[
    {
        "title": "Neil deGrasse Tyson, or how to fight the flat-Earth lunacy by spreading historical myth (a.k.a Dark Agers knew s*it)",
        "author": "B_Rat",
        "url": "https://www.reddit.com/r/badhistory/comments/44rs9z/neil_degrasse_tyson_or_how_to_fight_the_flatearth/",
        "text": "I know that I'm late to the party, but I just had to share. Not long ago, batshit crazy rapper BoB (or maybe free publicity grabber, one hopes) [entered in a diss with Neil deGrasse Tyson](http://www.theguardian.com/music/2016/jan/26/flat-earth-rapper-bob-neil-degrasse-tyson-diss-track) \"arguing\" that the supposed sphericity of the Earth is in fact fabricated by a conspiracy to hide the truth (bonus points for quoting David Irvin just for kicks).\n\n&amp;nbsp;\n\nSo, as a part of the exchange, we have [Tyson's tweet](https://twitter.com/neiltyson/status/691655467978919936?ref_src=twsrc^tfw) dated 25 Jan 2016:\n\n&gt; @bobatl Duude — to be clear: Being five centuries regressed in your reasoning doesn’t mean we all can’t still like your music\n\nSerious burn here, right? Well, only if you don't find the *\"five centuries regressed\"* thing ***suspicious***. After all, we have little documentation about how our planet's shape was determined, one thing sure being that i.e. in Greece it became the \"standard model\" *some centuries before Christ*. About \"five centuries\" ago we have **Columbus's voyage**, who had to fight his way against Bob's followers according to the longstanding myth propelled by Washington Irving's biography (*what's up with the Irvings?!*). BTW, strictly speaking Columbus's betting against Death^1 **did not support Earth's sphericity**, given that he did not reach Asia, whose distance had severely underestimated (as he was repeatedly told so). \n\n^1: ^since ^he ^expected ^a ^shorter ^route ^to ^Asia, ^had ^America ^not ^existed ^he ^and ^his ^sailors ^would ^have ^died ^in ^the ^Ocean.\n\n&amp;nbsp;\n\nBut, come on, I though, maybe it was my dislike of fellow STEMlord Tyson speaking, he might have thrown a random period of time.\n\nNot a chance.\n\nOn Jan 28, Hero-We-Need Andy Teal [asked](https://twitter.com/loomborn/status/692939133698887682):\n\n&gt;@neiltyson @bobatl Five centuries? I believe the knowledge of Earth's shape goes back a bit farther than that...\n\nTo which Tyson [replied](https://twitter.com/neiltyson/status/692939759593865216) *3 minuted later*:\n\n&gt;@loomborn @bobatl Yes. Ancient Greece - inferred from Earth’s shadow during Lunar Eclipses. **But it was lost to the Dark Ages**\n\n[Boom, Science, bitch!](http://i.imgur.com/kBAIkO6.jpg)\n\nAlso, ***BADHISTORY***, since we know like half of a dozen of Flat Earthers in the first 1500 years of Christianity, a round Earth was common in royal regalia and *freaking Aquinas* used the giant basketball nature of the Earth as the example of a belief that nobody would have been able to challenge. \n\nWithin little more than 3 hours McLaren Stanley tried to set right what once went wrong, with tweets like [*\"@neiltyson @loomborn the idea that people thought the earth was flat in the dark ages is a falsehood made popular in the 19th century\"*](https://twitter.com/StanTwinB/status/692989487773831168) and more. To this day, Tyson did not answer.\n\nAbout the spreading of the myth, I suggest you to read the History Today's piece \"[Inventing the Flat Earth](http://www.historytoday.com/jeffrey-russel/inventing-flat-earth)\" by historian Jeffrey Burton Russell, who wrote a book by the same name.\n\n*Edit:* /u/TimONeill also [explains in detail in the comments](https://www.reddit.com/r/badhistory/comments/44rs9z/neil_degrasse_tyson_or_how_to_fight_the_flatearth/czssfdj) why historians think that the sphericity of Earth was known even by the uncultured masses.\n\n&amp;nbsp;\n\n## Conclusion\n\n*Fun fact*: A [comment of mine](https://np.reddit.com/r/OutOfTheLoop/comments/42xafw/whats_going_on_about_neil_degrasse_tyson_and_bob/cze4vv7) on the /r/OutOfTheLoop thread about the Bob-Tyson battle that cited /u/TimONeill 's take on the Dark Agers' Flat-Earth Myth got severely downvoted [-10].\n\n*Sad fact*: The controversy gemmed a [rap song](http://www.theguardian.com/music/2016/jan/27/bob-stephen-neil-degrasse-tyson-flat-to-fact-flatline-rap-beef) by Neil's nephew, with our favourite Tyson repeating the *\"five centuries regressed\"* [in the end](http://genius.com/Tyson-flat-to-fact-lyrics).\n\n***Sadder fact***: To my limited knowledge, in this instance *nobody roasted Tyson for spreading myths*.",
        "created_utc": 1454950476,
        "upvote_ratio": ""
    },
    {
        "title": "WARNING!! On this site a lot of people who want to find a sexy adventure",
        "author": "trxoaSQaB",
        "url": "https://www.reddit.com/r/badhistory/comments/44qvck/warning_on_this_site_a_lot_of_people_who_want_to/",
        "text": "[removed]",
        "created_utc": 1454937761,
        "upvote_ratio": ""
    },
    {
        "title": "Was told you might enjoy this nugget, cross-posted from /r/badreligion",
        "author": "IAmDoubleA",
        "url": "https://www.reddit.com/r/badhistory/comments/44qtgg/was_told_you_might_enjoy_this_nugget_crossposted/",
        "text": "[removed]",
        "created_utc": 1454936796,
        "upvote_ratio": ""
    },
    {
        "title": "Mindless Monday, 08 February 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/44qmty/mindless_monday_08_february_2016/",
        "text": "Happy (or sad) Monday guys!\n\nMindless Monday is generally for those instances of bad history that do not deserve their own post, and posting them here does not require an explanation for the bad history.  That being said, this thread is free-for-all, and you can discuss politics, your life events, whatever here. Just remember to np link all links to Reddit and don't violate R4, or we human mods will feed you to the AutoModerator.\n\nSo, with that said, how was your weekend, everyone?\n",
        "created_utc": 1454933290,
        "upvote_ratio": ""
    },
    {
        "title": "What civ game should I get? IV, V, Beyond Earth?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/44p7b5/what_civ_game_should_i_get_iv_v_beyond_earth/",
        "text": "[removed]",
        "created_utc": 1454903737,
        "upvote_ratio": ""
    },
    {
        "title": "[Meta] What civ game should I get?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/44p4m1/meta_what_civ_game_should_i_get/",
        "text": "[removed]",
        "created_utc": 1454902508,
        "upvote_ratio": ""
    },
    {
        "title": "\"BodyCon\" in the Belle Epoque",
        "author": "chocolatepot",
        "url": "https://www.reddit.com/r/badhistory/comments/44ozma/bodycon_in_the_belle_epoque/",
        "text": "Warning: pedantry.\n\nThis article floated up on my Facebook feed yesterday:\n\n[The Belle Epoque Body-con Dress that was too Sexy for Paris](http://www.messynessychic.com/2016/02/02/the-belle-epoque-body-con-dress-that-was-too-sexy-for-paris/)\n\nI commented on it on FB briefly at the time, but it's a great candidate for a post here because it has some issues.\n\n&gt;In the Spring of 1908, three women walked onto the Longchamp racecourse in Paris and jaws dropped. The elite society event was known for debuting the latest couture creations to the public, but no one had seen fashion quite like this before. Dressed in blue, white and havane brown creations, according to newspapers, spectators called the three women a “monstrosity”, accused them of being semi-naked and showing revolting décolletage. It was these three dresses however, which would forever change fashion that day and launch the twentieth century silhouette. As for the designer? Well, no one really bothered to remember her name…\n\nOne of the troubles with primary sources in this area is that there's never a lot of attention paid to being factual. Fashion is business, and publicity is publicity. [Here's](http://gallica.bnf.fr/ark:/12148/bpt6k7525613d/f1.item.r=margaine%20lacroix%201908%20longchamp.zoom) an account from the French paper *Gil Blas* on May 16, 1908 (my translation):\n\n&gt;There was a scandal at Longchamp, last Sunday. [...] Four superb young ladies walked Sunday at Longchamp. The air was tepid, the season pretty, the décor ravishing. [...] So, four superb young women were walking. They provoked the sharpest stir. They passed, a little haughty, laughing, proud of their success. And they had charming little pouts of contempt at the ends of their pink-painted lips for the persons of their sex they met.\n\n&gt;They were followed with curiosity. The men were admiring, the women stupefied and sometime indignant. Some ladies cried: \"it's a scandal!\" And they roused other women who almost caused a riot.\n\n&gt; These sensational girls spread under the Sunday sun gowns of the latest model that Mme Margaine-Lacroix, a dressmaker very in vogue, it seems, wants to offer to us. Empire or Directoire gowns, say some; greek robes, say others. They aren't fixed. Pagan gowns, in any case, I think ... And this original quartet went with tranquility among the masculine homage and feminine denigration. The thin and silky fabrics, uncovering the neck and allowing their admirable shoulders to be admired, wound from the chest to the ankle in a harmonious mixture which was designed to delight their contours, arched the waist, descended in delicate spirals and let one guess at the gracious movement of a fine leg on the open side.\n\n[Here's](https://books.google.com/books?id=3XwxAQAAMAAJ&amp;dq=longchamp%20margaine-lacroix&amp;pg=PA1340) an English account from The Truth, May 27. Just between the two of these, there are discrepancies. For one thing, the naked backs and chests in The Truth don't show up in the photographs of the event. It's understandable that the writer went with the English one - it's a lot more accessible - but it's very sensationalist and plays on the \"dangerously sexy Parisian women\" stereotype. And the images from the MessyNessyChic article are dated on Gallica to May 10, so the Sunday that Gil Blas refers to as the day of the riot - but they all have sheer or white insets in their gowns that cover their chests - no décolletage, no naked skin. (Although [from the photos](http://gallica.bnf.fr/ark:/12148/btv1b69102581/f1.item.r=Hippodrome%20de%20Longchamp%201908.zoom), one woman did manage to show cleavage through her dress.) The English source is also fairly clear that it was the bright, attention-getting colors and the fact that these were dresses suited for fancier, indoor events that caused part of the stir, rather than just shock at how tight and revealing they were on an absolute scale. Lastly for that first paragraph, everyone remembered the designer's name - both of my primary sources name Margaine-Lacroix. It was a successful stunt.\n\n&gt;Long before Lycra or Spanx came along, she soon began making dresses made from stretchy elastic silk jersey, outlining the hips and thighs and slimming the figure.\n\nSilk jersey is nothing like Spanx - a jersey dress does not slim your figure. To the contrary, it's horribly unforgiving.\n\n&gt;The gawking crowd at Longchamp could see that the women were not wearing what they considered to be underwear, which in those days of course consisted of bulky under-garments including a full corset, petticoat and chemise.\n\nThe thing is, they probably were. By this point, it was A Thing to proclaim, as in The Truth, that a fashion required no corsets or that you never wore one ... but the women in the pictures have figures that are impossible without corsetry. They are wearing underwear. (Corsets of this period were usually made of a single layer of coutil, and petticoats and chemises were very light muslin. Not bulky.)\n\n&gt;You could now see their real, natural, soft bodies, rather than stiffly corseted, heavy-bosomed artificial silhouettes.\n\nEr ... those are some pretty heavy bosoms in the photographs.\n\n&gt;Their skirts were also oh-so-shockingly split to the knee\n\nYes, *but*. The Truth explains how the outfit is actually two parts, a pleated *dessous* or underdress and a overgown with a slit up the side. The spectators at Longchamps weren't seeing legs, they were seeing underskirts (that clung to the leg).\n\n&gt;These “marvellous women” or “fabulous divas” scandalised [Revolutionary] Paris with revealing dresses and tunics modelled after the ancient Greeks and Romans, cut of light or transparent linen and gauze, often too tight to even allow pockets.\n\nAt that time, pockets were large, deep bags (essentially) that were tied to the waist under a gown and accessed through slits in the skirt. They could be very bulky, since they filled the function of a handbag - it wasn't that any woman's clothes ca. 1800 were too tight to allow anything underneath, it was just that the slimmer line and sheerer fabrics made wearing pockets under the gown impractical.\n\n&gt;And it was Margaine-Lacroix’s dresses that floated across those Lonchamps racetracks in 1908 which sparked the desire for change.\n\nFashion is always changing - at the end of the 19th century, the vast majority of bodices were made very fitted to the shape. Then around 1900 a looser fit began to predominate, sometimes over a fitted lining and sometimes not. It was natural for the characteristic Edwardian blousy bodice to fall out of favor without any spark. By about 1906, it had become desirable for tailored suits to be smooth down the front rather than showing an echo of the gathered bodice in front; by 1907 there were advertisements for ordinary dresses that were fitted instead of fluffy. [This fashion illustration](http://digitalcollections.nypl.org/items/510d47e0-ed5d-a3d9-e040-e00a18064a99) dates to March 1908, a month before the Longchamps event, but the dress it shows looks an awful lot like Margaine-Lacroix's. It's almost never true (I say \"almost never\" because you're not supposed to say \"never\", but it's not like I can think of any exceptions) that widespread fashion changes occur because of a single designer's brainchild.\n\n&gt;Almost overnight, every impressionable young lady longing for a change from the rigid Victorian dress wanted to be those three women in the sassy slimline dresses.\n\nArgh, not Victorian! Victoria was queen until her death in 1901; her son Edward became king in that year. It's sadly common to erase his reign in pop fashion history because \"Victorian\" has instant name recognition as a synonym for \"uncomfortable and dowdy\". Victorian fashion was hardly rigid, but I'm struggling to think of how this [stereotypical Edwardian dress](http://fashionmuseum.fitnyc.edu/view/objects/asitem/760/45/dynasty-desc?t:state:flow=f53ac0b4-1ebb-4dc5-9149-6883df1cbc8f) could be considered \"rigid\".\n\n&gt;But throughout all the sensation and the press reports, Margaine-Lacroix’s name was left out of the headlines; not even given a footnote, and she was subsequently written out of fashion history.\n\nMargaine-Lacroix did get the publicity for her dresses, as linked above, but I will allow that she's been written out of fashion history. The thing is, though, pretty much *everyone* was written out of fashion history. You would think that Rose Bertin (Marie Antoinette's *marchande des modes*) was the first designer, and then there were shabby and unmemorable seamstresses for decades until Charles Frederick Worth invented the fashion industry, followed by Chanel inventing modern clothes in 1920. There are SO MANY dressmakers and couturiers who deserve to be remembered and none of them are. It really sucks. Even among people who are more interested in fashion history, only a few more names are added to the list. \n\n&gt;“Margaine-Lacroix has been forgotten, cast into shadow by the splendours of the Russian Ballet, and the exquisite illustrations of Poiret’s gowns. But influential as these were, it was Jeanne Margaine-Lacroix who brought about the general adoption of the lean, modern look. She deserves to be recognised as one of the most influential designers of the late Belle Époque.”\n\nPromoting Margaine-Lacroix as The One Who Did It is just as much of a mistake as leaving her out, see above.\n\nAt least one of my former classmates is fighting the good fight in the comments.",
        "created_utc": 1454900176,
        "upvote_ratio": ""
    },
    {
        "title": "Local museum had this gem: \"1000 BC: King David and First Wheels in Central Europe\"",
        "author": "Atanar",
        "url": "https://www.reddit.com/r/badhistory/comments/44mjro/local_museum_had_this_gem_1000_bc_king_david_and/",
        "text": "In an old-fashioned attempt at showing how advanced the ancient near east was, they had a row of hanging posters with a date and two historic events, one in the near east and one from europe.\n\nNow I won't comment much on the King David part, as it is highly controversial if he even existed at all, or was a rich and important king in the combined kingdom of both Juda and Israel, or something in between, and the cited evidence is often as good as of Merovech.  \n\nWhat really hit me was the ignorance on the wealth of evidence of wheels in Europe, starting at the depictions of the [Bronocice pot](https://en.wikipedia.org/wiki/Bronocice_pot)(14C: 3635–3370 BC) and megalithic Sites such as [Züschen](https://commons.wikimedia.org/wiki/File:Galeriegrab_Z%C3%BCschen_05.JPG) over the actual end-neolithic wheels in [Bad Schussenried](http://www.archaeologie-online.de/magazin/nachrichten/steinzeit-raeder-im-bad-schussenrieder-moor-entdeckt-7844/) and [Siedlung Stockwiesen/Federsee](https://de.wikipedia.org/wiki/Arch%C3%A4ologie_des_Federseebeckens#/media/File:Alte_Wagenraeder.jpg) to spoked wheels like the bronze age [Trundholm sun chariot](https://en.wikipedia.org/wiki/Trundholm_sun_chariot) (of which they actuallly had a replica!).\n\nIt's not a museum in a big city, but the exhibition on cultural history isn't very old (12 years) and the attempt to show how backwards Europe was is annoying all by itself, but they should have known better.\n\nEdit: Fixed a sentence",
        "created_utc": 1454866313,
        "upvote_ratio": ""
    },
    {
        "title": "Bad space history in fiction",
        "author": "TheFeanorianKing",
        "url": "https://www.reddit.com/r/badhistory/comments/44mheg/bad_space_history_in_fiction/",
        "text": "[removed]",
        "created_utc": 1454865490,
        "upvote_ratio": ""
    },
    {
        "title": "Saturday Studies, 7th of February 2016",
        "author": "Dirish",
        "url": "https://www.reddit.com/r/badhistory/comments/44lt22/saturday_studies_7th_of_february_2016/",
        "text": "Find a book you like? Read an intriguing article from JSTOR last week? Want to discuss and get recommendations for new books? This is the thread for it! Come one, come all, please let us know what you've been reading this week!\nNote: unlike the other two megathreads, this thread is not free-for-all. You are free to discuss books that you've read, articles you liked, and similar. But please save the personal updates for Mindless Monday!\n\n(manual post this week because the automoderator doesn't want to talk to me any more while I was trying to figure out why it wasn't posting. Also pretend it says Sunday... dum dee dum)",
        "created_utc": 1454855808,
        "upvote_ratio": ""
    },
    {
        "title": "WARNING!! On this site a lot of people who want to find a sexy adventure",
        "author": "DRqTGg07xq",
        "url": "https://www.reddit.com/r/badhistory/comments/44jato/warning_on_this_site_a_lot_of_people_who_want_to/",
        "text": "[removed]",
        "created_utc": 1454808876,
        "upvote_ratio": ""
    },
    {
        "title": "Grey Germs and Generalization",
        "author": "whatismoo",
        "url": "https://www.reddit.com/r/badhistory/comments/44gk0i/grey_germs_and_generalization/",
        "text": "\nEDIT: I've just found out that Mr Gray doesn't believe in free will. I think that this might be an indicator of an underlying disagreement about basic facts concerning human behavior which makes much of any argument against Guns Germs and Steel futile. My point about the intellectual dishonesty still stands.\n\n\nI'm a little late to the party, but here's my post on Mr Gray's podcast. This was originally typed on mobile, though since edited on a desktop, and Myers rum (it's kosher!) was involved, so pardon any issues. Also part of this might shift from 3rd to second person about grey. Sorry\n\n\nCGP grey guns germs and steel (GGS) podcast notes\n\nGGS discussion starts at 14:51 and ends around 70:00 [podcast link](http://www.hellointernet.fm/podcast/56)\n\n\nDear reader, be aware that I tend to get somewhat passioned, am writing on my phone from 10 hand written pages of notes taken listening to CGPGrey segment on guns germs and steel and I'd hope you can look past the snark, and if you'd like, have a cordial discussion about the topic. THAT MEANS FOLLOW RULE FOUR MOTHERFUCKERS! Also I'd recommend taking the time to read the Wednesday thread on historiography as well. It is very enlightening to those who have not had any background in historiography, which is a vital and necessary part of history.\n\n\nLet's jump right in. Be advised I'm not so sure of the timestamps because the playback on my phone was weird, but they should be roughly correct. Barring that, they *are* in chronological order from start to finish.\n\n\n15:22 I am somewhat confused by Mr Grey’s presentation of this this as a debate between equally valid sides. One side consists of the overwhelming majority of experts in a field, while the other is mainly laymen. And yet he question the validity of the experts’ criticism. The only comparison which comes to mind would be climate change denial.\n\n\n16:27 Calling GGS overly detailed? I'd like to think Grey understands that any thesis or hypothesis must be backed up by *facts*. Detail is good, it makes, or in diamonds case, breaks an argument. Though I would agree that GGS is poorly written in places.\n\n\n19:15 Mr Haran seems to have a more skeptical view of the book, he does bring up that GGS is popular history, (also called pop-history). It was not held to the same scrutiny as a peer reviewed paper submitted to a journal. Diamond isn't even a trained historian. His doctorate is in physiology and biophysics, yet Grey accepts his work as equal to those trained in the craft. I wouldn't ask a landscape architect about fixing my car, so why is it OK to ask a biophysicist about history and anthropology?^1 What you get in any case is sweeping generalizations which may seem basically correct, but are so vague or self fulfilling as to be meaningless or unprovable.\n\n\n22:15 Could it be that diamond is using a glorified gish gallop? He’s beating the reader over the head with a seeming preponderance of evidence supporting his case so you'll accept it rather than take the time to refute it all. Unfortunately historians have lots of free time collectively. Or are at least paid to write papers.\n\n\n22:30-44 it's pronounced queue-ni-form\n\n\n23:43 it's not just randos on the internet who debunk GGS, there are academic articles criticizing it.\n\n\n[James M. Blaut, professor of anthropology and geography at U Ill. Chicago](http://www.jstor.org/stable/216157)\n\n\n[Brian Ferguson, Professor of Anthropology at Rutgers](http://www.jstor.org/stable/684113)\n\n\n[Michael Barratt Brown, Economist and Historian](http://www.jstor.org/stable/4006551)\n\n\nAlso what's Grey’s obsession with the phrase “meta-argument”, [pertinent clip](https://youtu.be/G2y8Sx4B2Sk) I'm assuming he means the argument over the validity of GGS, which isn't the meta argument, which would be the argument over the argument over GGS, which is silly. Unless he’s calling into question the validity of rebutting Mr. Diamond's thesis there is no meta argument, just an argument.\n\n\n24:00 there is nothing arguable, greychik, GGS does vastly oversimplify human history into a deterministic paradigm with no regard for human agency or politics\n\n\n24:30 see the many linked wonderful deconstructions of GGS below\n\n\n26:00 BCE my friend. BCE means the same as BC, but isn't and is the preferred dating method.\n\n\n26:52 Look, don't want to harp, but those high school classes clearly didn't teach Grey the basics of academic historical study, that being historiography and the historical method. [a textbook on the matter](http://www.amazon.com/The-Houses-History-Critical-Twentieth-Century/dp/0814731279) the issue is that historiography is very complicated and background heavy. Writing essays and citations and sources and stuff is comparatively easy. There was a very good thread on this on Wednesday February 3rd which everybody should read because historiography is really important. But so is the next point\n\n\n27:00 THERE. IS. NO. OVERARCHING. NARRATIVE. TO. HISTORY. END OF DISCUSSION. NO UNIFIED THEORY OF HISTORY.\n\n\n27:15 “the UK is just dominating in this history game” there is so much wrong with this statement on a fundamental level.\n\n\nThe UK wasn't inevitably going to be the dominant world power. No previous composite government with a central bank had been able to succeed, rather collapsing after debt crises. At the beginning of the 18th century mentioned a good deal of continental observers thought that it would be the century of a resurgent France, not UK.\n\n\nHistory isn't a race. The UK isn't ‘better’ than Maori polities, or the Iroquois confederacy. European history isn't more valid than anybody else's, and the history of the rest of the world is more than “mud huts until slaughtered by mighty whitey and the communicable diseases”(insert band name joke here). There's no goal or end. There's no beginning either, save the extent of our records. History isn't a progression from the barbaric past to an enlightened future. That's very deterministic, which is bad and known as whig history. Marx was also very deterministic in his historiography. History the discipline simply attempts to record and understand the past (history the concept) to the best of our abilities. We do not, by and large, make judgments or deal in absolutes. History (both the discipline and concept) is not a ‘game’. Nobody wins. Nobody loses. Everybody dies.\n\n\n28:10 the Columbian exchange brought new diseases to Europe. Off the top of my head, a new more lethal syphilis though it's still debated whether it was a more virulent firm or if something akin to syphilis was extant in Europe pre Columbus.\n\n\n29:30 “two centuries of technological progress” I'm just curious how this is measured? Last I checked there wasn't an SI unit for technological progress, and technological development is very dependent on outside factors like utility. For example the wheel wasn't used much by the Inca outside of children's toys because it's not useful in their terrain. I recommend the SidMeyer for a unit of technological progress by the way\n\n\n30:00 these analogies aren't great and are pretty reductive, which complicates things unnecessarily. I know you'd really like a neat and easy way to explain the last 12,000 years of human history. So would I, but there isn't one. History is one of those fields where there's no easy way about it. It's a real pain in the arse, but it's the truth. People are amazing complex creatures and we make a muddle of things all the time.\n\n\n30:07 personally I'd say the Atacama Desert would be worse to start in, but that's not really how it works. I'd also like to question why European style culture is better than say, the myriad Australian Aboriginal cultures. There's a good number of statements of cultures being better or otherwise more valuable/valid which I don't appreciate.\n\n\n32:00-32:30 seriously? The modern Cow was bred from 6 foot at the shoulder violent bovines called Aurochs which ate Beech trees. https://en.m.wikipedia.org/wiki/Aurochs the reason cows etc are so chill is because we've been domesticating them for 8-10k years.\n\n\n33:10 see aurochs comment. Wild animals are unpredictable and violent. Domesticated animals are sheep. Literally. It was one of the first domesticated animals.\n\n\n33:33 horses have been domesticated for at least 5000 years. Of course they're going to be tame. That said feral horses are nasty shits.\n\n\n35:37 yes we historians like to argue the details. You refute a hypothesis in part by proving that the evidence supporting it is faulty.\n\n\n36:29 “how could it be otherwise if you have a semi random distribution of useful animals across the world” I don't think it's correct to call the evolution of certain species random, or even semi random. They evolved as a result of evolutionary processes which I will defer to an expert for the explanation of.\n\n\n37:00 good point Anglo-aussie man! Diamond is going about his thesis ass backwards!\n\n\n38:12 another good point anglosphere man\n\n\n39:22 again, syphilis. Which came either in whole or part from the Americas.\n\n\n40:53 why don't I have a hard on for GGS? because it is deterministic, simplistic, both vague and overcomplicated, removes human agency, and is so off base its not even wrong.\n\n\n41:00 there is no unified narrative of history. We humans, we like to put things into patterns to understand them. It's called apophenia. We want to find an explanation for why things happen the way they do. But there isn't an easy cut and dry answer like diamond posits. There is no one consise explanation for why things are the way they are.\n\n\n41:10 like the ‘theory’ of creationism, diamonds theory of geographic determinism is crap! Plus it's worked back from the present presupposing that the events that happened are the most likely (which we can't know), so it's a self fulfilling prophecy, because it's already been fulfilled.\n\n\n41:20 counterfactuals, or “what-ifs”, are unprovable guesses and not really helpful. It's why however well researched and meticulously written alt history is always fiction, and you can't cite it in an academic work.\n\n\n41:40 what is colonial technology? The modern European period of colonization goes from the 15th to 20th centuries. I know I am harping for being vague, but being specific helps to understand what point you're trying to make.\n\n43:30 I consider myself a historian. I'm working on an M. Litt in modern history at St Andrews. I can tell you, and I'm sure my esteemed comrades on this subreddit could also, that historians DO NOT work with destiny. That isn't my discipline. You want destiny, try philosophy or divinity. But to imply that anything in history *had* to happen a certain way, is not in line with any kind of contemporary accepted historiography I know of. When you say that geography implies destiny you're removing all agency from the actual people who lived and loved and died. Among other issues brought up by those with a more thorough understanding than I.\n\n\n44:55 Goodness gracious, Mr Gray! I've would think that it would be understood that history is not like physics and there isn't a unified theory of history. In fact I'd like to posit that a unified theory of history is impossible without drastically over simplifying a great deal.\n\n45:01 that is so very vague though? It doesn't provide any useful new interpretational paradigm to view history though, instead taking the people who made history and relegating their lives and actions to inevitable results of invisible forces beyond their control, and shifting the blame for colonialism to geography rather than asking deeper questions about European society at the time.\n\n\n46:10 Let me reference Marc Bloch. Just him in general. Pick up a copy of his book the historian's craft. He's one of the central figures of modern historiography. Also a french Jew who was killed by the Nazis for working with the Maquis\n\n\n47:33 the effects of the black death in Europe are really interesting. I would recommend looking on JSTOR.\n\n\n49:29 Hindsight is always an issue. We call it presentism. (https://www.historians.org/publications-and-directories/perspectives-on-history/may-2002/against-presentism)\n\n\n50:01 the term \"orientals\" is no longer socially acceptable. I would suggest saying Asians.\n\n\n51:07 http://www.jstor.org/stable/3790464 here. Read this.\n\n\n51:25 race is a social construct. I presume you mean ethnicity?\n\n\n51:45 you want an alternate theory? Here's mine. I'm no fancy Physiologist like Dr Diamond, but: Human history is so complex that to reduce it to one unified theory would be nigh impossible, and even if possible would not be useful in understanding the past, and would oversimplify and remove agency by imposing narratives on the past rather than letting it speak for itself. Also thanks for implying I'm racist for disagreeing with GGS.\n\n\n52:42 you're going to be left wanting, Mr Grey. As I've said multiple times, there is no narrative to history but what is imposed on it. There is no unified theory of history, and to my understanding of current historiography such a concept would be antithetical to history as it is understood today. Unless you want to say “god did it” or otherwise remove agency from people though vague and reductive postulates, it is my understanding that you ask the impossible. Thousands of years and billions of people cannot be boiled down into a “theory of history”. Life is too complex. There are too many variables. It would be awfully convenient if it could be done, but it can't. I'm sorry Mr Gray, there is no theory of history.\n\n\n“Let's not get down in the weeds… Argue about the details” Mr Grey, those weeds, those details, that is what history is made of. Not grand sweeping claims about inevitable laws, but the lives of everyday people. People like you and me. But also people other than white men. Marc Bloch talks a great deal about creating lines of connection with the past to further understanding. The history of people, not just big institutions. Oh and yes, historians are going to try and disprove the evidence behind theories. That is how you disprove a theory.\n\n53:52 more counterfactuals\n\n\n54:07 yes, history is what happened\n\n\n54:30 look if you want relatively simple answers why things happen talk to a Rebbe or a pastor or a philosopher. This is history. History is messy. It's complicated. Very little is cut and dry. About the only things I can think of are Nazis=bad and CSA=slaveholding dicks. A great deal of history is nuance and pedantry. A really good first step is to stop trying to assign big narratives.\n\n\n55:16 you might have been moving the goalposts here, just a little. Going from a nice big theory to wrap everything up in a bow to now only covering certain things.\n\n\n55:26 “as soon as civilizations interact” because that never happened before 1492?\n\n\n55:46 this question cannot be answered\n\n\n56:25 like geocentric models of the solar system its a dead end that seems promising at the start. The sun rises and sets right? So clearly is orbiting around us.\n\n\n57:35 just to question, how did the aborigines get to Australia without boats then? Did they fucking swim? How can you invent boats 200 years early when you needed boats to get to where you're living?\n\n\n58:40 look up peshawar lancers. Right in that vein\n\n\n59:55 humans have been living in Australia for at a minimum 40,000 years. There was an indigenous group living where Adelaide is, the Kaurna for quite a while before the Europeans showed up.\n\n\n60:35 it'd really make my life easier if I could just plug information into a theory and spit out history, instead of all the research and sourcing I do now.\n\n\n60:43 this discussion about the use of history… just go read the Marc Bloch book.\n\n\n61:00 please, do I really have to defend the validity of my discipline? Engineers don't have to put up with this shit. Grumble grumble.\n\n\n61:30 GGS is based on shoddy evidence. The thesis rests on a foundation of shit. [Here](Guns, Germs, and Steel - Chapter 11: Lethal Gift of Livestock) [are](https://www.reddit.com/r/badhistory/comments/1zarno/twerk4hitler_thinks_that_the_european_conquest_of/?ref=search_posts) [some](https://www.reddit.com/r/badhistory/comments/1u8u7c/i_think_white_people_are_better_cmv_answered_by/) posts explaining why it's bad. Also see the Wednesday thread and previously linked JSTOR articles.\n\n62:42 you keep defending this theory. The thesis, however valid, is based on crap methodology, shit evidence, and inconsistent writing. GGS doesn't support its thesis very well. Therefore, based on the available evidence one must conclude it is invalid until such a time as better evidence comes along.\n\n62:56 so this was all a gotcha to piss me off? WELL YOU DID YOU BERK! I'M WELL AND PISSED OFF.\n\n\n63:34-64:00 so for the sake of a giggle you were intellectually dishonest to over a million people? What's your next video gonna be? The holocaust based on David Irving? The story of the ~~Sherman tank~~ DAMNABLE YANKEE RONSON DEATH TRAP by Y. Belton Cooper? Your joy from trolling a few people compromised the unwritten compact between you, purveyor of seemingly factual information, and the viewer. Research even a modicum. Ask an expert. There's no shame in not knowing. I'm sure you're aware of that, and you say you did your homework in GGS. You said you knew of the issues with the book yet you “jokingly” recommended it as the history book to end all history books. How many people do you think took you seriously? I'd wager several hundred thousand. Your viewers trusted you, many of them still do, and you lied to them. That's not integrity or honestly, that's no better than the Sun or the Daily Heil. You may not realize it but as an authority figure you must be honest and accountable. I think you're a good person inside. I know you have a busy schedule, but you could use this as an exercise in demonstrating that its OK to be wrong. Or something. But you cannot break the faith your audience had in you, their expectations of honesty, well researched, thorough and correct answers.\n\n\nThat's my two cents. Just thought I'd mention it. Please feel free to comment/PM with any problems, I haven’t caught.\n\n\nEDITS: removed 41 possible rule 4 violations. Don't write drunk kids.\n\n\nEDITS II: fixed things, made pretty, reposted\n\n 1. Landscape architect is like a gardener but fancy and a degree\n",
        "created_utc": 1454771538,
        "upvote_ratio": ""
    },
    {
        "title": "Updated Meta Thread Schedule",
        "author": "Dirish",
        "url": "https://www.reddit.com/r/badhistory/comments/44gicj/updated_meta_thread_schedule/",
        "text": "Hi all, as you've noticed we started a new meta thread for Wednesdays that covers general bad history related stuff you want to chat about, or topical discussions set for the week. \n\nIn order to accommodate the new weekly post, and to give it some time at the top as a sticky post, we've moved a few of the other weekly threads around. So the current schedule is:\n\n- **Sunday** - **Sunday Studies** - was Saturday Studies, so it was easy to find a new name for that one. No changes to the theme of the thread.\n- **Monday** - **Mindless Mondays** - No change, your usual free for all discussion\n- **Wednesday** - **Wondering Wednesdays** - The new thread for weekly themed discussions, history related questions, discussions, or anything that's bad history but you don't feel like writing a whole post about.\n- **Friday** - **Free For All Friday** - was \"Thoughts for Thursday\" and is still the same type of thread as before. We moved it to Friday to space the weekly threads a bit more evenly, and just gave it a new name.\n\nThe new schedule will start tomorrow, Sunday the 7th of February with a Sunday Studies (if you spotted the ghost of Saturday Studies past today, it was just a figment of your imagination. You should have that looked at, hallucinations are never a good sign).",
        "created_utc": 1454770829,
        "upvote_ratio": ""
    },
    {
        "title": "Badhistory Universalis [EUIV]; Trans-Andean Express. The session where Sweden hit a critical mass and became a black hole. [UTC 1900, around 6 hours and 30 minutes from this post]",
        "author": "PersianClay",
        "url": "https://www.reddit.com/r/badhistory/comments/44g01r/badhistory_universalis_euiv_transandean_express/",
        "text": "Yet another EUIV game!, together with /r/thechapel .\n\nThis session will most likely be a EUIV session, but if enough people wants it, it might be a CKII session because of conclave, but this won't happen without there being a big movment for that.\n\n&gt;The world:\n\n* [Players](http://i.chapelcomic.com/d/poople.png)\n* [Countries](http://i.imgur.com/OdvFmnn.png)\n* [Religion](http://i.imgur.com/EnSZ30A.png)\n* [Cultures](http://i.imgur.com/I5BS7C4.png)\n* [Governments](http://i.imgur.com/nbAAg02.png)\n* [Dynasties](http://i.imgur.com/enWYl6g.png)\n* [Technologies](http://i.imgur.com/cKqNs5h.png)\n* [Development](http://i.imgur.com/UrZlRtw.png)\n* [HRE](http://i.imgur.com/8EqHObv.png)\n\n&gt;Important Information:\n\n* You only need the base game, DLCs are shared by the host. (/u/PersianClay)\n* We usually play for 4 to 5 hours. (this can vary a lot)\n* The primary means of oral communication is once again Teamspeak as that part has worked great all around so far. Usually, server is ts.tuplay.se.\n* Please mention the country you're playing as in your nickname, i.e. \"notamacropus | Tunis\" or similar to make it easier for everyone.\n* Server will be Badhistory Universalis, password holyvolcano.\n* For the most current information and the \"join game\" option please join the chat room of the [bad history steam group](http://steamcommunity.com/groups/badhistory) before launch. This is the ONLY reliable way to join the game, so make sure you get in the group chat.\n \n* also if you are new, remember that we usually have a development limit, at around 400-500(uncertain for now, you will get to know when we start to pick our nations again!.\n\nAs the [Andean Highway 1](http://i.imgur.com/0hvsxly.png) finishes[\n(Not Pachinko Road btw as some japanese would say)](http://i.chapelcomic.com/d/patcinko.png),\n[Will it expand?](http://i.imgur.com/VmmpnGu.png)\n\nIs it finnaly Over for Sweden? Has they grown to far? Will they turn into a black hole and swallow all of earth in the process? who knows!",
        "created_utc": 1454761636,
        "upvote_ratio": ""
    },
    {
        "title": "Sunday Studies, 06 February 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/44fxvv/sunday_studies_06_february_2016/",
        "text": "[removed]",
        "created_utc": 1454760226,
        "upvote_ratio": ""
    },
    {
        "title": "Bad Crossbow Military History, or how ByzantineBasileus is currently hoping that he will end up educating hot, humanoid Extra-Terrestrial space-babes on the meaning of love.",
        "author": "ByzantineBasileus",
        "url": "https://www.reddit.com/r/badhistory/comments/44fee2/bad_crossbow_military_history_or_how/",
        "text": "Hello Badhistoriers! Now, I had absolutely no intention of doing another review so quickly, but I stumbled across a documentary called Conquest Episode 25: The Crossbow\n\nhttps://www.youtube.com/watch?v=xCescM9DQuo\n\nI found it so personally insulting that my brain tried to force its way out of my skull through my eye sockets just so it could punch the monitor itself. The crossbow has always been my favourite weapon, so to view this crime against all scholarly efforts wounded my soul in a way no lover ever could. My imaginary drink this time is a bottle of Chivas Regal, so let's get nocked!\n\n0.26: The dunderheaded host says ancient warriors dreamed of a long-range weapon that could pierce through a man and his armour. No, because they already had them. They were called *bows*. DRINK!\n\n0.43: The dunderheaded host calls the extras skilled in a variety of weapons. HAHAHAHAHAHAHAHAHAHAHAHA *inhale* HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA!\n\n0.46: The dunderheaded host says the extras only need to be skilled in having one eye and two fingers to use a crossbow. Possessing fingers and eyes is not skill. Also, a crossbow is best used with two eyes for the purposes of depth perception, and requires both hands and arms to load and aim. DRINK!\n\n0.52-1.02: The dunderheaded host says the Chinese had the crossbow by the 6th century BC. The picture of a Chinese person they choose to show is this one:\n\nhttp://asia.isp.msu.edu/wbwoa/east_asia/china/history/images/mongol%20archer.gif\n\nThat is the image of Mongol rider from the 13th century onwards. Also, the image they choose to use of an ancient Greek crossbow is a Greek person with a BOW. Last of all, he uses footage of a guy being shot from a giant circus crossbow to represent the Roman ballista. Four drinks. Three for the inaccuracies, one because the host is a tool. DRINK! DRINK! DRINK! DRINK!\n\n1.06: The fluff-brained host says there is no firm evidence of the crossbow being used until the 10th century. You know, except for the Picts:\n\nhttp://www.pictishstones.org.uk/drosten-stone-zoom.jpg\n\nDRINK!\n\n1.15: The one eye, two finger reference again. DRINK!\n\n2.16: The fluff-brained hosts account of how the crossbow was probably invented is completely nonsensical, principally because it relies completely on guesses without examining any evidence. Perhaps it was developed as a way for people to use a weapon without requiring the training and upper body strength needed for a war-bow? Perhaps it was derived from a larger siege weapon? Do we have accounts of the larger siege versions coming before the hand-held version? Do we have primary accounts of the advantages of crossbows versus bows and using that as a basis for supposition? DRINK!\n\n2.24: The arbalest is actually a specific variation of a crossbow that uses a steel bow rather than a composite or wooden one. The term for crossbow was generally arcuballista, which is derived from Latin and was used by the historian who described the Siege of Senlis. So the host is using the wrong name for the wrong type of weapon. Two drinks, one for the error, and another because the host is a twat. DRINK! DRINK!\n\n2.49: The documentary states the crossbow strings were made from hair or thread. Thread is too generic a term, and many materials could be used. Flax or hemp was quite common. DRINK!\n\n3.50: Extremely poor test. In battle archers did not draw back until the target was in sight, so it is not judging each weapon fairly since the conditions of usage were different. Forcing an archer to stand there with the bow drawn back is idiocy. DRINK!\n\n4.40: Fluff-brained host calls it an arbalest again. DRINK!\n\n5.25: The exact usage of a bow varied based on its type. The composite bow was smaller than the bow used here, and could be used kneeling, especially when held at an angle, not vertical. DRINK!\n\n5.32: The mind-made-of-manure host says crossbowmen were equipped with a pavise. The equipment of crossbowmen varied across the centuries. The pavise was not wide-spread until the 15th century onwards. Prior to that crossbowmen did not use a large shield at all. DRINK!\n\n5.58: The mind-made-of-manure host calls it an arbalest again. DRINK!\n\n6.44: They shoot a crossbow against maille without padding. In the medieval period maille was almost always used with some kind of padded or quilted armour. This provided some cushioning and allowed the armour to press inwards against the point or edge of the weapon, making it harder to penetrate. This armour just lies against a solid mannequin, not a squishy human being, so of course the bolt with strike through it. DRINK!\n\n8.10: The empty-skulled host misses one variation of crossbow between the wood and steel types: the crossbow with composite arms. DRINK!\n\n10.28: The photo the empty-skulled host uses to display Richard I is completely anachronistic since it comes from the 18th century AD and has the king holding a halberd, a weapon not used in the 12th century AD. DID THEY NOT EVEN CARE? DID THEY NOT EVEN TRY? DRINK!\n\n10.44: Do extras get hazard pay?\n\n11.18: More armour with no padding against a solid mannequin. DRINK!\n\n14.12 Yet more armour with no padding against a solid mannequin. Also, they are using plate when, even in the 15th century, a crossbowmen could encounter a variety of armour, including maille. These testing conditions are not really plausible. DRINK!\n\n15.57: Another issue I have with these tests is that they don't tell use the poundage of the bows and crossbows, especially that of the longbow, and how close such poundage is to the medieval weapons they represent. I also doubt the empty-skulled host is skilled enough to represent a proper longbowman from the 14th century. All these automatically invalidate the test results. DRINK!\n\n16.31: Modern crossbow shooting: don't need to watch this.\n\nWell, that was indescribably wrath-inducing. This is going to be my last review for a while. I've had quite a creative spurt but I think my brain and my sanity level needs a week or two to rest and recharge. So after that time I will finish the Chinese history documentary.\n\nSources\n\nThe Crossbow: Its Military and Sporting History, Construction and Use, by Ralph Payne-Gallwey\n\nThe Early Chinese Empires: Qin and Han, by Mark Edward Lewis\n\nMedieval Chinese Warfare 300-900, by David Graff\n\nWarfare and Society in the Barbarian West 450-900, by Guy Halsall\n",
        "created_utc": 1454746921,
        "upvote_ratio": ""
    },
    {
        "title": "Bad Egyptian history, why would a pharoh have sex with a priestess.",
        "author": "recovering_spaz",
        "url": "https://www.reddit.com/r/badhistory/comments/44f0br/bad_egyptian_history_why_would_a_pharoh_have_sex/",
        "text": "[removed]",
        "created_utc": 1454738521,
        "upvote_ratio": ""
    },
    {
        "title": "Summarizing \"America Unearthed\"",
        "author": "AndyDiplodocus",
        "url": "https://www.reddit.com/r/badhistory/comments/44ec79/summarizing_america_unearthed/",
        "text": "[removed]",
        "created_utc": 1454727242,
        "upvote_ratio": ""
    },
    {
        "title": "Battle of Megiddo part 1: Arabs and Ponies",
        "author": "dontfearme22",
        "url": "https://www.reddit.com/r/badhistory/comments/44c7kx/battle_of_megiddo_part_1_arabs_and_ponies/",
        "text": "I am going to review some more Bronze Age badhistory; starting with something a lot more nuanced than the afrocentrism that was the last video I reviewed,\n\nhttps://www.youtube.com/watch?v=TqycKW-OBK0\n\nI need to preface this by saying, I love this documentary. It really tries to show the timeperiod with a sense of grandeur that I think a lot of other shows miss on, and it really does a admirable job.....but i'm gonna nitpick anyways, its just the way things go:\n\n00:07 This appears like a crack at some of the helmets from the [Thutmoses chariot](http://www.worldhistory.biz/uploads/posts/2015-09/314w-75.jpg), pretty close design so Ill let it pass\n\n00:25 ooh I've heard *that* scabbard sound before\n\n00:15 These shields seem curved, which is not evident in any ancient Egyptian artworks.\n\n The actual dimensions and shape of Egyptian shields flucuated a lot, from huge pointed shields like [this](http://l7.alamy.com/zooms/dda6e0fff1d34ef9ac25d8754af73e16/this-relief-shows-ancient-egyptian-soldiers-with-shields-at-siut-which-d1hap0.jpg)\nto small rounded shields with [bosses](https://upload.wikimedia.org/wikipedia/commons/7/7f/Illustrerad_Verldshistoria_band_I_Ill_015.jpg) or [stitching](https://s-media-cache-ak0.pinimg.com/236x/a0/da/ce/a0dace7ded6b6763366680173a86de36.jpg), as was more common towards the later New Kingdom, while the general trend seemed to be pointed to rounded, I can also forgive fluctuation of sizes in this documentary, since real shields were all over the place\n\n00:31 The prince is riding a horse. This did not happen, but not because people didnt ride horses in the Bronze Age. This is actually, relatively plausible for the time and region. While any full fledged cavalry is a big plate of no no's, there are records that mention horse-riding from the period, and before in Syria. One letter from Mari from Zimri-Lim to Bahdi-Lim actually advises a king *not* to ride a horse to preserve his dignity, and reliefs from Qadesh also show mounted [scouts](http://www.nilemuse.com/muse/pic/Luxor2185L.jpg) on horseback...buuuuut I still find it doubtful that a Canaanite prince would ride a horse over a chariot, due to the prestige loss alone. \nThe real kicker is that the actual account of the battle mentions the **lost chariots**, not sparkles the rainbow pony, of the Canaanite princes so *ding* the first real big inaccuracy. \n\n00:39 the actual account of the battle doesnt even mention a assault, only that *\"his majesty prevailed against them at the head of his army, and when they saw his majesty prevailing against them they fled headlong to Megiddo in fear, abandoning their horses and their chariots of gold and silver. \"* \n\n01:04 dafuq what is that? Some sort of balcony? Maybe he could walk the plank off it.\n\n01:05 Low budget jewelry\n\n01:45 *People wailing for dramatic effect* Otherwise, this little vignette is one I really like. Even for any errors it has it does strive to seem immersive and I give them credit\n\n01:54 Ethnically they seem pretty decent, a nice middle ground between [Och Aye Rameshess](http://i.dailymail.co.uk/i/pix/2015/11/27/22/2EDCF1E700000578-3336938-_We_re_sorry_The_studio_and_director_behind_the_Gerard_Butler_mo-a-5_1448662441909.jpg) and [black here, black there black everywhere!!!](https://pbs.twimg.com/profile_images/416568694979194880/65H0V5d9.jpeg)\n\n02:04 They are speaking Arabic, yeah sure maybe because teaching a few hundred extras a dead language is hard, but at least they kept it in the same language family. Still rustles my khopesh though.\n\n03:41 If they used horses, this is what they would have been used for. As messengers and scouts, but I still think it is 95% likely that the prince himself would be rocking a chariot, if he went personally at all.\n\n03:59 They weren't tribes unless they were Habiru/Shasu etc, these were city-states. In other news, the great tribal chieftain Pericles united the warring clans of Greece against the Persians\n\n04:15 Pretty complex harnesses, this is what a actual harness from the period looked [like] (http://cache4.asset-cache.net/gc/98952473-life-in-a-military-camp-horseman-galloping-gettyimages.jpg?v=1&amp;c=IWSAsset&amp;k=2&amp;d=GpNjP5rFhgl2c8btlvsP1xXwJ%2Fri0Jb54FC7mUtwbT5zcCeXz8nEwNr9%2FFjxXRSfjd8YK65TkKHmBPiouQliIA%3D%3D) \n\n07:32 Real New Kingdom forts were absolutely [huge](http://jeanclaudegolvin.com/wp-content/uploads/2015/03/egypte-bouhen-forteresse-bouhen.jpg), and often made out of stone over mud-brick\n\n07:41 That isn't Syria, neither today or back then. Canaan was called Canaan when referring to the Egyptian colony, and a smattering of other terms were used for various blobs of territory in and around it. The area labeled \"Syria\" on this papyrus-y map(because papyrus is kewl)would have been likely just called Shasu-land, where all those hairy nomads with axes n' beards came from. \n\n08:25 The armor is pretty plausible, but they would either have a neck-ring of scales or just have scales go upwards over the shoulders, not some sort of weird leather epaulets.\n\n09:30 That shield is a Persian shield, stupid Canaanites can't even [shield](http://c8.alamy.com/comp/DE48H5/a-scene-painted-on-the-side-of-a-casket-of-tutankhamun-depicting-a-DE48H5.jpg) right\n\n09:48 Beards are bearding appropriately bushy for the period, respect.\n\n09:52 I am 90% sure that is a falcata or a kopis, about as period accurate as a macquahuitl. \n\n10:35 Am I crazy or was that a monkey?\n\n13:35 The chariot is pretty close, but the holes on the sides are [tiny](http://www.ancient-origins.net/sites/default/files/field/image/Pharaoh-Tutankhamun-riding-a-chariot-.jpg)\n\n13:56 Big Words! Hyperbole! No Specifics! Booyah!\n\n14:48 They were great mercenaries, but not the be-all end-all of a entire Imperial army. \n\n18:02 Big claim, 0 back-up\n\nWeird wrestling scene...just trying to forget about it\n\n20:15 *generic arrow noise*\n\nThis post is really long already, get ready for the follow-up in....Ancient Egypt part 2: Qadeshic Boogaloo\n\nSome good follow-up sources on Ancient Egypt, and the time are:\n\n*New Kingdom Egypt* from Osprey; Mark Healy and Angus McBride. The Angus McBride Osprey books tend to have a high level of accuracy, plus they have absolutely incredible historically accurate artwork. Highly recommend at least flipping through them\n\n*War in Ancient Egypt: The New Kingdom* by Anthony J. Spalinger\n\n*The Rise and Fall of Ancient Egypt* by Toby Wilkinson. More of a pop-history, but very well written, and it gives the best shot at understanding the progression of 3000 years of history without being the size of a encyclopedia\n\n*Letters of the Great Kings of the Ancient Near East: The Royal Correspondence of the Late Bronze Age* by Trevor Bryce\n\n",
        "created_utc": 1454698011,
        "upvote_ratio": ""
    },
    {
        "title": "Ancient Egypt strikes back; Arabs at Megiddo",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/44c1gn/ancient_egypt_strikes_back_arabs_at_megiddo/",
        "text": "[removed]",
        "created_utc": 1454695971,
        "upvote_ratio": ""
    },
    {
        "title": "Bad Chinese Military History Part One, or how ByzantineBasileus is suddenly wondering why a trip to the rehab centre involves seeing the Earth from orbit.",
        "author": "ByzantineBasileus",
        "url": "https://www.reddit.com/r/badhistory/comments/44a9oc/bad_chinese_military_history_part_one_or_how/",
        "text": "I have always had a particular fondest for Chinese history. My favourite dynasty was the Song, followed by the Ming. As such, I am going to examine a documentary called Ancient Discoveries - Chinese Warfare:\n\nhttps://www.youtube.com/watch?v=1KGGSWvRGRE\n\n My imaginary drink of choice for this session is Baijiu. So let's get our *Han* on!\n\n0.51: The narrator says China is 5000 years old. This is not true. The earliest *supposed* Chinese culture is that of the Xia Dynasty, which reigned between 2000 to 1600 BC, but the actual existence of this civilization is much debated. It could have been a mythical originator culture, a collection of bronze-age states that had been reinterpreted by succeeding dynasties to be one centralized government, or it may have existed as traditional accounts say. The one early Chinese civilization we have concrete evidence for is the Shang, from 1600 BC to 1046 BC. As such, China can only be said to be around 3600 years old. DRINK!\n\n0.54: The narrator describes China as having the largest army in the world today. If we are speaking in terms of standing forces, that is correct. However, when one takes into account reserve and paramilitary forces, India, North and South Korea and Vietnam have much larger land forces. DRINK!\n\n0.57: The narrator states China has 60 centuries of military heritage. Considering Chinese civilization officially starts with the Shang, this is so wrong it collapses in on itself and creates a blackhole-like anomaly of factual errors. DRINK!\n\n1.11 - 1.34: Yeah, it's pretty much common knowledge that gunpowder came from China. No-one in the Western World thinks Europe invented it. And most scholars familiar with history also understand that the crossbow and cannon were introduced from China. Also, a lot of the discoveries the narrator mentions were a case of convergent invention, meaning they were created independently in separate parts of the world stemming from the same need. This includes the flame-thrower and catapult. So one can accurately say they were invented in the West, and originated from the Chinese. DRINK!\n\n1.51: The historian states most of the weaponry used in modern warfare has its roots in ancient China. You know, like ships, which were never used by the West, aircraft, tanks, APC, bayonets, helicopters and drones. DRINK!\n\n1.55: The Chinese were thousands of years ahead of their time? Despite certain inventions, the core of Chinese warfare remained identical to other contemporary cultures: infantry and cavalry using weapons and armor like shields, swords, spears, bows and pole-arms. DRINK!\n\n2.49: Starting from 400 BC, the narrator states the goal of each state was to conquer the others and rule China, and they do so by showing a modern map of China. GAAAAAH! The territory ruled by the Qin Dynasty was vastly different to that of China today. This is the state of Qin versus the current borders:\n\nhttps://s-media-cache-ak0.pinimg.com/originals/87/a5/27/87a5274392858b16821f03207614bbdc.gif\n\nAs you can see, Qin is a third of the size. DRINK!\n\n2.53: The Chinese certainly experimented a lot with different weapons in response to different conditions, but to say they \"accelerated the development of killing machines\" is incorrect. For example, gunpowder was supposedly developed in the 9th century AD but the oldest Chinese cannon dates from 1290, meaning it took 400 years of evolution to reach that point. DRINK!\n\n3.06: In 800 BC spears and pole-arms were the most common weapon, not the sword. This was because they were cheaper to create and more effective when used by large numbers of troops. Hand-to-hand fighting would also remain central for 1800 years as well. DRINK!\n\n3.17: Chinese hand-to-hand weapons were not the most lethal the world had seen. They were actually inferior in material to other contemporary cultures. DRINK!\n\n3.30: In 800 BC the Chinese were still working with bronze, not iron. It was the Middle-East that was pioneering metallurgical development. Also, the swords they are showing are a form of Jian that seems quite modern:\n\nhttps://upload.wikimedia.org/wikipedia/commons/7/73/Jian_(sword).jpg\n\nThis is what a Jian from the Warring States period looks like:\n\nhttps://en.wikipedia.org/wiki/File:Sword_(Jian)_with_Chevrons_LACMA_AC1998.251.20.jpg\n\nDRINK!\n\n3.57: I think we all wish we had 36 inches.\n\n4.05: The narrator says the longest swords in Europe during the time of the Warring States was 27 inches long. European Bronze Age and Iron Ages swords such as the Naue II and those produced by the Halstatt culture could be up to 33 inches long. Seriously, did the writers of this show do any research? Any at all? You can get books at the library that explain this stuff. DRINK! \n\n4.24: \"The result was an incredible level of hardness\". Hehehehehehehehehe.\n\n4.41: I'm not saying it was aliens..........\n\n\n6.37: The Chinese dagger-axe was hardly the most unique, as its method of fastening it to the shaft was similar to Middle-Eastern bronze-age axes. Here is a dagger-axe:\n\nhttp://www.cultural-china.com/chinaWH/images/exbig_images/3648463791bed1afbea15eed7c27131b.jpg\n \nHere are bronze-age axes and designs from various cultures:\n\nhttp://www.larp.com/hoplite/JP4.jpg\n\nhttp://edgarlowen.com/b3351.jpg\n\nhttp://www.wessexarch.co.uk/system/files/images/bronze-axe-from-hoard.jpg\n\nIt was just an axe with a longer shaft to make it a pole-arm. DRINK!\n\n6.52: As opposed to weapons that just inflicted light punishment.\n\n7.16: As opposed to weapons that were designed to be used with minimum effect in hand-to-hand combat.\n\n7.25: \"To be on the receiving end of just one thrust would have been agonizing\". Hehehehehehehehehe.\n\n7.25: Also, dagger-axes were swung, not thrust. DRINK!\n\n7.33: Meanwhile, to accompany the description of a dagger-axe being swung, a guy just stabs an opponent with a *spear*. DRINK!\n\n7.37: By 1000 AD China was 2600 years old. Does the narrator not even remember the numbers he said *seven minutes previously*? DRINK!\n\n7.47: So all the guys making weapons before this date had just been amateurs?\n\n7.53: YOU CANNOT REWRITE HISTORY BOOKS SINCE THERE IS NO TIME TRAVEL OR A PREVIOUS TIMELINE TO ALTER! BAD METAHISTORY DRINK!\n\n7.58: It took many centuries for gunpowder to be refined into a weapon that would change the nature of warfare, whereas the narrator makes it sound like it happened overnight. Also, air-power and nuclear weapons also changed warfare just as much, so to say nothing has altered warfare in such a way since gunpowder is plainly false. DRINK!\n\n8.09: Gunpowder is a 1200 year old invention. Not 1000. Seriously, how the F*ck does the narrator keep making such simple mistakes? DRINK!\n\n9.07: They are having a white European male make gunpowder. CULTURAL APPROPRIATION!\n\n9.46: Pussy!\n\n11.09: The flame-thrower was not new or terrifying by this date. A form of flame-thrower involving greekfire had been used for 350 years by the greatest civilization on Earth: The Byzantines. DRINK!\n\n12.00: NO WAR FOR OIL!\n\n12.44: Glad to see 70's fashion is making a comeback.\n\n14.30: TOO. MANY. JOKES!\n\n16.17: The best tactical position to place a flame-thrower is probably towards the enemy.\n\n18.10: The triple crossbow employed three bows? Get of here with that crazy!\n\n19.02: Full-metal-jacket tipped missiles? What the hell does that even mean?\n\n19.26: \"The power straining to unleash the missile would be freed by banging the trigger\". Hehehehehehehehehe.\n\nWell, that is it for now. Part two should be done this Sunday.\n\nSources:\n\nAncient Chinese Warfare, by Ralph Sawyer\n\nChina's Cosmopolitan Empire: The Tang Dynasty, by Mark Edward Lewis\n\nThe Early Chinese Empires: Qin and Han, by Mark Edward Lewis\n\nEurope Between the Oceans: 9000 BC-AD 1000, by Barry Cunliffe\n\nMedieval Chinese Warfare 300-900, by David Graff\n\nWarfare in the Ancient Near East to 1600 BC, by William Hamblin\n\n",
        "created_utc": 1454667774,
        "upvote_ratio": ""
    },
    {
        "title": "Can I request a proper refutation of this quote from David Cross about the transmission of the Bible?",
        "author": "Astrokiwi",
        "url": "https://www.reddit.com/r/badhistory/comments/445s7y/can_i_request_a_proper_refutation_of_this_quote/",
        "text": "[removed]",
        "created_utc": 1454600545,
        "upvote_ratio": ""
    },
    {
        "title": "\"At that moment in history Hitler told his aides, \"I am a hunter confronted with two tigers and who only has one bullet\". Indeed.\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/445ipl/at_that_moment_in_history_hitler_told_his_aides_i/",
        "text": "[removed]",
        "created_utc": 1454596866,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts for Thursday, 04 February 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/444yw7/thoughts_for_thursday_04_february_2016/",
        "text": "It's almost Friday everyone, and with that comes the newest latest of the Thoughts for Thursday Thread! Whoot whoot!\n\nHave any weekend plans? Found something interesting this week that you want to discuss? This is the thread to do it! This thread, like the Mindless Monday thread, is free-for-all. Just remember to np link all links to Reddit if you link to something from a different sub, lest we feed your comment to the AutoModerator. No violating R4!\n",
        "created_utc": 1454587257,
        "upvote_ratio": ""
    },
    {
        "title": "Bad Frankish Military History Part Two, or how ByzantineBasileus discovered he is not immune to tranquilizer darts.",
        "author": "ByzantineBasileus",
        "url": "https://www.reddit.com/r/badhistory/comments/444ss1/bad_frankish_military_history_part_two_or_how/",
        "text": "This is the second part of my review of the documentary, Barbarians: The Franks. I still have my bottle of Bärenfang, so let us begin!\n\n19.15: \"His notion is to win booty\". Hehehehehehehehehe.\n\n20.03: INCORRECT ARMOR! DRINK!\n\n20.15: At this point they are making out as if Clovis is waging war against Rome itself. Incorrect. The Roman Empire in the west has collapsed at this time(486 AD). He was waging war against Syagrius, who was a Roman military commander who led a successor state within Gaul, but Clovis was not at all hostile to Rome and maintained relations with the Eastern Roman Empire. The Roman Emperor Anastasius actually granted him a title after 507, meaning he was still willing to be incorporated into *conceptual framework* of Roman civilization. DRINK!\n\n20.18: The state of Soissons was hardly the last stitch binding Rome together, since the office of Western Emperor was no more after Romulus Augustulus was deposed by Theodoric the Great and the Eastern Emperor Zeno was recognized as the sole authority. DRINK!\n\n20.50: Syagrius in no way represented the last shred of Roman legitimacy, because the acknowledged leader of Rome *STILL EXISTED AND STILL GAVE OUT TITLES IN ORDER TO LEGITIMIZE GERMANIC RULE!* Examples include Theodoric ruling in Italy on behalf of the Emperor, having been given the title of consul earlier in his life. DRINK!\n\n21.05: INCORRECT ARMOR! DRINK!\n\n21.20: INCORRECT ARMOR! DRINK!\n\n21.32: INCORRECT WEAPON! DRINK!\n\n22.03: Rome was not a dead Empire. ARE THESE PEOPLE FORGETTING CONSTANTINOPLE?? DRINK!\n\n22.29: The Franks already had a home of their own. You know, the region they were granted by the Romans to settle in, and which they had occupied for 200 years by this point. DRINK!\n\n23.16: INCORRECT ARMOR AND WEAPONS! DRINK!\n\n24.18: INCORRECT ARMOR! DRINK! \n\n25.03: I like the blood on the edge of the axe. At least they remembered that detail.\n\n25.37: What the hell kind of dagger is that? DRINK!\n\n26.13: THERE CAN BE ONLY ONE!\n\n26.43: INCORRECT ARMOUR! DRINK! ALSO, I THINK I AM LEGALLY DEAD NOW!\n\n28.00: The weapons and armour in this battle-scene make me want to cry. DRINK!\n\n28.43: *Throws pokeball on ground* \"YHWH! I CHOOSE YOU!\"\n\n29.24: Now I'm having flashbacks to my Attila: Total War game.\n\n30.23: Gahhhh! Clovis converting to Christianity did not bridge the gap between Roman and Barbarian. The Germanic peoples had been in the cultural orbit of Roman civilization for centuries! DRINK!\n\n31.19: INCORRECT WEAPONS! DRINK!\n\n31.33: Why the hell has a historian got a skull in his office?\n\n32.24: INCORRECT ARMOR AND WEAPONS! DRINK!\n\n33.22: You know what other ancient time periods shared a similar style of battle? ALL OF THEM!\n\n34.05: INCORRECT ARMOR AND WEAPONS! DRINK!\n\n35.02: At this point I am going to give up pointing out inaccurate references to the Franks being barbarians.\n\n35.29: What the hell kind of dagger is that? DRINK!\n\n36.40: The Games of Thrones theme is now playing in my head for some reason.\n\n37.37: INCORRECT ARMOR! DRINK!\n\n38.23: INCORRECT WEAPON! DRINK!\n\n40.56: 511 WAS AN INSIDE JOB!\n\n41.02: INCORRECT WEAPON! DRINK!\n\nWell, that was without a doubt the worse documentary I have ever seen. Watching it was physically painful. There are other documentaries in the Barbarians series, but there is no way I am ever going to subject myself to watching them. 40 minutes of bad costuming is something I cannot bear. It is honestly like they paid no attention and just selected props at random from a box. And who the hell wrote it? There was so much misrepresentation I could barely go 5 seconds without finding something to be critical about. Never again!\n\nSources (For Part One and Part Two)\n\nThe Carolingians : A Family Who Forged Europe, by Pierre Riché\n\nA History of the Byzantine State and Society, by Warren Treadgold\n\nWarfare and Society in the Barbarian West 450-900, by Guy Halsall\n",
        "created_utc": 1454583473,
        "upvote_ratio": ""
    },
    {
        "title": "\"history of Japan\", bad history edition",
        "author": "Kegaha",
        "url": "https://www.reddit.com/r/badhistory/comments/44316s/history_of_japan_bad_history_edition/",
        "text": "[This video](https://www.youtube.com/watch?v=Mh5LY4Mz15o) is touring reddit these days. So why not /r/badhistory too? Of course there is a lot of Bad History in that video, and I won't cover it all, mostly because these colourful voices annoy me, so I ragequited at the 4th minute.\n\n\nIt all begins at 0:54 when Prince Shôtoku Taishi is presented as the one who tried to convert Japan to Buddhism. Actually no, debates regarding the introduction of Buddhism in Japan dates back to Emperor Kinmei. Shôtoku Taishi was a great Buddhist, and did a lot for Buddhism, but he is not the one who came up with the idea of spreading Buddhism in Japan. Also, you can't say \"knock knock it's religion\", there already were religions in Japan before that. And how to name this religion is a fierce battle between those who want to call it Shintô and the others who ~~are wrong~~ think it shouldn't be called Shintô, but I digress.\n\n\n1:34: Kyôto is not the first \"permanent\" capital. Nara was the capital before that. But it ended up being changed to Kyôto because of some stories involving monks trying to take control of the government and ghosts. But mostly ghosts. Or monks, depends on who you ask to.\n\n\n1:35: Japan \"conquered\" the north of Honshû. No. At this date what was conquered was all but roughly (to speak with modern geographical repairs) Aomori, Iwate and Akita. These parts of Honshû were still Emishi territory (basically \"barbarians\" hostile to the Japanese government) and got pacified some centuries later, some of them. Also don't say \"North of Japan\". Current day Japan includes Hokkaidô, that is on the north of Honshû, and that has only been annexed at the end of the 19th century. Say North of Honshû instead.\n\n\n\n1:42 : Kûkai didn't bring zen back to Japan, but Shingon. Shingon and zen are very different. \n\n\nAround 2 minutes, I would speculate that the person didn't understand the dynamic behind the appearance of samurai, but he doesn't say enough for me to call bad history or not.\n\n\n2:14 : The Shôgun was not \"actually\" in control during the Kamakura Shôgunate. The real persons who ruled (but not officialy) were the Hôjo clan.\n\nAround 2:30 : That's a bit more complicated, the other emperor created his own government in Southern Japan (thanks to /u/pgm123 who noticed my mistake, I wrote Eastern instead of Southern, and gave [more details](https://www.reddit.com/r/badhistory/comments/44316s/history_of_japan_bad_history_edition/cznrc61) ) and was only defeated 60 years later (that's an era called Nanboku Chô)\n\n\n3:40 : Hokkaidô was not a part of Japan when Toyotomi Hideyoshi unified it.\n\n\n\nSources: \n\n1. For the history of Buddhism in Japan, *A History of Japanese Buddhism* by Kenji Matsuo, and more specifically the second chapter that deals with both my points.\n\n2. Regarding Hokkaidô not being a part of Japan, *The Making of Modern Japan* by Marius B. Jansen deals with the colonization of Hokkaidô in the 9th chapter\n\n\n3. Regarding the relations between the Hôjo and the Shôgun, the *Cambridge history of Japan*, volume 3, chapter 1.",
        "created_utc": 1454549082,
        "upvote_ratio": ""
    },
    {
        "title": "Grey Germs and generalizations",
        "author": "whatismoo",
        "url": "https://www.reddit.com/r/badhistory/comments/442hp6/grey_germs_and_generalizations/",
        "text": "[removed]",
        "created_utc": 1454541474,
        "upvote_ratio": ""
    },
    {
        "title": "This thread, on Ronald Reagan's party switch, is chock full of \"the Southern Strategy don't real\"",
        "author": "vodyanoy",
        "url": "https://www.reddit.com/r/badhistory/comments/440yv5/this_thread_on_ronald_reagans_party_switch_is/",
        "text": "https://np.reddit.com/r/todayilearned/comments/43sqml/til_that_ronald_reagan_idolized_by_the_republican/czkon6x\n\n&gt; Yeah, this whole 'parties flipped' thing is hogwash. If this were true, why were most Southern state legislatures and governorships solidly in Democratic control into the 90's and even 00's? [source](https://np.reddit.com/r/todayilearned/comments/43sqml/til_that_ronald_reagan_idolized_by_the_republican/czl0ptt)\n\n and\n\n&gt; There was not a major party switch. It.Simply.Didnt.Happen. You've named two people who switched parties. Two. That isn't a trend. Also, you're version doesn't make sense; at all. The Republicans were the ones pushing civil rights legislation. Why would racist Democrat, like Thurmond, join the party he fought for so many years, citing (you speculating) the issue they fought over as his motivation? That makes less than no sense. It's far more likely that Thurmond (whom I believe had a black mistress) wasn't a racist but was caught up in the times while Byrd made a show of his new found tolerance but was still an ardent racist.\n\n&gt; The term \"Southern Strategy\" was a media term, not coined by Republicans. As though there is a monolithic Republican. I'm laughing out loud at the Wikipedia article.\" [source](https://np.reddit.com/r/todayilearned/comments/43sqml/til_that_ronald_reagan_idolized_by_the_republican/czl47n0)\n\nR5: The Southern Strategy is not a liberal lie made up to slander the GOP. [It is a well-documented historical event or series of events that explains why the South went from Democratic control to GOP control.](http://www.jstor.org/stable/4129605) The link here is provided just as an example of the type of scholarship that has been done, but there are hundreds or even thousands of other works discussing the Southern Strategy.",
        "created_utc": 1454522079,
        "upvote_ratio": ""
    },
    {
        "title": "This thread, on Ronald Reagan's party switch, is chock full of \"the Southern Strategy don't real\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/440m6u/this_thread_on_ronald_reagans_party_switch_is/",
        "text": "[removed]",
        "created_utc": 1454517656,
        "upvote_ratio": ""
    },
    {
        "title": "/r/europe, genocide olympic and the Victor guy.",
        "author": "Kaschenko",
        "url": "https://www.reddit.com/r/badhistory/comments/43yzod/reurope_genocide_olympic_and_the_victor_guy/",
        "text": "[removed]",
        "created_utc": 1454488984,
        "upvote_ratio": ""
    },
    {
        "title": "Wondering Wednesday \"What's the point?\"",
        "author": "smileyman",
        "url": "https://www.reddit.com/r/badhistory/comments/43yqcc/wondering_wednesday_whats_the_point/",
        "text": "Today's Wondering Wednesday topic is all about historiography. For those of you who don't know, historiography is the study of *how* we do history, as well as the study of why we do history and the various models of history that we come up with.\n\nToday's topic is going to focus on Grand Unifying Theory. This is in response to a recent video by CGP Grey that followed up on a previous video of his where he used Jared Diamond's *Guns, Germs &amp; Steel* as a source.\n\nG,G &amp; S has been largely discredited by the historian community, so it was no surprise that the video garnered outrage amongst the badhistorians. \n\nThe defenders of Diamond's work seem to want to have history be boiled down to a single unifying theory. So today's topics will revolve around that idea. Here are some questions about historiography to get the discussion started. \n\n* Why is history important in the first place?\n\n* What is historical theory?\n\n* What are some major schools of historical theory?\n\n* How has historical theory changed?\n\n* How does theory influence our interpretation of the past?\n\n* Why is historiography important?\n\n* How do the theories Diamond utilizes fit into the larger debate?\n\n* Why do people want a grand unifying theory of history?\n\n* Is it possible to do a grand unifying theory of history?\n\n* Is it even desirable to do do so?\n\n* What are some previous attempts at doing unifying theories\n\n* What are the pros and cons of trying to do a grand unifying theory?\n\n* Why is the analogy of history as a video or board game inappropriate?\n",
        "created_utc": 1454483107,
        "upvote_ratio": ""
    },
    {
        "title": "\"WW2 propaganda working too well. Mao and Stalin were the equivalent of Hitler x10, yet the latter gets remembered as the worst person of the 20th century. The same applies to the ideologies they followed.\"",
        "author": "m8stro",
        "url": "https://www.reddit.com/r/badhistory/comments/43wpej/ww2_propaganda_working_too_well_mao_and_stalin/",
        "text": "[removed]",
        "created_utc": 1454452359,
        "upvote_ratio": ""
    },
    {
        "title": "\"The consensus is that overall, the Bronze Age was a market economy.\"",
        "author": "catsherdingcats",
        "url": "https://www.reddit.com/r/badhistory/comments/43wcly/the_consensus_is_that_overall_the_bronze_age_was/",
        "text": "I finally found the article that made me want to quit this sub forever. [Click]( https://theanarchistlibrary.org/library/john-zerzan-origins-of-the-one-percent-the-bronze-age) with caution. \n\nI really wanted to go all out on this, but the amount he wrote and the density of the badhistory would make that take far too long. So, I will hit just a few personal favorites and ask anyone who wants to help post a favorite of yours in the comments! If you see any badhistory from me, please intervene. I’ve been starting to focus on the subject of ancient economies and trade, so I want to fix any mistakes.\n\nHere we go!\n\n&gt;Early on, what Marx called “domestic” or household industry was already market-oriented, and the consensus is that overall, the Bronze Age was a market economy. \n\nI would be very hard pressed to call even 15th century Europe a “market economy,” but there is no way you could consider a few trade caravans moving a limited amount of surplus items from one location to another a market economy. While there are a few examples of those “modern” features (listed below) during this time, that does not actually describe “Bronze Age” commerce.\n\n&gt;Long-distance trade, occupational/full-time specialization, supply/demand-determined prices, capital investment, credit, and other “modern” features are observable by the 4th millennium B.P. \n\nLong distance trade tended to focus on high value goods such as gold, amber, or shells, while most materials, like timber or wheat, were produced at the local level. You did have some occupational specialization in the few cities, but most people were still involved with local substance farming and animal husbandry. Calling much if anything in that time period a “capital investment” is a large stretch; paying to improve one’s farm or a city-state building a bigger temple are not done to solely improve value or turn a profit, which is an implication of that term. Credit was something that was happening, true, there were laws concerning debt, but not at a level of a market-oriented economy. Lastly, and my favorite, supply and demand did not determine prices; prices generally *weren’t determined, they were negotiated. \n\nA nice quote to describe the situation in the Near-East at the time:\n\n&gt;“Commodity exchange is not by itself tantamount to a market-system as we know it. Worth is not the same thing as price (Ratnagar 2003).”\n\nMoving on…\n\n&gt;Such capitalist aspects have existed in all the civilized countries of the world for as far back as economic evidence can take us. Sam Lilley saw pottery as “the first mechanized production industry, the first step on the way to the mass production factory of today.”\n\nCalling these concepts “capitalist” is ridiculous. You would be hard pressed to find any modern or historic economic system that did not include at least one of them and more likely several. I believe the author is trying to link any type of economics to the horrible capitalism to promote his ideal stateless society. Also, if you don’t recognize Sam Lilley, don’t worry, it is because our author is fond of choosing very outdated nonprofessional archaeology books to support his claims.\n\nBONUS (AKA last minute):\n\n&gt;Extraction and smelting of metal ores was a principal motor of Bronze Age society, with metallurgy stimulating all other productive activities. \n\nFor the first part of the “Bronze” Age, bronze was still fairly rare and mainly seen as a status symbol (fancy bronze swords or burial caches); copper and obsidian tools were still very wide spread. Agriculture is easily the closest thing you have to the foundation of society, considering a hunting and gathering society could not support a city. \n\nAnyway, I’ve spent more than enough time with this. If you will excuse me, I need to abuse some prescription medication.\n\nEdit: There seems to have been some confusion about what is meant by a market economy. While this time period in Mesopotamia, the Indus, Egypt, etc. some of these things were present, they were too underdeveloped to be considered market economies, which describes almost all economies prior to the 15th century. \n\n&gt;Market economies are defined by more than he mere presence of \"supply and demand\"; they involve competition between buyers and sellers that fixes the price of goods and has a feedback relationship between prices fluctuations and producive output (Keswani 1993). \n\nThis price feedback loop would allow the good to become commodified. This is the reason that even a socialist economy with public ownership can have a market economy in as much as the price is adjusted to find the price equilibrium. Also, in the types of markets that would be prevalent, most people selling were not full time retailers, but rather individuals selling surplus good. It would be very unlikely that these would be quantified by weight or volume (and in some cases even by number); this further reduces the chances of a supply and demand defined price (Ratnagar 2003).\n\n\n1. Ratnagar, Shereen. 2003. \"Theorizing Bronze-Age Intercultural trade : the evidence of the weights.\" *Paléorient* 29 (1): 79-92\n\n2. Keswani, Priscilla. 1993. \"Perspectives on Cypriot Social Complexity.\" *Bulletin of the American Schools of Oriental Research* 292 (Nov):73-83 ",
        "created_utc": 1454447848,
        "upvote_ratio": ""
    },
    {
        "title": "Lord Have Mercy on Mercy Street",
        "author": "TitusVarrus",
        "url": "https://www.reddit.com/r/badhistory/comments/43w35s/lord_have_mercy_on_mercy_street/",
        "text": "PBS recently aired its newest show Mercy Street (PBS Sundays at 10/9c) which revolves around a Civil War hospital in Alexandria, VA. It examines several aspects of Civil War medical history that have gone largely understudied and misunderstood. While the series makes some progress in authenticity standards in the genre of Civil War media, it is still not immune to Hollywood's creative license and perpetrates many inaccuracies. A few friends of mine with the National Museum of Civil War Medicine served as historical advisors to the show and often expressed their frustration with the production cast blatantly ignoring their input on certain historical facts and details. \n\nEpisodes may be found at: http://www.pbs.org/show/mercy-street/ (Only the latest two apparently. Episode 1 is not available for free)\n\n\n\n* **1) Poor Hygiene, Dress, and Long Hair**\n\nThe first glaring inaccuracy is the widespread portrayal of unkempt and dirty soldiers, both in the wards and in garrison. ([Example](http://imgur.com/bCGmnNx)). Find the Wookie became my new drinking game early into the first episode; it wasn't long before I was quite buzzed. As my connections in the production team told me, many extras were chosen specifically for that purpose. Two of the museum’s volunteers were denied extra roles, having been told their hair was too short. It’s no secret PBS is trying to go for that stereotypical rugged soldier look, trying to present a physical manifestation of the war's suffering by making them look unkempt and dirty. But this is precisely the opposite of what a soldier would do. The armies of both sides maintained strict uniform regulations and demanded their soldiers keep well dressed, well groomed, and clean. While this has the effect of boosting morale and confidence as well as maintaining discipline, cleanliness and short hair kept diseases and lice at bay. J.J. Woodward, M.D. wrote in *The Hospital Steward's Manual* that:\n\n&gt;The strictest military discipline is absolutely necessary in a military hospital; and it will be too generally found that an unmilitary neglect of regulations in regard to dress coexists with a general neglect of discipline and regulation in regard to other duties.\n\nAdditionally:\n\n&gt; Every patient, who is able, will wash his face and hands at least every morning, and keep the rest of his body in a cleanly conditions. Those who are unable to do this will have it done for them by the attendants. Every patient whose condition does not forbid it will take a bath on his admission into the hospital.\n\nCleanliness and hygiene were of highest importance in general hospitals for the sake of preventing disease. While germ theory was not yet accepted knowledge, physicians universally agreed that cleanliness promoted health and prevented infection. The 1861 Regulations clearly say \"The hair *kept short* and beard neatly trimmed.\"\n\nIn addition to uniforms being improperly worn, there seems to be a habit of people being out of them entirely. One of the surgeons can frequently be seen not wearing his officer's frock and the civilian contract surgeon is also not wearing an officer's frock. Though civilian, contract surgeons, also known as Acting Assistant Surgeons (usually with the rank of Brevet 2nd or 1st Lieutenant), they were still subject to military rules, regulations, and chain of command. Several period photographs prove that civilian contract surgeons had uniforms. It is possible, however, PBS decided to forego a uniform for this character to avoid confusion. \n\n\n* **2) Personal Effects and Weapons in the Wards**\n\nAt one point in the first episode, weapons can be seen in the background resting against a wall. One might understand that these weapons may have belonged to the patients. It was a rare occurrence for personal effects to travel with a soldier from the front to the hospital. His company would have taken charge of any weapons, accoutrements, or personal items the soldier had on him at the time of his evacuation. In the rare situation those effects were not collected, they would have immediately been impounded at the hospital upon admission. In the second episode, a Confederate soldier gives a nurse his haversack. It is extremely unlikely he would have been able to hide this from his captors. His belongings, like those of all the other patients, would have been collected.\n\n&gt;The knapsack-room is a place set apart for the safe keeping, not only of knapsacks, but of overcoats, blankets, and other property of the patients, and of their arms and accoutrements when they are brought with them to the hospital. It should be a secure apartment, of sufficient size, shelved on all sides and furnished with an arms-rack for the arms. Certain shelves should be set aside for each ward. On these the knapsacks should be neatly arranged. Each should be carefully and regularly packed, the articles have been first well cleaned or washed, if necessary. A label should be attached, having written legibly upon it the name of the owner, with his regiment and company. Great-coats and blankets should be neatly folded and strapped upon the knapsack. Arms should be placed in order upon the arms-rack and a similar label attached to each musket, sabre, belt, &amp;c.\n\n\n* **3) Incorrect Depiction of Sentries**\n\nGuard duty is one of the most poorly presented parts of military etiquette in Civil War media. In this case, the production team either did not open a single primary source or chose to ignore the input of the historical advisors. In the final scene of the first episode, two sentries can be seen, fully equipped and armed, inside the ward. These sentries would have no reason to be there as posts were placed at the entrances, exits, and any other position deemed necessary by the surgeon in charge (Not to mention, they are out of dress by not having their buttons buttoned). \n\nIn the second episode a sentry can be seen outside the entrance to the hospital. If I were an officer or the corporal of the guard, I'd have had that soldier disciplined for failure of his duties. The soldier's rifle must never touch the ground for the two hours he is on duty; he must \"carry [his] arms habitually at support, or on either shoulder, but will never quit them.\" This soldier is standing at a bastardized version of Order Arms. Additionally, that soldier is required to \"allow no patients or attendants to leave the building, except when furnished with a written pass, signed by the surgeon. Orders should also be given to admit no one, except patients or attendants returning from pass; new patients arriving with proper orders for admission; persons known to have business in the hospital; the medical officers and those wishing to receive them; and visitors on the visiting days and hours only.\" This sentry did not stop anyone from entering or exiting nor asked for papers, thus disobeying orders.\n\n\n* **4) The \"Medical Cadet\"**\n\nThis character appears in the show with little exposition. He refers to having attended \"the Academy\". There was no Academy for medical studies in the United States, nor would medical students of private schools be referred to as \"cadets\". There were several instances of medical students joining the army to volunteer their services or to acquire academic credit for military service. These would have simply been Contract, or Acting Assistant Surgeons, given a temporary rank and uniform for the term of their contract and the duties of that position. Additionally, this character faints during a trepanation. There is no possible way this man would have survived medical school and years as an apprentice and be squeamish. That was most certainly a condition for being denied a position. I also shouldn't have to explain why the line \"Cadet down!\" is not period correct.\n\n* **5) The Fugitive Slave**\n\nA main plot point in the second episode features Federal soldiers looking for a fugitive slave in a carpentry workhouse. An Act of Congress (March 13, 1862 - prior to the events of this episode) clearly states:\n\n&gt; All officers or persons in the military or naval services of the United States are prohibited from employing any forces under their respective commands for the purpose of returning fugitive from service or labor, who may have escaped from any persons to whom such labor or service is claimed to be due; and any officer who shall be found guilty by a court-martial of violating this article shall be dismissed from service.\n\n* **6) Stereotypes and Cliched Characters**\n\nThe series is a drama, I get that. But they morphed their cast into caricatures, making a few traits define the character. Not only does this result in very flat and 1 dimensional characters, but it propagates certain misconceptions about Civil War medical personnel. (I wrote my undergrad thesis on this topic). There is the image of the motherly female nurse. Female nurses really only accounted for about 20% of all nursing staff. Most nurses were in fact convalescent male soldiers. The Hospital Steward's Manual routinely refers to nurses as masculine and devotes but a small section to female nurses. The army surgeons are portrayed as uncaring and drunkards. An analysis of court-martial records revealed the rate of drunkenness in the medical corps to be at 18% - the same rate in the rest of the army. Ergo, surgeons were just as sober as the rest of the military. Additionally, my analysis of journals and letters of medical personnel that I conducted for my undergrad thesis showed that surgeons were just as compassionate as the nurses. This is my largest point of contention but it took me an entire thesis to adequately refute this, so brevity and lack of detail will have to suffice \n\nI applaud PBS and their programming is usually good (I enjoyed Downton Abby but I can't speak for it's accuracy). I will give them credit for some of their positive portrayals of Civil War medical care. However, I'm sadly disappointed in the demonstrated lack of simple research. I can personally attest to the quality of the historical advisors and the breadth of their knowledge, so I know for a fact that PBS had this information at their disposal. What I cannot readily forgive is ignorance in the face of evidence and PBS sadly displayed that. However, I'll still watch it if only to play more Bad History drinking games and reap more karma from posts about future episodes.\n\nEDIT: I wanted to point out the overall atmosphere of chaos they present in the hospital. I didn't address this earlier in detail because it can be argued one way or the other. This story takes place around Spring of 1862 (It is mentioned in dialogue that the Peninsula Campaign is underway). At the outbreak of the war the first two Surgeons General, Thomas Lawson and Clement Finley, made absolutely no preparations for war casualties nor any changes to infrastructure to account for the dramatic increase from a 17,000 man army to an army of hundreds of thousands. Naturally, early war medical care was atrocious. Their successor Surgeon General William Hammond however was quite the reformist and enforced discipline and regulations. However, the greatest changes came when Maj. Dr. Jonathan Letterman became Medical Director of the Army of the Potomac in July of 1862. He was most responsible for turning the medical corps into a highly efficient system both in how it treated the sick and wounded and in logistics. So on the one hand, this series is early enough in the war and pre-Letterman that it *might* still be fairly lax and unregulated. On the other hand, it's late enough in the war and under Hammond's administration that it should display some notion of adhering to regulations. I can't say with any certain that breaking the rules would never have happened, however I feel its unlikely in this situation. \n\n\n**Sources**\n\n[Bolet, Alfred J. *Civil War Medicine: Challenges and Triumphs* Tuscon: Galen Press, 2002](http://www.amazon.com/Civil-War-Medicine-Challenges-Triumphs/dp/1883620082)\n\n[Lowry, Thomas P. and Jack D. Walsh *Tarnished Scalpels: The Court-Martials of Fifty Union Surgeons* Mechanicsville, PA: Stackpole Books, 2000](http://www.amazon.com/Tarnished-Scalpels-Court-Martials-Fifty-Surgeons/dp/0811716031)\n\n[Wilburn, Michael P.*\"There is No Glory For Our Profession\": The Experiences of Surgeons and Nurses in the American Civil War* Saint Mary's City: Saint Mary's College of Maryland, 2013](https://drive.google.com/open?id=0B8qX4Rh6Zy1udDJDTFdSd0pjZ0k) \n\n[Woodward, J. J. *The Hospital Steward's Manual: For the Instruction of Hospital Stewards, Ward-Masters, and Attendants, In Their Several Duties*, Philadelphia: J. B. Lippencott &amp; Co, 1863](https://archive.org/stream/hospitalstewards00unse#page/n5/mode/2up)\n\n[*Act Prohibiting the Return of Slaves* March 13, 1862](https://en.wikipedia.org/wiki/Act_Prohibiting_the_Return_of_Slaves)\n\n[*Revised United States Army Regulations 1861* Washington: Government Printing Press, 1863](https://archive.org/details/revisedunitedst00deptgoog)\n\n\nVarious resources from the National Museum of Civil War Medicine in Frederick, Maryland\n\nMultiple letters, diaries, and journals of medical personnel",
        "created_utc": 1454444581,
        "upvote_ratio": ""
    },
    {
        "title": "A so-called \"True Crime Library\" book gets its details wrong regarding Peoples Temple, or \"don't ever trust anything that claims to be true in the title, because they're probably going to get it wrong\".",
        "author": "cordis_melum",
        "url": "https://www.reddit.com/r/badhistory/comments/43rx4k/a_socalled_true_crime_library_book_gets_its/",
        "text": "I was looking through a rather old syllabus for a sociology course taught at my university about new religious groups some weeks ago. I mainly did it because I wanted to find more reading material about Peoples Temple (because *of fucking course* I would), and I wanted to see what a professor would recommend. One of the required readings for the subject was a chapter about Peoples Temple in the book *Killer Cults* (James J. Boyle, St. Martin's Paperbacks, 1995), entitled \"Dad Knows Best\". \n\nBut first, let's see what the introduction to this book says:\n\n&gt; Each month, we [St. Martin's True Crime Library] offer you a fascinating account of the latest, most sensational crime that has captured the national attention. [...] St. Martin's True Crime Library gives you the stories *behind* the headlines. Our authors take you right to the scene of the crime and into the minds of the most notorious murderers to show you what really makes them tick. St. Martin's True Crime Library paperbacks are better than the most terrifying thriller, because it's all true!\n\nWell, then. I could go on about how popular historiography has treated the subject of Peoples Temple, but that might take a rather long time. Of note, I would like to point out that the first thing that the publisher is focused on is *sensationalization*. Sensationalized stories about Peoples Temple have been published way before this; the instant-history book *The Cult that Died* is a prime example of what has been called the pornography of Jonestown. So you get an idea on what is being emphasized here: thrilling sensationalization. To that end, the chapter on Peoples Temple is riddled with errors. \n\nThe preface to the book describes \"the queue of the doomed\", who are \"mechanically dipping cups into vats of death\". Take three guesses as to what this book is describing. It's really a loser's bet.\n\n&gt; They'd [Jim Jones and Marceline Baldwin] met and married when he was seventeen and starting a career as an apprentice Methodist minister in Indianapolis. (p. 34)\n\nNo, they met when Jim Jones was working as an orderly at the same hospital where Marceline was a student nurse^^(1). Jones was still a high school student at the time^^(2). He would not become a student minister until 1952^^(3), several years after he and his wife were wed^^(4). \n\n&gt; In 1957, after raising cash selling South American monkeys door-to-door for twenty-nine dollars each, Jones hung a shingle, \"People's Temple\", outside a rented storefront in an Indianapolis neighborhood whose population was rapidly changing from white to black. Just like that, he had founded his own religion. (p. 34)\n\nThe church that would later be called Peoples Temple was founded in 1954^^(5). It was first \"Community Unity\", then became \"Wings of Deliverance\" in 1956^^(6), and then \"Peoples Temple\" very shortly after^^(7). By the time the church was named \"Peoples Temple\", Jones had paid for an actual church building^^(8). Furthermore, many of his early members were former members of Laurel Street Tabernacle. They had followed Jones when he had walked out, angry that Laurel Street officials were uncomfortable with his pro-integration message and actions attempting to fully integrate the church^^(9). \n\n&gt; To those who had known the intensely religious young man as a teenager, this seemed somewhat unusual. Jim Jones had always been a bigot as a youngster. (p. 34-5)\n\nMany people have been interviewed regarding Jones's childhood years^^(10). In all of the accounts that I've heard and/or read, I have never heard anything suggesting that he was a \"Bible-thumping white racist with 'nigger' on his curled lips\" as a young child. Certainly, he swore like mad, and you can definitely make the argument that Temple leadership reflected racism on behalf of wider society and/or Jim Jones. However, there is little evidence to suggest that he was a cynical opportunist who did not believe what he preached, that being advancing social justice and ending racial and class inequalities. \n\n&gt; The Temple was a beehive of activity during the rest of the week too, as Jones expanded his base, leading his followers in fair-housing demonstrations and other New Left protests that generated respectful media attention and quickly established the charismatic young preacher as a new community leader. (p. 35-6)\n\nI'm left wondering if the author confused it with political activity undertaken in San Francisco in 1976-77. While Peoples Temple did establish themselves as community leaders, it was through promoting an integrated church, operating nursing homes, feeding the poor, etc. \n\n&gt; [still discussing the Indianapolis years] With these successes came the flashy symbols of status -- diamond rings, alligator shoes, frequent trips out of town in the style of a touring dignitary. (p. 36)\n\nJones is known for being extremely frugal^^(11). In fact, the only time that he was uncharitably show-offish with wealth was when he and his family moved to Belo Horizonte, Brazil, in 1962^^(12). Even then, his family set up a food program to feed starving children that they met on the streets, and the family lived on rice and beans^^(13). \n\n&gt; Some of his flock might well have remarked on the fact that Jones's top aids all were white--while the congregation was overwhelmingly black. If so, there's no record of it. (p. 36)\n\nThis is still discussing the Indianapolis years. During this time, Archie Ijames, a black man, was made one of the associate pastors^^(14) (although, to be fair, he was the only black man in the associate pastor role). \n\nThe section about remarking about the racial disparity in Temple leadership is true during Indianapolis, but not so true when the community moved to California, as seen in [this letter](http://jonestown.sdsu.edu/wp-content/uploads/2013/10/g8.pdf) by the Eight Revolutionaries^^(15). I'm willing to be generous and assume that the author just meant Indianapolis, but if the statement is meant to be read generally, it's wrong.\n\n&gt; Imposters were hired to fake being cured, even putting on ghoul faces to stage demonic-possession seizures to allow Jones to exorcize the beast. (p. 43)\n\nIt's generally understood that Planning Commission and staff members helped to fake the faith healings^^(16).\n\n&gt; Now organized into a group called Concerned Relatives, the defectors--along with relatives of followers who claimed Jones was holding people hostage in a messianic cult--had no luck getting a hearing from news organizations like the San Francisco *Chronicle*, which had invested years of positive coverage.\n\nThe entire story is described in *The Cult that Died* from the point of view of Klineman, Butler, and Conn, two who were instrumental in getting the *New West* piece written in the first place. The same story, including a description of meetings with defectors, is also described in *Raven*, on pgs. 313-31. Kilduff was the person who tried to propose an article intending to profile what he saw as an odd political figure, not the defectors who would later become the Concerned Relatives. Kilduff's article had been rejected from the *Chronicle* because it was not substantial enough. Quoted in *Raven*, \"Kilduff had neither proved his suspicions nor drawn a concise portrait of Jones\"^^(17). \n\nIn fact, defectors did not come forward with their stories until *after* the Temple began to hound *New West* with letters testifying to Jones's good character. *New West* wrote an article describing the Temple's overreaction, hoping to find people who were willing to testify about Temple misdeeds, and the bait worked. Before then, the defectors had been too terrified of Jones to come forward (or had not known that reporters did want to hear and publicize their stories).\n\nFinally, the Concerned Relatives group was not formed until late 1977, several months after the *New West* article was published^^(18).\n\n&gt; *New West*'s editorial offices were burglarized; a rough draft of the Kildruff article was stolen (p. 47) \n\nThe [police investigation](http://jonestown.sdsu.edu/wp-content/uploads/2013/10/vol090pp134.135.pdf) concluded that there was no link to Peoples Temple. In fact, the conclusion was that a *New West* staff reporter had locked himself out of the office and broke in through the window. Most histories, including *Raven*, make the mistake of omitting the police findings, but I'm not going to. \n\nAt this point, I got really fucking bored of the chapter, and extremely frustrated. There is probably more stuff I could debunk (descriptions on what happened on 17-18 November 1978 are generally juicy in that regard), but oh my gods, my brain was turning into mush from all of the bad history. \n\nI'm honestly surprised that a sociology class taught at my university would assign this chapter, especially when there are much better books to read regarding Temple history, even in 2008 (*Gone from the Promised Land* by John V. Hall, for example, or *Raven*, which I was using throughout this entire post). That one chapter on Peoples Temple was so full of bad history that it makes me doubt the veracity of the description of the other groups named in the book.\n\n1. *Raven: The Untold Story of the Rev. Jim Jones and His People*, Reiterman with Jacobs, 1982, p. 30\n2. Ibid, p. 33\n3. Ibid, p. 41\n4. Ibid, p. 36\n5. Ibid, p. 47\n6. Ibid, p. 49\n7. Ibid, p. 50\n8. Ibid, p. 49\n9. Ibid, p. 49\n10. Check out chapters 1 and 2 of *Raven*, or the documentary *Jonestown: The Life and Death of Peoples Temple*.\n11. Like, seriously. During the Redwood Valley/Ukiah years, there used to be [a sign](http://24.media.tumblr.com/tumblr_m2rmnr7XlV1qkj3a5o1_1280.png) talking about how he wore old church robes and how his suit was second-hand. Jones didn't take a salary for years. Probably the nicest thing he owned in Indianapolis was his car.\n12. *Raven*, p. 77\n13. Ibid, p. 80\n14. Ibid, p. 53\n15. The Eight Revolutionaries (sometimes called the Gang of Eight) were an integrated group of young, college-aged adults who defected from the Temple in 1973. They left behind a letter to Jones and Temple leadership, blaming staff for, among other things, obsessing too much about sex and not enough about socialism, not encouraging revolutionary attitudes or teaching the congregation about socialism, *the lack of active black socialist leadership* and the difficulties for black members to be elevated to staff positions, and divisiveness within the Planning Commission (a second-tier level within Temple leadership, generally consisting of around 100 members). For more information, check out the chapter on the Eight Revolutionaries in *Raven*, p. 219-29.\n16. See: *The Cult that Died: The Tragedy of Jim Jones and the Peoples Temple*; Klineman, Butler, and Conn; 1980. There's an entire chapter that discusses this topic, but I returned the university copy to the library some weeks ago, so I can't get the page numbers. It is also mentioned in *Jonestown: The Life and Death of Peoples Temple*, as well as the book *Understanding Jonestown and Peoples Temple* (Moore, 2009).\n17. Quote from *Raven*, p. 325.\n18. Ibid, p. 408\n\n(I realize that I hate 'Ibid' with a passion, but I was just so fucking irritated with this book that I just said 'screw it' and used it for the footnotes. Also of note, most of my sources predate 1995, when this so-called \"True Crime Library\" book was published, so this author has absolutely no excuse getting his details this wrong. This is seriously a research fail, although, in my personal opinion, it's not as big of a mistake as the accidental [white-washing of a black woman](https://www.reddit.com/r/badhistory/comments/4278gz/in_which_a_single_mistake_in_one_sentence/).)",
        "created_utc": 1454377483,
        "upvote_ratio": ""
    },
    {
        "title": "Low Hanging Fruit; aka The Hittites don't exist",
        "author": "dontfearme22",
        "url": "https://www.reddit.com/r/badhistory/comments/43qzvc/low_hanging_fruit_aka_the_hittites_dont_exist/",
        "text": "This is my first post ever on /r/badhistory; so if I screw up please tell me.\n\nMy main area of knowledge is the Bronze Age, Especially the Late Bronze Age and I came on this video in a dark side alley in youtube:\nhttps://www.youtube.com/watch?v=fKeEZwu6Eb0\n\nI really get irritated with a lot of the bad history around the Bronze Age, as a time period it seems to be uniquely attractive to truly epic levels of misinformation, with timeless classics like Jews/Pyramids, everyone is black!!, and the entire fustercluck of Exodus and Homer. \n\nSo lets take a ride on my magic carpet ride, yahoo!\n\n00:30 Pretty decent actually so far, but he decides to recommend realhistory.com, which is a infamous den of afrocentrist insanity worthy of a dozen or more posts, check it out [here](http://realhistoryww.com/) if you want your eyes to bleed\n\n00:50 Transliterating from cuneiform is always tricky, but most sources seem to show that its actually *nešili* not nes-es-i\n\n01:00-01:30 I have no idea what he is talking about, but the whole \"Indo-this Indo-that\" is easily one of the most solidly pinned down theories in lingustics, and the attestation of Hittite as Indo-European was first argued in 1915, by Bredrich Hrozny, and it has been strengthened substantially since then, \n\non a tangent, anyone who wants really good clear information on Hittite is well advised to check [this](http://www.utexas.edu/cola/centers/lrc/eieol/hitol-0-X.html) website out. Its managed by the linguistics deparment of the University of Texas and has extremely extensive information on the lingustics of the Anatolian languages\n\n1:36 **WHAT** Ok, I actually sorta get his theory but with the case of Indo-Europeans the genetic spread is pretty well tacked down as well. There were multiple migrations and that sort of cultural spreading definitely did occur, but to say that it was entirely cultural spread with little actual population movement, is demonstrably[ false](http://www.nytimes.com/2015/06/16/science/dna-deciphers-roots-of-modern-europeans.html?_r=0) on multiple levels, especially with the Yamnaya culture. Weirdly enough, he cites the Indo-Aryans as the only group where genetics are the main factor when they are one notable group where that is highly contreversial, as[ this](http://www.sciencedirect.com/science/article/pii/S0002929711004885) study says for example\n\n02:10 TIL literally every form of archaeological dating doesn't exist. Well, the more ya know.\n\n02:36 Oh wonderful that we only cite one source for all our historical needs! \n\nAs for the statue, it is a fake!!!...because the original is in the museum of [Ankara] (http://l7.alamy.com/zooms/ffa45d1081d54e298f33fbac04911a30/hittite-period-anatolia-archeologic-museum-ankara-turkey-a0n7yr.jpg) *best image I could find of the exhibit, sorry for the watermark*\n\n02:49 Weird af pronounciation, but I will let it slide because the bronze age is a nightmare for pronounciation.\n\n2:58 Pictographs aren't a thing, stop trying to make them a thing. Hittite hieroglyphs are primarily logographs. [Here](http://www.caeno.org/origins/papers/KlockFontanille_LuvianHieroglyphs.pdf) is a good article on Hittite writing systems\n\n03:57 What even is \"pure evidence\"?\n\n05:00 Nice one friendo on killing that Anatolian Indo-European thing, first real good thing you've said so far\n\n05:40 Sumerians were not Chaldeans, about as related as Celts and Koreans. Sumerians were extinct as a people before even the first reference to the Chaldeans in texts c.10th century bc. That is literally over a *millennium* apart.\n\n05:49 Sumerians were black/dark-skinned too, everyone is black!\n\nIn retrospect, not as much abysmal bad history as I expected, but still pretty nasty. If people like how I do these I might tackle some more Bronze Age nastiness in the future as well, probably even more from the same author.\n",
        "created_utc": 1454365266,
        "upvote_ratio": ""
    },
    {
        "title": "Bad Frankish Military History Part One, or how ByzantineBasileus has a warrant for his capture in three states.",
        "author": "ByzantineBasileus",
        "url": "https://www.reddit.com/r/badhistory/comments/43o8st/bad_frankish_military_history_part_one_or_how/",
        "text": "Two Badhistory reviews in one day? This has to be a record. A record of what I am not sure yet. The futility of the human mind trying to comprehend a universe without compassion or purpose? The perils of ambition and hubris? Either way, onwards I press. The subject of today's review is the Enemies of Rome - The Franks:\n\nhttps://www.youtube.com/watch?v=NBHahcN68Jg\n\nThe greatest difficulty is choosing what to imaginarily drink, since technically my blood  consists solely of tequila right now. The Franks were a Germanic people, so I have chosen Bärenfang, a type of Honey Liqueur. It sounds like \"Bear Fang\", which accurately describes its soon-to-be impact upon my health. Since this is a long documentary, I am not going to be able to tackle every mistake and have to divide it into two parts. Nonethless, let us begin!\n\n0.11: This has to be the quickest an example of badhistory has ever appeared in a documentary. The date is 300 AD. At this point in time a Roman legionnaire would look like this:\n\nhttps://s-media-cache-ak0.pinimg.com/736x/5a/c2/9e/5ac29ea988abac433d119f5572364335.jpg\n\nThe ones in the documentary.....don't. To begin with, their shields, javelins and helmets are completely anachronistic. They are more suited to the early Imperial Period, around 100 AD. This is like filming a movie set during the Vietnam War and having all the American soldiers dressed as late 18th century militiamen. Second, they have no armour. A Roman soldier would have been wearing either maille or scale by the 4th century if they were part of the legions, going unarmoured only if they were auxiliaries or part of an operation that required mobility rather than protection, such as on a raid. DRINK!\n\n0.16: That Frankish warrior has a Pompeii-style gladius, from around 100 AD. Now, by itself, a Frank using Roman equipment was very likely, but the Pompeii-style had really been phased out by 300 AD. Because of the influence of cavalry, the Romans had started adopting the spatha as an infantry sword because of its longer reach. DRINK!\n\n0.19: From the position of Gaul, Germanic raiders came from the east, not the north. DRINK!\n\n0.41: It should be a law that any individual with a degree in history has to always wear a bow tie when at work or out in public.\n\n0.53: Okay, there is NO WAY IN HELL that kind of sword existed in 300 AD. A migration period sword would look like this:\n\nhttps://c1.staticflickr.com/5/4021/4691749625_3ce4843d26.jpg\n\nThat weapon looks late medieval with that cross-guard, perhaps a type XXI according to Oakshott:\n\nhttp://www.oakeshott.org/typo.html\n\nDRINK!\n\n1.03: The \"expert\" says the Franks were well known for a special type of sword they developed. This weapon was called the Francisca, which was noted for its particularly unsword-like quality. DRINK!\n\n1.28: I am willing to forgive all previous errors based on how awesome this re-enactment scene is.\n\n1.36: Seriously, it's really well made. It actually *feels* like a serious encounter between Romans and barbarians.\n\n2.01: That is a disturbingly accurate recreation of my last Rome 2: Total War game as the Arverni. \n\n2.10: Those metal shoulder-pads are not only ahistorical, but look like something from a Warhammer game. DRINK!\n\n2.28: Those Romans should be speaking with a British Received Pronunciation accent.\n\n2.28: And that's when hotdogs were invented.\n\n2.43: Narrator mentions fictional countries. DRINK!\n\n3.57: By this time (440 AD), many Franks had converted to Christianity. 56 years later the Frankish leader, Clovis, converted as well. They were compromising on their gods very rapidly. DRINK!\n\n4.51: Many pagans converted to Christianity in order to better integrate themselves into a larger cultural and trade network (Magyars and Scandinavians), as part of a marriage or diplomatic arrangement (Boris I of Bulgaria and Vladimir the Great of the Rus). Others converted because Christianity was a prestige religion, as well as because there were aspects of the faith more appealing than their existing pagan religion. DRINK!\n\n4.58: I think a dead person coming back to life rates higher. BAD THEOLOGY DRINK!\n\n4.59: \"Okay guys, I pulled out some old dust-cloths and fabric left over from sewing class. Just throw them and pretend you are barbarians. No one will be able to tell the difference\".\n\n5.16: Egypt was always much more prosperous than Gaul. DRINK!\n\n5.52: That armour is very anachronistic. It resembles are Lorica Hamtata which was used mainly the Republican period:\n\nhttps://www.battlemerchant.com/images/product_images/popup_images/hamata2.jpg\n\nMaille at the time would have looked like this:\n\nhttps://s-media-cache-ak0.pinimg.com/736x/16/63/a0/1663a09360de88a0608fb9ac2ce49427.jpg\n\nDRINK!\n\n6.06: False, all recorded descendents were Merfolk.\n\n6.08: Franks speaking their native language or cat coughing up a hairball?\n\n6.13: \"Shit, watch where you point that thing, dude!\".\n\n6.25: The bow-tie makes me want to trust every word he says.\n\n6.40: Someone on the film-crew really needs to get that cat medical attention.\n\n6.43: Yeah, that armour makes me want to punch something. It appears they stole it from the set of one of the Dungeons and Dragons movies. DRINK!\n\n7.20: That is NOT what a francisca looked like. The head was much smaller:\n\nhttp://farm1.static.flickr.com/232/466519717_d4a05597fa.jpg\n\nThe head shown looks like it came from a modern wood-axe:\n\nhttp://s7g3.scene7.com/is/image/ae235/28420_P?$p$\n\nSeriously, it's like they didn't even care. DRINK!\n\n7.40: The Battle of Chalons was fought on a large field, not a forest. DRINK!\n\n7.53: The only accurate thing about that sword is that it appears to be made of metal. The Huns used straight swords, not scimitars from Lord of the Rings. DRINK!\n\n8.05: Romans are fighting with the shorter gladius rather than the longer spatha. DRINK!\n\n10.15: I have never seen any historical examples of helmets like that from the period. Again, looks like a prop from a fantasy movie. I think I am just gonna ignore all the bad weapons and armour unless I see something that really bugs me. DRINK!\n\n10.42: The narrator treats the Franks like a video game civilization that is slowly building up its strength till it can become independent and conquer its neighbours. This is nothing more than imposing a meta-narrative and is amongst the worst kind of scholarly practice. DRINK!\n\n 10.58 Childeric neither stole power nor \"carved out\" a domain. The Franks were *legally recognized* federates (those who settled inside a territory in exchange for military service) within the Empire and merely filled the void left by the collapse of Roman central authority. Provincial administration remained intact and the Franks, like other Germanic peoples, tried to continue Roman traditions rather than over-turn them. DRINK!\n\n 11.32: The Visigoths were not barbarians. In fact, they were devout Arian Christians. DRINK!\n\n11.45: Just like every other culture. HOW COULD THEY!\n\n11.52: Horsemen are using stirrups, which was not adopted at this time in Europe (most scholars believe they common after the 7th century AD). DRINK!\n\n12.58: I'm not too well-versed on the history of architecture, but that house does not exactly scream \"5th century AD\" to me. DRINK!\n\n13.13: That sword is clearly late medieval: 15th AD century at least. DRINK!\n\n13.39: Much like Bill Clinton.\n\n17.51: \"BELLLLLLLOOOOOOQQQQQQQQ!\"\n\n18.49: Besides the armour, the other guy appears to be holding a falchion. In the 5th century AD. DRINK!\n\nAnd that is the end of Part One. I shall conclude with Part Two later this week!\n",
        "created_utc": 1454329908,
        "upvote_ratio": ""
    },
    {
        "title": "Mindless Monday, 01 February 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/43o5na/mindless_monday_01_february_2016/",
        "text": "Happy (or sad) Monday guys!\n\nMindless Monday is generally for those instances of bad history that do not deserve their own post, and posting them here does not require an explanation for the bad history. This also includes anything that falls under this month's moratorium. That being said, this thread is free-for-all, and you can discuss politics, your life events, whatever here. Just remember to np link all links to Reddit and don't violate R4, or we human mods will feed you to the AutoModerator.\n\nSo, with that said, how was your weekend, everyone?\n",
        "created_utc": 1454328052,
        "upvote_ratio": ""
    },
    {
        "title": "Bad Aztec History, or how ByzantineBasileus escaped laboratory containment.",
        "author": "ByzantineBasileus",
        "url": "https://www.reddit.com/r/badhistory/comments/43nlgq/bad_aztec_history_or_how_byzantinebasileus/",
        "text": "Greeting Badhistoriers! This is my final review of the Ancient Warriors series. Do not worry though, it is certainly not my last. There are still a large number of documentaries and shows about ancient and medieval warfare, and I plan to do two more this week. But for today, I am focusing my attention upon Ancient Warriors, Episode 15: The Aztecs:\n\nhttps://www.youtube.com/watch?v=x057uI6p3Dk\n\nNow, I would certainly like to have a traditional Aztec alcoholic drink like Pulque to consume, but ever since that incident with Helen of Troy, a jar of jam and a butt-plug, I have been banned by the Council of Non-Linear Sentients from using my time machine for at least 3 Galactic Rotations. Since my sources assure me that the Aztecs were probably somewhere in Mexico, I have some Tequila to assist me in my journey. So let us being!\n\n1.15: I could be screaming out \"AMERICA WAS NOT DISCOVERED! THERE WERE ALREADY PEOPLE LIVING THERE!\". Fortunately, I am not an idiot. On a global scale it certainly was a discovery. The continent of America was unknown to the rest of the world at this time, and finding the region impacted both Europe and America in monumental ways, the least of which was the Colombian Exchange.\n\n 1.23 - 1.39 : The narrator's comments has just caused me to head-desk so hard I think I broke my one of my spines. There were a VAST array of peoples in the Americas, ranging from complex, urban-based societies to hunter-gatherers. Besides the Aztecs you had the Incas, Mayas, Tarascans, the Mapuche, the Chachapoya, the Pueblo cultures, the Mound Builders of Mississippi, the Five Nations and the Hupa. To assume that every single male born within these different societies was expected to be a warrior, and that every single civilization waged war to acquire sacrificial victims is an act of cataclysmic ignorance, at the very least. DRINK!\n\n1.58: The fact that the artefacts look like the Aztec version of the Annoying Orange makes the constant cut-aways look hilarious, not foreboding.\n\n2.32: Only a small proportion of the expedition of Cortez were mounted, so it is more accurate to say they *marched*. Also, the valley was named Anahuac, or Land Between Waters, not the Shadow of Death. DRINK!\n\n2.50: The Aztecs did not have a kingdom. Their state was a coalition between three separate cities called the Triple Alliance, and was ruled by a Huey Tlatoani, or Great Speaker. The Huey Tlatoani was an individual selected by a council, and the ideology and function of this office was very different from that of a European-style king. DRINK!\n\n3.15: CONQUISTACEPTION!\n\n3.30: THEY WERE NOT RIDING! DRINK!\n\n3.48: Stained in infamy? According to whom? The narrator is obviously talking about blood, but to the Aztecs that was quite normal. DRINK!\n\n4.01. That statue either just had an orgasm or their first cup of coffee for the morning.\n\n4.23: People hated dubstep even back then.\n\n5.04: Once again, Terror the Chihuahua is used to spread chaos across the countryside.\n\n5.19: THE AZTECS NEVER THOUGHT THE CONQUISTADORS WERE GODS! WHY CAN'T THAT MYTH DIE ALREADY! The only source we really have for this is one of Cortes' letters to the Emperor Charles, and many historians think that Cortes merely misunderstood Aztec diplomatic rhetoric. DRINK!\n\n5.57: Okay, thanks to hipsters I cannot take those ear-plugs seriously anymore.\n\n6.34: The narrator keeps assuming Aztec = Tenochtitlan. There were two other cties involved in the creation of the empire, Tlacopan and Texcoco. Yes, Tenochtitlan became the senior power, but it was still a multi-polar affair. DRINK! \n\n6.42: Just because one was born an \"Aztec\" does not mean they were automatically a warrior. The Aztecs maintained a class-based society. You had the pīpiltin, or nobility, the macehualtin, or peasants, as well as pochtecah, who were merchants and tlacotin, or slaves. The training and up-bringing of such people varied based on their class. The macehualtin, although subject to some military training and conscription, were mainly agriculturalists in terms of function. If they were called away to fight too much than the farming system would be disrupted. Although there existed schools to train youths in warfare, this was mostly likely restricted to a certain proportion of the population since, as a subsistence-based society, the children of peasants were needed to work on communal farms. What the narrator really means when he refers to Aztec youth is the children of the nobility or the military orders like the Jaguar and Eagle Warriors. DRINK!\n\n7.11: The god Huitzilopochtli was not the \"model for every warrior\". Many Aztec nobles were trained in schools called calmecac, which had specific patron gods. Quetzalcoatl was also depicted as a soldier. Xipe Totec was also a deity of war. DRINK!\n\n8.20: Warfare was an important part of Aztec ideology, but it was hardly their life-blood. They were not so one-dimensional. Aztecs were also talented merchants, architects and artists, and warfare was often a just tool to achieve specific economic or political aims, rather than being an objective in and of itself. DRINK!\n\n9.16: Bows and slings were not really the weapons of \"warriors\", that is those who fought in close combat and attempted to acquire prisoners for sacrifice. Bows and slings were used by peasant levies as a prelude to fighting. If you look at the artwork depicting Eagle and Jaguar warriors, they used shields, mācuahuitl and spears. DRINK!\n\n9.30: The narrator is talking about a mācuahuitl, but the image is of an obsidian spear-head. DRINK!\n\n10.26: Worst advertisement for a fast-food restaurant ever.\n\n10.17: \"I call dibs on the wings, you guys can have one of the legs!\"\n\n11.32: Again, the Aztecs did not have a king. DRINK!\n\n13.16: The people of Meso-America did not lack the wheel, they just had no use for it. DRINK!\n\n13.29: If the priests were behind scouts and raiders they could not be marching ahead. BAD SPAITAL REASONING DRINK!\n\n14.45: There are no historical accounts of Aztec warriors being capable of self-powered flight. DRINK!\n\n14.55: Holy shit that has to be the worse re-enactment fight scene I have ever seen.\n\n15.40: \"And then erupted in a frenzy as they pounced\". Hehehehehehehehe.\n\n16.47: That footage is funny if you imagine the camera-man is being chased by a big spider.\n\n18.01: Much like my last girlfriend.\n\n19.17: Fuck it, I'm just gonna slam the rest of the bottle and call it a day.\n\nWell, that is it for the Ancient Warriors series. Thank God. There was still six minutes of the documentary remaining, but it was just a long \"Cortes = Quetzalcoatl\" monologue, and I just couldn't take it anymore. Stay tuned for my next review as I select a new series to examine!\n\nSources: \n\nAztec Warfare: Imperial Expansion and Political Control, by Roy Hassig\n\nConquest: Cortes, Montezuma, and the Fall of Old Mexico, by Hugh Thomas\n\nDaily Life of the Aztecs on the Eve of the Spanish Conquest, by Jacques Soustelle\n",
        "created_utc": 1454315310,
        "upvote_ratio": ""
    },
    {
        "title": "\"Well afghanistan has been at war for literally 3000 years, since the time of Alexander the Great.\" AKA \"I didn't pick up a history book, and am thoroughly ignorant.\"",
        "author": "Thoushaltbemocked",
        "url": "https://www.reddit.com/r/badhistory/comments/43k9on/well_afghanistan_has_been_at_war_for_literally/",
        "text": "[This comment.](https://np.reddit.com/r/worldnews/comments/43e27e/germanys_merkel_says_refugees_must_return_home/czhlocx)  \n\nWell well well, lookit what we got here. A clueless fuckrod decides to try their hand at history. Let's just break this down a bit.  \n&gt;for literally 3000 years\n\n#\n\n&gt;since the time of Alexander the Great\n\nAlexander the Great was born in [356 BC.](https://en.wikipedia.org/wiki/Alexander_the_Great#Early_life) That's roughly 2372 years ago, not 3000.  \n\nGoing ahead:  \n&gt;The tribes fight amongst themselves until an outside aggressor comes. Once the aggressor has left, they fight eachother again.\n\nUhhh...yeah, that's been true of a lot of other nations, not just Afghanistan, although the tone makes it suggest that Afghanistan is especially belligerent in this regard. Take, for instance, France. Soon after the [Hundred Years' War,](https://en.wikipedia.org/wiki/Hundred_Years'_War) in which the English were the aggressors:\n\n&gt; In France, civil wars, deadly epidemics, famines, and bandit free-companies of mercenaries reduced the population drastically.\n\nIf you think that I'm going too far back in history, well, that's fair game. After all, I'm actually supposed to consider events from as far back as 3000 years ago.  \n\nContinuing with the bad history:\n\n&gt;It's hard to compare Syria, or really anywhere in the middle east to Afghanistan.\n\nWhile that is true, it's not true in the sense that anywhere in the middle east hasn't had internal conflicts after outside military intervention. [Consider Iran, after the US organized military coup in 1953:](https://en.wikipedia.org/wiki/History_of_Iran#1953:_U.S._organized_coup_removes_Mosaddeq)  \n&gt;However the reforms, including the White Revolution, did not greatly improve economic conditions and the liberal pro-Western policies alienated certain Islamic religious and political groups. In early June 1963 several days of massive rioting occurred in support of Ayatollah Ruhollah Khomeini following the cleric's arrest for a speech attacking the shah.\n\n#\n&gt;Two years later, premier Hassan Ali Mansur was assassinated and the internal security service, SAVAK, became more violently active. In the 1970s leftist guerilla groups such as Mujaheddin-e-Khalq (MEK), emerged and attacked regime and foreign targets.\n\nOr maybe take into account Iraq, [after it achieved independence from the British in 1932.](https://en.wikipedia.org/wiki/History_of_Iraq#Independent_Kingdom_of_Iraq)\n&gt;Establishment of Arab Sunni domination in Iraq was followed by Assyrian, Yazidi and Shi'a unrests, which were all brutally suppressed. In 1936, the first military coup took place in the Kingdom of Iraq, as Bakr Sidqi succeeded in replacing the acting Prime Minister with his associate. Multiple coups followed in a period of political instability, peaking in 1941.\n\nOr why don't we just [consider Syria itself?](https://en.wikipedia.org/wiki/History_of_Syria#Independence.2C_war_and_instability)\n&gt;Syria became independent on 17 April 1946. Syrian politics from independence through the late 1960s were marked by upheaval.  \n\n(Note: I do believe colonialism is basically the act of an \"outside aggressor,\" hence I am including that in my examples as well)  \n\nI'm only just covering the tip of the iceberg here. There are [quite a few](https://en.wikipedia.org/wiki/Partition_of_India#Independence.2C_population_transfer.2C_and_violence) examples [other than this.](https://en.wikipedia.org/wiki/Nigerian_Civil_War)  \n\nTl;dr: There are a lot of countries who've suffered from internal conflict after military intervention by foreign aggressors, including ones in the Middle East. Also, Alexander the Great wasn't from 3000 years ago.  \n\nEdit: [Archived link.](http://archive.is/Si1Yl)  \n\nEdit 2: I'd like to thank /u/titich for pointing out the bad history in [this post](https://np.reddit.com/r/ShitRedditSays/comments/43jl8a/well_afghanistan_has_been_at_war_for_literally/) on SRS.",
        "created_utc": 1454265882,
        "upvote_ratio": ""
    },
    {
        "title": "Extra History - Justinian &amp; Theodora - VII: The Cracks Begin to Spread (Because I'm sick of hearing the saga of Belisarius)",
        "author": "ParallelPain",
        "url": "https://www.reddit.com/r/badhistory/comments/43ijgs/extra_history_justinian_theodora_vii_the_cracks/",
        "text": "So I've actually had a beef with Extra History ever since their crap of a series that was their Sengoku. Now they continue the story of \"The Last of the Romans, the great general whose accomplishments are all his own and whose defeats are all someone else's fault\" which I am incredibly sick of hearing. So I'm going to pick it apart.\n\nThis is the episode where all the blame gets thrown on John.\n\nIn the episode John appears *after* the siege of Rome is raised (all by Belisarius' genius last episode oh hoho). He is implied, though not stated as part of Narse's reinforcements. He is sent north to raid and leave no enemy stronghold behind him. This John disobeyed by leaving Auximus and Urbinus untouched while taking Ariminum, leaving two enemy strongholds between himself and Belisarius. John is at least shown that he could not have taken the towns even if he wanted to (he did try to take Urbinus) and it's admitted that John took Ariminum to force the Vitigis and the Goths to retreat to Ravenna.\n\nWhat's wrong here, and what Extra History lied about, is that when Belisarius sent John north, *the Siege of Rome had not been lifted.* By taking Ariminum on his own initiative, John actually **forced** Vitigis to lift the Siege of Rome and withdraw to Ravenna. Also unmentioned is John kicking Vitigis' uncle's ass in the field so badly no one dared come out to fight him. John seems to even have been Belisarius' right hand man.\n\nOh also, Narse's reinforcements had not yet arrived.\n\nSo what happened next? According to Extra History:\n&gt;So Belisarius sent swift messengers with words to John to abandon the town of Ariminum and rejoin the main Byzantine force. But John refused. And by twice not heeding Belisarius' orders, first by leaving uncaptured towns behind him, and then by refusing Belisarius' direct orders now, he found himself cut off, surrounded, and besieged.\n\nJohn was indeed besieged in Ariminum, but was this really what happened? Let's ask Procopius, our source on the subject:\n&gt;But it happened that Belisarius, as soon as the Goths had broken up the siege of Rome, had sent Ildiger and Martinus with a thousand horsemen, in order that by travelling more quickly by another road they might arrive at Ariminum first, and he directed them promptly to remove John from the city and all those with him, and to put in their place fully enough men to guard the city, taking them from the fortress which is on the Ionian Gulf, Ancon by name, two days' journey distant from Ariminum. For he had already taken possession of it not long before, having sent Conon with no small force of Isaurians and Thracians. It was his hope that if unsupported infantry under commanders of no great note should hold Ariminum, the Gothic forces would never undertake its siege, but would regard it with contempt and so go at once to Ravenna, and that if they should decide to besiege Ariminum, the provisions there would suffice for the infantry for a somewhat longer time; and he thought also that two thousand horsemen, attacking from outside with the rest of the army, would in all probability do the enemy great harm and drive them more easily to abandon the siege.\n\nSo what's the difference? **Belisarius did not order John to abandon Ariminum.** He ordered infantry to relieve John.  \nAncon is 5 days march from Rome (according to Orbis Database). Ildiger and Martinus is slowed by the fortress at Petra. They then took 3 days (a march that should have taken 2) between Ancon and Ariminum. This means they took AT LEAST 8 days between Rome and Ariminum.\nA direct march from Rome to Ariminum could be done in 6 days. Vitigis is slow due to supplies problems (says Procopius). But he's certainly not hampered by fortresses on his march.\nJohn decides not to leave Ariminum, but let Ildiger and Martinus take back Belisarius' 800 guards (leaving himself with 1200 cavalry and the garrison from Ancon). \"Not long after\", Vitigis arrives and begins the siege.\n\nNow why Procopius thinks Vitigis would ignore Ariminum and go back straight to Ravenna is beyond me because it makes no military sense. Ariminum is far too close to Ravenna to be left to the enemy. In any case Vitigis didn't.\nNote here now that normally Vitigis should have arrived at Ariminum before Ildiger and Martinus under normal conditions even if they started out from Rome at the same time, and in reality Vitigis had a head start. This means Vitigis must have arrived on Ildiger and Martinus' heels. This raises the possibility that John simply did not have time to withdraw from Ariminum. But far more likely John simply judged from the situation that the garrison from Ancon alone would have been inadequate and decided to stay behind with 60% of the cavalry (which from how the siege played out, might very well have been true). The timing perhaps also played a role, as the men from Ancon likely did not have time to adequately prepare the defenses.\n\nSo John chose to stay and valiantly held Ariminum against superior forces (according to Procopius!)\n\nSo to summarize. a) Belisarius did not order Ariminum abandoned, just John to leave with his cavalry (Extra History messed up, again). Belisarius intended to hold Ariminum. b) The relieve to Ariminum was late. (Extra History ignores this) c) John stayed behind with part of his original force to defend the city and gave back Belisarius' guards (Extra History ignores this). d) He defends the city well to Procopius' praise (Extra History also ignores this).\n\nI see nothing against John here. He simply made the (correct) judgement call in a rapidly changing situation when his commander was far away and did not have up-to-date information. His actions should be praised, damn it Extra History.\n\nExtra History then decides to skip directly to the council at Firmum. But let us not. The Siege of Rome was lifted on spring equinox. Given the speed of later development, the Siege of Ariminum would have began sometime within a month. Did Belisarius follow hot on Vitigis' tail? Did he maybe quickly move on Ariminum? Did he quickly do *anything*?\n\nNope. It was summer solstice before he left Rome. John had already been besieged for over two months. But at least Belisarius went straight to the Adriatic coast to threaten Vitigis' rear right? Or at least start investing the fortresses between Rome and Ariminum. Nope, he moved north to Clusium. Okay but at least from there he could cross the mountains and arrive at Ariminum from the North West right? Yes he could've but he...didn't. \n\nOh my mistake. Belisarius did do something. He divided his forces and sent men off to Liguria to take Mediolanum, far behind enemy territory that he would have no way of reinforcing.\n\nI'm sure Belisarius had his reasons. But by being in no hurry he must be held partly responsible for the desperation John found himself in. Now I will give Belisarius the benefit of the doubt. Perhaps he judged he needed time to prepare properly and more men to relief John. But I won't give Extra History for acting as if it was all John's own fault that he was being starved into submission.\n\nVitigis at the same time was not sitting idly by either. He sent forces to Auximus from where he can invest in Ancon (remember it was weakened). Belisarius likely moved south to counter this because the next we hear is him joining Narses at Firmum. Oh yeah this is when Narses appears. Get your chronology right damn it.\n\nAnyways resuming. Belisarius decided:\n&gt;It was tragic but he would not risk the whole army to save John from his insubordination.\n\nI just want to remind you that said insubordination from John over three months ago helped save Belisarius' ass at Rome. Of course part of this mud slinging is Procopius' fault too.\n\nAnd so they relieved Ariminum and they have to tackle the problem of Mediolanum. The problem that Extra History forgot to mention Belisarius created himself by sending those men north before he marched out of Rome.\n&gt;Belisarius wanted to focus much of the Byzantine efforts on relieving [Mediolanum]. Narses said this was inefficient, and he would take his forces elsewhere while Belisarius handled Mediolanum.\n\nReally? Let's ask the pro-Belisarius Procopius.\n&gt;Therefore, as my opinion that a part of the army ought to be sent to Liguria and [Mediolanum], but that the rest should instantly proceed against Auximus and the enemy there, in order to accomplish whatever God permits; and afterwards we should also take in hand the other tasks of the war in whatever way seems best and most advantageous.\" So spoke Belisarius.\n\nSo Belisarius wanted to focus on *Auximus* to the south, **not** Mediolanum to the north. And where did Narses want to focus?\n&gt;In other respects. General, no one could deny that everything has been spoken by you with truth. But that the emperor's whole army here should be divided between [Mediolanum] and Auximus alone I consider to be utterly inexpedient. It would not be at all unreasonable for you, on your part, to lead against these places such of the Romans as you yourself might wish, but we, on our part, shall take possession for the emperor of the territory of Aemilia, which the Goths are making the greatest effort to win for themselves, and we shall harass Ravenna in such a way that you will crush the enemy before you as you wish, while they are excluded from the hope of armies to support them. For if we should elect to join you in carrying on a siege at Auximus, the barbarians, I fear, will come upon us from Ravenna, with the result that we shall become exposed to the enemy on both sides and, being at a distance from our base of supplies, we shall be destroyed on the spot.\" Such were the words of Narses.\n\nNot leaving Ravenna unchecked seems reasonable. So where was Aemilia? Guess what. It's the land on the Via Aemilia, *the road between Ariminum and Mediolanum*. I'm sorry who wanted to focus on Mediolanum?  \nIt would appear then Narses wanted to put themselves in a position to support Mediolanum if necessary. So it was Narses who was the one in favour of working to relieve Mediolanum, not Belisarius. Belisarius, as was the case with relieving Ariminum, was the more cautious general and wanted to secure his rear first and leave Mediolanum to its own devices.\n\nAnd after some arguing, according to Extra History:\n&gt;So he consented to marching with Narses to Urbinus and secure the road to Ariminum before relieving Mediolanum...Shortly after reaching Urbinus, even though coming here had been Narses' idea in the first place, both John and Narses' decided that, eh, it was impregnable, and took off. Narses headed to Ariminum to threaten the Ostrogothic Capital (Ravenna), and John charged off into the countryside to make short work of Forum Cornelii and collapse another Ostrogothic province.\n\nOh really? According to Procopius, after the argument:\n&gt;Upon hearing this Belisarius sent Peranius with a numerous army to Urviventus with instructions to besiege it, while he himself led his army against Urbinus, a city of strong defences and guarded by a sufficient garrison of Goths (it is at a distance from the city of Ariminum of one day's journey for an \nunencumbered traveller), and as he led forth the army he was followed by Narses and John and all \nthe others.\n\n*It was Belisarius' idea* to march on Urbinus. John and Narses followed. And Procopius, don't give me crap about Belisarius wanting to concentrate. Mediolanum is in peril because he had sent troops north. Now he divided his forces between Urbinus and Urviventus.\nAccording to Procopius (who's still pro-Belisarius here), Belisarius thought he could cower Urbinus into surrendering by just showing up with a large army. Urbinus did not, and Belisarius wanted to assault the fortress. Urbinus had only one level approach, from the north. John had already tried before to take the place and failed. It was here, when Belisarius ordered an assault, Narses and John departed. Narses indeed moved to Ariminum to threaten Ravenna. What was he supposed to do? Urbinus would not (and did not) fall for many months. Had Vitigis captured Ariminum while the whole army was at Urbinus, they'd be trapped against the Adriatic. At least Procopius admitted as much. Extra History just ignored the whole reasoning.\n\nNow *after* Urbinus falls around winter solstice (by the way, Mediolanum has been under siege for months at this point). Narses sends John towards Caesena. John couldn't take it, so join up with Justinus, and together took Forum Cornelii and began working towards taking the rest of Aemilia. Where are Caesena and Forum Cornelii? On the Via Aemilia, the road to Mediolanum.\n\nPerhaps with Urbinus in his hands, Belisarius would now march to relieve Mediolanum right? Nope. He divides his forces, sending part of it to Firmum to invest Auximus, while he himself went to Urviventus (between Rome and Urbinus) with the main force.\n\nWho's working to relieve Mediolanum again? At best Belisarius ordered Narses and John to work towards clearing the road to Mediolanum while he secured the rear (if true this would be against what Procopius says). At worst, he wanted to abandon Mediolanum just like he wanted to abandon John and Ariminum. If so, then John and Narses disobeyed their commander in order to work towards the city's relief.\n\nSo Extra History just ignored or reversed the entire thing. Whether his actions were justified or not, Belisarius most certainly did not work towards relieving Mediolanum.\n\nOh yeah and the Burgundians had crossed sometime in 538 (they started moving before Belisarius left Rome), not just now (early 539) as Extra History says. According to Extra History, it was here someone from Mediolanum arrived at Belisarius' camp asking for help, saying the city was in dire straits. Belisarius was in or besieging Urviventus. We don't know which because Procopius doesn't tell us it fell, only implies it did. Either way on hearing the news, did Belisarius finally march north with the main Byzantine army to relief Mediolanum? Because, if Urviventus had fallen, the road between Rome and Ariminum was finally secured. Now he can finally confidently march to relief Mediolanum, right? Nope, he sent a token force. He himself is *still* going to march to Picenum (where Auximus is).\n\nSo **after half a year**, Belisarius only now decides to send a token force north. Why didn't he send one after Ariminum like he said he would, or after Urbinus? All the while Narses was busy keeping the Goths in Ravenna in check, and John was busy clearing the road to Mediolanum.\nThe force reach the Po River and were unwilling/unable to cross due to insufficient men *and boats*. They did not reach the city walls and suddenly became too chicken to fight. Damn it Extra History.\n\nThis is when, according to Procopius, John and Justinus would not move to support the march on Mediolanum without orders from Narses. Now let's just forget all the possible legitimate reasons that they might have needed Narses' orders, like say Justinus was magister militum and so Belisarius does not outrank him, or say John was a cavalry commander being ordered to secure ships on the Adriatic.\n\nBy horse relay, and depending on where John and Justinus was on the Via Ameilia the letters from them to Belisarius, to Narses, and then back to them would have taken about a week. Belisarius has decided to ignore Mediolanum and campaign in central Italy for *months*, only now deciding to send a token force when someone for the city told him it was about to fall. And after all this we'll instead throw all the blame on Mediolanum's fall on a week's delay on John.\n\nExtra History even accuse John of feigning illness. Procopius states clearly he fell ill while trying to secure boats on the coast.\n\nSo to recap. John saved Belisarius' ass at Rome, which Extra History doesn't mention. Belisarius did not order Ariminum abandoned contrary to what Extra History says, and John's heroics there was not mentioned. Belisarius was the one who put Byzantine troops and Mediolanum in danger at a time when there's no way he could have helped them. Belisarius did not move with speed to relief John, but instead campaigned around Rome and Picenum until Narses told him to go help John. Afterwards, Belisarius was the one in favour of securing the road to Rome and Picenum first. John and Narses are the ones trying to help Mediolanum. And after months of doing nothing to help the city, when he finally hears the city was about to fall, Belisarius does not march himself, but sent a token force. The token force was not too chicken to fight, they could not cross the Po River. And when the city fell in early spring of 539, after month of doing nothing to help the city, Extra History will just throw all the blame on John, the one person who had been actively fighting his way towards the city.\n\nProcopius' bias (he blames everyone but Belisarius) is bad enough. Fuck Extra History for smearing a lesser known but incredibly skilled cavalry commander who saved Belisarius' ass.",
        "created_utc": 1454233594,
        "upvote_ratio": ""
    },
    {
        "title": "Badhistory Universalis [EUIV]; The super raffle, the Day after Sweden [UTC 1900, around 6 hours and 30 minutes from this post]",
        "author": "PersianClay",
        "url": "https://www.reddit.com/r/badhistory/comments/43dwhx/badhistory_universalis_euiv_the_super_raffle_the/",
        "text": "Yet another EUIV game!, together with /r/thechapel .\n\n&gt;The world:\n\n* [Players](http://i.imgur.com/o1yJ40O.png)\n* [Countries](http://i.imgur.com/LnRAbmv.png)\n* [Religion](http://i.imgur.com/SO10x0C.png)\n* [Cultures](http://i.imgur.com/ntd8tko.png)\n* [Technologies](http://i.imgur.com/Lo2poKq.png)\n* [Development](http://i.imgur.com/8rYH6Sd.png)\n* [HRE](http://i.imgur.com/hXvk5Fm.png)\n\n&gt;Important Information:\n\n* You only need the base game, DLCs are shared by the host. (/u/PersianClay)\n* We usually play for 4 to 5 hours. (this can vary a lot)\n* The primary means of oral communication is once again Teamspeak as that part has worked great all around so far. Usually, server is ts.tuplay.se.\n* Please mention the country you're playing as in your nickname, i.e. \"notamacropus | Tunis\" or similar to make it easier for everyone.\n* Server will be Badhistory Universalis, password holyvolcano.\n* For the most current information and the \"join game\" option please join the chat room of the [bad history steam group](http://steamcommunity.com/groups/badhistory) before launch. This is the ONLY reliable way to join the game, so make sure you get in the group chat.\n \n* also if you are new, remember that we usually have a development limit, at around 300-400(uncertain for now, you will get to know when we start to pick our nations again!.\n\n* What will happen now? will the incas and Parguayans prevent Americas dream to form the UK? Will Sweden get too much of a mass and turn into a black hole and start consuming the earth? How much will we actually win in this super raffle!? FOLLOW NEXT ON THIS SESSION!!",
        "created_utc": 1454157111,
        "upvote_ratio": ""
    },
    {
        "title": "Saturday Studies, 30 January 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/43dtug/saturday_studies_30_january_2016/",
        "text": "Find a book you like? Read an intriguing article from JSTOR last week? Want to discuss and get recommendations for new books? This is the thread for it! Come one, come all, please let us know what you've been reading this week!\n\nNote: unlike the other two megathreads, this thread is *not* free-for-all. You are free to discuss books that you've read, articles you liked, and similar. But please save the personal updates for Mindless Monday! \n",
        "created_utc": 1454155420,
        "upvote_ratio": ""
    },
    {
        "title": "\"Italy valued cathedrals while Spain valued explorers. So worldwide, five times as many people speak Spanish than Italian\" - Neil Tyson",
        "author": "big_al11",
        "url": "https://www.reddit.com/r/badhistory/comments/43dncr/italy_valued_cathedrals_while_spain_valued/",
        "text": "[removed]",
        "created_utc": 1454150996,
        "upvote_ratio": ""
    },
    {
        "title": "All it takes is one four way election to bring down the US Electoral College",
        "author": "catsherdingcats",
        "url": "https://www.reddit.com/r/badhistory/comments/43coiy/all_it_takes_is_one_four_way_election_to_bring/",
        "text": "Put on your ice skates because we are going to be doing loops around Rule 2 (please give our ~~overlords~~ blessed mods a break and try not to break it yourselves!)! \n\nTo summarize, [here](https://np.reddit.com/r/imaginarymaps/comments/436qfi/2016_presidential_election_the_collapse_of_the/) is speculation of what would happen to the US party system and the Electoral College in the event of a four way race. OP's answer is that the two main parties would shatter into six main parties (and stay that way for the foreseeable future) and the Electoral College would be done away with, once and for all. Mind you, it is not until some serious speculation by another poster that Paul Walker [sic] would be elected president that the 12th Amendment and the legal processes therein are even discussed, much to the detriment of those in the discussion unaware of its existence.\n\nThe situation of more than two candidates receiving electoral votes, or receiving more a percent of the popular vote, is not uncommon in Presidential elections, i.e., the elections of 1824, 1832, 1836, 1848, 1856, 1860, 1892, 1912, 1924, 1948, 1968, 1980, 1992, 1996 and 2000. If I'm not missing any, this situation has happened in more than a quarter of all US Presidential races. There are different political reasons to why this happens, such as political party transition periods, but none of these have seriously threaten the two party system (maybe the parties themselves, but not the actual system) or the Electoral College (besides a little fine tuning).\n\nBONUS! When OP is given the example of the elections of 1832 and 1860, he replies:\n&gt;My point was people are getting really tired of it. And things have changed a lot since the 1800's.\n\nConsidering there were just as many of these election types during the 1900s as there were in the 1800s, and the fact the 2000s literally started with one, I don't think much has changed at all. ",
        "created_utc": 1454128890,
        "upvote_ratio": ""
    },
    {
        "title": "A friend of mine on Facebook put up this picture. I know it's not correct but I can't exactly articulate why. Could anyone help?",
        "author": "iraah9",
        "url": "https://www.reddit.com/r/badhistory/comments/439upi/a_friend_of_mine_on_facebook_put_up_this_picture/",
        "text": "[removed]",
        "created_utc": 1454089099,
        "upvote_ratio": ""
    },
    {
        "title": "Something different to round off the Moratorium's Memento Mori? R/videos falls flat concerning the beauty of Carl Sagan's spherical sayings. Sticks, shadows and sibilants.",
        "author": "ryhntyntyn",
        "url": "https://www.reddit.com/r/badhistory/comments/4388jy/something_different_to_round_off_the_moratoriums/",
        "text": "[Here's the video. Carl Sagan should remain awesome, but here he is not. He's as wrong as anyone else.](https://www.youtube.com/watch?v=0ZLI7WZZRJQ&amp;t=4m9s)\n\n[Here's the thread](https://np.reddit.com/r/videos/comments/436ynk/carl_sagan_showing_how_it_was_determined_the/)\n\nR5: It's bad history from the headline, \"Carl Sagan showing how it was determined the Earth was not flat thousands of years ago\" into the comments. Eratosthenes didn't determine the world was round. He knew it was round. His experiments weren't made to prove it was round, although they among others confirm it was. He did the experiement to determine the size of the earth. \n\nThe attributions vary, some say Pythagoras was the first to figure it out, some say Parmenides, and others Hesiod (a poet, of all people). By the 5th century BC the spherical earth theory was dominant, according to Dicks'  Early Greek Astronomy to Aristotle.  Plato taught without any justification that the earth was round.  There were of course still flat earth theories from prior writers in the time of Aristotle, he names Anaximenes and Anaxagoras and Democritus,  but he dismisses them and he himself said in de Caelo et Mundo Book II sections 13 and 14: \n\n&gt;Its shape must necessarily be spherical. For every portion of earth has weight until it reaches the centre, and the jostling of parts greater and smaller would bring about not a waved surface, but rather compression and convergence of part and part until the centre is reached. \n\nAside from this, there is reference given to the roundness of the shadow of the earth on the moon, the difference of stars in the northern and southern hemispheres, and the descriptions of a round earth with temperate, cold zones, and two frozen poles from his Meteorologica.  And in Meteorologica he writes throughout as if the roundness of the earth is a given. \n\nEratosthenes feat, was Impressive, Most Impressive. But he wasn't out to prove the earth was round, it was accepted by the Greeks that the earth was round.  \n\nTL;DR: Thousands of people who skimmed that TiL will now think that Ancient people also thought the world was flat until Eratosthenes and think Carl Sagan is the source. Boo!  \n\nSources: Dicks, D.R. (1970). Early Greek Astronomy to Aristotle. Ithaca, N.Y.: Cornell University Press. p. 68. pp. 74-78, p. 98\n\nPlato's Phaedo and Calder, William M. “The Spherical Earth in Plato's \"phaedo”  Phronesis 3.2 (1958): 121–125.\n\nAristotle's de Caelo et Mundo, Book II, section 13 and 14\n\nAristotle's Meteorologica, Book I Section 3\n\nEDIT: Good points from and shout outs to /u/boruno [..... here](https://np.reddit.com/r/badhistory/comments/4388jy/something_different_to_round_off_the_moratoriums/czheu05) and /u/derdaus [.....here](https://np.reddit.com/r/badhistory/comments/4388jy/something_different_to_round_off_the_moratoriums/czgwgix) for pointing out that whoever wrote the script was dipping into badhistory and Sagan just went with it. So that's another point for the don't mix disciplines unless you do it well theory. Also, bad religion",
        "created_utc": 1454062292,
        "upvote_ratio": ""
    },
    {
        "title": "The rain in Paris should not fall on the train",
        "author": "matts2",
        "url": "https://www.reddit.com/r/badhistory/comments/4382tu/the_rain_in_paris_should_not_fall_on_the_train/",
        "text": "Rick is waiting for Ilse. And because the Germans entering Paris was not sad enough and because losing your love was not sad enough [it had to rain.](https://www.youtube.com/watch?v=BEiDZ9Rgd3s) Not a drizzle, not a rain, [a gullywasher](http://2.bp.blogspot.com/-ekTU3pr3R-k/UgoGUrbRMQI/AAAAAAAACs0/yl8Hz88hseA/s1600/Rick+in+the+Rain+2.JPG) soaking his hat and trenchcoat. \n\nBut was it raining? [This propaganda film](https://www.youtube.com/watch?v=VcrxENPArDE) shows dry clothes and roads as the Germans march in. [All of these pictures](https://www.google.com/search?q=germans+enter+paris+1940) Google returns show try hair and roads and clothes. Now maybe it did rain, but I've not been able to find any source saying so or discussing the weather. So I am going to call it bad history.\n\n(It is possible that the film makes other factual errors.)",
        "created_utc": 1454058375,
        "upvote_ratio": ""
    },
    {
        "title": "9 Million: bad history obvious and subtle of the European witch hunts",
        "author": "pathein_mathein",
        "url": "https://www.reddit.com/r/badhistory/comments/435xdm/9_million_bad_history_obvious_and_subtle_of_the/",
        "text": "A bunch of [people are protesting](https://www.dnainfo.com/chicago/20160128/logan-square/witch-is-back-hex-logan-square-gentrification-but-real-pagans-are-confused) around my house, and reinvigorating an [60's socially conscious public theater meme](http://www.jofreeman.com/photos/witch.html) into an advocacy organization to fight \"housing insecurity, a lack of affordable housing and speculative development\" by dressing up in stereotypical witch garb and casting spells of bane and boon to affect that goal.\n\nFighting about gentrification is basically what Chicagoans do to make up for whatever sports teams aren't doing well that season, so there's no reason to get into that. But I do want to get into [The WITCH manifesto](https://books.google.com/books?id=KHxYZdQ5CXQC&amp;lpg=PA177&amp;ots=GQYnTzXvNd&amp;dq=Witch%20is%20in%20all%20women%2C%20everything%2C%20It%E2%80%99s%20theatre%2C%20revolution%2C%20Magic%2C%20terror%20and%20joy.&amp;pg=PA177#v=onepage&amp;q&amp;f=false):\n\n&gt;Witch is in all women, everything,\n\n&gt;It’s theatre, revolution,\n\n&gt;Magic, terror and joy.\n\n&gt;It’s an awareness that witches and gypsies\n\n&gt;Where the first guerrilla and resistance fighters\n\n&gt;Against oppression – the oppression of women,\n\n&gt;Down through the ages.\n\n&gt;Witches have always been women who dared\n\n&gt;To be groovy, courageous, aggressive,\n\n&gt;Intelligent, non-conformist, explorative,\n\n&gt;Independent, sexually liberated and revolutionary,\n\n&gt;(This may explain why nine million women Have been burned as witches)\n\n&gt;Witches were the first friendly-heads and dealers,\n\n&gt;The first birth-control practitioners, and abortionists,\n\n&gt;The first alchemists.\n\n&gt;They bowed to no man,\n\n&gt;Being the last living remnants\n\n&gt;Of the oldest culture of all –\n\n&gt;One in which men and women were equal\n\n&gt;Sharers in a truly cooperative society,\n\n&gt;Before the death dealing sexual,\n\n&gt;Economic, and spiritual repression\n\n&gt;Of the ‘imperialist Phallic Society’\n\n&gt;Took over and began to shit all over nature,\n\n&gt;And human life\n\n&gt;A witch lives and laughs in every women,\n\n&gt;She is the free part of each of us.\n\nMuch of this is that bog-standard unverifiable exaggeration that picking on seems hardly sporting since it's somewhat metaphorical. Also, I do not know what a \"friendly-head\" is (but in it's proximity with \"dealer\" gives me suspicions). But then there's:\n\n&gt;(This may explain why nine million women Have been burned as witches)\n\n[The wiki](https://en.wikipedia.org/wiki/Gottfried_Christian_Voigt) suggests this comes from some Olympic-grade back-patting from an Enlightenment historian. [\"no respectable historian supports {the 9 Million figure} anymore.\"](http://departments.kings.edu/womens_history/witch/werror.html). The actual figure is frightening enough, in the 50,000-100,000 range, and needs to be expanded to 'people' instead, since [it includes men](http://rationalwiki.org/wiki/European_witch-hunts), even if women were disproportionately accused, and doesn't include however many *trials* might have taken place.\n\nIf we were just picking on the figure, it would hardly seem the effort to rake across the subreddit (one would be too many, as they say), and it's clear that the modern heirs to WITCH are at least aware of some of the more nuanced issues of gender:\n\n&gt;\"We think of witches as historically being women (and some men) that were at the forefront of resistance against oppressive systems,\" Galimberti said.\n\n...but that's also the subtle bad history going on here. Echoing the WITCH manifesto (\"Witches have always been women who dared/To be groovy, courageous, aggressive,/Intelligent, non-conformist, explorative,/Independent, sexually liberated and revolutionary...\") the notion is the witches were the original progressives, and killed for it, just too damn cool for the Middle Ages. Like, well **any** political faction likes to consider itself, they were the ones who saw true in a dark time of misery. It starts to look a lot like The Chart, but with Imperialist Phalli in place of the Catholic Church and civil rights as opposed to technology.\n\nIt ain't necessarily so. Concession: trying to sum up any 200+ year, multi-national event into some sort of singular reasoning is impossible, so it is even likely that, someone, somewhere, thought \"I believe that woman to be a witch because her lifestyle disturbs the religious paradigms I adhere to!\" But the majority? Or the reason for it going on? [It's complicated](http://www.brianpavlac.org/witchhunts/wtheories.html) and without consensus. There's targeting the older, poorer women, but often enough [ younger women doing the targeting](http://www.salon.com/2005/02/01/witch_craze/). So the neuroses here are complex. WITCH, in making the murdered something more necessarily political, is a way to get at some of the more wild conspiracy theories (i.e. that there actually was some sort of pagan underground) without going full tin-foil, because all it takes is supposing some sort of special knowledge (old WITCH) or attitude (new WITCH) as the real reason.\n\nThere might be a way to use the history here to talk about resisting oppression, but this is not that way.",
        "created_utc": 1454022669,
        "upvote_ratio": ""
    },
    {
        "title": "\"Nazism Was A Far Left Movement With A Right Wing Paint Job\"",
        "author": "Em2pag",
        "url": "https://www.reddit.com/r/badhistory/comments/435vk9/nazism_was_a_far_left_movement_with_a_right_wing/",
        "text": "http://np.reddit.com/r/worldnews/comments/430j5j/sweden_to_expel_up_to_80000_failed_asylumseekers/czfdxba?context=3\n\nThis is my first Bad History post so please forgive any shortcomings on my part.\n\nIt seems as though this is a myth that just won't die:\n\n&gt;Nazi - Nationalsozialistische Deutsche Arbeiterpartei\nTranslation: National Socialist Germany Worker's Party.\n\nYes, The Nazis had the word \"Socialist\" in the title of their party, this obviously makes them Socialist right? And we all know that North Korea is a beacon of freedom and Democracy since its called \"The Democratic People's Republic of Korea\", right?... While there were socialistic leanings in the early years, after Hitler took over, Almost all of those in the party whom held those sympathies were purged in the \"Night of Long Knives\", including Strasser. While there were some Nazis that had Socialist sympathies (Goebbels), they never had any say in enacting Nazi public policy. Not to mention that Socialists, Communists, and other political leftists were largely oppressed during the Nazis rule.\n\n&gt;Yeah, super right-wing. 20th century fascism was left-wing tyranny with a right-wing paint-job. They co-opted social institutions and national pride - very right-wing things - for unity and support. But did they use that to limit government? Uphold a free market? \n\nI can only assume this guy is American (I am as well), but I could be wrong. There seems to be this whole idea going around that Left wing = means supporting more government and opposing capitalism while Right wing = supporting less government and free market capitalism. Never mind the fact that Anarchism, the ideology that opposes government, has been historically and currently a far-left and socialistic ideology, also ignoring the existence of right wing dictatorships like Franco, Pinochet, Marcos, etc. The whole Left/Right political dichotomy is in my opinion pretty heinous, but I think I should point out some historical context; the terminology emerged from the French Revolution, with the radicals sitting on the left and the conservatives and monarchists sitting on the right. The Nazis certainly were no champions of free market capitalism and certainly strongly favored a strong authoritarian state, but they certainly were no fans of labor unions (which they crushed), held conservative family values, strongly promoted militarism, etc. this classifies them as being on the Right. This is not to say that they can be equivocated to modern day conservatives, but to place them on the left (especially the far left) is pretty inaccurate.\n\nBut hey, I guess it's just the damn cultural marxist academia whom have twisted history.../s",
        "created_utc": 1454022002,
        "upvote_ratio": ""
    },
    {
        "title": "\"Nazism Was A Far Left Movement With A Right Wing Paint Job\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/435tx9/nazism_was_a_far_left_movement_with_a_right_wing/",
        "text": "[removed]",
        "created_utc": 1454021394,
        "upvote_ratio": ""
    },
    {
        "title": "The regular /r/india-bashing-Auragazeb discussion is back!",
        "author": "that_70_show_fan",
        "url": "https://www.reddit.com/r/badhistory/comments/435sto/the_regular_rindiabashingauragazeb_discussion_is/",
        "text": "[This whole thread.](https://np.reddit.com/r/india/comments/433au4/aurangzeb_his_shenanigans_and_the_whitewashing_of/) I am only going to talk about the OP's comments. \n\n&gt; If I can find out this much, in about half an hour of scanning the chapters on Aurangzeb, especially those pertaining to Hindu Temple destruction and Jiziya, then you can do much more in the case of a detailed analysis. \n\nOff to a very promising start! \n\n&gt; Yeah right, he passed a bigoted law, and just so it could not be implemented properly due to logistical issues, it did not cause any harm, and hence, it does not matter.\n\nThe author of the book never said it doesn't matter. In page 277, the author states: \n\n\"We may now turn our attention to some of the other measures of Aurangzeb which may be called \ndiscriminatory and show a sense of bigotry towards people professing other religions. **The most \nimportant were Aurangzeb's attitude towards temples, and the levying of jizyah.**\" \n\n&gt; The line implying that he only destroyed those temples or places of learning which planted subversive ideas, propagated by Brahmins, to placate the orthodox elements, is rank bullshit.\n\nThe OP says it is BS without providing any sources to corroborate his assertion. Where as there are multiple sources say otherwise.[1][2][3][4] \n\n\n\n&gt; Does the author imply that suddenly here, Aurangzeb was not orthodox ? Did Aurangzeb not read the Quran then? Did he not profess affection for the Sharia? Isn't the author contradicting himself from what he said initially, that he was a pious devout Muslim ? Make up you mind man.\n\nWhat kind of twisted assertion is this? The author never contradicted himself[page 274]: \n\n\"here is little doubt about his being orthodox in his beliefs. He was not interested in philosophical debates or in mysticism - though he did occasionally visit Sufi saints for their blessings, and did not debar his sons from dabbling in Sufism. It would be wrong, however, to see Aurangzeb's religious policy in a rigid framework, based on his personal religious beliefs. **As a ruler, Aurangzeb had to contend with many political, economic, social and administrative problems. While keen to ensure that the state did not violate the sharia, he could not forget the political reality that any policy which meant the complete alienation of the numerous and powerful Hindu nobles, rajas and zamindars would be unworkable.** \"\n\nAccording to the OP a pious Muslim cannot be a pragmatic one. \n\n&gt; Bravo. Just cause the imposition of Jiziyah did not lead to large scale conversion of Hindus, it was deemed futile and could be brushed off as a minor aberration.\n\nNo. As I quoted earlier, the author never claimed Jizya was a minor aberration, this was in the context of Jizyah failing to play a significant role in religious conversions. \n\n&gt; Thus, I think it has been much more than adequately established that in no way whatsoever it has been mentioned in NCERT history books, has it been mentioned that Aurangzeb was a bigot and was basically an Islamist Fundamentalist asshole.\n\nNop, not at all: \n\n\"We may now turn our attention to some of the other measures of Aurangzeb which may be called discriminatory and **show a sense of bigotry towards people professing other religions.**\"  \n\n1. Eaton, Richard M. \"Temple desecration and Indo-Muslim states.\" Frontline (2001).\n\n2. Katherine Butler Brown. “Did Aurangzeb Ban Music? Questions for the Historiography of His Reign”. Modern Asian Studies 41.1 (2007): 77–120.\n\n3. Asher, Catherine Blanshard. Architecture of Mughal India. Vol. 4. Cambridge University Press, 1992.\n\n4. Ahmad, Muhammad Basheer. The administration of justice in Medieval India. 1941.",
        "created_utc": 1454020978,
        "upvote_ratio": ""
    },
    {
        "title": "Moratorium Vote Results - The Moratorium is Over",
        "author": "Dirish",
        "url": "https://www.reddit.com/r/badhistory/comments/433pvp/moratorium_vote_results_the_moratorium_is_over/",
        "text": "The Vote results were as follows:\n\nVoting for Total Anarchy, Wehraboos, Leeaboos, and Saint Edwinius Rommel:\n\n - 24 votes \n\nVoting for continuing the Reign of Democratic Oppression, Silencing Minorities, and Sticking Your Fingers in Your Ears and shout, \"LALALALALALALA, I CAN'T HEAR YOU!\":\n\n- 8 votes\n\nThis means that the monthly moratorium is cancelled for now. We, your benevolent, and totally not oppressive, mods reserve the right to reinstate an Emergency Moratorium on subjects whenever ~~something pisses us off~~ a subject receives too many similar posts.\n\nFeel free to gloat, cheer, and celebrate below. Or alternatively moan, cry in anguish, and predict the End of Times for the sub.",
        "created_utc": 1453994582,
        "upvote_ratio": ""
    },
    {
        "title": "Time travelling Julius Caesar? It seems to be the most logical conclusion.",
        "author": "caeciliusinhorto",
        "url": "https://www.reddit.com/r/badhistory/comments/433pne/time_travelling_julius_caesar_it_seems_to_be_the/",
        "text": "[Here](https://www.reddit.com/r/DebateReligion/comments/42zs16/internet_atheists_and_sophisticated_theists/czf4or2).\n\nIt's from debate religion.  Inevitably. I'm not going to go into the Jesus don't real implications of the post that this is responding to, but let's look at the linked response itself:\n\n&gt; Best estimates put some gospels within 30 years of Jesus' death, with 1000s of manuscripts surviving from within 100 years of Jesus' death. This is hundreds of years closer and 1000s more manuscripts than about any other ancient historical figure, but nobody questions the existence of Julius Caesar or Plato.\n\nI'm not even going to go into the question of why nobody ever questions the existence of Caesar or Plato.  What I am going to do is point and laugh at the juxtaposition of \"within 30 years of Jesus' death\", \"hundreds of years closer... than about any other ancient historical figure\", and \"Julius Caesar\".\n\nYou see, the difference between Julius Caesar and Jesus (aside from the fact that one was [descended from a divinity](https://en.wikipedia.org/wiki/Julia_%28gens%29#Origin) and the other was a carpenter from Judea) was that we have documents about Caesar's life not only written during his lifetime, but written *by* him.  His *de bello gallico* was written while he was on the campaign in Gaul which he was writing about.  Even more of Plato's writings survive, though admittedly these were written sometimes significantly after the dramatic date of the events they purport to describe (though as far as I know the *Apology* is still thought to have been written relatively close to Socrates' actual historical trial).  \n\nOn the other hand, if the poster I quote is right, then Julius Caesar wrote *de bello gallico* 130 years after his own death, in which case I don't know what we're doing pissing about worrying whether or not Jesus Christ was the son of God. That's one hell of a wait for a resurrection, though.\n\n(As an aside, I can think of *loads* of ancient historical figures whom we have sources mentioning written during or soon after their lifetimes.  For instance, off the top of my head: Pericles (Thucydides), Euripides (Aristophanes), Socrates (Aristophanes again, then Plato and Xenophon within 30 years), Catiline (Cicero).  And that's not counting the ones whose writings we have themselves.  So even ignoring the hilariously badly chosen examples of the post, it's still a swing and a miss.)",
        "created_utc": 1453994493,
        "upvote_ratio": ""
    },
    {
        "title": "\"Theoretical History\"",
        "author": "JFVarlet",
        "url": "https://www.reddit.com/r/badhistory/comments/433pm3/theoretical_history/",
        "text": "I'm sure most of you probably though libertarian fringe 'history' was bad because of people like Thomas DiLorenzo, Confederate revisionism, etc. But this genuinely makes those look like very sensible accounts.\n\nI don't know how many of you have heard of Hans-Hermann Hoppe, but he's another of the oddballs at the Mises Institute. Mostly he writes about political philosophy and ethics, which r/badphilosophy have encountered a few times. [But now, he's decided to expand himself to history.](https://mises.org/sites/default/files/From%20Aristocracy%20to%20Monarchy%20to%20Democracy_Hoppe_Text%202014.pdf) In fact, he's decided to write something covering massive themes across hugely diverse places - the transitions from feudal aristocracy, to absolute monarchy, to democratic society (yes, this is already bad history because it's teleological, but unlike most who promote a teleological view, Hoppe thinks the aforementioned transitions are making society *worse*, and thinks feudal aristocracy is really great).\n\nHowever, Hoppe doesn't actually do 'history' as anyone else in the world understands it. He doesn't look at sources, or read books and articles, or anything like that (he makes precisely *three* citations in the entire 48-page essay; amusingly, the introduction by another person, which is 12 pages long, contains *four*). In fact, while he doesn't explicitly say so here, he doesn't even think facts are important - like much of the rest of the Mises crowd, Hoppe doesn't believe in empiricism, instead believing in 'praxeology' - the idea that the entirety of human activity can be explained by repeatedly spinning out 'logical' conclusions from your previous conclusions achieved in the same way, eventually tracing this back to one or two philosophical assumptions which they claim are 'axiomatic'. So no evidence necessary, in other words.\n\nSome of the bizarre claims in here include:\n\n&gt; Feudal lords and kings could only “tax” with the consent of the taxed\n\nYep, apparently feudal tax was actually optional. Hoppe bases this on some sort of supposed sanctity of land ownership idea - he says \"on his own land, every free man was as much of a sovereign\". Aside from anything else, he doesn't consider the obvious possibility that not everyone owned land.\n\n&gt; The idea of kingship by birthright was absent during early medieval times. To become king required the consent of those doing the choosing, and every member and every section of the community of electors was free to resist the king if it deemed his actions unlawful. In that case, people were free to abandon the king and seek out a new one.\n\nActually, the early medieval period is when this stops happening (in the few places where this hadn't ended already). See, for example, France and the 'Capetian Miracle'. In most places at the time it's not so much that succession is 'elective', but rather that it's so vague and uncodified that nobles have a pretty significant influence.\n\nThis is the best one of all. On how the transition from feudal aristocracy to absolute monarchy happened:\n&gt; The king aligned himself with the “people” or the “common man.” He appealed to the always and everywhere popular sentiment of envy among the “underprivileged” against their own “betters” and “superiors,” their lords. He offered to free them of their contractual obligations vis-à-vis their lords, to make them owners rather than tenants of their holdings, for instance, or to “forgive” their debts to their creditors, and could so corrupt the public sense of justice sufficiently to render the aristocratic resistance against his coup futile.\n\nYep, you read that right. Apparently absolute monarchy was installed by class war. And not even a Marxist-style bourgeois vs aristocracy class war, but instead a aristocracy vs peasants class war!\n\nMost of the pamphlet is simply unaddressable, simply because Hoppe is, for the most part, not even wrong. He's not so much giving an incorrect account of actual events as giving an account of made-up events that he thinks *should* have happened. I'll leave the bad philosophy and bad politics to their respective subreddits, but I'm sure people can discuss it below if they like.\n\nEDIT: By the way, [here's](http://www.demos.org/blog/12/31/14/hans-hermann-hoppe-libertarian-theoretical-historian) an article that manages quite a bit more patience with this than I did....",
        "created_utc": 1453994481,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts for Thursday, 28 January 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/43304j/thoughts_for_thursday_28_january_2016/",
        "text": "It's almost Friday everyone, and with that comes the newest latest of the Thoughts for Thursday Thread! Whoot whoot!\n\nHave any weekend plans? Found something interesting this week that you want to discuss? This is the thread to do it! This thread, like the Mindless Monday thread, is free-for-all. Just remember to np link all links to Reddit if you link to something from a different sub, lest we feed your comment to the AutoModerator. No violating R4!\n",
        "created_utc": 1453982453,
        "upvote_ratio": ""
    },
    {
        "title": "When did Antarctic exploration start becoming about the science? Were early explorers just in it \"for the firsts\"?",
        "author": "LitZippo",
        "url": "https://www.reddit.com/r/badhistory/comments/42xz0j/when_did_antarctic_exploration_start_becoming/",
        "text": "This is my first /r/Badhistory post, so sorry if it's a bit long winded. Brevity isn't my strong suit! I was reading through old /r/AskHistorians posts [and I found this answer](https://np.reddit.com/r/AskHistorians/comments/3g8nw6/did_the_british_empire_embark_on_any_expeditions/ctw0h2h) by Quickspore concerning the aim of early expeditions to Antarctica. This section in particular stood out to me-\n\n\"Regular visits didn't really begin until the 20th century when men like Scott and Shackleton were competing with other nations to collect \"firsts,\" like the first visit to the pole and first trans-Antarctic crossing. And they largely weren't studying flora and fauna (not much to find in the interior after all).\nIt wasn't until the end of the 1920s, when the so called heroic age of Antarctic exploration ended, that people started working on more scientific and systematic studies of the continent.\"\n\nI would completely disagree with the idea that early expeditions throughout the \"Heroic age of Antarctic Exploration (taking it from around the end 19th century to 1917)\" were not concerned with scientific studies in general and I think it does a great disservice to both the scientists who achieved, pioneered and forwarded the scientific knowledge of the Antarctic continent in so many ways during this time. Below I thought I would go through some of the more notable expeditions as well as less known ones that refute the idea that scientific exploration started *after* the end of the \"Heroic Age\"\n\n**The Discovery Expedition**\n\nIt's true that even before expeditions took off in force, the claiming of land in the Antarctic has been consistent aim for many. Early claims were primarily to seize valuable fishing waters, later expeditions did so out of genuine patriotism (such as Mawson) and some did as a way to drum up more support for their expeditions and ventures (such as Shackleton). Probably the most famous of the early expeditions- *The Discovery Expedition* led by Robert Falcon Scott was lauded as a \"Duel... Between England and Germany...An international race to the pole.\" by Markham, the organiser and chief supporter of the Expedition who saw the expedition as a revitalisation of British values. To Scott's credit however he paid little attention to claiming of land, and although his desire to explore and later claim the pole was what would immortalise him, his desire for both his expeditions to be scientific is to be commended and often overlooked in popular perception. \n\nThe five scientists aboard the *Discovery*, ranging from zoologists to geographers made incredible breakthroughs and discoveries in their two year stay in Antarctica. To quote my personal favourite museum *ever*, Discovery Point (seriously I have a season pass, it's great!)\n\n\"*Over ﬁve hundred new kinds of marine animals, spiders, shrimps, star and shellﬁsh were discovered. The expedition was the ﬁrst to sight an Emperor Penguin rookery and obtain an egg of the species. Many hundreds of miles of unknown coast, towering mountain ranges and glaciers were mapped. Invaluable magnetic measurements, auroral observations and seismic recordings were made. The body of work was massive when the research had been analysed and the Royal Geographical Society came to publish the results, ten large, weighty volumes were ﬁlled*\"\n\n**The Nimrod Expedition**\n\nThe contribution of Shackleton's Nimrod Expedition (or The British Antactic Expedition) were particularly outstanding, especially considering Shackleton's comparative lack of interest in the subject compared to Scott. Shackletons skill however was his uncanny ability to pick the right men for the job, and through his scientists Mawson and Priestley (more on him later), their contributions to the field of geology, biology, meteorology and glaciology lay the important foundations that future generations built upon. While much like the Discovery and the later Terra Nova expeditions, these important works were often overshadowed by the more headline-grabbing achievements, in this case Shackletons incredible journey to the \"furthest South\" or his other team's journey to the South Magnetic Pole. \n\n**The Scottish National Antarctic Expedition**\n\nMy personal hero is probably the best refutal to the idea that early Antarctic expeditions were all adventure and no science- William Spiers Bruce. An incredible scientific mind and one of Scotlands greatest pioneers, Bruce launched *The Scottish National Antartic Expedition* after a falling out with Markham over organisation of the *Discovery* expedition. Bruce had even accompanied early Dundee whaling fleets into Antarctic waters, desperate to conduct biological surveys and studies (he was unable to effectively however as he couldn't find a clean bucket onboard to take water samples. No really). The SNAE was one of probably the most successful, efficient and scientific expeditions of the heroic age, but often underreported and due to it's less exciting findings and overshadowed by the Discovery. The SNAE however established the first manned meteorological station in Antarctic territory, a massive range of specimens, findings and surveys and probably the most important- [the first photo of a man playing bagpipes to a penguin](https://upload.wikimedia.org/wikipedia/commons/d/dc/Scotiapiper.jpg).\n\n**The Terra Nova Expedition** \n\nFinally, another criminally underreported journey is that of \"The Northern Party\", a scientific party led by Victor Campbell that split off from Scott's second Expedition, the \"Terra Nova\" expedition to explore King Edward VII land while Scott made his attempt on the pole. Both Priestly (who was so vital to the scientific success on the earlier BAE) and his colleague George Levick conducted important geological and biological studies- Levick in particular collected vast observations and notes on the behaviour and biology of adelie penguins, and as of recently had been the only person to have observed a full breeding cycle at the Cape Adare Rookery, the largest Adélie penguin colony in the world. His observations about some of the bizarre sexual practices of the penguins were actually suppressed at the time and have only recently been republished. Their party's journey, which ended up with them stranded in an ice cave with almost no food or supplies for an entire winter, desperately trying to preserve samples and scientific data, is some of the most harrowing and incredible moments in Antarctic history. \n\n**Conclusion**\n\nI don't wish to rattle on, but I thought a look at only a few of the more notable expeditions would prove that these efforts were not simply land grabs or races to the pole for glory, fame and fortune. Make no mistake however, *they were also exactly that*. Explorers came to the pole seeking fame and fortune, be it by achievements or discoveries or findings. Many hid behind the claim of scientific study. Some, like Amundsen were shameless in their disregard for scientific study. Scott, on his final death march back from the pole, needlessly lugged kilos of samples and rocks back so as to prove that while his journey to the pole, although beaten by Amundsen, was a scientific expedition first and not a race. Despite this, the scientific findings were real and were immensely valuable, and I think it's important to remember the volumes of scientific data that scientists, often overlooked and underappreciated in their time collected, and the great hardships they went though to get such information that would be so valuable for us in the future.\n\nSources:\n\n*Antarctica: A Biography*- David Day\n\n*Williams Spiers Bruce: Polar Explorer and Scottish Nationalist* - Peter Speak (Contains bucket-related complaints)\n\n*An Unsung Hero: Tom Crean* - Michael Smith\n\n*The Longest Winter: Scott's Other Heroes* Meredith Hooper (this book is incredible and I would recommend it to anyone interested in Antarctica!)\n\n*Shackleton: by Endurance We Conquer* - Michael Smith\n\nThe quote from the Discovery Centre is in the museum itself, you can find it on their website [here](http://www.rrsdiscovery.com/index.php?pageID=104) however. ",
        "created_utc": 1453908791,
        "upvote_ratio": ""
    },
    {
        "title": "Was it only after The Age of Heroic Antarctic Exploration that scientific study took off in earnest? Were Shackleton and Scott just in it for \"firsts\"?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/42xwj5/was_it_only_after_the_age_of_heroic_antarctic/",
        "text": "[removed]",
        "created_utc": 1453907911,
        "upvote_ratio": ""
    },
    {
        "title": "Was it only after The Age of Heroic Antarctic Exploration that scientific study took off in earnest? Were Shackleton and Scott just in it for \"firsts\"?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/42xuis/was_it_only_after_the_age_of_heroic_antarctic/",
        "text": "[removed]",
        "created_utc": 1453907125,
        "upvote_ratio": ""
    },
    {
        "title": "Welcome to Wondering Wednesdays /r/badhistory's new weekly meta thread.",
        "author": "smileyman",
        "url": "https://www.reddit.com/r/badhistory/comments/42w8eq/welcome_to_wondering_wednesdays_rbadhistorys_new/",
        "text": "I can already hear the badhistorians crying out \"Don't we already have enough meta threads!?!\"\n\nNo. You can never have too many meta threads . . . or something. \n\nWondering Wednesdays is the title of a series of weekly meta threads about history and the process of history. Rather than focus on specific examples of badhistory, or be a forum for open chit chat (e.g. Monday &amp; Thursday threads), it will be more about the meta.\n\nThis thread will be for the type of questions such as \"What's the worst history in a piece of media that you've ever seen?\", or \"What was the worst badhistory you were guilty of perpetuating yourself?\", etc.\n\n**Wondering Wednesdays** will also be a place to talk about historiography^1. We'll find room in various threads to talk about ways in which we can spot badhistory, even if we don't know a subject very well. \n\n(Stay tuned to this space, because other changes to our meta threads will be rolling out shortly . . .)\n\nSo, badhistorians, here's the inaugural **Wondering Wednesday** question:\n\n**\"At what point does the badhistory in a piece of media (be it movie, tv, book, papyrus or stone tablet.) make you throw up your hands in despair and give up on the subject?\"**\n\nAs a followup question:\n\n**\"Are there particular kinds of bad history that you have less patience with than others when it comes to your standards, and are there particular topics that you have shorter patience with than others?\"**\n\nPost your answers. If you'd like to submit ideas for future **Wondering Wednesdays** do that as well. We'll collect them and use them as inspiration for future posts. \n\n1.) For those of you who don't know--historiography is all about *how* we study history. It can include both the techniques of that studying, as well as how we view the past. A good example of a historiographical question/debate is over the type of history that should be written. Should we focus on biographies of great men more or focus on the masses? Are grand narratives possible to do? Are they even desirable? These types of questions fall under the rubric of historiography. ",
        "created_utc": 1453876729,
        "upvote_ratio": ""
    },
    {
        "title": "Cringeanarchy Charles DeGaulle was anti-fascist.",
        "author": "davydagger2",
        "url": "https://www.reddit.com/r/badhistory/comments/42vdgv/cringeanarchy_charles_degaulle_was_antifascist/",
        "text": "[removed]",
        "created_utc": 1453863474,
        "upvote_ratio": ""
    },
    {
        "title": "The vampire IRNV system was \"ahead of it's time",
        "author": "whatismoo",
        "url": "https://www.reddit.com/r/badhistory/comments/42s0xd/the_vampire_irnv_system_was_ahead_of_its_time/",
        "text": "[Here](https://np.reddit.com/r/TankPorn/comments/426aij/german_panther_1920_x_1080/cz8urfg)\n\n&gt;Stg. 44 with infrared scope... Brutal weapon. Far ahead of its time.\n\nA bit of background. The Zielgerät 1229 'Vampir' (Vampire) was a generation zero active infra red night vision scope for the Sturmgewehr 1944 (Stg-44). It consisted of an active broad spectrum IR emitter (a standard tungsten filament spotlight with a filter to emit only IR light) and an upper spectrum infra red receiver/ir-visible light converter mounted atop a standard Stg-44. This weighted about five pounds, increasing rifle weight to a bit over 16 pounds, roughly the same as three loaded M1 carbines, or two loaded AKM. This was then coupled with a 30lbs backpack battery for the spot light and a 5-10lbs battery in the gas mask container for the image converter. \n\nThis system entered service during the period of 1944-45. The first IR night vision devices were developed in the US by RCA in 1939. By 1942 the US army had tested tank mounted IRNV (infra red night vision) systems and found the technology promising but not mature enough for service. ^1 However this isn't the end of the story. The US developed and introduced the M1 and M3 IRNV scopes for the M1 carbine series which were manufactured in 1944 and saw combat action at Okinawa, and were refined and mass produced during the Korean war.^2 ^3 ^4  As best i can find, the M1 scope weighted ~5lbs, bringing rifle weight to ~10-11lbs, and the battery weighted 16-20lbs. I can't find any sources at the moment indicating that the ZG 1229 ever saw combat.\n\nOn the other hand, the British apparently developed a passive system for detecting IR beacons and active IR users, known as the Type K monocular or \"tabby\" which was issued to commando parties, possibly as early as 1939.^5\n\nThe ZG 1229 and T3 systems are broadly comparable, with them both being active upper spectrum infra red night vision devices powered by large and heavy battery backpacks mounted on rifles chambered in intermediate rounds.^6\n\n It is disingenuous to call the ZG 1229 \"ahead of its time\". It was very much of its time, and like other contemporary devices was limited by the low resolution, small battery life and storage capacity high battery weight and volume, short (&gt;100m/yds) range, and the general impracticality of strapping 5+lbs of crap to the top of your gun, putting on a 30-40lbs ruck, and trying to run around and shoot people in pitch black night only able to see via a night vision sight with a 2° field of view, and it doesn't even pick up body heat.^7 \n\nI'm really tired of people claiming that the Nazis were ahead of their time technologically. They weren't. Most of their supposed super weapons had severe flaws or limitations generally due to overengineering (tiger, tiger II, panther, maus), the Nazi system (see nuclear program), technical limitations (V-weapons, Jumo-004, [this](https://en.m.wikipedia.org/wiki/Bomber_B#High-output_aviation_engines_for_the_Luftwaffe) ), quality control (Tank armor, Me-163), and inherently flawed concepts (Bismark class's lack of dual purpose secondary armament, maus, Me-163, V3, Schwerer Gustav). They weren't ahead of their times, they were of their times. They get more billing and in the process the cool cutting edge technology of the allied powers gets ignored. \n\nMore generally I'd like to take offence at calling anything ahead of its time. Unless something was literally sent back in time, it is very much ahead of its time. Things can be cutting edge, or not fully realized until future research and development makes them more useful, case in point Hedy Lamarr's frequency hopping technique, a cornerstone of modern spread spectrum communications. There's no universal level of advancement in anything for things and anything past that is \"ahead of its time\". \n\nI'll end here, but I'll probably come back and clean it up since I'm on mobile\n\n1. [N. Moran, The Desert Sherman](http://worldoftanks.com/en/news/21/The_Chieftains_hatch_Desert_M4/)\n\n2. [I. McCollum M3 InfraRed Sniper Carbine](https://www.forgottenweapons.com/m3-infrared-sniper-carbine-at-ria/)\n\n3. [Rock Island Auctions, lot 3544 Dec. 5-7 2014 auction](http://www.rockislandauction.com/viewitem/aid/63/lid/3544)\n\n4. [Rock Island Auctions, lot 3673 apr 19-21 2013 auction](http://www.rockislandauction.com/viewitem/aid/58/lid/3673)\n\n5. IWM [link](http://www.iwm.org.uk/collections/item/object/30024747)\n\n6. .30 carbine/7.62x33mm from a 457.2mm barrel propels a 110gr fmj projectile with a muzzle velocity and energy of 1990 ft•s / 990 ft•lbf respectively, while 7.92x33mm kurz in a 419mm barrel fires a 125gr ball round at 2250ft•s and 1408 ft•lbf. A typical full power rifle rounds of the time such as .303 Mk.VII fired from a 640mm barrel would have a muzzle velocity and energy of 2440ft•s and 2300ft•lbf\n\nZ. Parsons, My Tank Is Fight, ISBN 0-8065-2758-7, p.48\n\nEdits: formatting",
        "created_utc": 1453822826,
        "upvote_ratio": ""
    },
    {
        "title": "Austria =/= Country CE 1700",
        "author": "Achierius",
        "url": "https://www.reddit.com/r/badhistory/comments/42qajs/austria_country_ce_1700/",
        "text": "[removed]",
        "created_utc": 1453789812,
        "upvote_ratio": ""
    },
    {
        "title": "Darwin the Lamarckian?!?! Minecraft and the Inheritance of Acquired Characteristics.",
        "author": "ManicMarine",
        "url": "https://www.reddit.com/r/badhistory/comments/42op6m/darwin_the_lamarckian_minecraft_and_the/",
        "text": "I saw [this comic](http://kmc.thecomicseries.com/images/comics/53/b155a84813a28c8f914b38a604236ad1543214201.jpg) on /r/Minecraft and don't ya know it just got my blood a boiling, as is the goal of minecraft comics. The comic repeats possibly **the** most common myth about Darwin: that he stridently opposed the idea that acquired characteristics could be inherited. So I thought I would make a short post debunking that idea. And for that we can do no better than turning to the writing of the man himself, from Chapter 5 of the first edition of *On the Origin of Species* (1859)\n\n&gt;I think there can be little doubt that use in our domestic animals strengthens and enlarges certain parts, and disuse diminishes them; and that such modifications are inherited.\n\nAnd later, in *The Variation of Animals and Plants Under Domestication* (1868), Darwin sought to teach us:\n\n&gt;how the effects of the long continued use or disuse of any part, or of changed habits of body or mind, can be inherited.\n\nDarwin didn't credit Lamarck by name because frankly it wasn't his idea, that idea had been circulating for at least a century by the 1850s, and was generally accepted. Darwin also didn't like Lamarck's theory of evolution, which was a lot more sophisticated than just inheritance of acquired characteristics and didn't even really rely on that process anyway. In fact the inheritance of acquired characteristics would remain mostly uncontroversial until the second generation of Darwinian evolutionists, working at the turn of the 20th century, who discovered Mendel, interpreted him in a Darwinian way, and started talking about genetics. Here I could go into a long rant about how Mendel wasn't actually all that interested in inheritance at all, and certainly had no concept of genetics, but that's another post.",
        "created_utc": 1453767298,
        "upvote_ratio": ""
    },
    {
        "title": "Mindless Monday, 25 January 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/42l08y/mindless_monday_25_january_2016/",
        "text": "Happy (or sad) Monday guys!\n\nMindless Monday is generally for those instances of bad history that do not deserve their own post, and posting them here does not require an explanation for the bad history. This also includes anything that falls under this month's moratorium. That being said, this thread is free-for-all, and you can discuss politics, your life events, whatever here. Just remember to np link all links to Reddit and don't violate R4, or we human mods will feed you to the AutoModerator.\n\nSo, with that said, how was your weekend, everyone?\n",
        "created_utc": 1453723251,
        "upvote_ratio": ""
    },
    {
        "title": "Future of the Moratorium",
        "author": "Dirish",
        "url": "https://www.reddit.com/r/badhistory/comments/42ig44/future_of_the_moratorium/",
        "text": "As you might have noticed, or not, we didn't have a moratorium on topics for the past three months. At this point it would be good to ask people if they're happy or unhappy with that situation, so we'll put it up for a vote. I'm loathe to put much more here lest I influence voting behaviour. So straight to the questions:\n\n**Do you think we need a moratorium?: yes or no**.\n\n**If you vote Yes**, let us also know in the comments under the option if you want to see some changes to the way we run it. Less frequent, exclude topics if they've been placed on the moratorium the month before, etc. etc. These are some ideas we had at some point, don't take them as the only options.\n\n**If you've voted No**, you can of course list your reasons, or if there are certain \nconditions when we need to bring it back.\n\n**If you vote \"I have no strong opinion on either choice\", you're a filthy neutral.**\n\n[edit - fixing some formatting and grammar]",
        "created_utc": 1453679017,
        "upvote_ratio": ""
    },
    {
        "title": "Bad Viking Military History, or how ByzantineBasileus needs to admit he has a problem.",
        "author": "ByzantineBasileus",
        "url": "https://www.reddit.com/r/badhistory/comments/42fws9/bad_viking_military_history_or_how/",
        "text": "Tomorrow I am starting the Work-for-Welfare programme that all job seekers have to engage in after a certain amount of time, and it is something I am quite looking forward to. It involves investigating various records and archives pertaining to the history of my home city, Perth, so not only will it keep me productive, it will also allow me to develop my skills since I usually work in a similar field. As I may be busy a good portion of this week, I thought now would be a good time for another Badhistory review. Today I am doing the favourite of Thoraboos everywhere, Ancient Warriors, Episode 11: The Vikings:\n\nhttps://www.youtube.com/watch?v=Lc225HP2psw\n\nInspired by the last episode about the Irish, I plan to have an imaginary bottle of alcohol specifically tailored to each culture. This time I have with me some nice Honey Mead. So put on your horned helmets, lash yourself to a dragonboat, and dive in with me!\n\n0.38: The episode begins with an artist adding illustrations to a newly written fantasy book.\n\n1.10: The last dragon died in 1037 BC, so they had been extinct for over 1700 years by this point. \n\n1.25: The \"Marauders from the North\" came from Denmark, Sweden and Norway, so at the most they would be marauders from the East if we take out starting position as being in Lindisfarne, Northumbria. DRINK!  \n\n1.27: There was no 'peace' to shatter. At the time of the raid on Lindisfarne in 793 AD, Northumbria had experienced a civil war between Eadwulf and Osred for the throne of the kingdom that had seen the birth place of history's greatest Marty Stu, Bamburgh, laid siege to. There were also frequent raids by the Picts into the region. DRINK! \n\n1.47: He just mentioned the Dark Ages. He. Just. Mentioned. The. Dark. Ages. THE DARK AGES! THERE WERE NO ACCURSED DARK AGES (I would have said G*ddamned, but I'm trying to follow the Seven Laws of Noah)!! In fact, there were many innovations, achievements and advancements in Europe during the 8th, 9th and 10th centuries. First amongst these was the Carolingian Renaissance, which included the creation of a script called Carolingian Miniscule that allowed standardized scholarly writing. Charlemagne also issued the Charter of Modern Thought 787 AD which saw the creation of schools to teach literacy. Alcuin of York, an individual active during this period, produced mathematical problems to be used in teaching, and another individual called Bede produced various works such as the Ecclesiastical History of the English People (props to u/Zaldax for his awesome posts). QUADRUPPLE DRINKS!\n\n1.54: To create the effect of chaos and destruction they had the camera move forward and knock over a candle. Who the hell thought that would be a good idea?\n\n2.00: Two minutes in and I'm already imaginarily drunk.\n\n2.23: White people were oppressing brothers even back then.\n\n3.10: The Vikings were the greatest sailors of their day? The Chinese had been using the stern-mounted rudder for over 600 years by this point, and the Tang Dynasty had invented paddle-boats. Mediterranean sailors were using lateen sails which had yet to be adopted by Northern Europe and allowed boats to sail against the wind. Likewise the Arabs and Indians had trade networks stretching across Eastern Africa and South Eastern Asia, places Europe only had the faintest idea about. The Vikings were obviously good sailors, but they were not the best, technologically or in terms of navigational knowledge. DRINK!\n\n3.12: Fiercest warriors! Oh man! Thorabooism rears its ugly head. Now, the Vikings were good fighters, but one must remember they were drawn from particular social classes: the karls (freemen) and  jarls (the nobility). These individuals were wealthy enough to provide their own equipment and often practiced a martial tradition influenced by constant blood-feuds and local insecurity, but only the richest had swords and maille. The average warrior had a spear, a shield, an axe and was unarmoured. However, you collect a number of these individuals and launch them against an agricultural society with a governmental structure based on personal relationship and where warriors are a minority scattered across various villages and manors, and of course they are going seem unbeatable from the perspective of a frightened peasant. When compared to more complex societies, they were severely outclassed. The Byzantines, Tang China, Persia and the Arab-Islamic world had long maintained standing forces with a plethora of military manuals and established tactical formations and manoeuvres. Their infantry alone had superior equipment and drilling to the average Viking, but when you include cavalry and their various forms (horse archers, kataphractoi, light horsemen), the Vikings are outclassed at every level. DRINK!\n\n3.35: The helmet and maille coif are far too early for the time period. It appears to be a chapel de fer or kettle-hat from the 14th century onwards, not the Viking Age. DRINK!\n\n3.52: \"Ivarr the Boneless\". Hehehehehehehehe.\n\n4.07: That image of Egill Skallagrímsson is from the 17th century and shows him with what appears to be a falchion and chapel de fer/kettle-hat. Describing it as anachronistic would be an understatement. DRINK!\n\n5.42: Death-Metal has always had its detractors. \n\n6.56: Same anachronistic image. DRINK!\n\n7.39: \"Warriors charge into battle shielded by Odin, god of war\". Odin was never used as a shield because they could never find a place to attach the handle.\n\n8.18: As opposed to those Viking poseurs who only got into it after it became popular.\n\n9.17: \"As boat builders these men were unrivalled\". Gahhhhhhh! See my previous comments on sailing. DRINK!\n\n9.37. I've said this many times but you CANNOT CHANGE HISTORY! There was no time-travel and no existing time-line to undo. You cannot alter what has not yet happened. BAD METAHISTORY DRINK!\n\n9.58: \"Such ships penetrated far up-river\". Hehehehehehehehe. \n\n10.18: \"They gave it names like Long Serpent\". Hehehehehehehehe.\n\n10.54: Absolutely false. Viking ships lacked the appendages required to tie knots.\n\n11.00: \"Against the swift longship there was no defence\". Except by other ships, such as the navy Alfred the Great constructed which defeated many Vikings at sea. DRINK!\n\n11.06: Now I have the image of several dozen Vikings leaping out of the bushes wearing party hats and crying out \"Happy Birthday!\".\n\n11.52: Not even the Vikings were crazy enough to play a game as destructive as Monopoly. \n\n12.03: \"For when a Viking just needs to look fabulous!\".\n\n12.11: Washed every Saturday? Well just look at Mr Fancy over here!\n\n13.59: That maille appears to be butted rather than riveted. Butted maille was never used as it split easily and was poor at defending against thrusts. DRINK!\n\n14.43: And as a perfect example of a Berserker, or Bear-Skin, they show us a wolf. DRINK!\n\n17.40: There is some debate over who founded Kiev. It seems it may have been an existing settlement prior to the arrival of the Rus. DRINK! \n\n18.02: IT IS THE HAGIA SOPHIA, NOT THE AYA SOPHIA! AT THE TIME IT WAS NOT A MOSQUE! IT WAS A CHURCH, THE LARGEST IN THE WORLD! IT IS NOT A MOSQUE NOW ANYWAY! IT IS A MUSEUM! THE WRITERS NEED TO BE EXECUTED! THEY SHOULD ASKHDHFDHFPIAYSWYPIYHEFHEBEASPOIUYQWIYFIGJCBMXNOFRHEHPORPOFLKDNFR......\n\n18.57: Recover from aneurysm.  \n\n19.18: That picture of Egill again. Also, he seems to be doing the Dreamworks eyebrow thing. DRINK!\n\n19.35: Does that belt-end hanging under the shield look like what I think it looks like?\n\n20.13: That guy on the left has no weapons or protection whatsoever.\n \n20.24: Not even that kind of camera effect can hide how badly staged this re-enactment scene is. \n\n20.29: \"Okay guys, you tap my shield with your weapon, and I'll do the same to you so it looks like we're busy.\"\n\n20.38: A guy has a kite-shield, which was not really used in 937 AD when the Battle of Brunanburh took place. DRINK!\n\n 20.59: The Normans were not Vikings. They were Normans, a settled, agricultural people that maintained heavy cavalry rather than infantry as their primary fighting style, were Christian and spoke a Romance-based dialect. DRINK!\n\n21.54: There are no accounts of Vikings using longships to travel to Mars. DRINK!\n\n24.03: So Phil Grabsky did all that? I WILL HUNT HIM DOWN AND CARVE OUT HIS HEART!\n\nThe next episode of the series I shall review will focus on the Aztecs, and I should hopefully have it done next weekend. See you then!\n\nSources\n\nAlfred the Great: War, Kingship and Culture in Anglo-Saxon England, by Richard Abels\n\nThe Carolingians : A Family Who Forged Europe, by Pierre Riché\n\nChina's Cosmopolitan Empire: The Tang Dynasty, by Mark Edward Lewis\n\nThe Early Chinese Empires: Qin and Han, by Mark Edward Lewis\n\nThe Vikings, by Mark Harrison, Keith Durham, Ian Heath, and René \nChartrand\n\nWarfare and Society in the Barbarian West 450-900, by Guy Halsall\n",
        "created_utc": 1453643269,
        "upvote_ratio": ""
    },
    {
        "title": "The aboltion of slavery, destroyed Jamaica. Seriously.",
        "author": "spinosaurs70",
        "url": "https://www.reddit.com/r/badhistory/comments/42er0w/the_aboltion_of_slavery_destroyed_jamaica/",
        "text": "Someone decided to write a [apologetic](http://www.donotlink.com/framed?839352) on slavery ...Bizarrely on jamica.\n\n(Note to Mods, I used donotlink.com to not support the racist webiste. I hope this fits this subreddit's policy. If it does not , I will remove the link.)\n\n&gt;Whenever I hear libertarians prattle on about the superiority of free labor over slave labor, I roll my eyes because the poor dears know nothing about history, or mangle history to justify their theories.\n\n\nYes,I'm tired of people arguing for paid labor. Why don't they learn about the efficient method of labor exploitation known as slavery! \n\nIn all seriousness ,there is quite a [academic debate](http://www.economist.com/blogs/freeexchange/2013/09/economic-history-2) on the effect slavery had on economic growth across the world  &amp; how ''successful'' it was for the local economy. \nPersonally,from what I can tell from the article  most studies seem to ignore the fact [half](https://books.google.com/books?id=dDWq5ThDC3QC&amp;printsec=frontcover&amp;dq=slavery+in+brazil&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwjT4ZXMycHKAhVI8WMKHS_eBLgQ6AEIHTAA#v=onepage&amp;q=ambience&amp;f=false) of slaves in the antebellum south &amp; 19th century Cuba &amp; Brazil did not live on plantations . However from what I have read a good majority of Jamaican slaves worked on large plantations owned by absentee landlords,anyway. \n\n\n&gt;Here’s further evidence from Ian Thomson’s The Dead Yard that slavery was superior to freedom:                                       \n\n  now  cite  a source that does not even prove your point! \n\n&gt;By the 1860s – thirty years after emancipation – many Jamaican plantations had turned to scrub as the owners were unable to compete with the cheap sugar produced by Cuba and Brazil. Jamaica had become a patchwork of ramshackle, half-evacuated farmsteads, where rumours of re-enslavement (associated with the possibility of Jamaica joining the United States as a slave state) were rife.”\n\nWell Jamaica joining the United states as a slave state would make for a great alternative history timeline or novel. Were you could see the contrasts in the two slave societies , &amp; it would certainly make for a interesting  alternative civil war.I don't know anything   particularly  historical wrong in that statement.\n\nWhat I find wrong and particularly  morally revolting is his belief that the economic decline of Jamaica  after abolition was worse than slavery for the general population.NO,NO,NO,No!\n\n*The majority of population was enslaved([ more than 10 slaves to every free person](https://books.google.com/books?id=JrMyBQAAQBAJ&amp;printsec=frontcover&amp;dq=200,00+slaves+jamaica&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwj6gJ6p2sHKAhVW62MKHXo8CogQ6AEIIjAB#v=snippet&amp;q=slave%20ratio%20jamica&amp;f=false)) unlike the Antebellum south(excluding Mississippi &amp; south Carolina)\n\n- The slaves had [high mortality rates](https://books.google.com/books?id=JrMyBQAAQBAJ&amp;printsec=frontcover&amp;dq=200,00+slaves+jamaica&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwj6gJ6p2sHKAhVW62MKHXo8CogQ6AEIIjAB#v=snippet&amp;q=early%20death&amp;f=false).\n\n-This along with low birthrates , &amp;  this lead to\n\n-   A need for the  continuous importation of slaves to refresh the slave population, thus continuing the grisly process. \n\nSo yeah, I think Jamaica was better after abolition. \n\n(Note: I did find some interesting [data]( https://books.google.com/books?id=AXQ5FCnHWnEC&amp;pg=PA71&amp;lpg=PA71&amp;dq=small+slave+holdings+in+jamaica&amp;source=bl&amp;ots=SpUxGWs3ML&amp;sig=Mejv4os0PDvUPKXafgI9zqpMioI&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwifieXf2MHKAhVO22MKHab9Dg0Q6AEIIDAA#v=onepage&amp;q=small%20slave%20holdings%20in%20jamaica&amp;f=false) on small scale slavery in Jamaica.\n\nEdit: I did find [some evidence](https://books.google.com/books?id=Uts5CgAAQBAJ&amp;pg=PT24&amp;dq=small+slave+holdings+in+jamaica&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwi32vHd3cPKAhVP12MKHQHcBjcQ6AEIODAC#v=onepage&amp;q=small%20slave%20holdings%20in%20jamaica&amp;f=false) that half of slaves did not work on sugar plantations on Jamaica. i'm Curious about  mortality rates on these  given the huge ones we see on sugar plantations. \n\n\n\n",
        "created_utc": 1453614006,
        "upvote_ratio": ""
    },
    {
        "title": "Neil DeGrasse Tyson has a hot take on why Spanish is popular.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/42epge/neil_degrasse_tyson_has_a_hot_take_on_why_spanish/",
        "text": "[deleted]",
        "created_utc": 1453613226,
        "upvote_ratio": ""
    },
    {
        "title": "Badhistory Universalis [EUIV] ; WHO WILL WIN THE GRAND PRIZE IN THE RAFFLE!? [UTC 1900, around 6 hours from this post]",
        "author": "PersianClay",
        "url": "https://www.reddit.com/r/badhistory/comments/42aqpk/badhistory_universalis_euiv_who_will_win_the/",
        "text": "Yet another EUIV game!, together with /r/thechapel .\n\n&gt;The world:\n\n* [Players](http://i.imgur.com/o3XNrMd.png)\n* [Countries](http://i.imgur.com/duntAQh.png)\n* [Religion](http://i.imgur.com/4UIwDjO.png)\n* [Cultures](http://i.imgur.com/uFmsaaU.png)\n* [Technologies](http://i.imgur.com/kDU4QE8.png)\n* [Development](http://i.imgur.com/HMMHE2m.png)\n* [HRE](http://i.imgur.com/bcJPhLM.png)\n\n&gt;Important Information:\n\n* You only need the base game, DLCs are shared by the host. (/u/PersianClay)\n* We usually play for 4 to 5 hours. (this can vary a lot)\n* The primary means of oral communication is once again Teamspeak as that part has worked great all around so far. Usually, server is ts.tuplay.se.\n* Please mention the country you're playing as in your nickname, i.e. \"notamacropus | Tunis\" or similar to make it easier for everyone.\n* Server will be Badhistory Universalis, password holyvolcano.\n* For the most current information and the \"join game\" option please join the chat room of the [bad history steam group](http://steamcommunity.com/groups/badhistory) before launch. This is the ONLY reliable way to join the game, so make sure you get in the group chat.\n \n* also if you are new, remember that we usually have a development limit, at around 300-400(uncertain for now, you will get to know when we start to pick our nations again!.\n\n* Will Tunisia devour the entirety of North America and Europe? Will Malay finnaly stop blobbing it all purple? Vill [Tunisia keep splitting up USA in the most horrid way possible?](http://i.imgur.com/9iFYHPS.png) FOLLOW NEXT ON THIS SESSION!",
        "created_utc": 1453553737,
        "upvote_ratio": ""
    },
    {
        "title": "Saturday Studies, 23 January 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/42almz/saturday_studies_23_january_2016/",
        "text": "Find a book you like? Read an intriguing article from JSTOR last week? Want to discuss and get recommendations for new books? This is the thread for it! Come one, come all, please let us know what you've been reading this week!\n\nNote: unlike the other two megathreads, this thread is *not* free-for-all. You are free to discuss books that you've read, articles you liked, and similar. But please save the personal updates for Mindless Monday! \n",
        "created_utc": 1453550448,
        "upvote_ratio": ""
    },
    {
        "title": "A good exploration of Confederate history, nope just more lost cause bad history but now in convenient list format!",
        "author": "spinosaurs70",
        "url": "https://www.reddit.com/r/badhistory/comments/429lty/a_good_exploration_of_confederate_history_nope/",
        "text": "There seems like there is a lack of civil war/slavery bad history  on this subreddit.\n\nSo let's take look at  this wonderful piece of [confedrate apolgetics](https://www.libertariannews.org/2010/08/13/if-we-never-fought-a-civil-war/).\n\n\n&gt;-Confederate General Robert E. Lee was an abolitionist. Lee called slavery “a moral and political evil.” He also said “the best men in the South” opposed it and welcomed its demise.'\n\nYes, a man who [purposfuelly tried not to free slaves](https://en.wikipedia.org/wiki/Robert_E._Lee#Late_1850s:_Arlington_plantation_and_the_Custis_slaves) was an aboltionist. Thanks for that new fact!\n\n\n&gt;-Union General Ulysses S. Grant and his wife held personal slaves before and during the War Between the States. Grant’s excuse for not freeing his slaves was that “good help is so hard to come by these days.”\n\n&gt;-Union General Ulysses S. Grant and his wife held personal slaves before and during the War Between the States. Grant’s excuse for not freeing his slaves was that “good help is so hard to come by these days.”\n\nUlysses grant freed the only slave he had owned in [1859](https://en.wikipedia.org/wiki/Early_life_and_career_of_Ulysses_S._Grant#Civilian_life), and by [1863](https://en.wikipedia.org/wiki/Early_life_and_career_of_Ulysses_S._Grant#Civilian_life) supported the full abolition of slavery. \n\nHe was not &amp; never was  an apologist &amp; slave owner during the civil war.\n\n\n\nI'm probably writing another post on this piece of work, but I got bored. \n\n\n",
        "created_utc": 1453527540,
        "upvote_ratio": ""
    },
    {
        "title": "In which a single mistake in one sentence describing a speaker during the final hours of Jonestown's existence leads to some very unfortunate implications.",
        "author": "cordis_melum",
        "url": "https://www.reddit.com/r/badhistory/comments/4278gz/in_which_a_single_mistake_in_one_sentence/",
        "text": "I am doing a number of personal projects, and one of them is reading books about Peoples Temple, especially earlier historiography, in order to determine how research on the topic has changed over time and how cultural memory has both shaped and is shaped by what people write in history books.\n\nOne of the books that I had the pleasure to read from my university library is *Our Father Who Art in Hell* by James Reston, Jr, published in 1981. This book, obviously, has biases, but one claim in the book stood out to me the most and has been bothering me for almost an entire month.\n\nIn a chapter about Peoples Temple seeking possible refuge in Russia, the author references Q042 (aka “the death tape”) in a “reconstruction” of the final debate before the community drank (or were forced to drink, or were injected with—we honestly don't know, and we're still debating whether everyone was actually murdered or whether most of the adults committed suicide) cyanide-laced Flavor-aid and extinguished itself. The reconstruction starts with this:\n\n&gt; From the assembled, a sixty-one-year-old white woman, Christine Miller, rose. (p. 200)\n\nThis seems innocuous enough, right? \n\nWell, no. It's not. It's wrong, or we wouldn't be here talking about it. But you might not realize just *how* much fail is loaded in that one sentence, especially if you were new to the topic and have never heard or seen a picture of Christine Miller. Well, I'm going to fix that.\n\n[This is Christine Miller.](http://jonestown.sdsu.edu/WhoDied/bio.php?Id=555) Take a look at this, and then go back and reread that sentence, and let the horror dawn upon you as you realize how badly Reston screwed up.\n\nYes, he white-washed a sixty-year-old black woman and made her white. \n\nFor the record, Christine Miller is very important. She is the only person on Q042 who argues for the preservation of the community and against the suicides/murders. Also, here's a demographic factoid related to Peoples Temple: [68% of the Temple members residing in Guyana were black](http://jonestown.sdsu.edu/?page_id=35666). So, uh, this basically has some very unfortunate implications, besides the white-washing problem.\n\nI can hear you all yelling now. “But this was published in 1981! What if he didn't have access to passport pictures?”\n\nFirst of all, it's still stupid to assume a person's race, and you really shouldn't do that if you honestly don't know. Second of all, he did have access to passport pictures. There's an entire chapter about a woman named Jann Gurvich, and in that chapter, he describes her passport picture. Reston has no excuse. ",
        "created_utc": 1453492386,
        "upvote_ratio": ""
    },
    {
        "title": "\"The Holocaust didn't happen.\"",
        "author": "eaglesh1gh",
        "url": "https://www.reddit.com/r/badhistory/comments/421r5j/the_holocaust_didnt_happen/",
        "text": "[removed]",
        "created_utc": 1453406815,
        "upvote_ratio": ""
    },
    {
        "title": "Bad Irish Military History, or how ByzantineBasileus continues to walk through the Valley of the Shadow of Death.",
        "author": "ByzantineBasileus",
        "url": "https://www.reddit.com/r/badhistory/comments/4207rf/bad_irish_military_history_or_how/",
        "text": "Another day and another review of bad history is upon us. On this occasion I turn my attention to Ancient Warriors, Episode 13: The Irish:\n\nhttps://www.youtube.com/watch?v=rsMSZHK1N40\n\nIn honour of this I have an imaginary bottle of Jameson Whiskey and am once again prepared to risk my life and health to entertain you all. Here we go!\n\n0.41: References a fictional character as if they existed. DRINK!\n\n0.43: Ireland fights for its life? The narrator is definitely exaggerating here. The Vikings certainly raided the country extensively, and established settlements such as Dublin, but they were always a vast minority compared to the rest of the population and did not really have the ability to extend their authority inland as they could with England, which was nearer to their population centres. Additionally, England's more centralized states were more vulnerable to Viking conquest as, once the centre of power was seized, the Vikings could set up a puppet ruler and gain authority over a large area. The fragmented nature of the Irish political system meant that, even if the Vikings took over one small kingdom, they would still face the prospect of many more battles, which would most likely discourage further efforts. DRINK!\n\n0.51. The Irish were outnumbered? BWAHAHAHAHAHAHAHAHA! I really don't even need to explain why that is so wrong that not even the God of Editing and Correction could make it right. Also, the Irish hardly \"put their faith\" in one man. The Irish were well aware the Vikings were not invincible. For example, the Vikings had been defeated in 848 at Sciath Nechtain. Likewise a High King fighting against the Vikings was hardly a new phenomenon. Máel Sechnaill mac Máele Ruanaid did so during his reign, capturing and killing the Viking warlord Thorgest. DRINK!\n\n0.54: I hate the word \"destined\" as it imposes a false narrative on the historical process. Nothing was \"destined to happen\", and the job of a historian is to determine why something happened, the time it did so, what happened and the consequences, not create a sense of manifest inevitability. DRINK!\n\n0.58: I've seen raves start like that.\n\n1.16: Want to make someone look like a primitive European warrior? Just add fur.\n\n1.54: They destroyed books??? Not cool, Vikings, not cool.\n\n2.48: But for the Vikings, it was Tuesday.\n\n2.55: Some Irish found refuge in crannogs. Others fought back, raided or came under the rule of the Vikings. Some were so far inland it did not really affect them at all. DRINK!\n\n\n3.22: Ireland had many recognized kings, not just one. What he should be referring to is the position of High King. DRINK!\n\n3.32: The map is supposed to be Ireland in 941 AD, but is missing kingdoms like the Ui Neills. DRINK!\n\n3.48: Brian Boru was not the son of a chief, he was the son of a king, Cennétig mac Lorcáin. DRINK!\n\n4.30: Not every Irish monastery was a tower. Movilla Abbey, founded in the 6th century AD, was not one, nor was Inishmacsaint Monastery, also built in the 6th century AD. DRINK!\n\n5.05: The tragedy did not earn Brian a place in history. Many other events were required before Brian Boru would become noted by chroniclers. I hate this kind of metahistory. DRINK!\n\n5.20: That weapon appears to be a Lochaber Axe, a weapon only used by the Scottish in the 16th century, or around 500 years after Brian Boru. DRINK!\n\n6.35: Warrior is holding a claymore, a weapon that is actually Scottish and not used till 400 years later. DRINK!\n\n7.37: The Irish had three favoured weapons. Besides the axe there was also the spear and the javelin. The spear required less metal than an axe, less training to use, could keep an opponent at a distance and could be used equally well in formation or in single fighting. The javelin also fitted well with the Irish skirmishing style of warfare as it could be used by lightly-armed foot-soldiers. Additionally, the voice-over is Irish, whilst the text being read is Anglo-Norman, so the accent is wrong. DRINK!\n\n8.00: So that's how extreme sports first started.\n\n8.38: \"Each warrior trains to wield it in either hand\". Hehehehehehehehe.\n\n9.12: The Irish were very horny drinkers.\n\n13.12: The Vikings were actually good fighters, and had axes themselves, so in a one-on-one fight they could stand against one a fair length of time. DRINK!\n\n13.21: I will give the creators of this documentary props for staging a fight-scene that looks somewhat feasible and chaotic.\n\n14.02: Sounds like the aftermath of a Canadian ice hockey game.\n\n14.41: Contemplative yet heroic warrior pose.\n\n16.34: The political system of Ireland allowed for many rulers. What the narrator should have said was one supreme ruler. DRINK!\n\n16.48: During this decade of peace there was the invasion of Ulster by Brian. Hardly peaceful, is it? DRINK!\n\n 17.48: I must point out that at this stage the Vikings has been in Ireland for centuries and had adopted many aspects of Gaelic culture and so were basically of mixed origin, not Vikings in the classic sense. \n\n19.47: The Irish are not speaking their native language, English. DRINK!\n\n20.19: Javelins and darts are the same thing. Darts was just an alternative name, in the same way blade and sword can be used interchangeably. DRINK!\n\n20.26: It seems clear that the Irish were not without sin.\n\n20.30: One of the Kerns is wearing maille. Kerns were light skirmishers, and would not have worn metal armour, nor could they afford it. DRINK!\n\n20.34: That spear-head is clearly a blunt replica, but I am going to let that go as the blunt weapons mean the re-enactors can present a much more intense staged battle.\n\n20.47: The narrator says the warrior is using a sword in each hand, but the actor on screen is using a sword and shield. DRINK!\n\n21.52: Okay, I loved that death scene!\n\n22.00: The Vikings can hardly give up their claim to Ireland when their descendants continued to live there. DRINK!\n\n22.25: Bro's were a problem even back then.\n\nDespite the inaccuracies, I really enjoyed this one. The quality of the re-enactment was of a very high level, and I felt it depicted the conflicts very well. I shall do another review soon, but I have not yet decided upon the subject.\n\n\n\n\nSources\n\nAlfred the Great: War, Kingship and Culture in Anglo-Saxon England, by Richard Abels\n\nEarly Medieval Ireland, 400-1200, by Daibhi O Croinin\n\nTopographia Hibernica, by Giraldus  \n\nWarfare and Society in the Barbarian West 450-900, by Guy Halsall\n\n",
        "created_utc": 1453387041,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts for Thursday, 21 January 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/41znoh/thoughts_for_thursday_21_january_2016/",
        "text": "It's almost Friday everyone, and with that comes the newest latest of the Thoughts for Thursday Thread! Whoot whoot!\n\nHave any weekend plans? Found something interesting this week that you want to discuss? This is the thread to do it! This thread, like the Mindless Monday thread, is free-for-all. Just remember to np link all links to Reddit if you link to something from a different sub, lest we feed your comment to the AutoModerator. No violating R4!\n",
        "created_utc": 1453377839,
        "upvote_ratio": ""
    },
    {
        "title": "Request: The British Empire.",
        "author": "YoureASoldierBodie",
        "url": "https://www.reddit.com/r/badhistory/comments/41z2n4/request_the_british_empire/",
        "text": "[removed]",
        "created_utc": 1453365332,
        "upvote_ratio": ""
    },
    {
        "title": "/u/Breaksfull encounters Molyneux Madness",
        "author": "BreaksFull",
        "url": "https://www.reddit.com/r/badhistory/comments/41y8kc/ubreaksfull_encounters_molyneux_madness/",
        "text": "So since my nightshift hours dictate that the best I can hope for in social life at the time is internet arguments and drunken anime sessions, I decided to stick with the later since I recently emptied the house of gin and whiskey except for some bile called Ouzo that tastes like fermented black licorice and plague boils. And as luck would have it, my friend on Facebook recently has given me the opportunity to do just that with a recent string of Stefan Molyneux videos. And what I thought to just be some overly smug YouTube 'philosopher' turned out to be an unending eruption of volcanic goodness, basting my TV and phone screen with ~~karma potential~~ opportunity to enlighten others.  My first foray involved his video on the Crusades in which Team Christian exclusively fought Team Muslim for totally just reasons and also why won't people just shut up about the Trans Atlantic Slave Trade already. But that was only the beginning, and my dear friend encouraged me to watch his two-part (oh christ) series [Myths of the World Wars.](https://www.youtube.com/watch?v=ke2hloDrb1c) And tragically, I made this hour and a half commitment without any soothing spirits to cool my volcanically-scorched soul.\n\n\nBeing a lazy shit, I didn't rewrite my entire breakdown of his videos again. So below I have just copy and pasted my Facebook reply to my friend and given it the BadAcademics treatment. Sources, snark, and swears.\n\n\n=======================\n\n\n\n**Part One: Are we done yet?**\n\n3:50 He says that WWII was essentially just a continuation of the first. That's Churchill's *Second Thirty Years War* claim, which is [bollocks!](https://np.reddit.com/r/AskHistorians/comments/3b24mk/treaty_of_versaillesmyths_of_reparations/csiqo30) While the conditions necessary for WWII were created by WWI, the second wasn't really a continuation of the first. The leading parties had all changed and the causes were completely different. Nazi Germany had no interest in resuming a war with England and France and Hitler's goal was almost exclusively focused on destroying the USSR and creating a large German Empire in Eastern Europe, completely different from the much more modest goals of the Kaiser and his obligation to support Austo-Hungary in a war against Russia and France.\n\n4:30 I'd be cautious about calling the 100 years between Napoleon and WWI peaceful. There was notable less major fighting in Western Europe to be sure, however [Eastern Europe, the Balkans, and Italy all experienced numerous bloody conflicts.](https://np.reddit.com/r/badhistory/comments/41sgoa/how_i_learned_to_stop_taking_responsibility_and/cz4ul7h) Not say that there was't a notable drop in major conflicts in West Europe during that time, but to call it a century of peace is wrong and insulting to the buckets of people who did die in Europe.\n\n7:00 He says that America entered WWI because of the sinking of the Lusitania. This is what academics call, 'a really fucking dumb thing to say and obviously whoever said it never read more than on Osborne Picture Encyclopedia on the  subject.' Because while multiple Americans dying from German torpedoes was a factor in aggravating the US, the decisive moment was [the Zimmerman Telegram](https://en.wikipedia.org/wiki/Zimmermann_Telegram) in 1917 when the Germans asked Mexico to go to war with the US in exchange for American territory.\n\n8:15 [The Versaille Treaty is overstated.](https://np.reddit.com/r/AskHistorians/comments/3b24mk/treaty_of_versaillesmyths_of_reparations/csiqo30) On paper it certainly looked imposing and unreasonably harsh, but the Allies were extremely flexible and lenient regarding payments. Despite initial hyperinflation during the early 1920's (by the Weimar Republic trying to get out of paying the loans) their economy didn't take long to recover and by 1924 Germany had the most modern economy in Europe and the highest GDP on the continent. Hitler didn't come to power because Germany was ruined by Versaille, he came to power when Germany was ruined -like everyone else- by the Great Depression, before which Germany had been doing well. \n\n13:50 Germany didn't go through the Enlightenment. I don't know what weird brand of cleaning chemicals he's snorting to arrive at this conclusion. Germany (or rather, the various Germanic states like Prussia, Saxony, Brandenburg, etc) were effected strongly by enlightenment ideals just as much as the rest of Europe. Frederic the Great of Prussia was practically the living embodiment of the Enlightenment ideal of the Enlightened Despotism, and the Napoleonic era saw the spreading of the Napoleonic Code [across the German states](https://en.wikipedia.org/wiki/Napoleonic_Code#Codes_in_other_countries) until the introduction of the Bürgerliches Gesetzbuch in 1900. \n\n\n16:00 The Germans weren't thirsting for vengeance against the west when Hitler came to power, he directed all German resentment and anger about 'being stabbed in the back' at the end of WWI against Bolshevism and Jewry.\n\n\nChrist I need my gin. Also what the fuck sort of accent is that? Pseudo-Pretentious English?\n\n18:00 His claim that the French and British governments did nothing to protect their people. First it's worth noting how much French and British attitude towards war had been shaken after the butchery they (especially the French) had experienced in WWI and really dreaded the idea of repeating WWI again. Second it's worth noting that France had assembled a damn fine army prior to WWII and some incredible defenses, and both France and Britain had drawn a strict line in the sand when Germany was pushing against Poland. So they didn't just sit around doing nothing. \n\n22:00 Defining the point of WWII as a fight against National Socialism is idiotically narrow-sighted. I mean, WWII was a global first of all and the reasons for the war in the Pacific with Japan, China, and America were completely different than those in the west. The 'point' of the war (presuming we're just talking about the European theater which is apparently all that *World* War Two means to Madman Molyneux) was more or less Hitler believing Soviet Bolshevism was a Jewish conspiracy that he was destined to lead National Socialism against, but it was also because of his racial theories and his belief that German Aryans needed to have expanded living space in order to take their place on the world stage. And in his eyes, the best place to take all that space from was Russia which was inhabited by Slavic people (Who he considered subhuman) and ruled by his ideological enemy, communists (and also in his mind, by Jews.)\n\n23:30 It's also inaccurate to say that the war against Germany was strictly against the ideology of National Socialism itself, but simply against an aggressive and expansionist Germany. Hitler was an aggressive leader fueled on insane ideas of race, and he was willing to act very dangerously on them and posed a threat to the security and stability of Europe. \n\n27:40 I understand and sort of agree with his point on the irony of governments doing various things for our 'freedom' while simultaneously restricting freedom in many ways, but he's painting a too rosy of a picture of the old world. Before WWII the US and many other 'modern' governments practiced enforced castration and eugenics on people who had disabilities or who were of different sexual orientations, or who were different ethnicities. Civil rights and workers rights were a joke in many countries back then, and it's only been after WWII that things like Civil Rights came into play and Womans rights. It makes freedom a tricky thing to calculate, because freedoms have expanded in some ways and shrank in others. \n\nHe says later on that we're about 'five or ten percent as free as we were at the turn of the century', (how he gets this number I don't know) but 'we' only really refers to middle and upper class white males in certain countries. I mean entire continents were colonies back then with the natives having substantially less freedom than they do today.\n\n\nAlso if I have to hear that we were 'Empirically' and 'Objectively' more free pre-WWII, I might have to lunge for the fucking Ouzo.   \n\n30:10 More on that same point, he points out being able to chose your own school as a sign of freedom in 1860. I'm sure that was very reassuring for the millions of people in America who couldn't enjoy any of that freedom under the law.\n\n33:15 He suggests that if we had never fought the Nazi's that things would have more or less worked out. Sure. Most likely, the Nazi Empire wouldn't have survived terribly long. *Neither would the 90% of Eastern Europe's native population that would have been liquidated, enslaved, or uprooted and deported, and the Holocaust would have been exponentially larger if GeneralPlan Ost had been enacted to completion.*\n\n\nPresuming the Soviet's didn't win and crush all of Europe themselves of course. \n\n35:20 He claims that people usually prefer to live under tyranny than die fighting it. [You don't fucking say?](https://en.wikipedia.org/wiki/List_of_revolutions_and_rebellions)\n\n\nFrench Revolution, Russian Revolution, American Revolution, Haitian Revolution, the South American revolutions, uprisings in North Africa and India against colonial powers, Tiananmnen Square, and the countless insurgencies that Nazi Germany dealt with are just a couple examples. And he backs his point with the lack of revolutions against the Soviets, ignoring that Soviet rule was substantially better than what living under Czarist Imperial Russia was like.\n\n\n\n**[Part two:](https://www.youtube.com/watch?v=e5EsnQUybKU) I'm getting too sullen and depressed by this for wit.**\n\n\n\n5:50 Blaming the intervention of America for the rise of Lenin in Russia is bullshit. The Imperial Russian government was in a very dangerous situation as it was having suffered a revolution in 1905, and Russia being involved in the war at all was almost guaranteed to spark another one. There were many, many other factors inside Russia that lead to the Bolshevik takeover, not least of which was the Kerensky Provisional Government making the mistake of continuing the war with Germany. \n\n9:20 Saying that 'the Germans' felt Communism was a Jewish threat is a tough thing to say, since this idea was mostly pushed by Hitler and he only received about a third of the popular vote. \n\n15:00 CIVIL WAS ABOUT EXPANDING FEDERAL POWER NOT SLAVERY OBVIOUSLY BECAUSE WE WERE OBJECTIVELY 80-90% FREER BACK THEN.\n\n\n*[Paging](https://np.reddit.com/r/badhistory/comments/3boun3/the_lost_cause_the_american_civil_war_and_the/) Dr. /u/Georgy_K_Zhukov for a bullshit enema...*\n\nSo in short: I weep for my friend, my liver, and my sore ass that's been immobile two hours writing this.\n\n\n\nOh and a fun side note: He compared creating a state to protect ones family and possessions to defending against rape by hiring people to rape you 24/7.",
        "created_utc": 1453350029,
        "upvote_ratio": ""
    },
    {
        "title": "Forget 209 years, the U.S. has been at war for 214!",
        "author": "I-am-that-hero",
        "url": "https://www.reddit.com/r/badhistory/comments/41vqmh/forget_209_years_the_us_has_been_at_war_for_214/",
        "text": "Many of you are familiar with [this] (https://www.reddit.com/r/badhistory/comments/1sqnqt/the_us_has_been_at_war_for_209_years/) post and the [photo](http://i.imgur.com/Mwe1jxG.jpg) it is referencing. I am pleased(?) to point out that there is another [list](http://www.loonwatch.com/2011/12/we-re-at-war-and-we-have-been-since-1776/) of wars making the rounds on the internet. This one claims that the United States has been at war for 214 years, or 91% of its existence. According to their claims, no president has ever been a \"peaceful\" president, and the longest span without a war was 5 years during the Great Depression. \n\nOnce you start reading the chart, several things become clear. First, the author does not give any pretense or explanation towards what criteria they are counting as a \"war\". Many of conflicts listed (for that's what many of them are, conflicts) such as the Chickamauga Wars, had little to no official U.S. troop involvement, and were often engagements between Indians and local settlers. I found it interesting that the Yellowstone Expedition listed in 1825 was listed, despite this particular venture not resulting in any [conflicts or notable deaths.](https://en.wikipedia.org/wiki/Henry_Atkinson_(soldier) The list also includes the Texas-Indian Wars in 1844-45, while Texas was not part of the U.S. until 1846. Again, the author is not fabricating events per se, but their representation is clearly skewed.\n\nI'm sure others may find some issues with the data, but I've been seeing this around the internet in several places without people giving 2 cents about the information or research. I'd be glad to know if there are other issues to bring up when I see it again. ",
        "created_utc": 1453315922,
        "upvote_ratio": ""
    },
    {
        "title": "How I Learned to Stop Taking Responsibility and Blame the Muslims.",
        "author": "BreaksFull",
        "url": "https://www.reddit.com/r/badhistory/comments/41sgoa/how_i_learned_to_stop_taking_responsibility_and/",
        "text": "In the aftermath of an unique experience the night before involving [gin and waffles,](https://np.reddit.com/r/drunkencookery/comments/41j1ox/i_made_drunkwaffles_from_soylent_and_some_sugar/) I decided during my recovery phase to look into the videos of some chap named Stefan Molyneux that have been seeping into my Facebook (thanks American election fever) and see if he was any good. While I've yet been able to commit an hour and some of my life learning the 'truth' about Bernie Sanders and Donald Trump, I did decide to investigate one of his smaller videos to see how he handled a controversial subject of history. [The Truth About the Crusades.](https://www.youtube.com/watch?v=-ilFbbk9jw4&amp;feature=youtu.be) \n\n\nGiven that it's a video from an apparent amateur Libertarian philosopher proclaiming the 'truth' about a subject, I was braced for the worst. He starts off the video alright, and in fact I'd say that the bulk of the video isn't that bad, most of the runtime being spent listing off a series of historical events taking up to the time of the First Crusade, which I don't have enough knowledge of to critique. In my eyes, the juicy meaty part of his video comes in the last quarter or so and in his overall theme. At first it comes off as nothing staggeringly awful, though still wrong. He simplifies the Crusades as nothing more than just Christian defensive postures in reaction to centuries of Muslim raiding (ignoring things like trying to help Byzantium, genuine religious devotion on part of many of the Crusaders, opportunists wanting land and plunder, authorities looking to find an outlet for an aggressive warrior class, etc). There's a nice /r/askhistorians thread on the Crusades causes [here.](https://np.reddit.com/r/AskHistorians/comments/2lz2ix/i_saw_this_article_about_the_crusades_posted_on/) Another nitpick about his history, referring to 'Islam' and 'Christendom' as monolith blocks.\n\n\nSo far his point is that the Crusades were a reasonable response to centuries of Muslim aggression and oppression of Christian territories, and he goes at length to point out that live as a Christian under Muslim rule could be very nasty. Then he takes it to the next level. Essentially, we shouldn't feel bad about the Crusades because the Muslims did just the same things and worse. \n\n\nAnd now it's around the 22:00 minute mark that the train really gets going. MUSLIM SLAVERY GUYS! IT WAS WAAAAAY WORSE THAT WESTERN SLAVERY! WE DIDN'T EVEN COMPARE TO BAD THEY WERE, WE SHOULDN'T BE FEELING BAD FOR THE TRANS-ATLANTIC SLAVE TRADE. \n\n\nYeah... He goes into relishing detail about the size and scope of Islamic piracy and slavery, how it took millions of whites and blacks into bondage, how it lasted waaaay longer than western slavery, and how we *never* hear about it as opposed to those big bad European meanies :'(\n\n\nI cannot stand this irresponsible line of reasoning. Other people were worse, so the horrible things we did don't matter. Who cares that American slavery was based on racism and created a bottom class of persons in America regardless of their wealth? Who cares that the effects of the TAST are survived through the 1960's with Jim Crow laws, the legacy of which still cripple black Americans to this day? Who *cares* about European colonialism, the Arabs had a massive slave trade it doesn't matter. Not to mention that at least in most Islamic slave systems you could earn/buy your freedom and that was that, as opposed to black slaves in the America's who were not even seen as humans as destined to be on the bottom of the barrel forever. So he doesn't even take all the important factors into account when determining which practice of selling human lives like furniture was 'worse', he acts like even if the Islamic trade *was* worse we shouldn't feel so bad about the horrors of the TAST.\n\n\nSo so far, this video has taught me that Muslims were way worse than Christians so we shouldn't feel so bad. Stalinism was also worse than McCarthyism so we shouldn't feel bad about the lives ruined in the Second Red Scare either, and the Holocaust was worse than incarceration of Japanese-Americans, that takes a load off my shoulders!\n\n\nAnd then around the thirty-minute mark, the whole thing just goes off the fucking rails. He gripes that Europe 'is the only culture not allowed to have a history' and that Europeans aren't allowed to feel any pride in their history, only guilt and shame for being bad white people because slavery and imperialism. While I agree that we shouldn't feel crushed by guilt for things we didn't do that happened long ago, to assume we shouldn't feel any sense of moral responsibility for the lives and cultures crippled by western domination is irresponsible and ridiculous. Not to mention that by ignoring those important realities, we lose context on how the world became what it is today, and people who don't understand the crippling impact of European imperialism for example may be inclined to write off Africa as an inherently barbaric and tribal society of primitives. But anyway..\n\n\nIn his final tirade to remind Europeans that they can be proud of their culture and history, the bars drops past the bottom of the barrel and begins digging a nice shallow grave.\n\n\n\nAt around 30:15, to point out what Western Europeans have to be proud of, he lists the following as being 'largely created by white Christian civilizations.'\n\n\n- Scientific method. Modern methodology sure, but lets not forget the significant contributions of the Arab world.\n\n- Free market.\n\n- Philosophy. [Mfw.](https://tribzap2it.files.wordpress.com/2014/06/chris-pratt-gif-2.gif?w=500&amp;h=318) I mean obviously China had nothing to do with philosophy. \n\n\n- Reason. Holy shit is he serious?\n\n\n- Evidence. *Holy shit is he serious?!*\n\n- *Rule of motherfucking law is a European invention guys!* The world was pure anarchy until the Magna Carta appeared in a euphoric cloud!\n\n\n\ntl;dr the islams were way worse, don't feel guilty if you only took bronze in the atrocity olympics.\n\n\n\n\n\n\nOther nitpicks:\n\n\nat 28:20 he mentions that 'European civilization ended slavery.' Except for the slavery they didn't end of course, since slavery has continued to exist. And then there were those Nazi's who used slaves. Of course the idea being that western civilization is better because they ended slavery first? Although I understand that the Achaemenid Persians ended slavery a few thousand years before the British, why don't we hear about them?\n\n\nAt 30:45 he says 'By any objective standards, Europe ranks very low on the list of criminal enterprises throughout history.' He's playing genocide olympics but he isn't even doing that right. DAE holocaust, thirty years war, Imperialism, eugenics? \n\n\n\n\nI've told my friend I'll keep watching some of his videos to be fair. Maybe [his hour-long video on the First World War](https://www.youtube.com/watch?v=gQ8Sj9FFmRc) can be a source of future weeping livers :)\n\n\n\nAlso another R5 virgin to toss into the volcano:\n\n\n- [Differences between American and Arab slavery](https://np.reddit.com/r/AskHistorians/comments/3a9ea5/how_brutal_was_the_arab_slave_trade_in_comparison/)\n\n\n\nEdit: Christ alive, looking through his other videos and he's off his fucking rocker. Red pill, lost cause, this is just the tip of the goddamn iceberg. ",
        "created_utc": 1453260687,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone else think the Crusades weren't that bad? Also, Europe invented logic and philosophy :)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/41sev3/does_anyone_else_think_the_crusades_werent_that/",
        "text": "[deleted]",
        "created_utc": 1453259919,
        "upvote_ratio": ""
    },
    {
        "title": "1873 New Zulu King Chetswayo Initiates White Genocide Agenda",
        "author": "WhiteHarem",
        "url": "https://www.reddit.com/r/badhistory/comments/41rhsn/1873_new_zulu_king_chetswayo_initiates_white/",
        "text": "[removed]",
        "created_utc": 1453247148,
        "upvote_ratio": ""
    },
    {
        "title": "\"While Turkey was under the Roman Empire for a time, it was pushed back by the Carthaginians\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/41rd3t/while_turkey_was_under_the_roman_empire_for_a/",
        "text": "[removed]",
        "created_utc": 1453245443,
        "upvote_ratio": ""
    },
    {
        "title": "I don't have to explain this one very much. \"20BC: The Roman Empire begins, spreading out as just a tiny dot from Rome to encompass Italy. At this time, Turkey (outlined) was in the hands of the barbarians and the Carthaginians\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/41r5ia/i_dont_have_to_explain_this_one_very_much_20bc/",
        "text": "[removed]",
        "created_utc": 1453242752,
        "upvote_ratio": ""
    },
    {
        "title": "A badhistory request: Varg Vikernes",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/41qioj/a_badhistory_request_varg_vikernes/",
        "text": "[removed]",
        "created_utc": 1453234818,
        "upvote_ratio": ""
    },
    {
        "title": "Martin Luther King Day Bad History Roundup",
        "author": "taylororo",
        "url": "https://www.reddit.com/r/badhistory/comments/41oaf5/martin_luther_king_day_bad_history_roundup/",
        "text": "Happy MLK day everyone.  It's a day were black and white people come together and tell stories about how Martin Luther King Jr agrees with them politically about everything. It's truly magical. Or, as Martin Luther King himself once said \"u/taylororo, I love you. Let's show the people some bad history.\"\n____\n[From Martin Luther King Was a Democratic Socialist](https://np.reddit.com/r/politics/comments/41khkv/martin_luther_king_was_a_democratic_socialist/)\n\n&gt;King was a life long labor leader because he understood the connection between race, division, and economics.\n\nWhile I too am a fan of alliteration, it does not make sense to describe MLK as a life-long labor leader, especially compared to men like A. Phillip Randolph, who actually led laborers. \n\nRandolph, when not originating the idea of the March on Washington, was president of the Brotherhood of Sleeping Car Porters. He's remembered for getting the Pullman Company to increase wages for their black employees and helping pressure FDR into signing the Fair Employment Act, which banned discrimination in war industries. \n\nMLK, when not being a preacher, worked with the SCLC on protesting Jim Crow and voting restrictions. When protesting,  the SCLC would often demand that major department store higher black workers along while desegregation, but this was only one aspect. Only towards the end of his life only did King start to place a strong emphasis on economic injustice. Even then though he had a wider emphasis than what we consider to be labor movements.\n \n&gt;he also embezzled money, plagerized speeches, and [funtimed] white whores\n\nThere is no evidence that he embezzled money. The state of Alabama did try to nail him on tax fraud charges in 1960, claiming he owed $1700 in back taxes. The charges were so flimsly that an *all-white jury found him not guilty*.\n\n \n\nHe did not plagiarize speeches. Within the tradition of black preachers, he did borrow, remix, and re-do parts of other peoples sermons. Even the phrase \"I have dream . . \" may have been taken from someone else's speech. However, calling this plagiarism is willfully misleading. Even outside the tradition of the black church, we don't remember \"I have dream\" because it contained a groundbreaking message. It did not and never claimed to. It is remembered because it told us what we already knew really, really well.\n \n\nFinally, why do they have to *white* whores? King's marital infidelities are stuff of legend, but there is no evidence that he paid for sex.\n\n______\n\n[Judge Joe: James Earl Ray Didn't Assassinate Martin Luther King Jr.](https://np.reddit.com/r/conspiracy/comments/41nb4v/judge_joe_james_earl_ray_didnt_assassinate_martin/)\n\n \n\nThere is overwhelming evidence [to prove the guilt of James Earl Ray](http://www.nytimes.com/1997/04/02/opinion/the-assassin-s-name-is-james-earl-ray.html). Ray, who was an escaped convict when he killed King, had spent several days following his victim around the South. Using assumed names, he then bought a rifle and rented a room in a flophouse with a view of the Lorraine Motel. He killed Martin Luther King, Jr. He fled into the hall and dropped the rifle (covered in his fingerprints) and other items linked to him in a neighboring doorway. Immediately going to the Atlanta airport, Ray was finally arrested in Heathrow Airport on his way to white supremacist nightmare state of Rhodesia.  In police custody, he confessed. James Earl Ray is the murderer of MLK.\n\n___\n\nAnd, funtime it, let's yell at vdare. com, but I'm not linking to those ~~scum~~ brothers in Christ.\n\n \n\n&gt;[Ben] Stein doesn’t, apparently, think it much mattered that Communists infiltrated King’s movement, or indeed that Communists ran the thing, or that King himself was a rabid Marxist and communist sympathizer.\n\n King was not a rabid Marxist, what ever that is. As said, he did criticize capitalism and, according to Michael Eric Dyson, he would privately express sympathy for the ideals of democratic socialism. Now did some Americans who were communist join his movement? Almost certainly. Some people, like Bayard Rustin, did formerly have ties to or belong to the communist party, but those ties were played down as he became more prominent. It may have been personal growth or pragmatism, but Rustin had long stopped working to create any communist movement. \n\nA usual line of attack on the part of segregationists is [Stanley Levision](http://www.davidgarrow.com/File/DJG%202002%20Atlantic%20SoloMLK%20Article.pdf), a man whose blood was literally red. Levision was a successful businessman, lawyer, and big whig in the Communist Party USA before meeting King. By the time he met MLK, however, he no longer had any connection with the CPUSA. Him and King formed a strong bond and Levison quickly became King's closest white counselor. But Levison's history was also a liability- it helped provide the official justification for the FBI to start wire tapping King. From the mid-1950s until his death, Levision worked not for the advancement of communism but for racial justice. His legacy on the CRM is not famous, but it is incredibly important and if he was acting at the behest of the communism, then American owes communism some gratitude.\n\nThe lack of communist involvement is also evidenced by the goals of the movement, which focused mainly on civil and political rights and not the ownership of production by labor or a proletariat revolution. What vdare is trying to say is that King did not have the exact same view of the market as them so he should not be respected.  Just kidding, they don't respect him because he's black.\n\nThe insinuation that communists ran the show is one of the oldest and falsest accusations thrown at the Civil Rights Movement. It is straight out of the segregationist handbook.\n\nFor example, here is Alabama governor George \"Segregation Now. Segregation Tomorrow. Segregation Forever.\" Wallace on the communist supreme court:\n\n&gt;It has reached the point where one may no longer look to judicial decisions to determine what the court may do. However, it is possible to predict with accuracy the nature of the opinions to be rendered. One may find the answer in the Communist Manifesto.\n\nSeriously, it's impossible to read ten sentence about the history of the foes of the CRM without someone yelling communism. Vdare is heir to a long American tradition of this shit.\n\nKing was not communist. Communists don't say things like:\n\n&gt; There are things I wanted to say renouncing Communism in theory . . . We wanted to say that it was an alien philosophy contrary' to us\n\nNor would he talk about how the Civil Rights Movement may be the key in the ideological battle against communism. Nor would he say that a revolution in moral values was the most effective way to defeat communism. \n\nNo King was not a communist.\n_____\n\n",
        "created_utc": 1453204411,
        "upvote_ratio": ""
    },
    {
        "title": "Bad Indian Military History, or how ByzantineBasileus has lost the capacity to experience human suffering.",
        "author": "ByzantineBasileus",
        "url": "https://www.reddit.com/r/badhistory/comments/41ny0m/bad_indian_military_history_or_how/",
        "text": "The job market here in Perth is quite frustrating, so I thought it would be mentally beneficial for me to do another bad history review. So today I am tackling Ancient Warriors, Episode 14: The Mauryans:\n\nhttps://www.youtube.com/watch?v=3TUUSYhuU3k\n\nMy focus on Indian history has always been the 16th century and the Rajputs, so examining this period will be a fun learning experience as I pick out inaccuracies. Nonetheless, if I make any mistakes myself, please let me know and I will amend the review. So here we go!\n\n0.45: The Narrator says the elephant has been both a god and a weapon. Obviously he is referring to Ganesh. The problem is Ganesh was not an elephant, he was a Deva (divine spirit or god) who merely had the head of an elephant. DRINK!\n\n0.50: Mauryan war elephants are depicted. One problem, there tusks are blunted. This is practice common for working elephants, but not for war elephants, as they were trained to gore their opponents. This is what a Mauryan war elephant would have looked like: \n\nhttp://wildfiregames.com/forum/uploads//monthly_05_2012/post-130-0-75326400-1337222277.jpg\n\nDRINK!\n\n1.57: The narrator refers to the Mauryan Empire being governed by a king. The title of king would have been pradesha chakravartin, meaning a ruler of a particular region, but the Mauryan ruler was titled chakravala chakravartin, which means universal ruler and is more appropriately translated as emperor. DRINK!\n\n1.59: Narrator confuses Star Wars character for an Indian monarch.\n\n3.09: Apparently the Mauryan army was made up of basketball players.\n\n3.25: If this is how you get conscripts I can see why the Vietnam War was so unpopular in the US.\n\n4.07: This guy has no idea how to play tic-tac-toe\n\n5.16: The narrator says the archer belonged to the Kshatriya varna, or the warrior caste. Such an individual would not be *just* an archer. They would have trained in a variety of weapons including swords, spears and maces. They would have also been horsemen, charioteers and infantry. Not so much an error as a failure to elaborate on the martial diversity of the role. \n\n7.04: The person narrating this portion has an Indian accent. The text the individual is speaking of is the Indika, by Arrian, a Roman writer. Anybody reading this text would have had a general \"Mediterranean' accent in the time period. DRINK!\n\n8.29: Okay, those arrows have no fletching and the arrow-heads are too large and appear to be made of cardboard. DRINK!\n\n8.34: Those guys in the background appear to be just gently tapping each other's shields with their weapons.\n\n9.16: The Narrator says Ashoka had 8000 elephants. I have no idea where he got this figure from. Megasthenes mentions Chandragupta had 9000 elephants, but that was twenty years before the period in question. DRINK!\n\n12.09: Warriors are marching with their swords held upwards. This would tire the arms rapidly. The swords would be held in a sheath, not raised and exposed to the elements. DRINK!\n\n16.35: I know I am being pedantic but that grass too well manicured for the 3rd century BC. DRINK!\n\n 18.34: Warriors working alongside elephants would have been armoured. The Arthashastra specifically mentions maille as well as a clubs being utilized as part of the \"standard equipment\" of elephant riders. Their status as the elite of the army would have entitled to them to such equipment as well. DRINK!\n\n19.48: First recorded case of cheerleaders in history.\n\n20.24: The best of the infantry is also suspiciously lightly equipped. DRINK!\n\n24.03: \"When Ashoka died no-one could take his place\". Except for Dasharatha, his grandson, who took his place. DRINK!\n\nWell, that was quite an educational experience. Next I shall review the episode about the Warriors of Ireland.\n\nSources\n\nThe Arthashastra, by Kautilya\n\nIndika, by Arrian\n\nIndica, by Megasthenes\n\nThe Origins and Development of Classical Hinduism, by A.L. Basham\n",
        "created_utc": 1453197694,
        "upvote_ratio": ""
    },
    {
        "title": "Bad American History X: The Golden Age of Chickencare",
        "author": "selfhatingyank",
        "url": "https://www.reddit.com/r/badhistory/comments/41iygt/bad_american_history_x_the_golden_age_of/",
        "text": "This is a not uncommon trope among certain aspects of the anti-universal healthcare right in the US. Before insurance, they allege, healthcare was paid for up-front, often by barter:\n\nhttp://www.theguardian.com/world/richard-adams-blog/2010/apr/21/sue-lowden-lowdencare-chickens-nevada\n\nThis is factually incorrect in Western history. For-profit care is just as much of a modern innovation as single-payer. Let's look at a typical oflder hospital in the US:\n\n[This Brooklyn hospital, for instance. Founded in the late 19th century as a religious ministry for Norwegian Lutheran immigrants, not a for-profit business, and treated as charity, not a service paid for primary with chickens.](https://www.google.com/url?q=http://www.lutheranhealthcare.org/Main/History.aspx&amp;sa=U&amp;ved=0ahUKEwjvmerJubPKAhUG3SYKHemEDsEQFggPMAI&amp;usg=AFQjCNGW-bhN8zHB9q91PC99A2hmeKA4_w)\n\nFor bonus R5, let's look at the history of hospitals in the west, going back to the days of Charlemagne:\n\n&gt;During the late 8th and early 9th centuries, Emperor Charlemagne decreed that those hospitals that had been well conducted before his time and had fallen into decay should be restored in accordance with the needs of the time.[29] He further ordered that a hospital should be attached to each cathedral and monastery.[29]\n\n&gt;In much of Europe town governments operated small Holy Spirit hospitals, which had been founded in the 13th and 14th centuries. They distributed free food and clothing to the poor, provided for homeless women and children, and gave some medical and nursing care. Many were raided and closed during theThirty Years War (1618–48), which ravaged the towns and villages of Germany and neighboring areas for three decades.\n\nThe first reference I can find to something reassembling the modern US model is in the 18th century:\n\n&gt;The voluntary hospital movement began in the early 18th century, with hospitals being founded in London by the 1710s and 20s, including Westminster Hospital (1719) promoted by the private bank C. Hoare &amp; Co and Guy's Hospital(1724) funded from the bequest of the wealthy merchant, Thomas Guy. Other hospitals sprang up in London and other British cities over the century, many paid for by private subscriptions. St. Bartholomew's in London was rebuilt in 1730, and the London Hospital opened in 1752.\n\nEven then, exclusive private hospitals existed alongside charitable ones:\n\n&gt;Another Enlightenment era charitable innovation was the dispensary; these would issue the poor with medicinesfree of charge. The London Dispensary opened its doors in 1696 as the first such clinic in the British Empire. The idea was slow to catch on until the 1770s, when many such organizations began to appear, including the Public Dispensary of Edinburgh (1776), theMetropolitan Dispensary and Charitable Fund (1779) and the Finsbury Dispensary (1780). Dispensaries were also opened in New York 1771, Philadelphia 1786, and Boston 1796.[43] (All courtesy [this overview](http://Wikipedia.org/wiki/history_of_hospitals))\n\nIn short, through western history healthcare in Europe and the US was generally provided by charity or insurance, not barter.",
        "created_utc": 1453124118,
        "upvote_ratio": ""
    },
    {
        "title": "Mindless Monday, 18 January 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/41into/mindless_monday_18_january_2016/",
        "text": "Happy (or sad) Monday guys!\n\nMindless Monday is generally for those instances of bad history that do not deserve their own post, and posting them here does not require an explanation for the bad history. This also includes anything that falls under this month's moratorium. That being said, this thread is free-for-all, and you can discuss politics, your life events, whatever here. Just remember to np link all links to Reddit and don't violate R4, or we human mods will feed you to the AutoModerator.\n\nSo, with that said, how was your weekend, everyone?\n",
        "created_utc": 1453118454,
        "upvote_ratio": ""
    },
    {
        "title": "Entertaining youtube channel reviewing historically inaccurate movies.",
        "author": "sexyloser1128",
        "url": "https://www.reddit.com/r/badhistory/comments/41ii8i/entertaining_youtube_channel_reviewing/",
        "text": "[removed]",
        "created_utc": 1453115107,
        "upvote_ratio": ""
    },
    {
        "title": "[Meta] Entertaining youtube channel reviewing historically inaccurate movies.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/41ih4k/meta_entertaining_youtube_channel_reviewing/",
        "text": "[removed]",
        "created_utc": 1453114417,
        "upvote_ratio": ""
    },
    {
        "title": "Entertaining youtube channel reviewing historically inaccurate movies.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/41iftx/entertaining_youtube_channel_reviewing/",
        "text": "[deleted]",
        "created_utc": 1453113623,
        "upvote_ratio": ""
    },
    {
        "title": "Bad Celtic Military History.",
        "author": "ByzantineBasileus",
        "url": "https://www.reddit.com/r/badhistory/comments/418lu5/bad_celtic_military_history/",
        "text": "Hello again, Bad-Historiers. It is time to dive once more into the fetid waters of popular history, imaginary Canadian Club in hand.  So here is my review of Ancient Warriors, Episode Two: The Celts\n\n0.33: Damn, barely 30 seconds in and already an error. The Celts hardly \"swept down from the mountains\". They lived in a range of climates. Yes, they could dwell in mountain valleys, but also lived in forests, plains, along the coasts and in towns. DRINK!\n\n0.47: The Celts could not at all be described as \"wild\". By the time of Caesar the Celts of Gaul were developing urban societies based on fortified towns called Oppida, and had a range of advanced political institutions including councils and assemblies. Even long before that they were settled agriculturalists with a long tradition of metal working and trade. Most Celtic migrations that occurred were a result of population pressure, not a \"wild\" or \"barbaric\" culture. DRINK!\n\n0.52: Celtic fighting traditions were greatly spread across different geographical regions and times, and so cannot solely be categorized as reckless. Yes, there were Roman accounts of Celts launching wild infantry charges, but there are also accounts of them forming organized phalanxes or shield walls, as well as engaging in sieges and guerrilla warfare by the time of Caesar's conquest of Gaul. DRINK!\n\n 1.12: \"They fought for nothing less than victory\". Funny, so do most combatants.\n\n1.38: So could Celtic invasions be considered booty-calls?\n\n1.46: \"Wild men of Western Europe\". Gaaaahhhhh! DRINK!\n\n1.58: \"Record their coming with alarm\". Hehehehehehehehehe.\n\n2.42: The idea that we know nothing of the lives of the Celts before their interaction with Rome is absolutely, utterly wrong. Archaeological finds allows us to construct a solid image of what their culture was like. For example, we have the ruins of homesteads, farms and granaries that allow us to reconstruct their daily agricultural existence. Likewise we have burials which enable us to identify cultural important items based on what was found there and recurrent imagery in their jewellery and metal work allow scholars to identify important religious and social themes. DRINK! \n\n4.25: That appears to be nailed-on horseshoe, which is strange as they were first recorded in Europe about the 10th century AD. DRINK!\n\n4.35: I know the narrator is just calling the Celts invincible for effect, but when you look at their numerous defeats by the Romans, they were quite vulnerable to a drilled military force. DRINK!\n\n4.49: The first recorded visit of North European Soccer Hooligans to Italy.\n\n7.19: Whilst the idea that they feared no man makes for impressive storytelling, it is quite incorrect. Also, I am surprised the narrator made no mention of the Celt emissaries telling Alexander the Great they only feared the sky falling on their heads, a belief corroborated by the ancient primary source Asterix the Gaul. DRINK!\n\n8.17: The Romans are wearing the equipment based on the Manipular Legion, including scutum shields and maille armour. At this time they would be equipped like Greek hoplites. DRINK!\n\n9:19: Mentions fantasy book as historical source. DRINK!\n\n9.57: I take issue with the claim of the narrator that the Celtic sword was intended solely for slashing. Celtic swords could be quite diverse in their design, and whilst the point of balance was often well forward, indicating it was indeed ideal for slashing, many had acute points and thus were also effective thrusting weapons. DRINK!\n\n10.52: First recorded appearance of effeminate and flamboyant hair stylists.\n\n11.22: We have no way of knowing exactly how disciplined Celtic war-bands were during that battle, so calling them \"mobs\" is quite a leap. DRINK!\n\n11.28: The narrator mentions the Celts were united by their battle-standards featuring animals of the forest. The depicted animal is a horse, a species predominantly found on plains and steppes. DRINK!\n\n12.15: Roman with what appears to be a Pompeii-style gladius. At this stage, the Romans were not even using gladii. Their swords were based on the style of the Greek xiphos. Even if the Romans were using gladii, the Pompeii-style comes from the Principate, not the Republican period. DRINK!\n\n14.01: Okay, I don't know what time period or cultures are being depicted on the carving, but they are certainly not Celts from the 4th century BC. One of the combatants is shown wearing a phrygian cap, which is derived from Anatolia and the Balkans. DRINK!\n\n19.28: \"The Celts deployed back-to-back. Hehehehehehehehehe.\n\n19.44 More Pompeii-style gladii. Urrrgghh! DRINK!\n\n20.13: Now I have an image of an army of Celts as assertively homosexual and fabulous.\n\n20.46: The Romans were equipped with hoplite shields, which were not small. DRINK!\n\n21.45: \"The Roman thrust their newest weapon, a short blade, into naked flesh\". Hehehehehehehehehe.\n\n23.11: Okay, this claim annoys me. The Celts were in no way driven from all those areas. They just came under the rule of Rome and were gradually assimilated. DRINK!\n\n23.35: GAAAAHHHH! Celtic society developed in Central Europe from the Hallstatt Culture, not from the \"farthest shores of the world\". DRINK!\n\nWell, this documentary certainly would have given me alcohol poisoning if I were actually drinking. If I must be complimentary, I was quite impressed with the visual depictions of the Celts in terms of costume and equipment. \n\nSources\n\nThe Ancient Celts, by Barry Cunliffe\n\nEurope Between the Oceans: 9000 BC-AD 1000, by Barry Cunliffe\n\nThe Complete Roman Army, by Adrian Goldsworthy",
        "created_utc": 1452954485,
        "upvote_ratio": ""
    },
    {
        "title": "Saturday Studies, 16 January 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/41844a/saturday_studies_16_january_2016/",
        "text": "Find a book you like? Read an intriguing article from JSTOR last week? Want to discuss and get recommendations for new books? This is the thread for it! Come one, come all, please let us know what you've been reading this week!\n\nNote: unlike the other two megathreads, this thread is *not* free-for-all. You are free to discuss books that you've read, articles you liked, and similar. But please save the personal updates for Mindless Monday! \n",
        "created_utc": 1452945649,
        "upvote_ratio": ""
    },
    {
        "title": "Badhistory Universalis [EUIV] ; Will Scotland reject Incan Austerity measures? [UTC 1900, around 7 hours from this post]",
        "author": "PersianClay",
        "url": "https://www.reddit.com/r/badhistory/comments/41842t/badhistory_universalis_euiv_will_scotland_reject/",
        "text": "Yet another EUIV game!, together with /r/thechapel .\n\n&gt;The world:\n\n* [Players](http://i.imgur.com/e1pUGVf.png)\n* [Countries](http://i.imgur.com/8PqZxXh.png)\n* [Religion](http://i.imgur.com/RXVYaHF.png)\n* [Cultures](http://i.imgur.com/0rKh4cF.png)\n* [Technologies](http://i.imgur.com/D1tijrd.png)\n* [Development](http://i.imgur.com/6jkjwSD.png)\n* [HRE](http://i.imgur.com/fGLdhqL.png)\n\n&gt;Important Information:\n\n* You only need the base game, DLCs are shared by the host. (/u/PersianClay)\n* We usually play for 4 to 5 hours. (this can vary a lot)\n* The primary means of oral communication is once again Teamspeak as that part has worked great all around so far. Usually, server is ts.tuplay.se.\n* Please mention the country you're playing as in your nickname, i.e. \"notamacropus | Tunis\" or similar to make it easier for everyone.\n* Server will be Badhistory Universalis, password holyvolcano.\n* For the most current information and the \"join game\" option please join the chat room of the [bad history steam group](http://steamcommunity.com/groups/badhistory) before launch. This is the ONLY reliable way to join the game, so make sure you get in the group chat.\n \n* also if you are new, remember that we usually have a development limit, at around 300-400(uncertain for now, you will get to know when we start to pick our nations again!.\n\n* Who will win the raffle this time? Will Scotland finnaly start earning money on themselves and get to rebrand their provinces and colonies back to normal? FOLLOW NEXT ON THIS SESSION",
        "created_utc": 1452945625,
        "upvote_ratio": ""
    },
    {
        "title": "\"[F]or thousands of years, you got executed if you were not a biblical literalist\"",
        "author": "matts2",
        "url": "https://www.reddit.com/r/badhistory/comments/417hvy/for_thousands_of_years_you_got_executed_if_you/",
        "text": "[\"I don't care what tradition is the oldest; for thousands of years, you got executed if you were not a biblical literalist. Thats the reality of religious history\"](https://np.reddit.com/r/DebateReligion/comments/40z9yf/why_do_so_many_evangelicals_deny/cyz4ybs)\n\nOur poster has already accepted that the Jewish tradition was not literalist. So that \"thousands of years\" can only be under Christianity. Now there has not been any such religious execution since say 1700. And Christians really don't have political power until say Constantine, so that take 300 years off the front end. So we have at most 1400 years. So even if the time was filled with executions over literalism that would not be thousands of years. Then we have the non-executed St. Augustine rejecting literalism so that takes us to a maximum of 1300 years.\n\nBut it is really worse. Because the Catholic church has never held to that sort of literalism. It does not start at all until the Reformation and modern literalism starts with the publication of [The Fundamentals](http://www.theopedia.com/the-fundamentals). As bad as the Religious Right is I don't see that they have had the opportunity, nor really the desire, to execute people for rejecting literalism.\n\nBonus bad history from the thread:\n\nHe offers [Franco de Franco](https://en.wikipedia.org/wiki/Franco_de_Franco) and [Bartholomew Legate](https://en.wikipedia.org/wiki/Bartholomew_Legate). Franco accused the Catholic Church of being idol worshipers, Legate seems to have denied the Trinity. Neither is an issue of literalism vs. non-literalism. If anything it is the executed who was arguing for a literal position.\n\nExtra bonus, this amazing comment:\n\n[I wouldn't even know where to begin providing historical evidence of literal biblical interpretation because it's just history](https://www.reddit.com/r/DebateReligion/comments/40z9yf/why_do_so_many_evangelicals_deny/cz06rpo)\n\nYes folk: history does not need evidence, it is just true.\n\n\n\n\n\n\n\n",
        "created_utc": 1452931533,
        "upvote_ratio": ""
    },
    {
        "title": "Request: This thread from WhoWouldWin",
        "author": "Yawehg",
        "url": "https://www.reddit.com/r/badhistory/comments/417fge/request_this_thread_from_whowouldwin/",
        "text": "[removed]",
        "created_utc": 1452929985,
        "upvote_ratio": ""
    },
    {
        "title": "D.M. Murdock (Acharya S.), Dec 25, 2015",
        "author": "Flubb",
        "url": "https://www.reddit.com/r/badhistory/comments/414yga/dm_murdock_acharya_s_dec_25_2015/",
        "text": "Most of us have probably come into contact with Murdock's work, whether it was whacking the eternal moles of the [Horus/Christ](http://www.stellarhousepublishing.com/images/jesusosiris.jpg) connections, or trying to contain the pox that was *Zeitgeist* after it bled all over the (largely) unsuspecting public consciousness, or rolling our eyes so hard in our heads about [Religulous](http://www.imdb.com/title/tt0815241/) that we could examine the backs of our skulls.\n\nRegardless of what we may think of her in causing us so much work, she succumbed to cancer on a date that might have amused her. Whether or not you enjoyed her work, [cancer sucks](https://xkcd.com/931/) and is a pretty awful way to go.  She leaves behind a son.\n\n[Link to announcement](https://www.giveforward.com/fundraiser/lsn9/u/updates/138747) (link for verification and for further reading -not for endorsement - as the fundraiser was for treatment).",
        "created_utc": 1452890022,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts for Thursday, 14 January 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/40xaq3/thoughts_for_thursday_14_january_2016/",
        "text": "It's almost Friday everyone, and with that comes the newest latest of the Thoughts for Thursday Thread! Whoot whoot!\n\nHave any weekend plans? Found something interesting this week that you want to discuss? This is the thread to do it! This thread, like the Mindless Monday thread, is free-for-all. Just remember to np link all links to Reddit if you link to something from a different sub, lest we feed your comment to the AutoModerator. No violating R4!\n",
        "created_utc": 1452772882,
        "upvote_ratio": ""
    },
    {
        "title": "Three presidents of Mexico were actually crypto-Filipinos.",
        "author": "selfhatingyank",
        "url": "https://www.reddit.com/r/badhistory/comments/40vae3/three_presidents_of_mexico_were_actually/",
        "text": "I found [this](http://galleonadventures.com/filipino-contact-mexico/filipinos-mexicans-hermanas-paisas/) gem from a few years back (quoting an article that originates in the Manila Bulletin). There are several serious errors in these two sentences alone that deserve *multiple* R5s:\n\n Among the notable Mexicans of African (Filipino?) heritage are Juan Alvarez, Lazaro Cardenas, writer and novelist Vicente Riva Palacio, Gaspar Yanga, Emiliano Zapata , Vicente Guerrero, Luis Pinzon, Venustiano Carranza, and the great composer Agustin Lara.\n\nThree of them — Alvarez, Cardenas, and Carranza — became president of Mexico.\n\nR5a: Let's look at the word \"Filipino\" here. \"Filipino\" as an ethnic identity did not mean what it does now. At the time the ancestors of these \"Filipino\" Mexicans were imported, the term \"Filipino\" [meant a white person of 100% Spanish ancestry born in the Philippines](https://books.google.com/books?id=4wk8yqCEmJUC&amp;pg=PA72&amp;lpg=PA72&amp;dq=filipino+peninsulares&amp;source=bl&amp;ots=DPXdepzXus&amp;sig=eg5nRmqS9xFT8NqAZJJlhcbNMtg&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwjnv_-wkKjKAhWF8x4KHWHcDosQ6AEIVzAN#v=onepage&amp;q=filipino%20peninsulares&amp;f=false). Also, even by today's standards many of these slaves were not Filipinos. [Quoth the Wiki](https://en.wikipedia.org/wiki/Asian_Mexicans#History):\n\n&gt;Although in reality they were of diverse origins, including Japanese, Koreans, Malays, Filipinos, Javanese, Cambodians, Timorese, and people from Bengal, India, Ceylon, Makassar, Tidore, Ternate [sic], and China.\n\nReferring to all of them as Filipino is fallacious. You wouldn't refer to a Japanese, Korean, or Bangla as a Filipino.\n\nR5b: Furthermore, there is not much evidence that they settled into the black community. Asian slaves and migrants in Mexico were generally referred to as [*indios*](http://www.academia.edu/3432351/Filipinos_in_Nueva_Espa%C3%B1a_Filipino-Mexican_Relations_Mestizaje_and_Identity_in_Colonial_and_Contemporary_Mexico), i.e. Amerindians, not blacks.\n\nR5c: Let's look at two of these names in particular.\n\n&gt;Gaspar Yanga\n\nWas unambiguously African (specifically [West African](http://www.blackpast.org/gah/yanga-gaspar-c-1545)), not Filipino.\n\n&gt;Among the notable Mexicans of African (Filipino?) heritage are Juan Alvarez, Lazaro Cardenas, writer and novelist Vicente Riva Palacio, Gaspar Yanga, Emiliano Zapata , Vicente Guerrero, Luis Pinzon, Venustiano Carranza, and the great composer Agustin Lara. **Three of them — Alvarez, Cardenas, and Carranza — became president of Mexico.**\n\nYou are technically correct, the best kind of correct. All three of those men became President of Mexico. However, you left out [Vicente Guerrero](http://www.blackpast.org/gah/guerrero-vicente-1783-1831), [who also served as president](https://en.wikipedia.org/wiki/List_of_heads_of_state_of_Mexico#First_Federal_Republic_.281824.E2.80.931835.29) and was [kinda a big deal, to the point that he is the only president in Mexican history, white or black, to have a state named after him.](https://en.wikipedia.org/wiki/Guerrero)\n\nBonus (although not strictly history): Guerrero is not the only black president in North American history to be confused for Filipino. In a Public Policy poll, about [1% of Americans fell for the trap answer that Obama was born in the Philippines, even though there is no evidence tying him to that nation as a child.](http://douthat.blogs.nytimes.com/2010/06/29/birthers-polls-and-public-ignorance/?_r=0)",
        "created_utc": 1452734830,
        "upvote_ratio": ""
    }
]