[
    {
        "title": "Sunday Studies, 19 November 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/7e059n/sunday_studies_19_november_2017/",
        "text": "Find a book you like? Read an intriguing article from JSTOR last week? Want to discuss and get recommendations for new books? This is the thread for it! Come one, come all, please let us know what you've been reading this week!\n\nNote: unlike the Monday and Friday megathreads, this thread is *not* free-for-all. You are free to discuss books that you've read, articles you liked, and similar. But please save the personal updates for Mindless Monday! \n",
        "created_utc": 1511092262,
        "upvote_ratio": ""
    },
    {
        "title": "Bad cannon history at the New York Metropolitan museum",
        "author": "terminus-trantor",
        "url": "https://www.reddit.com/r/badhistory/comments/7dlhsp/bad_cannon_history_at_the_new_york_metropolitan/",
        "text": "**TL;DR New York Metropolitan Museum of Art webpage has a wrongly dated an Asian cannon, which if it was true would alter most of what we know of gunpowder weapon development. It’s actually a trivial affair, but we can always use some drama in our lives.**\n\nSome days ago a user (not connected to badhistory in question itself in anyway) posted an innocent question over on AskHistorians:\n\n&gt;I've recently stumbled upon an article of these Southeast Asian cannons. It is mentioned that these cannons are breech-loaded. However, I cannot find any account on how they are operated, including how exactly the breech is sealed. I'm hoping someone here might know more.\n&gt;Thanks in advance!\n\n&gt;https://upload.wikimedia.org/wikipedia/commons/0/0f/Cet-bang_Majapahit.jpg\n\n&gt;https://upload.wikimedia.org/wikipedia/commons/0/05/Meriam_museum_bali.jpg\n\n\nI looked at the images, recognized the cannons as common (european in origin) breech loader design and specifically Asian versions of it, and I gave an answer to the question of the technicalities of breech loaders.\n\n\nSome short time after that, I revisited the question to ~~revel in the karma~~ read the response comment, and this time I actually went and dug up the pictures in wikipedia to read about them. There to my amazement I saw that the first image - [this one](https://upload.wikimedia.org/wikipedia/commons/0/0f/Cet-bang_Majapahit.jpg) - is used in [several] (https://en.wikipedia.org/wiki/Cetbang) different [wikipedia](https://en.wikipedia.org/wiki/Majapahit#Golden_age) historical [articles](https://en.wikipedia.org/wiki/List_of_Indonesian_inventions_and_discoveries#Weapons_and_military) claiming these were *cetbang* type, which is asian by origin (my raised eyebrow) and specifically from the 14th century (second raised eyebrow)\n\n\nTo my disbelief claim is actually strongly sourced to the … New York Metropolitan Museum of Art (at this point I am in my full wtf face). \n\nUnfortunately, the source of the claim is really there. [Here is the direct link](https://metmuseum.org/art/collection/search/37742) and you can see it as it is:\n\n&gt;Period:Majapahit period (1296–1520)  \n\n&gt;Date:ca. 14th century  \n\n&gt;Culture:Indonesia (Java)  \n\nNow, I know what you are thinking: this guy over the internet can’t know more than a museum. Well I definitely don’t but I do know this little thing, and for some reason they don’t and it is bothering me and that’s why we are all here today. \n\n----------\n\nAt this point we might as well finally start with the R5:\n\nThe reason why I don’t think there is even the slightest chance this cannon is 14th century, can be brought down to two main items:  \n\n* This cannon looks ***nothing*** like any cannon in the 14th century whether it was European, Chinese, Indian, or wherever  \n\n* This cannon looks ***exactly*** like 16th century European cannon brought to Asia by Portuguese . \n\nI won’t give much time to explaining 1) but I suggest anyone who is interested to check works of [Brackenbury](https://books.google.hr/books?id=KwgHAAAAQAAJ&amp;pg=PP5&amp;source=gbs_selected_pages&amp;cad=3#v=onepage&amp;q&amp;f=false), [Tout](https://books.google.hr/books?id=2AgNAQAAIAAJ&amp;pg=PA233&amp;lpg=PA233&amp;dq=tout+firearms+england&amp;source=bl&amp;ots=pnkLMsZRNu&amp;sig=uIwjgL48JyLMt5ZT5Gf9ALWHkZk&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwjH6ubjlcXXAhVKthoKHU_yAHAQ6AEIOzAE#v=onepage&amp;q=tout%20firearms%20england&amp;f=false), [Needham](https://books.google.hr/books?id=hNcZJ35dIyUC&amp;pg=PR5&amp;source=gbs_selected_pages&amp;cad=3#v=onepage&amp;q&amp;f=false) and [Khan](https://books.google.hr/books/about/Gunpowder_and_Firearms.html?id=s4PfAAAAMAAJ&amp;redir_esc=y), to read about examples of 14th century cannon around the globe and you will see nothing so developed like the cannon in question\n\nI will, though, focus on the 2) part.  \n \nBasically, when I say “looks exactly like” I don’t mean that it’s just similar idea, or mechanism of breech loading, or even just the general shape. No I mean literally they look like straight up copies, or guns from the same series even.  \nThe shape of the muzzle mouth, the position and shape of the trunnions for mounting, the connector for tiller in the back, the box shaped miche container for the breech chamber with a slot in the bottom and on the sides for the wedge ([image clarifying terminology](https://imgur.com/7ARw2AC)). Sizes are different, as the Asian cannon is much smaller, but the details matching is too perfect. Just compare the shape of this cannon with [several](https://imgur.com/MFwDk1q) of the [cannons](https://imgur.com/xxisqn5) from the [archaeological](https://imgur.com/WUZyHeP) finds from 16th century Portuguese shipwrecks or [surviving](https://imgur.com/Fz7Obs1) similar [cannons](https://imgur.com/cDp6tuu) from european museums. \n\nThe closeness of the shapes are too much for it to be coincidental, especially when spread between two continents and 150ish years.\n\nOf course, one may say:well maybe the Europeans took the design from asians, how about that option? However, we have so much european [examples](https://upload.wikimedia.org/wikipedia/commons/6/6c/Breech_loading_swivel_guns_15th_16th_century.jpg) of breech loading cannon you can really trace the [development](https://i.pinimg.com/474x/18/48/70/184870f3c8fa8ea5b1c9aa875745a3dd--tall-ships-cannon.jpg) of the breech loading in Europe, from it’s [beginnings](https://collections.royalarmouries.org/object/rac-object-1295.html) in the 15th century, through futher stages of development with [cannon mounted on wooden bed](https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Veuglaire_-_Ch%C3%A2teau_de_Castelnaud_-_20090926.jpg/1280px-Veuglaire_-_Ch%C3%A2teau_de_Castelnaud_-_20090926.jpg), to [swivel mounted versions](https://collections.royalarmouries.org/object/rac-object-34046.html), to [versions](https://imgur.com/1A8mknR) that started to get into shape we are looking at, to finally being [completely](https://collections.royalarmouries.org/object/rac-object-24148.html) this full “mature” form. \n\nWe also have additional corroboration of european origin of breech loaders in works of Needham where it is specifically stated the Chinese encountered, and eagerly adopted, the breech loading design after European arrival in the area, to the point they literally called the gun “Frankish gun”. If SE asians had such guns since 150 years before why did the chinese adopt them only after portuguese came?\n\nThe wealth of evidence that the breech loaders are from in Europe is so high that it is actually not even an issue among any historians that deal with the firearms, and is universally accepted so I really don’t know is there any point in providing further examples. At the same time this is the only cannon of such shape we have in SE Asia that is claimed to be pre 16th century and the reasons for it to be claimed remain unknown. I think the case is clear.\n\n-----\n\nBut let’s not just leave this at this point, though we might. Despite the cannon obviously not being pre-1500, there is still a question of when exactly was it made and by whom and why. While it’s general shape is portuguese, it does have Asian markings and absence of portuguese markings makes it unlikely to be portuguese, and overall it is much smaller than the portuguese ones of similar shape.\n\nCurious case had arisen lately when a swivel gun thought to be Portuguese was found in the coast of Australia. This report (Dundee report - [PDF link](http://www.pastmasters.net/uploads/2/6/7/5/26751978/dundee_swivel_gun_provenance__rpt_final.pdf)) concluded that, according to them (there still seems to be a debate on the final verdict) that gun is likely to be one of numerous SE Asian copies of Portuguese guns.  \n\nReport actually states four possibilities what cannons found could be:  \n\n1) Portuguese made cannon for Portuguese use  \n\n2) Portuguese made cannon for sale to Asian customers  \n\n3) Asian made cannon of Portuguese style for sale  \n\n4) Asian made cannon of Asian style for sale   \n\n\nA cynic might add a fifth one: a modern fake, but I actually don’t think this is the case here.\n\nThe Dundee cannon article I linked by some weird chance actually gives us a possible explanation. In the chapter 4.2 of the report we have mention of some cannons which can be found on an auction site. Here is the [link to that page.](http://www.wisma.com.au/collectables-from-around-the-world/cannons-shipwreck-items/csw0008.aspx) There we have three cannons, two of which are roughly equal in size to the one in the Musuem (35½\" and 34½ inches vs 37 inch for the museum piece). And while the three are heavily corroded, my subjective view is they are strikingly similar to the one in the Met museum. The auction site offers following explanation of their origin:\n\n&gt;Three bronze Portuguese breech lock cannons c1589-1600 found on a Portuguese shipwreck off the island of Ternate Dutch East Indies.  \nThese cannons were of small size and could have probably been used for barter for trade in the Dutch East Indies or were used as samples by a Portuguese salesman working for a gun company in Portugal.  \nThe cannons look as if they have been in the ocean for some time but are still stable. They measure No 1: 25½\" No 2: 35½\" and No3: 34½\"\n\n\nThis doesn't really mean much, as the auction site is actually a much worse source then the museum and doesn’t offer any of their references or methods for its description. And even if it did before we accept anything from them we should double, even triple, check it. But we can't. \n\nHowever my personal opinion is that weighing the probabilities  it is more likely that the cannon of Met museum shares origin with those cannons rather then being a pure asian 14th century cannon, if not directly then indirectly just by being a similar item by origin and purpose: a small example cannon, made for trade or show to the local population in the later 16th century. \n\n-----\n\nWhatever the case is with the auction, I think it is clear from the abundance of evidence the cannon from the Met museum is post-1500.\n\nI tried contacting the museum directly about this, but their [contact page](https://www.metmuseum.org/about-the-met/contact) doesn’t really give proper address for such complains, and the ones I did send it too didn’t answer anything yet (or acknowledged my mail in any way other than an auto reply response)\n\n\n",
        "created_utc": 1510930880,
        "upvote_ratio": ""
    },
    {
        "title": "Free for All Friday!, 17 November 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/7dke0h/free_for_all_friday_17_november_2017/",
        "text": "It's Friday everyone, and with that comes the newest latest Free for All Friday Thread! What books have you been reading? What is your favorite video game? See any movies? Start talking!\n\nHave any weekend plans? Found something interesting this week that you want to share? This is the thread to do it! This thread, like the Mindless Monday thread, is free-for-all. Just remember to np link all links to Reddit if you link to something from a different sub, lest we feed your comment to the AutoModerator. No violating R4!\n",
        "created_utc": 1510919464,
        "upvote_ratio": ""
    },
    {
        "title": "This hilariously edited Serbian Empire article on Wikipedia",
        "author": "Neutral_Fellow",
        "url": "https://www.reddit.com/r/badhistory/comments/7ddh48/this_hilariously_edited_serbian_empire_article_on/",
        "text": "[removed]",
        "created_utc": 1510849457,
        "upvote_ratio": ""
    },
    {
        "title": "16 November Small BadHistory Thread",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/7dbw15/16_november_small_badhistory_thread/",
        "text": "This is a place to dump all the bad history you run across that isn't worth doing a whole post about. Rules for the small posts are slightly different:\n1.) Don't link directly to the post/comment itself\n2.) Please quote it though (or at least summarise it if it's a real life bad history moment)\n3.) As usual, no username call-outs unless you want to bring it to the attention of an expert on the topic so they can add their 2 nummi.\n",
        "created_utc": 1510833071,
        "upvote_ratio": ""
    },
    {
        "title": "Wondering Wednesday, 15 November 2017, Pyrrhic Victories in History",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/7d3l9e/wondering_wednesday_15_november_2017_pyrrhic/",
        "text": "Sometimes the spoils of war are spoiled by the wars leading up to it. The namesake of this type of victory is of course Pyrrhus of Epirus, who won every war against the Romans but lost so much manpower doing so, he had to give up. But he was far from the only one to run into this problem. What are some other great examples from history where the achieved goal turned out to be not worth it anymore after the effort needed to gain it. This doesn't just have to be about wars, it can also be about scientific discovery, diplomatic efforts, a construction project, or whatever else you can think of.    \n \nNote: unlike the Monday and Friday megathreads, this thread is *not* free-for-all. You are free to discuss history related topics. But please save the personal updates for Mindless  Monday and Free for All Friday! Please remember to np link all links to Reddit if you link to something from a different sub, lest we feed your comment to the AutoModerator. And of course no violating R4! Also if you have any requests or suggestions for future Wednesday topics, please let us know via modmail. \n",
        "created_utc": 1510746671,
        "upvote_ratio": ""
    },
    {
        "title": "What are historical myths that have become commonly regarded as absolute established fact?",
        "author": "The740",
        "url": "https://www.reddit.com/r/badhistory/comments/7cx0qj/what_are_historical_myths_that_have_become/",
        "text": "Seemingly every time there's a topic that could be even remotely related to history on a default subreddit, there are a handful of common historical myths that are bandied about as fact.  I'm not even talking about ones where actual history is used in an argument against bad history, but rather ones where the bad history seems to be unanimously accepted as the actual one.\n\nThere was [a thread yesterday on AskReddit](https://np.reddit.com/r/AskReddit/comments/7cmydg/nonamericans_of_reddit_what_common_american/?utm_content=title&amp;utm_medium=user&amp;utm_source=reddit) that encouraged non-Americans to ask questions about American culture.  It goes without saying that nearly everything that's regarded as backwards is \"lol because Puritans and Puritan roots\", which is so immensely stupid and so incredibly *wrong*.  Yet over time, it's become commonly-accepted to the point where questioning these myths just doesn't seem to happen.  This stands in contrast to something like, say, Confederate apologia - which is at minimum attacked every time it's brought up as established fact.\n\nIs there anything in your field of study, or in a field that you're at least knowledgeable about, in which outright myths have become commonly regarded as established fact?",
        "created_utc": 1510679236,
        "upvote_ratio": ""
    },
    {
        "title": "King Tut and the amazing Egyptology found in the Adam West Batman.",
        "author": "SilverRoyce",
        "url": "https://www.reddit.com/r/badhistory/comments/7ct7lz/king_tut_and_the_amazing_egyptology_found_in_the/",
        "text": "While some deluded people say Harley Quinn is the greatest Batman villain to emerge outside of the comics, every sane person knows the true answer is [the star of the most recent batman movie]( https://youtu.be/b0X1r9v5XfI?t=36) King Tut! \n\nHe’s so great we don’t need to see his origin story, it’s told to us in exposition because, apparently Batman has already fought this fiendish foe. A Yale professor of Egyptology, William Omaha McElroy gets a nasty bump on the head during a student riot which convinces him he is King Tut and that Gotham is Thebes. \n\nHere’s someone’s attempt to transcribe the Script to King Tut’s first episode: The Curse of Tut\nhttps://www.springfieldspringfield.co.uk/view_episode_scripts.php?tv-show=batman-1966&amp;episode=s01e27\n\nand here’s an in depth summary of the episode if you want something easier to read. http://batman.wikia.com/wiki/The_Curse_Of_Tut\n\n[A giant Sphinx emerges in central Park and introduces us to King Tut]\n&gt;King of the Nile\n\nThis isn’t right. The “Sphinx” is clearly stating the royal titles of King Tut. This is not one of them. Let’s take a look at the royal titles of other [18th dynasty Egyptian rulers.](https://en.wikipedia.org/wiki/Ancient_Egyptian_royal_titulary)\n\n* Hatshepsut\nHorus name: Wesretkau, \"Mighty of Kas\" || Nebty name: Wadjrenput, \"She of the Two Ladies, Flourishing of years\" ||  Golden Horus: Netjeretkhau, \"Divine of appearance\" (Netjeret is the feminine form of netery meaning 'godly' or 'divine', and khau, 'appearances') ||Praenomen: Maatkare, \"Truth [Ma'at] is the Ka of Re\" || Nomen: Khnumt-Amun Hatshepsut, \"Joined with Amun, Foremost of Noble Ladies\"\n\n\n* Thutmose III\nHorus name: Kanakht Khaemwaset, \"Horus Mighty Bull, Arising in Thebes\" || Nebty name: Wahnesytmireempet, \"He of the Two Ladies, Enduring in kingship like Re in heaven\" || Golden Horus: Sekhempahtydjeserkhaw, \"Horus of Gold Powerful of strength, Sacred of appearance\" || Praenomen: Menkheperre, \"He of the Sedge and the Bee, Enduring of form is Re\" || Nomen: Thutmose Neferkheperu, \"Son of Ra, Thutmose, beautiful of forms\"\nOr \n\n* “Horus Might Bull Arising in Thebes, He of the two ladies, enduring in kingship like Re in heaven, Horus of Gold Powerful of strength, Sacred of appearance He of the Sedge and the Bee, Enduring of form is Re.” \n\n“King of the Nile” is the name of a slot machine so...*[shrug emoji]*\n\n&gt; “It is written in the stars that on this day shall the great King of the Nile rise up from the tomb and he shall claim his kingdom of Gotham City, and all who oppose him shall be smitten dead.”\n\nThis is also somewhat confusing given that the nature of *all* Pharaohs is already tied up with the concept of death and rebirth given their connection with Osiris established during the Old Kingdom. What does this bodily resurrection imply about a secret change in the metaphysics of the Egyptian religion? Tell me more!\n\n\n[Batman and the police initially think this is a stunt]\n&gt; Is there no limit to the brazen effrontery of the press agent? I'll put paid to their stunts.\n\nThis is not bad history\n\n&gt; [Bruce Wayne promised the Gotham Museum he would read through] This new volume by a Professor Red on ancient Egyptian cat worship cults.\n\nA library of congress search (limited to 1950-1970 author “Red” keyword “Egypt” or “cats”) found 0 results. \n\n[They Find out this is not a stunt]\n\n&gt; we're faced with that arch criminal, King Tut. Gosh! And everyone thought he died in that warehouse fire. We were mistaken it seems. He's risen like a phoenix from the ashes to.\n\nThe show correctly identified the Phoenix (and Cats) as Egypt-related animals. Folks, this is as good as it is going to get.\n\n&gt; So-our mad pharaoh has found himself a Nefertiti.\n\n\nIt’s important to remember that Nefertiti was the wife of Akhenaten. King Tut is the son of Akhenaten. She’s not his mother but “has found himself a Nefertiti” suggests a scandalous relationship the show never develops. To be fair Tut’s mom was married to her brother and King Tut’s wife was his father’s wife’s daughter so it’s at least plausible our “Nabob of the Nile” (a wonderful badhistory title from a future episode) was thinking in these terms, but he couldn’t find the “right” girl.\n\n\n&gt; Royal Scrivener\n\nI’m not sure why the writers chose to go with “Scrivener,” a Latin word when Scribe basically works. Nakhtim is listed in the Tomb of King Tut as the Royal Scribe (or “Ses”). [Indeed]( http://www.carnegiemnh.org/online/egypt/scribes.html)\n\n* Even though much ancient Egyptian written material is still extant, it surely represents only a fraction of what originally existed. To produce such a mass, there must have been an impressive arsenal of scribes. In fact the word sesh, \"scribe,\" was among the most frequently used titles in ancient Egypt. It is also one of the earliest recorded, and there are representations of scribes carrying the tools of their craft (pigments, water pot, and pen) over their shoulders from various periods beginning with the Old Kingdom.\n\n\n[Tut refers to Batman as a] winged rodent\n\nAncient Egyptians knew what bats were (and, you know, there’s a God coincidentally named Bat). Huge opportunity wasted for either a pun or a deep dive given bats were used in ancient Egyptian medicine.\n\n&gt; Great thorn of Thebes.\n&gt; Nemesis of the Nile.\n\nI can’t find the video of this scene so I’m just going to assume it’s about Batman instead of King Tut.\n  \n\n&gt; A rather good imitation of the Fourth Dynasty sphinx of Giza.\n\n\nThe Good: Fourth Dynasty is correctly identified…The Bad: [This]( http://mindlessones.com/wp-content/uploads/2015/12/vlcsnap-2015-07-20-21h44m25s694-300x240.png) is not a good imitation of the [Great Sphinx]( https://en.wikipedia.org/wiki/Great_Sphinx_of_Giza)\n\n&gt; What does Great Ra, God of the Sun have to inform us? Dynamic Duo escaped.\n\nRa isn’t informing them. Pharaohs did not grant minions the status of Gods.\n\n&gt; Curses of Amenhotep! Your pharaoh speaks.\n\n~~*Which* Amenhotep? The only Amenhoteps I know of are other 18th century Pharaohs the last of which was also Akhenaten. Googling found a few others but this is clearly what the writer is referring to. “Curses of my Grandfather! Your pharaoh speaks” doesn’t really sound the same.~~ \n\nOn the other hand: there was an 18th dynasty administrator named Amenhotep (who served under… Amenhotep III) and he left us a full curse on those who would disturb his tomb\nI think our Professor should simply recite the curse by heart instead of saying *Curses of my Grandfather’s Minister* Your Pharaoh speaks! That isn’t a very impressive statement. That being said it’s a pretty impressive curse. Here’s what I could find online and in \"The Curse of the Pharaohs' Tombs: Tales of the unexpected since the days of Tutankhamen” \n\n* [grave robbers would] lose their earthly positions and honors, be incinerated in a furnace in execration rites, capsize and drown at sea, have no successors, receive no tomb or funerary offerings of their own, and their bodies would decay because they will starve without sustenance and their bones will perish\n\n&gt; Slaves and Helot swordsmen prepare for action.\n\nAgain, Helots are a Greek term. The Spartans had Helots as the term ultimately derives from \na Peloponnesian location whose inhabitants were enslaved. Also the idea that the New Kingdom’s soldiers were merely slaves is wrong. There were professional soldiers and conscripts.\n\n&gt; It's a costume of the Fourteenth Dynasty.\n&gt;King Tut's dynasty.\n\n#**NO!**\n#**NO!**\n\nKing Tut is a member of the *18th* Dynasty not the 14th. This isn’t Mercia where the dynasties are grouped by first names, they’re literally numbered! Just use the \t~~Bat-computer~~ [Editor’s note: The Bat-computer was first introduced in 1967 while the Curse of Tut aired on April 13th, 1966. We apologize for the error].\n\n&gt; All we know about this particular gentleman is that he was a king in the Fourteenth Dynasty and reigned in 1500 BC.\n\nThe 14th Dynasty is a doubly bad choice as the capital was not even Thebes. It also ends in 1650 BC a full 150 years before Batman claims. The 18th Dynasty (Tut’s Dynasty) reigned from 1550 to 1292. Thus *if* Tut was a 14th Dynasty Pharaoh then this would mess up the earlier idea that he saw Gotham as Thebes.\n\n&gt; Phase 2 has worked perfectly. Naturally, it was foreseen in the scrolls. \n\nScroll-magic connection seems to check out [but I haven’t fully vetted this]\n\n&gt;To the palace with this Helot.\n\nStill wrong\n\n&gt; How many times must I tell you queens consume nectar and ambrosia, not hot dogs? So I get hungry. Living on nothing but figs and dates and pomegranates.\n\nNectar and Ambrosia are ancient Greek ideas that do not exist in Ancient Egyptian rulers. “figs, dates and pomegranates” are, again drawing on stereotypes about Ancient Greece. Ancient Egyptian Gods (and rulers) at nice food but nothing qualitatively different like nectar and ambrosia.\n\n\n&gt;&gt;Dr Joyce Tyldesley is a senior lecturer in the Faculty of Life Sciences at the University of Manchester, where she writes and teaches a number of Egyptology courses.\n\n* [While the elite dined off meat, fruit, vegetables, and honey-sweetened cakes enhanced by the finest of wines, the poor were limited to a more monotonous diet of bread, fish, beans, onions and garlic washed down with a sweet, soupy beer.](http://www.historyextra.com/feature/ancient-egypt/history-extra-explains-what-did-people-eat-ancient-egypt)\n\nand\n\n&gt;&gt;[Daily Mail reports:](http://www.dailymail.co.uk/sciencetech/article-1253842/The-sacred-junk-food-Egyptian-pharaohs.html#ixzz4yN0GLpWT) \n\n* The food of the gods in Ancient Egypt was more likely to guarantee an early grave than immortality, scientists have discovered. Delicious banquets offered to the deities and eaten by Egyptian priests and their families, were laden with artery-clogging saturated fat, research published in The Lancet has shown. The evidence comes from inscriptions on temple walls and from computer X-rays of the priests' mummified remains - which show signs of damaged arteries and heart disease. \n\n.\n\n&gt;&gt;[askhistorians user](https://www.reddit.com/r/AskHistorians/comments/67y4ad/if_i_were_to_have_lived_in_ancient_egypt_what/dgz4fbq/?st=j2cnai8a&amp;sh=751140a5) /u/cleopatra_philopater. Who also goes into more detail on what ancient Egyptians ate. \n\n* Thanks to cows, goats and sheep, we can add milk, butter, cheese, and cream to the list. Both archaeological and literary evidence supports the idea that dairy was an important part of the Egyptian diet from the Early Dynastic into the Roman period. Evidently milk was drunk and used in recipes but there were also apparently different types of cheeses the number of which only expanded over time but the Pharaoh probably would have been sampling a good deal more variety than that Egyptian everyman.\n\n\n\n\nTL;DR nothing I could find supports the “ambrosia or dates” idea and a lot of stuff seems to contradict it. \n\n[Bruce Wayne is captured by King Tut’s goons]\n\n&gt; \"The great King of the Nile has risen from the sands of time \"to reclaim his lost kingdom. 'The next voice you will hear will be King Tut himself. \"' Loyal subjects and Helots this is your king.\n\nWhat happened to the slaves? Why are slaves local but helots not? Same old badhistory.\n\n \n&gt; Holy cliffhanger! Bruce Wayne hurtling toward an awesome abyss! What will be his fate? How can he possibly be saved this time? Be in front of your Bat-sets tomorrow night.\n\n&gt;Same time.\n\n&gt;Same channel.\n\n&gt;**One hint the most horrendous is yet to come.**\n\n&gt;Batman Batman Batman Batman Batman Batman Batman Batman Batman Batman Batman\n\n**********\n",
        "created_utc": 1510634272,
        "upvote_ratio": ""
    },
    {
        "title": "The Adam West Batman Series is a 100% accurate source of Ancient Egyptian History (or how I learned to stop worrying and love Theban Pebble Torture)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/7ct6c3/the_adam_west_batman_series_is_a_100_accurate/",
        "text": "[removed]",
        "created_utc": 1510633899,
        "upvote_ratio": ""
    },
    {
        "title": "The Adam West Batman Series is a 100% accurate source of Ancient Egyptian History (or how I learned to stop worrying and love Theban Pebble Torture",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/7ct65k/the_adam_west_batman_series_is_a_100_accurate/",
        "text": "[deleted]",
        "created_utc": 1510633846,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone take a look at this list of things supposedly invented by Muslims?",
        "author": "Seutossic",
        "url": "https://www.reddit.com/r/badhistory/comments/7cso1q/can_someone_take_a_look_at_this_list_of_things/",
        "text": "I found [this](https://iwsmt-content-ok2nbdvvyp8jbrhdp.stackpathdns.com/622013165983.jpg) screenshot of a Tumblr post somewhere on the Internet and was immediately suspicious. Of course, the Islamophobia the post is predicated on is indefensible, but I have some serious qualms about the list. Music? Seriously? Music has been around for as long as humans have been around.  We have discovered bone flutes and whatnot that are literally tens of thousands of years old. And chess was invented in India during the zenith of the Gupta Empire, a political entity that was distinctly Hindu and not Muslim. Although it spread to Persia and received much of its form there, the modern game of \"chess\" was perfected in southern Europe. I don't even think cowpox is found in regions where Islam is predominant, didn't it originate in Europe? And wasn't Braille invented by, you know, Louis Braille? a Frenchman? And fucking bathing? Bathing is a basic human instinct, nobody freaking invented it. \n\nObviously, some things in the list were invented by Muslims, such as algebra and Hindu-Arabic numerals, but a lot of this seems fishy. Is there anything else you guys can look at and potentially disprove?",
        "created_utc": 1510628561,
        "upvote_ratio": ""
    },
    {
        "title": "[Request] This list of things supposedly invented by Muslims.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/7cslqy/request_this_list_of_things_supposedly_invented/",
        "text": "[removed]",
        "created_utc": 1510627949,
        "upvote_ratio": ""
    },
    {
        "title": "\"We should have taken every step possible to help integrate the black community into mainstream society and culture. What we did instead was to attempt to integrate mainstream society and culture into the black community.\" - A reactionary take on American history",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/7cr0g8/we_should_have_taken_every_step_possible_to_help/",
        "text": "[deleted]",
        "created_utc": 1510613202,
        "upvote_ratio": ""
    },
    {
        "title": "My teacher's pseudo history",
        "author": "HarbingerofWalpole",
        "url": "https://www.reddit.com/r/badhistory/comments/7cpi0c/my_teachers_pseudo_history/",
        "text": "Could somebody please pick apart my teacher's claim that Africans had consistent trade with Pre-Columbian America? He also claims that Columbus had black navigators for that very reason and that Native Americans have darker skin because of intermingling with West African traders. Please don't be too mean, I do really like this teacher but I also believe he is indescribably wrong on this issue. ",
        "created_utc": 1510600871,
        "upvote_ratio": ""
    },
    {
        "title": "Mindless Monday, 13 November 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/7clvzb/mindless_monday_13_november_2017/",
        "text": "Happy (or sad) Monday guys!\n\nMindless Monday is generally for those instances of bad history that do not deserve their own post, and posting them here does not require an explanation for the bad history.  That being said, this thread is free-for-all, and you can discuss politics, your life events, whatever here. Just remember to np link all links to Reddit and don't violate R4, or we human mods will feed you to the AutoModerator.\n\nSo, with that said, how was your weekend, everyone?\n",
        "created_utc": 1510563060,
        "upvote_ratio": ""
    },
    {
        "title": "Sunday Studies, 12 November 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/7cf09h/sunday_studies_12_november_2017/",
        "text": "Find a book you like? Read an intriguing article from JSTOR last week? Want to discuss and get recommendations for new books? This is the thread for it! Come one, come all, please let us know what you've been reading this week!\n\nNote: unlike the Monday and Friday megathreads, this thread is *not* free-for-all. You are free to discuss books that you've read, articles you liked, and similar. But please save the personal updates for Mindless Monday! \n",
        "created_utc": 1510487463,
        "upvote_ratio": ""
    },
    {
        "title": "/r/Communism claims that the Soviet Union didn't invade Poland and that no Polish were ever killed by Soviet troops.",
        "author": "JJAB91",
        "url": "https://www.reddit.com/r/badhistory/comments/7c94wb/rcommunism_claims_that_the_soviet_union_didnt/",
        "text": "[removed]",
        "created_utc": 1510415910,
        "upvote_ratio": ""
    },
    {
        "title": "The Roman and Greek empires collapsed because of homosexuality - Nixon",
        "author": "Reszi",
        "url": "https://www.reddit.com/r/badhistory/comments/7c1wtl/the_roman_and_greek_empires_collapsed_because_of/",
        "text": "[removed]",
        "created_utc": 1510329212,
        "upvote_ratio": ""
    },
    {
        "title": "How is Roger Collins' \"Early Medieval Europe, 300-1000\" viewed? Is it Outdated?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/7c1gt1/how_is_roger_collins_early_medieval_europe/",
        "text": "[removed]",
        "created_utc": 1510324830,
        "upvote_ratio": ""
    },
    {
        "title": "Free for All Friday!, 10 November 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/7c0msv/free_for_all_friday_10_november_2017/",
        "text": "It's Friday everyone, and with that comes the newest latest Free for All Friday Thread! What books have you been reading? What is your favorite video game? See any movies? Start talking!\n\nHave any weekend plans? Found something interesting this week that you want to share? This is the thread to do it! This thread, like the Mindless Monday thread, is free-for-all. Just remember to np link all links to Reddit if you link to something from a different sub, lest we feed your comment to the AutoModerator. No violating R4!\n",
        "created_utc": 1510314661,
        "upvote_ratio": ""
    },
    {
        "title": "Request: Can someone pick apart this statement i found in a askreddit post about colonialism benefiting sub-Saharan africa https://imgur.com/a/LHugQ",
        "author": "trujilliopablo",
        "url": "https://www.reddit.com/r/badhistory/comments/7bya5e/request_can_someone_pick_apart_this_statement_i/",
        "text": "I'm gonna be honest we don't learn much about the effects of colonialism in Africa much in Argentina, we focus heavily on its effects in South America. Was it similar in sub-Saharan Africa? Not trying to be ignorant but I can't name any great civilizations from there but from here we're taught the Spanish destroyed and/or colonized the Muisca, the Incan, the Chibchan and the K'iche' people. ",
        "created_utc": 1510281132,
        "upvote_ratio": ""
    },
    {
        "title": "09 November Small BadHistory Thread",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/7bstop/09_november_small_badhistory_thread/",
        "text": "This is a place to dump all the bad history you run across that isn't worth doing a whole post about. Rules for the small posts are slightly different:\n1.) Don't link directly to the post/comment itself\n2.) Please quote it though (or at least summarise it if it's a real life bad history moment)\n3.) As usual, no username call-outs unless you want to bring it to the attention of an expert on the topic so they can add their 2 nummi.\n",
        "created_utc": 1510228262,
        "upvote_ratio": ""
    },
    {
        "title": "\"The Myth of the Andalusian Paradise\" by Dario Fernandez Morera",
        "author": "hobblingcontractor",
        "url": "https://www.reddit.com/r/badhistory/comments/7bryjn/the_myth_of_the_andalusian_paradise_by_dario/",
        "text": "Okay, obligatory request for the mods to delete this if it isn't appropriate, but I'm not sure where else to post for a decent discussion.  \n\nThe full title is, \"The Myth of the Andalusian Paradise: Muslims, Christians, and Jews under Islamic Rule in Medieval Spain.\"  Based upon what I've read in the reviews I'm PREEEEEEETTY CERTAIN that this contains a  healthy heaping of BadHistory.  Unfortunately I'm not willing to expend the time or money involved in finding out for myself.  Not when there's people here willing to risk irreparable harm to their liver on our behalf, who might actually have seen this book in the wilds of a library.\n\nSo.  Help?  Is this worth reading?  Is there any new relevant information or is it exactly as it appears?\n\nedit: Just to be clear to everyone, my information on this subject is a decade or more out of date.  History DOES CHANGE as more primary sources are found.  ",
        "created_utc": 1510214159,
        "upvote_ratio": ""
    },
    {
        "title": "Wondering Wednesday, 08 November 2017, Buns, Perms, and Steel: Hair in History\"",
        "author": "Dirish",
        "url": "https://www.reddit.com/r/badhistory/comments/7blz6o/wondering_wednesday_08_november_2017_buns_perms/",
        "text": "Hair styles and decorations vary wildly throughout history. From the elaborate styling of the Assyrians to the simple, but oddly cut, hair of the Norman knights, hairstyles were often fashion statements, other times restricted by rules and regulations, and sometimes deliberately hidden from view. On top of that, people have used wigs, jewelry, hats and other covers to draw attention to their heads. What are some of your favourite hairstyles from history, have you tried any historical cuts yourself, or is there a style you would love to try? Alternatively you can talk about headwear, wigs, and hair jewelry or tell us some fascinating background stories on how certain styles became fashionable, fell out of fashion, or were used to send political messages.   \n\nNote: unlike the Monday and Friday megathreads, this thread is *not* free-for-all. You are free to discuss history related topics. But please save the personal updates for Mindless  Monday and Free for All Friday! Please remember to np link all links to Reddit if you link to something from a different sub, lest we feed your comment to the AutoModerator. And of course no violating R4! Also if you have any requests or suggestions for future Wednesday topics, please let us know via modmail. \n\n[mod note] sorry about this, looks like AM didn't update the schedule despite sending a confirmation.",
        "created_utc": 1510154602,
        "upvote_ratio": ""
    },
    {
        "title": "State of the Sub, 08 November 2017, Feedback Outcome and Rule Changes",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/7bktv0/state_of_the_sub_08_november_2017_feedback/",
        "text": "[removed]",
        "created_utc": 1510141866,
        "upvote_ratio": ""
    },
    {
        "title": "\"Jesus was represented more or less accurately as an ethnically Jewish Arab man up until the reign of Pope Alexander VI\"",
        "author": "Enleat",
        "url": "https://www.reddit.com/r/badhistory/comments/7b7mnd/jesus_was_represented_more_or_less_accurately_as/",
        "text": "[The post in question.](https://i.imgur.com/6hhb6hg.png)\n\nThe OP of the post has long since deleted the post and i've decided to screencap it rather than simply link to someone's tumblr and potentially open them to harrasment.\n\nTo put it bluntly, this post is simply incorrect.\n\nEspecially egregious is the idea that the Western depictions of Jesus stem from the likeness of Cesare Borgia, since depictions of Jesus similar to him existed for decades before he was born. [This for example, is from 1449](https://upload.wikimedia.org/wikipedia/commons/b/b0/Baptism-christ.jpg). Cesare Borgia was born in 1475.\n\nDepictions of Jesus as a a snow-white, long haired man began very early, as early as the 5th century.\n\n[Roman Mosaic from 410 AD.](https://upload.wikimedia.org/wikipedia/commons/e/e2/Apsis_mosaic%2C_Santa_Pudenziana%2C_Rome_W3.JPG)\n\n[A depiction of Jesus from the 6th century AD.](https://upload.wikimedia.org/wikipedia/commons/4/4a/Spas_vsederzhitel_sinay.jpgg)\n\n[From a 12th century illuminated manuscript from England.](https://upload.wikimedia.org/wikipedia/commons/e/ee/AberdeenBestiaryFolio004vChristInMajesty_%28cropped%29.jpg)\n\n[From a 5th century mosaic.](https://upload.wikimedia.org/wikipedia/commons/c/cc/Christ_treading_the_beasts_-_Chapel_of_Saint_Andrew_-_Ravenna_2016.jpg)\n\n\nJesus was, around the world, depicted in the style of any particular area, and people tended to imagine Jesus as they saw themselves and the people around them. \n\nIt's without a doubt of course that this did, and still does, influence and was influenced by racial politics. \n\nI do believe personally that Medieval Europeans would've found the depiction of Jesus with 'Jewish' or Semitic characteristics as offensive, or at the very least alien, given the fervent anti semitism of the time. But the idea that the image of a 'white' Christ was an invention of the 16th century is very easily proven as false.\n\n",
        "created_utc": 1509997804,
        "upvote_ratio": ""
    },
    {
        "title": "Mindless Monday, 06 November 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/7b3yze/mindless_monday_06_november_2017/",
        "text": "Happy (or sad) Monday guys!\n\nMindless Monday is generally for those instances of bad history that do not deserve their own post, and posting them here does not require an explanation for the bad history.  That being said, this thread is free-for-all, and you can discuss politics, your life events, whatever here. Just remember to np link all links to Reddit and don't violate R4, or we human mods will feed you to the AutoModerator.\n\nSo, with that said, how was your weekend, everyone?\n",
        "created_utc": 1509958262,
        "upvote_ratio": ""
    },
    {
        "title": "My wife was so misled. American education is the worst.",
        "author": "CupBeEmpty",
        "url": "https://www.reddit.com/r/badhistory/comments/7b3eys/my_wife_was_so_misled_american_education_is_the/",
        "text": "[removed]",
        "created_utc": 1509949648,
        "upvote_ratio": ""
    },
    {
        "title": "People can't draft WWI maps, exhibit #317:",
        "author": "Watchung",
        "url": "https://www.reddit.com/r/badhistory/comments/7b3bpa/people_cant_draft_wwi_maps_exhibit_317/",
        "text": "The Smithsonian Channel recently aired a documentary called Americans Underground:Secret City of WW1, focusing on the exploration of an underground quarry used as a bunker during the war, and the attempt to track down the descendants of the men that sought sanctuary there. That isn't focus of this post however. Instead, it's of the map the episode opens with when giving an overview of the conflict. And it's... interesting:  \n\nhttps://i.imgur.com/XgIZnqx.jpg  \n\nhttps://i.imgur.com/6kr7agw.jpg  \n\n*I've had to split it into two parts, since it pans up.*  \n\nOkay, where to start? First off, it's not consistent about whether or not it has borders between allied nations - Germany and Austro-Hungary don't, but France, Italy, and Belgium do. And it isn't clear what year it's supposed to represent. But, plowing ahead as best I can, here's what immediately leaps out to me:\n\n* The existence of an independent Ireland and Finland (sans Aland Islands). \n*  The Zuiderzee seems to have been fully reclaimed, despite the land not being drained by the Netherlands until post-WWII (well, mostly). Also it looks like the planned Markerwaard project went ahead. \n* The Balkan Wars seem to have gone south for most parties - Bulgaria performed so poorly, it was annexed by the Ottomans outright, Greece lost out on any hoped for gains to the northeast, losing Macedonia to Serbia. However, Serbia was kind enough to partition Albania with Greece, who gained Northern Epirus and then some. \n* The Ottoman Empire halts around the 33rd Parallel. But at least it still has Cyprus and the Dodecanese. \n* Everything east of Algeria is controlled some unknown neutral mega-state. \n* Spanish Morocco doesn't exist - at least that will spare the Spanish a great deal of heartache a few years down the road. ",
        "created_utc": 1509948395,
        "upvote_ratio": ""
    },
    {
        "title": "What are some bad economics history that gets thrown around a lot?",
        "author": "neoliberal_buzzkill",
        "url": "https://www.reddit.com/r/badhistory/comments/7b2zhp/what_are_some_bad_economics_history_that_gets/",
        "text": "What are some bad economics history that gets thrown around a lot by leftists/socialists? What about classical liberals/centrists? What about conservatives and right-wing populists? What about libertarians and anarchists? What about some bad economics history that gets thrown around by the public in general?",
        "created_utc": 1509943952,
        "upvote_ratio": ""
    },
    {
        "title": "A very well-thought-out critique of why German people shouldn't be allowed to exist",
        "author": "ColeYote",
        "url": "https://www.reddit.com/r/badhistory/comments/7az8he/a_very_wellthoughtout_critique_of_why_german/",
        "text": "[Zelda](https://np.reddit.com/r/trendingsubreddits/comments/7apaqv/trending_subreddits_for_20171104_rwwii/dpbs9j2/?context=3)\n\n&gt; These Are German Contributions To Civilization\n\n&gt; Alaric, German king:\n&gt; Precipitated the fall of the Roman empire, plunging Europe into the Germanic dark ages\n\n&gt; Death toll: Untold millions\n\n&gt; Martin Luther, German priest:\n\n&gt; Invented Protestantism, putting an end to Christendom and plunging Europe into decades of religious war\n\n&gt; Death toll: 15 Million\n\n&gt; Karl Marx, German philosopher:\n\n&gt; Unleashed Communism upon the world, destroying civilization wherever it took root.\n\n&gt; Death toll: 100 Million\n\n&gt; Wilhelm II, German emperor:\n\n&gt; Declared the first world war, causing immeasurable destruction and misery\n\n&gt; Death toll: 35 Millions\n\n&gt; AdoIf HitIer, German fuehrer\n\n&gt; Declared the second world war to finish the job, almost \nsucceeded, but was defeated by Anglo-Saxons\n\n&gt; Death toll: 50 Million\n\n&gt; Can humanity afford the continued existence of the German people?\n\nSo many problems...\n\n* Alaric: Okay, first off, the Visigoths never had anything to do with Germany. They were a German*ic* tribe, but that doesn't make them any more German than the English. They existed in Eastern Europe before taking Rome, and the Iberian Peninsula after. So no, Alaric was not a German king. Secondly, the western Roman Empire was already well into decline by the time Rome fell, and it continued to exist for another 66 years after Alaric's death. So no, he did not precipitate the fall of the empire. Thirdly, even if he *had* ended the Roman Empire, blaming him for all deaths in the medieval era is *fucking insane.*\n* Martin Luther: he did NOT \"invent\" protestantism. While popular thought is that his 95 Theses kicked off the reformation, protestants had existed well before his birth, most notably the Waldensians and Hussites. Furthermore, the reformation did not \"put an end to Christendom,\" even in the traditional Catholic sense of the word with the Church as a primary political authority. You want to blame anything for that, blame the enlightenment. Thirdly, putting all the blame for the European wars of religion on Protestants is, at the very least, highly questionable.\n* Karl Marx: I'd go into how Russian and Chinese communism is a perversion of Karl Marx's ideas, but that's probably a better topic for badpolitics. Still, putting those deaths on Marx for publishing a philosophy paper is unwarranted.\n* Wilhelm II: While Germany was obviously a major player in World War I, it started thanks to tensions between Serbia and Austria-Hungary which ultimately resulted in the latter declaring war on the former. Germany only got involved after Russia declared support for Serbia.\n* Adoif [sic] Hitier [sic]: I'm not gonna dispute the deaths this time, but I will say that \"[he] almost succeeded, but was defeated by **Anglo-Saxons**\" is both a silly way to refer to the Allies and seriously downplaying the role of the Soviet Union, the not-England parts of the UK, and various colonial nations.",
        "created_utc": 1509906056,
        "upvote_ratio": ""
    },
    {
        "title": "Sunday Studies, 05 November 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/7ax5b0/sunday_studies_05_november_2017/",
        "text": "Find a book you like? Read an intriguing article from JSTOR last week? Want to discuss and get recommendations for new books? This is the thread for it! Come one, come all, please let us know what you've been reading this week!\n\nNote: unlike the Monday and Friday megathreads, this thread is *not* free-for-all. You are free to discuss books that you've read, articles you liked, and similar. But please save the personal updates for Mindless Monday! \n",
        "created_utc": 1509882662,
        "upvote_ratio": ""
    },
    {
        "title": "Julius Caesar made up Jesus Christ with Cleopatra, then plotted the World Wars",
        "author": "cleopatra_philopater",
        "url": "https://www.reddit.com/r/badhistory/comments/7awfy1/julius_caesar_made_up_jesus_christ_with_cleopatra/",
        "text": "Oh joy. This is probably my favourite insane theory of all time because it is elegant in its simplicity. Jesus Christ is Ptolemy Caesar and Christianity is a Romano-Egyptian sham. [You can see the NP link here](https://np.reddit.com/r/assassinscreed/comments/7aprmv/the_redpill_truth_about_caesar_and_cleopatra/?st=j9ls25f4&amp;sh=94f93989) but this joyous ramble was posted to the Assassins' Creed subreddit today.\n\n&gt;Jesus Christ was Caesarion, the son of Julius Caesar and Cleopatra. In 46 BC Julius Caesar changed the calendar from the 13 month system to his new adapted 12 month version, using his family names as some of the months, Augustus (august) and Julius or Julie (July).\n\nThis is a pretty simplistic understanding of Julian calendar reforms, not only was the old Roman calendar usually a 12 month calendar except for leap years, but the new calendar imposed by Julius Caesar standardised the length of the year to align more closely with the solar year and last about 365 days. This was accomplished with the aid of the Alexandrian astronomer Sosigenes among other mathematicians and scholars. I could go on but calendars bore me. July was not even named by Julius Caesar, it was named after him following his assassination and posthumous status as a divine figure. Augustus was also never one of Julius Caesar's \"family names\", it was a title taken by his adopted son Octavian who the month was actually named for. I am not sure what this has to do with anything but let us keep going.\n\n&gt;The curious thing about this is if you look closely everything pertaining to ancient Egypt is BC while everything pertaining to the Holy Roman Empire is AD. \n\nCuriously if you look at Hellenistic and Assyrian history you will find that is BC, but the United States is AD. Coinincedencenences??1?\n\n In all seriousness, if we count the reign of Augustus and the conquest of Egypt as the start of the Roman Empire than it began around 30 BCE with Cleopatra's suicide or 27 BCE with the Octavian taking up the title Augustus. Meanwhile the Holy Roman Empire is still a wannabe Germanic kingdom and *not* a legitimate successor to the Roman Empire, although it is technically \"AD\" so I will give them that. \n\nAlso a lot of \"Ancient Egyptian\" things survived into the Common Era. Egyptian cultic practices, hieroglyphs, architecture, wisdom literature, fashion, and even royal titulature as Egyptian religious contexts' sometimes describe the Roman Emperors in Pharaonic terms.\n\n&gt;That is because the royal bloodlines who have ruled over mankind for thousands of years have established their empires using religion and covering up history to maintain power of their empires during times of uncertainty. \n\nOh dear...\n\n&gt;Therefore 45 BC is the same as 1 AD and if you look up anything that happened between 21 BC and 1 AD you will find very little information of any events. That is because during this time the Roman Empire was fully established and that is the reason for this discrepancy.\n\nSorry what? I am having difficulty understanding this, if 45 BC is 1 AD then the whole \"Roman Empire is Ad while Egypt is BC\" thing was meaningless but how is it possible that the entire drama of the Liberators' War, Roman-Parthian War, and Final War of the Roman Republic are fabricated? Even if we look at Egypt exclusively we have successive famines, outbreaks of plague and rebellions which occurred between 44 BCE and 1 AD. Even if we look solely at stelae and papyri from 44 to 30 BCE we know that there were droughts, an outbreak of plague, and the wheels of time just kept turning in general as villages made dedications to gods and local elites, officials patronised temples, rebels rose and fell. Even if we look exclusively at the first few years of Augustus' rule of Egypt there were no fewer than three prefects between 30 and 26 BCE, numerous revolts, and the Meröitic Nubian kingdom actually briefly annexed the Thebaid. In 22 BCE a peace between Rome and Meröe was agreed upon when Queen Amenirenas and Augustus agreed upon the former border between the Ptolemaic kingdom and the Meröitic kingdom. These are just things I can list off the top of my head, but it turns out Wikipedia has an article on the [10s BC](https://en.wikipedia.org/wiki/10s_BC) and also one on the [last decade of the 1st Century BC](https://en.wikipedia.org/wiki/0s_BC). As it turns out, a lot of things happened and were recorded.\n\nWhat gets me about this is the sheer arrogance that if the Romans decided to falsify their chronology, the whole world would be duped. People outside of the Roman Empire in Asia, Europe and Africa were chronicling events completely separate from the Roman Empire. But because history equals \"Popular Western Civilisations\" this seems plausible.\n\n&gt;Julius Caesar was stabbed to death by members of his own council. After this Cleopatra had her son Caesarion exiled to conceal his identity as the rightful successor to the crown and to insure hiw own safety. \n\nOne, I do not think the Senate counts as his \"council\" they existed in spite of his absence and were an important political institution before he was even born. Also Cleopatra did not exile Caesarion, he was only about 3 years old, and actually it was after Caesar's death that she raised him to being her co-regent (also she poisoned her brother-husband Ptolemy XIV which probably helped clear up a space in the succession. Allegedly.) This would have been around 44-43 BCE and she entered the Liberators' War on the side of Dolabella who confirmed Caesarion's status as her successor, with the Second Triumvirate reaffirming this later. Second, why would she \"conceal\" his identity as a successor to the crown because Caesar got stabbed? It seems like a throne in Egypt was one of the safest places to avoid political violence in the city of Rome. Then again he seems to be under the mistaken impression that Caesarion was in line to succeed Julius Caesar but not only was Caesarion illegitimate, but Caesar never acknowledged Caesarion publicly, he seems to have skirted around the issue in life and left Caesarion out of his will. Nicolaus of Damascus goes so far as to say that he *repudiated* Caesarion in his will but this is not mentioned in any other accounts nd seems mostly connected to denying that he had kingly aspirations in connection to Egypt, but still, he definitely was not leaving anything to Caesarion.\n\n&gt;Caesarion was then put under the care of his adopted parent Mary and Joseph. He travelled to India and studied vedic texts under brahman priests. \n\n[sighs] I find it highly doubtful that Cleopatra decided to give him to a Jewish couple in a Roman province to raise. Why do that instead of sending him literally anywhere else? I mean if we are going to go all *A New Hope* why not send him to live with an aristocratic Greek family or to one of the surviving pocket kingdoms in the Near East or Africa? Literally anything other than giving him to some random people from Bethlehem who are presumably then informed about this crazy plot so they can, you know, fill him in on the details as he grows up.\n\nThis whole confusion seems to come from Plutarch who claims that it was rumored that when Egypt was invaded Cleopatra sent Caesarion to safety in India through the Ethiopian route (no doubt referring to one of the Ptolemaic Red Sea ports in Lower Nubia). But he would have been 17 when this occurred and in any case Roman sources indicate that he returned when Octavian invited him back to take the throne but then promptly had him killed. Dio says that he was killed on the road to Ethiopia but Plutarch gives a more detailed story in his earlier account\n&gt;Cleopatra's children, together with their attendants, were kept under guard and had generous treatment. But Caesarion, who was said to be Cleopatra's son by Julius Caesar, was sent by his mother, with much treasure, into India, by way of Ethiopia. There Rhodon, another tutor like Theodorus, persuaded him to go back, on the ground that Caesar invited him to take the kingdom. But while Caesar was deliberating on the matter, we are told that Areius said: \"*Not a good thing were a Caesar too many.*\" As for Caesarion, then, he was afterwards put to death by Caesar\n\nNext up on \"Things fake conspiracy theorists say\":\n\n&gt;Returning to Alexandria Egypt later betraying his teachers and recaptured the once Egyptian Empire, now Holy Roman Empire by the name Jesus Christ. Jesus which is the name of Esau in Egyptian means, son of Isis and this is also recorded in ancient hieroglyphs. \n\nEhhh, *pretty sure* none of this is recorded by Egyptian hieroglyphs, the Ptolemaic Empire at its furthest extent only ever reached as far west as its footholds in the Balkans and certainly was not anywhere near the extent of the Roman Empire. According to Roman accounts he was betrayed by his tutors, not the other way around. And you know, this led to some bad things. Like his death. Him being dead dramatically reduces the odds of him secretly taking over the Roman Empire.\n\n&gt;Cleopatra was the self proclaimed virgin Goddess Isis named after Isis which came before her in family succession to the crown. Caesar was worshipped as a God. Jesus is the son of a virgin and God.\n\nTIL that the patron deity of marriage and maternity who brings her husband back from the dead and gives him a golden phallus so they can conceive a son in the most famous myth surrounding her was a virgin goddess. Must be why she was often conflated with the virgin goddesses Aphrodite and Venus. Also Caesar was only technically worshipped as a god after he died in the sense that he was divinified but this was not unprecedented and it was *after* he died. Caesarion was more like the illegitimate love-child of a divine Hellenistic queen and a Roman dictator who was given divine honours after he died and really wanted very little to do with him. But I had to double take on\n&gt;Goddess Isis named after Isis \n\nSo what, was Isis a goddess-lite before Cleopatra? How is this (made up) distinction in any way different from the original? Plus since Cleopatra was only a mortal incarnation of Isis, and/or possibly a new deity descended from Isis, then she could be considered less \"goddess\" than Isis in the Egyptian pantheon.\n\n&gt;Upon Jesus return he found his half sister and two other brothers. Selene was his half sister and after they were wed she had changed her name to Mary Magdalene. Or at least that is what was recorded. \n\nWhat the what? His half-sister Cleopatra Selene married Juba II of Numidia, had children with him including Ptolemy of Mauretania who ruled after them, and has her mausoleum *with* Juba II still in Mauretania. There is also no reason why she would change her name to something barbaric like Mary Magdalene when she had a perfectly good name like Cleopatra Selene.\n\nHis half-brothers might not even have had a better life expectancy than him, only Alexander Helios is usually mentioned after the conquest of Egypt and it is possible that Ptolemy Philadelphus did not survive childhood. Plutarch does state that all of Marc Antony's children were spared with the exceptions of Marcus Antyllus, and that Octavia adopted all of Antony's children including those of Cleopatra. Historians are not really sure about their ultimate fates, they may have grown up in obscurity or they may have died of natural or unnatural causes at an early age. Dio mentions that they were spared as a favour to Juba and Selene but his account is somewhat incongruous with other accounts as the marriage would have been a few years after their being taken to Rome, and in any case Dio was writing from quite a long while after these events unfolded. What is clear is that they never teamed up with Caesarion to rule the world. The Roman Alexandrian historian Plutarch had this much to say about it\n&gt;Cleopatra [Selene], the daughter of Cleopatra, Octavia gave in marriage to Juba, the most accomplished of kings, and Antony [Iullus Antonius], the son of Fulvia, she raised so high that, while Agrippa held the first place in Caesar's estimation, and the sons of Livia the second, Antony was thought to be and really was third. \n\nBut all this is moot because his half-siblings were born in 40 and 36 BCE respectively which according to this troll are the years that did not exist.\n\n&gt;The truth of the matter is that none of these biblical figures other than Mary and Joseph were never accounted for historically because they were know by different names historically. \n\nWell without any context for who these mysterious figures are there is not much I can say but quite a few Biblical figures were historical figures as well. Herod the Great existed during this time period (actually he is usually implicated in Jesus=Caesarion theories).\n\n&gt;Caesarion was Ptolemy the last reigning pharoah of Egypt and the founder of the HOLY ROMAN EMPIRE and the greatest lie ever told. \n\nYeah the Holy Roman Empire is still not the Roman Empire, it also was not founded with Christianity at its heart nor it would officially adopt Christianity for a few centuries after the reasonable lifespan of Caesarion. And yes Caesarion was Ptolemy Caesar (with Caesarion being a nickname) but the impact of his reign is kind of overrated here. As his mother's co-regent he held little power and after her death he might have technically reigned for a few weeks during a time when Egypt was occupied by Octavian who held the capital in his palm, making it hard for Caesarion to do much in the way of world-conquering.\n\n&gt;He was also referred to as “King of Kings” and “Lord of Lords” much like his father Julius Caesar who was once worshipped as a God and established the dictatorship of Caesarion rulership.\n\nJulius Caesar was never referred to as \"king\" let alone \"King of Kings\", that whole \"Queen of Kings, King of Kings\" deal was all on his mother at the Donations of Alexandria. The title King of kings had a history going back beyond the Hellenistic and Achaemenid dynasties which employed it, all the way back to the Assyrians. This was not something new to Near Eastern politics. Also \"Caesarion rulership\", the *Julio-Claudian dynasty* was established by Julius Caesar but not so much the Roman Empire because that came together later, and frankly not all of the interactions between Caesar's successors and Cleopatra's descendants were so friendly, Caligula straight up had Ptolemy of Mauretania killed.\n\n&gt;The Bible which was mostly taken from Ancient Egypt and then adapted by Julius Caesar nothing more than a fabricated half truth edited into Julius Caesars 2000 year long three world war plan to establish a one world Government.\n\nWell I have to admit, there is no arguing with this. Ave Caesar!\n\n**Sources** \n\n*Cleopatra: A Biography* by Duane Roller\n\n*Caesar: Life of a Colossus* by Adrian Goldsworthy\n\n*Life of Antony* by Plutarch\n\n*Life of Augustus* by Nicolaus of Damascus\n\n*Roman History* by Cassius Dio\n\n[The Dodekaschoinos](https://www.ancient.eu/Dodekaschoinos/) by a shitty Reddit historian I know.\n \n",
        "created_utc": 1509869216,
        "upvote_ratio": ""
    },
    {
        "title": "In which Jack the Ripper wrote Alice in Wonderland",
        "author": "God-bear",
        "url": "https://www.reddit.com/r/badhistory/comments/7ani0v/in_which_jack_the_ripper_wrote_alice_in_wonderland/",
        "text": "There are few cases of unsolved serial murderers that have received the public fascination, media attention, and wild theories as Jack the Ripper. There have been dozens of proposed culprits for these crimes and some are understandability less likely to have committed the killings than others. We will probably never know who did it, but that doesn’t a new book being released every few years that advertises itself as containing “the real story”. Today’s bad history post looks at one such book, Richard Wallace’s 1996 Jack the Ripper, Light-Hearted Friend.\n\nWallace’s thesis is that Jack was none other than author Lewis Carroll, writer of the fantasy classic Alice's Adventures in Wonderland. Wallace claims that Carroll, legal name Charles Dodgson, and his friend, Thomas Vere Bayne, committed the infamous slayings. This idea has received extremely negative reception from both Carroll and Ripper scholars. Chief upon the debunkers has been Karoline Leach, Carroll’s most influential biographer.\n\nThe main crux of the Wallace hypothesis is that in Carroll’s writing there are hidden messages in the form of anagrams. For instance, if one takes this passage from Alice, or to be more precise an edition of the book Carroll wrote for very young children, known as The Nursery \"Alice\".\n\n\t“So she wondered away, through the wood, carrying the ugly little thing with her. And a great job it was to keep hold of it, it wriggled about so. But at last she found out that the proper way was to keep tight hold of itself foot and its right ear.”\n\nYou can rearrange the letters to get:\n\n\t“She wriggled about so! But at last Dodgson and Bayne found a way to keep hold of the fat little whore. I got a tight hold of her and slit her throat, left ear to right. It was tough, wet, disgusting, too. So weary of it, they threw up - jack the Ripper.”\n\nAnother example given by Wallace is from an excerpt of “Jabberwocky”. Carroll’s original:\n\n\t“'Twas brillig, and the slithy toves \nDid gyre and gimble in the wabe: \nAll mimsy were the borogoves, \nAnd the mome raths outgrabe.”\n\nAnd Wallace’s supposed decoded message:\n\n\t“Bet I beat my glands til, \nWith hand-sword I slay the evil gender. \nA slimey theme; borrow gloves, \nAnd masturbate the hog more!”\n\nFurther codes in the book reveal other scandalous “messages”: that Carroll was homosexual, lusted for his mother, and was a fan of bestiality. However, Leach notes in her essays criticizing Wallace that the many of the alleged anagram in fact omits and substitutes letters not found within the original passages.\n\nAdditionally, Leach provides evidence that Carroll’s known whereabouts don’t match the locations of the murders. From August 31 to September 30 of 1888, when four of the five “canonical” murders occurred, Carroll was on holiday in East Sussex. Lacking evidence from his vacation companions that he was traveling to and from London multiple times during this period, we must conclude that Carroll was not involved. The fifth and final murder, taking place on November 9, 1888, happened when Carroll was in Oxford.\n\nFurthermore, some of Carroll’s texts that Wallace uses as evidence were penned before the Ripper murders. Wallace relies heavily upon a section of Carroll’s fairy tale novel Sylvie and Bruno (1889). But Carroll researchers have found that the offending passage, “The Mad Gardener's Song”, was written and sent to be illustrated in 1887. There are also issues relating to the psychical health of the alleged perpetrators at this time, Bayne had a bad back turning this time and wrote in his dairy that he could barely move.\n\nLeach points out the fallacies in targeting and finding such anagrams. To prove her point, she takes a passage from A.A. Milne’s Winnie-the-Pooh:\n\n\t“Here is Edward Bear coming downstairs now,”\n\nAnd changes it to:\n\n\t“Stab red red women! CR is downing whores – AA”\n\nLikewise, after the popular magazine Harper’s published an article by Wallace promoting his theory, puzzle writers Francis Heaney and Guy Jacobson wrote the punishment back with an anagram of their own from a passage of Wallace’s article.\n\nThe original:\n\n\t“This is my story of Jack the Ripper, the man behind Britain's worst unsolved murders. It is a story that points to the unlikeliest of suspects: a man who wrote children's stories. That man is Charles Dodgson, better known as Lewis Carroll, author of such beloved books as Alice in Wonderland.”\n\nAnd the shocking “decoded” confession:\n\n\t“The truth is this: I, Richard Wallace, stabbed and killed a muted Nicole Brown in cold blood, severing her throat with my trusty shiv's strokes. I set up Orenthal James Simpson, who is utterly innocent of this murder. P.S. I also wrote Shakespeare's sonnets, and a lot of Francis Bacon's works too.”\n\nInterestingly, Wallace’s book proudly advertises that the film rights have been sold. We at /r/badhistory look very much forward to the belated adaptation of a classic of pseudohistory.\n",
        "created_utc": 1509754920,
        "upvote_ratio": ""
    },
    {
        "title": "Free for All Friday!, 03 November 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/7aiuyi/free_for_all_friday_03_november_2017/",
        "text": "It's Friday everyone, and with that comes the newest latest Free for All Friday Thread! What books have you been reading? What is your favorite video game? See any movies? Start talking!\n\nHave any weekend plans? Found something interesting this week that you want to share? This is the thread to do it! This thread, like the Mindless Monday thread, is free-for-all. Just remember to np link all links to Reddit if you link to something from a different sub, lest we feed your comment to the AutoModerator. No violating R4!\n",
        "created_utc": 1509709858,
        "upvote_ratio": ""
    },
    {
        "title": "Transmission of the Plimpton 322 tablet badhistory",
        "author": "yoshiK",
        "url": "https://www.reddit.com/r/badhistory/comments/7abjoc/transmission_of_the_plimpton_322_tablet_badhistory/",
        "text": "While cleaning my browser, I found an article *The mystery of ancient Babylonian clay tablet solved*, which on closer inspection is reporting on a [paper by Norman Wildberger,](http://www.sciencedirect.com/science/article/pii/S0315086017300691?np=y) the one person who is exempt from the \"take special care when submitting work by professors\" rule on r/badmathematics. Unfortunately a few media outlets have chosen to write something about that based on a [press release,](https://newsroom.unsw.edu.au/news/science-tech/written-stone-world%E2%80%99s-first-trigonometry-revealed-ancient-babylonian-tablet) in particular [Eurekalert](https://www.eurekalert.org/pub_releases/2017-08/uons-mmo082117.php) and [The Guardian](https://www.theguardian.com/science/2017/aug/24/mathematical-secrets-of-ancient-tablet-unlocked-after-nearly-a-century-of-study). \n\nTo start a bit with modern context, Wildberger has rather extreme^1 views on philosophy of mathematics, and likes to use strong language to \"advocate\" for these views: \n\n&gt; Using flawed and ambiguous concepts, hiding confusions and circular reasoning, pulling theorems out of thin air to be justified `later' (i.e. never) and relying on appeals to authority don't help young people, they make things more difficult for them.\n\nRecently he wrote, together with a collaborator, a paper on a rather famous Babylonian clay tablet, [Plimpton 322.](https://upload.wikimedia.org/wikipedia/commons/c/c2/Plimpton_322.jpg) Plimpton 322 dates to 1822–1784 BCE and contains a table of numbers that look suspiciously like geometry. Science writers reporting on work of a non specialist who has an axe to grind. I can't see any red flags at all. ([But possibly that's just the Soviet may day parade obscuring my view.](https://imgur.com/a/P5vZJ)) \n\nTo get to the badhistory, from the abstract of the paper\n\n&gt; This is well over a millennium before Hipparchus is said to have fathered the subject with his ‘table of chords’. \n\n\nA claim that is repeated by Eurekalert and The Guardian. It is pretty dubious, since if [Hipparchus](https://en.wikipedia.org/wiki/Hipparchus) (c. 190 BCE - c. 120 BCE) has fathered geometry then [Pythagoras](https://en.wikipedia.org/wiki/Pythagoras) (c. 570 BCE - c. 495 BCE) obviously didn't do geometry. As didn't the Indian and Han Chinese mathematicians, were we have Indian proofs of slightly predating Pythagoras and Han dynasty Chinese proofs slightly later. There is however a more fundamental problem, mathematical theorems change somewhat with the way we look at them,^2 to pick a modern example Galois theory is today considered as an theory about a connection between groups and field extensions, however Galois died in a duel almost a hundred years before the notion of a group or a field. Ancient mathematics has quite similar problems, to quote Wikipedia on the Pythagorean theorem:\n\n&gt; The history of the theorem can be divided into four parts: knowledge of Pythagorean triples, knowledge of the relationship among the sides of a right triangle, knowledge of the relationships among adjacent angles, and proofs of the theorem within some deductive system.\n\nPythagorean triples are triples of integers, such that a^2 + b^2 = c^2 . From a number theory perspective, that is an interesting property in its own right, one can for example proof that for any odd integer m + 1/4 (m^2 -1)^2 = 1/4 (m^2 +1)^2 , without any recourse to geometry; or proof the Pythagorean theorem by geometric means, without any explicit reference to numbers. \n\nTo illustrate, the exercise from the Egyptian [Middle Kingdom Berlin Papyrus 6619](https://en.wikipedia.org/wiki/Berlin_Papyrus_6619) (c. 1800 BCE): \n\n&gt; \"the area of a square of 100 is equal to that of two smaller squares. The side of one is ½ + ¼ the side of the other.\n\nhas as solution the Pythagorean triple 6, 8, 10. However that does not necessarily imply that the ancient scribe who came up with the exercise knew about Pythagorean triples, he may just have tried a few possibilities until he came up with nice round numbers. (By the way, that's a rather nice exercise.)\n\nIt is of course possible here to argue that Hipparchus fathered only the study of angles, an interpretation that is directly contradicted by the press release: \n\n&gt; The Babylonians discovered their own unique form of trigonometry during the Old Babylonian period (1900-1600 BCE), more than 1,500 years earlier than the Greek form.\n\n&gt; Remarkably, their trigonometry contains none of the hallmarks of our modern trigonometry – it does not use angles and it does not use approximation.\n\nTo quote Robson, writing more than a decade before the offending paper:\n\n&gt; And if the rotating radius did not feature in the mathematical idea of the circle, then there was no conceptual framework for measured angle or trigonometry. In short, Plimpton 322 cannot have been a trigonometric table. \n\nAnd now that everybody is soundly asleep, we come to the second part of this, the badhistoriography.  Not to be outdone by the authors, the science writers went to Wikipedia. From the press release:\n\n&gt; In the 1920s the archaeologist, academic and adventurer Edgar J. Banks sold the tablet to the American publisher and philanthropist George Arthur Plimpton.\n\nWhich as far as I can tell is entirely correct. [Banks]( https://en.wikipedia.org/wiki/Edgar_James_Banks) was a rather colorful character of whom Wikipedia notes\n\n&gt; Banks was an antiquities enthusiast and entrepreneurial roving archaeologist in the closing days of the Ottoman Empire, who has been held up as an original for the *fictional composite figure* of Indiana Jones. [Emphasis mine]\n\nA rather careful formulation, which is further hedged in [Wikipedia's *Indiana Jones* article,](https://en.wikipedia.org/wiki/Indiana_Jones#Historical_models) by\n\n&gt; Many people are said to be the real-life inspiration of the Indiana Jones character—although none of the following have been confirmed as inspirations by Lucas or Spielberg.\n\n but a detail to good to pass up for journalist. \n\n Guardian:\n\n&gt; He bought it from Edgar Banks, a diplomat, antiquities dealer and flamboyant amateur archaeologist said to have inspired the character of Indiana Jones – his feats included climbing Mount Ararat in an unsuccessful attempt to find Noah’s Ark – who had excavated it in southern Iraq in the early 20th century.\n\nEurekalert: \n\n&gt; Known as Plimpton 322, the small tablet was discovered in the early 1900s in what is now southern Iraq by archaeologist, academic, diplomat and antiquities dealer Edgar Banks, the person on whom the fictional character Indiana Jones was based. \n\nOne is tempted to speculate, if [Banks]( https://upload.wikimedia.org/wikipedia/commons/6/6b/Edgar_James_Banks.jpg) was an inspiration for Indiana Jones before the casting of Harrison Ford. \n\nAnd since this mentions the ancient world and Babylon, one could add some additional color, The Guardian:\n\n&gt; The team from the University of New South Wales in Sydney believe that the four columns and 15 rows of cuneiform – wedge shaped indentations made in the wet clay – represent the world’s oldest and most accurate working trigonometric table, a working tool which could have been used in surveying, and in calculating how to construct temples, palaces and pyramids.\n\nSo far so good, but did anybody say Babylonian architecture?\n\n&gt; The fabled sophistication of Babylonian architecture and engineering is borne out by excavation. The Hanging Gardens of Babylon, believed by some archaeologists to have been a planted step pyramid with a complex artificial watering system, was written of by Greek historians as one of the seven wonders of the ancient world. \n\nFirst, there seems to be some debate if the hanging Gardens of Babylon existed, second if they existed they would have been build at least a millennium after the Plimpton 322 tablet and possible they were confused with the gardens of Ashurbanipal at Nineveh anyhow. To remind everybody, Plimpton 322 is dated to 1822–1784 BCE, [Diodorus who compiled one list of wonders lived c. 100 BCE.](https://en.wikipedia.org/wiki/Seven_Wonders_of_the_Ancient_World) That is an error like confusing Constantine with Queen Elizabeth II as ruler of Britain. \n\n## Sources:\n\n### The badhistory\n\n[Daniel F.Mansfield, N.J.Wildberger, *Plimpton 322 is Babylonian exact sexagesimal trigonometry*, Historia Mathematica Vol 44, 2017](http://www.sciencedirect.com/science/article/pii/S0315086017300691?np=y)\n\n[Daniel Mansfield and Norman Wildberger, *Written in stone: world’s first trigonometry revealed in ancient Babylonian tablet*, UNSW Newsroom 2017](https://newsroom.unsw.edu.au/news/science-tech/written-stone-world%E2%80%99s-first-trigonometry-revealed-ancient-babylonian-tablet) (The press release)\n\n[*Mathematical mystery of ancient Babylonian clay tablet solved*, Eurekalert 2017](https://www.eurekalert.org/pub_releases/2017-08/uons-mmo082117.php) (Eurekalert)\n\n[*Mathematical secrets of ancient tablet unlocked after nearly a century of study*, The Guardian, 2017](https://www.theguardian.com/science/2017/aug/24/mathematical-secrets-of-ancient-tablet-unlocked-after-nearly-a-century-of-study)\n\n### Actual Sources\n\n[Evelyn Lamb, *Don't Fall for Babylonian Trigonometry Hype*, Scientific American Roots of Unity blog, 2017](https://blogs.scientificamerican.com/roots-of-unity/dont-fall-for-babylonian-trigonometry-hype/) \n\nbasically another R5, more focused on mathematics. \n\n[Elanor Robson, *Words and Pictures: New Light on Plimpton 322*, 2002](https://www.maa.org/sites/default/files/pdf/upload_library/22/Ford/Robson105-120.pdf)\n\nQuite interesting and very readable paper on Plimpton 322.\n\n[u/ex0du5, *Some notes on ultrafinitism and badmathematics*, r/badmathematics, 2016](https://np.reddit.com/r/badmathematics/comments/4gjs5n/some_notes_on_ultrafinitism_and_badmathematics/)\n\nDefense of ultrafinitism and its relation to badmathematics. \n\n[MarkCC, *Dirty Rotten Infinite Sets and the Foundations of Math*, \"Good Math, Bad Math\" blog, 2007](http://goodmath.scientopia.org/2007/10/15/dirty-rotten-infinite-sets-and-the-foundations-of-math/)\n\nCritique and overview of Wildberger's philosophy of mathematics. \n\n\n\n^1 Before mods of r/badmathematics charge in, (ultra-) finitism is a legitimate philosophical position, it is just Wildberger is doing it wrong. \n\n^2 No position on Platonism implied here.",
        "created_utc": 1509629938,
        "upvote_ratio": ""
    },
    {
        "title": "State of the Sub, 01 November 2017, Feedback Outcome and Rule Changes",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/7a323z/state_of_the_sub_01_november_2017_feedback/",
        "text": "Hi, badhistorians! \n\nAs you might recall, we had a [\"State of the Subreddit\"](https://www.reddit.com/r/badhistory/comments/75oj7w/state_of_the_sub_11_october_2017_moratorium/) post a few weeks ago, where we discussed the rise in low-quality, politically-charged submissions that have been popping up more and more as of late. The moderators have taken your suggestions and discussed them internally, to figure out how it would work out. The following will be what we decided to do about the situation.\n\nFirst off: **we are not putting these topics on moratorium**. People don't want them, so we're still allowing bad history from certain places on the sub. That being said, we are introducing changes in how we approach those posts in future:\n\n* **Submissions may not mention the subreddit sourcing the bad history, or circlejerk about them in the submission title.** This is really an extension of Rule 4, which bans users from circlejerking over terrible subreddits, although we've been mainly enforcing them in comments and not submission titles. Now we'll be enforcing them in the title too. If your title is considered too circlejerky, mods reserve the right to remove it and ask you to resubmit with a more neutral title.\n* **We'll be putting submissions featuring bad history from frequent offenders under higher scrutiny for Rule 5.** A number of bad history sources featured here are repeat offenders, many which choose to bend history to promote a certain agenda. Since we know that the frequent offenders are going to promote bad history, we're going to make you work for it. Beyond the minimum requirements, we're going to ask for more than one source and a beefier rebuttal for submissions featuring one of those sources.\n* **Certain topics will require more in-depth rebuttals.** As an addendum for the above, many of the subjects from frequent offenders refer to topics that are still under debate in academia (e.g. definitions of statehood, genocide, and terrorism). Because of this, in order to do those topics justice, we're going to be even more stringent when they come up. Half-an-hour of Wikipedia reading is not going to be enough anymore. We will be asking for more sources in those cases; you can check JSTOR, Google Scholar, a quality blog, AskHistorians posts (to a point; please don't cite anything in the first one or two years of AH's existence), and other reputable websites.\n* **We will be more strict in removing soapboxing and agenda-pushing in both submissions and comments.** These are covered under Rules 2 and 3. Even if your submission or comment follows the above, if the entire point is to push an agenda, we're likely going to be removing it. Please don't advertise your ideological positions. Keep it off your sleeves.\n* **We will be increasing the frequency of the \"Small Bad History\" thread from monthly to weekly.** We want to encourage users to use this thread more. Anything that would only require a few lines to rebut, something you don't feel like writing a substantial post for, a topic we've already covered to death, and requests for rebuttals can go in the now-weekly \"Small Bad History\" thread.\n\nWe hope that this resolves the issue plaguing this sub as of late. Thank you for reading, and praise Volcano.\n\nthe /r/badhistory mods.   \n \n",
        "created_utc": 1509537070,
        "upvote_ratio": ""
    },
    {
        "title": "Mindless Monday, 30 October 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/79mhve/mindless_monday_30_october_2017/",
        "text": "Happy (or sad) Monday guys!\n\nMindless Monday is generally for those instances of bad history that do not deserve their own post, and posting them here does not require an explanation for the bad history.  That being said, this thread is free-for-all, and you can discuss politics, your life events, whatever here. Just remember to np link all links to Reddit and don't violate R4, or we human mods will feed you to the AutoModerator.\n\nSo, with that said, how was your weekend, everyone?\n",
        "created_utc": 1509353461,
        "upvote_ratio": ""
    },
    {
        "title": "It's not a good look to name yourselves after infamous slave traders, but it's even worse to do so and pass it off as an anti-slavery gesture.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/79k8y5/its_not_a_good_look_to_name_yourselves_after/",
        "text": "[deleted]",
        "created_utc": 1509322588,
        "upvote_ratio": ""
    },
    {
        "title": "Redditor will go back to 1945 in order to explain \"how bones and missiles work\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/79i4cv/redditor_will_go_back_to_1945_in_order_to_explain/",
        "text": "[deleted]",
        "created_utc": 1509301318,
        "upvote_ratio": ""
    },
    {
        "title": "Sunday Studies, 29 October 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/79g32i/sunday_studies_29_october_2017/",
        "text": "Find a book you like? Read an intriguing article from JSTOR last week? Want to discuss and get recommendations for new books? This is the thread for it! Come one, come all, please let us know what you've been reading this week!\n\nNote: unlike the Monday and Friday megathreads, this thread is *not* free-for-all. You are free to discuss books that you've read, articles you liked, and similar. But please save the personal updates for Mindless Monday! \n",
        "created_utc": 1509277860,
        "upvote_ratio": ""
    },
    {
        "title": "The irksome problem with trying to use the German folk song \"Die Gedanken sind frei\" to glorify the Nazi regime",
        "author": "crnaruka",
        "url": "https://www.reddit.com/r/badhistory/comments/79bimx/the_irksome_problem_with_trying_to_use_the_german/",
        "text": "What motivated this post is that recently I tried to look up the song [*Die Gedanken sind frei*](https://en.wikipedia.org/wiki/Die_Gedanken_sind_frei)\" or *Thoughts Are Free* on Youtube and noticed that quite a few of the videos showed a clear militaristic or openly pro-Nazi streak. For example, [this is one more blatant examples](https://www.youtube.com/watch?v=Rmgd2e7MGuQ) but quite a few of the other popular renditions also heavily feature the Nazi party or the Wehrmacht. \n\nWhile normally I wouldn't have cared much about such an unsavory appropriation, there is a deep irony of trying to link the song to the Nazi regime that I thought was worth pointing out. The exact origins of the song *Die Gedanken sind frei* are a bit fuzzy, but it became especially popular around the middle of the 19th century when one of its most popular versions was penned by  Hoffmann von Fallersleben. The reason the song reached such prominence around the time is that it meshed very well with the liberal zeitgeist of the era. The key idea behind the song is that one has the right to their own thoughts and not even external oppression can stop you, e.g.\n&gt; And if I am thrown into the darkest dungeon,\n\n&gt;all these are futile works,\n\n&gt;because my thoughts tear all gates\n\n&gt;and walls apart: Thoughts are free!\n\nWith such lyrics, the song always had a certain rebellious flavor, especially in periods marked by restrictive official censorship. It is no wonder that the Nazi regime was not a big fan of this song. The Nazi approach to music was that ideally it should serve the state and party, but at the very least it should not subvert it.^1 With this idea in mind, they outright banned certain types of music that were deemed foreign and \"degenerate.\" With folk songs they had to tread a bit more carefully given how entrenched the music was. However, they still cracked down on folk songs that were seen as especially inflammatory, including \"Die Gedanken sind frei.\" Playing or singing these songs made you liable to various degrees of punishment depending on the mood of the court that heard your case.\n\nIndeed, the Nazi government was not without cause in thinking that this song could be used as a symbol of defiance against them. In a (now) famous incident, a German student by the name of [Sophie Scholl](https://en.wikipedia.org/wiki/Sophie_Scholl) played the song outside of the prison in Ulm where her father was held for calling Hitler the \"scourge of God.\" Just a year later Sophie herself would be executed by the Nazis for her activities in a resistance organization called The White Rose. \n\nPerhaps not surprisingly the song was also commonly sung in German prisons and concentration camps.^2 One comical example was that when inmates at the Lichtenburg concentration camp were faced to put on a perfomance by the guards in honor of Hitler, the well-known lawyer Hans Litten chose to sing *Die Gedanken sind frei.* As an aside, it's worth mentioning that Litten once had a chance to grill Hitler himself on the witness stand. This personal history certainly hastened Litten's incarceration, as if it wasn't already enough that he was both an outspoken Communist as well as a Jew.\n\nIn light of this context, I find it more than a little absurd that some people have chosen to use this of all songs to glorify Hitler, the Nazis, or the Wehrmacht. When digging through German media studies a bit, it appears that this example is not altogether unique. Some far-right organizations, such as the German neo-Naziesque [NPD](https://en.wikipedia.org/wiki/National_Democratic_Party_of_Germany) and their adherents have often appropriated quite a few songs of liberal or even socialist provenance. The idea is that their members feel oppressed by the German state and so they find these songs of defiance in favor of one's ideas to be relevant to their experience. Since this is delving into politics, I will stop here, but I just wanted to add a minimal bit of context to explain this seemingly bizarre appropriation of this song.\n\n**Sources**\n\n1. Pitner, M. **Popular Music in the Nazi Weltanschauung** Intl. Multiling. J. Contemp.\nRes. 2014: 2(2) pp 149-156\n\n2. Fackler, G., **Music in Concentration Camps 1933–1945** Mus. &amp; Pol. 2007: 1(1) pp 1-25\n\nedit:fixed some typos",
        "created_utc": 1509213295,
        "upvote_ratio": ""
    },
    {
        "title": "Free for All Friday!, 27 October 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/792qaj/free_for_all_friday_27_october_2017/",
        "text": "It's Friday everyone, and with that comes the newest latest Free for All Friday Thread! What books have you been reading? What is your favorite video game? See any movies? Start talking!\n\nHave any weekend plans? Found something interesting this week that you want to share? This is the thread to do it! This thread, like the Mindless Monday thread, is free-for-all. Just remember to np link all links to Reddit if you link to something from a different sub, lest we feed your comment to the AutoModerator. No violating R4!\n",
        "created_utc": 1509105067,
        "upvote_ratio": ""
    },
    {
        "title": "OmarAdelX fails miserably at \"debunking\" a video by Real Crusades History",
        "author": "RealCrusadesHistory",
        "url": "https://www.reddit.com/r/badhistory/comments/78wpb0/omaradelx_fails_miserably_at_debunking_a_video_by/",
        "text": "[removed]",
        "created_utc": 1509035223,
        "upvote_ratio": ""
    },
    {
        "title": "According to an afrocentrist blog, there was a never a genocide of the Native Americans, they were shipped to Europe as slaves, then to Africa and then back to America",
        "author": "AiogbZuyzn",
        "url": "https://www.reddit.com/r/badhistory/comments/78vsag/according_to_an_afrocentrist_blog_there_was_a/",
        "text": "[removed]",
        "created_utc": 1509026947,
        "upvote_ratio": ""
    },
    {
        "title": "October Small BadHistory Thread",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/78v0wp/october_small_badhistory_thread/",
        "text": "This is a place to dump all the bad history you run across that isn't worth doing a whole post about. Rules for the small posts are slightly different:\n1.) Don't link directly to the post/comment itself\n2.) Please quote it though (or at least summarise it if it's a real life bad history moment)\n3.) As usual, no username call-outs unless you want to bring it to the attention of an expert on the topic so they can add their 2 nummi.\n",
        "created_utc": 1509018660,
        "upvote_ratio": ""
    },
    {
        "title": "The World's Worst WWI Map",
        "author": "Chamboz",
        "url": "https://www.reddit.com/r/badhistory/comments/78tmvg/the_worlds_worst_wwi_map/",
        "text": "Jackson Spielvogel's textbook *Western Civilization* (7th ed, 2008) is extremely lackluster in many ways, and I've been frustrated for months by having to make use of it for the class I'm grading, but today I came across something too funny not to share. I present to you [one of the worst maps I've ever seen in a serious history book](https://i.imgur.com/8O9D7ZV.png).\n\nThis hardly calls for explanation, but to point out the obvious for R5 purposes:\n\n1. Germany rules a large chunk of Congress Poland, while Russia rules Austria's share of the partition.\n2. France has Alsace-Lorraine.\n3. Belgrade is not even on the Danube, and where it should be is depicted as Austria-Hungary's territory.\n4. Brussels is hardly in Belgium. A few other cities are also far off the mark.\n5. Italy rules South Tirol.\n6. And much more!\n\nBONUS EDIT: Some more awful Spielvogel maps\n\n* [Prussia was Catholic, Estonia was Orthodox, and there were no Muslims in the Balkans (they all went to Georgia)](https://i.imgur.com/dERdXNz.png)\n* [The Ottomans ruled over the entire Middle East, and shaped their European borders to match modern-day Hungary and Croatia](https://i.imgur.com/z4NWNgx.png)\n* [Look at Austria-Hungary. *Look at it*](https://i.imgur.com/2Eqgc7V.png)",
        "created_utc": 1508997143,
        "upvote_ratio": ""
    },
    {
        "title": "Feudalism happened because \"some guys realized they could make a lot of money for themselves by building a castle\".",
        "author": "DarkRedDiscomfort",
        "url": "https://www.reddit.com/r/badhistory/comments/78revr/feudalism_happened_because_some_guys_realized/",
        "text": "[removed]",
        "created_utc": 1508971721,
        "upvote_ratio": ""
    },
    {
        "title": "Wondering Wednesday, 25 October 2017, How do you feel about non-historians writing in history?",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/78n5oo/wondering_wednesday_25_october_2017_how_do_you/",
        "text": "History is a subject that fascinates many people, and the field attracts many outsiders who decide to write about it. Some do so after extensive research, others approach it from a different angle or via a different discipline, and then there are those who twist it into a horrible bowl of mutant spaghetti to make it fit their ideology or agenda. What do you think about these non-experts in the fields? What are some excellent or terrible books you've read by amateur historians? Do you think that an amateur can gain enough understanding of the field to write about it well or will they be missing essential skills to do so? And what are the most often overlooked essential elements of historical research that the amateurs in the field often overlook or underestimate? Feel free to discuss anything else not covered by the above that relates to the topic, but R2 is very much in effect for this one, so please don't use it to criticise recent books by politicians dabbling into history.   \n \nNote: unlike the Monday and Friday megathreads, this thread is *not* free-for-all. You are free to discuss history related topics. But please save the personal updates for Mindless Monday and Free for All Friday! Please remember to np link all links to Reddit if you link to something from a different sub, lest we feed your comment to the AutoModerator. And of course no violating R4! Also if you have any requests or suggestions for future Wednesday topics, please let us know via modmail. \n",
        "created_utc": 1508932269,
        "upvote_ratio": ""
    },
    {
        "title": "In which the author crafts an entire new history of Christianity because the Establishment doesn't want you to know.",
        "author": "mikelywhiplash",
        "url": "https://www.reddit.com/r/badhistory/comments/78iw9j/in_which_the_author_crafts_an_entire_new_history/",
        "text": "https://np.reddit.com/r/conspiracy/comments/78bz6f/oh_do_i_have_a_story_to_tell_of_the_conspiracy_of/?st=j9622ir3&amp;sh=b7533689\n\nOK, there's a lot going on here. Mostly seems to be an (excited) rehash of the works of Robert Eisenmann, who I am not particularly familiar with, but who does seem to be something of a heterodox scholar.\n\n&gt;To skip to the point, and offer the thesis: *PAUL, THE FOUNDER OF CHRISTIANITY, WAS A ROMAN-HERODIAN, WORKING ON THEIR BEHALF, TO PACIFY THE HYPER-REVOLUTIONARY JEWS UNDER THE LEADERSHIP OF JAMES THE JUST, \"BROTHER OF THE LORD\", HELPING MURDER JAMES, HIS MESSIANIC FOLLOWERS, AND ALL OPPOSITION TO ROME, AND INSTEAD OFFERING A PEACEFUL, PRO-ROMAN, HEAVENLY SPIRITUALISM AS OPPOSED TO THEIR REVOLUTIONARY, ANTI-ROMAN, APOCALYPTIC ZIONISM.\n\nThank you for starting in all caps, it really gets the tone of the entire thing across. Also, I'm not really sure what a \"Zionist\" would be doing in ancient Judaea without time traveling, but hey, let's find out.\n\n&gt; Much of the information of the period comes from Josephus, a NATIVE PALESTINIAN with INTIMATE first-hand knowledge as he turned against the Jews and led a contingent of the Romans in Gamela in the War/Uprising. It is worth noting that Josephus writes that most of the history of the period was defective due to either FLATTERY TO THE ROMANS AND HATRED OF THE JEWS.\n\nNothing wrong with saying that Josephus was a flawed historian; that's pretty well-established. On the other hand, the point of this is to establish that no conventional history could possibly be accurate, and let the OP substitute whatever he likes. Also, claiming that he was motivated by hatred of the Jews is...iffy. But, whatever. This isn't about Josephus.\n\n&gt; What most people do not understand, is that FC Palestine was a hotbed of insurrection, war, oppression, strife, constant battling between SEVERAL factions...\n\nIt's a plot point in *Life of Brian* but sure, most people don't understand that. \"FC Palestine\" means first century Palestine here, and does not, as I initially thought, refer to a soccer team.\n\n&gt; Nothing could be further from the truth. Jerusalem, the temple, and the High Priesthood were all PLACED there by the Herods, the Roman puppet kings of the region. The multitudes of the Jews HATED this, as they considered this defilement of the temple, as all temple service was essentially polluted by a High Priesthood that \"doesn't keep the Law\" and converses and intermingles with the Romans and Herodians, \"Sons of the Pit\", basically demonic figures to these Jews, full of adulteresses and murderers and villains.\n\nTIL that Jews never liked Jerusalem or the Second Temple, anyway. I'll have to ask about that at Passover next year.\n\n&gt; Enter James the Just. If you were to read the New Testament, you'd know very, very little of James. At one point he is called the brother of the Lord, by none other than Paul himself. It's worth noting that Paul's letters, especially the earliest such as Galatians, is often a truer, first-person account of real experiences, and should be given primacy over other NT books, such as the Gospels and Acts\n\nWell, the New Testament isn't about James, so I don't know why he'd be that prominent in it. Since we're about to accuse Paul of a giant Roman conspiracy, I'm not sure why we start out by praising the veracity of his letters. Plus, regardless of the authority of either the Gospels or the Epistles, they're accounts of *different events* so I have no clue what should be given \"primacy\" or what that would mean.\n\n&gt; In Galatians and other letters, Paul refers to the LEADERSHIP OF JERUSALEM as a central triad, or pillars, of James, Cephas, and John. Sometimes described as James, PETER, and John.\n\nCephas is Aramaic, Peter is Latin, they mean the same thing. And it's not the civic leadership of Jerusalem, they're the leaders of the Church in Jerusalem. New thing.\n\n&gt; James was not a High Priest. He was not an establishment priest. He was the OPPOSITION High Priest, the leader of the vast multitudes in Jerusalem and Palestine, whose names are varied, but who call themselves \"The Poor\", \"The Many\". Another name? The Essenes. Much disinfo has leaked out about who \"the Essenes\" were. Look at the Dead Sea Scrolls. They were hyper-messianic, hyper-revolutionary, hyper-anti-Roman Jews who \"made a way in the wilderness.\"\n\nRight, James was a Christian; of course he wouldn't be part of the temple priesthood. That doesn't necessarily make him an Essene, and while there may have been influences, Christians and Essenes weren't the same thing. Their beliefs are not fully known, but they weren't a band of revolutionaries; mostly we know them to be monastic. They're getting blended with the Zealots here.\n\n&gt; It was taken pretty much for granted by all involved at the time that James was a) the true blood brother of another, called Jesus b) the opposition High Priest with more clout in Jerusalem and Palestine to be FEARED by the Establishment, for James had the entire population on his side.\n\nWell, the Establishment won't know what hit them. Who were the Establishment, anyway, if the entire population was against them?\n\n&gt;So perhaps the most important man of FC Palestine is forgotten, erased from history.\n\nYeah, they really did a heck of a job erasing James from history. He has a letter in the canonical Bible!\n\n&gt;Enter Saulus, I mean, Saul, I mean Paul.\n\nOh boy.\n\n&gt;Paul OPENLY ADMITS to \"persecuting the way\" in its infancy. One must recognize that \"Christianity\" as \"The Way\" is really not a good framework to udnerstand this. Christianity became what it was literally decades, if not centuries, later.\n\nWell, you can tell it's a good conspiracy because he admits to it.\n\n&gt; There exists a couple documents called \"The Pseudoclementines.\" Most establishment scholars completely dismiss these as\"romance fiction.\" \n\nSure, what do establishment scholars know?\n\n&gt;In the Recognitions is a section that is the first-hand account of Peter telling Clement that before Clement arrived, [this is in the early 40s] there was a day like any other, in which James, like Jesus afterward, is depicted as discoursing with the multitudes on the steps of the temple, preaching and answering their questions. Suddenly, a man only named \"The Enemy\" walks into the midst of the people on the temple with a gang of his compatriots. The Enemy begins shouting, yelling, at James, shouting for his compatriots to stop him from speaking...Astonishingly, in a footnote at the end of the Recognitions, there is a lone line, that says, in effect, \"The Enemy went by the name Saulus.\"\n\nWell, it's a margin note, not a footnote, but sure, this might be an anti-Paul work. There are plenty.\n\n&gt;Beautiful. No wonder the Latin version, \"The Homilies\" deleted this section, and no one mentions the Recognitions. How embarrassing for the Church to know this exacts.\n\nYeah, it's in the Catholic Encyclopedia. http://www.newadvent.org/cathen/04039b.htm\n\n&gt; You will notice the Gospels and Acts have several episodes that seem to go out of their way to paint the Romans in as best a light as possible. \n\nDunno. There's some persecution in there, too.\n\n&gt;Why is Paul, who \"claims Jewish heritage\" as all Herodians do, saying the most insulting, horrifying, vile thing to those of \"his own kin\" or faith? He LITERALLY SAYS that when Moses descended with the tablets from Mt Sinai, he wore a veil, not to hide the glory of god from shining and burning the people when they looked upon it, but TO DECEIVE THEM AND HIDE THE FACT THAT THE GLORY OF GOD HAD BURNT OUT?\n\nYes, Paul isn't Jewish. Christianity is becoming a new thing.\n\n&gt;What we have with the New Testament, is a systematic overwriting of real history to pacify an entire region, to turn the population to Roman subjugation. You'll notice how \"Samaritans\" feature prominently in the Gospels, all in good terms. Samaritans were the other huge factions in Palestine along with the Jews. These Samaritans had religious beliefs of their own, very, VERY similar to the Christianity of Jesus - it's obvious that they were being flattered and turned toward this new religion to slowly turn demographics away from the Jews, who were eventually massacred and dispelled from the area for centuries after the destruction of their temple in 70 AD.\n\nWell, that's a big leap. It's a Samaritan conspiracy! \n\n&gt;Even traditional Judaism at it exists today, BIRTHED IN THE AFTERMATH OF THIS PERIOD AND THE DESTRUCTION OF THE TEMPLE, is merely and overwrite of AUTHENTIC JUDAISM OF THE PERIOD.\n\nThe Romans got us too, it turns out! Judaism is a Roman plot. Yes, religions change a lot, etc. But this is quite something.\n\n&gt;The founder of Rabbinical Judaism, Yohanan ben Zacchai, fled Jerusalem, prostrated himself in front of Vespasian, THE DESTROYER OF JERUSALEM AND THE JEWS, applying the Messianic star prophecy to HIM, something so blasphemous and the HEART of the \"The Way\" of James and his followers, that Yohanan was allowed to live and found his academy which would birth modern Rabbinic Judaism, which is much, MUCH less hardline than the Zealots of James, the Poor, the Essenes.\n\nI guess we're all just dupes of this guy? \n\n&gt; The entirety of Acts, and even the Gospels, is a way to distort REAL history and create an idealized, Hellenistic, peaceful view of the times, offering a heavenly Man-God figure that would have offended the Zealots who \"Could never bring themselves to call any man Lord.\" Part of the Torah and these Zealots insistence was ABSTENANCE FROM BLOOD, which becomes THE central imagery of Paul's new religion, drinking the cup of his Lord's own blood, and eating his body. \n\nCorrect - people who are not Christians do not follow Christian practices.\n\n&gt;Is it not obvious that Paul and his lackeys are writing polemically to denigrate these Jews who hated him, hounded him, and opposed him? The NT uses coded language like \"Pharisees\" to ostensibly refer to the Establishment Jews, but THE ESTABLISHMENT JEWS were on the Herodian/Roman side, and would never act the way they do in the NT. The ZEALOTS, JAMES, THE POOR, THE MANY, now they would indeed act as Paul describes the Pharisees. They would \"nitpick\" over the Law. They would indeed call out his blasphemy\n\nI've lost the thread here, but he is, mercifully, done. \n",
        "created_utc": 1508879696,
        "upvote_ratio": ""
    },
    {
        "title": "Vladimir Medinsky, Minister of Culture of Russia presents his doctorate: \"Problems of objectivity in the coverage of Russian history from the second half of the 15th to 17th centuries\"",
        "author": "Ilitarist",
        "url": "https://www.reddit.com/r/badhistory/comments/78i0p6/vladimir_medinsky_minister_of_culture_of_russia/",
        "text": "[Vladimir Medinsky is an active guy](https://en.wikipedia.org/wiki/Vladimir_Medinsky). He understands internet and became Minister of Culture of Russia when the Russian internet was very much anti-governmental, and he made some efforts to change that. He talks about history a lot and often fights the prevalent view of Russia being a land of human waves and barbarism. Sometimes he goes too far.\n\nRecently he had a problem. People read his doctorate written in 2011, \"Problems of objectivity in the coverage of Russian history from the second half of the 15th to 17th centuries\". It turned out to be bullshit. Now forgive me for my bad English. You may even claim that talking about badhistory that you can only read in a translation is wrong. However, let me quote the doctorate itself to prove it's not the case:\n\n*\"This research uses Russian translations of foreign texts created in 19-20 centuries on a high scientific level. They were made using the most early and reliable printed exemplars. There's no doubt those translations fully represent author's text.\"*\n\nSo, let's talk about some points made there.\n\nMedinsky: *\"As it's known from Russian chronicles, Russian people were the first to face the agression of infidels, i.e. non-Christians - much earlier than Europeans; they succesfully fought back for several years\".*\n\nPerhaps it is true in as much that non-Christian Russians met other, more agressive non-Christians Russians and fought them long time ago (even though at the time they didn't know they were Russians). However, if we look at a more conventional logic then Russia became a Christian land in 988. [Battle of Tours](https://en.wikipedia.org/wiki/Battle_of_Tours) is not the first fight of Christian state against non-Christians but it is famous and it happened in 732, 250 years earlier. You can go even much earlier talking about Christian Roman Empire fighting whoever else. But in any case it's very strange that Medinsky doesn't know about Arabic Conquest of Spain which happened long before any significant Christian presence in Russia.\n\nMedinsky: *\"As it's known, Orthodox believers had scriptures written in Russian so it was easy for them to understand. It was different for Catholics and Protestants. Their scripture was written in Latin which was unknown to a typical believer\".*\n\nYes, this is a quote that begged me to make this post. Everything is wrong here.\n\n- Orthodox scripture was written in Church Slavonic language which was unreadable for a general populace by the time of the Reformation. In fact, [first official Orthodox Bible in Russian was only made in 19th century](https://en.wikipedia.org/wiki/Russian_Synodal_Bible).\n\n- Catholics had translations to other languages for some time such as [French translations in 14th century](https://en.wikipedia.org/wiki/Bible_translations_into_French). They were not used for the service but you could read them.\n\n- It can be argued that general populace couldn't read in any language. And they certainly weren't wealthy enough to have a real Bible to read. One of the reasons the priest is there in you village is just to be able to read anything.\n\n- The whole thing of Protestants was [to allow people use any language for church service and to understand scripture without a priest](https://en.wikipedia.org/wiki/Clarity_of_scripture).\n\nMedinsky: *\"Researching circumstances of creation of various works of foreign authors we can prove that practically every authour writing about Russia is fulfilling the request of various political entities. &lt;...&gt; Their goal was to give readers only the information beneficial to the client and thus to antagonize Europeans.\"*\n\nIt's hard to prove this didn't happen. However this part assumes some sort of control over all the information that came to Europe from Russia as well as some common will amongst European powers in 15-17 centuries. It is very unlikely that such a conspiracy could exist during, say, 30 years war.\n\nAnd now the quote I will leave without a rebuttal. It's right there in the foreword so that you know what's ahead.\n\nMedinsky: *\"The first question that the science of history has to answer with honesty is: how is this or that action reflects interests of the country and the people. Evaluation on scales of Russia's national interests creates the absolute stnadard of truth and trustworthiness of historical work.\"*",
        "created_utc": 1508872140,
        "upvote_ratio": ""
    },
    {
        "title": "ColdFusion gives us some bad computer history with \"The Greatest Story Ever Told\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/78bqdi/coldfusion_gives_us_some_bad_computer_history/",
        "text": "[removed]",
        "created_utc": 1508800813,
        "upvote_ratio": ""
    },
    {
        "title": "My AP United States history teacher claimed the USS Constitution received her nickname \"Old Ironsides\" because her hull was reinforced with iron.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/78auu2/my_ap_united_states_history_teacher_claimed_the/",
        "text": "[deleted]",
        "created_utc": 1508792729,
        "upvote_ratio": ""
    },
    {
        "title": "My Ap U.S history teacher said the USS Constitution was nicknamed \"Old Ironsides\" because her hall was reinforced with iron",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/78aenk/my_ap_us_history_teacher_said_the_uss/",
        "text": "[deleted]",
        "created_utc": 1508788851,
        "upvote_ratio": ""
    },
    {
        "title": "Mindless Monday, 23 October 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/786g8z/mindless_monday_23_october_2017/",
        "text": "Happy (or sad) Monday guys!\n\nMindless Monday is generally for those instances of bad history that do not deserve their own post, and posting them here does not require an explanation for the bad history.  That being said, this thread is free-for-all, and you can discuss politics, your life events, whatever here. Just remember to np link all links to Reddit and don't violate R4, or we human mods will feed you to the AutoModerator.\n\nSo, with that said, how was your weekend, everyone?\n",
        "created_utc": 1508748665,
        "upvote_ratio": ""
    },
    {
        "title": "A look at some African Badhistory on Twitter Part II: Mali Madness",
        "author": "LXT130J",
        "url": "https://www.reddit.com/r/badhistory/comments/784we7/a_look_at_some_african_badhistory_on_twitter_part/",
        "text": "This is a continuation of this post [here] (https://np.reddit.com/r/badhistory/comments/77ua4f/a_look_at_some_african_badhistory_on_twitter_part/). To recap: a guy called Mike and a guy called Omar got into a spat on Twitter over African history. The history presented (seen [here] ( https://twitter.com/MikeStuchbery_/status/920275446503264256) and [here] (https://twitter.com/Omar04618473/status/920423454960123904)) wasn't very good and this exercise is to present some corrections. Part I of this series focused primarily on Great Zimbabwe (and a little East Africa). This part will focus on West Africa with some slight digressions. \n\n**The History of Djenne**\n\nSo with that out of the way, let us move onto some bad Malian history. \n\nLet's start with Mr. Stuchbery's tweet: \n\n&gt; “Djenne in Mali was active since 250 BCE &amp; was a major hub of the gold trade – spectacular.” \n\nHe also includes a photograph of the Great Mosque of Djenne. Omar counters Stuchbery's point with the following tweet: \n\n&gt; “First of all the Djenne region wasn't populated until 250BC the actual city (which was more of a small trading post) wasn't built until the 1100s as with most of Malian civilization.” \n\nStuchbery's tweet is misleading and Omar's tweet is extraordinarily wrong. Let's go into more detail: \n\nThe Djenne that exists at present is not the Djenne that was founded around 250 BCE; there are two Djennes – the abandoned Djenne Djenno and the present day Djenne. The present Djenne is about 3 kilometers away from the old site. This is not only confirmed by archaeology but also by the *Tarikh-es-Sudan*, a history composed by the imam of Timbuktu, al-Sa'di in 1656. This work states that the original Djenne was located at a sight called Joboro and was founded by Pagans around 768 CE and this site was abandoned in favor of the present location. Archaeological surveys conducted by Roderick and Susan McIntosh established that the earliest settlement in Djenne Djenno was around 250 BCE and the city was at its greatest extent around 850 CE. Note that both of these dates are far before the 12th century date of founding Omar proposes; as for the Berbers, they hadn't founded Timbuktu yet (more on that later) much less penetrated this far south!\n\nThis was not a small trading post but rather a densely populated community based on raising cattle, fishing and farming the nearby floodplain; it was also part of a pre-Arabic long distance trading network as well. Population estimates of the site range between 4800 to 12800; if satellite settlements located 1 km from the site are also included, the population estimate rises to somewhere between 10,000 to 26,700 people. \n\nDjenne-Djenno was abandoned around 1400 CE but its successor was just as impressive. Duarte Pereira, a Portuguese soldier and sailor, writing in the early 16th century, described Djenne in the following manner: \n\n&gt; “the city of Jany, inhabited by Negroes, and surrounded by a stone wall, where there is great wealth of gold...The commerce of this land is very great...Every year a million gold ducats go from this country to Tunis, Tripoli of Soria [Syria], and Tripoli of Barbary and to the Kingdom of Boje and Feez and other parts.” \n\nal-Sa'di also confirmed the commercial prowess of Djenne and he also noted the dense population of the region; there were supposedly 7077 densely packed villages around Djenne. If the sultan wanted to convey a message to someone 160 km away, all he had to do was dispatch a messenger to one of the 11 gates of the city and shout the message. The message would be repeated by people outside the city until it reached the recipient. It is a quixotic tale but it goes to demonstrate the aforementioned high population density. \n\n**A look at the Great Mosque of Djenne** \n\nAs for the Great Mosque present in Stuchbery's tweet, that was, as Omar points out, constructed in early 20th century (in 1907). It is supposedly a reconstruction of a mosque originally erected in the early 13th century by the sultan of Djenne, Kunburu, upon his conversion to Islam, and expanded by his successors. Omar states that invading Berbers destroyed the mosque, but once again he is wrong. Around 1819, Fulani jihadists led by Seku Ahmadu conquered Djenne and Djenne was under the rule of the Fulani (not Berbers) when French explorer, Rene Caillie visited around 1828. Caillie noted that the mosque was in a state of disrepair and it was abandoned in 1829. Seku Ahmadu blocked the drains and allowed the rain to destroy the Mosque between 1834-1835 and he constructed a new mosque to the east of the site, which was much less ostentatious than the original mosque. The French colonial authorities weren't big fans of Seku Ahmadu's form of jihadist/reformist Islam and the reconstruction of the Djenne mosque and the replacement of Seku Ahmadu's mosque was a means of undercutting the Fulani and promoting a form of syncretic and tolerant Islam (Islam Noir) palatable to the French. While the French colonial authorities funded the effort to reconstruct the mosque, the actual building process was overseen by a local architect named Ismaila Traore. Still the argument could be made that the present mosque at Djenne is a product of French imperialism rather than an authentic African tradition. It certainly was not a 1:1 reconstruction of the mosque that existed previously. Given its history, the present mosque may not be the best example of authentic African architecture. \n\n**A history of Timbuktu**\n\nNow let's get to Omar's mangling of the history of Timbuktu. Here is the relevant tweet: \n\n&gt; “Now on to the topic of Timbuktu, Timbuktu was first inhabited in 1100AD by Mande as a small trading post presumably for selling slaves in the trans-Saharan slave trade and as Arab historians point out quite unimpressive.” \n\nNow let's unpack the wrongness here:\n\n1) **“Timbuktu was first inhabited in 1100 AD by Mande”** – The *Tarikh-es-Sudan* mentions that Timbuktu was founded by the Maghsharan Tuareg around 1106-1107 CE. This also contradicts Omar's later tweet that the Tuareg invaded and occupied Timbuktu. \n\n2) **“A small trading post presumably for selling slaves in the trans-Saharan slave trade”** - The *Tarikh-es-Sudan* mentions that the Tuareg would use Timbuktu as grazing ground for their herds and would move north when the rainy season set in. They also used the site as a depot for provisions and it slowly grew to be a commercial center and rest stop for travelers. The etymology of Timbuktu is disputed; one possible theory is that the city was named after a slave woman named Buktu, who was assigned to manage the depot. The name Buktu might mean lump or outgrowth (a more poetic reading might be 'She with a protuberant navel') while Tim/Tin means place so the “Place of Buktu”. There is no mention of it being a center for the slave trade.\n\n3) **“as Arab historians point out quite unimpressive.”** - This is a misinterpretation (perhaps willful) rather than a wrong fact. The Arabic historian goes nameless but it is probably ibn Battuta, who visited Timbuktu in around 1350. At this time, Timbuktu was predominantly inhabited by Berbers and various foreigners of Islamic extraction, not black Africans and was still developing into the famous Islamic learning center.\n\n**Civilization IV lied to you about Timbuktu** \n\nCivilization IV might tell you that Timbuktu was the capital of the Mali Empire but Timbuktu only came under the sway of Mali in 1325 (the Mali Empire had been around since before the mid 13th century) , during the reign of the famous Mansa Musa, and they lost control of it in 1433 to the Tuareg (who in turn lost it to the Songhai Empire in 1468).  Leo Africanus' famous description of Timbuktu, which inflamed European imaginations and set its reputation as a fabled city of gold,  was of the city under the rule of the Songhai Empire. This period was also when Timbuktu cemented its reputation as a center of Islamic learning, where over a 150 Quranic schools were active and books from North Africa were imported in large numbers to be copied and collected by scholars.\n \nWhile Timbuktu might not have been central to the Mali Empire, Mansa Musa was responsible \nfor erecting the Djinguerber Mosque (later torn down and enlarged during Songhai times) and a palace called the Ma'Dugu. He also encouraged Islamic learning by dispatching students to learn at Fez, invited scholars to the city and set up quranic schools. We can credit Mansa Musa for laying foundations for Timbuktu's future greatness. \n\nRather provocatively, we can also claim that it was only under the dominion of two black African Empires, that this sleepy little Berber/Tuareg supply depot turn into a legend, which is the exact opposite of what Omar claims. Whatever the case, we cannot apply a simplistic Berber master/Black slave dynamic in light of these facts. What began as a Berber/Tuareg town diversified quickly with black settlers moving into the city and the intellectual and political life of Timbuktu was not solely dominated by the Berbers and Tuareg as a result. \n\n**What was the Capital of Mali Empire? If you've been reading closely so far, you know it's not Timbuktu** \n\nAs to what was the actual capital of Mali, that's a mystery. Ibn Battuta passed by Timbuktu to the capital and Timbuktu was ruled by a Tuareg/Berber prince (called a *Farba*) on behalf of the Malian emperor. Scholars have attempted to locate the Malian capital by tracing Battuta's itinerary and combing through oral traditions. From this search, several candidates have emerged such as Niani (the sixth city on Mali's list of cities in Civ IV), Kangabu/Dieriba (only added in the Beyond the Sword expansion to the list of Malian cities) or the mysterious Dakajalan (not even on the list of cities in Civ IV). Actually, the answer could be all the above because several pieces evidence indicate that the capital was moved over the course of the Malian Empire's history. \n\n**Miscellaneous Mali Musings** \n\nOmar's next two tweets contains material that has mostly addressed above and I only have a few brief comments: \n\n&gt; “Timbuktu became the great city we think it is today after Tuaregs from the Maghsharan tribe (from the south of Algeria) invaded and occupied the city which is why the architecture protected by UNESCO was built after they came” \n\n&gt; “The Tuaregs were eventually driven out of power by the Mande thus creating the Songhai empire but Tuaregs &amp; arabs (I'll get to them) still have a presence in Mali to this day and their influence shouldn't be counted out” \n\nAs pointed out earlier, Timbuktu is a multiethnic city that had undergone several changes of \townership. All that architecture Omar talks about had authors of varying ethnicities and masters, not simply the Berbers/Tuareg and indeed we shouldn't ignore the Tuareg/Berber contribution to Timbuktu \nThe second tweet shows that Omar has confused Songhai and the Mali Empire; it is a common \tmistake, given their geographic proximity and how often they are associated with each other. It \tshould be emphasized that they are distinct political entities with their own unique ethnic roots. \n\n**Digressions** \n\nOmar then goes off on a slight digression about the race of ancient Egyptians. As usual, he's wrong. He posts the following tweet: \n\n&gt; “Considering the plethora of information we have regarding the ethnic composition of ancient Egypt Mike made a wise decision [Stuchbery brings up Egypt in his original tweets and skips over them]” \n\nand posts two blonde mummies afterwards. I don't know what plethora Omar is talking about, but Omar seems to imply that ancient Egyptians were 'white' and had fair hair. This topic has been beaten to death many times and I will point to this informative [post] (https://np.reddit.com/r/assassinscreed/comments/6y5k27/is_assassins_creed_origins_blackwashing_history/) on the Egyptian race question and instead focus specifically on the blonde mummies. I would like to point to a May 2016 [article] (http://www.smh.com.au/technology/sci-tech/some-ancient-egyptians-were-natural-blondes-20160426-gof9hn.html) in the Sydney Morning Herald that's relevant to the topic. The piece extensively quotes Janet Davey, a forensic Egyptologist at the Victorian Institute of Forensic Medicine who examined the fair haired mummies and discovered that they were natural blondes. It should be noted that the fair haired mummies examined by Davey are from the Greco-Roman period (332 BCE to 395 CE). That means that those mummies might not be even Egyptian! So the two blonde mummies don't provide much support for a 'white' Egyptian race. [Edit II: I seem to have misidentified my blonde mummies. The article above doesn't apply to the mummies presented in Omar's pictures.]\n\nOmar's next tweet correctly calls out Stuchbery for misstating the antiquity of The Church of Saint George and then he throws in this snide jab: \n\n&gt; “[Europeans] had far more impressive Cathedrals if you don't mind me in putting my own opinion.” \n\nI won't dispute the impressiveness of European cathedrals, but I ask how many of those cathedrals were carved out of living rock like The Church of Saint George? The Ethiopians didn't carve out just one but eleven total at Lalibela. Such a feat should be celebrated, I should think. \n\nI will skip the next three of Omar's tweets about Ethiopian iconography. I'd rather not get into art history and shall leave that to the experts. \n\nOmar then goes onto peddle some twaddle about the Berber 'masters' introducing literature to black Africans; I have already laid out the history of Timbuktu and it certainly isn't that of Berber imperialists 'civilizing' black Africans. I have also touched briefly on the intellectual history of Timbuktu and have shown that its 'golden age' of learning was under the rule of Songhai and not under the Berbers/Tuareg.\n\n**Mansa Musa and an Anachronistic Moroccan Invasion (Part I)** \n\nAnd now at long last, we have arrived at Omar's most incorrect tweets. \n\nHere is Omar on why Mansa Musa undertook his famous trip to Mecca: \n\n&gt; “Mansa Musa's trip to Mecca was a political cry for help he feared the Sultan of Morocco would invade Songhai so to prevent this he sent money to Arab sultans most nostably the sultan of Cairo in the hoes that they would convince the Moroccans not to invade” \n\nMorocco during the reign of Mansa Musa (1307-1332) was under the rule of the Marinid dynasty. Contrary to Omar's assertions, the relations between the Marinids and the Mali Empire was quite friendly. The historian ibn Khaldun recorded an encounter between the Marinid sultan and ambassadors  from Mali in 1331. During the course of the embassy, Mansa Musa died and the Marinid sultan sent back the ambassadors with gifts for his successor. In addition, the Marinid regime was under military pressure from the Portuguese and Castilians in the north and so their resources would not be available for a military expedition across the Sahara even if they desired an invasion. \n\nSo why did Mansa Musa go to Mecca? Most probably because he was a good Muslim and a trip to Mecca is a tenet of the Islamic faith. He wasn't even the first ruler of Mali to go on hajj. Mali might have been founded by the pagan wizard-king (a king who was a wizard, not a king of wizards) Sundiata but Islamic influence crept in almost immediately. Sundiata's son and heir Uli undertook the hajj and set a precedent for Malian rulers. Indeed, one of Musa's predecessors, Sakura was murdered while returning from Mecca. \n\n**Mali and Songhai are two different Empires** \n\nI should also note that Mansa Musa was the ruler of Mali and not Songhai. These are two separate political entities. The Songhai empire was based out of Gao which is to the east of Timbuktu. The Malian empire on the other hand has its origins to the south and west of Timbuktu. Gao did fall under the sway of Mansa Musa but it quickly gained independence and blossomed into its own empire after his death. \n\n**Mansa Musa and an Anachronistic Moroccan Invasion (Part II)** \n\nLet's continue with Omar's next tweet: \n\n&gt; “Eventually with the help of Spanish convert the Moroccans were able to take Timbuktu after Musa's death this occupation that followed as brutal as it was integrated Timbuktu &amp; west Africa as a whole into the Arab Islamic world “ \n\nTechnically, Omar is correct. There was a Moroccan invasion that seized Timbuktu after Mansa Musa's death. The thing is, that invasion was in 1591 and Mansa Musa died in 1332. It should be noted that the Moroccans invaded the Songhai Empire, and as established, Mansa Musa had nothing to do with the Songhai Empire which rose after his death. Let me provide you an analogy to capture how wrong Omar is here: this would be like me saying “James Monroe issued the Monroe Doctrine to prevent the Soviets from placing nuclear missiles in Cuba.” \n\nI would also like to point out that the Mali and Songhai empires were pretty well integrated with the broader Arabic Islamic world before the Moroccan invasion. Mansa Musa was exchanging ambassadors with other Islamic powers, caravans from Northern Africa visited Timbuktu and Djenne. Students from Mali were going to Fez to study and similarly, scholars were visiting Timbuktu. Mansa Musa brought in architects and other technicians from the broader Islamic world to beautify his empire. How much further could they be integrated? \n\n**Summary** \n\nSo that concludes our look at some Malian bad history. What have we learned?\n\n**1) Mike Stuchbery is occasionally misleading in his tweets and Omar is mostly incorrect.**\n\n**2) Sites like Djenne show that there was indigenous development of complex societies outside the influence of Berbers and Arabs.**\n\n**3)  Timbuktu was a late acquisition (not a conquest, the people of Timbuktu invited Mansa Musa to rule over them upon his return from his famous hajj) of the Mali Empire and was not its capital at any point.Timbuktu started out as a Berber/Tuareg town and the population gradually diversified ethnically as the city grew under the dominion of Mali and Songhai. Timbuktu's Golden Age was under Songhai though Mansa Musa did lay the foundation for its future greatness.**\n\n**4) Mansa Musa went to Mecca probably because he was a pious Muslim. He exchanged pretty friendly embassies with the Marinids of Morocco and his realm wasn't under threat of invasion from Morocco**\n\n**5) Mali and Songhai are two separate empires and Mansa Musa ruled Mali, not Songhai.**\n\n**6) The Moroccans invaded the Songhai Empire some 259 years after Mansa Musa died so the idea that his trip was a plea for protection from a Moroccan invasion is ill informed.**\n\n**Sources:** \n\n**On Djenne**\n\nMcIntosh, Roderick. Ancient Middle Niger: Urbanism and the Self-organizing Landscape. Cambridge University Press. 2005 \n\nConnah, Graham. African Civilizations: An Archaeological Perspective. 2nd ed. Cambridge University Press. 2001\n\nMcIntosh, Roderick and Susan McIntosh. “Cities without Citadels: Understanding Urban Origins along the Middle Niger.” The Archaeology of Africa: Food, Metals and Towns, edited by Thurstan Shaw et al. Routledge. 2014 \n\nHunwick, J.O. Timbuktu and the Songhay Empire: Al-Saʿdi's Taʾrīkh Al-Sūdān Down to 1613, and Other Contemporary Documents. Brill. 2003 \n\n**On the Great Mosque**\n\nPicton, John. “Keeping the Faith.” Islamic Art in the 19th Century: Tradition, Innovation, And Eclecticism, edited by Doris Behrens-Abouseif and Stephen Vernoit. Brill, 2006. \n\nDe Jorio, Rosa. Cultural Heritage in Mali in the Neoliberal Era. University of Illinois Press, 2016. \n\n**On Timbuktu**\n\nSaad, Elias N. Social History of Timbuktu: The Role of Muslim Scholars and Notables 1400-1900. Cambridge University Press, 1983. \n\nHofheinz, Albrecht. “Goths in the Land of the Blacks: A Preliminary Survey of the Ka'ti Library in Timbuktu.” The Transmission of Learning in Islamic Africa, edited by Scott Reese. Brill, 2004 \n\nIbn Battuta. Travels in Asia and Africa: 1325-1354. Routledge, 2013. \n\n**On the Capital(s) of Mali**\n\nHunwick, J.O. “The mid-fourteenth century capital of Mali.” The Journal of African History 14 (1973).195-206 \n\nGreen, Kathryn L. “Mande Kaba,” the Capital of Mali: A Recent Invention?” History in Africa, 1991 \n\nConrad, David C. “A town called Dakajalan: The Sunjata Tradition and the Question of Ancient Mali's Capital.”  The Journal of African History 35 (1994). 355-377. \n\n**Mansa Musa**\n\nNiane, D.T. “Mali and the second Mandingo Expansion.” General History of Africa: Africa from the Twelfth to the Sixteenth Century, edited by D.T Niane, vol IV. UNESCO, 1984. \n\nMeisser, Ronald A. and James A. Miller. The Last Civilized Place: Sijilmasa and its Saharan Destiny. University of Texas Press, 2015. \n\nLevtzion, Nehemia. “Islam in the Bilad-al-Sudan to 1800.” The History of Islam in Africa, edited by Nehemia Levtzion and Randall L. Pouwels. Ohio University Press, 2000. \n\nLevtzion, Nehemia. “The Thirteenth and Fourteenth-Century Kings of Mali.”  The Journal of African History 4 (1963). 341-353.\n\nEdit: Corrected spelling mistakes",
        "created_utc": 1508726886,
        "upvote_ratio": ""
    },
    {
        "title": "Sunday Studies, 22 October 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/77zs6f/sunday_studies_22_october_2017/",
        "text": "Find a book you like? Read an intriguing article from JSTOR last week? Want to discuss and get recommendations for new books? This is the thread for it! Come one, come all, please let us know what you've been reading this week!\n\nNote: unlike the Monday and Friday megathreads, this thread is *not* free-for-all. You are free to discuss books that you've read, articles you liked, and similar. But please save the personal updates for Mindless Monday! \n",
        "created_utc": 1508673064,
        "upvote_ratio": ""
    },
    {
        "title": "Infamous \"chronicler\" of history \"Trazyn the Infinite\" cares more for spectacle than historical accuracy.",
        "author": "Defengar",
        "url": "https://www.reddit.com/r/badhistory/comments/77ukdz/infamous_chronicler_of_history_trazyn_the/",
        "text": "[removed]",
        "created_utc": 1508605401,
        "upvote_ratio": ""
    },
    {
        "title": "Infamous \"chronicler\" (thief) of history \"Trazyn the Infinite\" cares more for spectacle than historical accuracy.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/77ui38/infamous_chronicler_thief_of_history_trazyn_the/",
        "text": "[removed]",
        "created_utc": 1508604765,
        "upvote_ratio": ""
    },
    {
        "title": "A look at some African Badhistory on Twitter Part I: Great Zimbabwe Edition",
        "author": "LXT130J",
        "url": "https://www.reddit.com/r/badhistory/comments/77ua4f/a_look_at_some_african_badhistory_on_twitter_part/",
        "text": "On October 17th, history writer Mike Stuchbery (the same guy who, incidentally, sparked off the 'were there black Roman soldiers in Britain?' debacle) posted a series of [tweets] (https://twitter.com/MikeStuchbery_/status/920275446503264256) about African history. This prompted the following ['rebuttal'] (https://twitter.com/Omar04618473/status/920423454960123904). There are issues with Stuchbery's set of tweets but the rebuttal, while better informed on some points, is substantially worse in terms of content and accuracy. Amusingly, we can use Stuchbery's critic's (henceforth referred to as Omar for simplicity's sake) own words to rationalize the need for this post, to quote:  \n\n&gt; “Every now and then you come across a thread so wrong you have to make a thread about it well ladies and gentlemen you're in for a treat.” \n\n\nI don't know about providing a treat, but I sure hope we can clarify some things about African history. \n\n\nLet's begin with Great Zimbabwe: Mike Stuchbery claims that Great Zimbabwe has a population comparable to Medieval London and he cites a Scientific American article to back up his claim.  Archaeologists offer a range of possible populations for Great Zimbabwe and it should be noted that the Scientific American article does acknowledge this fact. The lowest population estimate is between 1000 and 2500 individuals and is provided by Peter Garlake. The upper estimate is 18,000 to 20,000 and is provided by Thomas Huffman. Dr. Huffman's numbers were arrived at indirectly and were based on the number of huts excavated at the site. He assumed that there was one adult per hut and he extrapolated the total population based on early colonial census data gathered in the region (this would allow you to gauge items such as  fertility, life span and child mortality and so on). So the population estimate is a mixture of solid fact (number of huts excavated) and assumptions and given the lack of written evidence, it is is the best we can probably do. Of course, the debate over Great Zimbabwe's population isn't settled yet as seen in a  [recent paper] (http://journals.plos.org/plosone/article?id=10.1371/journal.pone.0178335) by Chirikure et al. which questions Huffman's high end estimate based on limits of local infrastructure and environment (the paper is free to access and provides a pretty good insight into the sort of fieldwork and guesswork that goes into mapping out the demographics of the site. I believe Stuchbery references this paper in an unrelated tweet and corrects his original point.) \n\n\nSo Stuchbery overstated his case about the population of Great Zimbabwe. Now let's move on to Omar's claim, which is: \n&gt; “Great Zimbabwe was a trading post used by Yemenite traders, many of whom of Jewish origin from the region of Hadramout.” \n\n\nThe pedigree of Omar's claim that Great Zimbabwe was built by foreigners (Arabs, Phoenicians, Israelites – take your pick) is old as the first European discovery of the site back in 1871. Omar cites the Lemba people as evidence of this position and little else. The description of the Lemba is mostly correct. They are a Bantu speaking South African ethnic group who claim to be of descendants of Jews originating from what is modern day Yemen. There is some truth to these traditions as genetic studies of the Lemba show that at least 50% of their Y chromosome is of Semitic origin (see Trefor Jenkins' article in the *American Journal of Human Genetics*). However fascinating, this does not show that Yemeni Jews or the Lemba built Great Zimbabwe. What is needed is archaeological evidence and what exists does not support the Yemeni origin of Great Zimbabwe. Let's run through the evidence, shall we? \n\n\nFirst, Great Zimbabwe is not unique; that doesn't mean it's not great, only that there are many other (approximately 200) examples of the dry (mortarless/cementless) stone architecture spread all across South Africa. The popular depictions of Great Zimbabwe only show certain features like the so-called Great Enclosure, but the site spans nearly 1800 acres and is composed multiple ruins. The dry stone walls located in the Great Enclosure top out at 32 feet, other highlights include the outer walls of the Hill Complex (which have a maximum height of 37 feet) and the conical stone tower which has a height of 30 feet. Focusing on the stone however ignores the numerous clay daga houses which dot the site. Perhaps they are not as architecturally impressive, but this was where the inhabitants of Great Zimbabwe lived and they serve as invaluable insights into the past. \n\n\nProper archaeological examination of Great Zimbabwe began in 1906, when the British Association for the Advancement of Science dispatched David Randall-MacIver, an academically trained Egyptologist, to examine the ruins. He not only accomplished that but also examined other locations such as Khami, Danagombe and Naletale. While these sites were not as big as Great Zimbabwe, all of them were feature the dry stone architecture present at Great Zimbabwe. After examining these sites, Randall-MacIver concluded that these sites were built by locals and were “essentially African” (see Randall-MacIver's Medieval Rhodesia for his conclusions). Randall-MacIver's conclusions were confirmed in 1926 by JF Schofield and by further excavations in 1929 conducted by Gertrude Caton-Thompson; later archaeologists like Huffman and Garlake too support the idea that Great Zimbabwe and other such sites were constructed locally. So what evidence is there for a local origin? Here's a short list: \n\n\n1) All the Arab, Persian and Chinese porcelains and glass objects recovered from the Great Zimbabwe date to the 14th and 15th century AD, much later the earliest occupation of the site.\n\n\n2) The stone walls of the Great Zimbabwe were erected in the 13th century. Pottery recovered in layers below the stone walls show that the site was occupied beforehand and as for the style of the pottery? They resemble local traditions rather than that imported from Arabia or Western Asia. Similarly ironwork, furnaces and tools excavated at the site also resembles locally produced objects. \n\n\n3) The curved stonework at Great Zimbabwe doesn't resemble the geometric/symmetric designs of the Middle East. Examination of the walls also demonstrate that there was a gradual refinement of masonry techniques. The earliest walls were poorly coursed with the granite stones arranged haphazardly; gradually the coursing became neater. Most walls in Zimbabwe show a mixture of these two styles of coursing and so demonstrate a gradual buildup of the site. \n\n\nSo, basically Omar is full of shit and the evidence doesn't support the theory that Yemeni traders constructed Zimbabwe \n\n\nOur next region of interest is East Africa. Stuchbery highlights Ethiopia and Axum as two examples of black African civilization. Omar counters this highlighting Western Eurasian genetics (brought in by neolithic migrations) and cultural influences (for example, the Ethiopian claims of descent from King Solomon) present in East African populations. The implication is that because there were Western Eurasian influences in Ethiopian civilization, that these foreign sources were the root of Ethiopian civilization making Axum and its successors not an example of an authentic African civilization. I have to call out the double standard here because it can be demonstrated that all these point apply to European civilization as well and yet we do not consider Rome as an offshoot of Near Eastern Civilization. There were Neolithic migrations of Near Eastern farmers into Europe as well migrations from the Pontic steppe. The predominant belief systems of Europe were imported from the Near East as was writing (the numerical system came from Slightly Farther East). Perhaps the greatest European civilization, Rome claimed descent from refugees from Anatolia and this trend was followed by the Franks, the British and numerous others and yet we don't consider the Carolingian Empire or Rome as foreign to Europe. So let's put to rest this idiotic double standard, shall we? \n\n\nThis is getting quite long and there is a lot more bad African history (including an absolute howler about Mansa Musa) to go through, so I will stop here and follow up with Part 2 in a separate post. The major takeaways here are: \n\n\n**1) There is no archaeological evidence to show that Jews/Arabs/Phoenicians built Great Zimbabwe**\n\n\n**2) Estimating populations based on archaeological data is imprecise and so the best we can do is propose a range of potential populations for a site like Great Zimbabwe**\n\n\n**3) Great Zimbabwe was one of many sites in South Africa that demonstrates dry stone architecture and so isn't that unique (but it still is pretty great)**\n\n\n**Sources:** \n\n**Information on the Lemba:**\n\nParfitt, Tudor and Emanuela Semi. Judaising Movements: Studies in the Margins of Judaism. Routledge Curzon. 2002 \n\n**Information on Great Zimbabwe:**\n\n“Great Zimbabwe”. Dictionary of Archaeology. 1999 \n\nChirikure, Shadreck et al. “What was the population of Great Zimbabwe (CE1000-1800).” PLOS One. Web.14 June 2017. http://journals.plos.org/plosone/article?id=10.1371/journal.pone.0178335\n\nNdoro, Webber. “Great Zimbabwe”. Scientific American. Jan 1, 2005.\n\nPikirayi, Innocent. The Zimbabwe Culture: Origins and Decline of Southern Zambezian States. AltaMira Press. 2001 \n\nConnah, Graham. African Civilizations: An Archaeological Perspective. 2nd ed. Cambridge University Press. 2001\n\nChirikure, Shadreck and Innocent Pikirayi. *Inside and outside the dry stone walls: revisiting the material culture of Great Zimbabwe.* Antiquity 82 (2008). 976-993\n",
        "created_utc": 1508602512,
        "upvote_ratio": ""
    },
    {
        "title": "Bismarck - The Socialist",
        "author": "LordLoko",
        "url": "https://www.reddit.com/r/badhistory/comments/77twpq/bismarck_the_socialist/",
        "text": "[removed]",
        "created_utc": 1508598702,
        "upvote_ratio": ""
    },
    {
        "title": "On Dadaism: \"Sure! It's an artistic current that sought to make fun of contemporary art and the mandate that \"anything can be art\". Look up \"The fountain\" for the most famous example of Dadaism.\"",
        "author": "jockstrapsmell",
        "url": "https://www.reddit.com/r/badhistory/comments/77slfu/on_dadaism_sure_its_an_artistic_current_that/",
        "text": "[Oh lord](https://np.reddit.com/r/AskReddit/comments/77m6c2/professors_of_reddit_whats_something_one_of_your/donkmd4/)\n\nIt's just...wrong. Granted, I don't know a *lot* about art history, despite my love for art. The motif of \"anything being art\" was really an element of post-modern ideas, for one, although even that would read like some reductionist comment on reddit. And then everything else about the comment is wrong. Dadaism was a rejection of logic, reason, rules. It was an opposition to capitalism and the bourgeois and some of the more intellectually...elitist (that's how one of my lit professors described it, anyway) leanings of modernism; more specifically, that art was meant to have an element of inaccessibility. If anything, Dadaism was a push *towards* the idea that anything could be art. \"Fountain\" was not an act of parody; its perception is that of a legitimate high-concept piece of art. Even to call it the \"most famous\" example of Dadaism would be rather forward. \n\nThe worst part? Supposedly this poster *teaches* art history.",
        "created_utc": 1508580715,
        "upvote_ratio": ""
    },
    {
        "title": "What are some examples of bad history or common misconceptions in the crusades?",
        "author": "awiseoldturtle",
        "url": "https://www.reddit.com/r/badhistory/comments/77m3m7/what_are_some_examples_of_bad_history_or_common/",
        "text": "[removed]",
        "created_utc": 1508506432,
        "upvote_ratio": ""
    },
    {
        "title": "Free for All Friday!, 20 October 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/77lkln/free_for_all_friday_20_october_2017/",
        "text": "It's Friday everyone, and with that comes the newest latest Free for All Friday Thread! What books have you been reading? What is your favorite video game? See any movies? Start talking!\n\nHave any weekend plans? Found something interesting this week that you want to share? This is the thread to do it! This thread, like the Mindless Monday thread, is free-for-all. Just remember to np link all links to Reddit if you link to something from a different sub, lest we feed your comment to the AutoModerator. No violating R4!\n",
        "created_utc": 1508500263,
        "upvote_ratio": ""
    },
    {
        "title": "What are examples of bad history that I likely believe due to my limited education and general liberal bias?",
        "author": "TylerMacintyre",
        "url": "https://www.reddit.com/r/badhistory/comments/77g5yu/what_are_examples_of_bad_history_that_i_likely/",
        "text": "Seeing recent posts on this subreddit primarily discussing the right wing using horrifically bad history to push an agenda, what do I likely believe as a liberal about history that is bad history? Inspired by seeing [this](https://www.reddit.com/r/badhistory/comments/1slpwe/as_a_leftist_what_bad_history_have_i_probably/) post from 3 years ago.",
        "created_utc": 1508435897,
        "upvote_ratio": ""
    },
    {
        "title": "Phantom Time Comeback Tour: Facebook Edition",
        "author": "theprof739",
        "url": "https://www.reddit.com/r/badhistory/comments/778tol/phantom_time_comeback_tour_facebook_edition/",
        "text": "Saw this [article](http://all-that-is-interesting.com/phantom-time-hypothesis?utm_campaign=pdhhustle&amp;utm_source=facebook&amp;utm_medium=social) being shared across Facebook the past week or so, and was even tagged in it by a few well meaning family members. I'm not going to refute the whole Phantom Time Hypothesis as it has already been tackled here on this subreddit so I'm going to focus on this one portion that stuck out to me as odd upon first perusal.\n&gt; Illig claims that Pope Sylvester II, Holy Roman Emperor Otto III, and Byzantine Emperor Constantine VII all got together and changed the calendar to make it seem as if Otto had begun his reign in the millennial year of 1000 AD, rather than 996. The reason being that 1000 sounded a lot more meaningful than 996 considering AD stands for “anno domini,” or, “the year of the Lord.”\nIllig further claims that the trio altered existing documents, and created fraudulent historical events and people in order to back themselves up.\n\nYou see the thing that seemed odd was the fact that well I was pretty sure, bordering on absolute certainty, that Basil II was Byzantine Emperor in 996. Off to Wikipedia I went, to make sure my memory wasn't faulty, and as I rightly suspected in 996 Basil II was indeed Basileus and his grandfather Constantine VII, our would-be conspirator, had been dead for 36 years. \n\nWith such a basic mistake uncovered I figured I should check on the rest of the Trio just to be sure they weren't all dead at the time. Our Prime suspect Otto III was and alive and healthy 16 year old in 996 and did receive the Imperial crown in that year. So far so good, except the wiki states that Otto was Crowned by the newly consecrated Gregory V, his cousin. It seems that Gerbert d'Aurillac was not only 3 years shy of becoming the first French pontiff, but was at that time not even a bishop, due to the controversy of the deposition of his predecessor.\n\nMaybe the article is right though. Otto would support Gerbert's election to the papacy, upon the death of his cousin Gregory V in 999. Perhaps this was all prearranged for the future Sylvester II, in exchange for the renown Polymaths Skill as a NECROMANCER to raise the late Constantine VII to help them Hoodwink all of Europe. \n\nSources: Wikipedia; because if you are going to invent a conspiracy between three people, you should always make sure all three were alive at the same time. ",
        "created_utc": 1508353530,
        "upvote_ratio": ""
    },
    {
        "title": "Wondering Wednesday, 18 October 2017, The Spy Who Loved History - Your Favourite Intelligence and Counterintelligence Stories",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/7760un/wondering_wednesday_18_october_2017_the_spy_who/",
        "text": "Gathering intelligence on other nations has been a job that is fascinating, complex, and often shrouded in mystery. Due to its secretive nature, historical documentation is often sparse or hard to find. This of course didn't stop people from filling in the gaps, and the well-trained secret agent has been a staple of movies and TV for more than half a century. And before that espionage novels have fascinated readers everywhere since at least 1821 and continue to do so. But we ignore the Jason Bournes, Jack Ryans, and Tim Donohues, and focus on the real thing here. So, who is your favourite historical spy, under-cover agent, or information gathering diplomat? Or what are your favourite espionage or counter-espionage organisations or stories? Don't compromise recent missions and keep the 20 year rule in mind for this one. \n \nNote: unlike the Monday and Friday megathreads, this thread is *not* free-for-all. You are free to discuss history related topics. But please save the personal updates for Mindless Monday and Free for All Friday! Please remember to np link all links to Reddit if you link to something from a different sub, lest we feed your comment to the AutoModerator. And of course no violating R4! Also if you have any requests or suggestions for future Wednesday topics, please let us know via modmail. \n",
        "created_utc": 1508327467,
        "upvote_ratio": ""
    },
    {
        "title": "Real crusades History: We are not here for history, we're here for the \"DEUS VULT!!\"",
        "author": "OmarAdelX",
        "url": "https://www.reddit.com/r/badhistory/comments/7705wl/real_crusades_history_we_are_not_here_for_history/",
        "text": "I have been a fan of history for a long while in my life, and in all stages of medieval Spain for a while now, like three years or so, been reading my ass off of any scraps of paper i could find about all the kingdoms. Taifas, Caliphates, emirates that existed from 500 till the Spanish war of succession that broke out in 1701\n\nThis special interest has pushed me to get a degree in it\n\nanyway, though being fan of books more than videos and more cultural history than political one, i just happened to be delving through all history you-tubers kind of later on, when i read/studied both Arabic resources, and english books by either translated from Spanish or written originally in English \n\nbefore i start though, i should hint that the channel's original content is about the Crusades, not the Medieval Spain. But they introduced The Reconquest and they have separate playlists that covers early, high and late medieval Spain so I'll be covering each in turn if I have time for it, showing you the scandalous amount of mistakes and the unprofessionalism, which implies that they don't even appreciate their fans to tell them the truth as it is..and it really doesn't need a history student to spot it, some honest googling will do it\n\nAlso, I don't want it to be a very long post so I think this hilarious video will be a good start, being a more concerned person about cultural history not political one (most of his videos are probably as accurate if not even worse, especially those who deal with Spanish history)\n\nthe Video is titled **Visigothic Brilliance: Pre-Islamic Spain's Thriving Intellectual Life**\n\n\nhttps://www.youtube.com/watch?v=5QlrpWDW-y8&amp;t=8sv\n\nthe first 6 minutes were kind of ok , though he is using the what-the-media-is-hiding-from-you conspiracy tone. the Visigoths did have a thriving culture and they contributed many things to modern world like family law, property law and gothic manuscript and the famed gothic art, some good poetry too, though not as bright in philosophy and astronomy and natural sciences \n\nall in all the entire situation in the newly ex-roman territories period according to other historians was a general decline in culture after the fall of the western roman empire so a \"bastion of culture\" is really a stretch\n\nhere is a great discussion about it \n\nhttps://history.stackexchange.com/questions/12085/what-happened-to-cities-in-the-western-roman-empire-after-the-fall-of-rome\n\n\nhe also in 3:00 used the term \" brief period of chaos\" which was a bit inaccurate describing how the Visigoths took over Romano-Hispania, there were battles against the Suevii, and battles against the Huns, revolts, civil wars, sectarian wars between Arianists and Catholics, so it wasn't brief, some sources (Chronicles of 754 by Isidorus Pacensis) cite that Actually the arabs came by an invitation from the losing side of the civil war that erupted in Iberia prior to the Umayyad invasion, so it wasn't really a Pax Visigothae\n\n\n\n\nhere where comes the real shit. In 6:30 he start to talk about how the later post Visigothic period was long and bleak that interrupted the civilization, ugh well, surprise surprise, it wasn't.\n\n\n  \nthe Arab and Berber kingdoms that came later had so many bright and renowned scholars like Abulcasis in surgery, Averroes and Maimonides in philosophy, Wallada and ibn zaidon in poetry (heck there are so many poets back then, literally most emirs were poets too), Ibn Khaldoun, Ibn Firnas\n\nand guess what? some Visigoths converted to Islam and were called \"muwallads\", and they continued contributing to culture like , there were historians like Ibn al Quotiyah, Said al-andalusi, who were half berber and half Visigoth \n\n\nhttps://en.wikipedia.org/wiki/Muladi\n\n\n\nthey founded schools of learning, made and later introduced a new style in architecture (the horseshoe arch) to europe, not to mention translation movement and it wasn't only for Arabs, Berbers, Andalusians or Muslims only, some Leonese, Castillian and Navarran Kings learned there like García Íñiguez of Pamplona, Alfonso VI who spent 10 years of his life in Dhunnunid Toledo\n\n\nit's a very long list…\n\nhttps://en.wikipedia.org/wiki/Category:People_of_Al-Andalus\n\nhe then realise his mistake and tried to repair it with yet bigger mistake when he refers to philosophy and intellect as \"their own intellect, science and their own philosophy\" around 7:00\n\nWTF? Does philosophy and knowledge have nationalities? It's fcking universal dude, everyone learns from the rest, there is no such thing as our philosophy/intellect and theirs \n\nthen he tries to mend it all with yet more miserable attempt to paint the people of North Africa as barbarians, forgetting the fact that this entire area was roman territory too, and had produced similar amount of philosophers, theologians, historians whom contributed as much as the Visigoths some of them were even Christians (though regarded as heretics), ever heard of St. Augustine dude? He was North African, ever heard of priscian? or Arius? He was North African too, Pope Gelasius? Donatus magnus? so they weren't illiterate barbarians you punk\n\nhttps://en.wikipedia.org/wiki/List_of_Berber_people \n\n\nneither Arabs at this period as well, The Umayyads back then had administrative form of governing, they were traders and famed for their inventing to first currency in the Arabic history, even Modern Arab nationalism regards the period of the Umayyads as the beginning of the Arab Golden Age, so they were not something like the Huns or Mongols who lived on raiding and pillaging^2\n\nhttps://en.wikipedia.org/wiki/Umayyad_architecture\nhttps://en.wikipedia.org/wiki/Arabic_calligraphy\n\nIn the end of the Video he cited a book and suggested the viewers to read in it, while in fact I doubt he even read it. \n\n",
        "created_utc": 1508261703,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone have a link to that post that was circulating a few days ago with the textbook that said Indians agreed to leave?",
        "author": "SoldierofVol",
        "url": "https://www.reddit.com/r/badhistory/comments/76v2j1/does_anyone_have_a_link_to_that_post_that_was/",
        "text": "[removed]",
        "created_utc": 1508201810,
        "upvote_ratio": ""
    },
    {
        "title": "Mindless Monday, 16 October 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/76p7ve/mindless_monday_16_october_2017/",
        "text": "Happy (or sad) Monday guys!\n\nMindless Monday is generally for those instances of bad history that do not deserve their own post, and posting them here does not require an explanation for the bad history.  That being said, this thread is free-for-all, and you can discuss politics, your life events, whatever here. Just remember to np link all links to Reddit and don't violate R4, or we human mods will feed you to the AutoModerator.\n\nSo, with that said, how was your weekend, everyone?\n",
        "created_utc": 1508143864,
        "upvote_ratio": ""
    },
    {
        "title": "Indigenous people ruined the landscape of Australia by \"burning everything down\", \"refused to develop farming\", and ignored \"what mother nature was telling them\".",
        "author": "boringsuburbanite",
        "url": "https://www.reddit.com/r/badhistory/comments/76oqk7/indigenous_people_ruined_the_landscape_of/",
        "text": "Indigenous history is a highly contentious thing for some people in Australia. They adhere to the most ridiculous made-up ideas without a shred of evidence, refusing to even accept that contrary evidence exists. Because of this refusal of history, very important scholarly works that disprove common myths have been completely ignored by many Australians, failing to penetrate the popular consciousness despite the popularity of the myths that they completely shatter.\n\nThese Australians have a tendency to characterise absolutely anything about Indigenous people as negatively as possible, seeing even a *discussion* about their history, culture, etc, as a travesty. \n\nThis user on /r/Australia is one of these people.\n\n[Um... I'm sorry but the reason South America and Australia look so different is because the population would live somewhere till there was nothing left to eat, and then they would burn it all down and move on.\nThey changed the countries landscape after a few hundred thousand years of doing so. That is why most plants here can now survive bush fires, because everything else went extinct.](http://np.reddit.com/r/australia/comments/76mx35/ancient_aboriginal_burning_techniques_return_to/dofdwt5/)\n\nI'm no ecologist but I'm pretty sure South America and Australia look different because South America has a massive fuckoff jungle right in the middle while Australia has a massive fuckoff desert. Anyway, \n\n&gt; They changed the countries landscape after a few hundred thousand years of doing so.\n\nFew hundred thousand?? I'm pretty sure current estimates top out at 60,000-80,000.\n\nUser also comments again further down:\n\n&gt; If you refuse to develop farming and ignore what mother earth is telling you, sure. \n\n&gt; They used the land until it was almost dead, and then they burnt it and moved on.\n\n&gt;That doesn't sound like the work of a people in tune with the land around them.\n\nFirstly, some Indigenous people did develop what we'd consider agriculture. Here's a quote that summarises some primary accounts from European explorers in the early 19th century:\n\n&gt; When explorer George Grey first entered the Victoria District of the central west coast of Western Australia in 1839, he noted yam fields of square kilometres in extent. One tract “extended east and west as far as we could see”. Further south he recorded that “the whole of this valley is an extensive warran [yam] ground”. A few years later Augustus Gregory, a surveyor who later became a famous explorer and Surveyor General of Queensland, stated that the local Aboriginal population “never dug a yam without planting the crown in the same hole so that no diminution of food supply should result”. Another colonial explorer, Lt. Helpman, commented in 1849 that the Nhanda and Amangu “are a fine race of men but seem to depend entirely upon warran and gum, of which they have great abundance”.\n\nThere's more about this kind of Indigenous agriculture in Bruce Pascoe's *Dark Emu, Black Seeds.* Which additionally discusses aquaculture, which was more commonplace than sedentary agriculture.\n\nHowever, fire-stick farming *was* agriculture. It was just not sedentary agriculture. Bill Gammage's *The Biggest Estate on Earth: How Aborigines made Australia* is a seminal text on \"fire-stick farming\", a type of sustainable nomadic agriculture practiced by Indigenous Australians, which ensured that the land and its resources would regenerate when they return. Essentially, they burned down bushlands which would then regenerate as pastures, attracting animals &amp; encouraging the growth of edible plants, which the Indigenous people would then hunt/harvest upon their return seasons or years later.\n\nGammage's primary thesis, formed over 10+ years of painstaking analysis of primary European sources, comparisons of pictures from the 19th century and now, his own field work, etc, is that this type of farming was actually very beneficial for the land - \"an extraordinarily complex system of land management using fire, the life cycles of native plants, and the natural flow of water to ensure plentiful wildlife and plant foods throughout the year.\" He compellingly argues in his seminal book, cited academically over 500 times in just 5 years, which as far as I'm aware no one has bothered trying to extensively refute, that their agricultural practices were so beneficial for the condition of the land that it provided the foundation for later European agriculture itself. For example, he specifically notes that the area chosen for the initial foundation of the city of Canberra, due to its abundance of greenery and fertile farmland, had been heavily fire-stick farmed by Indigenous people. \n\nTheir techniques were ingenious, considered, bordering on scientific, and they certainly did \"listen to mother nature\". That is precisely *how* they developed these techniques.\n\nSo, basically, they didn't ruin the land. They improved it.",
        "created_utc": 1508136054,
        "upvote_ratio": ""
    },
    {
        "title": "How to come across as a massively ignorant racist and Eurocentrist all the while race-splaining.",
        "author": "yeshras",
        "url": "https://www.reddit.com/r/badhistory/comments/76jlqg/how_to_come_across_as_a_massively_ignorant_racist/",
        "text": "[removed]",
        "created_utc": 1508081725,
        "upvote_ratio": ""
    },
    {
        "title": "\"[In Iran] ‘Sharia law took over’ thanks to the US and UK toppling the secular government and installing a theocracy.\", +618",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/76jk6g/in_iran_sharia_law_took_over_thanks_to_the_us_and/",
        "text": "[removed]",
        "created_utc": 1508081303,
        "upvote_ratio": ""
    },
    {
        "title": "Sunday Studies, 15 October 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/76ijdy/sunday_studies_15_october_2017/",
        "text": "Find a book you like? Read an intriguing article from JSTOR last week? Want to discuss and get recommendations for new books? This is the thread for it! Come one, come all, please let us know what you've been reading this week!\n\nNote: unlike the Monday and Friday megathreads, this thread is *not* free-for-all. You are free to discuss books that you've read, articles you liked, and similar. But please save the personal updates for Mindless Monday! \n",
        "created_utc": 1508068260,
        "upvote_ratio": ""
    },
    {
        "title": "A ByzantineBasileus Review: War and Civilization – Episode One – First Blood, Part One",
        "author": "ByzantineBasileus",
        "url": "https://www.reddit.com/r/badhistory/comments/76hwma/a_byzantinebasileus_review_war_and_civilization/",
        "text": "Greetings Badhistoriers! I know that my submissions have been few and far between of late, so I thought it a good time for another review. The documentary is War and Civilization – Episode One – First Blood:\n\nhttps://www.youtube.com/watch?v=bHSz8gvG3XQ&amp;list=PLcMNaTUIX_mbA9nZ7H8T-tX2vDAQLNtcu\n\nWith me is my bottle of Woodford Reserve Kentucky Straight Bourbon Whiskey, so let us being!\n\n0.58: \"War and civilization. The story of Mankind cannot be divorced from the history of war.\" The alimony would be far too high.\n\n4.17: \"The history of empires is written in blood.\" This is absolutely false, as blood does not cling very well to clay tablets.\n\n4.30: Ah, here is the first reference to anyone living outside of a settled state as 'barbarians'. DRINK!\n\n5.07: \"And when one political creed faced off against another the world faced armageddon.\" I can understand how this could be so terrifying. It was a horrible movie.\n\n6.07: \"2500 years ago the ancient Greeks transformed war into what we know today.\" I don't know how a documentary can make such an erroneous statement. It was the Sumerians who were the first known civilization to develop organized warfare, and they did this by 2600 BC. The Battle-Standard of Ur shows infantry with standardized equipment fighting in close order formation. Early chariots are also displayed:\n\nhttps://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Standard_of_Ur_-_War.jpg/1200px-Standard_of_Ur_-_War.jpg\n\nSimilarly Sargon of Akkad, a Sumerian ruler, had a standing army of 5400 men. This would have required an large body of highly educated scribes to recruit, feed and outfit so many warriors. DRINK!\n\n6.22: John Keegan says that the Greeks would introduce a new Western style of warfare that was formal, decisive and deadly. Dammit, as a historian he should know better. Greek warfare was actually inferior to the Near-Eastern methods at first. Greek armies were a militia that were recruited for specific conflicts and then disbanded. Near-Eastern states, such as the Assyrians, had larger forces that could remain in the field for far longer, would conduct extensive sieges with mobile towers, and had a greater diversity of troops including light and heavy infantry, chariots, heavy cavalry and warfare. This can be seen from Assyrian artwork:\n\nhttps://i.pinimg.com/736x/a5/c5/db/a5c5db30393d4098350ec40ef18c6b72--ancient-mesopotamia-ancient-art.jpg\n\nhttps://i.pinimg.com/736x/e5/33/75/e53375208e8417a90a07fd27dc74cf84--son-of-god-ancient-mesopotamia.jpg\n\nhttp://l7.alamy.com/zooms/f3b179968f72425bbbc0ec3fc07b2290/assyrian-soldiers-in-battle-archers-protected-by-large-reed-mate-shields-bp28yy.jpg\n\nhttp://c8.alamy.com/comp/BP29A5/siege-tower-battering-ram-in-action-assyrian-army-destroying-the-walls-BP29A5.jpg\n\nDRINK!\n\n6.29: Why is this hoplite staring at me like a character on the cover of a bad romance novel?\n\n6.40: The narrator calls the Greek hoplite the first modern solider. The first modern soldier that was not paid, trained, provided with equipment by the state or actually employed *on a full-time basis*. DRINK!\n\n6.58: \"Hoplites invented a way of fighting that survives to this day\". Remember when the United States issued shields and spears to their soldiers instead of assault rifles for the invasion Afghanistan?\n\n7.04: Another reference to organized fighting being the 'Western' way of war. DRINK!\n\n7.15: The documentary keeps treating a Greek hoplite as if it were a unique unit. This is not Age of Empires. The Greek hoplite was just a form of heavy infantry, no different those utilized by the Assyrians:\n\nhttp://www.ishtartv.com/en/articles_images/articles_image120160229074953Ldjy.jpg\n\nOr the Persians:\n\nhttps://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Persepolis_The_Persian_Soldiers.jpg/1280px-Persepolis_The_Persian_Soldiers.jpg\n\nDRINK!\n\n13.10: Victor Davis Hanson says that the hoplite would be a poor fighter out of formation as the aspis would not protect his body well, and that his sword was very short. Christopher Matthew in his book, *A Storm of Spears*, points out that a hoplite would most likely fight in a side-on stance, and in doing so the aspis would cover his whole torso. Likewise, the xiphos sword had a blade up to 24 inches long:\n\nhttp://blindsquirrelprops.com/wp-content/uploads/2012/07/spartan_old_01.jpg \n\nThis was only few inches shorter than a Celtic sword, and so was not a small weapon at all. DRINK!\n\n17.00: The aspsis here are merely flat pieces of wood, as opposed to bowl-shaped shields covered in a thin layer of bronze. DRINK!\n\n21.10: \"The shipping lanes of the Aegean Sea are all that separate Greece from her worst enemy in the 5th Century BC\". Also the case in the 3rd Millennium AD\n\n23.40: And to depict the Battle of Marathon they have Greeks charging against.....Greeks.\n\n24.00: \"The assault was so brutal it carried the day\". It was more like the assault was so brutal the Athenian center was defeated and fled. The Greeks won Marathon because they drove off the Persian flanks, reordered their formation and then charged the Persian center in their flanks and rear. DRINK!\n\n25.05: The narrator says in the first clash between East and West, the Greek way of war triumphed. This is a gross simplification. The Greeks were facing a small Persian force fighting without cavalry support. And even so, the battle was fairly close. In no way does it point to a failure of the Persian tactical system itself. DRINK!\n\nAnd that is that. Stay tuned for part two!\n\n**Sources**\n\nThe Ancient Celts, by Barry Cunliffe\n\nThe Histories, Volume Two, by Herodotus: http://www.gutenberg.org/files/2456/2456-h/2456-h.htm\n\nA History of the Ancient Near East, by Marc Van de Meiroop\n\nShadows in the Desert – Ancient Persia at War, by Kaveh Farrokh\n\nA Storm of Spears, by Christopher Matthew\n\nWarfare in the Ancient Near East to 1600 BC, by William Hamblin\n",
        "created_utc": 1508056822,
        "upvote_ratio": ""
    },
    {
        "title": "The \"turning point\" in 1529",
        "author": "Chamboz",
        "url": "https://www.reddit.com/r/badhistory/comments/76h6vu/the_turning_point_in_1529/",
        "text": "Sorry guys, no big post today. Too much reading to do for that. Rather, I just wanted to note something that caught my eye on the front page of Wikipedia's \"on this day\" section:\n\n&gt; 1529 – The Siege of Vienna ended as the Austrians repelled the invading Turks, turning the tide against almost a century of conquest in Europe by the Ottoman Empire.\n\nThe 1529 siege was no turning point or end of Ottoman conquest, it was a simple defeat. The Ottomans' decisive move into Central Europe didn't even come until 1541, when they definitively conquered Buda and, through several additional campaigns, wrested most of Hungary from Habsburg hands. \"The tide\" of Ottoman expansion came to an end in the 1560s as it became clear that they weren't going to be able to easily conquer the entire Hungarian kingdom, with peace being signed in 1568. No exciting turning point, just a gradual winding-down of conflict. The second siege of Vienna in 1683, on the other hand, was indeed a major turning point, not so much because it prevented Ottoman expansion (taking Vienna would have been hard enough, how much further could they have possibly gone?) but because it created the circumstances which allowed the Ottomans to be pushed back out of Hungary.\n\nFurthermore, while I get where they're coming from with \"almost a century of conquest in Europe\", that's misleading too. Before the reign of Süleyman the Magnificent (r. 1520-66), the Ottomans had had nearly 40 years of peace in Europe, with the exception of war against Venice during the reign of Bayezid II and some campaigns in Moldavia of no particular significance. The Ottoman Empire in the decades prior to 1520 was not actively seeking to conquer large swaths of Europe.",
        "created_utc": 1508044583,
        "upvote_ratio": ""
    },
    {
        "title": "Holodomor cherry picking",
        "author": "spaghettiputs",
        "url": "https://www.reddit.com/r/badhistory/comments/76cvck/holodomor_cherry_picking/",
        "text": "[removed]",
        "created_utc": 1507996265,
        "upvote_ratio": ""
    },
    {
        "title": "\"Stalin paid the clouds not to rain!\" - On Holodomor Denial",
        "author": "mhl67",
        "url": "https://www.reddit.com/r/badhistory/comments/76beft/stalin_paid_the_clouds_not_to_rain_on_holodomor/",
        "text": "So there's the meme i've seen pushed by Stalinists lately, coming to the effect of \"Capitalists think Stalin paid the clouds not to rain!\" in regards to the Holodomor. As encapsulated by circlejerky threads [like this one](http://np.reddit.com/r/ShitLiberalsSay/comments/75wnje/why_was_there_not_a_nuremberg_for_communism/do9jye8/)\n\nThe claim is basically:\n\n1. There was a famine in Ukraine and other areas of the USSR, but it was the result of weather, and not man-made.\n\n2. The claim it was orchestrated deliberately was invented by the Nazis and popularized by them to justify a war with the USSR. This claim has been extended to including the concept of the Holodomor as a tenet of fascism.\n\nNow before I debunk these claims, I'd like to address a couple of other topics. Firstly, while it's agreed that the Holodomor is a democide, it's heavily debated that it was a genocide. Most scholars have adopted the position that it was not a genocide if genocide is defined at attempting to exterminate an ethnic group. While Ukrainians suffered disproportionately, Kazakhs and south Russians suffered as well, and there is little evidence that it was intended as \"punishment\" for Ukraine. Most scholars have adopted the view that it was a deliberate over-requisitioning of grain to export to fund industrialization, and attempts to circumvent the resultant food shortage in Ukraine led to harsher measures by Stalin which did aim to punish. The second debate is over the number of casualties. Many people try to cite that it was over 10 million killed, partly in order to deflect their own culpability in the holocaust and/or try to portray the USSR as worse. The consensus is around 4 million killed.\n\nIn regards to claim one, the only scholar who seriously holds this position is Mark Tauger. Who has been dismissed as completely wrong by every other scholar in the field. Put simply, there is no real evidence for the effect of weather on the harvest. While there were dry periods in 1932, it was nothing that abnormal. This is pretty evident from the fact that no where else in Eastern Europe was there a significant food shortage, despite them sharing the exact same climate. Areas of depopulation of 15-20% run right up to the Polish border at that time and then mysteriously stop. In fact, not even Tauger argues that rain was the cause - because Tauger argues that the famine was the result of plant diseases. Of course this falls prey to the same problem as the drought hypothesis, namely, why does the famine stop at the Polish border? \n\nIronically the only other explanations for an \"Accidental Holodomor\" would probably be even less acceptable to them, seeing as how they largely blame the chaotic and poorly planned collectivization of agriculture for their problems.\n\nIn any case, even assuming that there was a natural component, their explanation still doesn't prevent Stalin from being responsible. Since around 1800, there has been a high enough rate of agricultural production worldwide that any famine since then has effectively been man-made, even assuming an agricultural component. For example, these same people would almost certainly classify capitalist famines as genocide, even though they have mostly had a natural origin. Especially so since the USSR literally rejected outside aid. [By their logic, the British aren't responsible for the Great Irish Famine](https://en.wikipedia.org/wiki/Great_Famine_(Ireland)), because after all, the food supply was affected by potato blight. And [the Great Indian Famine](https://en.wikipedia.org/wiki/Great_Famine_of_1876%E2%80%9378) must've been completely fine because of the drought that struck that year, despite the resultant export of food away from drought stricken areas. By their logic, if the Holodomor had a natural cause, then Stalin can't be held responsible, and yet by the same logic they would acquit capitalist culpability in those famines because they had natural causes. Somehow I don't think they would be ok with that.\n\nAs well, there's the meme that the famine was caused by \"Kulaks deliberately not working and killing their own livestock\". In the first place, Kulak under Stalin just became a term for any farmer that the regime didn't like, it didn't have any real class element to it. In the second place, killing your livestock won't cause a shortage of food that dramatic, especially since the primary source of food was agriculture. Killing livestock only detracts from future sources of food via slaughtering livestock, not somehow decreasing the amount of food currently available (discounting marginal things like dairy products for example).\n\nIn regards to claim 2, the fact is that the Nazis weren't even in power until the end of the famine. Even then, the famine was already well reported thanks to journalists like [Malcolm Muggeridge](https://en.wikipedia.org/wiki/Malcolm_Muggeridge), who was a leftist at the time, and [Gareth Jones](https://en.wikipedia.org/wiki/Gareth_Jones_(journalist)). While there was some doubt at the time over what was happening, largely because of Soviet press censorship, it's obvious in hindsight that a famine was actually occurring. Which is a problem because Soviet denial at the time largely focused on denying that a famine was occurring, which makes the later claims that it had natural causes completely nonsensical. If that was the case, then why didn't they bother publicizing the drought or accepting humanitarian aid? Why instead did they outright deny that a famine was occurring at all? It's especially ironic that they throw around accusations of Nazi Propaganda, because the primary source for this claim is a book by Douglas Tottle, which was literally funded by the USSR in the 1980s, and published via their international publishing arm at Progress Publishers, and which was deteremined to have contained material that was not \"available to a private person without Soviet assistance.\" You can read the book [here](http://www.garethjones.org/tottlefraud.pdf), if for some reason you want to. But I'm sure the Stalinists account of their own history is completely trustworthy, as opposed to the consensus of literally every other third-party. As well, while it is used by fascist groups today, I think it's pretty telling that I can't really find a single example of Nazi propaganda referencing the Holodomor. It was probably used for that purpose but I think it's telling that if the Nazis allegedly invented the idea that the Holodomor was deliberate that it's not referenced anywhere on the subject; on wikipedia for example the Nazis are nowhere mentioned on the Holodomor page, and nowhere on the Nazi propaganda themes page, it's literally mentioned only on the \"Holodomor genocide question\" page. Googling it results only in the same conspiracy theories about how the Holodomor was manufactured by the Nazis. I literally cannot find a single example specifically talking about the Holodomor. \n\nLiterally the only evidence that I can find in Tottle's book is (1) some photographs published were from a previous famine, and (2) the Nazis invaded the USSR. From what I can tell any propaganda about the famine published by the Nazis would've been published after the invasion when they were trying to suppress Ukrainian dissent. Not that it stopped the Nazis from modeling their own [Hunger Plan](https://en.wikipedia.org/wiki/Hunger_Plan) on it. In any case, Tottle appears to be making the bizzare claim that William Randolph Hearst, Gareth Jones, and Joseph Goebbels all collaborated on using the Hearst press to promote Nazi propaganda. Such as the Holodomor apparently. Despite their being no evidence of any of this. And you know, the fact Gareth Jones' diaries on the famine have been studied, but apparently they were all faked too, despite no one knowing at the time that anyone would care about his diaries.\n\nAs well, there's the matter of the overwhelming evidence uncovered from the USSR's own archives, confirming that exports of grain continued from famine stricken regions. Whatever, totally reasonable because of drought or something. Alternately, the documents were personally faked by Nikita Kruschchev despite them not admitting the famine until the 1980s, just in order to make Stalin look bad.\n\n**Sources**\n\nBloodlands, Timothy Snyder\n\nComrades, Robert Service\n\nA History of Communism, Archie Brown\n\nThe Red Flag, David Priestland\n\nBlood and Soil, Ben Kiernan\n\nThe Russian Revolution, Shiela Fitzpatrick\n\nThe Russian Revolution, GA Smith\n\nThe Russian Civil War, Evan Mawdsley\n\nThe Soviet Century, Moshe Lewin\n\nBlack Earth, Timothy Snyder\n\nEurope, Norman Davies\n\nGod's Playground, Norman Davies\n\nDark Continent, Mark Mazower\n\nTo Hell and Back, Ian Kershaw\n\nThe Dark Side of Democracy, Michael Mann\n\nStalin, Stephen Kotkin\n\nStalin, Robert Service\n\nSocialism, Michael Harrington\n\nState Capitalism in Russia, Tony Cliff\n\nLenin, Lars Lih\n\nIntroduction to Marxism, Ernest Mandel\n\nThe Stalinist Century, ed. Tariq Ali\n\nWestern Marxism and the Soviet Union, Marcel van der Linden\n",
        "created_utc": 1507977373,
        "upvote_ratio": ""
    },
    {
        "title": "Nitpicking at material culture in \"Frontier\" - a bad case of 19th century hats in an 18th century setting.",
        "author": "NikKerk",
        "url": "https://www.reddit.com/r/badhistory/comments/768y9z/nitpicking_at_material_culture_in_frontier_a_bad/",
        "text": "First post here, and I'm afraid it may not be worthy of its own post but I missed yesterday's small bad history thread and I'm very impatient so whatever. \n\nWe don't expect historical drama shows to be highly accurate in what they choose to portray people wearing onscreen. But some choices make it so obvious that whoever was behind the costume design was clearly uninformed. Today I'll be talking about hats. \n\nFor those don't know what *Frontier* is about, the series aired its first season last year and is co-produced by Netflix and Discovery Channel Canada (the channel's first original scripted commission). The series follows Declan Harp (Jason Momoa), a part-Irish, part-Cree outlaw who is campaigning to crumble the Hudson's Bay Company's iron grip on the fur trade up in what is now Northern (very Northern, as in Fort James northern) Ontario in the late 1700s. I'm assuming it's set during the American Revolution, as the show's intro has [one of the little figurines](https://i.imgur.com/lGStdzY.png?1) holding the iconic flag of the Thirteen Colonies, dressed in a Continental coat. \n\nNow we know the Thirteen Colonies were a thing in the 1770s. But shakos and top hats weren't.\n\nIn the series' second episode, Harp and his friends infiltrate a property to rescue a member of the \"Lake Walker\" tribe, where there is house guarded at the front entrance by a pair redcoats. And not just any redcoats! [These guys!](https://i.imgur.com/lnF8kOR.png?1)\n\nHoly Shit. This was exasperating when I first saw this.\n\nNot only are they wearing [Belgic shakos](https://en.wikipedia.org/wiki/Shako#Variations) which I've seen in basically every good War of 1812 reenactment in my home province of Ontario, but they're fully decked out in 1812-esque clothing like the high-waisted trousers and jackets, and those cute little fluffy white cotton balls on their shoulders. I get that Napoleonic shakos were supposed to make infantrymen appear more intimidating and taller, and I understand that the producers were trying to get at that by making these guards dress like this, compared to the generic redcoats we see in the rest of the show, but they could have *at least* wore bearskin mitre caps and uniforms that British grenadiers wore during the American Revolution, [like this grenadier private of the 18th regiment of foot from 1776, for example](https://i.imgur.com/7mKYjny.jpg?1), which made a soldier look as equally taller and intimidating. If you search up [British grenadiers of the American Revolution](https://www.google.ca/search?biw=1366&amp;bih=637&amp;tbm=isch&amp;sa=1&amp;q=american+revolution+british+grenadier&amp;oq=american+revolution+british+grenadier&amp;gs_l=psy-ab.3..0i8i30k1.3634.7516.0.7798.13.10.1.0.0.0.267.1083.0j5j1.6.0....0...1.1.64.psy-ab..7.3.505...0i24k1.0.SvhVquzPKnY#imgrc=_) on google images, pretty much all of them are wearing bearskin mitre caps, which were pretty standard for Grenadier companies of the British army in the 1770s, particularly in North America. I understand that not everyone who watches the show has a basic grasp of early modern uniforms but for a basic historier like me those eighteen-twelvers look so out of place, and a pair of grenadiers guarding that door would have been much more believable.\n\nNow onto the top hats.\n\nIn episode 3, one of the protagonists, an Irish lad by the name of Michael Smyth teams up with an Anishinaabe woman to track down a lone Scotsman in the forest. While the Scotman rests, the two hide behind a rock for a while. Smyth tells Anishinaabe woman of an Irish woman he loves and has known for a long time, and he needs to find her before she falls into any serious danger. Smyth recalls the time they broke into a rich woman's house, where his girl put on a dress and was really happy to wear it. Smyth said he would be very happy if the two were to go back to London, where he imagines himself walking in a park with his girl in said dress, and himself [wearing a top hat](https://i.imgur.com/1YBeFSv.png?1), as according to Netflix subtitles.\n\nGodammit, second hat error in a row. \n\n[The first real depiction we have of someone wearing a top hat is in 1796](https://en.wikipedia.org/wiki/Top_hat#History), where Carle Vernet's painting showing two French guys greeting each other, with one appearing to be holding a top hat. Within 20 years top hats had become popular with all social classes, with even workmen wearing them. 19 century-esque top hats did not exist in the 1770s. \n\n*Frontier's* love for top hats will be strained even further in season 2 which airs this October as is seen in [this screenshot of Harp in a sticky situation](https://i.imgur.com/rXNThhF.png?1) from the Season 2 trailer.  \n\nThere you have it, I've finally had my steam to blow which I've finally let out. I know this isn't a proper in-depth analysis of early modern hats, as it is my first post on this sub, but it's late here and I'm tired and I skipped sinusoidal function homework for this and I wanna watch S1E6 of *Frontier* right now. Have a great weekend guys.\n\n\n**Other Sources**\n\n*An Illustrated History of Uniforms from 1775-1783: The American Revolutionary War*",
        "created_utc": 1507941152,
        "upvote_ratio": ""
    },
    {
        "title": "Free for All Friday!, 13 October 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/7649mi/free_for_all_friday_13_october_2017/",
        "text": "It's Friday everyone, and with that comes the newest latest Free for All Friday Thread! What books have you been reading? What is your favorite video game? See any movies? Start talking!\n\nHave any weekend plans? Found something interesting this week that you want to share? This is the thread to do it! This thread, like the Mindless Monday thread, is free-for-all. Just remember to np link all links to Reddit if you link to something from a different sub, lest we feed your comment to the AutoModerator. No violating R4!\n",
        "created_utc": 1507895460,
        "upvote_ratio": ""
    },
    {
        "title": "October Small BadHistory Thread",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/75wgr5/october_small_badhistory_thread/",
        "text": "This is a place to dump all the bad history you run across that isn't worth doing a whole post about. Rules for the small posts are slightly different:\n1.) Don't link directly to the post/comment itself\n2.) Please quote it though (or at least summarise it if it's a real life bad history moment)\n3.) As usual, no username call-outs unless you want to bring it to the attention of an expert on the topic so they can add their 2 nummi.\n",
        "created_utc": 1507809064,
        "upvote_ratio": ""
    },
    {
        "title": "Gavrilo Princip was part of the Black Hand organization",
        "author": "83h3M07",
        "url": "https://www.reddit.com/r/badhistory/comments/75s7p5/gavrilo_princip_was_part_of_the_black_hand/",
        "text": "[removed]",
        "created_utc": 1507756620,
        "upvote_ratio": ""
    },
    {
        "title": "Suggestion for 500th anniversary of Protestant reformation.",
        "author": "ForestOfCheem",
        "url": "https://www.reddit.com/r/badhistory/comments/75pb1c/suggestion_for_500th_anniversary_of_protestant/",
        "text": "October 31st marks the 500th anniversary of Luther publishing his [95 theses](http://www.gutenberg.org/ebooks/274) against the Catholic Church, which, as we know, created a massive schism in Christendom with wide reaching political and social consequences, both positive and negative.\n\nI would like to see a special thread dedicated to sharing bad history related to the reformation, Luther, the Catholic Church, Calvin, Zwingli, Henry VIII, etc.\n\nI guess this thread itself could serve that purpose, if people want to run with it.",
        "created_utc": 1507731100,
        "upvote_ratio": ""
    },
    {
        "title": "State of the Sub, 11 October 2017, Moratorium revisited",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/75oj7w/state_of_the_sub_11_october_2017_moratorium/",
        "text": "The moratorium was an old feature of BadHistory where for one month a specific topics were banned and could only be discussed in the weekly Free for All posts. At the end of the month a vote would be held to determine which topics people had seen enough of, and the top three would be on the moratorium for the next month. For an example of the results, [see here](https://www.reddit.com/r/badhistory/comments/1z9wps/meta_march_2014_moratorium_the_people_have/), for a look at the voting process, check [this post](https://www.reddit.com/r/badhistory/comments/3uq32h/december_moratorium_voting/).\n\nNow we've been without a moratorium for around a year by popular demand, but there have been some recent rumblings from the populus that indicate that we might want to have a discussion about this again. Unlike previously where certain topics were done to death (Jesus January will bring back some horrible memories for some), this time it seems to be more related to the source of the bad history. So feel free to talk about that option if you wish. That sort of requires us to turn off R2 for this post, but please don't go overboard. \n \nNote: unlike the Monday and Friday megathreads, this thread is *not* free-for-all. You are free to discuss history related topics. But please save the personal updates for Mindless Monday and Free for All Friday! Please remember to np link all links to Reddit if you link to something from a different sub, lest we feed your comment to the AutoModerator. And of course no violating R4! Also if you have any requests or suggestions for future Wednesday topics, please let us know via modmail. \n",
        "created_utc": 1507722676,
        "upvote_ratio": ""
    },
    {
        "title": "Secrets of the Dead - Escape from Auschwitz",
        "author": "mhl67",
        "url": "https://www.reddit.com/r/badhistory/comments/75jp5k/secrets_of_the_dead_escape_from_auschwitz/",
        "text": "Secrets of the Dead is a PBS show focusing on historical mysteries. Normally, it's pretty good. In fact, this episode is pretty good if you just focus on it providing an account of what happened in this specific incident, namely the [Vrba-Wetzler escape](https://en.wikipedia.org/wiki/Vrba%E2%80%93Wetzler_report). The problem is with a couple implications that the show pushes, and more or less directly states.\n\nProblem number one is that the show strongly implies that Vrba and Wetzler were the first and only people to escape from Auschwitz. In fact, people had been escaping from Auschwitz since at least 1942, for example when [Kazimierz Piechowski](https://en.wikipedia.org/wiki/Kazimierz_Piechowski) stole an SS staff car and simply drove out the main gate of the camp. Or more famously [Witold Pilecki](https://en.wikipedia.org/wiki/Witold_Pilecki) a Polish resistance fighter who deliberately was arrested so he could document the camp and then escape. In total at least 144 people successfully escape from Auschwitz. Vrba and Wetzler didn't escape until around six months before the camp was closed down.\n\nProblem number two is that it implies strongly that the outside world was totally unaware of Auschwitz until Vrba and Wetzler escaped. While it is true that the Vrba-Wetzler report was one of the most detailed thus far, the allies and most of occupied Europe was probably by then well aware of Auschwitz. As previously mentioned, Witold Pilecki had escaped the previous year specifically to deliver a report on conditions in Auschwitz, and his report was three times longer then the Vrba-Wetzler report. Jerzy Tabau wrote a shorter report at virtually the same time. In any case, by 1942 most of the allies were clearly aware that a campaign of mass murder was occurring in occupied Europe. [Jan Karski](https://en.wikipedia.org/wiki/Jan_Karski#Reporting_Nazi_atrocities_to_the_Western_Allies), an agent for the underground Polish government, famously traveled to the US to personally inform President Roosevelt about the atrocities. The UN [specifically commented on](https://en.wikipedia.org/wiki/Joint_Declaration_by_Members_of_the_United_Nations) the mass murder of Jews in Europe. SS Officer [Kurt Gerstein](https://en.wikipedia.org/wiki/Kurt_Gerstein#Reporting) warned the Swedes and the Vatican about what was going on. The allies may not have been aware of the scope of the killings but they certainly knew they were going on.  And of course in occupied Europe itself, it's estimated that at least half of all Germans knew about the ongoing mass murders. ",
        "created_utc": 1507665510,
        "upvote_ratio": ""
    },
    {
        "title": "House of Cards and Marius vs. Sulla.",
        "author": "joelomite11",
        "url": "https://www.reddit.com/r/badhistory/comments/75hun3/house_of_cards_and_marius_vs_sulla/",
        "text": "In season 4 episode 7 Frank Underwood relates the story of the rivalry between Marius and Sulla after receiving a phone call from his opponent. Frank says that Sulla who was about Frank's age (not sure how old Frank is but somewhere between 55 and 65) beheaded his greatest rival- 26 year old Marius in the forum. I can't possibly overstate how badly this butchers history. First of all Marius was 19 years older than Sulla and lived to age 70 or 71. I'm not going to recount the long and complicated history of their rivalry but it Marius died in his bed as consul of Rome while Sulla was exiled.\n\nEdit: estimated Frank's age for those unfamiliar with the show.",
        "created_utc": 1507649941,
        "upvote_ratio": ""
    },
    {
        "title": "/r/The_Donald commentator claim the \"Islamization of India\" was the \"bloodiest episode in human history\" while deflecting responsibility for the genocide of the native Americans to cows",
        "author": "jain16276",
        "url": "https://www.reddit.com/r/badhistory/comments/75g2v6/rthe_donald_commentator_claim_the_islamization_of/",
        "text": "/r/The_donald is at it again with tons of bad history relating to Columbus that is so low-hanging that I couldn't be bothered to pick it up but there was this comment so blatant with it's hypocrisy and disregard for history that there was no way to let it go unrefuted in the echo-chamber that is that sub-reddit.\n\n&gt;Key word \"CAUSED\" It was t like the Islamization of India by muslims, the bloodiest episode in human history, most of the deaths that the native suffered were due diseases from the cattle Europeans brought...it was like 80 million Indians being beheaded by rusty swords The problem with history textbooks is that they are too eurocentric, making western people look bad. When you read of what was happening in the world while the west was raising, you really feel proud for your ancestors and for belonging to the less asshole of the civilizations\n\nlink: https://np.reddit.com/r/The_Donald/comments/75a7z7/525_years_ago_christopher_columbus_completed_a/?st=j8llcjvd&amp;sh=671fe80a\n\nthere are several claims in this comment \n* the Islamization of India was an event\n\n* That the aforementioned event involved at least 80 million deaths and was the bloodiest event in human history\n\n* That the destruction of native Americans were caused by diseases brought by cattle rather than those from humans\n\nThese claims would be refuted in point by point manner\n\n&gt;Islamization of India\n\nI'm unsure what even they are referring to but a basic knowledge of global history would show that India is not even remotely majority Muslim even when the original border including Pakistan and Bangladesh are taken into account. The first major Muslim kingdom in India proper outside of the conquests by the ummayad dynasty was the Ghurid dynasty which was not noted for being especially brutal and would be hard-pressed to achieve a 80 million killed figure given that the world population was only around 400 million at the time. \nhttps://en.wikipedia.org/wiki/World_population_estimates#cite_note-The_World_at_Six_Billion.2C_1999-7\n\nThe Delhi Sultanate was the main Muslim successor kingdom and was noted for being relatively tolerant of Hindus, they also grew out of the collapse of the preceding kingdom so there origin was not especially brutal. There ending by the timurs might be what constitutes the Islamization of India but that was a Muslim vs Muslim war which would also be hard-pressed to achieve the 80% figure. The Mughal empire was a similar beast that was also noted to not be especial insistent in spreading Islam at the sword point \nhttps://en.wikipedia.org/wiki/Delhi_Sultanate\n\n&gt;80 million deaths\n\nThe 80 million death figure would have been ridiculous unfeasible to achieve as it would have constituted a full 20% of the world population at the earliest Islamic excursion and even if we accept that's the total figure of all Hindus killed by Muslim. It's smaller than the death toll from the black death which killed a 100 million people. Adding the death count of world-war 1 and 2 would also give a larger death count and could be done under a similar methodology used to achive the 80 million figure .\nhttps://en.wikipedia.org/wiki/Black_Death\n\n&gt; That the destruction of native Americans were caused by diseases brought by cattle rather than those from humans\n\nDisease has often been a useful way for Americans to deflect criticism of the treatment of native americans and it's impossible to gain accurate data on the death toll from illness compared to that from general state collapse. It's also hard to argue against the fact that European settler brought on by Columbus committed various atrocities such as the Tenochtitlan which killed at least a few million\nhttp://necrometrics.com/pre1700a.htm\n\nThe diseases most death is attributed to, small-pox is not spread by cattle but rather humans. It was not brought by cows uninetalnily but rather a human.",
        "created_utc": 1507630321,
        "upvote_ratio": ""
    },
    {
        "title": "r/Historyporn with some Lost Cause BadHistory.",
        "author": "Shaneosd1",
        "url": "https://www.reddit.com/r/badhistory/comments/75dq3h/rhistoryporn_with_some_lost_cause_badhistory/",
        "text": "[removed]",
        "created_utc": 1507598412,
        "upvote_ratio": ""
    },
    {
        "title": "Mindless Monday, 09 October 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/757ttw/mindless_monday_09_october_2017/",
        "text": "Happy (or sad) Monday guys!\n\nMindless Monday is generally for those instances of bad history that do not deserve their own post, and posting them here does not require an explanation for the bad history.  That being said, this thread is free-for-all, and you can discuss politics, your life events, whatever here. Just remember to np link all links to Reddit and don't violate R4, or we human mods will feed you to the AutoModerator.\n\nSo, with that said, how was your weekend, everyone?\n",
        "created_utc": 1507539065,
        "upvote_ratio": ""
    },
    {
        "title": "How accurate is this article that claims Simon De Beauvoir was a Nazi and pedophile?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/755v7y/how_accurate_is_this_article_that_claims_simon_de/",
        "text": "[removed]",
        "created_utc": 1507512445,
        "upvote_ratio": ""
    },
    {
        "title": "/r/LateStageCapitalism claims that the USSR had 0% unemployment and eliminated the long-cycles of famines in Eastern Europe",
        "author": "Hurt_cow",
        "url": "https://www.reddit.com/r/badhistory/comments/755udp/rlatestagecapitalism_claims_that_the_ussr_had_0/",
        "text": "fIn the Interest in balance perhaps It's time for me to criticize some bad-history on the opposite side of the political spectrum from /r/the_donald. This poster from /r/LateStageCapitalism provided the perfect target for this ideological balance. https://i.redd.it/2ez7c20aqmqz.jpg. The creators of that comic cited his sources in this comment:https://np.reddit.com/r/LateStageCapitalism/comments/752ius/but_socialism_doesnt_work/do2wvcm/\nThe first part of his comment has a bit of bad econ/history\n&gt;The \"continuous\" part should make sense – the USSR was a planned, non-market economy, so market crashes á la capitalism were pretty much impossible.\n\nThat its factually untrue as economic crashes are just as possible in a communist system as in a capitalist system as it can be caused by a misallocation of good by central planners just as easily as it can be caused by market forces. This most often manifested a shortage of goods and can be witnessed in the crash of the cuban economy following the collapse of the USSR\n\n&gt;0% unemployment\n\nThis is semi-true but misleading because being unemployed was a crime the in the USSR that would lead to imprisonment. Frictional unemployment still existed however despite the statists not being widely published due to it being an aforementioned crime but it sitll existed \nhttps://www.jstor.org/stable/1811163?seq=2#page_scan_tab_contents\n&gt;0% homlessness\n\nThis is immediately contradicted in the comment \n&gt;there were homeless people, but they often had genuine issues with mental health\n\nBut even people with a lack of mental issues could become homeless due to family or personal circumstances  as explained in this ask-historian comment \nhttps://np.reddit.com/r/AskHistorians/comments/4ljfhy/were_there_homeless_people_in_the_ussr/d3ofuqb/\n\n&gt;You can read more about the post-1941 famine history in Nove's An Economic History of the USSR 1917-1991. There were food insecurity issues, especially when Khrushchev et al. majorly fucked up with trade and resource dependence on the west, but no famines after the collectivisation of agriculture in the early 1930s (except for in the Siege of Leningrad).\n\nThis is the source for the claim that the USSR eliminated famines and it continues the pattern of half-truths from the other claims. First,  the holomodr occurs during the collectivization and that was a famine that killed millions of people so attempting to credit it with the prevention of famines is offensively wrong. Famines did decrease during the USSR but that was primarily because increased oil and resources extraction allow the USSR to buy food from capitalist countries rather than because of domestic production\nhttps://www.cia.gov/library/readingroom/docs/DOC_0000637798.pdf\n&gt;",
        "created_utc": 1507512171,
        "upvote_ratio": ""
    },
    {
        "title": "'The Crown' on Netflix reveals the real reason behind the Allies victory in the Second World War: time travel capable Lancaster bombers.",
        "author": "Colonel_Blimp",
        "url": "https://www.reddit.com/r/badhistory/comments/754xby/the_crown_on_netflix_reveals_the_real_reason/",
        "text": "Now, a lot of you might be thinking that the Second World War was won by the combined efforts of three superpowers, China and a host of other Allied and even some neutral nations using rapidly advancing technology that was cutting edge for its time, but mostly obsolete in the 21st century or at more greatly advanced now than it was then. Yet the obscenely upper-middle class British 'The Crown' (where stern glares and thoughtful gazes speak a thousand words) has hinted at what might be the *real* story of what happened in the war and how Britain in 1940 might have had a weapon that puts our current measly arsenal to shame.\n\nIn this shot from the early part of Episode 7 of the first series, [a flight of multiple Avro Lancaster's is passing over the camera view](https://i.imgur.com/ZO7lllx.png). Initially this stirred my patriotic loins, [making my heart flutter and my mind wander into the realm of fantasy](https://www.youtube.com/watch?v=qIu91jbnr80). Gravy was poured onto beef. The birds sang. Schoolchildren sang \"Land of Hope and Glory\". Every home nation won the Six Nations simultaneously. Jessica Ennis-Hill smiled like the girl next door. Andy Murray laughed for the first time. Botham completed his century at Headingley, Gazza didn't miss that sliding attempt, and no-one would speak to me on the train without being prompted. It was a glorious flurry of images, sights and sounds flooding through my mind that confirmed that yes, everything *will* be ok. \n\nThe shot progresses on for a few more seconds and we see the outline of the legendary aircraft from the rear as they [fly over Windsor Castle](https://i.imgur.com/rUHO0v8.png), two icons of British culture meeting at a historical crossroads. I shed a tear and thought of times gone by when everything was better, unless you were poor, foreign, a woman or had polio. Truly simpler times. Fairer times. But then something shook me. Unnerved me. Broke me down to my very core.\n\nThat date. 1940.\n\nWhat was the significance...1940. 1940!\n\nMy skin crawled at the thought of the grand history of this ~~skeptical~~ ~~sizzled~~ scissored isle being butchered by 'The Queen - The TV Adaption'. Momentarily I wondered if it is another aircraft, something similar, like the Handley Page Halifax? But alas, one can see that the tail fins match not the [Winne the Pooh ear-esque Halifax](https://i.pinimg.com/originals/8f/95/18/8f95181927081c3ea10aa00f238cc28b.jpg), but instead a second look shows the aircaft in the show have the [telltale Batman ear-esque fins of a Lancaster.](http://www.warplane.com/images/Aircraft/Lancaster55.jpg) \n\nIn fact it seems highly unlikely that a popular television show would make the effort to cleverly insert a slightly older but similar looking British aircraft, as such a reference would fly over the heads of all but the most bookish of viewers, who I'm sure would be too busy playing Risk and watching repeats of 'The World at War' on Yesterday to be bothering with Netflix. As the brutal logic came together in my mind, I was too aghast to even consider a pun about how Netflix had \"winged it\" when it came to historical accuracy. \n\nYou see, the Lancaster did not fly in groups like that in 1940 - in fact, it didn't fly at all. The Avro Lancaster flew for the first time on the **9th January 1941**, and didn't even look the same as it had a three finned layout. The first production Lancaster flew nine months later in October 1941, not to be properly introduced into service until early the next year.^1 \n\nThis scandalous betrayal of Britain's historical heritage astounded me. Spilling my tea as I went, I furiously power walked to my work room and made a beeline for my WHS Smith notebook. Fury clouded my vision but soon it cleared and I wrote up a draft of this report back to you, the fine users of /r/badhistory, on what must be the greatest outrage of modern television. With it I also drew up a formal letter to English Heritage, the Imperial War Museum at Duxford and obviously my MP. Such transgressions cannot be treated lightly. After all if we had treated Nazism with quite such a light touch, we'd be speaking and living under German right now, and not the fun kind of German that makes campy television and electronic music.\n\nUnless...we have it wrong.\n\nIs there something the history books didn't tell us? A secret that had to be protected from the ghastly apparatus of Soviet Communism through the Cold War and was then forgotten about, tucked away in some dusty corner to rot in the margins of history? Secret science of the darkest kind? Did our brave boys in bomber jackets with dogs that were in hindsight quite regrettably named not just transit the English Channel, but the boundaries of time itself? \n\nWhatever the real truth might be, I can only hope that the true form of this unique Lancaster variant will make Wehrmacht fantasists with Hugo Boss leathers in their wardrobe and a subscription to the Daily Stormer even more angry and confused about how they lost. \n\nReferences which would get me frowns from my Britain in the Second World War lecturer at university:\n\n1. https://en.wikipedia.org/wiki/Avro_Lancaster#Flight_testing",
        "created_utc": 1507502099,
        "upvote_ratio": ""
    },
    {
        "title": "\"Waco is the Biggest slaughter in American history\" claim /r/the_Donald except for all those with a greater death toll.",
        "author": "Hurt_cow",
        "url": "https://www.reddit.com/r/badhistory/comments/751s1x/waco_is_the_biggest_slaughter_in_american_history/",
        "text": "/r/The_Donald is at it again with this terrible image here that claims that Waco-texas was the biggest slaughter in American history\n https://i.redd.it/ac2vj9kl78qz.jpg\nA trivial google search reveals this isn't the case as the Wikipedia list of massacres lists several massacres with a greater death count such as the Lawrence massacre or the Fort Pillow where black Union soldiers were killed when attempting to surrender to the conference.\nhttps://en.wikipedia.org/wiki/List_of_massacres_in_the_United_States\n\nIf we assume the claim talks about modern history which we shall define as any post-1990 event. There are a score of events to choose from including any notable terrorist attack or bombing such as the Oklahoma city bombing \n\n\n\n",
        "created_utc": 1507470701,
        "upvote_ratio": ""
    },
    {
        "title": "Sunday Studies, 08 October 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/7519im/sunday_studies_08_october_2017/",
        "text": "Find a book you like? Read an intriguing article from JSTOR last week? Want to discuss and get recommendations for new books? This is the thread for it! Come one, come all, please let us know what you've been reading this week!\n\nNote: unlike the Monday and Friday megathreads, this thread is *not* free-for-all. You are free to discuss books that you've read, articles you liked, and similar. But please save the personal updates for Mindless Monday! \n",
        "created_utc": 1507463463,
        "upvote_ratio": ""
    },
    {
        "title": "How accurate is this article that claims Simon De Beauvoir was a Nazi and pedophile?(x-post with /r/askhistorians)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/74ssp7/how_accurate_is_this_article_that_claims_simon_de/",
        "text": "[removed]",
        "created_utc": 1507349432,
        "upvote_ratio": ""
    },
    {
        "title": "Free for All Friday!, 06 October 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/74n3nx/free_for_all_friday_06_october_2017/",
        "text": "It's Friday everyone, and with that comes the newest latest Free for All Friday Thread! What books have you been reading? What is your favorite video game? See any movies? Start talking!\n\nHave any weekend plans? Found something interesting this week that you want to share? This is the thread to do it! This thread, like the Mindless Monday thread, is free-for-all. Just remember to np link all links to Reddit if you link to something from a different sub, lest we feed your comment to the AutoModerator. No violating R4!\n",
        "created_utc": 1507290663,
        "upvote_ratio": ""
    },
    {
        "title": "Know Your Enemy - Japan (1945)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/74cdjh/know_your_enemy_japan_1945/",
        "text": "[removed]",
        "created_utc": 1507162648,
        "upvote_ratio": ""
    },
    {
        "title": "[Netflix Documentary] Know Your Enemy - Japan (1945)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/74cb2y/netflix_documentary_know_your_enemy_japan_1945/",
        "text": "[removed]",
        "created_utc": 1507162003,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone seen the The Patriot? I have questions for you. They aren't mine. pls help",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/badhistory/comments/749y3l/has_anyone_seen_the_the_patriot_i_have_questions/",
        "text": "[removed]",
        "created_utc": 1507140248,
        "upvote_ratio": ""
    },
    {
        "title": "Wondering Wednesday, 04 October 2017, Improbable History - things that happened against all odds",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/badhistory/comments/747mrh/wondering_wednesday_04_october_2017_improbable/",
        "text": "Sometimes events played out in history that just seem so improbable that you wouldn't believe it if there wasn't evidence for it. It could be a victory against overwhelming odds, the 13th in line actually ascending the throne, an unexpected and rare event or distaster that came out of nowhere and completely changed the situation, an escape or survival that shouldn't have happened in a normal world, or the total underdog rising up to become the dominant power. So what's your favourite \"against all odds\" story from history, and why?   \n \nNote: unlike the Monday and Friday megathreads, this thread is *not* free-for-all. You are free to discuss history related topics. But please save the personal updates for Mindless Monday and Free for All Friday! Please remember to np link all links to Reddit if you link to something from a different sub, lest we feed your comment to the AutoModerator. And of course no violating R4! Also if you have any requests or suggestions for future Wednesday topics, please let us know via modmail. \n",
        "created_utc": 1507117914,
        "upvote_ratio": ""
    }
]