[
    {
        "title": "Any software they can use to easily make a evolutionary tree?",
        "author": "Due-Bumblebee7805",
        "url": "https://www.reddit.com/r/biology/comments/103ku0i/any_software_they_can_use_to_easily_make_a/",
        "text": "I’m running a evolution simulator app right now, and I want to be able to make a evolutionary tree in order to keep up with ancestry. Any software out there that can easily allow me to do this?",
        "created_utc": 1672880162,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question",
        "author": "nogodallowed76",
        "url": "https://www.reddit.com/r/biology/comments/103kqvn/question/",
        "text": "Comments\n\n[View Poll](https://www.reddit.com/poll/103kqvn)",
        "created_utc": 1672879933,
        "upvote_ratio": 1.0
    },
    {
        "title": "Been seeing loads of these bugs at home, are they harmful?",
        "author": "igpay_atinlay371",
        "url": "https://www.reddit.com/gallery/103iupa",
        "text": "",
        "created_utc": 1672875190,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with different Theories Origin of Life",
        "author": "010902080307940605",
        "url": "https://www.reddit.com/r/biology/comments/103hei8/help_with_different_theories_origin_of_life/",
        "text": "I'm trying to have a clear understanding of the different scientific theories about the origin of life and I'm having trouble. \n\nI understand this is a complex topic and depends on what we consider life and at which point we want to start. However I would like to have a sort of conceptual map or a general scheme that integrates the different theories about the origins organic compounds and their transformation into more complex \"alive\" systems. \n\nSomething similar to the image but also integrating clay, ice, and other theories/processes. Since I \"understand\" the different kinds of thermal generation but I have no idea of their relation with other theories/phases of the process.\n\nAny help is appreciated since I'm pretty lost.\n\nThanks beforehand",
        "created_utc": 1672871793,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone with a Biology BS degree working in public health?",
        "author": "Essiechicka_129",
        "url": "https://www.reddit.com/r/biology/comments/103h4zw/anyone_with_a_biology_bs_degree_working_in_public/",
        "text": "I will be graduating in may and came across epidemiologist.hought it was interesting and was wondering if that is possible for a biology bs graduate becoming an epidemiologist. Thought you need a bs in public health?",
        "created_utc": 1672871199,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do we know evolution isn't just extincion?",
        "author": "PastDays_RBX",
        "url": "https://www.reddit.com/r/biology/comments/103g6w9/how_do_we_know_evolution_isnt_just_extincion/",
        "text": "This isn't a religous thing, nor me trying to prove or disprove evolution to be clear, I was watching a \"Biologist Answers\" video and wondered, I couldn't find anything on google so thought this would be the best place to ask.\n\nIt's hard to write as a question but i'll try.\n\nHow do we know that the fossils of the past aren't just creatures that went extinct rather than a creature that slowly evolved into something else?\n\nHow do we know for a fact that humans didn't infact live alongside dinosaurs?\n\nSay a higher being or simulator suddenly placed all life on Earth and pressed play, wouldn't the fossil results be identical?",
        "created_utc": 1672869040,
        "upvote_ratio": 1.0
    },
    {
        "title": "New grad (molecular biology) job prospects/questions",
        "author": "RaisinBran-7",
        "url": "https://www.reddit.com/r/biology/comments/103fcey/new_grad_molecular_biology_job_prospectsquestions/",
        "text": "This probably has been asked but I’ve searched so many reddit threads and haven’t seen it so…\n\n*Background—\n\n- Cell/Molecular Biology Grad in May 2023.\n- 5 months of undergraduate research (stem cells)\n- Small state school (california).\n- Looking for jobs in San Diego Area.\n\nIs it possible to get a Research Associate job out of grad? Some positions on linkedin i’ve seen say 0-3 years of experience. \n(These positions seem to average on the 50-60k/yr range is that accurate?)\n\nOr should i just search for positions as a Lab tech/assistant? \n(These positions i’ve seen are in the 21-24/hr range). \n\nAt the end of the day, I am really just wanting to use my degree and start in the 50k/yr area.",
        "created_utc": 1672867083,
        "upvote_ratio": 1.0
    },
    {
        "title": "Longevity Drug Candidate from Biophysical Therapeutics",
        "author": "MnMdiscord",
        "url": "https://youtu.be/N4GOh_tovCE",
        "text": "",
        "created_utc": 1672864961,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seems all men started as girls in the womb I’m a lesbian",
        "author": "Ancient_Shine7824",
        "url": "https://www.reddit.com/r/biology/comments/103ddkz/seems_all_men_started_as_girls_in_the_womb_im_a/",
        "text": "Haha I heard we all start as female zygotes in the womb so I’m technically a lesbian",
        "created_utc": 1672862518,
        "upvote_ratio": 1.0
    },
    {
        "title": "Epigenetics and stress experiment",
        "author": "Pr3cc",
        "url": "https://www.reddit.com/r/biology/comments/103dak6/epigenetics_and_stress_experiment/",
        "text": "Hey\n\nIm doing a quite big school project soon, and my subject is epigenetics and stress. I need to do an experiment linked to my subject, and I've thought about perhaps doing an experiment on mice or another animal (under safe circumstances ofc). I need some suggestions on which experiment I could do here, which has to do with epigenetics and how stress may affect our genes. I am able to contact scientists and make them do the experiment as well, so it isnt an unexperienced person (me) doing it. \n\nThank you.",
        "created_utc": 1672862345,
        "upvote_ratio": 0.5
    },
    {
        "title": "why do whenever I'm on the verge of falling asleep, my body itches?",
        "author": "yumekiochan",
        "url": "https://www.reddit.com/r/biology/comments/103ca15/why_do_whenever_im_on_the_verge_of_falling_asleep/",
        "text": "We don't have any bed bugs, nor do I have any skin problem. It also only happens just when I'm about to fall asleep and my body itches and wakes me up from the sleep. It's very annoying.",
        "created_utc": 1672859986,
        "upvote_ratio": 1.0
    },
    {
        "title": "quick question",
        "author": "whattheacutualfuck",
        "url": "https://www.reddit.com/r/biology/comments/103b3gg/quick_question/",
        "text": "I need some information on the Norway maple and it's invasive properties and uses thanks.",
        "created_utc": 1672857257,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who dis",
        "author": "Fersanz12",
        "url": "https://v.redd.it/212iv13614aa1",
        "text": "",
        "created_utc": 1672856477,
        "upvote_ratio": 1.0
    },
    {
        "title": "HLA-questions, would VERY MUCH appreciate some help!!",
        "author": "Miserable_Ad_3449",
        "url": "https://www.reddit.com/r/biology/comments/103a3hz/hlaquestions_would_very_much_appreciate_some_help/",
        "text": "Hi. I just got my HLA results back, and it’s empty under DRB345, DQA1, and DPA1. The results are written with the HLA types above and the alleles below. What does this mean? Do I just…. not have them? I’m confused. That’s my first question.\n\nAnd also, the report is labeled as (verbatim):\n[A or A*], [B or B*], [C or C*], [DR or DRB1], [DRB345], [DQ or DQB1], [DPB1], [DQA1], [DPA1]. Those are splayed in columns horizontally (a column per [ ]), and the two values are written vertically in that column (A first, then A* etc). I wanted to clarify because I’ve seen many different formats. If it’s important, after the numbers there’s a G. To give a real example: HLA-B* 35:08:01G. My next question is, what is the difference between A/B/C and A*/B*/C*? My last question is, what does G mean and what does it stand for? I can’t find a solid answer\n\nI’d really love some help as I’m super invested now. I didn’t even know what these numbers were until yesterday and, this may be my ADD talking, but I really can’t quit until I understand it. I’m borderline obsessed now because it’s so interesting",
        "created_utc": 1672854998,
        "upvote_ratio": 1.0
    },
    {
        "title": "What makes muscle fiber strong? How many times have muscle-like structures evolved separately and what is the strongest \"variant\" on Earth?",
        "author": "Horror_in_Vacuum",
        "url": "https://www.reddit.com/r/biology/comments/1038pey/what_makes_muscle_fiber_strong_how_many_times/",
        "text": "Honestly this is a really nerdy, specific and useless question, but I was rewatching Avatar before I go to watch Way of Water (no spoilers please) and I started wondering if it really would be possible for a Na'vi arrow to pierce reinforced glass, with the added mass of the projectile and increased Na'vi strength.  \n\n\nNa'vi mass is never talked about in the movies, but we know how high they are, and the acceleration of gravity in the surface of Pandora has also been provided in a lore book that explores the characteristics of Pandora and it's fauna. It's around 80% of Earth's. Using that information, the average mass of a person and the average mass of a human arrow, you could probably get a good idea of how much a Na'vi arrow would weigh. But I still have no idea of how to calculate the draw weight of the Na'vi bows, because I don't really know how strong a Na'vi would be.   \n\n\nI could try to estimate their mass, compare it to human mass and use the reason to estimate strength, but their strength probably wouldn't scale in the same way, because strength depends solely on muscle fiber strength and muscle fiber density. And besides, this question about muscle strength is very interesting to me, because it says a lot about how diverse alien life could be.   \n\n\nThanks in advance.",
        "created_utc": 1672851767,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to do if someone is in cardiac arrest | CNN",
        "author": "VCardBGone",
        "url": "https://www.cnn.com/2023/01/04/health/cardiac-arrest-what-to-do-cpr-aed-wellness-xpn/index.html",
        "text": "",
        "created_utc": 1672851346,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chromatography",
        "author": "itsmePeterpan",
        "url": "https://youtu.be/prvFBw-UPA0",
        "text": "",
        "created_utc": 1672851092,
        "upvote_ratio": 1.0
    },
    {
        "title": "What species is this monkey?",
        "author": "theobserverboy",
        "url": "https://www.reddit.com/gallery/103879a",
        "text": "Unfortunately it was done with this monkey. What is his species?",
        "created_utc": 1672850591,
        "upvote_ratio": 1.0
    },
    {
        "title": "Perseverant bacteria challenge antibacterial treatment",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-perseverant-bacteria-antibacterial-treatment.html",
        "text": "",
        "created_utc": 1672850100,
        "upvote_ratio": 1.0
    },
    {
        "title": "'Jumping genes' help fungus kill salamanders",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-genes-fungus-salamanders.html",
        "text": "",
        "created_utc": 1672849989,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bioenergetics of rapid pollen tube growth",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-bioenergetics-rapid-pollen-tube-growth.html",
        "text": "",
        "created_utc": 1672849769,
        "upvote_ratio": 1.0
    },
    {
        "title": "New insights into a fundamental process in mitochondria",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-insights-fundamental-mitochondria.html",
        "text": "",
        "created_utc": 1672849738,
        "upvote_ratio": 1.0
    },
    {
        "title": "Putting the bones of giant, extinct 'thunderbirds' under the microscope reveals how they grew",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-bones-giant-extinct-thunderbirds-microscope.html",
        "text": "",
        "created_utc": 1672849625,
        "upvote_ratio": 1.0
    },
    {
        "title": "How microplastics are infiltrating the food you eat",
        "author": "VCardBGone",
        "url": "https://www.bbc.com/future/article/20230103-how-plastic-is-getting-into-our-food",
        "text": "",
        "created_utc": 1672849066,
        "upvote_ratio": 1.0
    },
    {
        "title": "Eelgrass: the endangered marine plant vital to keeping climate stable | Marine life",
        "author": "VCardBGone",
        "url": "https://www.theguardian.com/environment/2023/jan/04/eelgrass-endangered-marine-plant-vital-keeping-climate-stable",
        "text": "",
        "created_utc": 1672848858,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yeah...😂 Is there anyone who hasn't experienced this..?😅😅😅",
        "author": "Able-Passenger-8528",
        "url": "https://i.redd.it/s80ypf5d83aa1.jpg",
        "text": "",
        "created_utc": 1672846787,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does auxin affects roots and shoots differently?",
        "author": "LordButtertonBrave",
        "url": "https://www.reddit.com/r/biology/comments/1036gqd/why_does_auxin_affects_roots_and_shoots/",
        "text": "",
        "created_utc": 1672846404,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think studying medicine is amazing..From my point of view as long as you are passionate and there is a strong desire you can achieve anything. P.S: this picture was taken during my first anatomy meditation class😊😇",
        "author": "Able-Passenger-8528",
        "url": "https://i.redd.it/fskbj2sx33aa1.png",
        "text": "",
        "created_utc": 1672845304,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ribosome profiling bias",
        "author": "thunderflow11",
        "url": "https://www.reddit.com/r/biology/comments/1035plo/ribosome_profiling_bias/",
        "text": "Does ribosome profiling have an N-terminal bias? When footprints are mapped back onto the protein, I would imagine that as the ribosome runs into the 3'UTR it becomes difficult to map the very end (~30nt or ~10aa) of the protein. I haven't found any literature on this. Is anyone aware of a paper that discusses such biases?",
        "created_utc": 1672844505,
        "upvote_ratio": 1.0
    },
    {
        "title": "Researchers discover new cellular component with importance for the sense of smell",
        "author": "bikashkuta",
        "url": "https://www.news-medical.net/news/20230104/Researchers-discover-new-cellular-component-with-importance-for-the-sense-of-smell.aspx",
        "text": "",
        "created_utc": 1672839284,
        "upvote_ratio": 1.0
    },
    {
        "title": "Brain (cerebral) Aneurysm: Types, symptoms, and surgical repair",
        "author": "psycuriosity",
        "url": "https://youtube.com/watch?v=xtyZOpYG4DQ&amp;feature=share",
        "text": "",
        "created_utc": 1672838249,
        "upvote_ratio": 1.0
    },
    {
        "title": "Maximal possible size of insects in correlation to oxygen levels",
        "author": "Ryselle",
        "url": "https://www.reddit.com/r/biology/comments/10336km/maximal_possible_size_of_insects_in_correlation/",
        "text": "Hi,\n\nsince my biology class in school (nearly 20 years ago) I am fascinated by the idea of insects growing in correlation to athmospherical oxygen levels. \n\n\"Triggered\" by a questionable YouTube \"Documentary\" ([https://youtu.be/XYh1WciKjc0?t=312](https://youtu.be/XYh1WciKjc0?t=312)) - to my excuse, I watched it as background noise - I now have the urge to calculate the \"maximum insect size\" myself (Because I don't think \"Tank sized beelte\" is even possible with maxium o2 levels). For Arguments sake, lets imagine a hole planet with extrem conditions like 70% oxygen. \n\nFirst question would be if anyone has a paper that is more actual then \"RYOKO OKAJIMA (2008). The controlling factors limiting maximum body size of insects. , 41(4), 423–430. doi:10.1111/j.1502-3931.2008.00094.x\" on this topic.\n\nSecond question, before I do the excel-magic myself, is there anyone out there who has already come up with a scientifically based calculator? I struggle a bit in knowing some of the values the above mentioned authors use as variables (like values for a cross-sectional area of a tracheal system).\n\nLast but not least: Perhaps someone has an answer to this problem already.\n\nThank you in advance!",
        "created_utc": 1672837330,
        "upvote_ratio": 1.0
    },
    {
        "title": "Peace Lily (Spathiphyllum wallisii) polen: Darkfield, Oblique Illumination and Brightfield.",
        "author": "drsynthesis",
        "url": "https://youtu.be/1a3615Al-Xs",
        "text": "",
        "created_utc": 1672836979,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I supposed to know how to get the cells seeded just after one time watching someone passaging the cells",
        "author": "greendog3112",
        "url": "https://www.reddit.com/r/biology/comments/1031zy4/am_i_supposed_to_know_how_to_get_the_cells_seeded/",
        "text": "I'm a new lab tech in an academic lab. My PI showed me how to passage cells once and yesterday she asked me if I could get the cells seeded by myself. Her email sounds like she was assuming I should have already seeded the cells by myself when I have time after watching her doing the passage. \n\nI told her I am not sure how to do it and ask if she could show me how to seed the cells tomorrow. My reasons of not doing seeding by myself include not knowing the volume of the cell stock I need to take and not knowing how to tell if cells are dead or alive under the microscope. \n\nAm I too dumb to not to be able to seed cells by myself? If you were me, would you do it without asking for her help?",
        "created_utc": 1672833819,
        "upvote_ratio": 1.0
    },
    {
        "title": "BA Biology Degree",
        "author": "Huge_Environment8615",
        "url": "https://www.reddit.com/r/biology/comments/1031gk7/ba_biology_degree/",
        "text": "People with a BA degree in biology, what jobs have you had/do you have? How much did/do you make? I live in CA and trying to get some different ideas of jobs I could get with that degree. \n\nI think forensic dna sequencing seems interesting. So does research related to gut and or vaginal health. \n\nI know there are a lot more options with a masters degree, or higher education, but I’m only asking about careers with just a bachelor degree. \n\nThanks!",
        "created_utc": 1672832127,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Campbell Biology a good book for a beginner to get an overview of biology?",
        "author": "Additional_Battle_36",
        "url": "https://www.reddit.com/r/biology/comments/1031ct2/is_campbell_biology_a_good_book_for_a_beginner_to/",
        "text": "I have an CS degree, so took Chem 1 &amp; 2, Physics 1 &amp; 2 but never took any biology past high school sophomore year.  \n\n\nI want to get an overview of the the different topics in biology (specifically cells, evolution, genomics, etc). Learn some terminologies, so I can google questions better. \n \n\nWould this be a good book to slow read as a hobby? \n\n\nAlso what would I miss out on getting an older edition? The 9th edition seems to be much cheaper than the 11th. This is just for self learning.",
        "created_utc": 1672831795,
        "upvote_ratio": 1.0
    },
    {
        "title": "BSV",
        "author": "Evan_Carlos",
        "url": "https://www.reddit.com/r/biology/comments/10318cn/bsv/",
        "text": " &lt;!--td {border: 1px solid #cccccc;}br {mso-data-placement:same-cell;}--&gt;BSV has drawn criticism from some members of the cryptocurrency community who contend that its larger block size and association with Craig Wright make it less decentralized and out of step with the original goals of Bitcoin.",
        "created_utc": 1672831373,
        "upvote_ratio": 1.0
    },
    {
        "title": "oral apparatus",
        "author": "N4ch0sz",
        "url": "https://i.redd.it/wx738i9wt1aa1.jpg",
        "text": "",
        "created_utc": 1672829828,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the hardest exam question you’ve ever encountered",
        "author": "obammala",
        "url": "https://www.reddit.com/r/biology/comments/1030360/what_is_the_hardest_exam_question_youve_ever/",
        "text": "",
        "created_utc": 1672827663,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is more likely",
        "author": "nogodallowed76",
        "url": "https://www.reddit.com/r/biology/comments/102z5xf/what_is_more_likely/",
        "text": "There’s this girl I know who Redditors guessed to be 1/4 white when pics were posted, 3/4 black. Her youngest sibling looks fully black/monoracial, and her other brother who I think is a bit younger mainly looks black to me as well (someone who has more of an eye for it may suggest a bit of admixture, but he pretty much looks black.) The girl is not conventionally attractive, but has blue eyes. I remember she seemed to mainly associate w black people and her only boyfriend was black even though she went to middle and high school in a non-black city. She had an adoptive mom by late middle school/was placed in foster care, but seemingly wasn’t taken away from her mom before then even though her mom was v abusive\n\n[View Poll](https://www.reddit.com/poll/102z5xf)",
        "created_utc": 1672824443,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Hidden Markov Modeling Approach for Estimating Orientations and Structures of Biomolecules from High-Speed Atomic Force Microscopy Time-Series Images",
        "author": "cbirt_",
        "url": "https://cbirt.net/a-hidden-markov-modeling-approach-for-estimating-orientations-and-structures-of-biomolecules-from-high-speed-atomic-force-microscopy-time-series-images/",
        "text": "",
        "created_utc": 1672823162,
        "upvote_ratio": 1.0
    },
    {
        "title": "Natural Male-Female Ratio",
        "author": "ahmadshazeb",
        "url": "https://www.reddit.com/r/biology/comments/102ypgf/natural_malefemale_ratio/",
        "text": "How does human male to female sex ratio remains close to 1:1 over any significant human sample size? It really baffles me as to how humans as a species get to such 50-50 male female arrangement of population, when genetics is individual centric.",
        "created_utc": 1672822763,
        "upvote_ratio": 1.0
    },
    {
        "title": "Medical explanations",
        "author": "Lithiriana",
        "url": "https://www.reddit.com/r/biology/comments/102y7r6/medical_explanations/",
        "text": "Hello! I’m studying biotechnology, and thus I’m interested in understanding medicine. I’ve been trying to understand a thing my grandma was told, but can’t. \n\nMy grandma has been feeling very dizzy and lost some hearing, and went to see a stroke specialist. They did lots of testing, but found nothing wrong. \n\nThe doctors explained that she lost all of her “buffer” when she had a stroke 20 years ago. She was almost fully recovered then, but now her body can’t compensate anymore. So she will not get better, and aging will continue to make her worse. \n\nWhat buffer is he talking about?",
        "created_utc": 1672820864,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reef fish must relearn the 'rules of engagement' after coral bleaching",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-reef-fish-relearn-engagement-coral.html",
        "text": "",
        "created_utc": 1672820761,
        "upvote_ratio": 1.0
    },
    {
        "title": "Simple nasal swab can provide early warning of stealthy viruses: Lancet study",
        "author": "VCardBGone",
        "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/simple-nasal-swab-can-provide-early-warning-of-stealthy-viruses-lancet-study/articleshow/96731674.cms",
        "text": "",
        "created_utc": 1672819655,
        "upvote_ratio": 1.0
    },
    {
        "title": "Speculative Biology and Deep Sea Gigantism",
        "author": "LacelessShoes213",
        "url": "https://www.reddit.com/r/biology/comments/102xixt/speculative_biology_and_deep_sea_gigantism/",
        "text": "The whole concept of megafauna really interests me. With most if not all terrestrial modern megafauna having been discovered and documented, that really only leaves the ocean. Does anyone have any info, articles or studies based around potential megafauna in the earths oceans? If there’s also some for terrestrial animals that would be appreciated too.",
        "created_utc": 1672818319,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coronavirus Symptoms: An 'early' COVID symptom may occur in your legs and shoulders",
        "author": "VCardBGone",
        "url": "https://timesofindia.indiatimes.com/Coronavirus-An-early-COVID-symptom-may-occur-in-your-legs-and-shoulders/photostory/96702511.cms?picid=96702537",
        "text": "",
        "created_utc": 1672816527,
        "upvote_ratio": 1.0
    },
    {
        "title": "rate my abstract!",
        "author": "HeyoGuys",
        "url": "https://i.redd.it/rk0ky1pch0aa1.jpg",
        "text": "",
        "created_utc": 1672813490,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about biology class",
        "author": "burntsiena77",
        "url": "https://www.reddit.com/r/biology/comments/102w0hx/question_about_biology_class/",
        "text": "Hi, I go to a state college and need to take a year of biology for the med school prerequisite.  at my state school they have 2 biology classes that were recommended for me to take.  BIO 120A is called Principles of Cell and Molecular Biology and BIO120B is called Principles of Organismal Biology.  At my state school BIO 120A is a prereq to BIO 120B.\n\nI was looking into taking these at my community college (it is a lot closer to where I live) while still being full time at my state college.\n\nI asked my advisor which classes were equivalent to BIO 120A and BIO 120B at my community college.  He said 2 classes were.  The first class at the CC is called the same as the one at my state school and the second one is called Principles of Organismal Biology, Evolution, and Ecology.  \n\nI want to take both at my CC since it is closer to where I live.  The only thing is the course times that are offered for the cell and molecular biology class doesn't fit with my other classes times.  The only one that works with my schedule is Principles of Organismal Biology, Evolution, and Ecology.  At my CC the cell and molecular bio class is not a prereq to the principles of Organismal Biology, Evolution, and Ecology, it is only listed as \"advisory\".  \n\nWould it be ok to take the Principles of Organismal Biology, Evolution, and Ecology bio class before Principles of Cell and Molecular Biology? BTW I want to have the best grade possible in the class so I don't want to make a choice that would jeopardize my GPA.",
        "created_utc": 1672813124,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help identifying these teeth. Bottle cap for size reference.",
        "author": "wndrlnds",
        "url": "https://www.reddit.com/gallery/102vg2j",
        "text": "",
        "created_utc": 1672811309,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blacknose Shark (Carcharhinus acronotus) - Sharks Of The Order Carcharhiniformes",
        "author": "SkepticSalamander",
        "url": "https://www.youtube.com/watch?v=aIVH-tMbeHQ",
        "text": "",
        "created_utc": 1672810708,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does crying flush out viral particles?",
        "author": "Mesapholis",
        "url": "https://www.reddit.com/r/biology/comments/102ubnh/does_crying_flush_out_viral_particles/",
        "text": "I'm just recovering from a cold, viral infection, so naturally it just had to pass. While I was getting better, I made the fantastic discovery of how you can actually catch a cold in your eyes.\nSame infection, just slight secretion from the tearducts now.\n\nAs the infection previously, this too, just has to pass - I'm not asking for medical advice.\n\nWhat I'm interested in knowing is, does crying help your body flush out an infection as i.e. drinking enough water and peeing helps move a UTI along?\n\nJust wanting to know if sitting on the bathroom floor and sobbing is at least somewhat helpful. I'm just a bit down because I was sick for new years and now this.",
        "created_utc": 1672807856,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are some animals dicks?",
        "author": "deviantmoth",
        "url": "https://www.reddit.com/r/biology/comments/102sywj/why_are_some_animals_dicks/",
        "text": "Does science have an answer to why animals choose to torture other animals out of boredom? Like why do orca take turns smacking a shark or sting ray with their tail then just leave it to sink when it dies? Why do dolphins play volleyball with shark pups? Why do cats kill animals for sport? But not just kill them, play with the animal for 10-15 minutes until it dies from lacerations. Why do ducks use sexual violence so violent to the point it can kill their mate? Why do dolphins use eels as literal fleshlights?\n\nAn orca has no reason to abuse sharks or rays. They are apex predators with nothing seeing them as food. The only danger to a full grown orca is another orca or humans. The only explanation is like humans a lot of other intelligent species can simply be a dick just because. But why causes them to be a dick?",
        "created_utc": 1672803877,
        "upvote_ratio": 1.0
    },
    {
        "title": "Peace Lily (Spathiphyllum wallisii) polen: Darkfield, Oblique Illumination and Brightfield",
        "author": "drsynthesis",
        "url": "https://www.youtube.com/watch?v=1a3615Al-Xs",
        "text": "",
        "created_utc": 1672803501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can We Clone Anything?",
        "author": "chriswhoppers",
        "url": "https://www.reddit.com/r/biology/comments/102stys/can_we_clone_anything/",
        "text": "Can we clone anything at this point? Any animal, plant, fungi, or otherwise species? Whats the point in killing anything if we can just grab some dna, clone the best specimen of a species for a function, then have it reproduce for farming and production?  Genetic modifications, how far along are they?",
        "created_utc": 1672803473,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible that my cat's first heat is giving me hot flashes?",
        "author": "InIBaraJi",
        "url": "https://www.reddit.com/r/biology/comments/102qvjb/is_it_possible_that_my_cats_first_heat_is_giving/",
        "text": "Mind you, I'm 68 years old and human, and haven't had a hot flash in 15 years.",
        "created_utc": 1672798069,
        "upvote_ratio": 1.0
    },
    {
        "title": "Biology MCQ's for NEET 2023 || Human Reproduction || by Shiksha House",
        "author": "Zestyclose-Shirt-981",
        "url": "https://youtube.com/watch?v=syVFBPyMmuA&amp;feature=share",
        "text": "",
        "created_utc": 1672797245,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do limes exist if they don’t have seeds? Why would the tree waste its energy to produce the fruit?",
        "author": "xTvni",
        "url": "https://www.reddit.com/r/biology/comments/102q78h/why_do_limes_exist_if_they_dont_have_seeds_why/",
        "text": "",
        "created_utc": 1672796249,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just bought a cow pelvis for an art piece and was wondering if there’s a way to distinguish if it came from a female or male cow? It hasn’t arrived yet so this is the only pic I have.",
        "author": "emberaelle",
        "url": "https://i.redd.it/1v2ntzpavy9a1.jpg",
        "text": "",
        "created_utc": 1672793964,
        "upvote_ratio": 1.0
    },
    {
        "title": "little experiment I'm doing tonight.",
        "author": "jayboss101",
        "url": "https://i.redd.it/7ohb3jbgny9a1.jpg",
        "text": "",
        "created_utc": 1672791333,
        "upvote_ratio": 1.0
    },
    {
        "title": "Digital microscope to buy?",
        "author": "WarrenSnapper",
        "url": "https://www.reddit.com/r/biology/comments/102nqbi/digital_microscope_to_buy/",
        "text": "Hey y'all! I need some advice/suggestions on any digital microscopes to buy.  It needs to have an incorporated camera to be able to take pictures (2-3 megapixel), be compatible with windows 7 and up, can identify objectionable organisms, and has 40x 100x and 400x magnification minimum.  \n\nAny good suggestions?",
        "created_utc": 1672789949,
        "upvote_ratio": 1.0
    },
    {
        "title": "I know this is silly here, but I’m wondering if any of you guys will know. In Pokémon Violet/Scarlet does Sada and Turo suppose to be Biologist of some sort?",
        "author": "ChristineEliza",
        "url": "https://www.reddit.com/r/biology/comments/102m8jk/i_know_this_is_silly_here_but_im_wondering_if_any/",
        "text": "",
        "created_utc": 1672786377,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question for the biologists",
        "author": "TailorObvious7958",
        "url": "https://www.reddit.com/r/biology/comments/102lgk3/question_for_the_biologists/",
        "text": "Hi everybody, I’m a vet student in Belgium and I’ve run in a tiny problem. I was just wondering what’s the difference between glycocalyx and glycoaminoglycans ? I don’t know if it’s the same spelling in English, I hope so. I’m just confused cause it doesn’t say on my plan if it’s the same or two actual different molecules\nThanks a lot !",
        "created_utc": 1672784567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help coming up with global warming topics for my independent research paper",
        "author": "Essiechicka_129",
        "url": "https://www.reddit.com/r/biology/comments/102kpr2/need_help_coming_up_with_global_warming_topics/",
        "text": "I'm taking a senior independent research paper this semester since it's my last semester. It has to be related to global warming and has to be scientific since I will present it to a sophomore science class. Any interesting global warming topics?",
        "created_utc": 1672782912,
        "upvote_ratio": 1.0
    },
    {
        "title": "My mom and my aunt are identical twins. Is my aunt biologically and genetically same as my mother?",
        "author": "Dazzling-Ad6771",
        "url": "https://www.reddit.com/r/biology/comments/102kozl/my_mom_and_my_aunt_are_identical_twins_is_my_aunt/",
        "text": "",
        "created_utc": 1672782868,
        "upvote_ratio": 1.0
    },
    {
        "title": "how many Oxycodone can an Ox take?",
        "author": "storytimecrop",
        "url": "https://www.reddit.com/r/biology/comments/102kg3k/how_many_oxycodone_can_an_ox_take/",
        "text": "",
        "created_utc": 1672782307,
        "upvote_ratio": 1.0
    },
    {
        "title": "Euglenoids",
        "author": "drsynthesis",
        "url": "https://www.youtube.com/watch?v=vZ_z82uUjnM",
        "text": "",
        "created_utc": 1672781856,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did I grow? Taken from a pond",
        "author": "Daisy-Bea",
        "url": "https://www.reddit.com/gallery/102jf0v",
        "text": "",
        "created_utc": 1672779942,
        "upvote_ratio": 1.0
    },
    {
        "title": "A squad of Orbicular Batfish",
        "author": "princess-jinx",
        "url": "https://www.reddit.com/gallery/102iy3f",
        "text": "",
        "created_utc": 1672778867,
        "upvote_ratio": 1.0
    },
    {
        "title": "Primer extension",
        "author": "pitahaya11",
        "url": "https://www.reddit.com/r/biology/comments/102imcs/primer_extension/",
        "text": "Hello! I'm trying to understand the mechanism of primer extension. I get that we use a labelled primer which is complementary to a region near the 3' end of the mRNA of interest then reverse transcription. But how after doing an electrophoretic gel, is it possible to determine the transcriptional start site compared to a control with no reverse transcriptase? \n\nThank you in advance!",
        "created_utc": 1672778081,
        "upvote_ratio": 1.0
    },
    {
        "title": "how fast can an armadillo go on a freeway? if he used his body as a wheel to roll around?",
        "author": "storytimecrop",
        "url": "https://www.reddit.com/r/biology/comments/102ilez/how_fast_can_an_armadillo_go_on_a_freeway_if_he/",
        "text": "",
        "created_utc": 1672778018,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone identify this? It was found in southern Macedonia.",
        "author": "Bokizz11",
        "url": "https://i.redd.it/42t97ue7fx9a1.jpg",
        "text": "",
        "created_utc": 1672776447,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many push up can a gorilla do?",
        "author": "storytimecrop",
        "url": "https://www.reddit.com/r/biology/comments/102heq2/how_many_push_up_can_a_gorilla_do/",
        "text": "",
        "created_utc": 1672775180,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this lichen or what is it?",
        "author": "Escapist_anthopleura",
        "url": "https://i.redd.it/s78xjs6e9x9a1.jpg",
        "text": "",
        "created_utc": 1672774507,
        "upvote_ratio": 1.0
    },
    {
        "title": "Little protist",
        "author": "drsynthesis",
        "url": "https://www.youtube.com/watch?v=9Taa0i_vu-s",
        "text": "",
        "created_utc": 1672772122,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a technology that allows us to communicate with animals (aquatic and/or terrestrial)",
        "author": "Steelo7467",
        "url": "https://www.reddit.com/r/biology/comments/102fv6e/is_there_a_technology_that_allows_us_to/",
        "text": "Isn’t it weird that we wonder about getting in contact with aliens when we can’t even communicate with animals. Organisms from the same planet. \n\nWe all heard about different chimps and orangutans using sign language or keyboard. But could we actually develop a technology that would allow us to understand and translate different animal languages and even answer back. \n\nWouldn’t it be cool? It could also help us understand them way more… possibilities are just endless.\n\nIs there something?",
        "created_utc": 1672771532,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the impact of COVID-19 on the human genetic architecture?",
        "author": "VCardBGone",
        "url": "https://www.news-medical.net/news/20230103/What-is-the-impact-of-COVID-19-on-the-human-genetic-architecture.aspx",
        "text": "",
        "created_utc": 1672769906,
        "upvote_ratio": 1.0
    },
    {
        "title": "Breakthrough in plant breeding: Grafting and mobile CRISPR for genome editing in plants",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-breakthrough-grafting-mobile-crispr-genome.html",
        "text": "",
        "created_utc": 1672769563,
        "upvote_ratio": 1.0
    },
    {
        "title": "Most species evolve by adapting to similar, large-scale environmental pressures, study finds",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-species-evolve-similar-large-scale-environmental.html",
        "text": "",
        "created_utc": 1672769524,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bizarre cretaceous bird from China shows evolutionarily decoupled skull and body",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-bizarre-cretaceous-bird-china-evolutionarily.html",
        "text": "",
        "created_utc": 1672769486,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do tidal marshes store carbon?",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-tidal-marshes-carbon.html",
        "text": "",
        "created_utc": 1672769448,
        "upvote_ratio": 1.0
    },
    {
        "title": "Light, conspecific density and soil fungi have different effects on seedling growth of temperate tree species",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-conspecific-density-soil-fungi-effects.html",
        "text": "",
        "created_utc": 1672769322,
        "upvote_ratio": 1.0
    },
    {
        "title": "DNA in the water shows South African scientists where to find a rare pipefish",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-dna-south-african-scientists-rare.html",
        "text": "",
        "created_utc": 1672769263,
        "upvote_ratio": 1.0
    },
    {
        "title": "In defense of rodents: Why healthy ecosystems need them",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-defense-rodents-healthy-ecosystems.html",
        "text": "",
        "created_utc": 1672769228,
        "upvote_ratio": 1.0
    },
    {
        "title": "Flying foxes are a vital part of Australian ecosystems | Endangered species",
        "author": "VCardBGone",
        "url": "https://www.theguardian.com/environment/2023/jan/02/flying-foxes-are-a-vital-part-of-australian-ecosystems",
        "text": "",
        "created_utc": 1672769107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Noise pollution is a menace to humanity – and a deadly threat to animals | Karen Bakker",
        "author": "VCardBGone",
        "url": "https://www.theguardian.com/commentisfree/2023/jan/03/noise-pollution-is-a-menace-to-humanity-and-a-deadly-threat-to-animals",
        "text": "",
        "created_utc": 1672768750,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will humans become perpetually taller?",
        "author": "Miserable-Guess-783",
        "url": "https://www.reddit.com/r/biology/comments/102en59/will_humans_become_perpetually_taller/",
        "text": "Women find tall men more attractive so if tall men have an easier time to find a mate, so they will have more offspring, will this lead to a perpetual increase in height among humans.",
        "created_utc": 1672768739,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does ethylene oxide(the chemical which is used to sterilize covid test swabs and medical equipment) cause lymphoma/breast cancer?",
        "author": "sweetlikehoney981",
        "url": "https://www.reddit.com/r/biology/comments/102ehe1/does_ethylene_oxidethe_chemical_which_is_used_to/",
        "text": "I feel like it might be my health anxiety but I read online that if you are exposed enough to it, you can increase your chances of developing breast cancer or lymphoma/leukaemia. Over past few weeks I wasn't doing many covid tests but this week for the past three days I've done at least one test a day, sometimes two tests. It feels ironic because my health anxiety makes me feel like I need to frequently test myself, but at the same time what I have read online is making me feel like if my anxiety keeps making me feel like I need to keep testing myself then I'm going to end up developing  breast cancer. For context I'm in my early twenties and I think my increased health/death anxiety is a result of a traumatic/distressing medical/hospital experience I had when I was younger (both for me and my family) and I feel like it's making me hyper vigilant of any \"risk\" in terms of lifestyle choices(my diet, covid tests etc.) which may or may not put me at higher risk of getting cancer or any illness which could put me back in that hospital/doctors environment  if that makes sense\n\n[View Poll](https://www.reddit.com/poll/102ehe1)",
        "created_utc": 1672768361,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the name of this reflex?",
        "author": "deviantmoth",
        "url": "https://www.reddit.com/r/biology/comments/102eef9/whats_the_name_of_this_reflex/",
        "text": "When I'm hyperfocused on something,  my breathing completely cuts off. I can go up to 4 minutes without breathing and it isn't until I've zoned back in that I start breathing again and notice it. Apparently this is normal, but I haven't come across a name for the reflex that causes it.",
        "created_utc": 1672768176,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are we more from our fathers or more from our mothers?",
        "author": "Party-Mix4813",
        "url": "https://www.reddit.com/r/biology/comments/102eb18/are_we_more_from_our_fathers_or_more_from_our/",
        "text": "",
        "created_utc": 1672767955,
        "upvote_ratio": 1.0
    },
    {
        "title": "Summer Opportunities for college students w/o recommendations",
        "author": "Travellersaregreat",
        "url": "https://www.reddit.com/r/biology/comments/102e26n/summer_opportunities_for_college_students_wo/",
        "text": "Are there any programs for the summer that don't require recommendations? I'm not close with any of my professors and most of the programs require recommendations.",
        "created_utc": 1672767370,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would humanity evolve if TikTok where to high light Scientific and Athletic Achievements? and made kids motivated in accomplishing something??? instead of highlighting Mediocre dancing videos?",
        "author": "storytimecrop",
        "url": "https://www.reddit.com/r/biology/comments/102dq5w/would_humanity_evolve_if_tiktok_where_to_high/",
        "text": "",
        "created_utc": 1672766568,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think this is a Vorticella. Thoughts?",
        "author": "drsynthesis",
        "url": "https://youtu.be/9Taa0i_vu-s",
        "text": "",
        "created_utc": 1672764026,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think this is a Vorticella. Thoughts?",
        "author": "drsynthesis",
        "url": "https://www.youtube.com/watch?v=9Taa0i_vu-s&amp;t=597s",
        "text": "",
        "created_utc": 1672763918,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think this is a Vorticella. Thoughts?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1672763879,
        "upvote_ratio": 1.0
    },
    {
        "title": "is love a chemical reaction",
        "author": "storytimecrop",
        "url": "https://www.reddit.com/r/biology/comments/102bzkp/is_love_a_chemical_reaction/",
        "text": "",
        "created_utc": 1672762373,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the Tibiale-fibulare?",
        "author": "BritishMan5",
        "url": "https://www.reddit.com/r/biology/comments/102b94r/what_is_the_tibialefibulare/",
        "text": "I'm doing research on the *Beelzebufo ampigna* and a part came up talking about the Tibiale-fibulare and I can't seem to find what part of the body that is.\n\nI know it's in the hind limbs, but I know there is the femur that connects the leg to the ilium, then the tibiofibular underneath that, the tarsals is the bone that has the hole between what looks like two bones, then there's the metatarsal that has the phalanges attaches to it, then the phalanges which are the toes. (This for a common toad *Bufo bufo*)\n\nLike where is the Tibiale-fibulare?",
        "created_utc": 1672760557,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need some resources",
        "author": "Aphro2002",
        "url": "https://www.reddit.com/r/biology/comments/1029odj/i_need_some_resources/",
        "text": "For biotech and Bioinformatics, I found information on some websites but it was a bit wishy washy, and I need information from reputable sources, any ideas?\n\n We also don't have books in the library for these modules, but the ones I found online were dated. And I need new books for current progresses in Biotech.",
        "created_utc": 1672756400,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is life a fancy virtual reality??? why do I hear foot steps and random voices when I'm almost asleep??? Am I an account controlled in a multiverse????",
        "author": "storytimecrop",
        "url": "https://www.reddit.com/r/biology/comments/1028mlq/is_life_a_fancy_virtual_reality_why_do_i_hear/",
        "text": "",
        "created_utc": 1672753512,
        "upvote_ratio": 1.0
    },
    {
        "title": "who did kangaroos evolve from? is there a species with just one leg and a tiny sweater pouch?",
        "author": "storytimecrop",
        "url": "https://www.reddit.com/r/biology/comments/1028l25/who_did_kangaroos_evolve_from_is_there_a_species/",
        "text": "",
        "created_utc": 1672753399,
        "upvote_ratio": 1.0
    }
]