[
    {
        "title": "weird poop hanging from ceiling?",
        "author": "polive120",
        "url": "https://www.reddit.com/r/biology/comments/10ex43k/weird_poop_hanging_from_ceiling/",
        "text": "Recently moved in a house in the south; saw this poop hanging from the ceiling bathroom.\n\nDoes anyone where it came from? Maybe a lizard?\n\nThanks for any input\n\n&amp;#x200B;\n\nhttps://preview.redd.it/4dcbj12h4qca1.jpg?width=1156&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=9a6a8295dafb1f3158d137accddeda28c888c9e0",
        "created_utc": 1674013698,
        "upvote_ratio": 1.0
    },
    {
        "title": "Potential Biological reason for returning soldier effect",
        "author": "Kreanxx",
        "url": "https://www.reddit.com/r/biology/comments/10ex2jm/potential_biological_reason_for_returning_soldier/",
        "text": "The returning soldier effect, where there is a noticeable increase in the birth of boys after a conflict is vaguely similar to coyotes. When a female coyote howls and get a few howls back, the number of pups is normal, but if she heard one or a few her body produces more eggs and having a larger litter giving a chance for a few pups to survive in a hostile world. I’m wondering if it’s similar to RSE where maybe after a major conflict effecting a woman’s community, she produces certain hormones or some other means to give birth to more boys?",
        "created_utc": 1674013569,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should one do with unidentified, claimed to be new plant spp., obtained via plant swaps, besides producing seeds &amp; offering them to bot. gardens? Perhaps they should be sequenced or their microbiome cultured? Photographs submitted to some open archive? Thank you very much!",
        "author": "cur10us10",
        "url": "https://www.reddit.com/r/biology/comments/10ewdrt/what_should_one_do_with_unidentified_claimed_to/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/su90yl68ypca1.jpg?width=582&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=fb4359981db977e8734bf7c43a5267eb58071833",
        "created_utc": 1674011619,
        "upvote_ratio": 1.0
    },
    {
        "title": "Failure of tuberculosis treatment linked to bacterial resilience",
        "author": "Krazyscientist",
        "url": "https://www.hsph.harvard.edu/news/press-releases/tb-treatment-bacterial-reslience/",
        "text": "",
        "created_utc": 1674008297,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cordyceps: Attack of the Killer Fungi",
        "author": "VCardBGone",
        "url": "https://youtu.be/XuKjBIBBAL8",
        "text": "",
        "created_utc": 1674007460,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hypothesis about life evolving conscience",
        "author": "zMarvin_",
        "url": "https://www.reddit.com/r/biology/comments/10eudzo/hypothesis_about_life_evolving_conscience/",
        "text": "Hello, I've been thinking about conscience recently and I have a hypothesis on why humans have conscience and how it evolved. This may seem naive to most of you, but I have no one to share this hypothesis with and i would like to know if it could be relevant to someone smarter than me. \n\nIt all started when i read Sapiens from Yuval Harari and met a paradox about why humans evolve consciousness if a non sentient neural network can do almost anything (if not evertyhing) humans can do without being sentient. It goes as follows:\n\nWhat happens in the mind that doesn't happen in the brain? If nothing, then why did minds evolve at the first place? If it is something, where (physically) does this 'something' happens? Naturally, the response is 'at the brain', but then we've just came back to the first question.\n\n&amp;#x200B;\n\nThere goes my thinking process:\n\n**Intelligence X Consciousness X Self-awareness**\n\n1- **Intelligence**: ability to solve problems. A simple neural network can solve complex problems and contains a certain degree of flexibility within its own local field, but it certainly isn’t conscious. On evolved life, the mere intelligence is the poorest level of flexibility of all the neural networks, although it can still do powerfull stuff.\n\n2- **Consciousness**: intermediate level of flexibility. In this stage, for the first time, a virtual model of the world is created in the natural evolution of a neural network. Consciousness evolves when it becomes necessary to create abstractions in the form of subjective sensations in order to calculate a valid logical output more efficiently. Human babies and most animals are likely to be conscious. They are able to feel and experience the world kind of like we do, but probably don't think much outside of their sensorial limitations and instincts.\n\nIntelligence becomes conscious when the environment exerts enough evolutionary pressure, making a deeper understanding of the universe necessary in order to obtain better results in an individual's survival choices. Thus, virtual maps of the world are created, which allow greater creativity and flexibility within the choices made by the neural network, in addition creating what we usually call “mind”. This ensures greater idea variability of possible actions (creativity), increasing the chances of species’ collective success as a whole.\n\n• **Virtual maps**: it is what separates the “real world” from the “experienced world”. The subjective experience of colors, emotions, flavors and other sensations emerge in this virtual environment. This is the mental model that neural networks use to recreate the environment they are in and that allows greater levels of flexibility.\n\n• The virtual environment harbors consciousness, which is capable of giving immediate responses that are more plentiful (contains greater variability) than the immediate responses of a merely intelligent naturally evolved neural network, as consciousness allows for the emergence of creativity.\n\n3- **Self-awareness**: the highest level of mental flexibility currently achieved by terrestrial life. This is when consciousness becomes capable of overwriting its responses to certain stimuli, and may even alter its perception of the virtual environment to a certain degree. This is when the abilities of self-hypnosis, self evaluation, elevated rationality and mental proprioception emerge. Some mammals and birds may be self-aware to some degree, with the human genus being, clearly, the most self-aware of all by far.\n\nConsciousness becomes self-conscious when it becomes necessary to internalize intersubjective ideas (I borrowed this concept from Homo Deus – Yuval Harari) in order to live in societies with higher degrees of interdependence. Intersubjective ideas are those that are neither part of the objective nor the subjective world. They are the beliefs in ideologies, religions and the internalization of complex cultural concepts that connect individuals.\n\nEach species evolves its neural network to suit the specifics of its evolutionary environment. For example, some species of birds are shown to have different “cultures” and kinds of chirps depending on the regional group they are in, despite having the same genes and fundamental neural connections. Self-awareness increases as the need of internalizing intersubjective ideals grows in a given society.\n\nIt can also be inferred that the presence of virtual maps (consciousness) in self-aware individuals is something akin to an evolutionary vestige, in a certain way. Not necessarily a neural network needs to form consciousness in order to think about itself, but the natural evolution of neural networks in nature made it natural to virtual maps emerge before self-awareness, and therefore humans continue to experience subjective ideas such as pain and happiness.",
        "created_utc": 1674006188,
        "upvote_ratio": 1.0
    },
    {
        "title": "Your thoughts on why people think the earth is flat?",
        "author": "Krazyscientist",
        "url": "https://i.redd.it/1kmnk1jhwqca1.png",
        "text": "",
        "created_utc": 1674005964,
        "upvote_ratio": 1.0
    },
    {
        "title": "Campbell Biology (Campbell Biology Series) 11th Edition by Lisa Urry - Download Now",
        "author": "Tiny-Swordfish1017",
        "url": "https://www.ebook4y.com/product-page/Campbell-Biology-11th-Lisa-Urry-0134093410",
        "text": "",
        "created_utc": 1673996339,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice, I know it's really bad",
        "author": "Cute_Toe8097",
        "url": "/r/resumes/comments/10ep12q/need_advice_i_know_its_really_bad/",
        "text": "",
        "created_utc": 1673994517,
        "upvote_ratio": 1.0
    },
    {
        "title": "https://www.reddit.com/r/resumes/comments/10ep12q/need_advice_i_know_its_really_bad/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button",
        "author": "Cute_Toe8097",
        "url": "https://www.reddit.com/r/biology/comments/10epl7g/httpswwwredditcomrresumescomments10ep12qneed/",
        "text": "",
        "created_utc": 1673994314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are those my bones",
        "author": "sparrowbigballs",
        "url": "https://i.redd.it/i46xp7r5opca1.png",
        "text": "[removed]",
        "created_utc": 1673990151,
        "upvote_ratio": 1.0
    },
    {
        "title": "fat #fat #biggest #animals #krill #blue #whale #diplodicus #brachiosau...",
        "author": "jj-Searcys2005",
        "url": "https://www.tiktok.com/t/ZTRp2vJBs/",
        "text": "",
        "created_utc": 1673990077,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tepehuán tobacco. Nicotiana rustica.",
        "author": "j-cole333",
        "url": "https://www.reddit.com/gallery/10emv57",
        "text": "",
        "created_utc": 1673988226,
        "upvote_ratio": 1.0
    },
    {
        "title": "What type of biomolecule is “Gene 1”? Explain why.",
        "author": "trax143",
        "url": "https://i.redd.it/kc25c3cxfpca1.jpg",
        "text": "",
        "created_utc": 1673987378,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT explains T cell development from the perspective of a surfer bro:",
        "author": "ryko77",
        "url": "https://www.reddit.com/r/biology/comments/10ely5c/chatgpt_explains_t_cell_development_from_the/",
        "text": "My prompt:Pretend you are are surfer bro and explain how human T cell development occurs in the thymus. But only refer to CD4 T cells as the “helper bois”, CD8 T cells as the “killer bois”, and the bloodstream as the whitewater.The answer: Yo brah, so like, T cell development is all about the thymus, ya know? It's like the ultimate surf spot for the immune system. So, the helper bois and killer bois start out as these little immature cells in the thymus, like little groms just learning to ride the waves.As they start to mature, they start to express different receptors, like the CD4 and CD8 markers. The helper bois are like the lifeguards of the whitewater, they help coordinate the immune response and signal to other cells when to jump into action. The killer bois, on the other hand, are like the heavy hitters, they go straight for the dangerous pathogens and take 'em out.So, as these cells mature in the thymus, they start to get tested by the waves of the whitewater, or in this case, the antigens that flow through the bloodstream. If they can't handle the waves, they get washed out and don't make it to the final lineup of immune cells. But if they can handle it, they become fully mature and ready to take on any pathogen that comes their way.It's like the ultimate training ground for the immune system, and the helper bois and killer bois are the ultimate surf bros of the whitewater.",
        "created_utc": 1673985915,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is this thing? Found on a beach in Los Angeles, CA. Any help would be appreciated.",
        "author": "yungbuddzz",
        "url": "https://i.redd.it/xxhat6p34pca1.jpg",
        "text": "",
        "created_utc": 1673983403,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help with a paper about different species classifications!",
        "author": "MAAUUW",
        "url": "https://www.reddit.com/r/biology/comments/10ejc2m/need_help_with_a_paper_about_different_species/",
        "text": "Hi everyone, \n\nI am writing a paper about different species classifications and how they compare to each other, and am looking for an organism that is classified as a different species under different species classifications. \n\nFor example: \n\nOrganism x is classified as species A under classification method 1, but under classification method 2 is classified as species B. \n\nI've been looking for organism x in research papers, and so far no luck. Could you guys help me? :)  \nThank you!",
        "created_utc": 1673979812,
        "upvote_ratio": 1.0
    },
    {
        "title": "Biology doesn't always make sense",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1673974253,
        "upvote_ratio": 1.0
    },
    {
        "title": "Biodiversity safeguards bird communities under changing climate, shows study",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-biodiversity-safeguards-bird-communities-climate.html",
        "text": "",
        "created_utc": 1673973308,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rare fossilized feathers reveal secrets of paleontology hotspot during Cretaceous period",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-rare-fossilized-feathers-reveal-secrets.html",
        "text": "",
        "created_utc": 1673973264,
        "upvote_ratio": 1.0
    },
    {
        "title": "Critically endangered Yangtze finless porpoise shows signs of recovery",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-critically-endangered-yangtze-finless-porpoise.html",
        "text": "",
        "created_utc": 1673973209,
        "upvote_ratio": 1.0
    },
    {
        "title": "Birdsong isn't just competition for mates or territory: Zebra finches sing to bond",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-birdsong-isnt-competition-territory-zebra.html",
        "text": "",
        "created_utc": 1673973168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Living on the edge: Small mammals in threatened, biodiverse hotspot hold clues for conservation",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-edge-small-mammals-threatened-biodiverse.html",
        "text": "",
        "created_utc": 1673973123,
        "upvote_ratio": 1.0
    },
    {
        "title": "Glassy and reactive: Plants are more dynamic than you think",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-glassy-reactive-dynamic.html",
        "text": "",
        "created_utc": 1673973087,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unique trilobite trident could be the oldest evidence of male sexual combat",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-unique-trilobite-trident-oldest-evidence.html",
        "text": "",
        "created_utc": 1673973035,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ancient chimeras were suction feeders, not shell crushers, new research shows",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-ancient-chimeras-suction-feeders-shell.html",
        "text": "",
        "created_utc": 1673972998,
        "upvote_ratio": 1.0
    },
    {
        "title": "How donkeys changed the course of human history",
        "author": "VCardBGone",
        "url": "https://www.bbc.com/future/article/20230116-how-donkeys-changed-the-course-of-human-history",
        "text": "",
        "created_utc": 1673972282,
        "upvote_ratio": 1.0
    },
    {
        "title": "How extinct animals could be brought back from the dead",
        "author": "VCardBGone",
        "url": "https://www.bbc.com/future/article/20230113-how-extinct-animals-could-be-brought-back-from-the-dead?utm_source=bbc-news&amp;utm_medium=right-hand-slot",
        "text": "",
        "created_utc": 1673972212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please give me an honest answer(not just saying no because that's what you'd hope the answer is) but generally are people who chose to have the vaccine actually at higher risk of getting pneumonia from covid/lowered immune system after having the vaccine etc.",
        "author": "sweetlikehoney981",
        "url": "https://www.reddit.com/r/biology/comments/10efyre/please_give_me_an_honest_answernot_just_saying_no/",
        "text": "I literally feel like I can't cope with my health anxiety anymore. I've tried to be optimistic and resilient regarding my fears and anxiety but every time I try and distract myself, it will be effective for like a few hours but then after that my anxiety comes back twice as intensely. I'm in my early twenties and I know I'm relatively young but I know a lot of young people still do die of flu/covid /pneumonia. And it's not like ive only seen a couple of accounts of people who had the vaccine getting sick more often, ive seen LOTS of people talking about how they are vaccinated and have contracted covid and then said that they have never felt so ill in their life etc. I've basically convinced myself that I'm going to get covid again(I literally only had a positive lft a week and a half ago but I know a lot of people personally who had covid and then got covid again literally two weeks later so I don't feel optimistic tbh) i had to go to hospital for surgery when I was younger for something that I did to myself when I wasnt in a good emotional state and I feel like I'm not allowed to go to therapy to talk about what happened because whilst sometimes people have said to me \"id absolutely expect you to feel upset about what you did to yourself\" but often people have said that what I did to myself isn't valid enough trauma wise to go and get help purely because I did it to myself. I'm so scared of having to be back in that hospital environment and part of the reason why I'm also so scared about getting sick is because along with socializing, self care etc. Going to the social groups is a big way for me to feel in control if I feel like I can't control my anxiety and if I couldn't see people even for a week, idk if I could keep myself safe\n\n[View Poll](https://www.reddit.com/poll/10efyre)",
        "created_utc": 1673971738,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do people live without a oesophagus?",
        "author": "23sdsdsd2",
        "url": "https://www.reddit.com/r/biology/comments/10eep8e/how_do_people_live_without_a_oesophagus/",
        "text": "there an surgery to fully remove it and replace it with your stomach by stretching it out to the top of the throat. But wouldn't that cause stomach acid to constantly spill out in your mouth? And how would you breathe? Since the oesophagus is connected to the lungs and that's how air gets into your lungs. But now with the stomach in place how would air be able to come there? Would they put an breathing appartus on the person that is on the outside or something?",
        "created_utc": 1673968558,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do hominins have in common?",
        "author": "BWVE",
        "url": "https://www.reddit.com/r/biology/comments/10eegtf/what_do_hominins_have_in_common/",
        "text": "[diagram](https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Hominini_lineage.svg/1024px-Hominini_lineage.svg.png)\n\nHominins (ie hominini) are humans and two species of chimp. \n\n[WP](https://en.wikipedia.org/w/index.php?title=Hominini&amp;oldid=1132918239) doesnt say anything about defining traits here.",
        "created_utc": 1673967960,
        "upvote_ratio": 0.99
    },
    {
        "title": "Praying Mantis, which species it?",
        "author": "akvsangli",
        "url": "https://www.reddit.com/r/biology/comments/10ee9g0/praying_mantis_which_species_it/",
        "text": "",
        "created_utc": 1673967460,
        "upvote_ratio": 1.0
    },
    {
        "title": "Comparing WGS Results",
        "author": "bluewillow2022",
        "url": "https://www.reddit.com/r/biology/comments/10edmvj/comparing_wgs_results/",
        "text": "I had my whole genome sequenced before Covid 19 existed using Nebula Genomics and now since after having Covid 19 I thought to test again and compare the results to look for differences if any. The files are huge. Are there any tools I could run locally on a MacBook to do this (crossing fingers), or would I have to write my own?",
        "created_utc": 1673965824,
        "upvote_ratio": 1.0
    },
    {
        "title": "Preteens who avoid angry and critical faces may be more vulnerable to future depression and social anxiety",
        "author": "Sea_Manager5390",
        "url": "https://skymagzines.com/preteens-who-avoid-angry-and-critical-faces-may-be-more-vulnerable-to-future-depression-and-social-anxiety/",
        "text": "",
        "created_utc": 1673958873,
        "upvote_ratio": 1.0
    },
    {
        "title": "Biology SURE SHOT MCQ's for NEET 2023 || The Living World || by Shiksha ...",
        "author": "Zestyclose-Shirt-981",
        "url": "https://youtube.com/watch?v=LGrtxwTBESI&amp;feature=share",
        "text": "",
        "created_utc": 1673954829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are we getting dumber and dumber? | DW Documentary",
        "author": "NonSekTur",
        "url": "https://www.youtube.com/watch?v=s8TM_RD3qrI",
        "text": "",
        "created_utc": 1673954326,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do Viruses Function and Cause Illness in Humans?",
        "author": "VrobleBlog",
        "url": "https://www.vroble.com/2023/01/how-do-viruses-function-and-cause.html",
        "text": "",
        "created_utc": 1673953742,
        "upvote_ratio": 1.0
    },
    {
        "title": "Claiming That Coelacanths Are \"Living Fossils\" Is Not Entirely Accurate",
        "author": "SkepticSalamander",
        "url": "https://www.reddit.com/r/biology/comments/10e9hjy/claiming_that_coelacanths_are_living_fossils_is/",
        "text": "[https://skepticsalamanderblog.blogspot.com/2023/01/claiming-that-coelacanths-are-living.html](https://skepticsalamanderblog.blogspot.com/2023/01/claiming-that-coelacanths-are-living.html)",
        "created_utc": 1673953085,
        "upvote_ratio": 1.0
    },
    {
        "title": "Claiming That Coelacanths Are \"Living Fossils\" Is Not Entirely Accurate",
        "author": "SkepticSalamander",
        "url": "https://skepticsalamanderblog.blogspot.com/2023/01/claiming-that-coelacanths-are-living.html",
        "text": "",
        "created_utc": 1673953056,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does it have to be in your genes to be a contortionist? would I break my arms if I try to gradually stretch them all the way back from time to time?",
        "author": "storytimecrop",
        "url": "https://www.reddit.com/r/biology/comments/10e4mol/does_it_have_to_be_in_your_genes_to_be_a/",
        "text": "",
        "created_utc": 1673935372,
        "upvote_ratio": 1.0
    },
    {
        "title": "(not sure if true) but there was a drug scientist made to make inmates feel like they been there for more time than actual......can someone take it as a mental \"Hyperbolic Time Chamber\" ? and study and memorize things? just curious",
        "author": "storytimecrop",
        "url": "https://www.reddit.com/r/biology/comments/10e4m6b/not_sure_if_true_but_there_was_a_drug_scientist/",
        "text": "",
        "created_utc": 1673935324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nudges proved ineffective in a Rhode Island vaccination randomized controlled trial",
        "author": "Sea_Manager5390",
        "url": "https://skymagzines.com/nudges-proved-ineffective-in-a-rhode-island-vaccination-randomized-controlled-trial/",
        "text": "",
        "created_utc": 1673929939,
        "upvote_ratio": 1.0
    },
    {
        "title": "There are more people in the sex work industry than we might think, new research suggests",
        "author": "Sea_Manager5390",
        "url": "https://skymagzines.com/there-are-more-people-in-the-sex-work-industry-than-we-might-think-new-research-suggests/",
        "text": "",
        "created_utc": 1673928132,
        "upvote_ratio": 1.0
    },
    {
        "title": "Discovering the Secrets of the Human Kinome: An Atlas of Substrate Specificities for Serine/Threonine Kinases",
        "author": "cbirt_",
        "url": "https://cbirt.net/discovering-the-secrets-of-the-human-kinome-an-atlas-of-substrate-specificities-for-serine-threonine-kinases/",
        "text": "",
        "created_utc": 1673925827,
        "upvote_ratio": 1.0
    },
    {
        "title": "great white biolgy",
        "author": "Lonely_Enthusiasm645",
        "url": "https://www.reddit.com/r/biology/comments/10e0qgi/great_white_biolgy/",
        "text": "The origin of the great white shark.\n\nAt first glance, one might think that the ocean's shark species are all related to one another and so it follows that they are all related to one another.\n\nIn fact, it turns out that there are some 200 shark species, and they're all closely related. You'll find that most shark species have a \"secret\" relative, one that scientists have been trying to identify for decades.\n\nMikhail Katzman is one of the world's foremost shark biologists. He's also director of the Division of Genomic and Evolutionary Genetics at the Mote Marine Laboratory in Sarasota, Fla.\n\nIn a conversation with Shots, Katzman describes these ancestral shark ancestors, why the discovery is so significant and how the secret family tree might help us understand how to keep great white sharks safe and what we should do if we encounter one.\n\nThe interview has been edited for length and clarity.\n\nHow did you become interested in the ancestral shark lineage?\n\nI've always had an interest in biology and been trying to figure out how it all fit together. The first job I ever had at a marine laboratory, my very first job, I was a clean-up crew member. I had this idea in my head that I wanted to be a marine biologist and that this is what I wanted to do. My mom and dad gave me a little old chemistry set. I used to go down to the basement, and I would really study all the different chemical reactions and the periodic table. I'm a big big fan of modern chemistry, and this was my chance to learn more about it.\n\nMy dad came from a place in Austria and he was a plumber, like in a gas station. He was talking about the oceans when he was a young man, and he said, \"I learned about the ocean from the water and everything is salty.\" He would spray sulfur dioxide in the ocean and this fog would blow across the desert, and it would evaporate. My dad would go and he'd turn it into a big cloud. And they used to call it sulfur cloud, and this was how they called it the ocean. That got me really interested in the oceans, and the different parts of them.\n\nIt just made a huge impression on me. So I started working with marine biology and then I wanted to learn about what the different parts of the ocean was. I started working in Colorado and did research on the corals and the water and then I started working on the water, on the hydrothermal vents, the vents that are made out of the rocks. And they are so hot that it takes hundreds of millions of years for the rocks to grow because they are so hot.\n\nAnd then I really started to get interested in sharks. I love sharks, and sharks are the only living animals with four fins. And they're the only living animals that have that distribution pattern. So I really got fascinated with sharks.\n\nHow would you describe the ancestral shark family tree?\n\nWell, the main thing about it is that the idea of sharks having a family tree was a mythology. And when I first started looking at them, I said to myself, \"How is it possible that there's a family tree? It doesn't make sense.\" But as I looked into it, I began to think that maybe there was an ancestor, maybe it was a bacteria, that had a different way of moving through the water that changed all the sharks because it just didn't work for other sharks.\n\nI started to dig deeper into that, and there was one piece of evidence that we had. It was just something that just blew me away. The thing that was so surprising about the shark family tree was how closely related they were to us. And that's how I became really interested in sharks, was their relationship to humans.\n\nSo we are closely related to the shark, but not to all of them. And that's a part of what's so exciting about sharks, but it's also a very frightening part of sharks.\n\nSo the mystery is: How can there be this secret family tree?\n\nWell, when I started looking at sharks in the past, in the last few decades, the first thing that came to mind is that it could be a parasite. The thing is that parasitic jellyfish are only attached to one shark, and that means it's not a long-term relationship. It means it's not a family relationship. So they attach to one shark and they shed off.\n\nBut what I discovered is that sharks shed off like other animals, like they shed off all their skin cells. And we're attached to our families all the time. We shed off all our skin cells. So it's not the case that it's a parasite.\n\nSo I started looking at other species of sharks, and I saw that it was a lot more common than that. All the evidence was coming back that it wasn't a parasite. And so I started to look into it. I thought to myself: Well, we've been looking at a large number of species of sharks. And we know for sure there's lots of species of sharks. And there have been many species of sharks, many species, but that doesn't mean there's no one shark. It could be multiple species. There could be a family tree and multiple species, and each one is unique and could be an ancestor.\n\nThe thing about the family tree that's so strange about sharks, is that if you go back in the history of sharks, it goes back 300 million years. They've never changed that much. In contrast, the entire range of mammals, which are probably the same as sharks, have changed and evolved enormously. So, there are these different mutations in sharks. They are a lot more resistant to disease and they have stayed the same for 300 million years.\n\nMy best guess is that, at some point, there was a big fish that got that position that it should have been in. I don't know what species of fish it was, but when that happened\n\nThe trex origin. And it could be that it was an ancestor of all sharks, but it could be a different shark. And it might have changed all the sharks that were around at the time, for example. So then, instead of having lots of different types of sharks, there would be just one type. It's difficult to know, but at least that is something we have evidence of.\n\nHow did sharks get to be predators of other animals?\n\nWell, you might say they got to be predators of all other animals because they were prey for other animals, but that's not true. They were, in fact, predators of other animals. It's just they were a totally different type of predator. Sharks today are predatory, but they're very different from the predatory sharks.\n\nOne other thing is, as we know, they don't have the ability to smell. The greatest predators that we have in the world, like lions, are top predators, and they can smell.\n\nThe great white shark, for example, is a predator, but it is not a particularly powerful predator. It has been found that the great white sharks are unable to catch and kill small fry, or small mammals. Even, after long periods of exposure, they can't detect. They can't smell.\n\nWe know that lions can hunt and kill small mammals. But it's not because they have better noses. They are better hunters, and that's why they're top predators. The great white shark has no chance of catching and killing a tiny sea lion.\n\nWhat do scientists know about the first sharks that lived 300 million years ago?\n\nWell, we know they're marine because they came from the ocean. The fossil record shows that they were probably more plankton than anything. Now that we know there were sharks 300 million years ago, then we have to look at the first record of shark in the fossil record.\n\nThis is actually a good segue. What is the earliest record of the first shark? I think it's about 220 million years ago. And what we think is the oldest record is a group called the Orectolobidae, which is actually a kind of shark that is about the size of a land animal. And the next thing we know we have several more species of sharks that appear and they became more bigger. And they started to fill the food niche. The space between marine animals and plants, or between sea and land. But the real oddity about the sharks in the fossil record is that we actually don't see any of them alive.\n\nWe see their teeth, which is a real marker of them. But no one has ever been able to catch one alive. And for whatever reason, they don't appear in the fossil record. So we can't really say they were there. I don't know why they never appeared. It is one of the oddest features of the fossil record.\n\nBecause they seem like they should have. When we talk about when we saw the first people, we talk about when they appeared in the fossil record. They are usually described as fish, or amphibians, or reptiles. But the earliest shark teeth we have actually show evidence of the beginnings of jaws.\n\nSo maybe the Orectolobidae were there, but they weren't the ancestors of sharks. Or maybe the great white shark was there, but the ancestors of the great white shark had not evolved yet. It's a mystery. But all these problems in the fossil record have one thing in common. All those problems we have are problems that could be addressed with tools. They would be solved with chemistry. And these problems exist because we haven't developed the tools.\n\nJust imagine if you had an insight about the way to extract zinc from ore. There are three ways to extract zinc, and we didn't know any of them. So we're not going to go to the zoo and pick up a plant to extract zinc. But if we had the technology of scraping or other sort of mechanical technology to separate the zinc from the ore, then maybe we would know the answer.\n\nWhy did we have to wait 30 million years for science to discover the way to separate zinc? It's because we lacked the technology. And I think it's the same with sharks.\n\nBack to top\n\nSo where do sharks fit in with plants and animals?\n\nWell, that's where things get a little complicated. We know there are five of them. And these are a very unusual group, so they're not like any other group. These are special groups that we have just discovered. And we know that they're special because they show evidence of evolution.\n\nIn the past 200 years there have been five major discoveries. But they all have one thing in common. They show that evolution had a role to play in our existence. And these are the five modern groups, and their discovery goes back about 200 years.\n\nThe first group we ever discovered was about 200 years ago. That's all we know, but we aren't sure if evolution exists. We may be wrong.",
        "created_utc": 1673923818,
        "upvote_ratio": 1.0
    },
    {
        "title": "f",
        "author": "Fun-Character-6392",
        "url": "https://i.redd.it/tex8qgj5pica1.jpg",
        "text": "",
        "created_utc": 1673923738,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pathophysiological question for those with Endocrine knowledge or really anyone who wants to join in",
        "author": "Prerouting1",
        "url": "https://www.reddit.com/r/biology/comments/10e0jk7/pathophysiological_question_for_those_with/",
        "text": " Just a question to spark some discussion and hopefully provide me with some insight into the cellular processes:\n\nWhy is it that some patients who present with thyroiditis - painful and painless - don't recover from the hypothyroid phase following the thyrotoxic phase? The follicular cells of the thyroid and parathyroid glands are parts of the endoderm, similar to the stomach, lungs, liver, and pancreas. Why would these cells not regain their function similarly to other organs? Does body age play a role here? Do some people's bodies just say \"No, I think we're good not reaching homeostasis.\"?\n\nThanks for any responses!",
        "created_utc": 1673923274,
        "upvote_ratio": 1.0
    },
    {
        "title": "f",
        "author": "Aggravating-Wind219",
        "url": "https://i.redd.it/tbjlzuv9fica1.jpg",
        "text": "",
        "created_utc": 1673920416,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone Identify this vertebrae I found at the beach? It is concave on both sides.",
        "author": "Allosaurusfragillis",
        "url": "https://www.reddit.com/gallery/10dysg7",
        "text": "",
        "created_utc": 1673918566,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best books about history of Biology",
        "author": "CamiloJimenez019",
        "url": "https://www.reddit.com/r/biology/comments/10dymmd/best_books_about_history_of_biology/",
        "text": "Hi, I am looking for books about the history of biology.",
        "created_utc": 1673918123,
        "upvote_ratio": 1.0
    },
    {
        "title": "fc",
        "author": "henionmztaddeigp",
        "url": "https://i.redd.it/2m485ypv4ica1.png",
        "text": "",
        "created_utc": 1673916929,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are the oval dots fungal spores? Or maybe individually damaged cells? (long backstory in comment)",
        "author": "Nightnlight1",
        "url": "https://www.reddit.com/gallery/10dxx44",
        "text": "",
        "created_utc": 1673916239,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is the UK forcing DNRs on people with disabilities any different from Nazi eugenics?",
        "author": "Financial_Debt_8745",
        "url": "https://www.reddit.com/r/biology/comments/10dxh5w/how_is_the_uk_forcing_dnrs_on_people_with/",
        "text": "",
        "created_utc": 1673915081,
        "upvote_ratio": 1.0
    },
    {
        "title": "if one was born at a different time from the same parents, would their physical appearance be different?",
        "author": "awerks12",
        "url": "https://www.reddit.com/r/biology/comments/10dwdu4/if_one_was_born_at_a_different_time_from_the_same/",
        "text": "",
        "created_utc": 1673912372,
        "upvote_ratio": 1.0
    },
    {
        "title": "New approach for treating lupus holds promise, finds study",
        "author": "VCardBGone",
        "url": "https://medicaldialogues.in/mdtv/dermatology/videos/new-approach-for-treating-lupus-holds-promise-finds-study-105660",
        "text": "",
        "created_utc": 1673912293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wireless brain implant monitors neurotransmitters in real-time",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-wireless-brain-implant-neurotransmitters-real-time.html",
        "text": "",
        "created_utc": 1673912023,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gone fishing: Highly accurate test for common respiratory viruses uses DNA as 'bait'",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-fishing-highly-accurate-common-respiratory.html",
        "text": "",
        "created_utc": 1673911970,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do microorganisms on hydrothermal vents get and convert their energy?",
        "author": "Creative_Recover",
        "url": "https://www.reddit.com/r/biology/comments/10dw7ui/how_do_microorganisms_on_hydrothermal_vents_get/",
        "text": "Hi! I'm trying really hard to figure out the ecosystem of microorganisms living around deep oceanic hydrothermal vents and how they they manage to get their energy from the mineral-rich soup flowing out of the piping hot chimneys. Can anyone here help explain the processes to me? \n\nThank you so much!",
        "created_utc": 1673911955,
        "upvote_ratio": 1.0
    },
    {
        "title": "Early humans: Tooth enamel reveals life histories",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-early-humans-tooth-enamel-reveals.html",
        "text": "",
        "created_utc": 1673911913,
        "upvote_ratio": 1.0
    },
    {
        "title": "A breakthrough in understanding the sugar biology of multicellular organisms",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-breakthrough-sugar-biology-multicellular.html",
        "text": "",
        "created_utc": 1673911870,
        "upvote_ratio": 1.0
    },
    {
        "title": "Genetically modified rice could be key to tackling food shortages caused by climate change",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-genetically-rice-key-tackling-food.html",
        "text": "",
        "created_utc": 1673911789,
        "upvote_ratio": 1.0
    },
    {
        "title": "Study finds ants aren't altering behavior in rising temperatures",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-ants-behavior-temperatures.html",
        "text": "",
        "created_utc": 1673911726,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scientists discover secreted protein helps repair and grow muscles",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-scientists-secreted-protein-muscles.html",
        "text": "",
        "created_utc": 1673911680,
        "upvote_ratio": 1.0
    },
    {
        "title": "Understanding the alpha smooth muscle actin–driven foreign body response during wound healing",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-alpha-smooth-muscle-actindriven-foreign.html",
        "text": "",
        "created_utc": 1673911636,
        "upvote_ratio": 1.0
    },
    {
        "title": "Plasmids and the spread of antibiotic resistance genes",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-plasmids-antibiotic-resistance-genes.html",
        "text": "",
        "created_utc": 1673911587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Researchers produce first-ever toolkit for RNA sequencing analysis using a 'pantranscriptome'",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-first-ever-toolkit-rna-sequencing-analysis.html",
        "text": "",
        "created_utc": 1673911545,
        "upvote_ratio": 1.0
    },
    {
        "title": "How soldier fly larvae could reduce food waste",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-soldier-fly-larvae-food.html",
        "text": "",
        "created_utc": 1673911496,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sympatric or micro-allopatric speciation in glacial lake? Genomic islands support neither",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-sympatric-micro-allopatric-speciation-glacial-lake.html",
        "text": "",
        "created_utc": 1673911454,
        "upvote_ratio": 1.0
    },
    {
        "title": "1 billion years of abstinence: Chloroplasts can finally hope for sex",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-billion-years-abstinence-chloroplasts-sex.html",
        "text": "",
        "created_utc": 1673911415,
        "upvote_ratio": 1.0
    },
    {
        "title": "Endogenous retroviruses: Link to programmed aging found",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-endogenous-retroviruses-link-aging.html",
        "text": "",
        "created_utc": 1673911380,
        "upvote_ratio": 1.0
    },
    {
        "title": "A new species of gecko: What's in a name and why it matters",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-species-gecko.html",
        "text": "",
        "created_utc": 1673911342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Native eastern fence lizards change their bodies and behavior in response to invasive red imported fire ants",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-native-eastern-lizards-bodies-behavior.html",
        "text": "",
        "created_utc": 1673911301,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spotted hyenas all sound different when they call—they can tell friend from foe",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-hyenas-callthey-friend-foe.html",
        "text": "",
        "created_utc": 1673911257,
        "upvote_ratio": 1.0
    },
    {
        "title": "Most humans haven't evolved to cope with the cold, yet we dominate northern climates—here's why",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-humans-havent-evolved-cope-cold.html",
        "text": "",
        "created_utc": 1673911216,
        "upvote_ratio": 1.0
    },
    {
        "title": "How the last 12,000 years have shaped what humans are today",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-01-years-humans-today.html",
        "text": "",
        "created_utc": 1673911138,
        "upvote_ratio": 1.0
    },
    {
        "title": "We will never be able to live on another planet. Here’s why | Aeon Essays",
        "author": "VCardBGone",
        "url": "https://aeon.co/essays/we-will-never-be-able-to-live-on-another-planet-heres-why",
        "text": "",
        "created_utc": 1673910732,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beavers to be reintroduced in Hampshire for first time in 400 years | Wildlife",
        "author": "VCardBGone",
        "url": "https://www.theguardian.com/environment/2023/jan/16/beavers-reintroduced-hampshire-first-time-in-400-years",
        "text": "",
        "created_utc": 1673910389,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tech Tent - MRNA: The tech that transforms cancer treatment? - BBC Sounds",
        "author": "VCardBGone",
        "url": "https://www.bbc.co.uk/sounds/play/w3ct4kj0",
        "text": "",
        "created_utc": 1673909767,
        "upvote_ratio": 1.0
    },
    {
        "title": "Foot-long dwarf boa found in Ecuadorian Amazon | CNN",
        "author": "VCardBGone",
        "url": "https://www.cnn.com/2023/01/16/americas/dwarf-boa-ecuador-scn/index.html",
        "text": "",
        "created_utc": 1673909013,
        "upvote_ratio": 1.0
    },
    {
        "title": "Noticed after a dog had parvo. Seen them twice can’t find what they are anywhere. But it wiggled and moved.",
        "author": "Alterniity",
        "url": "https://v.redd.it/ewrw3d7suica1",
        "text": "",
        "created_utc": 1673907625,
        "upvote_ratio": 1.0
    },
    {
        "title": "4-Year-Old Complains Of Stomach Pain, Doctors Find Magnetic Bracelet Inside",
        "author": "VCardBGone",
        "url": "https://www.ndtv.com/feature/4-year-old-complains-of-stomach-pain-doctors-find-magnetic-bracelet-inside-3698187",
        "text": "",
        "created_utc": 1673907041,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question About Blood Transfusions.",
        "author": "peterpan39141",
        "url": "https://www.reddit.com/r/biology/comments/10dt3xu/question_about_blood_transfusions/",
        "text": "Why is **AB Blood group** considered 'Universal acceptor' ?  Let us not include Rh factor for now....\n\nperson with **AB-Blood** **group** has 'A-type' and 'B type' antigens on the RBC. If they were to get Transfusion from **A-blood group** (for example), the 'Anti-B antibodies' of the serum will cause agglutination in the recipient's blood. \n\nB-type RBC antigens (recipient) ----&gt; X &lt;-----Anti-B serum antibodies (donor)\n\nRIGHT??!!? Why?",
        "created_utc": 1673905146,
        "upvote_ratio": 1.0
    },
    {
        "title": "What software is good for creating publication quality diagrams?",
        "author": "bluish1997",
        "url": "https://www.reddit.com/r/biology/comments/10dso3y/what_software_is_good_for_creating_publication/",
        "text": "Preferably something user friendly with free options",
        "created_utc": 1673904387,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Protein Analysis Gets a Boost: Researchers Develop Advanced Label-Free Technique Using Ultraviolet Nanophotonics\"",
        "author": "Old_Height_9219",
        "url": "https://www.reddit.com/r/biology/comments/10dsgd6/protein_analysis_gets_a_boost_researchers_develop/",
        "text": "  \n\nScientists from Institut Fresnel, Aix Marseille University, have made a significant breakthrough in the field of protein study using ultraviolet nanophotonics to enable autofluorescence correlation spectroscopy on label-free proteins with a single Tryptophan.\n\nUsing the ultraviolet autofluorescence of tryptophan amino acids offers fascinating perspectives to study single proteins without the drawbacks of fluorescence labeling. However, the low autofluorescence signals have so far limited the UV detection to large proteins containing several tens of tryptophan residues. This limit is not compatible with the vast majority of proteins which contain only a few tryptophans.\n\nThe team has successfully pushed the sensitivity of label-free ultraviolet fluorescence correlation spectroscopy (UV-FCS) down to the single tryptophan level. The combination of nanophotonic plasmonic antennas, antioxidants, and background noise reduction techniques has improved the signal-to-background noise ratio by over an order of magnitude and enabled UV-FCS on TNase proteins with a single tryptophan residue.\n\nThis sensitivity breakthrough unlocks the applicability of the UV-FCS technique to a broad library of label-free proteins. This research is significant as it allows for proteins to be studied in their native state without introducing any external fluorescent label, thus simplifying the protein preparation and purification steps and ruling out the necessary controls to ensure the fluorescent label does not affect the protein.\n\nThis research opens up new opportunities for the study of proteins in the deep ultraviolet (UV) range using the natural fluorescence of tryptophan, tyrosine, and phenylalanine amino acids. The researchers have provided guidelines on how to extend plasmonics into the UV regime and further develop label-free single-molecule spectroscopy.\n\nIn a recent Nano Letters publication, our team breaks into this sensitivity limit and achieves label-free UV-autofluorescence detection down to the single tryptophan level thanks to a nanophotonic enhancement of the signal. Our approach relies on a rationally-designed combination of plasmonic antennas, antioxidants, and background noise reduction techniques to improve the signal-to-background ratio by over an order of magnitude. Achieving the ultimate sensitivity of UV-FCS down to the single tryptophan regime has wide applications for various communities from nanophotonics to biochemistry.\n\n&amp;#x200B;\n\n**More information:**  \nPrithu Roy et al, Ultraviolet Nanophotonics Enables Autofluorescence Correlation Spectroscopy on Label-Free Proteins with a Single Tryptophan, *Nano Letters* (2023). DOI: 10.1021/acs.nanolett.2c03797 , [pubs.acs.org/doi/10.1021/acs.nanolett.2c03797](https://pubs.acs.org/doi/10.1021/acs.nanolett.2c03797)",
        "created_utc": 1673904028,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is this? Context: we are doing experiment on peppered cockroaches (second pic for reference). Today one of our females was missing &amp; this was found in the container. Lab tech has no idea…",
        "author": "Bulky_Wallaby6562",
        "url": "https://www.reddit.com/gallery/10dr7kw",
        "text": "",
        "created_utc": 1673901990,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spider mite or young form of Aphid?",
        "author": "Nightnlight1",
        "url": "https://www.reddit.com/gallery/10dphat",
        "text": "",
        "created_utc": 1673898592,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dinosauria Cladogram",
        "author": "UnexpectedDinoLesson",
        "url": "https://www.reddit.com/r/biology/comments/10dp925/dinosauria_cladogram/",
        "text": "I have created an [**exhaustive cladogram of Dinosauria**](https://docs.google.com/spreadsheets/d/1rgflfIWW6x2h6jRRTe6cRO4YWc3mEKzVmJ7UzREFNq8/edit?usp=sharing) on Google Sheets.\n\nI realize the data is organized and logged in scientific journals somewhere, but I've found that it's pretty hard to find. I also realize that there are conflicting observations and cladistic organizations within the scientific community, due to differing methods, and mostly due to lack of sufficient fossil evidence. It is impossible to create a truly accurate cladogram, therefore I've put this together the best I could.\n\nThe main point of this project is to be as **complete** and **easy to read** as possible, and **available for anyone** on the internet to view. It is as accurate as I could make it, and is intended as an accessible resource for anyone to see and reference.\n\nI made this whole thing completely by myself using nothing but Google Sheets, Wikipedia, my brain, and good-old Copy+Paste. Of course I'm only human, so there's bound to be some errors. If you find something that seems wrong, let me know and I'll correct it.\n\nI want to allow this google sheet to be editable by more knowledgeable individuals than myself who can do a better job than me, but of course it has to be troll-proof, so I can't just make it open for anyone to edit.\n\nAs new discoveries and updated ways of thinking emerge I, or hopefully someone smarter, will keep this accurate and updated.\n\n\\~DON'T FORGET TO CHECK OUT THE \"README\" TAB!\\~",
        "created_utc": 1673898057,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does stunting effect height growth up to age 2 from malnutrition?",
        "author": "jake-jakejake",
        "url": "https://www.reddit.com/r/biology/comments/10dp6dm/does_stunting_effect_height_growth_up_to_age_2/",
        "text": "Also does stunting from malnutrition only effect leg length?",
        "created_utc": 1673897882,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can you create a controlled vascular injury?",
        "author": "SOMEMORONGUY",
        "url": "https://www.reddit.com/r/biology/comments/10dp1jz/how_can_you_create_a_controlled_vascular_injury/",
        "text": "Then VSMCs would migrate for remodelling...",
        "created_utc": 1673897561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Maybe a Longevity Drug Taught by Why Different Mammal Species have Different Lifespans?",
        "author": "MnMdiscord",
        "url": "https://medium.com/@Michael_Forrest/has-nature-taught-us-how-to-slow-aging-415e75a06ba3",
        "text": "",
        "created_utc": 1673896506,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey y’all I need help! I’m making a series on what certain adaptations can imply, like how sharp teeth are a common feature among predators. I made these categories but need some ideas as a stupid college student that barely passed biology 1…",
        "author": "Successful_Break_478",
        "url": "https://i.redd.it/pmluzsmzphca1.jpg",
        "text": "",
        "created_utc": 1673893906,
        "upvote_ratio": 1.0
    },
    {
        "title": "Proteins that are unable to move across the cytoplasmic membrane alone contain _________ that allows them to be transported.",
        "author": "trax143",
        "url": "https://www.reddit.com/r/biology/comments/10dn8xv/proteins_that_are_unable_to_move_across_the/",
        "text": "a) carbohydrate bridges\n\nb) amino acid signal sequences\n\nc) large, mobile flagella \n\nd) large amounts of peptidoglycan",
        "created_utc": 1673893628,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much can an earthworm survive without breathing?",
        "author": "TapAffectionate4912",
        "url": "https://www.reddit.com/r/biology/comments/10dmpc5/how_much_can_an_earthworm_survive_without/",
        "text": "So... I was reading a thread about earthworms and it reminded me of something that happened to me a few years ago: I have axolotls and I feed them Eisenia fetida. At the time, I only had 2 axolotls (now I have more than 12 lol) and one of them was younger and smaller.\n\nI feed him one whole E. fetida but, like 10-12 hours later, he vomited the worm. The weird thing is... it was still alive. You can tell the worm was partially digested because it was more pale than before, but it was moving around exactly like before being eaten. \n\nI know earthworms can survive in hostile condition for a while, but I'm pretty sure that in a stomach there's little to no oxygen and the gastric juices for sure don't help. \n\nSo... my question is: how that earthworm survived for that long? There's a chance that the stomach had, in fact, a bit of oxygen? Or does earthworms require so little oxygen that being 10-12 hours in a place where they can't breath isn't a problem? \n\nPS: gross thing that happened later... the other axolotl in the tank ate the vomited worm lol",
        "created_utc": 1673892634,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why vaccines that don't use needles could one day be the norm",
        "author": "fchung",
        "url": "https://www.salon.com/2022/12/28/why-vaccines-that-dont-use-needles-could-one-day-be-the-norm/",
        "text": "",
        "created_utc": 1673891019,
        "upvote_ratio": 1.0
    },
    {
        "title": "Metamorphic Proteins -- Proteins that can Switch Folds in an Instant",
        "author": "redhairinthesun",
        "url": "https://youtu.be/2aFVTXlXQyY",
        "text": "",
        "created_utc": 1673890991,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you use regular cotton buds in a covid test?",
        "author": "sweetlikehoney981",
        "url": "https://www.reddit.com/r/biology/comments/10dljsj/can_you_use_regular_cotton_buds_in_a_covid_test/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/10dljsj)",
        "created_utc": 1673890859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resources to learn about relative magnitudes of life?",
        "author": "sillysauce64",
        "url": "https://www.reddit.com/r/biology/comments/10dlgni/resources_to_learn_about_relative_magnitudes_of/",
        "text": "I’m a biology teacher. Kids often ask me questions about magnitude that I don’t really know enough to answer confidently. Like things like how many cells are in your body or in a specific organ. Or how many microbes we have in/on us. Or how many bases are in a single gene. On a larger scale, questions of evolution and the time/amount of individuals it takes, etc. Is there a good resource or some key search terms I can use to gain a better frame of reference for things like this? It would be awesome if there was a video series or documentary I could look at. I have seen those videos/interactive sites that zoom in and out on the smallest and largest things in the universe. But I mean more specific info.",
        "created_utc": 1673890732,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know what kind of millipede this is?",
        "author": "zweigramm",
        "url": "https://www.reddit.com/gallery/10digx2",
        "text": "",
        "created_utc": 1673885498,
        "upvote_ratio": 1.0
    },
    {
        "title": "Other fields in medicine",
        "author": "khanzb",
        "url": "https://www.reddit.com/r/biology/comments/10dh4l3/other_fields_in_medicine/",
        "text": "I want to know other fields in medicine other than Doctors and Nurses. \n\nLike PAs (Physician Associate), NPs (Nurse Practitioner) or Cardiovascular Profusionists. \n\nIs there a list/encyclopedia of such a collection? Kindly share, I want to look into all of them and decide what’s best for me. \nThanks!!",
        "created_utc": 1673882316,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me settle a biology debate!",
        "author": "No_Emphasis_8614",
        "url": "https://www.reddit.com/r/biology/comments/10dh0b2/help_me_settle_a_biology_debate/",
        "text": "My friends and I had a really interesting debate last night and I want to discuss/debate it further but can't find anything specific on the internet about it. Please use your big brains to consider.\n\nI was making the claim that a **human's physiological or survival needs** (oxygen, food, water, shelter/safety and sleep) will always trump a **human's psychological, social or cultural needs** when pushed far enough. I brought up examples of the depraved things seemingly normal humans have done throughout history during great famines, war and other desperate surival situations when they become hungry/thirsty/scared enough. There is also the basic evolutionary argument that we would evolve to ensure surivival first and fitting in second (you can't reproduce if you are dead sort of thing).\n\nAs a counter point my friends brought up examples of people committing suicide for religious, family or cultural purposes such as parents saving children, cults, suicide bombers etc etc. For some reason this suicide argument sits funny with me. Does it defeat my argument? It seems to be main counter point. \n\nWhat do you think? I am keen to hear any and all discussion. Lots of love and thank you.",
        "created_utc": 1673882029,
        "upvote_ratio": 1.0
    }
]