[
    {
        "title": "High-intensity fires do not reverse bush encroachment in an African savanna, finds study",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-high-intensity-reverse-bush-encroachment-african.html",
        "text": "",
        "created_utc": 1676536866,
        "upvote_ratio": 1.0
    },
    {
        "title": "https://youtu.be/qbF_YlxbA3c",
        "author": "Sweaty-Chemist-5927",
        "url": "https://www.reddit.com/r/biology/comments/113lppx/httpsyoutubeqbf_ylxba3c/",
        "text": "Are earthquakes a repercusions of the fast temperature changes? Especially influenced by global warming?\n\n[View Poll](https://www.reddit.com/poll/113lppx)",
        "created_utc": 1676535823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Plants call for help with a chemical employed by people as a drug",
        "author": "Vailhem",
        "url": "https://www.economist.com/science-and-technology/2023/02/15/plants-call-for-help-with-a-chemical-employed-by-people-as-a-drug",
        "text": "",
        "created_utc": 1676535146,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which",
        "author": "adepressedgoddess",
        "url": "https://www.reddit.com/r/biology/comments/113koyt/which/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/113koyt)",
        "created_utc": 1676531722,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which",
        "author": "adepressedgoddess",
        "url": "https://www.reddit.com/r/biology/comments/113khun/which/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/113khun)",
        "created_utc": 1676530928,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone help explain this to me, thanks, I feel like I’m doing something wrong",
        "author": "JDO1999",
        "url": "https://i.redd.it/avalvxjmijia1.jpg",
        "text": "",
        "created_utc": 1676530732,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Efficient Hospital Billing with Startlazaa: Simplify Your Billing Process and Streamline Your Revenue Management\"",
        "author": "startlazaa",
        "url": "https://www.startlazaa.com/importance-of-hospital-billing-software-startlazaa/",
        "text": "",
        "created_utc": 1676528576,
        "upvote_ratio": 1.0
    },
    {
        "title": "A New Era in Protein Conformational Ensemble Generation: The Role of Machine Learning",
        "author": "cbirt_",
        "url": "https://cbirt.net/a-new-era-in-protein-conformational-ensemble-generation-the-role-of-machine-learning/",
        "text": "",
        "created_utc": 1676527766,
        "upvote_ratio": 1.0
    },
    {
        "title": "WRITING SERVICE AT YOUR CONVENIENCE",
        "author": "PeterDennis76",
        "url": "https://v.redd.it/hcu8m6cjqhia1",
        "text": "",
        "created_utc": 1676527240,
        "upvote_ratio": 1.0
    },
    {
        "title": "My first Kombucha brew",
        "author": "Adenozinetry",
        "url": "https://www.reddit.com/r/biology/comments/113idas/my_first_kombucha_brew/",
        "text": "The last few months I have been growing a SCOBY in my pantry. Yes a real life living and breathing colony of organisms!  I'm currently learning about cellular respiration and how organisms convert food into ATP in my biology class and this reminded me so much about that! I've been learning a lot about how SCOBYs work and the benefits to growing them it has been very informative. I find it so interesting that they respire and eat all the sugar and caffeine they can.  They kind of sound a lot like myself lol. It makes me feel really good to be able to make something that I enjoy drinking as well as is very good for my body as a whole.  I hope that we soon learn about the human biome in class.  #CSUDHbiology",
        "created_utc": 1676523231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Research ideas",
        "author": "Excellent-Season6310",
        "url": "https://www.reddit.com/r/biology/comments/113i68f/research_ideas/",
        "text": "What would be a better research topic: antibiotic resistance or fibrosing disease treatment?",
        "created_utc": 1676522530,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recent Bio Graduate Searching for a Job",
        "author": "6ixLeafs",
        "url": "https://www.reddit.com/r/biology/comments/113hmkt/recent_bio_graduate_searching_for_a_job/",
        "text": "I graduated with a bachelor’s in science last year, with a major in Biology. Ever since I’ve been searching for a job that I think I qualify for. However, most of the positions that I’ve seen require at least 2 years of experience in the field. Even if I get an interview, I later get told that they decided to proceed with someone who was more experienced.\n\nGiven that I have almost zero experience, what would you suggest? I’ve tried connecting with recruiters on LinkedIn, but most of the time they either don’t respond or they leave a generic reply.\n\nFYI, I live near Toronto, Canada.\n\n\\*\\*Also, I'm working retail rn to pay the bills\\*\\*",
        "created_utc": 1676520723,
        "upvote_ratio": 1.0
    },
    {
        "title": "Novel method to accurately measure key marker of biological aging",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-method-accurately-key-marker-biological.html",
        "text": "",
        "created_utc": 1676519274,
        "upvote_ratio": 1.0
    },
    {
        "title": "New study identifies key success factors for large carnivore rewilding efforts",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-key-success-factors-large-carnivore.html",
        "text": "",
        "created_utc": 1676519228,
        "upvote_ratio": 1.0
    },
    {
        "title": "11 Stranded Pilot Whales Saved In Sri Lanka",
        "author": "VCardBGone",
        "url": "https://www.ndtv.com/world-news/watch-11-stranded-pilot-whales-saved-in-sri-lanka-3786619",
        "text": "",
        "created_utc": 1676518272,
        "upvote_ratio": 1.0
    },
    {
        "title": "Evolutionary Biology",
        "author": "Gossil",
        "url": "https://www.reddit.com/r/biology/comments/113g5eu/evolutionary_biology/",
        "text": "Hello! I'm not a biologist, just a layperson, but I've got a sense that the popular understanding of how evolutionary biology works is pretty flawed. Is there any book that could explain in comprehensible language how actual academics think about things like evopsych, population genetics, etc? Articles would be good too. Thanks!",
        "created_utc": 1676516072,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have questions about comas and braindeath",
        "author": "-still-alive",
        "url": "https://www.reddit.com/r/biology/comments/113fyiq/i_have_questions_about_comas_and_braindeath/",
        "text": "Sorry if this isn't the right sub in advance.\n\nDoes, if coma patient can still hear and feel everything, get an adrenaline boost, as usual, if they feel strong enough pain?\n\nCan a coma be mistaken for braindeath?\n\nAnd usually if sb is in too much pain they pass out what does a coma or braindead patient do? (I've read articles about braindead patients getting their organs removed but the brain still detected or felt every single cut.) \nCan the braindead person or coma patient feel that?\n\nI'm holding a presentation about organ donation and transplantation in ethics class that's why those questions might sound weird xd",
        "created_utc": 1676515479,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do the glycolipid, glycoproteins, and carbohydrates point to the same thing?",
        "author": "Spew_doodle",
        "url": "https://i.redd.it/ly072p9jrgia1.jpg",
        "text": "",
        "created_utc": 1676515421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do the glycolipid, glycoproteins, and carbohydrates point to the same thing?",
        "author": "Spew_doodle",
        "url": "https://i.redd.it/avqhjzt5rgia1.jpg",
        "text": "",
        "created_utc": 1676515312,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sure Shot MCQs of Strategies for Enhancement in Food Production #shorts ...",
        "author": "Zestyclose-Shirt-981",
        "url": "https://youtube.com/shorts/IqHs5Y9Lqlk?feature=share",
        "text": "",
        "created_utc": 1676513683,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think will happen",
        "author": "adepressedgoddess",
        "url": "https://www.reddit.com/r/biology/comments/113fc8s/what_do_you_think_will_happen/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/113fc8s)",
        "created_utc": 1676513595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone ELI5 this for me? It seems like a conspiracy theory, but it's apparently published in a reputable journal",
        "author": "craeftsmith",
        "url": "https://link.springer.com/article/10.1007/s11357-022-00645-w",
        "text": "",
        "created_utc": 1676513455,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Giant cell tumor of bone\" is typically full of...well...osteoclast-type giant cells! Interestingly, the background tumor spindle cells are identical to giant cell nuclei. GCT is a rare benign primary bone tumor with mutation in H3F3A histone gene! Swipe for more pics and video link below. [OC]",
        "author": "needt9379876",
        "url": "https://www.reddit.com/gallery/113f5t2",
        "text": "",
        "created_utc": 1676513052,
        "upvote_ratio": 1.0
    },
    {
        "title": "Use 'egg-producing' not 'female', say scientists in call to phase out binary language",
        "author": "Equivalent_Scar_3299",
        "url": "https://www.reddit.com/r/biology/comments/113e7tv/use_eggproducing_not_female_say_scientists_in/",
        "text": "https://www.telegraph.co.uk/news/2023/02/14/words-male-female-should-banned-science-enforce-idea-sex-binary/ article",
        "created_utc": 1676510244,
        "upvote_ratio": 1.0
    },
    {
        "title": "Use 'egg-producing' not 'female', say scientists in call to phase out binary language",
        "author": "Equivalent_Scar_3299",
        "url": "https://www.reddit.com/r/biology/comments/113e6gv/use_eggproducing_not_female_say_scientists_in/",
        "text": "The words “male” and “female” should be phased out in science because they reinforce ideas that sex is binary, scientists have suggested.\n\nCritics warn that abandoning traditional terms for the sake of inclusivity could leave science lacking precision, as well as causing confusion\nCritics warn that abandoning traditional terms for the sake of inclusivity could leave science lacking precision, as well as causing confusion\n© Provided by The Telegraph\nResearchers studying ecology and evolutionary biology should be encouraged to use terms such as “sperm-producing” or “egg producing” or “XY/XX individual” to avoid “emphasising hetero-normative views”, experts say.\n\nOther words and terms deemed problematic include man, woman, mother, father, primitive, advanced, alien, invasive, exotic, non-native and race.\n\nThe terms were gathered as part of the EEB (Ecology and Evolutionary Biology) Language Project, founded by a collaboration of scientists in the US and Canada who claim some terminology is not inclusive, and could be harmful.  \n\nEven one of the most famous scientific concepts of all time, the “survival of the fittest”, should no longer be used because it discriminates against people with disabilities and is linked to eugenics, they advise. \n\nSpeaking about the term \"fitness\" - widely used in biology to signify the success of a species in its habitat - Haley Branch, a doctoral candidate at the University of British Columbia (UBC) said: “The definition is about reproductive output, which doesn't take into account individuals that don't produce offspring.”\n\nHowever, critics warned that abandoning traditional terms for the sake of inclusivity could leave science lacking precision, as well as causing confusion. \n\nProf Frank Furedi, an education expert at the University of Kent, said: “I think that when you characterise terms like male/female, mother/father as harmful you are abandoning science for ideological advocacy.\n\n“Regardless of intent, the project of re-engineering language will cause confusion to many and the last thing that scientists need is a lack of clarity about the meaning of the words they use.”\n\nThe EEB Language Project, which was launched in this month’s Trends in Ecology and Evolution journal, is compiling a repository of “problematic” words that have been identified by scientists as harmful and suggests alternatives.\n\nFor example, they have flagged up the term “citizen science” saying it could be “harmful to non-citizens” who may feel excluded. Instead, they suggest “participant science or community science”.\n\nThe term “invasive” or “non-native species” is also deemed to be “xenophobic, anti-immigrant, and militaristic”, and could be replaced with “newly-arrived” or “nuisance species”, they suggest.  \n\nEven the phrase “double-blind” - which is often used to describe trials in which neither the participants nor scientists know if they are on a drug or placebo - has been deemed potentially offensive to those with disabilities. \n\nScience ban\nScience ban\n© Provided by The Telegraph\nOther words such as “optimisation” can be misleading, the scientists claim, because it perpetuates the idea that a species is evolving towards a defined permanent optimum.\n\nDr Danielle Ignace of UBC said: “The EEB Language Project will be a living document, as particular words that are harmful and their alternatives can change over time.\n\n“People can submit their suggestions online and have their voices heard. They can also get more involved as an individual, as an institution, or at the community level. The hope is that this grassroots effort brings people together.”\n\nThe EEB Language Project said it will “provide resources and support action to reconsider harmful terminology at the levels of individuals, institutions and broader scientific communities”.\n\nProponents of the changes say that although the use of “harmful” language is not usually intentional they warn “inadvertent harm” can arise as a result of the “inherent complexities and historical legacies of language”.\n\nChanging terminology is something that individual researchers can do to boost inclusivity at an individual level, they said. \n\nDr Kaitlyn Gaynor, an author on the paper who studies the impact of human activity on biodiversity at the university, said: “The project started as a Twitter conversation among a few people discussing potentially harmful terminology.\n\n“We reached out to different networks in ecology and evolution that were focused on increasing inclusion and equity in the field to rally support for one very specific action - revising terminology that might be harmful to certain people, particularly those from groups historically and currently excluded from science.”\n\n- Copy and pasted from The Telegraph",
        "created_utc": 1676510136,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grad programs for a dual major in biology and GIS?",
        "author": "Both_Yam_4389",
        "url": "https://www.reddit.com/r/biology/comments/113d96k/grad_programs_for_a_dual_major_in_biology_and_gis/",
        "text": "Hello! I'm a junior undergraduate student dual majoring in biology and GIS. I love both and want to work in conservation or wildlife management. I really want a job or career where I can use GIS in a biology field, such as in the national park service or US fish and wildlife. I am planning to go to graduate school, but am unsure which path to follow. I feel like a Master's in GIS is unnecessary, and that most bio programs will not utilize GIS much. I was thinking about conservation biology programs or something similar. Does anyone have experience working in these two fields and have advice for future schooling? Thank you ! &lt;3",
        "created_utc": 1676507480,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are these eggs? Got a floral bouquet delivery for v-Day and just noticed these.",
        "author": "Interesting_Cat_7470",
        "url": "https://www.reddit.com/gallery/113cnol",
        "text": "",
        "created_utc": 1676505841,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oral bacteria may increase heart disease risk: Research",
        "author": "VCardBGone",
        "url": "https://www.aninews.in/news/health/oral-bacteria-may-increase-heart-disease-risk-research20230215214813/",
        "text": "",
        "created_utc": 1676503627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dogma-defying biology",
        "author": "VCardBGone",
        "url": "https://www.axios.com/2023/02/11/biology-disordered-proteins",
        "text": "",
        "created_utc": 1676503208,
        "upvote_ratio": 1.0
    },
    {
        "title": "Microbes may play a key role in unleashing 'forever chemicals' from recycled-waste fertilizer",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-microbes-play-key-role-unleashing.html",
        "text": "",
        "created_utc": 1676503009,
        "upvote_ratio": 1.0
    },
    {
        "title": "Climate change disrupts core habitats of marine species, finds modeling study",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-climate-disrupts-core-habitats-marine.html",
        "text": "",
        "created_utc": 1676502914,
        "upvote_ratio": 1.0
    },
    {
        "title": "DNA research finds low genetic diversity among US honeybees",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-dna-genetic-diversity-honeybees.html",
        "text": "",
        "created_utc": 1676502858,
        "upvote_ratio": 1.0
    },
    {
        "title": "New research roots out solution to keeping houseplants healthy",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-roots-solution-houseplants-healthy.html",
        "text": "",
        "created_utc": 1676502801,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mining at key hydrothermal vents could endanger species at distant sites",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-key-hydrothermal-vents-endanger-species.html",
        "text": "",
        "created_utc": 1676502753,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is ''egg-producing'' a good alternative to the word ''female''?",
        "author": "zipiclyde",
        "url": "https://www.reddit.com/r/biology/comments/113bh6m/is_eggproducing_a_good_alternative_to_the_word/",
        "text": "Copypasted from the article\n\n&gt;Researchers studying ecology and evolutionary biology should be encouraged to use terms such as “sperm-producing” or “egg producing” or “XY/XX individual” to avoid “emphasising hetero-normative views”, experts say.\n\n&gt;Other words and terms deemed problematic include man, woman, mother, father, primitive, advanced, alien, invasive, exotic, non-native and race.\n\n&gt;The terms were gathered as part of the EEB (Ecology and Evolutionary Biology) Language Project, founded by a collaboration of scientists in the US and Canada who claim some terminology is not inclusive, and could be harmful.  \n\n&gt;Even one of the most famous scientific concepts of all time, the “survival of the fittest”, should no longer be used because it discriminates against people with disabilities and is linked to eugenics, they advise. \n\n&gt;Speaking about the term \"fitness\" - widely used in biology to signify the success of a species in its habitat - Haley Branch, a doctoral candidate at the University of British Columbia (UBC) said: “The definition is about reproductive output, which doesn't take into account individuals that don't produce offspring.”\n\n&gt;However, critics warned that abandoning traditional terms for the sake of inclusivity could leave science lacking precision, as well as causing confusion. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n&gt;Continue reading",
        "created_utc": 1676502734,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the limits of Germline Chimerism?",
        "author": "JackieTan00",
        "url": "https://www.reddit.com/r/biology/comments/1138h6r/what_are_the_limits_of_germline_chimerism/",
        "text": " I'm aware that it's possible to genetically engineer animal embryos to be sterile, and then inject primordial germ cells of a different species into them so that they will be able to carry that species' sperm or eggs. To my knowledge, the most distantly related species this technique has successfully been applied to are the domestic chicken and duck, the end result being a rooster that produced duck sperm and had offspring with female ducks. Chickens and ducks are thought to have diverged back in the Cretaceous about 77 million years. Meanwhile, the biotech company Colossal Biosciences plans to inject pigeon/dodo hybrid PGCs into chickens, and they're separated by about 90 million years of evolution. To put it bluntly, how much crazier than that could you realistically get?",
        "created_utc": 1676495014,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can shrimp see more colors?",
        "author": "spicylettere",
        "url": "https://www.reddit.com/r/biology/comments/1138eno/can_shrimp_see_more_colors/",
        "text": "I've always been obsessed by the idea that certain kinds of shrimp have more color receptors than we do, the way dogs have less. Does this mean that things we perceive as clear are colorful to them? The air opaque? Or does this mean that they see the same colors we do, just have an extra receptor for secondary and tertiary colors?",
        "created_utc": 1676494833,
        "upvote_ratio": 1.0
    },
    {
        "title": "Detecting rapidly mutating bacteria and viruses with AutoPLP",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-rapidly-mutating-bacteria-viruses-autoplp.html",
        "text": "",
        "created_utc": 1676492433,
        "upvote_ratio": 1.0
    },
    {
        "title": "A 'zinc' in the armor: Could metal help combat common superbug?",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-zinc-armor-metal-combat-common.html",
        "text": "",
        "created_utc": 1676492378,
        "upvote_ratio": 1.0
    },
    {
        "title": "Food coloring and anti-caking nanoparticles may affect the human gut",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-food-anti-caking-nanoparticles-affect-human.html",
        "text": "",
        "created_utc": 1676492176,
        "upvote_ratio": 1.0
    },
    {
        "title": "Targeted prenatal therapy for mothers and their babies addresses longstanding gap in health equity",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-prenatal-therapy-mothers-babies-longstanding.html",
        "text": "",
        "created_utc": 1676492126,
        "upvote_ratio": 1.0
    },
    {
        "title": "Newly discovered fungus castrates male spruce flowers",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-newly-fungus-castrates-male-spruce.html",
        "text": "",
        "created_utc": 1676492070,
        "upvote_ratio": 1.0
    },
    {
        "title": "Robo-bird teaches young zebra finches to sing",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-robo-bird-young-zebra-finches.html",
        "text": "",
        "created_utc": 1676492025,
        "upvote_ratio": 1.0
    },
    {
        "title": "Concern About Naegleria Fowleri",
        "author": "Few-Appearance8234",
        "url": "https://www.reddit.com/r/biology/comments/1137bs5/concern_about_naegleria_fowleri/",
        "text": "Hello, as the title suggests, I (22M) have been concerned these past few days about my potential exposure to Naegleria Fowleri. I was hiking in AZ to a hot spring site, and happened to get some rushing water from a small stream that appeared to originate from the hot springs themselves in my nose. I blew my nose immediately and was hocking loogies but I have been incredibly anxious ever since. This happened on Friday of last week and I have since been able to keep my active lifestyle, like  work out and attend swim practices feeling relatively normal, but I feel like I am hyping up symptoms to myself. I have felt shaky, hot, and my neck has been feeling stiff lately. I know its probably irrational and I might get hate, but I want other's opinions. Thank you.",
        "created_utc": 1676491984,
        "upvote_ratio": 1.0
    },
    {
        "title": "Freshwater plant functions can help predict ecosystem trends affected by climate change",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-freshwater-functions-ecosystem-trends-affected.html",
        "text": "",
        "created_utc": 1676491963,
        "upvote_ratio": 1.0
    },
    {
        "title": "Snakes can hear more than you think",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-snakes.html",
        "text": "",
        "created_utc": 1676491874,
        "upvote_ratio": 1.0
    },
    {
        "title": "Study reveals mystery of Paleozoic ostracod evolution",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-reveals-mystery-paleozoic-ostracod-evolution.html",
        "text": "",
        "created_utc": 1676491759,
        "upvote_ratio": 1.0
    },
    {
        "title": "Newly discovered components of Dendrolimus pini sex pheromone",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-newly-components-dendrolimus-pini-sex.html",
        "text": "",
        "created_utc": 1676491706,
        "upvote_ratio": 1.0
    },
    {
        "title": "7 new spider species discovered in caves in Israel",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-spider-species-caves-israel.html",
        "text": "",
        "created_utc": 1676491659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scientists find world's oldest European hedgehog",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-scientists-world-oldest-european-hedgehog.html",
        "text": "",
        "created_utc": 1676491574,
        "upvote_ratio": 1.0
    },
    {
        "title": "Plasmid-host manipulation discovery challenges biology textbooks",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-plasmid-host-discovery-biology-textbooks.html",
        "text": "",
        "created_utc": 1676491526,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scientists decipher how non-resistant forms of Staph aureus thwart antibiotics, almost like a superbug",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-scientists-decipher-non-resistant-staph-aureus.html",
        "text": "",
        "created_utc": 1676491404,
        "upvote_ratio": 1.0
    },
    {
        "title": "New discovery to bulk up gluten-free fiber supplement",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-discovery-bulk-gluten-free-fiber-supplement.html",
        "text": "",
        "created_utc": 1676491342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oldest fossil record of larval neuropterans found in Inner Mongolia",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-oldest-fossil-larval-neuropterans-mongolia.html",
        "text": "",
        "created_utc": 1676491284,
        "upvote_ratio": 1.0
    },
    {
        "title": "Researchers uncover new characteristics of the extinct American cheetah 'Miracinonyx'",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-uncover-characteristics-extinct-american-cheetah.html",
        "text": "",
        "created_utc": 1676491229,
        "upvote_ratio": 1.0
    },
    {
        "title": "Genetic test can detect deadly bleeding disorder in dogs",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-genetic-deadly-disorder-dogs.html",
        "text": "",
        "created_utc": 1676491145,
        "upvote_ratio": 1.0
    },
    {
        "title": "Study reveals spatial heterogeneity of diversity in two pines in subtropical Southeast Asia",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-reveals-spatial-heterogeneity-diversity-subtropical.html",
        "text": "",
        "created_utc": 1676491103,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using CRISPR-Cas9 to knock out asparagine gene in wheat to reduce cancer risk",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-crispr-cas9-asparagine-gene-wheat-cancer.html",
        "text": "",
        "created_utc": 1676491033,
        "upvote_ratio": 1.0
    },
    {
        "title": "Late Cenozoic climate cooling biogeographically shifted marine plankton communities, shows study",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-late-cenozoic-climate-cooling-biogeographically.html",
        "text": "",
        "created_utc": 1676490988,
        "upvote_ratio": 1.0
    },
    {
        "title": "Large-scale fossil study reveals origins of modern-day biodiversity gradient 15 million years ago",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-large-scale-fossil-reveals-modern-day-biodiversity.html",
        "text": "",
        "created_utc": 1676490877,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this study factual?",
        "author": "jake-jakejake",
        "url": "https://www.pnas.org/doi/full/10.1073/pnas.1802876116",
        "text": "",
        "created_utc": 1676490851,
        "upvote_ratio": 1.0
    },
    {
        "title": "Engineered magic: Wooden seed carriers mimic the behavior of self-burying seeds",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-magic-wooden-seed-carriers-mimic.html",
        "text": "",
        "created_utc": 1676490789,
        "upvote_ratio": 1.0
    },
    {
        "title": "Smoke activated seed banks found to rapidly re-establish banksia woodlands after fire",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-seed-banks-rapidly-re-establish-banksia.html",
        "text": "",
        "created_utc": 1676490741,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is gene editing and how could it shape our future?",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-gene-future.html",
        "text": "",
        "created_utc": 1676490531,
        "upvote_ratio": 1.0
    },
    {
        "title": "Insects are vanishing worldwide—now it's making it harder to grow food",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-insects-worldwidenow-harder-food.html",
        "text": "",
        "created_utc": 1676490504,
        "upvote_ratio": 1.0
    },
    {
        "title": "Insect bite marks show first fossil evidence for plants' leaves folding up at night",
        "author": "VCardBGone",
        "url": "https://phys.org/news/2023-02-insect-fossil-evidence-night.html",
        "text": "",
        "created_utc": 1676490470,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would you best describe the net or population diffusion of molecules in solution ?",
        "author": "hvneypop",
        "url": "https://www.chegg.com/homework-help/questions-and-answers/question-5-05-points-would-best-describe-net-population-diffusion-populations-molecules-so-q56916743",
        "text": "",
        "created_utc": 1676489788,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would you tell if a beached whale is still alive?",
        "author": "LegoC97",
        "url": "https://www.reddit.com/r/biology/comments/1136g2h/how_would_you_tell_if_a_beached_whale_is_still/",
        "text": "If you were to find a beached whale, what would be the tell-tale signs that it is still alive that you could observe from a distance? (For example, does a whale's underside contract and expand with its breathing?) \n\nAs a follow-up to this, what would it take to keep a whale alive for an extended period of time outside the water? I have heard it said that a beached whale typically dies because its internal organs can't handle the pressure of gravity outside of water. So in a purely hypothetical situation, how could you extend a whale's life while it is out of the water?\n\nThis is all purely hypothetical. There is no actual beached whale and I know to contact the authorities if I ever actually ran into this situation.",
        "created_utc": 1676489697,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bacteria Have Histones After All: Study",
        "author": "VCardBGone",
        "url": "https://www.the-scientist.com/news-opinion/bacteria-have-histones-after-all-study-70951",
        "text": "",
        "created_utc": 1676489585,
        "upvote_ratio": 1.0
    },
    {
        "title": "Transgender Athletes in Women's Sport - Is it Fair?",
        "author": "ProofPerformer1338",
        "url": "https://youtu.be/Ktp0ZZ9VLTI",
        "text": "",
        "created_utc": 1676488685,
        "upvote_ratio": 1.0
    },
    {
        "title": "Escaped zoo owl learns to hunt in Central Park | CNN",
        "author": "VCardBGone",
        "url": "https://www.cnn.com/videos/us/2023/02/15/central-park-escaped-owl-moos-cprog-orig-bdk.cnn",
        "text": "",
        "created_utc": 1676488652,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Are The Risks Of Bird Flu To Humans, Animals? An Explainer.",
        "author": "VCardBGone",
        "url": "https://www.ndtv.com/india-news/what-are-the-risks-of-bird-flu-to-humans-animals-an-explainer-3785135",
        "text": "",
        "created_utc": 1676486071,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Is Marburg Disease? Know Symptoms, Transmissions Rate And Treatment Options For This Ebola-Like Virus",
        "author": "VCardBGone",
        "url": "https://www.ndtv.com/health/what-is-marburg-disease-know-symptoms-transmissions-rate-and-treatment-options-for-this-ebola-like-virus-3785058",
        "text": "",
        "created_utc": 1676486031,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bird Flu Spreads To New Countries, Threatens Non-Stop \"War\" On Poultry",
        "author": "VCardBGone",
        "url": "https://www.ndtv.com/world-news/bird-flu-spreads-to-new-countries-threatens-non-stop-war-on-poultry-3785185",
        "text": "",
        "created_utc": 1676485985,
        "upvote_ratio": 1.0
    },
    {
        "title": "Forest Officer Shares Video Of How A Leopard Survives In A Tiger-Dominated Area",
        "author": "VCardBGone",
        "url": "https://www.ndtv.com/offbeat/forest-officer-shares-video-of-how-a-leopard-survives-in-a-tiger-dominated-area-3786404",
        "text": "",
        "created_utc": 1676485024,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a question for people who study evolution in humans",
        "author": "alibaba3021",
        "url": "https://www.reddit.com/r/biology/comments/1134bbg/i_have_a_question_for_people_who_study_evolution/",
        "text": "This might seem racist, but please do not think of it that way, this is purely out of curiosity. \n\nWhy do certain races of people have somewhat similar characteristics, like some African Americans have a slightly flat wide nose, with large nostrils, and large mouths, while some White Europeans have a small nostrils, and slightly smaller mouths and sometimes even different skull structure. Did humans evolve these traits as a result of their environment, like the warm climate of Africa or the cold climate of Europe?",
        "created_utc": 1676484238,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question concerning the Receptor potential",
        "author": "AlternativeLux",
        "url": "https://www.reddit.com/r/biology/comments/1133z3f/question_concerning_the_receptor_potential/",
        "text": "Hey there,  \nnormally the receptor potential is a depolarisation event (with exceptions e.g. rod cells)  resulting from an current inflow (mostly na+).  \nIs the na+ transport out of the cell after the depolarisation usually caused by the na+/k+-ATPase?  \nThanks",
        "created_utc": 1676483375,
        "upvote_ratio": 1.0
    },
    {
        "title": "Researchers use CRISPR to engineer a bacteriophage to deliver DNA into targeted members of microbial communities for precise genome editing.",
        "author": "qptbook",
        "url": "https://www.youtube.com/watch?v=SpNrNrYzBWU",
        "text": "",
        "created_utc": 1676482442,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fire ants are one of the few insects capable of building big structures above ground by connecting their bodies together. That means fire ants can be seen as a sort of material that you can test. Fire ants can build structures like Eiffel Tower-shaped structures, floating rafts and bridges.",
        "author": "thestrucguyYT",
        "url": "https://youtu.be/WvSJ63mdtRo",
        "text": "",
        "created_utc": 1676481918,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confused, conflicted and need advice",
        "author": "SkepticSalamander",
        "url": "https://www.reddit.com/r/biology/comments/11334ye/confused_conflicted_and_need_advice/",
        "text": "I'm currently pursuing a bachelors in Biotechnology in university. The commute is a bit long for me.\n\nI'm becoming much more interested in the Bioinformatics route. Would it be a wiser option to pursue an online Bachelors in Bionformatics if I want to primarily work in this field?\n\nIf so, any good affordable choices? Thank you",
        "created_utc": 1676481576,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any fun biology experiment ideas?",
        "author": "Reasonable-Ice3293",
        "url": "https://www.reddit.com/r/biology/comments/113307l/any_fun_biology_experiment_ideas/",
        "text": "I'm in grade 12 and I have a biology ISU, but instead of being told what I must look into I have been tasked with looking for an experiment, making the process to do this experiment, and writing the full report on everything I did. I can easily do all but think of an experiment to do, and I was wondering if anyone has any ideas on what I should try (I am allowed to ask for ideas as long as I create the process). I could do something basic, like putting toothpaste in a petri dish and seeing which kind has the least bacteria, or what fertilizer concentration has the best effect on plant growth, but I want to do something different and interesting, something that I would be engaged with.\n\nI have access to many chemicals and a centrifuge, as well as other basic biology tools (though I'm sadly not allowed to use multiple generations of bacteria in the dishes after I put it in I can't touch it), and I'm able to get small things we don't have for free, and I can work out the price of anything more expensive with the teacher. I also have a long time to do the experiment (a couple months) but if it does take long it can't be super labor intensive (maybe an hour a day, all at once).\n\nI'm open to looking at anything, even if I can't do it, since maybe it'll give me a new idea",
        "created_utc": 1676481247,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Animals Dream",
        "author": "Noxx422",
        "url": "https://youtu.be/2SazJB4KGyI",
        "text": "",
        "created_utc": 1676478894,
        "upvote_ratio": 1.0
    },
    {
        "title": "Squirrel in neighborhood with large pink bumps and missing fur, what’s wrong with it?",
        "author": "rootblossom",
        "url": "https://i.redd.it/dgahlwv88fia1.jpg",
        "text": "[removed]",
        "created_utc": 1676478816,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the logic behind Peanut?",
        "author": "luk_jedi",
        "url": "https://www.reddit.com/r/biology/comments/11316d3/what_is_the_logic_behind_peanut/",
        "text": "One thing that has been tormenting my thoughs for a couple years is the fact that peanut grows under the ground. Since school I was though that through evolution, plants achieves mechanisms to spread its seeds better and better: there are very light seeds that are carried by wind, there are colorful and tasty fruits wich atracct animals to eat and spread then anywhere... But peanut grows under the ground, so it's offsprings will grow close to itself, disputing space, water and light .\n\nSo, what is the evolutionary logic for a plant to start making his seeds grow under the ground? \n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/bijpw3snjdia1.png?width=612&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=ae3db5fac082e6d3eec67056d4b5a25fefaf34b6",
        "created_utc": 1676476462,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am interested to pursue a career in research in neuroscience, what should I do? Bachelors in Neuroscience or Biology?",
        "author": "MOARMYSTAYIGOT7",
        "url": "https://www.reddit.com/r/biology/comments/112zc2x/i_am_interested_to_pursue_a_career_in_research_in/",
        "text": "My friends are saying to do Bachelors in biology and then specialization in Neuroscience ( Masters/phd) in case my interest in it goes away with time.\n\nWhat is your advice?",
        "created_utc": 1676471499,
        "upvote_ratio": 0.99
    },
    {
        "title": "Enzymes in cockroach and their location.",
        "author": "Jessjudge09",
        "url": "https://www.reddit.com/r/biology/comments/112xci9/enzymes_in_cockroach_and_their_location/",
        "text": "Hello everyone\nWhat are the enzymes present in-\n1. Salivary glands\n2. Foregut\n3. Midgut\n4. Hindgut\n5. Malphigian tubules\n6. Fatty bodies\n\nThe main enzymes I am interested in finding the location of are- invertase, amylase, lipids, protease and rennin.\n\nAny tips/resources are welcome.\nThank you.",
        "created_utc": 1676465691,
        "upvote_ratio": 1.0
    },
    {
        "title": "Origin of Life according to AI chatbot",
        "author": "nakatoe",
        "url": "https://www.reddit.com/gallery/112xbkh",
        "text": "I asked an AI chatbot (by AnthropicAI) to generate some scientific theories and it came up with a hypothesis about the origin of life. What do you guys think? Does it have any merit?\n\nExcerpt:\n“Primitive protocells could have formed in shallow coastal environments with cycles of wetting and drying. The mixing of chemicals in the wet-dry cycles could have spawned simple membrane-like structures enclosing a concentrated chemical soup. Some of these protocells might have had the right combination of raw materials and physical interactions/conditions to develop basic metabolic-like processes that could harness energy to power simple growth or division.”",
        "created_utc": 1676465599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Glycolysis, Gluconeogenesis, beta-oxidation of fatty acids.",
        "author": "Jessjudge09",
        "url": "https://www.reddit.com/r/biology/comments/112xapp/glycolysis_gluconeogenesis_betaoxidation_of_fatty/",
        "text": "Hello\nCould anyone please suggest how to do the above mentioned cycles for my metabolism exam?\nAny tips/resources are welcome.\nThank you",
        "created_utc": 1676465516,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to theoretically calculate amount of product in first-order reaction?",
        "author": "Signal-Knowledge-125",
        "url": "https://www.reddit.com/r/biology/comments/112wows/how_to_theoretically_calculate_amount_of_product/",
        "text": "Hi there,\n\nI was wondering if it was possible to calculate the amount of product theoretically produced from in vivo (human) values to determine if that's the only enzyme causing the increase in amount of product. The rate of the reaction is dependent on enzyme concentration, and the Km enzym &lt;&lt; \\[product\\] (in rats at least).\n\nFrom the papers I have read, others have calculated the theoretical concentration (in rats) by: \\[product\\] = (kcat/Km) \\* \\[substrate\\] \\* \\[enzyme\\]\n\nHowever, as far as I remember Km is dependent on multiple environmental factors and Kcat can change as well.\n\nThus, I'm wondering how I could theoretically calculate it.\n\nMy questions are more this:\n\n* Can I use the Km and Kcat I found in papers for the reaction (also found in humans), but they differ greatly between papers.\n* Is the equation correct for a first-order reaction.\n* Any papers or books I can read to learn more about this?\n* Any ideas to calculate this?\n\nI also shared it on stackexchange [here](https://biology.stackexchange.com/questions/111532/how-to-theoretically-calculate-amount-of-product-in-first-order-reaction) if you'd like to reply there rather than here!\n\nThank you for reading and any ideas are welcome!",
        "created_utc": 1676463440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Packing Cell ?????",
        "author": "henryeth123",
        "url": "https://www.reddit.com/r/biology/comments/112wob7/packing_cell/",
        "text": "High school bio teacher (an interesting guy to be sure) gave my class a holiday assignment on the last day, (leaving no time to ask questions), and won't read messages. We have a list of specialised plant cells to make posters for (in short), which is all good. But the last one is a \"packing cell\" which none of us have heard of and the internet won't come up with anything, any ideas what he might be referring to?",
        "created_utc": 1676463380,
        "upvote_ratio": 1.0
    },
    {
        "title": "Humans and the things that have fascinated you about our biology and genetics.",
        "author": "MoistySaltTrader",
        "url": "https://www.reddit.com/r/biology/comments/112sl6j/humans_and_the_things_that_have_fascinated_you/",
        "text": "To start I am in no way an expert in biology I am just a curious person who likes to learn and dive into rabbit holes on the internet.\n\nI recently learned that the Shirpa located in Napal are adapted to dealing with hypobaric hypoxia that is a problem in high altitudes because they have genetics that allow for better delivery of oxygen to tissue and have a population under 20,000 which I found fascinating.\n\n I wanted to know about other really unique and benificial genetics in groups and just random people that you find really cool or fascinating.\n I know sometimes weird things can pop up like tales or webbed feet which I have family members with webbed feet and red facial hair with dark brown head hair, but I mean the deeper stuff, strange, wacky and fascinating stuff you know about.",
        "created_utc": 1676447135,
        "upvote_ratio": 1.0
    },
    {
        "title": "The skull of Dinocrocuta gigantea, a huge hyena species from the Miocene that weighed up to 400 kg",
        "author": "jacquiline3421",
        "url": "https://www.reddit.com/r/biology/comments/112sik9/the_skull_of_dinocrocuta_gigantea_a_huge_hyena/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/19wf6qxn3bia1.jpg?width=640&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=2e935c14288e444c34463a8dc09bf2e2f30c1f6d",
        "created_utc": 1676446849,
        "upvote_ratio": 1.0
    },
    {
        "title": "Neanderthal were Cooking and Eating Crabs 90,000 Years-ago, Archaeologists Say",
        "author": "davinci-code",
        "url": "https://www.guardianmag.us/2023/02/neanderthal-were-cooking-and-eating.html",
        "text": "",
        "created_utc": 1676446799,
        "upvote_ratio": 1.0
    },
    {
        "title": "What jobs can you get with a bachelors in biology?",
        "author": "SksIwannadie",
        "url": "https://www.reddit.com/r/biology/comments/112scrl/what_jobs_can_you_get_with_a_bachelors_in_biology/",
        "text": "Soon I’ll be graduating with a degree in biology and a concentration in marine biology however, I have no idea what to do. I was gonna go to graduate school but didn’t get accepted due to my lack of experience. I’m having a hard time find some biology related jobs with livable wages. Please help me",
        "created_utc": 1676446220,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would stem cells be used to stop ageing?",
        "author": "Klutzy-Peach5949",
        "url": "https://www.reddit.com/r/biology/comments/112sa53/how_would_stem_cells_be_used_to_stop_ageing/",
        "text": "The question is more so based on if somehow stem cells with the same genome as of a person could be harvested, what would be the procedure as to how they'd get those stem cells to actually work to stop ageing (e.g injected or however they'd get it to become part of the person)?",
        "created_utc": 1676445929,
        "upvote_ratio": 1.0
    },
    {
        "title": "What will happen",
        "author": "adepressedgoddess",
        "url": "https://www.reddit.com/r/biology/comments/112rz8g/what_will_happen/",
        "text": "Comment section\n\n[View Poll](https://www.reddit.com/poll/112rz8g)",
        "created_utc": 1676444715,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do night animals get vitamine D?",
        "author": "patjeduhde",
        "url": "https://www.reddit.com/r/biology/comments/112rdsm/how_do_night_animals_get_vitamine_d/",
        "text": "Title",
        "created_utc": 1676442428,
        "upvote_ratio": 1.0
    },
    {
        "title": "Human extinction",
        "author": "OkManner6985",
        "url": "https://www.reddit.com/r/biology/comments/112rbuy/human_extinction/",
        "text": "One thing for-sure that we can all agree on about extinction on Earth is that we would not be warned about it. The reason being is how sensitive we are, we would panic, kill, steal and destroy because it’s “the end of the world.” \n\nIf an earth killer asteroid was heading our way no one nor the news would warn us about it, and that’s what’s happening right now. They know what’s coming but instead of letting us know about it their selling us hope and clarity that nothing will end human civilizations. But it’s here! And you know what we should do about it? Absolutely whatever it takes to protect ourselves and that’s…NOTHING. We can’t do shit about that. You dead.",
        "created_utc": 1676442216,
        "upvote_ratio": 1.0
    },
    {
        "title": "Difference between virus through air and virus through body fluids for saliva",
        "author": "rio_katie",
        "url": "https://www.reddit.com/r/biology/comments/112qnvc/difference_between_virus_through_air_and_virus/",
        "text": "Does saliva count as ‘virus passed on through air’ or ‘virus through body fluids’",
        "created_utc": 1676439744,
        "upvote_ratio": 1.0
    },
    {
        "title": "sentido de la visión",
        "author": "Grand_Performance894",
        "url": "https://www.reddit.com/r/biology/comments/112qhp7/sentido_de_la_visión/",
        "text": "No solo vemos con los ojos y las que conformar el ojo tal y como lo conocemos a nivel de medicina. \nAl escuchar atentamente, sentir el viento, oler y conocer el entorno se puede observar incluso más agudo que las águilas.",
        "created_utc": 1676439102,
        "upvote_ratio": 1.0
    }
]