[
    {
        "title": "Jobs...",
        "author": "NeonFireFly99",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tqxxc/jobs/",
        "text": "When you get father out into the BM timeline it appears jobs get razor thin but some episodes don't address this properly.\n\nIn Nosedive there are still baristas and real estate agents. I can tell you from a media perspective on real estate in 25 years agents could just as easily meet with you for paper work and nothing else. Virtual tours of houses are only going to get more interactive and it's harder to break into the market as an agent now. \n\n3-D printed houses, look that up.\n\nBut of course labor jobs will be last to go.\n\nIn Nosedive, the main character works where??????\n\nAnd in Men of Fire while I can understand said technology, drones themselves can just be armed if it's killing operation. Eliminating the need for soldiers. \n\nWhich always leads me to ask what buddy does in History of You for work.",
        "created_utc": 1517214315,
        "upvote_ratio": ""
    },
    {
        "title": "*spoilers* The synthetic in Be Right Back.",
        "author": "NeonFireFly99",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tqvsb/spoilers_the_synthetic_in_be_right_back/",
        "text": "You can say the service is only for deceased but that's not going to stop the sex doll industry. As soon as that happened I couldn't stop talking to my girlfriend how many people would use them as slaves and be antisocial. Especially the sexual aspect. I figured he couldn't have sex. So the company that makes them HAS to have sexual users.\n\nSomething that life-like would just take over. It's not so much people would only be with synthetics but they'd be the default. Like people going on dates but having very high standards because why the hell not? And at that stage of technological progression you probably have grown children from DNA so absolutely no necessity to have relationships that's a choice now.",
        "created_utc": 1517213399,
        "upvote_ratio": ""
    },
    {
        "title": "*spoiler* Metalhead Is Less Scary When...",
        "author": "NeonFireFly99",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tquhi/spoiler_metalhead_is_less_scary_when/",
        "text": "You look at it from a North American perspective or Switzerland. In Switzerland the gun ownership is high and military training is mandatory. So these dogs wouldn't last very long. \n\nThen in some regions of Canada &amp; USO there is high gun ownership and survivalist camps. Given those conditions the autonomous dogs are rather harmless. \n\nI thought up to when the woman blew the dog's head off they were impervious to most gunfire and only the limbs could be broken with weight.\n\nThen the trackers at the end are not limitless. I'll assume the weapon on the dogs is solar powered laser but the trackers are in limited supply.\n\nFinally the night aspect. These are laughably vulnerable at night unless they hide well. Well armed search parties could routinely clear them out.\n\nSo it's only scary when you don't have guns or secure barricade. With only 2 limbs the dogs are also restricted mobility. \n\nLast though: Magnets",
        "created_utc": 1517212836,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror Rewatch [Episode Discussion] - S04E01 - USS Callister",
        "author": "Nheea",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tqirm/black_mirror_rewatch_episode_discussion_s04e01/",
        "text": "\nNo spoilers for any other episodes in this thread.\n\nIf you've seen the episode, please rate it at this [poll](https://youpoll.me/3804/). / [Results](https://youpoll.me/list/8/)\n\nWatch USS Callister on [Netflix](https://www.netflix.com/watch/80131567)\n\n\nStarring: Jesse Plemons, Cristin Milioti, Jimmi Simpson, and Michaela Coel\n\nDirector: Toby Haynes\n\nWriter: Charlie Brooker and William Bridges\n\nYou can also chat about [USS Callister](https://discord.gg/pDACsRv) in our [Discord server](https://discord.gg/6U5SshM)!\n\n\n[Previous S4E1 episode discussion](https://www.reddit.com/r/blackmirror/comments/7mrqcz/black_mirror_episode_discussion_s04e01_uss/)",
        "created_utc": 1517208274,
        "upvote_ratio": ""
    },
    {
        "title": "What the babysitter saw in the garage. Tony had no idea why he killed his friend.",
        "author": "ivana992",
        "url": "http://mynutriday.com/uncategorized/babysitter-saw-garage-tony-no-idea-killed-friend/",
        "text": "",
        "created_utc": 1517206858,
        "upvote_ratio": ""
    },
    {
        "title": "This show is what keeps me up at night",
        "author": "jtbjtb123",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tq816/this_show_is_what_keeps_me_up_at_night/",
        "text": "Just watched season 1 and most of season 2 and it’s amazing and I love it, but I’m kept up over how royally fucked up it is. \nLike today I woke up around 2 or so hours after going to sleep with the song from 15 mMillion Merits and White Christmas playing in my head with a faint view of the egg introduction in White Christmas. \nI love this show but it’s so utterly messed up. ",
        "created_utc": 1517204627,
        "upvote_ratio": ""
    },
    {
        "title": "[spoilers] my thoughts on Black Museum",
        "author": "MrWolf451",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tq61d/spoilers_my_thoughts_on_black_museum/",
        "text": "So, Clayton is arrested for the murder of that weather reporter. Her body was found mutilated. I wonder if perhaps the doctor who loves pain got to her since it's heavily implied that Clayton was wrongfully accused. Maybe the bum on the street wasn't his first kill, just the first time he got caught... Also, i wanted so bad to learn that Carrie, the poor lady in the monkey, was able to have her consciousness transferred to san junipero.",
        "created_utc": 1517203987,
        "upvote_ratio": ""
    },
    {
        "title": "I'm sure this has been said so many times already and I know there's an episode specific thread, but I really just wanted to ventilate. [Spoilers]",
        "author": "gervaistweet",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tq4tc/im_sure_this_has_been_said_so_many_times_already/",
        "text": "Hang the DJ. Wow. Georgina Campbell as Amy... I was absolutely enamored and felt so much for Frank.. THEIR CHEMISTRY IS SO BEAUTIFUL, ALMOST AS BEAUTIFUL AS THEY BOTH ARE. \n\nReally though, the episode was seriously special to me and not just as an episode of Black Mirror. I was so touched by it, especially those last couple of scenes and that final act of rebellion. \n\nI don't consider myself a romantic or a fan of hokey pokey stuff, but the performance of those two really took me somewhere else. I was so invested in their plights, not just as romantic partners, but as people who were just trying to figure it out \n\nAgain, seriously smitten by Georgina Campbell though. Can't say it enough. She and Joe Cole are something else",
        "created_utc": 1517203602,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror with \"Maps\" Idea?",
        "author": "SweetTea742",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tptsp/black_mirror_with_maps_idea/",
        "text": "I don't know if this happens to anyone else in other parts of the world, but, where I'm from, Google Maps, Waze etc will _sometimes_ direct you to the *wrong* location. It is annoying, sometimes scary and extremely inconvenient, especially when you're alone and lost.\n\nWon't that be a cool idea for Black Mirror though? A \"location app\" that _intentionally_ takes users to the wrong location for some sinister outcome? ",
        "created_utc": 1517200149,
        "upvote_ratio": ""
    },
    {
        "title": "Possible Future Episode Plot",
        "author": "Kinglens311",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tpph8/possible_future_episode_plot/?utm_source=ifttt",
        "text": "",
        "created_utc": 1517198979,
        "upvote_ratio": ""
    },
    {
        "title": "Possible Future Episode Plot",
        "author": "sadboiultra",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tpph8/possible_future_episode_plot/",
        "text": "I was rewatching White Christmas today and the overarching story about John Hamms character getting blocked by the entire world got me thinking. In the Black Mirror universe, when you are legally blocked by someone, you can’t see them until the person either reverses it or they die (i.e, the third story from White Christmas). I think an interesting future episode of Black Mirror could be about a man put on the registry and is blocked by the entire world, goes insane from the isolation, and becomes a serial killer for the sole purpose of being able to see human faces again.\n\nEdit: I love all the comments under this post speculation is always fun. In response to some of the comments, I don’t think Black Mirror always has to leave us with questions. Think about the episode Men Against Fire. It was a critique on how abusing technology can blur the lines morally for soldiers and the public. The hypothetical  episode’s overarching theme could be about the prison system in America and other first world countries. Not very sure about the exact statistics but a whole lot of inmates who are set free return to a life of crime because they weren’t properly reintroduced into normal society in life (the analogy in the episode being that the prisoner can’t be normal again because he can’t see anyone for who they are). At the end of the day, is being free even worth it if you can’t interact with the world around you? The man in question can’t see or hear anyone, physically or even mentally (the block distorts memories because the zed-eyes record everything) and he couldn’t even have the privilege of masturbating because the actors would be blocked (can’t enjoy hentai either because the voice overs would be blocked too). Its a ripe breeding ground for insanity and it would be a direct result of the block. You could even throw in opposition to the punishment throughout the episode.\n\nLiterally just thought of this: you can’t take out the zed-eyes because it will kill you so the end of the episode could be the main character hiding from the international manhunt that inevitably will occur and kill himself trying to take the tech out of his head, similarly to what happened in The Entire History of You. ",
        "created_utc": 1517198873,
        "upvote_ratio": ""
    },
    {
        "title": "They are becoming self-aware...",
        "author": "Hidrog",
        "url": "https://www.reddit.com/r/SubredditSimulator/comments/7tia0l/we_live_in_a_picture/?utm_source=reddit-android",
        "text": "",
        "created_utc": 1517197920,
        "upvote_ratio": ""
    },
    {
        "title": "Quick Connection.",
        "author": "Jakey_A",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tpmbk/quick_connection/",
        "text": "While watching the episode \"Men Against Fire\" I noticed that when they're interrogating the religious man that hid the Roaches, that one of the girls(Blonde one I think) is singing the same song as the girl in Five Million Merits. I honestly don't know if any else has noticed this but uh huh yeah! \n\nP.S. I know that the  device in U.S.S Callister, is the same in San Junipero.",
        "created_utc": 1517197897,
        "upvote_ratio": ""
    },
    {
        "title": "The veteran in me hates the unit in Men Against Fire",
        "author": "redooo",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tp5kb/the_veteran_in_me_hates_the_unit_in_men_against/",
        "text": "**Bullshit up top, real talk at the bottom**\n\nReally, guy? First you're going to do a room clearing totally solo while your squadmate is in a totally different part of the house? I guess we just want to get fucked up, huh? Then, after you get attacked since you fucking wandered off without your battle buddy, you decide to leave the weird, unidentified weapon being used against you at the scene? No AAR? Didn't seem like something higher should know about?\n\nTHEN, when you DO report the suspicious noiseweapon to the doc, he also doesn't give a shit. Guess that reflects why the unit is ass up. I shouldn't be surprised that the leadership sucks, ol girl left her weapon pointed at the civilian even after the LT told her to drop it. Rot starts at the top.\n\nThen, we come upon not only a bunch of the noiseweapons, but a fucking SCHEMATIC apparently detailing how it affects your brain - not gonna call that up either. Guess that was for the best since now you're woke, but still. After all that - LT getting smoked, battle buddy going nuts, knocking you out, and saving roaches by stealing the HMMWV - ol girl decides to set out on her own to finish the job, instead of linking back up with the unit. You don't maybe want some support? RECKLESS motherfucker.\n\n******\n\nSeriously though, this episode was incredible. A real look at how to get around the pesky morality issue that troops have. It's a world without war crimes. Plus, the commentary about what might be waiting for you when you get back from the shit - a run-down house and a whole lotta nothing.",
        "created_utc": 1517192904,
        "upvote_ratio": ""
    },
    {
        "title": "Found this on ask reddit. What you think? cto.",
        "author": "sheenaleven",
        "url": "https://i.redd.it/vdgd6g1qmwc01.jpg",
        "text": "",
        "created_utc": 1517187116,
        "upvote_ratio": ""
    },
    {
        "title": "The “White Bear” question: who am I supposed to be disgusted more with ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tncx8/the_white_bear_question_who_am_i_supposed_to_be/",
        "text": "[deleted]",
        "created_utc": 1517175828,
        "upvote_ratio": ""
    },
    {
        "title": "Fill the BM void with this bizarre Cold War scifi, went viral on youtube, on Io9.gizmodo",
        "author": "RakanishuLives",
        "url": "https://io9.gizmodo.com/a-real-life-historical-mystery-gets-a-thrilling-scifi-t-1821991287",
        "text": "",
        "created_utc": 1517175259,
        "upvote_ratio": ""
    },
    {
        "title": "Simpsons did Arkangel first.",
        "author": "TheSeansei",
        "url": "https://youtu.be/cYRsHWm4yGI",
        "text": "",
        "created_utc": 1517174395,
        "upvote_ratio": ""
    },
    {
        "title": "Just waiting for this little child to be thrown into outer space while his father watches",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/interestingasfuck/comments/7tlchn/an_8_year_olds_microbiological_handprint_after/?utm_source=reddit-android",
        "text": "[deleted]",
        "created_utc": 1517173819,
        "upvote_ratio": ""
    },
    {
        "title": "Electric Dreams?",
        "author": "disposable_account01",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tmzi0/electric_dreams/",
        "text": "[removed]",
        "created_utc": 1517172485,
        "upvote_ratio": ""
    },
    {
        "title": "The blender models in the Arkangel episode get progressively worse as time goes on.",
        "author": "ELOadminHELL",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tmkn5/the_blender_models_in_the_arkangel_episode_get/",
        "text": "They start off with this nice looking silver one. Then when Sara is in middle school they have a different blender that still looks okay, but definitely looks worse/cheaper than the silver one. By the end of the episode, they've switched to one of those garbage $20 as-seen-on-TV bullet blender things.\n\nC'mon, Marie. Didn't Russ teach you that you get what you pay for before he died?",
        "created_utc": 1517168924,
        "upvote_ratio": ""
    },
    {
        "title": "Starting to watch, which episode do you recommend I start off with so I don’t have a bid first impression?",
        "author": "GeekyNerd_FTW",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tmioe/starting_to_watch_which_episode_do_you_recommend/",
        "text": "Also, is each episode its own story or do I need to watch in chronological order?",
        "created_utc": 1517168463,
        "upvote_ratio": ""
    },
    {
        "title": "Showing my husband ‘White Christmas’",
        "author": "PurpleThirteen",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tmgzt/showing_my_husband_white_christmas/",
        "text": "So far he’s seen:\n\nShut up and dance: ‘There’s no real ending - we don’t find out what happened to him’\n\nWhite bear: ‘better but still no real closure’\n\n\nI think he’s expecting a Disney ‘happily ever after’ kind of ending.\n\nPerhaps I should show him San Junipero?! \n\nWill keep you updated what he comments re: White Christmas.\n\n\nEdit 1... quite a long way in now. We’ve met Beth. No comments so far. Watching vividly. ",
        "created_utc": 1517168062,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone thinking what I'm thinking...",
        "author": "nrm2202",
        "url": "https://i.redd.it/0gmr9zv3quc01.jpg",
        "text": "",
        "created_utc": 1517164037,
        "upvote_ratio": ""
    },
    {
        "title": "One of the most intense Black Mirror scenes so far",
        "author": "BlendeLabor",
        "url": "https://youtu.be/iWGFjtFqAKk",
        "text": "",
        "created_utc": 1517160469,
        "upvote_ratio": ""
    },
    {
        "title": "Possible future black mirror episode?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskReddit/comments/7tibq8/what_options_would_come_up_if_you_could/?utm_source=reddit-android",
        "text": "[deleted]",
        "created_utc": 1517159261,
        "upvote_ratio": ""
    },
    {
        "title": "This AskReddit thread reminded me of BM.",
        "author": "novapr0spekt",
        "url": "https://np.reddit.com/r/AskReddit/comments/7tibq8/what_options_would_come_up_if_you_could",
        "text": "",
        "created_utc": 1517157822,
        "upvote_ratio": ""
    },
    {
        "title": "In “Black Museum” (S4:E6), there is a mugshot of a man named Joel Collins - production designer of season 4",
        "author": "[deleted]",
        "url": "https://i.redd.it/zjagxufq1uc01.jpg",
        "text": "[deleted]",
        "created_utc": 1517155842,
        "upvote_ratio": ""
    },
    {
        "title": "\"Black Museum\" takes two ideas from Karl Pilkington (from Idiot Abroad, Ricky Gervais Podcast) [spoilers]",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tl119/black_museum_takes_two_ideas_from_karl_pilkington/",
        "text": "[deleted]",
        "created_utc": 1517155334,
        "upvote_ratio": ""
    },
    {
        "title": "INSTALL ANDROID APPLICATION ON YOUR PC | Be Technical",
        "author": "shoaibi666",
        "url": "https://www.youtube.com/watch?v=pg3UeqpqFBk&amp;t=23s",
        "text": "",
        "created_utc": 1517153085,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirrot Season 4 has Real Life Implications and it is Terrifying. *SPOILERS*",
        "author": "JanelleFassi12",
        "url": "https://www.theodysseyonline.com/black-mirror-back-and-bleaker-than-ever",
        "text": "",
        "created_utc": 1517149313,
        "upvote_ratio": ""
    },
    {
        "title": "[S2E2] When you REALLY hate upgrading your phone",
        "author": "SkullTune",
        "url": "https://i.redd.it/htpnvhqqftc01.jpg",
        "text": "",
        "created_utc": 1517148445,
        "upvote_ratio": ""
    },
    {
        "title": "I'll clear up 15MM",
        "author": "Ihatethewayyoutalk",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tk7z8/ill_clear_up_15mm/",
        "text": "Regarding the world they live in. Seen the episode many times through the years, one of my favorites. It was a recent viewing that I caught something that helps explain their situation.  \n\nWhen Bing meets Abby he mentions something about her being new and she tells him that she just turned 21. When he mentions he got all of his merits from his late brother, she asks him why doesn't he just buy a new MOS. MOS is military talk for the kind of job you perform. She also mentioned something about her sister being in a different branch of the military in a different location. \n\nSo this world seems to be a kind of military conscription, perhaps for an outside world that has energy problems. Notice how everyone on the bikes seems relatively young?\n\nThe question that has always entered my mind about the episode is, at the very end when he's looking out the \"windows\" , it's possible he could just be looking at screens. ",
        "created_utc": 1517145996,
        "upvote_ratio": ""
    },
    {
        "title": "Hang the DJ...hang the DJ....",
        "author": "Sonshine9",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tk6w0/hang_the_djhang_the_dj/",
        "text": "[removed]",
        "created_utc": 1517145560,
        "upvote_ratio": ""
    },
    {
        "title": "Searched black mirror on YouTube and end up getting tons of news blooper vids recommended to me",
        "author": "AntwithWings",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tk1ag/searched_black_mirror_on_youtube_and_end_up/",
        "text": "YouTubes recommendation system getting more and more subtle these days",
        "created_utc": 1517143289,
        "upvote_ratio": ""
    },
    {
        "title": "BLACK MIRRORS COMING TO LIFE!!!!",
        "author": "[deleted]",
        "url": "https://instagram.com/p/BedEFulHrBT/",
        "text": "[deleted]",
        "created_utc": 1517142215,
        "upvote_ratio": ""
    },
    {
        "title": "BIG ANNOUNCEMENT!",
        "author": "[deleted]",
        "url": "http://vvboutiquestyle.blogspot.com/2015/03/big-announcement.html",
        "text": "[deleted]",
        "created_utc": 1517141234,
        "upvote_ratio": ""
    },
    {
        "title": "Sweet Jesus, Nosedive is horribly uncomfortable!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tjvau/sweet_jesus_nosedive_is_horribly_uncomfortable/",
        "text": "[deleted]",
        "created_utc": 1517140588,
        "upvote_ratio": ""
    },
    {
        "title": "Fans of Black Mirror and Inside No.9 should watch Psychoville.",
        "author": "IKindaLostMyHat",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tju7q/fans_of_black_mirror_and_inside_no9_should_watch/",
        "text": "It feels like an extremely long episode of black mirror since there are a couple seasons, but it does provide the same feel that a Black Mirror episode provides!",
        "created_utc": 1517140079,
        "upvote_ratio": ""
    },
    {
        "title": "Think we can simulate reddit users who have posted enough content?",
        "author": "WarAndGeese",
        "url": "https://www.reddit.com/r/SubredditSimMeta/comments/7tji94/are_there_any_bots_that_can_act_as_user_simulators/",
        "text": "",
        "created_utc": 1517135797,
        "upvote_ratio": ""
    },
    {
        "title": "How to Completely Customize Your Android Smartphone (No Root) 2017 | MS Tech",
        "author": "shoaibi666",
        "url": "https://www.youtube.com/watch?v=xaqTs_9sgak&amp;t=27s",
        "text": "",
        "created_utc": 1517134876,
        "upvote_ratio": ""
    },
    {
        "title": "A Black Mirror tribute",
        "author": "ShriekingWanderer",
        "url": "https://www.youtube.com/attribution_link?a=qmUnvmiA_I0&amp;u=%2Fwatch%3Fv%3DniTLi-OeHyU%26feature%3Dshare",
        "text": "",
        "created_utc": 1517129725,
        "upvote_ratio": ""
    },
    {
        "title": "Hello everyone, as a new online store, we are looking for new customers, so we are giving away 100 pcs of these amazing leather watches, for the price of 0$. Pay only shipping and get a new watch. We'd appreciate a honest review.",
        "author": "alex400001198",
        "url": "http://win4review.blogspot.com/2018/01/hello-everyone-as-new-online-store-we.html",
        "text": "",
        "created_utc": 1517129451,
        "upvote_ratio": ""
    },
    {
        "title": "Tuckers in SteamVR. What’s the connection?",
        "author": "tzmau5",
        "url": "https://i.redd.it/tevcxdsdirc01.jpg",
        "text": "",
        "created_utc": 1517125118,
        "upvote_ratio": ""
    },
    {
        "title": "It's been a month since the 4th season release, tomorrow we're going to start a rewatch.",
        "author": "Nheea",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tix02/its_been_a_month_since_the_4th_season_release/",
        "text": "Also, the original discussions for the episodes will be locked since they have way too many comments right now.\n\n\nWe need your input. How would you like to do the rewatch? One episode/week or more often?",
        "created_utc": 1517124162,
        "upvote_ratio": ""
    },
    {
        "title": "It's been a month from the 4th season release, tomorrow we're going to start a rewatch.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tiwvh/its_been_a_month_from_the_4th_season_release/",
        "text": "[removed]",
        "created_utc": 1517124110,
        "upvote_ratio": ""
    },
    {
        "title": "Eternal Sunshine of the Spotless Mind",
        "author": "Thugshrugshrach",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tiuk2/eternal_sunshine_of_the_spotless_mind/",
        "text": "The Eternal Sunshine is the Spotless Mind very  could have been an episode of Black Mirror",
        "created_utc": 1517123160,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror Episode Idea",
        "author": "merryprankster88",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tirjl/black_mirror_episode_idea/",
        "text": "Teleporters are now available for public use. The individual can teleport anywhere almost instantly; however, the person is cloned and a copy is transported to the desired destination. The original person is transported to an unending hell.  When the copy dreams at night, he or she experiences the original persons hellish experience.",
        "created_utc": 1517121926,
        "upvote_ratio": ""
    },
    {
        "title": "Question for a nervous watcher",
        "author": "samcarrigan",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tip3n/question_for_a_nervous_watcher/",
        "text": "Hiya. I have heard great things about black mirror, and think I'd like it, but am concerned about one thing. I've seen a handful of episodes with friends (uss mccallister, nosedive, and 15 million credits) and I liked them well enough. But from what I hear, the show can get really dark, and sometimes have rather depressing endings. I liked how (small spoiler) uss mcallister had a happy ending, and I'm wondering if that's common or more an exception. I watch stuff to de-stress after a long day and get ready for bed. I'm fine if the show is stressful, as long as it relieves it in the end. Is black mirror right for me?",
        "created_utc": 1517120918,
        "upvote_ratio": ""
    },
    {
        "title": "Watch please",
        "author": "shoaibi666",
        "url": "https://www.dailymotion.com/video/x6dthg5",
        "text": "",
        "created_utc": 1517120682,
        "upvote_ratio": ""
    },
    {
        "title": "Episode idea - \"Yelp\" for people",
        "author": "BittyMcBitBit",
        "url": "https://www.reddit.com/r/blackmirror/comments/7til3f/episode_idea_yelp_for_people/",
        "text": "Branching off of the \"Nosedive\" episode of people rating each other 5 stars - I'd be curious to see this idea explored further. Particularly, if the rating had more behind it, like the user reviews that Yelp has. Imagine being a woman on a first date with a man, and she goes into the bathroom to \"freshen up\", but instead she quickly scans the guy's reviews and notices words in reviews from past roommates and coworkers like \"controlling\" and \"brash\" and \"future abusive husband\". The protagonist might be a man with a frat-boy past that he's matured out of, but can't escape because the permanent online reviews label him in a negative light.\n\nWas just thinking about how enough bad Yelp reviews can tarnish a business, but what if that applied to individual people. Could be interesting to explore.",
        "created_utc": 1517119383,
        "upvote_ratio": ""
    },
    {
        "title": "Too Good At Goodbyes - the song and the video encapsulate so much of Hang The DJ that I just had to share it here",
        "author": "GTFOUSA",
        "url": "https://www.youtube.com/watch?v=J_ub7Etch2U",
        "text": "",
        "created_utc": 1517117164,
        "upvote_ratio": ""
    },
    {
        "title": "All Black Mirror Episodes, ranked by Reddit comments",
        "author": "sparkguitar50",
        "url": "http://blog.seangransee.com/2018/01/all-black-mirror-episodes-ranked-by-reddit-comments/",
        "text": "",
        "created_utc": 1517116917,
        "upvote_ratio": ""
    },
    {
        "title": "Instant apps",
        "author": "shoaibi666",
        "url": "https://youtu.be/dBJrYdjfNlE",
        "text": "",
        "created_utc": 1517115574,
        "upvote_ratio": ""
    },
    {
        "title": "Beautifully haunting Black Mirror tribute",
        "author": "rick_almes",
        "url": "https://youtu.be/NObuczVba5g",
        "text": "",
        "created_utc": 1517114812,
        "upvote_ratio": ""
    },
    {
        "title": "What would it take for you to allow your consciousness to be put into a stuffed animal?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ti786/what_would_it_take_for_you_to_allow_your/",
        "text": "[deleted]",
        "created_utc": 1517114547,
        "upvote_ratio": ""
    },
    {
        "title": "Would you like to see supernatural elements incorporated in future seasons?",
        "author": "alternateaccountZ",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ti5lr/would_you_like_to_see_supernatural_elements/",
        "text": "Some of the tech presented in episodes (USS Callister) is a stretch beyond anything arguably ever real, do you think it would be out of the realm for Black Mirror to just go ahead on focus on some pure supernatural or fantasy elements in future episode installments? ",
        "created_utc": 1517113974,
        "upvote_ratio": ""
    },
    {
        "title": "Upgraded Simulation",
        "author": "On_The_Warpath",
        "url": "http://i.imgur.com/EtJVGhg.gifv",
        "text": "",
        "created_utc": 1517113463,
        "upvote_ratio": ""
    },
    {
        "title": "This sounds good to everyone... except people who have watched Black Mirror",
        "author": "Carter2158",
        "url": "https://twitter.com/mindblown47/status/956910313277968386",
        "text": "",
        "created_utc": 1517111351,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror is the most popular Netflix show in only one US state...",
        "author": "bunshido",
        "url": "https://www.thrillist.com/news/nation/most-popular-netflix-show-in-every-state-map",
        "text": "",
        "created_utc": 1517110747,
        "upvote_ratio": ""
    },
    {
        "title": "Metal Head-lets talk about the house",
        "author": "pocketfullofcrap",
        "url": "https://www.reddit.com/r/blackmirror/comments/7thvur/metal_headlets_talk_about_the_house/",
        "text": "Can someone give your opinion on the house that she found and why you think the people killed themselves? It didn't seem as if any dogs got to them before this scenario and they lived so  close to the warehouse where all the dogs are anyway. So any thoughts on how this is pieced into this \"world/context\" because i refuse to believe it's just a deus ex machina thing",
        "created_utc": 1517110738,
        "upvote_ratio": ""
    },
    {
        "title": "What concept would you like to see revisited in a future episode?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7thn0x/what_concept_would_you_like_to_see_revisited_in_a/",
        "text": "[deleted]",
        "created_utc": 1517107877,
        "upvote_ratio": ""
    },
    {
        "title": "mindblowing Black Mirror tribute",
        "author": "[deleted]",
        "url": "https://youtu.be/NObuczVba5g",
        "text": "[deleted]",
        "created_utc": 1517106627,
        "upvote_ratio": ""
    },
    {
        "title": "My predictions for Season 4 Before watching it. (By seeing the names)",
        "author": "polterion",
        "url": "https://www.reddit.com/r/blackmirror/comments/7thcwo/my_predictions_for_season_4_before_watching_it_by/",
        "text": "U.S.S Callister : Humanity Reaches another galaxy but there are bad monsters and they kill humanity or smth\n\nArkangel: You can buy a robot that gives you protection and love (GOES WRONG)\n\nCrocodile: self aware vaccums crocodile shaped that ends up eating a baby\n\nMetalhead: Some VR fucked up shit, \n\nHang the DJ: Music is created magically with some sorta robot. So DJ's kill themselves\n\nBlack Museum: a cool episode which gets you back to everything that happened on season 3 2 and 1.\n\n",
        "created_utc": 1517104792,
        "upvote_ratio": ""
    },
    {
        "title": "Wow",
        "author": "lamacode88",
        "url": "https://youtu.be/K98RxwToCjI",
        "text": "",
        "created_utc": 1517100838,
        "upvote_ratio": ""
    },
    {
        "title": "Did you catch any of these Easter Eggs from season 1-4?",
        "author": "[deleted]",
        "url": "https://youtu.be/K98RxwToCjI",
        "text": "[deleted]",
        "created_utc": 1517100235,
        "upvote_ratio": ""
    },
    {
        "title": "A Black Mirror tribute",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=Emhdi6CU2s8",
        "text": "[deleted]",
        "created_utc": 1517099811,
        "upvote_ratio": ""
    },
    {
        "title": "What is the general consensus of episode 1? Good or terrible?",
        "author": "RobertFeller19",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tgacp/what_is_the_general_consensus_of_episode_1_good/",
        "text": "I just finished it and i cannot believe the decisions in the episode. It was unrealistic but it seems like a lot disagree with that. Before i continue does the show only get better from here?",
        "created_utc": 1517093828,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone want a more...\"Connected\" approach for season 5?",
        "author": "m62259",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tg8xg/anyone_want_a_moreconnected_approach_for_season_5/",
        "text": "Like some serialized plot or narrative spanning all the stories, something like pulp fiction, where all the stories take place in the same universe, and happen around eacth other....what do you think?",
        "created_utc": 1517093452,
        "upvote_ratio": ""
    },
    {
        "title": "BM fans, would you recommend the movie Her?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tg830/bm_fans_would_you_recommend_the_movie_her/",
        "text": "[removed]",
        "created_utc": 1517093221,
        "upvote_ratio": ""
    },
    {
        "title": "USS Callister",
        "author": "jl250",
        "url": "https://i.redd.it/ft1y30uinoc01.jpg",
        "text": "",
        "created_utc": 1517090527,
        "upvote_ratio": ""
    },
    {
        "title": "Found this little clock at my friends house and it reminded me of something",
        "author": "yourpetcows",
        "url": "https://i.redd.it/qmwyuq8smoc01.jpg",
        "text": "",
        "created_utc": 1517090292,
        "upvote_ratio": ""
    },
    {
        "title": "Just finished watching 'Metalhead' and...",
        "author": "Reshuffle",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tfsog/just_finished_watching_metalhead_and/",
        "text": "Like many others it left me wanting the backstory/ more stories from this world, however aside from fanfiction I doubt we'll ever get any. \n\nSo instead I'm looking for book/movie/tv show recommendations that have a similar theme to Metalhead - specifically dystopian robot uprising in which the humans are screwed. Any suggestions welcome!\n\n",
        "created_utc": 1517089123,
        "upvote_ratio": ""
    },
    {
        "title": "Just watched \"Metalhead\" and realised I grew up near the filming location. Google map pics in album. Meldon Quarry, Okehampton, Devon, UK.",
        "author": "on_the_night",
        "url": "https://imgur.com/gallery/9GJiQ",
        "text": "",
        "created_utc": 1517088249,
        "upvote_ratio": ""
    },
    {
        "title": "Hmmm",
        "author": "ratchet-hatchet",
        "url": "https://i.redd.it/2m03cquo7mc01.jpg",
        "text": "",
        "created_utc": 1517087350,
        "upvote_ratio": ""
    },
    {
        "title": "Your keyboard layout does not apply to me (Arkangel)",
        "author": "Clawz114",
        "url": "https://gfycat.com/GiddyBeneficialCowbird",
        "text": "",
        "created_utc": 1517081759,
        "upvote_ratio": ""
    },
    {
        "title": "Is Black Mirror the heir of The Twilight Zone?",
        "author": "Gobul-Glargz",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tewut/is_black_mirror_the_heir_of_the_twilight_zone/",
        "text": "What do you guys think about that?",
        "created_utc": 1517081057,
        "upvote_ratio": ""
    },
    {
        "title": "[S02E04][EASTER EGG] In the first shot of the epispde...",
        "author": "NerfherderTheGreat",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tetju/s02e04easter_egg_in_the_first_shot_of_the_epispde/",
        "text": "[removed]",
        "created_utc": 1517080242,
        "upvote_ratio": ""
    },
    {
        "title": "New to the show and loving it!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ter2o/new_to_the_show_and_loving_it/",
        "text": "[deleted]",
        "created_utc": 1517079648,
        "upvote_ratio": ""
    },
    {
        "title": "Black Museum review with easter eggs. What did you guys think of the episode? Might be my favorite ever.",
        "author": "sweetoothsteve",
        "url": "https://www.youtube.com/watch?v=kGauZGpZseE",
        "text": "",
        "created_utc": 1517077602,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror: Ep.4 \" I'll Be Right Back\" Review (Spoilers) — Steemit",
        "author": "mykosonai",
        "url": "https://steemit.com/fiction/@mykos/black-mirror-ep-4-i-ll-be-right-back-review-spoilers",
        "text": "",
        "created_utc": 1517075269,
        "upvote_ratio": ""
    },
    {
        "title": "San Junipero in the Cinema...",
        "author": "UsedDrive",
        "url": "https://www.reddit.com/r/blackmirror/comments/7te2g4/san_junipero_in_the_cinema/",
        "text": "Would be fucking amazing. Not a movie version, just the episode with the soundtrack playing on those speakers... Fuck yes.",
        "created_utc": 1517073928,
        "upvote_ratio": ""
    },
    {
        "title": "[Spoilers] Hang the DJ, Be Right Back, and San Junipero makes a nice themeatic trilogy",
        "author": "karatemanchan37",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tdw41/spoilers_hang_the_dj_be_right_back_and_san/",
        "text": "Each of them was really a love story and how technology affects our relationship with others. Watch it in the order described above and you get a cool arc:\n\n**Hang the DJ:**  Technology copies our personality and behaviors in a simulated world to help two soulmates find each other. At this time, there is still a distinction between the virtual world and the real world. Love is something you have to fight for, to rebel against. \n\n**Be Right Back:** Tragedy strikes our soulmates. One partner desperately tires to make things right by using bringing the simulated technology into the world, but it doesn't stick. Love and relationships is irreplacable, no matter how good our copy is. \n\n**San Junipero:** Technology has now successfully integrated our virtual and real worlds by allowing us to \"live\" inside a cloud. Our partner, still quietly dealing with her grief, successfully moves on when she finds love again. Love helps us move on and gives us second chances.",
        "created_utc": 1517072658,
        "upvote_ratio": ""
    },
    {
        "title": "Nokia 2 Unboxing and Full Review IN Urdu/Hindi |MS Tech",
        "author": "shoaibi666",
        "url": "https://www.youtube.com/watch?v=tLIePHQ1Xn4&amp;t=7s",
        "text": "",
        "created_utc": 1517067971,
        "upvote_ratio": ""
    },
    {
        "title": "Still more emotions than monkey",
        "author": "Blueskiesbrowneyes",
        "url": "https://v.redd.it/ntv2517ohmc01",
        "text": "",
        "created_utc": 1517064937,
        "upvote_ratio": ""
    },
    {
        "title": "As a newcomer to black mirror, Would shut up and dance be a good starter.",
        "author": "fnnstgrmm",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tcua4/as_a_newcomer_to_black_mirror_would_shut_up_and/",
        "text": "shut up and dance is my favourite episode out of the lot, mainly because of the shock factor throughout the whole episode and the twist!!! i thought it would be a good introductory episode for one of my friends, and then white bear (my starter) since i remembered it being basically the benchmark for all the episodes i watched after (same with SUAD). Opinions?",
        "created_utc": 1517061638,
        "upvote_ratio": ""
    },
    {
        "title": "His Reaction When You've Convinced Him To Start With 'Hang the DJ'...",
        "author": "bluntbutnottoo",
        "url": "https://i.redd.it/lre0knzh3mc01.png",
        "text": "",
        "created_utc": 1517059579,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone see Philip K Dick’s Electric Dreams?",
        "author": "Tangus5000",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tcgp6/anyone_see_philip_k_dicks_electric_dreams/",
        "text": "[removed]",
        "created_utc": 1517056395,
        "upvote_ratio": ""
    },
    {
        "title": "Why an AI replica of our consciousness is more ethically acceptable than a biological clone?",
        "author": "astrofisico",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tccut/why_an_ai_replica_of_our_consciousness_is_more/",
        "text": "I understand that the availability of an artificial consciousness based entirely on a individual's behavior (as seen in Hang The DJ) would imply that such computer person is a CONSTANT COPY of the real life person. Why this idea seems more \"cool\" and acceptable than replicating someone's DNA (for medical purposes, for example) and generating someone with the same genetic code but with a whole different life experience, aka, ANOTHER PERSON?",
        "created_utc": 1517054780,
        "upvote_ratio": ""
    },
    {
        "title": "Shut Up and Dance Trauma",
        "author": "kngktrn",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tc33r/shut_up_and_dance_trauma/",
        "text": "[removed]",
        "created_utc": 1517050410,
        "upvote_ratio": ""
    },
    {
        "title": "The Ultimate Rickroll?",
        "author": "nineteenthly",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tbw4h/the_ultimate_rickroll/",
        "text": "'White Christmas' + 'San Junipero':  An elderly person goes back to 1987 in VR only to find 'Never Gonna Give You Up' (released in that year) is playing on an endless loop.",
        "created_utc": 1517047310,
        "upvote_ratio": ""
    },
    {
        "title": "It's comming",
        "author": "MackoUsko",
        "url": "https://imgur.com/wFYEt7B",
        "text": "",
        "created_utc": 1517041731,
        "upvote_ratio": ""
    },
    {
        "title": "What one episode would you guys recommend to convince someone to watch the show?",
        "author": "rooscroos",
        "url": "https://www.reddit.com/r/blackmirror/comments/7taxq6/what_one_episode_would_you_guys_recommend_to/",
        "text": "[removed]",
        "created_utc": 1517033020,
        "upvote_ratio": ""
    },
    {
        "title": "I am still waiting for the Black Mirror episode on self driving cars that will ..... (Plus hang the dj thoughts)",
        "author": "whoami4546",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tald9/i_am_still_waiting_for_the_black_mirror_episode/",
        "text": "end in a murder / suicide.  This show can get dark!  I have only see a few episodes.\n\n\nI just finished the Hang the DJ episode. I loved it.  I guessed it was a simulation halfway through.  However, I did have a minor nitpick about the simulation.  \n\nRelationships do not happen in a vacuum. l feel like simulating a real relationship would also involve simulating stress and life. Instead of just hanging out and doing nothing.  I feel this would give very inaccurate results.  Its easy to maintain a relationship when you have no responsibilities.  Just my two cents.  ",
        "created_utc": 1517030228,
        "upvote_ratio": ""
    },
    {
        "title": "watched the first 3 episodes",
        "author": "arnaoutelhs",
        "url": "https://www.reddit.com/r/blackmirror/comments/7taikd/watched_the_first_3_episodes/",
        "text": "am i missing something? i didnt understand anything",
        "created_utc": 1517029347,
        "upvote_ratio": ""
    },
    {
        "title": "Question I have about USS Callister Season 4 Episode 1",
        "author": "FlyGuys098",
        "url": "https://www.reddit.com/r/blackmirror/comments/7taagn/question_i_have_about_uss_callister_season_4/",
        "text": "After just finishing the episode I really enjoyed it but, while watching it I found myself mostly hating the crew/co-workers and rooting for Robert Daly. Mostly because how badly he was treated at the office by his co-workers I felt that he used this place just to let out his frustrations from a days work. I felt like he should’ve been left in his own game and didn’t really deserve it. I was wondering if anybody else had felt the same way throughout the episode? Or did you hate Robert throughout the episode?",
        "created_utc": 1517026997,
        "upvote_ratio": ""
    },
    {
        "title": "What’s a good episode to introduce the show to your friends?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ta644/whats_a_good_episode_to_introduce_the_show_to/",
        "text": "[deleted]",
        "created_utc": 1517025594,
        "upvote_ratio": ""
    },
    {
        "title": "SO excited to receive this custom USS Callister Nanette Cole Pop! from Spastic Customs!",
        "author": "[deleted]",
        "url": "https://i.redd.it/stlt905dngc01.jpg",
        "text": "[deleted]",
        "created_utc": 1517025132,
        "upvote_ratio": ""
    },
    {
        "title": "Did not like B&amp;W on Metalhead",
        "author": "TheHendryx",
        "url": "https://www.reddit.com/r/blackmirror/comments/7t9jec/did_not_like_bw_on_metalhead/",
        "text": "I don't get the artistic choice to go B&amp;W.  I can think it was maybe an homage to old Romero-type films, but the B&amp;W just didn't work for me here.  \n\nThere are some forms of modern media that look great in B&amp;W (The Walking Dead, Logan, etc) but it made this episode less enjoyable than it should've been, imo",
        "created_utc": 1517018494,
        "upvote_ratio": ""
    },
    {
        "title": "[Discussion] Regarding USS Callister. What happened to Jillian? She’s “lost weight” apparently.",
        "author": "Reigate_Bri",
        "url": "https://www.reddit.com/r/blackmirror/comments/7t8yrd/discussion_regarding_uss_callister_what_happened/",
        "text": "I’d like to see her in her human form, before she was turned into a spider/crab/octopus thingy.",
        "created_utc": 1517012484,
        "upvote_ratio": ""
    }
]