[
    {
        "title": "Recommended Episode for somewhat first time watcher of the show",
        "author": "HowlingWenclair98",
        "url": "https://www.reddit.com/r/blackmirror/comments/115ptt8/recommended_episode_for_somewhat_first_time/",
        "text": "I watched Black Mirror an Long time ago the first episode National Athem. And  I really didn't like the episode I know the message is about but I still didn't like it. Him fucking the Pig really was  unwatchable and turned me of  the series. Just now the series popped into my head again and I feel is unfair based the Show of one episode. I figured I would pick it up again. as an Fan of Horror Anthologies. I  watched it when I wasn't really into Horror anthology  then and wasn't fan of bummer endings.",
        "created_utc": 1676752281,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which episodes do you see as most likely &amp; least likely to occur in real life?",
        "author": "cynicalprecious",
        "url": "https://www.reddit.com/r/blackmirror/comments/115ingg/which_episodes_do_you_see_as_most_likely_least/",
        "text": "",
        "created_utc": 1676736482,
        "upvote_ratio": 1.0
    },
    {
        "title": "Used one emoji for each episode. Any improvements? Episodes are in order.",
        "author": "Disastrous-Treat0616",
        "url": "https://i.redd.it/i6usk545h0ja1.jpg",
        "text": "",
        "created_utc": 1676736050,
        "upvote_ratio": 1.0
    },
    {
        "title": "a thought I had while watching shut up and dance",
        "author": "gandaknuckles",
        "url": "https://www.reddit.com/r/blackmirror/comments/115d9aw/a_thought_i_had_while_watching_shut_up_and_dance/",
        "text": "Other than the Mindy stuff, Hector seems pretty dedicated to his family. Before they robbed the bank, he even says that he'd put a bread knife through his throat if he were to lose his kids. Do you guys think this is the reason 'they' put Kenny and Hector together? In my opinion, out of all of them, the two pedos got the harshest instructions (the two being the only ones to face the actual possibility of death), so it seems to me that the hackers hate pedophiles and gave them the worst of it as a sort of punishment. As part of this punishment, maybe the hackers purposefully put Kenny with Hector, a guy that has children he loves and cares for and is very vocal about to make Kenny feel even worse about his actions. What do you guys think?",
        "created_utc": 1676719485,
        "upvote_ratio": 1.0
    },
    {
        "title": "See what the Unicorn Scale has to say about the Black Mirror classic: San Junipero! [Article]",
        "author": "AntiWokeGayBloke",
        "url": "https://bi.org/en/articles/the-unicorn-scale-san-junipero",
        "text": "",
        "created_utc": 1676694303,
        "upvote_ratio": 1.0
    },
    {
        "title": "Black Mirror episodes explained by too simple images",
        "author": "cmsd--",
        "url": "https://i.redd.it/mullzvpl8via1.png",
        "text": "",
        "created_utc": 1676672654,
        "upvote_ratio": 1.0
    },
    {
        "title": "S5E2: Rewatching \"Smithereens\" the attention to detail on the gun used is impressive!",
        "author": "Defirence680",
        "url": "https://www.reddit.com/r/blackmirror/comments/114nipp/s5e2_rewatching_smithereens_the_attention_to/",
        "text": "SPOILERS: About \\~27 minutes in, there's a short shot of the gun.\n\nMy best guess is when they shot the episodes they used real world models loaded with blanks + squibs for blood/gunshots etc. Seeing that groove near the front of the barrel and the shape beforehand was a dead giveaway. \"MODEL 75 CAL 9 PARA - MADE IN CZECHOSLOVAKIA\" is the commonly-known \"CZ-75\". Amazing attention to detail, crazy to think I didn't even notice this before.  \n\n\nJust a note: I don't support violence or weapons used for the wrong reasons, but prefer to appreciate the engineering and physics of it all. \"When a forest is burned away, it will always grow back.\"",
        "created_utc": 1676646369,
        "upvote_ratio": 1.0
    },
    {
        "title": "was just re-watching Shut Up And Dance",
        "author": "_twisted_macaroni_",
        "url": "https://www.reddit.com/r/blackmirror/comments/114kho0/was_just_rewatching_shut_up_and_dance/",
        "text": "in the scene where we are introduced to Kenny, he gives a toy back to a little girl while kneeling in front of her and then keeps staring until she leaves. Now, this might just be a coincidence, but given that it is revealed in the ending that he is a paedophile, this might just be a wonderful way of introducing him.",
        "created_utc": 1676641061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Microsofts chat gpt struggling to understand its own existence",
        "author": "Tommy814",
        "url": "https://i.redd.it/xyrkfq95bqia1.jpg",
        "text": "",
        "created_utc": 1676612965,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Yo fool, this is what you look like!”",
        "author": "bigpimpgrant",
        "url": "https://www.reddit.com/r/blackmirror/comments/1148g3n/yo_fool_this_is_what_you_look_like/",
        "text": "Are the words my dad told me when I told him to watch Black Mirror.",
        "created_utc": 1676601399,
        "upvote_ratio": 1.0
    },
    {
        "title": "Made this video with AI generated images to give 5 suggestions for the topics of the next season! Go give it a watch. I plan to go in more detail in more videos.",
        "author": "No-Resort-4998",
        "url": "https://m.youtube.com/watch?v=bRafv4NQBaw&amp;feature=youtu.be",
        "text": "",
        "created_utc": 1676585169,
        "upvote_ratio": 1.0
    },
    {
        "title": "What might happen in the next season of Black Mirror?",
        "author": "No-Resort-4998",
        "url": "https://m.youtube.com/watch?v=bRafv4NQBaw&amp;feature=youtu.be",
        "text": "",
        "created_utc": 1676584350,
        "upvote_ratio": 1.0
    },
    {
        "title": "Series 6??",
        "author": "Typical_Ad_6747",
        "url": "https://www.reddit.com/r/blackmirror/comments/113n10h/series_6/",
        "text": "Not gonna lie, my hype levels are gonna be at an all time high when it drops. I think I’m probably in the minority that enjoys Series 5, apart from the stupid doll episode. Loving the announced cast so far, although I wish there were more English actors, the ones with them in were always better episodes. But I hear Charlie Brooker may not be involved? What made Black Mirror what it is where his brilliant satirical views and ideas. It’s a different show if he’s not gonna be there. Plus when are we getting a trailer or something along those lines??",
        "created_utc": 1676541330,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just saw white bear for the first time",
        "author": "adepressedgoddess",
        "url": "https://www.reddit.com/r/blackmirror/comments/113ge6y/just_saw_white_bear_for_the_first_time/",
        "text": "I didn’t feel that the punishment was fair at all. I really sympathized w the main character. It just felt like they were punishing an innocent person",
        "created_utc": 1676516815,
        "upvote_ratio": 1.0
    },
    {
        "title": "#DeathTo @ChatGPT",
        "author": "bass_of_clubs",
        "url": "https://i.imgur.com/Xuiqnpl.jpg",
        "text": "",
        "created_utc": 1676516770,
        "upvote_ratio": 1.0
    },
    {
        "title": "Series 6",
        "author": "Typical_Ad_6747",
        "url": "https://www.reddit.com/r/blackmirror/comments/1136ozl/series_6/",
        "text": "Not gonna lie, my hype levels are gonna be at an all time high when it drops. I think I’m probably in the minority that enjoys Series 5, apart from the stupid doll episode. Loving the announced cast so far. But I hear Charlie Brooker may not be involved? What made Black Mirror what it is where his brilliant satirical views and ideas. It’s a different show if he’s not gonna be there. Plus when are we getting a trailer or something along those lines??",
        "created_utc": 1676490358,
        "upvote_ratio": 1.0
    },
    {
        "title": "which black mirror episode next?",
        "author": "Ok-Appointment-9",
        "url": "https://www.reddit.com/r/blackmirror/comments/11323hq/which_black_mirror_episode_next/",
        "text": "I've been watching a lot of black mirror and liked episodes like white bear, but I can't just get into the episode from name.\nSo I was wondering, what episode should I watch next and what is it about? (Description without spoilers)",
        "created_utc": 1676478868,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Simpsons S13E21 is very reminiscent of White Bear",
        "author": "zahcncam",
        "url": "https://www.reddit.com/gallery/1130gh2",
        "text": "",
        "created_utc": 1676474505,
        "upvote_ratio": 1.0
    },
    {
        "title": "An even more disturbing streamers post",
        "author": "enigmaticbloke",
        "url": "https://v.redd.it/pxpv3det13ia1",
        "text": "",
        "created_utc": 1676455427,
        "upvote_ratio": 1.0
    },
    {
        "title": "My headcannon for the monkey plushie in Black Museum",
        "author": "cmsd--",
        "url": "https://www.reddit.com/r/blackmirror/comments/112kk9j/my_headcannon_for_the_monkey_plushie_in_black/",
        "text": "I would be unbelievably happy if they could take the woman out of the monkey and put her in a more sophisticated system where she can do stuff, communicate properly, feel stuff properly, etc. Kinda like a cookie but different since they would put her mind in something else.\n\nSure she can be uploaded to San Junipero but I think that after years of being trapped inside a monkey plushie in a museum ruled over by a psychopath, I think she deserved a bit better than just getting her mind uploaded into a server.",
        "created_utc": 1676420315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hot Shot",
        "author": "palebluedot1988",
        "url": "https://i.redd.it/f2pptw3706ia1.jpg",
        "text": "",
        "created_utc": 1676367145,
        "upvote_ratio": 1.0
    },
    {
        "title": "A bunch of free creepy masks at the curb.",
        "author": "MissTinyTits",
        "url": "https://i.redd.it/jp8j5doxg2ia1.jpg",
        "text": "",
        "created_utc": 1676360351,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saw this…felt like it was appropriate for this sub.",
        "author": "utilityspork",
        "url": "https://v.redd.it/ml05qyxp90ia1",
        "text": "",
        "created_utc": 1676344078,
        "upvote_ratio": 1.0
    },
    {
        "title": "Timeline?",
        "author": "AntiAnonymousSatan",
        "url": "https://www.reddit.com/r/blackmirror/comments/111nlr6/timeline/",
        "text": "I know that many people over the years have created approximate timelines for the connections in the show and so on but is there a more detailed one out there?\n\nFor example, the harsh police state shown in the Waldo Moment being a result of the populism of the character leading to the treatment of the main characters at the end of White Christmas as those officers seem harsh enough to be in a police state. \n\nSomething like that...",
        "created_utc": 1676331209,
        "upvote_ratio": 1.0
    },
    {
        "title": "A bunch of free creepy masks at the curb.",
        "author": "Fire_Frog_",
        "url": "https://i.redd.it/jp8j5doxg2ia1.jpg",
        "text": "",
        "created_utc": 1676330553,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just watched USS Callister and I just can't hate Daly",
        "author": "cmsd--",
        "url": "https://www.reddit.com/r/blackmirror/comments/111kcqs/just_watched_uss_callister_and_i_just_cant_hate/",
        "text": "Daly is a sadistic asshole god who threw someone's son out of an space garbage chute, turned people into giant bug monsters and did everything so they suffered. And not to mention that unlike some npcs or fictional characters, they're the exact copies of his co-workers.\n\nBut I gotta be real, I relate to Daly too much to hate him. In the darkest time in my life I was stuck in a Discord server with people that I thought were my friends but increasingly started to realize they were a bunch of manipulative assholes. Through all of my life I've been dealing with false friends and I understand why he wanted to make them pay. \n\nYou see, if Daly wasn't sick to the point of psychologically torturing copies of actual people and instead took out his anger on coded-in NPCs or even just sued the guy that stole all of his credit, I believe he would have a much happy ending and wouldn't meet his fate in the ending. I kinda pity him and I'm sad he took the wrong route.",
        "created_utc": 1676323244,
        "upvote_ratio": 1.0
    },
    {
        "title": "Visit San Junipero",
        "author": "FindingPhysical3474",
        "url": "https://i.redd.it/7uflneb74zha1.png",
        "text": "",
        "created_utc": 1676301751,
        "upvote_ratio": 1.0
    },
    {
        "title": "Our Newyear holiday with our Korean grandparents. For full video go to our YouTube channel and subscribe. Thanks",
        "author": "K-Wisdom",
        "url": "https://v.redd.it/uw76jza47xha1",
        "text": "",
        "created_utc": 1676260518,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Midnight Television\" on Dust",
        "author": "silian_rail_gun",
        "url": "https://www.reddit.com/r/blackmirror/comments/110poza/midnight_television_on_dust/",
        "text": "Strong Black Mirror vibes!\n\n&amp;#x200B;\n\n[https://www.youtube.com/watch?v=T08deT2tnf0](https://www.youtube.com/watch?v=T08deT2tnf0)",
        "created_utc": 1676234469,
        "upvote_ratio": 1.0
    },
    {
        "title": "White bear camera shake",
        "author": "Dependent_Use3791",
        "url": "https://www.reddit.com/r/blackmirror/comments/110md5b/white_bear_camera_shake/",
        "text": "I'm 8 minutes into this episode and I'm about to give up. The camera is shaking violently all over the place, it's just too much.\n\nSurely, I can't be the only one distracted by this?",
        "created_utc": 1676225980,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which of these lists do you agree with the most??",
        "author": "TranslatorOne2847",
        "url": "https://www.reddit.com/gallery/110i2jb",
        "text": "me and my friend are arguing about who has a stronger list",
        "created_utc": 1676215135,
        "upvote_ratio": 1.0
    },
    {
        "title": "Binge Watching",
        "author": "quirky-nugget",
        "url": "https://www.reddit.com/r/blackmirror/comments/110hywz/binge_watching/",
        "text": "Did you binge the entire show for a few days? Or did you have to watch the show bits in pieces. \nTbh I love the show and love the creativity behind it. It’s one of those series you can rewatch again, but when you do it’s through different lenses. Currently binge through the weekend. Haven’t see it all yet.",
        "created_utc": 1676214864,
        "upvote_ratio": 1.0
    },
    {
        "title": "What black mirror concepts can be made into a whole TV series and still be good?",
        "author": "lumboister",
        "url": "https://www.reddit.com/r/blackmirror/comments/110eun7/what_black_mirror_concepts_can_be_made_into_a/",
        "text": "I think most episodes are perfect length, but certain concepts(like the doctor who can feel his patients pain) could totally be turned into their own TV series. Any ideas?",
        "created_utc": 1676205686,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daylight might overshadow its darkness for some",
        "author": "andvoi",
        "url": "https://i.redd.it/hi0p8yv9trha1.jpg",
        "text": "",
        "created_utc": 1676204318,
        "upvote_ratio": 1.0
    },
    {
        "title": "yes i love on a roll how could you possibly know",
        "author": "celeste_fan_139",
        "url": "https://i.redd.it/29iovhs4zmha1.png",
        "text": "",
        "created_utc": 1676136758,
        "upvote_ratio": 1.0
    },
    {
        "title": "A bit weird, yes, but I like to make the white bear symbol with my pill packets.",
        "author": "Larllyparp",
        "url": "https://i.redd.it/l733pe9dukha1.jpg",
        "text": "",
        "created_utc": 1676110943,
        "upvote_ratio": 1.0
    },
    {
        "title": "White Bear Justice Park visitor reviews. [This is some really well done and scary fan work I thought I would share here]",
        "author": "SurvivingBigBrother",
        "url": "https://www.reddit.com/r/blackmirror/comments/10z6wb4/white_bear_justice_park_visitor_reviews_this_is/",
        "text": "\"Well executed concept, definitely a proportionate punishment!\"\n\nRating: ★★★★\n\nReviewed by Lily C. on 15 June 2020\n\n133 out of 145 people found this review helpful.\n\n \n\nFirst review for this park! I'll try my best to do it justice. Like many, I have been following the Jemima case avidly, horrified at what happened to the little girl and feeling outraged at how cold-bloodedly she was tortured and killed. I admit I was initially a little dubious of the sentencing. While I have to give points for creativity, what's the point? Skillane won't suffer if her mind is wiped clean every evening, because she’ll start on a clean slate every day.\n\nThere was a lot of hype generated about it though, enough to make me curious. Since we live just an hour away, my friends and I got tickets to check out the park when White Bear opened for business.\n\nAnd what's the verdict?\n\nI think they definitely brought the judge's vision to life. For those of you who had been living under a rock, the concept of the park works this way. The premise is that after some vague electronic signal, a large proportion of the world is turned into 'onlookers', where they mindlessly film events on their smartphones, particularly the actions of 'psychopaths', people whom the electronic signal didn't affect and can now indulge in their violent impulses. A mind-wiped Skillane wakes up in that world and goes through an entire day of being chased around by psychos (actually the park employees) while being filmed by unhelpful onlookers (us, the park visitors), eventually leading up to the climax where everything is revealed to her.\n\nThe thinnest and cheesiest of sci-fi plots, really. So many inconsistencies and plot holes that it's amazing Skillane didn't figure it out. Maybe the mind wipe did more than erase her memory, hah. The ‘acting’ is amateurish. One of the psychopath's masks fell off entirely. They also accidentally left props out at the woods (thankfully, I don't think Skillane noticed it). Baxter was the only one who put in a credible performance, almost too credible actually – you can tell how much contempt he holds for Skillane.\n\nBut anyway, much to my surprise, I enjoyed myself! Playing the role of a mind-wiped robot who films endlessly is actually kind of fun, and my friends and I had a great time. Skillane's terror was cathartic to us too. Now she knows what poor Jemima felt, that helpless terror as horrible things were done to her while people just watched. And knowing she will have to go through the same terror, again and again, day after day? I now think the decision to mind-wipe her a stroke of masterful brilliance by the judge. Genius.\n\nIt's a newly opened park and it does show. There are some hitches here and there, problems with the acting and props as I said above. But other than that, it's a cool concept, and I like what they've done with the judge's verdict, given nothing of this kind had ever been attempted before. I believe that most of the hitches will be ironed out in a few weeks, and they’ll be giving consistently good shows then. I bought the annual pass so I’m definitely coming back to check it out again.\n\n \n\n \n\n\"This isn’t justice.”\n\nRating: ★★\n\nReviewed by Sam A. on 4 July 2020\n\n3 out of 47 people found this review helpful.\n\n \n\nFirst off, let me just say this right from the start: I do not condone what Victoria Skillane did, and believe that she is completely guilty and should be punished.\n\nThat said, yesterday’s trip to White Bear made me uncomfortable, on so many levels. From the very beginning, Skillane kept screaming for someone to just help her, and watching her confusion as we all refused to just made me feel so sick. I think what pushed it over the edge was watching Skillane break down on the stage, after learning that she aided a murderer and filmed the death of a little girl. Even though her grief was palpable, she was just taunted and vilified by everyone while she sobbed. I looked around the auditorium, and I saw every single one of us, me included, with our smartphones raised, recording her anguish, and I felt so complicit in causing her torment. She lost her memory! Surely she's not the same person.\n\nWatching her the entire day, I felt like she resembled Jemima more than she resembled the criminal she was before. The park was meant to put Skillane into the shoes of Jemima, to make her suffer like that poor girl did, but it ended up putting us into Skillane's shoes instead, finding entertainment in the torture of another, and I don't think I enjoyed that.\n\nThis isn't justice. Not when a terrified woman sat in shackles before a jeering crowd, for a crime that she didn't remember committing, but yet is tortured psychologically every day for it, where sponges filled with red ink are hurled at her every night. This isn’t justice. It’s completely gratuitous violence masquerading as righteousness, and it won’t bring Jemima back, nor will it bring her family peace.\n\n  \n\n  \n\n\"Brought my family here, it's very kid friendly!\"\n\nRating: ★★★★★\n\nReviewed by Michael M. on 16 September 2020\n\n122 out of 129 people found this review helpful.\n\n \n\nI had my reservations about how kid friendly this is so I came here on a solo trip first, and I thoroughly enjoyed myself. You can see the review for my previous trip here. Suffice to say, I thought it was a great concept, perfectly executed, and had a fantastic time!\n\nAnyway, I knew I wanted to bring my kids here someday - it's educational since it teaches them about justice and punishment, and it directly concerns them and drives home the point to never, ever, talk to strangers. I know they’ll also have a grand time running around and playing mindwiped onlookers – it’s the closest we’ll ever get to being in a movie set after all!\n\nMy kids had a great time! Obviously some places/scenes are out of bounds. They don't allow any children to watch the scene in the forest because of all the grim imagery, so we had a picnic nearby instead. We did some fun stuff though. We staked out a house with a good view of Skillane when she first came out and recorded a whole lot of video, which we already uploaded to their app here. The children also enjoyed the scene at the convenience store – their faces and smartphones were practically pressed up against the glass walls of the store, they were trying to get that close!\n\nSpeaking about the app: It's incredibly useful. They have maps of the whole place, and people pin their locations and give reviews and tips about the best places to be in at each stage of the performance. You can also use it to view all the live video feeds. Definitely download the app before you visit the park!\n\n \n\n \n\n\"Day ruined by crazy activist.\"\n\nRating: ★★★\n\nReviewed by Pete K. on 25 November 2020\n\n35 out of 78 people found this review helpful.\n\n \n\nI was so excited at going to this park at first. I’m sick of theme parks, amusement parks, etc., they’re all the same and don’t give me much of a thrill anymore. I thought White Bear was going to be different. Up close and personal with the notorious Skillane, and we get to pretend that we’re in some sort of sci-fi movie while filming her torment! It doesn’t get much better than that.\n\nOur day was off to a promising start at first. Using the app, and some quick walking, we managed to get the house right next to Skillane, so we had a prime filming location for the start of the show. We then dashed out and managed to get to the road where Baxter chases Skillane, got some great footage from that scene!\n\nHowever, during the scene at the woods, this crazy guy suddenly ran up to Baxter and Skillane, yelling about how it's all fake and he's going to rescue Skillane from her hell, grabbing her and trying to drag her away. Caused a big scene. Thankfully the park crew subdued him and Skillane with tasers. But of course, since Skillane is now unconscious, the show is over for the day.\n\nThe park operators did give us free tickets, but we are only in this area for a couple of days and the rest of our time here is packed, so it's basically a waste of our money. We asked for refunds but they claimed they were unable to, gave us the whole 'every day is unpredictable and there's no guarantee each day will proceed smoothly' spiel.\n\nI do understand that such incidents are rare, especially now that they insist on pre-bookings and do background checks on every visitor, after a series of disruptions during the initial opening of the park, but it’s just disappointing that a day I had anticipated so much was ruined thanks to the actions of a madman. I hope they punish that guy severely and imprison him for a good long time. I heard they’re building another Justice Park and it’s opening sometime next year, maybe I can send this guy to be one of the exhibits there.\n\n \n\n  \n\n\"Disappointing.\"\n\nRating: ★\n\nReviewed by Julia K. on 12 March 2021\n\n27 out of 68 people found this review helpful.\n\n \n\nWent to this park over the weekend with my girlfriend because we've heard great things about it. We went to Mural, the second Justice Park, earlier last month and really enjoyed ourselves, so we thought we could have some fun over here at the original park, try out a different scenario.\n\nWell, suffice to say that we were majorly disappointed. There was a light drizzle the whole time (which I admit isn't the fault of the park operators) but I wished there were more indoor sequences so that we could take shelter from the rain and still catch the show. Also, I don’t know if it was an off day, but the acting from the park employees was dismal, with the exception of Baxter, who put in a stellar performance as usual. The rest, however, just seemed lethargic and bored. They didn't even bother running during the chase scenes! It was utterly unconvincing and I don't know how they manage to have Victoria Skillane fall for it every single time. I suspect Skillane herself is exhausted – she was completely confused and disoriented during the whole show and had to be prompted to run from the ‘psychopaths’ several times.\n\nIf I have to diagnose the park, I’ll say that its biggest problem now is boredom. Stale routines and lack of reinvention. They’ve been doing the same show, over and over again, for months now. This is completely unlike Mural, which rotates the criminal and show every month, making everything seem fresh. In White Bear, the employees are bored, even Skillane is bored despite the memory wipe, and it translates into boredom among the visitors. It is no wonder that their visitor numbers have been dropping!\n\nJustice Parks are starting to pop up all over the world now, each with their own unique take on the whole 'justified punishment' thing, and increasingly, White Bear is being left obsolete in the dust.  As the pioneering park, I'll hate to see White Bear close down due to competition, but unless they buck up, it looks like it might be the case.\n\n \n\n \n\n\"Let us not forget who this park was created for.\"\n\nReview: ★★\n\nReviewed Rebecca L. on 23 April 2021\n\n0 out of 23 people found this review helpful.\n\n \n\nIt occurred to me as I read through some of the reviews over here that so few people mentioned what I thought was the most important place in this justice park, and even if they did they only spoke about it in passing. The place I'm talking about is of course the house that serves as Jemima's memorial. A place that deserves prominence and respect. Unfortunately, it seems like the park operators don’t think the same way, and Jemima’s memorial will be removed and the house converted to a new exhibit next month. I’m writing a review today about the memorial house, lest we forget about Jemima and who this park was built for in the first place.\n\nJemima’s memorial house is tucked away in a small corner a few streets away from where Skillane's prison is. It is a wholly unremarkable house, exactly the same as all other houses on the street, but for the etching of a white bear on the front door. I  went there with my daughter during the 'woods' scene, since there was no way I was exposing my daughter to the graphic scenes of violence there. Moreover, my daughter is now the same age as Jemima was when she was kidnapped, and I guess I wanted my daughter to know her.\n\nWe walked in and the atmosphere inside was oppressive and sombre. Much like how we were supposed to behave outside - silent and brainwashed - but there was a particularly solemn feel to the mood inside the house, out of respect for Jemima perhaps. It was also quiet because so few people were inside – there were probably only about five others not including us, definitely less than ten.\n\nIn the living room, photos of a smiling Jemima lined one side of the walls, while the other was devoted to images of the woods where her body was found. Silent videos played in an endless loop on the other wall, of the investigation, the media reports, Jemima's parents, and more chillingly, even the video that Skillane took. Upstairs, rooms were dedicated to replicas of Jemima’s bedroom and home, as well as the broken-down shack her kidnappers took her.\n\nA huge oak table stood in the centre of what might have been the dining room, brightly lit with lights. It was littered with teddy bears, cards, and dust, our tributes to the dead girl. A heavy book set in the middle for visitors to write their thoughts. I flipped through the pages and saw messages of grief and condolences, fears that what happened to Jemima could have happened to their children too. The last message was written several weeks ago. Together with my daughter, we penned an ode to Jemima. It will likely be the last thing ever written on the book.\n\nMuch later in the evening, we stood together with a bloodthirsty crowd as people screamed and hurled insults and abuse at Skillane as she was transported from the stage back to the house that doubled as her prison. Not a single word was said of Jemima.\n\nLet us not forget the reason why this park exists. This is more than entertainment, more than violence. It is because of justice, because of the murder of a little girl. Please let us not forget that, because otherwise, how much better would we be if we too, indulged in the pointless suffering of another?\n\n \n\n \n\n\"Finally a truly immersive experience!!!!\"\n\nRating: ★★★★★\n\nReviewed by Jonathan O. on 2 July 2021\n\n56 out of 56 people found this review helpful.\n\n \n\nPhenomenal. Astounding. Mind-Blowing. I know almost everyone had doubts when the park closed for renovations two months ago in order to prepare for their brand new scenario. The media sure had their fun tearing into it, calling it 'stopgap' measures to delay the inevitable, but me, I never doubted Baxter and the park and I knew they will definitely deliver on their promise to reinvent the park. And let me tell you, the doubters were dead wrong.\n\nI got the special tickets from the lucky draw online (otherwise, it’ll cost slightly more than twice the usual ticket – although I think it’s definitely worth it), and arrived bright and early on the day of the park’s reopening. We (and there were about 10 of us) were taken into a separate room from the rest of the visitors and Baxter himself briefed us on our role in the new show and tips on how to put on a credible performance. We were then taken to another room to be outfitted, where there was a large variety to choose from. We could even bring in our own tools if we wished to. I love that we could personalise our roles this way – makes it feel more real, you know?\n\nAnyway, after we were all outfitted satisfactory, we took our positions at the newly renovated house (it used to be some sort of memorial for that Jemima kid, now it’s Skillane’s torture chamber, talk about irony hah!), we hung around and waited for Skillane to wake up in the house in the next street and make her slow progress out. Oh boy we were all so excited, the anticipation in the air was just amazing. I’ve been here (as in the old iteration of this park) so many times, but this is the first time I’m personally participating in it, and we’re the pioneer group of performers too! There were others who, like me, have been long-time fans of White Bear, and some who were total newbies, but we were all incredibly honoured to be a part of this.\n\nSoon enough, the call came for us to move to our positions, put on our masks and start the action and boy, that’s when all the fun began! Skillane came stumbling into the house, expertly herded by the park employees, and I was lucky to be the first one to jump out of the shadows and slash my chainsaw at her. Boy, that scream she made, I’m going to be savouring it for a long time. I chased her, cackling and slashing my chainsaw the whole time, up the stairs to where the next person, Charlotte, laid in wait with her knife and Skillane screamed so loudly that the walls echoed with the noise. We all chased her around the house, triggering traps and hidden performers, and she was just hysterically crying the whole time. She actually passed out, but that was no big deal. Just tied her up and sent her on to the next scene with the second group of performers.\n\nI'm watching the complimentary videos they sent me from the recordings, and they’re truly fantastic. This is seriously an experience I’ll treasure for a long, long time. All along, in the old White Bear and all the other Justice Parks, we were always the onlookers, you know. Participating but not entirely part of the production. There’s always this… distance, and it keeps us from enjoying the performance to the fullest. Now, with the new scenario, White Bear has managed to do what other parks haven’t yet done – make the visitors full players in the production, and truly immerse ourselves in it, and it’s just utterly fantastic!\n\nPeople had started to write off White Bear Justice Park, but mark my words, the original Justice Park has proved that it is still relevant, and will remain relevant, for a long time.\n\nFound here:\n\nhttps://archiveofourown.org/works/5448578?show_comments=true&amp;view_adult=true#comments",
        "created_utc": 1676073638,
        "upvote_ratio": 1.0
    },
    {
        "title": "Elon Musk's Neuralink sounds like it's out of a Black Mirror episode.",
        "author": "Zaraboi",
        "url": "https://www.reddit.com/r/blackmirror/comments/10xwc7r/elon_musks_neuralink_sounds_like_its_out_of_a/",
        "text": "So Neuralink makes microcip implants for the brain. They are planning of making possible the upload of information to the human brain.\n\n\nImagine being used as a hard drive just to store information that you don't even need in your brain. Maybe they lure you in with the abilities of instantly learning new languages and living experiences you'll never be able to experience, all within your head, just by downloading them to your brain. After they connect you to the computers you're fucked. They delete from your brain all of the memories and experiences you accumulated within your life. You gave away your family and friends, your passions, your rights, your memories, your past, present and future life. You just sit there unconsciously, living inside your own brain with the endless sea of excels and statistics of various companies and insitutions. They delete the ones they don't need anymore and download new of the same, effectively and endlessly raping your brain, also making money from it.\n\n\nBy \"they\" i don't mean Neuralink, but a hypothetical company that uses this, yet unreleased, tech.",
        "created_utc": 1675953569,
        "upvote_ratio": 1.0
    },
    {
        "title": "i don't know if this is the type of thing to post here but has anyone else noticed this weird interactive tik tok lives? Straight out of black mirror.",
        "author": "VegetableYou1310",
        "url": "https://www.reddit.com/gallery/10xmlxp",
        "text": "",
        "created_utc": 1675920876,
        "upvote_ratio": 1.0
    },
    {
        "title": "How mainstream/common are cookies in White Christmas?",
        "author": "ididentdoit1",
        "url": "https://www.reddit.com/r/blackmirror/comments/10xcvo4/how_mainstreamcommon_are_cookies_in_white/",
        "text": "Just asking as Joe doesn't appear to be familiar with them until Matt tells him what his job involved. Greta seems to have a fair bit of money, are we to assume that in White Christmas cookies are pretty cutting edge and not something everyone has?",
        "created_utc": 1675895174,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coco's Quest: Life &amp; Death in the Black Mirror",
        "author": "Forsaken_Apricot4638",
        "url": "https://youtube.com/watch?v=rmfUBXv77II&amp;feature=share",
        "text": "",
        "created_utc": 1675891286,
        "upvote_ratio": 1.0
    },
    {
        "title": "new season coming soon",
        "author": "CaterpillarWeak8382",
        "url": "https://i.redd.it/0kr5r37m50ha1.png",
        "text": "",
        "created_utc": 1675878487,
        "upvote_ratio": 1.0
    },
    {
        "title": "black mailing",
        "author": "damn_priyank",
        "url": "https://www.reddit.com/r/blackmirror/comments/10wrw88/black_mailing/",
        "text": "is there any real story out there just like black mirror shut up and dance episode. just finished it.",
        "created_utc": 1675846590,
        "upvote_ratio": 1.0
    },
    {
        "title": "I would love to watch an episode based on this topic.",
        "author": "ktlevesque",
        "url": "https://www.reddit.com/gallery/10vmve0",
        "text": "",
        "created_utc": 1675784876,
        "upvote_ratio": 1.0
    },
    {
        "title": "what in the black mirror is this???? i think my sims just blocked me 🫣",
        "author": "mm0299",
        "url": "https://i.redd.it/p1os0uavbjga1.png",
        "text": "",
        "created_utc": 1675656765,
        "upvote_ratio": 1.0
    },
    {
        "title": "Halfway through season 4 and the quality drop is astounding",
        "author": "kczbrekker",
        "url": "https://www.reddit.com/r/blackmirror/comments/10ucgbz/halfway_through_season_4_and_the_quality_drop_is/",
        "text": "It's been more than a month since I've been watching Black Mirror and the last episode I watched is *Hang The DJ* which is the only one I liked. Before proceeding to talk about my thoughts on season 4 I'd like to say that I'm quite impressed with BM. In my opinion the greatest ones would be *Shut Up and Dance*, *FMM*, *Nosedive*, *MAF*, *BRB* and *HITN*. I really enjoyed everything more or less before season 4. And the show got much less exciting with some poor plotline in the later season.\n\n*USS callister* was comically nonsensical I'd say. The satirical space opera game would be fine if they didn't make the ai characters real human. And sure the guy was kinda sociopathic. But it's a video game for fuck's sake. The ending was so childish, I had nothing else to say.\n\n*Arkangel* started with a good plot with the tech and parent-child relationship. But the way the whole thing was executed was such a waste of potential. The girl should've been a psycho after the but instead becomes your regular high school kid doing drugs and having sex. And then suddenly beats her mother like? Yeah it was underwhelming to say the least.\n\nThe whole plot in *Crocodile* doesn't make sense. They could've reported the police at the very start of the accident. It's not like they murdered the kid. And then the woman who felt guilt and everything about the incident becomes a serial killer and kills a child in the end? Any normal person would never do that. It was extreme which is totally illogical.\n\nSo yeah I guess I'm quite disappointed with season 4 and totally expected better. Thoughts?",
        "created_utc": 1675603673,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any one else do this?",
        "author": "Zkraut2_point_O",
        "url": "https://www.reddit.com/r/blackmirror/comments/10u145i/any_one_else_do_this/",
        "text": "So I kept hearing about black mirror right when it came out and really had no idea what it was about. So I go and watch the first episode to see why people are raving about it. By the end of the episode I was like “Where the fuck are they gonna go with this series!?!?” And instantly hit next episode. Next episode starts and I then realized it was an anthology series lmao",
        "created_utc": 1675571014,
        "upvote_ratio": 1.0
    },
    {
        "title": "Imagine if",
        "author": "Scared_Temporary5135",
        "url": "https://i.redd.it/xu0w1uyxn9ga1.jpg",
        "text": "",
        "created_utc": 1675557768,
        "upvote_ratio": 1.0
    },
    {
        "title": "God enters into my body and then i become gay",
        "author": "Away-Initiative5340",
        "url": "https://strduchhmuch.blogspot.com/2023/02/god-enters-into-my-body-and-then-i.html",
        "text": "",
        "created_utc": 1675541068,
        "upvote_ratio": 1.0
    },
    {
        "title": "Watch Bandersnatch as a regular episode?",
        "author": "PlumeDencre",
        "url": "https://www.reddit.com/r/blackmirror/comments/10tj3c9/watch_bandersnatch_as_a_regular_episode/",
        "text": "I haven't watched *Bandersnatch* yet but I know it's an interactive episode. But is it possible to watch it as a normal episode? Like would it still make sense or would it be impossible to understand anything without the choices?\n\nThanks",
        "created_utc": 1675524680,
        "upvote_ratio": 1.0
    },
    {
        "title": "My cat's nickname, Monkey, has taken on a whole new meaning",
        "author": "Albert_Borland",
        "url": "https://www.reddit.com/r/blackmirror/comments/10t4n1q/my_cats_nickname_monkey_has_taken_on_a_whole_new/",
        "text": "Monkey always needs a hug, and Monkey always loves me.",
        "created_utc": 1675483902,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ok hear me out… two sentence horror stories thoughts?",
        "author": "Lady_Sniper",
        "url": "https://www.reddit.com/r/blackmirror/comments/10t3age/ok_hear_me_out_two_sentence_horror_stories/",
        "text": "So I have been missing black mirror since what 2011? The closest thing I could find was that series. Thoughts anyone? I know it’s on CW but still just as thrilling!",
        "created_utc": 1675479726,
        "upvote_ratio": 1.0
    },
    {
        "title": "Top 10 Performances in Black Mirror, Go!",
        "author": "Typical_Ad_6747",
        "url": "https://www.reddit.com/r/blackmirror/comments/10spnor/top_10_performances_in_black_mirror_go/",
        "text": "1. Alex Lawther\n2. Rory Kinnear\n3. Daniel Kaluuya\n4. Hayley Atwell\n5. Andrew Scott\n6. Jesse Plemons\n7. Gugu Mbatha-Raw\n8. Bryce Dallas Howard\n9. Jon Hamm\n10. Anthony Mackie",
        "created_utc": 1675444610,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ye Mirror Black 😂 “I love John The Hamm”",
        "author": "fairyfrenzy",
        "url": "https://www.reddit.com/r/blackmirror/comments/10skkdd/ye_mirror_black_i_love_john_the_hamm/",
        "text": "[removed]",
        "created_utc": 1675431651,
        "upvote_ratio": 1.0
    },
    {
        "title": "My episode idea brought to life by Chat GPT",
        "author": "dannygloversdad",
        "url": "https://www.reddit.com/r/blackmirror/comments/10sipjp/my_episode_idea_brought_to_life_by_chat_gpt/",
        "text": "[removed]",
        "created_utc": 1675425805,
        "upvote_ratio": 1.0
    },
    {
        "title": "Smithereens ending sequence",
        "author": "chi_sweetness25",
        "url": "https://www.reddit.com/r/blackmirror/comments/10sg0kq/smithereens_ending_sequence/",
        "text": "Just watched Smithereens. I saw some people in the original episode discussion thread were speculating on who died during the final sniper scene based on the reactions of people during the ending sequence. But here’s how I interpreted it:\n\nWe’re not supposed to be able to tell who died, if anyone. The writers are trying to convey that social media has us so detached from humanity that Jaden dying, Chris dying, neither, or both all elicit the same reaction - a blank face looking down at a phone. So, the ambiguity of the ending is actually part of the underlying message.",
        "created_utc": 1675415649,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting into black mirror, some eps involve super triggering topics. Can anyone give me a list of the eps i should skip?",
        "author": "morbid_mystique",
        "url": "https://www.reddit.com/r/blackmirror/comments/10s595u/getting_into_black_mirror_some_eps_involve_super/",
        "text": "(sorry if this isnt the place to ask this, idk where else to ask) \n\n\nHey! Ive been getting into black mirror, the only eps ive seen were the shut up dance ep which was kind of triggering and the miley cyrus ep which i really liked! I like the concept of the show and it seems to be right up my alley! But the topics of pedophilia/csa and SA in general are really triggering to me. \n\nWhat eps should i avoid?",
        "created_utc": 1675382503,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can somebody explain the show to me ? I can’t figure out what the storyline or the meaning behind the show is. I feel so stupid 😵‍💫",
        "author": "Ilovechickennuggies8",
        "url": "https://www.reddit.com/r/blackmirror/comments/10rz8tx/can_somebody_explain_the_show_to_me_i_cant_figure/",
        "text": "",
        "created_utc": 1675368042,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ominous",
        "author": "MyPrimordialSoup",
        "url": "https://i.redd.it/hlqebikrpsfa1.jpg",
        "text": "",
        "created_utc": 1675363638,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Siri: Rehost\" to &lt;Machinecode&gt; DnB",
        "author": "Anansong",
        "url": "https://v.redd.it/g8lxk03yqofa1",
        "text": "",
        "created_utc": 1675304698,
        "upvote_ratio": 1.0
    },
    {
        "title": "tuckersoft.net",
        "author": "Advanced-Garlic-2145",
        "url": "https://www.reddit.com/r/blackmirror/comments/10r0e62/tuckersoftnet/",
        "text": "hey, does someone know if the site that netflix created for bandersnatch still exists?",
        "created_utc": 1675272363,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your favourite episode aesthetic??",
        "author": "Typical_Ad_6747",
        "url": "https://www.reddit.com/r/blackmirror/comments/10qw83w/what_is_your_favourite_episode_aesthetic/",
        "text": "For me, Striking Vipers, The Entire History of You and FMM are contenders.",
        "created_utc": 1675262196,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wrote a song about the concept of Black Mirror. It’s still in progress but figured I’d share here",
        "author": "Volt-Cult",
        "url": "https://v.redd.it/yr04iz04cifa1",
        "text": "",
        "created_utc": 1675208922,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's another level of what was told in Black Museum",
        "author": "Dudi0310",
        "url": "https://i.redd.it/411bdj6q8cfa1.jpg",
        "text": "",
        "created_utc": 1675135110,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ideas for possible future Black Mirror episdoes?",
        "author": "MaizeNBlueWaffle",
        "url": "https://www.reddit.com/r/blackmirror/comments/10p8k4l/ideas_for_possible_future_black_mirror_episdoes/",
        "text": "What are people's ideas for episodes that haven't been made yet? No, I am not Charlie Brooker looking for inspiration",
        "created_utc": 1675099852,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is giving me be right back vibes and i don't know exactly why",
        "author": "celeste_fan_139",
        "url": "https://i.redd.it/kka0x97ap2fa1.png",
        "text": "",
        "created_utc": 1675092580,
        "upvote_ratio": 1.0
    },
    {
        "title": "Share your \"Post-episode\" headcanons/ideas for sequels?",
        "author": "Professional-Eye-540",
        "url": "https://www.reddit.com/r/blackmirror/comments/10o0mxp/share_your_postepisode_headcanonsideas_for_sequels/",
        "text": "Hey!\n\nI was thinking about some episodes recently and got curious about what all of your headcanons for the time after a specific episode are. Do you ever think about what could come after? Do you have headcanons you just 100% want to be true?\n\nDo you have any ideas for sequels to any episode?\n\nPlease mark the episode beforehand so we can give people a chance to avoid spoilers if they haven't seen the particular episode.\n\n&amp;#x200B;\n\nSPOILER: San Junipero, S03 E04\n\n&gt;!Personally, I think the episode had the perfect ending and doesn't need to follow Kelly and Yorkie any longer. I'm satisfied with what we got and I love the episode. It's my all-time favourite.!&lt;\n\n&gt;!I still can't help but shake this idea of what it would look like if something happened to the \"servers\" running San Junipero. What if there was some sort of technical glitch, a virus, or somebody hacking into it? What would that look like? What if the information inside San Junipero got lost? What if tourists can't find their way back - or what if permanent residents get deleted by mistake? !&lt;\n\n&gt;!I'd trust Brooker and the whole team and also specifically the San Junipero cast to make this a great investigation into the impermanence of existence in a setting that's supposed to transcend this very fragility and endpoint. !&lt;\n\n&gt;!What do you think?!&lt;\n\nPlease share and discuss, I'd really love some input. Thanks!",
        "created_utc": 1674972550,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hated In The Nation is a masterpiece",
        "author": "Unremovable_Cortana",
        "url": "https://www.reddit.com/r/blackmirror/comments/10nyv59/hated_in_the_nation_is_a_masterpiece/",
        "text": "\"The Game of Consequence\". \n\nThe way this episide showed the dangers of technology pertaining in the way people use their words a weapon...  (exhales)\n\nI totally get why he did what he was did.\n\nThis episode is art.",
        "created_utc": 1674966571,
        "upvote_ratio": 1.0
    },
    {
        "title": "episode suggestions !!",
        "author": "peepeejones786",
        "url": "https://www.reddit.com/r/blackmirror/comments/10nnre3/episode_suggestions/",
        "text": "i need suggestions for an episode to watch that doesn’t have any inappropriate scenes. i want to watch it with my younger brother. obviously kissing scenes are fine. if i’m gonna be more specific, intense makeout scenes are probably ok as long as it’s not throughout the whole episode. sex is too much unless it’s just one scene where i can skip it. \n\nepisodes we have watched so far are black museum (skipped the first story lol), nosedive, white bear (insanely good omg), white christmas (skipped first story again) and that’s it. \n\ni’ve watched smithereens and ashley o and i know they’re fine but i don’t find them super entertaining episodes in general. my other brother also says hated by the nation is ok but super long.\n\nthe only other episode i’ve watched is fifteen million merits but that’s obviously inappropriate.",
        "created_utc": 1674935357,
        "upvote_ratio": 1.0
    },
    {
        "title": "Soon „be right back” might be reality",
        "author": "Wallflower_in_bloom",
        "url": "https://www.itbrew.com/stories/2023/01/26/ai-firm-s-avatars-for-dead-people-raises-ethical-and-security-concerns?utm_source=&amp;utm_medium=syndication&amp;utm_campaign=feed",
        "text": "",
        "created_utc": 1674934757,
        "upvote_ratio": 1.0
    },
    {
        "title": "Outside the anthology format, what genre is black Mirror really??",
        "author": "Typical_Ad_6747",
        "url": "https://www.reddit.com/r/blackmirror/comments/10nbej9/outside_the_anthology_format_what_genre_is_black/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/10nbej9)",
        "created_utc": 1674899331,
        "upvote_ratio": 1.0
    },
    {
        "title": "I cry when this song plays in the episode every. single. time.",
        "author": "slave_to_pluto",
        "url": "https://i.redd.it/aunk56xxarea1.jpg",
        "text": "",
        "created_utc": 1674881610,
        "upvote_ratio": 1.0
    },
    {
        "title": "Technology is not so bad",
        "author": "Freakbert",
        "url": "https://www.reddit.com/r/blackmirror/comments/10muvz7/technology_is_not_so_bad/",
        "text": "So i just finished black mirror for the second time and it got me thinking that that the show is less about \"technology bad\" and more about \"what if every person on earth was an asshole\" seriously every character is incredible mean or incredible stupid, \"oh! I know you were force to fuck a pig to  save a girl but you disgust me i don't want to see you anymore\", \"hey! I made you to replace my dead boyfriend but you aren't a 100% like him so go fucking die\", \"you love me and want to have a baby with me? well fuck you I'm gonna abort the baby and block you forever and btw the baby isn't even yours but I'm never gonna tell you that to drive you crazy\", the white Christmas episode  got me especially furious with the ending and I get that technology made people in this world like this, they like to take the easy way out but come on!, btw i love how this show can get me to feel so many emotions genuinely love this show.",
        "created_utc": 1674850686,
        "upvote_ratio": 1.0
    },
    {
        "title": "Imagine if you could gift your loved ones a cookie of you to talk with you whenever they need to (like a Tamagotchi). What would be the fucked up twist?",
        "author": "nightsreader",
        "url": "https://i.redd.it/8ezya2hpgoea1.jpg",
        "text": "",
        "created_utc": 1674847228,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't know why but every time i see a post like this my brain immediately goes \"we could turn this into a black mirror concept\"",
        "author": "celeste_fan_139",
        "url": "https://i.redd.it/vy4tds0yd7481.jpg",
        "text": "",
        "created_utc": 1674838496,
        "upvote_ratio": 1.0
    },
    {
        "title": "And for black mirror season 6 (it's not real but i kinda wish it is)",
        "author": "celeste_fan_139",
        "url": "https://v.redd.it/79fha1yu9tda1",
        "text": "",
        "created_utc": 1674834134,
        "upvote_ratio": 1.0
    },
    {
        "title": "I asked AI to create Season 6 of Black Mirror",
        "author": "vhs199",
        "url": "https://i.redd.it/i2kgklhbphea1.png",
        "text": "",
        "created_utc": 1674783426,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just screams black mirror",
        "author": "noodiot",
        "url": "https://businessinsider.com/bryan-johnson-45-reduced-biological-age-5-years-project-blueprint-2023-1",
        "text": "",
        "created_utc": 1674751756,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fostering a dog in the meta- verse has a very black mirror ring to it",
        "author": "lithaxbaby",
        "url": "https://i.redd.it/48u32922geea1.jpg",
        "text": "",
        "created_utc": 1674725943,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got a new friend into the show and I’m flying high guys….",
        "author": "fairyfrenzy",
        "url": "https://www.reddit.com/r/blackmirror/comments/10lc6ms/i_got_a_new_friend_into_the_show_and_im_flying/",
        "text": "I have to share my story and the giddy ass state I’m in because I know you will understand. \n\nI’ve been trying to get this friend, who’s a newer friend that I met at work, into this show for about two months. He was interested but slightly hesitant, as he said he kept hearing how “depressing and bleak” it is……and I kept saying “No, man! “Fascinating and introspective… and yes kinda bleak, but I swear you’re the kind of person who will love this. You’ll get it. Just do it!” He’s truly like us. It had to be done. \n\nSo, finally, last night we were hanging out and couldn’t find anything to watch. Like we did one of those scrolling on almost everything and just kept saying “Ehhh.. nah…..”\n\nSo finally, I suggested we try “Nose Dive.” He looked at me, hesitantly but said……”Yeah. Ok.” And I had to hide some of my inner geekdom glee. \n\nSo we watched it, and he really liked it. A lot. And HE said…. “Ok, what episode should we watch next?” \n\nYou can imagine my emotions. \n\nSo we watched “15 Million Merits” — again, he loved it, even though he said, “Yeah ok.. I’m seeing how this show can be a touch bleak. But it’s rad as hell.”\n\nAll in all, we watched:\n\nNose Dive\n15 Million Merits \nHang the DJ\nPlaytest \n\nSuccess.\n\nHe said next time we hang or if we can’t, he’ll fill me in on:\n\nThe Entire History Of You\nSan Junipero\nWhite Bear\nThe National Anthem (I had already warned him and told him we couldn’t watch that first)\n\nI informed him he’s not allowed to watch “White Christmas” without me. And he’s texted me on and off with all these great thoughts about the episodes all day, wanting to discuss it… seriously like all day 😂 \n\n\nAhhhhh….  it’s  so fantastic bringing a friend or someone close, especially who gets it, into the Mirror-verse. It’s been far too long. Not that I don’t love discussing it on here with you Mirror-versers, but…. I’m sure you know what I mean.",
        "created_utc": 1674686830,
        "upvote_ratio": 1.0
    },
    {
        "title": "Out of this poll, which episode’s soundtrack is your favourite ?",
        "author": "Larllyparp",
        "url": "https://www.reddit.com/r/blackmirror/comments/10kdxyw/out_of_this_poll_which_episodes_soundtrack_is/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/10kdxyw)",
        "created_utc": 1674588818,
        "upvote_ratio": 1.0
    },
    {
        "title": "man against fire",
        "author": "mirageatwo",
        "url": "https://www.reddit.com/r/blackmirror/comments/10jwnjh/man_against_fire/",
        "text": "What is the painting shown in Man against fire when they first enter the home to look for the cockroaches? \n\nThey don't show the whole painting, but it shows a man on the ground, and some (conquistadors?) Standing on top of him. \n\nAnyone got any idea?",
        "created_utc": 1674533048,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spotify's 6 skips per hour restriction is convenient",
        "author": "Hristan_Milikic",
        "url": "/r/unpopularopinion/comments/k5qh3z/spotifys_6_skips_per_hour_restriction_is/",
        "text": "",
        "created_utc": 1674499959,
        "upvote_ratio": 1.0
    },
    {
        "title": "Be Right Back IRL",
        "author": "blairbxtchproject",
        "url": "https://i.redd.it/1ssd88avfvda1.jpg",
        "text": "",
        "created_utc": 1674495847,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bandersnatch takes place in the 80s, which makes you think about how it’s one of the only Black Mirrors without any futuristic tech. Until you realize…",
        "author": "solace1234",
        "url": "https://www.reddit.com/r/blackmirror/comments/10ji8va/bandersnatch_takes_place_in_the_80s_which_makes/",
        "text": "We *are* the futuristic tech, playing a part in this simulation of a 1980s game dev’s mental breakdown.",
        "created_utc": 1674495364,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else obsessed with this song? I’ve been obsessed since I first heard it in Black Mirror! Anyone Who Knows What Love Is (Will Understand)",
        "author": "Choice_Ad_8613",
        "url": "https://v.redd.it/sjbvqpz6ppda1",
        "text": "",
        "created_utc": 1674426343,
        "upvote_ratio": 1.0
    },
    {
        "title": "Top ten personal Black Mirrors eps, with explanation",
        "author": "Cornelious72",
        "url": "https://www.reddit.com/r/blackmirror/comments/10i52lr/top_ten_personal_black_mirrors_eps_with/",
        "text": "Literally no background in film study or anything. Simply Cornelious72’s opinion. Feel free to debate in the comments Im curious!! \n\n\n10.) Arkangel- I liked the concept a lot and I do not hear people talking about this one that much. I think it’s a classic black mirror “technology gone wrong” scenario but it stuck out to me more than say the entire history of you did. \n\n9.) Striking Vipers- I see this ep get alot of hate, but I still really enjoyed it. Not saying this isn’t true of all black mirror episodes but it was very unique and weird. I think it also played on masculine friendship pretty well, because a lot of dudes do not even hug their friends, so its like 0 to 100. \n\n8.) Smithereens- Another one I see people hate on. In Black Mirror terms this episode was simple. But thats why I loved it, it was a very simple concept that kept you on the edge of your seat with incredible acting. Holy shit the acting was so good. The anticipation built for every moment, despite being such a long episode with no super insane weird plotlines that are typical of black mirror, this was so impressive to me\n\n7.) Black Museum- A very fucked up episode, executed so well in my opinion. I cycled through disgust, sadness, and anger the whole time. It struck all the right nerves, and the script helped build the intensity. Even small quotes I hear from that ep invoke emotion. The way this one had three storylines composed into one and had it all tied together was super cool. \n\n6.) Nose Dive- I think this, and the next up on the list, are my two favorite social commentary episodes. I love this ep because the society portrayed isnt super far off from how we live now. Like is it all that exaggerated? Not only does this ep play on social like-ability but also class. The same people who like to feel good about themselves for helping out the less fortunate, but also do not want to embarras themselves with someone who is too low on the totem pole, exist irl. \n\n5.) The National Anthem- The reason this one is this high up on my list is because damn, what a way to start a show. All those weird and “what the fuck” situations that black mirror entertains-this episode was the blueprint. As mentioned previously the social commentary in this one was also strong, and what a fucking way to do it. I also feel that the publics’ opinions in the plot of this episode were incredibly realistic. The gross media coverage, people cracking jokes, opinions changing at the speed of light, all realistic. And then after all this public humor everyone watches and they are like, oh….\n\n4.) USS Callister- This episode is just fun, plain and simple. It’s so fun and it also was executed so well. It was sad and disturbing but not too sad and disturbing, I actually found this ep to be pretty wholesome. I also loved the typical trope of vengeful antisocial nerd combined with a star trek theme. Not much to say about this one I just like it. \n\n3.) San Junipero- How much do I really need to explain myself? Who ever submitted this idea for an ep, good on you! Half the fun in watching this is trying to figure out what the fuck is going on before its revealed. Its cute, its sad, and its wholesome. The weird dystopian themes are present but its not just that alone, you also get involved in the characters. \n\n2.) Hang the DJ- I know not many people feel this should be second, but sorry I love this episode. Its so cute. It keeps you engaged and I loved the classic half break of the third wall where the characters are like “why am I here I don’t remember life before this.” Its just a fun little idea to have it all tied into a dating app too. Overall wholesome and sweet episode that plays with your emotions. \n\n1.) Shut up and Dance- Sorry, had to do it. I love everything about this episode. And I know y’all probs saw it coming. This episode gets all the hype it deserves. The idea of rooting for a character the whole time out of sheer terror that this could happen to you was a strong factor. Then with the end, it leaves the audience feeling satisfied because we realize then he deserved it all-beautiful.",
        "created_utc": 1674344114,
        "upvote_ratio": 1.0
    },
    {
        "title": "872929191 Free Here Best / Best / teen / leaks/ discord / onlyfans / young / video / child por / n htt@ps://cokeaszzsk.ws/invite/i=23354 Remove @ to see",
        "author": "Straight-Job517",
        "url": "https://www.reddit.com/r/blackmirror/comments/10hd18r/872929191_free_here_best_best_teen_leaks_discord/",
        "text": "[removed]",
        "created_utc": 1674258499,
        "upvote_ratio": 1.0
    },
    {
        "title": "I still don’t get why is hang the dj called hang the dj?",
        "author": "Guyok2828272",
        "url": "https://www.reddit.com/r/blackmirror/comments/10hci4h/i_still_dont_get_why_is_hang_the_dj_called_hang/",
        "text": "",
        "created_utc": 1674257252,
        "upvote_ratio": 1.0
    },
    {
        "title": "San Junipero: I don't understand Kelly's thought process/motivations",
        "author": "lllths",
        "url": "https://www.reddit.com/r/blackmirror/comments/10h93fa/san_junipero_i_dont_understand_kellys_thought/",
        "text": "Hi guys, I'm new to the sub (and the show). I was watching San Junipero and was totally confused the whole time, even when it ended I was still confused and feeling kind of bleak. \n\nAnyways after reading about it a whole lot on here, I started thinking; why did Kelly even go to SJ in the first place?\n\nShe told Yorkie that she wouldn't stay there because her daughter never got to experience it, and her husband didn't go becuase he didn't want to experience what his daughter didn't get to, so why did Kelly even go? Even as a visitor, doesn't it defeat the whole purpose of not going to SJ? She also says she wants to have as much fun over there as possible, or something to that effect, but again doesn't that ruin the whole point? Why would you want to have the most fun at SJ and then say 'oh well I'm not actually going to live my afterlife there because my daughter didn't get to experience it and my husband isn't here' \n\nI don't know if this makes sense or if I'm missing something, but let me know!",
        "created_utc": 1674250867,
        "upvote_ratio": 1.0
    },
    {
        "title": "Welp",
        "author": "BananaBread999",
        "url": "https://v.redd.it/4fdaq33ro7da1",
        "text": "",
        "created_utc": 1674246823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doing little exercises thru the day that jolt your system really make big impact on them last few hard to loose pounds",
        "author": "Odd_Transition_8255",
        "url": "http://ederduchhmuch.blogspot.com/2023/01/jj.html",
        "text": "",
        "created_utc": 1674246012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Immediately burn the calories you consume!",
        "author": "Unclestanky",
        "url": "https://v.redd.it/ifke5zord2da1",
        "text": "",
        "created_utc": 1674178460,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have to write an essay on a black mirror episode",
        "author": "-J_A_W-",
        "url": "https://www.reddit.com/r/blackmirror/comments/10giyr3/i_have_to_write_an_essay_on_a_black_mirror_episode/",
        "text": "Are there any good episodes about ai run amuck cause i think it’d be cool to write abt ai. If not are there any episodes you guys would recommend to choose",
        "created_utc": 1674176632,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shut Up &amp; Dance.",
        "author": "Hot-Animator-1624",
        "url": "https://i.redd.it/gthifeczrxca1.png",
        "text": "",
        "created_utc": 1674128257,
        "upvote_ratio": 1.0
    },
    {
        "title": "this email I spam email I received.",
        "author": "Hot-Animator-1624",
        "url": "https://i.redd.it/gthifeczrxca1.png",
        "text": "",
        "created_utc": 1674128197,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fifteen Million Merits",
        "author": "BoredGeek1996",
        "url": "https://time.com/6247678/openai-chatgpt-kenya-workers/",
        "text": "",
        "created_utc": 1674107498,
        "upvote_ratio": 1.0
    },
    {
        "title": "Episode suggestions for a college class?",
        "author": "cam0937",
        "url": "https://www.reddit.com/r/blackmirror/comments/10f9ilc/episode_suggestions_for_a_college_class/",
        "text": "I'm teaching a tech ethics class starting in March and will be doing a \"Black Mirror Writers' Room\" exercise twice throughout the semester where groups of students essentially write their own episode. However, I want to assign an episode of the show to watch before each writers' room so that those who haven't seen the show get the idea. I can't assign anything too graphic though (ideally no sex scenes, no intense gore/violence, etc.). My thoughts are Nosedive and Rachel, Jack and Ashely Too. Wanted to get other perspectives though, especially from any college students in the sub. Thanks!",
        "created_utc": 1674054267,
        "upvote_ratio": 1.0
    }
]