[
    {
        "title": "Holy Shit China stole from a netflix series.",
        "author": "Coopzville",
        "url": "https://i.redd.it/pwmfxd5uu6e11.jpg",
        "text": "",
        "created_utc": 1533437298,
        "upvote_ratio": ""
    },
    {
        "title": "Hang the DJ",
        "author": "nicole1971",
        "url": "https://www.reddit.com/r/blackmirror/comments/94mupx/hang_the_dj/",
        "text": "I need a little help. I have watched several times. What is with the percentage of successful matches? Did they have to complete the simulation 1000 times before they are successfully matched? If so, why?",
        "created_utc": 1533420201,
        "upvote_ratio": ""
    },
    {
        "title": "Open Mouth Cover",
        "author": "Allinallisallweare02",
        "url": "https://www.reddit.com/r/blackmirror/comments/94mlsc/open_mouth_cover/",
        "text": "I was on Netflix last night and when I scrolled by Black Mirror the cover I got was like this open mouth, all in Black and White.  Does anyone now what episode this is from? perhaps Metalhead, as it is all in black and white and the covers are always season 4 episodes.",
        "created_utc": 1533418124,
        "upvote_ratio": ""
    },
    {
        "title": "Gonna be a hard pass for me. I know it ends.",
        "author": "jsharp1983",
        "url": "https://youtu.be/TzE1KAotkJQ",
        "text": "",
        "created_utc": 1533416214,
        "upvote_ratio": ""
    },
    {
        "title": "Netflix's \"The Hollow\"",
        "author": "TheIberDeber",
        "url": "https://www.reddit.com/r/blackmirror/comments/94l5w2/netflixs_the_hollow/",
        "text": "I recently watched The Hollow on Netflix and it really feels like a Black Mirror episode. Spoilers are in this post, just a heads up.\n\nSo The Hollow follows a group of teens that wake up in a bunker with no memories, not even their own names (but a name in their pocket is probably their name). They escape and slowly discover they have powers. They want tonget home, but they are other kids that want to also and the are fighting to get this \"Ishibo\" to get home. However, stuff starts getting weird and they glitch and pixelate. They realize that they are in a game and they have to leave before the game's code collapses. When the main characters beat the game, its revealed that they are real people for a televised tournament and they get this trophy but one member from the other group's eye glitches before the episode ends. A cliffhanger. It reminds me of Playtest except nobody dies in it. Kinda Black Mirror-esque I guess. I think everyone here should watch it even though it is targeted for kids. Netflix hasn't said anything for a second season.",
        "created_utc": 1533406361,
        "upvote_ratio": ""
    },
    {
        "title": "...",
        "author": "endgame00",
        "url": "https://i.imgur.com/IKCUntG.png",
        "text": "",
        "created_utc": 1533405538,
        "upvote_ratio": ""
    },
    {
        "title": "TORTURING CHILDREN DOES NOT EXECUTE SCIENCE.EXE",
        "author": "[deleted]",
        "url": "https://i.imgur.com/IKCUntG.png",
        "text": "[deleted]",
        "created_utc": 1533405497,
        "upvote_ratio": ""
    },
    {
        "title": "Filming Location for Black Museum",
        "author": "xxabixx",
        "url": "https://www.reddit.com/r/blackmirror/comments/94kxak/filming_location_for_black_museum/",
        "text": "I’ve recently started watching Black Mirror on Netflix and caught up quickly. \n\nNow my question is, does anyone know any of the filming locations for the Black Museum episode? In particular, the short clip with Jack and Carrie walking by the lake?\n\nI’ve looked on IMDB and can’t find anything about it. ",
        "created_utc": 1533404509,
        "upvote_ratio": ""
    },
    {
        "title": "[Fluff] What is it with Netflix and this song?",
        "author": "melissappled",
        "url": "https://youtu.be/_bfqsNh6U7c?t=6s",
        "text": "",
        "created_utc": 1533396474,
        "upvote_ratio": ""
    },
    {
        "title": "Black mirror subtitles, at least i used this website, to watch in my language",
        "author": "jsndippa",
        "url": "https://www.subtitledb.org/subtitle/black-mirror",
        "text": "",
        "created_utc": 1533391762,
        "upvote_ratio": ""
    },
    {
        "title": "'Black Mirror' Season 5 Already Has Its First Episode, Showrunners Reveal",
        "author": "eyezofnight",
        "url": "https://www.inverse.com/article/47760-black-mirror-season-5-release-date-could-bring-uss-callister-sequel",
        "text": "",
        "created_utc": 1533390087,
        "upvote_ratio": ""
    },
    {
        "title": "[deleted by user]",
        "author": "tavernau",
        "url": "https://www.element14.com/community/community/applications/industrial-automation-space/blog/2018/07/18/boston-dynamics-plan-to-sell-spotmini-in-2019?CMP=SOM-FACEBOOK-PRG-BLOG-CATWELL-SPOTMINI-COMM-GBL",
        "text": "",
        "created_utc": 1533355920,
        "upvote_ratio": ""
    },
    {
        "title": "Man who is shutup and dancing me is going to be severely disappointed when he finds out all his footage is me with my double chin eating food while on reddit/instagram",
        "author": "moscato_and_muaythai",
        "url": "https://i.redd.it/vmsis82zkzd11.jpg",
        "text": "",
        "created_utc": 1533349223,
        "upvote_ratio": ""
    },
    {
        "title": "[S03E06] Analysis of Hated in the Nation (25YL)",
        "author": "caemeron",
        "url": "https://www.reddit.com/r/blackmirror/comments/94e5cl/s03e06_analysis_of_hated_in_the_nation_25yl/",
        "text": "It seems like this episode got a pretty mixed reception. I quite liked it, though, and found a number of interesting things to think about. \n\nA big question raised that I think bears discussion is whether engaging in the hashtag would be ethical or not once the thing was going. That is, if we knew that someone was going to be killed because of it, is there an argument for engaging to try and make sure it is someone who \"deserves it\"?\n\nOf course there are plenty of other things in there we could talk about too. Hope that some of you may take the time to read, and I look forward to hearing what you think. Thanks\n\n\nhttps://25yearslatersite.com/2018/05/07/black-mirror-hated-in-the-nation/",
        "created_utc": 1533335821,
        "upvote_ratio": ""
    },
    {
        "title": "Netflix’s “What Happened To Monday” is basically a Black Mirror episode",
        "author": "TrueRusher",
        "url": "https://www.reddit.com/r/blackmirror/comments/94da27/netflixs_what_happened_to_monday_is_basically_a/",
        "text": "Sorry if I should flair this, but I’m not sure what to flair. But anyways, I’m watching this movie and it’s literally like I’m watching Black Mirror. It’s got the plot twists, the “dark technology future” thing, and really just a general feel of suspense you get from Black Mirror. \n\nIt’s about sectuplets (I think that’s the word—there’s 7 of them) who live under a “one child only” law and they all live as the same person. They’re named after days of the week—each girl going out on her corresponding day. Monday goes missing, and they try to find her. \n\nIt’s amazing. Totally a great filler while we wait for Black Mirror. ",
        "created_utc": 1533329172,
        "upvote_ratio": ""
    },
    {
        "title": "Black mirror wider reading",
        "author": "tuberous_sclerosis",
        "url": "https://www.reddit.com/r/blackmirror/comments/94bl0o/black_mirror_wider_reading/",
        "text": "I was thinking about the main themes of Black Mirror, helplessness, having control taken away from you and the feeling of being in a trap and if there are any other short stories that share them. \n\nThe first one that springs to mind is “I have no mouth, and I must scream”, this is of course a very similar story to USS Calister.\n\nhttps://wjccschools.org/wp-content/uploads/sites/2/2016/01/I-Have-No-Mouth-But-I-Must-Scream-by-Harlan-Ellison.pdf\n\nThe second one is “The Jaunt” by Stephen King, here the ironic punishment for being curious about how a technology really works is quite literally a fate worse than death. The punishment far far outweighs the indiscretion, yet the universe is completely indifferent. This is a common them in Black Mirror. \n\nIf anyone could direct me to any more short stories that feel like they could be a Black Mirror episode, I would be most appreciative.\n",
        "created_utc": 1533317317,
        "upvote_ratio": ""
    },
    {
        "title": "Film based on 'Black Mirror' episode 'in development hell' after Robert Downey Jr's option runs out",
        "author": "thombutler",
        "url": "https://uk.movies.yahoo.com/film-based-jesse-armstrongs-black-mirror-episode-development-hell-robert-downey-jrs-option-runs-exclusive-113149881.html",
        "text": "",
        "created_utc": 1533304760,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best Black Mirror Character? Bracket-Tournament Round 3 is up! Results of round 2.",
        "author": "WeirdInspector",
        "url": "https://www.reddit.com/r/blackmirror/comments/9490mz/what_is_the_best_black_mirror_character/",
        "text": "At [https://www.polltab.com/bracket-poll/rkuYa\\_sNm](https://www.polltab.com/bracket-poll/rkuYa_sNm) you can vote for your favourite characters in a bracket competition.\n\n(Each two days the next round will be played.)\n\nThanks for voting all, around 55 votes per matchup this time \n\nMatt beats Bella (83% vs 17%)\n\nNish beats Sara (79% vs 21%)\n\nRobert beats Mia (77% vs 23%)\n\nJoe beats Ash (67% vs 33%)\n\nKelly beats Yorkie (61% vs 39%)\n\nNanette beats Bing (55% vs 45%)\n\nLacie beats Frank (55% vs 45%)\n\nKarin beats Hector (51% vs 49%)\n\nInteresting fact, out of the 8 final contenders, USS Callister (Robert and Nanette) and White Christmas (Joe and Matt) both send two.\n\nWhat are your opinions about the results?",
        "created_utc": 1533298023,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone ever read the YA novels Need or Erebos?",
        "author": "StarChild413",
        "url": "https://www.reddit.com/r/blackmirror/comments/945ciw/has_anyone_ever_read_the_ya_novels_need_or_erebos/",
        "text": "There's a lot of posts on here recommending Black-Mirror-esque fiction and I just wanted to take the opportunity to talk about these two books (which I want to make into movies if I can get the rights). The common factor in the Black-Mirror-esque tech at the heart of them is both involve some kind of application that makes users do mysterious escalating favors for great rewards but that's their only commonality (besides centering around high schoolers).\n\nThe tech in Need is a website of that name where you type in what you want (doesn't have to be material but it has to be within reason e.g. no wishing for world peace or time travel or alien contact) and it gives you some sort of task to do as a \"price\" for what you asked for (task difficulty is equivalent to how hard it'd be for the people behind Need to give you what you ask for, quid pro quo). The main character wants her sick brother to get the kidney he needs and you can imagine what transpires after that (no, her task isn't to KO someone and steal their kidney, the Need people take care of the acquisition of the thing). And she isn't the only one in her town to ask such difficult things of it but she's the only one to start suspecting a hidden agenda behind the tasks.\n\nBy contrast, the application asking favors in Erebos is the titular WoW-Expy MMORPG that, in addition to the regular in-game quests, asks mysterious irl challenges as quests that reward characters with an auto-level-up and the only way you can get a hold of it is getting a copy from another player (in a very MLM-esque move, sometimes those \"irl quests\" ask players to recruit particular people it somehow knows they know)",
        "created_utc": 1533260229,
        "upvote_ratio": ""
    },
    {
        "title": "Shut Up and Dance Spam",
        "author": "aurorasarus",
        "url": "https://www.reddit.com/r/blackmirror/comments/942ng3/shut_up_and_dance_spam/",
        "text": "Received this spam email today and had to laugh at the attempt to rip off Black Mirror's Shut Up and Dance!\n\n\"Hi, victim.\nI writе you beсаuse I put а malwаrе оn thе web pagе with pоrn whiсh you hаvе visitеd.\nMy virus grabbed all your persоnal info аnd turnеd оn yоur саmera which саpturеd thе prосеss of your onanism. Just аftеr that thе sоft savеd your contасt list.\nI will delеtе thе compromising video and infо if you раy mе 600 EURO in bitcоin. This is addrеss fоr pаyment : 1Fq6hDk1mrxedgghSUjH66zHsg6ud9bktv\n \nI givе you 24 hours аftеr yоu ореn my mеssage fоr mаking the transaсtion.\nAs soоn as you rеad the mеssagе I'll see it right away.\nIt is nоt neсеssary tо tеll mе that yоu havе sent mоney tо me. This аddrеss is сonnеcted tо yоu, my system will dеlеtе evеrything аutоmаtiсаlly аftеr transfer confirmаtion.\nIf yоu neеd 48 h just rерly оn this lеtter with +.\nYou саn visit thе роlice station but nоbоdy саn help yоu.\nIf yоu try tо dеcеive mе , I'll see it right аwаy !\nI dоnt livе in yоur сountry. Sо they саn nоt trаck my lосatiоn еven fоr 9 months.\nGoodbyе. Dont forgеt about the shamе and tо ignоre, Yоur life саn be ruined.\"\n",
        "created_utc": 1533239893,
        "upvote_ratio": ""
    },
    {
        "title": "Its like they are getting all the ideas from the show :-P",
        "author": "[deleted]",
        "url": "https://i.redd.it/usdzdhk1zpd11.png",
        "text": "[deleted]",
        "created_utc": 1533232887,
        "upvote_ratio": ""
    },
    {
        "title": "Something bad happens there",
        "author": "ForzaFezza",
        "url": "https://i.redd.it/rt7mc734rpd11.jpg",
        "text": "",
        "created_utc": 1533230226,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone watched Phillip K. Ducks Electric dreams ?",
        "author": "regrettheprophet",
        "url": "https://www.reddit.com/r/blackmirror/comments/940m13/anyone_watched_phillip_k_ducks_electric_dreams/",
        "text": "I just started this series and it reminds me so much of blascl mirror what are your guys thoughts on it?",
        "created_utc": 1533226165,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror: Thoughts and Prayers",
        "author": "[deleted]",
        "url": "http://time.com/5344265/3d-printed-guns-legal/",
        "text": "[deleted]",
        "created_utc": 1533200132,
        "upvote_ratio": ""
    },
    {
        "title": "What is this still from?",
        "author": "eam1188",
        "url": "https://imgur.com/967Z8Da",
        "text": "",
        "created_utc": 1533193112,
        "upvote_ratio": ""
    },
    {
        "title": "[deleted by user]",
        "author": "anandcu3",
        "url": "https://i.redd.it/vq3947ezfid11.jpg",
        "text": "",
        "created_utc": 1533180250,
        "upvote_ratio": ""
    },
    {
        "title": "Is this Nosedive?",
        "author": "Din0chickenugget",
        "url": "https://i.redd.it/0m2n99vo4ld11.jpg",
        "text": "",
        "created_utc": 1533174250,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any release date on season 5 yet or any like speculation?",
        "author": "antman2025",
        "url": "https://www.reddit.com/r/blackmirror/comments/93uyrs/is_there_any_release_date_on_season_5_yet_or_any/",
        "text": "Is there any release date on season 5 yet or any like speculation?",
        "created_utc": 1533172666,
        "upvote_ratio": ""
    },
    {
        "title": "Just a reminder: San Junipero's ending and the truth behind it.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/93s22k/just_a_reminder_san_juniperos_ending_and_the/",
        "text": "[deleted]",
        "created_utc": 1533151166,
        "upvote_ratio": ""
    },
    {
        "title": "Emmys: ‘USS Callister’ and ‘Versace’ Aim For TV Movie and Limited Series Gold",
        "author": "AliceFlores345",
        "url": "https://www.indiewire.com/2018/08/emmy-nominations-limited-series-tv-movie-black-mirror-uss-callister-assassination-gianni-versace-american-crime-story-1201990029/",
        "text": "",
        "created_utc": 1533149131,
        "upvote_ratio": ""
    },
    {
        "title": "Has watching Black Mirror affected you in your day to day life at all?",
        "author": "purpleyellowpaint",
        "url": "https://www.reddit.com/r/blackmirror/comments/93rhow/has_watching_black_mirror_affected_you_in_your/",
        "text": "If so, how? Has it changed how you look at certain things?",
        "created_utc": 1533147381,
        "upvote_ratio": ""
    },
    {
        "title": "So I was at the Boston Science Museum",
        "author": "vipulperiwal",
        "url": "https://i.redd.it/q1lk3ui2ohd11.jpg",
        "text": "",
        "created_utc": 1533132340,
        "upvote_ratio": ""
    },
    {
        "title": "Is the Black Mirror Volume 1 book available anywhere?",
        "author": "Jive_McFuzz",
        "url": "https://www.reddit.com/r/blackmirror/comments/93p35f/is_the_black_mirror_volume_1_book_available/",
        "text": "I thought this book was supposed to be released a while ago but it does not seem to actually be available on any of the sites that list it. Anyone know if it is actually out? And if it is where I can buy it?",
        "created_utc": 1533131188,
        "upvote_ratio": ""
    },
    {
        "title": "Season 5 Article with lots of speculation (no real spoilers)",
        "author": "eyezofnight",
        "url": "https://www.express.co.uk/showbiz/tv-radio/996782/Black-Mirror-season-5-spoilers-episodes-sequel-Netflix-Charlie-Brooker-series",
        "text": "",
        "created_utc": 1533130105,
        "upvote_ratio": ""
    },
    {
        "title": "Reminded me of something...",
        "author": "lukeber4",
        "url": "https://www.cnet.com/news/china-launches-high-tech-bird-drones-to-watch-over-its-citizens/",
        "text": "",
        "created_utc": 1533129738,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best Black Mirror Character? Bracket-Tournament Round 2 is up! Results of round 1.",
        "author": "WeirdInspector",
        "url": "https://www.reddit.com/r/blackmirror/comments/93oq3v/what_is_the_best_black_mirror_character/",
        "text": "At [https://www.polltab.com/bracket-poll/rkuYa\\_sNm](https://www.polltab.com/bracket-poll/rkuYa_sNm) you can vote for your favourite characters in a bracket competition.\n\n(Each two days the next round will be played.)\n\nThanks for voting all, around 300 votes per matchup was a nice amount.\n\n**Round 1 ended up with some interesting results, here are the results in order of clear win to slightly ahead.**\n\nMatt beats Michael (78% vs 22%) - Love-making with a pig can't help the PM get a good result against the cookie-expert.\n\nBing beats Cooper (69% vs 31%) - Bing makes Cooper call for his mom with his speech\n\nJoe beats Victoria (67% vs 33%) - Both trapped in a neverending loop, Joe takes the best of screaming Vic\n\nRobert beats Jem (66% vs 34%) - Oh he's a jolly good fellow, beating amusement-park actress by a big margin.\n\nNish beats Abi (64% vs 36%) - Nish drives away with the win, setting Abi on fire, who didn't gain enough merits/votes\n\nYorkie beats Martha (63% vs 37%) - A walk in the park for Yorkie, while Martha mourns again with another loss.\n\nKarin beats Jamie (62% vs 38%) - A bee-autifully accomplished win, leaving Jamie behind, wondering where Waldo is.\n\nLacie beats Liam (62% vs 38%) - Miss Nosedive has the better ratings, Liam needs to evaluate what went wrong.\n\nNanette beats Kenny (60% vs 40%) - Kenny crosses a red line, Nanette makes him look like a little kid (not 'look at')\n\nFrank beats Blue (60% vs 40%) - 99.8% chance he would win against Blue, who couldn't hunt this man down.\n\nAsh beats Stripe (60% vs 40%) - Don't know if human or AI Ash did it, but he exterminated Stripe like a roach.\n\nSarah beats Gwendolyn (60% vs 40%) - She beats up women with tablets and votes, making Gwen lose another election.\n\nHector beats Rolo (59% vs 41%) - Rolo tried to blackmail Hector, and wanted to make him suffer, but Hector pulls ahead.\n\nMia beats Marie (56% vs 44%) - Mia is better at beating panicky mothers than guinea pigs, she takes this round.\n\nBella beats Ffion (53% vs 47%) - Close fight, but Ffion can't cheat this time, Bella wins this race\n\nKelly beats Amy (51% vs 49%) - Just a few votes separated these BM-legends, but Kelly outdances the mismatched Amy.\n\nWhat are your thoughts on these results? And good luck with voting in the next round (til August 2nd, 23:59)",
        "created_utc": 1533128281,
        "upvote_ratio": ""
    },
    {
        "title": "So has anyone found out where to buy the monkey yet?",
        "author": "lostgate",
        "url": "https://www.reddit.com/r/blackmirror/comments/93nyh3/so_has_anyone_found_out_where_to_buy_the_monkey/",
        "text": "I've spent the last 7 months looking all over for it, mainly in various shops in the UK and a little online, and I've not found it yet. I've seen a couple that are close, but not the exact one. Anyone had better luck than me?",
        "created_utc": 1533121175,
        "upvote_ratio": ""
    },
    {
        "title": "r/BlackMirror Reddit Chat Room",
        "author": "anonboxis",
        "url": "https://s.reddit.com/channel/856312_0999b2a61bb5884c26c454f84094b7293db81266",
        "text": "",
        "created_utc": 1533117082,
        "upvote_ratio": ""
    },
    {
        "title": "Hang the DJ possible plot hole in the last scene.",
        "author": "chickapowpow",
        "url": "https://www.reddit.com/r/blackmirror/comments/93lkie/hang_the_dj_possible_plot_hole_in_the_last_scene/",
        "text": "The last scene of Hang the DJ, you see the profile pictures of each main character in eachother’s black-mirror-ish pebble. But in Amy’s pebble, it was of another man’s face, and not Franks. \n\nCan someone explain this? Or am I not recognizing Frank’s face. \n\nUPDATE: I had to re-watched the scene twice!! And now i can kinda see Frank's face. PHEW all makes sense in the world now. In the pebble, he's got such dark hair. While, I initially thought it was more of a dirty blonde. Anyhow, thanks for the input yall! ",
        "created_utc": 1533095698,
        "upvote_ratio": ""
    },
    {
        "title": "Unfriended- The Dark Web has a Black Mirror vibe",
        "author": "CaptainNinjaX",
        "url": "https://www.reddit.com/r/blackmirror/comments/93liio/unfriended_the_dark_web_has_a_black_mirror_vibe/",
        "text": "Just saw this at the movies but great film. Reminds me of Shut Up and Dance but maybe darker. Worth a watch",
        "created_utc": 1533095229,
        "upvote_ratio": ""
    },
    {
        "title": "Alexa loves you!",
        "author": "tabinom",
        "url": "https://i.redd.it/f911zq2s5ed11.jpg",
        "text": "",
        "created_utc": 1533089868,
        "upvote_ratio": ""
    },
    {
        "title": "I think it would have been cool to see these in Metalhead",
        "author": "WobbegongShark",
        "url": "https://i.redd.it/a37vrt23ydd11.jpg",
        "text": "",
        "created_utc": 1533087938,
        "upvote_ratio": ""
    },
    {
        "title": "If you lived in the reality of White Christmas, would you get a “cookie” of yourself?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/93jt56/if_you_lived_in_the_reality_of_white_christmas/",
        "text": "[deleted]",
        "created_utc": 1533081209,
        "upvote_ratio": ""
    },
    {
        "title": "Eyes in the Sky: How to Quantify Your Life",
        "author": "likhuta",
        "url": "https://lawless.tech/eyes-in-the-sky-how-to-quantify-your-life/",
        "text": "",
        "created_utc": 1533078240,
        "upvote_ratio": ""
    },
    {
        "title": "Is it just me or is the Waldo Moment completely under appreciated?",
        "author": "12manyNs",
        "url": "https://www.reddit.com/r/blackmirror/comments/93iz48/is_it_just_me_or_is_the_waldo_moment_completely/",
        "text": "I’ll keep this short and sweet. \n\nNot sure it’s in my top 5 but its eerie how well it predicted Trump’s campaign. I don’t think most people realize this episode was made well BEFORE Trump was elected. I know I didn’t at first and found it a stereotypical metaphor for the Trump. When I found out it was released in Feb 2013 I was shocked. It completely nails how quick zingers and slogans without substance can gain support of the everyday people quicker than substantive arguments. I could go on with the other similarities between the two campaigns but I think we all get the point.\n\nI see a lot of statements (when browsing the history) saying it reminded people too much of the 2016 election yet the fact that it holds so many parallels (when made ~3 years earlier) is why I appreciate it.\n\nCurious on the thoughts of those that knew it was made in 2013 and those that didn’t before reading my post.",
        "created_utc": 1533074916,
        "upvote_ratio": ""
    },
    {
        "title": "If you're suffering from Black Mirror withdrawal...",
        "author": "CyberPancakes",
        "url": "https://www.reddit.com/r/blackmirror/comments/93ifm3/if_youre_suffering_from_black_mirror_withdrawal/",
        "text": "I highly recommend the movie \"Snowpiercer\" if you haven't seen it already. It's like a 2 hour BM episode in a lot of ways. ",
        "created_utc": 1533071121,
        "upvote_ratio": ""
    },
    {
        "title": "Its happening",
        "author": "NessBeast",
        "url": "https://i.redd.it/mawp1sj1aad11.jpg",
        "text": "",
        "created_utc": 1533066982,
        "upvote_ratio": ""
    },
    {
        "title": "How many episodes does this kind of thing feature in?",
        "author": "LiamSkerritt",
        "url": "https://www.reddit.com/r/AskWomen/comments/935l97/if_everyone_were_suddenly_forced_to_have_a_number/",
        "text": "",
        "created_utc": 1533061895,
        "upvote_ratio": ""
    },
    {
        "title": "My little sister dragged me into bulid-a-bear and i couldnt resist making this for my long distance boyfriend.",
        "author": "the_shortie",
        "url": "https://v.redd.it/w3mvnd05rbd11",
        "text": "",
        "created_utc": 1533060909,
        "upvote_ratio": ""
    },
    {
        "title": "“Be Right Back” ranked 20th on The Ringer’s 100 Best TV Episodes of the Century.",
        "author": "_famousjameis",
        "url": "http://besttv.theringer.com",
        "text": "",
        "created_utc": 1533060235,
        "upvote_ratio": ""
    },
    {
        "title": "Why isn’t my score changing?",
        "author": "purpleyellowpaint",
        "url": "https://www.reddit.com/r/blackmirror/comments/93gpwy/why_isnt_my_score_changing/",
        "text": "This is gonna sound stupid as hell, I know. I had a 4.something rating but then I got heavily downvoted a few months ago after asking what happened with Zuckerberg because I honestly didn’t know. That brought it to a 2.975, which is what it is now. But since then I’ve made some posts and comments with a decent amount of upvoted on here - and my score isn’t changing. Am I delusional? Am I doing it wrong? Am I obsessing about it too much (don’t answer that. I already know.) thanks.",
        "created_utc": 1533059505,
        "upvote_ratio": ""
    },
    {
        "title": "cant remember the name of this episode... HELP!:(",
        "author": "oldiebutgoodie1234",
        "url": "https://www.reddit.com/r/blackmirror/comments/93fzpw/cant_remember_the_name_of_this_episode_help/",
        "text": "Im confused.... Im on netflix trying to watch black mirror, but there are only like 4?5 episodes per season.... i used to watch it on a different (free) website and remember them having many more episodes.. \nAnyway, one episode i watched a while back was taking place in this white cell-like plce, and everyone was placed into this cell with a huge screen. they have to dance or enter this talent show thing... i remember them getting coins? or virtual money for something good they do &amp; they can use it for vending machine or smt... Oh they were also shown this provocative video every few hours? and had to watch all that to get virtual money... DOES ANYONE KNOW THIS EPISODE? the main actor was a buff guy... thanks :(",
        "created_utc": 1533054671,
        "upvote_ratio": ""
    },
    {
        "title": "CAKE - a short film starring Letitia Wright and Maxine Peake",
        "author": "gymnol7412",
        "url": "https://www.youtube.com/watch?v=_vCr8TyaaPQ",
        "text": "",
        "created_utc": 1533052842,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone Who Knows What Love Is - Irma Thomas | Solo Guitar Arrangement",
        "author": "matthewnjee",
        "url": "https://www.youtube.com/watch?v=-LFbFbTa9Dc",
        "text": "",
        "created_utc": 1533037633,
        "upvote_ratio": ""
    },
    {
        "title": "This film gave me major Black Mirror vibes",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=pWIykrdenoU",
        "text": "[deleted]",
        "created_utc": 1533033723,
        "upvote_ratio": ""
    },
    {
        "title": "I fixed my daddy. Now he can serve me fine wine, fix my plumbing, be polite and interesting to my parents, and then take me home and choke me...",
        "author": "kunkudukai",
        "url": "https://i.redd.it/iljwe18i26d11.jpg",
        "text": "",
        "created_utc": 1533033357,
        "upvote_ratio": ""
    },
    {
        "title": "22 eerie photos show how China uses facial recognition to track its citizens as they travel, shop — and even use toilet paper",
        "author": "Ragnarokcometh",
        "url": "https://nordic.businessinsider.com/how-china-uses-facial-recognition-technology-surveillance-2018-2",
        "text": "",
        "created_utc": 1533008193,
        "upvote_ratio": ""
    },
    {
        "title": "A theory about the voices in White Christmas",
        "author": "squibby77",
        "url": "https://www.reddit.com/r/blackmirror/comments/93a1wu/a_theory_about_the_voices_in_white_christmas/",
        "text": "When I first watched White Christmas I assumed that the women who killed her self and the guy she was with was schizophrenic or something. Now,\nhowever, having watched the rest of the series and learned about cookies, I wonder if she might have had a cookie in her head that was driving her to be crazy? Maybe something like in Black Museum where a cookie from a dead person lives in someone’s head? That would make this part of the episode even darker imo...",
        "created_utc": 1533000064,
        "upvote_ratio": ""
    },
    {
        "title": "Crocodile [Spoiler Alert]",
        "author": "CreampuffOfLove",
        "url": "https://www.reddit.com/r/blackmirror/comments/939n27/crocodile_spoiler_alert/",
        "text": "I avoided this episode for MONTHS based on the title and the love/hate reactions I saw on here - I'm more of a Most Hated In The Nation type - but I saw it tonight and just...WOW. \n\n80s-esque technology portrayal aside, the (/spoiler text to be hidden)bloody guinea pig is the key to solving it all after the fact?!",
        "created_utc": 1532996681,
        "upvote_ratio": ""
    },
    {
        "title": "Hey guys watch Extinction on Netflix now!",
        "author": "zGunrath",
        "url": "https://www.reddit.com/r/blackmirror/comments/937oe2/hey_guys_watch_extinction_on_netflix_now/",
        "text": "Movie is incredibly Black Mirror like, go in blind and keep watching.",
        "created_utc": 1532982344,
        "upvote_ratio": ""
    },
    {
        "title": "Black Beach.03",
        "author": "clueless_as_fuck",
        "url": "https://i.imgur.com/JSEU0I9.jpg",
        "text": "",
        "created_utc": 1532978806,
        "upvote_ratio": ""
    },
    {
        "title": "How Black Mirror Writes A Twist",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=_ahStuRUAQM&amp;t=106s",
        "text": "[deleted]",
        "created_utc": 1532974300,
        "upvote_ratio": ""
    },
    {
        "title": "#DeathTo",
        "author": "[deleted]",
        "url": "https://i.redd.it/nbjc78p494d11.jpg",
        "text": "[deleted]",
        "created_utc": 1532969928,
        "upvote_ratio": ""
    },
    {
        "title": "You have to make one piece of technology from Black Mirror reality.",
        "author": "purpleyellowpaint",
        "url": "https://www.reddit.com/r/blackmirror/comments/935pze/you_have_to_make_one_piece_of_technology_from/",
        "text": "What do you chose, and why?  ",
        "created_utc": 1532969285,
        "upvote_ratio": ""
    },
    {
        "title": "Character names",
        "author": "Allinallisallweare02",
        "url": "https://www.reddit.com/r/blackmirror/comments/934tol/character_names/",
        "text": "how do we know the names/last names of characters which were not mentioned in the show? For example, Bing's name is Bingham Madsen. We are never told this in the episode. Or that martha's last name from Be Right Back is Powell. there are many examples of the blanks being filled in when it comes to characters names, even to the point where wikipedia says that the name of the kid they are getting the bear for in metalhead is jack. how do we know these things?",
        "created_utc": 1532963105,
        "upvote_ratio": ""
    },
    {
        "title": "Questions about ending of S4E01 - USS Callister",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/934f5m/questions_about_ending_of_s4e01_uss_callister/",
        "text": "[Spoiler Alert](/s \"Firstly the characters in the game are full thinking sentient beings right? So why at the end when they 'survive' and end up in the main game are they just like ''Woo yeah, let's go on adventures!''?\nThey can now contact the outside world. Don't they want to know what year it is, how Walton's son is doing, does Nanette not want to let her true self know that it was her that blackmailed her and Daly is this twisted freak with his own modded version, etc?\nAlso if Daly dies then isn't real life Nanette screwed? A murder investigation would likely happen and the only evidence of anyone else being there is her with her fingerprints. She'd be charged with his murder. Yet virtual Nanette is happy to just get on with life inside a simulation?\nIt seems like having the ending be that they survive there are huge implications to this that are just not tackled at all and brushed aside with a cheesy \"Let's get outta here!\" attitude which does lend gravity to the situation at all.\nReally enjoyed the episode initially the more I think about the more plot holes become apparent and that ending is just so jarring.\")",
        "created_utc": 1532960165,
        "upvote_ratio": ""
    },
    {
        "title": "Re-re-rewatching episodes",
        "author": "Haltonch",
        "url": "https://www.reddit.com/r/blackmirror/comments/932uxc/rererewatching_episodes/",
        "text": "I'm on another rewatch of the show, which means that I will have seen some early episodes 6-7 times. But no matter how often I watch the episodes, even if I saw them a couple of months ago, they never stop being packed with emotion and darkly perfect to me.\n\nSo my questions are to those who have seen the episodes a lot: what's your record for most watches? And how does this affect how you view each episode? Are there any episodes you got bored of, or found an appreciation of, long after your first watch? What details did you only notice when watching an episode for the umpteenth time?\n\nFor me, it was only on my sixth watch of \"The National Anthem\" that I really noticed scenes of Carlton Bloom (the kidnapper) in his workshop were interspersed with the scenes of the public (in the pub and hospital, and the guy at home). And I first watched \"Be Right Back\" when it aired in 2013, so I was a lot younger and didn't really appreciate the poignancy of the ending (Martha's mum put all her pictures of loved ones in the attic when they passed away).\n\nSince my first watch, my opinions on the episodes haven't changed much, other than that now I love \"Fifteen Million Merits\" and \"Hated in the Nation\" more. Almost every episode I still find breathtaking and devastating.",
        "created_utc": 1532945638,
        "upvote_ratio": ""
    },
    {
        "title": "Are the Hackers from USS Callister that are blackmailing, the same Hackers blackmailing everyone else in the Shut Up And Dance episode, once they escaped and entered the Cloud???",
        "author": "[deleted]",
        "url": "https://i.redd.it/nzcoqfso91d11.png",
        "text": "[deleted]",
        "created_utc": 1532934135,
        "upvote_ratio": ""
    },
    {
        "title": "The Running Man by Richard Bachman",
        "author": "mexiwok",
        "url": "https://www.reddit.com/r/blackmirror/comments/9313xb/the_running_man_by_richard_bachman/",
        "text": "Is a book that has a super heavy Black Mirror vibe to it despite it coming out in the late 70s/early 80s. Completely different than the movie, that book wrecked me when I read it and now after watching Black Mirror, I want to see adapted correctly.",
        "created_utc": 1532925585,
        "upvote_ratio": ""
    },
    {
        "title": "I’ve watched White Bear for the fourth time and I think it’s the darkest episode in the entire series.",
        "author": "mb2bruh",
        "url": "https://www.reddit.com/r/blackmirror/comments/930zyt/ive_watched_white_bear_for_the_fourth_time_and_i/",
        "text": "At the end of the episode, when the credits start, they start showing how the amusement park works.  They start by  showing the sign of White Bear theme park, and on the bottom it has pricing for daily parking tariffs for cars, buses, and motorcycles.  The fact that people would individually drive a fucking motorcycle to see the girl’s suffering blows me away.  Not to mention that they amusement park is making profits off of the parking.  So fucking dark.  ",
        "created_utc": 1532924476,
        "upvote_ratio": ""
    },
    {
        "title": "I dont think I can continue watching this show after shut up and dance",
        "author": "Quarkoo",
        "url": "https://www.reddit.com/r/blackmirror/comments/930lpw/i_dont_think_i_can_continue_watching_this_show/",
        "text": "Most of the other episodes were alright, but this was way to fucking much, am I the only that thinks this episode went a little too far? With the suicide attempt and child pornography? ",
        "created_utc": 1532920678,
        "upvote_ratio": ""
    },
    {
        "title": "Shut Up and Dance is my favorite episode I’ve watched so far and I can no longer watch this show as a result",
        "author": "Pwntagonist",
        "url": "https://www.reddit.com/r/blackmirror/comments/92xis3/shut_up_and_dance_is_my_favorite_episode_ive/",
        "text": "I’ve watched White Christmas, USS Callister, San Junipero, Playtest, 15 Million Merits, Be Right Back, and Shut Up and Dance.\n\nMy top 3 would be Shut Up and Dance &gt; USS Callister &gt; White Christmas, but... none of them even come close to Shut Up and Dance in my opinion, which was the one I watched most recently.\n\nThis episode is... horrifying, suspenseful, thrilling, and masterfully directed, and it does the best job at creating a morally grey situation I’ve seen so far. Don’t get me wrong, there are other great episodes, but in my opinion nothing even comes close to this one, at least from what I’ve seen.\n\nDoes anyone else feel the same way and what other eps would I like?",
        "created_utc": 1532894201,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best Black Mirror Character? Bracket-Tournament",
        "author": "WeirdInspector",
        "url": "https://www.reddit.com/r/blackmirror/comments/92wksh/what_is_the_best_black_mirror_character/",
        "text": "At [https://www.polltab.com/bracket-poll/rkuYa\\_sNm](https://www.polltab.com/bracket-poll/rkuYa_sNm) you can vote for your favourite characters in a bracket competition.\n\n(Each two days the next round will be played.)",
        "created_utc": 1532886713,
        "upvote_ratio": ""
    },
    {
        "title": "It's been a while since there's been an Overrated/Underrated thread. Let's Argue!",
        "author": "yamanbt",
        "url": "https://www.reddit.com/r/blackmirror/comments/92wfw2/its_been_a_while_since_theres_been_an/",
        "text": "Overrated: White Christmas, Shut Up and Dance\n\nUnderrated: Men Against Fire, Playtest\n\n\n\n\nfight me.",
        "created_utc": 1532885626,
        "upvote_ratio": ""
    },
    {
        "title": "Its happening.",
        "author": "Omnissah",
        "url": "https://www.reddit.com/r/blackmirror/comments/92wcbx/its_happening/",
        "text": "So, I was in RBC the other day, (Royal Bank of Canada) setting up an account, and the advisor noticed I had a Fitbit. \n\nThey mentioned that RBC had partnered with the Can.Gov and created an app called Carrot. \n\nWhat does this app do?\n\nIt tracks your steps and fitness level and turns it into credits for rewards, such as movie passes, gift cards, ect. \n\nThat's some 15 million merits crap right there. ",
        "created_utc": 1532884824,
        "upvote_ratio": ""
    },
    {
        "title": "Indecent content detected",
        "author": "zzman94",
        "url": "https://i.imgur.com/25JasZs.jpg",
        "text": "",
        "created_utc": 1532882557,
        "upvote_ratio": ""
    },
    {
        "title": "Playtest is one of my favorites",
        "author": "WobbegongShark",
        "url": "https://i.redd.it/tu9u3rxfopc11.jpg",
        "text": "",
        "created_utc": 1532881022,
        "upvote_ratio": ""
    },
    {
        "title": "I was stood taking a photo of my girlfriend in the sea, then realised so was every other Instagram boyfriend.",
        "author": "mooncolours",
        "url": "https://i.redd.it/u714unk77vc11.jpg",
        "text": "",
        "created_utc": 1532880604,
        "upvote_ratio": ""
    },
    {
        "title": "Can we stop posting all of our spam emails here?",
        "author": "CycleWheel",
        "url": "https://www.reddit.com/r/blackmirror/comments/92vtri/can_we_stop_posting_all_of_our_spam_emails_here/",
        "text": "Cheers lads.\n\nI'm tempted to unsub until the next season, was hoping for some discussion of the episodes but with 90% of posts that reach my front-page being 'fluff'...",
        "created_utc": 1532880583,
        "upvote_ratio": ""
    },
    {
        "title": "Shut Up and Dance young man on his phone, one of the hackers?",
        "author": "PurpleDragon9",
        "url": "https://www.reddit.com/r/blackmirror/comments/92v1ou/shut_up_and_dance_young_man_on_his_phone_one_of/",
        "text": "In Shut up and Dance when Kenny and Bronn walk out of the hotel, the camera focuses on a guy on his phone, looking at Kenny and Hector, do you think he could be working with the hackers keeping an eye on them? same thing for the guy stood outside the bank making Hector nervous.",
        "created_utc": 1532873822,
        "upvote_ratio": ""
    },
    {
        "title": "[Spoiler] What would be the outcome of the participants if shut up and dance happened in real life?",
        "author": "jakalanski",
        "url": "https://www.reddit.com/r/blackmirror/comments/92up8g/spoiler_what_would_be_the_outcome_of_the/",
        "text": "Imagine the story was real and Kenny got arrested if he showed all those texts to the authorities how bad would his punishment be? Would he receive any leniency at all? To make it simple imagine he didn't jack off to CP but normal porn and this happened in UK. ",
        "created_utc": 1532870305,
        "upvote_ratio": ""
    },
    {
        "title": "Wait a minute, i think we r living in the 'Waldo moment' era folks...",
        "author": "disyamac",
        "url": "https://www.reddit.com/r/blackmirror/comments/92ujh7/wait_a_minute_i_think_we_r_living_in_the_waldo/",
        "text": "Black Mirror: The Waldo Moment\nhttps://www.imdb.com/title/tt2386296/",
        "created_utc": 1532868578,
        "upvote_ratio": ""
    },
    {
        "title": "\"Hang The DJ\" (and other \"Blasphemous Rumors\")",
        "author": "Aarxn82",
        "url": "https://onpiratesatellite.com/home/hang-the-dj-and-other-blasphemous-rumors?format=amp&amp;__twitter_impression=true",
        "text": "",
        "created_utc": 1532865498,
        "upvote_ratio": ""
    },
    {
        "title": "Shut Up &amp; Dance ?",
        "author": "PiyushTechor",
        "url": "https://i.redd.it/o6z3g2cp3vc11.png",
        "text": "",
        "created_utc": 1532859141,
        "upvote_ratio": ""
    },
    {
        "title": "I think I've been \"Shut Up and Dance\"d",
        "author": "transfo47",
        "url": "https://i.imgur.com/IOeRBCY.png",
        "text": "",
        "created_utc": 1532855782,
        "upvote_ratio": ""
    },
    {
        "title": "White Christmas opinion?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/92shu4/white_christmas_opinion/",
        "text": "[removed]",
        "created_utc": 1532840897,
        "upvote_ratio": ""
    },
    {
        "title": "Nosedive in action",
        "author": "mgdmw",
        "url": "https://i.redd.it/a9vouzbe0qc11.jpg",
        "text": "",
        "created_utc": 1532821959,
        "upvote_ratio": ""
    },
    {
        "title": "The Netflix film 'Extincion'",
        "author": "Appelcien",
        "url": "https://www.reddit.com/r/blackmirror/comments/92px1i/the_netflix_film_extincion/",
        "text": "Have you guys seen the new Netflix film Extincion? It's really giving me Black Mirror vibes and just feels like a long episode! The stuffed monkey even reminds me of the monkey in Black Museum.\n\nI think it's a good film and definitely worth a watch! 😁",
        "created_utc": 1532815834,
        "upvote_ratio": ""
    },
    {
        "title": "What if you knew the biases of every potential juror in your courtroom? [real life]",
        "author": "tom2121bbc",
        "url": "https://jury-x.com/",
        "text": "",
        "created_utc": 1532807424,
        "upvote_ratio": ""
    },
    {
        "title": "Worth Watch ?",
        "author": "jaka121",
        "url": "https://www.reddit.com/r/blackmirror/comments/92omck/worth_watch/",
        "text": " Worth  watch this show ? is good? ",
        "created_utc": 1532805168,
        "upvote_ratio": ""
    },
    {
        "title": "What’s a fitting legal punishment for Kenny?",
        "author": "phlibbertigibbet",
        "url": "https://www.reddit.com/r/blackmirror/comments/92ol1x/whats_a_fitting_legal_punishment_for_kenny/",
        "text": "Aside from the emotional destruction of his friends and family and future friends/family finding out about him... what would the legal repercussions be? What do you *think* the legal repercussions should be? \n\nLooks at child porn pics, then gets blackmailed. He has evidence on his phone that he was blackmailed into, basically, robbing a bank and killing a guy in self-defense (sort of... self-defense) - but he was still being blackmailed and could have turned himself in... Also, he fucked up by keeping the prize money. You see him with the backpack at the end when he gets caught. Like... c’mon. That’s gonna play badly in court. \n\nAnyway, I don’t have to summarize the whole episode, but I can’t help wondering what the post-arrest interrogation looks like. I wonder what the authorities and the judge would decide his sentence should be, given the whole story, which he of course has evidence for. Courts tend to be a tad more lenient on juveniles than adults in the US, but he *might* be 18+ since he had that job. ",
        "created_utc": 1532804875,
        "upvote_ratio": ""
    },
    {
        "title": "You have to make one piece of technology from Black Mirror real. Which one do you choose, and why?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/92mjve/you_have_to_make_one_piece_of_technology_from/",
        "text": "[removed]",
        "created_utc": 1532788552,
        "upvote_ratio": ""
    },
    {
        "title": "Credit scores are a mini real world version of Nosedive?",
        "author": "MaledictionSparkles",
        "url": "https://www.reddit.com/r/blackmirror/comments/92lucy/credit_scores_are_a_mini_real_world_version_of/",
        "text": "They qualify you for loans, if you have a bad score sometimes you won’t get the best terms... ",
        "created_utc": 1532781689,
        "upvote_ratio": ""
    },
    {
        "title": "Prime minister Callow...",
        "author": "filmandtvdiscussions",
        "url": "https://i.redd.it/2e9t78zcioc11.jpg",
        "text": "",
        "created_utc": 1532779325,
        "upvote_ratio": ""
    },
    {
        "title": "What episode is this image from?",
        "author": "zahcncam",
        "url": "https://i.redd.it/tneki0c1foc11.jpg",
        "text": "",
        "created_utc": 1532778207,
        "upvote_ratio": ""
    },
    {
        "title": "Gave me black mirror vibes",
        "author": "softserved_",
        "url": "https://i.redd.it/uvxep6ul9oc11.jpg",
        "text": "",
        "created_utc": 1532776378,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on \"Playlist\" theory??",
        "author": "_theMAUCHO_",
        "url": "https://www.reddit.com/r/blackmirror/comments/92lbj1/thoughts_on_playlist_theory/",
        "text": "Ok guys so I saw Playlist like 3 hours ago and I can't get myself to sleep lmao. I've been reading a lot about the episode and would like to know what you think about the theory that he actually died in the first plane in a crash and never even got to start his trip??\n\n\nPoints of discussion:\n\n\n1. When the mom calls him at first the only options in his phone are 'Answer' and 'Decline', but in the final scene there's 'Answer', 'Decline' and 'Message'. BM focuses to much in the little details for this to be an overlook. Maybe it means a message from above or beyond as the protagonist is dead??\n\n\n2. It's weird that they show the plane 'shaking' or not having a smooth ride for no reason at all. That whole plane scene is kinda uncomfy and weird. Some of the passangers look worried and uneasy at the bumpy ride. Again don't think they included this randomly.\n\n\n3. While on the plane, he's watching a movie with a HUGE spider on it and he's smiling and laughing at it, unlikely for someone who fears them so much even a little black spider freaks him out in the simulation. Maybe he started fearing spiders cause he relates it to the crash?\n\n\n4. The air hostess asks him to please turn off his phone, which he does. But by then it could have already been too late. In the final scene in the computer, the woman (Kate I think?) writes \"Cause of crash: Phone interference\" which could be a reference to the plane incident.\n\n\n5. When he meets his mom she looks like she has been crying, but his dad passed away at least 6 months ago if I'm not mistaken. She never mentions the dad but does mention him. \"Gotta call Cooper. Gotta make sure he's safe\" or something like that. That could imply that she feels guilty for not being able to talk to him and make sure he was safe before or during the trip. After he died on the plane she's traumatized and still tries to call him to prevent what happened, futelessly.\n\n\n6. In the \"Called Mom\" observation in the end, it could be that he called for his mom while the plane was falling or that he literally turned on his cellphone back and called her. After the crash she could have tried calling back to no avail which is what left her so traumatized.\n\n\n7. When he lost his money he wanted to call his mom but hesitated because he literally couldn't call her as he was already dead.\n\nI know there's a mention of the game company and a missing tourist in another ep. but maybe it was written by a different person or just as an easter egg that isn't meant to interfere with the different interpretations of 'Playtest'. But anyways guys what do you think??",
        "created_utc": 1532775473,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any character you think got what they deserved?",
        "author": "PurpleDragon9",
        "url": "https://www.reddit.com/r/blackmirror/comments/92las5/is_there_any_character_you_think_got_what_they/",
        "text": "For me probably Rolo Haynes and Mia, Rolo being killed and Mia being arrested for all the people she killed.",
        "created_utc": 1532775205,
        "upvote_ratio": ""
    },
    {
        "title": "snapchat film scarier than black mirror",
        "author": "IntelligentHunter",
        "url": "https://vimeo.com/202796971",
        "text": "",
        "created_utc": 1532771629,
        "upvote_ratio": ""
    },
    {
        "title": "The movie \"Ex Machina\" is on Netflix. It's similar to Black Mirror and any fan of the show would probably like it.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/92jipy/the_movie_ex_machina_is_on_netflix_its_similar_to/",
        "text": "[removed]",
        "created_utc": 1532752960,
        "upvote_ratio": ""
    }
]