[
    {
        "title": "Most boring BM episode concept?",
        "author": "NeonFireFly99",
        "url": "https://www.reddit.com/r/blackmirror/comments/7uh99v/most_boring_bm_episode_concept/",
        "text": "I was discussing this today how disconnect is more pronounced as we move into the adult generation that's grown up with internet and smartphone technology. \n\nMost people in developed countries born in late 00s will have no personal understanding of disconnection (camping remotely is way in decline) or meeting people in person initially as strangers past school.\n\nSo a realistic but boring BM episode would be people having internet connections with food deiveries and guaranteed income covering expenses. \n\nSome orphans take advantage.............",
        "created_utc": 1517472041,
        "upvote_ratio": ""
    },
    {
        "title": "Can we copy the human brain?",
        "author": "panchicore",
        "url": "https://spectrum.ieee.org/static/special-report-can-we-copy-the-brain",
        "text": "",
        "created_utc": 1517465520,
        "upvote_ratio": ""
    },
    {
        "title": "[S1E2] How do they get fat if they have to cycle for credits to eat?",
        "author": "Bumlords",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ug6hz/s1e2_how_do_they_get_fat_if_they_have_to_cycle/",
        "text": "Apologies if this is simple or been asked before!",
        "created_utc": 1517459054,
        "upvote_ratio": ""
    },
    {
        "title": "Alt Shift X should do Black Mirror episodes analysis too...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ug4x1/alt_shift_x_should_do_black_mirror_episodes/",
        "text": "[removed]",
        "created_utc": 1517458601,
        "upvote_ratio": ""
    },
    {
        "title": "Netflix posted on Facebook asking which BM episode was best, how could they not anticipate this response?",
        "author": "Ariel_Khaleesi",
        "url": "https://i.redd.it/xtw99s8byid01.jpg",
        "text": "",
        "created_utc": 1517457365,
        "upvote_ratio": ""
    },
    {
        "title": "I feel like the episode “The entire history of you” had wasted potential",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ufphr/i_feel_like_the_episode_the_entire_history_of_you/",
        "text": "[deleted]",
        "created_utc": 1517454329,
        "upvote_ratio": ""
    },
    {
        "title": "These are the kind of things ideas blossom from",
        "author": "PunnyManChild",
        "url": "https://i.redd.it/u5y0i4ao9gd01.jpg",
        "text": "",
        "created_utc": 1517453263,
        "upvote_ratio": ""
    },
    {
        "title": "Nicolas Cage Can Now Be Put Into Any Movie in History Thanks to A Machine-Learning Algorithm (x-post from /r/movies)",
        "author": "EmpororPenguin",
        "url": "http://www.indiewire.com/2018/01/nicolas-cage-machine-learning-algorithm-deep-fakes-1201923224/",
        "text": "",
        "created_utc": 1517453208,
        "upvote_ratio": ""
    },
    {
        "title": "The implants are rather silly",
        "author": "Gravybeefonricebed",
        "url": "https://www.reddit.com/r/blackmirror/comments/7uff1h/the_implants_are_rather_silly/",
        "text": "I never understood why all the episodes go the implant route, instead of say, contacts or glasses or swallowed nanobots. I don't think it is realistic that people would actually volunteer and pay money to get an implant, it is way too intrusive. ",
        "created_utc": 1517451532,
        "upvote_ratio": ""
    },
    {
        "title": "So my BM newbie friend/retail manager watched \"White Christmas\"...",
        "author": "RealSF85",
        "url": "https://www.reddit.com/r/blackmirror/comments/7uf6g9/so_my_bm_newbie_friendretail_manager_watched/",
        "text": "...and he is at his store 50-60 hours a week. Christmas is the worst because it's Holiday music...over and over...every...single...day...\n\n...but he has told me in the past before this viewing that there is one, solitary Christmas spng among the playlist he actually enjoys. *Oh how I wish it could be Christmas, every day-a-aaaay*...\n\n...And he said to me just now on the phone \"Now when I hear it I think of that guy stuck in the cookie forever. F__k you, man.\"",
        "created_utc": 1517449255,
        "upvote_ratio": ""
    },
    {
        "title": "For those of us who did not love S04E06, \"Black Museum\"",
        "author": "wynden",
        "url": "https://www.reddit.com/r/blackmirror/comments/7uesnt/for_those_of_us_who_did_not_love_s04e06_black/",
        "text": "For those who didn't like the last episode, I'd like to make this a safe space.  I know that it's difficult not to defend something you love, but it's expected and acceptable that people have differences of opinion.  Sometimes that makes for the best conversation, rather than preaching to the choir.  Think of it as shooting the shit with your friends at the pub - dissent may be met with astonishment, but it cannot be buried.\n\nYou know that feeling when you realize you're off kilter but you haven't figured out why yet?  Those of us who felt unsatisfied would like the opportunity to compare notes like the rest of you, and figure out what ticks our boxes and what doesn't.\n\nLet's try to be grownups for a bit and attempt to have a thoughtful conversation.  Think of it as a Black Mirror \"book club\".  Let's have some analysis!\n\nI'll start.\n\n--\n\n**Awkward for the Wrong Reasons**\n\nI will admit that I was uncomfortable from the moment Nish put herself in close quarters with the sleazy museum proprietor, for no other reason than that I felt like I was the one stuck alone with this guy, trying to make small talk while my car charged.  There was something effectively \"tight\" and intimate about the scene that made my introvert-nerves stand on edge.  Of course I want and expect BM to make me uncomfortable, but social discomfort isn't a novel experience for me, so I wasn't loving it.\n\nTo be clear, I didn't hold this as a strike against the episode, but I wasn't thrilled when the story proceeded in the same vein, with Rolo narrating rather than the story being experienced exclusively through the characters, first-hand.  Interestingly, this wasn't an issue for me with White Christmas, so it may just be the car-salesmanship of Rolo and the setting that I didn't like, but I think it's more than that.\n\n**Low Immersion**\n\nIn White Christmas, you are effectively placed in Potter's position.  You wake up in this cabin, stuck alone with this one other guy, trading stories about your life because there's fuck-all else to do.  Although Matt narrates periodically, much of the action unfolds without interjection.  A similar thing was done with Black Museum, but it felt like we were pulled out of the story with greater frequency, perhaps because the stories were shorter, or perhaps to emphasize the fact that the truth of the stories were reliant on Rolo, the narrator.  I suspect the latter and appreciate the intent, but it did cause me to feel more detached throughout the episode.\n\n**Lazy Punches**\n\nLaying aside the narrative framework, the stories themselves seemed much more satirical than many or most other episodes.  I believe I like the episodes best the more plausible I find them.  Arkangel was a good case in point, as I was struggling to suspend disbelief that such a technology would be used... but I was satisfied by the explanation that it was still in beta.  Black Museum threw out one blatantly terrible idea after another and made no effort to justify the absurdity.  You could blame this on the unreliable narrator or on time constraints of the episode, but it's unsatisfying to me as a viewer.  It was difficult to sympathize with the characters or to imagine being in their position.  It was pointedly absurd, and consequently easier to predict the fallout.  Of course a doctor addicted to pain and death will become the minister of such, and of course sticking a whole other human being in your head - effectively giving yourself schizophrenia - isn't going to be a honeymoon forever.\n\nEven most moments of disturbance were over-the-top sucker-punches rather than understated slow-burning mind-fucks.  My brother and I have never simultaneously averted our eyes but we did from the bathroom scene with the doctor.  It was disgusting, painful, repulsive... but not psychologically thrilling.\n\n**Missing the Mark**\n\nThe only element of the episode which bordered on traditional black-mirror-standard disturbing, for me, was the suggestion that each souvenir \"snapshot\" of Nish's dad captured at his moment of agony was actually a little immortal bit of consciousness trapped for all eternity in that second of fathomless pain.  To be honest, the mom-in-the-monkey and dad-in-the-glass-room were just reiterations of themes we've already seen done to better effect in White Christmas, Callister, etc., so there was nothing new to be scandalized by.  The snapshot was the only tid bit to suggest that there may still be untapped alternative hells, worse than we've yet imagined.  \n\nIf I were Nish and I thought some authentic part of my dad's conscious existence were being tortured inside that chamber, I wouldn't be able to sleep nights thinking there are hundreds of little copies of him floating around all over the world screaming in eternal agony.  A better episode might have been about the hauntingly insurmountable task of tracking down and recovering every one of those keychains before her dad's soul could really be put to rest.\n\n**Pandering**\n\nFinally, the ending rang a bit hollow, probably because it felt a bit too traditional.  I'm not *displeased*, per se, that dad-in-the-cage was liberated or Rolo got a little taste of his own medicine, but the \"solution\" was superficial - it only applied to an isolated incident - and yet by satisfying the viewer that justice has been served, it stymies intellectual conversation.  Some will still pursue the unsettled threads of the thought experiment down the perennial rabbit hole, but most will be sated by the short-term settlement.  The episode will not haunt them and thus will not achieve the longevity that more strenuously unnerving episodes have achieved in the public consciousness.\n\n**Pointless Plot Twists**\n\nAlso, I didn't get anything out of the mom-in-Nish's head, aspect.  It detracted somewhat from Nish's own motivations and strength as a character, and reopened the whole absurd can-of-worms that injecting an immortal digital copy of your SO or parent into your own head represents.  It made her less believable.\n\nNow, if the whole episode had been a close examination of how such a seemingly positive development could go horribly wrong, that might have been a stronger episode.  But that was Arkangel.\n\n**&amp;etc**\n\nA disappointing episode of Black Mirror is still a good episode in the general pantheon of contemporary entertainment, in my book.  But while this episode was conventionally entertaining to me, it wasn't gripping, unpredictable, or take-my-hand-and-lead-me-straight-to-the-darkest-most-prohibitive-and-untresspassed-regions of-my-mind disturbing.  I have read endless accounts in endless threads from those for whom it delivered.  But now I'd like to hear from the downvoted minority.  What about this episode left you teased but not tickled?",
        "created_utc": 1517445616,
        "upvote_ratio": ""
    },
    {
        "title": "'Playtest' might make you wanna talk to your mom.",
        "author": "matheus886",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ued0s/playtest_might_make_you_wanna_talk_to_your_mom/",
        "text": "Obviously, this may not be the case for everyone, but for me it definetely was. I watched it again today and couldn't help but to almost burst into tears when Cooper went home and his mom showed up, and couldn't help to leave my room and give my mom a hug. It's such a powerful episode, and it's like my third time watching it. ",
        "created_utc": 1517441765,
        "upvote_ratio": ""
    },
    {
        "title": "The Chinese Social Credit System. Future of Governance?",
        "author": "Skyyum",
        "url": "https://medium.com/@alexanderskyummortensen/the-chinese-social-credit-system-in-the-context-of-datafication-and-privacy-cafc9bb7923b",
        "text": "",
        "created_utc": 1517440688,
        "upvote_ratio": ""
    },
    {
        "title": "If Black Mirror was more realistic",
        "author": "Pasin5",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ue5s6/if_black_mirror_was_more_realistic/",
        "text": "[removed]",
        "created_utc": 1517440014,
        "upvote_ratio": ""
    },
    {
        "title": "book suggestions? fan of black mirror",
        "author": "thadiusb",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ue2h6/book_suggestions_fan_of_black_mirror/",
        "text": "is there anything you guys suggest to read...?\n\nbig fan of black mirror, the psychology, the tech, the futurism :)\n\nanything goes :) \n\nthanks, if you can help",
        "created_utc": 1517439245,
        "upvote_ratio": ""
    },
    {
        "title": "[SPOILER ...kinda] Reminded me of a certain episode from season 2",
        "author": "Comsworth",
        "url": "https://i.redd.it/u2phvvezahd01.jpg",
        "text": "",
        "created_utc": 1517437607,
        "upvote_ratio": ""
    },
    {
        "title": "A Black Mirror episode I thought of",
        "author": "Ravenclaw968",
        "url": "https://www.reddit.com/r/blackmirror/comments/7udsd9/a_black_mirror_episode_i_thought_of/",
        "text": "A teenage guy is living a privileged life in a wealthy family and he noticed throughout his life how “fake” and materialistic everyone around him is. All he knows is wealth and he has never travelled outside the gates at all. His sister and his parents and “his friends” only talk about the new stuff they buy and the main character is miserable because he tries making a crack exposing the world around him for what it is but he constantly gets a negative reaction.\n\nHe wakes up one day to see he is in a run down house with a water pipe bursting in the room. A older woman and man rush in to fix the pipe and the main character tries getting their attention but the woman and man ignore his presence.\n\nHe walks to school and then he’s ambushed by an older gentlemen in a hoodie and taken behind a bush.\n\nThe old man says “We need to go before they transfer you.”\n\nHe is confused but they head to a maximum security building.\n\nAs they are breaking in the building, the story becomes clear to the main character.\n\nThe United States has a fierce abortion debate where a company resolved it by running the neurons of developed fetuses into a computer simulation of the EtherSpace. The main character was one of those fetuses and the building he is in has to facilitate the transfer of the main character from fetus into EtherSpace every day to ensure all parallel universes can obtain the transfer. If the building fails to do it one day, the fetus cannot be aborted by law.\n\nThe main character has an existential moment of whether he wants to commit suicide and he comes to terms as he realizes how materialistic the world is.\n\nThey come close the stopping the transfer and the main character is so close to pushing the button to stop the transfer but the guards grab him and pull him out as he’s screaming for death.\n\nHe taken into a dark room and like 1984 over multiple scenes he’s beaten into submission to follow the materialistic ways.\n\nThe last scene shows him talking to his family and friends about the new painting he brought of a straight black line.",
        "created_utc": 1517436931,
        "upvote_ratio": ""
    },
    {
        "title": "Design your own episode:",
        "author": "StuckeyIRL",
        "url": "https://www.reddit.com/r/AskReddit/comments/7u5tak/redditors_if_you_could_create_a_black_mirror/?st=JD3JPS6F&amp;sh=4110d104",
        "text": "",
        "created_utc": 1517431955,
        "upvote_ratio": ""
    },
    {
        "title": "Should i watch?",
        "author": "marboon",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ucy19/should_i_watch/",
        "text": "I watched the first two episodes a year or so ago and didn't really know what to think. I thought it was well written and acted but the content of the stories (mainly the first episode) were weird to watch to say the least. Is it always super depressing and dark, or does the tone change from time to time? ",
        "created_utc": 1517430358,
        "upvote_ratio": ""
    },
    {
        "title": "Former Google employees developing delivery trucks similar to the pizza truck in Crocodile",
        "author": "BullShifts",
        "url": "http://money.cnn.com/2018/01/30/technology/nuro-self-driving-delivery/index.html",
        "text": "",
        "created_utc": 1517428402,
        "upvote_ratio": ""
    },
    {
        "title": "The teaser trailer for my new Black Mirror-inspired short film coming soon.",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=UXrIKB3MgJI",
        "text": "[deleted]",
        "created_utc": 1517426865,
        "upvote_ratio": ""
    },
    {
        "title": "Episode idea",
        "author": "stewartisme",
        "url": "https://www.reddit.com/r/blackmirror/comments/7uc3vq/episode_idea/",
        "text": "[removed]",
        "created_utc": 1517423879,
        "upvote_ratio": ""
    },
    {
        "title": "We sell these monkeys at work that only make one sound when pushed. I can no longer look at them the same",
        "author": "zwaymire",
        "url": "https://i.redd.it/75rpvq4r5gd01.jpg",
        "text": "",
        "created_utc": 1517423550,
        "upvote_ratio": ""
    },
    {
        "title": "We sale these monkeys at work that make only one sound when pushed. I can no longer look at them the same way",
        "author": "[deleted]",
        "url": "https://i.redd.it/jzzev6u15gd01.jpg",
        "text": "[deleted]",
        "created_utc": 1517423314,
        "upvote_ratio": ""
    },
    {
        "title": "Reminded me of a possible Black mirror episdoe",
        "author": "safia1172",
        "url": "https://i.imgur.com/BMBa0ry.jpg",
        "text": "",
        "created_utc": 1517422182,
        "upvote_ratio": ""
    },
    {
        "title": "“Human Uber” developed in Japan, provides a way to attend events remotely using another person’s body.",
        "author": "Tyl9er",
        "url": "https://twitter.com/willknight/status/958231499509149697",
        "text": "",
        "created_utc": 1517421847,
        "upvote_ratio": ""
    },
    {
        "title": "In the Black Museum Episode, during the flashback to Jack and Carrie, Jack is reading a Comic called 15M Merits",
        "author": "Cardo94",
        "url": "https://i.imgur.com/AWVcLZV.jpg",
        "text": "",
        "created_utc": 1517417730,
        "upvote_ratio": ""
    },
    {
        "title": "When you show your best friends “White Christmas” and they look at you in disgust and say, “why do you like this sad show?”",
        "author": "TheRedReverend",
        "url": "https://i.redd.it/9uh4kxt7ofd01.jpg",
        "text": "",
        "created_utc": 1517417646,
        "upvote_ratio": ""
    },
    {
        "title": "Jim Halpert in Black Mirror Season 5",
        "author": "Dr_Mantis_Toboggan_-",
        "url": "https://i.redd.it/hf736ij9lfd01.jpg",
        "text": "",
        "created_utc": 1517416653,
        "upvote_ratio": ""
    },
    {
        "title": "I am currently working on a Black Mirror inspired short film set in the near future, would you be interested in seeing it when it is finished?",
        "author": "creator111",
        "url": "https://www.reddit.com/r/blackmirror/comments/7uazer/i_am_currently_working_on_a_black_mirror_inspired/",
        "text": "I was recently inspired by the fourth season to attempt a sci fi short film.",
        "created_utc": 1517415185,
        "upvote_ratio": ""
    },
    {
        "title": "Just got Done with Black Mirror",
        "author": "aboutd",
        "url": "https://www.reddit.com/r/blackmirror/comments/7uask6/just_got_done_with_black_mirror/",
        "text": "Oh my god. \n\nOne of the twistiest, best series I've ever watched. My favorite out of the whole series would have to be White Christmas. It plays with your feelings. You somehow feel bad about some lines of code because they act and have human behavior. Genius writing.\n\nNow that I've finished all of Black Mirror, What other shows are similar that you've seen and would recommend to me? Also, what did you think about White Christmas?",
        "created_utc": 1517413601,
        "upvote_ratio": ""
    },
    {
        "title": "The Truth Behind Metalhead",
        "author": "Madfoon",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ua45d/the_truth_behind_metalhead/",
        "text": "Alright so this will be a long one. My hypothesis says that the entire episode of metal head is some kind of AI simulation, probably simulating what would happen if this new product came into sale.\n(That last part I'm not sure of)\n\nI have based my hypothesis on many observations throughout the season.\n\n1) Black Mueseam made sure that we understood that all the episodes in Black mirror are on the same timeline. So where does this one fit?? In an AI world.\n\n2) every season 4 episode dealt with digitalizing what the human is from memories, senses, consiousness. Except this one which aspect of humanity is digitalized this episode?? The entirety of it.\n\n3) who the fuck thinks it's a good idea to risk three people's lives to bring in a damn teddy bear?\n\nThis is just my hypothesis any help in proving or disproving it is more than welcome.",
        "created_utc": 1517407695,
        "upvote_ratio": ""
    },
    {
        "title": "A different ending for Black Museum that goes even more 'meta' - S04E06 - [Spoilers]",
        "author": "bgrizz101",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u9sl8/a_different_ending_for_black_museum_that_goes/",
        "text": "Black Museum didn't quite hit home for me because I thought the story would go in a different direction.  When I saw all the references to old episodes, I thought Black Museum would actually work best as a more 'meta' episode which takes stock and comments more explicitly on how Black Mirror itself has changed.\n\nHere's where I thought it would go. Apologies for where this rears into fan fiction but bear with me and see if you think this alternative direction would have been interesting:\n\n* Everything is the same up to two thirds of the way through. First the Pain Addict story, then the Monkey story. \n\n* After the Monkey story, Nish says that all of Rolo's stories follow the same pattern. Everything is fine until someone enters a deal with a devil which dooms them to a type of technological hell (as Nish says, \"there's always a 'but'\"). \n\n* Nish says she doesn't understand Rolo's fascination with these stories.  She's a technological optimist. She believes that with the right will, technology can do good for the world. Human rights and neuro-ethicists now protect against the dangers these stories warn against.  Wrongs can be righted. Rolo scoffs. It's the potential horrors that interest him most. \n\n* Rolo leads Nish next door to the final room and the main attraction of the Black Museum: The Black Box. Its an immersive VR device which detects your worst fear and shows how technology can make it a reality (a licenced version of the technology shown in 'Playtest').  Rolo says that this is intended to demonstrate the real message behind the Black Museum: technology can have a terrible human cost. \n\n* Nish agrees to use the Black Box and we see the start of her story.  When she was a young student she was involved in an accident and couldn't take part in social student activities, so signed up to a videogame service called Friendo. Friendo is a simulated buddy that scans the manner of speech of Facebook friends and Twitter followers and then acts like them when playing as a companion for online video games (similar technology from the company that replicated Ash in 'Be Right Back'). This cures her loneliness for a while, but then her simulated buddy starts asking her questions that are too intimate, displaying knowledge about every single aspect of her life. Creeped out, she quits Friendo. Deciding to get out there now she has recovered from her accident, she hooks up with a student named Alex.  The relationship develops quickly until Alex goes abroad to the US for a semester. Alex and Nish enter a long-distance relationship. One day, during a virtual reality call with Alex, the two decide to have cybersex. Just before she takes her clothes off, the door bell starts to ring insistently. She runs downstairs eventually and Alex is at the door, \"Surprise!\" \n\n* The story abruptly ends as Nish pulls herself out of the Black Box VR simulation. We see that she is also now wearing the diagnostic hair net, which Rolo has put on her after she started the Black Box simulation.  She takes it off and goes to a back room where she confronts Rolo.   He is paralyzed because she has slipped nerve agent into his water and is clutching an implant at the top of his spine while she has been in the VR simulation.  \n\n* Nish explains that when she was a student she used the Black Box and was so terrified of what it showed her, she had recurring nightmares and had to drop out of university. She would keep coming back to the Black Museum to face her fears.  Nish slowly learned that Rolo was in fact the doctor in the Pain Addict story who is able to feel the sensations of people wearing the hairnet through an implant on his spine.  However, he didn't turn into a serial killer, he got addicted to leaching off the fear of patients.  Rolo had turned that into a money-making enterprise when he invented the Black Museum, using the Black Box as the best way to get people terrified and experience their fear vicariously.  The horrifying effects of the Black Box are now publicly known, and explain why the Museum is now deserted.\n\n* Nish puts the hairnet on the paralyzed Rolo and then also the Black Box VR machine over his eyes.  This is her revenge. The more terrified Rolo gets, the more intensely he will feel afraid because of the hairnet, which will then cue the Black Box to learn the true limits of Rolo's terror etc. etc.  As Rolo enters a recursive, exponential loop of increasing terror, we see a lighting quick montage of horrifying images as he lets out a bloodcurdling scream. \n\n* Nish grabs the Monkey toy.  It says quietly 'I Need a Hug' as she practically skips out of the Museum with Rolo's screams echoing from the Museum in the middle of the desert. ",
        "created_utc": 1517404509,
        "upvote_ratio": ""
    },
    {
        "title": "My highest possible match on OkCupid is 99.8% - Hopefully the simulation will find the perfect match ;)",
        "author": "itspuia",
        "url": "https://i.redd.it/kk7jh1nyzdd01.png",
        "text": "",
        "created_utc": 1517397665,
        "upvote_ratio": ""
    },
    {
        "title": "The producers should made an episode about the effects of Facebook, Instagram and the whole smartphone lifestyle!",
        "author": "flockmann",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u895m/the_producers_should_made_an_episode_about_the/",
        "text": "I believe we already live in this epsiode ",
        "created_utc": 1517383710,
        "upvote_ratio": ""
    },
    {
        "title": "Just noticed something about Playtest",
        "author": "isabelshea",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u7xrq/just_noticed_something_about_playtest/",
        "text": "[removed]",
        "created_utc": 1517379701,
        "upvote_ratio": ""
    },
    {
        "title": "Black mirror is not the same anymore.",
        "author": "Andousan",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u7wqp/black_mirror_is_not_the_same_anymore/",
        "text": "I think S4 recycles the same VR idea, with the same happy ending twist. \n\nI also think this material regurgitation happened because Netflix is trying too hard to model every episode like San Junipero which won a ton of awards.\n\nIm not hating on Black Mirror. Im hating on corporations that buy out good tv shows to win a bigger crowd. And judging by the comments, seems like they did a good job. \n\nI feel like this in itself in Black Mirror type of situation. \n\nBut wait! Well find out its all a simulation, so this discussion prob will not matter. ",
        "created_utc": 1517379355,
        "upvote_ratio": ""
    },
    {
        "title": "Serious Issue I have with S3 EP6. Hated in the Nation",
        "author": "Slim_Maldinaldo",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u7r0q/serious_issue_i_have_with_s3_ep6_hated_in_the/",
        "text": "Maybe this is just being too realistic or I am over thinking things or I don't know, but as someone who has been taught a lot of problem solving skills, I feel solved how to stop the problem about 45 minutes into this episode. One EMP Burst would have fried everyone of those little bees no problem. And an EMP Burst can be set off by detonating Nuclear Warheads underwater or in the atmosphere. There is no way you can tell me they don't have a way to create an EMP or a nuke they could have used to stop all the bees at the end when they knew it was going to get bloody anyway?",
        "created_utc": 1517377522,
        "upvote_ratio": ""
    },
    {
        "title": "Remind you of anything?",
        "author": "wiretapfeast",
        "url": "https://youtu.be/Uvk2t4g3n48?t=1m11s",
        "text": "",
        "created_utc": 1517374375,
        "upvote_ratio": ""
    },
    {
        "title": "I am currently working on a short film inspired by Black Mirror, would you guys be interested in seeing it when it is done?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u75kj/i_am_currently_working_on_a_short_film_inspired/",
        "text": "[deleted]",
        "created_utc": 1517371413,
        "upvote_ratio": ""
    },
    {
        "title": "HANG THE DJ",
        "author": "cvrlosrivera",
        "url": "https://i.redd.it/jrpggy8kubd01.jpg",
        "text": "",
        "created_utc": 1517371352,
        "upvote_ratio": ""
    },
    {
        "title": "Is it just me or did \"hated in the nation\" have a \"part 1\" in the name at some point?",
        "author": "WanderDormin",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u70sy/is_it_just_me_or_did_hated_in_the_nation_have_a/",
        "text": "I swear that at some point the full name of this episode was hated in the nation part 1. And upon viewing season 4, and expecting some sort of continuation to the story and not getting it, I searched for part 2 and if they were going to implement it somehow, but all I got was a link to this very sub reddit in a thread about some one asking about a part 2 and people telling this person that there wasn't any more story to follow up on.  \n\nAm I on crack? ",
        "created_utc": 1517370237,
        "upvote_ratio": ""
    },
    {
        "title": "AI rights in 'Be right back' vs 'USS callister'",
        "author": "thecomrade1871",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u6v0n/ai_rights_in_be_right_back_vs_uss_callister/",
        "text": "I noticed some interesting parallels between Martha imprisoning the sentient AI clone of Ash in her attic and ordering him to kill himself and Daly creating AI clones and imprisoning them in his virtual reality for him to mistreat.\n\nThe even more disturbing implication is that in the universe of 'Be right back', it is normal for AI to have no rights in contrast to the universe of 'USS callister' where AI Nanette mentions the 'cyber police' in her message to real Nanette.",
        "created_utc": 1517368805,
        "upvote_ratio": ""
    },
    {
        "title": "3D printed some Spacefleet badges",
        "author": "throw_awayyy21",
        "url": "https://i.redd.it/6mrq3mukfbd01.jpg",
        "text": "",
        "created_utc": 1517366325,
        "upvote_ratio": ""
    },
    {
        "title": "Someone died and it reminded me of Shut Up and Dance",
        "author": "noodle6x",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u6kr2/someone_died_and_it_reminded_me_of_shut_up_and/",
        "text": "So, Mark Salling from Glee died from suicide while awaiting sentencing after pleading guilty to possession of CP, and while reading hateful comments like \"glad the trash took itself out\" from several articles, I can't help but connect them to what happened in Shut Up and Dance. I get it, what he did was sick and profoundly wrong but a little compassion costs nothing. Most of us felt sorry for Kenny even after finding out what he was jerking off to. I'm pretty sure it was also torturous for Mark, being in the public eye and all. People in the comment section are kinda \"White Bear\"-ing this guy.",
        "created_utc": 1517366223,
        "upvote_ratio": ""
    },
    {
        "title": "Am I the only one that a minute after the intro thinks, “How is this going to end terribly?”",
        "author": "cowbelldayjob",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u5wre/am_i_the_only_one_that_a_minute_after_the_intro/",
        "text": "[removed]",
        "created_utc": 1517359948,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for image relating to Black Mueseum",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u5k35/looking_for_image_relating_to_black_mueseum/",
        "text": "[deleted]",
        "created_utc": 1517356799,
        "upvote_ratio": ""
    },
    {
        "title": "Dumb Question About Nosedive",
        "author": "pokemonnolan",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u5izt/dumb_question_about_nosedive/",
        "text": "So I get the whole point of the episode is not the actual plot but the message behind it, and the message is we put too much value into our status on social media or just our status in general, but why didn't someone make a service or an app where all the low rated people get together and 5 star each other. I'm sure there's enough low rated people for that to work out.",
        "created_utc": 1517356530,
        "upvote_ratio": ""
    },
    {
        "title": "I covered Radiohead's Exit Music (For a Film), the song used in the end of Shut Up and Dance. Free download available!",
        "author": "blackorc",
        "url": "https://youtu.be/J-bo7tVkbIk",
        "text": "",
        "created_utc": 1517353411,
        "upvote_ratio": ""
    },
    {
        "title": "I’m not sure if this has been asked...but",
        "author": "Iwasborntostare",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u4l40/im_not_sure_if_this_has_been_askedbut/",
        "text": "Does anyone know if there’s a place that sells the “Monkey Needs a hug”? I want to get my girlfriend that for Valentine’s Day because I’m a terrible person. \n\nAny ideas? ",
        "created_utc": 1517348560,
        "upvote_ratio": ""
    },
    {
        "title": "Has there been any official or unofficial response from Boston Dynamics on \"Metalhead\"?",
        "author": "doyoueventdrift",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u4jx2/has_there_been_any_official_or_unofficial/",
        "text": "Just wondering, because I believe a large group of people get the same fobia reaction to Boston Dynamics as to Spiders or other typical fobias.",
        "created_utc": 1517348297,
        "upvote_ratio": ""
    },
    {
        "title": "How I feel posting to this sub",
        "author": "BenderButt",
        "url": "https://i.redd.it/4sf13exws9d01.png",
        "text": "",
        "created_utc": 1517346606,
        "upvote_ratio": ""
    },
    {
        "title": "I was listening to my discover weekly playlist and this was on it. Gave me goosebumps. 😌",
        "author": "FlyingCheddarMonster",
        "url": "https://i.redd.it/puchnfohr9d01.jpg",
        "text": "",
        "created_utc": 1517346106,
        "upvote_ratio": ""
    },
    {
        "title": "I realized I have made a mistake.",
        "author": "alternativerealacc",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u48rz/i_realized_i_have_made_a_mistake/",
        "text": "[removed]",
        "created_utc": 1517345835,
        "upvote_ratio": ""
    },
    {
        "title": "Men Against Fire, never happened?",
        "author": "Panaman88",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u438q/men_against_fire_never_happened/",
        "text": "Ever since this this episode appeared on the Arkangel tablet to simulate violence it made me think if this episode is just a movie in the Black Mirror universe. I would put it in the similar boat to the Fifteen Million Merits comic book which made it seem like a fiction story.\n\nThe tablet showed a clip of the episode itself. Perhaps it's just another action movie that both introduces cookie/grain technology to the masses in a fantasy scenario and also desensitizes how violence is perceived.\n\nThis divides the episodes into those that actually happened in the physical universe (Entire History of You) to their counterpart  fiction and fantasy ones (Men Against Fire)",
        "created_utc": 1517344575,
        "upvote_ratio": ""
    },
    {
        "title": "Black mirror effect",
        "author": "[deleted]",
        "url": "https://youtu.be/B8_dgqfPXFg",
        "text": "[deleted]",
        "created_utc": 1517344570,
        "upvote_ratio": ""
    },
    {
        "title": "Should I tell her?",
        "author": "goonnumbaone",
        "url": "https://i.redd.it/ruesufrei9d01.jpg",
        "text": "",
        "created_utc": 1517343055,
        "upvote_ratio": ""
    },
    {
        "title": "Should I tell her?",
        "author": "[deleted]",
        "url": "https://i.redd.it/7qovn6bmg9d01.jpg",
        "text": "[deleted]",
        "created_utc": 1517342450,
        "upvote_ratio": ""
    },
    {
        "title": "did the recallers make the hamster smell the beer?",
        "author": "thadiusb",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u38j8/did_the_recallers_make_the_hamster_smell_the_beer/",
        "text": "[removed]",
        "created_utc": 1517337917,
        "upvote_ratio": ""
    },
    {
        "title": "almost finished the series",
        "author": "thadiusb",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u32p0/almost_finished_the_series/",
        "text": "and I think its giving me depression 🙈🙈🙈",
        "created_utc": 1517336607,
        "upvote_ratio": ""
    },
    {
        "title": "Metalhead Theory",
        "author": "gonegirlss",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u2zox/metalhead_theory/",
        "text": "Sorry if this has been discussed before, I’m a new fan of BM! \n\nIn Men Against Fire, there are obvious flaws in the MASS system regarding human empathy and potential reluctance to comply, and it may be possible that in the future, they scrapped MASS and created the dogs. The Dogs are now released into roach infested wastelands (safe zones in the wilderness where people can hide) to destroy what remains. \n\nJust a theory, it doesn’t really account for the couple in the big house who killed themselves. ",
        "created_utc": 1517335943,
        "upvote_ratio": ""
    },
    {
        "title": "So just finished watching the show for the first time",
        "author": "SidewinderBudd",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u2awb/so_just_finished_watching_the_show_for_the_first/",
        "text": "What's with season 4 being primarily happy endings? I feel like the only 2 episodes that weren't were \"Crocodile\" and \"Metalhead.\"\n\nI still liked Season 4 and all, but it just feels so Hollywood the way thay they do the end of episode twist/resolution.",
        "created_utc": 1517330585,
        "upvote_ratio": ""
    },
    {
        "title": "A Black Mirror episode in book format... DAEMON by Daniel Suarez",
        "author": "taco-fights",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u1t70/a_black_mirror_episode_in_book_format_daemon_by/",
        "text": "Randomly remembered this book and thought you guys would love it.  Have any of you read this thing?  It's basically a black mirror episode on paper, don't worry--they have an audio version too for those people who don't like to read. \n\n\nhttps://www.amazon.com/DAEMON-Daniel-Suarez/dp/0451228731",
        "created_utc": 1517326552,
        "upvote_ratio": ""
    },
    {
        "title": "I missed this during my first watch of Shut Up and Dance",
        "author": "pinkminipig",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u0b3k/i_missed_this_during_my_first_watch_of_shut_up/",
        "text": "[removed]",
        "created_utc": 1517310646,
        "upvote_ratio": ""
    },
    {
        "title": "What's the hardest episode for you to watch?",
        "author": "nineteenthly",
        "url": "https://www.reddit.com/r/blackmirror/comments/7u00pc/whats_the_hardest_episode_for_you_to_watch/",
        "text": "I'm currently rewatching all the episodes, in no particular order, and have to my surprise found that the hardest one by far to get through is 'Nosedive'.  I mean that in a good way, as in, it messes with my head in a way which I find I can only tolerate in short bursts.  It's a fantastic episode for that very reason.\n\nWhat episode is the most difficult for you and why?",
        "created_utc": 1517306614,
        "upvote_ratio": ""
    },
    {
        "title": "Crocodile- If the letter was traced...",
        "author": "TayMarsh23",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tzfzj/crocodile_if_the_letter_was_traced/",
        "text": "If Mia and Rob were traced through the letter, how much prison time do you think they’d get? ",
        "created_utc": 1517298166,
        "upvote_ratio": ""
    },
    {
        "title": "Safety for children, peace of mind for parents. It’s starting...",
        "author": "Ziggeee",
        "url": "https://www.angelsense.com",
        "text": "",
        "created_utc": 1517298035,
        "upvote_ratio": ""
    },
    {
        "title": "Vote Waldo.",
        "author": "akillez47",
        "url": "https://i.imgur.com/Fbj90bi.jpg",
        "text": "",
        "created_utc": 1517294790,
        "upvote_ratio": ""
    },
    {
        "title": "It's scary how White Christmas is so similar to the real world.",
        "author": "chaotic2h",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tz0zt/its_scary_how_white_christmas_is_so_similar_to/",
        "text": "Apologies if this has already been discussed previously. I have just finished watching White Christmas and it's freaky how accustomed our society has abused the \"block\" feature on phones to prevent further contact from people that we know. \n\nTake me, for example. When I came out as gay to my parents, my mother wouldn't shut up about how disappointed she was in my life choices. Even after I moved out, I would consistently get voicemails and calls from her begging me to \"see the light of god\" and see a therapist to change my gay behavior. \n\nSo I blocked her on my phone and all social media channels.\n\nIt's wonderful. her narcissistic personality can no longer invade my life and I'm much happier now that she's out of the picture but this really makes you wonder how it's crazy these days that we just block people with the mere press of a button. \n\nJust like White Christmas, my mother is essentially covered up in a white haze. She can't contact me at all. There's little chance that I'll be unblocking her regardless because just like White Christmas, I know I'll be hearing the same shit begging me to come back to talk to her again and be a good, straight boy. \n\nAny one else like this? Blocking a poisonous ex, relative, friend out of their lives with the simple press of a button? Doesn't that seem kind of fucked up?\n\n",
        "created_utc": 1517292732,
        "upvote_ratio": ""
    },
    {
        "title": "Omg it’s the dog",
        "author": "imtired365",
        "url": "http://i.imgur.com/NmkjOH1.gifv",
        "text": "",
        "created_utc": 1517291797,
        "upvote_ratio": ""
    },
    {
        "title": "Love my new phone case! 📱",
        "author": "MsGlam",
        "url": "https://i.redd.it/b062xtfc84d01.jpg",
        "text": "",
        "created_utc": 1517279133,
        "upvote_ratio": ""
    },
    {
        "title": "added a new sticker!",
        "author": "mayashendy",
        "url": "https://i.redd.it/65n3cqfe74d01.jpg",
        "text": "",
        "created_utc": 1517278818,
        "upvote_ratio": ""
    },
    {
        "title": "It is videos like this why i like Metalhead so much",
        "author": "7b5645c4-6a87-11e5-9",
        "url": "https://www.youtube.com/watch?v=M8YjvHYbZ9w&amp;feature=youtu.be",
        "text": "",
        "created_utc": 1517277095,
        "upvote_ratio": ""
    },
    {
        "title": "My Amazon pre-order for the Black Mirror novel was deleted (item will not now be released). Anyone know what happened?",
        "author": "flippinecktucker",
        "url": "https://www.reddit.com/r/blackmirror/comments/7twvkp/my_amazon_preorder_for_the_black_mirror_novel_was/",
        "text": "[removed]",
        "created_utc": 1517271069,
        "upvote_ratio": ""
    },
    {
        "title": "I love White Bear but...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7twqzr/i_love_white_bear_but/",
        "text": "[deleted]",
        "created_utc": 1517269948,
        "upvote_ratio": ""
    },
    {
        "title": "You just found out you’ve had a grain implant since birth. You are given the controls. What moment will you redo first?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7twpws/you_just_found_out_youve_had_a_grain_implant/",
        "text": "[removed]",
        "created_utc": 1517269683,
        "upvote_ratio": ""
    },
    {
        "title": "VR Whack-A-Mole filter for snapchat. Eerily similar to whack a mole in “Playtest”",
        "author": "gooterman",
        "url": "https://www.snapchat.com/unlock/?type=SNAPCODE&amp;uuid=71c912d4db2940149e8595d091d0b400&amp;metadata=01",
        "text": "",
        "created_utc": 1517269560,
        "upvote_ratio": ""
    },
    {
        "title": "After you first binge Black Mirror...",
        "author": "[deleted]",
        "url": "https://i.redd.it/cn9ngf4d93d01.png",
        "text": "[deleted]",
        "created_utc": 1517267368,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for computer glasses",
        "author": "desmeytere",
        "url": "https://www.reddit.com/r/blackmirror/comments/7twa3c/looking_for_computer_glasses/",
        "text": "I'm looking for computer glasses and I was maybe thinking about getting those yellow aviators from 'Shut up and dance'. Anyone here knows if those are a good idea and/or would know where to get those?",
        "created_utc": 1517265887,
        "upvote_ratio": ""
    },
    {
        "title": "Black Museum possible plothole",
        "author": "jesaub",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tvyy8/black_museum_possible_plothole/",
        "text": "[Spoiler Alert](/s \"Rolo Haines says that he got canned from his job for the Teddybear situation, and there it was a law that didn't allow to store digital consciences on limited vessels.\n\nHe seemed to have a famous enough museum to not have anything out of the law in it, is there any explanation for the souvenir with the prisioner's moment of the electrocution in continuous pain different to \"he gave the illegally to the visitors\"?\n\nI mean, if that's not a copy of the real conscience of the prisioner, it isn't either Rolo's at the end... then, the punishment was not nearly as satisfying.\n\nAm I missing something?\")\n\nedit: I suck at formatting",
        "created_utc": 1517263312,
        "upvote_ratio": ""
    },
    {
        "title": "V-Bag (Vodafone UK)",
        "author": "scallynag",
        "url": "https://i.imgur.com/5Hz3tAB.jpg",
        "text": "",
        "created_utc": 1517262450,
        "upvote_ratio": ""
    },
    {
        "title": "I’m Shut Up and Dance, how does the video reveal its child porn? It’s just a video of him wanking, it could be to anything",
        "author": "GeekyNerd_FTW",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tvkcw/im_shut_up_and_dance_how_does_the_video_reveal/",
        "text": "[removed]",
        "created_utc": 1517260074,
        "upvote_ratio": ""
    },
    {
        "title": "What Black Mirror T-shirts would you guys want made?",
        "author": "Y0ungPup",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tuv9c/what_black_mirror_tshirts_would_you_guys_want_made/",
        "text": "So I'm pretty good at making T-shirt designs, and I'm curious what Black Mirror t-shirts you guys would want made? I made a USS Callister one with the USS Callister pin logo on the tee, but I can't really think of any other things like that. I want to make tees that aren't in your face BLACK MIRROR type designs, because I like tees that are for the fans and thing that only people who watch the show understand.\n\n-\n\nAlso let me know what price you'd pay for the tees. I think I could get them made on demand pretty cheap",
        "created_utc": 1517254488,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror: Every Easter Egg in Seasons 1-4 [ScreenCrush]",
        "author": "TrustMe_I_lie",
        "url": "https://www.youtube.com/watch?v=K98RxwToCjI",
        "text": "",
        "created_utc": 1517254057,
        "upvote_ratio": ""
    },
    {
        "title": "Indian version of \"Arkangel\" already being implemented in schools by Delhi Chief Minister",
        "author": "UnescoCertified",
        "url": "https://i.redd.it/hvkyw1pw12d01.jpg",
        "text": "",
        "created_utc": 1517253067,
        "upvote_ratio": ""
    },
    {
        "title": "A couple things about Hang the DJ, wanted to see what others think",
        "author": "TillikumWasFramed",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tuckl/a_couple_things_about_hang_the_dj_wanted_to_see/",
        "text": "[Spoiler Alert](/s \"1. Amy's speech in the restaurant before she and Frank rebel: she asks him if he doesn't feel like he's done the same thing a thousand times. This implies they have some memory of having done the simulation over and over, even if it's buried deep down. Why would they? Wouldn't that just muddy the results? It seems like they should enter each simulation as a blank slate.\n2. Everyone else freezes when Amy and Frank decide to rebel. This implies that the simulation is just for Amy and Frank, and all the other people are just set decoration. But what about when, for example, Frank encounters the guy that Amy is dating for 9 months? Is he a simulation, or is he 'real', i.e. is the simulation for him as it is for Amy and Frank? If so, it means some of the people in it are not just set dressing. The fact that the characters go to a gathering where they socialize [as opposed to the restaurant, where they don't really seem to talk to other people] is confusing in that regard. How many of those people are in the simulation on behalf of their real-world counterparts, and how many are just background?\n3. It seems like the 'Coach' is pushing them together, rather than being a neutral arbiter and just seeing who falls for who. It hooks them up for two relationships, then at the end gives them one last chance to say goodbye. Isn't this supposed to be a numbers game where the system hooks people up in thousands of simulations then counts up how many times they connect strongly enough to rebel? But you get the impression that 'Coach' knows these two are a match, so it's just trying to get them to rebel for the 998th time and resolve this.\nEDIT: 4. This might be the biggest thing that started bothering me once I thought about it. Some people are just more apt to chafe against authority and rebel. Others essentially never rebel. Rebellious people are going to pair up with someone faster and not necessarily with their top match. Others might meet their perfect match, but if they are both extremely compliant with authority, they won't wind up together. Each will wind up with a more rebellious person, because the rebellious person is going to have a hard job getting the compliant person to rebel. If millions and millions of simulations are run, it will eventually happen. But it's not going to happen with two compliant people.\")",
        "created_utc": 1517250424,
        "upvote_ratio": ""
    },
    {
        "title": "Amy's speech toward the end of Hang the DJ",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tubuv/amys_speech_toward_the_end_of_hang_the_dj/",
        "text": "[deleted]",
        "created_utc": 1517250251,
        "upvote_ratio": ""
    },
    {
        "title": "I would like a system like that in Nosedive, but only for driving on public roads, and with a few tweaks",
        "author": "ZeusThunder369",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tu50k/i_would_like_a_system_like_that_in_nosedive_but/",
        "text": "One tweak: You wouldn't be able to give any driver a positive rating. It'd be just degrees of 'bad'. This is because positive ratings would bring on an onslaught of \"nice drivers\", which usually do more harm than good. Instead, every certain amount of miles driven without a bad rating, would give you an assumed positive rating.\n\nHaving a low rating would mean you'd pay more for gas, repairs, service, new vehicles, licensing, and registration.\n\nThis would be great for encouraging people to follow basic traffic rules, and be considerate of others. It would reduce such things as:\n\n- \"I need to take a left here, but forgot to get in the correct lane. So what I'm gonna do is just stop in this lane until I can move over, making multiple cars wait behind me.\" (As opposed to just continuing on and turning around at the next opportunity)\n\n- \"OOPS! Gonna miss my exit on this freeway traveling at 60mph. Better just come to a complete stop so I can get over!\" (Completing #%#$ the flow of traffic, and again as opposed to just going to the next exit and turning around)\n\n- \"Wow, there are a lot of people in that exit only lane. I don't want to wait, so I'm just going to go in the next lane over right until the very end then stop and wait for someone to let me in. My time is more important than everyone else's, so I shouldn't have to wait in line\"\n\n- \"I need to take a right turn up ahead, so instead of using this median in the road to make my left turn, I'm just going to wait for literally all 6 lanes to clear before I make my left turn. That way I can just swerve on to the road at an angle instead of making an actual turn.\"\n\n- \"Red light? Screw that, I need to make a left turn right now! Everyone else at the intersection can just wait for me.\"",
        "created_utc": 1517248777,
        "upvote_ratio": ""
    },
    {
        "title": "White Mirror Endings",
        "author": "Pasin5",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ttsxr/white_mirror_endings/",
        "text": "The National Anthem - The princess is found before the prime minister has sex with the pig.\n\nFifteen Million Merits - Bing leads a successful revolution against the X-Factor group. He and Abi live happily ever after.\n\nThe Entire History of You - Liam simply divorces Ffion and is able to safely remove his grain without blinding himself. He puts the whole thing behind him.\n\nBe Right Back - Despite the android Ash not being entirely like the real Ash, he and Martha are able to make the relationship work.\n\nWhite Bear - The plot twist about the Justice Park never happens. Victoria and Jem take down the White Bear signal, freeing everybody.\n\nThe Waldo Moment - Jamie sticks to his role as Waldo but realises he needs his own ideals. Waldo comes first in the election and actually manages to change the system for the better.\n\nWhite Christmas - Harry is able to fight off Jennifer and escape.\n\nCookie Greta is able to delete herself. Matt is stunned by this and quits his job breaking down cookies.\n\nJoe doesn't kill Beth's dad but instead simply leaves. He and Matt really were stationed at an outpost. Matt helps Joe get over Beth and find someone else, acting as his dating coach.\n\nNosedive - Lacie is able to turn the crowd against Naomi, causing her own ratings to go and Naomi's to go down. Lacie is able to get the apartment discount.\n\nPlaytest - It ends with the scene of Cooper waking up back in the room where the experiment started.\n\nShut Up and Dance - Kenny was watching normal porn. The hackers don't release any of the information they were blackmailing people with and even cover for bank robbery.\n\nSan Junipero - Kelly commits suicide without uploading to San Junipero. Yorkie becomes convinced she doesn't deserve to be happy and the simulation starts to torture her with rapes and bullwhipping.\n\nMen Against Fire - Stripe refuses to have his memory wiped. Instead, he kills Arquette and goes on a rampage through the place. He convinces Hunter to switch sides and they lead a successful revolution.\n\nHated in the Nation - Li realises Scholes' plan and doesn't activate Radmus' code. The ADIs are safely deactivated. Scholes is never caught. He kidnaps Blue and rapes and kills her.\n\nUSS Callister - The crew plan to escape fails and Daly continues to torture them with rapes and bullwhippings.\n\nArkangel - Marie apologises for the Arkangel thing and destroys the tablet. She and Sara are able to work everything out.\n\nCrocodile - There is no guinea pig. Mia gets away with her crimes.\n\nHang the DJ - The digital Amys and Franks are deleted. The real Frank is run over. Amy is raped and commits suicide.\n\nMetalhead - Bella doesn't get shrapnel in her and is able to escape before any other robot dogs show up.\n\nBlack Museum - Dawson removes the implant before anything bad happens.\n\nInstead of putting Carrie in a stuffed monkey, Jack breaks up with Emily and he and Carrie agree she should probably be deleted.\n\nNish's plan fails. Haynes rapes her and uploads her mind to her hologram is eternally tortured with bullwhippings.",
        "created_utc": 1517246112,
        "upvote_ratio": ""
    },
    {
        "title": "Which Black Mirror technologies would Brits actually be willing to use? (Survey by YouGov.com)",
        "author": "UnescoCertified",
        "url": "https://i.redd.it/940rheypf1d01.jpg",
        "text": "",
        "created_utc": 1517245294,
        "upvote_ratio": ""
    },
    {
        "title": "Fermi Paradox",
        "author": "speculumfight",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ttn4f/fermi_paradox/",
        "text": "https://en.wikipedia.org/wiki/Fermi_paradox#Hypothetical_explanations_for_the_paradox  \ntl;dr - Basically why haven't we come into contact with alien life\n\nOne of my favorite hypothesis:\n\n**They tend to isolate themselves**\n\nIt has been suggested that some advanced beings may divest themselves of physical form, create massive artificial virtual environments, transfer themselves into these environments through mind uploading, and exist totally within virtual worlds, ignoring the external physical universe.[96]\n\nIt may also be that intelligent alien life develops an \"increasing disinterest\" in their outside world.[97] Possibly any sufficiently advanced society will develop highly engaging media and entertainment well before the capacity for advanced space travel, and that the rate of appeal of these social contrivances is destined, because of their inherent reduced complexity, to overtake any desire for complex, expensive endeavors such as space exploration and communication. Once any sufficiently advanced civilization becomes able to master its environment, and most of its physical needs are met through technology, various \"social and entertainment technologies\", including virtual reality, are postulated to become the primary drivers and motivations of that civilization.[98] \n\ntl;dr Advanced races might find isolation in virtual technology and find no need to explore and leave their world.  \n\n\n\n\n\n\n",
        "created_utc": 1517244855,
        "upvote_ratio": ""
    },
    {
        "title": "I'll just leave this here.",
        "author": "nrm2202",
        "url": "https://i.redd.it/gpn44qoeb1d01.jpg",
        "text": "",
        "created_utc": 1517243842,
        "upvote_ratio": ""
    },
    {
        "title": "Nish spin-off",
        "author": "hananahbanana27",
        "url": "https://i.redd.it/30srd29k71d01.jpg",
        "text": "",
        "created_utc": 1517242548,
        "upvote_ratio": ""
    },
    {
        "title": "\"Hang the DJ\" - darker implications",
        "author": "otakuman",
        "url": "https://www.reddit.com/r/blackmirror/comments/7tsoxo/hang_the_dj_darker_implications/",
        "text": "Have you guys considered that if an easily usable tech can accurately model our decisions to date someone, they can also accurately model our decisions to rebel against the government? It's like a cross between \"Minority report\" and \"1984”.",
        "created_utc": 1517236672,
        "upvote_ratio": ""
    },
    {
        "title": "The End of the F***ing World is trending but i can't watch it cuz all i see is Kenny from Shut Up and Dance...",
        "author": "eschaotic",
        "url": "https://i.redd.it/8ji9o0ufo0d01.png",
        "text": "",
        "created_utc": 1517236140,
        "upvote_ratio": ""
    },
    {
        "title": "Whatsapp Tips And Tricks | 2018 | Ms Tech",
        "author": "shoaibi666",
        "url": "https://www.youtube.com/watch?v=LquwnakXP2w",
        "text": "",
        "created_utc": 1517232732,
        "upvote_ratio": ""
    },
    {
        "title": "A possible plot for Black Mirror: Money Time",
        "author": "Shushishtok",
        "url": "https://www.reddit.com/r/blackmirror/comments/7trwg8/a_possible_plot_for_black_mirror_money_time/",
        "text": "Hey guys!\n\nFirst of all, I'd like to say that I'm a huge fun of Black Mirror. Some episodes are my favorites of all TV series ever seen. It is a great series, and I really like it so much. I also like how it stands as a warning for humanity, as though it is saying \"Watch out! You're moving towards some nasty future, where things are fucked up. Tread lightly\". I like how every episode is a standalone, showing a world where things can be perceived as fucked up, but then, it reminds you that we aren't *that* far from it.\n\n**Background:** Lately, I've started thinking of a new theme and decided to name it \"Money Time\". The emphasis of this so called episode is \"Time is money\". It is in some ways similar to the movie \"In Time\" where currency is time, however, money is still money. Nothing has really changed from what we know, however, some systems are slightly altered, which changes everything.\n\n**The concept:** The world is the same as we know it. However, it has become a trend worldwide to include time when deciding a payment over a product or a salary. Similar to how there are pizza services where, if the pizza delivery took longer than half an hour, it is free. What if, instead, the payment for the pizza was proportional to how long the delivery took? For instance, the base price of pizza is 20$, and every minute that you waited for it, the price goes down by 1$. Another example would be a taxi driver, where instead of counting up, the longer the taxi driver took to get you to your destination, his payment actually goes down. When talking about retail managers, a monetary objective is set, and every day that it takes that manager to reach it, the management above takes a portion of that manager's pay. A client's payment in a restaurant for foods and drinks goes down for every minute he or she had to wait, and so on and so on. \n\n**The (possible) aftereffects:** As time is calculated into everything, the general profits of most jobs go down. Assuming that it also affects salaries, the base prices can't go up, as the economy is heavily pulled downwards, and people will be unable to pay prices that were possible before. This means that some will have to work on more than one job, shortening the free time and increasing workload. As more people have to work, the more need for small jobs also appear, such as babysitting, fixing, gardening and other household stuff that a person usually does by himself. A single parent won't be able to finance a family cell of a father, mother and a child in this ecosystem, leading to both parents working.\n\n**The Tech:** Because of the need for small jobs, a \"portal\" of sorts has been developed. It is very similar to what we have today for people looking for jobs, but it is very focused, has high levels of details for every person's profile. Basically, this portal offers Limited Time Jobs. Those open up and close at fixed intervals set up by the profile's manager. People who take those jobs are measured in time, from the moment of accepting until finishing the job, for a price based on time taken. As the job completes, the portal immediately transfers the payment from the job creator into the one who made the job.\n\nNow, I would love a few opinions on this:\n\n1. Assuming the trend to measure payments based on time, how do you think the ecosystem would actually be?\n\n2. What about jobs, profits, salaries, availability, skill levels and requirements for said jobs? How would they be affected?\n\n3. What about human behavior? (e.g. taxi drivers would have to drive extremely fast and dangerously in order to reach destinations without losing too much money for the ride). What about their day to day routines? How would they be affected?\n\n4. Any other changes on the ecosystem for people that I haven't thought about?\n\n5. Assuming it becomes a Black Mirror episode, how would it go? Who would be starring (e.g. what occupation, race, standing etc.) What would be the general plot?\n\nPlease, discuss away. I would love to see what other people think and I will gladly welcome any opinions.",
        "created_utc": 1517228129,
        "upvote_ratio": ""
    },
    {
        "title": "Who would you block?",
        "author": "condelicate",
        "url": "https://www.reddit.com/r/blackmirror/comments/7trwd9/who_would_you_block/",
        "text": "If you had the irl block from White Christmas ",
        "created_utc": 1517228101,
        "upvote_ratio": ""
    },
    {
        "title": "My stepkids at Painshill Park, Cobham where scenes from “Hang the DJ” Utopian world were filmed.",
        "author": "McTuppence",
        "url": "https://i.redd.it/s7cdgpxwqzc01.jpg",
        "text": "",
        "created_utc": 1517224850,
        "upvote_ratio": ""
    },
    {
        "title": "Which Black Mirror technologies would Brits actually be willing to use?",
        "author": "bennzo1238",
        "url": "https://yougov.co.uk/news/2018/01/29/which-black-mirror-technologies-would-brits-actual/",
        "text": "",
        "created_utc": 1517222958,
        "upvote_ratio": ""
    }
]