[
    {
        "title": "Thinking about Metalhead ending...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/9d0kzy/thinking_about_metalhead_ending/",
        "text": "[deleted]",
        "created_utc": 1536101592,
        "upvote_ratio": ""
    },
    {
        "title": "Okay so hear me out...",
        "author": "Kinglens311",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cyvrs/okay_so_hear_me_out/?utm_source=ifttt",
        "text": "",
        "created_utc": 1536094285,
        "upvote_ratio": ""
    },
    {
        "title": "Okay so hear me out...",
        "author": "BruXr",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cyvrs/okay_so_hear_me_out/",
        "text": "I was watching a [video](https://youtu.be/Ub43wDzqPjg) from [Screenprism](https://www.youtube.com/channel/UCVjsbqKtxkLt7bal4NWRjJQ) (Totally recommend it btw) about the shared universe in Black Mirror right after I'd watched another [video](https://youtu.be/P46ro0f-lUA) from the channel about the cookies or digital copies that are constantly brought back to us on the show and it suddenly hit me.\n\nI'm one of those fans who believe that every Black Mirror episode happens in the same universe, the same world and I've seen dozens of timelines here on reddit and on other websites that try to make a consistent timeline. All based on references to one episode in another or the technological advances in each of them. But one episode that to me never seemed to fit anywhere is **Fifteen Million Merits.**\n\n&amp;#x200B;\n\n[Scene from Fifteen Million Merits](https://i.redd.it/c2r2tt4t2hk11.png)\n\nI'm gonna go ahead and assume that since you're still reading this you've already watched the episode, as well as probably the rest of the show. The whole thing about those people living in that place that seemed so far from everything we've seen before. How that's totally disconnected from reality while other Black Mirror episodes always bring elements that remind us of our own society but include a little or a lot more of technology. All of this combined with the fact that the talent show featured in Fifteen Million Merits is presented to us on a billboard in The Waldo Moment.\n\nAll of that led me to believe that the people in Fifteen Million Merits are actually **Cookies living in a virtual reality**.\n\nThat would explain not only why that reality happens simultaneously to the events in The Waldo Moment but also why those characters' lives are so empty and why they live that way. We could even guess the reasons why people would willingly (or unwillingly maybe) create those cookies of themselves and place them in that reality:\n\n# 1- To generate energy\n\nWe see in the episode that the people live in Fifteen Million Merits have two purposes: finding their talent and achieving fame (which we'll talk about later) and generating energy, and their reward consists on winning credits that they can spend on food, submit to talent shows and watching the programs they're constantly presented with through ads (which we'll also talk about later). But what if they're providing energy not just so that system can exist but also to real life?\n\nIt is proven to us in White Christmas that cookies can alter reality. And making them work all day to provide energy to real people would be more than normal in Black Mirror\n\n&amp;#x200B;\n\n[Cookie working so that her real persona's house is ideal](https://i.redd.it/7vy5micc2hk11.jpg)\n\n# 2- To entertain people in the real world\n\nAnother totally possible scenario considering it's Black Mirror. Their main purpose and motivation in life is to appear in and watch those talk shows (to serve as a wii character inspired audience), so they would possibly be much more hard-working and probably even more talented than their real life personas. Also that would allow the judges (who I suspect live in the real world and only go there to be part of the show like Matt Trent in White Christmas) to treat them however they'd wish, since cookies don't seem to have any rights by this time of the Black Mirror timeline.\n\nBut perhaps the biggest prove of this is that billboard I mentioned that appears in The Waldo Moment\n\n&amp;#x200B;\n\n[Billboard featuring Abi Khan from Fifteen Million Merits in The Waldo Moment](https://i.redd.it/mlr8mujg2hk11.jpg)\n\n# 3- So that the people who upload their cookies to that world know if they actually have talent and could ever have a chance in that competitive talent show reality\n\nThis reason would only be possible if people willingly uploaded another version of themselves into that system.\n\nThat would explain why we see the same actress(Hannah John-Kamen) who plays Selma in Fifteen Million Merits living a totally different life as Sonja in Playtest.\n\n&amp;#x200B;\n\n[Hannah John-Kamen, who played Selma in Fifteen Million Merits, as Sonja in Playtest](https://i.redd.it/kj2drbpk2hk11.jpg)\n\nIf this is true, it would mean that the cookies in Fifteen Million Merits had their memories altered to believe they have different names and that that society is normal, much like they did in White Christmas and Hang The DJ. That would also explain why we only see adults in the episode. Because this software is probably for adults who would like to see if they have some talent without actually facing rejection and fighting for it. Not only this, but it would explain (I realize I've said this a hundred times by now. But this is a theory after all, I need to support my arguments) why the characters all need to constantly watch ads during their working and resting hours. Because it's probably a free software but their virtual version have to watch ads unless they win credits to skip them.\n\n&amp;#x200B;\n\nI realize this theory doesn't theory doesn't affect the episode that much, since cookies are still people and the whole satire and discussion brought by the episode is still up. But at least to me it offers a huge satisfaction as it finally grants Fifteen Million Merits some sense. Not only it fits the timeline as happening virtually simultaneously to The Waldo Moment and possibly the episodes that come after it but it explains why the world in the episode feels so unreal and distant from our reality, kind of life Joe's Cabin in White Christmas (which he couldn't even remember at the beginning, proving that Cookies memories can be altered) or the entire virtual world presented in Hang The DJ. Whose app, I would suggest, could have been inspired by the system in Fifteen Million Merits, after the developers realized that people who had never seen each other before in real life could fall in love inside the program and decided to create a whole dating social media with that premisse.\n\n&amp;#x200B;\n\n[The virtual reality inside the dating app from Hang The DJ](https://i.redd.it/5rl0ty9p2hk11.png)\n\nAnyway, if you read until here, congratulations, you're a very patient, curious person. Thanks for actually hearing me out and please feel free to add your thoughts and disagreements to this not so relevant, really thought through (I read to much into this) theory.\n\n&amp;#x200B;",
        "created_utc": 1536089353,
        "upvote_ratio": ""
    },
    {
        "title": "Can we talk about the elephant in the room?",
        "author": "R3V3D",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cxysf/can_we_talk_about_the_elephant_in_the_room/",
        "text": "Apologies if this has been covered before, but I feel since BM has come to Netflix it has lost its edge slightly. \n\nI don't want to sound like a contrarian but I liked the show because it was the antithesis of the American way of storytelling. They like hope and that's fine, but I liked it different.\n\nThey even gave it an award for San Junipero, for what I see as conforming to their ways, and being the least Black Mirror of all of the Black mirror episodes.\n\nEven the feedback you hear from American fans about The National Anthem, which I feel is the most perfect opening episode of a TV show.\n\nWhat do you guys think, are the Americans pilfering it of its essence?\n\n",
        "created_utc": 1536083109,
        "upvote_ratio": ""
    },
    {
        "title": "Just watched white Christmas for the first time ever",
        "author": "MCBest",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cxp70/just_watched_white_christmas_for_the_first_time/",
        "text": "Holy shit that was REALLY fucked up ",
        "created_utc": 1536081374,
        "upvote_ratio": ""
    },
    {
        "title": "If Black Mirror made you afraid of new technology...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cxcwp/if_black_mirror_made_you_afraid_of_new_technology/",
        "text": "[deleted]",
        "created_utc": 1536079303,
        "upvote_ratio": ""
    },
    {
        "title": "Who knows. Maybe someday...",
        "author": "divyanshverma98",
        "url": "https://youtu.be/4C_mdpmuuu8",
        "text": "",
        "created_utc": 1536064465,
        "upvote_ratio": ""
    },
    {
        "title": "The Pain Addict Story feels a lot like Repo: The Genetic Opera",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/9ct75t/the_pain_addict_story_feels_a_lot_like_repo_the/",
        "text": "[deleted]",
        "created_utc": 1536043754,
        "upvote_ratio": ""
    },
    {
        "title": "Which episode was your favorite?",
        "author": "Palerthanghosts",
        "url": "https://www.reddit.com/r/blackmirror/comments/9ct6kq/which_episode_was_your_favorite/",
        "text": "I really liked \"White Christmas,\" \"White Bear,\" and \"Shut Up and Dance.\"",
        "created_utc": 1536043568,
        "upvote_ratio": ""
    },
    {
        "title": "Parent-child tolerable episodes?",
        "author": "scienceislice",
        "url": "https://www.reddit.com/r/blackmirror/comments/9css60/parentchild_tolerable_episodes/",
        "text": "My parents really like this show. For reference, I'm in my early 20s so it's not like I can't handle this show. So far we've watched The Entire History of You and Fifteen Million Merits and they really enjoyed it and want to watch more, preferably together as a shared activity. However, we don't like watching a lot of sex scenes together, especially when they're explicit. I would rather not have to watch the episode beforehand, it's more fun to watch it for the first time together. The sex in Fifteen Million Merits was at our limit for watching TV together. Are there any other episodes that we should absolutely stay away from?",
        "created_utc": 1536039237,
        "upvote_ratio": ""
    },
    {
        "title": "So the neighbours are re-doing their front driveway...",
        "author": "idoall",
        "url": "https://i.redd.it/hjqws5srm5k11.jpg",
        "text": "",
        "created_utc": 1536037564,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror?",
        "author": "Mattjhagen",
        "url": "https://i.redd.it/xfxvhdyzk5k11.jpg",
        "text": "",
        "created_utc": 1536036961,
        "upvote_ratio": ""
    },
    {
        "title": "Hang the DJ: My quibble",
        "author": "gregorybrian",
        "url": "https://www.reddit.com/r/blackmirror/comments/9crktq/hang_the_dj_my_quibble/",
        "text": "I enjoyed Hang the DJ but the quibble I have with it is that the system doesn't evaluate couples in an atmosphere where they are subjected to stresses of the everyday world. None of these people have jobs to go to, bills to pay, ailments to nurse, relatives who die, etc. How can a top match be made without those elements. That's where I found it to be rather empty but maybe that's the point.\n\n&amp;#x200B;\n\nPerhaps I'm missing something. (And yes, I know what the end reveals but still...). What do you think of this?",
        "created_utc": 1536027685,
        "upvote_ratio": ""
    },
    {
        "title": "Black mirror hangover",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cr79o/black_mirror_hangover/",
        "text": "[deleted]",
        "created_utc": 1536024512,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror title meaning theory",
        "author": "ohmygabs",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cqdi1/black_mirror_title_meaning_theory/",
        "text": "[removed]",
        "created_utc": 1536017821,
        "upvote_ratio": ""
    },
    {
        "title": "Which topics would you like to see in future episodes?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cpkwv/which_topics_would_you_like_to_see_in_future/",
        "text": "[deleted]",
        "created_utc": 1536011394,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone else watching C4's 'Married to a Paedophile'?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cp8on/anyone_else_watching_c4s_married_to_a_paedophile/",
        "text": "[deleted]",
        "created_utc": 1536008856,
        "upvote_ratio": ""
    },
    {
        "title": "Deep Angel, The Artificial Intelligence of Absence",
        "author": "bpooqd",
        "url": "http://deepangel.media.mit.edu/",
        "text": "",
        "created_utc": 1535998761,
        "upvote_ratio": ""
    },
    {
        "title": "My new shirt arrived today",
        "author": "Superlandero",
        "url": "https://i.redd.it/kj91rx3he2k11.jpg",
        "text": "",
        "created_utc": 1535998448,
        "upvote_ratio": ""
    },
    {
        "title": "Virtual Reality Makes the World More Accessible For People with Disabilities",
        "author": "DaHawk12",
        "url": "https://2myvirtualjourney.wordpress.com/2018/09/03/vr-for-disabled/",
        "text": "",
        "created_utc": 1535994186,
        "upvote_ratio": ""
    },
    {
        "title": "Doesn't the Jeremy Kyle Show feel Black Mirror-esk",
        "author": "jeffbobingson",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cmc86/doesnt_the_jeremy_kyle_show_feel_black_mirroresk/",
        "text": "If you've seen the Jeremy Kyle Show before you'll know what I mean.\n\nThere's useally 2 or 3 people having useally very traumatic arguments (if you can even call them arguements).\n\nAnd then there's Jeremy Kyle that is there just to shout and make them feel small. \nAnd then the creepiest part is the audience. There all just sitting there watching people they so obviously think they are better than, go through probably the hardest time of their life just laughing. It's actually sick.\n\nIt's eerily similar to Fifteen Million Merits and White Bear.",
        "created_utc": 1535988332,
        "upvote_ratio": ""
    },
    {
        "title": "has anyone seen Brooker's other shows like \"How TV ruined your life\" and \"Screenwipe\"",
        "author": "Allinallisallweare02",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cmbu7/has_anyone_seen_brookers_other_shows_like_how_tv/",
        "text": "How Tv ruined your life was good, great actually, Screenwipe however was boring.",
        "created_utc": 1535988253,
        "upvote_ratio": ""
    },
    {
        "title": "Just finished watching every episode. This show peaked at “Shup up and dance”. Hated everything that came after.",
        "author": "chin-pr",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cm3r6/just_finished_watching_every_episode_this_show/",
        "text": "I’m looking straight at you San Junipero and Men Against Fire",
        "created_utc": 1535986547,
        "upvote_ratio": ""
    },
    {
        "title": "Filter on.",
        "author": "Firepal64",
        "url": "https://i.redd.it/cnuddbx221k11.jpg",
        "text": "",
        "created_utc": 1535982205,
        "upvote_ratio": ""
    },
    {
        "title": "Saw this shirt at Target yesterday...I need it now",
        "author": "Iceflame2001",
        "url": "http://imgur.com/TUjUmJK",
        "text": "",
        "created_utc": 1535975648,
        "upvote_ratio": ""
    },
    {
        "title": "It should be mandatory to watch NoseDive",
        "author": "TheEnthusiast1",
        "url": "https://www.reddit.com/r/blackmirror/comments/9ckdkd/it_should_be_mandatory_to_watch_nosedive/",
        "text": "This is exactly where we are headed.\n\nI’m free from the chains of Facebook, Instagram, Snapchat, tinder so should you to ",
        "created_utc": 1535970419,
        "upvote_ratio": ""
    },
    {
        "title": "I didn't actually understand why stars were used in this sub until now...",
        "author": "Democritous",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cjr75/i_didnt_actually_understand_why_stars_were_used/",
        "text": " \n\nI actually just concluded with Nosedive, and went to this sub in order to view the various discussions on it when I saw the star rankings and it dawned on me that it referenced that episode. Evidently this was my first time seeing it, so before I was absolutely clueless, but I can't help but grin every single time I see it. I just absolutely love Black Mirror, as well as this subreddit.\n\n​\n\n***Please rate me five stars, I'll be sure to do the same! And I love your shirt as well!***",
        "created_utc": 1535962968,
        "upvote_ratio": ""
    },
    {
        "title": "I didn't actually understand the ranking system of this sub until now...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cjpau/i_didnt_actually_understand_the_ranking_system_of/",
        "text": "[removed]",
        "created_utc": 1535962351,
        "upvote_ratio": ""
    },
    {
        "title": "I didn't quite understand why this subreddit used a star ranking...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cjnis/i_didnt_quite_understand_why_this_subreddit_used/",
        "text": "[removed]",
        "created_utc": 1535961754,
        "upvote_ratio": ""
    },
    {
        "title": "+91-9876425548 How To Get Back Your Love in New York London uk",
        "author": "vinodji786",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cio2x/919876425548_how_to_get_back_your_love_in_new/",
        "text": "[removed]",
        "created_utc": 1535951269,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror in my bathroom",
        "author": "bec-k",
        "url": "https://www.reddit.com/r/blackmirror/comments/9ciab8/black_mirror_in_my_bathroom/",
        "text": "I just binge watched several episodes (including PlayTest)  before going upstairs to bed, and my bathroom light switch/outlets are flashing red and will not reset. \nIs this real life ???? Omg 😯 scared af, bring on the nightmares ",
        "created_utc": 1535947476,
        "upvote_ratio": ""
    },
    {
        "title": "She definitely has a 4.9 Rating",
        "author": "[deleted]",
        "url": "https://i.redd.it/qy5dlijnvwj11.jpg",
        "text": "[deleted]",
        "created_utc": 1535931589,
        "upvote_ratio": ""
    },
    {
        "title": "Overwatch Players, Anyone else think the endorsment system is really like nosedive?",
        "author": "Thodege",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cfuvb/overwatch_players_anyone_else_think_the/",
        "text": "When it was introduced everyone was being fake nice to each other, it was kinda creepy.",
        "created_utc": 1535924989,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror technology that could’ve helped you",
        "author": "Enyo81",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cfodf/black_mirror_technology_that_couldve_helped_you/",
        "text": "Yesterday I was at my night job and dealing with a very difficult customer. My boss wasn’t there, and told me to write down the whole situation in an incident report ASAP. Of course, we all know writing things down immediately helps us get the most accurate information, but I couldn’t help thinking about how the technology in “The Entire History of You” might’ve been helpful. \n\nDoes anybody else have those moments where you think something out of Black Mirror that could’ve helped in a real life situation? Usually I am scared of pretty much every technology in the show, LOL, so this was an interesting change for me.",
        "created_utc": 1535923506,
        "upvote_ratio": ""
    },
    {
        "title": "New to this sub",
        "author": "notsafeforanywhereha",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cf7wv/new_to_this_sub/",
        "text": "Hey everyone! I just wanted to some suggestions on which episodes to watch first. I unknowingly watched USS Callister thinking it was the first episode. I know a lot of people on this sub talk about how the first episode made them lose interest. So Im thinking of going back to that later. Without spoiling the episodes, I just wanna hear your thoughts on good episodes to continue with. Thanks in advance! ",
        "created_utc": 1535919836,
        "upvote_ratio": ""
    },
    {
        "title": "\"Idiot..\" *sigh*",
        "author": "Maxinprogress",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cf432/idiot_sigh/",
        "text": "After the candidate for the Larbor party makes a bad joke in front of the jury, she walks down the stairs and calls herself an idiot.\n\nNow the scene might seem like nothing but I saw the exact same words on 3 different episodes. Don't know where exactly I think s01e02 and s03e01.\n\nThey will do something embarrassing and shame themselves afterwards.\n\nI don't know if Im overreading this but I think that he is making an accent of the shame we get from others. We try to please them, then act unanthenticly because we want to please them so bad, and then we shame ourselves for not beeing authentic. Which is ironic, because what we want the most is to be authentic, perfect, pure. But by wanting to be it, we cannot achieve it when put under pressure. Im pretty sure it s on purpise because it s just so similar. They do something shameful and then spit out \"idiot..\" in a sigh\n\nI thought I d just share my thoughts on this thank you",
        "created_utc": 1535919007,
        "upvote_ratio": ""
    },
    {
        "title": "When it can’t understand you",
        "author": "PyroSplicer",
        "url": "https://v.redd.it/uuuenwgh1uj11",
        "text": "",
        "created_utc": 1535916105,
        "upvote_ratio": ""
    },
    {
        "title": "I'm currently writing a script for Black Mirror.",
        "author": "Malcolm_Morin",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cdn7c/im_currently_writing_a_script_for_black_mirror/",
        "text": "I always wanted to try getting into script writing or doing a screenplay, and after watching Black Mirror, I figured I give it a shot.\n\nThe concept is based off \"The Boy who cried Wolf,\" set in an alternate present day. It's very interesting to give it a shot. It may not end up being good, but hell, it's worth trying.\n\nAnd while the chances of Brooker ever coming across this and giving it a read are the same as me becoming a successful musician, I would still love to pitch the idea itself to him and see if he could take it up, because I thought it was interesting.",
        "created_utc": 1535907949,
        "upvote_ratio": ""
    },
    {
        "title": "Somebody get me Jimmi Simpsons agent",
        "author": "Eye-0-",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cdlfs/somebody_get_me_jimmi_simpsons_agent/",
        "text": "Will somebody please get me Jimmi Simpsons agent? Either this guy has an incredible agent, or he has made the best choices in projects than any other actor in hollywood today. The guy is in everything good. Black Mirror, Westworld and thats just to name a few current hits!",
        "created_utc": 1535907622,
        "upvote_ratio": ""
    },
    {
        "title": "DAE Boston Dynamics exists?????",
        "author": "MolotovPiggy",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cc7tw/dae_boston_dynamics_exists/",
        "text": "[removed]",
        "created_utc": 1535896696,
        "upvote_ratio": ""
    },
    {
        "title": "[spoilers]What small details in episodes did you notice that you liked the inclusion of?",
        "author": "SirBamboozled",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cbupt/spoilerswhat_small_details_in_episodes_did_you/",
        "text": "USS Callister: I noticed that it is set up that Daly will die after the end of the episode. He is stuck in darkness, practically brain dead. His house is on \"do not disturb\" mode, he doesn't seem to have any family, friends or neighbours who check in and they won't be back at work for 8 days. So that's 8 days without food or water before someone notices he is trapped. \n\nShut up and Dance: We all know about the creepy scene at the start, but there are other details about Kenny that show that he is off. You might not notice it the first time watching, but your brain did. The way he acts when his sister takes his laptop, him putting a lock on his door, his emails have some messages called \"pics\" and one of them is favourited. He stares at the drawing in the restaurant for a long time. The song he is watching with his sister has the lyrics \"So many *ladies* and the music playing loud Just one *girl*, she'll stand out from the crowd\" referencing the fact that Kenny ignores the ladies in his life for his own twisted desires. \n\nWhite Bear: Victoria has marks on her wrists at the start that is later revealed to be from her constantly being put in cuffs/zip-ties/rope. \n\nFifteen Million Merits: Bing takes the jokes Swift says and uses them himself later for his own benefits. This is exactly what the system does to him, taking him and uses him to their benefit. There is also the fact that Charity (the female Judge) shows several signs of being uncomfortable with what they do to Abi.\n\nMen against fire: The episode title is a reference to the MASS system being in place to make it easier for the soldiers to fire their weapons. Once Stripe figures it out, he does not fire another weapon for the rest of the episode. \n\nThese are the main ones I can think of now. What are details you found? ",
        "created_utc": 1535893085,
        "upvote_ratio": ""
    },
    {
        "title": "Some small gripes with Black Museum I thought were stupid.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/9cb05d/some_small_gripes_with_black_museum_i_thought/",
        "text": "Why did Nish pretend to be British? \n\nRolo had zero depth, but he'd make a good Joker.\n\nCouldn't help but feel like it was a little bit race-y, but not enough for me to think it wasn't beliveable or ruined my experience overall.\n\nIf this is post Crocadile (we see the bathtub, which confirms it), why didn't they just scan his memory and find out he was innocent?\n\nWhere did Nish get a conciousness sapper thingy?\n\nOther then that, loved the stories. Wish they were their own episodes. Take this with a grain of salt, just my personal gripes and over thinking that have been gnawing my mind for a while.",
        "created_utc": 1535882172,
        "upvote_ratio": ""
    },
    {
        "title": "Season 5-episode Bandersnatch-casting (POSSIBLE spoilers)",
        "author": "JustinDuck",
        "url": "https://www.reddit.com/r/blackmirror/comments/9catgb/season_5episode_bandersnatchcasting_possible/",
        "text": "[http://www.princestone.com/file-3LVci9PcQ2TcCwWulyilXOZIXOxIgl9ueRroD2rLGQ0jhGtdcO](http://www.princestone.com/file-3LVci9PcQ2TcCwWulyilXOZIXOxIgl9ueRroD2rLGQ0jhGtdcO) Not sure if this has been posted here yet somewhere, but I happened to come across the CV for the camera operator of the episode \"Bandersnatch\" which also reveals the director (David Slade) and cast members; Fionn Whitehead (misspelled as Fiona) from for example Dunkirk, Will Poulter from The Revenant, Detroit etc. and Craig Parkinson from multiple British TV-shows. \n\nSounds very intriguing, to me atleast...",
        "created_utc": 1535879330,
        "upvote_ratio": ""
    },
    {
        "title": "After series of thoughts, Ive come to a conclusion to stop watching black mirror.",
        "author": "swaeleegram",
        "url": "https://www.reddit.com/r/blackmirror/comments/9ca4uu/after_series_of_thoughts_ive_come_to_a_conclusion/",
        "text": "I'm at season 3 😭😭 and can't bear the thought of having finished it and craving for more....same thing happened with breaking bad and I kept having dreams.",
        "created_utc": 1535870019,
        "upvote_ratio": ""
    },
    {
        "title": "Black mirror inspired “magic for humans” episode. Show about magic on Netflix btw it’s funny if any of you wanna check it out.",
        "author": "oceans09",
        "url": "https://i.redd.it/ttottsxd3rj11.jpg",
        "text": "",
        "created_utc": 1535861548,
        "upvote_ratio": ""
    },
    {
        "title": "*First Time on BM Reddit *Whats with the reoccurring use of the song \"Anyone Who Knows What Love is\" in Black Mirror?",
        "author": "jguth21",
        "url": "https://www.reddit.com/r/blackmirror/comments/9c9b2u/first_time_on_bm_reddit_whats_with_the/",
        "text": "Ive seen it in the merits episode and white Christmas",
        "created_utc": 1535860494,
        "upvote_ratio": ""
    },
    {
        "title": "This sure reminds me of something...... for those who don’t know it’s a wired article about a man who builds a chatbot of his dying father in order to talk to him once he passes",
        "author": "vsvpawgetdeof",
        "url": "https://i.redd.it/w6wh5ee8voj11.jpg",
        "text": "",
        "created_utc": 1535834590,
        "upvote_ratio": ""
    },
    {
        "title": "What ideas would you want BM to do in future seasons?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/9c4fec/what_ideas_would_you_want_bm_to_do_in_future/",
        "text": "[deleted]",
        "created_utc": 1535819632,
        "upvote_ratio": ""
    },
    {
        "title": "Yes, what DID we do to deserve them?",
        "author": "tsunadehokage",
        "url": "https://i.redd.it/eaz68gd8mnj11.jpg",
        "text": "",
        "created_utc": 1535819451,
        "upvote_ratio": ""
    },
    {
        "title": "Be Right Back is getting closer and closer...",
        "author": "notsomuchreally",
        "url": "https://www.dailystar.co.uk/news/world-news/726877/AI-bring-dead-back-life-human-replicas-3D-technology-video",
        "text": "",
        "created_utc": 1535818659,
        "upvote_ratio": ""
    },
    {
        "title": "I just watched S3E2",
        "author": "Miki_360",
        "url": "https://www.reddit.com/r/blackmirror/comments/9c3yql/i_just_watched_s3e2/",
        "text": "The episode that has to do with VR horror. HOLY SHIT that was good. I'm still shocked and almost speechless after that. It was so weird and fucked up, but still so good. I don't know what other people think of it but I fucking loved it. It was so great after a, in my opinion, weak season start. ",
        "created_utc": 1535816220,
        "upvote_ratio": ""
    },
    {
        "title": "S02E03 [Spoilers] The Waldo Moment vs. SHIELD",
        "author": "aramantha",
        "url": "https://www.reddit.com/r/blackmirror/comments/9c16cv/s02e03_spoilers_the_waldo_moment_vs_shield/",
        "text": "{Spoilers for The Waldo Moment  - and Iron Man :D}\n\nI read recently, in one of those bizarre art-mimics-life moments, Robert Downey Jr. actually ad-libbed the entire \"I am Iron Man\" news conference scene, contrary to the movie's original plan to maintain Iron Man's secret identity just like they do in the original comics. That one decision by RDJ would resonate, creating more success for the entire 10-year history in the MCU. \\[[https://bit.ly/2wx3ssg](https://bit.ly/2wx3ssg) \\] This was a gamble that paid off handsomely over time, motivated by a recognition of his fictional character's soul.\n\nThere's a reason I think this is relevant to The Waldo Moment. Jamie has his own identity crisis, and he maintains a sort of semi-secret identity until the end, when he publicly outs himself, out of a some sense of decent guilt. But Jamie is not Tony Stark, or RDJ.  By refusing to read his \"cue-cards\" /follow his producer, Jaimie abdicates his control, he loses custody of the soul of Waldo, and the blue bear is co-opted by the media, as directed by a certain shadowy government Agency. Jamie is instantly replaced, and Waldo goes on to rule the world, without Jamie. Waldo becomes the face and message\\[distraction\\] of the Agency now. And the Agency is doing, what exactly?... it's Black Mirror, so it can't be good.\n\nAlso, Jamie doesn't own Waldo. Tony pushed back against control and won, he kept ownership of Iron Man, and so the suit could not be co-opted by SHIELD, that is to say HYDRA. If Tony had agreed to read his cards, had maintained his secret identity, how soon would it have been that HYDRA would have struck him down, stolen the suit and become the new Iron Man? It would have been easy to make up a story covering up Tony's death just as they covered up the death of his enemy Obadiah Stane. Iron Man would then be the face of SHIELD, but in reality the arm of HYDRA, with no one the wiser. Poor Captain Rogers would have to fight both Iron Man and the Winter Soldier during that next movie.\n\nBut once Tony announced himself, SHIELDRA was stuck - they couldn't just take Iron Man as long as Tony was still in the public eye, bigger than life. Take away the suit and he's still that \"genius billionaire playboy philanthropist.\" Instead they had to manipulate him into playing along.\n\nBut without Waldo, Jamie is just a nobody. Jamie listened to his heart, and rejected the secret hypocrisy - in the same way as Tony Stark did, and even as RDJ did - but he didn't win in the end. Or did he? After all, he is alive. Don't tell me the \"Agency\" wouldn't have erased him just as easily as Hydra could the moment he refused to play ball. And who is to say the Waldo producer who instantly took over for him hasn't been replaced 2 or 3 times by now - with no one the wiser? Had the owner refused to play ball too, maybe the Agency would have been stuck, like SHIELD was with Tony Stark. Or they would have gone to a rival like HammerTech, and created a new cartoon puppet prince to spearhead their New World Order.\n\nIn the end, we are made to feel sorry for Jamie. Waldo is everywhere, if he'd just gone along he'd be famous, or wealthy, or powerful! But I think really, even if he'd gone along initially, he would have revolted against Agency agendas eventually, and he'd really just be dead. Or ruined &amp; turned out on the streets, where he is anyway. At least this way, one likes to think, he still has his soul.\n\n​",
        "created_utc": 1535785606,
        "upvote_ratio": ""
    },
    {
        "title": "More memes",
        "author": "Arys1393",
        "url": "https://www.reddit.com/r/blackmirror/comments/9bztxt/more_memes/",
        "text": "This subreddit has had a severe lack of memes recently, it’s mainly just reposts about the robot bees or China implementing a rating system. Post more memes!\n\nOh and before you ask why I don’t post memes, haha. I am a memelord, I don’t create, I cultivate. ",
        "created_utc": 1535770851,
        "upvote_ratio": ""
    },
    {
        "title": "I love anthologies.",
        "author": "aramantha",
        "url": "https://www.reddit.com/r/blackmirror/comments/9bz5px/i_love_anthologies/",
        "text": "I love anthologies. Loved Twilight Zone, Outer Limits, Night Gallery, Tales from the Darkside, Alfred Hitchcock Presents and some less famous ones I can't remember the names of-  like that one with the guy who plays Freddy Krueger telling grim stories in the back of a diner...\n\nI've even watched reruns of that old Live Playhouse series from the sixties.\n\nBlack Mirror is definitely one of the very best of the anthologies I've seen. My favorite used to be Night Gallery, simply because I watched it as a tiny child and it was the first show to ever give me the shivers.\n\nWhich ones do you like? Anyone got any recommendations now that I'm caught up with Black Mirror?",
        "created_utc": 1535764224,
        "upvote_ratio": ""
    },
    {
        "title": "[S04E04] Analysis of Hang the DJ (25YL), or, why dating is the worst",
        "author": "caemeron",
        "url": "https://www.reddit.com/r/blackmirror/comments/9bz4xi/s04e04_analysis_of_hang_the_dj_25yl_or_why_dating/",
        "text": "Does the ultimate system of the dating app in Hang the DJ make sense? Would the system as it was originally presented be so bad? \n\nWhat do you all think? I am looking forward to hopefully engaging in some discussion about this one. \n\nThanks to anyone who takes the time to read my thing.\n\n\nhttps://25yearslatersite.com/2018/06/04/black-mirror-hang-the-dj/",
        "created_utc": 1535764025,
        "upvote_ratio": ""
    },
    {
        "title": "Accents of judge Wraith and Bing",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/9bywee/accents_of_judge_wraith_and_bing/",
        "text": "They certainly sound British to me but not quite the usual accents you hear from white people. Do they speak in the same accent? Is it a norm\nIn the UK for people of different ethnic group to have their own accent?",
        "created_utc": 1535761831,
        "upvote_ratio": ""
    },
    {
        "title": "I wish I could start again",
        "author": "Jamie1410",
        "url": "https://www.reddit.com/r/blackmirror/comments/9bylzw/i_wish_i_could_start_again/",
        "text": "Having seen all the episodes at least twice (some 5 or 6 times) I wish someone would invent a machine to wipe my memory of Black Mirror so I can enjoy them like I did first time around \n\nThat said , if such a device did exist it would probably delete the memories of my entire family and get its own episode \n\nI envy the people who post here saying 'I just started watching OMG' ",
        "created_utc": 1535759223,
        "upvote_ratio": ""
    },
    {
        "title": "Two more actors confirmed for Bandersnatch 👀",
        "author": "[deleted]",
        "url": "https://i.redd.it/18ij985v8ij11.jpg",
        "text": "[deleted]",
        "created_utc": 1535754453,
        "upvote_ratio": ""
    },
    {
        "title": "Confused by the Waldo moment",
        "author": "YazanKhatib",
        "url": "https://www.reddit.com/r/blackmirror/comments/9bxmde/confused_by_the_waldo_moment/",
        "text": "I've just watched the Waldo moment and I understand how he is an independent that the government \"agency\" use him to its own benefits but the scene at the very end waldo in different cultures what does it exactly mean? ",
        "created_utc": 1535751067,
        "upvote_ratio": ""
    },
    {
        "title": "Started watching Black Mirror a couple days ago, and just saw White Christmas.",
        "author": "Lance_Lionroar",
        "url": "https://www.reddit.com/r/blackmirror/comments/9buyue/started_watching_black_mirror_a_couple_days_ago/",
        "text": "I just came here to say: I need someone to hold me. God damn that episode got me good. I think it also happens to be one of the most brilliant episodes I've ever seen in any show. I'm gonna go cry now.",
        "created_utc": 1535732106,
        "upvote_ratio": ""
    },
    {
        "title": "No.",
        "author": "[deleted]",
        "url": "https://www.independent.co.uk/news/world/asia/china-surveillance-big-data-score-censorship-a7375221.html",
        "text": "[deleted]",
        "created_utc": 1535729883,
        "upvote_ratio": ""
    },
    {
        "title": "My fan art for Black Mirror's Black Museum.",
        "author": "kidtsamba",
        "url": "https://i.redd.it/y6lxd0mc7gj11.png",
        "text": "",
        "created_utc": 1535729722,
        "upvote_ratio": ""
    },
    {
        "title": "black mirror and handmaidens movie fanfiction",
        "author": "Puddingpop5",
        "url": "https://youtu.be/7eoSZ_8dJCs",
        "text": "",
        "created_utc": 1535729578,
        "upvote_ratio": ""
    },
    {
        "title": "Hang the DJ for the single mid-30 something year old",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/9buavh/hang_the_dj_for_the_single_mid30_something_year/",
        "text": "[removed]",
        "created_utc": 1535727410,
        "upvote_ratio": ""
    },
    {
        "title": "‘National Anthem’ is a bad first episode and probably costs this show a lot of viewers",
        "author": "SillyMattFace",
        "url": "https://www.reddit.com/r/blackmirror/comments/9bsr0z/national_anthem_is_a_bad_first_episode_and/",
        "text": "A while back I recommended Black Mirror to a friend at work. She later started watching with her husband, but after finishing National Anthem, they concluded they didn’t really want to watch a TV show about pig-fucking. “So is SillyMattFace a bit fucked up or what?”, asked the husband, as the porcine copulation unfolded.\n\nThis week, office conversation turned to Black Mirror due to news about plans to ban AI in warfare (we work in the cyber security sector so relevant topics are never far away) and another colleague said they also dropped it after the first episode, while someone else’s other half quit hallway through.\n\nNow I actually like National Anthem. I think it raises some interesting questions about our media consumption, and also has a lot of funny and tense moments by turns. Plus, I really like Rory Kinnear and enjoyed him as the PM.\n\nHowever, the use of pig fucking as the overarching plot device really overshadows everything else. It’s so deeply crude and out there that it dilutes any message the episode is trying to deliver and it turns into the same kind of gross-out, car-crash spectacle it’s trying to call out.\n\nIt’s also a weird choice of first episode because the speculative futurism and dystopian sci-fi elements that are the show’s hallmarks are pretty much absent. Almost every other episode is hinged around advancing technology and the resulting social shifts and the only other one I can think of that exists entirely in the here and now is Shut Up and Dance.\n\nHowever, I personally find that to be one of the most powerful and affecting episodes, in part \\*because\\* it is entirely feasible right now. While National Anthem \\*could\\* happen right now, the whole premise is too ridiculous for that to take root and have anything like the same impact.\n\nNow whenever I try and get someone into the show I always recommend skipping ahead and checking out one of the later episodes. The show has enough variety that I’ve found I can pick a taster episode based on the individual (USS Callister for my Star Trek-loving dad, San Junipero for my wife who doesn’t like things too bleak, etc)\n\nAnyone else experience National Anthem directly putting people off of the show? I can only imagine how many people caught it on TV back in the day or randomly chose it on Netflix and then noped out. Maybe it’s for the best that Netflix suggests the new seasons first.\n\n&amp;#x200B;\n\n\\*Just a quick edit to say I didn't expect this to be such a contentious issue - about 300 more replies here than I anticipated. Interesting mix of insightful comments about what is good about the episode and how it's less well suited for streaming than live TV, and people just calling me a fucking stupid pussy American with no taste or balls. Thanks to the former, mostly amused eye rolls for the latter. \n\n&amp;#x200B;\n\nAlso just to clarify, I'm as English as they come, and so is everyone I mentioned above. Not that I think there's a strict correlation between being English and tolerating/enjoying pig fuckery. Also just to note as many people have missed this, I \\*do\\* like the episode overall. And just because my friends didn't dislike it because they are squeamish and couldn't take it, they just thought the pig fucking was the wrong kind of fucked up and not entertaining. ",
        "created_utc": 1535714430,
        "upvote_ratio": ""
    },
    {
        "title": "This sweatshirt is giving me major San Junipero vibes",
        "author": "[deleted]",
        "url": "https://www.levi.com/US/en_US/clothing/women/sweaters-sweatshirts/graphic-gym-crewneck-sweatshirt/p/359400001",
        "text": "[deleted]",
        "created_utc": 1535682021,
        "upvote_ratio": ""
    },
    {
        "title": "Mysticum - In Your Grave",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=s0yJPXrjc-Y",
        "text": "[deleted]",
        "created_utc": 1535680084,
        "upvote_ratio": ""
    },
    {
        "title": "The ending of Shut Up and Dance [spoilers]",
        "author": "benj2305",
        "url": "https://www.reddit.com/r/blackmirror/comments/9bogyy/the_ending_of_shut_up_and_dance_spoilers/",
        "text": "Couldn't Kenny and the guy at the end have quietly agreed to fake fight and have one of them pretend to be dead? Are we given any concrete reason they felt they had to go through with fighting to the death?",
        "created_utc": 1535671303,
        "upvote_ratio": ""
    },
    {
        "title": "Failing technology in a commercial for a Norwegian food store chain. Made me think of Black Mirror.",
        "author": "rodamaskin",
        "url": "https://youtu.be/sgJLpuprQp8",
        "text": "",
        "created_utc": 1535658468,
        "upvote_ratio": ""
    },
    {
        "title": "Starling murmuration",
        "author": "cbhat5",
        "url": "https://i.imgur.com/m3fHcvF.gifv",
        "text": "",
        "created_utc": 1535658221,
        "upvote_ratio": ""
    },
    {
        "title": "Charlie Brooker writes an official Black Mirror guide",
        "author": "wrathfulsalt",
        "url": "https://www.chortle.co.uk/news/2018/07/11/40451/charlie_brooker_writes_an_official_black_mirror_guide",
        "text": "",
        "created_utc": 1535640180,
        "upvote_ratio": ""
    },
    {
        "title": "Searching director Aneesh Chaganty discusses the all too negative depiction of technology in Black Mirror and the role of technology in cinema",
        "author": "quentinstein",
        "url": "https://www.firstpost.com/entertainment/searching-director-aneesh-chaganty-on-how-he-crafted-his-game-changing-tech-thriller-5078101.html",
        "text": "",
        "created_utc": 1535635781,
        "upvote_ratio": ""
    },
    {
        "title": "I just started watching this show today and just finished crocodile and black museum. What are the other episode that is your favorite?",
        "author": "survivor061213",
        "url": "https://www.reddit.com/r/blackmirror/comments/9bgi99/i_just_started_watching_this_show_today_and_just/",
        "text": "[removed]",
        "created_utc": 1535603099,
        "upvote_ratio": ""
    },
    {
        "title": "What happened after Season 2?",
        "author": "Aqoch",
        "url": "https://www.reddit.com/r/blackmirror/comments/9bc0jt/what_happened_after_season_2/",
        "text": "I just started watching Black Mirror recently and was really enjoying the show, but I just watched the first episode of Season 3 and I don't know what just happened.\n\nSo far as I can tell, it's been bought by Netflix and Americanized, and I have very mixed feelings about it. On the one hand, the idea behind the episode, the acting and production and everything were great, but the presentation of the story made it completely predictable. Nothing was kept hidden from the viewer, nothing was a mystery at any point; the viewer is never in the dark about what's going on. Everything was explained very clearly so that you're not only keeping pace with what's happening, but if you've got a working head on your shoulders, you're several steps ahead twiddling your thumbs, waiting for the show to catch up and be over.\n\nOn the whole, I hated it.\n\nIf there's anyone who can relate to my experience, but has seen beyond this episode, can you please tell me whether it continues in this vein: whether there's any point in watching further, or whether season 3 is where the show went to die. I'd really appreciate the time you would save me to let me know if this is, virtually, where the series ended or not. Thanks!",
        "created_utc": 1535568255,
        "upvote_ratio": ""
    },
    {
        "title": "What functional utility does the black screen(read mirror) after every act has like \"End of Part .......\"?",
        "author": "altamashghazi",
        "url": "https://www.reddit.com/r/blackmirror/comments/9bbi0f/what_functional_utility_does_the_black_screenread/",
        "text": "[removed]",
        "created_utc": 1535564725,
        "upvote_ratio": ""
    },
    {
        "title": "Best BM episodes? New to the show here",
        "author": "KMiller152",
        "url": "https://www.reddit.com/r/blackmirror/comments/9bavhx/best_bm_episodes_new_to_the_show_here/",
        "text": "Hey guys I just found the show last night while giving netflix a try. \n\n&amp;#x200B;\n\nCould you please tell me what are the best episodes that I still have to watch? \n\nI have seen these episodes.\n\n&amp;#x200B;\n\nThe National Anthem - Absolutely loved it, what a wonderful premiere episode to set the tone for the series\n\nFifteen Million Merits - I really loved it\n\nNosedive - The premise was great, the story was great but I hated the filters and the actress who played the protagonist.\n\nShut up and dance - This was my favorite, the twist was so unexpected.\n\nHated in the Nation - I really liked this episode, I didn't like the very very end (The scene in the other country) but  the episode was great\n\n&amp;#x200B;\n\nWell I have seen those only, I have yet to watch many episodes. I'll be gladly waiting for your comments, thank you!\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;",
        "created_utc": 1535560545,
        "upvote_ratio": ""
    },
    {
        "title": "What movies do you think that could be Black Mirror episodes? Some examples would be \"The Truman Show\", \"Eternal Sunshine Of The Spotless Mind\" or \"Being John Malkovich\"",
        "author": "sh1kabala",
        "url": "https://www.reddit.com/r/blackmirror/comments/9barkx/what_movies_do_you_think_that_could_be_black/",
        "text": "&amp;#x200B;",
        "created_utc": 1535559810,
        "upvote_ratio": ""
    },
    {
        "title": "Virtual reality will be used at Yee Hong Centre for Geriatric Care homes",
        "author": "meeyeam",
        "url": "https://www.msn.com/en-ca/news/canada/virtual-reality-will-be-used-at-yee-hong-centre-for-geriatric-care-homes/ar-BBMzUQl",
        "text": "",
        "created_utc": 1535551059,
        "upvote_ratio": ""
    },
    {
        "title": "[spoilers]White Bear and Judgement Night",
        "author": "SirBamboozled",
        "url": "https://www.reddit.com/r/blackmirror/comments/9b9beh/spoilerswhite_bear_and_judgement_night/",
        "text": "This has been posted before but I found White Bear and to an extent White Christmas both very similar to The Twilight Zone Judgement Night. \n\nMaking someone relieve their biggest sin seemingly forever as a punishment for what they have done is a big theme for both main characters in each episode. For those of you that have seen Judgement Night, do you see the similarities? \n\nApologies in advanced for any typo's it's late here. ",
        "created_utc": 1535549567,
        "upvote_ratio": ""
    },
    {
        "title": "Virtual reality will be used at Yee Hong Centre for Geriatric Care homes",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/9b99iq/virtual_reality_will_be_used_at_yee_hong_centre/",
        "text": "[deleted]",
        "created_utc": 1535549138,
        "upvote_ratio": ""
    },
    {
        "title": "Episodes with jump scares?",
        "author": "NeverbuyfromSamsung",
        "url": "https://www.reddit.com/r/blackmirror/comments/9b86cq/episodes_with_jump_scares/",
        "text": "I've watched Black Mirror sequentially up to S3E01, but I heard the episode after that has jump scares so I stopped there.\n\nWhat episodes have jump scares? Is it okay to skip them or will that cause me to miss some references in later episodes?",
        "created_utc": 1535539659,
        "upvote_ratio": ""
    },
    {
        "title": "Binge watched the entire series this past weekend. I'm mad at myself for putting it off.",
        "author": "Kinkajou1015",
        "url": "https://www.reddit.com/r/blackmirror/comments/9b7wf7/binge_watched_the_entire_series_this_past_weekend/",
        "text": "I watched them in order, a few things came to mind. \n\n* I didn't realize it was a British show when I started watching. \n* I expected creepy and disturbing, I had gleaned that from the internet without getting outright spoiled, but some spots it was even more creepy and disturbing than I could have imagined. This isn't a bad thing really, but still. \n* There was a lot more sex than I would have expected. \n* In Season 4 it finally clicked they were smoking on screen and I realized, hey, that's kinda unheard of in media today.\n* I liked the Batman reference in S2:E3 even though it was my 17th favorite episode overall. \n* Favorite season overall is 3, least favorite a tie between 2 and 4.",
        "created_utc": 1535536774,
        "upvote_ratio": ""
    },
    {
        "title": "So my professor had a foldable podium...",
        "author": "quentinchoy",
        "url": "https://i.redd.it/q2jojonxiyi11.jpg",
        "text": "",
        "created_utc": 1535515671,
        "upvote_ratio": ""
    },
    {
        "title": "Shut Up and Dance (Spoiler)",
        "author": "1Proton1",
        "url": "https://imgur.com/gallery/e18u0Lr",
        "text": "",
        "created_utc": 1535498377,
        "upvote_ratio": ""
    },
    {
        "title": "What was the biggest lesson you learned from watching Black Mirror? How has it affected your life?",
        "author": "DoctorZ3d",
        "url": "https://www.reddit.com/r/blackmirror/comments/9b0cep/what_was_the_biggest_lesson_you_learned_from/",
        "text": "[removed]",
        "created_utc": 1535473424,
        "upvote_ratio": ""
    },
    {
        "title": "I just realised how many hints are put into each episode about its outcome.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/9azybm/i_just_realised_how_many_hints_are_put_into_each/",
        "text": "[deleted]",
        "created_utc": 1535470677,
        "upvote_ratio": ""
    },
    {
        "title": "The Truman Show",
        "author": "Freaknature17",
        "url": "https://www.reddit.com/r/blackmirror/comments/9az0rs/the_truman_show/",
        "text": "We just watched the Truman Show in school because we're studying Plato's Allegory of the Cave and Truman himself is analogous to the prisoner who was freed from the cave and finally saw the world . While watching it I got heavy Black Mirror vibes from it. The whole gist of it is very similar to the episode \"White Bear.\" If you're interested in sci-fi movies and Black Mirror, I would highly recommend you watch it. ",
        "created_utc": 1535463766,
        "upvote_ratio": ""
    },
    {
        "title": "Crocodile: The Good, the Bad and the Ugly",
        "author": "chasesdiagrams",
        "url": "https://www.reddit.com/r/blackmirror/comments/9ayta9/crocodile_the_good_the_bad_and_the_ugly/",
        "text": "I'm going to provide my take on the three main character of the episode. Also, this contains major spoilers.\n\n\"Good\" and \"bad\": It was Rob's idea to hide the body, out of a selfish reason. Why did Mia give in to Rob's demand? Maybe, She was too shocked and devestated and just let Rob decide on her behalf. Also, she might have done an illegal and unethical thing in order to protect a loved one.\n\nNow, fifteen years after the incident, Mia had a lot to lose, Rob didn't. Of course, it might be argued that Rob just couldn't pull his life together because of the guilt, while Mia just had found a way to move on despite an unclear conscience. This also has something to do with the sunk cost fallacy. They both paid heavily in an emotional way for hiding the incident; Mia was able to create a descent life despite of the pain, while Rob couldn't. Now, in Mia's mind all the pain and inner conflict she had experienced while building her life would have been in vain if the beans had been spilled. But Rob hadn't gained much for hiding his pain, so it was way easier for him to put himself in risk by writing a letter.\n\nAll that being said, the Rob's decision to write a letter was the right and the ethical choice, and Mia's decision to give in to Rob's demand to hide the body was a wrong decision. One of the most emotionally devastating lines for me and in this regard was the final sentence of the last song: \"You know you gonna be remembered for the things you say and do\". \n\nAs a final note on Mia, while it's extremely difficult for me to *empathize* with her considering all the things she did, I can definitely *sympathize* with her (As I can with all the other \"evil\" characters in the series).\n\nNow about the \"ugly\" character: It was Shazia. It became very hard for us to criticize her after the horrifying things that happened to her and her family, but she should be criticized. Of course, she was doing her job and she had the law on her side. Not only that, the law forced people to cooperate with her. But it doesn't change the fact that what she had been doing was highly unethical. She made a living out of intruding people privacy, and harming them emotionally. To make it worse, she seemed to have a very clear conscience despite of that.\n\n&amp;#x200B;\n\n&amp;#x200B;",
        "created_utc": 1535462095,
        "upvote_ratio": ""
    },
    {
        "title": "Shut Up And Dance // What Makes a Protagonist.",
        "author": "ChanceSDM",
        "url": "https://www.reddit.com/r/blackmirror/comments/9aw81e/shut_up_and_dance_what_makes_a_protagonist/",
        "text": "**\\*THIS THREAD SHOULD LEAD TO OPEN DISCUSSION, I DON'T WANT MY VIEWS EXPRESSED HERE TO BE TAKEN AS DEFINITIVE, AND WOULD LOVE MULTIPLE OTHER OUTLOOKS\\***\n\nThat being said, during a close friend's 18th birthday party, several of us decided to dive into the cryptic, and dark world of Black Mirror. Shortly after, we experienced heartbreak, death, political and emotional deception, and terrorism. And while we didn't fall into a VR simulation screaming \"MOM!\" from the top of our lungs, we did engage in discussion about what we'd seen.\n\nThe most interesting (imo) of which, revolved around Season 3 Episode 3, *Shut Up and Dance*.\n\nMainly, who to root for? In previous episodes like *USS Callister* or *Fifteen Million Merits*, our main hero(s) were established from the get-go, without much deviation as the episode went on. Obviously Kenny of *SU&amp;D* begins as our protagonist, but is that term symbolic with \"hero\"?\n\nAs the episode comes to a close and we discover the true nature of his crimes, pedophilia. Kenny starts to warp far across the line of an Anti-Hero, becomes something of a villain, when compared to our local and luxurious couch-based lifestyle. But what about that is so enjoyable? I think because that wasn't the first episode of Black Mirror I'd seen, I was OK with the ending, but at the end of the day it still seems sort of... lackluster.\n\nA character we'd sympathized with for the entire episode, turned into someone we couldn't root for anymore. **Kenny turned into a bad person**. We as an audience are then faced with a question; who's side are we on now? Do we still hope Kenny makes it out, and if so does that make us morally gray, as to root for a pedophile? Or do we abandon the main character completely and by doing so, our investment in the episode? So my open-ended questions can be stated as such:\n\n1.) Were you disappointed with this ending/how Kenny ended up?\n\n2.) What about a protagonist makes us want to root for them, and were those characteristics stripped from Kenny at the end of the episode?\n\n3.) Is Kenny still the \"hero\" of the story? Or had his character turned into an Anti-Hero, or even Villain?\n\n​",
        "created_utc": 1535433750,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror As Fuck, this whole game,",
        "author": "kognito12",
        "url": "https://www.youtube.com/watch?v=euqbMkM-QQk",
        "text": "",
        "created_utc": 1535431675,
        "upvote_ratio": ""
    },
    {
        "title": "Episode Idea",
        "author": "Walittle",
        "url": "https://www.reddit.com/r/blackmirror/comments/9avooy/episode_idea/",
        "text": "[removed]",
        "created_utc": 1535428348,
        "upvote_ratio": ""
    },
    {
        "title": "\"San Junipero\" by nunar",
        "author": "NaiadoftheSea",
        "url": "https://i.redd.it/yezz8wl3xqi11.jpg",
        "text": "",
        "created_utc": 1535423579,
        "upvote_ratio": ""
    },
    {
        "title": "Doki Doki Literature Club",
        "author": "Mariboom94",
        "url": "https://www.reddit.com/r/blackmirror/comments/9at26x/doki_doki_literature_club/",
        "text": "Hey guys and gals!\nYesterday I played a game on Steam called Doki Doki literature club. You have no idea how close to black mirror the whole experience is. It terrified me because of this. Might seem like a happy cute move dating Sim game, but it isn't. Would 100% suggest to anyone who's interested in something different and creepy. \n\nHas anyone else played it? Would like to hear your opinion on this. \n\nNote : if you actually play it, just go blind. Don't Google it. You'll probably get spoiled. ",
        "created_utc": 1535405944,
        "upvote_ratio": ""
    },
    {
        "title": "Magic for Humans on Netflix",
        "author": "aback5",
        "url": "https://v.redd.it/s99bi2w99pi11",
        "text": "",
        "created_utc": 1535403530,
        "upvote_ratio": ""
    },
    {
        "title": "I wrote a little jingle about Black Mirror but need to finish it! Looking for your guys help with quotes and references to add to the lyrics !",
        "author": "JerseyEnt",
        "url": "https://youtu.be/tM14GADh8ME",
        "text": "",
        "created_utc": 1535394738,
        "upvote_ratio": ""
    },
    {
        "title": "robot bees may soon be a thing, and potentially going to be controlled by corporate overlords.",
        "author": "vwtdi--P",
        "url": "https://www.weforum.org/agenda/2018/03/autonomous-robot-bees-are-being-patented-by-walmart",
        "text": "",
        "created_utc": 1535377931,
        "upvote_ratio": ""
    },
    {
        "title": "The National Anthem, unrealistic?",
        "author": "k0ntagious",
        "url": "https://www.reddit.com/r/blackmirror/comments/9aos63/the_national_anthem_unrealistic/",
        "text": "I think this episode bothers me the most about BM. I really enjoy the concept of this episode and they way that they play it, but I can’t help but think, this would never happen. \n\nAll of the other episodes have an element of “oh sht, this could happen”, but I can’t see that the events of this would take place. \n\nThoughts?",
        "created_utc": 1535375309,
        "upvote_ratio": ""
    },
    {
        "title": "A comparison between \"Black Museum\" and \"Curtain: Poirot's Last Case\"",
        "author": "chasesdiagrams",
        "url": "https://www.reddit.com/r/blackmirror/comments/9aoo1m/a_comparison_between_black_museum_and_curtain/",
        "text": "In addition to \"Black Museum\", this post contains spoilers for \"Curtain: Poirot's Last Case\".\n\nHere is a plot summary for the later: [https://en.wikipedia.org/wiki/Curtain\\_(novel)#Plot\\_summary](https://en.wikipedia.org/wiki/Curtain_(novel)#Plot_summary)\n\n   Rolo and Norton were both extremely dangerous and immoral characters, who had one thing in common: They were both law-abiding people. Nish and Poirot went on to stop them in the only possible way which was taking justice into their own hands and executing them. But there were very important differences between Nish and Poirot. \n\n   Nish did it in a very self-righteous way, while Poirot didn't (Poirot actually punished himself by not taking his medicine and dying as a result). Also, Nish went on and pulled the lever and also trapped a digital clone of Rolo in a device in an unending cycle of pain. I really cannot put her morally on top of those people who executed the digital clone of his father over and over again. But Poirot actually ran a \"trial\" and sentenced Norton to death, and let him know about it. He didn't torture Norton and executed him in his sleep by putting a bullet into his head. Poirot just felt obliged to stop Norton, because the law couldn't do that, nothing more. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;",
        "created_utc": 1535374340,
        "upvote_ratio": ""
    },
    {
        "title": "Oh shit",
        "author": "dennisklappe",
        "url": "https://i.imgur.com/jnwBqq2.png",
        "text": "",
        "created_utc": 1535373429,
        "upvote_ratio": ""
    }
]