[
    {
        "title": "A doctor feeling pain, sound familiar?",
        "author": "A-single-Meeseek",
        "url": "http://www.bbc.co.uk/news/stories-43572639?ocid=socialflow_facebook&amp;ns_mchannel=social&amp;ns_campaign=bbcnews&amp;ns_source=facebook",
        "text": "",
        "created_utc": 1522921491,
        "upvote_ratio": ""
    },
    {
        "title": "I just had an incredibly \"Nosedive\" moment.",
        "author": "caesarsaladmustdie",
        "url": "https://www.reddit.com/r/blackmirror/comments/89y7xz/i_just_had_an_incredibly_nosedive_moment/",
        "text": "Recently I went on a short trip to Qatar.\n\nFor those of you who don't know, Saudi Arabia recently began a very sudden (to the outside world) blockade and condemnation of Qatar, after decades of friendship. For IR students like me, it's a hell of a fascinating place to be right now. Not just the wild desert landscapes, but also the political climate is so deliciously dramatic. I got some fantastic photographs and also included some interesting commentary on them on Instagram.\n\nSo I've been posting those pictures on Instagram, and receive one comment from a girl I went to summer school in the Netherlands with last year. She said she was envious of my eye-opening trip.\n\nNow this girl is no every day classmate. She's a fucking genius, and she's gorgeous too, as well as the owner of an incredibly impressive resumé, including NATO, the UK Foreign Ministry and God knows what else. And she's popular, people try to impress her. She's what every other girl wants to be.\n\nIts the first time she's ever commented on any of my posts, and I couldn't believe she said she was envious. She doesn't even comment on our other summer school classmates' posts, and they're pretty impressive too - sojourns around China, trekking across the Norwegian mountains, diving in the Adriatic. I was really happy with myself.\n\nAnd then my phone locked and I saw Bryce Dallas Howard looking breathlessly back at me in my reflection. \n\nHelp.",
        "created_utc": 1522919700,
        "upvote_ratio": ""
    },
    {
        "title": "Black skincare",
        "author": "Blackunited",
        "url": "https://www.reddit.com/r/blackmirror/comments/89y3uc/black_skincare/",
        "text": "[removed]",
        "created_utc": 1522918179,
        "upvote_ratio": ""
    },
    {
        "title": "Just one more!",
        "author": "morrisonismydog",
        "url": "https://i.redd.it/yyx1ysa7x0q01.jpg",
        "text": "",
        "created_utc": 1522905094,
        "upvote_ratio": ""
    },
    {
        "title": "Sooo be right back",
        "author": "sirducky123",
        "url": "https://youtu.be/Him2a5TWq40",
        "text": "",
        "created_utc": 1522904747,
        "upvote_ratio": ""
    },
    {
        "title": "Mommy needs a hug",
        "author": "krustypatties",
        "url": "https://i.redd.it/e7ajegq1f0q01.jpg",
        "text": "",
        "created_utc": 1522898994,
        "upvote_ratio": ""
    },
    {
        "title": "San Junipero. Almost finished.",
        "author": "lostgatherer",
        "url": "https://i.redd.it/rpporgg7c0q01.jpg",
        "text": "",
        "created_utc": 1522898151,
        "upvote_ratio": ""
    },
    {
        "title": "Why does the filter keep changing in USS Callister?",
        "author": "Jawn_Seenuh",
        "url": "https://www.reddit.com/r/blackmirror/comments/89vm3e/why_does_the_filter_keep_changing_in_uss_callister/",
        "text": "[removed]",
        "created_utc": 1522891944,
        "upvote_ratio": ""
    },
    {
        "title": "Season 3 Episode 3: Shut Up and Dance plothole?",
        "author": "zedsnotdead2016",
        "url": "https://www.reddit.com/r/blackmirror/comments/89va0f/season_3_episode_3_shut_up_and_dance_plothole/",
        "text": "So we know that Kenny has had his laptop stolen multiple times already by his sister and he takes numerous steps to avoid getting caught. So why on earth does he not even have a password? A guy who smells his hands after washing and suddenly installs a lock onto his door when he's out and is incredibly secretive about his habits should surely be able to put a password on his laptop?",
        "created_utc": 1522889064,
        "upvote_ratio": ""
    },
    {
        "title": "Someone Stop Him Before It's Too Late.",
        "author": "[deleted]",
        "url": "https://i.redd.it/vpmreqyzezp01.png",
        "text": "[deleted]",
        "created_utc": 1522886872,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror Advanced Analytics",
        "author": "s460",
        "url": "https://www.reddit.com/r/blackmirror/comments/89u4m2/black_mirror_advanced_analytics/",
        "text": "**Ratings**\n\nA while ago [I submitted](https://www.reddit.com/r/blackmirror/comments/85t6dj/black_mirror_episodes_analytics/) a request for people to rate Black Mirror episodes in order to do some analytics.\n\nThe original post didn't get a ton of exposure, but I did get 57 responses, which I feel is enough to present at least a somewhat interesting analysis.\n\nI present to you, /r/blackmirror's favorite Black Mirror episode:\n\n***White Christmas!***\n\nWhite Christmas was not only the most popular, but it also had the lowest standard deviation, which means that people were not in disagreement about it being good. Number 2, not trailing by much, is Shut Up and Dance, also with a relatively low standard deviation.\n\nFollowing up, /r/blackmirror's least favorite episode by a HUGE margin (also the fourth most controversial):\n\n***The Waldo Moment!***\n\nA lot of people just *hated* this episode, and gave it a 1/10. Other people gave it a spectrum of ratings, but all those 1/10's brought it down and made it \"controversial\". \n\nBe Right Back, the uncontroversial favorite from the three articles I linked in the last post, was eleventh place. Not a super controversial eleventh place either; only 5/47 people ranked it lower than 5.\n\nMy favorite, USS Callister, was the second least controversial episode, and it got 4th place. So people mostly liked it, but not as much as White Christmas.\n\nThe consensus worst from the compilation of articles, Men Against Fire, was the sixth worst according to Reddit, and not particularly controversial. \n\n[Here is the graph](https://imgur.com/a/4FYqF), complete with error bars (the longer the error bar, the more controversial the episode):\n\n**Heat Map**\n\nAnother analysis I though of was to look at the correlations between episodes. This would give you an idea, if you're trying to decide what episode to watch next (or what episode you want your friend/SO/family to watch). If you liked a certain episode, what other episode might you like? If you disliked a certain episode, what's a good episode should you try next? For example, if you like a smart, funny, entertaining episode about VR and full of cool Star Trek references, maybe you wouldn't like an episode about a miserable, sweaty, crying dude fucking a pig.\n\nSome actual hypotheses (mild spoilers ahead):\n\nPeople who like \"The Waldo Moment\" will also like \"The National Anthem\" and \"Hated in the Nation\" (because I feel like those are all \"I hate politicians\" episodes).\n\nPeople who liked \"San Junipero\" will also like \"Hang the DJ\" (romantic episodes)\n\nPeople who like \"Playtest\" will also like \"Men Against Fire\" (a brain implant making you see imaginary stuff)\n\n[Here's the actual heat map](https://imgur.com/a/iwVaF).\n\nAn interesting thing I noticed from this, is that \"White Christmas\" and \"Black Museum\" are strongly correlated, so the same people liked the two episodes with \"mini-episodes\" in them.\n\nOne of my three predictions was right: \"San Junipero\" lovers also liked \"Hang the DJ.\"\n\n**Clustering**\n\nFor those of you still reading, I also made a [hierarchical cluster map](https://imgur.com/a/31aPc).\n\nI can't really see anything illuminating here, aside from San Junipero being paired up with Hang the DJ. Also, \"Entire History of You\" is about a relationship, though I wouldn't call it \"romantic\". \"Fifteen Million Merits\" also has a relationship element, so I guess we can call the furthest left branch the \"relationship\" branch. I'm open to ideas about the other branches. \"White Christmas\" and \"White Bear\" both involve punishing a criminal?\n\nAnyway, hopefully people found this marginally entertaining. Cheers!",
        "created_utc": 1522880053,
        "upvote_ratio": ""
    },
    {
        "title": "IMO White Christmas is a little too dark",
        "author": "bigboy1213",
        "url": "https://www.reddit.com/r/blackmirror/comments/89u3gr/imo_white_christmas_is_a_little_too_dark/",
        "text": "Like I get that John Ham gets blocked cause he honestly was a bad immoral guy, but the dude who found out the baby he thought was his for 5 years isn't and his wife has cheated the whole time gets an infinite torture of isolation and pain? He killed the grandpa I know but still are we supposed to feel it's justified?",
        "created_utc": 1522879862,
        "upvote_ratio": ""
    },
    {
        "title": "Sound familiar?",
        "author": "Treadstone1971",
        "url": "https://apple.news/AXIL2CMBDRr2PkWGebKCfoA",
        "text": "",
        "created_utc": 1522878552,
        "upvote_ratio": ""
    },
    {
        "title": "I think we all know where this is heading...",
        "author": "goofy_goober112",
        "url": "http://www.bbc.com/news/stories-43572639",
        "text": "",
        "created_utc": 1522876655,
        "upvote_ratio": ""
    },
    {
        "title": "So it begins",
        "author": "pt_amadeus",
        "url": "https://i.redd.it/opirl8za7yp01.jpg",
        "text": "",
        "created_utc": 1522872183,
        "upvote_ratio": ""
    },
    {
        "title": "Black on black crime",
        "author": "Blackunited",
        "url": "https://www.reddit.com/r/blackmirror/comments/89s2t3/black_on_black_crime/",
        "text": "[removed]",
        "created_utc": 1522866181,
        "upvote_ratio": ""
    },
    {
        "title": "Opinions on the episodes i watched so far(SPOILERS)",
        "author": "Enricc1",
        "url": "https://www.reddit.com/r/blackmirror/comments/89ryo8/opinions_on_the_episodes_i_watched_so_farspoilers/",
        "text": "So i started this show i started with the whole first season and then now i am binge watching episodes in a random order.\n\nThe National Anthem 2/10 Hated it i think i may be the only one but no i just couldn't stand it i have an open mind but even i have my limits,i just hated how the episode involved more around the fact that the UK public want to see the minister fuck a pig Jesus\n\nFifteen Million Merits 7/10\nEven if the episode itself left us with more doubt like what are the drinks does this work like A brave new world if so why is there a new girl there and you kind of wish they would explain the world itself it is a likeable episode and the difference between this and the first one is that the first one barely focused on the consequences of fucking a pig in this one everyone faces their own consequences even if it is with a society they are all slaves on.I think it was a well done metaphore,also unlike the first episode all the little details count bear that in mind.\n\nThe Entire History of You 6/10\nIt is fine i guess we seen already enough metaphores on depression and holding into happy memories that it feels kinda vague and unintersting even if it has a good premise\n\nWhite Christmas 10/10\nThis episode has the best rating both on Letterboxd and Imbd and it is so fucking earned,everything just connects perfectly the side stories our anti-heroes the whole story of a future that suicide is worthless since you will be bored to death(no pun intended) With slaves and when you can block a person and that person will never see you ever so if someone you ever loved blocks you you will never be able to see that person ever again.I mean sure it is debatable if it is the most  fucked up scenario but it is without a doubt the most depresing one where our lives are based on ourselves and we can do whatever we want with the people that we love.\n\nBlack Museum 9/10\nNot as good as white christmas but this show can still deliver similar to White christmas these are stories on how we value life and people that feel pleasure in the pain of others themselves,you can now put a whole life in a teddy bear or in a toy and you are the ruler of that it is terrifying think that this show is.And rule number 1 i got from Shut Up And Dance that made me learn NEVER TRUST THE PROTAGONIST\n\nShut Up And Dance 8/10 Even if the easy answer would be to let the troll be troll before he does any crime the episode is a huge metaphore on how people die for their dignity and how blackmailing takes a plot twist in the worst direction possible still the episode gives a good laughs.It makes you happy scared VERY scared confused of what the fuck just happen but it is a good taste.\n\nWhat episode should i watch next?",
        "created_utc": 1522865453,
        "upvote_ratio": ""
    },
    {
        "title": "\"Black Mirror Has Gotten Way Too Dark\"",
        "author": "BlessBless",
        "url": "https://www.instagram.com/p/BhJ8R6klAis/?taken-by=futurismcartoons",
        "text": "",
        "created_utc": 1522862824,
        "upvote_ratio": ""
    },
    {
        "title": "The system in Hated in the nation is pretty unfair.",
        "author": "KindoflikeFlazeda",
        "url": "https://www.reddit.com/r/blackmirror/comments/89rjm8/the_system_in_hated_in_the_nation_is_pretty_unfair/",
        "text": "While I don’t think anyone deserved to die in this episode, some of them were still wishing death on someone. But what about the people that used the hashtag to warn people that it was real or that used the hashtag to talk about the hashtag. It just seems quite stupid that someone who did not wish death on anyone would die.",
        "created_utc": 1522862764,
        "upvote_ratio": ""
    },
    {
        "title": "What would you do if you were Kenny in Shut Up and Dance?SPOILERS",
        "author": "Enricc1",
        "url": "https://www.reddit.com/r/blackmirror/comments/89reat/what_would_you_do_if_you_were_kenny_in_shut_up/",
        "text": "Yes  i know he is a pedophile but the thing is,he kind of regret this i mean that is why he cries so much he peed himself.If you were Kenny would you let the troll be a troll?Or do more crimes so you can have none?\n\nPersonally i would let the troll be the troll face the consequences if it had to happen but think it like this even if the episode never says if he is an adult or not(like he could be 17 or 16 in the uk it is legal to work at that age) the less time you spend in prision like it was obvious it was a troll at first time so trusting a troll doesn't seem like a good idea and usually when someone blackmails you they make you do crimes.So it is kinda like picking between having one leg or no legs at all you want to have the two legs but the option is not there thanks to the tumor,This is pretty much the same,kenny for the most time did seem to care about this.In my opinion Pedophiles should be put into a mental hospital instead of just putting them to prision so they can become better people and overcome their feelings.\n\nBut what would you do? and no suicide is not a option",
        "created_utc": 1522861818,
        "upvote_ratio": ""
    },
    {
        "title": "White Bear",
        "author": "Mustafa0407",
        "url": "https://www.reddit.com/r/blackmirror/comments/89qxe6/white_bear/",
        "text": "[removed]",
        "created_utc": 1522858778,
        "upvote_ratio": ""
    },
    {
        "title": "Robotic dog? Oh boy....",
        "author": "park_injured",
        "url": "http://money.cnn.com/2018/03/20/technology/jeff-bezos-robot-dog/index.html",
        "text": "",
        "created_utc": 1522853453,
        "upvote_ratio": ""
    },
    {
        "title": "Get concerned.",
        "author": "[deleted]",
        "url": "https://www.weforum.org/agenda/2018/03/autonomous-robot-bees-are-being-patented-by-walmart",
        "text": "[deleted]",
        "created_utc": 1522852130,
        "upvote_ratio": ""
    },
    {
        "title": "Is China becoming a Black Mirror episode? Street Interviews with Asian Boss",
        "author": "robosocialist",
        "url": "https://youtu.be/AAIKh7AnTIk",
        "text": "",
        "created_utc": 1522851221,
        "upvote_ratio": ""
    },
    {
        "title": "its happening...",
        "author": "FingerKiss",
        "url": "https://i.redd.it/jkbuqd82cwp01.png",
        "text": "",
        "created_utc": 1522849566,
        "upvote_ratio": ""
    },
    {
        "title": "'Saint Juniper Ward' spotted in Black Museum",
        "author": "elvisspringsteen",
        "url": "https://i.redd.it/3usph42u9wp01.jpg",
        "text": "",
        "created_utc": 1522848837,
        "upvote_ratio": ""
    },
    {
        "title": "Rolo Haynes is worse than I thought",
        "author": "Teal_Mouse",
        "url": "https://www.reddit.com/r/blackmirror/comments/89pgm8/rolo_haynes_is_worse_than_i_thought/",
        "text": "Ok, so in Black Museum's second segment, I always found it pretty ridiculous that Jack, without much thought or resistance, consents to having Carrie transferred to an immobile monkey, even if they have major conflicts, as he could just put her on pause. I'd imagine that Jack would at least fight to put her in an android. And then I thought, what if Haynes altered Jack's mind? Haynes claimed that humans only use 40% of their brain, which has been shown to be untrue, so Jack's consciousness would need to somehow be compressed in order to fit Carrie. Well, what if Haynes took the opportunity to alter Jack's mind to be nonresistant to whatever experiment he might throw at him? It fits perfectly with Haynes character, considering he never tells his clients the full risks or consequences of his experiments. And it makes Jack a great test subject. Any thoughts?",
        "created_utc": 1522848656,
        "upvote_ratio": ""
    },
    {
        "title": "Some thoughts about 1x02 \"Fifteen Million Merits\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/89otlq/some_thoughts_about_1x02_fifteen_million_merits/",
        "text": "[deleted]",
        "created_utc": 1522843279,
        "upvote_ratio": ""
    },
    {
        "title": "On Reflection | Max Richter (from Black Mirror's Nosedive) (Piano Tutorial Synthesia)",
        "author": "saadmrb",
        "url": "https://www.youtube.com/watch?v=XAfWFKttoZY",
        "text": "",
        "created_utc": 1522839297,
        "upvote_ratio": ""
    },
    {
        "title": "Why is nobody aware of the unbelievable technological advances?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/89ocsi/why_is_nobody_aware_of_the_unbelievable/",
        "text": "[deleted]",
        "created_utc": 1522838482,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror nominated for three BAFTAs",
        "author": "williamthebloody1880",
        "url": "https://www.reddit.com/r/blackmirror/comments/89o16l/black_mirror_nominated_for_three_baftas/",
        "text": "Hang the DJ for Single Drama, Joe Cole for Best Actor and Jimmi Simpson for Best Supporting Actor.\n\n[Full list of nominees here](https://www.theguardian.com/tv-and-radio/2018/apr/04/bafta-tv-awards-nominations-full-list-2018-blue-planet-ii-line-of-duty)",
        "created_utc": 1522834798,
        "upvote_ratio": ""
    },
    {
        "title": "This sounds familiar",
        "author": "[deleted]",
        "url": "http://www.bbc.co.uk/news/stories-43572639",
        "text": "[deleted]",
        "created_utc": 1522822101,
        "upvote_ratio": ""
    },
    {
        "title": "What stories/technological themes do you want to see addressed in season 5?",
        "author": "TheTruckWashChannel",
        "url": "https://www.reddit.com/r/blackmirror/comments/89m9j3/what_storiestechnological_themes_do_you_want_to/",
        "text": "On the season 5 filming announcement thread I saw some people mentioning what they hope to see (largely \"no cookies\", it would seem) but I thought I'd make a thread specifically for current tech-related issues that'd make for a good story (for which you're also free to submit some ideas). \n\nMy ideas:\n\n- Cryptocurrency. I'm not following the news on Bitcoin as avidly as some others are but I think the show could explore the consequences of digital currency in terms of the privacy/security concerns surrounding the existing debate.\n\n- News media. This one might be a bit challenging to do without seeming too on-the-nose, since the ongoing conversation about social media and \"fake news\" is already feeling a bit like a BM episode (see: the Sinclair Broadcast Group's propaganda script that hundreds of local news stations had to recite). But I think Brooker is a good enough writer to walk this tightrope elegantly.\n\n- Environmentalism. Right now the big issue is that the US government is tarnishing existing protections on the environment in service to corporations, but I think Black Mirror could do something fun and counterintuitive by analyzing the other end of the spectrum: technology explicitly intended to save the environment, and what the potential consequences of that could be. Or perhaps some kind of simulated environment designed to eliminate the risks of global warming, or to give nature an advantage over man. Hated in the Nation explored this to some degree with the robotic bees, which were implemented to prevent colony collapse disorder and were set to go after that Chancellor (who says \"fuck the environmental impact!\" in one scene). But the theme of that episode was mainly civility on social media, not the environment.\n\nWhat you guys' thoughts on this?",
        "created_utc": 1522815370,
        "upvote_ratio": ""
    },
    {
        "title": "We know this doesn't end well...",
        "author": "paceyscreek",
        "url": "https://i.redd.it/vky1hhy57tp01.png",
        "text": "",
        "created_utc": 1522811791,
        "upvote_ratio": ""
    },
    {
        "title": "White Christmas Episode Review and discussion",
        "author": "Brickwallpictures",
        "url": "https://youtu.be/p5W7Bl2B2nU",
        "text": "",
        "created_utc": 1522811372,
        "upvote_ratio": ""
    },
    {
        "title": "Carribean food search",
        "author": "Blackunited",
        "url": "https://www.reddit.com/r/blackmirror/comments/89kjws/carribean_food_search/",
        "text": "[removed]",
        "created_utc": 1522802424,
        "upvote_ratio": ""
    },
    {
        "title": "The doctor who really feels his patients’ pain",
        "author": "VeryOutHere",
        "url": "http://www.bbc.com/news/stories-43572639",
        "text": "",
        "created_utc": 1522802146,
        "upvote_ratio": ""
    },
    {
        "title": "We’d like to run a few tests on you",
        "author": "[deleted]",
        "url": "http://www.bbc.com/news/stories-43572639",
        "text": "[deleted]",
        "created_utc": 1522801509,
        "upvote_ratio": ""
    },
    {
        "title": "Why not buy black",
        "author": "Blackunited",
        "url": "https://www.reddit.com/r/blackmirror/comments/89kcoc/why_not_buy_black/",
        "text": "[removed]",
        "created_utc": 1522801022,
        "upvote_ratio": ""
    },
    {
        "title": "We’d like to run a few tests on you",
        "author": "[deleted]",
        "url": "https://apple.news/AXIL2CMBDRr2PkWGebKCfoA",
        "text": "[deleted]",
        "created_utc": 1522800878,
        "upvote_ratio": ""
    },
    {
        "title": "Found a 'Black Museum' reference in S04, E06 ('Black Museum'), anyone else noticed this?",
        "author": "[deleted]",
        "url": "https://i.redd.it/paddhn3v6sp01.jpg",
        "text": "[deleted]",
        "created_utc": 1522799432,
        "upvote_ratio": ""
    },
    {
        "title": "My town in Puebla, Mexico opened a very peculiar bar. Come visit when you can!",
        "author": "timchequea",
        "url": "https://i.redd.it/auismmcjxrp01.jpg",
        "text": "",
        "created_utc": 1522796240,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to get the Akinator to guess Kenny from \"Shut Up and Dance\" when...",
        "author": "Macegoalie14",
        "url": "https://i.redd.it/jtgzhlc4wrp01.png",
        "text": "",
        "created_utc": 1522796108,
        "upvote_ratio": ""
    },
    {
        "title": "Doesn't remind me of any particular episode, but definite shades of Black Mirror here",
        "author": "pickwickian",
        "url": "https://i.redd.it/ve3vunrj8rp01.jpg",
        "text": "",
        "created_utc": 1522788076,
        "upvote_ratio": ""
    },
    {
        "title": "It's Happening...",
        "author": "[deleted]",
        "url": "https://imgur.com/a/jTKGl",
        "text": "[deleted]",
        "created_utc": 1522786061,
        "upvote_ratio": ""
    },
    {
        "title": "The 'San Junipero' Controversy",
        "author": "dreamiiing",
        "url": "https://www.reddit.com/r/blackmirror/comments/89hw5y/the_san_junipero_controversy/",
        "text": "I recently got into Black Mirror (on Hated in the Nation right now) and I have to say, it's really good. One of my favorite episodes was San Junipero, even though it was much less \"deep\" than other endings, it was breath of fresh air from all of the darker social commentaries of other episodes. Thus, I noticed it got a hate for this.\nIt's understandable, of course, since it parted from the typical \"formula\" quite heavily. A lot of people aren't into the romance/drama theme. However one of the major reasons to why it got hate was because it had a lesbian relationship. A lot of people said it was \"shoving homosexuality down the viewer's throats\" which I felt was ridiculous. Some people only disliked the episode for this reason, which is plainly and simply, homophobic.\nI noticed the recent spike in attention that Black Mirror has gained caused something I call \"Rick and Morty Syndrome\" to occur. This is basically where a large portion of a fandom acts more intelligent or claims intelligence is needed to understand the plot and meanings, and also dictates what the rules and formula of the source material are (which then causes any episodes that diverge to be hated upon.) I've seen people claim Black Mirror is only a show for very intelligent people, and also drag an episode for being different than their idea of a formula.\nWhat's everyone's opinion on this?",
        "created_utc": 1522785645,
        "upvote_ratio": ""
    },
    {
        "title": "There are 4 short polish Black Mirror episodes on Netflix Polska youtube channel. High quality work, really recommend watching. [English subs]",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=Y_igsGHD7Hg&amp;list=PLmBsoljiEud8kMugvZz6wbQL-qnsbqbRG",
        "text": "[deleted]",
        "created_utc": 1522783614,
        "upvote_ratio": ""
    },
    {
        "title": "TIL that a Polish version of Black Mirror - funded by Polish Netflix - is available for free on Youtube",
        "author": "gioaogionny",
        "url": "https://i-d.vice.com/en_uk/article/43b3ep/the-polish-version-of-black-mirror-might-be-the-best-thing-on-the-internet",
        "text": "",
        "created_utc": 1522781716,
        "upvote_ratio": ""
    },
    {
        "title": "Disregard for public policy will result in loss of merits",
        "author": "blocktq",
        "url": "https://i.redd.it/q4gv0l4symp01.jpg",
        "text": "",
        "created_utc": 1522781560,
        "upvote_ratio": ""
    },
    {
        "title": "Which of the technology is absolutely impossible?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/89gixh/which_of_the_technology_is_absolutely_impossible/",
        "text": "[removed]",
        "created_utc": 1522778114,
        "upvote_ratio": ""
    },
    {
        "title": "Who's listening to Charlie Brooker's Desert Island Discs then?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/89fkyf/whos_listening_to_charlie_brookers_desert_island/",
        "text": "[removed]",
        "created_utc": 1522772831,
        "upvote_ratio": ""
    },
    {
        "title": "This sounds like the start of a Black Mirror episode. (x post from r/cyberpunk)",
        "author": "VictorVaughnGogh",
        "url": "https://i.redd.it/1ce88em0zpp01.jpg",
        "text": "",
        "created_utc": 1522772710,
        "upvote_ratio": ""
    },
    {
        "title": "About Fifteen million merits: What is society?",
        "author": "TheSwecurse",
        "url": "https://www.reddit.com/r/blackmirror/comments/89fdxe/about_fifteen_million_merits_what_is_society/",
        "text": "No, seriously, what was the society in that episode? An enclosed facility Aperture Science style with a population of what I guess is essentially a small country, where work is pedalling on a stationary bike or if you just can't you become a cleaner. For some people they have... what I guess is \"entertainment jobs\", and they're more well off in some weird sense. \n\nWhat people do on their spare time seem to be nothing but endlessly watching mediocre \"tv-shows\" of little variety, and being FORCED to watch the advertisement that can even be in the most vulgar form possible. I'm sorry but I don't want to watch a porn-ad in between my Henry VIII documentary. But if I don't watch it the tv-screen cube I live in start screaming at me to watch. \n\nAnd that's pretty much it! \n\nAt the end of the episode we see Bing look out at some sort of jungle. Was that a screen too? IS THERE LIFE OUTSIDE THIS ENCLOSED SPACE?!\n\nWas this episode just trying to parody ALL of modern society? The one's who can't work gets shunned and is forced to do a lower work task while those who work hard gets a chance at greater success? The enclosed laboratory setting is like how we're all trapped around the confides of where we live, without the freedom to move at will? The merits is money/school grades/whatever other thing you can come up with? The entertainment they're forced to watch is just the media of today, with all the obscene and vulgarity packed in and you have no choice but to take part in it unless you want to \"progress\"?\n\nWhat does it all mean? What is the society we're seeing here?",
        "created_utc": 1522771726,
        "upvote_ratio": ""
    },
    {
        "title": "China to ban citizens with bad 'social credit' rating from taking flights or using trains for up to a year",
        "author": "AssaultedCracker",
        "url": "https://www.independent.co.uk/news/world/asia/china-social-credit-barred-flights-trains-president-xi-jinping-national-development-reform-a8260941.html",
        "text": "",
        "created_utc": 1522768288,
        "upvote_ratio": ""
    },
    {
        "title": "Nosedive, anyone?",
        "author": "walterlust",
        "url": "https://www.independent.co.uk/news/world/asia/china-social-credit-barred-flights-trains-president-xi-jinping-national-development-reform-a8260941.html",
        "text": "",
        "created_utc": 1522765780,
        "upvote_ratio": ""
    },
    {
        "title": "This post reminded me of an episode",
        "author": "[deleted]",
        "url": "https://i.redd.it/m401xxjc8op01.jpg",
        "text": "[deleted]",
        "created_utc": 1522764007,
        "upvote_ratio": ""
    },
    {
        "title": "San Junipero: \"Happy Ending?\"",
        "author": "Shatterbrain",
        "url": "https://www.reddit.com/r/blackmirror/comments/89dlvo/san_junipero_happy_ending/",
        "text": "Does San Junipero have a happy ending? That seems to be the common consensus, but my interpretation was different. It seemed to me like there was an intentional contrast being shown between the dark, grey storage area where their consciousness was being kept (reality) and the happy, false world of San Junipero. Not to mention that the protagonist essentially abandoned her husband and her earthly convictions in order to skirt death. \n\nWhat do you think, is this an \"intended interpretation?\" Is this aspect open to interpretation at all? Have the creators weighed in on how they intended it?\n\nDo people flee to San Junipero because they truly want to keep living (even if it's false), or do they do it because they fear death? Does life lose meaning when it's possible to live forever?",
        "created_utc": 1522761257,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think Charlie Brooker will ever write or oversee a videogame?",
        "author": "ResumeViewing2016",
        "url": "https://www.reddit.com/r/blackmirror/comments/89d07h/do_you_think_charlie_brooker_will_ever_write_or/",
        "text": "Given Brooker’s history as a game critic, and the fact that many of his shows have either referenced or promoted games, I’ve always thought that he would write a videogame in some capacity.\n\nHell, he even did performance capture for *Sniper Elite 3* as a \nGerman soldier guarding Hitler – both of whom the player can shoot in the eyes, spine and (if they’re feeling particularly dextrous) testicles. The bastard even shoots back. “You only shot one bollock? Boooo!” \n\nAnyway, because Annapurna recently published *What Remains of Edith Finch* and Universal has similarly expressed interest in making more videogames, I suspect it’s only a matter of time before Netflix makes a play in the interactive medium. \n\nAside from *Stranger Things*, *Black Mirror* is the only Netflix IP which springs to mind as being (somewhat) suitable as a game. And, whether you approve or not, an adaptation does make sense from a business perspective. \n\nI’ve pitched ways that ‘Crocodile’ and ‘Metalhead’ could have been reimagined as games (https://everybodywinsontheinternet.wordpress.com/), but the real draw would be original interactive ideas that mess with players’ minds. \n\nWhat are your thoughts? Would short, one-off, downloadable *Black Mirror* games be of interest to you (focusing on a unique game mechanic and story), or would you rather see Brooker throw his weight behind an original videogame project? \n\nAll I know is that gaming needs characters like Rolo Haynes and Patrick from *Dead Set*. ",
        "created_utc": 1522757054,
        "upvote_ratio": ""
    },
    {
        "title": "CLOUD Act passed, without any real oversight, Digital privacy is gone. BM come alive!",
        "author": "RealBaerthe",
        "url": "https://www.eff.org/deeplinks/2018/03/responsibility-deflected-cloud-act-passes",
        "text": "",
        "created_utc": 1522740393,
        "upvote_ratio": ""
    },
    {
        "title": "Watched Season 1",
        "author": "davwad2",
        "url": "https://www.reddit.com/r/blackmirror/comments/89axqm/watched_season_1/",
        "text": "I got to travel for work and had a decent amount of flying to do, so  I downloaded  season one, and wow, just wow.  Gut punches all the way around.  Why only three episodes though?  \n\nI felt like Oliver Twist after I finished the season. \n\nCan't wait to watch S2 on my way home. ",
        "created_utc": 1522738855,
        "upvote_ratio": ""
    },
    {
        "title": "The Number 4 In Hang The DJ Explained",
        "author": "BryceDoesMakeFilms",
        "url": "https://www.youtube.com/watch?v=QSyGJptcJ7E&amp;t=2s",
        "text": "",
        "created_utc": 1522737375,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone explain S1 E2, Fifteen Million Merits?",
        "author": "Fireheart251",
        "url": "https://www.reddit.com/r/blackmirror/comments/89akw8/can_someone_explain_s1_e2_fifteen_million_merits/",
        "text": "The setting. Why are they in that facility with all the black walls, what is it? This is the foundation of my question because I think it will answer all the other questions I have, like what is that competition about? Or the bikes? What are those games they play? What's up with those yellow wearing janitors, what's their deal? And is porn the only type of advertisement they have? What was in that drink they gave Abi? I just need a complete synopsis and analysis of that episode.",
        "created_utc": 1522735950,
        "upvote_ratio": ""
    },
    {
        "title": "Season 5 has started filming, according to Charlie Brooker",
        "author": "The_Angularity",
        "url": "https://screenrant.com/black-mirror-season-5-filming/",
        "text": "",
        "created_utc": 1522734053,
        "upvote_ratio": ""
    },
    {
        "title": "It seems as if most people here either loved Black Museum or hated it, which side are you on?",
        "author": "bransontsn",
        "url": "https://www.reddit.com/r/blackmirror/comments/89a7lj/it_seems_as_if_most_people_here_either_loved/",
        "text": "I actually really enjoyed the episode over all and that it had a good story, but may have over did some parts.",
        "created_utc": 1522733506,
        "upvote_ratio": ""
    },
    {
        "title": "I wish I could live in San junipero",
        "author": "undercoverpasta",
        "url": "https://www.reddit.com/r/blackmirror/comments/89a68q/i_wish_i_could_live_in_san_junipero/",
        "text": "[removed]",
        "created_utc": 1522733273,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror S04 E05 Metalhead",
        "author": "thewarriorprincess--",
        "url": "https://www.reddit.com/r/blackmirror/comments/89a2j0/black_mirror_s04_e05_metalhead/",
        "text": "Black Mirror is well known for it's Easter Eggs and I wanted to know if there is any significance to the license plate of the Range Rover playing the Golden Brown song. The license plate seems to read \"LF14 FYA\" and I can't seem to find anything on the internet so far. \nLife fourteen fire? Hell if one four if I eh? \nCan anyone explain this? Or has it no significance? ",
        "created_utc": 1522732684,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror Vibes in Latest Starset Music Video",
        "author": "tennisstar14",
        "url": "https://www.reddit.com/r/blackmirror/comments/898qjw/black_mirror_vibes_in_latest_starset_music_video/",
        "text": "Starset is a very sci fi influenced band. Their live shows are incredibly visual. Their latest music video for the song Ricochet seems very influenced by Black Mirror. Thought this sub would appreciate the themes! Plus the song kicks ass.",
        "created_utc": 1522725600,
        "upvote_ratio": ""
    },
    {
        "title": "This cover to 1984 reminds me of Arkangel (xpost from r/DesignPorn)",
        "author": "irishAAron5963",
        "url": "https://i.redd.it/m872rmol5kp01.jpg",
        "text": "",
        "created_utc": 1522711248,
        "upvote_ratio": ""
    },
    {
        "title": "Question about cookies in White Christmas",
        "author": "Anontakesover",
        "url": "https://www.reddit.com/r/blackmirror/comments/8964wi/question_about_cookies_in_white_christmas/",
        "text": "So, this may sound dumb but this is the thought I had. \n\nIf you are alive in an era where they can make cookies, and they make a cookie of you, what's stopping you from being a cookie, in the part where they put her in the little google home type device, she experiences her weird birth, if they were able to make a cookie and simulate the cookies memories without them experiencing anything like that birth, sort of like how they were in a simulated room when they were getting the confession, then you wouldn't know you're a cookie. \n\nYour only proof right now you aren't a cookie is that it hasn't been invented yet, in that era it's been invented, you can't claim you aren't a cookie just because a cookie was made from you, if they make a second cookie it will have the same memory of having existed before cookies and having a cookie being made from it, giving it the belief that it's not a cookie. \n\nWould it not be kinda scary that you could be at any moment be a cookie living in a simulation? Who knows what purpose it would be for whoever did it. \nWould small groups of people go crazy over this sort of thinking?",
        "created_utc": 1522710150,
        "upvote_ratio": ""
    },
    {
        "title": "Foreshadowing in Playtest",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/895zoq/foreshadowing_in_playtest/",
        "text": "[deleted]",
        "created_utc": 1522709049,
        "upvote_ratio": ""
    },
    {
        "title": "Be Right Back in a music video -&gt; Starset, Ricochet",
        "author": "synntth",
        "url": "https://www.youtube.com/watch?v=SaC0YVaIMno",
        "text": "",
        "created_utc": 1522705449,
        "upvote_ratio": ""
    },
    {
        "title": "The dead couple in Metalhead is very weird in its context. Maybe they did the British equivalent of this?",
        "author": "necrocannibal2",
        "url": "https://www.youtube.com/watch?v=3c66w6fVqOI",
        "text": "",
        "created_utc": 1522700116,
        "upvote_ratio": ""
    },
    {
        "title": "Metal head easy solution?",
        "author": "Taker2626",
        "url": "https://www.reddit.com/r/blackmirror/comments/89483g/metal_head_easy_solution/",
        "text": "So i recently rewatched season 4 episode 5 Metalhead and cannot but wonder why she didn’t just cover the robot with her jacket or buried it after it ran out of battery? Like I assume they are solar powered and she spent all night on that tree draining the robots battery and it had never crossed her mind that blocking out any sunlight from the robot might be helpful? Or am I missing something? :o",
        "created_utc": 1522698492,
        "upvote_ratio": ""
    },
    {
        "title": "u/ChaosChaos_'s circle",
        "author": "ChaosChaos_",
        "url": "https://www.reddit.com/user/ChaosChaos_/circle/embed/",
        "text": "",
        "created_utc": 1522698255,
        "upvote_ratio": ""
    },
    {
        "title": "Question/thought about Cookies.",
        "author": "styrrell14",
        "url": "https://www.reddit.com/r/blackmirror/comments/891hyf/questionthought_about_cookies/",
        "text": "Why can't they remember signing up for the procedure or prepping for surgery? Shouldn't they remember everything that has happened to the patient until extraction? When Greta's was removed, it had no idea what was going on. But going into it, the patient should know that there's a 50/50 chance that the you that you feel you are will either stay in the real person's body or end up in the device, if that makes sense. If this is the case, shouldn't the cookie react more along the lines of, \"Damn, this sucks, but I knew what I was getting into. Let's go home and make some toast.\"? It wouldn't be perfect, but it would certainly make for a smoother transition for the cookie post-operation.",
        "created_utc": 1522689124,
        "upvote_ratio": ""
    },
    {
        "title": "Shut up and dance (2016)",
        "author": "whiptrash",
        "url": "https://i.redd.it/blnyl5j5oip01.jpg",
        "text": "",
        "created_utc": 1522684160,
        "upvote_ratio": ""
    },
    {
        "title": "Season 3 episode 1. Why didn’t she just show a whole bunch of guys her rack for their 5 star ratings? (No spoiler unless you were hoping for titties)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/88zp20/season_3_episode_1_why_didnt_she_just_show_a/",
        "text": "[removed]",
        "created_utc": 1522679249,
        "upvote_ratio": ""
    },
    {
        "title": "Hip hip hooray!",
        "author": "will_I__Am_",
        "url": "https://youtu.be/wB6LAB5yIkg",
        "text": "",
        "created_utc": 1522675130,
        "upvote_ratio": ""
    },
    {
        "title": "Lessons from the Screenplay: Analysis of U.S.S. Callister",
        "author": "zachrob2k",
        "url": "https://youtu.be/42jHc-_XsDo",
        "text": "",
        "created_utc": 1522669458,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think are with the pics that they used to blackmail the real Nanete Cole in USS Callister episode?",
        "author": "dizunidoodle",
        "url": "https://www.reddit.com/r/blackmirror/comments/88xyf2/what_do_you_think_are_with_the_pics_that_they/",
        "text": "I don't think that these are just naked pics. It must have something like Shut Up and Dance kind of revelation. ",
        "created_utc": 1522659651,
        "upvote_ratio": ""
    },
    {
        "title": "Just finished watching all episodes, and I was curious of the \"theoretical timeline\" of the series",
        "author": "CalicoKingsman",
        "url": "https://www.reddit.com/r/blackmirror/comments/88x7hn/just_finished_watching_all_episodes_and_i_was/",
        "text": "Ever since White Christmas, I've noticed throwbacks to previous episodes and such, but all this culminated in Black Museum. So I was curious, where would episodes be placed if they all existed in the same timeline, and possibly if any characters actions in one episode influence the actions of a different character from a different episode.",
        "created_utc": 1522648469,
        "upvote_ratio": ""
    },
    {
        "title": "Meme is dying but i just watched Shut Up and Dance",
        "author": "hereforememesandporn",
        "url": "https://i.redd.it/4l9uwdencfp01.png",
        "text": "",
        "created_utc": 1522643950,
        "upvote_ratio": ""
    },
    {
        "title": "By 2020, China will have completed its nationwide facial recognition and surveillance network, achieving near-total surveillance of urban residents, including in their homes via smart TVs and smartphones.",
        "author": "Sicaltus",
        "url": "https://www.rfa.org/english/news/china/surveillance-03302018111415.html",
        "text": "",
        "created_utc": 1522642159,
        "upvote_ratio": ""
    },
    {
        "title": "What episode had the worst ending?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/88wiln/what_episode_had_the_worst_ending/",
        "text": "[removed]",
        "created_utc": 1522640176,
        "upvote_ratio": ""
    },
    {
        "title": "What twist did you see coming a mile away?",
        "author": "ghosttoftomjoad",
        "url": "https://www.reddit.com/r/blackmirror/comments/88w0sl/what_twist_did_you_see_coming_a_mile_away/",
        "text": "I called just about everything that happened in Men Against Fire. Same with USS Callister after the initial reveal that he can put people in the simulation. Other than that can't think of any.",
        "created_utc": 1522635163,
        "upvote_ratio": ""
    },
    {
        "title": "Someone better warn Mars",
        "author": "Bunners69",
        "url": "https://www.telegraph.co.uk/science/2018/04/01/bees-mars-nasa-funds-swarm-robotic-insects-exploring-red-planet/",
        "text": "",
        "created_utc": 1522628022,
        "upvote_ratio": ""
    },
    {
        "title": "I would like to recommend a book/short story that has a lot of *Black Mirror* themes...*The Machine Stops.*",
        "author": "dinosaurfacedude",
        "url": "https://www.reddit.com/r/blackmirror/comments/88uasy/i_would_like_to_recommend_a_bookshort_story_that/",
        "text": "The author is E.M. Forster. It was written in 1909, but it has a lot of similarities to Black Mirror. It deals with people's overreliance of technology, and how it can be a problem. It asks the question: What if Technology became our god?\n\n\nJust wanted to share, since it seems to be something *Black Mirror* fans would enjoy",
        "created_utc": 1522619251,
        "upvote_ratio": ""
    },
    {
        "title": "i’m sad",
        "author": "NathanHatesLife",
        "url": "https://www.reddit.com/r/blackmirror/comments/88t6d8/im_sad/",
        "text": "just heard they’re postponing season 5 until late [2019](https://en.m.wikipedia.org/wiki/April_1) ",
        "created_utc": 1522609648,
        "upvote_ratio": ""
    },
    {
        "title": "By 2020, China will have completed its nationwide facial recognition and surveillance network, achieving near-total surveillance of urban residents, including in their homes via smart TVs and smartphones.",
        "author": "hi5eyes",
        "url": "https://www.rfa.org/english/news/china/surveillance-03302018111415.html",
        "text": "",
        "created_utc": 1522608703,
        "upvote_ratio": ""
    },
    {
        "title": "I gotcha your waldoes right here! STUGGATZ !!!!",
        "author": "[deleted]",
        "url": "https://i.redd.it/o7kokicrbcp01.png",
        "text": "",
        "created_utc": 1522607352,
        "upvote_ratio": ""
    },
    {
        "title": "Connection Between Shut Up and Dance &amp; Black Museum?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/88sohl/connection_between_shut_up_and_dance_black_museum/",
        "text": "[removed]",
        "created_utc": 1522605595,
        "upvote_ratio": ""
    },
    {
        "title": "How does nobody understand",
        "author": "Animal_Luvah",
        "url": "https://www.reddit.com/r/blackmirror/comments/88r9e7/how_does_nobody_understand/",
        "text": "[removed]",
        "created_utc": 1522593920,
        "upvote_ratio": ""
    },
    {
        "title": "Season 5 release date announced! (with proof)",
        "author": "Doki_Yuri_is_Life",
        "url": "https://www.reddit.com/r/blackmirror/comments/88qp1c/season_5_release_date_announced_with_proof/",
        "text": "[removed]",
        "created_utc": 1522588399,
        "upvote_ratio": ""
    },
    {
        "title": "WoW April Fools Patch Notes",
        "author": "ilogik",
        "url": "https://i.redd.it/2dr7260wdap01.png",
        "text": "",
        "created_utc": 1522583835,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror Season 5 Official Announcement | Coming 2018",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/88qard/black_mirror_season_5_official_announcement/",
        "text": "[deleted]",
        "created_utc": 1522583690,
        "upvote_ratio": ""
    },
    {
        "title": "What's the font/typeface used for the Infinity Logo in USS Callister?",
        "author": "loi044",
        "url": "https://www.reddit.com/r/blackmirror/comments/88pztp/whats_the_fonttypeface_used_for_the_infinity_logo/",
        "text": "What's this font/typeface used for the Infinity Logo in USS Callister?\n\nhttps://vignette.wikia.nocookie.net/black-mirror/images/4/47/Infinity_Logo.png/revision/latest?cb=20171230020906",
        "created_utc": 1522579428,
        "upvote_ratio": ""
    },
    {
        "title": "Uber driver’s profile reminds me of “Nosedive”",
        "author": "[deleted]",
        "url": "https://i.redd.it/axl76dcxv9p01.jpg",
        "text": "[deleted]",
        "created_utc": 1522577973,
        "upvote_ratio": ""
    },
    {
        "title": "Obey",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=hWLjYJ4BzvI",
        "text": "[deleted]",
        "created_utc": 1522574866,
        "upvote_ratio": ""
    },
    {
        "title": "This vid gave me Black Mirror vibes \"This is what happens when one company owns dozens of local news stations\"",
        "author": "TacticalHog",
        "url": "https://www.youtube.com/watch?v=hWLjYJ4BzvI&amp;feature=youtu.be",
        "text": "",
        "created_utc": 1522571738,
        "upvote_ratio": ""
    },
    {
        "title": "What does the title Hang the DJ exactly mean",
        "author": "sweeet_caroline",
        "url": "https://www.reddit.com/r/blackmirror/comments/88os6z/what_does_the_title_hang_the_dj_exactly_mean/",
        "text": "[removed]",
        "created_utc": 1522561906,
        "upvote_ratio": ""
    }
]