[
    {
        "title": "Anyone preordering the Black Mirror Book?",
        "author": "CaptainNinjaX",
        "url": "https://www.amazon.com/Black-Mirror-Literary-Cory-Doctorow-ebook/dp/B072QVNBBV",
        "text": "",
        "created_utc": 1518973509,
        "upvote_ratio": ""
    },
    {
        "title": "Was Crocodile bad?",
        "author": "The_PurpleZone",
        "url": "https://www.reddit.com/r/blackmirror/comments/7yfive/was_crocodile_bad/",
        "text": "While watching it I was at the edge of my seat. I kept thinking it can't get any worse and then of course it did. Astronomically. But after it kind of seemed like a wasted opportunity with the memory tech. What do you guys think? ",
        "created_utc": 1518973414,
        "upvote_ratio": ""
    },
    {
        "title": "Black Museum or USS Callister?",
        "author": "BoltonSmilie",
        "url": "https://www.reddit.com/r/blackmirror/comments/7yet3v/black_museum_or_uss_callister/",
        "text": "[removed]",
        "created_utc": 1518966917,
        "upvote_ratio": ""
    },
    {
        "title": "Something I don't understand in Shut Up and Dance",
        "author": "raghiid",
        "url": "https://www.reddit.com/r/blackmirror/comments/7yel0f/something_i_dont_understand_in_shut_up_and_dance/",
        "text": "If they're blackmailing Kenny with a video of himself, how did his mum know the kind of pictures he was jerking off to? Did the hackers just leak his video and say what the pictures were?",
        "created_utc": 1518964624,
        "upvote_ratio": ""
    },
    {
        "title": "Just started watching...wow",
        "author": "CitrusLamb",
        "url": "https://www.reddit.com/r/blackmirror/comments/7yefhq/just_started_watchingwow/",
        "text": "I have nothing but praise for this show so far. Every aspect of it is incredible. Acting, writing, everything. ",
        "created_utc": 1518962957,
        "upvote_ratio": ""
    },
    {
        "title": "Which tech from black mirror do you most wish you could have",
        "author": "LordPounce",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ydyez/which_tech_from_black_mirror_do_you_most_wish_you/",
        "text": "San junipero seems like an obvious choice but I also really, really want to play the game from USS caplister and use the dating app in hang the dj. \n\nHow about you all?",
        "created_utc": 1518957011,
        "upvote_ratio": ""
    },
    {
        "title": "If you could contribute to the writing of one episode of the show, what would you want it to be about?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ydwlr/if_you_could_contribute_to_the_writing_of_one/",
        "text": "[removed]",
        "created_utc": 1518956210,
        "upvote_ratio": ""
    },
    {
        "title": "Ideas for topics of future epsisodes.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ydv9f/ideas_for_topics_of_future_epsisodes/",
        "text": "[deleted]",
        "created_utc": 1518955612,
        "upvote_ratio": ""
    },
    {
        "title": "Another theory on how Black Mirror got its name",
        "author": "thest3llar1",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ydsz1/another_theory_on_how_black_mirror_got_its_name/",
        "text": "I think we've all heard of the theories that Black Mirror got its name because it reflects our current society but in a darker way or that it represents a turned off display. \nWell, I have a friend who is really into crystals and who has told me something really peculiar yesterday. In Mesoamerican culture, groups like Mayans and Aztecs used a variety of polished black elements and crystals (obsidian) for mirrors. They believed that with them they could see into to the future and cross into the different realms.\nThis could be an interesting connection to Black Mirror and its name or just a coincidence. Either way, I had to share that with you.\n",
        "created_utc": 1518954599,
        "upvote_ratio": ""
    },
    {
        "title": "Rewatching the Series",
        "author": "xxBentley39",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ydrrv/rewatching_the_series/",
        "text": "Does anyone find themselves enjoying rewatching the series even more than the first time they watched it? I watched Shut Up and Dance, Nosedive, and Hang the DJ again and they all made so much more sense and I noticed subtle foreshadowing that the show does SO WELL!!! \n\nTL;DR: Black Mirror seems to be better the second time through.",
        "created_utc": 1518954013,
        "upvote_ratio": ""
    },
    {
        "title": "Let's talk cinematography!",
        "author": "Jekkeswekke",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ydpni/lets_talk_cinematography/",
        "text": "Holy freaking shit. As a filmmaker this serie is golden. The story is pretty dope, damn. But the cinematography is diamond, how the film is graded and made. It's so cool.\n\n\n\n I'm wondering what y'all think is the best episode cinematography wise and why?\n\n\nFor me it's definitely San Junipero. The grade is fucking perfect. The set, everything just fits so great.\n",
        "created_utc": 1518952989,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror episode I want to see",
        "author": "Kidlike101",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ydjrs/black_mirror_episode_i_want_to_see/",
        "text": "The idea of cookies that have our memories and personality interests me. Black mirror used this idea a few times after the episode White Chrismas and it made me think of an episode from the Twilight Zone that I'd love to see modernized. \n\nThe episode was (The After hours).\n\nHow to modernize? A guy is very active on social media with thousands of followers. One day he's phone goes bonkers so following an ad he heads to the apple (or whatever they call it) store to get it fixed. The Employees act strange and send him to a pod to (link) the phone to his brain implant but get interrupted. When he talks to the manager the guy says he's never even heard of his phone model let alone sell it in the store.\n\nIt takes some time but he keeps getting headaches and the implant is affecting his vision in sync with the phone's static. Finally the employee tells him to come after hours and he finds a handful of them waiting with a smile leading him to the pod for the sync. \n\nAnd to shut him down for maintenance. The guy is an an android same as the employees. they're all unwanted cookies living in an old computer. They made these bodies to attempt to assimilate back into society, the one in this one was in for over a year and he forgot he wasn't really human anymore. \n\nAll of of his communication outside of social media videos was to the other cookies not real people which is why the RL ones he called friend kept a distance when he asked for help like you would a stranger or an acquaintance.\n\nI'd like to hear your pitch for an episode. Has to be a modern day issue (or eternal one) with tech related in some way to the storyline!\n  ",
        "created_utc": 1518950169,
        "upvote_ratio": ""
    },
    {
        "title": "Connected Metal Head and Entire History of You",
        "author": "itsjustme1505",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ydgse/connected_metal_head_and_entire_history_of_you/",
        "text": "So, the house in Metal Head with the Land Rover that the main character tries to get in, is the house that the guy who cheated with Fion lives.",
        "created_utc": 1518948693,
        "upvote_ratio": ""
    },
    {
        "title": "Who else thinks Men Against Fire is underrated?",
        "author": "daddymaddie",
        "url": "https://www.reddit.com/r/blackmirror/comments/7yda7m/who_else_thinks_men_against_fire_is_underrated/",
        "text": "[removed]",
        "created_utc": 1518945436,
        "upvote_ratio": ""
    },
    {
        "title": "San Junipero Timeframe Question",
        "author": "Quinnster247",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ycfd8/san_junipero_timeframe_question/",
        "text": "So were there different versions of San Junipero inside the simulation? ",
        "created_utc": 1518932318,
        "upvote_ratio": ""
    },
    {
        "title": "My guess on why cookies are unique and not able to be copied",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ycefy/my_guess_on_why_cookies_are_unique_and_not_able/",
        "text": "[deleted]",
        "created_utc": 1518931977,
        "upvote_ratio": ""
    },
    {
        "title": "Don't upvote, but I am confused as to what \"San Junipero\" was about...",
        "author": "BringBackTron",
        "url": "https://www.reddit.com/r/blackmirror/comments/7yc7m2/dont_upvote_but_i_am_confused_as_to_what_san/",
        "text": "I watched that episode, and I still can't figure out what happens. Could someone explain it to me? Also big fan of the show. I have [this](https://i.imgur.com/RMEvrrU.jpg) as my wallpaper now",
        "created_utc": 1518929673,
        "upvote_ratio": ""
    },
    {
        "title": "Confused about kenny",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7yc5ym/confused_about_kenny/",
        "text": "[deleted]",
        "created_utc": 1518929151,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror is weakest when it strays too far from its Twilight Zone roots.",
        "author": "deltanovemberalpha",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ybzu5/black_mirror_is_weakest_when_it_strays_too_far/",
        "text": "What made the Twilight Zone so moving was that it had to deal with the intimate emotions humans felt when placed in scenarios brought about by scientific advancements. In fact, the sci-fi elements sometimes hindered the story, as the more realistic the science was the more moving the episode was. For example, in \"The Shelter,\" a group of friends is torn apart because a fallout shelter isn't big enough for everyone. Even though it was a product of it's time, it's still so grounded in humanity that I was even moved as a child. \n\nThis is why \"San Junipero\" upsets me: the characters don't seem to realize that their lives in the simulation are for eternity (a concept that terrifies me to my core). I mean, I can understand Yorkie's excitement, as she has been confined to an immobile body for decades, but Kelly's change of heart honestly shocks me. She was so steadfast in her beliefs, and the idea that young love could change that is honestly laughable. \n\nCompare this to \"Be Right Back.\" At least initially, the technology used seems like something that could be out right now. And if you've ever even thought that someone you love is dead, you'll understand Martha's motivations. She needs someone to talk to about her earth-shattering news, and goes to the closest version of her husband that she can. She realizes that the robot is just a cheap copy of the man she loves, but she can't just get rid of him because *it's still him.* \n\nAnd I know the Twilight Zone didn't have as good of a track record as Black Mirror, but just watch the \"The Long Morrow\" and tell me that \"Arkangel\" couldn't have benefited from stealing a few ideas. ",
        "created_utc": 1518927155,
        "upvote_ratio": ""
    },
    {
        "title": "El Podcast de los cronopios sin fama sobre la ultima temporada de Black Mirror. Esperamos que sea de su interes.",
        "author": "Hildegan04",
        "url": "http://mx.ivoox.com/es/cronopios-sin-fama-11-black-mirror-audios-mp3_rf_23846797_1.html",
        "text": "",
        "created_utc": 1518925854,
        "upvote_ratio": ""
    },
    {
        "title": "Newbie here, holy sh**, can we talk about San Junipero?",
        "author": "Andgelyo",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ybvf4/newbie_here_holy_sh_can_we_talk_about_san_junipero/",
        "text": "I'm a 27 year old guy, and already watched the episode twice. **I cried the second time around**. Not ashamed to admit it. **The episode evoked so many thoughts and emotions in me**.  It made me realize just how lucky I am to still be young and have many years ahead of me, and made me really cherish that I still have friends and family who are thankfully still alive and healthy.  Hands down it was one of the best episodes I've ever seen on black mirror.  No other episode in the show has provoked such deep thoughts about life and *after life*.  The love between the two main characters felt incredibly real and palpable. The fact that the leads were females is irrelevant in my opinion and shows that true love is genderless. Plus the sound track and 80s vibe....just wow, I was blown away. \n\n Anyone else feel the same way? It's almost as good as USS Callister (my favorite episode since it was a very light hearted and fun episode). ",
        "created_utc": 1518925708,
        "upvote_ratio": ""
    },
    {
        "title": "Playtest brain processing speed",
        "author": "NativeLobo",
        "url": "https://www.reddit.com/r/blackmirror/comments/7ybny3/playtest_brain_processing_speed/",
        "text": "\"You can all feel better knowing that the human brain cannot actually process data that fast as shown in the episode.\" \nTalking about how Cooper was in the simulation for only .4 seconds.\nThis was posted by u/robinhoodchess and the thread I saw this in has replies disabled now so I thought I do a quick Google search and found they we're wrong. The brain can actually process info in .013 seconds or about 13 milliseconds\n\nEdit: Grammar and wording",
        "created_utc": 1518923370,
        "upvote_ratio": ""
    },
    {
        "title": "Where is the new BM Netflix thumbnail from?",
        "author": "SirTrekalot",
        "url": "https://imgur.com/a/zJ9oe",
        "text": "",
        "created_utc": 1518918610,
        "upvote_ratio": ""
    },
    {
        "title": "Something random happened, which I think saved the show for me. Minor spoilers for S04E01 inside.",
        "author": "yannick_1709",
        "url": "https://www.reddit.com/r/blackmirror/comments/7yb4mr/something_random_happened_which_i_think_saved_the/",
        "text": "As I was looking for something to watch for tonight after finishing Fargo, I came across Black Mirror *(which I had on my watchlist for ages, but never came around to watching it)*. At this point all I knew about it was that it had a similar mysterious vibe to it, so I decided to give it a go *(didn't even know that it was an anthology series)*.\n\nI go grab a beer, some chips and start the netflix app on my PC. After noticing Netflix recommending it by 98% I got even more happy I finally decided to watch it and immediately jumped into it by klicking the big play button you see on the banner. \n\n*Minor spoilers for S04E01 ahead, so tread carefully.*\n\nThe episode starts:  [Spoiler Alert](/s \"4:3 ratio and it looks weird, like some old Star Trek series\"), which got me thinking that it's some kind of show inside a show. As the story unravels it hooks me more and more with it's twists and intrigues and I find myself enjoying it very much. At some point, I realize my beer is empty, which causes me to pause the video and stand up to get another one. When coming back to the room the overlay has turned on and says in bold: \"Season 4, Episode 1\" and my heart sank. Somehow Netflix started the show with this episode and not the actual first one. I was really worried that I ruined the experience and it actually made me consider just dropping the show for good (I've had a similar experience with a show before). So I decide to ask reddit for advice. After a few minutes, I was told the show is actually just a collection of short stories I was relieved and decided to continue on and afterwards watched S01E01.\n\nAnd my god, what was that?! I've probably never had a more uncomfortable experience with a TV show. It was not bad at all, I actually enjoyed it somehow, but it definitely made me feel eerie. I was thinking of quitting halfway through, but my overwhelmingly good experience with the first one I watched made me sit through it. So thanks Netflix for the small technical problem, which probably made me actually keep on watching. After 3 more episodes, I can say: I'm hooked.\n\n\nTL;DR: I accidentally started with S04E01, instead of S01E01, and that made me continue watching the show. Still enjoyed the first one, it as just very weird and would have turned me away from Black Mirror.",
        "created_utc": 1518917692,
        "upvote_ratio": ""
    },
    {
        "title": "The design on this ring seemed familiar..",
        "author": "KillerTofu1923",
        "url": "https://i.redd.it/8es0cfm2hvg01.jpg",
        "text": "",
        "created_utc": 1518916499,
        "upvote_ratio": ""
    },
    {
        "title": "Bathroom rater immediately made me think of “Monkey loves you!”",
        "author": "explosivefish",
        "url": "https://i.redd.it/zikilbojdvg01.jpg",
        "text": "",
        "created_utc": 1518915313,
        "upvote_ratio": ""
    },
    {
        "title": "*sips a glass of water*",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7yatst/sips_a_glass_of_water/",
        "text": "[deleted]",
        "created_utc": 1518914678,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror - Hang the DJ",
        "author": "rmmh_25",
        "url": "https://www.reddit.com/r/blackmirror/comments/7yaror/black_mirror_hang_the_dj/",
        "text": "[removed]",
        "created_utc": 1518914097,
        "upvote_ratio": ""
    },
    {
        "title": "What Is A Good Book For A Black Mirror Fan To Read?",
        "author": "ryanirishpi",
        "url": "https://www.reddit.com/r/blackmirror/comments/7yaqit/what_is_a_good_book_for_a_black_mirror_fan_to_read/",
        "text": "I know I, and a lot of other Black Mirror fans, are wondering what would be some good books to read that are similar to Black Mirror episodes or the themes of Black Mirror in general. Anyone have good suggestions&gt;",
        "created_utc": 1518913772,
        "upvote_ratio": ""
    },
    {
        "title": "A better ending for USS Callister",
        "author": "kembervon",
        "url": "https://www.reddit.com/r/blackmirror/comments/7yab6y/a_better_ending_for_uss_callister/",
        "text": "I thought the ending of USS Callister was a bit nonsensical since there was no reason for a software update to open a black hole nor a reason for the program to self-delete simply because the Callister flew into it.  The writers just needed a way to end the episode, and I think this way would have been more plausible... and more interesting.\n\nWhat if the crew had recruited Real Life Nanette to make a cookie of Daly and insert him into the game?  Cookie Daly would realize he was screwed and Real Life Daly would delete him the moment he learned of his existence, and his ego wouldn't allow that.  So Cookie Daly would team up with the crew and provide them with additional information to allow them to dismantle the program from the inside.\n\nCookie Daly might even hate Real Life Daly more than the others, and could make RLN order another pizza with something he knows he's allergic to so RLD would have an allergy attack during the game that they could exploit. RLD would die and RLN could help with the process of transferring the crew members out of Daly's mod, using a program that Cookie Daly provided.",
        "created_utc": 1518909601,
        "upvote_ratio": ""
    },
    {
        "title": "Is this how Metalhead will come to fruition IRL?",
        "author": "sillymerricat",
        "url": "https://i.redd.it/78tmkcr4qug01.jpg",
        "text": "",
        "created_utc": 1518907440,
        "upvote_ratio": ""
    },
    {
        "title": "Movies like Metalhead?",
        "author": "HeyYoLessonHereBey",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y9r9f/movies_like_metalhead/",
        "text": "I loved Metalhead a lot until the abrupt ending. But I will forgive because the rest of it was great to watch. And the lack of context made it all better. What are some sci-fi/survival/post-apocalypse movies that are tense, dark and atmospheric as Metalhead? Preferably with no or little explanation about the back story just like this episode?",
        "created_utc": 1518904349,
        "upvote_ratio": ""
    },
    {
        "title": "An aggressive invitation or a plea for death?",
        "author": "monthlyduck",
        "url": "https://i.redd.it/zl5bwv0a9ug01.jpg",
        "text": "",
        "created_utc": 1518901787,
        "upvote_ratio": ""
    },
    {
        "title": "Playtest - \"TEST DURATION\"? [Spoilers]",
        "author": "point04seconds",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y83vl/playtest_test_duration_spoilers/",
        "text": "[removed]",
        "created_utc": 1518889709,
        "upvote_ratio": ""
    },
    {
        "title": "Monkeys",
        "author": "rclouse",
        "url": "https://imgur.com/5yjQyS8",
        "text": "",
        "created_utc": 1518886526,
        "upvote_ratio": ""
    },
    {
        "title": "Why’s no one craving for season 5?",
        "author": "Twink-le",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y7opd/whys_no_one_craving_for_season_5/",
        "text": "[removed]",
        "created_utc": 1518885779,
        "upvote_ratio": ""
    },
    {
        "title": "Songs like \"Anyone Who Knows What Love Is\"?",
        "author": "ohwhatirony",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y7lm5/songs_like_anyone_who_knows_what_love_is/",
        "text": "I don't know about you guys, but whenever I hear that song, I kind of get the creeps. I've heard it in trailers outside of Black Mirror (one even had Bryce Dallas Howard from Nosedive..) and it just gives me this hollow, weird feeling that something bad might happen.\n\n\nAre there any other songs you guys think of that are kind of \"creepy themes\"? What do you picture happening with the song? One that comes to mind is Strangers in the Night by Frank Sinatra. ",
        "created_utc": 1518884940,
        "upvote_ratio": ""
    },
    {
        "title": "Someone turned Metalhead into a quite impressive music video",
        "author": "[deleted]",
        "url": "https://youtu.be/eIrY-ts0HoM",
        "text": "[deleted]",
        "created_utc": 1518884107,
        "upvote_ratio": ""
    },
    {
        "title": "Anime with black mirror twist",
        "author": "kngktrn",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y7if6/anime_with_black_mirror_twist/",
        "text": "Guys if you like anime with a black mirror twist you should watch this anime movie entitled \"Hal\" it's a soujo but the twist is somewhat blackmirrory not dark but surely a twist you would not expect and the theme is in the future too. Just sharing hehe.",
        "created_utc": 1518884067,
        "upvote_ratio": ""
    },
    {
        "title": "USS Callister",
        "author": "ChiTownChick",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y6y0o/uss_callister/",
        "text": "SPOILERS AHEAD\n\nI loved this episode. I am a big Star Trek fan, and I feel like this episode was made for me. The episode was very reminiscent of the first Star Trek. It was a dark episode, and I was on the edge of my seat for most of it. \nRobert Daly was an introvert with a sadistic streak. If he liked you, then you're going into his Space Fleet mod. If you hated you, then you're going in.  Smile too much? You're in. He not only took their entire world away, he turned them into dolls down there. The way he kept the DNA was seriously messed up. And oh, you can't die in his world. There is no escape, not in the tradional sense. It sounds like pure hell. At the end of the episode after the crew went into the wormhole/update, did Daly die? Or was he in a coma. ",
        "created_utc": 1518878088,
        "upvote_ratio": ""
    },
    {
        "title": "What's everyone's most relatable episode?",
        "author": "Sentantic",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y6tsz/whats_everyones_most_relatable_episode/",
        "text": "For me, it's 15 million merits. Just the fact that you go to work, do the same monotonous task over and over then come home and just watch a screen. Maybe that's why I think it was one of the best episodes.",
        "created_utc": 1518876704,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think would make a good episode?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y6f1w/what_do_you_think_would_make_a_good_episode/",
        "text": "[removed]",
        "created_utc": 1518871044,
        "upvote_ratio": ""
    },
    {
        "title": "Unpopular Opinion: Hang the DJ is overrated",
        "author": "madeofivory",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y67za/unpopular_opinion_hang_the_dj_is_overrated/",
        "text": "Don't get me wrong, it has a great premise, the two leads have great chemistry, and it's definitely one of the better episodes from Season 4, but the ending felt super rushed and anti-climactic. To me, it felt like the writers saw how successful San Junipero was and wanted to recreate it. \n\nI mean think about it, they both mostly take place within a simulated reality, they're both about relationships, they're both comment on our dependence on technology (albeit in 2 opposing views). Except I feel like San Junipero is better in conveying its message. Hang the DJ just has this lackluster twist with comparably very little emotional impact. Just my opinion though.",
        "created_utc": 1518867911,
        "upvote_ratio": ""
    },
    {
        "title": "In ○rder t○ αttrαct new cust○mers t○ ○ur st○re we αre mαkἱng α greαt pr○m○tἱ○n. We αre gἱvἱng αwαy 100 Mechαnἱcαl Leαther Wαtches (normαlly 100$) ○nly t○dαy. Αll y○u hαve t○ d○ ἱs leαve α h○nest revἱew αnd Pαy shἱppἱng",
        "author": "clubber1561727",
        "url": "http://takeme43.blogspot.com/2018/02/in-rder-t-ttrct-new-custmers-t-ur-stre.html",
        "text": "",
        "created_utc": 1518858315,
        "upvote_ratio": ""
    },
    {
        "title": "Question concerning \"Hang the DJ\".",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y5lde/question_concerning_hang_the_dj/",
        "text": "[deleted]",
        "created_utc": 1518857096,
        "upvote_ratio": ""
    },
    {
        "title": "This is my ranking of the Black Mirror episodes.",
        "author": "GlubbGore420",
        "url": "https://i.redd.it/sqwm2lugmpg01.png",
        "text": "",
        "created_utc": 1518845674,
        "upvote_ratio": ""
    },
    {
        "title": "No spoilers, I want to watch black mirror for the first time, what episode should I watch?",
        "author": "tortatuesday",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y4tv1/no_spoilers_i_want_to_watch_black_mirror_for_the/",
        "text": "[removed]",
        "created_utc": 1518845422,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone have a clip of the ending of Season 2 Ep 3, \"The Waldo Moment\"?",
        "author": "RuiningYourJokes",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y4p1v/does_anyone_have_a_clip_of_the_ending_of_season_2/",
        "text": "The one where they announce the elections, not the end credits. I can't seem to find a clip.",
        "created_utc": 1518843685,
        "upvote_ratio": ""
    },
    {
        "title": "High Black Mirror",
        "author": "jackie_blue_5",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y4f0e/high_black_mirror/",
        "text": "Just wanna say that smoking weed and watching Black Mirror is super cool. Love you guys.",
        "created_utc": 1518840123,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror Funko Pops",
        "author": "quothetheraven79",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y45wl/black_mirror_funko_pops/",
        "text": "Funko has asked you what characters would you pick for a series of 6 Funko Pops.  Who do you pick?  Now you can pick 2 versions of 2 characters for your chase figures \n\nMy picks:\n\n1) British Prime Minister Michael Callow with a miniature pig (from national anthem)\n2) Waldo (The Waldo Moment)\n3) Lacie w/ phone (from nosedive) Chase variant Lacie covered in mud, smeared makeup, &amp; ratty bridesmaid dress\n4) Kelly in purple 80’s attire (from San Junipero) chase variant Kelly in Wedding Dress\n5) Captain Robert Daly (from USS Callister)\n6) Bella w/ miniature dog available in black &amp; white (Metalhead)",
        "created_utc": 1518837037,
        "upvote_ratio": ""
    },
    {
        "title": "Kenny looking at kids in “Shut Up and Dance”?",
        "author": "youradhere14",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y418a/kenny_looking_at_kids_in_shut_up_and_dance/",
        "text": "When Kenny’s mother calls him and says “they says “there’s some video of you...they’re saying it’s kids...that you’ve been looking at kids”, do we ever know if this was in fact the case? There does not seem to be any evidence to support or refute this that I noticed, but would certainly explain why he is so desperate to have the video disappear. ",
        "created_utc": 1518835566,
        "upvote_ratio": ""
    },
    {
        "title": "Am I the only one who doesn’t like san junipero?",
        "author": "artiproctor",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y3z8e/am_i_the_only_one_who_doesnt_like_san_junipero/",
        "text": "I just thought it wasn’t very interesting and I lost interest throughout it. I don’t think it was the fact that it was was happy and upbeat compared to other episodes because I thought “hang the DJ” was great. Just my personal opinion.",
        "created_utc": 1518834923,
        "upvote_ratio": ""
    },
    {
        "title": "Metalhead and Why it’s all in Black and White",
        "author": "Payne113",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y3nqu/metalhead_and_why_its_all_in_black_and_white/",
        "text": "Okay so this is the only episode that’s completely in black and white...I feel like this is because it doesn’t fully fit in the Black Mirror world...or at least the time line yet. I mean if the world is taken over by these “Dogs” and almost everyone is dead then that would mean it’s the that that would be how the world ended...so I feel like it’s in black and white to kind of mask it from the rest of the storyline ",
        "created_utc": 1518831496,
        "upvote_ratio": ""
    },
    {
        "title": "Episode Survivor Round 8",
        "author": "not_a_skunk",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y3frk/episode_survivor_round_8/",
        "text": "Probably gonna start getting into contentious territory as we enter Round 8. Last round, **Playtest** [was eliminated](http://www.strawpoll.me/15081908/r) with 16% of the vote. Current standings: \n\n* Rd. 1) The Waldo Moment\n* Rd. 2) Metalhead\n* Rd. 3) Crocodile\n* Rd. 4) Men Against Fire\n* Rd. 5) The National Anthem\n* Rd. 6) Arkangel\n* Rd. 7) Playtest\n\n[Click here for Round 8](http://www.strawpoll.me/15088992)",
        "created_utc": 1518829227,
        "upvote_ratio": ""
    },
    {
        "title": "Any way we can get a future episode inspired by all this news of election meddling?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y3690/any_way_we_can_get_a_future_episode_inspired_by/",
        "text": "[deleted]",
        "created_utc": 1518826634,
        "upvote_ratio": ""
    },
    {
        "title": "Just finished binging all 4 seasons",
        "author": "yourfellowredditor",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y2rxv/just_finished_binging_all_4_seasons/",
        "text": "And holy fuck. I am at a loss for words. I went into the series completely blind, and started from USS Callister. As i watched episodes like 15 Million Merits, White Bear and Shut Up And Dance, my mind just [fucking repeatedly got completely blown](https://imgur.com/r/gifs/DWrI2JY). I had never seen tv like that, which could grip me like that. It's been close to two weeks since i started and still some of the episodes i saw in the beginning has me fucked up. I have been looking for something like this for so long, and now i'm scared i might never be able to fully enjoy another show as pretty much everything i have seen pales in comparision to some of the better episodes in this show. I was actually close to stopping it during the first 5 minutes of USS Callister because i thought this might be some Star Trek kind of show and i really wasn't interested in that. Definitely glad i didn't do that",
        "created_utc": 1518822837,
        "upvote_ratio": ""
    },
    {
        "title": "Which episode should I start on?",
        "author": "pepe184",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y2n73/which_episode_should_i_start_on/",
        "text": "Netlfix has them in a weird order season 4 is first then season 3, 2, 1... im confused as fuck. Just give me the title of the episofe i should watch pls :)",
        "created_utc": 1518821594,
        "upvote_ratio": ""
    },
    {
        "title": "What concepts do think would make compelling Black Mirror episodes?",
        "author": "josboa",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y2du6/what_concepts_do_think_would_make_compelling/",
        "text": "[removed]",
        "created_utc": 1518819247,
        "upvote_ratio": ""
    },
    {
        "title": "The hamster got em",
        "author": "Faddeh",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y2a34/the_hamster_got_em/",
        "text": "Anybody else in love with how the hamster had its memory tapped in S4E3 so that bitch got arrested",
        "created_utc": 1518818327,
        "upvote_ratio": ""
    },
    {
        "title": "A Perfect Black Mirror script from 1909",
        "author": "digoryk",
        "url": "http://archive.ncsa.illinois.edu/prajlich/forster.html",
        "text": "",
        "created_utc": 1518817928,
        "upvote_ratio": ""
    },
    {
        "title": "Waldo question",
        "author": "patosaurus75",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y201e/waldo_question/",
        "text": "Can someone explain the end of the waldo moment for me? Like did waldo take over the country after all? I dont know, I'm confused.",
        "created_utc": 1518815828,
        "upvote_ratio": ""
    },
    {
        "title": "Favourite or Hate It",
        "author": "SweetTea742",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y1ge8/favourite_or_hate_it/",
        "text": "Hey guys, \n\nI have a cool idea for a thread (not sure if it was done before).\n\nLet's list our Most Favourite Episode and Most Hated Episode. \n\nFrom the answers, we would be able to see a match, an opposite or difference. \n\nMy Most Favourite: The Entire History of You\nMy Most Hated: Arkangel",
        "created_utc": 1518811225,
        "upvote_ratio": ""
    },
    {
        "title": "Rewatching of Playtest",
        "author": "Payne113",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y10js/rewatching_of_playtest/",
        "text": "Okay so I just rewatched Playtest with my roommate (he’s just starting and I told him to watch that one because it’s on of my favorites) but as I was rewatching I noticed that they made a point to show Cooper being told on the plane to turn off his cellular device because it interferes with the wave lengths of the plane. And I found that ironic and very flash forwarding to how he died...maybe I’m over thinking this.",
        "created_utc": 1518807540,
        "upvote_ratio": ""
    },
    {
        "title": "Which Black Mirror universe do you think we're closest to?",
        "author": "MAINstays20inchFAN",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y0hl1/which_black_mirror_universe_do_you_think_were/",
        "text": "I mean in the literal sense, not the allegorical sense as seen in \"Nosedive\".\n\nI'd say Crocodile or Hated in the Nation. ",
        "created_utc": 1518803376,
        "upvote_ratio": ""
    },
    {
        "title": "The real \"Black Mirror Moment\" of USS Callister is what happened after the episode",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7y08lx/the_real_black_mirror_moment_of_uss_callister_is/",
        "text": "[removed]",
        "created_utc": 1518801415,
        "upvote_ratio": ""
    },
    {
        "title": "I’ve just watched Playtest for the second time and I still don’t quite understand the ending.",
        "author": "hamburger_2",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xziwp/ive_just_watched_playtest_for_the_second_time_and/",
        "text": "Is it an inception based ending? Like he keeps returning to reality but it’s not reality until the end when he’s dead? Someone clear this up for me, thanks",
        "created_utc": 1518795634,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think that we are seeing so many real world similarities to black mirror because the writers choose already existing concepts",
        "author": "ITriggerFeminists",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xz81g/do_you_think_that_we_are_seeing_so_many_real/",
        "text": "I see so many real world posts on this subreddit and I was simply wondering if it’s a coincidence or the writers have been doing their research",
        "created_utc": 1518792881,
        "upvote_ratio": ""
    },
    {
        "title": "Episode Suggestions?",
        "author": "CanIEatYourAssPlease",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xz3m1/episode_suggestions/",
        "text": "My favourite episodes were Shut Up And Dance and Arkangel. I haven’t watched many episodes but these were the ones I liked most. What episodes would you suggest for me to watch?",
        "created_utc": 1518791675,
        "upvote_ratio": ""
    },
    {
        "title": "Metalhead meets Music.",
        "author": "[deleted]",
        "url": "https://youtu.be/eIrY-ts0HoM",
        "text": "[deleted]",
        "created_utc": 1518791159,
        "upvote_ratio": ""
    },
    {
        "title": "Is the video game technology in \"U.S.S. Callister\" the same as in \"Playtest\"?",
        "author": "nineinchscrews",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xyxwp/is_the_video_game_technology_in_uss_callister_the/",
        "text": "[removed]",
        "created_utc": 1518790122,
        "upvote_ratio": ""
    },
    {
        "title": "CMV: White Bear should be done to school shooters (like recently :( )",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xyri3/cmv_white_bear_should_be_done_to_school_shooters/",
        "text": "[removed]",
        "created_utc": 1518788303,
        "upvote_ratio": ""
    },
    {
        "title": "i did a cover of the 15 million merits song and tried to make it as gritty as blackmirror.",
        "author": "Motwastaken",
        "url": "https://soundcloud.com/m_ot/anyone-who-knows-what-love-is",
        "text": "",
        "created_utc": 1518788289,
        "upvote_ratio": ""
    },
    {
        "title": "Hang the dj's 'system'",
        "author": "astrid8200",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xykn2/hang_the_djs_system/",
        "text": "[removed]",
        "created_utc": 1518786140,
        "upvote_ratio": ""
    },
    {
        "title": "Wait what",
        "author": "Reagiamo",
        "url": "https://i.redd.it/agkknbihdkg01.jpg",
        "text": "",
        "created_utc": 1518782119,
        "upvote_ratio": ""
    },
    {
        "title": "White Christmas or Black Museum?",
        "author": "RubyPeridot",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xxhl0/white_christmas_or_black_museum/",
        "text": "Which episode do you think is better. IMO Black Museum is better, just because i think the stories are a bit better and the ending was amazing. Don't get me wrong, i still like White Christmas.",
        "created_utc": 1518770859,
        "upvote_ratio": ""
    },
    {
        "title": "Nosedive Done Right",
        "author": "XAngeliclilkittyX",
        "url": "https://ivn.us/2018/02/01/cutting-edge-voting-reform/",
        "text": "",
        "created_utc": 1518770858,
        "upvote_ratio": ""
    },
    {
        "title": "How would you feel knowing there exists a cookie version of you, and that version is eternally suffering?",
        "author": "smokieTopaz",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xxd10/how_would_you_feel_knowing_there_exists_a_cookie/",
        "text": "[removed]",
        "created_utc": 1518768814,
        "upvote_ratio": ""
    },
    {
        "title": "Just watched \"Shut up and dance\" S3E3 on a mobile phone, and...",
        "author": "Orodrake",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xxcxu/just_watched_shut_up_and_dance_s3e3_on_a_mobile/",
        "text": "During the whole episode whenever Hector (Jerome Flynn) receives a text, I hear my phone notification sound at the exact same time. First I thought it was just I had a message or something, but I quickly understood that somehow Netflix made my phone ring at the same time as Hector in SUAD.\n\nBut the thing is even tho I googled for 15mn or so, I can't find anything about this on the internet so that's getting a little creepy x) Have you guys experienced the same thing watching this episode on mobile ? (Android 6.0 btw, and sorry for broken english)\n\nEdit: re-watch some scenes, and I confirm I hear my 'bike horn' sound when he receives a text. (40:45 for example)",
        "created_utc": 1518768779,
        "upvote_ratio": ""
    },
    {
        "title": "Why Did So Many People Dislike Metalhead?",
        "author": "ddevvnull",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xx3vj/why_did_so_many_people_dislike_metalhead/",
        "text": "As is with any anthology series, there's almost always one episode that folks feel \"*eh*\" about. In the case of Season 4, it seemed like Metalhead was that episode. I personally liked it (and can explain the comments, if anyone'd like) but I'd love to know why seemingly many BM fans weren't so thrilled about this particular story. Thoughts?\n\n**Update:** Wow, these are some pretty interesting takes on BM. Thanks, everyone!",
        "created_utc": 1518765002,
        "upvote_ratio": ""
    },
    {
        "title": "Who else was annoyed with this bitch?",
        "author": "[deleted]",
        "url": "https://i.redd.it/yacbmdig3ig01.jpg",
        "text": "[deleted]",
        "created_utc": 1518754532,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a specific order that BM should be watched in?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xw9cp/is_there_a_specific_order_that_bm_should_be/",
        "text": "[deleted]",
        "created_utc": 1518754498,
        "upvote_ratio": ""
    },
    {
        "title": "Would you \"White Bear\" the recent school shooter",
        "author": "ShiningKatana20",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xw21d/would_you_white_bear_the_recent_school_shooter/",
        "text": "[removed]",
        "created_utc": 1518752224,
        "upvote_ratio": ""
    },
    {
        "title": "Could a similar ''nosedive'' rating system be implemented in the real world to better mankind?",
        "author": "Babbby123",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xw1nw/could_a_similar_nosedive_rating_system_be/",
        "text": "[removed]",
        "created_utc": 1518752112,
        "upvote_ratio": ""
    },
    {
        "title": "Community's reaction to USS Callister",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xw0nc/communitys_reaction_to_uss_callister/",
        "text": "[removed]",
        "created_utc": 1518751818,
        "upvote_ratio": ""
    },
    {
        "title": "XKCD #1580 basically predicts cookies in real life",
        "author": "Koush888",
        "url": "https://i.redd.it/i1j6qpegihg01.png",
        "text": "",
        "created_utc": 1518747510,
        "upvote_ratio": ""
    },
    {
        "title": "Might as well call it a dog!",
        "author": "shotthesheriff727",
        "url": "https://youtu.be/ZCp0Bq6xVZI",
        "text": "",
        "created_utc": 1518743376,
        "upvote_ratio": ""
    },
    {
        "title": "Episode Survivor Round 7",
        "author": "not_a_skunk",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xuro2/episode_survivor_round_7/",
        "text": "That concludes Round 6. [Arkangel was eliminated](http://www.strawpoll.me/15075943/r) with 21% of the vote\n\nResults so far:\n\n* Rd. 1) The Waldo Moment\n* Rd. 2) Metalhead\n* Rd. 3) Crocodile\n* Rd. 4) Men Against Fire\n* Rd. 5) The National Anthem\n* Rd. 6) Arkangel\n\n[Let's go Round 7...](http://www.strawpoll.me/15081908)\n",
        "created_utc": 1518739365,
        "upvote_ratio": ""
    },
    {
        "title": "Why does everyone love hang the DJ?",
        "author": "Our_Saviour_Tachanka",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xu9nf/why_does_everyone_love_hang_the_dj/",
        "text": "I don't mean to be criticising others but in my opinion it came of as an attempt to reproduce what the audience loved in  San Junípero. Which in my opinion it failed at. While it certainly isn't bad I feel that it is given too much praise in comparison with the rest of season 4. ",
        "created_utc": 1518734778,
        "upvote_ratio": ""
    },
    {
        "title": "What is the importance of Quagmire in San Junipero?",
        "author": "VitriolicDiatribe",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xu36f/what_is_the_importance_of_quagmire_in_san_junipero/",
        "text": "San Junipero is supposed to be 'heaven on earth', so why is there a hellish, violent nightclub there called Quagmire, which Kelly describes as a place where people go who are desperate to feel something?\n\nWhy aren't those people getting the eternal heaven from SJ? Could it be a programming error? Malware? People whose (living) family haven't kept up with the payments for the server space in the San Junipero cloud?\n\nAlso a side note, when Yorkie walked away from the club near the start, it was pouring down with rain yet the reflection in the puddle she stepped in showed a full moon in a perfectly clear sky. That was the first hint I got that they were in a different reality. ",
        "created_utc": 1518733238,
        "upvote_ratio": ""
    },
    {
        "title": "You guys like my San Junipero Theme?",
        "author": "Brandawg451",
        "url": "https://i.imgur.com/SXfTzd6.jpg",
        "text": "",
        "created_utc": 1518732432,
        "upvote_ratio": ""
    },
    {
        "title": "15 mill merits is a bitcoin generator run by \"cookies\"",
        "author": "TheSubtlegong",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xtg5j/15_mill_merits_is_a_bitcoin_generator_run_by/",
        "text": "I rewatched the second episode of the show fully realizing that it is a shared universe and I just don't see any evidence that this is prison or slave labor in any other episodes. No evidence of second class citizens other than digital \"cookie\" copies of people. So what if 15 mill merits is all about digital slavery for the sake of creating cryptocurrency?",
        "created_utc": 1518727894,
        "upvote_ratio": ""
    },
    {
        "title": "Black Mirror is starting to become real life.",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=fUyU3lKzoio&amp;feature=share",
        "text": "[deleted]",
        "created_utc": 1518723849,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone else feel Season 3 was a bit underwhelming?",
        "author": "alrashid2",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xsssd/does_anyone_else_feel_season_3_was_a_bit/",
        "text": "I don't mean to criticize at all. I loved watching Season 4. However, I have noticed a difference from Season 3. \n\nAfter I watched S3, I would often rewatch episodes after a while. I still rewatch episodes from S3!\n\nHowever, I have yet to rewatch a single episode or feel the need to from S4. \n\nJust a thought I had, wonder if you agree.\n\nEdit: Geez I got mixed up! I meant season 4!! Edited above ",
        "created_utc": 1518722636,
        "upvote_ratio": ""
    },
    {
        "title": "Altered Carbon is a must watch",
        "author": "Dominator_384",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xsfry/altered_carbon_is_a_must_watch/",
        "text": "If you're a black mirror fan you need to watch this, there are some parts where there is a lot of action which some of you might not be into, but overall it's an amazing show\n\nEdit: Alright it seems people are taking this the wrong way, the reason I'm comparing it to black mirror is because of the aspect of society and the abuse of technology. The rich life forever as the can afford it while the rest don't and are tortured. Another part is the virtual torture, which again is abusing that technology. Hopefully you all get from where I'm coming from",
        "created_utc": 1518719716,
        "upvote_ratio": ""
    },
    {
        "title": "Why in my opinion Hang The DJ is a masterpiece",
        "author": "lost_f1_survivor_got",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xs2px/why_in_my_opinion_hang_the_dj_is_a_masterpiece/",
        "text": "I just rewatched the episode for the 3rd time ( watched it the first time on my own and once with my girlfriend ) and it is still as amazing as the first time I saw it about two months ago.\n\nThe two main characters, Amy ( Georgina Campbell ) and Frank     ( Joe Cole ) have such an unbelievable chemistry that it makes me question anyone who thinks San Junipero's Kelly and Yorkie come anywhere close the chemistry that these two people have. And no, it has got nothing to do with because they're a straight couple, I don't want any arguments like that. \n\nThe ending scene still gave me chills and I nearly fucking cried despite knowing what was going to happen. For some reason the song \"Panic\" by The Smiths fits into the ending so perfectly and gives a meaning to the title of the episode. Only if \"Shut Up And Dance\" didn't exist, I would confidently be able to say that Hang The DJ is my favourite and in my opinion the best Black Mirror episode of all time but Black Mirror is such a great show that it can produce multiple amazing episodes.\n\nWhat's your opinion on Hang The DJ? Do you think it's better than San Junipero? I respect everyone's opinion and if someone wants to explain to me why they like SJ so much, I'll consider it.\n",
        "created_utc": 1518716819,
        "upvote_ratio": ""
    },
    {
        "title": "“Do you submit?” | Black Mirror Fan Art by IAMCRIME",
        "author": "IAMCRIME",
        "url": "https://i.redd.it/6hs0z1l4neg01.gif",
        "text": "",
        "created_utc": 1518712727,
        "upvote_ratio": ""
    },
    {
        "title": "#Deathto Nikolas Cruz",
        "author": "Baylor_F",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xqw3g/deathto_nikolas_cruz/",
        "text": "[removed]",
        "created_utc": 1518706895,
        "upvote_ratio": ""
    },
    {
        "title": "Tales of the Crypt and Black Mirror",
        "author": "SweetTea742",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xqth2/tales_of_the_crypt_and_black_mirror/",
        "text": "I grew up in the 90's and even though I was a huge horror fan, I never had the chance to watch the series Tales of the Crypt.\n\nAnyhoo, Tales of the Crypt was mentioned as a \"must watch\" for Black Mirror fans on Reddit so, I gave it a shot. \n\nI've watched a few episodes well and it is indeed very good with a similar lingering eeriness of Black Mirror.\n\nThanks for the recommendation Black Mirror Reddit users lol 😊",
        "created_utc": 1518706183,
        "upvote_ratio": ""
    },
    {
        "title": "Do you prefer seasons 1&amp;2 or 3&amp;4?",
        "author": "midnight_rebirth",
        "url": "https://www.reddit.com/r/blackmirror/comments/7xqrns/do_you_prefer_seasons_12_or_34/",
        "text": "Just curious if people generally prefer the Netflix episodes or the ones that aired on channel 4. As much as I hate to say I love both equally and really can’t decide. I’ve heard of people say in S3 &amp; S4 they felt it became “Americanized” and not as good just curious what you guys think. ",
        "created_utc": 1518705714,
        "upvote_ratio": ""
    }
]