[
    {
        "title": "Man's search for meaning",
        "author": "random_user_nth",
        "url": "https://www.reddit.com/r/books/comments/11gvb78/mans_search_for_meaning/",
        "text": "I am currently reading Man's search for meaning. I want to know what's your one learning that you got from this book.\n\nI will start with mine, \"you have to find a bigger purpose in life in order to have some meaning or happiness in your life, which is quite hard nowadays given we live in a virtual world constantly chasing after transient pleasures\".",
        "created_utc": 1677831359,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ursula LeGuin: The Water is wide",
        "author": "Mr_Doe",
        "url": "https://www.reddit.com/r/books/comments/11gvb0z/ursula_leguin_the_water_is_wide/",
        "text": "LeGuin has been one of my favorite authors since I first read *A wizard of Earthsea* as a kid.\n\nI recently got around to reading one of her collections of short stories (*The Unreal and the Real*), which, I've sadly neglected until now.\n\nThere are several incredible short stories in this collection, most notably *Unlocking the Air* and *The ones who walk away from Omelas*, however, it was *The Water is Wide* that really touched me.  Hauntingly beautiful, intimate, and melancholy.\n\nI'm pretty sure I could live to be 100 and never be as thoughtful or as wise as LeGuin.\n\nBut enough about me, I'd love to hear some recommendations.  What are your favorite short stories of LeGuin's?  Why?",
        "created_utc": 1677831339,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does my hardcover book smell like Hershey's Chocolate?",
        "author": "Educational-Fuel2484",
        "url": "https://www.reddit.com/r/books/comments/11guu2w/why_does_my_hardcover_book_smell_like_hersheys/",
        "text": "[removed]",
        "created_utc": 1677829592,
        "upvote_ratio": 1.0
    },
    {
        "title": "ขวางานซ้ายเงิน 6610 ลายมือเรื่องที่คุณต้องรู้",
        "author": "benjateller",
        "url": "https://www.benjateller.com/ขวางานซ้ายเงิน/",
        "text": "",
        "created_utc": 1677829541,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Utilitarian Theory and ethics",
        "author": "Difficult_Dinner8584",
        "url": "https://www.philobuzz.com/2023/03/the-utilitarian-theory-and-ethics.html",
        "text": "",
        "created_utc": 1677828068,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good book on football analytics",
        "author": "robParallax",
        "url": "https://www.reddit.com/r/books/comments/11gud1o/good_book_on_football_analytics/",
        "text": "[removed]",
        "created_utc": 1677827850,
        "upvote_ratio": 1.0
    },
    {
        "title": "searching for out of print!",
        "author": "Thin_Adhesiveness_66",
        "url": "https://www.reddit.com/r/books/comments/11gubve/searching_for_out_of_print/",
        "text": "Contemporary Pottery of Iran\n\nA Selection of the Works Exhibited at the Fifth Exhibition Contemporary Pot\n\nPublished by: The Visual Art Association, with the cooperation of Tehran Musume of Supervisor: S.M. Sohofi Jenab\n\nArt Director &amp; Designer: Bijan Photography: Ali Reza Ilkhani\n\nLithography: Kayhan Graphic Printed: Salahi\n\nCirculation: 3000 copies First Edition: Winter 1996\n\nPrice: 40,000 Rials\n\nAll Rights Reserved\n\nPrinted in the Islamic Republic of Iran",
        "created_utc": 1677827733,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is Best Book to Read which can Turn Our Life to a different angel?",
        "author": "Warez-bb-Official",
        "url": "https://www.reddit.com/r/books/comments/11gu9y5/what_is_best_book_to_read_which_can_turn_our_life/",
        "text": "[removed]",
        "created_utc": 1677827529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally finished Good Omens.",
        "author": "littlem0resalt",
        "url": "https://www.reddit.com/r/books/comments/11gsskq/finally_finished_good_omens/",
        "text": "Man , what a cool book. I feel bad it took me so long to read. I’m not really a reader, or I should say I have a bad track record.  I get all geeked on reading for a week or so and then putz out, but I’m trying to change that now that I’m sober and hopefully not nearly as depressed..lol..\n\nAnyway, I’m excited to learn what I even enjoy reading. I randomly picked up Good Omens based on a Reddit post 3 years ago and really don’t know what else to read or what/who I even like. I’ve read like, 4 books in my life I think, and the Alchemist is one of them, so, yknow. \n\nI bought Legends and Lattes today because I hear it’s popular and I like coffee. I haven’t started it yet but I’m afraid of being “too old” for it.",
        "created_utc": 1677822581,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a problem. I’ll get about half way through a book, and then ill change books or just start reading it a lot slower. I’m not too sure what it is.",
        "author": "Le0son",
        "url": "https://www.reddit.com/r/books/comments/11gshrn/i_have_a_problem_ill_get_about_half_way_through_a/",
        "text": "[removed]",
        "created_utc": 1677821610,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know a good book in the fantasy genre about building a kingdom or a city?",
        "author": "Britania93",
        "url": "https://www.reddit.com/r/books/comments/11grxpa/does_anyone_know_a_good_book_in_the_fantasy_genre/",
        "text": "I find the scenario where someone builds a kingdom/city very interesting. Especially when it comes to politics, intrigues, solving problems, etc.\n\nAs an example, a fallen nobleman who wants to take revenge on the kingdom and therefore goes into exile and builds a new country there or just a city and then wants to take revenge.\n\nOr a noble gets an undeveloped land to build up.\n\nIn mangas/manwhas there are stories like that from time to time, but I wonder if there aren't stories like that in the book as well.",
        "created_utc": 1677819904,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would someone care to help me with my essay about the poppy war?",
        "author": "toottoottrain812",
        "url": "https://www.reddit.com/r/books/comments/11gru61/would_someone_care_to_help_me_with_my_essay_about/",
        "text": " \n\nI’m currently writing a media essay on a chosen media. I choose The Poppy War by R.F. Kuang. It’s a book I read a couple of years ago. I choose this book because I think it fits the topic of my essay. My essay must include 1 theory and 2 concepts I've learned in my class. The only problem is it's been a while since I read this book and I've read many reviews and summaries of this book. I'm not sure how many will see this post but I'm just organizing my thoughts here and if you want to input your own thoughts that would be very helpful. \n\nMy first theory is an example that can signify adapting to another person by culture, gender, ethnicity, or language. And my example is how Rin started to understand Altan because they both come from the same background. If I remember correctly he teaches her about the place where they both come from. So I was wondering if that could be a good example. I'm still thinking. \n\nMy two concepts are perception and self-serving bias. The perception part is pretty easy (I think). I was gonna give an example of how everyone perceives the Gods. Right? Or even the shamans. Because they perceive them differently. And about the self-serving bias, I'm still thinking of examples that include that in the book. \n\nIf anyone has any helpful tips or examples from this book I would really appreciate it. (I really do not want to re-read the book) \n\nThank you.",
        "created_utc": 1677819629,
        "upvote_ratio": 1.0
    },
    {
        "title": "American psycho was really funny to me",
        "author": "DirectionBasic3386",
        "url": "https://www.reddit.com/r/books/comments/11grrw4/american_psycho_was_really_funny_to_me/",
        "text": "I feel like kind of an asshole for admitting it, but American psycho was one of the funniest books I’ve ever read. There were certainly scenes that were gratuitously violent and absolutely ridiculous, but I loved it in the context of the absurdity of the rest of the book. It made sense to me and was very funny. I understand why a lot of people cannot take this book as a work of satire, and find it to be completely repugnant. But the satire hit really hard for me, and all of the gratuitous descriptions of clothing and food, along with the absurd violence and commentary on vapid yuppie culture were absolutely hilarious to me.",
        "created_utc": 1677819439,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which time period in Discworld would you live in if you had the choice?",
        "author": "Obscura_Games",
        "url": "https://www.reddit.com/r/books/comments/11grbcd/which_time_period_in_discworld_would_you_live_in/",
        "text": "I'm mostly thinking of Ankh Morpork here. I think I'd avoid the early days. Vimes says in the detective books that the city had gotten a lot better by the time he was older. Like a lot safer to walk around (a functioning watch) and it seems a lot better economically too. Not to mention an absence of homicidal kings.\n\nI'm interested in the later period where there are steam trains and the like but I think my preference would be the middle period. Feet of Clay sort of time - early days of the clacks. That kind of thing. It seems like the most fun period of the city and before it got too technological and more similar to our world. Just anarchic enough.\n\nIt would depend who you were in the world of course. I think it would definitely be better to be a watchman later on.\n\nJust wondered what kind of time period appeals to readers?",
        "created_utc": 1677818026,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a book I can't remember the title of",
        "author": "OhBingusAhhh",
        "url": "https://www.reddit.com/r/books/comments/11gr8ra/looking_for_a_book_i_cant_remember_the_title_of/",
        "text": "Hello! I was wondering if anyone might be able to help me find the name of a certain book or if anyone happens to remember this book. I can't remember the title but I remember bits about the story and cover. I read this book probably in/around 2012/2013 (I might be off by a year or two) and I believe it was considered teen fiction. The story was post apocalyptic after a zombie like infection occurred and I believe the main character (a young adult girl) lived in or around a forest. I might be wrong but I think she came from a town or civilization that was based in a large forest. The cover of the book had a young adult blonde girl in the center and only part of her face was in focus. She was surrounded by a forest/greenery that was out of focus. If anyone knows what I'm talking about please let me know the name of the book, thank you!",
        "created_utc": 1677817822,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can y’all recommend some books that have really unique magic systems or plots?",
        "author": "thevvitchdoctor",
        "url": "https://www.reddit.com/r/books/comments/11gr3ou/can_yall_recommend_some_books_that_have_really/",
        "text": "[removed]",
        "created_utc": 1677817417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me remember the title of a book please",
        "author": "Royal_Ad_7379",
        "url": "https://www.reddit.com/r/books/comments/11gr374/help_me_remember_the_title_of_a_book_please/",
        "text": "what’s up peoples.  i’ve been trying to remember the name of a book I read awhile back with no success. i’ve tried google and still nothing. If anyone could help me i’d very much appreciate it! \nHere’s what I know: Its a dystopian future and the government has all power. The government runs all TV networks and there are game shows on them. on the shows the participants are poor citizens who sign up for money. some shows people run on treadmills till they drop dead of heart attacks. the main character is participating in a show where he will win big money. he had to survive mercenaries for a period of time.\n\nIf anyone knows what book this is please let me know✌🏻🍄",
        "created_utc": 1677817377,
        "upvote_ratio": 1.0
    },
    {
        "title": "American psycho was really funny to me",
        "author": "DirectionBasic3386",
        "url": "https://www.reddit.com/r/books/comments/11gr0wx/american_psycho_was_really_funny_to_me/",
        "text": "I feel like kind of an asshole for admitting it, but American psycho was one of the funniest books I’ve ever read. There were certainly scenes that were gratuitously violent and absolutely ridiculous, but I loved it in the context of the absurdity of the rest of the book. It made sense to me and was very funny. I understand why a lot of people cannot take this book as a work of satire, and find it to be completely repugnant. But the satire hit really hard for me, and all of the gratuitous descriptions of clothing and food, along with the absurd violence and commentary on vapid yuppie culture were absolutely hilarious to me.",
        "created_utc": 1677817197,
        "upvote_ratio": 1.0
    },
    {
        "title": "did “My Dark Vanessa” cause anyone else to spiral??",
        "author": "katiebugladybug04",
        "url": "https://www.reddit.com/r/books/comments/11gqvgx/did_my_dark_vanessa_cause_anyone_else_to_spiral/",
        "text": "[removed]",
        "created_utc": 1677816747,
        "upvote_ratio": 1.0
    },
    {
        "title": "God, I am REALLY enjoying “IT”",
        "author": "Efficientqueen97",
        "url": "https://www.reddit.com/r/books/comments/11gquwt/god_i_am_really_enjoying_it/",
        "text": "I’m actually about to get up and start reading more of it, even though I have an exam tomorrow to study for. I am getting closer and closer to page 800… this is the longest book I have ever read, and of all the books I’ve read this school year, it is undeniably the novel wherein I am most excited to see how it will end. There are a lot of things going on in the book right now, and I really want to see how they all come together. The book is such a great mixture of intriguing/interesting and frightening. It is thought provoking - it is such a page turner, I am very interested in every character and really really have the desire to read this one each and every single night.",
        "created_utc": 1677816700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aries Nyght is pretty relatable",
        "author": "cflegel444",
        "url": "https://www.reddit.com/r/books/comments/11gquo9/aries_nyght_is_pretty_relatable/",
        "text": "[removed]",
        "created_utc": 1677816678,
        "upvote_ratio": 1.0
    },
    {
        "title": "Number9dream by Mitchell",
        "author": "ackthisisamess",
        "url": "https://www.reddit.com/r/books/comments/11gql59/number9dream_by_mitchell/",
        "text": "I just finished rereading this book after a long time not having read it.\n\nThis book is... a journey. So many different things seem to be going on, yet Mitchell, as per usual, manages to wind everything together in a beautiful (albeit slightly chaotic) way. The ending bit of the novel is particularly beautiful in my opinion.\n\nI also love all of Eiji's interactions with Ai, and Ai as a character.\n\nThis book also carries with it a kind of Murakami-esque feeling, and probably ressembles a Murakami book the most compared to all of Mitchell's reads, at least in my opinion (although it actually surprisingly lacks the magical realism element, compared to his (Mitchell's) other books, so in that way it doesn't necessarily parallel the style of Murakami's more magical realism type of reads. It is, however, very surrealistic in my opinion).\n\nThis post is a mess and I apologize .\n\n I'd be glad to read anyone else's thoughts about this book!",
        "created_utc": 1677815922,
        "upvote_ratio": 1.0
    },
    {
        "title": "ماهي مواصفات الماعز البور الشكلية «البوير, البورقوت , البورقت , boer g...",
        "author": "shrte",
        "url": "https://vt.tiktok.com/ZS8xNC1TS/",
        "text": "",
        "created_utc": 1677814988,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help Cleaning &amp; Repairing Older Books",
        "author": "wrentroquinine",
        "url": "https://www.reddit.com/r/books/comments/11gq940/help_cleaning_repairing_older_books/",
        "text": "So... pretty much what the title says. I picked up a book at the thrift store a couple weeks ago that was published in 1946--has a cloth binding, some gold lettering on the front, even if most of it's been worn away. I figured I could try to clean it up a bit and put it in a plastic bag for later, but didn't get around to it until about half an hour ago. Generally, it's in pretty good condition, but the cover was a bit sticky, so I went, hey, maybe I could just wipe it down for now!\n\nUnfortunately, however, I lack common sense. I tried to use a disinfecting wipe, and the only result thus far appears to be causing red ink from the cover to bleed all over and stain my hands. I am an innocent man, but look as if I've committed several heinous crimes. It doesn't appear to be damaged by my actions, but I... feel a bit as if I perhaps should not have done that, and like I should probably see it anyone else has any advice/experience with cleaning them? Several people have also informed me that I am going to die of lead poisoning because of the dye, and though I can't find any actual evidence of this, I am moderately concerned...? Any help is appreciated. ^^",
        "created_utc": 1677814962,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help",
        "author": "Tough-Ear-4093",
        "url": "https://www.reddit.com/r/books/comments/11gq579/need_help/",
        "text": "[removed]",
        "created_utc": 1677814646,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't find this book HELP!!",
        "author": "MundeMobius",
        "url": "https://www.reddit.com/r/books/comments/11gq4i8/cant_find_this_book_help/",
        "text": " \n\nI remember a book which my father recommended me to read when I was 8-10 years old. I can't remember the name of the book and author. I only have a vivid memory of its cover.\n\nThe cover was a colored drawing of several kids (around 7 or 8) walking on a steep cliff, there was also a goat and maybe a dog, I think. It was a kid's adventure book. And on the back cover, there were portraits of all those character and brief details about them.\n\nThat's all I know, please help me find out this book if you have any idea of what I'm talking about,",
        "created_utc": 1677814594,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help finding a Marty Robbins book titled \"The Small Man: A Novel of the Old West\"",
        "author": "bird_magnet",
        "url": "https://www.reddit.com/r/books/comments/11gpyqs/need_help_finding_a_marty_robbins_book_titled_the/",
        "text": "I am looking for a book by the singer Marty Robbins titled \"The Small Man: A Novel of the Old West\"\n\nThe only real information I can find online is a Google Books entry with barely any information and a WorthPoint page for one that was sold on eBay at one point.  \n\n\nI really like the song \"Ballad of a Small Man\" or just \"Small Man\" and I would love to read the whole story which I believe is in this book. I have even written my own story loosely based on it but I'm no professional author and I used ChatGPT which feels cheaty but I just wanted something to read that was similar.\n\nOr maybe if there is another book with a similar story that is obtainable, you could recommend it to me.\n\nAny information as to where I could maybe score a copy is greatly appreciated. Thanks for any help you can provide!",
        "created_utc": 1677814152,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to maintain and read books with serious OCD",
        "author": "KangarooCrusader",
        "url": "https://www.reddit.com/r/books/comments/11gpgec/how_to_maintain_and_read_books_with_serious_ocd/",
        "text": "This is an odd question that I couldn't really find any information on, but an important one nonetheless.\n\nHow do you maintain the state of your books, especially the edges of hardcover books, when living with serious obsessive compulsive disorder.\n\nThe past month or so I've bought some books on history, philosophy, and other important fictional works like The Lord Of The Rings. Reading them at home has been fine, but I dread bringing anything with me. It's especially apparent at the top and bottom of the spine of hardcovers, where it sometimes curls inwards.\n\nAt first I was rolling books up in sweaters, then a felt pouch from my headphones, but they still end up a little damaged.\n\nIs this something I should just learn to endure? Most hardcovers are about $50 where I live, but that doesn't seem expensive enough for it to remain a show piece and collect dust, yet still expensive enough that the most minute of scratches or marks seriously pains me.",
        "created_utc": 1677812729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bella Swan",
        "author": "yiool",
        "url": "https://www.reddit.com/r/books/comments/11gp78c/bella_swan/",
        "text": "[removed]",
        "created_utc": 1677812040,
        "upvote_ratio": 1.0
    },
    {
        "title": "There Is A Lot Of Talk About Censoring Books Flying Around Lately. What Books Are Being Censored &amp; Worth Picking Up Before The Content Is Changed From The Authors Original Version?",
        "author": "FuntivityColton",
        "url": "https://www.reddit.com/r/books/comments/11gp6b3/there_is_a_lot_of_talk_about_censoring_books/",
        "text": "[removed]",
        "created_utc": 1677811967,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the most oddly specific topic/subgenre that can be found in your book collection?",
        "author": "gonegonegoneaway211",
        "url": "https://www.reddit.com/r/books/comments/11gp4u0/what_is_the_most_oddly_specific_topicsubgenre/",
        "text": "I've always enjoyed browsing friend's bookshelves whenever I get the chance because it's like a mini-window into their interests. The last time I was reorganizing my own shelves I was a little surprised to realize that out of the general genres I had minisections for animal cognition, unusual YA perspectives on WWII, and several vampire anthologies. Have you ever found yourself collecting a very specific kind of book without realizing it?",
        "created_utc": 1677811851,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a detailed summary of Barkskins by Proulx",
        "author": "Oddment0390",
        "url": "https://www.reddit.com/r/books/comments/11gow92/looking_for_a_detailed_summary_of_barkskins_by/",
        "text": "[removed]",
        "created_utc": 1677811204,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the most oddly specific topic/subgenre that can be found in your book collection?",
        "author": "gonegonegoneaway211",
        "url": "https://www.reddit.com/r/books/comments/11gov5a/what_is_the_most_oddly_specific_topicsubgenre/",
        "text": "[removed]",
        "created_utc": 1677811113,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me ID this book I read 20 years ago",
        "author": "aimeed72",
        "url": "https://www.reddit.com/r/books/comments/11gome3/help_me_id_this_book_i_read_20_years_ago/",
        "text": "A YA fiction book about hidden Faery kingdom in amongst regular world. Pretty sure it was set in Minneapolis/St Paul. Typical girl meets faery Prince and falls in love but the faery Prince ride a motorcycle and also there was some sort of war in the land of the Fae happening. \n\nGood writing, better than my description would suggest. At least 20 years old, probably more.",
        "created_utc": 1677810462,
        "upvote_ratio": 1.0
    },
    {
        "title": "A swim in a pond in the rain by George Saunders",
        "author": "Life_Difference_4360",
        "url": "https://www.reddit.com/r/books/comments/11gok27/a_swim_in_a_pond_in_the_rain_by_george_saunders/",
        "text": "[removed]",
        "created_utc": 1677810281,
        "upvote_ratio": 1.0
    },
    {
        "title": "the picture of Dorian Gray analysis help",
        "author": "fznsy",
        "url": "https://www.reddit.com/r/books/comments/11gogeg/the_picture_of_dorian_gray_analysis_help/",
        "text": "Not sure if this is the right subreddit but oh well. In my dissertation im writing about the theme: corruption of influence which is apparent throughout. One great example ive found is that in the pretext to this story it quotes  “The critic is he who can translate into another manner or a new material his impression of beautiful things“ . Ive linked this with lord henry being the critic and the translation he gives of the paining is his attempts at corrupting Dorian. How am i able to expand on this?",
        "created_utc": 1677810001,
        "upvote_ratio": 1.0
    },
    {
        "title": "Museum issues appeal to save famed \"Misty of Chincoteague\" ranch from being sold to developers",
        "author": "ZebZ",
        "url": "https://www.delmarvanow.com/story/news/local/virginia/2023/03/01/museum-issues-appeal-to-help-save-home-of-misty-of-chincoteague/69950922007/",
        "text": "",
        "created_utc": 1677809531,
        "upvote_ratio": 1.0
    },
    {
        "title": "Arbitrum $ARB New Airdrop.",
        "author": "No_Start_2704",
        "url": "https://www.reddit.com/r/books/comments/11gnwwm/arbitrum_arb_new_airdrop/",
        "text": "[removed]",
        "created_utc": 1677808562,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are some modern literary novels with great plot?",
        "author": "hoooopladoooop",
        "url": "https://www.reddit.com/r/books/comments/11gnifz/what_are_some_modern_literary_novels_with_great/",
        "text": "[removed]",
        "created_utc": 1677807484,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a book like Arkady Martinez’s memory called empire",
        "author": "mushroomyqueen",
        "url": "https://www.reddit.com/r/books/comments/11gni70/looking_for_a_book_like_arkady_martinezs_memory/",
        "text": "[removed]",
        "created_utc": 1677807467,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me remember a book",
        "author": "Tread0816",
        "url": "https://www.reddit.com/r/books/comments/11gn7i0/help_me_remember_a_book/",
        "text": "[removed]",
        "created_utc": 1677806697,
        "upvote_ratio": 1.0
    },
    {
        "title": "Discipline is Destiny",
        "author": "eieireddit",
        "url": "https://www.reddit.com/r/books/comments/11gmwf7/discipline_is_destiny/",
        "text": "[removed]",
        "created_utc": 1677805879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Les Miserables",
        "author": "hangrybird1",
        "url": "https://www.reddit.com/r/books/comments/11gmmux/les_miserables/",
        "text": "[removed]",
        "created_utc": 1677805195,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can’t find the right translation for Les Miserables.",
        "author": "hangrybird1",
        "url": "https://www.reddit.com/r/books/comments/11gml0i/i_cant_find_the_right_translation_for_les/",
        "text": "[removed]",
        "created_utc": 1677805046,
        "upvote_ratio": 1.0
    },
    {
        "title": "Les Miserables. Can’t find the right translation.",
        "author": "hangrybird1",
        "url": "https://www.reddit.com/r/books/comments/11gmj26/les_miserables_cant_find_the_right_translation/",
        "text": "[removed]",
        "created_utc": 1677804903,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help I'm looking for a book I read as a kid",
        "author": "SleepingUmibozu",
        "url": "https://www.reddit.com/r/books/comments/11gmdf6/help_im_looking_for_a_book_i_read_as_a_kid/",
        "text": "So I thought that this book was one of the fairy books but I check them all and they didn't have the stories I've read.\n\nThe book was already broken when I read it sa Im not sure what the first story was but I remember clearly the contents were, but not in order.\n\n•Why the sea is salt\n•the emperor's New clothes (I looked this one up all I remembered about this was how this king bought invisible clothes)\n•snow queen\n•gingerbread man",
        "created_utc": 1677804495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Year One by Nora Roberts. I bought it used and found an “autograph” in the back. Is there anyway to find out whose it is?",
        "author": "faerygirl",
        "url": "https://www.reddit.com/r/books/comments/11gmam6/year_one_by_nora_roberts_i_bought_it_used_and/",
        "text": "[removed]",
        "created_utc": 1677804293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you \"see movies in your head\" while reading?",
        "author": "av3sta7",
        "url": "https://www.reddit.com/r/books/comments/11glgys/do_you_see_movies_in_your_head_while_reading/",
        "text": "[removed]",
        "created_utc": 1677802217,
        "upvote_ratio": 1.0
    },
    {
        "title": "Casper plus",
        "author": "HunterReady6000",
        "url": "https://sahelcard.com",
        "text": "",
        "created_utc": 1677801125,
        "upvote_ratio": 1.0
    },
    {
        "title": "kiss me kill me~ J.S Carol",
        "author": "Elfo14",
        "url": "https://www.reddit.com/r/books/comments/11gkx86/kiss_me_kill_me_js_carol/",
        "text": "I just finished this book and oh my god where do I start. You are on edge throughout the whole book, even at the end waiting for a plot twist or cliffhanger to come swooping in. There are so many twists and turns and it had me hooked the whole time. It took me about 3 to 4 days to finish and I've never been so sad to finish a book. That being said I can't give it at 10 out of 10. It does however get a 9 becasue it was damn close to perfect. The only thing I had a slight problem with was that the first 2 parts alternated between \"now\" and \"then\". I completley understand why the author did this, it shows a huge contrast on how things have changed especially in part one. But sometimes the now parts felt like something I HAD to complete just so I could move to the now sections I was hooked on. Eventually half way through those sections I was hooked just like the rest. I highly reccomend this read. Is thrilling, scary and you won't want to put it down. \n\nThe books does have a couple sensitive topics, the main one being domestic violence especially emotionally but also physically. And slight hints to rape. If you can't read these themes then this book isn't for you but if you can get past them it's one of my top reccomendations for sure!",
        "created_utc": 1677800928,
        "upvote_ratio": 1.0
    },
    {
        "title": "you're not Ready boy",
        "author": "No-Big-3019",
        "url": "https://youtube.com/shorts/cO5lD-6tezA?feature=share",
        "text": "",
        "created_utc": 1677800809,
        "upvote_ratio": 1.0
    },
    {
        "title": "Brain Rules. written by John Medina.",
        "author": "SomeoneRandom68",
        "url": "https://www.reddit.com/r/books/comments/11gkl5w/brain_rules_written_by_john_medina/",
        "text": "John Medina is a developmental molecular biologist and research consultant. He is an affiliate professor of bioengineering at the University of Washington School of medicine. He is also the director of of the brain center for applied learning research at Seattle Pacific university. He lives in Seattle, Washington. I've only just started reading this book but it is very fascinating and intriguing. I don't usually like to read but when it comes to things like this book, science,biology, etc. I usually become very interested. I deffinetly recommend this book to teens like me (prefer 15+18) only because it's super complex haha, it's really good. Def recommend. There's also a DVD you can buy but I prefer reading. You can find more info on this book at Www.brainrules.net if your curiouse.",
        "created_utc": 1677800229,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone summarize G.A Henty's \"When London Burned.\"",
        "author": "Feeling_Basil_1632",
        "url": "https://www.reddit.com/r/books/comments/11gkgnc/can_someone_summarize_ga_hentys_when_london_burned/",
        "text": "[removed]",
        "created_utc": 1677799994,
        "upvote_ratio": 1.0
    },
    {
        "title": "red",
        "author": "Naive_Ad1090",
        "url": "https://www.reddit.com/r/books/comments/11gkbuo/red/",
        "text": "[removed]",
        "created_utc": 1677799763,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some examples of retcons in a book series?",
        "author": "FruitTop",
        "url": "https://www.reddit.com/r/books/comments/11gk4mw/what_are_some_examples_of_retcons_in_a_book_series/",
        "text": "[removed]",
        "created_utc": 1677799440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why 'Ignition!' Should Be on Every Science Enthusiast's Reading List",
        "author": "something_nothing__",
        "url": "https://www.reddit.com/r/books/comments/11gk1su/why_ignition_should_be_on_every_science/",
        "text": "\"Ignition!\" by John D. Clark is a must-read for anyone interested in the history of rocket propellants. With witty anecdotes and accessible explanations, Clark takes you through the different types of rocket propellants and the people and events that shaped their development. You'll get a real sense of the personalities behind these technological achievements, and the book will leave you with a greater appreciation for the science and engineering behind space exploration. Whether you're a science enthusiast or just looking for an interesting read, \"Ignition!\" is definitely worth checking out.",
        "created_utc": 1677799324,
        "upvote_ratio": 1.0
    },
    {
        "title": "My dad wrote a children’s book and I illustrated it! Im really proud of it, anyone is free to check it out! :D",
        "author": "mranoneemoose",
        "url": "https://books.friesenpress.com/store/title/119734000264847197/Warren-Spence-The-Story-of-Chissa",
        "text": "",
        "created_utc": 1677799067,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best books with SHORT chapters",
        "author": "cperdue",
        "url": "https://www.reddit.com/r/books/comments/11gjttr/best_books_with_short_chapters/",
        "text": "[removed]",
        "created_utc": 1677799031,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to find Fantasy Comedy books",
        "author": "Downtown_Milk547",
        "url": "https://www.reddit.com/r/books/comments/11gjkix/how_to_find_fantasy_comedy_books/",
        "text": "I recently noticed that I enjoy comedies with fantastical, supernatural, magic realism, or sci-fi elements. I realised these recs would fall under the specific sub-genre ‘Fantasy Comedy.’ Fantasy Comedy is not as popularly defined as ‘dramedy’ for example, so it’s often hard to describe what I’m looking for. I also see other redditors asking for recommendations, but struggling to express what they mean. Fantasy Comedy is becoming more and more popular but doesn’t have a dedicated space for discussion and recommendation.\n\nSo I made r/FantasyComedy\n\nCome join if you, too, are a fan of this sub-genre, and would like to discuss and give/receive recommendations for funny and fantastical TV series, movies and books. It’s a place to chat about speculative fiction which makes us laugh. If you’re drawn into hilarious stories which question things like “how would vampires/zombies survive in this day and age?”, “what happens when we die?” or “what would happen if we all had superpowers?” then r/FantasyComedy is the place for you!",
        "created_utc": 1677798737,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the yearling, why is Penny forgiving to Jody?",
        "author": "aPaticulalySnazzyCat",
        "url": "https://www.reddit.com/r/books/comments/11gjfdb/in_the_yearling_why_is_penny_forgiving_to_jody/",
        "text": "[removed]",
        "created_utc": 1677798581,
        "upvote_ratio": 1.0
    },
    {
        "title": "Isaac Babel’s Red Cavalry: Set during the Polish-Soviet War of 1919–1920, Babel’s novel captured the indiscriminate violence and injustice of warfare.",
        "author": "drak0bsidian",
        "url": "https://daily.jstor.org/isaac-babels-red-cavalry/",
        "text": "",
        "created_utc": 1677798497,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help a homie out",
        "author": "witchx_mess",
        "url": "https://www.reddit.com/r/books/comments/11giixs/help_a_homie_out/",
        "text": "Hello, I need a little bit of help to find this book. I've been trying to find this book for about 2 years and still haven't found it.  \n\n\n(SPOILERS FOR THE MAIN PLOT OF THE BOOK)\n\nThis book is about a girl with pink dyed hair, she just moved in into a new town, and soon after her sister or friend, I honestly can't remember exactly, i just remember someone getting murdered, she starts to look into the murder to find who did it and why. The catch is that she sometimes passes out and, if you leave something of yours in contact with her hands when she passes out, she is able to tab into what you are doing, and see what you are doing. So she is using these powers to be able to find who murdered her sister/friend.\n\n&amp;#x200B;\n\nPLEASE i've been so desperate to find this book and i haven't been able to find it, I read this so many times when i was a kid and it belonged to my sister, I lost it in a school field trip and i want to get a copy for the both of us.",
        "created_utc": 1677797590,
        "upvote_ratio": 1.0
    },
    {
        "title": "SUggest me a book",
        "author": "JOKER_XDXX",
        "url": "https://www.reddit.com/r/books/comments/11giice/suggest_me_a_book/",
        "text": "[removed]",
        "created_utc": 1677797572,
        "upvote_ratio": 1.0
    },
    {
        "title": "epub link",
        "author": "blues_Goddess",
        "url": "https://www.reddit.com/r/books/comments/11gh25u/epub_link/",
        "text": "[removed]",
        "created_utc": 1677795993,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for books in their original languages - recommendations for where to shop?",
        "author": "oneunlitcandle",
        "url": "https://www.reddit.com/r/books/comments/11gggzj/looking_for_books_in_their_original_languages/",
        "text": "[removed]",
        "created_utc": 1677795370,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help finding this book",
        "author": "Rain5766",
        "url": "https://www.reddit.com/r/books/comments/11gg2kc/help_finding_this_book/",
        "text": "[removed]",
        "created_utc": 1677794929,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who are your 10 favourite novelists?",
        "author": "blue_strat",
        "url": "https://www.reddit.com/r/books/comments/11gfgxx/who_are_your_10_favourite_novelists/",
        "text": "[removed]",
        "created_utc": 1677794304,
        "upvote_ratio": 1.0
    },
    {
        "title": "What genre would I like",
        "author": "trnduhhpaige",
        "url": "https://www.reddit.com/r/books/comments/11gf9l9/what_genre_would_i_like/",
        "text": "[removed]",
        "created_utc": 1677794021,
        "upvote_ratio": 1.0
    },
    {
        "title": "Barnes &amp; Noble Changing Membership Program, Killing Educator Program",
        "author": "catagator",
        "url": "https://bookriot.com/barnes-noble-to-overhaul-membership-program-cut-free-educator-program/",
        "text": "",
        "created_utc": 1677792975,
        "upvote_ratio": 1.0
    },
    {
        "title": "what’s a shit your pants scary book but that’s not supernatural? i don’t fuck with ghosts haha",
        "author": "-sadphrog-",
        "url": "https://www.reddit.com/r/books/comments/11ges7z/whats_a_shit_your_pants_scary_book_but_thats_not/",
        "text": "[removed]",
        "created_utc": 1677792888,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone read “Saving 6” by Chloe Walsh?",
        "author": "Existing-Cable7487",
        "url": "https://www.reddit.com/r/books/comments/11ge69q/has_anyone_read_saving_6_by_chloe_walsh/",
        "text": "[removed]",
        "created_utc": 1677791499,
        "upvote_ratio": 1.0
    },
    {
        "title": "7 Habits of Highly Effective People: Keys to Success and Fulfilment - Qu...",
        "author": "Psychology_Ninja",
        "url": "https://youtube.com/watch?v=0BmS7vTxOiY&amp;feature=share",
        "text": "",
        "created_utc": 1677791309,
        "upvote_ratio": 1.0
    },
    {
        "title": "7 Habits of Highly Effective People: Keys to Success and Fulfilment - Qu...",
        "author": "Psychology_Ninja",
        "url": "https://youtube.com/watch?v=0BmS7vTxOiY&amp;feature=share",
        "text": "",
        "created_utc": 1677791260,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Charles Mingus' autobiography a former New Orleans stripper makes a remark I cannot figure out.",
        "author": "halftimeatthegarden",
        "url": "https://www.reddit.com/r/books/comments/11gdz22/in_charles_mingus_autobiography_a_former_new/",
        "text": "[removed]",
        "created_utc": 1677791031,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some good, fast-paced, second person POV, genre fiction novels?",
        "author": "wildly-bored123",
        "url": "https://www.reddit.com/r/books/comments/11gdx1a/what_are_some_good_fastpaced_second_person_pov/",
        "text": "[removed]",
        "created_utc": 1677790900,
        "upvote_ratio": 1.0
    },
    {
        "title": "the authors voice. before, after.",
        "author": "CoastalSailing",
        "url": "https://www.reddit.com/r/books/comments/11gd9zk/the_authors_voice_before_after/",
        "text": "Has anyone else had this experience?\n\nYou read a novel, maybe a few from an author. The language is shaped in your own head with it's own rhythms and flow. And you become enamored with the book, so you go online, learn about the author, and then, mistake! Mistake!\n\n\nYou listen to them do a reading.\n\n\nAnd suddenly, the crystal palace of the prose in your own mind, the ear turns, cracks appear, and what was once incandescent becomes, worst case, banal.\n\nThey pause where you wouldn't pause, emphasize what you wouldn't emphasize.\n\n\nI'm talking worst case scenario here, but it's never the same. At least for me. \n\n\nThis isn't universal, but there are a particular few where I wish I'd never listened to the author do a reading. Just so I wouldn't have the echo of their voice in my head as I read.\n\n\nCan anyone relate to this?",
        "created_utc": 1677789425,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rainbow six siege shorts",
        "author": "Ok-Barber397",
        "url": "https://youtube.com/shorts/GgypuSe9IAs?feature=share",
        "text": "",
        "created_utc": 1677789181,
        "upvote_ratio": 1.0
    },
    {
        "title": "What year dictionary should I buy that has definitions before everything went \"woke\"?",
        "author": "luffin_life",
        "url": "https://www.reddit.com/r/books/comments/11gcgrl/what_year_dictionary_should_i_buy_that_has/",
        "text": "[removed]",
        "created_utc": 1677787567,
        "upvote_ratio": 1.0
    },
    {
        "title": "ACOTAR or Mistborn",
        "author": "zepenbread",
        "url": "https://www.reddit.com/r/books/comments/11gc57s/acotar_or_mistborn/",
        "text": "Hey guys. So, i'm about to get a fantasy series to read and i dnt know which one should i go for.. i heard good things about ACOTAR but im scared it wont live up to the hype. But i also am intigued by Mistborn bc i need a break from all the YA reads. \n\nWhich series is better in ur opinion? And if u think both, what should i start with?",
        "created_utc": 1677786827,
        "upvote_ratio": 1.0
    },
    {
        "title": "A book about the history of autism?",
        "author": "theformerorphan",
        "url": "https://www.reddit.com/r/books/comments/11gc1oo/a_book_about_the_history_of_autism/",
        "text": "Hi, all!\n\nObligatory apologies for any formatting issues—I’m on mobile.\n\nI’m looking for a book or two about the history of autism. As in, throughout time &amp; across cultures. Like how did different people in different time periods see it, and how did they treat autistic kids/adults?\n\nAny titles welcome :) thank you!\n\nFYI: I don’t like “autism speaks” as an organization, if that helps inform you about the kind of text I wouldn’t like. Aka, I don’t want the author to have some clear bias about autism being a “disease” to be “cured.”",
        "created_utc": 1677786592,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guilty Pleasure Books",
        "author": "530SSState",
        "url": "https://www.reddit.com/r/books/comments/11gbwq7/guilty_pleasure_books/",
        "text": "What are your \"guilty pleasure\" books?\n\nWhat are the books (and/or authors) that you enjoy even though they're silly, or badly written, or have plot holes in them, or aren't considered \"serious literature\"?\n\nMaybe they have wonderful descriptions, or a character you identify with, or maybe you just associate them with a particularly good time in your life when you first read them -- but what books do you love despite their flaws and go to like they're comfort food?",
        "created_utc": 1677786270,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know where to find a Russian book translated to english.",
        "author": "Sensitive-Ad-1531",
        "url": "https://www.reddit.com/r/books/comments/11gbw09/does_anyone_know_where_to_find_a_russian_book/",
        "text": "[removed]",
        "created_utc": 1677786220,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can an author in future prove their work is written by humans instead from AI?",
        "author": "uswhole",
        "url": "https://www.reddit.com/r/books/comments/11gbaix/how_can_an_author_in_future_prove_their_work_is/",
        "text": "Assume a future AI is improve so much that can write \"better\" books than human can.  I am sure there will still be people try to write books in and people enjoy read human created content in future. Even if they become a small niche community. However, outside of \"trust\" there not much a reader can do to tell it apart from AI.\n\nIt ready happens now with art where people accusing artist using AI when they did not and when people use AI and use filter and control net to remove AI artifacts then sold it in store say they drew it themselves. But for now at least artist can stream their process to \"prove\" they drew it. they would show line art ect ect. It might hold off for few years until the only way to prove your drawing is through real witnesses. You can't really do it with books because you going to spoil to everyone. \n\nhow can a writer like in 20-40  years from now insure their reader that their text is from human (mostly). Not just from a prompt",
        "created_utc": 1677784832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good audio book for 8-hour drive.",
        "author": "NiceTryBush",
        "url": "https://www.reddit.com/r/books/comments/11gba6q/good_audio_book_for_8hour_drive/",
        "text": "[removed]",
        "created_utc": 1677784813,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where the Crawdad’s Sing - illustrations",
        "author": "East_Competition_349",
        "url": "https://www.reddit.com/r/books/comments/11gb9ax/where_the_crawdads_sing_illustrations/",
        "text": "[removed]",
        "created_utc": 1677784755,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for good sci fi books",
        "author": "doogybot",
        "url": "https://www.reddit.com/r/books/comments/11gb8bk/looking_for_good_sci_fi_books/",
        "text": "[removed]",
        "created_utc": 1677784689,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Whale by Samuel D. Hunter",
        "author": "voirloup",
        "url": "https://www.reddit.com/r/books/comments/11gb8ak/the_whale_by_samuel_d_hunter/",
        "text": "Read this in an hour and a half this afternoon and it was heartbreaking. I bought it after seeing the movie, as I wanted to have a paper form of this story. I don't know if there was ever a more accurate representation of a piece in cinema, it was perfect, I loved Charlie and it broke my heart.\n\nWhat did you think of it ?",
        "created_utc": 1677784688,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone explain why Asimov? Foundation was a bit of a slog.",
        "author": "OpanDeluxe",
        "url": "https://www.reddit.com/r/books/comments/11gawjn/can_someone_explain_why_asimov_foundation_was_a/",
        "text": "Would love to hear some alternative angles on why Asimov holds such a legendary position as a fiction author. I read Foundation after seeing some emphatic suggestions here, and really found it a slog. It seemed obsessed/fascinated with its own theories of economic downfall - instead of its characters. Characters felt like a delivery vehicle for these theories. Dialog was unnatural. Characters established/discarded rapidly.\n\nPerhaps this is unfair and it's more about the context with which it was written. And everything which came after it...?\n\nIs Asimov's fiction really his highest achievement? Or is it that he was all these things - a polymath - and a sheerly prolific writer... and it's more of a cumulative effect which determines his status.\n\nIt occurs to me that this is something written by a scientist who doesn't really grasp the emotional requirements of fiction... but Clarke was an esteemed scientist and I find his writing absolutely riveting emotionally.\n\nAny and all thoughts welcome!",
        "created_utc": 1677783922,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the deal with the second part of McCammon’s Swan Song?",
        "author": "Armadillus34",
        "url": "https://www.reddit.com/r/books/comments/11ganad/what_is_the_deal_with_the_second_part_of/",
        "text": "I just finished swan song and after googling I was happy that there is a second part. But it seems to be nearly impossible to get a paperback version of it. I decided to look for an English version, but looks like it’s even harder to find one. On some book sites or Wikipedia it isn’t even listed as one of McCammon works. The translated name of the book in German is “Swans Song - Book 2: The scarlet eye” (Das scharlachrote Auge). Was released on 14th June 2015 if Amazon is right. \nNo story spoilers please and thanks in advance!",
        "created_utc": 1677783323,
        "upvote_ratio": 1.0
    },
    {
        "title": "any books on recovering from solitary confinement?",
        "author": "sffffargalbootoo",
        "url": "https://www.reddit.com/r/books/comments/11gan4h/any_books_on_recovering_from_solitary_confinement/",
        "text": "[removed]",
        "created_utc": 1677783314,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Free Ebook] Generate money using these 11 Top Side Hustles for 2023 (Side Hustle Success)",
        "author": "el-chadi",
        "url": "https://elsaiyan.gumroad.com/l/sidehustlesuccess",
        "text": "",
        "created_utc": 1677783235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interesting things",
        "author": "IndividualVehicle195",
        "url": "https://money-easilyojy.buzz/76637878272410/?s=rd",
        "text": "",
        "created_utc": 1677782451,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts about daisy jones series",
        "author": "nmsaper",
        "url": "https://www.reddit.com/r/books/comments/11ga6yk/thoughts_about_daisy_jones_series/",
        "text": "I read daisy jones in the middle of 2022, was my first Taylor Jenkins Reid book, followed by the huge success Evelyn Hugo. I really like the history, your interview format left me totally immersed in the 70s, but i don’t know what expect for the prime adaptation. \n\nI mean, Sam Claflin is unanimously a perfect Billy Dune, and Daisy so close to her face in the cover of the book, the songs are gready as well. My fear is that they focus too much on a love triangle(Camila billy daisy) forgetting the essence of the book, a rock band living together the delusions of being more famous than your music.",
        "created_utc": 1677782223,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oxford handbook of Catholic theology",
        "author": "es18x",
        "url": "https://www.reddit.com/r/books/comments/11ga60t/oxford_handbook_of_catholic_theology/",
        "text": "Does anyone have a copy of the Oxford  handbook of Catholic theology? Protestant friend has a copy of Martin Luther’s theology and found Oxford makes one for Catholic theology. I can’t find anyone talking about it on the subreddit or internet at large wanting to know before I commit to buying because it is so expensive.\n\nThank you in advance!",
        "created_utc": 1677782157,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should we organize our library by Author or by Category?",
        "author": "crepuscopoli",
        "url": "https://www.reddit.com/r/books/comments/11g9y4g/should_we_organize_our_library_by_author_or_by/",
        "text": "# \n\nHi there guys!  \nI  would like to organize my library. would it be better to organize the  library per author or by category? For example, I have JK Rowling  novels, but also Harry Potter artbooks. Should I separate those two in 2  categories, novels and artbooks, or should I group into JK Rowling  shelf space?\n\nI am a visual artist and I am trying to make the best of my library.\n\nFor  example I do collect biographies, manuals, artbooks, manga, comics,  novels, scienfitic papers, etc. For a single artist, it happened that I  have 5 categories of his works.\n\nPlease tell me which it would be the best way :)",
        "created_utc": 1677781613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Africanus (Santiago Posteguillo) Que pasó con la mini serie que estaba en desarrollo?",
        "author": "B3RN4RD00",
        "url": "https://www.reddit.com/r/books/comments/11g9uhq/africanus_santiago_posteguillo_que_pasó_con_la/",
        "text": "[removed]",
        "created_utc": 1677781366,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stephen King - The Stand - links to \"The Second Coming\" by William Butler Yeats",
        "author": "ChronicCrit",
        "url": "https://www.reddit.com/r/books/comments/11g9it7/stephen_king_the_stand_links_to_the_second_coming/",
        "text": " \n\nSo today I finished reading Stephen King's The Stand today and loved it. My favourite character is definitely Glen Batemen and Tom Cullen, laws Yes! Anyway I reread the poem The Second Coming by William Butler Yeats which is mentioned by Starkey in the beginning of the book. It seems like almost every line has a deep relation to events that occur in the book and I thought this was fascinating so heres my thoughts:\n\n&amp;#x200B;\n\n&gt;Turning and turning in the widening gyre  \nThe falcon cannot hear the falconer;\n\n* This suggests humans are unable to hear gods messages to them in modern times and are disconnected from religion, this is referenced a few times throughout the book.\n\n&gt;Things fall apart; the centre cannot hold;\n\n* The idea the destruction of the world occured because of our modern habits that are opposed to nature such as pollution and waste. This is also referenced a few times in the book.\n\n&gt;Mere anarchy is loosed upon the world,  \nThe blood-dimmed tide is loosed, and everywhere  \nThe ceremony of innocence is drowned;\n\n* This references the death of possible billions and the idea that captain trips destroyed all characters physically and mentally, completely upending there life. While forcing them, like Nick sending Tom Cullen away, to make tough decisions.\n\n&gt;The best lack all conviction, while the worst  \nAre full of passionate intensity.\n\n* This relates to how many of the good characters like Stu, Larry and Nick have no passion to lead but are forced into that position due to circumstance and their character. This contrasts with Randall Flagg's inherent anger and fury at the east and his need for death and destruction.\n\n&amp;#x200B;\n\n&gt;Surely some revelation is at hand;  \nSurely the Second Coming is at hand.\n\n* This links to the idea that captain trips was viewed intially by some, like Nadine as some heavenly judgement and condemnation of the actions of humanity.\n\n&gt;The Second Coming! Hardly are those words out  \nWhen a vast image out of Spiritus Mundi  \nTroubles my sight: somewhere in sands of the desert\n\n* Here \"Spiritus Mundi\" is reffering to a collective conciousness, this seems similiar to the almost universal dreams of evil (and good) that almost all the characters subconciously share.\n\n&gt;A shape with lion body and the head of a man,  \nA gaze blank and pitiless as the sun,\n\n* This clearly relates to the represantation of Randall Flagg as a thin human shell over some sort of pure evil demonic form, which is visible through his eyes. The lion body represents his fury, power and threating nature.\n\n&gt;Is moving its slow thighs, while all about it  \nReel shadows of the indignant desert birds.\n\n* This immediatly suggests death as a dying body is watched by birds waiting to peck at the corpse. But also this links to the references of crows and how Flagg's control of them to achieve his malcious goals.\n\n&gt;The darkness drops again; but now I know  \nThat twenty centuries of stony sleep  \nWere vexed to nightmare by a rocking cradle,\n\n* Babies are mentioned very often throughout the book, like at the end where Fran's son Peter is almost like the start of a new age.\n\n&gt;And what rough beast, its hour come round at last,  \nSlouches towards Bethlehem to be born?\n\n&amp;#x200B;\n\n\\*I don't know much about religion and poetry but I enjoyed the poem and thought the connections I saw were intresting enough to share. I will enjoy hearing your thoughts!",
        "created_utc": 1677780541,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to start with classics?",
        "author": "CatLady0904",
        "url": "https://www.reddit.com/r/books/comments/11g98iu/where_to_start_with_classics/",
        "text": "[removed]",
        "created_utc": 1677779881,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Arctic Night",
        "author": "Doncan67",
        "url": "https://www.reddit.com/r/books/comments/11g8u85/one_arctic_night/",
        "text": "[removed]",
        "created_utc": 1677778916,
        "upvote_ratio": 1.0
    }
]