[
    {
        "title": "looking for new book to read",
        "author": "TheoryBrief9375",
        "url": "https://www.reddit.com/r/books/comments/11g8qf3/looking_for_new_book_to_read/",
        "text": "[removed]",
        "created_utc": 1677778662,
        "upvote_ratio": 1.0
    },
    {
        "title": "Penguin Random House Announces New Leadership After a Turbulent Period",
        "author": "davster39",
        "url": "https://nyti.ms/3Z66mjz",
        "text": "",
        "created_utc": 1677778652,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any recommendations for fantasy books that take place in an enchanted forest?",
        "author": "One_Mat_Army",
        "url": "https://www.reddit.com/r/books/comments/11g8iz0/any_recommendations_for_fantasy_books_that_take/",
        "text": "[removed]",
        "created_utc": 1677778162,
        "upvote_ratio": 1.0
    },
    {
        "title": "A stranger has sent me 2 books now…. within 2 weeks.",
        "author": "yungara1",
        "url": "https://www.reddit.com/r/books/comments/11g87c1/a_stranger_has_sent_me_2_books_now_within_2_weeks/",
        "text": "in less than 2 weeks I have received 2 soft cover books in my College PObox. \n\nthese books were addressed to me. for record, a campus address looks something like this \n\nYour name \nYour Campus \nbox number \nYour city, state 12345\n\nThe person who has sent me this has my whole address and even got the correct box number. I get a new box every year from my university, and no one has my box number except me and my boyfriend. the first book was a book about how to be a man from Amazon. no return address available. the second book I received today is “Finding Fish” from Superbookdeals. I emailed them today and asked if they can give me a first name from the billing address so I can see who it is. \n\nI should add that my boyfriend said it wasn’t his doing. I take no classes that require me to buy a regular book like this, and I don’t read for enjoyment. I checked all my bank cards and there’s no charges for a subscription of any sort. \n\ndo you all think I should take this seriously? or just deem it a simple accident? it’s quite hard to find access my campus address bc my university keeps everything private. i’m getting a little creeped out but I don’t want to over think it.",
        "created_utc": 1677777373,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strip ili Crtani film: Jabuke ... - STRIPOVI",
        "author": "besplatnioglas",
        "url": "https://knjigeudzbenicicasopisistripovi.infooglasi.rs/strip-ili-crtani-film-jabuke-stripovi/?feed_id=4400&amp;_unique_id=6400d9d7985c3",
        "text": "",
        "created_utc": 1677777368,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unpopular opinion on Holden Caulfield.",
        "author": "wilde_folklore66",
        "url": "https://www.reddit.com/r/books/comments/11g7qmu/unpopular_opinion_on_holden_caulfield/",
        "text": "[removed]",
        "created_utc": 1677776301,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do people still purchase and read Stephen King books?",
        "author": "QuirkyHalf7255",
        "url": "https://www.reddit.com/r/books/comments/11g74si/why_do_people_still_purchase_and_read_stephen/",
        "text": "When I first started reading I went with Stephen King because I loved horror movies and creepy things in general so it seemed right up my alley. But after reading more and more... I'm disgusted by this man. The constant oversexualisation of women is so unnecessary, and it's a thing in almost all of his books where he's describing body's and boobs and stuff like that and it's not even a sex scene they're just...exsisting, the mother in pet cemetery for example? Why???? and the sheer  pedophilia of IT where he described 11 year old Betty's nipples getting hard cause she got scared and how she was no longer a woman cause her boobs are growing. Don't even get me started on the orgy scene. I don't care if he was on cocaine nothing can justify the amount of disgusting things he's said in almost all of his books.",
        "created_utc": 1677774831,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do people still purchase and read read Stephen King books ?",
        "author": "QuirkyHalf7255",
        "url": "https://www.reddit.com/r/books/comments/11g73s1/why_do_people_still_purchase_and_read_read/",
        "text": "When I first started reading I went with Stephen King because I loved horror movies and creepy things in general so it seemed right up my alley. But after reading more and more... I'm disgusted by this man. The constant oversexualisation of women is so unnecessary, and it's a thing in almost all of his books where he's describing body's and boobs and stuff like that and it's not even a sex scene they're just...exsisting, the mother in pet cemetery for example? Why???? and the sheer  pedophilia of IT where he described 11 year old Betty's nipples getting hard cause she got scared and how she was no longer a woman cause her boobs are growing. Don't even get me started on the orgy scene. I don't care if he was on cocaine nothing can justify the amount of disgusting things he's said in almost all of his books.",
        "created_utc": 1677774764,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am almost done with east of eden. Here are my thoughts",
        "author": "soulmaker_",
        "url": "https://www.reddit.com/r/books/comments/11g6vzd/i_am_almost_done_with_east_of_eden_here_are_my/",
        "text": "Ok so theres around a 100 pages left and i Think ill make another post when im done with it to see how i feel then too. But heres the thing, east of eden is different from what im used to, i usually read modern novels and so east of eden was a bit of a difficult read at times. I feel the main thing thats got me thru it is the amount of ppl who call it their 'fav book of all time'. id love to hear what you rlly liked about the book. I wont lie i do like the boy, took me a while to get into it but i am now. A few phrases or dialogues have definitely stuck with me and you can tell its the work of a polished author. what r ur thoughts?",
        "created_utc": 1677774234,
        "upvote_ratio": 1.0
    },
    {
        "title": "Snow Crash is simultaneously one of the funniest and and most interesting SF books I've ever read. I am still trying to wrap my head around how it manages to be both hilarious and have such big (and fun) ideas about tech, the future, religion, and language. Check it out if you haven't read it yet!",
        "author": "brent_323",
        "url": "https://www.reddit.com/r/books/comments/11g6pul/snow_crash_is_simultaneously_one_of_the_funniest/",
        "text": "I was nervous to read Snow Crash again because it was a really impactful book for me in high-school. If anything, it was even better than I remembered - the action and big tech ideas had stuck with me, but I'd forgotten how funny this book is!\n\n**Here's the setup** (back of the book style, but in spoiler tags in case you like to go in totally blind)**:** &gt;!Hiro Protagonist (yes, you read that right - the book really isn't trying to take itself too seriously) is a self-described hacker working as a pizza-delivery driver and living in a storage unit at LAX.!&lt;\n\n&gt;!He lives in a US that has been fully corporatized - from Judge Bob’s Judicial System to Pastor Wayne’s Pearly Gates.!&lt;\n\n&gt;!To get away, Hiro spends much of his free-time in the Metaverse, where he wrote many of the subroutines that underpin the virtual world. One of his hacker friends, Da5id, is given a new virtual drug called Snow Crash that not only crashes his computer, but also destroys his brain in the real world. Hiro (and a hilarious cadre of friends) are drawn ever deeper into the worldwide conspiracy that is spilling out of the virtual world to threaten the real world.!&lt;\n\nThere are so many things about this book I love, but I’ll try to pick just a few to highlight:\n\nFirst, the big tech ideas that stuck with me over the twenty years since I read it the first time. It has the most fun and engrossing description of a VR world that I've read so far - it's everything *Ready Player One* was trying to be and so much more. It even coined the term Metaverse! Then there is the skateboard with smart wheels that adjusts to the terrain so you can skate right over potholes (or even down a forested hillside). A nuclear-powered gatling gun in a suitcase. And so, so many others.\n\nThe narrative voice is also amazing and truly unique. Humor rare in sci-fi, but this book shows that it can be done really successfully. The narrator establishes the general satirical tone, but it also adjusts to match whichever character it's currently following. That match of narrative voice to character brings us into the world in a much deeper way, and is also a big part of making all characters so likeable and fun. Are they burnouts or are they superheroes? Why not both!\n\nOne watch out - there is one cringe-inducing section of the book where one of the main characters, who is 15, gets sexually involved with an adult. Its a bad guy who is pursuing her, so presumably Neal Stephenson would say it was part of establishing him as evil - but it still feels like it could have been avoided without taking anything away from the book.\n\nFinally, the 'big idea' underneath the novel is really interesting. I won't spoil anything, but let's just say its about the intersection of language, religion, and ideas as viruses and potential tools of control. The actual details of how Snow Crash itself works in the book are a little ridiculous, but given the overall ridiculous tone of the novel it totally fits, and doesn't take away from the very-thought provoking big idea.\n\nIf you haven't read it, check it out - you're in for such a fun, wild ride!",
        "created_utc": 1677773820,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mystery Books",
        "author": "ForeignPhotograph880",
        "url": "https://www.reddit.com/r/books/comments/11g6hu4/mystery_books/",
        "text": "[removed]",
        "created_utc": 1677773281,
        "upvote_ratio": 1.0
    },
    {
        "title": "Name that book",
        "author": "dilpan7",
        "url": "https://www.reddit.com/r/books/comments/11g6dm6/name_that_book/",
        "text": "Hi hope this is the right place to post this. I’m trying to remember the name of a book I read in the mid to late 70’s. It was about a detective getting deep into satanic worshipping as part of an investigation. The cover was an over shoulder shot towards a man wearing the full robes and goats head. \nI seem to recall something about a billion dollar brain but that might just be the sands of time fogging my memory. \nWasn’t a big author, pretty cheesy as I recall\nAny help appreciated",
        "created_utc": 1677773000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stephen King - The Stand - links to \"The Second Coming\" by William Butler Yeats",
        "author": "ChronicCrit",
        "url": "https://www.reddit.com/r/books/comments/11g6djj/stephen_king_the_stand_links_to_the_second_coming/",
        "text": "[removed]",
        "created_utc": 1677772996,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else throw away dust jackets? Or am I just a monster?",
        "author": "bomberdog1000",
        "url": "https://www.reddit.com/r/books/comments/11g5yyn/anyone_else_throw_away_dust_jackets_or_am_i_just/",
        "text": "[removed]",
        "created_utc": 1677772035,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any books that are both obscure and controversial?",
        "author": "ScrollingDegenerate",
        "url": "https://www.reddit.com/r/books/comments/11g5y8s/is_there_any_books_that_are_both_obscure_and/",
        "text": "For some reason every time I try to go on a deep dive to find something extremely controversial or anything that just disagrees with me in general it always shows the same books. Boroughs, Nabakov, etc. \nThe only one book that I’ve found to be partially obscure and highly controversial is The Story of the Eye by George Battalie. \nI want to know books that are truly condemned and despised- pulling from shelves, libraries, burning, cover ups. That kinda stuff. Although it’s important for controversial books to be wildly successful as they are, I think there’s books out there that have been covered up; to not be discovered by anyone. So does anyone know anything along those lines? It doesn’t have to follow it exactly just something along the lines of controversy yet not widely known.",
        "created_utc": 1677771985,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone know any obscure books that are controversial?",
        "author": "ScrollingDegenerate",
        "url": "https://www.reddit.com/r/books/comments/11g5l5j/anyone_know_any_obscure_books_that_are/",
        "text": "[removed]",
        "created_utc": 1677771105,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books",
        "author": "Summer_flower2005",
        "url": "https://www.reddit.com/r/books/comments/11g58qu/books/",
        "text": "[removed]",
        "created_utc": 1677770261,
        "upvote_ratio": 1.0
    },
    {
        "title": "Audio Book Apps?",
        "author": "Tigalabs",
        "url": "https://www.reddit.com/r/books/comments/11g56bi/audio_book_apps/",
        "text": "[removed]",
        "created_utc": 1677770082,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Compleat Angler, Hemingway, and how he made me do stupid things",
        "author": "Le_Rat_Mort",
        "url": "https://www.reddit.com/r/books/comments/11g4thd/the_compleat_angler_hemingway_and_how_he_made_me/",
        "text": "The 17th anniversary of the fire that destroyed Hemingway's Bahamian hideaway came and went without much ado last month, but it did spark memories of the events that took me there for a brief moment shortly before it was lost.\n\n[For those unfamiliar with the place, it was a quaint island hotel-bar on the tiny island of Bimini.](https://i.imgur.com/YKA0T3W.jpg) Hemingway was a long term guest during the mid 1930's, and it is said to have been the birthplace of *To Have and Have Not*. It was there that *Papa* had a standing offer of ten dollars to any local that could last two rounds in the ring with him, and there that \"every day is a holiday, unless you call fishing work\".\n\nMy journey with Hemingway as something of a de-facto spiritual guide began with a dog-eared copy of *A Farewell to Arms*, which I devoured, then slept poorly, then promptly marched off to the enlistment office the next morning. Fast forward a couple of memorable years serving in a foreign army, and I was stepping onto a yacht as an army \"adventure training\" instructor, with a global circumnavigation on the itinerary. The mission was to take a bunch of land-loving infantry soldiers around the world and teach them something along the way of surviving challenging environments. Yes, a bit of a farce given most had already survived the battlefields of Iraq and Afghanistan. \n\nThe crew was a mixed bag of decorated heroes, miscreants and ass-kissers, much like any platoon. They were selected as either a reward for exemplary service, or to be forgotten of for a few months for execrable service - whichever their commanding officer deemed most beneficial to the battalion, it seemed. One was awarded the second highest military medal for bravery. Another jumped ship with a \"*fuck you!*\" for a girl he met the night before while we were in a foreign port, never to be seen again.\n\nLife on a 70ft yacht is one of extremes. Weeks at sea are routine to the point madness, punctuated by brief moments of sheer terror. Books and sleep are your only escape from the close-quarters living, and it was on that galley bookshelf that Hemingway found me again. James R. Mellow's biography *Hemingway: A Life Without Consequences* became something of a bible to me over the next twelve months at sea. Between battling Southern Ocean swells in the Roaring Forties and cyclones in the Furious Fifties, I'd pore over details of Papa's life. Rounding Cape Horn and Good Hope, I searched for clues as to what made and unmade the man. By the time we docked in Rio de Janeiro, I must've read the book cover-to-cover three or four times. My first mate overheard me talking about Bimini and the Gulf Stream as we plotted our route through the Caribbean and the Bahamas, and suggested we make a stop there before pushing through to New York. I wasn't going to argue. Looking back, it was a truly kind thing for him to do. I think he understood how much Hemingway's story had sustained me during those long months at sea.\n\nSo as we bounced between the islands on our journey north, the plan to dock at Bimini seemed straight forward enough. The tidal charts told us we would have plenty of water under the keel when entering the port. Except we didn't. We stuck fast on a sand bar that wasn't supposed to exist, dangerously close to rocks. We blew the gearbox trying to motor off the bar and lost our escape window as the tide fell away and the boat inched towards the rocks with each swell. Things were looking desperate. \n\nWith nothing left to do until the next high tide and a tow from a tug boat, the call was made to abandon ship. It was fifty-fifty the yacht would still be in one piece by the next morning. \n\nThe Compleat Angler called. \n\nExhausted and emotionally drained, I walked with the crew to the Angler. The conflicting feelings of guilt that my Hemingway fascination had inadvertently doomed us, and that I was also about to walk on hallowed ground, is what I remember most. A couple of island kids were sitting on the top balcony outside Papa's favorite room, legs dangling between the railings. Standing behind the bar was owner Julian Brown, who sadly died in the fire a few months later. Mr Brown was patient with me as I wandered about the place, peppering him with trivial questions. The walls were a canvas of photos, newspaper articles and pictures. Early editions of Hemingway's books sat on shelves, alongside seventy years of related ephemera. It was a perfect mess. \n\nI don't think I found Hemingway's ghost there, but there was certainly an echo of him about the place. Much had changed, but what was left was still the same. I remember asking Mr Brown where the jetty was that *Pilar* called home, and he waved me away with \"it's gone. It's all gone\". Over the years, I've thought about what he meant by that. I think he was just tired of people chasing ghosts. \n\nThat night is something of a blur. We slept on the rocky ground by the mouth of the marina, anesthetized by the Angler's rum. A group of those miscreants I mentioned stole a golf cart and drove it off a jetty into the sea like a ritual sacrifice. The island's only policeman was happy to blame it on unknown American college kids rather than instigate an international incident with a boatload of soldiers.\n\nDuring the night, the yacht had shifted to within a couple of feet of the rocks. We managed to bribe a couple of powerboat owners to tow us off the bar, which was something of a miracle in itself. With lines running from mast and bow, they pulled simultaneously, dragging us off the bar heeled over at forty-five degrees with minutes to spare. Under sail, we eventually made it to Fort Lauderdale for repairs to the gearbox, which turned into a two week wait for parts during Spring Break. The soldiers weren't bothered. \n\nNearly twenty years later, I still wonder what Hemingway would've thought about the adventure he inspired. It's a tragedy that the Compleat Angler was lost, but I'm just so grateful to have seen it. It's occurred to me that I perhaps wasn't present enough living my own adventure while re-living Hemingway's, but great books and those that write them can inspire us to write our own adventures too, I reckon.",
        "created_utc": 1677769167,
        "upvote_ratio": 1.0
    },
    {
        "title": "Closure¿",
        "author": "Cold_coffee_addict",
        "url": "https://www.reddit.com/r/books/comments/11g4l43/closure/",
        "text": "[removed]",
        "created_utc": 1677768547,
        "upvote_ratio": 1.0
    },
    {
        "title": "Slow Burn by Bobby Adair",
        "author": "Sparrowflop",
        "url": "https://www.reddit.com/r/books/comments/11g3y14/slow_burn_by_bobby_adair/",
        "text": "Has anyone else read through this series? I picked up the box set for my commute (to listen to), the description made me envision the main character having some type of 'zombie powers', but about half through the first book, I guess it's just a traditional zombie survival novel?\n\nIt has a fair take on the source, and the main characters seem well written so far, but I'm so 'generic zombie' fatigued I can't really invest in it, unless something changes as far as power-creep goes.\n\nDoesn't feel like it's doing anything Last of Us didn't do better (the game - I haven't had time to watch the show yet).",
        "created_utc": 1677766830,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books about gratitude",
        "author": "H4shir4m4",
        "url": "https://www.reddit.com/r/books/comments/11g3wku/books_about_gratitude/",
        "text": "[removed]",
        "created_utc": 1677766727,
        "upvote_ratio": 1.0
    },
    {
        "title": "Almost through with Tomorrow and Tomorrow and Tomorrow by Gabrielle Zevin, and one of the scenes she’s written has devastated me and is living rent free in my head, help.",
        "author": "brooke_157",
        "url": "https://www.reddit.com/r/books/comments/11g3ut7/almost_through_with_tomorrow_and_tomorrow_and/",
        "text": "I really did not expect to react this intensely to any of these characters or what has happened to them. I was just enjoying an absorbing, well written book, minding my own (emotional) business, and then The NPC chapter came up, and I just could not deal with it.\n\nI went from really liking Marx to absolutely adoring him, and the last few pages hit me so hard - the *How I will miss these horses*, the peach field memory, the strawberry field reference. I’m a sucker for memory collages, and the way Zevin transitions from the simple game observations to Marx’s memories is SO good (the ‘simple moments’ snapshots representing someone’s life has been done quite a bit and it was not in the least bit cheesy to me here). And Marx seemed like the one out of the trio who was most able to appreciate this reality, and not try to escape into the game world as much. And then the last paragraph of how he continues to fly overhead… ugh I was just not ready for this chapter \n\nI started tearing up reading all of it and had to take a short break, but somehow a dam burst and I could not stop replaying the words and his memories in my head over and over and I started to ugly cry like no one’s business. When I woke up this morning it was the first thing I thought about and I started crying again. I’ve read a lot of heartbreaking scenes but don’t think I’ve had a reaction like this. There’s clearly something deeper that struck me about this personally (I can’t quite figure out what just yet). I really needed to share this though (I am _still_ crying while writing this what is wrong with me!)",
        "created_utc": 1677766604,
        "upvote_ratio": 1.0
    },
    {
        "title": "Osvrt na knjigu Briana Tracy-a : Psihologija prodaje i mojih pet najboljih savjeta za prodaju - KNJIGE",
        "author": "besplatnioglas",
        "url": "https://knjigeudzbenicicasopisistripovi.infooglasi.rs/osvrt-na-knjigu-briana-tracy-a-psihologija-prodaje-i-mojih-pet-najboljih-savjeta-za-prodaju-knjige/?feed_id=4372&amp;_unique_id=6400afa7f40c6",
        "text": "",
        "created_utc": 1677766568,
        "upvote_ratio": 1.0
    },
    {
        "title": "My top 5 books pick of 2023 (with links)",
        "author": "IzZalmon69",
        "url": "https://amzn.to/3kyPIdL",
        "text": "",
        "created_utc": 1677765273,
        "upvote_ratio": 1.0
    },
    {
        "title": "My top 5 book picks of 2023 (with links)",
        "author": "IzZalmon69",
        "url": "https://www.reddit.com/r/books/comments/11g39yn/my_top_5_book_picks_of_2023_with_links/",
        "text": "[removed]",
        "created_utc": 1677765065,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which edition of classic books is best for a young reader?",
        "author": "JanesLoveThrwy",
        "url": "https://www.reddit.com/r/books/comments/11g3646/which_edition_of_classic_books_is_best_for_a/",
        "text": "I’m young, 17, and really want to read all the best classics. So far, I only have a few books that are considered to be classics, and most of them are the Penguin Classics edition, which I like well enough. But I recently bought the Wordsworth Classics version of Crime and Punishment by Dostoevsky and found it pretty decent altogether. The spine certainly held up better than my Penguin copy of The Count of Monte Cristo, but that may be due the big size difference. The font size left a bit to be desired and I’ve read there’s better translations, but overall I enjoyed the copy as much as I would have a Penguin Classics edition, and it was much cheaper. \n\nAnyways, the point of my post is this: What is the best edition of classic books to buy for a young reader? I don’t have much budget for books since I have to buy them out of my own pocket, which is why the Wordsworth Classics interest me. But I  want to make sure I get the best reading experience for the books I buy, including the actual book quality and especially the translation, so I’m curious if I should just save up and spend the extra money for better editions. I want to physically own every book I read, so I’m not interested in the library, ebooks, or audiobooks. I also much prefer paperbacks. \n\nSo, what advice can you give?",
        "created_utc": 1677764780,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to best support my fav authors?",
        "author": "the_madinator3",
        "url": "https://www.reddit.com/r/books/comments/11g2v1r/how_to_best_support_my_fav_authors/",
        "text": "I have a kobo - I use it a lot. I am considering subscribing to kobo plus, but it’s unclear to me how that sub translates to money for authors. Is it better to buy their ebooks directly or do they get more money through subs if I reread/redownload their books often?\n\nTLDR; best model to get money into my fav authors hands: one time purchase or sub?",
        "created_utc": 1677763925,
        "upvote_ratio": 1.0
    },
    {
        "title": "I could use some suggestions",
        "author": "Easy_Ad7801",
        "url": "https://www.reddit.com/r/books/comments/11g2ngp/i_could_use_some_suggestions/",
        "text": "I have been reading more lately and so far I've enjoyed Patricia Highsmith, the catcher in the rye and Murakami's 1Q84.\n\nI couldn't get into Proust.\n\nI'm thinking of trying either Cormac McCarthy, Michael Crichton or Thomas Pynchon next.\n\nI'd like to get more ideas first, though.\nSuggestions can be as vague or as detailed as possible and as long as it's fiction I will give anything a try.\nI just don't want it to be from the same authors I mentioned as I definetely will want to read more from them at some point but I'd rather try the works of others first.",
        "created_utc": 1677763331,
        "upvote_ratio": 1.0
    },
    {
        "title": "books written by the opposite gender bore me",
        "author": "b1living",
        "url": "https://www.reddit.com/r/books/comments/11g2ko4/books_written_by_the_opposite_gender_bore_me/",
        "text": "I (25f) started reading books again like 2 years ago. I stopped bc i was trying to pick up with the latest movies and shows.\n\nAs i started reading books again, i seem not to be able to finish most books written by men. Its not because im boycotting books written by them but more so that i dont understand them and the characters seem so emotionless. \n\nOf course i read books written by men but those authors seemed to not care about gender of their characters where the book could resonate with everyone. \n\nSometimes when i read a book where i do not know who the author is, you can kinda feel if its a man or woman or someone in between those genders. I would listen to my friend tell me the story of the book and i would be like \"did a man write it?\"\n\nI believe there are also men who arent able to read books written by women bc they dont understand the way a woman thinks but sometimes i think male writers do not understand how the world works. \n\nI need more books where the authors dont care about the genders of their characters or just understand how gender and society works bc some of them live in their own universe. \n\nI just wanted to put this out on the internet and see if anyone shares my thoughts",
        "created_utc": 1677763109,
        "upvote_ratio": 1.0
    },
    {
        "title": "Star Wars - Episode I: The Phantom Menace novelization review",
        "author": "GondorianSith",
        "url": "https://m.youtube.com/watch?v=rB3IBewPdyo&amp;fbclid=IwAR38-nqZqvLnKpzhNUqJC2U4Bqggdch1DYh243yMsX6LrTTmSgCvrD9XACw",
        "text": "",
        "created_utc": 1677763010,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I read the character list in Dracula?",
        "author": "YoLoDrScientist",
        "url": "https://www.reddit.com/r/books/comments/11g24x4/should_i_read_the_character_list_in_dracula/",
        "text": "This is not a sh*t post, I promise!\n\nI always dislike and whenever possible skip preface, prologue, and most of all forwards ￼in books. I feel like (at least with forwards) they always spoil something about the book. It’ll be a book that came out 50 years ago and the author will be like, “When I wrote that [event A] happened on page 336…” - not a fan of that. Is it just me? Maybe they’re supposed to though? I don’t know.\n\nRecently got a bunch of great new books that were suggested in one of the many “what is your favorite book?” posts on here and from some of the great posts on /r/suggestmeabook. I’m currently reading Grapes of Wrath (seems to be highly recommended here). I’m 25% of the way through and am struggling to get more into it mostly because of the random chapters that don’t have character dialogue but talk about other random things in their world (like the damn dust!). I find the characters interesting enough… should I push through?\n\nAnyways, today I decided I’m going to take a break from GOW and give Dracula a try (*also* highly recommended here). I started it this morning and when reading the character list as soon as I got to Mira (1st character after Dracula) it’s already talked about them getting married and other plot points.\n\nMy question is, should I read the entire character list? Is it critical to the story as in I won’t know who characters are if I don’t? Hoping to avoid plot points when possible (unless I wouldn’t get them otherwise). \n\nSorry if that’s a dumb question I didn’t pickup reading until later in life so always learning sometime new :)\n\nThank you for the help!",
        "created_utc": 1677761861,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for the title of a book in which someone commits suicide using an anesthetic mask at the dentist",
        "author": "zippyz4ppy",
        "url": "https://www.reddit.com/r/books/comments/11g1xhx/looking_for_the_title_of_a_book_in_which_someone/",
        "text": "[removed]",
        "created_utc": 1677761244,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I need to read the character list in the beginning of Dracula?",
        "author": "YoLoDrScientist",
        "url": "https://www.reddit.com/r/books/comments/11g1ocu/do_i_need_to_read_the_character_list_in_the/",
        "text": "[removed]",
        "created_utc": 1677760462,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book bundles about a certain topic? e.g. Green Ideas bundle by Pinguin",
        "author": "Timmerman94",
        "url": "https://www.reddit.com/r/books/comments/11g1m8h/book_bundles_about_a_certain_topic_eg_green_ideas/",
        "text": "Couldn't figure it out using some Google-fu, so here is my question;\n\nI'm thinking of buying the Green Ideas bundle from Penguin to learn more about climate change, using the writings of multiple authors. Sounds like a fun read.\n\n[Penguin Green Ideas Collection | Penguin Shop](https://shop.penguin.co.uk/products/penguin-green-ideas-slipcase)\n\n&amp;#x200B;\n\nDoes anyone know of comparable curated book bundles made around a certain topic/idea/philosophy? Could be anything, really. I really like the idea of being able to skip a book (or powering through it in a couple hours) if I don't like the writing of a certain author, and also of going through the works of multiple authors fast, so I can figure out who's writing I want to read more about.\n\n&amp;#x200B;\n\nThanks in advance!",
        "created_utc": 1677760288,
        "upvote_ratio": 1.0
    },
    {
        "title": "Non-fiction",
        "author": "bgb372",
        "url": "https://www.reddit.com/r/books/comments/11g1hbg/nonfiction/",
        "text": "[removed]",
        "created_utc": 1677759878,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it possible to finish 100 books a year?",
        "author": "kisw9",
        "url": "https://www.reddit.com/r/books/comments/11g1gj4/is_it_possible_to_finish_100_books_a_year/",
        "text": "I think it's totally possible if the person really wants even if you read one hour daily  , I see people saying about 100 readers that they're lying and it's impossible when it's not actually and most of these people who say this are the ones who spend so much time on their phone if you think they're lying then go try by yourself if you don't believe",
        "created_utc": 1677759806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hrabal and Vonnegut",
        "author": "lottadro",
        "url": "https://www.reddit.com/r/books/comments/11g1cxy/hrabal_and_vonnegut/",
        "text": "So I’ve been reading some Hrabal lately on the suggestion of a friend. I’m currently on Too Loud A Solitude. Its good, I like his writing.\n\nIt reminds me in some ways of Vonnegut. They both are dark, use dark comedy and metaphor. When I states this to my friend, they replied with something that confused me:\n\n“I think a dark novelist from Eastern Europe is more genuine than a same one from the US “\n\nI asked why and got the reply that although Vonnegut lived through WWII, it was that kind of dark event/s/milieu that pervaded Eastern Europe/Czechoslovakia that allowed for Hrabals writing to be more “real”. \n\nDo you agree? What are your thoughts?",
        "created_utc": 1677759497,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just a moment...",
        "author": "Thais2020",
        "url": "https://www.kickstarter.com/projects/ijustamsiri/i-just-am-an-emotions-book-for-children?ref=android_project_share",
        "text": "",
        "created_utc": 1677759291,
        "upvote_ratio": 1.0
    },
    {
        "title": "Log into Facebook",
        "author": "Thais2020",
        "url": "https://m.facebook.com/story.php?story_fbid=pfbid0mwJNCBcykduvKU2xGqJywxzW3yripJjHVppiZXZKmZJLH2VTu5UiCWLYqi3amg17l&amp;id=59201249&amp;sfnsn=wiwspmo&amp;mibextid=ijjfgs",
        "text": "",
        "created_utc": 1677758937,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books that got you into Reading: March 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/books/comments/11g11re/books_that_got_you_into_reading_march_2023/",
        "text": "Welcome readers,\n\nToday is [Read Across America](https://www.nea.org/professional-excellence/student-engagement/read-across-america) and [World Book Day](https://www.worldbookday.com/)!  To celebrate, we're discussing the books that got us into reading!\n\nIf you'd like to read our previous weekly discussions of fiction and nonfiction please visit the [suggested reading](https://www.reddit.com/r/books/wiki/r/booksrecommends) section of our [wiki](https://www.reddit.com/r/books/wiki/index).\n\nThank you and enjoy!",
        "created_utc": 1677758499,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am looking for a childhood book",
        "author": "Meg_Wants_A_Corgi",
        "url": "https://www.reddit.com/r/books/comments/11g0zff/i_am_looking_for_a_childhood_book/",
        "text": "[removed]",
        "created_utc": 1677758310,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a childhood book.",
        "author": "Meg_Wants_A_Corgi",
        "url": "https://www.reddit.com/r/books/comments/11g0yoa/looking_for_a_childhood_book/",
        "text": "[removed]",
        "created_utc": 1677758235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Salem’s Lot question",
        "author": "Elegant-Plenty-9084",
        "url": "https://www.reddit.com/r/books/comments/11g0smw/salems_lot_question/",
        "text": "[removed]",
        "created_utc": 1677757674,
        "upvote_ratio": 1.0
    },
    {
        "title": "My homemade app has improved my reading and vocabulary simultaneously. Would it be useful enough to bring to market?",
        "author": "BluePandaFrog",
        "url": "https://www.reddit.com/r/books/comments/11g0nyx/my_homemade_app_has_improved_my_reading_and/",
        "text": "Hey readers, I've been working on a personal project to improve my vocabulary while reading.  This tool has been so helpful for me that I'm considering releasing it so that others can benefit from it too.\n\nBasically, the app intelligently **predicts words you should learn** **ahead** **of your reading sessions.** It does this by pre-scanning a book and calibrating to your vocabulary profile to identify the unfamiliar words.\n\nIt doesn't interrupt my reading flow like looking up definitions can (*this happens even when e-readers make that lookup accessible*).  More importantly, I've found that priming myself with the words **ahead** of reading supercharges my retention of those unfamiliar words.\n\nThis 20 second GIF will show you how it works:  [https://imgur.com/xUYildY](https://imgur.com/xUYildY)\n\n**I'll be grateful to hear your thoughts and feedback. And if you're interested in giving it a spin, here's a makeshift signup form to try it out:** [https://forms.gle/45Ngnewysf5d1sC59](https://forms.gle/45Ngnewysf5d1sC59)\n\nThanks so much in advance!\n\n\\---\n\n**Background information.** *TLDR:* *For those of you interested in what's driving me, I've shared my thoughts on why I think this is so important.*\n\n&gt;A year ago, I was struck by a sudden realization - the frustration of reading fiction books despite having a doctorate-level education. Every other page, unfamiliar words would disrupt the flow of the narrative, robbing me of the full experience. That's when it dawned on me that society was losing its grasp on adjectives and adverbs - the very building blocks of language - not just because we're reading less, but because we've become slaves to visuals, relying on photos and videos to tell our stories.  \n&gt;  \n&gt;We've lost the true art of story telling, and much of our memories are encoded with words. A child's verbalization ability is a predictor of how well they can form long-term memories.  Memories are the tapestry that we weave from our experiences, our hopes, our fears. And yet, I fear that our society is losing the very words that give those memories their richness and depth. And when we lose the ability to express ourselves with nuance and complexity, we risk losing those memories forever.  \n&gt;  \n&gt;The consequences of a declining vocabulary are dire: a diminished ability to read, to think, to remember, and to communicate with precision. But, it's not too late. We can preserve our language, we can keep our memories vivid and rich, and we can ensure that future generations inherit a legacy of words that truly capture the beauty and complexity of our world.",
        "created_utc": 1677757214,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you recommend The Memoirs of Sherlock Holmes?",
        "author": "GamerLadyXOXO",
        "url": "https://www.reddit.com/r/books/comments/11g0lda/would_you_recommend_the_memoirs_of_sherlock_holmes/",
        "text": "[removed]",
        "created_utc": 1677756958,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mixed feelings about real world by Natsuo Kirino",
        "author": "No_Aide_7186",
        "url": "https://www.reddit.com/r/books/comments/11g0doe/mixed_feelings_about_real_world_by_natsuo_kirino/",
        "text": "I feel like I might have fallen into the trap of having very high expectations of the book because I loved reading out and grotesque (if you haven’t, I recommend reading out first and then if you enjoyed it read grotesque)\n\nWhat made me like her work so much is how she manages to insert social commentary in her work without feeling forced/out of place \n\nI feel like maybe with real world the commentary isn’t as universal? \n\nIn grotesque the in-depth analysis of the concept of beauty felt real to me, a person with a completely different background than the author’s.\n\nAs for out, I feel like she managed to bring out the universal truth about poverty and loneliness while providing an accessible view point of how these themes manifest in society.\n\n\nAs for real world, I feel like the characters lack that depth ( might be due to the fact that they are angsty teens) and I also didn’t feel that sense of immersion.\n\n\nI don’t think an author should adapt/change their work just to fit an international audience, I believe that I’m a guest who gets to enjoy translated work and nothing more.\n\n\nI just wanted to share my thoughts.",
        "created_utc": 1677756219,
        "upvote_ratio": 1.0
    },
    {
        "title": "From book butlers to library sleepovers: 10 great UK places to stay for book lovers | Travel",
        "author": "losimagic",
        "url": "https://www.theguardian.com/travel/2023/mar/02/book-butlers-library-sleepovers-10-great-places-to-stay-for-book-lovers-world-book-day",
        "text": "",
        "created_utc": 1677751910,
        "upvote_ratio": 1.0
    },
    {
        "title": "free children's ebook for world book day 📚🥰",
        "author": "Apart-Positive-8245",
        "url": "https://www.reddit.com/r/books/comments/11fyr5h/free_childrens_ebook_for_world_book_day/",
        "text": "[removed]",
        "created_utc": 1677750303,
        "upvote_ratio": 1.0
    },
    {
        "title": "Replacement dust jacket",
        "author": "Long-Helicopter-8790",
        "url": "https://www.reddit.com/r/books/comments/11fyfz1/replacement_dust_jacket/",
        "text": "Recently dust jacket of my copy of book Scythe by Neal Schusterman got damaged so I tried e-mailing Amazon, Book Depository and Simon&amp;Schuster publisher if there is a way how to get a new one even tho they are not sold separately. Neither helped me with that and Simon&amp;Schuster didn't reply to me yet. \nCan any of you help me where else I could try to find a new dust jacket ?\nThank you ❤",
        "created_utc": 1677749192,
        "upvote_ratio": 1.0
    },
    {
        "title": "NEED HELP ACQUIRING BOOK COPY",
        "author": "Creepy_Vermicelli_51",
        "url": "https://www.reddit.com/r/books/comments/11fy8bh/need_help_acquiring_book_copy/",
        "text": "[removed]",
        "created_utc": 1677748421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just got my pre-order of A Day of Fallen Night by Samantha Shannon... Why to publishers do this?",
        "author": "RealMcKye",
        "url": "https://www.reddit.com/r/books/comments/11fxvvx/just_got_my_preorder_of_a_day_of_fallen_night_by/",
        "text": "[removed]",
        "created_utc": 1677747199,
        "upvote_ratio": 1.0
    },
    {
        "title": "Open Source Insights",
        "author": "Clement_Nzubechukwu",
        "url": "https://devread.hashnode.dev/open-source-insights",
        "text": "",
        "created_utc": 1677745348,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any books similar to Strange the dreamer?",
        "author": "Keliseri",
        "url": "https://www.reddit.com/r/books/comments/11fwwmm/any_books_similar_to_strange_the_dreamer/",
        "text": "Right now, I’m at a book slump since the start of 2020, since when Covid started, due to my mental health. Strange the dreamer was one of the books I loved the most, it was a book I couldn’t stop recommending. Of course, I’ve read muse of nightmares too. Now I’m looking for something to give me this magical feel with the beautiful writing, hopefully to start reading again. \n\n\nI’ve also loved throne of glass , mistborn, the stormlight archive. But I look right now for something quite easier to read and less heavy.",
        "created_utc": 1677743778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Launch your own Cryptocurrency exchange platform with an impressive Binance Clone Script",
        "author": "mathewbenze",
        "url": "https://www.reddit.com/r/books/comments/11fwhdy/launch_your_own_cryptocurrency_exchange_platform/",
        "text": "[removed]",
        "created_utc": 1677742326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Goodreads redesign survey *unofficial*",
        "author": "Onemorejoint",
        "url": "https://www.reddit.com/r/books/comments/11fvy83/goodreads_redesign_survey_unofficial/",
        "text": "I'm a UI/UX Design student and I am conducting a survey to help me aid in redesigning Goodreads as it is the project I have chosen for my final exams. As a user of Goodreads, your input is crucial to help me get a better understanding of the problem at hand.\n\nPlease consider taking a few minutes to fill out my survey.\n\nDISCLAIMER: I am in no way affiliated with Goodreads, this is an unofficial personal project\n\nI have also seen certain members express grievances over people taking surveys as students and using it covertly using it for their own business/app. I declare that i have no such intention and if you would like proof I'm also willing to show my research untill now(please DM if you would like proof).\n\nI also completely understand if the moderators would like this post deleted. But i had to try :)\n\nClick [here](https://forms.gle/bvVS8EZuzk4ArY5W8) to fill the form.",
        "created_utc": 1677740586,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee table books",
        "author": "Professional-Ad8137",
        "url": "https://www.reddit.com/r/books/comments/11fvpnd/coffee_table_books/",
        "text": "[removed]",
        "created_utc": 1677739822,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need book recommendations",
        "author": "tneophyte_2",
        "url": "https://www.reddit.com/r/books/comments/11fvlig/i_need_book_recommendations/",
        "text": "[removed]",
        "created_utc": 1677739447,
        "upvote_ratio": 1.0
    },
    {
        "title": "No longer human is one depressing book.",
        "author": "sufferinfromsuccess1",
        "url": "https://www.reddit.com/r/books/comments/11fvi66/no_longer_human_is_one_depressing_book/",
        "text": "[removed]",
        "created_utc": 1677739158,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reading accessories",
        "author": "Nick16993",
        "url": "https://www.reddit.com/r/books/comments/11fvc7m/reading_accessories/",
        "text": "[removed]",
        "created_utc": 1677738640,
        "upvote_ratio": 1.0
    },
    {
        "title": "I read thirteen reasons why two years ago and I did not like it .",
        "author": "thattintrovertsoul",
        "url": "https://www.reddit.com/r/books/comments/11fvb8j/i_read_thirteen_reasons_why_two_years_ago_and_i/",
        "text": "Maybe it was because I read the entire book in one day or l could not resonate with it. Sometimes I think I should read it again because a lot of people seemed to like it but I just hate the idea of reading it again. In my opinion it's my least liked book out of all the books I've read. Sometimes I don't even get why Hannah committed suicide. Some reasons made a lot of sense, some don't make much sense to me. And I don't get why Clay had to go through so much. It didn't seem closure for Clay to me. It seemed like torture. I don't understand how i couldn't get myself to love the book when a lot of people around me absolutely loved it. Should I give it a read again?",
        "created_utc": 1677738560,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the French book, “The piano teacher “by Elfriede Jelinek published in English?",
        "author": "ericalynn5477",
        "url": "https://www.reddit.com/r/books/comments/11fva8a/is_the_french_book_the_piano_teacher_by_elfriede/",
        "text": "[removed]",
        "created_utc": 1677738468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blog Tour Review, The Holiday Home",
        "author": "Grand-Grapefruit9370",
        "url": "https://thebookreviewcrew.com/blog-tour-review-the-holiday-home/",
        "text": "",
        "created_utc": 1677738426,
        "upvote_ratio": 1.0
    },
    {
        "title": "I read No Longer Human by Osamu Dazai, a heavy book that gave me a lot of new things. How do you interpret this quote from the book?",
        "author": "3OHNIM44",
        "url": "https://www.reddit.com/r/books/comments/11fv89s/i_read_no_longer_human_by_osamu_dazai_a_heavy/",
        "text": "In the translated version I read, (I don't know other translations you read) there is a line that probably says, \"Those who are too sensitive will be sympathetic to the pain of others, and naturally they will not be able to be frank easily. What is called frankness is actually violence.\"  How do you interpret this quote?\n\nAsking highly sensitive people to be frank is a form of violence? Sensitive people are more empathetic and can't help but think about what others say and do, and think about what they should say/do to make the other person feel comfortable, so naturally sensitive people can't be honest easily and they always force themselves to cater to the other person.",
        "created_utc": 1677738295,
        "upvote_ratio": 1.0
    },
    {
        "title": "What i Learnt from the book Forgive Yourself by Leslie Monroe",
        "author": "RaelEndears",
        "url": "https://www.reddit.com/r/books/comments/11fuzhe/what_i_learnt_from_the_book_forgive_yourself_by/",
        "text": "The book 'Forgive yourself' taught me on how to let go of my past mistakes: The book offers strategies for letting  go of guilt and shame over past mistakes, allowing readers to move  forward with a sense of peace and self-acceptance.  The importance of self-compassion: The book emphasizes the importance of  being kind and understanding towards oneself, even in the face of  failures and setbacks.",
        "created_utc": 1677737529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not sure how to feel about The Folk of the Air.",
        "author": "duck-watcher",
        "url": "https://www.reddit.com/r/books/comments/11fusvx/not_sure_how_to_feel_about_the_folk_of_the_air/",
        "text": "[removed]",
        "created_utc": 1677736974,
        "upvote_ratio": 0.99
    },
    {
        "title": "Like many people, I got Babel for Christmas",
        "author": "Bookanista",
        "url": "https://www.reddit.com/r/books/comments/11fuo5h/like_many_people_i_got_babel_for_christmas/",
        "text": "I’ve been disappointed in it, though. 😕 The first thing I don’t like is the hefty conversational info dumps. The second thing I don’t like is that the pace is glacial. Large chunks of it are very boring. Also, big-ass hefty books in general need to be absolutely riveting and glue your eyes to the page. This one does not.\n\nWhat did everyone else think of Babel?",
        "created_utc": 1677736605,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I find book reviews that were written during the time the novel was originally published?",
        "author": "Electronic_Being2196",
        "url": "https://www.reddit.com/r/books/comments/11ftqdj/how_do_i_find_book_reviews_that_were_written/",
        "text": "I'm writing an essay in English and would like to find what people thought about the book during the time it was written. I see essays today saying things like, \"the novel was highly reviewed by most readers when published,\" but I can't ever find the original reviews they are referencing. Is there a specific website that can help me locate these or a specific thing I should google. The book I'm specifically looking for is One Day in the Life of Ivan Denisovich if that helps.",
        "created_utc": 1677733781,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Classics for the Beach?",
        "author": "deweygreen",
        "url": "https://www.reddit.com/r/books/comments/11ftly7/best_classics_for_the_beach/",
        "text": "Had this discussion recently and I found it pretty difficult! So many classics from the western canon are set in rainy and/or cold Europe (Bronte, Dickens, Austen, Dostoevsky, Tolstoy, etc.) and a lot are just plain difficult or challenging to get through when you're on a beach towel taking in the sun. The idea of a classic with a beach-appropriate ambiance and a plot to match almost sounds counterintuitive.\n\nThat being said, I think this is my list so far:\n- Robinson Crusoe: setting really wins on this one\n- Old Man and the Sea: again setting, and while sometimes heavy, its focus on nautical commentary pairs well for a slow beach day\n- The Sun Also Rises: maybe I just can digest Hemingway anywhere, but there are large parts of this that follow the lazy beach lifestyle\n- To the Lighthouse: family vacation theme",
        "created_utc": 1677733405,
        "upvote_ratio": 1.0
    },
    {
        "title": "#बोधदिवस_पर_विशालभंडारा 2 Days Left For Bodh Diwas",
        "author": "Vegetable_Aspect_168",
        "url": "https://www.youtube.com/live/rypHOqccQSs?feature=share",
        "text": "",
        "created_utc": 1677733390,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm too stupid to understand/analyze \"The Stranger\" by Camus",
        "author": "baratoyoso",
        "url": "https://www.reddit.com/r/books/comments/11ftitj/im_too_stupid_to_understandanalyze_the_stranger/",
        "text": "Just finished the book. It was a good book but I didn't love it. \n\nThis is embarrassing but I rarely read a book.\n\nThe last time I finished a book was like 6 months ago, Kafka - Metamorphosis.\n\nI did some \"research\", more like watching YT videos reviewing books, I just learned that I missed so many points what Camus intended to say.\n\n&amp;#x200B;\n\nDo I have to study philosophy (i.e. existentialism) to fully understand?",
        "created_utc": 1677733183,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you find book reviews written during the time the novel was released?",
        "author": "Electronic_Being2196",
        "url": "https://www.reddit.com/r/books/comments/11ftisu/how_do_you_find_book_reviews_written_during_the/",
        "text": "I'm writing an essay in English and would like to find what people thought about the book during the time it was written. I see essays today saying things like, \"the novel was highly reviewed by most readers when published,\" but I can't ever find the original reviews they are referencing. Is there a specific website that can help me locate these or a specific thing I should google? The book I'm specifically looking for is One Day in the Life of Ivan Denisovich if that helps.",
        "created_utc": 1677733182,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else miss Borders?",
        "author": "bookboy27",
        "url": "https://www.reddit.com/r/books/comments/11fspyf/does_anyone_else_miss_borders/",
        "text": "[removed]",
        "created_utc": 1677730863,
        "upvote_ratio": 1.0
    },
    {
        "title": "I consider the editing of the Roald Dahl books to be worse than the removal of the Dr. Seuss books from print back in 2021.",
        "author": "wimpykidfan37",
        "url": "https://www.reddit.com/r/books/comments/11fsf7w/i_consider_the_editing_of_the_roald_dahl_books_to/",
        "text": "[removed]",
        "created_utc": 1677730036,
        "upvote_ratio": 1.0
    },
    {
        "title": "Regarding Roald Dahl",
        "author": "weedmemequeen",
        "url": "https://www.reddit.com/r/books/comments/11fscln/regarding_roald_dahl/",
        "text": "[removed]",
        "created_utc": 1677729838,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you believe in interpreting a work differently from the authors intentions?",
        "author": "River_Minx",
        "url": "https://www.reddit.com/r/books/comments/11fs9nn/do_you_believe_in_interpreting_a_work_differently/",
        "text": "I recently finished The Metamorphosis and to me I read it as Gregor working himself to depression and death and his family having to change and adapt and grow. Obviously probably not Kaftka’s meaning but it’s how I viewed the story. Do y’all do this at all or do you simply stick to what most critics agree on or what the author clearly meant.",
        "created_utc": 1677729629,
        "upvote_ratio": 1.0
    },
    {
        "title": "Traditional or classic Chinese and/or Japanese fantasy in English?",
        "author": "Praetor_7",
        "url": "https://www.reddit.com/r/books/comments/11fs70k/traditional_or_classic_chinese_andor_japanese/",
        "text": "I'm looking for a Chinese or Japanese fantasy story set a long time ago. Nothing modern. It can be written in modern times but I would prefer the setting to not be modern. I think I want something based in reality though. A vibe similar to the Detective Dee movies maybe. Are those books any good?\n\nIf you're familiar with video games, is there anything similar to Nioh 2 or Wo Long?\n\nThere's a book called Monkey King and another called Monkey, both by Wu Cheng'en, that I might check out but they may be too fantastical.\n\nI appreciate any suggestions. Thanks!",
        "created_utc": 1677729428,
        "upvote_ratio": 1.0
    },
    {
        "title": "I caved.",
        "author": "Outrageous-Ask-8877",
        "url": "https://www.reddit.com/r/books/comments/11fs2kz/i_caved/",
        "text": "I caved in and got Daisy Jones and The Six! Not usually my genre but I’m excited to try it out. It’s been really popular lately it seems, I’ve been hearing about it nonstop. No spoilers please but anyone who read it what did you think? I skimmed it and looks like it’s written in almost like a script format which seems interesting",
        "created_utc": 1677729090,
        "upvote_ratio": 1.0
    },
    {
        "title": "23yo Man that doesn't read looking for book recommendations.",
        "author": "Okimbe_Benitez_Xiong",
        "url": "https://www.reddit.com/r/books/comments/11fs2b9/23yo_man_that_doesnt_read_looking_for_book/",
        "text": "Hi I'm a 23 year old dude. I like sports playing video games drawing and I'm a mathy kinda guy. I very much dislike reading but I feel like I must be missing out on some amazing content by avoiding books as a format all together (much like how people who refuse to watch anime miss out on great stories that weren't adapted to other formats).\n\nIn the last few years I have read a few books:\nBehave - Robert Sapolsky (pretty good book)\nAll About Love - Bell Hooks (at the recommendation of my gf) it had some good conversation pieces.\nAtomic Habits - I don't remember who but yall probably know its pretty popular. (This one was interesting)\n\nI dont want to read fiction books but can anyone recommend me some quality non-fiction books that explore interesting topics and provide novel insight or opinions.\n\nThanks!",
        "created_utc": 1677729070,
        "upvote_ratio": 1.0
    },
    {
        "title": "North Dallas Forty by Peter Gent.",
        "author": "Myshkin009",
        "url": "https://www.reddit.com/r/books/comments/11fs0b0/north_dallas_forty_by_peter_gent/",
        "text": "[removed]",
        "created_utc": 1677728929,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it common for a preface to spoil major plot points of a book?",
        "author": "RideRideSnare",
        "url": "https://www.reddit.com/r/books/comments/11frt49/is_it_common_for_a_preface_to_spoil_major_plot/",
        "text": "Just started reading The Lonesome Dove and the preface McMurty writes seems to give away a couple massive spoilers. It's not enough to deter me from continuing and maybe what he says isn't a big deal but it seems pretty backwards to include something like that before the story even starts. I'm kind of gutted that I won't be going into this completely blind as I've heard it's an incredible experience. Should I just be saving these types of things until after I finish a book?",
        "created_utc": 1677728396,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made a video response/reflection to my thoughts after reading Matthew McConaughey's Greenlights. It's not that it was the best book I've ever read, but was more so the analogy of Greenlights that feels particularly relevant to my life. I hope if anyone's going through stuff this can help you 🚦💚",
        "author": "BigBatCasting",
        "url": "https://www.youtube.com/watch?v=rwFGdtP5r94",
        "text": "",
        "created_utc": 1677727722,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who Will Cry When You Die Book Summary In Simple English By Robin Sharma - Richboxx",
        "author": "Gadget45",
        "url": "https://www.richboxx.com/who-will-cry-when-you-die-book-summary-in-simple-english-by-robin-sharma/",
        "text": "",
        "created_utc": 1677726924,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT如何评价韩寒“代笔门”事件",
        "author": "xiaguoxiang",
        "url": "https://youtube.com/watch?v=-fLahyK0ItM&amp;feature=share",
        "text": "",
        "created_utc": 1677726418,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do me and my cousin publish books?",
        "author": "BedEasy2946",
        "url": "https://www.reddit.com/r/books/comments/11fquik/how_do_me_and_my_cousin_publish_books/",
        "text": "[removed]",
        "created_utc": 1677725844,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book recommendations - what are some books every woman should read?",
        "author": "bbqueen86",
        "url": "https://www.reddit.com/r/books/comments/11fqtyo/book_recommendations_what_are_some_books_every/",
        "text": "[removed]",
        "created_utc": 1677725803,
        "upvote_ratio": 1.0
    },
    {
        "title": "The mystery of the divine [self promotion]",
        "author": "KyleRS18",
        "url": "https://www.reddit.com/r/books/comments/11fqh22/the_mystery_of_the_divine_self_promotion/",
        "text": "[removed]",
        "created_utc": 1677724854,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which books have movies made of them that are actually nothing like the book?",
        "author": "wwenumber1fan",
        "url": "https://www.reddit.com/r/books/comments/11fqbhl/which_books_have_movies_made_of_them_that_are/",
        "text": "[removed]",
        "created_utc": 1677724450,
        "upvote_ratio": 1.0
    },
    {
        "title": "Non-fiction books by woman authors?",
        "author": "poopscoopdoopee",
        "url": "https://www.reddit.com/r/books/comments/11fqb7y/nonfiction_books_by_woman_authors/",
        "text": "[removed]",
        "created_utc": 1677724430,
        "upvote_ratio": 1.0
    },
    {
        "title": "Russia's Demographic Time Bomb Explained by Peter Zeihan 🇷🇺",
        "author": "Aminokef",
        "url": "https://vm.tiktok.com/ZMYyfShhU/",
        "text": "",
        "created_utc": 1677724242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Post the book you’re currently reading, then go back and upvote the books you’ve read.",
        "author": "Routine_Mechanic1492",
        "url": "https://www.reddit.com/r/books/comments/11fpxgw/post_the_book_youre_currently_reading_then_go/",
        "text": "[removed]",
        "created_utc": 1677723470,
        "upvote_ratio": 1.0
    },
    {
        "title": "a book a can't remember the title to.",
        "author": "bullet-maker94",
        "url": "https://www.reddit.com/r/books/comments/11fps0s/a_book_a_cant_remember_the_title_to/",
        "text": "Hi all, I read a book not too long ago and was going to give a copy to my little cousin for a birthday gift. But for the life of me I can't remember it's name. \n\nIt's based during the rampage of Jack the ripper. A female scientist travels back in time to stop another scientist from doing some great evil, and gets tangled up in the investigation of JTR and falls in love with a nobleman. Great read, just can't remember the name of it for the life of me. Can anyone help a guy out?",
        "created_utc": 1677723081,
        "upvote_ratio": 1.0
    },
    {
        "title": "Intimate Strangers by Susan Lewis",
        "author": "EquivalentWarning827",
        "url": "https://www.reddit.com/r/books/comments/11fpqn1/intimate_strangers_by_susan_lewis/",
        "text": "[removed]",
        "created_utc": 1677722988,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being generous towards others",
        "author": "jilvia",
        "url": "https://www.reddit.com/r/books/comments/11fphja/being_generous_towards_others/",
        "text": "Hi all, is there any book that explain \"the art of giving\" (not this exact title) but something that explain my partner why being unconditionally generous is important in life. He is a person who loves science and just go by facts. I hate this from him. He cannot donate money, for example, without the solid ground that they will use it 100% as they said. Then he doesn't volunteer. So a book that shows unconditional generousity without having any return.",
        "created_utc": 1677722381,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where the crawdads sing",
        "author": "KeysiMacduncan",
        "url": "https://www.reddit.com/r/books/comments/11fph0j/where_the_crawdads_sing/",
        "text": "[removed]",
        "created_utc": 1677722344,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where the crawdads sing",
        "author": "KeysiMacduncan",
        "url": "https://www.reddit.com/r/books/comments/11fpgii/where_the_crawdads_sing/",
        "text": "[removed]",
        "created_utc": 1677722305,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some of your preferred authors with a minimalist writing style?",
        "author": "must_kill_all_humans",
        "url": "https://www.reddit.com/r/books/comments/11fospj/what_are_some_of_your_preferred_authors_with_a/",
        "text": "[removed]",
        "created_utc": 1677720657,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hardbacks?",
        "author": "CowgirlSmut",
        "url": "https://www.reddit.com/r/books/comments/11fofc0/hardbacks/",
        "text": "Why don't publishers bring out a hardback and a paperback copy of a book when it goes to print? \n\nI can't be the only person who prefers paperbacks; they're cheaper, less bulky, lighter, and, in my experience, don't degrade or break faster than a hardback, especially new ones with those glossy plastic covers. I don't actually know if it is plastic, but you know what I mean.\n\nI always find it annoying when I have to weigh up how much I actually want to read a new book. Do I want it so much that I'm willing to pay nearly double the price (usually) for a heavier, more cumbersome version of a book that I could get for cheaper and easier, just in a year's time? \n\nAs far as I can tell, the \"benefits\" of hardbacks are that they supposedly are harder wearing than paperbacks, and they have those flaps for keeping your page. I've already addressed what I think of the durability argument, and for the latter point, I'll just say: bookmarks.\n\nI can only assume it's money. As I've noted, hardbacks are much more expensive than paperbacks, sometimes being close to double the price. I don't think they should abandon hardbacks completely as there's obviously a market for them, and I wouldn't want to take them away from people who obviously enjoy them. I won't deny that there's a certain aesthetic value to having a completed serious of hardbacks lined up on a shelf, and I suppose one can always serve as a weapon against a potential home-invader, although I'd argue that my copy of The Complete Poems of Emily Dickinson would be able to hold its own should the need ever arise.\n\nWhy not bring out both a hardback and a paperback at the same time? Why do we have to wait a year for the paperback?\n\nI mean, I know why. Money. But that's a depressing thought.\n\nDiscuss, and meanwhile I'll try and figure out if I can stand waiting until October 2024 for the paperback of Babel.",
        "created_utc": 1677719743,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a book.",
        "author": "SnooRevelations5116",
        "url": "https://www.reddit.com/r/books/comments/11fodkb/looking_for_a_book/",
        "text": "I saw a tiktok about a book that featured yog-sothoth and a guy named Carter about a week ago. I thought I saved the video but I don't think I did. Can anyone point me in the right direction of the book and/or series? I would love to read them as I am a huge cthulhu mythos fan. Any help is appreciated.",
        "created_utc": 1677719616,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need Karma",
        "author": "Sweetkirra",
        "url": "https://www.reddit.com/r/books/comments/11fnvul/need_karma/",
        "text": "[removed]",
        "created_utc": 1677718392,
        "upvote_ratio": 1.0
    }
]