[
    {
        "title": "As I Lay Dying Question",
        "author": "likerunningwater",
        "url": "https://www.reddit.com/r/books/comments/11nbqgc/as_i_lay_dying_question/",
        "text": "Hi everyone, I was wondering if any of you William Faulkner lovers could help me out. \n\nIm confusing by the following passage from chapter 17 “Darl”: \n\n“In a strange room you must empty yourself for sleep.\nAnd before you are emptied for sleep, what are you. And when you are emptied for sleep, you are not. And when you are filled with sleep, you never were. I dont know what I am.\nI dont know if I am or not. Jewel knows he is, because he does not know that he does not know whether he is or not.\nHe cannot empty himself for sleep because he is not what he is and he is what he is not. Beyond the unlamped wall I can hear the rain shaping the wagon that is ours, the load that is no longer theirs that felled and sawed it nor yet theirs that bought it and which is not ours either, lie on our wagon though it does, since only the wind and the rain shape it only to Jewel and me, that are not asleep. And since sleep is is-not and rain and wind are was, it is not. Yet the wagon is, because when the wagon is was, Addie Bundren will not be. And Jewel is, so Addie Bundren must be. And then I must be, or I could not empty myself for sleep in a strange room. And so if I am not emptied yet, I am is.\nHow often have I lain beneath rain on a strange roof, thinking of home.” (Faulkner  80-81).\n\nDoes anybody know what Darl means by any of this? \n\nI’d appreciate any and all insights/perspectives! \n\nThank you!",
        "created_utc": 1678414728,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suggestion of books based in Paris/ France?",
        "author": "Ogthalting",
        "url": "https://www.reddit.com/r/books/comments/11nboec/suggestion_of_books_based_in_paris_france/",
        "text": "[removed]",
        "created_utc": 1678414576,
        "upvote_ratio": 1.0
    },
    {
        "title": "William T. Vollmann: A Reader’s Guide",
        "author": "largeheartedboy",
        "url": "http://vol1brooklyn.com/2023/03/09/william-t-vollmann-a-readers-guide/",
        "text": "",
        "created_utc": 1678414485,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just finished “The Kite Runner” by Khaled Hosseini",
        "author": "Rainbownbutterfly",
        "url": "https://www.reddit.com/r/books/comments/11nbjb4/just_finished_the_kite_runner_by_khaled_hosseini/",
        "text": "This book was very moving and powerful. The characters and their stories will stay with me for a long time. I’m really glad to have had another vision of Afghanistan, from the childhood of Amir. There where times while reading it I was saying “oh my gosh” out loud. Anyways let me know if you’ve read the book and what you thought of it.  I’m going to be starting “A Thousand Splendid Suns” now.",
        "created_utc": 1678414209,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ella Scott's Banned Book Club: How Students Are Fighting Back In The War Over Censorship and Ideas",
        "author": "dulcinea8",
        "url": "https://studentcam2023.us.launchpad6.com/fanfavorite/entry/8",
        "text": "",
        "created_utc": 1678413238,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are you reading next?",
        "author": "HurtHurtsMe",
        "url": "https://www.reddit.com/r/books/comments/11nax9s/what_are_you_reading_next/",
        "text": "[removed]",
        "created_utc": 1678412663,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finance Books",
        "author": "sauls_21",
        "url": "https://www.reddit.com/r/books/comments/11naww2/finance_books/",
        "text": "[removed]",
        "created_utc": 1678412637,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ron DeSantis' memoir sold more copies in its first week than books by Donald Trump, Barack Obama, and Hillary Clinton",
        "author": "matchettehdl",
        "url": "https://www.businessinsider.com/desantis-memoir-outsells-books-from-clinton-trump-obama-in-fist-week-2023-3",
        "text": "",
        "created_utc": 1678411870,
        "upvote_ratio": 0.99
    },
    {
        "title": "Dirty Laundry, a review by Shelley",
        "author": "Grand-Grapefruit9370",
        "url": "https://thebookreviewcrew.com/dirty-laundry-a-review-by-shelley/",
        "text": "",
        "created_utc": 1678411653,
        "upvote_ratio": 1.0
    },
    {
        "title": "I bought This book for $3 and it is changing my life I recommend it to you",
        "author": "Tasty-Panic-6446",
        "url": "https://payhip.com/Socialgrowth",
        "text": "",
        "created_utc": 1678411074,
        "upvote_ratio": 1.0
    },
    {
        "title": "Demon Wars: Revenge",
        "author": "XxmuffinexX",
        "url": "https://book-boost.com/genres/fiction/demon-wars-revenge/",
        "text": "",
        "created_utc": 1678409603,
        "upvote_ratio": 1.0
    },
    {
        "title": "need reviews and opinions about 48 laws of power",
        "author": "Overall-Belt1309",
        "url": "https://www.reddit.com/r/books/comments/11n9lrr/need_reviews_and_opinions_about_48_laws_of_power/",
        "text": "So basically after finishing Sun Tzu's Art of War and Meditations by Marcus Aurilius, I've started reading 48 laws by Robert Greene and I'm in the starting chapters. I've got this weird feeling of soulessness from the book unlike the other two and many other psychology and self improvement books I've read. Basically I've got this bad feeling from it and I'm seeing it as overhyped by many young men around my age(and many reviews said the same thing)so I wanna ask is it worth a read or should I pick up Atomic Habits. Plus I don't want to something which will let me become a manipulator or some kind of sociopath my aim is to be a good man with virtues.\nThank you all",
        "created_utc": 1678409314,
        "upvote_ratio": 0.99
    },
    {
        "title": "Side Hustlers Are Flooding Amazon with ChatGPT and AI Written Books",
        "author": "Readmoreco",
        "url": "https://www.readmoreco.com/blogs/book-news/side-hustlers-are-flooding-amazon-with-chatgpt-and-ai-written-books",
        "text": "",
        "created_utc": 1678409263,
        "upvote_ratio": 1.0
    },
    {
        "title": "Libraries that have free digital library cards for out of state/province people?",
        "author": "ninja-blitz",
        "url": "https://www.reddit.com/r/books/comments/11n99ji/libraries_that_have_free_digital_library_cards/",
        "text": "I'm looking to broaden the number of libraries I have linked to my Libby app, specifically for ebooks. \n\nMy local public library is partners with 5 other libraries that I have on there, as well as Broward County  PL (even though I'm not even in the US...they were giving these out for free during covid!).\n\nI'm wondering if anyone knows of other public libraries that don't charge fees for people who live outside their library area to get a card AND that also allow said card to be used for Overdrive/Libby.\n\nBonus points if they have a good Romance selection!",
        "created_utc": 1678408459,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking Help With Frustrating Browsing Issue on Audible Android App",
        "author": "-SpaghettiCat-",
        "url": "https://www.reddit.com/r/books/comments/11n8wer/seeking_help_with_frustrating_browsing_issue_on/",
        "text": "Hello, I am trying to troubleshoot an annoying issue with the Audible app on Android. Perhaps I am overlooking something or am experiencing some kind of bug.\n\nWhen browsing for a new book, I am starting in the [Discover](https://i.imgur.com/tmDhauj.jpg) section, I then select [View All](https://i.imgur.com/P74TqJy.jpg) to view all categories. I happen to be browsing under the [Computers &amp; Technology category](https://i.imgur.com/vRBv7Vi.jpg), and then I click [View All](https://i.imgur.com/yviVkJM.jpg) Best Sellers to look at best selling titles.\n\nWhat's irritating is that once I [select](https://i.imgur.com/ftLvlZL.jpg) a title to [review](https://i.imgur.com/3QAeUTT.jpg), once I [back out](https://i.imgur.com/k1PzDpn.jpg) it takes me back to the [categories list](https://i.imgur.com/voZl2IM.jpg) instead of back to the Best Sellers for the category I already selected, with my place saved. \n\nFor each book I review I have to repeat the steps of selecting the category, viewing all best sellers, and then scrolling back to where I left off. Just pretty tedious if I want to review multiple books when considering a purchase.\n\nAppreciate any advice or input. Thanks in advance for any help.",
        "created_utc": 1678407558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone tell me Five Feet Apart by Rachael Liqqincott",
        "author": "hasimple",
        "url": "https://www.reddit.com/r/books/comments/11n8rgi/someone_tell_me_five_feet_apart_by_rachael/",
        "text": "Im really trying to read the book and I was hoping I could read it in one day since it’s not that many pages but it’s putting me in this reading slump and I can’t be bothered to finish it if it’s not gonna get good. I don’t know what it is but i’m very bored while reading it.\n\nI like reading books before they become movies to see which is better but I just can’t get through the book. \n\nWhat did you guys rate the book? Is it truly worth it or should I just watch the movie.",
        "created_utc": 1678407218,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Advice] how to teach babies in 2023 the beauty of books",
        "author": "Axeltl",
        "url": "https://www.reddit.com/r/books/comments/11n8owc/advice_how_to_teach_babies_in_2023_the_beauty_of/",
        "text": "Hi everyone. I just discovered the sub Reddit so nice to meet all of you. As a new father of a six month old baby I sometimes worry that my baby is growing up in a generation where books are no longer commonplace. I remember growing up and having book fairs and book reports and scholastic fairs etc. Does the stuff still exist for children growing up in 2023? Any advice for how to create a space an environment that would mimic something like I grew up?",
        "created_utc": 1678407047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wanted: A Hook Book for Girls",
        "author": "laurakeet1209",
        "url": "https://www.reddit.com/r/books/comments/11n88p6/wanted_a_hook_book_for_girls/",
        "text": "TLDR; Need recs for fun, engaging, easy reads for a 7 year old girl!\n\nWhen my older son was moving from first grade into second, he was a very reluctant reader. That summer, he discovered Dog Man by Dav Pilkey. By the time second grade began, he was an eager and enthusiastic reader. Dog Man was his hook book.  \n\nMy younger daughter needs her own hook book, and she’s pretty traditionally girly so Dog Man isn’t it!  She’s in second grade but suffered from “virtual learning” during her Kindergarten year, and as a result she’s at a “beginning second grade” level now.  She’s making great progress but she needs *practice* that doesn’t feel like pulling teeth.  So, please, suggest to us some really fun books for the 7-8yo girl demographic!",
        "created_utc": 1678406002,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking to expand my library!",
        "author": "flipflopsanddunlops",
        "url": "https://www.reddit.com/r/books/comments/11n86jj/looking_to_expand_my_library/",
        "text": "I have a small bookshelf but i'm curranty building a house and want a good size collection for mu study. I have mostly medical and phycological books with a few miscellaneous ones. i'm looking to expand with a bunch of classic's ill put a list of most the ones I have in the comments. i'm open to any and all suggestions!",
        "created_utc": 1678405855,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sarah Bohrer: Booktuber, Thoughts?",
        "author": "MountainPerformer210",
        "url": "https://www.reddit.com/r/books/comments/11n85pt/sarah_bohrer_booktuber_thoughts/",
        "text": "[removed]",
        "created_utc": 1678405803,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best book you read so far in 2023?",
        "author": "More_Perception3303",
        "url": "https://www.reddit.com/r/books/comments/11n800u/what_is_the_best_book_you_read_so_far_in_2023/",
        "text": "[removed]",
        "created_utc": 1678405431,
        "upvote_ratio": 1.0
    },
    {
        "title": "download books",
        "author": "daviumbelino",
        "url": "https://www.reddit.com/r/books/comments/11n7qsi/download_books/",
        "text": "[removed]",
        "created_utc": 1678404816,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your favorite day of the week to read?",
        "author": "Im-a-sim",
        "url": "https://www.reddit.com/r/books/comments/11n7ppt/whats_your_favorite_day_of_the_week_to_read/",
        "text": "[removed]",
        "created_utc": 1678404749,
        "upvote_ratio": 1.0
    },
    {
        "title": "In each session, how many pages do you read and for how long?",
        "author": "rafarodxcv",
        "url": "https://www.reddit.com/r/books/comments/11n76vv/in_each_session_how_many_pages_do_you_read_and/",
        "text": "[removed]",
        "created_utc": 1678403561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good books for an adult who hates R rated content",
        "author": "Apprehensive-Sign918",
        "url": "https://www.reddit.com/r/books/comments/11n6g1a/good_books_for_an_adult_who_hates_r_rated_content/",
        "text": "Hi guys! Loving this community. So I’m looking for good book suggestions.\n\nI’m an adult, but to compare it to movies I’m looking for PG 13 books lol.\n\nI’m not one into cursing, raunchy sex scenes or graphic violence, but I like a good plot.\n\nThe hard thing is that books don’t have a rating like movies do. Does anyone know of a way to see this without spoiling the book?\n\nI will give some examples of some books I have loved the past year:\n- A Man called Ove \n- A girl on the train\n- Desert Flower\n- Where the Crawdads sing\n\nI would love a good mystery, and I enjoy series. I like romance, but mostly as a sub plot, usually something else is going on. \n\nAny suggestions?",
        "created_utc": 1678401883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever read a book that put you off reading for a bit?",
        "author": "NativeoftheNorthPole",
        "url": "https://www.reddit.com/r/books/comments/11n68mq/have_you_ever_read_a_book_that_put_you_off/",
        "text": "[removed]",
        "created_utc": 1678401417,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m looking for a memoir book about a boy with ALS",
        "author": "Ian1181",
        "url": "https://www.reddit.com/r/books/comments/11n62ea/im_looking_for_a_memoir_book_about_a_boy_with_als/",
        "text": "I don’t really remember the title of the book but basically it was about an American mother telling the story of her son with ALS. I got the chance to read it when I was in elementary school in my mother tongue. The only few details I remember was that the boy himself was also a young poet and he was traveling around to give out speeches about his poems. Sadly the boy passed away at a young age. It’s a book that left me with a strong impression as a young kid and I would love to find the title of it to read it once again",
        "created_utc": 1678401039,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stay updated with the books",
        "author": "book-panda",
        "url": "https://www.reddit.com/r/books/comments/11n5ybj/stay_updated_with_the_books/",
        "text": "What are your sources to keep track of the book releases ? \n\nI was really happy when books entered digital space and we were talking about them in all the social media but right now everyone talks about the same 15 or 20 books. \n\nIn this scenario, how do you keep track of the book releases and experience different genre ?\n\nThanks in advance",
        "created_utc": 1678400792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meet The Malones, Lenora Mattingly Weber (1895–1971)",
        "author": "empati2015",
        "url": "https://www.reddit.com/r/books/comments/11n5qes/meet_the_malones_lenora_mattingly_weber_18951971/",
        "text": "[removed]",
        "created_utc": 1678400305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Newbie reader",
        "author": "Dixie_Wrect",
        "url": "https://www.reddit.com/r/books/comments/11n5pt1/newbie_reader/",
        "text": "Greetings all,\n\nI am fairly new to reading and have not read many books. My reading primarily focuses on Informative text, Biographies, Research, Self-Help etc. I have been trying to improve my brain, character, and become at least a little smarter everyday. However, my hunger for intelligence has left me with tunnel vision by focusing only on stats, facts, and studies. It made me realize I have been lacking on the creativity and fiction side of things. I always stay on the real side and do not tap into the fantasy world. As someone who was once very into drawing, painting, and art, it saddens me that my creativity has become dormant.\n\nWith the realization that my creativity side has been weakening, I figured that I need some books that dial into the outside world. So I wanted to ask you veteran readers, what are some easy to read, newbie friendly books that can help me fall down the rabbit hole of fiction?\n\nWhat interest me most is science, space, time travel etc. Really, anything to do with science but I am not opposed to branching outside of my scope. I try to look for some titles but I do not even know where to start looking. I would like to ask for some of your favorite reads as well.\n\nSome books that I am currently reading:\n\nSandworm\nCode Breaker\nHow to listen with Intention\nHow to Change Your Mind\nMycelium Running \nNew Plant Parent\n\nAs you can see the titles jump around to different types of genres since I try to learn as many things as I can and get interested in too many things.\n\nQuite a long post and I thank all of you for any recommendations.\n\nHope you all are having a great day and blessed life!",
        "created_utc": 1678400268,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you read Malorie by Josh Malerman without reading Birdbox first?",
        "author": "TeaQueenJ",
        "url": "https://www.reddit.com/r/books/comments/11n5jcu/would_you_read_malorie_by_josh_malerman_without/",
        "text": "[removed]",
        "created_utc": 1678399875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book Club- Discussion Help \"On Earth We're Briefly Gorgeous\" by Ocean Vuong",
        "author": "Ambiyonce",
        "url": "https://www.reddit.com/r/books/comments/11n59ky/book_club_discussion_help_on_earth_were_briefly/",
        "text": "I am hosting our next book club and it is something I have been looking forward to for months. I chose \"On Earth We're Briefly Gorgeous\" for a variety of reasons. We are an all cis male, predominantly white book club with true socio-economic privilege. I myself am one of two biracial members and wanted (selfishly) to pick a book that spoke to my experience as a BIPOC but also could give us an entry point into one experience of a community we want to more about. \n\nNow after reading the book for the second time and hearing one of the critiques from a members before the actual club, that the book is extremely hard to read because of the, what I think is beautiful, but what some have said is too much purple prose.\n\nI am very new to reading and just wondering if my interpretation of the writing style is on base for us to talk about as a group- \n\nVuong is a poet and he uses the English language as a means to disrupt the reader. Stopping to question alternate meanings of a word/words provides English only speakers a small experience of what it is like as an ELL learner but also as a speaker of a tonal language. Vuong in an interview said that Vietnamese like other Asian languages is tonal. And as such you really have to listen to the slight differences between tones to get the true meaning of what a person is trying to say or not say. \n\nTLDR- What do you think of Vuong's writing? What is the purpose of Vuong's style of writing?",
        "created_utc": 1678399293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Replacing screen time with books",
        "author": "IAmNotAFetish",
        "url": "https://www.reddit.com/r/books/comments/11n55s9/replacing_screen_time_with_books/",
        "text": "Have you been very successful in doing so? I find that I am on the computer ALL the time and I have been looking for a way to get over that. How have you been able to be on social media or your computer and get tons of books read? I am addicted to Reddit, especially, but it seems that many of you on this sub don't really have that problem. How much time every day do you spend reading and how do you create that time?",
        "created_utc": 1678399059,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you read book 2 of a book series without reading book 1 first?",
        "author": "TeaQueenJ",
        "url": "https://www.reddit.com/r/books/comments/11n541q/would_you_read_book_2_of_a_book_series_without/",
        "text": "[removed]",
        "created_utc": 1678398949,
        "upvote_ratio": 1.0
    },
    {
        "title": "Persepolis by Marjane Satrapi",
        "author": "zeelumango",
        "url": "https://www.reddit.com/r/books/comments/11n51zp/persepolis_by_marjane_satrapi/",
        "text": "[removed]",
        "created_utc": 1678398818,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book recommendation ALL THE BRIGHT PLACES",
        "author": "Zak_aria_01",
        "url": "https://www.reddit.com/r/books/comments/11n4qdp/book_recommendation_all_the_bright_places/",
        "text": "[removed]",
        "created_utc": 1678398095,
        "upvote_ratio": 1.0
    },
    {
        "title": "Biography books sport related reccs?",
        "author": "Greytroll",
        "url": "https://www.reddit.com/r/books/comments/11n4i2d/biography_books_sport_related_reccs/",
        "text": "Hey guys Im currently really enjoying the gym again which in turn has made me really enjoy watching football/soccer if you are from the US. But wondered if there are any really good sport biographies? . Doesn't have to be from football players although I'm a big Arsenal fan so willing to give them a try. Maybe books from the NBA, NFL where they talk about mind set? Kobe and something that does interest me is the Kaepirnek situation regarding the BLM movement. Could you recommend anything similar I know this is a very broad spectrum but I hear shoe dog is great not sport related but twinges of sport shoe mixed with business. Pref amazon reccs 🙏",
        "created_utc": 1678397563,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good books to read to help rekindle a loved reading.",
        "author": "Snaxovec",
        "url": "https://www.reddit.com/r/books/comments/11n48qk/good_books_to_read_to_help_rekindle_a_loved/",
        "text": "[removed]",
        "created_utc": 1678396969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Join me on TikTok and get a £15 Amazon Gift Card for new reads and more!",
        "author": "Vast-Leek-4851",
        "url": "https://vm.tiktok.com/ZMYaJEgkn/",
        "text": "",
        "created_utc": 1678396854,
        "upvote_ratio": 1.0
    },
    {
        "title": "any books about motive of revenge and/or destiny/fate in greek literature/tragedies?",
        "author": "clawsandbones",
        "url": "https://www.reddit.com/r/books/comments/11n42fy/any_books_about_motive_of_revenge_andor/",
        "text": "[removed]",
        "created_utc": 1678396569,
        "upvote_ratio": 1.0
    },
    {
        "title": "I seem to hate every book that's been recommended online",
        "author": "anonynonner",
        "url": "https://www.reddit.com/r/books/comments/11n41dl/i_seem_to_hate_every_book_thats_been_recommended/",
        "text": "It seems like every single book that someone recommends online I end up hating. I saw great reviews for 'nightcrawling' whereas I felt like the entire thing was a complete waste of my time. I've also been seeing great reviews for 'notes on an execution' which boils my blood since I absolutely hated this book. It was unrealistic and the characters did not act the way real people behave in real life and it also would randomly throw in unnecessary sexual scenes; for example a character meets her sister's boyfriend and then proceeds to go upstairs and finger herself??? Like wtf??? There was another part where a character is talking about how they struggle in relationships and then it suddenly talks about her wanting to be choked during sex, her boyfriend choking her and then being disgusted by her. Idk just the entire book was weird and unrealistic.",
        "created_utc": 1678396507,
        "upvote_ratio": 1.0
    },
    {
        "title": "Goosebumps books 'sanitised without RL Stine's permission'",
        "author": "ex_planelegs",
        "url": "https://www.thetimes.co.uk/article/goosebumps-books-sanitised-without-rl-stines-permission-8qwvf7d5d",
        "text": "",
        "created_utc": 1678396095,
        "upvote_ratio": 1.0
    },
    {
        "title": "Amazing",
        "author": "munozvera",
        "url": "https://www.reddit.com/r/books/comments/11n3lcs/amazing/",
        "text": "[removed]",
        "created_utc": 1678395534,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dows the presence of highlighting and annotations make you less likely to buy a particular used book?",
        "author": "rotprincess",
        "url": "https://www.reddit.com/r/books/comments/11n3ahz/dows_the_presence_of_highlighting_and_annotations/",
        "text": "Hi guys! \n\nI’m curious if people are less or more likely to purchase a used book if it has highlighting and annotations. \n\nWhen a listing for a used book mentions the copy has annotations, I am delighted and will, almost always, purchase that copy. I also enjoy highlighted copies. \n\nHaving another person’s commentary, present in a book makes me feel connected to a larger web of readers and the presence of another’s opinions about the text makes the experience more gratifying. I love hearing what others think about a text. Knowing the words, sentences, and paragraphs which stood out to someone else allows me to read in conjunction with another and pick up on things I may not have otherwise. \n\nOthers have expressed distain for annotated/highlighted books. They view marking a text as an act of disrespect to an author. They also find preexisting marks distracting, and say the marks hinder their reading experience. \n\nSome neither prefer nor dislike books with these characteristics. \n\nWhat do you guys prefer? Do you have strong feelings on this matter? If you do then why? \n\nWould love to get more opinions on this matter! (Sorry if my post sounds weird, I get nervous posting publicly on social media)",
        "created_utc": 1678394816,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on Demon Copperhead ending?",
        "author": "crlnreinhardt",
        "url": "https://www.reddit.com/r/books/comments/11n33zw/thoughts_on_demon_copperhead_ending/",
        "text": "[removed]",
        "created_utc": 1678394400,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the worst 'Rebus' novel?",
        "author": "i-am-colombus",
        "url": "https://www.reddit.com/r/books/comments/11n2pcj/what_is_the_worst_rebus_novel/",
        "text": "[removed]",
        "created_utc": 1678393469,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you get clients?",
        "author": "masha_a_m",
        "url": "https://www.reddit.com/r/books/comments/11n2o7r/how_do_you_get_clients/",
        "text": "Hello. I am book editor, ghostwriter and proofreader. I started my author services last year but I still don't have regular clients. I have joined Fiverr and Upwork and other sites but honestly, It just isn't working. Fiverr is even better, as I get a client after some months. \n\nPlease, for those in this type of business, how do you get clients? I'm seriously down and this is my only source of income.",
        "created_utc": 1678393395,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to organize series?",
        "author": "FringedLoki5003",
        "url": "https://www.reddit.com/r/books/comments/11n2lqt/how_to_organize_series/",
        "text": "Should I organize my series left to right or right to left? I've always organized them left to right because that's the way we read, but it feels wrong cus organizing them right to left, the story is all in sequential order (does that make sense?) \nMy brain can't handle this lmao, they both feel slightly wrong and right at the same time.",
        "created_utc": 1678393239,
        "upvote_ratio": 1.0
    },
    {
        "title": "War Of The Sun, Thanks to all!",
        "author": "Dmandnpc34",
        "url": "https://www.reddit.com/r/books/comments/11n2e26/war_of_the_sun_thanks_to_all/",
        "text": "[removed]",
        "created_utc": 1678392759,
        "upvote_ratio": 1.0
    },
    {
        "title": "War Of The Sun, Thanks to all",
        "author": "Dmandnpc34",
        "url": "https://www.reddit.com/r/books/comments/11n2cxy/war_of_the_sun_thanks_to_all/",
        "text": "[removed]",
        "created_utc": 1678392686,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help, i'm heartbroken and don't know what to do 😢",
        "author": "One-Application-9884",
        "url": "https://www.reddit.com/r/books/comments/11n26sy/help_im_heartbroken_and_dont_know_what_to_do/",
        "text": "Hey Reddit,\n\nI'm reaching out to you today to ask for your help in supporting my girlfriend's dream of becoming a children's book author and illustrator. She's poured her heart and soul into this project, but unfortunately, she's struggling to get the support she needs.\n\nAs her partner, I've seen the dedication and passion she's put into her work, and it breaks my heart to see her so disheartened. We've spent all the money we could on her dream, but she's received almost none back. Seeing her in tears as she looks at her benfeitoria campaign (Brazilian Kickstarter) and considers giving up on her dream is heartbreaking.\n\nBut I know she has what it takes to succeed. Her book is filled with heartwarming stories and stunning illustrations that can spark a child's imagination and take them on a magical adventure.\n\nThat's why I'm reaching out to you today, to ask for your help in supporting her campaign. Please consider making a contribution or sharing it with your friends and family. Every little bit helps, and your support can make a huge difference in helping her achieve her dream.\n\nThank you for taking the time to read this, and please help us make her dream a reality.  \n[https://benfeitoria.com/projeto/noescuro](https://benfeitoria.com/projeto/noescuro)\n\nSincerely,\n\nNeto",
        "created_utc": 1678392292,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books in Western genre set in Australia?",
        "author": "DiscombobulatedCod45",
        "url": "https://www.reddit.com/r/books/comments/11n26ae/books_in_western_genre_set_in_australia/",
        "text": "[removed]",
        "created_utc": 1678392258,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dostoevsky: where to start?",
        "author": "Secty",
        "url": "https://www.reddit.com/r/books/comments/11n269s/dostoevsky_where_to_start/",
        "text": "So I’m not really looking for an “easiest to read” answer. What I’m more looking for is, if anyone has read them and has the inclination, a brief (spoiler free) blurb of the plot of three of Dostoevsky’s books. I’m interested in reading *The Idiot*, *Crime and Punishment* or *Demons*. I’ve looked at all of them on Goodreads and StoryGraph but the blurb outline you get isn’t really insightful regarding what actually happens! And I’m wary of heading to the internet at large because I can’t control what I read and don’t want to give too much away. \n\n…yeah, that’s about it. Thanks for any help you can give me!",
        "created_utc": 1678392257,
        "upvote_ratio": 1.0
    },
    {
        "title": "For people who work 9-5 BUT don’t have to commute for work…when/what hrs of the day do you read?",
        "author": "Potter_King",
        "url": "https://www.reddit.com/r/books/comments/11n252h/for_people_who_work_95_but_dont_have_to_commute/",
        "text": "[removed]",
        "created_utc": 1678392183,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Subtle Art of Not Giving a F*ck",
        "author": "gammapsi05",
        "url": "https://www.reddit.com/r/books/comments/11n22yj/the_subtle_art_of_not_giving_a_fck/",
        "text": "This book offers a refreshing perspective on how we tend to overthink and get caught up in trivial things that don't really matter. The author emphasizes the importance of choosing our battles wisely and focusing our energy on what truly matters in our lives, rather than getting bogged down by the endless stream of worries and insecurities that often plague us. As someone who has struggled with overthinking in the past, I found this book to be incredibly helpful in gaining a new perspective on how to approach life with a more positive and productive mindset. Whether you're looking to improve your relationships, career, or overall well-being, \"The Subtle Art of Not Giving a Fck\" is a must-read for anyone looking to live a more fulfilling and meaningful life.",
        "created_utc": 1678392055,
        "upvote_ratio": 1.0
    },
    {
        "title": "a novel about a detective with multiple personas",
        "author": "Initial-Recover-7804",
        "url": "https://www.reddit.com/r/books/comments/11n1v31/a_novel_about_a_detective_with_multiple_personas/",
        "text": "[removed]",
        "created_utc": 1678391533,
        "upvote_ratio": 1.0
    },
    {
        "title": "i",
        "author": "Bubbly-Willingness92",
        "url": "https://youtu.be/VuiB6oLy8LU",
        "text": "",
        "created_utc": 1678391175,
        "upvote_ratio": 1.0
    },
    {
        "title": "a novel where the mc makes planets",
        "author": "AbroadSuccessful8418",
        "url": "https://www.reddit.com/r/books/comments/11n1md3/a_novel_where_the_mc_makes_planets/",
        "text": "[removed]",
        "created_utc": 1678390942,
        "upvote_ratio": 1.0
    },
    {
        "title": "In 1992, Connie Willis’s novel Doomsday Book accurately predicted how the USA would react to a pandemic.",
        "author": "slinkyjosh",
        "url": "https://www.reddit.com/r/books/comments/11n1m8i/in_1992_connie_williss_novel_doomsday_book/",
        "text": "I thought the following passage was rather prophetic. An American woman in Britain is complaining to a British man about a quarantine that has just been issued:\n\n“I’m not used to having my civil liberties taken away like this. In America no one would dream of telling you where you can or can’t go.”\n“And over 30 million Americans died during the pandemic as a result of that thinking,” he thought.",
        "created_utc": 1678390933,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book. Role in our life.",
        "author": "lagilahi",
        "url": "https://www.reddit.com/r/books/comments/11n1ic5/book_role_in_our_life/",
        "text": "[removed]",
        "created_utc": 1678390692,
        "upvote_ratio": 1.0
    },
    {
        "title": "Psychology, philosophy, human manipulation &amp; neuroscience book suggestions :)",
        "author": "Ploobybloo",
        "url": "https://www.reddit.com/r/books/comments/11n1h6j/psychology_philosophy_human_manipulation/",
        "text": "Hey! I’d love to hear your suggestions on your favourite books in advanced psychology, philosophy, human manipulation/people reading or neurosciences-or books you reckon are worth investing in for more knowledge in related areas. Birthday is coming up and I’d love to indulge in some more reading🫶 thank you :))",
        "created_utc": 1678390619,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you do with your book collection if you may be moving soon but aren’t sure what is going to be the permanent place you are going to stay?",
        "author": "ginevrababy",
        "url": "https://www.reddit.com/r/books/comments/11n1b7q/what_do_you_do_with_your_book_collection_if_you/",
        "text": "I have the habit of buying random books everywhere i go, most of the books I have I haven’t been able to read them all as I am busy with other stuff. \n\nPaper books are so heavy though and occupy space, what do you do with your precious book collection if you know you will be moving soon but aren’t sure 100% of your future plans?\n\nI could keep them here in the apt I live now (owned by parents) but I have no idea if I will ever return.\n\nShould I prepare them and in case ship them to the destination? It is going to cost a lot but I have grown attached to these books lol",
        "created_utc": 1678390242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on A Little Life?",
        "author": "icedoatamericano",
        "url": "https://www.reddit.com/r/books/comments/11n1a77/thoughts_on_a_little_life/",
        "text": "I just finished A Little Life, and I have mixed feelings:\n\nPositives: As someone who went through child abuse, I think this book did a great job portraying how unresolved childhood trauma can fuck up your life and repeatedly bring you back into bad situations because you don’t feel sure of yourself or like you deserve anything better. In that regard, it’s articulated many things that I’ve felt throughout my life but have been unable to put into words. I also loved the writing style, many parts were so beautifully written. \n\nNegatives: It is so, almost needlessly, graphic. I feel like it’s bordering on torture porn. Additionally, I’m mad that, even though Jude ended up getting help in the end, he still ended up &lt;!&gt;committing suicide&lt;/!&gt;. I wish the ending was at least a bit more hopeful. Additionally, it was very hard for me to get into the book, and I feel like it starts off kind of slow.",
        "created_utc": 1678390183,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommended completions of Chekhovs short stories available in the UK",
        "author": "Sohcratees",
        "url": "https://www.reddit.com/r/books/comments/11n138y/recommended_completions_of_chekhovs_short_stories/",
        "text": "[removed]",
        "created_utc": 1678389746,
        "upvote_ratio": 1.0
    },
    {
        "title": "Goodreads reviews are wild dude",
        "author": "Dmanduck",
        "url": "https://www.reddit.com/r/books/comments/11n10rg/goodreads_reviews_are_wild_dude/",
        "text": "I read some reviews for Something Wicked this way Comes and there are people who both liked and hated it who I swear thought that they were the author themselves. I was reading reviews for another book I recently finished and everybody is so pretentious. I felt like I could only find two or three reviews that were left by people who just wanted to read the book and had genuine thoughts about it, not try to show off to everybody how into books they can get and how well they can understand the author.",
        "created_utc": 1678389591,
        "upvote_ratio": 1.0
    },
    {
        "title": "James and the Giant Peach",
        "author": "SeaBlacksmith7001",
        "url": "https://www.reddit.com/r/books/comments/11n0x2v/james_and_the_giant_peach/",
        "text": "[removed]",
        "created_utc": 1678389359,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Home Doctor - Practical Medicine for Every Household",
        "author": "jcentreprise21",
        "url": "https://www.reddit.com/r/books/comments/11n0kn2/the_home_doctor_practical_medicine_for_every/",
        "text": "[removed]",
        "created_utc": 1678388559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Educational screen time: my daughter &amp; her favorite shows | Senai",
        "author": "DefinitionWorldly",
        "url": "https://share.newsbreak.com/39lc6yju",
        "text": "",
        "created_utc": 1678388234,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hyperion series by Simmons - is it good or bad literature?",
        "author": "MateorPitt",
        "url": "https://www.reddit.com/r/books/comments/11n0end/hyperion_series_by_simmons_is_it_good_or_bad/",
        "text": "Only last year have I read the first two Hyperion books. On one hand the  first book covers deep topics about societies, faith and time. On the  other hand the second book creates narrative mess and quite informal  language in the dialogues which was taking me out of experience. I know  it is a sci-fi classic, but is it considered high literature? I really enjoyed both of them.",
        "created_utc": 1678388194,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Home Doctor - Practical Medicine for Every Household",
        "author": "jcentreprise21",
        "url": "https://www.reddit.com/r/books/comments/11n0c7a/the_home_doctor_practical_medicine_for_every/",
        "text": "[removed]",
        "created_utc": 1678388041,
        "upvote_ratio": 1.0
    },
    {
        "title": "f",
        "author": "Bubbly-Willingness92",
        "url": "https://youtu.be/1N_QrgflR3E",
        "text": "",
        "created_utc": 1678387898,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Forager's Guide to Wild Foods",
        "author": "jcentreprise21",
        "url": "https://www.reddit.com/r/books/comments/11n07zz/the_foragers_guide_to_wild_foods/",
        "text": "[removed]",
        "created_utc": 1678387778,
        "upvote_ratio": 1.0
    },
    {
        "title": "h",
        "author": "Bubbly-Willingness92",
        "url": "https://youtu.be/LWkl4DQrNaI",
        "text": "",
        "created_utc": 1678387192,
        "upvote_ratio": 1.0
    },
    {
        "title": "Как вызвать сукуба?!",
        "author": "Yllymah",
        "url": "https://www.reddit.com/r/books/comments/11mzef1/как_вызвать_сукуба/",
        "text": "[removed]",
        "created_utc": 1678385867,
        "upvote_ratio": 1.0
    },
    {
        "title": "Preference: Hardback books with or without the paper cover, which do you prefer and why?",
        "author": "n8_xo",
        "url": "https://www.reddit.com/r/books/comments/11mz4f5/preference_hardback_books_with_or_without_the/",
        "text": "[removed]",
        "created_utc": 1678385231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Majority of people read books?",
        "author": "GloomyMelons",
        "url": "https://www.reddit.com/r/books/comments/11mz222/majority_of_people_read_books/",
        "text": "Every study I am finding online reports only a minority of Americans don't read; i.e, most people are reading at least 1 book a year. \n\nIdk what other people's experiences are like but in my experience, the majority of people I meet treat reading like witchcraft -- they don't participate in it and are borderline afraid of the idea. \n\nWhat are your experiences?",
        "created_utc": 1678385081,
        "upvote_ratio": 1.0
    },
    {
        "title": "Preference: Hardback books with or without the paper cover, which do you prefer and why?",
        "author": "n8_xo",
        "url": "https://www.reddit.com/r/books/comments/11mz0wa/preference_hardback_books_with_or_without_the/",
        "text": "[removed]",
        "created_utc": 1678385004,
        "upvote_ratio": 1.0
    },
    {
        "title": "The end of the fist Outlander book just destroyed me mentally. Can I take reading the rest of the series or is it all this intense and traumatic?",
        "author": "lsolar775",
        "url": "https://www.reddit.com/r/books/comments/11mytn1/the_end_of_the_fist_outlander_book_just_destroyed/",
        "text": "[removed]",
        "created_utc": 1678384555,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a new fantasy series to read (repost)",
        "author": "ChemicalPanda10",
        "url": "https://www.reddit.com/r/books/comments/11myt74/looking_for_a_new_fantasy_series_to_read_repost/",
        "text": "(Originally posted on r/Fantasy)\nWant suggestions for some fantasy series!\n\nSo recently, the book I’ve been reading (Blade Breaker by Victoria Aveyard), failed to captivate me anymore, and now I’m on the lookout for a new fantasy. I’m looking for a series that has: \n- a good magic system (can be simple or complex)\n- Gods and/or a known afterlife (the prospect of nothingness after death makes me uncomfortable)\n- A balance between dialogue and action scenes\n- Nothing explicitly sexual (romance is fine but nothing explicit)\n- Various fantasy races like elves, dwarves or anything that isn’t humans\n- (optional), goblins/kobolds. Love those cute critters :)\n\nThanks for the suggestions and have a good day!",
        "created_utc": 1678384526,
        "upvote_ratio": 1.0
    },
    {
        "title": "What it's like being a slow reader obsessed with books",
        "author": "TapiocaTuesday",
        "url": "https://www.reddit.com/r/books/comments/11my3na/what_its_like_being_a_slow_reader_obsessed_with/",
        "text": "Imagine you're obsessed with traveling and want to be a world traveler, but you spend 3 years in every place you visit.   \n\nYou definitely get to know each country really well, but meanwhile your list of places you want to visit keeps growing. Your friend wants you to visit them in Kenya, another friend owns a hotel in Prague and is offering you a free room, your coworkers are planning a group trip to Mexico and you really want to go.   \n\nBut you have another year left in Italy, and after that you have three other counties that have been on your list for a long time, so you'll need to get through those, which will take nine years. By that time, five more opportunities will have come your way.   \n\nEach country is amazing, but you find yourself unable to discuss traveling with other travelers, and they often are surprised to hear you call yourself a world traveler when you've only been to five or six countries. Meanwhile, your friends are disappointed that you haven't visited them in Kenya and Prague, because you sounded really excited about it.    \n\n\n\nThat's why \"everyone reads at their own pace\" is not always consoling. It's a nice thought, but the reality is, quantity really counts when books are your life, especially for the social aspect.",
        "created_utc": 1678382881,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't know where to post this. A question about an obscure idiom: \"Porcelain Dalmations\"",
        "author": "dogpeoplearebetter",
        "url": "https://www.reddit.com/r/books/comments/11mxvid/i_dont_know_where_to_post_this_a_question_about/",
        "text": "Is this a real phrase or something my mom made up? And what is the full idiom if so?\n\nA person who has \"porcelain dalmatians\" is the type of person who would buy big, expensive, fragile, ugly porcelain dalmatians to display in their home and then go on and on about how expensive they were and brag about them every time you were over, beating the dead horse about the fact that they are super rich and can afford to buy expensive useless things for the sake of buying expensive useless things. \n\nWe used this phrase to describe people deciding to pay full price for a snobby private college that wasn't even that good of an education. There were many cheaper alternatives that you could go to that would give you a better education. The biggest reason people went to this said college was to say they had gone to an expensive college. \n\nIt's a phrase to describe tacky, shallow, showy, snobby people who have the audacity to constantly talk about how rich they are. \n\nI don't know where to put this question. I figured well read people would know what I'm talking about if this phrase even exists.",
        "created_utc": 1678382360,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fantasy/Fiction Survey",
        "author": "annax237",
        "url": "https://www.reddit.com/r/books/comments/11mxtg3/fantasyfiction_survey/",
        "text": "[removed]",
        "created_utc": 1678382226,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having a difficult time telling if this Verne book is abridged..",
        "author": "FlyingPasta",
        "url": "https://www.reddit.com/r/books/comments/11mxnsc/having_a_difficult_time_telling_if_this_verne/",
        "text": "ISBN: 9781607103172\n\nSome blurbs quickly mention \"revised\" but most do not. Any opinions?\n\nWhat is your opinion on abridged works? I feel like if I'm going to read something, I'd like it to be the whole as the author meant it. It's fine to get the story sure, but don't want to miss any subtleties or things the abridger(?) thought not as important",
        "created_utc": 1678381848,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Question of Identity",
        "author": "Affectionate_Cap_884",
        "url": "https://www.reddit.com/r/books/comments/11mx4ts/a_question_of_identity/",
        "text": "My question pertains to literature from the western world: \n\nIf a character's race is not explicitly stated, is it the default that they are white?\n\n&amp;#x200B;\n\nI want your first thoughts, not your considered opinions or sincerest hopes. This isn't about judgment; this is about understanding.\n\n&amp;#x200B;\n\nI really appreciate any help you can provide.",
        "created_utc": 1678380631,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's a book that was really well liked when it was released but over time became more disliked?",
        "author": "PeachyTortellini",
        "url": "https://www.reddit.com/r/books/comments/11mwvj4/whats_a_book_that_was_really_well_liked_when_it/",
        "text": "One good example I can think of is Ready Player One. I remember in the early-2010's you couldn't avoid it and it was at the top of the \"must read\" of many top book lists. But ten years later and it's basically as reviled as its sequel and is said to be more similar to nostalgia bait than actually good writing. What other books do you think fell to this?",
        "created_utc": 1678380015,
        "upvote_ratio": 1.0
    },
    {
        "title": "The 5 Second Rule Transform your Life, Work, and Confidence with Everyday Courage",
        "author": "Sarah-Jess",
        "url": "https://www.upload-4ever.com/g3lpknqow7xl",
        "text": "",
        "created_utc": 1678379879,
        "upvote_ratio": 1.0
    },
    {
        "title": "the new uncanny: tales of unease",
        "author": "omgitsraytoro",
        "url": "https://www.reddit.com/r/books/comments/11mwomp/the_new_uncanny_tales_of_unease/",
        "text": "I don't read alot of books but for my art course we need to talk about different art books, im writing about the uncanny and have found a book called the new uncanny: tales of the unease by Sarah eyre. Has anyone read this book that can tell me a bit about it before I buy it? Apparently there's not alot of books about the uncanny in the art world apart from Sigmund freuds book which I have read a bit before but it didn't seem like the book I wanted. I haven't seen alot about the book I'm looking for but from what I have seen it does look interesting. It would also help if I could be recommended some books based on the uncanny in art (photography or paintings maybe even film) I am currently writing about photography in the victorian era and how unsettling it is which is what we have been shown before in lectures and I was a victorian obsessed child so it makes sense to write about it, if there's even any books about photography in the victorian times that would really help alot! I don't usually know where to look for books, I have been in my local Waterstones but they have nothing on the uncanny right now and my university library also weirdly doesn't have any",
        "created_utc": 1678379549,
        "upvote_ratio": 1.0
    },
    {
        "title": "Buy Negative Google Reviews.",
        "author": "Interesting_Escape18",
        "url": "https://www.reddit.com/r/books/comments/11mw3oi/buy_negative_google_reviews/",
        "text": "[removed]",
        "created_utc": 1678378155,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good books to buy with credit on audible?",
        "author": "introvert_eng",
        "url": "https://www.reddit.com/r/books/comments/11mvyos/good_books_to_buy_with_credit_on_audible/",
        "text": "Hey book readers, I got a coupon code for audible and have 2 credits in audible. I want to buy some good audio books.\n\nI already have a Kindle and read books on it but I started using audible so I can read books when I walk. Currently I am reading Spare by Prince Harry.  Also I am new book reader so any genre except romantic will work. Thanks",
        "created_utc": 1678377846,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"She's Yours For The Taking\"",
        "author": "GeofreyGekood",
        "url": "https://www.patreon.com/posts/shes-yours-for-79786706?utm_medium=clipboard_copy&amp;utm_source=copyLink&amp;utm_campaign=postshare_creator&amp;utm_content=join_link",
        "text": "",
        "created_utc": 1678377332,
        "upvote_ratio": 1.0
    },
    {
        "title": "sad books with tragedy settings.",
        "author": "Fun-Negotiation217",
        "url": "https://www.reddit.com/r/books/comments/11mv54z/sad_books_with_tragedy_settings/",
        "text": "[removed]",
        "created_utc": 1678375879,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the scariest book you’ve ever read?",
        "author": "TravDog321",
        "url": "https://www.reddit.com/r/books/comments/11mv34z/what_is_the_scariest_book_youve_ever_read/",
        "text": "For me it’s The Exorcist. I’ve read it 6 or 7 times because even though I know exactly what happens, the concepts and literary style make it the only book that has ever genuinely scared me, and continued to do so consistently. When I read it, I even get scared of the dark. And normally I find the dark very peaceful. And being that horror is one of my favorite genres in both literature and film, I’m not easily scared at all.",
        "created_utc": 1678375745,
        "upvote_ratio": 1.0
    },
    {
        "title": "books that will make you sad and broken.",
        "author": "Fun-Negotiation217",
        "url": "https://www.reddit.com/r/books/comments/11mv2k6/books_that_will_make_you_sad_and_broken/",
        "text": "[removed]",
        "created_utc": 1678375706,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Cruel Practice of Banning Books Behind Bars",
        "author": "pearloz",
        "url": "https://www.vera.org/news/the-cruel-practice-of-banning-books-behind-bars",
        "text": "",
        "created_utc": 1678375414,
        "upvote_ratio": 1.0
    },
    {
        "title": "Knjige i časopisi 3 - ČASOPISI",
        "author": "besplatnioglas",
        "url": "https://knjigeudzbenicicasopisistripovi.infooglasi.rs/knjige-i-casopisi-3-casopisi/?feed_id=4540&amp;_unique_id=6409f9e55a160",
        "text": "",
        "created_utc": 1678375398,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you organize information read into a system?",
        "author": "decrementsf",
        "url": "https://www.reddit.com/r/books/comments/11mutkr/how_do_you_organize_information_read_into_a_system/",
        "text": "What is your system for organizing information read? Looking to improve methods.\n\nIn reading, highlighting, notes, and bookmarks are useful. Have a number of books that get reviewed periodically to recall points raised. Useful ideas for designing habits around systems. Useful arguments with relevance outside the source material. Specific protocols for nutrition or fitness.\n\nThe important parts are usually brief. Recognized it is possible to summarize these, and instead keep a central reading journal to collect information. Thus eliminating the need to preserve many of the books themselves, website bookmarks, etc.\n\n[Apparently I reinvented my way back to the idea of a commonplace book.](https://en.wikipedia.org/wiki/Commonplace_book) Stumbled on reference to keeping a commonplace book reading classical philosophy from ancient greece, circling back to very old ideas for the same reasons of first principles.\n\nThinking through how a commonplace book will look after a year or two of reading I can see it becoming filled with a mix of unsorted information. Thus potential re-work to sort out ideas and collect themes by topics. I can imagine grouping topics sorted by different subsystems. Fitness and health. Professional skills. Social networking. History. Frames for thinking. How the world was and what we think of it (\"Dark City\"). Not sure where to slice it.\n\nHow to develop systems. I see evidence that pre-computers commonplace books were central in most houses. They appear to have been popular in the Victorian era. I think considerations can be extracted from this to identify first-principles, then use those first-principles to see how the technology available to us today can solve and enhance those things.\n\nSimple is best. Through design of elegant solutions to problems you may observe sometimes the best solution is the crude brute forced approach. Rather than design a database for fitness, grab the note pad and just right it down. In this case, not worrying about it and just carrying a single mixed commonplace book to job down when reading may be simplest.\n\nFollow up tasks. The purpose of the exercise to begin with is capturing information you may revisit. Thus, re-opening the commonplace book happens eventually. Maybe that is when information is curated to sort out into specialized 'best-of' points that go into other books. Invest time to extract those points out and organize, reinforcing information, and setting up into a format that can later be used as basis for writing other books.\n\nEnd product. Often open a new life chapter and wonder what experience grandparents or parents had with new marriage, or introducing kids to the home for the first time, or chopping down trees, or personal finance, or legal affairs. I've got sense of some of the books they had on their bookshelves but do not have much insight into key points and ideas they took from those that formed their approach. Would find it useful if some commonplace book of their ideas had survived along with simple biographies they left behind. Could see translating this into a short summary akin to Marcus Aurelius Meditations. Book form of \"Dad How Do I?\" YouTube channel. Explains \"Oh, that's why we ate like that as kids.\"\n\nI think I've talked through how I'm going to approach this through exercise of thinking outloud. Curious how others have approached this bottleneck. Reading over years is a LOT of information to figure out how to summarize.",
        "created_utc": 1678375101,
        "upvote_ratio": 1.0
    }
]