[
    {
        "title": "Gift Ideas?",
        "author": "miIkycow",
        "url": "https://www.reddit.com/r/books/comments/11aek7x/gift_ideas/",
        "text": "Any good book recommendations for 11-13 y/os? I'm looking to get a gift for my cousin, she's into sad romance fiction, historical fiction, thrillers, and ghost stories. Some books I've read that are at least kinda in that context are Good Girl's Guide to Murder, They Both Die at the End, The Places I've Cried in Public, etc. Feel free to comment your opinion on those books, too. I'm curious to see what other people think :D",
        "created_utc": 1677201325,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many books do you read at a time?",
        "author": "greendaisy513",
        "url": "https://www.reddit.com/r/books/comments/11aebkv/how_many_books_do_you_read_at_a_time/",
        "text": "[removed]",
        "created_utc": 1677200658,
        "upvote_ratio": 1.0
    },
    {
        "title": "William Gibson's latest book Agency - weirdly worse than his others??",
        "author": "Obscura_Games",
        "url": "https://www.reddit.com/r/books/comments/11ae97e/william_gibsons_latest_book_agency_weirdly_worse/",
        "text": "As a teenager I discovered Neuromancer and was instantly entranced.\n\n\"The sky above the port was the colour of television, tuned to a dead channel.\"\n\nChills. I also went on to love Pattern Recognition (one of my favourite books) and the Peripheral, which was incredibly inventive (but somewhat lacking in some areas - nothing could really match Pattern Recognition for me though).\n\nBut I read the sequel to The Peripheral a year or so ago and was incredibly disappointed, and have been looking for somewhere to get views on it since.\n\nHas anyone else read it and if so what were your thoughts? Goodreads has different views, some positive and some negative. Personally I wondered if it is ironic that it is called Agency, or if I was missing something, because the actions of the main POV character have zero effect on what transpires in the plot. If you removed that character's actions, it all would have happened anyway. And it doesn't happen in a kind of reflective, 'we are small and events are much bigger than us way'. It happens in a bad writing, not thought through sort of way.\n\nIt's one of the first books I've read where I finished it out of some strange loyalty to the author, rather than because I was enjoying it. It's so weird because Pattern Recognition is superb and reads like a mournful meditation on modernity, perfectly taking you into the mind of someone alienated from life and struggling to reconnect through weird subcultures. But Agency is almost vacuous. It doesn't iterate on the ideas of The Peripheral in an interesting way either.\n\nAnyway - just interested if anyone else has views on the book or on Gibson's progression of writing in general.",
        "created_utc": 1677200475,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books with the main relationship like Sterek.",
        "author": "im_a_weeb_degenerate",
        "url": "https://www.reddit.com/r/books/comments/11ae40s/books_with_the_main_relationship_like_sterek/",
        "text": "[removed]",
        "created_utc": 1677200062,
        "upvote_ratio": 1.0
    },
    {
        "title": "William Gibson's latest book Agency - weirdly bad??",
        "author": "NascantNeptune",
        "url": "https://www.reddit.com/r/books/comments/11ae3fx/william_gibsons_latest_book_agency_weirdly_bad/",
        "text": "[removed]",
        "created_utc": 1677200013,
        "upvote_ratio": 1.0
    },
    {
        "title": "Go read \"Too Loud a Solitude\" by Bohumil Hrabal.",
        "author": "Not_a_zucchini",
        "url": "https://www.reddit.com/r/books/comments/11adur0/go_read_too_loud_a_solitude_by_bohumil_hrabal/",
        "text": "I dont think i give away too much about this book but if you are worried about spoilers be warned. \n\nI just got back from a quick trip to the Czech Republic, also known as Czechia 🇨🇿\n\nThe book that took me on this adventure was \"Too Loud a Solitude\" by Bohumil Hrabal.  \n\nThis was a fricking awesome read!!!!!!! One that I would highly recommend. For 35 years Haňt'a has run a hydraulic press crushing paper products. He loves his monotonous dirty dead end job. Haňt'a crushes your usual paper waste products, but what with being in a communist country keen on censorship, he also crushes all kinds of banned books and artwork. At times he is even tasked with crushing whole libraries. Haňt'a cherishes these books - he collects them, he hoards them. He finds very special books and saves them for the other interesting characters in the story. \n\nImagine this - every single bundle he crushes is a piece of art to him. He carefully places an open book in the middle of each precious bundle. He wraps it warmly with classic art prints. These are his beauties, his legacy, his loves. \n\nHaňt'as dream is that when he retires he's going to take his hydraulic press with him and put it in his uncle's garden. He will let people crush their own bails, let them make their own works of art. \n\nI dont want to give anything else away because I want you to go out now and read this book, and I dont want to spoil it for you. I will say though that I found it to have a very satisfying ending. \n\nBohumil Hrabalself self published this book in 1976 and it was only circulated underground due to the political censorship of the time. It was officially published in Czechoslovakia in 1989.\nThis book was originally written in Czech and was only translated by Michael Henry Heim into english in 1990. \n\nMy only complaints was that sometimes the pros is a little bit too beatneck for me, but thats just personal preference. And I didn't fully understand the mentions of classic euro literature but you dont need to in order to enjoy this book. \n\nI am on a  trip around the world via books. This was number 22 so I have many, many beautiful adventures to go on yet. \n\nAlso, The book was written in 1976, so technically it would have been written in Czechoslovakia. I'm perfectly comfortable counting it as my Czechia book though because it was written in Prague which is in modern day Czechia. And as far as I understand historically the two countries have viewed themselves as separate places and it was only for a small time that they were grouped together as Czechoslovakia. I could be wrong about that though, feel free to correct me. \n\nHappy reading!",
        "created_utc": 1677199327,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kingkiller Chroniclers - Book 3 Progress?",
        "author": "chroniclersmessenger",
        "url": "https://www.reddit.com/r/books/comments/11adnno/kingkiller_chroniclers_book_3_progress/",
        "text": "[removed]",
        "created_utc": 1677198769,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rivals to War and Peace",
        "author": "specialagentmgscarn",
        "url": "https://www.reddit.com/r/books/comments/11adfue/rivals_to_war_and_peace/",
        "text": "I'm currently reading the Penguin Classics edition of *Vanity Fair* and in the introduction, John Carey writes, \"*Vanity Fair* has strong claims to be the greatest novel in the English language. It is also the only English novel that, in scope and theme, challenges comparison with Tolstoy's *War and Peace*.\" \n\nWhich books are your candidates for rivals to *War and Peace*? I love *W&amp;P,* but for me it comes in as a distant second to *Middlemarch,* which is at least as epic, though the stage might be smaller.",
        "created_utc": 1677198181,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me find a new fantasy book.",
        "author": "TSleezy22",
        "url": "https://www.reddit.com/r/books/comments/11acwcg/help_me_find_a_new_fantasy_book/",
        "text": "To give you some context Mist born series and StormLight have been some of my favorite series as well as Eragon and they all have all had great audio books as well which is a plus. \n\nI’m looking for an action adventure fantasy style book series to pick up. Any recommendations would be killer. Also love when people try to sell my on why it would be a good read. Thank you all in advance. You are my hero’s.",
        "created_utc": 1677196764,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just finished Frankenstein and had this one question",
        "author": "thisisaname101",
        "url": "https://www.reddit.com/r/books/comments/11acqkd/i_just_finished_frankenstein_and_had_this_one/",
        "text": "Why doesn't Frankenstein think to reanimate Elizabeth once she dies? Elizabeth wouldn't be any stronger or tougher than him, and by doing so, he might be able to bring back his love. The only thing that may prevent this is his fear that he wouldn't be able to get rid of Elizabeth if she doesn't remember him or acts hateful to him.\n\nStill, it would've been interesting for him to have that thought.",
        "created_utc": 1677196325,
        "upvote_ratio": 1.0
    },
    {
        "title": "the meaning behind \"the trial by Franz Kafka\"",
        "author": "adnaisu",
        "url": "https://www.reddit.com/r/books/comments/11acp10/the_meaning_behind_the_trial_by_franz_kafka/",
        "text": "I just finished the trial by franz kafka and im im fasinited by how many interpretations theres, apart from the beraucracy one, for me the meaning that i get is an existential one\n\nK is the human who lost in the world and want to find a meaning in his life\n\nthe trial is life and the judge and lawyers are god who he didnt see but only hear about them\n\nwhat do you think about my existential analyse  ?",
        "created_utc": 1677196213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bloody books: \"Paperbacks from Hell: The twisted history of '70s and '80s horror fiction.\"",
        "author": "i-the-muso-1968",
        "url": "https://www.reddit.com/r/books/comments/11aclf0/bloody_books_paperbacks_from_hell_the_twisted/",
        "text": "If there was a history written about the horror fiction of the 1970s to 1980s then \"Paperbacks from Hell\" would be that very history. Ranging from its beginnings in the 60s to it's peak in the 80s it is a pretty wild ride!\n\nThe book is separated into eight chapters (also including the prologue). Each of these chapters detail certain subject matter that many of the writers of these two decades utilized. The Supernatural (demonic possession and haunted houses), monsters, weird science ect. From the well written to the campy. Includes some mentions of big names like Stephen King, Peter Straub, Richard Matheson, Robert Bloch, Anne Rice, William Peter Blatty, Ray Russell and George R. R. Martin.\n\nAside from those big names there are also some lesser known names as well. And it even has pages dedicated to artists who provided artwork to these paperbacks.\n\nThe writing of Grady Hendrix is funny, irreverent as he details the history and timeline of the 70s and 80s horror boom. Plus the book is generously illustrated with the cover artwork from novels and collections from that time period. This is just a really fun book to read!",
        "created_utc": 1677195939,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a book",
        "author": "Illustrious_Rain2163",
        "url": "https://www.reddit.com/r/books/comments/11abzs4/looking_for_a_book/",
        "text": "Hello everyone! I am looking for a book I read a few years back. I can't remember the title nor the author, I only remember the cover being blue. The book was about a teenager whose childhood friend died et she appears in his bedroom. He is the only one who can see her and, throughout the whole book, she is slowly decomposing. That's all I remember about the book, if anyone knows which book I am talking about I would really appreciate you reaching out! Thank you :)",
        "created_utc": 1677194393,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stop letting others betray your trust! Discover how to build trust in relationships, the workplace, and society with 'I Don't Trust You'.",
        "author": "Witty_Purchase9718",
        "url": "https://amzn.to/3Irj6KK",
        "text": "",
        "created_utc": 1677192837,
        "upvote_ratio": 1.0
    },
    {
        "title": "No Plans for Dahl Text Changes from U.S., European Publishers",
        "author": "CyberGhostface",
        "url": "https://www.publishersweekly.com/pw/by-topic/childrens/childrens-book-news/article/91601-no-plans-for-dahl-text-changes-from-u-s-european-publishers.html",
        "text": "",
        "created_utc": 1677192015,
        "upvote_ratio": 1.0
    },
    {
        "title": "Easy and engaging reads?",
        "author": "jenleepeace",
        "url": "https://www.reddit.com/r/books/comments/11ab0ez/easy_and_engaging_reads/",
        "text": "[removed]",
        "created_utc": 1677191943,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Suggestion) A book where MC is suicidal and purely broken inside out,",
        "author": "ReyanX3",
        "url": "https://www.reddit.com/r/books/comments/11a9twf/suggestion_a_book_where_mc_is_suicidal_and_purely/",
        "text": "[removed]",
        "created_utc": 1677189047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need a book recommendation for a hike!",
        "author": "UnknownWeeb333",
        "url": "https://www.reddit.com/r/books/comments/11a9nso/need_a_book_recommendation_for_a_hike/",
        "text": "[removed]",
        "created_utc": 1677188626,
        "upvote_ratio": 1.0
    },
    {
        "title": "roald dahl",
        "author": "Famous_Speaker_6116",
        "url": "https://www.reddit.com/r/books/comments/11a9a2a/roald_dahl/",
        "text": "what does everyone think of the changes being made to the roald dahl books, personally i think these changes to be downright offensive and an attack on cultural heritage and most of all no one asked for it. also does anyone know if these changes have already been made or they are upcoming, i want to buy his complete collection before this is changed",
        "created_utc": 1677187669,
        "upvote_ratio": 1.0
    },
    {
        "title": "roald dahl",
        "author": "Famous_Speaker_6116",
        "url": "https://www.reddit.com/r/books/comments/11a986o/roald_dahl/",
        "text": "[removed]",
        "created_utc": 1677187538,
        "upvote_ratio": 1.0
    },
    {
        "title": "roald dahl",
        "author": "Famous_Speaker_6116",
        "url": "https://www.reddit.com/r/books/comments/11a96xn/roald_dahl/",
        "text": "[removed]",
        "created_utc": 1677187451,
        "upvote_ratio": 1.0
    },
    {
        "title": "roald dahl",
        "author": "Famous_Speaker_6116",
        "url": "https://www.reddit.com/r/books/comments/11a955f/roald_dahl/",
        "text": "[removed]",
        "created_utc": 1677187323,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey guys...Can anybody please give me some suggestions on psychological thriller books??",
        "author": "Arii_29",
        "url": "https://www.reddit.com/r/books/comments/11a8fcu/hey_guyscan_anybody_please_give_me_some/",
        "text": "[removed]",
        "created_utc": 1677185595,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Noble quran in English /r/",
        "author": "Suspicious_Cover_775",
        "url": "https://thequranjourney.com/the-noble-quran-in-english/",
        "text": "",
        "created_utc": 1677185002,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me find this book !!",
        "author": "Heavy_Competition931",
        "url": "https://www.reddit.com/r/books/comments/11a7xuq/help_me_find_this_book/",
        "text": "\nOk so I know this is a long shot but it’s my last hope. When I was a kid I read this book and I’ve been looking for it for years. I think it was called the burning photo or burning photos. But basically there was this family Ona pier and when their creepy guy took a photo of people with his instant camera they vanished. But they actually got stuck in the photos. This happens all at the start and I can’t really remember what happens after this but I’ve been looking for it forever.",
        "created_utc": 1677184408,
        "upvote_ratio": 1.0
    },
    {
        "title": "Randomocity S4-E8: A Boy and His Dog(1975) by Randomocity",
        "author": "randeinfeldt",
        "url": "https://anchor.fm/randomocity/episodes/Randomocity-S4-E8-A-Boy-and-His-Dog1975-e1u0rsm",
        "text": "",
        "created_utc": 1677184076,
        "upvote_ratio": 1.0
    },
    {
        "title": "recommendations on books about navigating guilt and shame as a former religious person?",
        "author": "createandconfuse",
        "url": "https://www.reddit.com/r/books/comments/11a7szf/recommendations_on_books_about_navigating_guilt/",
        "text": "[removed]",
        "created_utc": 1677184074,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best depiction of America in books?",
        "author": "ParisTexas121",
        "url": "https://www.reddit.com/r/books/comments/11a7akn/what_is_the_best_depiction_of_america_in_books/",
        "text": "[removed]",
        "created_utc": 1677182813,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any good Yoga book recommendations?",
        "author": "laerrusleefi",
        "url": "https://www.reddit.com/r/books/comments/11a78vd/any_good_yoga_book_recommendations/",
        "text": "[removed]",
        "created_utc": 1677182704,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beneath A Scarlet Sky By Author Mark Sullivan | Book Summary World",
        "author": "Opposite_Ant_5953",
        "url": "https://youtube.com/watch?v=n6jjYVYI0Ac&amp;feature=share",
        "text": "",
        "created_utc": 1677181550,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meeting with a literary agent",
        "author": "forbiddenorigins",
        "url": "https://www.reddit.com/r/books/comments/11a6m6v/meeting_with_a_literary_agent/",
        "text": "Hey everyone. We recently self published our first book and now we have a meeting with a literary agent. \n\nHow does this process work usually? If we sign with this agent do they then send out our book to publishers? Would we have to take down our first book? Any tips or knowledge from y’all on here would be extremely helpful.",
        "created_utc": 1677181171,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Children's Books: \"Ritchie The Rat Series\" on Spotlight with Logan ...",
        "author": "TheSpotlightNetwork",
        "url": "https://youtube.com/watch?v=khmT7BuXW9I&amp;feature=share",
        "text": "",
        "created_utc": 1677180940,
        "upvote_ratio": 1.0
    },
    {
        "title": "What version of The Picture of Dorian Gray should I read?",
        "author": "Wxze",
        "url": "https://www.reddit.com/r/books/comments/11a6flj/what_version_of_the_picture_of_dorian_gray_should/",
        "text": "I bought one on Amazon not knowing there were two different versions. I believe I have the shorter one published in 1890. \n\nIs one considered the one I should read? Is there any significant difference that would make it so I should return this version and buy the other one? Or should I just go with this since it's the one I have currently and I won't really miss anything from the longer version?",
        "created_utc": 1677180719,
        "upvote_ratio": 1.0
    },
    {
        "title": "Back To Happiness",
        "author": "Ok-Present-9232",
        "url": "https://www.reddit.com/r/books/comments/11a6b2k/back_to_happiness/",
        "text": "[removed]",
        "created_utc": 1677180411,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which actors would you cast for the three brothers Karamazov?",
        "author": "andurilthebare",
        "url": "https://www.reddit.com/r/books/comments/11a5viy/which_actors_would_you_cast_for_the_three/",
        "text": "Thought that Casey Affleck would make a great Ivan (thinking of him as Robert Ford).\n\nThought that a young Marlon Brando would make a great Dimitry ( Stella!)\n\nHaving a difficult time working out Alyosha. Heath Ledger would have nailed it though, I figure.\n\nBut I don’t know much about actors …wondering what you all thought?",
        "created_utc": 1677179347,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any other liberals actually enjoy Atlas shrugged? Or just me?",
        "author": "redbackedshrike",
        "url": "https://www.reddit.com/r/books/comments/11a5evu/any_other_liberals_actually_enjoy_atlas_shrugged/",
        "text": "[removed]",
        "created_utc": 1677178246,
        "upvote_ratio": 1.0
    },
    {
        "title": "Baby's Lead Exposure from Old Book?",
        "author": "PitAd-1951",
        "url": "https://www.reddit.com/r/books/comments/11a50xv/babys_lead_exposure_from_old_book/",
        "text": "I'm currently reading a wonderful first edition book from the late 30s with a red cover.  I was reading it while breastfeeding my baby and the cover got wet.  I blotted it with a paper towel and there was red dye that came off on it.  I don't know if I got any on my fingers.  Maybe.  But I did wash my hands. Anyway I continued reading the damp book and fed the baby.  Then I started wondering about lead and other things in the cover's dye and saw online that old books contain lead.   Freaking out cause I was touching my breast which did touch the baby's mouth.  Does anyone know if lead and other stuff leach out if it was damp or even dry?",
        "created_utc": 1677177281,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is samuel butler a recommended translation of the iliad and odyssey? I want to make sure im getting something true to the original not just something that looks pretty? Looking at the deluxe two book hardcover",
        "author": "mindrosoft",
        "url": "https://www.amazon.com/gp/product/9388144295/ref=ox_sc_act_title_1?smid=ATVPDKIKX0DER&amp;psc=1",
        "text": "",
        "created_utc": 1677177161,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was your favorite or most impactful book you read in high school? (Not necessarily one you were required to read, just your favorite)",
        "author": "strangewoops",
        "url": "https://www.reddit.com/r/books/comments/11a4ua2/what_was_your_favorite_or_most_impactful_book_you/",
        "text": "Seems like all my favorite books or the ones I found most profound were all ones I read in high school (I’m 40ish now) and I think it’s because things just felt more impactful at that age. My favorite book is Catch-22, read it when I was 15 or 16 and it felt so sad/beautiful/hilarious/moving. What’s yours??",
        "created_utc": 1677176837,
        "upvote_ratio": 1.0
    },
    {
        "title": "the epics of homer",
        "author": "nmixxtzy",
        "url": "https://www.reddit.com/r/books/comments/11a4jr1/the_epics_of_homer/",
        "text": "hi all! ive been wanting to delve into classical literature for a long time, and now i finally have the time to do so. i figured i would start with homers work, as it is said to be some of the oldest surviving literature currently known to man. however, i was wondering as to whether i should begin with the iliad or the odyssey. as in, which takes place first? its my understanding that these two poems were only select portions of a larger, more complete work known as the epic cycle, but unfortunately i believe all the other pieces in this cycle have been lost to time (cmiiw). i know then that i will never be able to get the full story, but id still like to read these two in chronological order at the very least. thanks in advance!",
        "created_utc": 1677176138,
        "upvote_ratio": 1.0
    },
    {
        "title": "Textbook Request: Introduction to Health Care Management 4th Edition",
        "author": "Ancient_Impact3911",
        "url": "https://www.reddit.com/r/books/comments/11a46w4/textbook_request_introduction_to_health_care/",
        "text": "[removed]",
        "created_utc": 1677175294,
        "upvote_ratio": 1.0
    },
    {
        "title": "What actors would you cast for the three Brothers Karamazov?",
        "author": "andurilthebare",
        "url": "https://www.reddit.com/r/books/comments/11a3ojm/what_actors_would_you_cast_for_the_three_brothers/",
        "text": "[removed]",
        "created_utc": 1677174098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Author's Elizabeth Wurtzels Op-Ed on Cancer from 2018 discussion",
        "author": "ParfaitSignificant38",
        "url": "https://www.reddit.com/r/books/comments/11a3o5h/authors_elizabeth_wurtzels_oped_on_cancer_from/",
        "text": "\"I have cancer. Don't tell me you're sorry | Elizabeth Wurtzel | The Guardian\" https://www.theguardian.com/commentisfree/2018/jan/20/cancer-elizabeth-wurtzel#comments\n\nI read this op-ed and then the over 300 comments on it. Unfortunately comment section were closed for new comments. I couldn't believe how many people did not like or get this article. Their main complaints were 1.) She sounds so narcissist it's all I, I, I  2.) Cancer is terrifying  so she's diluted. 3.) There's nothing wrong with people telling other people sorry about their cancer.\n\nFirst, it's a personal piece about HER experience thoughts and feelings, not a piece about the collective experience of cancer. Also E.W. mostly wrote about herself and this piece would not surprise a single soul who had actually read her books. She has every right to feel the way she does about people telling her they're sorry and feeling sorry for her that makes some people feel worse. She IS a fighter which again anyone who knew her and her voice/works would know.\n\nWhat seemed to get people crapping on her the most was her approach to not being afraid of cancer and her saying she was happy for getting the experience. Cue the \"I wasn't happy when I had to tell my two small children I was probably going to die\" and \"my mom wasn't happy to suffer with the disease for years before slowly dying.\" She WAS NOT SAYING cancer is something anyone else should be happy about or that she wishes it on anyone. When she said she felt sorry for people who don't know the experience (which I admit that one does sound jarring) she means the positive things she got from the experience. Such as an almost high-like appreciation for life and being alive, accepting inevitably of death, the strength she saw she possessed. That's what she meant. Not wishing this disease on anyone but loving the positives it gave her she wishes for others. Also this was the way this person dealt with a serious disease. It helped her cope so she should be celebrated for it.\n\nAlso, after this piece, she did go further into the disease. She ended up breaking her tibia and fibula, she ended up getting a brain tumor and getting brain surgery. She wrote about how horrific cancer was and had been. And she still said no one could convince her cancer had been bad for her. Admist the horrific pain and loss she appreciated what she gained so much and never allowed herself to feel sorry for herself. I just wanted to share this because the comments on this article made me so angry. I love Elizabeth Wurtzels and her writing and wanted to come to her defense, somewhere, especially since she can no longer do it herself now she's gone. Even though I know she never needed anyone to fight for her. She did it all herself.",
        "created_utc": 1677174074,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nora Ephron's \"Heartburn\" is 40 years old. Gift Washington Post link.",
        "author": "lizzieismydog",
        "url": "https://www.reddit.com/r/books/comments/11a3gq6/nora_ephrons_heartburn_is_40_years_old_gift/",
        "text": "Nora Ephron's \"Heartburn\" is 40 years old. Gift Washington Post link. \n\n[https://wapo.st/3SF5fW1](https://wapo.st/3SF5fW1)\n\nThe article makes me miss Ephron so much. I have all her books. \n\nI've read it twice; once when it came out and again a few years ago. I gave it to my elderly mother because she liked recipes in books.  I saw the documentary by her son a while ago and Carl  Bernstein seems to have survived the scorching just fine.",
        "created_utc": 1677173571,
        "upvote_ratio": 1.0
    },
    {
        "title": "The ARREST by Jonathan Lethem",
        "author": "Wisejitsuguy",
        "url": "https://www.reddit.com/r/books/comments/11a3b7f/the_arrest_by_jonathan_lethem/",
        "text": "[removed]",
        "created_utc": 1677173200,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wanted to share these two new short story collections I liked recently - 'What It Means When a Man Falls from the Sky' and 'Gods of Want'",
        "author": "Radio_gugu",
        "url": "https://www.reddit.com/r/books/comments/11a37py/wanted_to_share_these_two_new_short_story/",
        "text": "I recently had picked up two books in 'New fiction' section in the library (This is what I often do to find new books). I liked reading them, though in both books quality of the stories isn't consistent. I am mentioning a few stories I liked from the collections.\n\n**What It Means When a Man Falls from the Sky** is a collection of short stories by Nigerian author, Lesley Nneka Arimah. The stories are set in Nigeria and the United States and explore themes of identity, family, loss, and the complexities of human relationships. Like many other Nigerian writing, there's use of magical realism to explore the emotional realities of her characters. \n\nI liked \"Who Will Greet You at Home,\" a tale about a woman who creates a baby out of yarn and hair, hoping it will come to life. Another standout is \"Buchi's Girls,\" which tells the story of two sisters who are sent to live with their aunt after their mother's death. The other story I liked - The future looks good is told backwards in time.\n\n**\"Gods of Want: Stories\"** is a  collection of short stories by Taiwanese-American author K-Ming Chang. the stories explore themes like family, identity, queerness, trauma, and the complexities of the immigrant experience. I like how often many stories have a fun factor in them, I chuckled while reading the first story 'Auntland' which is essentially a parade of aunts that create community, family and bring in cultural nuances that sets the tone for the rest of the stories. The language is unique, often differently punctuated and full of eccentric characters and details. As an immigrant myself, often felt a personal appeal in the narration. \n\nI must admit at one point it can get a little monotonous if you aren't sold on the surrealist style and repetition of the themes. I liked the stories Auntland, The Lala store and 'nine headed bird' a lot ! I think the book could be divisive as in either you like it a lot or not like it at all !\n\nHappy reading !",
        "created_utc": 1677172957,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Fifth Season and first person narrative really threw me off.",
        "author": "apocalypschild",
        "url": "https://www.reddit.com/r/books/comments/11a30sv/the_fifth_season_and_first_person_narrative/",
        "text": "Am I missing out on a great story here? I tried really hard to follow this book but simply couldn’t get through it. Part of it was the first person narrative it leans on. I know a book like this needs to do a lot of the heavy lifting of world building and I gave it leeway but I barely made it to the half way point and simply gave up because it felt like a chore I was forcing myself to do rather than the enjoyment/escapism I love about a good book.",
        "created_utc": 1677172503,
        "upvote_ratio": 1.0
    },
    {
        "title": "Machiavelli",
        "author": "MrRaspberryJam01",
        "url": "https://www.reddit.com/r/books/comments/11a2hcc/machiavelli/",
        "text": "I'm currently reading The Prince by Machiavelli and I don't find it nearly as controversial as I was led to believe, is it just me?  It's definitely cynical, no doubt, however it seems as though it is just a very honest look at how people and the world can be, not how we would like it to be.  Especially the political world.",
        "created_utc": 1677171227,
        "upvote_ratio": 1.0
    },
    {
        "title": "Things I should know before I start reading 'The book thief' by Markus Zusak",
        "author": "StrangerOk231",
        "url": "https://www.reddit.com/r/books/comments/11a1vkg/things_i_should_know_before_i_start_reading_the/",
        "text": "I have heard that the book is a little complicated and confusing for someone who is reading it for the first time. \nI know what it is about but if someone could just tell me some points to keep in mind when reading the book(without spoilers, duh) so that I can enjoy and understand the story better,that would be helpful!",
        "created_utc": 1677169787,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dostoyevsky fan? Read this!",
        "author": "Geeki_dude",
        "url": "https://www.reddit.com/r/books/comments/11a1sql/dostoyevsky_fan_read_this/",
        "text": " \"Notes from Underground\" by Fyodor Dostoevsky is a thought-provoking novel that delves into the complexities of human nature. The protagonist, known as the \"Underground Man,\" provides a unique perspective on society and the world around him, exposing the flaws and contradictions of the society he lives in.\n\nThrough the Underground Man's narrative, the reader is transported into a world of existential musings and introspective analysis. The novel explores themes of isolation, loneliness, and the search for meaning and purpose in a world that seems devoid of it.\n\nThe Underground Man's philosophical musings are both insightful and disturbingly cynical. He critiques the utopian ideals of the time and exposes the dark, irrational aspects of the human psyche. His thoughts on free will and determinism challenge traditional philosophical perspectives and offer a new, critical perspective on society.\n\nThe novel is a testament to Dostoevsky's mastery of the written word and his ability to create complex and multi-layered characters. The Underground Man is a complex and dynamic character, whose motivations and actions are at times confusing, yet always intriguing.\n\nIn short, \"Notes from Underground\" is a powerful and thought-provoking novel that provides a unique perspective on society and the human condition. Through its exploration of the complexities of human nature, the novel forces the reader to question their own beliefs and assumptions about the world and the people around them.\n\nIn conclusion, books are an essential part of our lives and can bring numerous benefits to readers. Whether you're looking to learn something new, escape into a different world, or improve your overall well-being, there's a book out there for you. Start reading!",
        "created_utc": 1677169596,
        "upvote_ratio": 1.0
    },
    {
        "title": "How the Armed Services Editions Created a Nation of Readers",
        "author": "drak0bsidian",
        "url": "https://lithub.com/how-the-armed-services-editions-created-a-nation-of-readers/",
        "text": "",
        "created_utc": 1677169287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Always a Bridesmaid by Cindi Madsen &lt;3",
        "author": "ariadnapinheiro",
        "url": "https://www.reddit.com/r/books/comments/11a1nhx/always_a_bridesmaid_by_cindi_madsen_3/",
        "text": "[removed]",
        "created_utc": 1677169243,
        "upvote_ratio": 1.0
    },
    {
        "title": "Men's fashion: key pieces for every wardrobe",
        "author": "dazzlemeinvites",
        "url": "https://fashionfixes101.blogspot.com/2023/02/mens-fashion-key-pieces-for-every.html?m=1",
        "text": "",
        "created_utc": 1677168496,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fashion and Lifestyle",
        "author": "dazzlemeinvites",
        "url": "https://fashionfixes101.blogspot.com/?m=1",
        "text": "",
        "created_utc": 1677168228,
        "upvote_ratio": 1.0
    },
    {
        "title": "please help me find it",
        "author": "UnfairEconomist9432",
        "url": "https://www.reddit.com/r/books/comments/11a16h7/please_help_me_find_it/",
        "text": "[removed]",
        "created_utc": 1677168093,
        "upvote_ratio": 1.0
    },
    {
        "title": "anyone know what this book is?",
        "author": "UnfairEconomist9432",
        "url": "https://www.reddit.com/r/books/comments/11a149m/anyone_know_what_this_book_is/",
        "text": "[removed]",
        "created_utc": 1677167957,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it bad I want to DNF a book because of ellipses?",
        "author": "WynRave",
        "url": "https://www.reddit.com/r/books/comments/11a0x9m/is_it_bad_i_want_to_dnf_a_book_because_of_ellipses/",
        "text": "I am reading A Court of Thorns and Roses by Sarah J Maas after it being recommended by multiple co workers and I just can't handle the amount of ellipses (...) that this woman uses. Damn near every single page has one or multiple instances of these. The plot is fine, I guess, but every time I see an ellipsis I internally groan. Is this the dumbest reason to DNF a book? Do future books by this author have this issue? If I see those blasted three dots again I might hurl this book at the wall.",
        "created_utc": 1677167462,
        "upvote_ratio": 1.0
    },
    {
        "title": "Porth's Essentials of Pathophysiology 5th Edition TEST BANK",
        "author": "No-Cry-8729",
        "url": "https://nursingmaterials.gumroad.com/l/zylhy/",
        "text": "",
        "created_utc": 1677167144,
        "upvote_ratio": 1.0
    },
    {
        "title": "WORST book you've ever read?",
        "author": "BadBooks4Me",
        "url": "https://www.reddit.com/r/books/comments/11a05er/worst_book_youve_ever_read/",
        "text": "[removed]",
        "created_utc": 1677165492,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey so i wrote a short story and would like some criticism and help with publishing it if you guys can help",
        "author": "Gucci_llama4realll",
        "url": "https://www.reddit.com/r/books/comments/11a04ca/hey_so_i_wrote_a_short_story_and_would_like_some/",
        "text": "[removed]",
        "created_utc": 1677165416,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which fictional character death are you still not over?",
        "author": "ladycrankyportcullis",
        "url": "https://www.reddit.com/r/books/comments/119zid1/which_fictional_character_death_are_you_still_not/",
        "text": "[removed]",
        "created_utc": 1677163869,
        "upvote_ratio": 1.0
    },
    {
        "title": "Great experience, grap a copy you won’t regret it 💯",
        "author": "Awdil3fou",
        "url": "https://payhip.com/b/JVegB",
        "text": "",
        "created_utc": 1677163771,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to take Arbitrum $ARB Tokens. Release 23.02.23",
        "author": "StormyST111",
        "url": "https://www.reddit.com/r/books/comments/119zfs0/how_to_take_arbitrum_arb_tokens_release_230223/",
        "text": "[removed]",
        "created_utc": 1677163683,
        "upvote_ratio": 1.0
    },
    {
        "title": "People Become 'Zombies' after having drugs",
        "author": "farazahhmad",
        "url": "https://youtu.be/qtXFa0XbQno",
        "text": "",
        "created_utc": 1677163665,
        "upvote_ratio": 1.0
    },
    {
        "title": "The 2023 Republic of Consciousness Prize longlist has been announced!",
        "author": "Charles_Benes",
        "url": "https://www.republicofconsciousness.com/2023-longlist",
        "text": "",
        "created_utc": 1677163560,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books like 1883",
        "author": "sgm3pv",
        "url": "https://www.reddit.com/r/books/comments/119yvlx/books_like_1883/",
        "text": "[removed]",
        "created_utc": 1677162088,
        "upvote_ratio": 1.0
    },
    {
        "title": "Remember opportunity come but Once.",
        "author": "sahzman",
        "url": "https://link.medium.com/kgBtvBcEExb",
        "text": "",
        "created_utc": 1677162053,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book recs for a woman in stem?",
        "author": "theameonna",
        "url": "https://www.reddit.com/r/books/comments/119yv1b/book_recs_for_a_woman_in_stem/",
        "text": "[removed]",
        "created_utc": 1677162044,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book recs for a woman in stem?",
        "author": "theameonna",
        "url": "https://www.reddit.com/r/books/comments/119yu4a/book_recs_for_a_woman_in_stem/",
        "text": "[removed]",
        "created_utc": 1677161975,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stephen King and unnatural dialougs?",
        "author": "Astr0Rain",
        "url": "https://www.reddit.com/r/books/comments/119ytcd/stephen_king_and_unnatural_dialougs/",
        "text": "Is it just me guy? I notice this Stephen king recent works\nThe dialougs feels unnatural to me especially about kids, I don't how to explain it, But I dont understand the comedy part in his dialougs between kids, It feels lame or dry? I dont know what is the perfect word in this context?\n\n\nFor example, His recenet work the institute. The dialoug between the characters in the locked institute, Luke and his mates, I dont't understand the jokes or the funny dialougs, Like he teries to makes kids act cool, but in natural way?\n\nSome of you would say he is not good at writing kids, he grew among 50s or 60s kids. But this is not my point, My poiny is the way how characters react to each others. It feels unnatural. Like I cant imagine them bonding. It's not about time period of feels like kids in 50s or 60s, but the unnatural reactof the characters and dialougs\n\n\n What do you think guys? Let me know your thoughts?",
        "created_utc": 1677161916,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think Stephen King has poor sense of humor?",
        "author": "Astr0Rain",
        "url": "https://www.reddit.com/r/books/comments/119ym9k/do_you_think_stephen_king_has_poor_sense_of_humor/",
        "text": "Is it just me guy? I notice that Stephen king has poor sense of humor in his dialougs, I don't how to explain it. English not my native language, But I dont understand the comedy part in his dialougs, It feels lame or dry? I dont know what is the perfect word in this context?\n\n\nFor example, His recenet work the institute. The dialoug between the characters in the locked institute, Luke and his mates, I dont't understand the jokes or the funny dialougs, Like he teries to makes kids act cool, but in natural way?\n\nSome of you would say he is not good at writing kids, he grew among 50s or 60s kids. My point is the way how characters react to each others. It feels unnatural. What do you think guys? Let me know your thoughts?",
        "created_utc": 1677161388,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help finding a particular book series.",
        "author": "JFKsBullethole",
        "url": "https://www.reddit.com/r/books/comments/119yi7m/need_help_finding_a_particular_book_series/",
        "text": "There’s a book series I read a long time ago. From what I can remember here is basic context: it is a children’s/YA book, there’s three books in the series, it is fiction.\n\nI believe it takes place in London (and/or the word London is in the title) and is centered around a boy who is a part of a very (VERY) large, very wealthy family. He lives in a mansion with his family surrounded by what’s essentially a scrapyard/ garbage yard. \n\nEvery family member gets an object assigned at birth. The object is based on their personality or something. The main character is assigned a matchbook in which he doesn’t feel suits him. \n\nThe boy has an interesting quick. He can hear things that no one else can. He can hear the families objects talking. He figured out that the family is somehow turning real people into objects for the family members. He then figures out a way to turn his matchbook back into a real girl. \n\nThat is all I remember of the book. Can someone please help me figure out what series this is? I feel like I’ve scoured the internet. I don’t think I was able to finish the series and I want to now.",
        "created_utc": 1677161077,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dutch House by Ann Patchett audiobook - thoughts?",
        "author": "SomeRandomDefault",
        "url": "https://www.reddit.com/r/books/comments/119y0bd/dutch_house_by_ann_patchett_audiobook_thoughts/",
        "text": "I got the audible version of The Dutch House by Ann Patchett read by Tom Hanks but I'm finding it difficult to get into it.\nI've listened to several audio books over the last few years but this is one I've tried starting a couple of times and just can't seem to move beyond the first chapter.\nDoes it get better? What did you think of the book?",
        "created_utc": 1677159722,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you name a book that completely changed your perspective on life?",
        "author": "DontMindPlease",
        "url": "https://www.reddit.com/r/books/comments/119xvep/can_you_name_a_book_that_completely_changed_your/",
        "text": "[removed]",
        "created_utc": 1677159357,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on Freida McFadden’s books.",
        "author": "DontMindPlease",
        "url": "https://www.reddit.com/r/books/comments/119xohg/thoughts_on_freida_mcfaddens_books/",
        "text": "[removed]",
        "created_utc": 1677158824,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it me or are most italicised (specifically for emphasis) words in a book in the wrong order? Am I missing something?",
        "author": "jidkut",
        "url": "https://www.reddit.com/r/books/comments/119xac5/is_it_me_or_are_most_italicised_specifically_for/",
        "text": "Been reading for years but it’s always been something that’s bugged me, for example:\n\nJohn shouted “Are you *joking* me?!” \n\nIn my head the emphasis is on the word joking with or without the italics if someone was shouting, but more often than not I see it phrased as:\n\nJohn shouted “Are *you* joking me?!”\n\nNow I can understand if it was a targeted comment towards a group of people, but this is usually in one-on-one dialogues, or monologues.\n\nThe reason for the question is that when I see it on Reddit or other forums, they usually emphasise the word I’d expect to have emphasis. \n\nIs it an editor thing? Is it a common misconception of a grammar rule (like, the word italicised before maybe denotes that you should apply emphasis on the next word)? I’ve just been confused about it for a while.",
        "created_utc": 1677157692,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books about different entities like angels, demons, gods etc.",
        "author": "Plutonic-Rose",
        "url": "https://www.reddit.com/r/books/comments/119x47g/books_about_different_entities_like_angels_demons/",
        "text": "Hello everyone, I recently got back into reading again and I really wanna read a book that is \" almost \" like an encyclopedia about different beings like the ones mentioned. Since the most I have ever read was an encyclopedia of all the different religions and beliefs that are known to us, I don't really know if a book like that even exists. If you know a book that covers this topics in a encyclopedia way (or maybe not like that, but at least one where I can read about many different ones) I would really appreciate it.\n\nI tried to look for something myself but it turns out it's much more difficult to find something via a Google search, since I can imagine that a book that covers the whole spectrum from gods down to demons might not really exist.",
        "created_utc": 1677157201,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day by Day Armageddon was always my favorite zombie story when the series had 2 books. I don't know how he could nail those so well and then fumble the next two so badly. Biggest reading disappointment I've experienced and I need to whine a bit. (spoilers)",
        "author": "sawaflyingsaucer",
        "url": "https://www.reddit.com/r/books/comments/119wtfb/day_by_day_armageddon_was_always_my_favorite/",
        "text": "**TL:DR;**\n&gt;*I read the first two books of a zombie series years ago.  They quickly became my favorite zombie books due to the main character's rationality and the realism of it all.  It was like the zombie survival guide but with a character doing the stuff instead of it just being explained what to do.  \nI came to find out the series is finished recently and read the last two.  Everything which made them good in the first place were gone from these next ones.  The slow but steady, clever and careful attitude the main character had was gone.  Replaced with outlandish one man vs a horde type situations.  The series took such a drastic nose dive in quality after the first two that I've gone from recommending the story every time it's relevant, to not bothering to mention it anymore at all (outside this disappointment post).  \nIf the author had written a solid ending to the second book and ended it there, I'd have far more respect for him than I do for getting lazy and writing 2 more that were not at all in tone with the first 2, nor even entertaining.  \n\nThis is a series about a zombie apocalypse.  What really drew me in was the \"journal\" style format it is written in.  Even more so  the pure rationality of the main character was nice to see.  Characters in zombie stories are generally stupid, so it was refreshing to see one who could analyze and adapt to the situation and thrive based on actual skill/knowledge.  \n\nThe story begins slow, trickles of information coming in, but soon it's clear they've passed the point of no return.  The main character is a military guy.  So when his CO emails him to report for duty; you expect this to turn into some high action thing.  Instead, the main character; \"Kilroy\" realizes it's a hopeless suicide mission and simply replies; \"With all due respect, Fuck you, Sir.\"  \n\nFrom here it becomes a survival story with a very competent survivalist.  He rigs his home up to a submarine battery recharged by solar power, and generally fortifies it against all but the biggest hordes.  He spends his time collecting intel as he studies the undead behavior and skills.  He manages to establish communication with a neighbor.  The neighbor gets a 2 way radio to him by using a thermos packed with cloth and an exercise band to \"slingshot\" it across the road.  \n\nSoon enough they get a TV announcement that all major population centers are getting nuked.  So they have to head out into the wild world.  (The nukes actually have an interesting effect too, any zombies who were highly irradiated don't decompose, and are much faster/stronger than the rest, plus being in proximity to one can give off a lethal level of radiation, a hug from one is as lethal as a bite.)    \n\nI had read the first 2 books 3 times I enjoyed them so much.  It was vastly different than most zombie fiction I've read.  (Not a whole lot, admittedly)  \n\nThis is as close to \"rational man vs Zombies\" or \"Zombie survival guide in action\" as you're gonna get in fiction as far as I've seen.  The guy never fires a shot he doesn't have to.  He is always analyzing and assessing the situation, using his military training to evade the undead whenever possible using a slew of clever tricks to get out of tight spots.  \n\nSome people may find that boring because it lacks a lot of action you'd normally see.  I found it engaging because instead of shooting down the zombies that pile up in front of his house, or whatever.  He's always got some clever trick or way of approaching a situation which eliminates most of the danger.  IMO it makes up for any lack of action with suspense and execution.  Just a whole bag of clever/common sense tactics which pull him out of tight spots, because he uses his head instead of his guns.  Not to say he doesn't get caught off guard, but when he does he's already gained enough control of the environment or thought of back up plans to manage to get away.  \n\nThe characters he saves along the way are very generic.  It's due to it being a journal format.  You can only really get their personalities through the passages he writes about them in his journal.  I had no problem with that though, because you can't really get inside their heads from another guy's end of day journal POV, plus they weren't stupid either.    \n\nLike I said I had read the first 2 books 3 times over.  I enjoyed them that much.  Years later I remember the series, and to my delight I find that the writer has finished the story with 2 more books.  So I read the first two AGAIN and then started the new one.  \n\nThe third takes a DRASTIC change in tone.  It's no longer about Kilroy specifically, nor is it journal format.  It's broken into 3 storylines which go back and forth and aren't really relevant to each other in the long run.  \n\nOne is Kilroy with a military team headed into mainland China.  The other is a group of people stuck at an artic outpost, and the third is Kilroy's group of folks he saved who are secure on a military ship.  These 3 storylines don't actually relate to each other in the book though, it's just like 3 separate stories going at once back and forth.  There may be small bits in one which are relevant to another, but by no means are they \"intertwining\".  It comes off as jarring jumping from one group to another as there's not much to connect them.    \n\nThe Kilroy story really bothered me.  Him with a military team just seemed like a reason to throw as many military acronyms and inside jokes in as possible.   White featuring the most cliché and 1 dimensional solider characters I've ever read.  They have even less personality than the people who only got mentioned in journals.  The entire book is leading up to a mission to China, which is way worse off than the US for answers how it started.  Then they don't even get there, the whole travel/plot part of that story ends up being completely irrelevant.    \n\nEven worse though, the rationality and plain survival skills Kilroy showed in the first two books are gone.  He's engaging every random zombie now with machine gun fire.  Running carelessly into situations he'd have just sat and waited a day to clear in the previous books.  He just starts to become that generic badass who shoots his way out of situations.  It really killed the whole \"Zombie survival guide\" vibe the first two books had.  \n\nThen comes the last one...  As I understand the format change in book 3 got a lot of backlash, so at least it's back to the journal format.  However, it's also basically the plot of book 2 redone; He's separated from his group by vast distance and has to find his way back, except this time he's a dumb character.  \n\nIn the second book, if there were 2 or 3 Zombies around when he woke up on a roof he'd just sit out of view for hours until they leave, or distracting them in some clever way.  Rather than popping a shot at it and making noise that draws more.  \n\nHe's just running and gunning at this point in the story now.  Sometimes he'll even run into a dangerous situation he doesn't need to be in, just for the sake of action almost.  \n\nThere were a dozen situations in this fourth installment where I thought; \"if he had done it this way in the first book, he'd be dead, and he'd know he'd die, that's who he was...\"  \n\nAny of the realism or gritty survival tactics are just gone by this point.  It had become almost cartoonish like The Walking Dead.  Hitting headshots at distance while running suddenly, taking on groups of zombies by himself, choosing to engage rather than evade most of the time, saved only by plot now when before his thinking would have saved him.  \n\nI was just sooooo disappointed.  I absolutely loved those first two books, and knowing it was an ongoing series had high anticipation for further installments.  Once I found the story concluded, and read how it turned out I wish he would have simply written a soilid ending for the second one and called it quits there.  \n\nThe last 2 really put a sour taste in my mouth now, I can't recommend this series with the verve I would before.  Everything which made them great books in the first two is just thrown out for the last 2.  Realistic situations, rational actions, clever characters...  No more of that after book 2.  \n\nSorry for the length, but these thoughts have been brewing for a few months now since I finished the series.  I know it's not well known and nobody cares I was let down but I just needed to rant a minute or two.   I am just stunned and disappointed how the author took what was by far my favorite zombie story.  \n\nI'm kinda pissed the author made it into some lazy, generic, cliche, paint by numbers superbadass vs Z's thing.  I ended up having to push myself to finish, and now I don't know why I bothered it's only tainted my view of this story overall.",
        "created_utc": 1677156258,
        "upvote_ratio": 1.0
    },
    {
        "title": "Favorite Books with Girl Scouts: February 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/books/comments/119w0zv/favorite_books_with_girl_scouts_february_2023/",
        "text": "Welcome readers,\n\nFebruary 17-19 is [Girl Scout Cookie Weekend](https://www.girlscouts.org/en/cookies/how-to-buy-cookies.html) and February 22 is [World Thinking Day](https://www.girlscouts.org/en/members/for-girl-scouts/ways-to-participate/global-girl-scouts/world-thinking-day.html).  To celebrate, we're discussing our favorite books with girl scouts as characters!\n\nIf you'd like to read our previous weekly discussions of fiction and nonfiction please visit the [suggested reading](https://www.reddit.com/r/books/wiki/r/booksrecommends) section of our [wiki](https://www.reddit.com/r/books/wiki/index).\n\nThank you and enjoy!",
        "created_utc": 1677153686,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books in their original language - Are they all the same?",
        "author": "t3rtius",
        "url": "https://www.reddit.com/r/books/comments/119vs5i/books_in_their_original_language_are_they_all_the/",
        "text": "Hi all,\n\nThis may seem naive, but I have a question: if I buy a book in the original language of the author, is it always the original text? I mean sure, editors do intervene for clarity usually, but book X in its original language Y, will always have the exact same content (except, of course, for prefaces, introductions, postscripts etc. that someone other than the author wrote) regardless of the publisher?\n\nI try my best to read books in the language the author wrote them, and I know that a rule of thumb is to rely on respectable publishers. But sometimes I manage to find a book published by some unknown publisher, perhaps with lower quality paper and illustrations and fonts, which I generally have nothing against, as the content itself is the focus. But can I be sure that it's the exact same content other publishers use?\n\nI'm not referring only to fiction, but also philosophy and science for example.\n\nIf the answer is in the negative, do you have other tips or things to look for other than the prestige of the publisher to make sure I'm getting \"the original\"?\n\nI also think some licensing is involved, as I assume most writers sign exclusive deals with publishers, so that publisher alone has the original. But I'm sure you are aware of many texts, especially older and classical ones published by many.\n\nThanks.",
        "created_utc": 1677152865,
        "upvote_ratio": 1.0
    },
    {
        "title": "Harris County Public Library eliminates late fees, following Houston’s lead",
        "author": "zsreport",
        "url": "https://www.houstonpublicmedia.org/articles/news/harris-county/2023/02/22/444467/harris-county-public-library-eliminates-late-fees-following-houstons-lead/",
        "text": "",
        "created_utc": 1677151803,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a series set in San Francisco",
        "author": "MissHoovers",
        "url": "https://www.reddit.com/r/books/comments/119us0h/looking_for_a_series_set_in_san_francisco/",
        "text": "Hi there, my late mother lent me a series of books years ago set in San Francisco, from the 1900s to 1970. \nIt started with a poor fisherman who bought some boats around WW1 and married a rich girl he'd always admired. They split up years later and she ended up owning a winery in Napa Valley and he married a Japanese woman just before WW2. It followed their lives throughout. \nMy mum loved it and I wouldn't mind rereading it, but can't remember the author or title, only the cover image.\n\nAny idea on the author or title would be much appreciated! Thanks in advance",
        "created_utc": 1677149234,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you read paperbacks without getting cracks on the spine?",
        "author": "Polaroid_Pigeon",
        "url": "https://www.reddit.com/r/books/comments/119ulad/how_do_you_read_paperbacks_without_getting_cracks/",
        "text": "I've seen a few posts where people say to put the spine on a hard surface, then open the first and last 15 or so pages, then the next 15 pages, eventually working towards the center of the book, all the while keeping the spine flat on the hard surface. So far this hasn't worked for me. Is this because I'm reading mass market paperbacks? If not does anyone know of another way to prevent those creases? It doesn't really bother me too much since I haven't had a spine get ruined yet (except for one Wheel of Time book, but that baby was a mass market paperback that was over 1000 pages, so I think it's just an exception). Still, if there's a way to treat my books better I'd like to try it.",
        "created_utc": 1677148497,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking to make new friends?!",
        "author": "Effective-Ad6233",
        "url": "https://www.reddit.com/r/books/comments/119u90y/looking_to_make_new_friends/",
        "text": "[removed]",
        "created_utc": 1677147169,
        "upvote_ratio": 1.0
    },
    {
        "title": "My greatest fears as an author",
        "author": "JD_Gameolorian",
        "url": "https://www.reddit.com/r/books/comments/119tqxk/my_greatest_fears_as_an_author/",
        "text": "They say you must conquer your fears, no matter what. But honestly, the fears I’m having right now aren’t easy to conquer. I always have this fear of “will books stay popular in the near future? Will AI take our place as authors?” These two questions always circle my mind and I really want a good straight answer, which isn’t easy I admit\n\nSo please, fellow book lovers. Give me your thought on these two questions, and don’t sugarcoat. Be as honest as possible!",
        "created_utc": 1677145219,
        "upvote_ratio": 1.0
    },
    {
        "title": "What % of your book collection have you read?",
        "author": "ShoonlightMadow",
        "url": "https://www.reddit.com/r/books/comments/119tkjz/what_of_your_book_collection_have_you_read/",
        "text": "[removed]",
        "created_utc": 1677144528,
        "upvote_ratio": 1.0
    },
    {
        "title": "I published a book",
        "author": "Klariessss",
        "url": "https://www.reddit.com/r/books/comments/119tj5q/i_published_a_book/",
        "text": "[removed]",
        "created_utc": 1677144365,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Ranked Every Book I Have Ever Read",
        "author": "zahaha",
        "url": "https://www.reddit.com/r/books/comments/119stm0/i_ranked_every_book_i_have_ever_read/",
        "text": "[removed]",
        "created_utc": 1677141631,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you experience cyclic reading habits?",
        "author": "tommy_the_bat",
        "url": "https://www.reddit.com/r/books/comments/119sodz/do_you_experience_cyclic_reading_habits/",
        "text": "[removed]",
        "created_utc": 1677141070,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you experience seasonal reading habits?",
        "author": "tommy_the_bat",
        "url": "https://www.reddit.com/r/books/comments/119snu9/do_you_experience_seasonal_reading_habits/",
        "text": "[removed]",
        "created_utc": 1677141013,
        "upvote_ratio": 1.0
    },
    {
        "title": "App to catalogue books",
        "author": "Sea_Spark_8579",
        "url": "https://www.reddit.com/r/books/comments/119rwmz/app_to_catalogue_books/",
        "text": "I've moved this week and am now in the situation that I could catalogue all my paper books before putting them back onto shelves. Can you recommend me an app where I could scan the IBAN or cover and it pulls up title &amp; author and compiles that into a list I can export to other devices? Don't care if it's .txt, .csv, .pdf or any other common editable format. Thank you!",
        "created_utc": 1677138129,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boost Your Amazon Book or Ebook Sales with Expert Promotion",
        "author": "Kind_Business8464",
        "url": "https://www.reddit.com/r/books/comments/119rlmt/boost_your_amazon_book_or_ebook_sales_with_expert/",
        "text": "[removed]",
        "created_utc": 1677136978,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book Edit In Tiktok",
        "author": "Dependent-Pea-3965",
        "url": "https://www.tiktok.com/@readtochangeofficial/video/7203246155491331330?is_from_webapp=1&amp;sender_device=pc&amp;web_id=7025969247492179457",
        "text": "",
        "created_utc": 1677136761,
        "upvote_ratio": 1.0
    },
    {
        "title": "Children Of Time",
        "author": "davidmason007",
        "url": "https://www.reddit.com/r/books/comments/119r59t/children_of_time/",
        "text": "I read Children Of Time by Adrian Tchaikovsky and here is what I thought about the book. I read the book in under a week, so it was a pretty captivating story.\n\nThe plot is really great, the evolution of spiders are very well thought out, and the concept of gender roles was interesting (the scientific and evolutionary basis). The things that happen in the other world (in human spaceship as well in Kern's world) seen by the other organism and their interpretation was very thought provoking, makes us think what would we humans have interpreted wrongly and never knew otherwise.\n\nThe concept of God is also very noval to me, since Kern actually is their creator, and they worship her from the beginning without knowing her at all, then finally working together with her was a new concept of god. God is not all knowing ,is ever changing and needs to adapt to her children's culture.\n\nThe thing striked me the most was the game theory/prisoners dilemma that the humans used when attacking the Kern's world towards the end of the book. Spiders did know about their alternative about the theory of prisoners dilemma, but they chose to cut the communication gap between them , saying that the dilemma should not have been existed in the first place. \nI am excited to see where the story goes in the sequels, the evolution of stomatopods, beetles are the things I look most towards.\n\nThe things I hated about the book is the lack of characters we can invest in. The spiders have only a span of few chapters, and the humans are not at all worth loving (evel Holsten). \nFrequent use of the phrase 'on the shoulders of giants/those who came before' constantly bugged me out, but that might not be a problem for anyone else.\n\nOverall the book was very enjoyable and thought provoking, I give it a rating of 7/10. What are your thoughts and insights on this book? What moments you thought were worth mentioning?",
        "created_utc": 1677135371,
        "upvote_ratio": 1.0
    },
    {
        "title": "ZkSync token is confirmed Reward 22.02.2023",
        "author": "Curious-Comfort3736",
        "url": "https://www.reddit.com/r/books/comments/119qyd6/zksync_token_is_confirmed_reward_22022023/",
        "text": "[removed]",
        "created_utc": 1677134687,
        "upvote_ratio": 1.0
    },
    {
        "title": "#SaveAWoundedSenior",
        "author": "pdmercy",
        "url": "https://www.reddit.com/r/books/comments/119q9rm/saveawoundedsenior/",
        "text": "[removed]",
        "created_utc": 1677132374,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Santiago die? In old man and the sea",
        "author": "Garbage-CanMan2905",
        "url": "https://www.reddit.com/r/books/comments/119prl7/does_santiago_die_in_old_man_and_the_sea/",
        "text": "[removed]",
        "created_utc": 1677130753,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you’ve read them, which of the books out of the entire Hannibal Lecter franchise is your favorite and why? Red Dragon, Silence of the Lambs, Hannibal, or Hannibal Rising",
        "author": "pablohax",
        "url": "https://www.reddit.com/r/books/comments/119phi6/if_youve_read_them_which_of_the_books_out_of_the/",
        "text": "[removed]",
        "created_utc": 1677129843,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which of the books out of the entire Hannibal Lecter franchise is your favorite and why?",
        "author": "pablohax",
        "url": "https://www.reddit.com/r/books/comments/119pf1y/which_of_the_books_out_of_the_entire_hannibal/",
        "text": "[removed]",
        "created_utc": 1677129621,
        "upvote_ratio": 1.0
    }
]