[
    {
        "title": "How to get access to a rare book?",
        "author": "celestial_goat7",
        "url": "https://www.reddit.com/r/books/comments/11fnvfk/how_to_get_access_to_a_rare_book/",
        "text": "Im wondering if anyone has any advice for getting access to rare books? There is a book I have in mind called \"The life of the harp in the hand of the harper\". Cannot find it online. It seems there are 2 copies at the denver public library but they are not in circulation, and 1 copy at the library of congress, but I am not a member and I guess you need to become a member in person? Is it likely I could get someone at the Denver library to scan it (191 pages)? or how should I go about this?",
        "created_utc": 1677718364,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your favorite 1,000+ page novel?",
        "author": "SadisticPeanut",
        "url": "https://www.reddit.com/r/books/comments/11fnts9/what_is_your_favorite_1000_page_novel/",
        "text": "[removed]",
        "created_utc": 1677718243,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it dumb of me to not want to buy hardcover books because I only own paperbacks? My friend said it was so I’m curious.",
        "author": "Ameliagonemad",
        "url": "https://www.reddit.com/r/books/comments/11fnsyc/is_it_dumb_of_me_to_not_want_to_buy_hardcover/",
        "text": "I have a somewhat small collection of books. Less than 100. All of them are paperbacks, half trade and half mass market. I prefer paperbacks in general. I can be rough with them and I just think the aesthetic of a paperback book is better than that of a hardback book. Also, I don’t feel right buying a pretty hardcover version of a book I haven’t read and might not really enjoy, you know? It feels…disingenuous, almost. And at this point I’m apprehensive to buy a hardback because it’ll seem like I love that book more than my others because it’s a pretty looking hardcover book…\n\nBecause of this, I’ve avoided buying hardcover books for years. Well, today my friend and I went to our local bookstore and they were having a sale on hardcover books. She was excited, I ignored it. When asked why, I told her my preference and she laughed and said it was stupid. Is it? I’ve not thought much about it but having her call it dumb is making me feel pretty dumb. \n\nWhat do you all think?",
        "created_utc": 1677718186,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else like reading a summary of the book when they finish?",
        "author": "Wanamasolo",
        "url": "https://www.reddit.com/r/books/comments/11fnooz/anyone_else_like_reading_a_summary_of_the_book/",
        "text": "[removed]",
        "created_utc": 1677717879,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your favorite Film adaptation of novels?",
        "author": "ManWith_ThePlan",
        "url": "https://www.reddit.com/r/books/comments/11fn5vl/whats_your_favorite_film_adaptation_of_novels/",
        "text": "For me personally, It’s hard but I think mines would have to be a toss up between A Clockwork Orange and American Psycho. I bought copies of both the novels Written by Bret Easton Ellis and Anthony Burgess  awhile before I even knew about their film adaptations.\n\nThere’re many movies I didn’t even know were originated in book before screen. No Country for Old Men, Silence of the Lambs, Taxi Driver, The Godfather, just too name a few.",
        "created_utc": 1677716544,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you prefer a book where the main character's description was broad or detailed?",
        "author": "_Halo21",
        "url": "https://www.reddit.com/r/books/comments/11fmxk8/would_you_prefer_a_book_where_the_main_characters/",
        "text": "Hi,\n\nI'm thinking about writing a book with a girl as the main character. If you were reading a book, would you prefer broad descriptions (for example Shiny hair, bright eyes, pretty smile, glowy skin), or would you prefer a book that describes a character in more detail (for example Big Brown eyes, purple hair, tanned skin, plump lips)? IDK just random descriptions, Just wanna know what y'all think :3",
        "created_utc": 1677715968,
        "upvote_ratio": 1.0
    },
    {
        "title": "Normal People by Sally Rooney made me feel normal after a long time",
        "author": "daymanAHAHahhhhhh",
        "url": "https://www.reddit.com/r/books/comments/11fmbn4/normal_people_by_sally_rooney_made_me_feel_normal/",
        "text": "I honestly didn't expect to like this book provided that the person who recommended it to me usually likes books I find to be okayish (we just have different tastes), but I decided to give it a go. While initially frustrated with the lack of quotation and a somewhat simplistic prose that seemed to struggle with the pointless back and forth between the protagonists (both of whom I found quite unlikeable at first), I found myself rooting for the characters way more than I thought I would. After a point, I didn't even find the conversations that they were having to be pointless and towards the end, I wanted more of it. I wanted them to keep on talking to each other because them trying to understand each other through subtle confession of their feelings somehow made the initial angst of lack of communication even more delicious. \n\nI think Rooney has managed to capture the loneliness that stems from the awareness we have of ourselves and others and the deep-seated need to belong to someone or something perfectly. What's more, the indecisiveness when it came to their feelings for each other (not really their feelings but more like the uncertain way they acted towards each other) that seemed to arise from an unspoken assumption of what the other would want made both Marianne and Connell as real to me as I myself am, and I am grateful that they made me feel normal in my own skin, my relationships, and my past. While my friend hated the open-ish ending, I loved it, because we do end up leaving a lot of chapters ion our life open, and for some reason, made me feel hopeful.",
        "created_utc": 1677714484,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a book that made you consistently smile as you read it?",
        "author": "Katie_Rea",
        "url": "https://www.reddit.com/r/books/comments/11fm53e/what_is_a_book_that_made_you_consistently_smile/",
        "text": "[removed]",
        "created_utc": 1677714031,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Thoughts on Re-Releases That Have Been Edited",
        "author": "symean",
        "url": "https://www.reddit.com/r/books/comments/11flpsw/my_thoughts_on_rereleases_that_have_been_edited/",
        "text": "I’m seeing a lot of controversy about books being re-released that have been edited for a more modern audience, you know…more ‘woke’.\n\nEasy solution to this would be to require publishers to identify that a book is not the original text. Say, if the original source material is more than 10 years old, they are legally bound to put an EDITED mark on it somewhere. That way customers can choose what they’re buying. If no one wants the edited versions, they’ll become more expensive and publishers will stop producing them. It would also stop a publisher deciding to only publish edited versions to keep the noisy minority happy and save on production costs.\n\nThat’s my two bob anyway.",
        "created_utc": 1677713029,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grady Hendrix",
        "author": "gavia___",
        "url": "https://www.reddit.com/r/books/comments/11flmrk/grady_hendrix/",
        "text": "[removed]",
        "created_utc": 1677712824,
        "upvote_ratio": 1.0
    },
    {
        "title": "ERAGORN or something else? u/ChristopherPaolini",
        "author": "LordVissaium",
        "url": "https://www.facebook.com/100044467718176/posts/pfbid0jpYiUpoSDqu5MERZ7BY7EbkdtpjuiQtLCKrswJDTR3BPjZgHCs9e3p3VwgQWAJpLl/?sfnsn=mo",
        "text": "",
        "created_utc": 1677711967,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lord loss",
        "author": "CatWithAHat120",
        "url": "https://www.reddit.com/r/books/comments/11fl7k8/lord_loss/",
        "text": "[removed]",
        "created_utc": 1677711854,
        "upvote_ratio": 1.0
    },
    {
        "title": "ONE TRUE LOVES book adaption Taylor Jenkins Reid - Trailer (2023)",
        "author": "bertina_izzy",
        "url": "https://youtu.be/p3PboMzVt8c",
        "text": "",
        "created_utc": 1677711460,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just finished “Cloud Cuckoo Land” by Anthony Doerr. The characters are so masterfully developed and entwined together. I have also read “All The Light We Cannot See” by him which I enjoyed a lot. I hope he writes more",
        "author": "OwenRocha",
        "url": "https://www.reddit.com/r/books/comments/11fkwm2/just_finished_cloud_cuckoo_land_by_anthony_doerr/",
        "text": "[removed]",
        "created_utc": 1677711154,
        "upvote_ratio": 1.0
    },
    {
        "title": "give me all your recommendations for books/novellas under 300pages",
        "author": "GraceWisdomVictory",
        "url": "https://www.reddit.com/r/books/comments/11fkuqu/give_me_all_your_recommendations_for/",
        "text": "[removed]",
        "created_utc": 1677711030,
        "upvote_ratio": 1.0
    },
    {
        "title": "Infinite Abundance by David Graham",
        "author": "ava_green_19",
        "url": "https://www.reddit.com/r/books/comments/11fkq8r/infinite_abundance_by_david_graham/",
        "text": "I think I should not tell this online. But anyway... I want to benefit people. My Friend Told me about this book a month ago. He said I've made $12,130.55 Dollars using this book. And Told me to try CHAPTERS 38 and do Exact Steps from this book. I did the Exact Steps from this book and in a Month I've made $743.68 Dollars.\n\nI just Love this Book. in this book there's write 100 Easy ways to make money Online and Exact Steps that what you have to Do. \n\nI'm so Lucky that I've Found this Book and I've Wanted to share it with People who want Money.\n\n\nBut I will Never tell about this book to my friend I don't want her to be Rich. This Book is My Secret.",
        "created_utc": 1677710736,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally finished \"The Count of Monte Cristo\" by Alexandre Dumas, and I'm dying to talk about it",
        "author": "nikocheeko",
        "url": "https://www.reddit.com/r/books/comments/11fkja7/finally_finished_the_count_of_monte_cristo_by/",
        "text": " I recently finished The Count of Monte Cristo and my goodness do I have some thoughts on it. It took me about five months to finish it but every second kept me engrossed. It started when I read a post here probably close to a year ago singing its praises, and immediately put it on my ever-growing 'to read' list. After getting it for my birthday last year, I finally sat down and started reading it in early September of 2022.\n\nComing from reading basically only non-fiction works, I was surprised by how this book *immediately* got me hooked. I fell in love with Edmond Dantes character, and his betrayal, loss and heartbreak genuinely affected me. I found myself so frustrated at his turmoil, and wanted nothing more than his revenge to be brutal and all encompassing. Seeing the fall from grace of this young, idealistic and just genuinely good hearted kid, into a cynical, mean-spirited and extravagant man was just something that made me feel emotions from words on a page I had never experienced previously.\n\nReally the entire cast of characters Dumas created I found to be extremely compelling and interesting to read about.Off the top of my head there's Noirteir, the entire Danglars family, Andrea Cavalcanti, and Haydèe to name a few. And of course the titular Count was the star of the show every time he appeared on page. I found myself as in awe of him as were the people around him. His long drawn out plan of revenge was as fun to behold as it was impossible to predict. I do wish we could've heard about the aftermath of all the characters. I was particularly interested in what happened afterwards to more minor characters such as Andrea and Franz specifically. I felt as though their characters had quite a lot of build-up but were essentially forgotten about once they'd fulfilled their purpose to the Count. Other than that, the bit of a slog in the middle, and a few minor gripes (Didn't get the translation by Buss so apparently there were quite a few changes and removals made in my translation) I think this is quite possible my favorite book I've read. Certainly my longest read!\n\nI'd love to hear everyone else's thoughts!",
        "created_utc": 1677710303,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone help me find this Nabokov book and passage?",
        "author": "Apart-Warning4328",
        "url": "https://www.reddit.com/r/books/comments/11fkfv5/can_anyone_help_me_find_this_nabokov_book_and/",
        "text": "I remember almost exactly nothing about it except the usage of words \"employ\" and then \"time and space\" I think? I used to have the quote saved on my old phone because I wanted to read the entire book but I now lost it... If I recall correctly the whole thing was him refuting God. Please help me find it if you can, I've been haunted by his writings",
        "created_utc": 1677710090,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone know what this is?",
        "author": "Electronic-Angle5490",
        "url": "https://www.reddit.com/r/books/comments/11fkfca/anyone_know_what_this_is/",
        "text": "[removed]",
        "created_utc": 1677710056,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m literally heartbroken",
        "author": "finnwittrockswhore",
        "url": "https://www.reddit.com/r/books/comments/11fk4w6/im_literally_heartbroken/",
        "text": "I’ve had many times where a book has left me feeling sad but this time feels different. I feel like I’m going through an actual break up. I know it’s dramatic as hell but I was sobbing at work when I finished it. My heart kind of hurts, My stomach feels funny, I can’t even eat right now. This is crazy but I feel like I need to heal from this and it was just a damn book lol. Has any one else ever felt this wrecked after a book? \n\nI’m gonna have some wine and rebound with another story so I can move on😭",
        "created_utc": 1677709406,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Sword of Truth",
        "author": "Merio1997",
        "url": "https://www.reddit.com/r/books/comments/11fjpxn/the_sword_of_truth/",
        "text": "[removed]",
        "created_utc": 1677708486,
        "upvote_ratio": 1.0
    },
    {
        "title": "'Eggplant' instead of 'Aubergine' in Bram Stoker's Dracula?",
        "author": "juli_ane-b",
        "url": "https://www.reddit.com/r/books/comments/11fiwer/eggplant_instead_of_aubergine_in_bram_stokers/",
        "text": "I just started reading Dracula in English for the first time (I'm a non-native speaker) and right at the beginning of the first chapter Jonathan Harker describes a dish \"egg-plant stuffed with forcemeat\" (p.3 in my edition - Puffin Clothbound Classics).\n\nI might be wrong but I learned that 'Egg-plant' is only used in the US &amp; Canada. So I was surprised to see it used by an English (?) character  in a book by an Irish author.\n\nDoes someone know why this is?\nI just thought it was curious and was wondering if I was wrong with thinking eggplant is an exclusively american term.",
        "created_utc": 1677706621,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hurry up to pick up the from Optimism $OP.",
        "author": "vetanoo",
        "url": "https://www.reddit.com/r/books/comments/11fis82/hurry_up_to_pick_up_the_from_optimism_op/",
        "text": "[removed]",
        "created_utc": 1677706362,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the 1st instance of \"matrix like\" jacking do you know in hard sci/fy?",
        "author": "Previous_Astronaut22",
        "url": "https://www.reddit.com/r/books/comments/11fipo9/whats_the_1st_instance_of_matrix_like_jacking_do/",
        "text": "I'm readding the Hyperion books (dan simmons) and it hit me that the way dan describes people going into datasphere reminds me of the matrix... I'm not sure if this inspired the matrix or if this was the 1st instance of something like this was talked about.... is there an earlier idea of people jacking into a computer system like this or was this the 1st one?\n\n&amp;#x200B;\n\nIf there is an earlier one, I'd like to read it. Please and thank you.",
        "created_utc": 1677706206,
        "upvote_ratio": 1.0
    },
    {
        "title": "What websites are good to check upcoming books and their blurbs?",
        "author": "Samazra_Wolgon",
        "url": "https://www.reddit.com/r/books/comments/11fid6w/what_websites_are_good_to_check_upcoming_books/",
        "text": "I want a website like Goodreads where I can browse upcoming books, but I also want each book to have a blurb ready at the bottom or something. \n\nWith Goodreads, I have to manually click on each book, and with the many many books releasing every week, this process is quite lengthy and inefficient. \n\nSo I'm hoping y’all know a website that has a list of all (or most) upcoming books with blurbs ready to be read.",
        "created_utc": 1677705407,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any fiction books published in Ireland about OCD?",
        "author": "petalmouse",
        "url": "https://www.reddit.com/r/books/comments/11fi94u/are_there_any_fiction_books_published_in_ireland/",
        "text": "I’m mostly looking for children’s books anywhere from picture books to YA, published in Ireland, but I’m struggling to find any that are about OCD. Any of them - are there are few - are technical manuals for parents. \n\nI’d love to hunt down more representations here in fiction but I’m finding it difficult.",
        "created_utc": 1677705155,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finished : everyday by David levithan … I LOVED THIS BOOK But the ending kind of hurts …",
        "author": "amxgxne",
        "url": "https://www.reddit.com/r/books/comments/11fi7gi/finished_everyday_by_david_levithan_i_loved_this/",
        "text": "So the book started off with the Soul A falling in love with a girl name Rhiannon &amp; I realized later on in the book A fell in love with her sadness and the fact that Justin wasn’t treating her right . A was also looking for love to actually feel something other than lost since he was going from body to body and felt like he had nothing to actually live for .\nI did start to think the same way as Rhiannon that A was wrong for changing these peoples daily routines just so he can go see her . I was starting to get worried for the lives he was taking over and got happy when Rhiannon put some sense into his head . \nMy MAIN CONCERN IS the reverend. Is he like A? How does he get to stay in one body &amp; what happens to the other soul? What does he want with A ? I also feel so bad for Nathan because he took it to far to late . I need more answers . \nIf you have read the next two books Another day , someday, please let me know if they are worth the read . \nTHE ENDING … A just left , where does A go ? At first I was so confused because you did all of this and emailed the reverend without telling us exactly what he responded back, just to leave !!! I get that he gave Rhiannon someone good to love but what about you A ? That’s what made me sad when I start to realize A loved her so much A gave Rhiannon someone good to be with even if it meant it wasn’t going to be A . \nSorry if this is all over the place but it’s just a crazy book lol . If you have read this book please give me your thoughts",
        "created_utc": 1677705054,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your desert island literary fiction book?",
        "author": "IskaralPustFanClub",
        "url": "https://www.reddit.com/r/books/comments/11fi7dy/what_is_your_desert_island_literary_fiction_book/",
        "text": "[removed]",
        "created_utc": 1677705050,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to not fall asleep while reading?",
        "author": "Lohynochka",
        "url": "https://www.reddit.com/r/books/comments/11fi3ze/how_to_not_fall_asleep_while_reading/",
        "text": "Hi, so basically I am in last year of college and I really need to prepare for exams. There is a ton of literature for me to reed but after about 20 minutes of reading I feel sleepy and eventually falling asleep. This kind of problem is new to me because I used to love reading. I would sit with a book for a day or two but now I can’t read anything at all. I think it will get even worse after the college in university where I will need to read even more stuff. I would really thankful and glad for all of your suggestions.",
        "created_utc": 1677704847,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me find this book!",
        "author": "Timely-Attention5039",
        "url": "https://www.reddit.com/r/books/comments/11fhy9y/help_me_find_this_book/",
        "text": "So I read this book a few years back, I borrowed it from my local library, and it happened to be one of my favorite reads of all time. Unfortunately, I have since then returned the book and forgot the title, but I can still vaguely remember the plot. It was about this girl who would take a ferry in order to meet in secret with her boyfriend since they weren't allowed to date, I'm assuming. She then meets this guy who's new to town, and they start becoming close. However, she's still very much in love with her boyfriend. We later find out that said boyfriend has died due to a boating accident, and she's been imagining him this entire time. The cover was all white and it was snowing and there were two figures sitting next to each other. That's all I can remember. Please let me know if this sounds familiar!",
        "created_utc": 1677704503,
        "upvote_ratio": 1.0
    },
    {
        "title": "'A little bit more anonymous' libraries are providing safe spaces to seek support",
        "author": "AlamutJones",
        "url": "https://www.abc.net.au/news/2023-03-01/library-become-safe-community-spaces-dv-emergencies/102014780",
        "text": "",
        "created_utc": 1677704359,
        "upvote_ratio": 1.0
    },
    {
        "title": "I love The Alchemist by Paulo Coelho",
        "author": "sarbaddict843",
        "url": "https://www.reddit.com/r/books/comments/11fhnm0/i_love_the_alchemist_by_paulo_coelho/",
        "text": "[removed]",
        "created_utc": 1677703863,
        "upvote_ratio": 1.0
    },
    {
        "title": "Every day By David Levithan",
        "author": "amxgxne",
        "url": "https://www.reddit.com/r/books/comments/11fhmvd/every_day_by_david_levithan/",
        "text": "[removed]",
        "created_utc": 1677703820,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with book name?",
        "author": "CoderStudios",
        "url": "https://www.reddit.com/r/books/comments/11fhg7g/help_with_book_name/",
        "text": "(Playing in a fantasy medieval world)\nI remember reading a book, it was about an orphan that was supposed to be transported to a Nobel that owned the orphanage, but the carriage crashed (down a cliff) and she/he escaped. Wounded (arm), and only way out is trough a dangerous forest (I think) survives and gets stronger. After some time MC is at a city learning smithing, and meets old friends from orphanage that escaped. Gives friends a hand. Cooks a some sort of soup and other things for other smiths. Knows things master/head smith doesn’t so MC gets special treatment. And I remember the concept of beginner adventurers and beginner smiths working together. (Because beginner smiths must fund their learning and beginner adventurers needs cheap equipment)",
        "created_utc": 1677703424,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you’re interested,",
        "author": "AlarmingKangaroo7948",
        "url": "https://www.reddit.com/r/books/comments/11fh8sq/if_youre_interested/",
        "text": "Hey everyone! Not sure if this will get taken down or not but my best friend just had their book published! For those into spirituality and finding your place in this world, dealing with depression or just curious as to how you can find more meaning in your life! \n\nHe is a former member of the Canadian Armed Forces and wrote this book as “the book I wish someone gave me when I was at my lowest point” \n\nIf it interests you please find out more or check it out at these links! \n\nhttps://books.friesenpress.com/store/title/119734000289060614/David-Lee-Sadai-Unraveling-Madness\n\nhttps://www.unravelingmadness.com\n\nCheers everyone and happy reading!",
        "created_utc": 1677702994,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you count long essays towards your reading goal?",
        "author": "waterisgoodok",
        "url": "https://www.reddit.com/r/books/comments/11fgv10/do_you_count_long_essays_towards_your_reading_goal/",
        "text": "[removed]",
        "created_utc": 1677702285,
        "upvote_ratio": 1.0
    },
    {
        "title": "November 9 by Colleen Hoover song",
        "author": "OverBid6548",
        "url": "https://www.reddit.com/r/books/comments/11fgsd0/november_9_by_colleen_hoover_song/",
        "text": "[removed]",
        "created_utc": 1677702157,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best way to choose who facilitates each month's book choices in a book club?",
        "author": "slayaboy87",
        "url": "https://www.reddit.com/r/books/comments/11fgfyy/best_way_to_choose_who_facilitates_each_months/",
        "text": "Hello, I'm currently starting a new book club, my first time, and as such designated myself as the first month's \"facilitator\" who nominates the books that the members would vote on, choose the place to meet, and lead the discussion at that meeting.\n\nHow about moving forward? I would think a random pick, like names in a bowl, would work out best. However, my friend thinks we ask for volunteers and the group votes on who it should be out of those volunteers. I'm worried that would set the stage for drama or conflict, because stronger personalities would prevail, and leave more timid personalities to just give up their chance to avoid conflict, or trying to campaign for votes. Am I being paranoid?",
        "created_utc": 1677701611,
        "upvote_ratio": 1.0
    },
    {
        "title": "i Need a book name idea",
        "author": "Luvz_Oliver",
        "url": "https://www.reddit.com/r/books/comments/11fg2h4/i_need_a_book_name_idea/",
        "text": "So, there's this girl named Sally and she lives a good life:she has a good job,a cool house,an awesome partner, a pet to love and she's wealthy enough to have an happy life. One day she finds out she's in a book and at the end she fades  in the phrase:\"in this book she was alive,and you saw it.but good things always come to an end eventually.\"\nI really need a name for the book",
        "created_utc": 1677701114,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you're looking to get into audio books and don't have audible, you can get 6 books for about $22.50",
        "author": "TheAirNomad11",
        "url": "https://www.reddit.com/r/books/comments/11ffurm/if_youre_looking_to_get_into_audio_books_and_dont/",
        "text": "I found a really good deal on audible and thought I'd share it. Unfortunately it is only for new accounts though. So I recently did a free trial on audible because they give you 2 free credits. When I went to cancel my subscription, they offered me 3 months at half off ($7.50) if I stayed. And after spending 3 credits, you get a $10 coupon (which is almost a free book depending on what you spend it on. Use it toward whatever book will be cheapest). So for a little more than $22.50, you can get 6 books, which averages out to $3.75 a book. And you will also have access to all their free books for 4 months. Definitely a great deal!",
        "created_utc": 1677700861,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where do you all buy your books? I can’t spend much on them but love to read.",
        "author": "JanesLoveThrwy",
        "url": "https://www.reddit.com/r/books/comments/11fft52/where_do_you_all_buy_your_books_i_cant_spend_much/",
        "text": "I’m having a bit of trouble finding the best market for books. I’ve used Amazon a lot, but I don’t really like supporting them, the copies can get expensive, and my books always arrive damaged in some way. But I don’t know where else to buy books from. There are no book stores around where I live, and the only place I can ever find books is at a thrift store that rarely stocks them. Where do you all buy your books? I prefer paperbacks and honestly don’t mind the state of a book, so long as it’s not dirty and is perfectly readable, I’d be fine with used books; I just don’t know of any reputable sites to buy used books. Or of any alternatives to Amazon. And I don’t read ebooks or audiobooks. \n\nCan anyone help me out here?",
        "created_utc": 1677700812,
        "upvote_ratio": 1.0
    },
    {
        "title": "A hundred years of solitude",
        "author": "Neila144",
        "url": "https://www.reddit.com/r/books/comments/11ffa6f/a_hundred_years_of_solitude/",
        "text": "I got a second edition dated june 1967 of A Hundred Years of Solitude and was wondering if anyone knows how much it's worth?\n\nI know first editions go even for 12000€. Now, I know mine would probably be around a tenth of what a first edition is worth, especially since it's not in great conditions, but it would be great to know exactly how much. \n\nI got an extensive library, but not a lot of first editions or even second editions. This one I found by accident in a thrift shop.",
        "created_utc": 1677700193,
        "upvote_ratio": 1.0
    },
    {
        "title": "Read the Kinky Coily Goddess Blog",
        "author": "Due_Ad_890",
        "url": "https://www.reddit.com/r/books/comments/11ff72m/read_the_kinky_coily_goddess_blog/",
        "text": "[removed]",
        "created_utc": 1677700092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got a second edition june 1967 of A hundred years of solitude",
        "author": "Neila144",
        "url": "https://www.reddit.com/r/books/comments/11fexru/got_a_second_edition_june_1967_of_a_hundred_years/",
        "text": "[removed]",
        "created_utc": 1677699794,
        "upvote_ratio": 1.0
    },
    {
        "title": "Protect books from sunlight",
        "author": "Bookishoxygen",
        "url": "https://www.reddit.com/r/books/comments/11fewz6/protect_books_from_sunlight/",
        "text": "I’m in the middle of a (hurried) move and my bookcases will catch some afternoon sun coming through the windows. They’re obviously very precious to me and I’d hate for their colors to fade due to the sunlight or  other sun-related-stuff.\n\nI wanted to ask if anyone here has been in this situation before and has some tips as to what to do to protect the books as best as you can in an average living room? Is there some kind of special foil that blocks whatever ‘damages’ the books but lets in some sun? \nI’m open to any suggestions!\n\nMore information: \nI will see if I’m able to move the furniture around to make sure the book cases aren’t in any direct sunlight, however as I’m in a hurry to move I can’t really take my time to figure that out right now.\nWe’re talking about 500 books and I’m moving to a smaller apartment.",
        "created_utc": 1677699769,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for nonfiction history recommendations",
        "author": "theofficialbigcheese",
        "url": "https://www.reddit.com/r/books/comments/11feu8a/looking_for_nonfiction_history_recommendations/",
        "text": "[removed]",
        "created_utc": 1677699680,
        "upvote_ratio": 1.0
    },
    {
        "title": "Loved this review of South of Happily. Thank you!!",
        "author": "Gaby-Writes-Books",
        "url": "https://www.reddit.com/r/u_Gaby-Writes-Books/comments/11feltz/loved_this_review_of_south_of_happily_thank_you/",
        "text": " \n\n[*5.0 out of 5 stars*](https://www.amazon.com/gp/customer-reviews/R22I1PC5BDPPRZ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&amp;ASIN=1685131042)[ I needed some Happily in my life ](https://www.amazon.com/gp/customer-reviews/R22I1PC5BDPPRZ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&amp;ASIN=1685131042)\n\nReviewed in the United States 🇺🇸 on January 29, 2023\n\n[Verified Purchase](https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G75XTB7MBMBTXP6W)\n\nI truly enjoyed this book.  It made me laugh out loud and also  cry out loud.  And my cheeks hurt from all the smiling I did at the end",
        "created_utc": 1677699415,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommendations - historical fiction",
        "author": "conniecatmeow",
        "url": "https://www.reddit.com/r/books/comments/11fekwc/recommendations_historical_fiction/",
        "text": "Hello readers! I’m after some recommendations for books based around historical events.\n\nSimilar to the story within the story of the seven sister novels, where stories were set around certain events in history - building of Christ the Redeemer, WW2, the IRA etc.\nI’ve also liked Geraldine’s Brookes The Year of Wonders, which takes place during the Black Plague.\nNot so much the Royal Family type of fiction as I’ve read a lot of Philippa Gregory and Alison Weir.\n\nThank you in advance!",
        "created_utc": 1677699385,
        "upvote_ratio": 1.0
    },
    {
        "title": "Love this review! Thank you!",
        "author": "Gaby-Writes-Books",
        "url": "https://i.redd.it/uwdhkiizj6la1.jpg",
        "text": "",
        "created_utc": 1677699345,
        "upvote_ratio": 1.0
    },
    {
        "title": "Contraception Intra-utérin (Dispositif Intra-Utérin) - ppt télécharger",
        "author": "Difficult_Ant1290",
        "url": "https://slideplayer.fr/slide/3301848/#.Y_-lKf-aaoM.reddit",
        "text": "",
        "created_utc": 1677698376,
        "upvote_ratio": 0.99
    },
    {
        "title": "Stephen King - The Stand - links to \"The Second Coming\" by William Butler Yeats",
        "author": "ChronicCrit",
        "url": "https://www.reddit.com/r/books/comments/11fd9oq/stephen_king_the_stand_links_to_the_second_coming/",
        "text": "[removed]",
        "created_utc": 1677697898,
        "upvote_ratio": 1.0
    },
    {
        "title": "Religious Horror without supernatural elements",
        "author": "MrPhistr69",
        "url": "https://www.reddit.com/r/books/comments/11fcgwe/religious_horror_without_supernatural_elements/",
        "text": "[removed]",
        "created_utc": 1677697013,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you add audio books as “read” on Goodreads?",
        "author": "PlanNo3321",
        "url": "https://www.reddit.com/r/books/comments/11fc8w7/do_you_add_audio_books_as_read_on_goodreads/",
        "text": "[removed]",
        "created_utc": 1677696764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone got any recommendations for books similar to the Spook book series?",
        "author": "Potato_Salesperson",
        "url": "https://www.reddit.com/r/books/comments/11fblgg/anyone_got_any_recommendations_for_books_similar/",
        "text": "[removed]",
        "created_utc": 1677696045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need a non fiction book title. It’s a business book. I thought it was called “the sixth level”.",
        "author": "muckinfunchies",
        "url": "https://www.reddit.com/r/books/comments/11fbjeg/need_a_non_fiction_book_title_its_a_business_book/",
        "text": "[removed]",
        "created_utc": 1677695932,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anybody else….",
        "author": "kinddye",
        "url": "https://www.reddit.com/r/books/comments/11fbdhw/has_anybody_else/",
        "text": "[removed]",
        "created_utc": 1677695542,
        "upvote_ratio": 1.0
    },
    {
        "title": "POLL: What is the great American epic?",
        "author": "classofthetrash",
        "url": "https://www.reddit.com/r/books/comments/11fbcl8/poll_what_is_the_great_american_epic/",
        "text": "[removed]",
        "created_utc": 1677695486,
        "upvote_ratio": 1.0
    },
    {
        "title": "Debut Novel",
        "author": "tseidenburg18",
        "url": "https://www.reddit.com/r/books/comments/11fba4l/debut_novel/",
        "text": "[removed]",
        "created_utc": 1677695335,
        "upvote_ratio": 1.0
    },
    {
        "title": "The joy of Eid and the sadness of departing Ramadan.",
        "author": "Suspicious_Cover_775",
        "url": "https://thequranjourney.com/the-joy-of-eid-and-the-sadness-of-departing-ramadan/",
        "text": "",
        "created_utc": 1677695257,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there, or is there not, going to be an AMA w/ Neal Stephenson?",
        "author": "UnspentTx",
        "url": "https://www.reddit.com/r/books/comments/11fb558/is_there_or_is_there_not_going_to_be_an_ama_w/",
        "text": "[removed]",
        "created_utc": 1677695021,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any suggestions on motivation books for teens ( fictional, real stories , science etc) ?",
        "author": "paperjena",
        "url": "https://www.reddit.com/r/books/comments/11fb1as/any_suggestions_on_motivation_books_for_teens/",
        "text": "[removed]",
        "created_utc": 1677694780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Robert Cormier’s The Chocolate War (and its sequel)",
        "author": "twindrillz",
        "url": "https://www.reddit.com/r/books/comments/11fb02g/robert_cormiers_the_chocolate_war_and_its_sequel/",
        "text": "I find The Chocolate War to be a very interesting book. It’s a story of hierarchy, manipulation, our roles in society, and one boy’s effort to rebel against the oppressive regime within his high school. It was at times hard to read the main antagonists’ sly manipulation, but it made it all the more effective to demonstrate how ambitiously selfish a few teenage boys can be. The ending is especially harrowing once Jerry, the one we’ve been rooting for to put an end to the madness, realizes his place in society and ultimately gives up his fight. There’s even a pretty great movie adaptation.\n\nHowever…the same cannot be said for its sequel Beyond The Chocolate War, which I didn’t even realize existed until fairly recently. Compared to the original, this just felt like a slog. There’s some darker elements and manipulation tactics in play, plus a more tragic outcome for one of the newly introduced characters, but ultimately this book felt like more of the same. I also don’t really see the point of reintroducing Jerry, seeing as how he’s become much less of a main character in this installment. I’m pretty sure he gets dropped from the story only a few pages after his reintroduction, though this book bored me too much to the point of being unable to hold my attention well. At this point, I’d consider this sequel utterly non-canon.\n\nWhat does this sub think of these two books, though?",
        "created_utc": 1677694705,
        "upvote_ratio": 1.0
    },
    {
        "title": "POLL: What is the great American Epic?",
        "author": "classofthetrash",
        "url": "https://www.reddit.com/r/books/comments/11faz3b/poll_what_is_the_great_american_epic/",
        "text": " Epics of great empires:   \n\nBabylon —&gt; Gilgamesh \n\nGreeks —&gt; Iliad and Odyssey \n\nRome —&gt; Aeneid  \n\nEngland —&gt; Beowulf \n\nSpain —&gt; El Cid \n\nFrance —&gt; Song of Roland   \n\n\nAmerica? \n\nMoby Dick? Star Wars? Huck Finn? MCU?   \n\n\nInteresting answer here: \n\n[https://booksworthreading.substack.com/p/in-search-of-the-great-american-epic](https://booksworthreading.substack.com/p/in-search-of-the-great-american-epic)",
        "created_utc": 1677694639,
        "upvote_ratio": 1.0
    },
    {
        "title": "Almond !",
        "author": "Less-Watercress4581",
        "url": "https://www.reddit.com/r/books/comments/11fawfk/almond/",
        "text": "[removed]",
        "created_utc": 1677694473,
        "upvote_ratio": 1.0
    },
    {
        "title": "anyone familiar with the great library series by Rachel Caine?",
        "author": "ZombieBoi05",
        "url": "https://www.reddit.com/r/books/comments/11faog7/anyone_familiar_with_the_great_library_series_by/",
        "text": "Okay, so I have started reading this series and so far I'm only on the 3rd book. It is very interesting and I have looked almost everywhere for anyone else who has enjoyed this series. I can't seem to find anyone or anywhere that has some kind of group like fandom for this book series and I would love to talk about it with someone without having to explain to them the whole book.",
        "created_utc": 1677693967,
        "upvote_ratio": 1.0
    },
    {
        "title": "WORLD IN 2050, WRITTEN BY AN AI",
        "author": "SafeTouch6845",
        "url": "https://www.reddit.com/r/books/comments/11fadbe/world_in_2050_written_by_an_ai/",
        "text": "[removed]",
        "created_utc": 1677693276,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just learned about Magical Realism",
        "author": "demon803",
        "url": "https://www.reddit.com/r/books/comments/11facg3/just_learned_about_magical_realism/",
        "text": "[removed]",
        "created_utc": 1677693221,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Double Life of John le Carré",
        "author": "blueneuronDOTnet",
        "url": "https://www.theatlantic.com/books/archive/2023/02/john-le-carre-spy-came-in-from-cold-book/673227/?utm_source=copy-link&amp;utm_medium=social&amp;utm_campaign=share",
        "text": "",
        "created_utc": 1677693097,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm in the first half of Hyperion and I just can't stand Martin Silenus.",
        "author": "Ghaenor",
        "url": "https://www.reddit.com/r/books/comments/11fa4b0/im_in_the_first_half_of_hyperion_and_i_just_cant/",
        "text": "The character is unlikeable : he's never fun, never witty, never even remotely interesting. His swearing is forced and the character seems to be the crystallization of a 16 year-old's fantasy about what a cool, old, transgressive artist would be.\n\nI wasn't really interested in Kassad's urges but it wasn't such a drag to read.\n\nHe's ruining my reading of what is actually an enjoyable science-fiction universe.\n\nCan I just skip Silenus' story ?",
        "created_utc": 1677692677,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey everyone! I'm a book cover designer looking for new authors to work with, if anyone's interested just send me a message",
        "author": "QuirkyHalf7255",
        "url": "https://www.reddit.com/r/books/comments/11fa2h2/hey_everyone_im_a_book_cover_designer_looking_for/",
        "text": "[removed]",
        "created_utc": 1677692558,
        "upvote_ratio": 1.0
    },
    {
        "title": "sites where you can listen to audiobooks for free?",
        "author": "nevercursd",
        "url": "https://www.reddit.com/r/books/comments/11f9vw4/sites_where_you_can_listen_to_audiobooks_for_free/",
        "text": "[removed]",
        "created_utc": 1677692140,
        "upvote_ratio": 1.0
    },
    {
        "title": "For those of you who are into books on personal development, investing, entrepreneurship, or technology…",
        "author": "HJPearson",
        "url": "https://www.reddit.com/r/books/comments/11f9a5e/for_those_of_you_who_are_into_books_on_personal/",
        "text": "There’s a relatively new and free email list called Morning Chapter. It summarizes the most important points from books on these topics and delivers them via email 3 times a week. And all subscribers have access to the library of book summaries that have been previously covered on the email list. \n\n[Morning Chapter](https://morningchapter.com)",
        "created_utc": 1677690738,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best sources of (legally) free books?",
        "author": "EnaGrimm",
        "url": "https://www.reddit.com/r/books/comments/11f8ki0/best_sources_of_legally_free_books/",
        "text": " Hi everyone! Long-time reader here (of books and r/books). I’ve been getting more and more into contemporary non-fiction. Books at my library are always on hold so I’m trying to figure out where else I can get lots of non-fiction content for free. Ideally in a format I can read on my laptop and phone too. It can be short because I mostly read on my commute.",
        "created_utc": 1677689076,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a line or passage from a book that, in hindsight, changed your life?",
        "author": "musicnothing",
        "url": "https://www.reddit.com/r/books/comments/11f896u/what_is_a_line_or_passage_from_a_book_that_in/",
        "text": "There are certain bits of books I've read that I didn't think would be life-changing when I read them, but I end up thinking about them often and realized that I have changed my behavior because of them. Are there any that you can think of? Here's one of mine:\n\nFrom \"Carter Beats the Devil\" by Glen Gold:\n\n&gt; \"You know what the hardest thing is?\" Phoebe said, as the first pair of fireworks went up. \"The hardest thing is to know everything you know so far and still have faith.\"\n\n&gt; A sizzling sound, as a ratty-looking brownish smoke trail ignited, and bits of carbonized paper rained down. And then two purple ones, twisting like a pari of snakes, and a *boom* as sparks made a brief, flickering halo.\n\n&gt; It would be easy to pretend to feel faith this moment, suspended over Oakland, with fireworks bursting. Carter closed his eyes. To hear them was to notice that no matter how bright, they were all launched with dull thumps.\n\n&gt; But then the people. The cries from the ground, the exclamations.\n\n&gt;He opened his eyes. He saw Phoebe, listening to pops and whizzing above. He wasn't lonely. Faith was a choice. So, it followed, was wonder.\n\n&gt; By the finale of the display, a half-dozen rose-colored smoke trails dusted with glitter that caught the sunlight like diamonds, he'd found a voice in himself, calling \"bravo\" with the rest of the crowd. It was unbelievable—he was actually disappointed when they ended.\n\nThis book, and this passage in particular, have helped me to be less cynical and to enjoy things in life more. We went to the Grand Canyon and I found myself *choosing* to be blown away by it. I'm sure I would have been amazed, but I realized that wonder really is a choice and you can choose to be cynical or underwhelmed, or you can choose to get swept away.",
        "created_utc": 1677688329,
        "upvote_ratio": 1.0
    },
    {
        "title": "should I do it?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677686632,
        "upvote_ratio": 0.75
    },
    {
        "title": "Books like \"Bifocal\" by Deborah Ellis and Eric Walters (Canadian book)",
        "author": "Most_Ad904",
        "url": "https://www.reddit.com/r/books/comments/11f7by7/books_like_bifocal_by_deborah_ellis_and_eric/",
        "text": "So, I'll be honest I'm not much of a reader, and as an eighteen-year-old right now I barely read a couple of books in a year at most (even those would be about self-improvement. But, if there's one book that stood out to me and that I am constantly reminded of and wonder about, it's \"Bifocal\" by Deborah Ellis and Eric Walters.\n\nI know, by searching it up most of you will see it's a young adult's book and will laugh at me for just mentioning such a book and yes I did read this initially when I was like 12-13. But, something about it just always stuck with me, maybe it's just how it talked about the Canadian high-school experience and how I've been able to resonate with some of the story as I've grown older and it gives a nostalgic vibe. But, I just can't stop thinking about it which is really strange because I've pretty much never had this experience with any other book. So, I was wondering if anyone knows of other books that are similar to this one? (obviously ones that are more suited for late teens)",
        "created_utc": 1677686178,
        "upvote_ratio": 1.0
    },
    {
        "title": "First Self-Help Book Written by ChatGPT",
        "author": "misbahsy",
        "url": "https://www.reddit.com/r/books/comments/11f6s0y/first_selfhelp_book_written_by_chatgpt/",
        "text": "[removed]",
        "created_utc": 1677684843,
        "upvote_ratio": 0.4
    },
    {
        "title": "Queston about life if pi book Up to chapter three.( overall confused)",
        "author": "Allie_W21",
        "url": "https://www.reddit.com/r/books/comments/11f6rmr/queston_about_life_if_pi_book_up_to_chapter_three/",
        "text": "[removed]",
        "created_utc": 1677684817,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cover art",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677684497,
        "upvote_ratio": 1.0
    },
    {
        "title": "Goodnight From Paris, a review by Di",
        "author": "Grand-Grapefruit9370",
        "url": "https://thebookreviewcrew.com/goodnight-from-paris-a-review-by-di/",
        "text": "",
        "created_utc": 1677684459,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lost Man Booker Prize of 1970",
        "author": "lizzieismydog",
        "url": "https://www.reddit.com/r/books/comments/11f6arj/lost_man_booker_prize_of_1970/",
        "text": "Mary Renault's \"A Fire From Heaven\" and Len Deighton's Bomber were on it. I recommend both. Also Master and Commander which irritated me (get off the dock and onto the boat!)\n\n**In 1971, just two years after it began, the Booker Prize ceased to be awarded retrospectively and became a prize for the best novel of the year of publication. At the same time the award moved from April to November, resulting in a wealth of fiction published for much of 1970 not being considered for the prize. Some 40 years on, a panel of three judges - all of whom were born in or around 1970 - was appointed to select a shortlist of six novels from that year.**\n\n **The Lost Man Booker Prize was a one-off prize to honour the books that missed out on the opportunity to win the Booker Prize in 1970.** \n\n[https://thebookerprizes.com/the-lost-man-booker?utm\\_source=substack&amp;utm\\_medium=email](https://thebookerprizes.com/the-lost-man-booker?utm_source=substack&amp;utm_medium=email)",
        "created_utc": 1677683724,
        "upvote_ratio": 0.71
    },
    {
        "title": "Greek Mythology book recommendations.",
        "author": "anthropodm",
        "url": "https://www.reddit.com/r/books/comments/11f691q/greek_mythology_book_recommendations/",
        "text": "[removed]",
        "created_utc": 1677683612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hail Mary SEVERELY OVERRATED",
        "author": "AudioWoW8",
        "url": "https://www.reddit.com/r/books/comments/11f688r/hail_mary_severely_overrated/",
        "text": "[removed]",
        "created_utc": 1677683557,
        "upvote_ratio": 1.0
    },
    {
        "title": "book review",
        "author": "ni2807",
        "url": "https://www.reddit.com/r/books/comments/11f6169/book_review/",
        "text": "[removed]",
        "created_utc": 1677683085,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unlock Your Inner Healer with VITORI Crystal Mat",
        "author": "Nelson_marks_",
        "url": "https://www.reddit.com/r/books/comments/11f5zpa/unlock_your_inner_healer_with_vitori_crystal_mat/",
        "text": "[removed]",
        "created_utc": 1677682979,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mythical creatures in Deerskin?",
        "author": "Working-Mistake-6700",
        "url": "https://www.reddit.com/r/books/comments/11f5zg6/mythical_creatures_in_deerskin/",
        "text": "[removed]",
        "created_utc": 1677682962,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has someone here read Mona Arshi's Somebody Loves You?",
        "author": "HootHootBtch",
        "url": "https://www.reddit.com/r/books/comments/11f5tej/has_someone_here_read_mona_arshis_somebody_loves/",
        "text": " Hi all, I have just finished reading Somebody Loves you, by Mona Arshi. I thought it was beautiful but I am left with some questions. I think partly because English is not my native language. \n\nI loved the writing style, especially the wat the story is told in these short episodes. I also love how the characters are described and shaped. The way the main character observes the speaking if the other characters and people she meets.\n\n\nI did find it confusing l, however, that the blurb text says  \"[Her mother] comes and goes and goes and comes, until, one day, she doesn't\". Though the main character describes her mother and her breakdowns and Mugdays, I never noticed that the mother suddenly disappears for a longer while or never comes back from a breakdown. How should I interpret the blurb? \n\nHas somebody here read it? What did you think of it? Could you help me understand?",
        "created_utc": 1677682566,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wanna read life changing books?",
        "author": "IdeasForYou1",
        "url": "https://www.reddit.com/r/books/comments/11f5sux/wanna_read_life_changing_books/",
        "text": "[removed]",
        "created_utc": 1677682527,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone help me find this books?",
        "author": "InTranceDayDreamer",
        "url": "https://www.reddit.com/r/books/comments/11f5na5/can_someone_help_me_find_this_books/",
        "text": "[removed]",
        "created_utc": 1677682144,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books with almost identical storylines, almost down the detail.",
        "author": "humble_Rufus",
        "url": "https://www.reddit.com/r/books/comments/11f5mqn/books_with_almost_identical_storylines_almost/",
        "text": "Currently reading a book that has exact plot as another book I read a few weeks ago. \n\nIt's about a current day woman that comes into possession of an old musical manuscript and tries to identify the composer and original owner by traveling to it's last known location in Europe. \n\nAlso follows the journey of the manuscript from a historical perspective. Some of the details such as relationship drama with the woman in possession of the manuscript, facing obstacles from current day musicologists, etc. are just so similar. \n\nI get that this sub-genre of music and historical fiction is pretty niche, but the similarities are uncanny. These books were published in back to back years. \n\nHave you come across something similar? Did one writes 'steal' a plotline and expand on it? Is there nothing knew that could have been created to explore this topic?\n\nBooks in question are:\n\n 'And After the Fire ' by Lauren Belfer, 2016 \n'The Prague Sonata ' by Bradford Morrow, 2017",
        "created_utc": 1677682105,
        "upvote_ratio": 0.9
    },
    {
        "title": "Has someone here read Mona Arshi's Somebody Loves You?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677681640,
        "upvote_ratio": 1.0
    },
    {
        "title": "Woman At 1000 Degrees",
        "author": "ProfondoRosso291",
        "url": "https://www.reddit.com/r/books/comments/11f4qmj/woman_at_1000_degrees/",
        "text": "\nHello,\n\nJust recently started this book and it’s quite interesting in the narrative and tone. Out of curiosity being from the United States and with it being written in Iceland is there some kind of context or background that I should know about the book? I only found the small blurb on Wikipedia so far but haven’t dived into it too much yet. Just curious what other people think about the book as well.",
        "created_utc": 1677679842,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend wants to debut under a new, different pen name.",
        "author": "Adrian0DL",
        "url": "https://www.reddit.com/r/books/comments/11f4q5m/my_friend_wants_to_debut_under_a_new_different/",
        "text": "What happens if they debut under a new pen name, but still keep the original title and story of their old novel? It's still ongoing, they reminded me, just in hiatus, but they also want a fresh take on their story and their \"being\" and we have no ideas what the consequence(s) of this action will entail, especially regarding copyright.",
        "created_utc": 1677679811,
        "upvote_ratio": 0.6
    },
    {
        "title": "books",
        "author": "Emotional-Young7709",
        "url": "https://www.reddit.com/r/books/comments/11f4jw5/books/",
        "text": "[removed]",
        "created_utc": 1677679358,
        "upvote_ratio": 1.0
    },
    {
        "title": "Children of Time by Adrian Tchaikovsky",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677679320,
        "upvote_ratio": 1.0
    },
    {
        "title": "Times when you actually liked the movie more than the book?",
        "author": "AstonianSoldier",
        "url": "https://www.reddit.com/r/books/comments/11f3vot/times_when_you_actually_liked_the_movie_more_than/",
        "text": "It is often said \"the book is better than the movie\" because the book can give you so much detail and insight where a movie doesn't have the time.\n\nAre there any times when you actually liked the movie more?\n\nI have 2 examples where I actually liked the movie version more than the book.\n\n1 The Hunt for Red October (Tom Clancy) I liked the book and consider it a good book but there is something about the movie that really grabbed me and emotionally involved me more than the book.\n\n2. The Shawshank Redemption (Stephen King, novella in Different Seasons). I liked the novella \"Rita Hayworth and Shawshank Redemption\" but it was just a nice story. The film, I consider it one of the greatest films of all time. A masterpiece. \n\nAnyone have examples where the book wasn't the best version on your opinions?",
        "created_utc": 1677677577,
        "upvote_ratio": 0.88
    },
    {
        "title": "Subscription box for my fiancés birthday",
        "author": "CombSpare",
        "url": "https://www.reddit.com/r/books/comments/11f3v5i/subscription_box_for_my_fiancés_birthday/",
        "text": "Hello:) \nSorry, English is not my first language, but I need help to find a good subscription box for the birthday of my fiancée. \n\nWe are both book worms, but both of us favor a different genre, so I have absolutely no clue, what he would like! He is totally into the fandom (I really hope that’s the name of it, lol!) genre. His favorite authors are John Gwynne, Robin Hobb, Brandon Sanderson, Robert Jordan and so on. He enjoys it so much, I wanna be able to gift him something that will come for the next couple of months.\n\nAre there any good websites in the U.S which would provide books that are in those kind of genre? \n\nThanks in advance!",
        "created_utc": 1677677535,
        "upvote_ratio": 0.6
    },
    {
        "title": "SELF-HELP TABBING SYSTEM",
        "author": "notyour_Luna",
        "url": "https://www.reddit.com/r/books/comments/11f3mam/selfhelp_tabbing_system/",
        "text": "[removed]",
        "created_utc": 1677676841,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finished Iain Banks 'The Wasp Factory', I liked it a lot. This is why:",
        "author": "DingoBingoWimbo",
        "url": "https://www.reddit.com/r/books/comments/11f3m5m/finished_iain_banks_the_wasp_factory_i_liked_it_a/",
        "text": "I'd tried to read Iain M. Banks' 'Consider Phlebas' before, but I didn't manage to get invested, so I took a step away from Sci-Fi to try Banks' fiction work, eventually finding The Wasp Factory, and yesterday I finished it. Enjoyed it a ton. For those who haven't read it, I'd say give it a go, nice and short, though to warn you it can get quite grotesque.\n\n(Spoilers)\n\nThe book has a very localised setting, and I appreciated that. The main character, Frank, feels bound to the island his house is on, only occasionally crossing the bridge to visit the local town. Throughout the book you're following Frank at his house, the island, or the town, all the while there's the ever-present mystery of his Father's locked study, and the growing threat of his psychotic brother, Erik, who's escaped from an insane asylum and is making his way back to the island, igniting every dog he sees along the way.\n\nThe Wasp Factory hooked me with an interesting glimpse into the mind of Frank, a disturbed Scottish teenage boy who's established a wartime-like sovereignty over the island and it's inhabitants, the inhabitants being small creatures whom he likes to murder in ritualistic fashion. It's not only Frank who's disturbed, his whole family have very strange quirks, Erik being raving-mad and his Father being overly-anal about the measurements of everything in the house, among other things.\n\nThe novel is also full of especially imaginative death sequences, throughout the book Frank recounts the period of his life where he had 'a phase' of murdering small children, these children being his relatives who would come to the island to visit. Long after most of the details of this novel have slipped my mind, the imagery of those deaths are gonna stick around. Throughout the book Frank expresses his disdain for all women, he perceives women to be weak, believing that men are born with the innate ability to take life, and women the ability to give life. Frank's genitals were mutilated by a dog when he was young, and he's remained stuck with the feeling that he is less of a man than all of the other men around him, believing he'll never grow into a 'true' man. He compensates for his perceived lack of manhood by behaving as how he believes the ideal man should behave, taking life, and being suzerain of his territory, the island.\n\nThis misogynistic, Übermensch-y sort of personality that Frank has built up only makes the final reveal of the book all the better - Frank manages to get into his Father's mysterious study, finding his own mutilated testicles in a vat of alcohol. The image of his 'lost manhood' turns Frank into a sobbing mess, having to see what he mourns the most is super difficult for him. Pretty weird of his father to keep his testicles in a jar, so Frank believes that this was the great mystery, but to be sure he searches around a bit more, finding a locked cabinet. He unlocks it and opens it, finding tampons and hormone medication. During this find, Erik begins his 'attack', sending a flock of engulfed sheep charging at the house. Frank interrogates his drunk father at knife-point, believing that his Father had been 'pretending to be a man' all this time, unbuckling his belt only to find... old, wrinkly male genitalia. As Erik's attack ends, Frank demands answers from his father, only to be told that himself, *Frank,* masculine sovereign of his island, taker of life, was actually born a female. His genitalia had indeed been mutilated by an dog, and his Father saw it as a chance to 'experiment', raising Frank as a man, and dosing him with testosterone medication, happening to keep tampons handy just in-case the med dosing got messed up. The male genitalia were in-fact made of wax, and were kept to double-down on the lie of Frank being born a male, in-case Frank ever questioned anything.\n\nYeah, it's a pretty silly reveal, but I found it super entertaining. Frank had always experienced a form of gender dysphoria for what he perceived to be a lack of manhood, and was always very misogynistic, so having to find out he was biologically female is the ultimate irony, and an earth-shattering revelation for the character. As a transgender person, I really appreciated how the story delved into themes of Gender dysphoria, and the distinction between gender and biological sex, I wasn't expecting something like that, especially not from an 80s book, it's funny getting to heavily relate to such an insane character.\n\nThe final chapter consists of Frank/Frances searching for Erik (who'd fled after half-heartedly trying to burn the house down) while coming to terms with their identity. For so long they'd been trying to reclaim what they felt was a lost masculinity via this Übermensch-like, murder-y behaviour, and now they wonder what it was all for. A very interesting look into how the mind of this (very psychopathic person) works.\n\nThe titular **Wasp Factory** is a clear-face clock that they'd found in a dump. They built twelve winding tunnels, corresponding to the twelve hours of the clock, and the twelve tunnels would lead to twelve unique, gruesome deaths for the little wasp that was put inside and left to choose a tunnel. Throughout the book Frank/Frances would use it ritualistically in an attempt to foresee the future. They recount in the final chapter that they'd always felt like the wasp in the wasp factory, but that they'd never had a choice of hallway, having been pushed down a certain hallway after their 'manhood was stolen' from them. With the truth out, they realise they were never stuck at all, their choice for their path in life always having been available to them, they'd just never seen it.\n\nI did find it a little strange how in the span of one chapter Frank rather quickly comes to accept the news and identify herself as a woman (Frances). The book had established the distinction between sex and gender via Frank's very existence, though soon after finding out her true sex, she aligns her gender accordingly to her sex. Frances does seem to have very hard-line views on many things though, so I suppose that's just how her mind works. The book ends very soon after this, so the growth of her new gender identity isn't really discussed.\n\nSo yeah, I found the novel really endearing, it's bite sized, has some interesting characters, and very funny death scenes, and the gender-sex stuff did speak to me a lot. Might give the culture series a second chance after-all.\n\n&amp;#x200B;\n\n&gt;Poor Erik, came home to see his brother, only to find zap, pow, dams burst, bombs go off, wasps fry... He's got a sister",
        "created_utc": 1677676831,
        "upvote_ratio": 0.96
    },
    {
        "title": "JK Rowling says she was bullied off a Harry Potter forum she joined under a pseudonym",
        "author": "LinguoBuxo",
        "url": "https://www.msn.com/en-us/entertainment/news/jk-rowling-says-she-was-bullied-off-a-harry-potter-forum-where-fans-had-no-idea-who-she-really-was/ar-AA181TWW",
        "text": "",
        "created_utc": 1677675172,
        "upvote_ratio": 0.82
    }
]