[
    {
        "title": "E-Book vs PaperBook for School and Studying",
        "author": "Neon_44",
        "url": "https://www.reddit.com/r/books/comments/114hwqo/ebook_vs_paperbook_for_school_and_studying/",
        "text": "[removed]",
        "created_utc": 1676632293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weekly Recommendation Thread: February 17, 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/books/comments/114hlag/weekly_recommendation_thread_february_17_2023/",
        "text": "Welcome to our weekly recommendation thread!  A few years ago now the mod team decided to condense the many \"suggest some books\" threads into one big mega-thread, in order to consolidate the subreddit and diversify the front page a little.  Since then, we have removed suggestion threads and directed their posters to this thread instead.  This tradition continues, so let's jump right in!\n\n**The Rules**\n\n* Every comment in reply to this self-post must be a request for suggestions.\n\n* All suggestions made in this thread must be direct replies to other people's requests. Do not post suggestions in reply to this self-post.\n\n* All unrelated comments will be deleted in the interest of cleanliness.\n\n____\n\n**How to get the best recommendations**\n\nThe most successful recommendation requests include a description of the kind of book being sought.  This might be a particular kind of protagonist, setting, plot, atmosphere, theme, or subject matter.  You may be looking for something similar to another book (or film, TV show, game, etc), and examples are great!  Just be sure to explain *what* you liked about them too.  Other helpful things to think about are genre, length and reading level.\n\n____\n\nAll Weekly Recommendation Threads are linked below the header throughout the week to guarantee that this thread remains active day-to-day.  For those bursting with books that you are hungry to suggest, we've set the suggested sort to new; you may need to set this manually if your app or settings ignores suggested sort.\n\nIf this thread has not slaked your desire for tasty book suggestions, we propose that you head on over to the aptly named subreddit /r/suggestmeabook.\n               \n- The Management",
        "created_utc": 1676631612,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Stranger (and my previous existential crisis)",
        "author": "benefitslapsedagain",
        "url": "https://www.reddit.com/r/books/comments/114fcxs/the_stranger_and_my_previous_existential_crisis/",
        "text": "I'm not quite sure how to articulate how I feel about this book, and I'm also looking for advice/other opinions. I read this when I was 24 after my grandfather died. I had no idea what the subject matter was, and was not familiar with Camus' writing style, or the concept of existentialism. I read this book and I went through quite a dark period - the quote that is imprinted in my memory forever is the following:\n\nHow did I picture the life after the grave?\n\nI Fairly bawled out at him: 'A life in which I can remember this life on earth. That's all I want of it.'\n\nThis was such a gut punch for me, and I spiraled for a long time, ruminating about death (so much fun).\n\nI want to drive home to everyone that I am in a great place now, and incredibly happy with my path and family. However, this book feels like such a looming obstacle in my mind. I would like to read it again, now that I am in a less vulnerable place, just to prove to myself that I can read it and be ok.\n\nDo any of you have a book that feels like your Achilles heel? Please weigh in on whether I should read this again to conquer it, or perhaps it triggered me for a reason and I should leave it where it lies.",
        "created_utc": 1676626252,
        "upvote_ratio": 1.0
    },
    {
        "title": "recent crave",
        "author": "leit_bloomer",
        "url": "https://www.reddit.com/r/books/comments/114fbl3/recent_crave/",
        "text": "[removed]",
        "created_utc": 1676626100,
        "upvote_ratio": 1.0
    },
    {
        "title": "just started a little life",
        "author": "leftaligned-bells",
        "url": "https://www.reddit.com/r/books/comments/114f6hp/just_started_a_little_life/",
        "text": "[removed]",
        "created_utc": 1676625487,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to find a book",
        "author": "Any-Oil3183",
        "url": "https://www.reddit.com/r/books/comments/114f3bv/trying_to_find_a_book/",
        "text": "I remember reading this book my mom had when I was younger in the early 2000’s. I cannot remember the name of the book but I remember parts of the story.\nThis group of girls was going on a trip, they ended up at this abandoned either hotel or cabin resort, something about there had been a terrible accident there like maybe a toxic chemical thing that killed everyone, and there’s this character I can’t remember their name I think maybe it starts with a g, they live in the woods around the abandoned cabin, and later on in the story they turn out to be intersex. The girls start going missing, one of them is portrayed as heavier set in the book and in the end one of the friends is actually crazy and is the one murdering everyone, she stabs the heavier set woman but because she’s heavier set the knife doesn’t penetrate as bad as it should of and she ends up surviving and killing the crazy friend. \nIt’s a really good book and I’ve wanted to find it for years but have never been able to.",
        "created_utc": 1676625112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommend me short and descriptive books (not using intricate language)",
        "author": "myme1ody",
        "url": "https://www.reddit.com/r/books/comments/114exoc/recommend_me_short_and_descriptive_books_not/",
        "text": "[removed]",
        "created_utc": 1676624447,
        "upvote_ratio": 1.0
    },
    {
        "title": "Russian literature",
        "author": "hate2bme",
        "url": "https://www.reddit.com/r/books/comments/114evjg/russian_literature/",
        "text": "[removed]",
        "created_utc": 1676624199,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need motivation to get through the ‘History’ section of The Second Sex",
        "author": "sadarlecchino",
        "url": "https://www.reddit.com/r/books/comments/114eb34/need_motivation_to_get_through_the_history/",
        "text": "it’s (obviously) such a good read so far, but I’m so bored by the history section. unfortunately it has kind of stunted my reading. I kind of want to skip to the parts I know I’ll find interesting, but at the same time I don’t want to miss anything, and I know important points are made throughout that section. any advice on how to get through boring passages in books? or just motivation to get through it quickly.",
        "created_utc": 1676621785,
        "upvote_ratio": 1.0
    },
    {
        "title": "Obsessed with books",
        "author": "Fionawritesbetter",
        "url": "https://www.reddit.com/r/books/comments/114e70a/obsessed_with_books/",
        "text": "[removed]",
        "created_utc": 1676621321,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you call this type of book printing?",
        "author": "TCompton",
        "url": "https://www.reddit.com/r/books/comments/114e6v3/what_do_you_call_this_type_of_book_printing/",
        "text": "What is the name of the type of book printing [used here](https://www.flickr.com/photos/agitpropdevices/1355934575) on the two books on the right? With the kind of leathery/plastic-y cover, thin pages, small form factor? It's similar to the type of printing pocket bibles use. \n\nAnd would anyone happen to know where I can get a book of this same form factor/style printed? Can't find any of this info anywhere! Thank you!",
        "created_utc": 1676621306,
        "upvote_ratio": 1.0
    },
    {
        "title": "What book is being talked about here? I can’t figure it out!",
        "author": "elefrunk2029",
        "url": "https://www.reddit.com/user/AudibleUK/comments/10wuzdj/join_the_book_club_now/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf",
        "text": "",
        "created_utc": 1676619986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Look what I found. An Artificial Intelligence Illustrated Children's Picture book",
        "author": "Available-Help2969",
        "url": "https://play.google.com/store/books/details?id=rXetEAAAQBAJ&amp;rdid=book-rXetEAAAQBAJ&amp;rdot=1&amp;source=gbs_atb&amp;pcampaignid=books_booksearch_atb",
        "text": "",
        "created_utc": 1676615978,
        "upvote_ratio": 1.0
    },
    {
        "title": "Deaf Characters",
        "author": "dgblackwell",
        "url": "https://www.reddit.com/r/books/comments/114cpqz/deaf_characters/",
        "text": "[removed]",
        "created_utc": 1676615554,
        "upvote_ratio": 1.0
    },
    {
        "title": "What will get you to read a story?",
        "author": "anhedistic",
        "url": "https://www.reddit.com/r/books/comments/114ci4f/what_will_get_you_to_read_a_story/",
        "text": "[removed]",
        "created_utc": 1676614770,
        "upvote_ratio": 1.0
    },
    {
        "title": "help me find the name of this book",
        "author": "tunaburn",
        "url": "https://www.reddit.com/r/books/comments/114c89n/help_me_find_the_name_of_this_book/",
        "text": "I read it when I was a teen like 25 years ago. It might be a series I'm not sure. \n\nAliens have taken over and they use kids as slaves. The main character gets tired of being beaten by his alien master so he punches him and it ends up killing him. Then he's trying to hide and escape. \n\nI don't remember much else but I loved that book.",
        "created_utc": 1676613757,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on the Collector by John Fowles",
        "author": "thedaveoflife",
        "url": "https://www.reddit.com/r/books/comments/114c32b/thoughts_on_the_collector_by_john_fowles/",
        "text": "I just finished The Collector by John Fowles and was curious if anyone who's read the book had the same reaction as I did-- from reading around a bit on the internet I haven't seen anyone have the same interpretation. \n\n&gt;!The book was written in the 1960s but I feel like the parallel that Fowles draws between the Power dynamic in Miranda's relationship with her older boyfriend GP and the literal kidnapper Fred Clegg was really interesting especially given the me too movement in recent years. Obviously trying to seduce someone using your position of power over them and intellect/experience/reputation isn't the same as using violence to trap them and keep them in a literal prison in your basement-- but if Fowles isn't trying to make us notice the similarities, then why devote so much time to MIranda's thoughts on GP in her journals? \n\n\n I was wondering if anyone else saw that parallel and what others' general thoughts on the book were!&lt;",
        "created_utc": 1676613257,
        "upvote_ratio": 1.0
    },
    {
        "title": "need help finding a book i read in middle school",
        "author": "nofearoftime-",
        "url": "https://www.reddit.com/r/books/comments/114bw3v/need_help_finding_a_book_i_read_in_middle_school/",
        "text": "[removed]",
        "created_utc": 1676612551,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else read Leslie Thomas?",
        "author": "Signguyqld49",
        "url": "https://www.reddit.com/r/books/comments/114bv74/does_anyone_else_read_leslie_thomas/",
        "text": "[removed]",
        "created_utc": 1676612463,
        "upvote_ratio": 1.0
    },
    {
        "title": "hardcover books",
        "author": "Single-Platypus2894",
        "url": "https://www.reddit.com/r/books/comments/114buwz/hardcover_books/",
        "text": "[removed]",
        "created_utc": 1676612436,
        "upvote_ratio": 1.0
    },
    {
        "title": "hardcover books",
        "author": "Single-Platypus2894",
        "url": "https://www.reddit.com/r/books/comments/114bu17/hardcover_books/",
        "text": "[removed]",
        "created_utc": 1676612353,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Shattered City (book 4 in The Last Magician)",
        "author": "aMotherDucking8379",
        "url": "https://www.reddit.com/r/books/comments/114bgn1/the_shattered_city_book_4_in_the_last_magician/",
        "text": "This is a great series if you like urban fantasy. I like the use of magic where people only have one gift. I think this interesting and the elements of time travel and consequences make gaming out what will happen next more challenging. In all very well done.\n\nBut I have this buring question... \n\nI'm not sure where to ask this and such a specific question might not be exactly a discussion, though I have some strong feelings about plot holes we can talk about. But here is what's making crazy. I'm only half way through book 4 and Esta has just produced Dakari's knife. Apparently from a plot hole??? The wiki pages and the intent don't seem concerned with this point... If anyone knows please tell me. 🤣\n\nThis is a clutch point of the plot as Esta really needs past Dakari to believe her story about their shared future. And the knife he gifted to her is the perfect solution to her moral quandary. Because of course we can't take the easy magic way with Heart's affinity...so the knife is the only opinion. \n\nBut Esta lost his knife at the Haymarket in the first book!! She does try to get it back but the Haymarket gets raided before she can. It was a big deal. Finding it should have been a big deal as well. \n\nFor three whole books it's been lost. And I think at one point in book two The Devil's Theif she bemoaned it's lost as it was the only thing from her own time. Now suddenly, she has it? I'm wondering if I missed something or if this is poor editing? \n\nTheres a number of years between book 1 and 4. So poor editing is a possibility. I've downed these as fast as I can get them on Libby. I did have a 6 week wait between 2 and 3 so maybe I forgot... Maybe it doesn't matter. \n\nLittle things like this really take me right out of the story. And I paused the book to search for answers because I don't have my hands in book 1 right now. Though it could be in 2 or 3... Sigh. It's only one of the major hinges in the conclusion... This is really going to bug me.",
        "created_utc": 1676611045,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Dark Vanessa",
        "author": "No-Doubt9192",
        "url": "https://www.reddit.com/r/books/comments/114b7sp/my_dark_vanessa/",
        "text": "[removed]",
        "created_utc": 1676610207,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Dark Vanessa",
        "author": "No-Doubt9192",
        "url": "https://www.reddit.com/r/books/comments/114b57g/my_dark_vanessa/",
        "text": "[removed]",
        "created_utc": 1676610005,
        "upvote_ratio": 1.0
    },
    {
        "title": "Years after her death, science-fiction writer Octavia E. Butler lands on bestseller list",
        "author": "Hrmbee",
        "url": "https://www.theglobeandmail.com/arts/books/article-years-after-her-death-science-fiction-writer-octavia-e-butler-lands-on/",
        "text": "",
        "created_utc": 1676609867,
        "upvote_ratio": 1.0
    },
    {
        "title": "जो आधा अधूरा कह दूँ तो..",
        "author": "Narrow-Spend-4813",
        "url": "https://www.bookswagon.com/book/23322379-231023432366-23092343237023522366-23252361-2342237/9789393262073?srsltid=Ad5pg_FVpU_cGaurAg6W6CN62W3wChT4OzFBlAEXLyaJGjtNN5qds47FsMU",
        "text": "",
        "created_utc": 1676609112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best quote I've ever heard in regards to feeling self conscious about not being able to retain all the information from the books you're while reading.",
        "author": "DrBucket",
        "url": "https://www.reddit.com/r/books/comments/114aryq/best_quote_ive_ever_heard_in_regards_to_feeling/",
        "text": "\"Do you remember every meal you've ever had? Probably not, but that doesn't make them any less a part of you today, does it?\".\n\nI don't know who said it or where I got it from but it's always felt like such a good analogy to me. Sometimes it's more about priming your mindset to feel a certain way rather than being able to spew out all the information you're reading. Sometimes knowing how to find the information again if you've forgotten it which is good enough. I feel like the mood reading puts me in doesn't make me smarter, it just makes me more patient to hear certain people out or stay calm with information dense situations and just allow it to unfold first rather than getting too anxious as it's unfolding.\n\nObviously reading isn't the only way to become patient and calm, but it is a good way to exercise that muscle.",
        "created_utc": 1676608781,
        "upvote_ratio": 1.0
    },
    {
        "title": ":( - Google Shopping",
        "author": "Narrow-Spend-4813",
        "url": "https://www.google.com/shopping/product/14709557935716368194?q=:(&amp;client=ms-opera-gx-android&amp;channel=new&amp;espv=1&amp;biw=360&amp;bih=702&amp;tbs=vw:g&amp;prmd=ivmn&amp;prds=eto:11686109262805207993_0,cdl:1,prmr:1,cs:1",
        "text": "",
        "created_utc": 1676608132,
        "upvote_ratio": 1.0
    },
    {
        "title": "'Stars and Bones' by Gareth L. Powell - is this satire?",
        "author": "alangrai",
        "url": "https://www.reddit.com/r/books/comments/114aiic/stars_and_bones_by_gareth_l_powell_is_this_satire/",
        "text": "I picked this up because I like well-written space opera, AI and post-apoc tales. Instead I got this horrible mishmash of lampshading, odd ideas, at-best mediocre writing, and a deeply unlikeable protagonist despite the author's fervent attempts to portray her as admirable...\n\nThere's a derelict alien ship sending out a distress call. You know, like Alien. A ship is diverted there and the crew go out to investigate. You know, like Alien. When they get there and touch it, a weird alien infection kills some of them then gets back to the ship. You know, like Alien. On the off-chance you missed the reference, a later solution is to return and nuke the alien ship from orbit, because 'it's the only way to be sure'. You know, like Aliens. The alien infection doesn't just kill people though; it turns their bodies into black oil, which can infect humans. You know, like Prometheus. But it can't turn their bones into black oil, so it makes neat cube-shaped piles of them all over the planets it razes. You know, like no other story ever because it's incredibly dumb. Despite this 'can't dissolve bones' thing, the black-oil-dissolvey alien later reshapes continent-sized metal starships.  \nFleeing the black-oil-dissolvey-alien, the crew race home, but not to a planet. Humanity was forced off Earth by an Angel (yes they call them that) who was sad that humanity was chopping down the trees. Now the whole human race journeys through space in a rag-tag fleet. You know, like Galactica. Or Mass Effect. FTL is possible, but the AI ships need a human to 'Dreamlink' with them to do it. You know, like Pacific Rim. The human's role is to (urgh) 'collapse the wave function' as the AI plots the course through the FTL goo. To do this collapsey-thing, the human LOOKS OUT THE WINDOW. Also, the tree-loving alien decided to put chips in cats' brains so they could talk. No explanation for why, just 'here, talking cats'. The cat on the ship can't just talk though: it also understands physics well enough to propose a near-pass of a star to excise the infection. Because cats and physics. When the ending finally arrives, the heroine confronts the baddie in a dreamscape on a rainy windswept beach where time has no meaning. You know, like Inception. Then the original tree-loving Angel reappears to Deus Ex Machina us out of our misery.  \nI could go on. The writer uses 'discreet' to mean 'separate'. The writer uses 'comprised of', repeatedly. The protagonist is gay, but she sleeps with exactly one man. She discovers the next day he is her sister's partner, because sitcom hilarity. Minor characters do dumb things for no reason other than to give the protagonist an excuse to (literally) punch them in the face to show how tough and principled she is. Nobody ever punches back or calls her out for assaulting her crew.  \nThis book is not self-published. The author has an agent and an editor. He has several other books. He has won prizes. Yet somehow it is literal, literary, occasionally littoral, garbage.  \n\n\nAm I missing something? Is the (prize-winning, fairly successful) writer simply having a laugh, or demonstrating the terrible state of the industry by publishing something so clearly unready for print?",
        "created_utc": 1676607886,
        "upvote_ratio": 1.0
    },
    {
        "title": "Priest, by Sierra Simone",
        "author": "That_Profile_2800",
        "url": "https://www.reddit.com/r/books/comments/114ab44/priest_by_sierra_simone/",
        "text": "[removed]",
        "created_utc": 1676607218,
        "upvote_ratio": 1.0
    },
    {
        "title": "anyone know these books",
        "author": "Lucky_Thanks_6556",
        "url": "https://www.reddit.com/r/books/comments/114a35x/anyone_know_these_books/",
        "text": "I have been looking for two books one was about a boy staying in his uncle's or grandmothers cottage/cabin and going into a room he's not aloud and climbing into a chest and ends up in a different universe I think it was but it was a garden and there were people there. The other I don't have as much detail in because it was a book my teacher gave me to try out because I was a very talented reader in the first grade but it was about two girls at a summer camp and it was by rl Stine and that's about what I remember but does anyone know either of these books.",
        "created_utc": 1676606482,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is the reading rainbow documentary so hard to find?",
        "author": "Retardimundi",
        "url": "https://www.reddit.com/r/books/comments/1149okh/why_is_the_reading_rainbow_documentary_so_hard_to/",
        "text": "[removed]",
        "created_utc": 1676605169,
        "upvote_ratio": 1.0
    },
    {
        "title": "books",
        "author": "arniii1",
        "url": "https://www.reddit.com/r/books/comments/1149k6q/books/",
        "text": "[removed]",
        "created_utc": 1676604768,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you care about the condition of your book I recommend not to order books on Amazon.",
        "author": "dumbape678",
        "url": "https://www.reddit.com/r/books/comments/1149dhr/if_you_care_about_the_condition_of_your_book_i/",
        "text": "[removed]",
        "created_utc": 1676604183,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone spoil White Oleander for me?",
        "author": "ithinkerno",
        "url": "https://www.reddit.com/r/books/comments/1149bwe/can_someone_spoil_white_oleander_for_me/",
        "text": "I started out really interested in the story and where it was going, but I am really struggling with Astrid and Ray's  relationship. As it was happening it was completely romanticized but I figured the author would circle back and show the wrongness of it. So far that hasn't happened and it has made me totally uncomfortable with the book. Does the author address this at any point?",
        "created_utc": 1676604043,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can’t decide which book to work on!",
        "author": "Jasmine_Dragonista",
        "url": "https://www.reddit.com/r/books/comments/114991u/cant_decide_which_book_to_work_on/",
        "text": "I’m 19F in college and an English/writing major. One of my creative writing classes this semester is once a week, two hours, and it’s mainly fantasy-focused. After combing through the syllabus a few weeks ago, I realized that I would have the chance to work on a novel if I wanted to!! And now I’m torn between two different projects. Pls help \n\nProject 1: Series with a tentative outline. Wrote the first draft years ago and publishing it has always been my dream. Need to rewrite book 1 because my voice and skill has changed immensely. Very attached to this one. A little bit trope-y, tho, which is what I’m concerned about. A lot of people scoff at YA/New Adult, and I notice tropes are pretty hated on lately, but there’s so many books in the world, you have to start somewhere, right?\n\nProject 2: Stand-alone that started from a short story I wrote a year ago. The idea is actually really original and I pulled it right out my ass. Proud of it but hesitant to take my attention off of project 1. People who read the shorter piece said I needed to turn it into a novel.\n\nHere’s the biggest dilemma: I have a cool way to make project 1 more noticeable and original, but doing so would make the lore of the world a little similar to project 2 (think time periods). Project 1 is so special to me, and I know it could be amazing with some time and patience, but is it worth discarding project 2? I don’t want to write that story off, either.\n\nThanks u guys!",
        "created_utc": 1676603803,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are new books published in Large Print Paperbacks?",
        "author": "Substantial_Ad_2209",
        "url": "https://www.reddit.com/r/books/comments/11490vg/why_are_new_books_published_in_large_print/",
        "text": "I love paperback books. I usually wait for the paperback editions because 1) Hardbacks are expensive, and 2) paperbacks are easier to read. Recently, I’ve seen new books that are published in Large Print Paperback format (not the standard sized Trade Paperbacks).\n\nOne example is the The Winners by Fredrik Backman which is in LPP and Hardback editions. I didn’t buy the LPP edition because I’m collecting his books in TP format and having this edition would ruin these books’ appearance on my bookshelf.😂\n\nI also have a copy of Carrie Soto is Back by Taylor Jenkins Reid in LPP edition which annoys me every time I see it next to the TP edition of her other books. \n\nI’m just wondering why are these editions being released at the same time as the HB editions. Can anyone explain why?",
        "created_utc": 1676603123,
        "upvote_ratio": 1.0
    },
    {
        "title": "New dystopian action sci-fi book",
        "author": "NewEngineering7547",
        "url": "https://www.reddit.com/r/books/comments/1148f2a/new_dystopian_action_scifi_book/",
        "text": "I am happy to announce the the first entry to my dystopian action science-fiction anthology has released on Amazon, Kobo, and Google Play (And soon to be other platforms) in Ebook and Paperbook forms. To anyone here who enjoys action Sci-Fi books set in near future dystopian settings, please consider the summary below to determine if this book is right for you. Take care!\r  \n\r  \nEva 2040 is an action Sci-Fi anthology series written by Tyler J Sluys that is set in a near future dystopian world. The book entries contain no continuity with each other and can be read in any order. A synopsis of the series and book edition can be found below:\r  \n\r  \nEVA 2040\r  \nIn the year 2029, scientists made a breakthrough in human genetic engineering, which allowed for the physical and cognitive enhancements of a specific selection of individuals. The genetically enhanced became known as the “Enlightened” and quickly established themselves as the global elites, who made their way into positions that heavily influenced government affairs, business, technology, trade, and other industries with a global impact. The Enlightened intentionally corrupted parliaments, crashed the stock market, and bankrupted countries and global funds beyond any conceivable measure of repair all in order to bring about the total collapse of world societies. This allowed for the establishment of a New World Order. One where the Enlightened would have complete control over the entire human race. This process is referred to as the “Conversion”. Once the Conversion was complete, humanity existed under a single unified world government operated and managed by an artificial intelligence named “Eva.” On June 14th, 2040, Eva officially launched and changed the course of all human lives forever. Welcome to a world where privacy does not exist. Welcome to a world absent of all legal rights. Welcome to a world where freedom is nothing but a mere memory.\r  \nWelcome to EVA 2040\r  \n\r  \nVolume I\r  \nA former police officer turned Security Consultant discovers that his ex-wife has gone missing with even Eva not being able to detect her. He suspects foul play among the government and goes rogue on an investigative journey to find and rescue her, while outwitting the detection of the ever powerful and omniscient artificial intelligence.",
        "created_utc": 1676601310,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a 1-step way to add/rate/date a book on Goodreads (desktop)?",
        "author": "noodletune",
        "url": "https://www.reddit.com/r/books/comments/1148a2a/is_there_a_1step_way_to_addratedate_a_book_on/",
        "text": "Goodreads recently changed, and the functionality now seems to be way worse than it used to be. \n\nI used to be able to type in an ISBN and it would pull up the book I wanted, and right there, I could put in my rating of the book and the date that I finished it. \n\nNow I can't figure out how to do this without going to multiple pages, and it's a big hassle to find what I need. \n\nPlease help! Thanks.",
        "created_utc": 1676600898,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should I read?",
        "author": "monsterbator89",
        "url": "https://www.reddit.com/r/books/comments/114833z/what_should_i_read/",
        "text": "I work 12hr shifts. I am able to pass some of my time reading when I’m not actively “doing my job”. I have a kindle loaded with a bunch books, help me decide what to read!\n\nCarmilla - Joseph Sheridan Le Fanu\nThe Death of Ivan Ilych - Tolstoy\nHeart of Darkness - Joseph Conrad\nThe Old Man and the Sea - Hemingway\nThe Road - Cormac McCarthy\nSnuff - Chuck Palahniuk",
        "created_utc": 1676600321,
        "upvote_ratio": 1.0
    },
    {
        "title": "where/how can i read the storm of steel in english?",
        "author": "fluxatref",
        "url": "https://www.reddit.com/r/books/comments/11482p5/wherehow_can_i_read_the_storm_of_steel_in_english/",
        "text": "[removed]",
        "created_utc": 1676600287,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Lost Apothecary by Sarah Penner",
        "author": "WildInsights",
        "url": "https://www.reddit.com/r/books/comments/1147zfh/the_lost_apothecary_by_sarah_penner/",
        "text": "Others who have read The Lost Apothecary: what did you think? I really, really wanted to like this book, and to be fair, I did finish it (which is unusual for me as a habitual \"bailer\"). The premise was interesting, and my own love of historical research kept me sort of engaged with the modern day story. However, I really struggled with the writing itself, which often felt melodramatic and awkward. Nella in particular was completely one-note for me. And so much of the dialogue just felt incredibly unnatural and forced. It really frustrated me, since I genuinely liked the premise and wanted to find out what happened, but found reading it to be pretty difficult. Did other people have a better experience with it? It gets great reviews, not sure what I'm missing.",
        "created_utc": 1676600010,
        "upvote_ratio": 1.0
    },
    {
        "title": "DAIRY OF AUGUST ESON 602 BY VIKTOR PREVANDER my first spy book",
        "author": "BaronViko",
        "url": "https://www.storyjumper.com/book/read/149707041",
        "text": "",
        "created_utc": 1676598494,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally got around to reading Jonathan Strange and Mr. Norrell and loved it!",
        "author": "steampunkunicorn01",
        "url": "https://www.reddit.com/r/books/comments/11475zi/finally_got_around_to_reading_jonathan_strange/",
        "text": "So, I've been a big fan of the miniseries adaptation and bought the book forever ago. Everything I'd heard told me I'd like the book as much, if not more than the miniseries. Nevertheless, I kept putting it off for various reasons (surprisingly, not due to the size. I've read bigger books in the interim) Finally, I decided to make myself read it.\n\nAnd it was everything everyone had told me!\n\nThe characters are so rich, the story so memorable, the plot so tight. And, given how much I loved the miniseries, I was super interested in what changes were made and trying to figure out why they were made. I definitely wish I had read it years ago, but I am more glad that I didn't put it off any longer.\n\nAre there any books you loved when you finally read them that you had put off for a while?",
        "created_utc": 1676597573,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"The Mountain Between Us\"",
        "author": "Healthy-Heather",
        "url": "https://www.reddit.com/r/books/comments/11475tw/the_mountain_between_us/",
        "text": "Has anyone else read this book?  I did a search but didn't find a thing. \n\nI'd love to discuss it. \\*spoilers\\*\n\n1.) it really only worked as a good story because of the protagonist's background.  Avid hiker, backpacker, Egle scout and being a doctor.  Same for Ashley, she was an athelete and at age 34 and good sturdy age.  \n\n\n2) What did you think of the whole wife thing.  And the \"twist\" at the end?\n\n&amp;#x200B;\n\n3) the romatic interest.  What do you think of the two being romantically interested in each other?\n\n&amp;#x200B;\n\n4) any other comments",
        "created_utc": 1676597560,
        "upvote_ratio": 1.0
    },
    {
        "title": "Woman of the Year, a review by Shelley",
        "author": "Grand-Grapefruit9370",
        "url": "https://thebookreviewcrew.com/woman-of-the-year-a-review-by-shelley/",
        "text": "",
        "created_utc": 1676597234,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommendations? Help! I have specific preferences for books but so little knowledge of what’s out there.",
        "author": "brewitbro",
        "url": "https://www.reddit.com/r/books/comments/1146usf/recommendations_help_i_have_specific_preferences/",
        "text": "Hi r/books after having a baby I have not touched a book. I have a long international trip coming up (15 hours flight time, and baby is coming along) and would love to hear your recommendations.  I love a good thriller but nothing so nerve wracking that it adds to my anxiety. \n\nHere’s what I’d like to avoid:\n- space travel \n- oceans (makes me anxious) \n- zombies \n- teenagers \n- overt gore \n\n\nAnd I truly love a book that ends with the bad guys getting what they deserve. \n\nRecommendations? \n\nAlso I’ll take your tips for international travel with a baby, even though I’m sure there’s many subreddits for it. Book people know a lot of shit you just have to ask.",
        "created_utc": 1676596668,
        "upvote_ratio": 1.0
    },
    {
        "title": "found a very misprinted book",
        "author": "Significant_Many1323",
        "url": "https://www.reddit.com/r/books/comments/1146q4j/found_a_very_misprinted_book/",
        "text": "I was wondering if misprinted books could be worth anything? I found a first edition children's book from 1990 in a thrift shop, the book cover and back say it's a book about ducks while the inside is upside down drawings of bears. Just curious if it could be worth anything, or if anyone has come across this before?",
        "created_utc": 1676596286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bret Easton Ellis",
        "author": "abbasalabadi90",
        "url": "https://www.reddit.com/r/books/comments/1146ecs/bret_easton_ellis/",
        "text": "[removed]",
        "created_utc": 1676595346,
        "upvote_ratio": 1.0
    },
    {
        "title": "We’re All Living Under Gravity’s Rainbow",
        "author": "Obliterature",
        "url": "https://www.wired.com/story/living-under-gravitys-rainbow-thomas-pynchon/amp",
        "text": "",
        "created_utc": 1676594932,
        "upvote_ratio": 1.0
    },
    {
        "title": "Greek Mythology Itch",
        "author": "Flash_Mormon",
        "url": "https://www.reddit.com/r/books/comments/11466v5/greek_mythology_itch/",
        "text": "I've loved Greek mythology since I was a kid and have been meaning to read more books on it. I just finished Song of Achilles and read Circe about a month ago.  Any recommendations for books based in Greek myth, preferably in modern writing, I've tried The Iliad in the past but it was a little difficult to get into.",
        "created_utc": 1676594732,
        "upvote_ratio": 1.0
    },
    {
        "title": "Playlists based on books",
        "author": "gabrielemenopee",
        "url": "https://www.reddit.com/r/books/comments/1146471/playlists_based_on_books/",
        "text": "[removed]",
        "created_utc": 1676594518,
        "upvote_ratio": 1.0
    },
    {
        "title": "The difference between older young adult novels and young adult novels today is interesting",
        "author": "Ghostobsessed",
        "url": "https://www.reddit.com/r/books/comments/1145uwk/the_difference_between_older_young_adult_novels/",
        "text": "So I reread a few of my favorite old adult novels from when my mom was a kid and they were very laid back and not very true issues were in them thrillers were very simple and didn’t go into to much detail and then I decided to read some of the recent young adult novels I’ve gotten for my birthday and the change between the vibe and the language was just fascinating. Modern ones use more sweats and more complex issues and don’t hold back on the problems such as underage drinking or them literally killing each other it’s just interesting how as new generations come through how authors change to fit that generation. I love to read them side by side and point out the differences but I wanted to know what you guys thought.",
        "created_utc": 1676593781,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do sticky notes damage paper over time?",
        "author": "Rogerther4bbit",
        "url": "https://www.reddit.com/r/books/comments/1145upt/do_sticky_notes_damage_paper_over_time/",
        "text": "[removed]",
        "created_utc": 1676593765,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Mysterious Book That Has Me Intrigued",
        "author": "Davidjackson2412",
        "url": "https://www.reddit.com/r/books/comments/1145s8f/a_mysterious_book_that_has_me_intrigued/",
        "text": "[removed]",
        "created_utc": 1676593564,
        "upvote_ratio": 1.0
    },
    {
        "title": "Romance reader!",
        "author": "DeborahMinter",
        "url": "https://youtu.be/ta6ZpxFwMOo",
        "text": "",
        "created_utc": 1676593131,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need some interesting fantasy books!",
        "author": "Fl4kJack3t",
        "url": "https://www.reddit.com/r/books/comments/1145liu/need_some_interesting_fantasy_books/",
        "text": "[removed]",
        "created_utc": 1676593061,
        "upvote_ratio": 1.0
    },
    {
        "title": "anyone have great bookmark suggestions?",
        "author": "Solidg_o_l_d69",
        "url": "https://www.reddit.com/r/books/comments/1145fnw/anyone_have_great_bookmark_suggestions/",
        "text": "[removed]",
        "created_utc": 1676592613,
        "upvote_ratio": 1.0
    },
    {
        "title": "There are very few books that can actually justify their 700+ page length",
        "author": "blackwaltz9",
        "url": "https://www.reddit.com/r/books/comments/1145d6j/there_are_very_few_books_that_can_actually/",
        "text": "[removed]",
        "created_utc": 1676592429,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Song of Achilles",
        "author": "OutlandishnessWild",
        "url": "https://www.reddit.com/r/books/comments/1145bqn/the_song_of_achilles/",
        "text": "[removed]",
        "created_utc": 1676592317,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ruthie Fear by Maxim Loskutoff completely broke me.",
        "author": "ectophylla",
        "url": "https://www.reddit.com/r/books/comments/114562u/ruthie_fear_by_maxim_loskutoff_completely_broke_me/",
        "text": "Ruthie Fear by Maxim Loskutoff is a story about Ruthie, a girl growing up in rural Montana with her father. We watch her as she grows up, fighting incoming modernity, her own identity, and grappling with her lot in life.\n\nIf that sounds like something you'll read, please go read it, because this whole post is spoiler-y. \n\nI can understand why people mostly gave this book four stars on GoodReads. It reads very matter-of-fact, and all of the emotion I got from it were from my own personal life. The story of a growing girl to a single father was written by a man, and some of it can be disjointed, but for me, this book is five stars.\n\nAt first, I started to understand my husband more. There's this restlessness in my husband I saw with Ruthie's father - the desire to hunt, fish, live with the animals, but the growing cities around their little home squeezed the life out of him. A disdain for the scientists, tourists, and rich people that came and spat on the history of the land.\n\nBut then... I related to Ruthie. Ruthie's mother left shortly after she was born, her father struggled with the weight of raising a daughter when he was just a kid himself. Shit, that's my life story. Even down to the dog Ruthie had that died when she was in high school. I felt like this book was calling me out. Of course, I never harbored Ruthie's aggression and wanton harm of other people, but I understood her when she asked why her mother hadn't called in 30 years. \n\nBut there was this one part, that had me sobbing:\n\n*...\"Your mother left me over that rug,\" he said. \"Don't think I ever told you that. It was funny, she was never much for animals, but one day she looked at it and just started packing up. Like it was too much. After that, it was the only place you'd sleep.\"*  \n*\"I know,\" Ruthie said quietly.*  \n*Rutherford's pale eyes scanned the small room, as if searching for something more. His worn hands gripped the bar in front of his short, wiry body. He shrugged and his shoulders dropped. \"Guess I've never known what to be proud of.\" He rapped his fist against the wood and looked away. \"Except you.\"*\n\nRutherford, Ruthie's father, and Ruthie's relationship was somewhat of an echo of my own relationship with my father. I was born when he was just settling into his maturity, left alone to raise a daughter, still clinging to his young partying days but ultimately succumbing to the bigger responsibility: his daughter. \n\nAnd my dad loves me above all else. Didn't need my mother, didn't need his beer. Just needed me. \n\nI cried at this small part for a long time. It took me many, many years (as I'm only a young 21 now) to realize that my dad was growing up with me. When I was learning how to read, he was learning how to buy his own house. I was late to thanking him for this, but when I came to that realization, I couldn't thank him enough.\n\nLater, when my tears had dried, I continued reading. And *on the same page,* I started crying again:\n\n*Ruthie found herself alone in the shed's doorway with tears on her cheeks. She remembered how her father had held her as he taught her to shoot. The steadiness of his hands flowing into hers. he smell of sawdust on his collar. His heart beating against her shoulder. She took in the room of his small dreams. Animals and beer and guns and a little bit of pride. She saw the edges of his life, and how much he'd wanted it to mean something. She wished she could have been more for him: that she'd married Sitka and become the rich wife of a football star, or won more trap-shooting competitions, or become a star herself in Las Vegas, like the showgirl on the faded poster. But she knew he didn't care.*\n\nI broke. I cried, I sobbed, and I texted my dad that I loved him.\n\nThanks for reading.",
        "created_utc": 1676591905,
        "upvote_ratio": 1.0
    },
    {
        "title": "EMBRACE YOUR WEIRDNESS !!",
        "author": "Single-Sprinkles4880",
        "url": "https://www.reddit.com/r/books/comments/1144dsq/embrace_your_weirdness/",
        "text": "[removed]",
        "created_utc": 1676589806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reverse harem recommendations",
        "author": "Cam_Bam_128",
        "url": "https://www.reddit.com/r/books/comments/11447k2/reverse_harem_recommendations/",
        "text": "[removed]",
        "created_utc": 1676589357,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Libby app changed my life",
        "author": "snarkitall",
        "url": "https://www.reddit.com/r/books/comments/11444x7/the_libby_app_changed_my_life/",
        "text": "I was a book worm child and young adult. I read constantly, everything and fast. If my parents wanted to punish me, they took my books away. I read in the car, under my school books, in the bathroom, under the covers, at parties. Books were such a central part of my life until I was in my 20s, when slowly but surely, I lost the ability to focus on anything but rereading a few favourites. \n\nMaybe the combination of smartphones, social media and kids did it, but suddenly I'd rather do anything but read. I would read a couple things on vacation, and that was about it. I felt so guilty about it (and weird - to go from being an objectively well-read young adult to a mindless FB scrolling adult), but I just didn't have the stamina or interest to consume new books. \n\nFinally, I downloaded the Libby app. It was my daughter that inspired me to get it set up, because I was getting concerned about her screen time and how much less she read than myself as a kid, but also because she's dyslexic and audiobooks are a much better media for her. So we both started using the app and IT. CHANGED. MY. LIFE.\n\nI have already read 48 books since the new year. I have read non-fiction, new fiction, reread books I haven't thought of in years, classics that I \"read\" in university, all the books that I have heard about but somehow never got around to. Someone mentions a book to me, I can find it and borrow it right away. The library doesn't have a book, I can place a hold and it shows up automatically a few days later. I can even have two libraries (my current city library has a smaller English collection, so I added my hometown's library). I can suggest the library buy books! I can try a book I'd never have bothered to buy, and return it in an instant if I'm not interested. As an easily distracted, disorganized person who regularly racked up huge late fees, all the guilt and frustrated associated with borrowing and returning books is gone. \n\nLibby made it possible for me to deal with my internet addiction and stick to a social media diet. I can read in bed again without waking my spouse, or listen to audio books. It's even helped me go to the physical library more often, when I read a book on the app that I realize would be excellent in physical form. It sounds crazy, but I'm sleeping better, I'm happier, and overall just feeling like a real human being with a brain. \n\n&amp;#x200B;\n\nSo, if you are a disheartened formerly voracious reader and you haven't tried it (or whatever the library app in your area is), give it a shot.",
        "created_utc": 1676589169,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you properly read a book?",
        "author": "simracer4433",
        "url": "https://www.reddit.com/r/books/comments/1143xzq/how_do_you_properly_read_a_book/",
        "text": "I want to start reading daily but i am scared of wasting my time if i dont remember a lot from the book, so how do i read books effectively? should i take notes while reading? \n\n&amp;#x200B;\n\nsomething completely different: sometimes while reading i just zone out and then have to read the whole page again, is this normal?  how can i prevent it?",
        "created_utc": 1676588686,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good news: Your favourite author is releasing a new book! Bad news: It's the worst book they've done and goes against everything that make you like them. Who is the author and what's the book about?",
        "author": "CatholicCockney",
        "url": "https://www.reddit.com/r/books/comments/1143oys/good_news_your_favourite_author_is_releasing_a/",
        "text": "[removed]",
        "created_utc": 1676588064,
        "upvote_ratio": 1.0
    },
    {
        "title": "When you see this coming?⌛️😱🐻🏃‍♀️#bear #shortsfeed #shorts #sigma #legendary",
        "author": "pacificrimfan",
        "url": "https://youtube.com/shorts/AynGbsCA2w8?feature=share",
        "text": "",
        "created_utc": 1676587998,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reddit, pick a book off of this reading list for me. The top comment is the one I will choose.",
        "author": "International-Top145",
        "url": "https://www.reddit.com/r/books/comments/1143nap/reddit_pick_a_book_off_of_this_reading_list_for/",
        "text": "A lot of these are easy, and I’m a moderate to skilled reader, so keep that in mind. \n\nFantasy:\n\nHarry Potter and the Sorcerer's Stoner by J.K. Rowling\n\nHarry Potter and the Chamber of Secrets by J.K. Rowling\n\nHarry Potter and the Prisoner of Azkaban by J.K. Rowling\n\nHarry Potter and the Goblet of Fire by J.K. Rowling\n\nA Wrinkle in Time by Madeleine L'Engle\n\nArtemis Fowl by Eoin Colfer\n\nThe Lightening Thief by Rick Riordan\n\nThe Red Pyramid by Rick Riordan \n\nOff to Be the Wizard by Seth Meyer (a guy figures out how to hack the world and uses the programming code of the world to act like a wizard)\n\nSpell or High Water by Seth Meyer (sequel to Off to Be the Wizard)\n\nMagnus Chase and the Gods of Asgard by Rick Riordan (Norse mythology adventure book like Percy Jackson) \n\nMagnus Chase and the Gods of Asgard Book 2: The Hammer of Thor by Rick Riordan\n\nFablehaven by Brandon Mull (a brother and sister are sent to stay at their grandparents farm where everything is not as it seems) \n\nFablehaven: Rise of the Evening Star by Brandon Mull (Fablehaven Book 2)\n\nFablehaven: Grip of the Shadow Plague by Brandon Mull\n\n \n\n \n\nFiction:\n\nMonster by Walter Dean Myers (a pretty raw and shocking book about a boy on trial) \n\nEggs by Jerry Spinelli (a book about a teenage girl without friends forming a bond with younger boy that recently lost his mother) \n\nUngifted by Gordon Korman  (a fun book about a young man that goes to a gifted school but isn't gifted) \n\nSupergifted by Gordon Korman\n\nRules by Cynthia Lord (a book about a teenage girl dealing with her family and her autistic brother) \n\nThe Giver by Lois Lowry (dystopian society book where a boy learns more about his perfect town) \n\nGathering Blue by Lois Lowry (sequel to The Giver) \n\nThe Messenger by Lois Lowry\n\nSon by Lois Lowry\n\nFollow My Leader by James B. Garfield (a boy deals with his recent blindness after a friend threw a firework in his face) \n\nThe Thing About Jellyfish by Ali Benjamin (Suzy's friend dies in a drowning accident but Suzy won't believe that and searches for answers)\n\nGhost by Jason Reynolds \n\nMatilda by Roald Dahl\n\nThe Indian In the Cupboard by Lynn Reid Banks\n\nReturn of the Indian by Lynn Reid Banks\n\nBruiser by Neal Shusterman\n\nSourdough by Robin Sloan\n\nThe Midnight Library by Matt Haig\n\n \n\n \n\nCreepier Fiction:\n\nMiss Peregrine's Home for Peculiar Children  by Ransom Riggs (an odd story told based off of old pictures found by the author) \n\nHollow City by Ransom Riggs (the sequel to the book above) \n\nAmong the Hidden by Margaret Peterson Haddix \n\nAmong the Imposters by Margaret Peterson Haddix\n\nCoraline by Neil Gaiman\n\n \n\nSci-Fi:\n\nScythe by Neal Shusterman (in the future no one dies, so the computer controlling the world gives people the job of Scythe, and they are required to end the lives of people to help the population) \n\nRaptor Red by Robert T. Bakker (A paleontologist's story about the life of a dinosaur)\n\nJurassic Park by Michael Crichton\n\nAwaken Online: Catharsis by Travis Bagwell\n\nThe Martian by Andy Weir\n\n \n\nNon-fiction:\n\nPhineas Gage by John Fleischman (a true story about a man that had a railroad spike go through his brain and lived) \n\nMy Life in the Ring &amp; Out by Jack Johnson\n\n \n\nClassics:\n\nConnecticut Yankee in King Arthur's Court by Mark Twain (a man ends up in the medieval times of King Arthur where he gets to show off how smart he is) \n\nThe Prince and the Pauper by Mark Twain\n\nThe Count of Monte Cristo by Alexandre Dumas\n\n \n\nAction:\n\nSilverfin by Charlie Higson (a young James Bond does James Bond things) \n\nThe Hunger Games by Suzanne Collins\n\nCatching Fire by Suzanne Collins\n\nMockingjay by Suzanne Collins\n\nThe Ballad of Songbirds and Snakes by Suzanne Collins\n\nSteelheart (The Reckoners Book 1) by Brandon Sanderson\n\n \n\n \n\nMystery:\n\nAnd Then There Were None by Agatha Christie (a mystery book where people are invited to an island mansion and are being killed off one by one) \n\nThe Curious Incident of the Dog in the Night-Time by Mark Haddon",
        "created_utc": 1676587941,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good news: Your favourite writer decides to release a new book. Bad news: It is the worst book possible that goes everything that made you love their work. Who is this author and what's their book about?",
        "author": "CatholicCockney",
        "url": "https://www.reddit.com/r/books/comments/1143mg7/good_news_your_favourite_writer_decides_to/",
        "text": "[removed]",
        "created_utc": 1676587881,
        "upvote_ratio": 1.0
    },
    {
        "title": "how can i improve my reading?",
        "author": "TheXFey",
        "url": "https://www.reddit.com/r/books/comments/1143koi/how_can_i_improve_my_reading/",
        "text": "Hello...\nI have a problem only with English books, only the books. My main language is not english it's arabic, but whenever i read in my main language, the words flow and my imagination work as it's best. But when i read in english, i got a hard time imagining like my mind working to comprehend the words instead to imagine it and enjoy the journey, even tho i use everything in english, i watch and play in english.\n\n i even mostly write in english and understand about 80% of it, but when it comes to reading, i take like triple the time or maybe more to read 1 page and understand it completely.\n\nIs it vocabulary or fear? Idk. so please, can anyone give me some advice or try something new? Or some solutions if u overcome this issue. And thank you 🙏🏻",
        "created_utc": 1676587755,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you know books about Walt Disney?",
        "author": "Expensive_Ad_6896",
        "url": "https://www.reddit.com/r/books/comments/1143fcz/do_you_know_books_about_walt_disney/",
        "text": "[removed]",
        "created_utc": 1676587372,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you know books about Walt Disney?",
        "author": "Expensive_Ad_6896",
        "url": "https://www.reddit.com/r/books/comments/1143dlq/do_you_know_books_about_walt_disney/",
        "text": "[removed]",
        "created_utc": 1676587247,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made a fiction novel recently I hope you all like it",
        "author": "suf15",
        "url": "https://www.reddit.com/r/books/comments/114337v/i_made_a_fiction_novel_recently_i_hope_you_all/",
        "text": "  \n\n**\"The Unseen One: A Tale of Vengeance and Liberation.\"**\n\n**\"The Legacy of the Forgotten One\"** \n\n**You’re here…**\n\n**Alright I will enlighten you...**\n\nOnce upon a time, in a distant land shrouded in myth and legend, there lived a human of immeasurable strength and resilience. He was a force to be reckoned with, a titan among men, but alas, time was not a friend to such a man, and he sadly perished, leaving behind only memories and legends of his greatness. It was a pity indeed to witness the fall of someone so mighty and brilliant, but fate had other plans for him. The man was reborn a thousand years into the future, in a world vastly different from the one he had known, a world of advanced technology and interconnectedness, where he had to find his place once again. For the man, the tools and technologies that had become so prevalent in the modern world were both a handicap and a way to enhance his human limits. He saw how they could be used to improve lives, but also how they could be wielded to create division and inequality. Globalization had brought about new opportunities, but also new challenges and threats to cultural diversity and local economies. Despite these challenges, the man believed in the potential of humanity to overcome its limitations and create a better world. He saw that it was possible to use technology and innovation to promote sustainability and harmony with the natural world, and to create a more equitable and just society. The man's journey was not just a personal one, but a reflection of the broader struggle of humanity to find meaning and purpose in a rapidly changing world. Through his experiences, he came to realize that the true source of power lay not in technology or wealth, but in the ability to connect with others and find common ground. In the end, the man's legacy was not just one of individual achievement, but of a vision for a better future that inspired others to take up the challenge of building a more just and sustainable world. One of the places that the man visited during his travels was the great city of Baghdad. He had been there long ago, in a time when the city was a center of learning and culture. The halls of Baghdad were filled with scholars and poets, philosophers and mathematicians, all striving to unlock the secrets of the universe. As he walked through the city, he was struck by the sheer volume of knowledge that was being exchanged. He saw books being traded in the markets, and debates raging in the streets. He was reminded that knowledge comes with risk and obligation, and that the pursuit of truth can often lead to unforeseen consequences. But he was also inspired by the beauty and complexity of the world around him. He marveled at the intricacies of the architecture, the richness of the tapestries, and the intricate calligraphy that adorned the walls. He realized that even in the midst of chaos and confusion, there was beauty to be found. It was during his time in Baghdad that he began to understand the importance of balance. He saw that too much knowledge could lead to madness, but that too little could lead to ignorance. He realized that the key to a fulfilling life was to seek out knowledge, but to do so with a sense of humility and respect. In Baghdad he met a man person shrouded in darkness, whose name was Liu Chen. Despite the veil of obscurity that surrounded him, Liu Chen possessed great knowledge and wisdom. He became a mentor to the man, teaching him the ways of Buddhism and the art of channeling one's inner strength. To the man, Liu Chen was more than just a teacher, but a guide and a friend, someone who had shown him a path to enlightenment and inner peace. The man came to know Liu Chen as \"معلم,\" which means \"teacher\" in Arabic, and he would always remember the profound impact that Liu Chen had on his life.\n\nAnd so, he continued on his journey, gathering knowledge and experience wherever he went. He learned from the people he met, the books he read, and the places he visited. He also read the Quran and was mesmerized by its beautiful language and powerful message. He acknowledged it as a great religion with high morals and humility. The man's quest for knowledge and spiritual enlightenment was never-ending, and he continued to seek out new experiences and teachings wherever he went. He was constantly reminded that there was more to life than just knowledge, that there was a deeper purpose that he needed to fulfill. It was in this search for purpose that he finally found his sense of peace and purpose. He realized that his true calling was not just to acquire knowledge, but to use that knowledge to make a difference in the world. He saw that he had a responsibility to share what he had learned, to help others find their own sense of purpose and fulfillment. And so, he continued on his journey, carrying with him the lessons he had learned in the halls of Baghdad and beyond. As the man traveled through the land, he came across the ancient city of Alexandria. There, he marveled at the remnants of the great Roman Empire, which still stood tall and proud, despite the passage of time. But as he wandered through the ruins, he couldn't help but reflect on the fragility of empires and the fleeting nature of power. He had seen the rise and fall of many great empires in his time, and he knew that even the mightiest of kingdoms could crumble in an instant, leaving nothing but ruins and memories behind. It was a humbling reminder of the impermanence of all things and the importance of cherishing every moment in life. He knew that there would be challenges ahead, but he was ready to face them, armed with the knowledge and experience he had gained along the way. As the man's wealth grew, he found himself drawn to the stock market, amazed by the sheer volume of transactions taking place. He saw traders shouting across the floor, waving their arms in the air, and he marveled at the complexity of the system. But he also saw something else. He saw that much of what was being traded was controlled by a few, that there was a power dynamic at play that left many at a disadvantage. He saw the effects of greed and corruption, the way that the pursuit of wealth could lead to a loss of morality and ethics. And so, he made a conscious decision to use his wealth for good. He invested in businesses and organizations that he believed in, that he felt were making a positive impact on the world. He used his resources to support those in need, to provide education and resources to those who had been left behind by the system. But even as he tried to make amends for his past, he could not shake off the feeling that he was still haunted by his sins. He poured his heart and soul into the creation of various organizations, including one that he called Codex, which became a great business empire in its own right.\n\nBut he was not always a man of honor and integrity. In his youth, he had led a troubled life, scarred by a difficult past and haunted by the demons of his own making. He had hurt many people, both physically and mentally, and the weight of his sins hung heavily on his soul. However, he did not let his past define him. He worked tirelessly to make amends for his past transgressions and strove to live a life of purpose and meaning. He knew that the road to redemption was a long and arduous one, but he was determined to stay the course, no matter the cost. The memory of his pet crow and the mistakes he had made in his youth seemed to follow him everywhere. It was as if a new being had taken over his body, barking at him from within, reminding him of the wrongs he had committed. And so, he redoubled his efforts to make a positive impact, using his resources to right the wrongs of the past and create a better future for all. Through it all, he never forgot the lessons he had learned in the halls of Baghdad and beyond. He knew that knowledge came with a responsibility, and that the pursuit of wealth should never come at the cost of one's morality or ethics. And so, he continued on his journey, a constant reminder of the power of transformation and redemption.\n\nLong ago, he had met a crow, a dark-eyed black bird that had whispered thoughts into his ear and helped guide him on his journey. The man had formed a deep bond with the crow, and he often thought of it as he traversed the world, gathering knowledge and wisdom. But even as he amassed wealth and prestige, he could not shake off the feeling that he had lost something essential along the way. It was as if the crow had taken a part of him with it when it had passed away, leaving him adrift and unsure of his purpose. And so, he searched for something to fill the void, something that would give him a sense of belonging and direction. And then he met the mutt, and something about the animal's presence stirred a long-dormant memory within him. He felt a sense of familiarity and comfort around the creature, as if it held the key to unlocking the secrets of his past. As he looked into the mutt's purple eyes, he saw a reflection of his own soul, and he knew that he had finally found what he had been searching for. The mutt barked at him, a sharp, insistent sound that cut through the noise of the world and reminded him of his purpose. He knew that he could not undo the mistakes of the past, but he could use his wealth and knowledge to create a better future. He could honor the memory of the crow and the lessons it had taught him, and he could work to ensure that others did not make the same mistakes he had made. And so, he continued on his journey, with the mutt by his side and the memory of the crow in his heart, a testament to the power of transformation and redemption.\n\nThe man pondered on the Buddhist saying he had heard long ago in the halls of Baghdad, \"Give life when done, be truthful when it's hardest, and righteous when it's hard.\" He realized that with great power came great responsibility, and that he had a duty to use his knowledge and abilities for the betterment of mankind. However, his new life had also brought about great risk. As he delved deeper into his understanding of the world, he could think of things that could harm the world just as the airplane had once done. It was a delicate balance, but he knew he had to use his powers for good, even if it meant risking his own safety. As he sat in deep contemplation, the memory of the dark-eyed black crow came back to him. He remembered how the crow had whispered thoughts into his mind, as if trying to guide him towards a greater purpose. The mutt he had encountered seemed to possess a similar knowledge, and the man felt a kinship with the animal. He knew that he had to follow his instincts and continue on his path of discovery. In this new world, he saw that things had not changed much. Though society had evolved and progressed in many ways, it was still controlled and oppressed in its own unique ways. He saw that people were free yet suffocating under the weight of their own expectations and responsibilities. The man felt that it was his duty to help others break free from these constraints and find their own sense of purpose and meaning in life. \n\nAs he traveled and reflected on his past experiences, the man realized that he had fought in battles against Vikings and Romans, seeing many places burned to the ground and forgotten to time. Through these experiences, he had learned that life was full of hardships and challenges, but it was up to each individual to face them head-on and make the most of their circumstances. It then that he encountered bikers a gang of mercenaries and thugs who were robbing and pillaging the innocent. Their actions were a reminder that even in this modern world, there were still those who sought to take advantage of others. The man knew that he had to confront them, to fight against their oppression and bring justice to those who were suffering at their hands. The man faced the bikers with nothing but a simple wooden stick, determined to protect himself and those around him. The gang of mercenaries and thugs sneered and laughed at him, thinking that such a small and insignificant tool could never defeat their brute force and firepower. But the man was not to be underestimated, and he fought with a ferocity and determination that left them stunned. In the end, the man emerged victorious, having taken down each and every one of the bikers with nothing but his trusty wooden stick. As a trophy of his victory, he claimed one of their bikes, a sleek and powerful machine that he would use to travel the world and leave his mark on history. But even as he forged ahead, the sins of his youth still weighed heavily on his conscience. He had hurt many people, both physically and mentally, and the memories of his past misdeeds haunted him still. It was a burden that he would carry with him for the rest of his days, a reminder of the darkness that he had once embraced, and the light that he had now found. As he embarked through his journey through school, he saw that the values being taught were misplaced. The emphasis was on being a worker rather than an owner, on working for wealth and maintaining it rather than on creating something new and innovative. The man knew that this was not the path to true fulfillment and happiness, and he sought to guide the younger generation towards a more fulfilling and meaningful life. As he fought against these forces of oppression and ignorance, the man remembered the Buddhist saying: \"Give life when done, prevail to be truthful when it's hardest, and righteous when hard.\" He knew that his actions would have consequences and that he had to be true to himself and his values. He recognized that his new life had brought about new risks to the world, just as the airplane had once done. But he was determined to use his power for good, to make a positive difference in the world and leave behind a legacy of hope and inspiration for future generations. As he journeyed through the modern world, the man encountered a woman with mystical blue eyes. Though she was short in stature, she possessed an indomitable will and fierce determination. He was struck by her remarkable strength when he witnessed her heroically stop a child from being harmed by a moving car. As he marveled at women’s act of bravery, the man couldn't help but feel drawn to her. He asked her why she had risked her life for the child, and she simply smiled and replied, \"Every life is important, even a child's. We must protect each other to survive.\" Her words resonated with the man, and he knew he had met someone special. He then asked the woman for her name, and she replied with a smile, \"Sharifa.\" Sharifa asked the man if he had a name and invited him to dine at a local bistro. Seeing that the man was somewhat impatient, she suggested they grab a bite to eat and get to know each other. As they sat down to dine at the bistro, Sharifa turned to the man and asked for his name. He paused for a moment before answering, \"I have no name other than what people call me.\" Sharifa looked at him quizzically, and he continued, \"My name is أعمى واحد منسي, which means 'the one who sees but chooses to be forgotten.” Sharifa was taken aback by the man's response, and for a moment, they sat in silence. She couldn't help but feel intrigued by this mysterious man, who seemed to have a deep sense of purpose and identity, despite his lack of a conventional name. Over the course of their meal, they talked at length about their respective journeys and the challenges they had faced along the way. Though their time together was brief, Sharifa and أعمى واحد منسي developed a strong connection and became the best of friends. Even though Sharifa was engaged to another man, their bond was unbreakable, and they continued to support each other through life's ups and downs. As the rain poured down, the man couldn't help but feel a sense of melancholy. His loyal companion, the purple-eyed mutt, seemed to be pleading with him to stay with Sharifa, but he knew that his journey was not yet complete. He had a mission to find the ancient ruins that held the secrets of the past, and perhaps even the key to prevent the eventual collapse of the world as it was known. So, with a heavy heart, he bid Sharifa farewell and set out on his quest once more. As he delved deeper into the ruins and uncovered the forgotten knowledge of the past, the man couldn't shake the feeling that there was a purposeful **erasure** of history. The missing pieces seemed to fit together, painting a picture of a larger force at play, guiding the world toward a certain direction. The man was left pondering the motives behind this deliberate obfuscation, wondering who could be behind it and what they stood to gain. Despite the weight of these questions, the man persevered, determined to uncover the truth and expose the secrets hidden in the shadows. As the man journeyed through the ancient ruins, he found himself being pursued by a group of masked men, all donning a distinct symbol that he recognized from his encounter with the biker gang - a crescent with twin swords, one blue and one red. Despite his attempts to evade them, they continued to follow him, making his travels increasingly difficult and dangerous. The man began to wonder about the true intentions of these mysterious figures and why they were so determined to stop him from uncovering the secrets hidden within the ruins. The man was soon captured and was taken to the warehouse, he couldn't help but feel a sense of unease. The symbols on the walls were familiar, but he couldn't quite place them. It wasn't until he saw their crest that he realized he was dealing with a group of powerful and ancient individuals. They were an order that had long been forgotten, their influence and power hidden from the world. The man knew he was in trouble, and his capture was proof of that. As he was brought before their leader who was very tall, the man tried to keep a calm demeanor, but his heart was pounding in his chest. The leader spoke in a language the man didn't understand, but his tone and body language made it clear he was not happy about the man's intrusion. The man tried to explain that he was just a traveler, but the leader was not convinced. Days turned into weeks, and the man was kept in captivity. He was treated well, but he knew his life was in danger. The order was known for their extreme methods and willingness to do whatever it took to protect their secrets. The man knew he had to find a way to escape before it was too late. His purple-eyed mutt, who had not been captured with him, came to the rescue and was able to use the keys to free him from his captivity.  \n\nThe man thought back to his teacher Liu zhen and how he had always hoped to establish an order of brilliant minds to share information. The symbol resembled his teacher's medallion, but his teacher was long dead, so he had figured this was a new, more extreme group of people. However, he still had doubts in his heart. As he regrouped and confronted the masked men's group leader, what he saw horrified him. He saw not his own reflection, but he saw his teacher Liu zhen. He couldn't believe his eyes and wondered if he was losing his mind. The man couldn't shake off the feeling that something was off about his teacher's doppelganger. He remembered how his teacher had been a kind-hearted man who helped people in need and had been a wise sage of his own time. However, this man was different, a likely clone or copy but void of a soul. Despite his doubts, he put his teacher's double in jail and began to investigate further, determined to uncover the truth. As days turned into weeks and weeks into months, he sent various messages to informants around the world and realized that this organization was not what it seemed. Instead, it was a mega-paramedical giant tied to the ancient ways and had imprisoned his teacher, معلم, deep underground. Somehow, his teacher was still alive but appeared to be dead, as if he was being kept from death's door until his last breath. The man pitied his former teacher and was hesitant to kill him, but he knew that he had to free his soul from the suffering. As his mortal body turned to dust, the man vowed vengeance against the accursed organization.\n\nAs the man settled down in his various strongholds around the world, he continued to gather intelligence and support from various resistance fighters and informants, biding his time until he was ready to strike against the powerful organization. In Japan, he found particular support from the resistance fighters, who had long been battling against the organization's influence. With their help, he was able to uncover more information about the organization's inner workings and expand his network of allies.\n\n   \n \n\nOne day, as he was meditating in the shrine of Komitake at Mt. Fuji, he felt a ghost-like presence and heard a faint voice thanking him for freeing his teacher's soul. He knew it was his teacher, Liu Zhen, and felt a sense of comfort and closure knowing that he had done the right thing. With his resolve strengthened, he continued his preparations to take down the organization and bring justice for all those they had harmed.\n\nOne day, as he was planning his next move from his headquarters in Japan, he received a mysterious message from an unknown sender. The message contained coordinates to an uncharted island in the Pacific, and a cryptic note that read \"the key to ultimate power lies within\". Intrigued and cautious, the man gathered a small team and set sail to the island.\n\n After a treacherous journey, they arrived at the island and discovered an ancient temple hidden in the dense jungle. Inside the temple, they found a secret chamber with a glowing crystal that seemed to pulsate with energy. As he reached out to touch the crystal, he was enveloped in a blinding light and a voice boomed in his mind, revealing to him the true nature of the organization and their plans for world domination. Now armed with this newfound knowledge and power, the man and his team set out on a mission to stop the organization once and for all. They launched a full-scale assault on their main base and engaged in a fierce battle in Tibet, but ultimately emerged victorious.\n\nWith the organization defeated, the man and his team continued to work towards creating a better world, using the knowledge and resources they had gained to help those in need and promote peace and unity. Though his name was forgotten, the man and his team became symbols of hope and bravery, and their story continued to inspire people for generations. With the help of his fighters, Asia was soon free of the organization's presence. The man then went back to Japan and established his headquarters in the heart of Liberation City, calling it Freedom United. As the man continued to lead the Freedom United in Liberation City, he discovered more about the evil organization's plot to limit the growth of mankind by carefully controlling what technologies could be released. It was a shocking revelation that he knew had to be brought to the world's attention. With the help of his allies, he launched a massive campaign to expose the organization's wrongdoings, and as a result, many children were saved from being used as pawns in the organization's schemes. As more people learned the truth about the organization's nefarious agenda, its power began to crumble, and its leaders were brought to justice. The man finally felt a sense of peace knowing that he had helped to liberate the world from the grip of tyranny and evil. He knew that there would always be new challenges to face, but with the Freedom United in Liberation City, he was ready to face them head-on, and build a better, brighter future for all.",
        "created_utc": 1676586544,
        "upvote_ratio": 1.0
    },
    {
        "title": "Making a Scene by Constance Wu",
        "author": "snru123",
        "url": "https://www.reddit.com/r/books/comments/11431bg/making_a_scene_by_constance_wu/",
        "text": "Hello, \n\nI wanted some opinions on this book. I just finished reading it and I really liked it! I find Constance very relatable. I was at my local library and the book intrigued me. I knew nothing about Constance and her career until reading her book. I think for now on I shouldn’t go on goodreads (lol) until  I’m done reading the book because I was able to read her book without any bias.",
        "created_utc": 1676586406,
        "upvote_ratio": 1.0
    },
    {
        "title": "Humankind: A Hopeful History was incredible",
        "author": "amahl_farouk",
        "url": "https://www.reddit.com/r/books/comments/1142w5r/humankind_a_hopeful_history_was_incredible/",
        "text": "[removed]",
        "created_utc": 1676586041,
        "upvote_ratio": 1.0
    },
    {
        "title": "Space: The Final Effrontery",
        "author": "Battleboo_7",
        "url": "https://www.reddit.com/r/books/comments/1142v1p/space_the_final_effrontery/",
        "text": "[removed]",
        "created_utc": 1676585965,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does one read the Robin Hobb books?",
        "author": "ssbooknerd",
        "url": "https://www.reddit.com/r/books/comments/1142jdu/how_does_one_read_the_robin_hobb_books/",
        "text": "[removed]",
        "created_utc": 1676585145,
        "upvote_ratio": 1.0
    },
    {
        "title": "Author recommendation: Jordan Harper",
        "author": "cdrwork",
        "url": "https://www.reddit.com/r/books/comments/1142d6n/author_recommendation_jordan_harper/",
        "text": "[removed]",
        "created_utc": 1676584737,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help identifying books.",
        "author": "robrobdotexe",
        "url": "https://www.reddit.com/r/books/comments/1142d4z/help_identifying_books/",
        "text": "Does anyone know what these types of books are called or how I can search online for them?\n\nMy son has seen them in YouTube videos and the best way I can describe them is like origami, but the book has pages with figures you can tear out, fold, and paste and they can perform actions when contracted. For example, a penguin figure you can fold and when pressed down, it will retract and jump.",
        "created_utc": 1676584733,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it just me or does nobody edit their books anymore?",
        "author": "Evilsatan31",
        "url": "https://www.reddit.com/r/books/comments/1142b2x/is_it_just_me_or_does_nobody_edit_their_books/",
        "text": "Noticing small typos (sometimes a lot of them) in books written after 2010 and newer. Is it because authors aren't going through editors anymore or is this just the new generation of laziness? Not blaming anyone obviously. I still read the books and work past it, but it's something I've noticed a lot when I find new books.",
        "created_utc": 1676584585,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it just me or does nobody edit there books anymore?",
        "author": "Evilsatan31",
        "url": "https://www.reddit.com/r/books/comments/11428qi/is_it_just_me_or_does_nobody_edit_there_books/",
        "text": "Noticing small typos (sometimes a lot of them) in books written after 2010 and newer. Is it because authors aren't going through editors anymore or is this just the new generation of laziness? Not blaming anyone obviously. I still read the books and work past it, but it's something I've noticed a lot when I find new books.",
        "created_utc": 1676584421,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Possibly Spoilers) Loving Misborn overall, but there's a few things that bother me.",
        "author": "ohmyllamas",
        "url": "https://www.reddit.com/r/books/comments/11421cf/possibly_spoilers_loving_misborn_overall_but/",
        "text": "I made a post the other day about how Mistborn has really sucked me in, this much is still true, and overall I enjoy Sanderson's writing style and choice of words, but I feel the need to talk about a couple of things that make me itch a little.\n\nThese critiques have probably been said before and honestly are just nitpicks, so take it with a grain of salt.\n\nI'm not sure if these count as spoilers but I'm tagging it just to be safe.\n\n&gt;!First off, the characters \"smile\" and \"frown\" way more in a single chapter than I've seen anyone do in a whole day, and sometimes it kind of pulls me out of the story a little.!&lt;\n\n&gt;!I'm loving the magic system a lot, but the way he describes it sometimes is so goddamn kooky. Especially some of the names for the powers like steelpush.!&lt;\n\n&gt;!\"Vin turned on her tin.\" \"Kelsier burned steel.\" \"He used his steelpush to jump over the wall.\" \"She used her ironpull to flip the ingot back into her hand.\"!&lt;\n\nI'm no writer so I really can't say if there's a better way to name and describe these.\n\nAgain, these are just nitpicks, and its certainly not a deal breaker for me, just wanted to see some other opinions.",
        "created_utc": 1676583905,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips on how to read more books and make more time to read?",
        "author": "Spiritual_Trash_231",
        "url": "https://www.reddit.com/r/books/comments/1141si9/any_tips_on_how_to_read_more_books_and_make_more/",
        "text": "Okay so i have a couple of friends who can literally fly through books so easily and finish them so fast and I wish to be like that. I am a pretty average paced reader and I try to read as much as I can but I am somewhat busy. Any tips on how to read more books and overall just make more time to read?",
        "created_utc": 1676583305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which book have been the most different from your expectations?",
        "author": "Holmbone",
        "url": "https://www.reddit.com/r/books/comments/1141rha/which_book_have_been_the_most_different_from_your/",
        "text": "[removed]",
        "created_utc": 1676583232,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to read more books and make time to read",
        "author": "Spiritual_Trash_231",
        "url": "https://www.reddit.com/r/books/comments/1141r02/how_to_read_more_books_and_make_time_to_read/",
        "text": "[removed]",
        "created_utc": 1676583199,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which book has been the most different from what you expected?",
        "author": "Holmbone",
        "url": "https://www.reddit.com/r/books/comments/1141po9/which_book_has_been_the_most_different_from_what/",
        "text": "[removed]",
        "created_utc": 1676583110,
        "upvote_ratio": 1.0
    },
    {
        "title": "American Gods is an amazing audiobook.",
        "author": "slayer1am",
        "url": "https://www.reddit.com/r/books/comments/1141lmr/american_gods_is_an_amazing_audiobook/",
        "text": "[removed]",
        "created_utc": 1676582832,
        "upvote_ratio": 1.0
    },
    {
        "title": "blood samurai",
        "author": "trinioktau23",
        "url": "https://www.reddit.com/r/books/comments/1141abi/blood_samurai/",
        "text": "[removed]",
        "created_utc": 1676582058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Favourite nostalgia trip?",
        "author": "UpbeatInsurance5358",
        "url": "https://www.reddit.com/r/books/comments/11419o8/favourite_nostalgia_trip/",
        "text": "[removed]",
        "created_utc": 1676582011,
        "upvote_ratio": 1.0
    },
    {
        "title": "blood samurai",
        "author": "trinioktau23",
        "url": "https://www.reddit.com/r/books/comments/11418o1/blood_samurai/",
        "text": "[removed]",
        "created_utc": 1676581943,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alibris Trustworthy?",
        "author": "ZombieshadoW0517",
        "url": "https://www.reddit.com/r/books/comments/11410md/alibris_trustworthy/",
        "text": "[removed]",
        "created_utc": 1676581382,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Flowers for Algernon the new meta?",
        "author": "Trimalchio8",
        "url": "https://www.reddit.com/r/books/comments/1140yrg/is_flowers_for_algernon_the_new_meta/",
        "text": "Feels like I all see on r/books are posts about someone who has just read Flowers for Algernon. Don't get me wrong, it's an incredible book (and probably my personal second favourite book after To Kill a Mockingbird) but I am just bored of seeing the same old posts about how great it is/how many tears have been shed/how moved someone is by it. \n\nI don't know, I had a post auto-removed a month or two ago about whether people skip book introductions, as apparently that's a subject which has been posted to death. Is it time to start auto-removing Flowers for Algernon posts? You know, in order to balance the meta?",
        "created_utc": 1676581252,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Tangled Tree by David Quammen",
        "author": "snowbizzel",
        "url": "https://www.reddit.com/r/books/comments/1140qdg/the_tangled_tree_by_david_quammen/",
        "text": "[removed]",
        "created_utc": 1676580644,
        "upvote_ratio": 1.0
    },
    {
        "title": "A book u’ve read that have changed your life and mindset?",
        "author": "Careless-Knee-1278",
        "url": "https://www.reddit.com/r/books/comments/1140c06/a_book_uve_read_that_have_changed_your_life_and/",
        "text": "[removed]",
        "created_utc": 1676579623,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think of \"A Scanner Darkly\" and its ending?",
        "author": "Bellegarigue",
        "url": "https://www.reddit.com/r/books/comments/113zwti/what_do_you_think_of_a_scanner_darkly_and_its/",
        "text": "I'm not going to mention the details of the end of the novel because that's against the rules, but do you think it's an analogy to the \"War On Drugs\" and how the government efforts just make the problem worse? To me this is interesting because it was first published in 1977. That was before I existed, but I do know that when people complain about the \"War On Drugs\", they are referring to a lot of the things the U.S. did in the 80's, so maybe PKD was \"ahead of his time\" or something? People have said that about him.\n\nOther than that, I think the dimension of the book where the protagonists mind is slowly deteriorating is really interesting, and then there's the subtle Dickian humor which is always a treat when you spot it.",
        "created_utc": 1676578530,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just read East of Eden - wow what a book! Curious what people think of the idea of fate.",
        "author": "TakeARideOnMyBWC",
        "url": "https://www.reddit.com/r/books/comments/113zgdo/just_read_east_of_eden_wow_what_a_book_curious/",
        "text": "[removed]",
        "created_utc": 1676577352,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some books that aren't really LGBT but have LGBT themes or characters in them?",
        "author": "shade_plant",
        "url": "https://www.reddit.com/r/books/comments/113zda7/what_are_some_books_that_arent_really_lgbt_but/",
        "text": "LGBT people are everywhere, even when we aren't wearing pride shwag! It's like this in literature, too. \n\nSo to me, for example, Geek Love was queer in the way that it held up a mirror to capitalism but at the same time, was about people who didn't choose to be strange and had to manage in the world and adapt. Then, there's Kafka on the Shore, which has a trans character (there's also Middlesex, but let's ignore that one). Tomorrow and Tomorrow and Tomorrow is said to have some queer themes (I haven't read it yet). Orlando does for SURE, as does Thistlefoot, which came out last year, and Fiona and Jane. \n\n&amp;#x200B;\n\nWhat else?",
        "created_utc": 1676577121,
        "upvote_ratio": 1.0
    }
]