[
    {
        "title": "Looking for name of retro children’s book",
        "author": "AptYes",
        "url": "https://www.reddit.com/r/books/comments/11rtdha/looking_for_name_of_retro_childrens_book/",
        "text": "Hello! I’m trying to recall the name of a children’s book, probably from the late 60’s-70’s.\nIt was illustrated with a very colorful, bordering on a sort of psychedelic style. In my mind I keep seeing the main character being some sort of investigator that resembles the Pringles potato chip logo. I know this is a long shot, but if anyone has any ideas I’d appreciate hearing them. I realize this is an awkward and limited description, but any help or ideas are welcome. Thanks!",
        "created_utc": 1678879001,
        "upvote_ratio": 1.0
    },
    {
        "title": "Literature of The Netherlands: March 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/books/comments/11rt320/literature_of_the_netherlands_march_2023/",
        "text": "Welkom readers, \n        \nThis is our monthly discussion of the literature of the world!  Every Wednesday, we'll post a new country or culture for you to recommend literature from, with the caveat that it must have been written by someone from that there (i.e. Shogun by James Clavell is a great book but wouldn't be included in Japanese literature). \n               \nToday is the National Festival of Trees in The Netherlands and, to celebrate, we're discussing Dutch literature!  Please use this thread to discuss your favorite Dutch literature and authors.\n                \nIf you'd like to read our previous discussions of the literature of the world please visit the [literature of the world](https://www.reddit.com/r/books/wiki/literatureof) section of our [wiki](https://www.reddit.com/r/books/wiki/index). \n               \nBedankt and enjoy!",
        "created_utc": 1678878114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Win your 50$ reward ASAP!",
        "author": "Piash56",
        "url": "https://www.reddit.com/r/books/comments/11rt2ja/win_your_50_reward_asap/",
        "text": "[removed]",
        "created_utc": 1678878075,
        "upvote_ratio": 1.0
    },
    {
        "title": "Connect Attestation in Qatar offers the Best Experience certificate attestation service",
        "author": "connectattestation",
        "url": "https://www.reddit.com/r/books/comments/11rsh87/connect_attestation_in_qatar_offers_the_best/",
        "text": "[removed]",
        "created_utc": 1678876242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why people are so obsessed with these booktok famous books?",
        "author": "nightOwlwhy",
        "url": "https://www.reddit.com/r/books/comments/11rsb3u/why_people_are_so_obsessed_with_these_booktok/",
        "text": "Okay, so I'm genuinely curious and don't take this as an offensive   question or anything like that, I just want to know bout the opinions of others on this, \n\nLike why? Why ppl are so obsessed with Coho's novels or any other books that are in trend cause of booktok or other platforms like that. What is in it? And yep I've read one of her books 'it ends with us cause my roommate had it and for me it was a total waste of time. So why ppl are so interested in it? Is this because they are new readers? Or because the language is easy? Or maybe because everyone's commenting on it? Either the comments are positive or negative. Like what's the reason? Don't take it as I'm targeting y'all for reading it. I'm just curious. Baki ofc ppl can read whatever they want...",
        "created_utc": 1678875695,
        "upvote_ratio": 1.0
    },
    {
        "title": "Loki book to review",
        "author": "toyfan1990",
        "url": "https://rumble.com/v2cduwi-loki-book-to-review.html?mref=1uluhs&amp;mc=5nvef",
        "text": "[removed]",
        "created_utc": 1678874107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Station Eleven by Emily St. John Mandel is probably one of the best books I've read.",
        "author": "horker_meat123",
        "url": "https://www.reddit.com/r/books/comments/11rr92h/station_eleven_by_emily_st_john_mandel_is/",
        "text": "[removed]",
        "created_utc": 1678872170,
        "upvote_ratio": 1.0
    },
    {
        "title": "if you're ever looking for a quick read, or a book to share with your kids, look no further.",
        "author": "WinterBlueMoon",
        "url": "https://www.reddit.com/r/books/comments/11rr38d/if_youre_ever_looking_for_a_quick_read_or_a_book/",
        "text": "I thought I'd give a shout out to this book I recently read. It's a primary school page-turning horror/suspense that appears to be inspired by Goosebumps (author section says they grew up reading them). The book is set in Tasmania, Australia at Gordon's Lake, a fictional campground in the fictional munipality called Van Diemen's Valley (which is the name of the series).\nIt's probably more suited for confident readers 10 years and older, but I had a lot of fun reading it with my 6 year old at bedtime (I personally primarily read around the YA range). \n\nIt's about a boy named Brad who has to spend the last week of school holidays with his aunt, uncle and cousin at Gordon's Lake. Brad hasn't seen them for a years and barely remembers them. \n\nA lot of strange things happen to Brad from the moment he arrives. Immediately he is warned away from the warehouse which has a deadly history behind it, his cousin Jason loves playing pranks on him and he meets some kids his own age who disappear a lot. The creepiest part is how he appears to be haunted/stalked by a ghostly voice that whispers his name and tells him he will never leave. The atmosphere and the setting of the campground are really cool and spooky and almost every chapter on a cliffhanger which leads to a satisfying conclusion. The other cool part is the writer leaves clues throughout the book that if you go back you'll say 'oh yeah' that makes total sense/how did I not see it.\n\nAnyway, I thought I'd share my thoughts since this book is pretty much limited to Tasmanian bookstores but is available online and thought it was worth giving it a bit of a shout out.\n\nDefinately worth reading if you have kids.",
        "created_utc": 1678871627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get smarter!!",
        "author": "123789Sou",
        "url": "https://www.reddit.com/r/books/comments/11rr35u/get_smarter/",
        "text": "[removed]",
        "created_utc": 1678871620,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fahrenheit 451 from Ray Bradbury is not SF any more",
        "author": "besucherke",
        "url": "https://www.reddit.com/r/books/comments/11rqwr6/fahrenheit_451_from_ray_bradbury_is_not_sf_any/",
        "text": "I really like to read old science fiction and observe how the passing decades have changed their validity. Flying cars is still a dream today, but stories dealing with the human soul usually keep up really well.\n\nEvery element of Ray Bradbury's novel has become a reality in the seventy years since its publication: the robot dog, the overwhelming social media, the obscurity of the canonized common culture, loneliness, the empty family relationships, the media entertainment as a circus. Therefore, the SF label is not really needed for this novel any more, I really recommended to read it as a satire.\n\nIf someone still didn't hear its story: Guy Montag (what a name!) works as a fireman, saving the people from thinking by burning any and all books deemed dangerous and subversive by society. His marriage with his wife has also become empty, and his life is dull. Out of curiosity, he starts flipping through the books condemned to be burned, and the thoughts he receives drop by drop transform his everyday life.\n\nI haven't seen neither the Netflix series nor the movie, but I can really suggest anyone to read the book. It is available in several editions, even in some audio book versions on Spotify. I received a copy containing other short stories from the library, Like in such selections, those stories are of different quality. There are some in which Bradbury's romantic, human-centered writing style is enchanting, and some are not so striking - if someone wants to read a collection of short stories by the author, I rather recommend the Martian Chronicles.\n\nSummarized, Fahrenheit 451 is really great, I'm sorry I waited for so long reading it until now.",
        "created_utc": 1678871030,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should I read next? After Tolkien and GMartin.",
        "author": "Ragahell",
        "url": "https://www.reddit.com/r/books/comments/11rqu3j/what_should_i_read_next_after_tolkien_and_gmartin/",
        "text": "Can you tell without spoilers what you like or don't like about these book series? To help me decide my next one? If not just let me know your favourite :)\n\n1- Brandon Sanderson - \"Mistborn: The Final Empire\"\n\n2- Brandon Sanderson - \"The Stormlight Archive\"\n\n3- Stephen King - \"The Dark Tower\"\n\n4- Steven Erikson - \"Malazan Book of the Fallen\"\n\n5- Patrick Rothfuss - \"The Kingkiller Chronicle\"\n\n6- Rick Riordan - \"Percy Jackson and the Olympians\"",
        "created_utc": 1678870810,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should I read next? After Tolkien and Ice and Fire.",
        "author": "Ragahell",
        "url": "https://www.reddit.com/r/books/comments/11rqsje/what_should_i_read_next_after_tolkien_and_ice_and/",
        "text": "[removed]",
        "created_utc": 1678870659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book review of how to be a writer by Ruskin Bond",
        "author": "Old-Maintenance-8045",
        "url": "https://www.reddit.com/r/books/comments/11rpcbg/book_review_of_how_to_be_a_writer_by_ruskin_bond/",
        "text": "[removed]",
        "created_utc": 1678865607,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice from you guys",
        "author": "zm3sss",
        "url": "https://www.reddit.com/r/books/comments/11rp43s/advice_from_you_guys/",
        "text": "[removed]",
        "created_utc": 1678864822,
        "upvote_ratio": 1.0
    },
    {
        "title": "تحميل كتاب قوة التحكم بالذات pdf",
        "author": "Silent-Ambition-8757",
        "url": "https://golden-library1.blogspot.com/2023/03/The-power-of-self-control.html",
        "text": "",
        "created_utc": 1678862821,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have shared my book list with you. Come and take a look!",
        "author": "CrAZy___girl",
        "url": "http://comi.life/1HrvxR",
        "text": "",
        "created_utc": 1678862458,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello, I'm looking for recomendations of interesting books or journals that were written by people of ancient civilisations like greeks, romans, mesopotamian, etc.",
        "author": "Megatheriumm",
        "url": "https://www.reddit.com/r/books/comments/11ro874/hello_im_looking_for_recomendations_of/",
        "text": "[removed]",
        "created_utc": 1678861762,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to write a book.",
        "author": "RoundBudget5961",
        "url": "https://www.reddit.com/r/books/comments/11rny8h/trying_to_write_a_book/",
        "text": "[removed]",
        "created_utc": 1678860854,
        "upvote_ratio": 1.0
    },
    {
        "title": "just finished better than movies....",
        "author": "Big_Park1737",
        "url": "https://www.reddit.com/r/books/comments/11rnw91/just_finished_better_than_movies/",
        "text": "[removed]",
        "created_utc": 1678860666,
        "upvote_ratio": 1.0
    },
    {
        "title": "just finished better than movies...",
        "author": "Big_Park1737",
        "url": "https://www.reddit.com/r/books/comments/11rnt8g/just_finished_better_than_movies/",
        "text": "[removed]",
        "created_utc": 1678860388,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I read books despite my problems with racing thoughts?",
        "author": "IncompetenceHater",
        "url": "https://www.reddit.com/r/books/comments/11rni0l/how_can_i_read_books_despite_my_problems_with/",
        "text": "Even though it's not my favorite subject, I love English class, and I love to read. However, some of my mental disorders are getting worse. I have begun to get racing thoughts, and this has been a problem while I am reading texts and books. As a result, even though I have always had high grades in English, I got my first B- in AP Language last semester, the first B- in all of my years of schooling. Bummer, right? Yes, a B- is good, and some people would die to have a B-, especially in an AP class. My problem is I never get Bs, and this is showing that my racing thoughts are getting in the way of being able to read books for English class.\n\nI talked to the English teacher that I had sophomore year (I'm a junior), who is also the AP Lit teacher at my school. She told me if I am having trouble getting through reading, AP Lit would very risky to take. She recommended Dual Enrollment English 101/102. As some of you might know, 101 and 102 in college are similar to AP Language. I do not want to take 101 or 102 because I would have already taken Lang, and I am sick of non-fiction. *In Cold Blood* is the death of me right now. \n\nI miss reading a novel and talking about it with other students and the teacher the next day. I don't want to read about random murders that had no impact on society at all and other miscellaneous topics. I want to dive into a world, a world that is not ours and explore it. A fiction book.\n\nMy senior year will start on the last Monday of August. I have until then to fix this problem of racing thoughts. If I don't I will probably start failing AP Lit and have to switch to DE 101/102.\n\nPeople might say I should get therapeutic and psychiatric treatment, but I already am. A previous psychiatrist overmedicated me, so I have to start over because I ceased my medication. I was put on Lamotrigine, but from what I know, it does not help racing thoughts, so I was recently put on anxiety medication. My therapist will assist me with these racing thoughts as well. In addition, I will be getting a 504 Plan by the end of this week to allow me to ask for extensions on assignments without question.  \n\n\nBut let us postulate a world where I still have racing thoughts and struggle to get through a book.\n\nHow can I read books at a normal pace while still having the problem of racing thoughts?",
        "created_utc": 1678859353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help",
        "author": "Annaelizabethsblog",
        "url": "https://www.reddit.com/r/books/comments/11rnhqi/help/",
        "text": "A few years ago someone gave me a book. \nIt took me forever to read it, because it was magical realism and poetical prose. It was beautiful I remember having a glass of white white reading it in the evening in the summer with my slider open. \nI’ve moved a couple of times since I read it. I can’t find it, and I’d like to buy it again, but.. I don’t remember the title. I only remember a few specific things.\n1. It was a magical house with only women. I think the portraits talked, and if they didn’t, they were still characters in the story.\n2. The girl had just ended a romance with a professor… at the very end… you realize (spoiler) the professor was a woman. \n3. I think house was in the title. \nAny ideas?",
        "created_utc": 1678859325,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking advice, NOT recommendations",
        "author": "amadeus451",
        "url": "https://www.reddit.com/r/books/comments/11rnelo/seeking_advice_not_recommendations/",
        "text": "I was curious about comedy novels.  I loved Confederacy of Dunces, and it is my baseline for comedy novels.  I, alternatively, couldn't get past the first 50 pages of The Sellout-- it was witty and all that but I was annoyed by all the little asides (that would expand into taking up a whole page), and that book is lauded as one of the funniest in recent memory.  Now I'm reading Canticle for Liebowitz and I can't stop.  Its been a while since a book gripped me back like this and I wanna carry the momentum forward.\n\nSo, this brings me to my question.  And once again, to make it clear for the mods: I in no way am seeking a recommendation, I seek comparative analysis from someone (again, I swear on the basic grace we have to be able to print words, not seeking recommendations).  So, Candide has been knocking around my bookshelf for years and I just wanna know-- is the comedy similar between Canticle and Candide?\n\nIt wasn't assigned reading while I was in school, but hear its a slept-on, hilarious classic.  Please, oh on-high ones-- hear my peal that I only want someone to compare and contrast for me and absolutely not to recommend or not.",
        "created_utc": 1678859026,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help with reading",
        "author": "Max_E_Mas",
        "url": "https://www.reddit.com/r/books/comments/11rn7h6/i_need_help_with_reading/",
        "text": "I feel really embarrassed to make this post. I feel like reading should be as simple as walking or picking up a feather off the ground, but it never has been that way for me. I always had issues with reading. I always wanted to, but it always feels like things are holding me back.   \n\n\nI feel sort of overwhelmed by how much maybe in a book. Unless its a picture book (IE comics, manga and so forth) I feel sort of daunted by reading something along the lines of ... say Of Mice and Men. The text seems so small and I find it hard to read sometimes. Like I feel like I can read a whole page and not understand anything Ive read.   \n\n\nI feel like I may have dyslexia. I say may because I never been diagnosed and I don't feel comfortable saying \"Yes I do have this.\" unless I actually have been told that I do. Though, people who are have told me I shown signs of it and often times I will misread what someone sends me on discord or something and I need to double check to make sure I was understanding correctly. So, if I did have it Ill say I would not be shocked.   \n\n\nSorry for the rambling I am trying to get everything out here. I just ... idk if anyone else feels this way. Like reading can be such a chore even though you want to. Is there like, any suggestions that could make it easier? Any tips or something? Any help would be appreciated. Thanks.   \n\n\nP.S. I am pretty sure this post is fine to put here since Im talking about reading books but in case Im wrong I'm sorry for bothering everyone.",
        "created_utc": 1678858344,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any books about working in a fast-paced kitchen?",
        "author": "CaptainBeefheart69",
        "url": "https://www.reddit.com/r/books/comments/11rmvx6/any_books_about_working_in_a_fastpaced_kitchen/",
        "text": "[removed]",
        "created_utc": 1678857250,
        "upvote_ratio": 1.0
    },
    {
        "title": "Virginia Woolf, Mary Chapin Carpenter, Harlan Ellison, and Andrew Marvell walk into a bar ...",
        "author": "Available-Page-2738",
        "url": "https://www.reddit.com/r/books/comments/11rmdkn/virginia_woolf_mary_chapin_carpenter_harlan/",
        "text": "Virginia Woolf mentioned, famously, that a writer needed \"a room of one's own.\" \n\nMary Chapin Carpenter sang about \"cool quiet and time to think.\" \n\nHarlan Ellison said it so many times I've lost track: \"Pay the writer.\" \n\nAnd before them all, Andrew Marvell mentioned \"world enough and time.\"\n\nSo does anyone have any estimates on how many authors can actually swing it? How many people make enough off their writing to enable them to continue writing. Without a side gig. Without someone else's money supporting them. Just Constant Writer up in the garret or in the spare room writing the next story.",
        "created_utc": 1678855599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help! I am trying to find a teen fiction book I read as a teen about a school attended by angels.",
        "author": "theunfinishedletter",
        "url": "https://www.reddit.com/r/books/comments/11rm92l/please_help_i_am_trying_to_find_a_teen_fiction/",
        "text": "[removed]",
        "created_utc": 1678855206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lamios - A short story",
        "author": "-Abinadied-",
        "url": "https://www.reddit.com/r/books/comments/11rm187/lamios_a_short_story/",
        "text": "[removed]",
        "created_utc": 1678854535,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for this book/ what book us this?",
        "author": "TopArtichoke403",
        "url": "https://www.reddit.com/r/books/comments/11rlxv5/looking_for_this_book_what_book_us_this/",
        "text": "[removed]",
        "created_utc": 1678854239,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help",
        "author": "Its_jopey",
        "url": "https://www.reddit.com/r/books/comments/11rlvpf/i_need_help/",
        "text": "[removed]",
        "created_utc": 1678854058,
        "upvote_ratio": 1.0
    },
    {
        "title": "SPOILERS: Notes on an Execution and the character Shawna",
        "author": "dggtlg4",
        "url": "https://www.reddit.com/r/books/comments/11rlk94/spoilers_notes_on_an_execution_and_the_character/",
        "text": "[removed]",
        "created_utc": 1678853109,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book Suggestions Pretty Please",
        "author": "ToriBrooks8715",
        "url": "https://www.reddit.com/r/books/comments/11rlabv/book_suggestions_pretty_please/",
        "text": "[removed]",
        "created_utc": 1678852330,
        "upvote_ratio": 1.0
    },
    {
        "title": "Today was a good day for book reading.",
        "author": "acrowsmurder",
        "url": "https://www.reddit.com/r/books/comments/11rkmjv/today_was_a_good_day_for_book_reading/",
        "text": "I haven't been reading books much in the past...decade or so. Neurological/mental/emotional issues that I'm *finally* starting to get under control.\n\n\nI use Google Rewards to buy books on Play, and Michael Crichton's *Micro* was on sale for $0.99, and I always liked *The Lost World*.\n\nWell, reddit was down and I was actually able to 'focus' and I read ten chapters!\n\nGreat book so far!",
        "created_utc": 1678850480,
        "upvote_ratio": 1.0
    },
    {
        "title": "The City Of Dreaming Books",
        "author": "GamerAchiever",
        "url": "https://www.reddit.com/r/books/comments/11rkl5r/the_city_of_dreaming_books/",
        "text": "I finished reading The City Of Dreaming Books, and damn was it amazing. The writing style along with the unique storyline is immersive as hell. I found it wierd for the first few chapters, but I gradually started to embrace that weirdness, and it was at that point that it just transformed into a pure work of art. I'm sure this is going to be one of the books I won't forget for a very long time",
        "created_utc": 1678850384,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spoiler free thoughts on The Plot by Jean Hanff Korelitz",
        "author": "moonchild-rm",
        "url": "https://www.reddit.com/r/books/comments/11rkhzy/spoiler_free_thoughts_on_the_plot_by_jean_hanff/",
        "text": "First time posting in here. I’m about halfway through The Plot by Jean Hanff Korelitz and it’s definitely slower paced than I thought but just want to know how many liked it or didn’t like it. Of course spoiler free, but I am still going to finish the book no matter what just want other peoples thoughts!",
        "created_utc": 1678850140,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wayward Pines",
        "author": "Tmettler5",
        "url": "https://www.reddit.com/r/books/comments/11rkejl/wayward_pines/",
        "text": "[removed]",
        "created_utc": 1678849876,
        "upvote_ratio": 1.0
    },
    {
        "title": "jandy nelson!!!",
        "author": "staticspacelover4",
        "url": "https://www.reddit.com/r/books/comments/11rk4c6/jandy_nelson/",
        "text": "ok so i've been a jandy nelson fan for years seriously. i'll give you the sun is one of my all time favorite books ive ever read in my life and that's saying a lot since i'm a bookworm from birth (like read beowulf in it's original old english at 12 years old type bookworm). i love that A24 made the sky is everywhere into an AMAZING movie!! but is i'll give you the sun the next on their list? i've been needing this book to be made into an amazing movie since i've read it. i saw that at one point warner bros bought the rights but does anyone know if that's still the case? i'll actually die if they still have the rights and absolutely butcher it.",
        "created_utc": 1678849135,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kiss Her Once for Me by Alison Cochrun— what does this line mean?",
        "author": "GinaKaySims",
        "url": "https://www.reddit.com/r/books/comments/11rk40q/kiss_her_once_for_me_by_alison_cochrun_what_does/",
        "text": "[removed]",
        "created_utc": 1678849110,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you find old or alternative covers of books in new editions?",
        "author": "Flippin_Forko",
        "url": "https://www.reddit.com/r/books/comments/11rjrfv/how_do_you_find_old_or_alternative_covers_of/",
        "text": "[removed]",
        "created_utc": 1678848212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone read The Age of Discovery trilogy by Michael A. Stackpole?",
        "author": "MaryJaneAndMaple",
        "url": "https://www.reddit.com/r/books/comments/11rjmqf/has_anyone_read_the_age_of_discovery_trilogy_by/",
        "text": "The first book in the series is called A Secret Atlas, then comes Cartomancy, and The New World rounds out the trilogy.\n\nI am about halfway through The New World and I'm just wondering if anyone out there has read any of these books and, if so, I'm wondering what your thoughts are/were? I'm open to ALL opinions and reviews. \n\nIf you've completed the trilogy, please do not spoil it.\n\nStackpole has written a lot of books. This trilogy was finished in 2008/9. I have opinions about the series and would like to see where they fall on the spectrum.",
        "created_utc": 1678847883,
        "upvote_ratio": 1.0
    },
    {
        "title": "help finding a book",
        "author": "pretzal_sticks_",
        "url": "https://www.reddit.com/r/books/comments/11rjlql/help_finding_a_book/",
        "text": "i saw this tik tok a while ago that had the first line was something along the lines of “i didn’t kill her” or “i didn’t do it”. can y’all help me find the book title? when i sent it to my friend she said that the title was “dead” or something like that. \n\nlike i said, it’s been a hot minute and we would gladly appreciate your help :)",
        "created_utc": 1678847813,
        "upvote_ratio": 1.0
    },
    {
        "title": "Let's go",
        "author": "Maximum_Arm6499",
        "url": "https://www.reddit.com/r/books/comments/11rjegi/lets_go/",
        "text": "[removed]",
        "created_utc": 1678847330,
        "upvote_ratio": 1.0
    },
    {
        "title": "ஸ்ரீ காஞ்சி மஹா பெரியவரை பார்க்க மலை இறங்கிய மாருதி ( ஆஞ்சேநேயர் ).",
        "author": "Snathan-22",
        "url": "https://www.reddit.com/r/books/comments/11rjdb1/ஸர_கஞச_மஹ_பரயவர_பரகக_மல_இறஙகய_மரத_ஆஞசநயர/",
        "text": "[removed]",
        "created_utc": 1678847249,
        "upvote_ratio": 1.0
    },
    {
        "title": "During the final season of Season 3, the community will be presented with over 300 million bluur tokens",
        "author": "CryptographerRich469",
        "url": "https://www.reddit.com/r/books/comments/11rj8g7/during_the_final_season_of_season_3_the_community/",
        "text": "[removed]",
        "created_utc": 1678846918,
        "upvote_ratio": 1.0
    },
    {
        "title": "Searching for a book on diplomacy",
        "author": "WandererNotLost21",
        "url": "https://www.reddit.com/r/books/comments/11rj44w/searching_for_a_book_on_diplomacy/",
        "text": "[removed]",
        "created_utc": 1678846635,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Secret History by Donna Tartt",
        "author": "Localaw",
        "url": "https://www.reddit.com/r/books/comments/11riloq/the_secret_history_by_donna_tartt/",
        "text": "It's like Donna Tartt is that ex you can't get over. She showed me this beautiful story and then just left me in a mess out on the streets. Can't seem to fill the void. I've read her other novel The Goldfinch after that. But I feel like nothing comes close to the writing, characters, and scenery like it does in The Secret History. When Richard was cold, I was cold. When Richard was confused, I was confused. I even miss Bunny's questionable chaotic actions. The story lives rent free in my head. I keep searching for something similar everytime I pick up a new book, it's kinda sad honestly. \nDid you guys feel this too?",
        "created_utc": 1678845472,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on Half Price Books (the store)?",
        "author": "Theta7274",
        "url": "https://www.reddit.com/r/books/comments/11rii4y/thoughts_on_half_price_books_the_store/",
        "text": "[removed]",
        "created_utc": 1678845246,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finding time to read",
        "author": "kdf1990",
        "url": "https://www.reddit.com/r/books/comments/11ri32x/finding_time_to_read/",
        "text": "[removed]",
        "created_utc": 1678844280,
        "upvote_ratio": 1.0
    },
    {
        "title": "Casual Vacancy",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1678844060,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do y'all read while eating?",
        "author": "Never-Ducks",
        "url": "https://www.reddit.com/r/books/comments/11rhxto/do_yall_read_while_eating/",
        "text": "[removed]",
        "created_utc": 1678843943,
        "upvote_ratio": 1.0
    },
    {
        "title": "Small Joys, a review by Shelley",
        "author": "Grand-Grapefruit9370",
        "url": "https://thebookreviewcrew.com/small-joys-a-review-by-shelley/",
        "text": "",
        "created_utc": 1678843659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book writing help?",
        "author": "OddCoat6822",
        "url": "https://www.reddit.com/r/books/comments/11rh64q/book_writing_help/",
        "text": "[removed]",
        "created_utc": 1678842286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anxiety starting a book series with average ratings?",
        "author": "justkeepbreathing94",
        "url": "https://www.reddit.com/r/books/comments/11rgfl6/anxiety_starting_a_book_series_with_average/",
        "text": "I want to read a book series that's pretty long. 3 600+ page books. But I have this weird feeling of anxiety because the ratings are around 3.5/5 and i don't know if I'll end up spending 60~ hours reading a series that's just \"okay\". What are your thoughts or experience with this? Do you think this is just me being weird about this?",
        "created_utc": 1678840821,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anxiety starting a book series with average ratings?",
        "author": "justkeepbreathing94",
        "url": "https://www.reddit.com/r/books/comments/11rgbea/anxiety_starting_a_book_series_with_average/",
        "text": "[removed]",
        "created_utc": 1678840590,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help me remember the name of this book",
        "author": "KinkyLittleParadox",
        "url": "https://www.reddit.com/r/books/comments/11rg2zm/please_help_me_remember_the_name_of_this_book/",
        "text": "\n\nIt's set after some sort of apocalypse - we're very early on because there's an astronaut stuck on the space station\n\n I believe our main character is a traveling glasses salesman\n\n There's some sort of quasi religious thing and also people gather around the radio regularly for news \n\n I swear there was also this malformed parasitic twin who was psychic or something and was trying to take over the world \n\n\n I think it was probably 60s or 70s and maybe by Phillip K Dick? It feels like his brand of crazy but he has so many books I can't find it!",
        "created_utc": 1678840157,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm just curious, what is this sub's opinions on LitRPG books?",
        "author": "Coffee-O-Holic",
        "url": "https://www.reddit.com/r/books/comments/11rg1bd/im_just_curious_what_is_this_subs_opinions_on/",
        "text": "I've been skimping on reading books for the last two years due to college, but recently started reading again after my family started a Kindle Unlimited plan. Granted I did not like the plan (it had a limited selection of books that I was interested in) but I did find a books series called \"The Primal Hunter\" by Zogarth. It was a LitRPG series, seemed interesting by the description, so I decided to read the first book, with another book regarding my college major on standby just in case this one got boring.   \nLong story short, I finished the 4 books in the series that were out at that time within a month, never touched the backup book,  and recently bought and finished reading the latest book (which I bought separate from the kindle plan).   \nI love the series, and find LitRPG's fascinating as a concept, but it seems that people have mixed opinions on them. I think they provide a unique opportunity for world-building from the perspective of average people. Also, this quasi self-insertion gives authors new way to explore themes in modern society applied to a completely different situation, yet without a lot of exposition to set up how the narrative's theme is the same as one in our world.  \n\n\nI admit this opinion is from a guy that read one LitRPG series, but I would love to hear the thoughts from a community focused on books, since I haven't explored too much of the genre yet.",
        "created_utc": 1678840064,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone read Donald Culross Peattie?",
        "author": "Take-to-the-highways",
        "url": "https://www.reddit.com/r/books/comments/11rg026/has_anyone_read_donald_culross_peattie/",
        "text": "I just picked up \"The Road of a Naturalist\" after reading an excerpt from another one of his books in \"Overstory\" by Richard Powers (another excellent book). I'm only about 20 pages in but I think he's going to be one of my favorite authors already. His words are poetic almost and when he describes the scenery you feel like you're right there with him. I'm hooked!\n\nHowever, I can't find hardly any reviews or anyone talking about his work. I'd love to hear other peoples' thoughts, favorite passages, etc! And if you like",
        "created_utc": 1678839999,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help finding a book that I haven’t read in a while, anything would be great",
        "author": "Th3Obsidian",
        "url": "https://www.reddit.com/r/books/comments/11rft4g/i_need_help_finding_a_book_that_i_havent_read_in/",
        "text": "The cover of most of what I remember is all white with a large silhouette and the title, with the silhouette being in one solid color and the title being in black. I remember one specific was a yellow silhouette on the left side of the cover. I also remember a bit about one of the books. The daughter (who is the main person of this book) of the main hero (of the old book) runs away, out of a safe town and had to cross a dangerous reef to get out. She is able to get to the outside world and is in a dead world with lots of evil blights from the old evil guy. I don’t remember much else but I really want to read it again. Any help would be much appreciated!\n\nThanks in advance!",
        "created_utc": 1678839634,
        "upvote_ratio": 1.0
    },
    {
        "title": "William Peter Blatty's \"Legion\".",
        "author": "i-the-muso-1968",
        "url": "https://www.reddit.com/r/books/comments/11rfhxh/william_peter_blattys_legion/",
        "text": "So today I've finished another of Blatty's novels, \"Legion\". This novel, as I have now recently discovered, was part of Blatty's faith trilogy with the first being \"The Exorcist\", the second was \"The Ninth Configuration\". \"Legion\" is the third of that trilogy.\n\nIn the plot of this novel we are introduced to Lieutenant Kinderman, who appeared in \"The Exorcist\", as he investigates the murders of one boy and two catholic priests. The trail that he follows is bewildering and twisting as he tries to find a connection between these killings and those that were perpetrated twelve years ago. But that case ended with the death of the killer himself.\n\nSo now Kinderman has a few suspects. An old woman who had witnessed the crime. A neurologist who can no longer bear the pain of his own life. A psychiatrist with a very morbid sense of humor with a dark secret. Or a mysterious mental patient who is locked away in isolation?\n\nThis book blends one part crime drama and one part supernatural in a superb way. Hopefully one day I will track down \"The Ninth Configuration\" very soon.",
        "created_utc": 1678838980,
        "upvote_ratio": 1.0
    },
    {
        "title": "No break up sapphic books recs?",
        "author": "BarberRepulsive4271",
        "url": "https://www.reddit.com/r/books/comments/11rfgyu/no_break_up_sapphic_books_recs/",
        "text": "[removed]",
        "created_utc": 1678838917,
        "upvote_ratio": 1.0
    },
    {
        "title": "No break up sapphic book?",
        "author": "BarberRepulsive4271",
        "url": "https://www.reddit.com/r/books/comments/11rffo8/no_break_up_sapphic_book/",
        "text": "[removed]",
        "created_utc": 1678838824,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just finished Capote's In Cold Blood and all I can say right now is... wow. What a book!",
        "author": "BrexitBlaze",
        "url": "https://www.reddit.com/r/books/comments/11rf573/just_finished_capotes_in_cold_blood_and_all_i_can/",
        "text": "I did NOT know this book was going to be so gut wrenchingly, heartbreakingly, depressingly difficult to complete. I don't mean difficult insofar as reading it but rather the humaneness Capote has given to Dick and Perry. \n\nWhilst they do show Alpha &gt; Beta / Submissive &gt; Dominant personalities (from my reading) it was difficult to read the book knowing the predicament they were going to end up in. \n\nI think I found it even more difficult to read that someone like Perry who sang\n\n&gt; In this world today while were living\n&gt;\n&gt; Some folks say the worst of us they can\n&gt;\n&gt; But when we're dead and in our caskets, They always slip some lilies in our hand.\n&gt;\n&gt; Won't you give me flowers while I'm living...\n\ncould ever be involved in a diabolical criminal act. The way he nonchalantly confessed \"'I didn't want to harm the man. I thought he was a very nice gentleman. Soft spoken. I thought so right up to the moment I cut his throat.'\" \n\nI don't know the ins and outs of the full trial (Way before my time) but with me reading this book, I felt like it was happening now. In 2023. \n\nI feel so sorry for the Clutter family. I was left with the feeling that their descendants never got over the loss of four of their closest relatives. As a result, I have not looked up the crime in detail. Yet. \n\nThis book I think, may have left me an emotional wreck. The brutality of the crime, the loss of innocent people, and the capability of humankind to commit such atrocious acts just because of Money. *Money*. It usually takes a day or two for me to realise the (full) impact a book has had on me. So ask tomorrow if you want to know though currently I do like it. But the last book that f***d me up this much was Ishiguro's *Never Let Me Go.* As a result, I have no idea what I will be reading next. Or should be reading next.",
        "created_utc": 1678820563,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fable or parable suggestion? Akin to the parable of the good samaritan?",
        "author": "Infamous-Wall2505",
        "url": "https://www.reddit.com/r/books/comments/11rf3ti/fable_or_parable_suggestion_akin_to_the_parable/",
        "text": "I am trying to find a short story similar to the parable of the good samaritan which can be used as an example of helping someone who is in need, even when one doesn't have too. Or, in the alternative, an example of standing up for others in the face of injustice. I have been searching Aesops fables endlessly. I need something that I can summarize in a more modern and easily understood fashion. \n\n&amp;#x200B;\n\nThank you in advance!",
        "created_utc": 1678820488,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a bingeclock for books?",
        "author": "moahmrn",
        "url": "https://www.reddit.com/r/books/comments/11rf1ht/is_there_a_bingeclock_for_books/",
        "text": "Like the bingeclock site with the length of TV series, but for books and book series, with word or page count.\n\nI took an interest after deciding to start the Discworld series, and was wondering how long it would be to read it all.\n\nI've seen a few on Google, but they have either very few books, are disorganized or just ads for speed reading courses. Other than that, there is [this](https://www.reddit.com/r/Fantasy/comments/8nv3j2/word_count_of_popular_fantasy_and_science_fiction/) thread on r/fantasy.\n\nIf one would start a new app for this, where to begin? Scraping the ISBN database for page counts (which is less precise than word count)? Is there a better open database?\n\nThanks!",
        "created_utc": 1678820364,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to disinfect old books?",
        "author": "mik288",
        "url": "https://www.reddit.com/r/books/comments/11rezzl/how_to_disinfect_old_books/",
        "text": "Hi everyone! so i’m just recently getting back into reading, and I just made a trip to my parent’s house to pick up my whole collection from when I was younger along with some of my mom’s books that sparked my interest (she’s an avid horror fan, so am I). however, all the books were kept in a damp-ish basement along with a good majority of these books being from 1990-2010, so they definitely have seen better days.\n\nI did have to leave behind some that had extensive mold, but the ones I salvaged seem alright albeit a little dusty. my question is, how would I go about disinfecting these books so I don’t have to be concerned about bringing any nasty bugs or microbes into my collection at my house?\n\nThank you in advance!",
        "created_utc": 1678820273,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mental issues related books",
        "author": "vkzofoI",
        "url": "https://www.reddit.com/r/books/comments/11reynn/mental_issues_related_books/",
        "text": "Hello,\n\nA few days ago, while being high I thought and meditated. I realized that I needed to face my problems instead of fleeing them. \n\nFor several reasons, I have been thinking that I have mental issues or perhaps depression. I want to stop denying my issues and being like \"my mental health is pathetic but let's forget about it and watch another youtube video\".\n\n\nNow I want to face that and the first step is to identify what is wrong, understanding how these things work and then how to work on it. \n\nDo you know some books/authors that might help me ?\nMy English isn't perfect so a French author/translation would be ideal\n\nThank y'all for reading :)",
        "created_utc": 1678820191,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to read more classic books about birds",
        "author": "Myrandall",
        "url": "https://www.reddit.com/r/books/comments/11repyc/i_want_to_read_more_classic_books_about_birds/",
        "text": "[removed]",
        "created_utc": 1678819677,
        "upvote_ratio": 1.0
    },
    {
        "title": "I always seem too tired to read",
        "author": "Klarkasaurus",
        "url": "https://www.reddit.com/r/books/comments/11refar/i_always_seem_too_tired_to_read/",
        "text": "My job is hard involving manual labour all day. I love reading but lately I feel too tired to read. I'm not exhausted I'm just not awake enough to read. Like now it's 6.30pm and ill go bed about 9.30pm so I've got time to read but if I started to read now I would fall asleep in 10 minutes of reading. \n\nI could play a video game right now until 9.30 easily but I don't want to I'd rather read.\n\nI don't have time to read in the morning because I work out and then go straight work. I work 6 days so I only really get 1 free day and it's usually a busy day anyway. \n\nAny suggestions?",
        "created_utc": 1678819038,
        "upvote_ratio": 1.0
    },
    {
        "title": "Life In The Past Lane: Learning How To Focus Forward by Rod Woitas | BookBaby Bookshop",
        "author": "rwoitas",
        "url": "https://store.bookbaby.com/book/life-in-the-past-lane",
        "text": "",
        "created_utc": 1678818722,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lovecraft Country",
        "author": "simonthemooncat",
        "url": "https://www.reddit.com/r/books/comments/11re5ja/lovecraft_country/",
        "text": "I just finished reading Lovecraft Country and I'd like to ask opinions on the themes in the book. I understand that the main theme was to draw connections to Lovecraftian mythos to Jim Crow laws in the US during the mid 1900s. When I read it though, the connection seemed not there? Like the racial themes of the book felt a little pointless because the same story could be written without the racism. Can anyone who understood and saw the connection help me out?\n\nAlso, loved the book, felt it contained a lot of accurate Jim Crow era abuses and prejudices that I feel are important for people to understand. Would definitely recommend reading to anyone.\n\nNote: I'm tagging this as spoilers for any possible comments that contain spoilers.",
        "created_utc": 1678818455,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feng Shui for Beginners: Harmonize Your Home and Life",
        "author": "Logical-Quote2048",
        "url": "https://www.amazon.com/dp/B0BY9HNVM5",
        "text": "",
        "created_utc": 1678817932,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm searching for this romance book",
        "author": "Common_Brain_2157",
        "url": "https://www.reddit.com/r/books/comments/11rdlbn/im_searching_for_this_romance_book/",
        "text": "Soo the mother of the main character (woman) apparently died and the police says it was suicide. The mc doesn't believe that, she thinks her mother was killed. Some ppl try to attempt to murder her multiple times, which is why she's on the run with her car. In some random kiosk or something she buys a newspaper to find a job. In a library she writes her application on the computer and she gets the job. The job is to teach this Russian guy's son the English language. There's also a cooking madame in the estate. And i believe the main guy also has a sister which is there from time to time. And obv there's this sexual tension between the mc and the Russian guy. I also believe he's kinda part of the Russian Mafia or at least has something to do with them. She lives there and at some point the guy steals her car keys so she can't leave him.",
        "created_utc": 1678817223,
        "upvote_ratio": 1.0
    },
    {
        "title": "For every who read \"Animal Farm\". What Message dis it convey?",
        "author": "Firm_Suggestion_9942",
        "url": "https://www.reddit.com/r/books/comments/11rdddd/for_every_who_read_animal_farm_what_message_dis/",
        "text": "[removed]",
        "created_utc": 1678816764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books for spiritual transformation &amp; relinquishing control",
        "author": "STOICSONIA",
        "url": "https://www.reddit.com/r/books/comments/11rd9tm/books_for_spiritual_transformation_relinquishing/",
        "text": "I'm looking for books in line with Michael Singer's Untethered Soul and Eckhart Tolle's Power of Now. I know of Singer's and Tolle's other books as well that are on my list currently. I'm seeking spiritual transformation without ties to organized religion. Alan Watts comes to mind as well and I've been listening to his talks. Not necessarily philosophy as some of those texts go down the wrong path for me at the moment (except Stoicism- Marcus Aurelius does resonate with me). What other texts should I consider reading in this time of my life?",
        "created_utc": 1678816543,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unboxing stripova iz Darkwood-a - STRIPOVI",
        "author": "besplatnioglas",
        "url": "https://knjigeudzbenicicasopisistripovi.infooglasi.rs/unboxing-stripova-iz-darkwood-a-stripovi/?feed_id=4652&amp;_unique_id=6410b49b47607",
        "text": "",
        "created_utc": 1678816412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else use bad/1 star reviews to decide a book should be read?",
        "author": "autumncandles",
        "url": "https://www.reddit.com/r/books/comments/11rd58a/does_anyone_else_use_bad1_star_reviews_to_decide/",
        "text": "[removed]",
        "created_utc": 1678816257,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for good recommendations. I tend to like fact based stories of people with hard lives and things they have gone through or self help books.",
        "author": "Bitch-Im-Her",
        "url": "https://www.reddit.com/r/books/comments/11rcu2g/looking_for_good_recommendations_i_tend_to_like/",
        "text": "[removed]",
        "created_utc": 1678815599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just started reading again",
        "author": "iWin_FTW",
        "url": "https://www.reddit.com/r/books/comments/11rct1b/just_started_reading_again/",
        "text": "[removed]",
        "created_utc": 1678815535,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a book but don't know the title just the context",
        "author": "SecludedSausage",
        "url": "https://www.reddit.com/r/books/comments/11rbv7d/looking_for_a_book_but_dont_know_the_title_just/",
        "text": "Has anyone heard of or remembers reading a book about some evil lady maybe from another dimension or something that steals red headed little girls and raises them up till they hit puberty then either disposes them to get rid of them cause they aren't cute anymore or forces her \"pet\" to get pregnant to keep the red headed baby and then kill the mother? I'm pretty sure there was demons involved as well, the red headed girl escapes while pregnant and raises her baby in secret so it won't be kidnapped, I also remember a friendly demon getting cursed out by a nun if that helps lol",
        "created_utc": 1678813502,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blonde King (ML) book?",
        "author": "ConfidentAd2188",
        "url": "https://www.reddit.com/r/books/comments/11rbslg/blonde_king_ml_book/",
        "text": "I need help finding a character, blonde King (Main Lead?) from a book, probably Royal Fantasy(?) \nHe was very attractive!\n\nBlonde hair (like golden) (normal boys hair length) Wearing a golden crown\nGreen/blue eyes?\nCaucasian\n\nThe name I searched were 2 words..(King ... ...). I can't remember the exact name. \n\nI saw it on a video in instagram/tik tok mentioning him and when I searched him in google there were some fanart of him. The one I clicked was very well drawn! The shadings and everything were realistic! It was maybe a year back..\n\n(I thought the name was Aaron (but had no luck:( )\n\nPlease help, I've tried a few times with no such luck..Its been bugging my mind...",
        "created_utc": 1678813343,
        "upvote_ratio": 1.0
    },
    {
        "title": "you are not so smart",
        "author": "Short-Noisey-5683",
        "url": "https://www.reddit.com/r/books/comments/11rbq2g/you_are_not_so_smart/",
        "text": "[removed]",
        "created_utc": 1678813208,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about Shuggie Bain",
        "author": "apachebearpizzachief",
        "url": "https://www.reddit.com/r/books/comments/11rbjsw/question_about_shuggie_bain/",
        "text": "https://imgur.com/a/ph1XLuD\n\nIn the link above, I highlighted a term that I am uncertain of and there is no further description in the book for me to base what the meaning of this may be. It may be a cultural difference that I may not be understanding. Can anyone help me out with what Leek did in this passage?",
        "created_utc": 1678812824,
        "upvote_ratio": 1.0
    },
    {
        "title": "wow",
        "author": "Bluedino_1989",
        "url": "https://www.reddit.com/r/books/comments/11rbcs5/wow/",
        "text": "[removed]",
        "created_utc": 1678812400,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wrote my first book. It's a story about my addiction. Even though it's only 100 pages, I'm proud of myself.",
        "author": "FlashyWheel2419",
        "url": "https://www.reddit.com/r/books/comments/11rb1og/i_wrote_my_first_book_its_a_story_about_my/",
        "text": "I've been thinking about it for about three months.\n\n&amp;#x200B;\n\nWhen I finally forced myself to write the book, it took me 14 days.\n\n&amp;#x200B;\n\nIt's called How Porn Addiction Destroyed My Life.\n\n&amp;#x200B;\n\nI know it's a bit of a controversial subject and it's not for everyone.\n\n&amp;#x200B;\n\nIt's probably too short and I'm thinking of going into more detail. Maybe change the cover page. I don't know.\n\n&amp;#x200B;\n\nBut I still had fun writing it and I had fun creating it.\n\n&amp;#x200B;\n\nI'll be glad for any ideas or suggestions.",
        "created_utc": 1678811715,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey friends!! If you’re into the new age con and a complex gay+pan relationship:",
        "author": "Indica-daddy",
        "url": "https://www.reddit.com/r/books/comments/11razl8/hey_friends_if_youre_into_the_new_age_con_and_a/",
        "text": "Rafael Frumkin’s (trans author) newest book Confidence is for you! It’s a quick read because it’s so hard to put down. The con is in three acts, doesn’t focus on queerness for plot but allows queer characters to just be. Orson and Ezra are complex characters you root for, roll your eyes at and wanna shake at times, especially as the cons get bigger. Think Theranos meets NXIVM cult meets Talented Mr. Ripley. \n\nThe Washington post’s review is spot on. I really enjoyed this one and the cover is really kewl to boot. The audiobook is narrated by a non-binary human as well, for those who like to listen!\n\nHis first book The Comedown has a pilot with Stars in development!",
        "created_utc": 1678811586,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Wheel of Time story arc question",
        "author": "Muahd_Dib",
        "url": "https://www.reddit.com/r/books/comments/11rala7/the_wheel_of_time_story_arc_question/",
        "text": "I'm on book 6 on the wheel of time.  I think it's 14 books total.\n\n&amp;#x200B;\n\nMy uncle has read all them.  He said that there a major lull in the books.  He said books 7-10 (can't remember exactly what the range is) get pretty boring.  I was wondering if anyone has read the whole series who remembers which books were the hardest to get through.  \n\n&amp;#x200B;\n\nI've honestly loved the books so far.  Found myself captivated even in the boring parts I've broached so far.",
        "created_utc": 1678810726,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"You Are a Badass at Making Money\"",
        "author": "GeofreyGekood",
        "url": "https://www.patreon.com/posts/you-are-badass-80014474?utm_medium=clipboard_copy&amp;utm_source=copyLink&amp;utm_campaign=postshare_creator&amp;utm_content=join_link",
        "text": "",
        "created_utc": 1678808844,
        "upvote_ratio": 1.0
    },
    {
        "title": "Personality Development: Tips and Books",
        "author": "Crincly",
        "url": "https://www.reddit.com/r/books/comments/11r99zs/personality_development_tips_and_books/",
        "text": "[removed]",
        "created_utc": 1678807882,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to find video game Based on Seas of Venus - David Drake",
        "author": "Nogardenfairies",
        "url": "https://www.reddit.com/r/books/comments/11r8pt9/trying_to_find_video_game_based_on_seas_of_venus/",
        "text": "[removed]",
        "created_utc": 1678806627,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's a Cordon Bleu story?",
        "author": "gabiba",
        "url": "https://www.reddit.com/r/books/comments/11r8pev/whats_a_cordon_bleu_story/",
        "text": "[removed]",
        "created_utc": 1678806607,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something breaks inside of me every single time…",
        "author": "JailHouseRockGirl",
        "url": "https://www.reddit.com/r/books/comments/11r8ns7/something_breaks_inside_of_me_every_single_time/",
        "text": "[removed]",
        "created_utc": 1678806506,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for perusing libraries without genrefication?",
        "author": "amaxs",
        "url": "https://www.reddit.com/r/books/comments/11r883s/tips_for_perusing_libraries_without_genrefication/",
        "text": "In my last library, everything was sorted by genre. I just moved to a new city and came to find out that it's actually more common to sort fiction by author surname. This really took away my joy from going to the library, and I didn't find one book that looked interesting. \n\nCertainly, there are more important things to worry about rather than library sorting method, but it got me curious: how do you all peruse libraries when there are no genre sections demarcated? Any tips to make the experience more enjoyable? Or, do you just look at the online catalog for inspiration?",
        "created_utc": 1678805531,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help",
        "author": "Jeffriko",
        "url": "https://www.reddit.com/r/books/comments/11r7wzu/help/",
        "text": "[removed]",
        "created_utc": 1678804827,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the average rate of secondhand books in Blossoms Bookhouse (Bangalore)",
        "author": "Rasmus786",
        "url": "https://www.reddit.com/r/books/comments/11r7hxh/what_is_the_average_rate_of_secondhand_books_in/",
        "text": "[removed]",
        "created_utc": 1678803880,
        "upvote_ratio": 1.0
    },
    {
        "title": "THIS IS CHECKMATE.",
        "author": "Maddy_brown1",
        "url": "https://www.reddit.com/r/books/comments/11r70n2/this_is_checkmate/",
        "text": "[removed]",
        "created_utc": 1678802735,
        "upvote_ratio": 1.0
    },
    {
        "title": "any other authors like clarice lispector?",
        "author": "croods2getcrooding",
        "url": "https://www.reddit.com/r/books/comments/11r6tir/any_other_authors_like_clarice_lispector/",
        "text": "Howdy y'all, I finished reading a while ago back to back ice by Ana kavan and clarice lispector, it was an amazing double read back to back and I highly recommend.\nWas wondering if anyone could suggest similar authors to those two, plus if you've read either I'd love to hear your thoughts on them. \nThank you very much!!",
        "created_utc": 1678802288,
        "upvote_ratio": 1.0
    },
    {
        "title": "While we are talking about Books, perhaps we should also talk about an organization called Moms for Liberty …",
        "author": "vulcan_on_earth",
        "url": "https://www.reddit.com/r/books/comments/11r6lab/while_we_are_talking_about_books_perhaps_we/",
        "text": "MFL is the group behind the drive to ban certain books from the library. \n\nIn fact, in Florida, most of the books selected for the the ban came from a single individual - the chair of the local MFL chapter! They recently added a book about holocaust to the ‘banned-list’. \n\nAn amusing history …\n\nhttps://litreactor.com/columns/yes-i-read-the-111-page-moms-for-liberty-book-ban-document",
        "created_utc": 1678801726,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where is DDR? (Book printed in DDR)",
        "author": "wallflower1911",
        "url": "https://www.reddit.com/r/books/comments/11r5o1f/where_is_ddr_book_printed_in_ddr/",
        "text": "Greetings everyone,\n\nMy uncle got me a used edition of *What Katy Did*, a 1989 published copy by Susan Coolidge from one of the roadside booksellers back in 2014/2015 from New Delhi, India.\n\nThe book's first page has a short message of *'Present from Mich + Vincent, 23.6.89'* and I am a massive nerd about a book's sentimental value.\n\nThe book shows it was printed in DDR and I can't figure out where that is. Is it a country, a city, or what? I figured from the names that they sounded English or European and also the date was written in a non-American fashion. \n\nThis was one of my first novels when I was 9 or 10 at that time and I'd really love to know where this book was born, how it traveled all the way to New Delhi, imagine its original owners, etc.\n\nThankyou in advance.",
        "created_utc": 1678799349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book Review: Circe by Madeline Miller",
        "author": "no_u_r_wrong",
        "url": "https://www.reddit.com/r/books/comments/11r5f1k/book_review_circe_by_madeline_miller/",
        "text": "Circe\" is a novel by Madeline Miller that was published in 2018. The book is a retelling of the story of Circe, a minor character in Homer's \"Odyssey.\" In Miller's version, Circe is the protagonist, and the novel follows her journey from being a powerless nymph to a powerful sorceress who challenges the gods.\n\nThe plot of \"Circe\" revolves around Circe's struggles to find her place in the world. At the beginning of the novel, she is dismissed and belittled by her family and the other gods. She is exiled to an island, where she develops her powers and learns to survive. As she becomes more powerful, she challenges the gods and forms relationships with mortals, including the famous Greek hero, Odysseus. Eventually, she must face the consequences of her actions and confront the wrath of the gods.\n\nOne of the main themes of \"Circe\" is the power of choice. Circe must navigate a world where the gods control the fate of mortals and immortals alike. However, she learns that she has the power to choose her own destiny and to shape the world around her. She chooses to help mortals and to challenge the gods, even though it puts her in danger.\n\nThe retelling of classic Greek mythology has always been an interest of mine and I thoroughly enjoyed reading this book.",
        "created_utc": 1678798693,
        "upvote_ratio": 1.0
    }
]