[{"title":"[WEEKLY THREAD] MORONIC MONDAYS","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11q4jwz\/weekly_thread_moronic_mondays\/","text":"Don't be embarrassed. We all have questions sometimes.\n\nAnd yes, you need to do your rest day between runs.","upvote_ratio":0.67,"created_utc":1678698002.0},{"title":"Week 4 Day 1 \/\/ Propelled by dog, but hindered by his peeing sessions.","author":"tea_bird","url":"https:\/\/i.imgur.com\/srP860l.jpg","text":"","upvote_ratio":0.96,"created_utc":1678669867.0},{"title":"C25K W3D1 done!","author":"onebeers","url":"https:\/\/i.redd.it\/k61bpfvegjna1.jpg","text":"Was motivated to post since I’ve mostly seen fast runners here. To my fellow slow runners, we can do this!","upvote_ratio":0.81,"created_utc":1678709231.0},{"title":"Graduated yesterday!!!!","author":"Qasid96","url":"https:\/\/i.redd.it\/5y5g13niecna1.png","text":"I am over the moon. I feel so good and in the process have lost six kilograms of weight and my old clothes fot again. \n\nStill a long way to go but I am happy. Thank you all for the motivation.","upvote_ratio":0.99,"created_utc":1678623844.0},{"title":"Finished week 7 with my best run so far","author":"ste001","url":"https:\/\/i.imgur.com\/vaAB14J.jpg","text":"I decided to see how much I could push while still being comfortable for W7D3. I expected to pass the 4km milestone, but I didn't expect to crush it! I only got a little bit tired around 2\/3 into the run, I slowed down just a bit and did a final push in the last minutes. Overall it was a bit more fatiguing, but so satisfying to see what my true pace was!\n\n\nI'll be back on a slower pace for the start of week 8, but it's been a great boost in morale to have a run like that. Graduation to 5k have never felt so close :D","upvote_ratio":0.96,"created_utc":1678636504.0},{"title":"5k program for someone who can jog it slowly?","author":"Available_Force6578","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11pq5iz\/5k_program_for_someone_who_can_jog_it_slowly\/","text":"Hi everyone. 36,  male, active but out of shape, 20lbs overweight. I started rucking a few weeks back and decided to start running. I ran a mile the other day and it about killed me, since I haven’t ran since high school, and got bad shin splints. I read some advice to jog slowly starting out, so after waiting a few days for healing, I ran a 5k course, pace of 12 for the first mile and 14 something for the last two, and could have kept going if my knee wasn’t hurting so bad. I don’t think I had ever “ran” that far in my life, it was interesting that jogging slowly made it happen. \nSince I can already jog a 5k, I was wondering if there is a plan to take your 5k time from old man slow to at least an average time for my age (30 minutes ish), and then down to a respectable time? It seems that all the plans start out way slower, I can walk on an incline with 30lbs on my back for an hour easily, just can’t run fast without lots of pain. Thoughts? Want to slowly (so my body can adjust) work my 5k times slower.","upvote_ratio":0.77,"created_utc":1678655889.0},{"title":"Completed W5D3!","author":"j_b1997","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11phor6\/completed_w5d3\/","text":"Just did it and wasn't too difficult at all! I posted this the other day about the previous run [https:\/\/www.reddit.com\/r\/C25K\/comments\/11mxqud\/w5d2\\_done\/](https:\/\/www.reddit.com\/r\/C25K\/comments\/11mxqud\/w5d2_done\/), so I was worried I'd run out of steam at some point. Managed to run 3.24km so an average pace of 6'15 per km which I'm happy with. First km i did in 5'22 so probably could have slowed a bit for that, but even so by the end I felt like I could have gone another few minutes comfortably.","upvote_ratio":0.97,"created_utc":1678636068.0},{"title":"Restart","author":"PunkWrites","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11phn0x\/restart\/","text":"Finally realized my login info was saved to Google so I can actually participate in communities now! Just reinstalled the old I was using back in 2016\/2017. Furthest I ever got was W5D3. I stopped both times due to back pain. I've had scoliosis since I was 8, saw an orthopedist every 6 months until age 19, wore a plastic brace in high school.\n\nPlanning to start again after an appointment with a new orthopedist and getting into PT, gonna ask them specifically about running. I genuinely love running and there's a lot of outdoor spaces nearby to go now that it'll be spring!","upvote_ratio":0.92,"created_utc":1678635944.0},{"title":"Strava Auto-Pause","author":"onebeers","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11pp3nn\/strava_autopause\/","text":"It’s my W3D1 tomorrow and for the past runs, I didn’t notice that the strava auto-pause setting was On. Should I turn it off and what changes will it do to my succeeding runs.\n\n*edit: posting it because I noticed that my records did not show my workout time as 30mins (length of my c25k program including warm ups and cool downs) always less. 20-25mins","upvote_ratio":1.0,"created_utc":1678653367.0},{"title":"Does muscle soreness eventually fade during runs?","author":"ApplenessAnge","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11pdyn0\/does_muscle_soreness_eventually_fade_during_runs\/","text":"I'm not exactly asking about injury pain here or post-run muscle aching, but I'm on week 5 of my c25k and I've noticed after my first 0.5km or so my calves start getting sore (I'm not even sure if sore is the best way to phrase it but like just general muscle tiredness and strain?) and it gets worse as I continue running. I'm just wondering for professional runners who run way longer than 5ks, do they\/you suffer from muscle strain (and will I eventually stop experiencing so much soreness during runs) or do you just learn to ignore it?\n\nMight seem like kind of a dumb question to ask since logic would say that as your muscles grow stronger they'll be able to run for longer times without strain but I personally haven't noticed any progress at all and was curious (maybe i'm just impatient).\n\nWould love to hear anyone else's experience\/advice!\n\n&#x200B;\n\nside note in case it's relevant: the c25k program I'm following is not the one linked in this subreddit, but another one that I found online","upvote_ratio":1.0,"created_utc":1678625917.0},{"title":"I've been on W0D0 for the last six weeks but I'm finally getting close to W1D1.","author":"MikeOKurias","url":"https:\/\/i.redd.it\/rwwl885wj7na1.jpg","text":"","upvote_ratio":0.99,"created_utc":1678565115.0},{"title":"Are there any free apps?","author":"MrsScienceMan","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11pbwrx\/are_there_any_free_apps\/","text":"Im a lifelong try-er, I think the furthest I got was week 3 a few years ago but hey ho new motivation, new attempt. I’ve always used zenlabs and noticed this time around after w2d1 I need to go pro. Is this specific app worth the pro payment? Or is there another I can use just the same? \n\nHad a head cold all weekend and working up the motivation to finish week 1 this evening!","upvote_ratio":0.83,"created_utc":1678618955.0},{"title":"Back pain solved!","author":"choccyweetos","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11p1ffi\/back_pain_solved\/","text":"Just thought I'd make a post after my last about lower back and knee pain for anyone else starting out experiencing the same issue. It was a problem I always had with running that I never managed to get even 5 minutes done, and thought the pain would stop me progressing in the plan.\n\nI had a few suggestions but something I'd never took notice of was how my feet landed. This is probably common sense to regular runners but I had no idea that landing heel first could cause both those issues. I'm now moving onto week 7 with ease with no problems anymore now I've adjusted the landing. Just a suggestion if you're feeling something similar!","upvote_ratio":0.92,"created_utc":1678584513.0},{"title":"Day two Completed!!","author":"Shot_Profession1465","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11ov6au\/day_two_completed\/","text":"Following up from my first day post, I finished day two! As per the advice on the previous thread I gave it a couple days rest from my first run and I got fitted for a pair of running shoes. The weather has been terrible so I ended up running in heavy rain but I want to build the habit of going out in all weather (within reason).\n\nLittle bit faster and definitely not running out of breath so soon. Can't wait for run 3.","upvote_ratio":1.0,"created_utc":1678568923.0},{"title":"Life after C25k - where are YOU now?","author":"Healthy-Painter-3770","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11okqwj\/life_after_c25k_where_are_you_now\/","text":"There are so many great posts from over the years in here but it got me thinking about where all these \"graduates\" ended up, so I thought I'd ask!\n\n1. How long ago did you graduate c25k?\n2. What did you do after you completed C25k (quit, continue doing 5ks, trained for a 10k, marathon etc)?\n3. Are you still running today?","upvote_ratio":1.0,"created_utc":1678542805.0},{"title":"W1d2 done!","author":"Trees-of-green","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11otvui\/w1d2_done\/","text":"The highlight was the cute dogs! Took a chance that I’d make it all the way around the little lake instead of needing to go out and back on the same part of the trail and it worked out!","upvote_ratio":0.92,"created_utc":1678565743.0},{"title":"Running and donating blood","author":"Agreeable-Bug-4901","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11p5zxa\/running_and_donating_blood\/","text":"","upvote_ratio":1.0,"created_utc":1678597843.0},{"title":"Week 2 completed! The weather wasn't great this week but I'm glad I pushed through.","author":"youngmo-iscoming","url":"https:\/\/www.reddit.com\/gallery\/11ov2b4","text":"","upvote_ratio":1.0,"created_utc":1678568652.0},{"title":"Conquered the infamous W5D3!","author":"flafunk","url":"https:\/\/i.redd.it\/7udrbg9dp1na1.jpg","text":"","upvote_ratio":1.0,"created_utc":1678494318.0},{"title":"W8D3 done - penultimate week with 3x 28 mins runs","author":"I_say_nicethings","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11oe5ik\/w8d3_done_penultimate_week_with_3x_28_mins_runs\/","text":"Just finished [week 8](https:\/\/i.imgur.com\/J3k8V23.jpg) with its three days of 28 mins.\n\nNext week is the final week of the program - 3x 30 min. \n\nI will hit my first personal goal!\n\n&nbsp;\n\nPersonal goals:\n\n1) first 30 mins run - that will be on W9D1\n\n2) first 5 km run - longest run so far was 3.14 km\n\n3) first 5 km in 30 mins - the estimate at the moment is ~44 mins\n\n \n&nbsp;\n\nIf I can do it\n\n#You can do it\n\nSee you at 5K.","upvote_ratio":1.0,"created_utc":1678520936.0},{"title":"Accuracy Question","author":"lostmymind16","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11owchf\/accuracy_question\/","text":"I just completed a session, the C25K app calculated I did 2 full miles. My watch calculated 1.49 miles. Just curious if anyone else has experience something similar to this? Is the C25K app accurate?","upvote_ratio":1.0,"created_utc":1678571805.0},{"title":"Completed C25K This week.","author":"C_Hams","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11o11qq\/completed_c25k_this_week\/","text":"Thanks to everyone in the sub with their inspiration and advice. I did my 1st 5k in years on the treadmill. Did it in just under 39 minutes. Got a local 5k fun run 18 March, who knew running was fun?","upvote_ratio":0.96,"created_utc":1678482835.0},{"title":"New sneak recommendations","author":"Lex_Loki","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11okk1v\/new_sneak_recommendations\/","text":"I have been buying Nike Pegasus, but the damn little wing on the back keeps catching on my stairs. I will most certainly kill myself at some point, lol.\n\nAnyways, they are wearing out, and I'd like a fresh new pair of sneakers to continue my running journey!\n\nI am 32\/F, and I have a really heavy gait. I also usually wear all of my shoes out in the big toe\/ ball of my foot area. \n\nAny suggestions? Cost isn't as important as quality, but over $200 is kind of pushing it.\n\nAny help would be great, or if this thread already lives someone else, please let me know!","upvote_ratio":0.75,"created_utc":1678542269.0},{"title":"Restarting C25K but outside this time! W6D1 done! The worst part about today was the 32 mph wind gusts and freezing temps, it was awful but hey! Glad I did it and I hit 2 miles for the 1st time today during a session. Thinking about taking 2 rest days due to slight knee pain but will see how I feel!","author":"yuyithemermaid","url":"https:\/\/www.reddit.com\/gallery\/11nmoet","text":"","upvote_ratio":0.98,"created_utc":1678447999.0},{"title":"Crushed my W1D3 🙌","author":"hasanopinion","url":"https:\/\/i.redd.it\/8k5wsa32h0na1.jpg","text":"","upvote_ratio":1.0,"created_utc":1678479414.0},{"title":"Just completed W5D3!!","author":"YeyeYaKnow","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11nqay0\/just_completed_w5d3\/","text":"Thanks for the support everyone from earlier in the week, had a heavy snowfall here in Wales so had to shuffle the run to today, not going to lie I found it hard but was totally worth it when I finished!\n\n&#x200B;\n\nJust took my time - we got this! :)","upvote_ratio":1.0,"created_utc":1678457566.0},{"title":"After completing W8\/D1 last Saturday had pain on the side of my right hip...progress paused until it feels 100%","author":"Bihas19","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11o3gw1\/after_completing_w8d1_last_saturday_had_pain_on\/","text":"Feeling a bit bleurgh. Completed W8\/D1 last Saturday and experienced hip pain at the end of the run. It's definitely feeling better as each day passes but on Tuesday when I tried testing the water, had to stop pretty much straight away as I could feel pain on the side of my hip every time my right foot landed.\n\nAt the point now where the pain is barely noticeable but thinking it's safer to wait until its 100% gone before I run. After all this progress its deflating..\n\nNo purpose of this post except to put it out there. I've found so many of the posts and comments on here really helpful and often motivating, but for anyone else deflated about an injury pausing progress, well... you're not alone in it.\n\nI'm really hoping by Sunday I can try again, don't know if I should roll back to an earlier week or see how I go with W8\/D2...","upvote_ratio":1.0,"created_utc":1678488641.0},{"title":"At home strength training routines?","author":"Purr_Francine","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11o07tl\/at_home_strength_training_routines\/","text":"t;dr: Does anyone have any basic strength training regimens that can be done at home?  \n\n\nFrom 18 to 26 running was my sole form of exercise (2-3 miles), but gradually I became bored with it. I moved to exclusively cycling for the next couple years. Once the pandemic hit, my mental health exponentially worsened, which, without going into much detail, resulted in developing chronic pain alongside pelvic floor dysfunction. My self esteem took a hit, my health anxiety heightened, my fear of injuring myself further led to me ceasing exercise, and all this accumulated in hitting a low point in my life. It’s worth noting I have ADHD (resulting in hypersensitivity and being easily overwhelmed), PTSD (resulting in body dysmorphia and overall low sense of worth), and OCD (manifesting as health anxiety). \n\nI had a breakthrough the other day realizing that my fear of injuring myself has created this vicious feedback loop worsening my mental and physical health. Prior to the pandemic I never associated exercise as a means of meditation and release–it had always been the fulcrum of body dysmorphia stemming from PTSD. However, I believe the aforementioned details resulted in me getting little to no dopamine, endorphins, or any other feel good chemicals, and thus the development of my chronic pain and muscle tension. \n\nI want to change this. I want to get back into running. I want to regain control of my health. \n\nThe problem is, for years all I did was run, I never strength trained. My physical therapist believes my pelvic floor dysfunction and chronic pain are the result of a tight\/weak core and posterior chain, especially in my glutes. The reason for my neglecting strength training? Being easily overwhelmed by all the possibilities and exercises. \n\nUltimately, I came here to ask for advice, as well as this question:\n\nDoes anyone have any basic strength training regimens that can be done at home?\n\nI have access to dumbbells, a bench, and a kettlebell.\n\nWhenever I’ve asked this in the past I’m pointed towards various wikis and websites that list an overwhelming amount of detail, and I figure it is best to start small to work up consistency in my routine.    \n\nThank you for your help!","upvote_ratio":0.88,"created_utc":1678480859.0},{"title":"Apps for treadmill C25K?","author":"dickewand","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11nmb9a\/apps_for_treadmill_c25k\/","text":"Is doing C25K on a treadmill any different than outside? Can I use the same app by Zen Labs? I imagine not, since it relies on GPS tracking and you're stationary on a treadmill.","upvote_ratio":0.91,"created_utc":1678446868.0},{"title":"W1d1 done!","author":"Trees-of-green","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11n8gp3\/w1d1_done\/","text":"Woohoo!!!","upvote_ratio":0.98,"created_utc":1678406515.0},{"title":"[WEEKLY THREAD] FEATS OF FRIDAY","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11nkxum\/weekly_thread_feats_of_friday\/","text":"Let's brag a little. What did you accomplish this week?","upvote_ratio":0.81,"created_utc":1678442403.0},{"title":"I'm baaaaack! I broke my toe and started renting a studio space for my photography business, haven't run in a while but excited to report I can still pick up where I left off 😁","author":"polarpear11","url":"https:\/\/i.redd.it\/c5bck3m19qma1.jpg","text":"","upvote_ratio":0.93,"created_utc":1678373728.0},{"title":"I cannot believe I just ran a 5K… this one goes out to my fellow slow runners!!","author":"11minuteslate","url":"https:\/\/i.redd.it\/y7lcfl936oma1.jpg","text":"","upvote_ratio":1.0,"created_utc":1678330443.0},{"title":"W5D2 done","author":"j_b1997","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11mxqud\/w5d2_done\/","text":"Just about. First 8 mins felt great, then the first 6 mins of run 2 were pretty good… then hit a brick wall. I did it but those last two minutes hurt. The big one up next, think I need to slow it down a bit!","upvote_ratio":1.0,"created_utc":1678382055.0},{"title":"W2D1","author":"PsychologicalBank129","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11n41u5\/w2d1\/","text":"I tried to do C25K about 6 months ago and was doing quite well. I got to about 7 weeks in and whilst I was able to just about manage the runs it never felt quite right. More often than not I'd have to cancel a run mid way through due go my ankles getting sore. It was pretty disheartening and honestly I was not enjoying myself. Stretching helped a little bit but not a lot and would be no guarantee I'd have to cancel a run.\n\nA few months ago I quit drinking alcohol. I was a nightly heavy drinker. Since then the weight has been falling off fast! I'm down 30lbs from my heaviest and have restarted C25K. Honestly the difference is night and day. My ankles are not sore at all during or after my run.\n\nI also had to run really slow before. It meant I wasnt really too out of breath after the run and couldn't push myself without risking a visit to ankle agony land. Today I got a stitch and pushed through. Haven't had a stitch in years. I'm enjoying the runs now and looking forward to finishing the program this time around 💪\n\nBest of luck to the rest of you !","upvote_ratio":0.93,"created_utc":1678396531.0},{"title":"W5D3 minor fail, should I repeat at slower speed?","author":"iflippyiflippy","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11n7brk\/w5d3_minor_fail_should_i_repeat_at_slower_speed\/","text":"Meant to say W3D3****\n\nThe pinned running plan doesn't load for me so I'm on this https:\/\/i.imgur.com\/tnoeHPw.jpg \n\nThis week was hard. It ramped up severely, going from the previous 5\/3 run\/walk to one 7\/2 then two 8\/2 days.\n\n I had 2, minutes left on my last run but my feet felt so hot and the rest of my body was getting more tense. I ended it with a 3 min walk. \n\nI'm a bit bummed, NGL.","upvote_ratio":0.88,"created_utc":1678403869.0},{"title":"Today, after 6 weeks of building up, I finally managed to run 3k using your tips and tricks. So just wanted to say thank you even though I'm sweating bullets right now.","author":"Initial-Birthday-656","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11moxo3\/today_after_6_weeks_of_building_up_i_finally\/","text":"","upvote_ratio":0.95,"created_utc":1678358067.0},{"title":"Strava groups?","author":"sunisburning","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11n1zwg\/strava_groups\/","text":"Are there any active Strava groups for the C2 programs? It'd be nice to join something for motivation. Just starting out!","upvote_ratio":1.0,"created_utc":1678391853.0},{"title":"W1D2 Done","author":"Worried_in_the_Bay","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11mv6pr\/w1d2_done\/","text":"Did it indoors, basically doing laps of the living room, but I still did it. I feel like I was running a little fast. I'm probably going to repeat W1D2 outdoors on Saturday *before* the gym to see how things differ between indoors at a lower temperature and outdoors in the probably early-twenties \\*C. I was able to handle all the intervals today perfectly and didn't have to stop once, so I definitely think that my first W1D1 was impacted by EITHER the weather OR the gym. Hence my test on Saturday.\n\nStill enjoying it, for what it's worth. And that's still a surprise.","upvote_ratio":0.9,"created_utc":1678375982.0},{"title":"How to avoid fatigue?","author":"Initial-Birthday-656","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11mm8ra\/how_to_avoid_fatigue\/","text":"I have been running for 6 weeks now but I'm still stuck on 2k, it's like as soon as the tracker hits 2k, I'm instantly fatigued. Solutions please?","upvote_ratio":1.0,"created_utc":1678347856.0},{"title":"W1D1 down","author":"Pemulis","url":"https:\/\/i.redd.it\/2c85pzid6mma1.jpg","text":"","upvote_ratio":1.0,"created_utc":1678306324.0},{"title":"Tight, painful calves as soon as I start running","author":"SentFromTheTrash49","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11mn439\/tight_painful_calves_as_soon_as_i_start_running\/","text":"I just started W1D1 and I did my 5 minute brisk walk, then when I started running, my calve see mini fly instantly got tight and painful. Not like injury pain but like the lactic acid burn. It was like flexing your calves as hard as you can then try to run on them keeping them flexed the whole tome. This happened within like 30 seconds of my first run. During my walking periods it would partially go away, but get progressively more painful as I ran more.By the end it was all I could do to push through without tearing up from the pain.\n\nBefore I ran I made sure to stretch. I spent probably 45 minutes stretching and foam rolling my legs and hips. Could this be chin splints? I haven’t ran since I was a kid so this is all new to me and I have no idea what’s happening, but it’ll ruin running for me if I can’t find a solution","upvote_ratio":1.0,"created_utc":1678351107.0},{"title":"Restarting C25K but outside this time! -W5D3 done - Can’t believe I managed to jog for 20 minutes! And after it snowed! Old me would have let the snow stop me but I actually looked forward to it :) Feeling so good about my progress today and looking forward to week 6!","author":"yuyithemermaid","url":"https:\/\/www.reddit.com\/gallery\/11lrq93","text":"","upvote_ratio":0.99,"created_utc":1678267343.0},{"title":"W1 D1 & W1 D2 in the bag! Returning after having a baby.","author":"hasanopinion","url":"https:\/\/i.redd.it\/ou6vcsm0wlma1.jpg","text":"","upvote_ratio":1.0,"created_utc":1678302841.0},{"title":"WK1D5","author":"shag377","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11mb1ct\/wk1d5\/","text":"Since August, I have dropped about 60 lbs.  I still am fairly heavy.  However, I am working on running a mile before I run my first 5k.\n\nI am semi-following the plan.  It is my goal to let my body dictate when to move on.  If it takes me longer to make it, it takes me longer.  I want to run a 5k before 2024.\n\nDoes anyone have any suggestions?  Currently, I am on a treadmill for 2.5 mph for two minutes; 3.5 mph for one  minute running for a total of 20 minutes.  Certainly not moving swiftly, but I am moving.","upvote_ratio":0.86,"created_utc":1678316212.0},{"title":"W4D2!!! Did a 5k in 36 minutes!","author":"blueberrywaffles3","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11ly5fw\/w4d2_did_a_5k_in_36_minutes\/","text":"I’m proud! Not super fast or anything but I did it! Did mile 1 in 12 minutes, walked for a few minutes then ran mile 2 in 11, walked a few, then pushed myself for mile 3 and did it in 9 minutes!!","upvote_ratio":0.92,"created_utc":1678286736.0},{"title":"W1D3 done! felt like death but i finished!","author":"PsychologicalBlock83","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11lz98f\/w1d3_done_felt_like_death_but_i_finished\/","text":"it’s super cold and windy where i live right now so that was an extra challenge today. there were many moments where i was questioning my life choices and wondering if running will ever get easier, but i decided to just go for it and trust the process. one day it won’t be this difficult (i hope)!","upvote_ratio":1.0,"created_utc":1678289392.0},{"title":"Long Time Coming... W1D1 Finished!","author":"Novel-Pop7463","url":"https:\/\/i.redd.it\/jcev9vc79ima1.jpg","text":"","upvote_ratio":0.99,"created_utc":1678258849.0},{"title":"Can’t hear the audio cues from active app","author":"zirkel37","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11mcjyc\/cant_hear_the_audio_cues_from_active_app\/","text":"Any suggestions on how to solve this? My Apple Watch only vibrates when I should start walking or start running etc but I prefer to hear cues while I run","upvote_ratio":1.0,"created_utc":1678319725.0},{"title":"Recently completed W8D2. My heart rate was very high throughout the run but I felt completely fine and it wasn’t really a struggle. Has this happened to anyone else?","author":"spearsandroses","url":"https:\/\/i.redd.it\/7gfvpb6djjma1.jpg","text":"","upvote_ratio":0.92,"created_utc":1678274373.0},{"title":"Ran a 5k with with very little training. Super addicted now","author":"Unlikely_Mix_703","url":"https:\/\/i.imgur.com\/U9z3lRI.jpg","text":"","upvote_ratio":0.8,"created_utc":1678269608.0},{"title":"W7D1 completed!","author":"ste001","url":"https:\/\/i.redd.it\/jucauqaqedma1.jpg","text":"","upvote_ratio":1.0,"created_utc":1678218273.0},{"title":"how do i stop getting nervous about runs?","author":"PsychologicalBlock83","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11ljflt\/how_do_i_stop_getting_nervous_about_runs\/","text":"tomorrow morning i start W1D3, and so far i’ve done well with the past 2 days, but i keep freaking myself out and telling myself that this time it’s going to be a bad run or i’m not going to do as good, which kind of makes me feel discouraged. any tips on how to reframe or overcome this doubt?","upvote_ratio":0.92,"created_utc":1678242231.0},{"title":"W4D1 - had to stop midway","author":"Heavy_Sprinkles_2773","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11lnto2\/w4d1_had_to_stop_midway\/","text":"I had completed the second 3 minutes run and suddenly got a very bad stomach cramp. So, my periods had decided to show up unannounced. I feel bad that I couldn't complete my run. My pace was good today and I was feeling overjoyed that I could run 5 minutes continuously. I hate that I had to stop midway :\/","upvote_ratio":1.0,"created_utc":1678254431.0},{"title":"[WEEKLY THREAD] RANT WEDNESDAYS","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11lscy3\/weekly_thread_rant_wednesdays\/","text":"Things that make you go !@#$%&","upvote_ratio":1.0,"created_utc":1678269603.0},{"title":"Deleted app after 8 years","author":"iamagirl1","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11m4x75\/deleted_app_after_8_years\/","text":"Opened the app for the first time in a few months to find that it’s no longer free. Too bad. It was a good app. Just not worth paying for. Found another free training app. Sorry to see it go. C25K was a huge part of my life.","upvote_ratio":0.33,"created_utc":1678302279.0},{"title":"First day down!","author":"Shot_Profession1465","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11l4cf3\/first_day_down\/","text":"I haven't run in quite some time and I was never good at it. However, I completed the run. I am determined to finish this. My ankles hurt so bad but I will not give up this time.","upvote_ratio":1.0,"created_utc":1678207574.0},{"title":"Finished my first 10k race and am amazed at my progress!!","author":"syclops_","url":"https:\/\/www.reddit.com\/gallery\/11kv1v2","text":"My main achievements from my first ever 5k to my 10k race on Saturday. Was originally aiming for sub hour then my brother in law told me, based on my 5k pb I should go for sub 57 minutes. Then on race day he egged me on to try and stick with the 55 minute pacers and i managed to get sub 55!!!","upvote_ratio":0.98,"created_utc":1678183107.0},{"title":"What's the best free or paid app AFTER completing C25K?","author":"Freds_Premium","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11lmloh\/whats_the_best_free_or_paid_app_after_completing\/","text":"I want to get faster and a search told me that running longer will get you faster. So the progression is 10K after 5K. What's the best app for this? I see ZenLabs 10K app is not free for the full program, is it worth paying for? Or, is there a better app? Thanks.","upvote_ratio":1.0,"created_utc":1678250795.0},{"title":"Did W1D1. Pretty sweet lifestyle choice tbh.","author":"Schizophrenic01","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11kwbik\/did_w1d1_pretty_sweet_lifestyle_choice_tbh\/","text":"Don't feel much but the feeling of confusion has definitely went down quite a bit from what it was before I ran.","upvote_ratio":0.83,"created_utc":1678187128.0},{"title":"About to enter W5D3","author":"YeyeYaKnow","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11kvy4h\/about_to_enter_w5d3\/","text":"Any suggestions on how to approach this day? The 8 minute runs scared me on W5D2 - but this seems like a massive jump! Not sure how to approach the playlist or what to do, or should I just go for it and see how it goes? Did anyone fail it and return to it if so?","upvote_ratio":1.0,"created_utc":1678185979.0},{"title":"I have not been updating but oh my god I'm actually doing this,??????","author":"Phallenpheather","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11kc142\/i_have_not_been_updating_but_oh_my_god_im\/","text":"I can actually like, jog for several minutes at a time?????? \n\nI can feel the changes in my body and this is just incredible. \n\nI've had a few bad runs, but that's okay. I'm learning to take it as it is and \"forgive myself\" for a bad run. It just is what it is! \n\nI can celebrate what my body is capable of. \n\nThis is incredible","upvote_ratio":0.98,"created_utc":1678132642.0},{"title":"Quick question for anyone who did the programme outside after completing it on a treadmill","author":"Historical_Ant6997","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11kzkzm\/quick_question_for_anyone_who_did_the_programme\/","text":"Did you start from the very beginning again or part way through? Is there any particular week that would be best?\nI’m about to finish week 6 on a treadmill and want to start running outside once I’ve completed week 9.\nAny advice greatly appreciated! 🏃‍♀️","upvote_ratio":1.0,"created_utc":1678196301.0},{"title":"Running Music 2023 - Running Hits [Running Music]","author":"MelissaSharonMusic","url":"https:\/\/open.spotify.com\/playlist\/0PNoxh4jV8clEvX0eHtH0L?si=82c9f30519144e24","text":"","upvote_ratio":0.5,"created_utc":1678212770.0},{"title":"graduation night!","author":"Gragra37","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11kf4i5\/graduation_night\/","text":"Well I did it in 37. Thanks for all your support.","upvote_ratio":1.0,"created_utc":1678139146.0},{"title":"finished W1D2!! finally faced my fear and ran outside today","author":"PsychologicalBlock83","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11k1log\/finished_w1d2_finally_faced_my_fear_and_ran\/","text":"i was planning on doing the whole program on my treadmill because i get so self conscious of how i look when i’m running, but today i decided to just go for it and it was the best decision i made. it no longer felt like a chore, because i was looking at great scenery and breathing in fresh air. it felt amazing","upvote_ratio":0.97,"created_utc":1678115915.0},{"title":"Rain!","author":"Ok_Sock_3643","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11kb31k\/rain\/","text":"How do you motivate yourself when the forecast is rubbish? I’m just starting week 2 and the weather in England is horrible this week, rain for the next 6 days.","upvote_ratio":1.0,"created_utc":1678130613.0},{"title":"Graduated C25K in November, just ran the London half marathon in 1hr :40 mins","author":"Westq2","url":"https:\/\/i.redd.it\/jx4bm2z141ma1.png","text":"","upvote_ratio":0.99,"created_utc":1678051301.0},{"title":"Possibly stupid question. Am I doing the program wrong?","author":"_WhiteTPoison","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11kgxdn\/possibly_stupid_question_am_i_doing_the_program\/","text":"I just started week 3 and I noticed from other posts that some users are logging in high 20min - low 30min run times. Are they running extra or is that including warm up\/cool down? Not including my walking warm up, week 3 for me is only 18min (90 sec jog\/90 sec walk, 3min jog\/3 min walk x2). Sorry if this is dumb, just confused and want to make sure I’m doing the right thing. Thanks","upvote_ratio":1.0,"created_utc":1678143132.0},{"title":"Crossed 4km for the first time in my life yesterday.","author":"OnidaKYGel","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11jsymg\/crossed_4km_for_the_first_time_in_my_life\/","text":"Hi! \n\nI should say off the bat that I dont follow the program. I just hit the treadmill as often as I can. That usually means 2 maybe 3 times a week. But my goal is to be able to do 5km runs regularly.\n\nI been doing 15 minute runs making sure I cross 2km everytime and I've been able to do it consistently. Yesterday, I decided to push it and I crossed 4km at 32:30 approximately. I was on 8kmh consistently with a break in the middle where I dropped to 5kmh. I felt I could cross 5k but I thought to save it for another day. \n\nSo yeah. yay me :)","upvote_ratio":0.96,"created_utc":1678091240.0},{"title":"Those who use active’s 5k to 10K app, how do I link the data from the app with Apple fitness?","author":"zirkel37","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11kaww3\/those_who_use_actives_5k_to_10k_app_how_do_i_link\/","text":"","upvote_ratio":1.0,"created_utc":1678130243.0},{"title":"Paid app??","author":"iamagirl1","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11k34i5\/paid_app\/","text":"Fell in love with c25k all years ago when it helped me fall in love with running. I’ve used it a few times over the years. Restarting the app to go again. Imagine my surprise when i opened the app after a few months today and it’s no longer a free app?! Does anybody have any free train to run apps they use??","upvote_ratio":0.6,"created_utc":1678119341.0},{"title":"W3D1 done!!!","author":"Soggy_Bed_3244","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11jgdbp\/w3d1_done\/","text":"I was so nervous for today, but I did it!! My pace was a little too fast on the first 1.5 minute run, which had me nervous. I sometimes speed up by accident. I think the momentum of running makes it hard to not keep picking up speed. But I caught my breath on the walking portion and focused really hard on keeping a consistent pace on the 3 minute run, and I did it and was fine for the second 3 minute run as well!\nI decided I wanted to start running a little less than a month ago. I told myself I would just run for the length of a song, and add another song each week. But at the end of that 3 minute song, I felt like I was dying, my mouth tasted like blood, and I had a wheezing cough for the rest of the day. The next day, I started C25K, and I’m so glad that I did. I feel like I’m really getting somewhere!!","upvote_ratio":1.0,"created_utc":1678056199.0},{"title":"Graduated c25k today! Started Jan 3,2023 and did my 30 min run today! What do I do next?","author":"Federal-Progress-365","url":"https:\/\/i.redd.it\/ynroootf8zla1.jpg","text":"","upvote_ratio":0.98,"created_utc":1678028561.0},{"title":"Restarting C25K but outside this time! - W5D2 done! First time running for 8 minutes straight outside today so I’m quite happy with that! However I’m worried for the huge jump to 20 minutes of running for W5D3. I think it’s a mental block I’ll have to push through but hoping for the best!","author":"yuyithemermaid","url":"https:\/\/www.reddit.com\/gallery\/11iwbik","text":"So","upvote_ratio":0.99,"created_utc":1678020366.0},{"title":"W1D1 Done! Not Well, But Done!","author":"Worried_in_the_Bay","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11izoqz\/w1d1_done_not_well_but_done\/","text":"So I posted here some time last week talking about my doubts about handling C25K and advice etc. etc. and you lot were very supportive and gave a lot of advice.\n\nSo yesterday, right after my hour's workout at the gym I went ahead and did my W1D1. I couldn't complete it perfectly, I cut short a few of the run sections and skipped one entirely, but I did it. I also had to do some running\/walking on the spot at stop lights. Google Fit *says* I managed 2.49km, but I'm highly doubtful of that. \n\nI'll do the same route tomorrow\/next time and repeat W1D1 to see if I can do it better. I also downloaded Strava (though really, you have to pay after your first free month?) so I can see how far I did. ANy recommendations for a free route tracker type thing would be recommended.\n\nSo thanks guys, gals, peeps and so on for the support.","upvote_ratio":1.0,"created_utc":1678029995.0},{"title":"[WEEKLY THREAD] MORONIC MONDAYS","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11junh2\/weekly_thread_moronic_mondays\/","text":"Don't be embarrassed. We all have questions sometimes.\n\nAnd yes, you need to do your rest day between runs.","upvote_ratio":1.0,"created_utc":1678096976.0},{"title":"From 12K to 21K in 7 weeks","author":"wreckherjournaI","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11jmykp\/from_12k_to_21k_in_7_weeks\/","text":"Hi! I just joined a 12k race this weekend and I was able to do it in 1hr and 40mins. There’s another race coming up in our area in 7 weeks and I thought of doing the same category. But also thought maybe I could do 21K this time. Is this wishful thinking? Do you think I could do 21K in 7 weeks? \n\nAny advice is very much appreciated. Also if anyone has any tips on any meal plans etc when doing 21K that would be very helpful.\n\nThank you so much foe taking the time to read. Really grateful that this sub exists! 🙏🏽","upvote_ratio":0.5,"created_utc":1678073073.0},{"title":"I completed the program! I’m not at a full 5k distance yet, so that’s my next goal, but I’m proud to be able to run for a full 30 minutes!","author":"Hot-Bat-5042","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11idrbb\/i_completed_the_program_im_not_at_a_full_5k\/","text":"","upvote_ratio":1.0,"created_utc":1677965172.0},{"title":"C25K on a treadmill","author":"cabird78","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11iqkw4\/c25k_on_a_treadmill\/","text":"Hi all,\n\nI feel a bit like I've been cheating as I've been following the program.  Since I live in Seattle (cold and rainy for a lot of the year) and I often can only work out once kids are in bed, I've followed the program on our treadmill.  \n\nThe good news is that I was able to go from having never run before in my life for more than 2 min to being able to jog at 5.5 MPH for an hour and I'm aiming to run a 10K this summer (I'm not looking to be able to place high or have a fast pace, just be able to jog the whole 10K without stopping).  I \\*never\\* thought I would get this far.  \n\nThe bad news is that literally all of my jogging has been somewhat artificial, on a treadmill at a fixed speed, no incline, on a forgiving platform much less hard than concrete, at a nice temperature with no rain, and usually watching netflix.  That 10K I've set as a goal is going to be much different as it will be outside and have all the differences that come with it.  As I've lurked on this subreddit I've seen many people say that running on a treadmill is much different than running outside and that totally makes sense.\n\nSo my ask to the more experienced folks here is: How should I prepare for a 10K race if I've only run on a treadmill so far?  As the weather gets better, I can probably get outside for at least one run per week.  Any suggestions on the best thing to do?  Should I ease into things (distance-wise? speed-wise?) to avoid injuries?  I'm looking both for suggestions of things to do\/not do as well as things to watch out for or expect in transition.  To be honest, I got into this mostly just to be able to stay fit and so I'm fine keeping it on the treadmill in the long term, but I'd like to be able to run outside in events and when I travel, etc. and I don't want to be naive and assume I can just go out and do the same things I'd been able to do inside.  Thanks in advance for any suggestions\/advice.","upvote_ratio":0.95,"created_utc":1678000472.0},{"title":"About to finish the programme (on treadmill). Currently at 7.7 mph with 0.5 incline for 30 mins, how does this compare to the average and experienced runner?","author":"Waqqy","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11ix26m\/about_to_finish_the_programme_on_treadmill\/","text":"Early 30s, live in Scotland so the weather has been miserable, I do aim to attempt running outside once Spring begins and it gets a little warmer. Also aim to keep running 5k and building up the speed, might try building up to 8mph later this week.\n\nAnother question: I do sometimes get shin and\/or heel pains after running...does this mean I'm running with bad form or just something that will diminish over time? I have taken time off previously to recover when it's been a hindrance.","upvote_ratio":0.8,"created_utc":1678022642.0},{"title":"Any tips for using non-programmable treadmills when doing intervals inside during inclement weather?","author":"TheThirteenthCylon","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11j4jm1\/any_tips_for_using_nonprogrammable_treadmills\/","text":"Oregonian here, so frequent winter rain and occasional snow\/ice, like today.\n\nNone of the treadmills at either of the gyms I frequent are programmable.  That forces me to use Manual mode, but between the delays in achieving desired speeds and having to either hold down a button or press it repeatedly, it's either frustrating or dangerous (at least while at the end of a running interval).  I've seen people use two treadmills, side by side (one for each speed), and I like that approach but would only do that during quieter gym hours.\n\nAny suggestions are appreciated!","upvote_ratio":1.0,"created_utc":1678038258.0},{"title":"week 1 day 1 never ran a 5k before","author":"etujfssg","url":"https:\/\/i.redd.it\/jatavaymstla1.png","text":"","upvote_ratio":1.0,"created_utc":1677962718.0},{"title":"Week 1 completed! Finally started after months of procrastinating","author":"youngmo-iscoming","url":"https:\/\/i.redd.it\/ebcfbbztyrla1.jpg","text":"","upvote_ratio":1.0,"created_utc":1677940582.0},{"title":"C25K - Anyone getting started? Looking for partner to keep me from slacking!","author":"Captain-Popcorn","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11i86uf\/c25k_anyone_getting_started_looking_for_partner\/","text":"Not my first time. I start in the spring and have completed each time, and run through the fall until it gets chilly. Once I did b210k after.  But I didn’t run last 2 years and back to couch potato status for running!\n\nI’ve picked up some tips that I’m happy to share.","upvote_ratio":1.0,"created_utc":1677952297.0},{"title":"5’9 145lbs. Able to finish 5k recently but high heart bpm. How do I reduce it? I feel it drains all my energy out and not able to run more. Is MAF training the only way? I don’t think I have the patience for it:(","author":"controlsgeeek","url":"https:\/\/i.redd.it\/0bx24fg51vla1.jpg","text":"","upvote_ratio":0.75,"created_utc":1677977687.0},{"title":"W7D3 done - first week with 3x 25 mins runs","author":"I_say_nicethings","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11htljs\/w7d3_done_first_week_with_3x_25_mins_runs\/","text":"Just finished [week 7](https:\/\/i.imgur.com\/APLHWbY.jpg) with its three days of 25 mins.\n\nNext week - 3x 28 min. After that, final week with 3x 30 min.\n\nI'm nowhere near 5k, but I'm not woried. After graduation I'll work at my speed and I'll get there.\n\n\nPersonal goals:\n\n1) first 30 mins run - *that will be on W9D1*\n\n2) first 5 km run - *longest run so far was 2.88 km*\n\n3) first 5 km in 30 mins - *the estimate at the moment is ~44 mins*\n\n&nbsp;\n\nIf I can do it\n\n#You can do it\n\nSee you at 5K.","upvote_ratio":1.0,"created_utc":1677916878.0},{"title":"Stopped by thigh chafing","author":"alnono","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11ii0aw\/stopped_by_thigh_chafing\/","text":"Ugh, has anyone else had this problem? I’m not obese, but I’ve gotten some (large? blisters that are causing me issues. I’ve been ignoring them, but I feel like that just made them worse so I have to take a break. Hopefully not a long one… I just think that if it gets any worse I’ll need to seek medical assistance, it’s that bad. \n\nAnyone have any suggestions to help it heal quickly or prevent it once it improves? I’m in week 8 and I’m kind of bummed I’m not going to get all 3 runs in this week for such a dumb reason. Today I’m using hydro cortisone cream and polysporin…","upvote_ratio":1.0,"created_utc":1677975512.0},{"title":"I’m a lurker here, but I’m pretty proud so I’ll post for once :)","author":"Actual_Pineapple_550","url":"https:\/\/i.redd.it\/j8ev6r91wlla1.jpg","text":"","upvote_ratio":1.0,"created_utc":1677866999.0},{"title":"Did wrong week of c25k","author":"yhtatch","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11i1g8f\/did_wrong_week_of_c25k\/","text":"So I just started c25k today and i ran w2d1 instead of w1d1. Should I skip the first week of c25k?","upvote_ratio":0.67,"created_utc":1677942647.0},{"title":"Week6Day1:(","author":"nailbabyliz","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11hjz6p\/week6day1\/","text":"I finished the run but it’s the first time, I felt like I couldn’t do it and had to slow down… feeling rlly unmotivated..ugh. Advice?","upvote_ratio":1.0,"created_utc":1677889317.0},{"title":"yesterday I should have done w6d3 but I've had a stressful couple of days and didn't have the energy. Today I wanted to skip again but decided to just go for a run without the program and I'm happy I went","author":"Strong_Feed3126","url":"https:\/\/i.redd.it\/m1rd74140lla1.jpg","text":"","upvote_ratio":1.0,"created_utc":1677856263.0},{"title":"Slowly progressing towards 5k! Running like a snail but still running! Would appreciate any tips to improve!","author":"PopGurll","url":"https:\/\/i.redd.it\/xgw2kiw75mla1.png","text":"","upvote_ratio":1.0,"created_utc":1677870093.0},{"title":"My first 5k run isn’t 5k :(","author":"zirkel37","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11h51cw\/my_first_5k_run_isnt_5k\/","text":"I used the zen app and I stopped at 40 mins not knowing that I was only at 4.27. Had I known before hand I wouldn’t have stopped and now I’m sad that my first 5k isn’t 5k..","upvote_ratio":0.85,"created_utc":1677861058.0},{"title":"W5D1 done! Feeling pretty exhausted so think I might do this one again before progressing","author":"chubbagrubb","url":"https:\/\/i.redd.it\/qpz4v5j9vlla1.jpg","text":"","upvote_ratio":1.0,"created_utc":1677866741.0},{"title":"Temporarily quitting mid W2D2 due to shin splints..","author":"S1nko","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11heyj9\/temporarily_quitting_mid_w2d2_due_to_shin_splints\/","text":"Unfortunately I have failed my first attempt at running..\n\nThe pain started after W1D3, but it was pretty mild and I thought that maybe it's not that bad, I'll just take some more rest days, watch some videos about correct running form and try to focus on midfoot strike next time.\n\nW2D1 completed, it's getting worse and I can feel the pain basically at all times if I think about it while walking, still *manageable* tho.\n\nSo today I went for D2 and immediately it was not a good start, the pain was fairly noticeable while doing 5 min walk and it fully hit on the actual run. I figured it was not worth completing and just barely made it back home, it freaking hurts..\n\nAnyway, see you in a month or so! Meanwhile I'll buy a foam roller and start doing toe raises, heard it helps.","upvote_ratio":0.86,"created_utc":1677877617.0},{"title":"Anyone else struggle with “looping” their route?","author":"Jomato_Soup","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11gve2m\/anyone_else_struggle_with_looping_their_route\/","text":"It throws me right off!\n\nI was getting to 15 or 20 mins and mentally needing to stop because I need to circle round the park. \n\nTook a break from the programme today (week 7) and tried a different park with a longer route. Ran for 22 minutes solid! Very proud of myself. But what gives!?","upvote_ratio":0.97,"created_utc":1677831658.0},{"title":"I don't know how but i completed W5D3","author":"DarkZek22","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11gnnj9\/i_dont_know_how_but_i_completed_w5d3\/","text":"I just did W5D3, i don't know how, i was totally sure that i couldn't do it but i did it, i was even sad this morning because i was sure that i was going to fail this day but now i'm sure that i can finish C25K.\n\nIf you're afraid of W5D3 just do it, you can do it, now i can understand what everyone say, W5D3 is just a mental barrier.\n\n&#x200B;\n\nhttps:\/\/preview.redd.it\/wnvumqi3jfla1.jpg?width=530&format=pjpg&auto=webp&v=enabled&s=6e22a84c2cd0d02dbed16ab2337ed33d47e91a56","upvote_ratio":0.99,"created_utc":1677807861.0},{"title":"[WEEKLY THREAD] FEATS OF FRIDAY","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11gwxwf\/weekly_thread_feats_of_friday\/","text":"Let's brag a little. What did you accomplish this week?","upvote_ratio":1.0,"created_utc":1677837739.0},{"title":"Restarting C25K but outside this time! - W5D1 completed! A bit of a slower pace than W4D3 but my average HR was lower than it has been the past month so I’m sure that’s a good thing! I felt a little knee pain today so thinking about taking 2 rest days and doing my next run on Sunday. Thoughts?","author":"yuyithemermaid","url":"https:\/\/www.reddit.com\/gallery\/11fz63s","text":"","upvote_ratio":0.99,"created_utc":1677751800.0},{"title":"If you finish W5D3…","author":"SelfCareBears","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11fyrcy\/if_you_finish_w5d3\/","text":"But not track it in your phone, does it really count? 😛\n\nIm so stoked that I managed to run (embarrassingly slowly) for 20 straight minutes! It’s scary but really not that bad at all. Like I said I didn’t track so I don’t know distance, but I’m guess between 2 and 2.5 km for the running stretch. I definitely feel like I can handle the rest of the program now!\n\nAlso if anyone has some advice on how to make my hands sweat less when you run, I’d appreciate it… they always feel so gross and clammy\n\nTime to reward my 20 mins run with a 20 min everything shower!","upvote_ratio":1.0,"created_utc":1677750321.0},{"title":"Looking for input","author":"thecastlehag","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11g9tkc\/looking_for_input\/","text":"I am doing zombies run 5k training and I love it.  Working through week 7.  I already had to take a week off part way through week 5.  I just got so tired and felt I needed a rest. The runs are totally doable and enjoyable.  Like they are challenging but they dont feel taxing.  I got back on the following week and completed week 5 and 6.  On week seven I did the w7d1 took a day off then complete w7d2 and felt completely exhausted again.  So I waited 5 days and did w7d3.  The perfectionist in me wanted to redo the week since it took me like 8 or 9 days to complete it but I'm trying to be reasonable with myself.  My pace is not fast.  I love running and wish I could do more.   Anyway is this kind of fatigue expected?  Any tips, suggestions, anecdotes?","upvote_ratio":1.0,"created_utc":1677781298.0},{"title":"W9D2 ✔️! It was a hard run that I had to slog through, but i slogged through entire 30 minutes anyway!","author":"Hot-Bat-5042","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11fpk74\/w9d2_it_was_a_hard_run_that_i_had_to_slog_through\/","text":"","upvote_ratio":1.0,"created_utc":1677722543.0},{"title":"Finished Week 4! Feeling good 💪😀","author":"chubbagrubb","url":"https:\/\/i.redd.it\/d4g4exybm7la1.jpg","text":"","upvote_ratio":1.0,"created_utc":1677694242.0},{"title":"Think I’ve hurt a hamstring… so frustrated","author":"Tinygalaxie","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11g5boz\/think_ive_hurt_a_hamstring_so_frustrated\/","text":"Just completed W1D2, though really it’s more like the first time as I have been ill for a while and started again today. I stretched well before and after and took it very gently but I’ve still managed to strain a hamstring. It’s really painful when walking. Have foam rollered it and will focus on resting and recovering but I’m so frustrated - I did everything right! Has anyone else experienced this? I think it might be the fault of my shoes, I’ve ordered some new ones with proper support (I have high arches and flat feet) but I am kicking myself for getting injured so early on.","upvote_ratio":1.0,"created_utc":1677770460.0},{"title":"Week 2 Day 2 - Finally not dying on the run sections! Shins feeling better!","author":"tea_bird","url":"https:\/\/i.imgur.com\/aoBa2LO.jpg","text":"","upvote_ratio":0.98,"created_utc":1677679723.0},{"title":"Best running apps to keep pace for iPhone?","author":"fastforward89","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11fm5u7\/best_running_apps_to_keep_pace_for_iphone\/","text":"I’ve been strictly running on a treadmill to keep pace. My first 5k is in a couple of weeks and will be outside. Are there any apps you recommend to help you stick to your pace? I’ve noticed when I try running outside I get very excited and tend to speed up. I’d like an app to help me stay on pace. I appreciate any recommendations. Thanks!","upvote_ratio":0.75,"created_utc":1677714081.0},{"title":"Finished 5K under 30 minutes for the first time! Started running in Feb. Happy!","author":"karmayoge","url":"https:\/\/i.redd.it\/u6fsuc5q33la1.jpg","text":"","upvote_ratio":0.99,"created_utc":1677639556.0},{"title":"W3D1 done! Didn't think I would be able to run continuously for 3 mins. I'm so happy. Also, special thanks to my kpop workout playlist.","author":"Heavy_Sprinkles_2773","url":"https:\/\/i.redd.it\/ittlqpj9i3la1.png","text":"","upvote_ratio":0.96,"created_utc":1677644446.0},{"title":"My thoughts on shoe rotation. Maybe someone will find it useful.","author":"Adventure-Craft","url":"https:\/\/youtu.be\/zAml1M8M2L4","text":"","upvote_ratio":0.67,"created_utc":1677713312.0},{"title":"Watch to 5K - Apple Watch app testers required :)","author":"radox1","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11f04st\/watch_to_5k_apple_watch_app_testers_required\/","text":"I am looking for some Apple Watch users who are interested in just using their Apple Watch to do the Couch to 5K plan to beta test new features of my  app Watch to 5K.\n\nWatch to 5K is an independent Couch to 5K plan for your Apple Watch allowing you to run with just your Apple Watch. The app will help you gradually work up towards running 5K in just 9 weeks. The running plan is for absolute beginners. It involves 3 runs a week, with a day of rest in between, and a different schedule for each of the 9 weeks. By the end of the program, you will be able to run continuously for 30 minutes (approx 5k).\n\nThe app includes an iPhone companion app to allow you to track your progress, view your achievements and view stats on your completed runs.\n\nYou can find more info about the app at [WatchTo5K.com](https:\/\/watchto5k.com\/)\n\nI'm looking for some beta testers to test the build on TestFlight. Joining the beta is entirely free and gives you access to the full app (including early access to features before they hit the store). Your feedback on the betas will allow me to iron out any bugs before releasing updates to the app. If you are interested please let me know by replying to this thread and I will send you the details on how to access the beta.\n\n*All you need is an Apple Watch (S3+) , an iPhone running iOS 15+ and be willing to give running ago!*","upvote_ratio":1.0,"created_utc":1677665678.0},{"title":"5k Runner App route tracking?","author":"Old_dood_","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11f3nqp\/5k_runner_app_route_tracking\/","text":"I just started C25K!\n\nI am using the 5K Runner app on an Apple Watch. I'm interested in tracking my route, does anyone know if this app does route tracking, and if so how do I turn it on? \n\nThanks :)","upvote_ratio":1.0,"created_utc":1677676955.0},{"title":"Restarting C25K but outside this time! - W4D3 DONE! Running today felt great. Those 5 minutes intervals didn’t seem too bad and I also knocked off over a minute off my first mile compared to a week ago. Taking tomorrow off and going to start W5D1 on Thursday. Can’t believe it’s been 4 weeks already!","author":"yuyithemermaid","url":"https:\/\/www.reddit.com\/gallery\/11e7aqs","text":"Also I’ve found myself focusing too much on how much time I had left during running intervals so I tried listening to a podcast today opposed to music which personally helped a lot. I didn’t look at my phone as much and was more focused on what was being said and not so much about what I was doing.","upvote_ratio":0.99,"created_utc":1677593442.0},{"title":"C25K - Getting started while overweight","author":"DandthebigD","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11eu2p5\/c25k_getting_started_while_overweight\/","text":"Hi, first time posting.\n\n\nBackstory:\n\nI have been working out consistently for about 5 months now, I started at 300lbs and now am 290lbs with a little muscle. I workout 2-3x a week (ideally MWF), with walking warmups of 10 min at 3mph on the treadmill for my weightlifting.\n\n\nC25K:\n\nI found a C25K program and it seemed like a good starting point for running instead of walking while tracking progress. The first day (today) I tried doing the 1 min running and 1 min walking, 10 intervals, and I am looking for tips to do better and make sure I don't injure myself through this process.\n\n\nWhy I'm here:\n\nI only got through about 6 intervals of the 1x1, did a mile at a 18:43 time total, which was marginally faster than my walking speed I suppose, but man did it burn on my tibilias anterior and to a lesser extent the tibilias exterior. I tried running speeds of 4, 4.5, and 5 mph and it was definitely my muscles burning that made me stop more than my heart rate or anything. I would not say I experienced any pain, just muscle burning.\n\n\nTL;DR:\n\nDoes anyone have any tips for starting C25K while overweight?\n\nThank you in advance, anyone who got this far.","upvote_ratio":1.0,"created_utc":1677644602.0},{"title":"Returning after injury.","author":"No-Good-6695","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11f5bt5\/returning_after_injury\/","text":"I was silly & picked up an overuse injury adout 5\/6 weeks ago, see here,\nhttps:\/\/www.reddit.com\/r\/C25K\/comments\/10p014v\/dont_push_it\/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button\nIve ran 5 times in the last 12 days, short runs to start to test the ankle, a 7min,a10min,a 20min,a25min & a 30min, l need to do strengthning exercises for my legs ect, when is best to do them? On a rest day or same day? How many times a week? Ankle is very slightly tender after my 30 minute run today i can feel the lower calf tighten a little at about 25 minutes so going to maybe keep the runs at 20-25 minutes for a while until i get a bit stronger, should i take 2 days for recovery between runs? I dont want to mess this up for a second time, 😬, any advice appreciated.\n👍","upvote_ratio":1.0,"created_utc":1677681328.0},{"title":"W6D3 done!!! After 25 minutes I feel so powerful!","author":"Srdjan667","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11ee2hi\/w6d3_done_after_25_minutes_i_feel_so_powerful\/","text":"&#x200B;\n\nhttps:\/\/preview.redd.it\/sesdosfcpyka1.jpg?width=1080&format=pjpg&auto=webp&v=enabled&s=8754865ecce423e13bb50416125c07b22b51fae2","upvote_ratio":0.99,"created_utc":1677604405.0},{"title":"[WEEKLY THREAD] RANT WEDNESDAYS","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11ezxp0\/weekly_thread_rant_wednesdays\/","text":"Things that make you go !@#$%&","upvote_ratio":1.0,"created_utc":1677664939.0},{"title":"Pain in the sides of leg","author":"Powernap30","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11exqn6\/pain_in_the_sides_of_leg\/","text":"I am in Week 3 currently. I feel pain the outer side of calves during the walk intervals after the runs. I do not feel much pain during the run. The pain almost vanishes after 15 minutes of my run. I bicycle 1 mile to my run park so I get enough warm up. I am also taking alternative day rest.\n\nHow do I address this issue?","upvote_ratio":1.0,"created_utc":1677656592.0},{"title":"Last Call! - Garmin\/Spartan Racer Research Study!","author":"GabeHernandez_Ollin","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11exph4\/last_call_garminspartan_racer_research_study\/","text":"Data collection for my research study on Spartans ends this **Saturday 3\/4 at 11:59 pm PST!** Thank you so much if you've already participated or spread the word, but if you are eligible and haven't gotten a chance then there is still time! **Just be sure to include a screenshot from your race data** in the Garmin connect app to be eligible (video instructions link in the survey itself) for a chance to enter the raffle for 1 of 8 free races!\n\nMy name is Gabe Hernandez and I’m a grad student at Cal State Long Beach in my last semester of my M.S. in Athletic Training degree. For my thesis\/research project I’ve been conducting a study on Spartan racers who used a Garmin smartwatch in the last 5 years to record their race data. By entering so you can opt-in for a raffle for a free Spartan race in 2023! While this may not be directly applicable to your interests in this subreddit page, I hope that this is able to reach a wider audience so that I may use this data to publish an official article after I graduate and represent the obstacle course racing community in scientific literature. If you’re interested the link for the survey is in my bio, or if you would like more info feel free to DM me. The link is listed below and you can also scan the QR code in this flier!\n\n[https:\/\/csulb.qualtrics.com\/jfe\/form\/SV\\_cYGrm3AoElbzR1s](https:\/\/csulb.qualtrics.com\/jfe\/form\/SV_cYGrm3AoElbzR1s)\n\n\\*\\*Just to be clear I have been given permission to post this by the moderator team for educational purposes only. This post is in no way an advertisement for my university, Spartan Race, or affiliated with this subreddit.\\*\\*\n\nThanks so much for your time and have a great day!\n\nGabe Hernandez, CSCS, SGX\n\nAROO!\n\nhttps:\/\/preview.redd.it\/ur2i145h03la1.png?width=1080&format=png&auto=webp&v=enabled&s=930a06d4441d68d07d5e572b1b11420236c4d3c5","upvote_ratio":0.5,"created_utc":1677656463.0},{"title":"Week 3 Day 2… DONE","author":"thatgirllissalou","url":"https:\/\/i.redd.it\/8wlmcoksnvka1.jpg","text":"","upvote_ratio":0.98,"created_utc":1677549449.0},{"title":"New to the Group","author":"WoodyMejias1","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11em0dy\/new_to_the_group\/","text":"I’m new to the group and I’m trying to get into a better routine when it comes to running. Anyone here have any suggestions on how to start off and plans or programs that you are all doing to work on running more distance running, pace, speed training.","upvote_ratio":0.4,"created_utc":1677623207.0},{"title":"Completed W5D3 (ran for 25 minutes)!!!","author":"fastforward89","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11duobl\/completed_w5d3_ran_for_25_minutes\/","text":"I was a little worried I wouldn’t be able to run for 20 minutes nonstop. I made a new playlist last night and included songs I was excited to listen to. I’ve read from a lot of people on here that what stops most is mostly a mental block and I completely believe it. My partner said something that made me believe in myself and I wanted to share. The program wouldn’t have us complete this exercise if we aren’t capable of doing it. They also want us to succeed and wouldn’t set us up for failure. This really helped me to get over the mental block. I not only ran the 20 minutes but decided to see if I could push a little farther. I ran for 25 minutes nonstop!! I am so proud of myself. When I first started C25k, I couldn’t even complete the first exercise. It CAN be done! Can’t wait to run my first 5k next month!","upvote_ratio":0.93,"created_utc":1677552139.0},{"title":"I'm Interested In Doing C25K, But I'm 60lb Overweight,scared, And Overwhelmed [Seeking Advice And Motivation]","author":"Worried_in_the_Bay","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11dwvul\/im_interested_in_doing_c25k_but_im_60lb\/","text":"As the title says. I'm 31 and mostly unfit. I do strength train, but even with that it's intermittent because I can't commit to a regular workout schedule.\n\nBut I'm still interested in doing to C25K programme because it's a bucket list item, but also because I want to improve my cardiovascular system and such.\n\nI've downloaded an app (Just Run) and I've had it on my phone for a few weeks because I'm nervous about running.\n\nI live in a suburb with no sidewalks and while there is a park you still Jane to cross many roads. How do you deal with traffic stops and waiting on a C25K where the goal is to move non-stop? How do you deal with running when you don't have sidewalks? How do you deal with running when the local park starts turning off its lights around 8:30pm leaving you in the pitch black?\n\nHow do you stay motivated?\n\nHow do you even do the programme? I've heard so many variants from repeating runs you've failed until them to just going to the next run no matter what.\n\nTL;DR: scared, unfit noob asking for advice and help. And am on mobile, so I can't tag a flair.","upvote_ratio":1.0,"created_utc":1677558746.0},{"title":"W4D2 today was much harder than W4D1 a couple of days ago. I almost gave up two mins into the first 5 min run but I managed to push through and complete it - just!","author":"chubbagrubb","url":"https:\/\/www.reddit.com\/gallery\/11dh2l4","text":"","upvote_ratio":1.0,"created_utc":1677518024.0},{"title":"Path to 5K","author":"parboiledpotatoes","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11dca4s\/path_to_5k\/","text":"Will be running my first ever 5k (actually my first ever athletic event of any kind) in May. Still a long way to go and lots to improve, but happy with the progress so far. Most importantly, I feel great!\n\n[Link to dashboard](https:\/\/public.tableau.com\/views\/5kJourney\/Dashboard1?:language=en-US&publish=yes&:display_count=n&:origin=viz_share_link)\n\n&#x200B;\n\n&#x200B;\n\nhttps:\/\/preview.redd.it\/47yat29xjqka1.png?width=514&format=png&auto=webp&v=enabled&s=c7fcda3f0932f729f8e926244ab33ece996c8fb1","upvote_ratio":1.0,"created_utc":1677505752.0},{"title":"Last run of the program complete! Not close to 5k yet but we’ll get there.","author":"HalfOk4038","url":"https:\/\/i.redd.it\/91mnxq10qpka1.jpg","text":"","upvote_ratio":0.98,"created_utc":1677477551.0},{"title":"It’s my birthday tomorrow and will complete w9w1. My almost 39 yo self is actually looking forward to it. Happy Monday, all.","author":"Hot-Bat-5042","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11d27ze\/its_my_birthday_tomorrow_and_will_complete_w9w1\/","text":"","upvote_ratio":1.0,"created_utc":1677470726.0},{"title":"Should I run a 5k or 30 minutes?","author":"SubstantialDeer1","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11dg66j\/should_i_run_a_5k_or_30_minutes\/","text":"I finished week 8 run 3 and am due for week 9 run 1. The problem is I can already run a 5k. My last run was 28:04 and it was 5.12k. What's the plan for tonight?","upvote_ratio":0.84,"created_utc":1677515823.0},{"title":"Finally managed a 5k! 🥳","author":"misterbifford","url":"https:\/\/i.redd.it\/oz7byjhizmka1.png","text":"","upvote_ratio":0.99,"created_utc":1677444427.0},{"title":"Starting again","author":"Narfrili","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11d9n6g\/starting_again\/","text":"I, like many I imagine first completed C25K successfully during COVID. I was the healthiest I have ever been, but now back to square one lol.\nI have completed week 1 again this, and have been doing it with my wife who has not run before.\nI am getting on well, but my wife is really struggling with calf pain - after about 2 minutes of running she is finding it unbearable.\n\nAny tips? We both really want to keep it up! I know she is concerned that she is holding me back but I want to be able to support her to complete it too for the first time, and get that brilliant feeling of completing the program! \n\nThanks","upvote_ratio":1.0,"created_utc":1677497396.0},{"title":"Restarted but outside posts","author":"lildorado","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11d5ok4\/restarted_but_outside_posts\/","text":"Is there a reason people declare that they’re restarting outside? I run on a treadmill because my vision isn’t great and I’m more confident on the treadmill, plus I add a 1-2 incline to build the stress, which is what online recommendations were, but why are people changing? What am I missing?","upvote_ratio":0.83,"created_utc":1677482552.0},{"title":"W5D3 - Completed!","author":"Prime-Sloth","url":"https:\/\/www.reddit.com\/gallery\/11cyehz","text":"","upvote_ratio":1.0,"created_utc":1677459559.0},{"title":"Week 2 Day 1 - was nervous but it was the best run so far!","author":"tea_bird","url":"https:\/\/i.imgur.com\/lCockty.jpg","text":"","upvote_ratio":0.88,"created_utc":1677450353.0},{"title":"Restarting C25K but outside this time!- W4D2 (repeat) - after failing on Friday was feeling a little nervous about this run but was able to complete it entirely! And it was cold and windy AF. Bonus pic of post run squirrel feeding at the park!","author":"yuyithemermaid","url":"https:\/\/www.reddit.com\/gallery\/11chmh2","text":"","upvote_ratio":0.99,"created_utc":1677419427.0},{"title":"did my first 3k","author":"Gragra37","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11clm5a\/did_my_first_3k\/","text":"","upvote_ratio":1.0,"created_utc":1677429301.0},{"title":"Shin pains after 3 mins of running","author":"itmose","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11d108d\/shin_pains_after_3_mins_of_running\/","text":"I need some advice! I just completed W5D1 tonight and I’ve had the problem for the past week where, every run, about 3 minutes into the 5 minute run segment, the fronts of my shins start hurting. I do stretch a bit before running but maybe not enough if I’m having this problem. \n\nI’m trying to figure out the problem. Do you think I’m running funny, like landing on my feet oddly etc? Am I just not stretching enough\/the right muscles? I could use all the help I can get. I’m very new to running and I’m just doing my best. \n\nThanks in advance for suggestions!","upvote_ratio":0.91,"created_utc":1677467084.0},{"title":"Should I push myself to try to run a 10k in May?","author":"chaosbeess","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11cvyhw\/should_i_push_myself_to_try_to_run_a_10k_in_may\/","text":"I'm on W8D2 of C25K and last run I continued to 30mins and hit 4k. I hope at the projected end date (march 8) I'll run to 5k regardless of time. I signed up for a 5k on May 14th. I'm confident that I'll be able to do that since it's over 2 months away but I worry that I'll get bored of trying to get faster 5ks and if I move onto training for a 10k that the 5k will feel \"easy\" or like I'm not challenging myself enough. But i wonder if it's enough time for me to comfortably get to 10k. The time limit for the 10k is 90 minutes so I'd need to be able to do that. Despite having practically no prior cardio experience i feel like things have been going pretty well so far. I've definitely been pushing myself the last few runs but never into the feeling bad territory. What do you guys think?","upvote_ratio":1.0,"created_utc":1677453279.0},{"title":"C25k Long Covid - recovery. Was nervous about the jump from week 3 to week 4 but weirdly I found W4D1 easier than W3D3? Got a migraine straight after though so I need to be careful not to push too hard and cause a symptom relapse for myself","author":"chubbagrubb","url":"https:\/\/www.reddit.com\/gallery\/11cjar9","text":"","upvote_ratio":1.0,"created_utc":1677423711.0},{"title":"First sub 25 minute 5k!","author":"EULA-Reader","url":"https:\/\/i.imgur.com\/t7aJnqB.jpg","text":"","upvote_ratio":1.0,"created_utc":1677447127.0},{"title":"[WEEKLY THREAD] MORONIC MONDAYS","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11d879x\/weekly_thread_moronic_mondays\/","text":"Don't be embarrassed. We all have questions sometimes.\n\nAnd yes, you need to do your rest day between runs.","upvote_ratio":1.0,"created_utc":1677492140.0},{"title":"Going to start?","author":"WebFinancial8650","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11cszmp\/going_to_start\/","text":"So I've been looking to start this. The only real question is I am a big guy 315#. Should I focus more on meal prep and losing some weight before starting to run? I have ran in the past but at that time I was 240#. Guess I am just apprehensive of beating the crap out of my knees now that I'm closer to 40 then 30. Ha","upvote_ratio":1.0,"created_utc":1677446251.0},{"title":"Critique my running form? All advice and tips welcome","author":"AdTough2337","url":"https:\/\/v.redd.it\/xbetc2yfnmka1","text":"","upvote_ratio":0.93,"created_utc":1677440370.0},{"title":"Beginning runner HR","author":"PTcreeper","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11ctmlk\/beginning_runner_hr\/","text":"So during my 5 min warm up walk my HR goes up to 100-120. As soon as I begin a very light jog at slow pace my HR jumps up to 180 and I get up to 200 in 4-5 min. Is there anything I can do to prevent my HR from going so high because I know this isn't the zone I want to be training at or is it just going to take time time to build my fitness before that improves? It would be harder for me to jog at much of a slower pace to prevent the jump in HR.","upvote_ratio":0.81,"created_utc":1677447736.0},{"title":"Tender (not painful) shins - do I take a break?","author":"QuietusReddit","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11culmh\/tender_not_painful_shins_do_i_take_a_break\/","text":"Just finished Week 6, Day 2. Was a bit tougher than W5D3 but managed to get through it.\n\nHave been conscious since the beginning of running on my toes\/mid-foot to avoid shin splints from the get go. After runs though, I still end up feeling some tenderness on my shins (mostly just right leg) when I rub the area. Sometimes, it's a bit of a tingly feeling. Never really any pain, but I worry this is the start of something that ends up hurting if I keep running.\n\nShould I take a longer break (more than 1-2 days)? Would prefer not to because I usually lose motivation pretty quick and the last 6 weeks have been really consistent for me up to this point. But if it's between that and the risk of shin splints, obviously I'll take the break.\n\nGuess the question is - is tenderness and tingling around the shins after a run normal since I'm super new with weak legs or a sign of bad form and possible injury?","upvote_ratio":1.0,"created_utc":1677450023.0},{"title":"W7D3 done. couldn't run for 20 seconds two months ago. Thank you All for the motivation.","author":"Qasid96","url":"https:\/\/i.redd.it\/gxeamnm41ika1.png","text":"","upvote_ratio":0.99,"created_utc":1677384438.0},{"title":"Failed week 5 run 3, feeling super disappointed 😩😩😩","author":"ketoandkpop","url":"\/r\/couchto5k\/comments\/11cg8hh\/failed_week_5_run_3_feeling_super_disappointed\/","text":"","upvote_ratio":1.0,"created_utc":1677419125.0},{"title":"Week 7-9","author":"spudbrain321","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11csfp7\/week_79\/","text":"Over the past year I’ve decided to get myself fit. I started walking around the block, added and added till I was doing about 10 miles a week. Graduated to c25k but started on week 2 as I felt I had the fitness level to start there. I’ve followed the program up to the last run on week 6, 25 min run. Well I felt ok so carried on for the 30 mins, felt ok with no problems including the following day. So if I do this another couple of days (30 mins ) am I done ? If so I’d have done it in 5 weeks, not bad for someone who weighed more than 20 stone a year ago !","upvote_ratio":0.5,"created_utc":1677444980.0},{"title":"Failed twice","author":"crazyquoter","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11ccrrr\/failed_twice\/","text":"So I think I began running last September, with no previous experience at any sort of sports. In the pandemic I had gained huge amount of weight for me from 56 or something (not measured but guessing) to 65 kgs at 5'4 something. I didn't mind it essentially I never thought I was looking fat, just chubby. In the meanwhile I reread 'What I talk about,when I talk about running' and I always though running was one sport\/physical activity I can get behind. \n\nSo after few random walks, I decided to follow C25K and I reached to Week 5 day 2, but I just couldn't do day 3. I got bummed out and left it since I was also having breathing issues in the winter weather. \n\nAfter a month or so I decided to start again and reached till week 4, but I was somehow finding it harder. I think I lost all my progress and had to also stop the program because I had to do a fair bit of traveling.\n\nIn the meanwhile I have lost weight. I now weigh 53.85kg I run on and off sometimes, with no set time intervals and that does make me feel good. But I am keen to run 5k and even longer distances but I am turned off by the idea  what if I start the program again and I wound up not being able to run a set interval, it would turn me off running altogether.\n\nAny advice would be helpful.If anyone has dealt with anything similar please advice.","upvote_ratio":0.88,"created_utc":1677407941.0},{"title":"Week 1 DONE!","author":"tea_bird","url":"https:\/\/imgur.com\/kdvmpoi","text":"","upvote_ratio":0.81,"created_utc":1677335937.0},{"title":"W8D3 Complete. What next?","author":"broke_fit_dad","url":"https:\/\/www.reddit.com\/gallery\/11bry34","text":"","upvote_ratio":0.93,"created_utc":1677349736.0},{"title":"W2, Run 3 completed yesterday! For some reason was harder than previous runs.","author":"blueberrywaffles3","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11bnt7i\/w2_run_3_completed_yesterday_for_some_reason_was\/","text":"I managed to do it, but for some reason it just felt more difficult. I don’t necessarily feel like I’m getting any better or gaining stamina, so that’s a little discouraging but I will stick with it!\nLooking forward to week 3!","upvote_ratio":1.0,"created_utc":1677339431.0},{"title":"W8 D3 - I can't believe it, I actually did it! 10K is next!","author":"Putrid-Television-22","url":"https:\/\/i.redd.it\/wa85px1ow9ka1.png","text":"","upvote_ratio":1.0,"created_utc":1677286083.0},{"title":"W6D3 - my second 20(+) mins run","author":"I_say_nicethings","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11bfh48\/w6d3_my_second_20_mins_run\/","text":"First run was [last week](\/r\/C25K\/comments\/115a1ts\/w5d3_my_first_20_mins_run\/).\n\nToday was my [22 mins run](https:\/\/i.imgur.com\/CeS75rX.jpg).\n\nJust six weeks ago was feeling like I was going to puke after 1 min intervals.\n\n> \"From here on out there are no more walking breaks\"\n\nHere we go.\n\n&nbsp;\n\n**If I can do it - you can do it.**\n\nSee you at 5K.","upvote_ratio":0.97,"created_utc":1677311629.0},{"title":"I did a thing! I somehow managed to complete the program and I am beaming!!","author":"mrwouperz","url":"https:\/\/i.redd.it\/bexkfqgb88ka1.jpg","text":"","upvote_ratio":0.99,"created_utc":1677265786.0},{"title":"W3D1 Complete 🎉. Not the prettiest, but the DONEst!","author":"thatgirllissalou","url":"https:\/\/i.redd.it\/5eqipjnhn9ka1.jpg","text":"","upvote_ratio":1.0,"created_utc":1677282994.0},{"title":"Accidental first ever 5K","author":"traineethrowaway123","url":"https:\/\/i.redd.it\/rti3jogm09ka1.jpg","text":"I’ve recently started using a running app in the background on top of the c25k app, to keep track of the distance and pace. Last night, shortly before finishing my w6d3 run, I suddenly heard “4 kilometres” and decided to just keep going. Hit the 5K and, surprisingly, had loads of energy left. Might not be much, but I’d always been crap at distance running so this is a huge milestone for me.","upvote_ratio":0.89,"created_utc":1677275305.0},{"title":"Restarting C25K but outside this time! - W4D2 - it’s been 3 days since W4D1 because life happened but managed to get out there today! I ended up walking halfway through one of the 3 minute intervals so I don’t consider today a success but not going to let that get me down. Will try again on Sunday!","author":"yuyithemermaid","url":"https:\/\/www.reddit.com\/gallery\/11arcd1","text":"I can tell improvements in my overall fitness levels just in everyday life as I live in a big city so walking is a must and it’s amazing the differences you can feel just from a few weeks. I also had an interview this morning which I felt like went really well so hoping for some good news next week. Hope everyone has had a good week and can enjoy the weekend!","upvote_ratio":1.0,"created_utc":1677245134.0},{"title":"I didn't skip today.","author":"poultrey_wolf","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11asrqx\/i_didnt_skip_today\/","text":"I didn't skip today. W2D2. I really wanted to just sleep and skip today but I got up and completed my workout ask planned!!","upvote_ratio":0.96,"created_utc":1677249127.0},{"title":"W5R3 - I did it!","author":"Elden_Cock_Ring","url":"https:\/\/i.imgur.com\/x5DpqHh.jpg","text":"I did it! 20 min of running in W5 in one go! I honestly was not sure if I would be able to finish it. I never just ran for 20 min. I made sure to take it slow and just make it to the finish.\n\nThe \"autopilot\" didn't kick in like it sometimes does on my runs when I just zone out and my body starts running on its own - very zen. Maybe it will happen next time.\n\nSuper proud of this and had to share it with my fellow C25Kers!","upvote_ratio":0.92,"created_utc":1677245795.0},{"title":"I finally finished the program!","author":"classroomslight23","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11adwzn\/i_finally_finished_the_program\/","text":"I have started and restarted over so many years never fully commuting and yesterday I finished the program. I still can’t believe I was able to run so far without stopping. I’m looking forward to getting my pace up now and then moving onto longer distances.","upvote_ratio":1.0,"created_utc":1677199504.0},{"title":"Ohh boy W5D3 tomorrow!","author":"FFJesse10","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11aypjn\/ohh_boy_w5d3_tomorrow\/","text":"W5D3 tomorrow! Which is the 2 mile jog. The two 8 minute runs today were still on the easier side. Focusing on form and breathing. Kinda nervous for the 2 miles tomorrow!","upvote_ratio":1.0,"created_utc":1677264321.0},{"title":"First race - enough time to improve pace?","author":"oakdown","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11b0cr4\/first_race_enough_time_to_improve_pace\/","text":"Hey everyone! This is about C210K as opposed to 5K but I've seen a couple similar posts, so hope this is alright.\n\nAfter a few failed attempts over the past couple of years I'm back on the C210K plan and have just finished week 7 of 14. I've signed up to the Edinburgh Marathon Festival 10K in May as motivation, but i'm a little concerned about getting my speed up in time. \n\nCurrent sustainable pace for me is around 8:34\/km (although my 5k PB was at a 7:30\/km pace last year) which takes me right up against the cutoff for the event. \n\nWithout any repeat runs I should finish the program with about 4 weeks to go until the race - is that enough time to improve my pace? Getting swept on the day would be crushing, especially considering I'm doing it to raise money for charity, but I want to go in with reasonable expectations. Any tips or advice would also be much appreciated. Thanks!","upvote_ratio":1.0,"created_utc":1677268448.0},{"title":"Plans","author":"WoodyMejias1","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11azicu\/plans\/","text":"New to the group and looking for some plans or methods to increase my run time. I know the typical saying it just go run, but I’m looking for more concrete ways. I want to be able to do longer runs and then increase speed better mile times. Any advice ?","upvote_ratio":0.5,"created_utc":1677266310.0},{"title":"Post C25K Plan","author":"heine19","url":"https:\/\/i.redd.it\/tqefqycz24ka1.jpg","text":"","upvote_ratio":0.87,"created_utc":1677215563.0},{"title":"[WEEKLY THREAD] FEATS OF FRIDAY","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11anuti\/weekly_thread_feats_of_friday\/","text":"Let's brag a little. What did you accomplish this week?","upvote_ratio":1.0,"created_utc":1677232939.0},{"title":"Joint pain and possible solutions?","author":"surfghost","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11arn1i\/joint_pain_and_possible_solutions\/","text":"Hey all! I just finished w7d2 a few days ago, and I'm starting to run into a few issues. My original issue when I started c25k was not having the endurance to run for over a few minutes, but my body was holding up really well. Now that I've gotten to the 7th week with longer runs, my endurance has greatly improved, but my body is taking longer and longer to recover. Ankle, knee, and hip joints are taking multiple days to calm down, and it's putting a real damper on the progress. I'm a 31y\/o male, not overweight, running on a pretty nice treadmill with dampeners. Picked up what I thought was a good pair of under armor running shoes. I'm not quite sure what I can do besides taking multiple day rests to avoid injury. I do have relatively flat feet. Should I maybe look for a pair of shoes that can help counter that? Soul inserts? Yoga? Strength training? Anything helps! Thankyou! Sorry for the format, on mobile.","upvote_ratio":0.66,"created_utc":1677246024.0},{"title":"C25K where should i start?","author":"chatimex","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11afhw8\/c25k_where_should_i_start\/","text":"Hi C25k,  \n\n\nI just started running after a few years break and was quite interested in C25K.\n\nI was able to complete two 5k's (see photos) and was wondering if I should start the C25K from W1D1 or if there is a more appropriate week to start at based on my current ability? Any advice at all is welcome :)\n\nThe two 5k's did involve walking the time splits were: 22:49 running \/ 13:19 walking and 20:42 running \/ 18:07 walking.\n\n  \nThank you for any advice you can provide!  \n\n\nhttps:\/\/preview.redd.it\/eqrz0z0rm1ka1.jpg?width=1080&format=pjpg&auto=webp&v=enabled&s=d9fbd3ef9339ac59ce2fe63d6f29ff8a5049935e\n\nhttps:\/\/preview.redd.it\/pce9s21rm1ka1.jpg?width=1080&format=pjpg&auto=webp&v=enabled&s=a53d646575788f69f98c6c945ff175160725d376\n\nhttps:\/\/preview.redd.it\/uni1d41rm1ka1.jpg?width=1080&format=pjpg&auto=webp&v=enabled&s=65ba3a899fbbe0405d50e92c4ef84fd66f510aa0\n\nhttps:\/\/preview.redd.it\/6o6cg21rm1ka1.jpg?width=1080&format=pjpg&auto=webp&v=enabled&s=6cdb8670d0c3b2693db1bea54b792b386963007f","upvote_ratio":0.86,"created_utc":1677204002.0},{"title":"W9D2 - proud to have gotten this far, but feeling significantly worse after each run than I used to?","author":"misterbifford","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/119ug2b\/w9d2_proud_to_have_gotten_this_far_but_feeling\/","text":"When I first started the C25k programme I would return from each run feeling really energised, and usually crack straight on with the washing up or whatever task I'd been putting off. I'd really come to look forward to the positive difference running made to my mood and productivity.\n\nSince W8 onwards I've been noticing a real difference after runs - I'm exhausted, just want to lie down for the rest of the day, insatiably hungry, and mood feels quite low. I was just wondering if anyone else has experienced something similar as the runs get longer? Perhaps I'm pushing myself a bit too hard? I still feel great whilst I'm running, it's just the after effect that's changed.\n\nI've only got one run left and am hoping to move on to a 5k to 10k programme next, but I'm worried this issue is sapping my motivation a bit! Any help\/advice welcome - thanks ☺️","upvote_ratio":0.98,"created_utc":1677147927.0},{"title":"Completed w6d3 and a question about the rest of the program","author":"Runningpolygon","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/119z863\/completed_w6d3_and_a_question_about_the_rest_of\/","text":"I ran 25 minutes today which is nice albeit slower than usual. The question I have is that i have been following this gtn program up till here.\n\n[https:\/\/playsportsnetwork.com\/wp-content\/uploads\/2020\/07\/5K-Plan.pdf](https:\/\/playsportsnetwork.com\/wp-content\/uploads\/2020\/07\/5K-Plan.pdf)\n\nHowever this program has walk intervals in week 7 and 8 as well whereas the other c25k programs i have seen have uninterrupted running for weeks 7,8 and then 9.\n\nwhich program do you think looks better going forward? Pros and cons etc.\n\nthanks","upvote_ratio":0.86,"created_utc":1677163028.0},{"title":"NHS Podcasts - Laura's songs tempo","author":"tupisac","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11a2bth\/nhs_podcasts_lauras_songs_tempo\/","text":"I've just switched from the app to NHS podcasts in the middle of W3. \n\nFeels like songs tempos are all over the place. With some I struggle to get the rhythm and breathing right. \n\nWere the songs chosen to keep the best pace for different runs and progress with the cadence across the whole program, or is it all just random?","upvote_ratio":1.0,"created_utc":1677170856.0},{"title":"Was able to run 18 minutes after week 1","author":"shelovesmath","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/119pws4\/was_able_to_run_18_minutes_after_week_1\/","text":"Hi everyone! So I started C25K last week, and on W1D3 I actually just ran the entire 18 minutes between the warm up and cool down. I didn’t go very fast, between 4.5-5.5 on a treadmill. I did walk 10K steps regularly for a few months before I started, but could it possibly be bad for me to run so long without having practiced running before? I’m sort of shocked I was even able to. I put on a really good playlist and it flew by. Thanks so much!","upvote_ratio":0.89,"created_utc":1677131216.0},{"title":"I’m probably injured but need stretching tips","author":"SammyScrammy","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/119rs3o\/im_probably_injured_but_need_stretching_tips\/","text":"Hey folks, I’m on week 8 at the moment, which is seeing me run 25 mins and I’m next due to run for 30 mins straight!\nHowever, I’ve had to slow it up as I’ve suddenly had pain while running in my hips. It started in my quads but that seems to have healed after a two-day break and now I feel rather stiff before and after a run. The pain in my hips is quite bad when I run - I probably should go to a physio… I know.\nAre there particular stretches people recommend for legs\/hips? I have googled them but I would like to follow something consistently if people have any tips.\nI assume I’ll also have to work on getting stronger through strength training as I am putting to much strain through my hips. Does anyone have advice on that too? I do follow a plan but wonder if there’s something particular I should target.\nTIA!","upvote_ratio":1.0,"created_utc":1677137655.0},{"title":"That's it, I'm done!","author":"Healthy-Painter-3770","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/1190r44\/thats_it_im_done\/","text":"Today, I graduated! I'm so happy to be one of those C25k success stories that I've read about daily since December!\n\nIn Feb 2022 I decided I wanted to run, and I downloaded a C25k app and did week 1, possibly week 2, I can't quite remember, then life got in the way. Actually, life didn't, excuses got in the way. I have hit the same difficulties this time round (no childcare, dark mornings, dark evenings, rain, snow, workload, not wanting to be seen, etc etc), but this time I've looked for solutions NOT excuses!\n\nFast forward from \"failure-Feb\" to December, and I was watching Limitless with that Chris guy who plays Thor, and one episode really stuck with me - the fat 50 year old who wanted to loose weight, got on a bike, and now 20 years later he's athletic, cycling thousands of miles, and not suffering from all the ailments most 70 year old have. The secret was apparently endurance sports! I'm not into cycling but I did fancy trying running - again. So Christmas eve I re downloaded the app and off I went!\n\nIt was difficult, I'm mid 30s, no health issues and not overweight, but I was thinking I need to do this now before I start getting to an age where things so slow down 😂 But I plodded along, with one key thing from this sub in my mind \"take it slow\". So I did, and every 2-3 days I did another C25k day. Taking it slow really helped, I didn't have to repeat a day, I didn't not complete a day either. I have juggled this around childcare (on school days I run mid morning after drop off, on holidays I run early doors before people are awake. I hate getting up, it's pitch black, but I must not start making excuses!) I have run in rain (previously used excuse, but turns out I love runs best in the rain!) I've run in snow (discovered that you can run safely on a field where you won't slip!) I've purchased hi viz clothing and lights so I can run in dark evenings or mornings, and I've learnt to be more strict on managing my workload and ensuring my run days are adhered too (OK I work for myself which helps as I'm a kind boss and allow myself time during the 9-5 to run 😂) and I've even run with a head cold (turned out that made me feel much better than a lemsip would've!) \n\nI'm glad I pushed myself to run outside instead of buying a treadmill. We don't really have space, I didn't want to spend the money (more previously used excuses not to run) but I've been amazed at how much it helps mentally to get outside! I've learned to ignore my thoughts on what people might be thinking of me when they see me running, and in fact most people have been friendly and said hello as we passed! If someone passes me, it's fine, I'm no longer embarrassed at my speed, we all have different aims!\n\nI'm excited to continue with my running and I hope excuses never get in the way again. I'm amazed I've come from being exhausted at a 1 minute run, to having energy left after 30 minutes! It isn't a myth people, you really can go from C25k!! 😍","upvote_ratio":0.99,"created_utc":1677075999.0},{"title":"W5D3 :D","author":"sinni0","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/119fqwh\/w5d3_d\/","text":"Hey first time poster in here (but often in reading others advice and stories).\n\nThis is my 3rd time I think attempting c25k (I use the NHS app), I think the furthest I've made it before was end of week 3\/start of week 4. From peeking ahead I thought there was absolutely no way I was going to be able to manage day 3 of week 5, from 5 and 8 minute runs with walking breaks, to a full 20 minutes of straight running? Yeah, no way. But I actually did it was relatively little issues! (and it was my first go at it!) Most proud I've felt of myself so far in this programme :D I kept thinking I might give up on the run, but my breathing was pretty good and I wasn't in any pain (a little discomfort maybe but nothing bad), it was all mental, just had to keep on pushing \\^-\\^","upvote_ratio":0.95,"created_utc":1677104353.0},{"title":"W8D2 done! Does anyone else run on a treadmill and watch running paths on YouTube? It really helped me not get bored!","author":"Hot-Bat-5042","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/119gdwr\/w8d2_done_does_anyone_else_run_on_a_treadmill_and\/","text":"","upvote_ratio":1.0,"created_utc":1677105760.0},{"title":"couple months after graduation still improving.","author":"Silver-Cauliflower89","url":"https:\/\/www.reddit.com\/gallery\/1197u1u","text":"","upvote_ratio":1.0,"created_utc":1677092022.0},{"title":"Is it normal for the same run to suck?","author":"PirateKezmond","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/119aifa\/is_it_normal_for_the_same_run_to_suck\/","text":"Hey all! I'm really new to this and have just finished W1D3 and man...that sucked. I managed W1D1\/2 semi alright but really struggled tonight with the third one. \n\nWould it be worth repeating Week 1 instead of going on to Week 2 do you think? I'm worried that I won't make it and don't want the failed attempt to put me off entirely 😅","upvote_ratio":1.0,"created_utc":1677096290.0},{"title":"Week 2, Run 2 Complete! Ran\/walked 3.1 miles in 37 minutes.","author":"blueberrywaffles3","url":"https:\/\/i.redd.it\/4ctryndleuja1.jpg","text":"","upvote_ratio":0.85,"created_utc":1677098400.0},{"title":"W5R3!!!!","author":"Hellasoundd","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/1190a3m\/w5r3\/","text":"I did it omg!! I tried it a couple weeks ago but I developed shin splints. Today I stretched before heading out and I did it!! I could never imagined in my 31 years alive that I could run for more than 5 minutes but here I am!! I am soooooo proud of myself!","upvote_ratio":0.95,"created_utc":1677075192.0},{"title":"Newbie: W1D1 completed","author":"Head_Anything1177","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/118rn4g\/newbie_w1d1_completed\/","text":"Newbie to running but not to working out. I recently learned about the program and completed Day 1 W1 yesterday. Yayy! I did 20 mns on the treadmill though the program schedule says 30. It’s ok, I liked the progress and liked alternating between walking and running. I just want to share my progress with you because I’ve always been intrigued by running though I never liked it much as I was a slow runner as a kid. I’m trying to focus on progress and kilometers more than speed, as I’m not planning a race atm, but just to stay fit and pump more oxygen to my lungs :)\nI don’t use an app to record my progress, I just follow the schedule on the c25k website. Do you have any app recommendations?\n\nUpdate: completed D2W1, and feeling great already! Thanks for all the feedback with app recommendations and the support :))","upvote_ratio":1.0,"created_utc":1677049720.0},{"title":"W6R1 is a killer","author":"Jomato_Soup","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/118ylq6\/w6r1_is_a_killer\/","text":"Thought this would a good run, an “easy” run. I mean, last week I ran for 20 mins so a 5\/8\/5 split is a “walk” in the park. \n\nWrong. \n\nI pushed too hard on my first run. Had to stop and walk at minute 6 of my 8 minute run and again half way through the last 5 minute run. \n\nI did achieve my fastest time! But also a lesson on my limits. Bring on w6r2!","upvote_ratio":1.0,"created_utc":1677072264.0},{"title":"What free app do you recommend for 10km training?","author":"zirkel37","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/119hydo\/what_free_app_do_you_recommend_for_10km_training\/","text":"I’m about to finish C25K of zen labs. I clicked on the training for 10K and I saw that the 10K version is paid. Any suggestion for a free version? The C25K worked really really well for me","upvote_ratio":0.99,"created_utc":1677109372.0},{"title":"Safety Tips Every Runner Should Know","author":"C25KMGUY","url":"https:\/\/www.couchto5km.com\/running-safety-tips-everyone-should-know\/","text":"","upvote_ratio":0.67,"created_utc":1677093729.0},{"title":"W1D1 - first running workout of my life at 34","author":"tea_bird","url":"https:\/\/i.imgur.com\/3XZdmJq.jpg","text":"","upvote_ratio":0.98,"created_utc":1676987305.0},{"title":"w4d1. I don't know if I'm capable of finishing","author":"Phallenpheather","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/118iemb\/w4d1_i_dont_know_if_im_capable_of_finishing\/","text":"I barely survived. I cheated and took longer rest walks between circuits, and I still barely made it. My lungs burned and my calves were on absolute fire\n\nThis is the real first time I feel like I'm not gonna make it, friends","upvote_ratio":0.96,"created_utc":1677021684.0},{"title":"My 1st 5K : Running & Workout plan","author":"Nekrah_","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/118vv0q\/my_1st_5k_running_workout_plan\/","text":"Hi all,\n\nI have started training for my first 5K race, and i would like your insight on the training plan i created.\n\nTo start with, i am a relatively fit 37yo male and i have been going to the gym (weights) for the past years on\/off and playing Basketball weekly lately.\n\nMy first goal is to finish the 5k race first and then target a sub-30mins time if possible.\n\nDue to the nature of my day2day life, work and life in a big city, it is easier for me to start training in the gym\/treadmill before transitioning outdoors to train running.\n\nI also do not want to stop hitting the gym \/ weight lifting, so i figured i could merge a C25K sort of program with a full body workout, 3 times a week.\n\n&#x200B;\n\n\\- Is weight training a good complimentary method or is general cross-training preferred?\n\n\\- Is this a good training plan for preparation ?\n\n\\- Every Sunday i play basketball for 1.5hours so that would also be considered as a 4th training day\n\n\\- Is this a viable training program to achieve my goals? I am currently at week 1 and i am feeling alright but perhaps this will change in week 3 :P \n\n\\- The actual race has a bit of an incline, ranging from 0 to 2 to 3.5 at times, so in the running program i would replicate that during the race simulation. \n\n&#x200B;\n\n**Running training**\n\n**Week 1**   \nWorkout 1: 2 x 1.5 miles @ 6mph 2-5 min recovery between intervals  \nWorkout 2: 4 x .25 miles @ 6.5mph w\/ 2 min walk recovery  \nWorkout 3: 2 x 2 mi at 4.9mph \n\n**Week 2**  \nWorkout 1: 6 x .25 miles @ 6.5mph 2 min walk recovery btwn each. 5 min recovery then 1 mile @ 6mph  \nWorkout 2: 1 x 2 miles at 6mph with 2 min rest  \nWorkout 3: 3 – 4 miles 4.9 mph \n\n**Week 3**   \nWorkout 1: 3 x 1 miles at 6mph with 2 min rest  \nWorkout 2: 1 mile at 6mph pace, 1 min rest; 1 x 0.5 mile at 6.5mph, walk 4 min, 4 x 1 minute at 6.9mph, walk 2 min rest  \nWorkout 3: 5k race simulation \n\n**Week 4**   \nWorkout 1: 30 min 6mph  \nWorkout 2: 4 x 1 min at 6.9mph (walk 2min), 2 x 0.5mile 6.5mph walk 4 min  \nWorkout 3: Race. \n\n&#x200B;\n\n**Full body workout** \n\n**Day 1** \n\nBench Press \n\nBarbell Squat \n\nBarbell Bent Over Row\n\nDumbbell Side Raises \n\nBarbell Bicep Curls \n\nTricep Rope Pulldown \n\n**Day 2** \n\nIncline Dumbel Press:\n\nRomanian Deadlift\n\nLat Pulldown\n\nSeated Shoulder Press\n\nInclune dumbell Curcl \n\nSeated tricept overhead extension \n\n**Day 3** \n\nCable Chest crossover\n\nLeg Press \n\nSeated cable row\n\nStanding overhead press: \n\nDumbell hammer curl \n\nLying down skullcrushers","upvote_ratio":0.75,"created_utc":1677065484.0},{"title":"Speed or endurance?","author":"IDontHateTheLetterA","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/118syq8\/speed_or_endurance\/","text":"Yesterday was my first day of running. That said, (I hope) I lead an active life. I play tennis, badminton and occasional football (soccer for the Americans).\n\nYesterday, I ran for 10 minutes at 10 km\/h (6.2 mph) covering a distance of a little more than 1.6km (1 mile). So, I was wondering whether this is a good speed to practice at (hoping to eventually increase my distance). Or should I decrease my speed?\n\nPS. This was on a treadmill.","upvote_ratio":0.75,"created_utc":1677054741.0},{"title":"Week 6 Run 2","author":"radox1","url":"https:\/\/v.redd.it\/mltuguye1mja1","text":"Ran a total of 4.25k inc 3 min walk interval.","upvote_ratio":0.95,"created_utc":1676997115.0},{"title":"[WEEKLY THREAD] RANT WEDNESDAYS","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/118ucy6\/weekly_thread_rant_wednesdays\/","text":"Things that make you go !@#$%&","upvote_ratio":1.0,"created_utc":1677060139.0},{"title":"W7D1, Decided I was too hungry, went for the full 5k\/30min run, felt easy enough and recovered just the same as any other day, do you think it's worth running the rest of the course or just continue doing this as if it's week 9? pretty stoked about hitting this so easily though!","author":"Brave_Ad9886","url":"https:\/\/i.redd.it\/xpvgrkha0lja1.jpg","text":"","upvote_ratio":0.94,"created_utc":1676984628.0},{"title":"Incline?","author":"AffectionateBake281","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/118cnwu\/incline\/","text":"For those doing the program on a treadmill, what incline setting (if any) do you use before a run? Does anyone use a higher incline during the walking intervals?","upvote_ratio":1.0,"created_utc":1677004925.0},{"title":"Idk if it's pms, allergies, or I'm just having a day, but my first fail on W5D2.","author":"Christinamh","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/118558r\/idk_if_its_pms_allergies_or_im_just_having_a_day\/","text":"Trying to not let it get me down. I ran about 8 of my 22 minutes total. Just kinda like... Meh about it.","upvote_ratio":0.84,"created_utc":1676990931.0},{"title":"Finally graduated! I am so proud of my mind and body! I gave up for months due to my slow pace but got myself togather and finally completed the program today! What should I do next to reach 5k?","author":"PopGurll","url":"https:\/\/i.redd.it\/r6eef680rfja1.jpg","text":"","upvote_ratio":1.0,"created_utc":1676920972.0},{"title":"W8D1 in the books! I can’t believe I’m already at week 8!","author":"Hot-Bat-5042","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/117r7je\/w8d1_in_the_books_i_cant_believe_im_already_at\/","text":"","upvote_ratio":0.95,"created_utc":1676944307.0},{"title":"W2D1 Finished!","author":"blueberrywaffles3","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/117ra90\/w2d1_finished\/","text":"I was sick over the weekend so it wasn’t as easy as last week, but I completed today without too much trouble! 1.5 miles done in 20 minutes.","upvote_ratio":0.92,"created_utc":1676944522.0},{"title":"Restarting C25K but outside this time! - W4D1 - not going to lie I went into this run expecting to fail but surprised myself and completed the entire run! Absolutely amazed I can run for 5 minutes straight now, feeling proud of myself so bonus selfie ft. my tomato face!","author":"yuyithemermaid","url":"https:\/\/www.reddit.com\/gallery\/11736hh","text":"","upvote_ratio":0.98,"created_utc":1676888137.0},{"title":"Treadmill Running","author":"alnono","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/117nq9c\/treadmill_running\/","text":"Hi folks! \n\nI’ve been doing my C25K on a treadmill. I just completed week 6. I’ve never been much of a runner at all and my cardiac health is terrible so it’s been good for me, and shockingly easier than I expected (though not easy). \n\nWhere I live there aren’t a lot of good times of year to run outside, between ice, rain, and extreme heat and humidity (we just have a lot of terrible weather haha). So treadmills make a lot of sense and I purchased a no-bells one from decathlon. I’m happy with it and I like how being able to measure my exact speed lets me not push too hard and also measurably increase. But I’ve heard that treadmill running is quite a bit easier than outdoor running, so I’m interested in knowing what I’ll need to do to be able to do that on the days I’m able to, as I’d really like to get that fresh air and push myself. \n\nThanks!","upvote_ratio":0.88,"created_utc":1676934825.0},{"title":"When you’ve barely finished a week, and not sure if you can do the next week… Do you repeat the previous week or attempt the new week until you complete it?","author":"callme_rabh","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/117ri1c\/when_youve_barely_finished_a_week_and_not_sure_if\/","text":"","upvote_ratio":1.0,"created_utc":1676945153.0},{"title":"question... I am in the middle of c210k after doing c25k, but have just tested positive for covid. I feel well and am asymptomatic. I am able to rub in places where I will not see anyone else. would it be OK to still do my run days?","author":"somelittlepumpkins","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/117vje4\/question_i_am_in_the_middle_of_c210k_after_doing\/","text":"Run 🤣🤣\n\n[View Poll](https:\/\/www.reddit.com\/poll\/117vje4)","upvote_ratio":0.75,"created_utc":1676957408.0},{"title":"It stays with you forever","author":"soupzYT","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/1174uzv\/it_stays_with_you_forever\/","text":"I did c25k during 2020 lockdown because I couldn’t run more than a minute before then. Sadly through a number of injuries and commitments and laziness I didn’t run for over a year from October 2021. Tried to get back into it a month ago and ran 6k without stopping. After about 15 months off. It was as if I hadn’t taken a break at all.\n\nPoint of this post is, if you’re still undertaking the journey I can attest that by finishing it, you’ll gain a skill that’ll be very difficult to lose. Even beyond the ability to run a 5k, I often jog from place to place now just to get there a little earlier, and just because I can. Good luck x\n\nEdit\nSeems like everyone disagrees. Oops","upvote_ratio":0.88,"created_utc":1676894370.0},{"title":"What should I do once I've finished C25K?","author":"kingo15","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/117bban\/what_should_i_do_once_ive_finished_c25k\/","text":"I've completed couch to 5k a few times but will always stop the running upon completion. \n\nI did 30 minutes on a treadmill this morning and realised that I'm only actually reaching about 4.6km in distance due to slow jogging. My question for you is - as a next step, should I try to jog for longer to reach the 5k, or should I try to jog faster to reach 5k in 30 mins?","upvote_ratio":1.0,"created_utc":1676909004.0},{"title":"W2D1 Complete","author":"Badbrittyx","url":"https:\/\/i.redd.it\/prfisep3sdja1.jpg","text":"Forced a run this morning before my doctor appointment!","upvote_ratio":1.0,"created_utc":1676897126.0},{"title":"W5D3 - REPEAT DAY OR WEEK?","author":"Prime-Sloth","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/117gf0d\/w5d3_repeat_day_or_week\/","text":"Looking for thoughts if I should repeat this day or the whole week altogether.\n\nGoing into this run I already sensed I wouldn't make it but went out there to give it my best shot.\n\nI completed W5D2 on Friday with the plan of doing W5D3 on Sunday. However Saturday I recorded 16,500 steps on my watch (city walking) and had sore calves Sunday. I used a massage gun to help relieve the pain for the day and decided today (Monday) was the day. My calves were tight this morning, however, I'm not trying to push over 2 days of rest in between runs in order to maintain consistency.\n\nI completed the first 10 min nonstop with a 4 min break. and stopped 1-2 min after continuing in the attempt to prevent injury.\n\n&#x200B;\n\nInformation that may help:\n\n\\-Running pace: 7:30\/km Rough average. (Statistic from Google Fit not sure how\/if this translates to KM\/H\/MPH)\n\n\\-Hydrated before the run. (Also run with a camel pack)\n\n\\-Possibly developing a sickness - Shortness of breath was apparent within the first minute of the run, however, was able to normalize breathing and stopped due to calf pain.\n\n\\-Normally start a run between 4-7 pm.  Today I started just after noon.\n\n\\-To the last point, I've only eaten a bowl of oatmeal whereas I usually run before eating dinner.\n\n\\-Training outside for a midday 5k in April.\n\n\\-Stretching isn't part of my routine. (Bad habits die hard, and the massage gun is my attempt to avoid stretching)\n\n\\-Will be buying a foam roller for my calves.\n\n&#x200B;\n\nMy apologies as my writing can be all over the place.\n\n&#x200B;\n\nEdit:\n\nI am using the C25K app from Zen Labs Fitness \n\nI didn't upload my screenshots correctly. ([https:\/\/postimg.cc\/gallery\/KYPdsht](https:\/\/postimg.cc\/gallery\/KYPdsht))","upvote_ratio":1.0,"created_utc":1676917508.0},{"title":"… but I didn’t die… W2D2, that was rough!","author":"thatgirllissalou","url":"https:\/\/i.redd.it\/iqdtke9y18ja1.jpg","text":"","upvote_ratio":0.96,"created_utc":1676827797.0},{"title":"You can do tough things","author":"MenorahJones8","url":"https:\/\/i.redd.it\/rttp4jkvv8ja1.jpg","text":"I’ve been a LONG time lurker in this sub. I am often inspired by every post, every check in, every accomplishment. When I began my C25K journey, I struggled with self doubt, unfair comparison, and imposter syndrome. I would tear myself down for not being small enough, fast enough, or tough enough. This one is for every runner that feels the same way. This one is for those of us whom are unfairly hard on ourselves. This one is for the runner who will beat themselves up for not meeting a specific pace. This one is for those that don’t fit into the societal mold of what an athlete looks like. Keep on going! Keep on showing up for yourself even when you’re doubting your abilities! Keep on keeping on! Celebrate the highs and lows that come with every new run week. You can do this! You can do tough things.","upvote_ratio":0.93,"created_utc":1676837860.0},{"title":"Just finished W3D1","author":"EmbarrassedCredit892","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/116tbw5\/just_finished_w3d1\/","text":"And man, it was so much easier\/better than W2! In fact, I had to stop after W2D1 and repeat the first week just to make sure I had enough endurance to grit through. Today was easy and TONS of fun. Maybe it's easier pushing through 4 running segments, maybe it's better because the 3 minute runs are JUST long enough for a good song... who knows. Either way, I'm pumped for days 2 and 3.","upvote_ratio":0.94,"created_utc":1676854261.0},{"title":"Took a week off between W4D3 and W5D1, but I got through the 8 min segment somehow. Bonus: lol at this gps confused about me being on a treadmill.","author":"Christinamh","url":"https:\/\/imgur.com\/afySzDt.jpg","text":"","upvote_ratio":0.88,"created_utc":1676866285.0},{"title":"W2D2 done","author":"Legal-Big5760","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/116t43i\/w2d2_done\/","text":"It's getting easier. Can't wait to see more progress.","upvote_ratio":1.0,"created_utc":1676853693.0},{"title":"[WEEKLY THREAD] MORONIC MONDAYS","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/1172yzo\/weekly_thread_moronic_mondays\/","text":"Don't be embarrassed. We all have questions sometimes.\n\nAnd yes, you need to do your rest day between runs.","upvote_ratio":0.6,"created_utc":1676887340.0},{"title":"Issues returning to jogging","author":"jdroskell","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/116pw3w\/issues_returning_to_jogging\/","text":"Completed C25k last year,  and was carrying on. Not going to win a medal but doing OK. Pleased with myself.\n\nBut in December I was really ill for a few weeks,  so running was off the table.  Then it was Xmas,  and cold wet weather. More delays in getting neck to running. \n\nI've started running again but after about 3k I get pain down the side of my knee,  and have to hobble home. \n\nI just feel like I'm back at the start again,  and don't know what to do about both the knee pain, and motivation. \n\nI just want to get back to where I was.","upvote_ratio":0.72,"created_utc":1676845574.0},{"title":"check in. finished Feb 1st 23. continuing onto c210k","author":"somelittlepumpkins","url":"https:\/\/i.redd.it\/wkf4w78mp4ja1.jpg","text":"","upvote_ratio":0.96,"created_utc":1676787328.0},{"title":"Should we do workout three times a day or workout everyday for three times in the c25k thread mill version","author":"SpiritedReaction8","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/116soh6\/should_we_do_workout_three_times_a_day_or_workout\/","text":"For each week, should I workout three times or should I workout everyday for three times in c25k and at what speed should I keep the threadmill for walking and running","upvote_ratio":0.5,"created_utc":1676852553.0},{"title":"Should I still continue W3 or jump to W4? Alternatively, how flexible is C25K?","author":"Tetizeraz","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/116agmy\/should_i_still_continue_w3_or_jump_to_w4\/","text":"[I'm using this as a reference](http:\/\/www.c25k.com\/c25k_treadmill.html), and I run around 6.0 - 6.5 km\/h on a treadmill with little to no elevation.\n\nI've been working on C25K for a while, starting with week -1. But when I started W2, I thought I was supposed to do 6 laps of 2 minutes and 30 seconds, not six (and one lap of 1:30 minutes). \n\nI don't feel anything particularly bad, it's actually the best part of my day, I'm just really worried about starting to feeling pain.\n\nW3 seems easy compared to what I'm currently doing, though, with two 3 minutes runs, while W4 has two 5 minutes runs. I can try, I am just not expecting to have enough breath to sustain a 5 minutes run.\n\nI asked in the title how \"flexible\" the program is, or if anyone tried anything different like I did, even if by accident. I was thinking of doing 4 laps of 3 minute runs, and then start W4 normally.\n\nThanks for any help!","upvote_ratio":0.88,"created_utc":1676813775.0},{"title":"Restarting C25K but outside this time - W3D3 done! Had a later start than usual today but I still got out there and did the thing! So happy to have finished week 3 but nervous about starting W4 next week but onwards we must go. Have a great weekend and see you all on Monday!","author":"yuyithemermaid","url":"https:\/\/www.reddit.com\/gallery\/115g3az","text":"","upvote_ratio":0.98,"created_utc":1676729227.0},{"title":"Running c25k with back or neck problems?","author":"Admirable_Candy2025","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11676bg\/running_c25k_with_back_or_neck_problems\/","text":"I haven’t run since October as have had so many injuries and illnesses over the winter. I had completed c25k and was running regularly. Just starting up c25k again today (run 1 week 1 done!). \nWonder if anyone else running with back or neck problems? I’ve had mine years, degeneration and bulging discs. All I see online says running is bad for disc problems but I always feel better than ever when I run. It’s not like I’m running marathons or anything. Just 5k trail running. How do others get on?","upvote_ratio":0.75,"created_utc":1676802153.0},{"title":"W5D3 done! Dropping to only 2 segments of 8+8 was hard but the cold kind of helped","author":"sourboysam","url":"https:\/\/i.redd.it\/6hf42a5v70ja1.jpg","text":"","upvote_ratio":1.0,"created_utc":1676732931.0},{"title":"Started week 7 & hit an unusual snag","author":"Elsie-pop","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/115w7nt\/started_week_7_hit_an_unusual_snag\/","text":"UK based- does anyone have any pointers for places to buy cheap running leggings?\n\n I've worn out the inner thigh of all of my cheap Asda own brand normal clothes leggings and the chafing at the holes tells me that I should not be buying these for running again.","upvote_ratio":1.0,"created_utc":1676765214.0},{"title":"W3D1 vs W3D3. my cardio endurance and recovery has been remarkable!!! I'm so proud of how strong my body is getting","author":"Phallenpheather","url":"https:\/\/www.reddit.com\/gallery\/115nbme","text":"","upvote_ratio":1.0,"created_utc":1676748802.0},{"title":"W7W3 completed!","author":"Hot-Bat-5042","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/115niar\/w7w3_completed\/","text":"","upvote_ratio":0.97,"created_utc":1676749070.0},{"title":"Running doesn’t seem to be getting easier","author":"No-Literature-5250","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/115ezb8\/running_doesnt_seem_to_be_getting_easier\/","text":"I’m currently on week 3 and it doesn’t feel any easier than when I started. I’m going as slow as I possibly can, you can probably walk faster than my pace (14 min mile) and I still feel like I’m dying at the end of the run. I’m okay for the first 2 or 3 intervals and then I can’t sustain any conversation after that. Am I just not made for running?","upvote_ratio":0.97,"created_utc":1676725804.0},{"title":"W5D3 - my first 20 mins run","author":"I_say_nicethings","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/115a1ts\/w5d3_my_first_20_mins_run\/","text":"45 M here.\n\nLong time smoker (still smoking at least 1 pack\/day).\n\nOverweight, by any BMI scale.\n\nSedentary, with a desk job.\n\nWith a messy sleeping schedule.\n\nNever did cardio in my life.\n\n&nbsp;\n\nStarted C25K a month ago.\n\nToday, I just finished W5D3 - and did [my first 20 mins run ever](https:\/\/i.imgur.com\/cy6jA1w.jpg)\n\n&nbsp;\n\nI don't know who needs to read this, but I'm here to let you know this:\n\n&nbsp;\n\nIf I can do it\n\n#You can do it\n\nSee you at 5K.","upvote_ratio":1.0,"created_utc":1676706528.0},{"title":"W1D1: I was not able to complete 8\/8 jogs","author":"Kind_Cow7817","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/115kuul\/w1d1_i_was_not_able_to_complete_88_jogs\/","text":"Background: 26 yo, last asthma attack was 2019, super sedentary life until oct 2022. Decided to work on my physical health by starting to walk outside 3 to 4x a week (6-10k steps goal). Now I plan on joining fun runs, currently targetting to train for 5km category.\n\nI started C25k a few hours ago but I was only able to do 5\/8 jogs. I felt bad that I had to walk the remaining 3 jogging sets.\n\n1st to 3rd jog I was doing fine, on my 4th I felt a warm-to-hot sensation in the lower part of my left leg (where it meets the ankle) and in the front shin of my right leg (https:\/\/imgur.io\/a\/gRGO1tm). On my 5th run, it felt very heavy to jog but I was able to finish the whole minute. On the 6th - 8th I had to walk because I was really feeling the pain in the parts that I mentioned.\n\nMy speed was around 3.3 - 5.0 km\/h (jogging), im at 4.5 - 4.9 km\/h when walking. (Tell me if it is a normal jogging pace for beginner or im just bad)\n\nI have no problem walking 10km at a steady pace so I was surprised that I had difficulty even on the simple jog. I am pretty sure that I was not catching my breath but it was just painful for me to jog, i dont know if that make sense.\n\nCan I get some beginner tips? Does the burning sensation just go away the more I stick to jogging? \n\nIm still going to continue the rest of the program as I want to develop my running life. I just want to do it with everyone's insights.","upvote_ratio":0.86,"created_utc":1676742450.0},{"title":"Stuck on this. First time only got to 10min on the first run (day before my period). Today got 13min on the first run. Both times was able to do the second run section. Trying again after a rest day but running during period is not fun","author":"Federal-Progress-365","url":"https:\/\/i.redd.it\/lvlblkqntzia1.jpg","text":"","upvote_ratio":1.0,"created_utc":1676728152.0},{"title":"NOT A 5K, I did my first one in 37:18 but wanted to improve my pace so chose to do a run with distance as the goal instead of time and just completed my fastest 3k. C25K works... alright ig 😁","author":"Steelarm2001","url":"https:\/\/i.imgur.com\/FdNW7Gw.png","text":"","upvote_ratio":0.96,"created_utc":1676706702.0},{"title":"W1D2, finding out that I actually CAN run!","author":"blueberrywaffles3","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/114ox58\/w1d2_finding_out_that_i_actually_can_run\/","text":"I’m so proud of myself. I completed W1D2, run\/walking 2.5 miles in 30 minutes! \nI realize now that I can definitely do a 5k, especially considering I have 10 weeks to train!! I feel so much better about it now. I’ll report back with how W1D3 goes today!","upvote_ratio":0.98,"created_utc":1676648318.0},{"title":"W1D3 done! Feeling really good! I just have to build up my stamina.","author":"blueberrywaffles3","url":"https:\/\/i.redd.it\/wfl0hh66guia1.jpg","text":"","upvote_ratio":0.86,"created_utc":1676663083.0},{"title":"Completed a 20 minute run!","author":"Runningpolygon","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/114lek2\/completed_a_20_minute_run\/","text":"Just ran 20 minutes without stopping it went surprisingly ok. \n\nI’ve improvised the program a little against advice and skipped a week in the beginning because i felt capable of skipping, however i also felt that the jump from w5d2 to w5d3 was too big so i added an extra session of 12 minutes running then walking and then 8 minutes running 2 days ago.\n\none observation so far is that before this run, my dominant leg used to get tired while my other leg and breathing was fine so that is what held me back. I think I was running too “upright” and also I made short quick steps with my dominant foot and long slow ones with my other foot. This run I tried to focus on advice I've seen online about leaning forward and letting yourself “fall forward” while also running slower and more deliberately making sure both my feet were stepping similarly. And it seems to work, my calf felt much better after the run compared to before.","upvote_ratio":0.97,"created_utc":1676643396.0},{"title":"F*ck you, Week 5","author":"spunkybumdust","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/114n7ox\/fck_you_week_5\/","text":"I've had no trouble with the first 4 weeks at all but the difficulty jump from 4 to 5 is insane for me. I've tried the first 2 days of Week 5 but each time I tapped out a couple of minutes before the end of the second run and had to walk the rest. Was just about to head out and do Day 3 but it looks even harder again. Should I attempt it and then do the whole Week 5 over again next week if I fail, or should I redo one or both of the first 2 Week 5 days before attempting Day 3?   \n\n\nEvery other week has started out just slightly beyond what's comfortable (but not too hard), but then been easy by the third day. This week is just a bastard.","upvote_ratio":1.0,"created_utc":1676645974.0},{"title":"Just graduated! Gave the first mile a hard run then slowed up. Felt excellent.","author":"LazyBoyD","url":"https:\/\/i.redd.it\/e62u7zb1eoia1.jpg","text":"","upvote_ratio":0.99,"created_utc":1676589723.0},{"title":"Anyone Here Ran C25K With Their Partner?","author":"Prestigious_Quarter5","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/114eevk\/anyone_here_ran_c25k_with_their_partner\/","text":"Was it a good experience or it distracted you from the overall thing?","upvote_ratio":0.9,"created_utc":1676622231.0},{"title":"Restarting running after battling with long covid for three years. Had a setback after another infection flared all my symptoms but just completed Week 3! Tired today but feeling good 😊","author":"chubbagrubb","url":"https:\/\/www.reddit.com\/gallery\/113qign","text":"","upvote_ratio":0.97,"created_utc":1676553735.0},{"title":"Restarting C25K but outside this time! - W3D2 - mentally didn’t want to go for a run today but got myself out the door. The 3 minute running intervals are not easy but they’re doable! And to think 2 1\/5 weeks ago I could barely run for 1 minute straight without feeling like I was going to die.","author":"yuyithemermaid","url":"https:\/\/www.reddit.com\/gallery\/113q5ji","text":"Been really struggling with my mental health lately and sometimes it takes everything in me just to get out the door but I’m glad I made it today. Apart of what helps me is posting here because I feel it holds me accountable. So thank you to this community for existing and how supportive everyone is over here. It’s much appreciated.","upvote_ratio":0.99,"created_utc":1676552659.0},{"title":"[WEEKLY THREAD] FEATS OF FRIDAY","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/114fu96\/weekly_thread_feats_of_friday\/","text":"Let's brag a little. What did you accomplish this week?","upvote_ratio":1.0,"created_utc":1676628102.0},{"title":"Running while feeling tired?","author":"Federal-Progress-365","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/1146cov\/running_while_feeling_tired\/","text":"I got my period this evening and was planning on doing my run tomorrow am. However, currently body feels so exhausted and can’t imagine having enough energy to run tmr. \n\nIs it worth taking another rest day? Or push through?","upvote_ratio":0.81,"created_utc":1676595212.0},{"title":"W2D3 was a bit tough, though not because of the running. Need to make some upgrades to my running kit, ear warmers already ordered.","author":"BodyPuppeteer","url":"https:\/\/i.imgur.com\/GgfOHYD.jpg","text":"","upvote_ratio":0.9,"created_utc":1676581510.0},{"title":"Been I’ll, suspected Covid but was nice to be back running this week after a rest and passing week 5!","author":"Eriol_Mits","url":"https:\/\/i.redd.it\/vsg5b2i53nia1.jpg","text":"","upvote_ratio":0.92,"created_utc":1676573956.0},{"title":"Trying to beat anxiety\/ppd W1D1","author":"pocketfullofshrimps","url":"https:\/\/i.redd.it\/pxr5pniabhia1.jpg","text":"I’m 10 months postpartum, and been struggling with agoraphobia\/general anxiety to leave the house without my husband.  I finally accomplished going on W1D1 with my baby in the stroller with me. Wanting to do this for him is a big motivation to do things despite my anxiety. Thanks for reading ☺️","upvote_ratio":0.99,"created_utc":1676504052.0},{"title":"Trying to improve my mental and physical health, and lose weight. Really enjoyed today and can’t wait for the next session!!","author":"Careless_Orchid","url":"https:\/\/i.redd.it\/tebu7245kiia1.jpg","text":"","upvote_ratio":0.97,"created_utc":1676519137.0},{"title":"W5D2 A bit far into it but this is my 4th try without completing (finished in the past). Rain couldn't stop me today though","author":"sourboysam","url":"https:\/\/i.redd.it\/iz6r82m04iia1.jpg","text":"","upvote_ratio":1.0,"created_utc":1676513713.0},{"title":"W3D2 running cadence","author":null,"url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/113tazm\/w3d2_running_cadence\/","text":"Ive failed W3 D2 after playing with my cadence a bit. I am curious about what my cadence should be. I used to run with a cadence of 150 but Ive read somewhere beginner cadence is 160-165. When I run with a cadence of 160 my pace is 4:00\/km but I get tired so much I can't complete my 3 min run. What should I do?","upvote_ratio":1.0,"created_utc":1676561562.0},{"title":"Best way to try and prevent \"stitches\"? That's what we call them in the UK anyway!","author":"maybeillcatchfire22","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/113lb94\/best_way_to_try_and_prevent_stitches_thats_what\/","text":"A stitch feels like a tight muscle cramp. From Dr Google it seems there is no sure evidence as to what it is or how to prevent.. just wondered if anyone has any tips or does it stop when we get a bit fitter?","upvote_ratio":1.0,"created_utc":1676534229.0},{"title":"I completed w7w2 today. Definitely getting more relaxed and somewhat less obsessed with many minutes I have left. Slowing down truly helped, but I’m kind of disappointed with my speed.","author":"Hot-Bat-5042","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/113g43l\/i_completed_w7w2_today_definitely_getting_more\/","text":"","upvote_ratio":1.0,"created_utc":1676515951.0},{"title":"W2D1 complete!","author":"thatgirllissalou","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/113fsz4\/w2d1_complete\/","text":"Phew!! When you last ran years ago... I didn't even realize the challenge and accomplishment this would be! But YAY, another run done!!!","upvote_ratio":1.0,"created_utc":1676515012.0},{"title":"Proud of myself 😊","author":"queenlymajesty","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/1130o8l\/proud_of_myself\/","text":"I've just finished week 3, run 2. I know I'm not even a third of the way there, but as someone who used to struggle to run for 30 seconds without getting out of breath, I can't believe it's actually working! I'm finding Laura really motivational and I'm getting all these lovely endorphins.\n\nI used to go to the gym and I've tried all sorts of exercise, but none has felt quite as 'freeing' as running. \n\nThe hardest part is definitely starting a new week, and motivating myself to go out when I'm tired\/busy and it's cold or wet outside, but I never regret it once I've finished a run.\n\nDoes anyone have any useful tips for week 4 onwards?","upvote_ratio":1.0,"created_utc":1676475091.0},{"title":"Absolutely have to pay for C25K?","author":"Acenterforants333","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/1133v6w\/absolutely_have_to_pay_for_c25k\/","text":"I just finished week 2 day 1 and the app told me I had to sign up for their paid membership to continue. I did this program years ago and never paid. Do I have no choice? Are there any actually free full c25k apps?","upvote_ratio":1.0,"created_utc":1676483089.0},{"title":"W1D2 Complete! I decided to test myself and run a few more intervals. I ran 2.5 miles in 30 minutes! I’m proud of myself.","author":"blueberrywaffles3","url":"https:\/\/i.redd.it\/xp24r91yrgia1.jpg","text":"","upvote_ratio":0.9,"created_utc":1676497545.0},{"title":"Self Love is W5D3 on Valentine’s Day.","author":"DeathBecomesHerrrrrr","url":"https:\/\/i.redd.it\/7865nybttbia1.jpg","text":"","upvote_ratio":1.0,"created_utc":1676437639.0},{"title":"Week 5, day 3... didn't feel that bad!","author":"Propupperpetter","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/112idjq\/week_5_day_3_didnt_feel_that_bad\/","text":"I'm not one to post on this thread, instead lurking and taking it all in from everyone else's posts... \n\nBut I'm pretty proud of myself- I just finished the week 5, day 3 workout of 20 consecutive minutes... And it wasn't that bad!\n\nI ran cross country in high school in addition to playing two other sports... Sedentary life during and after college\/graduate school, 2 babies later, getting back into running has been a very humbling, mental experience. I for sure thought that I could never do 20 consecutive minutes... But if I can, anyone can! \n\nKeep going, we've got this!","upvote_ratio":1.0,"created_utc":1676414494.0},{"title":"Finished W8D3 in a cyclone!","author":"username-fatigue","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/112dtvp\/finished_w8d3_in_a_cyclone\/","text":"This morning I finished Week 8 Day 3! Went out and ran for 30 minutes, despite being in the middle of a cyclone.  Pretty proud of myself! \n\nOnly went 4.6kms though, had I realised how close I was to 5kms I would have just kept at it. On Friday I will!","upvote_ratio":0.98,"created_utc":1676402841.0},{"title":"Restarting C25K but outside this time! - W3D1 done! Was honestly a little nervous for the 3 minute running intervals but proud to say I was able to do them! And the 1.5 minute running intervals felt like a breeze. Happy that I can tell I’m making progress compared to W1D1.","author":"yuyithemermaid","url":"https:\/\/www.reddit.com\/gallery\/1123d58","text":"Was eager to get out today to complete my run just because I wanted to see if I could do it and surprised myself that I did. I’m even noticing that my recovery time after the running intervals feels faster\/easier. Really enjoying running outside so far and definitely recommend anyone thinking about doing it to just do it! The first week I was nervous about people judging me\/what they thought but now it really doesn’t even cross my mind. Honestly, who cares what anyone else has to say\/think about someone else working on themselves, the only person that matters is yourself.","upvote_ratio":0.99,"created_utc":1676374874.0},{"title":"Heart rate question","author":"kiwi_hunter","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/112q4ec\/heart_rate_question\/","text":"I am currently up to the 25 minute runs and learning that my heart rate should be in zone 3. I am 30 years old and using the 220-30 formula my maximum heart rate should be 190. I normally run at about 168 and feel good, I can hold a conversation at this rate. I also feel like I can't run much slower.\n\n\nDo I need to try get my heart rate lower or should I not worry about it?","upvote_ratio":1.0,"created_utc":1676437759.0},{"title":"Feeling like a cheat \/ rant","author":"BlueBlueberries_12","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/112vwdb\/feeling_like_a_cheat_rant\/","text":"So I have been running C25k since January. I had done it before last year in August in preparation for 10k race in the autumn(finished but was really slow) and since I hadn’t run since the race in October I restarted the plan but only ran 1x each different workout(i.e. 1st week was 1xweek 1, 1xweek2, 1xweek3) and all was well.\n\nI finally got up to the 20min continuous run, which I couldn’t finish so then my plan was to go back a week, repeat the full week with all workouts and try again. I ended up getting covid and didn’t run for two weeks. \n\nYesterday, I went back to running, did 5mins and it felt ok so I ran 20min more. But where I feel like a cheat a little bit is that I usually run on the hilly trails nearby, where as this time I did run full 20mins but it was in our garden, which is reasonable area, but obviously a lot of turning and also completely flat… It was so easy compared to what I felt before getting unwell. \n\nNow I’m thinking it wasn’t really an achievement as it was just in the garden and not sure if it’s even same effort. We live in a valley so the gps data on the 20mins is completely useless 😩","upvote_ratio":0.5,"created_utc":1676460555.0},{"title":"C25K Beginner: Legs burning like satan is cookin' up a meal","author":"lemonsorbetstan","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/112lkt2\/c25k_beginner_legs_burning_like_satan_is_cookin\/","text":"Hi folks!\n\n&#x200B;\n\nI've recently started the C25K program, and am currently on the end of week 2.\n\nRecently on my runs, I've experienced this intense burning sensation on my lower leg -- just above the ankle (Achilles) and up to lower portion of my calf. It's not a sharp pain, but burns quite badly. To the point that cardio-wise, I'm finding the intervals a breeze so far (heat-rate is fine), but THE PAIN. I find myself watching the timer, desperate for the burning to stop.\n\nSome information about me:\n\n* I'm 26F, 5'3'' and about 70 kilos (lower end of overweight on the BMI scale)\n* [These](https:\/\/www.rebelsport.com.au\/p\/new-balance-fresh-foam-roav-v2-womens-running-shoes-black-white-us-7.5-61456404.html?gclid=CjwKCAiAlp2fBhBPEiwA2Q10D-ODt1qYy65mg6NG6Vq6SKkH5ErOKpgJk1i6ih5ZRY9WMNKkGs81zxoCgpEQAvD_BwE&gclsrc=aw.ds) are the shoes I wear\n* I get the same pain whether I'm running on grass or cement (a fairly flat track with some inclines)\n* I've been sedentary for YEARS with little to no muscle \n* I've looked at \"running posture\" and cadence. I've tried speeding up, slowing down, sticking my hips out, looking towards the horizon, walking for longer, etc. Same pain.\n* I could definitely stretch a bit more\n* After a day's break, I'm pretty much back to normal, with some lingering soreness throughout my whole leg, but this feels more like general muscle fatigue. \n\nBack when I was 18 I could jog (albeit slowly) almost 6k, and never encountered pain like this. I know it could just be a result of my being slightly overweight \/ no muscle \/ generally unfit, but I suppose I wanted to see if any of you had any tips to mitigate pain and\/or assurance that this is normal and that I'll be able to push through it eventually. Because as it stands, I think I'm cardio-ready to push into next week, but don't think I'll be able to run for the longer periods with the burning calf thing.\n\nAny advice\/thoughts\/queries are welcome!","upvote_ratio":1.0,"created_utc":1676423160.0},{"title":"Have run in a month & a half since I was dealing with heath issues and intense, residual anxiety. Started this Valentine’s Day with some self-care and self-love. ❤️ I didn’t think I’d be able to do a mile after a break that long, but I did it!! I feel so good.","author":"MugwumpWizard","url":"https:\/\/i.redd.it\/6vzvo1l6v7ia1.jpg","text":"","upvote_ratio":0.98,"created_utc":1676389672.0},{"title":"[WEEKLY THREAD] RANT WEDNESDAYS","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/112uk0u\/weekly_thread_rant_wednesdays\/","text":"Things that make you go !@#$%&","upvote_ratio":1.0,"created_utc":1676455302.0},{"title":"W3D2! I'm making this harder on myself","author":"Phallenpheather","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/112eic5\/w3d2_im_making_this_harder_on_myself\/","text":"I barely survived W3D1. Like, barely. \n\nI slowed it down for W3D2. I'm nursing a neck injury and sometimes my shoulders will hurt if I strain myself too much,  so I broke and lowered my speed. I set my treadmill to 5mph, but when I \"ran\" today, I kept it between 4.2-4.5mph. \n\nSlowing down was exactly what I needed to do.  I feel like I can do this now! I honestly considered if \"running\" was for me after my horrible W3D1 experience, but I'm so ready to keep going","upvote_ratio":1.0,"created_utc":1676404572.0},{"title":"My third time around","author":"limeblast","url":"https:\/\/i.redd.it\/z0r6u14gc8ia1.jpg","text":"I’ve completed c25k twice in the past 8 years or so.\n\nThe first lead to a regular running practice which lasted a 18 months or so, until I fell out of the habit. The second was in the lead up to my wedding and helped me lose some weight. \n\nIt’s now been at least a year and a half since I’ve done any running, so I figured it was time to get back into it.","upvote_ratio":0.95,"created_utc":1676395478.0},{"title":"Finished W1D1, doing a 5K in April. Any Advice?","author":"blueberrywaffles3","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/1123wty\/finished_w1d1_doing_a_5k_in_april_any_advice\/","text":"Hey! I’m a college student [19F] who is in decent shape. I used to work out fairly often but I haven’t hit the gym in months. I think my baseline of fitness is okay, but my cardio endurance is pretty crappy. I’ve always been bad at running but last spring I started training, and I got to a point where I could run 2 miles which I was really proud of. \n\nTo get back into it, I’ve challenged myself to run a 5k, so I started C25k. I completed the run\/walk intervals, running at 5.6 mph and walking at 4 mph. On the rest days I will be doing strength workouts. \n\nFirst day wasn’t too bad, I definitely could’ve gone longer, but I’m excited to see how this goes! Any advice for a beginner like me? Anything to make sure I stick with it?","upvote_ratio":0.77,"created_utc":1676376709.0},{"title":"Week 2, Day 1 complete.","author":"MLuka-author","url":"https:\/\/i.redd.it\/nko4zm7w44ia1.jpg","text":"After 2 year hiatus due to health issues. I find that C25k a great trainer so far.","upvote_ratio":1.0,"created_utc":1676344510.0},{"title":"Week 4, day 1 done! This is the furthest I’ve gotten with this program so far. (5th attempt!)","author":"melting_muddy_pony","url":"https:\/\/i.redd.it\/fhjybfm1r0ia1.jpg","text":"My pace is slow, my legs are burning but I’m doing it. Started leg strength training too and I hope it’s helping. Probably going to repeat week four but that’s okay because I have the time to take it slowly and what’s more important is the routine of getting out there and out of bed\/off the couch.","upvote_ratio":0.96,"created_utc":1676303533.0},{"title":"Completed C25K, Unsure what to do next","author":"marcoroman3","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/111f49c\/completed_c25k_unsure_what_to_do_next\/","text":"I've been just running for 30 minutes or 5k for the past few weeks, but I miss working towards a goal. I'm considering either the \"5k improver\" or the 5 to 10k program. The improver program intimidates me a little, because I'm uncertain about trying to go fast, but the 10k requires more time which will be challenging.\n\nDoes anyone have any experience with either of these? Other recommendations are also welcome.","upvote_ratio":1.0,"created_utc":1676310277.0},{"title":"Time for Week 5 Run 3 again","author":"radox1","url":"https:\/\/www.reddit.com\/gallery\/1119tlx","text":"After having a sore ankle for a few weeks I've gone back to week 5 Run 3.\n\nAfter no running for nearly a month it wasn't as easy as I would have liked 😄","upvote_ratio":0.96,"created_utc":1676298628.0},{"title":"1st day back","author":"No-Good-6695","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/111gua2\/1st_day_back\/","text":"Finished c25k & ran five 5k's 4 weeks ago, over done it and got an ankle injury, Today was my first run since, & it felt good to get out there again, even though i only ran for 7 minutes, no pain but i felt it tighten up slighty, after about 5 minutes, rest of me felt ok to keep going, but thought i would listen to my body this time, 5 hours later & no pain or tightness 🙂, just very slighty tender. So was thinking of just running every other day, no set time just for as long as the foot lets, slowly 1 day at a time 🤞 & just try and add a little more as & when it feels ok & hopefully eventually get back to where i was, aiming to start c25k at week 6 as soon as i can run 20 minutes a few times 🙂","upvote_ratio":0.93,"created_utc":1676314561.0},{"title":"5k and beyond…","author":"artofuchi","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/111tq79\/5k_and_beyond\/","text":"Those of you who completed c25k and then continued to 10k…was it easier\/harder? How long did it take you to get to running 10k?","upvote_ratio":1.0,"created_utc":1676348814.0},{"title":"I don’t know how to improve. I’m getting discouraged.","author":"SeaMonsterInTraining","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/111h2d0\/i_dont_know_how_to_improve_im_getting_discouraged\/","text":"I started  c25k in October and finished the program. I didn’t run for about a month after that. But then I got back into it and have been consistent for about 6 weeks now. I started using the Nike Run Club 5k program. And have 3 weeks left in that. I’m starting to get really discouraged and I don’t know why. \n\nSo I’m 5’6” about 210lbs. I started all this to help lose weight and get active but I found out I just really like running. In October week 1 had me winded and my heart rate was going to high but i slowed down and was “running” at 3.5 mph. I can walk that speed if wanted. Finished prgram. Was super elated that I could run 30 minutes without dying but it was still real tough. I started Nike Run Club 5k and it seems much harder but I’ve been keeping up. I can’t fathom running a mile as a warm up to a run but whatever. Now I can run 5k much easier but it takes so freaking long. It takes me 53 minutes. My heart rate is still a challenge. Like at 170 I can still talk and breathe fine but everyone says it means I need to slow down. I can’t slow down anymore or I’ll be crawling! How do I improve? I know they say run more but with the plan I’m doing it has me around 10 or 12 miles a week. 2 recovery runs, 2 speed runs, 1 long run and 2 rest days. After this plan should I just do the 5k few times a week? Should I do another plan? Should I go back to c25k and go faster on the run parts and my slow jog on walk parts? I need help.","upvote_ratio":1.0,"created_utc":1676315099.0},{"title":"Getting back on the horse after a year long hiatus due to new job. Week 5 complete!","author":"Nicoyas","url":"https:\/\/i.redd.it\/jg5uj86uttha1.jpg","text":"","upvote_ratio":0.98,"created_utc":1676219725.0},{"title":"What do you listen to?","author":"jimmy-jaime","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/111lx5g\/what_do_you_listen_to\/","text":"Hi everyone! I completed c25k last week, but I still want to keep running. I find I have the most difficulty with finding something to listen to. The spotify “upbeat” playlists got old, I’m now getting sick of military running cadences, and I don’t want to listen to the same high tempo songs over and over again. Do y’all have any recs??","upvote_ratio":1.0,"created_utc":1676327016.0},{"title":"WK4 D1, super slow pace but this is the farthest I’ve gotten with this app so far! (5th attempt)","author":"melting_muddy_pony","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/111c9ti\/wk4_d1_super_slow_pace_but_this_is_the_farthest\/","text":"My pace is slow, my legs are burning but I’m doing it. Started leg strength training too and I hope it’s helping. Probably going to repeat week four but that’s okay because I have the time to take it slowly and what’s more important is the routine of getting out there and out of bed\/off the couch.","upvote_ratio":1.0,"created_utc":1676303210.0},{"title":"Is something wrong with my shoe?","author":"whiskeypie101","url":"\/r\/RunningShoeGeeks\/comments\/111bvj9\/is_something_wrong_with_my_shoe\/","text":"","upvote_ratio":1.0,"created_utc":1676302231.0},{"title":"Routine for Gluteus medius \/ core \/ calves","author":"Hold_Effective","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/11183rc\/routine_for_gluteus_medius_core_calves\/","text":"I've had challenges with plantar fasciitis and lower back pain while running, and I've had a few questions here about my physical therapy routine; I've finally written it down! (reps are what I started with; I add reps \/ time as I progress). I try to do the strength exercises 3 times \/ week.\n\nStrength\n\n* Side plank (kneeling) - leg lift (with resistance band around knees) - 8 reps \/ 3 sets\n* Spider plank - 4 reps each side \/ 2 sets\n* Side step (resistance bands around knees and ankles) - 60 seconds \/ 2 sets\n* Dead bug - 40 seconds \/ 2 sets\n* Single leg bridge lifts - 10 reps each side \/ 3 sets\n* Side leg lifts - against wall (instructions were to do this with a towel on your foot, but I could never get that to work) - 15 reps \/ 2 sets\n* Calf raises - 15 reps \/ 2 sets\n\nWarmup (1 minute each)\n\n* Forward kicks - bent knee\n* Calf raise \/ arm above head\n* Walk outs\n* Knee to chest\n* Forward kicks - straight leg\n\nCooldown\n\n* Foam roller - 1 minute each leg\n* Hip flexor stretch - 30 seconds each leg","upvote_ratio":0.84,"created_utc":1676294504.0},{"title":"W1D1 Done!","author":"Badbrittyx","url":"https:\/\/i.redd.it\/wkggimigwvha1.jpg","text":"Signed up for a 5K right next to my house right at the end of the 8 week program!","upvote_ratio":1.0,"created_utc":1676244820.0},{"title":"After hip bursitis and hysterectomy: W1D1 complete!","author":"nomadic_suburbanite","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/110o5gh\/after_hip_bursitis_and_hysterectomy_w1d1_complete\/","text":"Injury and health issues have taken me out of running for almost two years. Now I’m 6 months post op and starting over. Feels\ngood to be on my feet again! Happy Sunday, all!","upvote_ratio":0.95,"created_utc":1676230539.0},{"title":"[WEEKLY THREAD] MORONIC MONDAYS","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/1114pqh\/weekly_thread_moronic_mondays\/","text":"Don't be embarrassed. We all have questions sometimes.\n\nAnd yes, you need to do your rest day between runs.","upvote_ratio":1.0,"created_utc":1676282502.0},{"title":"On tracking intervals and anxiety","author":"Puzzleheaded-Bet1735","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/1114leh\/on_tracking_intervals_and_anxiety\/","text":"Since the whole \"road to 5k\" is based on interval training, I'm wondering, how do you guys track these walk\/run intervals on your apps? Walking? Running? I keep thinking about it  👏 every 👏 single 👏 run, and it's driving me nuts. It's what keeps my head occupied during my run intervals so I don't think too much about how tired or out-of-breath I am. Are we doing runs with walls in-between? Are we doing walks with runs in-between?\n\nSamsung Health tracks automatically once I'm walking for about 10 minutes, but that's pretty much the time I spend on the warm-up, and then the whole interval thing happens, should I change it to manual and track a run instead? I guess my question is, am I tracking it accurately? \n\n\n*Last minute rant*\nI haven't posted any of my progress on the Weeks as I didn't progress much, been stuck on Week 3 for about a month now (with increments in sets and distance), too afraid to try and move on, and fail (there's a history here).","upvote_ratio":0.67,"created_utc":1676282044.0},{"title":"Questions about the program","author":"Infinite-Emu-1279","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/1110ifq\/questions_about_the_program\/","text":"The week 1 says:\nWorkout 1\nWorkout 2\nWorkout 3 \n\n\nAre these 3 workouts 1 day \n\nOr 1 workout 3 days a week","upvote_ratio":0.5,"created_utc":1676266317.0},{"title":"App advice please","author":"JustAnnabel","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/110vxck\/app_advice_please\/","text":"I’ve been using the NHS podcast but couldn’t get past day 1 of week four and I think it’s the music I hate. I downloaded an interval app so I could listen to my own music but the intervals are 3 minutes and 1 minute and I want to be able to change it. Can anyone recommend a free interval\nTimer, or alternatively, do any of the C2K apps allow you to listen to your own music?","upvote_ratio":0.67,"created_utc":1676251725.0},{"title":"Y’all…..I just ran 20 minutes! LFG!!","author":"remmi91","url":"https:\/\/www.reddit.com\/gallery\/10zryp3","text":"","upvote_ratio":0.99,"created_utc":1676134099.0},{"title":"Hip pain for 3 days?","author":"canolipew","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/110ph3p\/hip_pain_for_3_days\/","text":"I was  jogging everyday for 10 days and doing squats, and it's been 3 days now that my hips area is hurting when I try to stand on each of my leg or walk.\n\nI'm walking as If I have peed myself. \n\nIf I don't do this it hurts really bad.\n\nI don't think much of it but now Im starting to feel concerned. I haven't left my house in 3 days because of it.\n\nHow long should I wait it out?","upvote_ratio":0.33,"created_utc":1676233922.0},{"title":"Still on Week 4 but I wanted to do Run Walk combo and complete the Adidas Virtual 5K today! So proud and tired!","author":"bharat4ever","url":"https:\/\/i.imgur.com\/MDVhAGt.jpg","text":"","upvote_ratio":0.87,"created_utc":1676158736.0},{"title":"I have a couple of questions what's the idea to go back to jog\/walk style run after being able to run for 20 min straight? and running 3.2k(2 miles) in 20 min at 9.6 k\/h isn't that a bit hard? i did at 7.5 and ran for longer to hit the distance","author":"trixvidone","url":"https:\/\/i.redd.it\/g481gcsadqha1.jpg","text":"","upvote_ratio":0.81,"created_utc":1676177843.0},{"title":"Finally getting close! W8D1!","author":"Healthy-Painter-3770","url":"https:\/\/i.redd.it\/64ecjomg1mha1.jpg","text":"I started C25k with one tip that stuck from all the posts in this sub - take it slow! It seemed to be the best way to ensure you finished each day - and finished the entirety with no injuries. We are all on our own unique journey - But that said I couldn't help but feel disheartened at my pace and distance covered when people on earlier stages were sharing pics and being almost at the 5k mark. \nHowever I finally almost hit the 3m mark today (3.1m is 5k iirc) and I felt so excited I had to share with someone! That extra 3 minutes clearly adds some distance as my pace is quite normal! Although I ran somewhere different today which was very flat which helps 😂\nI always include my warm up and cool down walk in my strava results, which could explain the pace, and realistically I'm still a long way from actually running an entire 5k but I know I'll get there, probably just be a long time after I complete the programme 😅","upvote_ratio":0.97,"created_utc":1676125432.0},{"title":"Frustrated feeling like I can’t run this week after a successful week 6","author":"Superstarella61","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10zxpns\/frustrated_feeling_like_i_cant_run_this_week\/","text":"I’ve been jogging casually for about a year but I felt like I wasn’t improving much from running a mile or so at a time a few times a week, so I decided to start c25k. Last week I completed week 6 on the treadmill and actually went further than planned on week 6 day 3. I ran a full 30 minutes at a speed of 5.3 mph on the treadmill. It wasn’t easy mentally and I had to push myself to get through it but I was excited to finish since that’s probably the longest I’ve ever jogged without walking before. But this week, week 7, I haven’t been able to finish each day. Yesterday I ran only half a mile or so before I felt like I couldn’t run any further. I know there a lot of factors that could be at play but I don’t feel like much has changed in my diet, hydration etc. I’m not sure if it’s normal after a year of pretty consistent jogging to still be this bad at it— I’ve considered that I might have asthma because I get out of breathe so easily. For context I am 24f, 5’3 and 130 pounds","upvote_ratio":1.0,"created_utc":1676148963.0},{"title":"W1D1","author":"bluesstarz","url":"https:\/\/www.reddit.com\/gallery\/10z9z4t","text":"Started the C25K program 2 days ago. Still struggling to get through day 1. I’ve never run before. So I’m trying to go as slow as possible and reminding myself to breathe. But I’m still not sure if I will ever love this lol! My shins are hurting but I’m so proud of myself for trying!","upvote_ratio":1.0,"created_utc":1676082746.0},{"title":"How do I keep my heart rate down as the run progresses? I run at a pretty constant slow pace","author":"imouttahere10","url":"https:\/\/www.reddit.com\/gallery\/10zfk27","text":"","upvote_ratio":0.78,"created_utc":1676101900.0},{"title":"W6D3 done! First run outdoors - it was fun but difficult","author":"slowrizard","url":"https:\/\/i.redd.it\/xhoyu2bg7gha1.jpg","text":"","upvote_ratio":1.0,"created_utc":1676054805.0},{"title":"Week 8, Day 1. Feeling confident, what’s a good training plan to achieve 10k?","author":"LazyBoyD","url":"https:\/\/i.redd.it\/6qndxgfr8hha1.jpg","text":"","upvote_ratio":0.94,"created_utc":1676067353.0},{"title":"Restarting C25K but outside this time! - W2D3 - easier than the first two days but still not easy! W3 starts on Monday.","author":"yuyithemermaid","url":"https:\/\/www.reddit.com\/gallery\/10yrosf","text":"Was hard to get out the door today but so glad I did, feeling a lot better.","upvote_ratio":0.96,"created_utc":1676034851.0},{"title":"I finally completed week 1, but by day 5 I was almost wiped out","author":"PlanetOfVisions","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10zck0w\/i_finally_completed_week_1_but_by_day_5_i_was\/","text":"I **finally** did it and stuck to it after months of toying with starting the program. I was too chicken to really commit but my stamina was also absolute crap. I spent about 6-7 weeks just building up my endurance. It helped that I dropped a good chunk of weight too. I actually got through it.\n\nI started on Monday and by Friday, I was beat. I trained really hard this week to make up for last week (it was that time of the month and I craved carbs, first time I had potato chips in *months*). I had to stop and take a break. I go pretty slow, I use the treadmill on 2.2. we'll see how next week goes. \n\nIt's a long battle ahead, but man is it a lot of fun.\n\nEdit: ok this didn't go as planned lol, to clarify I slacked off the week before in terms of exercise and diet, so I worked harder this week. I eat mostly healthy but succumbed to some cravings because of my monthly cycle. I do actually enjoy exercising, I wasn't trying to \"punish\" myself for eating, just working harder.","upvote_ratio":0.61,"created_utc":1676091125.0},{"title":"Week 3 done!","author":"ste001","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10yz0lv\/week_3_done\/","text":"I didn't expect it to make it this far and still feeling like I still have a lot to give, but here we are. The week has been a big tougher, but nothing crazy: I fatigued a bit more on the second day, but then I realized I was pushing a bit too much (I had a 7.46\/km pace) so today I went a little bit slower and it was better (7.56\/km).\n\n\nSpeaking of that, now I understand why people tend to go faster: sometimes you feel really good and want to capitalize on that. You need to exercise a good amount of self-control not to go overboard and stick to the program when you feel so good!\n\n\nApart from that, I can't wait to start the next week. Also, I'm planning to buy a fitness tracker at this point, do you have any recommendations?","upvote_ratio":1.0,"created_utc":1676053552.0},{"title":"Which week should i continue from?","author":"Runningpolygon","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10zawg6\/which_week_should_i_continue_from\/","text":"I began running 5 sessions ago and since I was mildly active before as well, I decided to push myself and rapidly increase time spent running each session. I’m 5 sessions (2 weeks) in and managed to do (5 minutes jog, 1 minute walk)x4 last time and felt exhausted to my limit. My question is now that I know my ability what week and day of c25k should i continue from? Thanks and happy running","upvote_ratio":0.75,"created_utc":1676085772.0},{"title":"Very proud of myself. Started Jan 6, couldn’t run 60 sec without getting insanely winded. Just finished this today!!","author":"Federal-Progress-365","url":"https:\/\/i.redd.it\/ibcgefprxeha1.jpg","text":"","upvote_ratio":0.96,"created_utc":1676039442.0},{"title":"Can you build leg muscle by running long distances? And if so then can other muscles be built by wearing weighted equipment?","author":"Initial-Birthday-656","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10zgqnn\/can_you_build_leg_muscle_by_running_long\/","text":"","upvote_ratio":0.44,"created_utc":1676106466.0},{"title":"Lvl Max Confidence achieved: 20mins run on W5D3","author":"gunner9108","url":"https:\/\/www.reddit.com\/gallery\/10yfqks","text":"I've just hit a new level in my running game with my 20 minute run on Week 5 Day 3 of the C25K program. It was a rush of adrenaline and confidence that took me to the next level. I've done C25K before, but starting it again has been a fresh new experience and I'm loving every step of the way. Week 5 has been a real game-changer and gives a huge boost in confidence. Who else is in Week 5 and feeling the same rush of confidence? Let's level up together!\n\nP.S. do i really need to slow down or my heart will eventually catchup. Last time I did I remember my heart rate would go up to 190","upvote_ratio":1.0,"created_utc":1676001908.0},{"title":"Phew! Week 1 DONE! Baby steps!","author":"thatgirllissalou","url":"https:\/\/i.redd.it\/pleb39aiqaha1.jpg","text":"","upvote_ratio":0.97,"created_utc":1675988573.0},{"title":"W5D3 - success and boost in motivation","author":"Mochimirangue","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10ylxbz\/w5d3_success_and_boost_in_motivation\/","text":"Just completed my first ever good solid 20 minute run!\n\nNot going to lie, week 5 was a tough week, I felt my energy taking a slight dip and I think this 20 minute run was making me lose a bit of motivation but wow! \n\nJust completed the run and oh boy is the excitement back at it again! Honestly feels like adding an extra 10 mins to the run is so damn achievable now! \n\nExciting times ahead, W6D1 will be a breeze compared to this run ahaha 🕺","upvote_ratio":0.94,"created_utc":1676020052.0},{"title":"[WEEKLY THREAD] FEATS OF FRIDAY","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10yno2a\/weekly_thread_feats_of_friday\/","text":"Let's brag a little. What did you accomplish this week?","upvote_ratio":1.0,"created_utc":1676023303.0},{"title":"W3D1 - WHEEEWWWWW","author":"Phallenpheather","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10y4jrb\/w3d1_wheeewwwww\/","text":"I don't know how I made it through that! \n\nI don't feel powerful about it yet. Just exhausted. I was more proud of myself finishing the 60 second runs during W1 than now\n\nThat was really hard. Really really hard","upvote_ratio":1.0,"created_utc":1675972862.0},{"title":"I did it! I finally did it!","author":"detectiveskips2","url":"https:\/\/i.redd.it\/xk5klha6w4ha1.jpg","text":"Whew, I finally did it after restarting twice. Now should I go to W9D1 or to the 5K Pacer App?","upvote_ratio":1.0,"created_utc":1675917836.0},{"title":"My First 5K!","author":"apoorvasehgal","url":"https:\/\/i.redd.it\/z7ek0gxjz3ha1.jpg","text":"\nI did it! It was W8D2, but I decided to push it and go for my first 5K! To think I was struggling to run for even one minute a couple weeks ago. \n\nI swear to god, if I can do it, anyone can!","upvote_ratio":0.99,"created_utc":1675906867.0},{"title":"Week 7 done! Can’t believe I just went out and ran 3km straight","author":"HalfOk4038","url":"https:\/\/i.redd.it\/s85za823n5ha1.jpg","text":"","upvote_ratio":0.98,"created_utc":1675926887.0},{"title":"W7D1 done! my left foot went numb for the last 3-4 minutes, I continued anyway. It was normal after I stopped and no problem after that. Should I be worried?","author":"PopGurll","url":"https:\/\/i.redd.it\/nwf8x71y96ha1.jpg","text":"","upvote_ratio":1.0,"created_utc":1675934577.0},{"title":"Week 7, Day 3. It hurt so bad, but I finished.","author":"LazyBoyD","url":"https:\/\/i.redd.it\/uh6w57txr2ha1.jpg","text":"","upvote_ratio":1.0,"created_utc":1675892205.0},{"title":"My 5K is on Saturday. Finished the program last month. Did 6mi today. Not sure what my official 5K speed will be but my goal is to just finish.","author":"healthierlurker","url":"https:\/\/i.redd.it\/m1q8qcfya4ha1.jpg","text":"","upvote_ratio":0.95,"created_utc":1675910710.0},{"title":"Shin pain returns.","author":"dylnmr101","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10xs8rt\/shin_pain_returns\/","text":"I started C25K 1. to achieve a decent level of running in order to do it consistently but 2. to build myself up slowly from recurring shin pain whenever I played sports.\n\nI have made it all the way to W7R1, I completed the run and now my shins are hurting again. Maybe I’m doomed!! Should I continue or stop?","upvote_ratio":0.86,"created_utc":1675941190.0},{"title":"Is Nike Pegasus 39 good shoes to get into running?","author":"whiskeypie101","url":"\/r\/RunningShoeGeeks\/comments\/10xqun6\/is_nike_pegasus_39_good_shoes_to_get_into_running\/","text":"","upvote_ratio":1.0,"created_utc":1675936153.0},{"title":"Restarting C25K but outside this time - W2D2 - felt a little hard but really focused on slowing down and maintaining a sustainable pace for myself. Bonus foggy park picture!","author":"yuyithemermaid","url":"https:\/\/www.reddit.com\/gallery\/10wummv","text":"","upvote_ratio":0.99,"created_utc":1675856812.0},{"title":"W4D2 done! Much better than W4D1 for sure","author":"friendlypuffin","url":"https:\/\/i.redd.it\/fqzr552n42ha1.jpg","text":"","upvote_ratio":1.0,"created_utc":1675884365.0},{"title":"Oh, yeah, it’s all coming together.","author":"Dunnananaaa","url":"https:\/\/i.imgur.com\/EMXqwJb.jpg","text":"","upvote_ratio":1.0,"created_utc":1675897842.0},{"title":"Slowly but surely getting there!","author":"Federal-Progress-365","url":"https:\/\/i.redd.it\/0r6t0hcz11ha1.jpg","text":"","upvote_ratio":0.96,"created_utc":1675871362.0},{"title":"Keep getting stuck on Week 3 due to shin splints...","author":"IsIandLion","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10xdrsu\/keep_getting_stuck_on_week_3_due_to_shin_splints\/","text":"Stamina isn't an issue, I typically finish Week 2 days really easily, to the point where I even go above and beyond. However, the 3 min jog times for Week 3 really make my shins burn so much, the pain is unbearable. \n\nWondering if anyone has any tips to overcome this?","upvote_ratio":1.0,"created_utc":1675897210.0},{"title":"Self conscious \/ anxious while running outside (please help 🥺)","author":"sexual-abudnace","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10wmiuv\/self_conscious_anxious_while_running_outside\/","text":"\nHello to all beginners,\n\nI just started running last month, and I'm not yet very consistent.\n\nBut my major issue is -\n\nHow do I overcome anxiety and stop being self conscious when out for a run?\n\nAs soon as I see people on the street, I switch to walking. I feel like they look funny (must be only in my head)\n\nEspecially because I don't have a good pair of running shoes\/a good jacket on - this makes me even more self conscious.\n\nOne way I'm planning to avoid this is by running early in the morning - this is a good solution, but not very versatile and not to mention waking up early in the morning is a bitch.\n\nA part of me knows it's only in my head - but I'd like some pointers on how to overcome it. Even better, if you had it before and overcame it.\n\nWelcome all suggestions 😇\n\nBe brutal if necessary lol\n\nThanks!","upvote_ratio":0.93,"created_utc":1675828374.0},{"title":"Knee pain W4R2","author":"magical_bean2033","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10xc5pi\/knee_pain_w4r2\/","text":"Knee pain, it hurts when I run and my feet touch the floor. W4R1 they were a little achey but now I can’t even jog on the spot \/ do starjumps as a warmup without them hurting. Has anyone had this before and how long did they take to settle? I have physio tape and willing to strap up and keep on going! TIA","upvote_ratio":1.0,"created_utc":1675893559.0},{"title":"Survey about earbuds!","author":"realidoes","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10x6qfc\/survey_about_earbuds\/","text":" \n\nHi everyone, if you've got some time we would appreciate if you could answer a few questions in this survey about in-ear earbuds, specifically for joggers, thanks!\n\nhttps:\/\/docs.google.com\/forms\/d\/e\/1FAIpQLSfHAaR2Mv\\_\\_DLwJUfmctuOO8-nsJKWd\\_34WSyTUrCp9S7fS8A\/viewform?usp=sf\\_link","upvote_ratio":0.5,"created_utc":1675880772.0},{"title":"Took a leap of faith and finished W6D3! Context: I stopped running for months because of my slow pace, got demotivated! Started from W5D1 again.","author":"PopGurll","url":"https:\/\/i.redd.it\/e2wqd0p4xtga1.jpg","text":"","upvote_ratio":0.96,"created_utc":1675784983.0},{"title":"If you know what you want, nothing can stop you! Stay focused everybody!","author":"letsstartanew2","url":"https:\/\/v.redd.it\/azdc93s8lvga1","text":"","upvote_ratio":0.86,"created_utc":1675805200.0},{"title":"[WEEKLY THREAD] RANT WEDNESDAYS","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10wsvuo\/weekly_thread_rant_wednesdays\/","text":"Things that make you go !@#$%&","upvote_ratio":0.67,"created_utc":1675850503.0},{"title":"after my last post, many of you commented I should do my W5D3 run again. So I did thankfully","author":"Qasid96","url":"https:\/\/i.redd.it\/nrtypk56rtga1.png","text":"","upvote_ratio":0.96,"created_utc":1675782981.0},{"title":"Did anyone finish C25K on the first attempt without any running experience\/skills? What was your experience?","author":"jesinta-m","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10viv1j\/did_anyone_finish_c25k_on_the_first_attempt\/","text":"I’m interested in hearing people’s experiences. The whole point of C25K is that it gets people from inactive to running a 5k. Yet, from what I hear and read it is quite challenging with people often needing to repeat days and weeks. \n\n* What was your experience?\n* What do you wish you knew at the beginning of your C25K that would have made things easier \/ more successful?\n\nEdit: Thanks for the advice everyone. I thought I'd update the post with the common feedback, for anyone that reads this thread later. The consensus seems to be:\n\n* Run slowly, don't sprint thinking you feel fine now and you'll tire yourself out. \n* Be consistent. \n* Pay attention to your breathing.\n* Don't skip rest days\n* Wear good shoes \/ take care of yourself.","upvote_ratio":0.98,"created_utc":1675719157.0},{"title":"Hilly running injury help!","author":"Ok-Slip-8663","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10w0bbx\/hilly_running_injury_help\/","text":"Completed C25k for the second time late last year and love it. I restarted the app after injury to slowly build myself up in the hopes it wouldn’t happen again. I originally thought I was suffering with shin splints but now I’m in pain again, I’ve discovered it’s a soleus injury - generally caused by overuse and running on too many hills. I live in an extremely hilly part of the UK, I’ve found a park with a 1\/2km loop, but other than that or driving to somewhere to run I’m a bit stuck. I’ve seen exercises to strengthen the muscle but was hoping people might have some advice!","upvote_ratio":1.0,"created_utc":1675771952.0},{"title":"W9D1 Success!","author":"djmc252525","url":"https:\/\/i.redd.it\/7l5f7chh3pga1.jpg","text":"","upvote_ratio":0.97,"created_utc":1675726585.0},{"title":"Restarting C25K but outside this time! W2D1 done - was hard AF but pushed through","author":"yuyithemermaid","url":"https:\/\/i.redd.it\/uxn8160dnlga1.jpg","text":"Been feeling depressed lately due to stress and unemployment but using running and staying active as a tool in hopes of climbing out of this hole","upvote_ratio":0.98,"created_utc":1675684843.0},{"title":"how will I ever make it??","author":"Phallenpheather","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10vplb2\/how_will_i_ever_make_it\/","text":"I just finished w2d3 today\n\nI can't even imagine running for 3 straight minutes for week 3.. and from here it just goes up. \n\nFeeling pretty intimidated and could use some pick me ups to keep going","upvote_ratio":1.0,"created_utc":1675736098.0},{"title":"From Walk to Jog: Level 5, Day 2 of C25k","author":"gunner9108","url":"https:\/\/www.reddit.com\/gallery\/10vc19t","text":"Just finished my Level 5, Day 2 of the Couch to 5K plan and feeling like I'm making progress! 8 minutes of running followed by 5 minutes of walking and then 8 minutes of running again. It's amazing how quickly you progress with level 5. Who else is on the Couch to 5K journey with me? Let's encourage each other and see how far we can go!","upvote_ratio":0.94,"created_utc":1675703589.0},{"title":"How to overcome the lower back pain?","author":"choccyweetos","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10vn2pz\/how_to_overcome_the_lower_back_pain\/","text":"Really enjoying the sessions up to now into week 2, but I'm sure I'm not the first person to get lower back pain when running. I think this may start ruining later runs when the time increases. I thought it may be the running shoes, but I've got a few pair I cycle between now so it can't be.\n\nDoes anyone have any tips to help?","upvote_ratio":1.0,"created_utc":1675729515.0},{"title":"I did it!! I am so proud of myself.","author":"Federal-Progress-365","url":"https:\/\/i.redd.it\/rze57j704mga1.jpg","text":"","upvote_ratio":1.0,"created_utc":1675690445.0},{"title":"I’ve noticed a lot of progress but when will I get faster?!","author":"ThrowAway_SeaMonster","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10vnpx7\/ive_noticed_a_lot_of_progress_but_when_will_i_get\/","text":"I october I started c25k. It was pretty tough but I finished the whole program and could run 30 minutes by the end, even though it was a super miserable 30 minutes. In December I got sick and busy and didn’t do much. I lost a lot of my progress. January I got back to it and started Nike Run Club 5K program. It feels tougher but it’s fun. I’m 4 weeks in and have worked my way back up to being able to run longer.\n\n Today I did 3.5 miles but it took me an hour. I feel like I could have gone more but don’t want to increase distance to quick and wind up hurt. I know I should be happy I can run for a solid hour and not die, when 4 months ago 90 seconds had me winded and begging for mercy. I should be happy my heart rate is slowly going down. It topped out at 175 after the whole run instead of 180something after a couple minutes. I should be happy I could still talk easily after 3 miles instead of gasping for breath like I used to. But I just cannot get past the fact that I’m still so stinking slow! Like I might as well be walking. Grandma in her tracksuit could power walk right past me running at 3.5mph. 😮‍💨 I know they say speed comes with distance but it’s still discouraging being just as slow as always. And so slow it’s technically walking.","upvote_ratio":0.81,"created_utc":1675731215.0},{"title":"New here - finished w1d1 today. I currently cannot fathom running for more than 2 minutes without stopping, and I’m excited to see where this takes me!","author":"munchycrunchycarrots","url":"https:\/\/i.redd.it\/rnt2xvfdckga1.jpg","text":"","upvote_ratio":1.0,"created_utc":1675669039.0},{"title":"The difference a month makes! My week 5 day 3 run to yesterdays run. C25K has given me a new hobby I am absolutely loving and it’s getting my fitness in order too. Can’t ask for much more.","author":"bredditandshredit","url":"https:\/\/www.reddit.com\/gallery\/10v4p3w","text":"","upvote_ratio":0.9,"created_utc":1675684244.0},{"title":"[WEEKLY THREAD] MORONIC MONDAYS","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10v2ysn\/weekly_thread_moronic_mondays\/","text":"Don't be embarrassed. We all have questions sometimes.\n\nAnd yes, you need to do your rest day between runs.","upvote_ratio":1.0,"created_utc":1675677704.0},{"title":"W5D3 completed! After about 14 minutes, I was really starting to get in my head about not being able to finish, but I did finish! I’m happy to have this one behind me. Does anyone have any tips when you hit that mind block?","author":"Hot-Bat-5042","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10uolhr\/w5d3_completed_after_about_14_minutes_i_was\/","text":"","upvote_ratio":0.96,"created_utc":1675633775.0},{"title":"My first run in a while 🏃","author":"Dreams_ComeTrue","url":"https:\/\/i.redd.it\/nj1j01ky4hga1.jpg","text":"","upvote_ratio":1.0,"created_utc":1675630239.0},{"title":"Should I repeat week 5","author":"Qasid96","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10uyi2q\/should_i_repeat_week_5\/","text":"On Sunday I ran Week 5 Day 3 and should have ran for 20 minutes. However, I only ran for 15 minutes. I did not go for the extra five minutes because I have ulcerative colitis and had extreme gut pain during the run. Normally I bear through any such pain but this time it was different. \nAlthough during the run i did not feel any pain in my legs or tiredness. I could have gone through the 20 minutes if I didn't need to go to the bathroom. \nMy question is should I repeat week 5.","upvote_ratio":0.8,"created_utc":1675660794.0},{"title":"Possible plantar fasciitis as per my family doctor, but also just finished week 6...","author":"zamiboy","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10uz5ux\/possible_plantar_fasciitis_as_per_my_family\/","text":"Is it bad to keep running even though the pain goes away\/dulls after doing a warm up?\n\nMy family doc said it takes like 5+ weeks to recover, and that is *SO MUCH TIME*. I feel like I'm going lose my endurance if I rest for 5+ weeks and then catch back on week 7. \n\nAnyone have similar issues and have tips on what to do instead of jogging\/running?\n\nI'm so freaking dejected right now because after my runs in week 6, I feel so amazing mentally and happy that I finished everything up to the end of week 6 quite consistently and regularly.","upvote_ratio":1.0,"created_utc":1675663016.0},{"title":"Program done - now what?","author":"Rainyqueer1","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10uz3cb\/program_done_now_what\/","text":"Finished week 8! Rocking 5k on the treadmill and feeling great. I’ve been running every other day and I’ve done two days at full distance this week. I’ve always been active but never managed to sustain a regular fitness routine before.\n\nHow often should I run each week going forward? Does anyone have free cross training recommendations for off days? I’m 37, with no noteworthy orthopedic issues. I am, however, restricted to 45 minutes a day of exercise time due to having to stuff it into the baby’s nap time and a full-time telework schedule.","upvote_ratio":1.0,"created_utc":1675662779.0},{"title":"W5D3 done and dusted! Perceived temperature of -8°C, small blizzard, perfect weather! Wasn't sure I could go for 20 mins, but it was quite easy","author":"adrianxbox","url":"https:\/\/i.redd.it\/xvoe76glpfga1.jpg","text":"","upvote_ratio":0.96,"created_utc":1675612957.0},{"title":"Finally after one and half month!!!!!!","author":"yinyangsan","url":"https:\/\/i.redd.it\/hr9xi8hl8cga1.jpg","text":"","upvote_ratio":1.0,"created_utc":1675570914.0},{"title":"Finally finished my 1st race","author":"bb_noob1","url":"https:\/\/i.imgur.com\/I2Jkdwh.jpg","text":"","upvote_ratio":1.0,"created_utc":1675576442.0},{"title":"Does anyone else run slower than they walk?","author":"11minuteslate","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10tvubp\/does_anyone_else_run_slower_than_they_walk\/","text":"As a lifetime running hater, I am surprisingly enjoying the challenge of C25K. Currently on week 4, but clocking in around a 16:30minute mile. My heart rate is about 174 at that pace. I can easily walk a mile faster than that. (I timed it just to be sure!) I also do pilates and yoga. \n\nIs this normal?? Am I doing something wrong? My hopes of someday running a 10 minute mile are slowly dwindling.","upvote_ratio":0.95,"created_utc":1675556445.0},{"title":"First 5k","author":"NecessaryStriking284","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10txeyu\/first_5k\/","text":"Only been training for a month and just completed first official 5k event. Completed at 29:45- pretty stoked 😊😊","upvote_ratio":0.92,"created_utc":1675560777.0},{"title":"Started C25K again on 11\/10\/22, graduated in January, ran for an hour straight on 2\/3\/23. Doing a half marathon program now but it’s crazy how well the C25K program works to get you into shape.","author":"healthierlurker","url":"https:\/\/i.redd.it\/nw1n53w36bga1.jpg","text":"","upvote_ratio":1.0,"created_utc":1675557971.0},{"title":"Restarting C25K but outside this time - W1D3 done! Easier than the first two days. Here’s to starting W2D1 on Monday!","author":"yuyithemermaid","url":"https:\/\/i.redd.it\/8fzys064z6ga1.jpg","text":"3 days of running outside and each day I’ve cared less and less about what people may think of me so cheers to that!","upvote_ratio":0.99,"created_utc":1675507193.0},{"title":"W4D1: I was so nervous but it was easier than I thought it would be!","author":"capricornfeed","url":"https:\/\/i.redd.it\/x2l1cfcyuaga1.jpg","text":"","upvote_ratio":1.0,"created_utc":1675554219.0},{"title":"Getting back in the game with C25K from level 5, day 1! I already finished the program once, but now I'm starting again after a long break. Let's go, slow and steady wins the race!","author":"gunner9108","url":"https:\/\/www.reddit.com\/gallery\/10tt93e","text":"","upvote_ratio":1.0,"created_utc":1675549674.0},{"title":"I did it!","author":"alluring_fog64","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10t7abx\/i_did_it\/","text":"W5D3, the dreaded. I did it. Thanks for the advice, to me directly, and to others which I’ve read. A 20 minute jog felt impossible even a week ago. Now I know for sure, if I can do this, I can do the rest of the program.","upvote_ratio":1.0,"created_utc":1675492986.0},{"title":"Week 2 done! Feeling better than ever","author":"ste001","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10tibam\/week_2_done_feeling_better_than_ever\/","text":"Week 1 was very easy, so I didn't know what to expect from more walking and more uninterrupted running... but it went pretty good. W2D2 was probably slightly tougher but nothing too crazy.\n\n\nAlso, I started putting runs on Strava, and it seems I'm actually keeping a faster pace each time. On W2D1 it was 8:49\/km, while on W2D3 it was 8:41\/km. I know it's not so important, but it really feels good!\n\n\nOn to Week 3, hoping for it to be as easy as the first two weeks! Also I might soon invest in a smartwatch, to keep track of everything with ease.","upvote_ratio":1.0,"created_utc":1675522714.0},{"title":"Finished C25K but I'm hurting","author":"standingonline","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10tfwkp\/finished_c25k_but_im_hurting\/","text":"So after the final week 8 D3 run I decided I'd run again the next day--just to see if I coudl really indeed run 5K. BTW, my time is 42 minutes. Well my body was exhausted for the next 4 days. I simply could not bring myself to exercise, and I am a very active person. I am supposed to run a 10 K in mid-March and was goign to begin a 5K to 10 K program, and I am now very uncertain. Anyone have thoughts?","upvote_ratio":1.0,"created_utc":1675515714.0},{"title":"Don’t get mad at me but… need some advice re health stats","author":"SammyScrammy","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10td3iy\/dont_get_mad_at_me_but_need_some_advice_re_health\/","text":"Hey everyone!\nAbsolutely love this reddit and have found it super helpful. I’m about to start W6D1 which on my app is 10m run 5m walk 10m run. I reckon I covered about 3.5k last week at the end of Week 5 so I’m starting to make up the distance now. However, I was having a look at my Apple Watch health data and feel a bit flat as my VO2max is about 29… terrible for my age (26y\/o female) - Apple says it’s ‘low’. I used to be super fit (played competitive sports including representing my state at one stage). I’ve had bad health the last few years and stacked on the weight & have been plagued with injuries until starting slow with C25K six weeks ago. Will my stats really improve? I just hate seeing ‘low’ or data that suggests that even though I’m putting in work nearly every day, it’s still ‘bad’. My diet is so\/so. Baby steps.. just trying to be better and reward myself with good food after all this exercise I’m doing.","upvote_ratio":1.0,"created_utc":1675506128.0},{"title":"Needed to have a break for 9 days","author":"Vetulerian","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10tlhsi\/needed_to_have_a_break_for_9_days\/","text":"I was at the end of week 4 but work came in between. Do you think it would be safe to start with the last day made?","upvote_ratio":1.0,"created_utc":1675530652.0},{"title":"Thank you for the motivation the other day. I graduated the program after two weeks off!","author":"gottagofastjax","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10snfbx\/thank_you_for_the_motivation_the_other_day_i\/","text":"I had to stop due to covid with literally just one day left in the program and was very nervous to get back into it. Then I posted here and a few kind folks reached out to encourage me to keep going. And I did! I had to go slower than usual, and I am already pretty slow, but I did 30 continuous minutes of running! I'm so proud. Thank you for the motivation!","upvote_ratio":0.98,"created_utc":1675439160.0},{"title":"Does \"walk for 5 mins then alternate between 90s run and 120s walk for a 20 mins\" includes walk?","author":"Srdjan667","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10tcste\/does_walk_for_5_mins_then_alternate_between_90s\/","text":"I'm at Week 2 run 3 and for these past two weeks I was doing 5 min walk and then 15 mins of run walk. So that's total of 20 minutes.\n\nIs that warmup period not included in that 20 minutes? I feel like it'll be much harder in future to complete run because I ran for 15 minutes instead of 20.\n\nCan someone tell me how it's supposed to be done?\nSorry for confusing post.","upvote_ratio":0.5,"created_utc":1675505480.0},{"title":"W2D2! my treadmill distance was ~1.5, app says 0.80, so who knows my real distance. listening to podcasts helps keep my mind entertained","author":"Phallenpheather","url":"https:\/\/i.redd.it\/vxsid4i153ga1.png","text":"","upvote_ratio":0.91,"created_utc":1675460759.0},{"title":"Can't get out to run","author":null,"url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10soiz1\/cant_get_out_to_run\/","text":"So recently I've decided to get my fat ass off the bed and do some exercise, and I did for 2 days. I planned to do it at the local park, as nearby pedestrians are more or less narrow and I might trip into a speedy car. Unfortunately, that park often attracts genuine pricks from my high school, and both times that I went they just laughed at me when I passed them, or tried to trip me, or block me. It's really hurtful and annoying and has taken a toll on my motivation. It also gets quite dark around 1 hour after arriving home from school, so there's really no avoiding traffic (said youths) in the weekdays, and it's even darker before school. \n\nI understand it's more of a mindset thing that I'd give them attention, but they still hurt me nonetheless, and I don't want this harassment to expand to within school areas once I get recognised, even when I sort of have friends backing me up. How can I deal with this?","upvote_ratio":0.97,"created_utc":1675441840.0},{"title":"First 5K!!! Ran the whole way and even though my pace is dogshit, I still have 4 runs remaining in the program and will try to improve it. Also a run where I totally surprised myself as I felt I was gonna collapse at merely the 26min mark.","author":"Steelarm2001","url":"https:\/\/www.reddit.com\/gallery\/10sdvey","text":"","upvote_ratio":0.98,"created_utc":1675407641.0},{"title":"Remembering to forget the ego - W6D3 done","author":"HalfOk4038","url":"https:\/\/i.redd.it\/02rlck1uuyfa1.jpg","text":"Just finished running for 25mins and I’m bloody proud of it. \n\nThis is my 4th completing the program (over about 10 years), and I think this is probably the “easiest” I’ve found it because I’m actively reminding myself to go slow and not give in to my ego when running. I’m definitely the unfittest I’ve ever been, but by going slow slow slow my legs are building up strength and I feel like I could keep chugging along forever. In the past I would’ve been completely out of breath and dealing with shin splints because I went too fast too quick. \n\nI find it can be quite demoralising when I start looking at what other people are doing, but I keep reminding myself it’s the long game and I don’t even need to think about speed until I can run 5k regularly!","upvote_ratio":1.0,"created_utc":1675408896.0},{"title":"What free apps do you use to track your distance and timing?","author":"Rare-Neighbourhood06","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10so3gl\/what_free_apps_do_you_use_to_track_your_distance\/","text":"","upvote_ratio":1.0,"created_utc":1675440789.0},{"title":"W5D1 and my ankle is sad but the rest of me is feeling like I’ve won at something.","author":"DeathBecomesHerrrrrr","url":"https:\/\/i.redd.it\/h5wa29krzwfa1.jpg","text":"","upvote_ratio":1.0,"created_utc":1675386341.0},{"title":"Restarting C25K but outside this time! W1D2 done and easier than W1D1","author":"yuyithemermaid","url":"https:\/\/i.redd.it\/it8huuvnlsfa1.jpg","text":"","upvote_ratio":0.99,"created_utc":1675333172.0},{"title":"Afraid I lost progress because I was unable to run for two weeks","author":"No_Time1325","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10smggx\/afraid_i_lost_progress_because_i_was_unable_to\/","text":"Hi everyone!\n\nSo I run outside and till now I have been very consistent with it since we had a pretty \"hot\" January so I was able to advance. \n\nHowever, I can't run at all once the weather goes below -5 Celsius (can't breath, muscle pain, extreme headaches) and for the past two weeks the weather was crazy cold with snow storms and I just don't have the right equipment to run in these temperatures without injuring myself. Right now it feels like minus 39 c.\n\nAll this time I am constantly thinking of the progress I might have lost. I was just done with week 6 and finally ran for 25 minutes.\n\nSo I have a few questions:\n\n1. They are predicting warmer week ahead of us and I was wondering if I can jump right back where I stopped and start week 7 or should I repeat week 6? Talking about injury risk\n2. Also, what do you guys do when you just can't run outside to keep you moving? Do you also have a gym membership, a treadmill at home?\n3. And a bit related - at what point in your running journey did you decide it is time to splurge on good running equipment? shoes, clothing, even nutrition stuff. I plan on sticking with running as a hobby but did not want to spend money in case I will be my old self and drop it after two weeks. But for now it seems like I am being disciplined :) \n\nThanks for everyone in advance. This sub is the only reason I have a reddit account, i love it! \n\n[Woke up to this](https:\/\/preview.redd.it\/l7c5gk4kjzfa1.png?width=398&format=png&auto=webp&v=enabled&s=85401f7d987a0dfcb696a780cc41ed59e3f4e9de)","upvote_ratio":1.0,"created_utc":1675436687.0},{"title":"Back to it before I’m 40","author":"MayorPelican","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10scg1q\/back_to_it_before_im_40\/","text":"Well it hit me last week that I am 40 this year and unfit, plus carrying some extra weight. I started C25K last June then got COVID after week 2. Never went back to it.\n\nNewly inspired, I don’t want to be an unfit 40 year old. Just finished W1D2 and I’m enjoying it.\n\nQuestion is, how does everyone stay motivated and stick to it? I wrote out a goal backwards from my birthday so I can keep regular track. \n\nFingers crossed. Love reading everyone’s posts on here and progress!","upvote_ratio":1.0,"created_utc":1675402869.0},{"title":"My stats for Day 1,I'm challenging myself for running 10kms in a single go in 30 days.","author":"armshort_click58","url":"https:\/\/i.redd.it\/m9j81grw60ga1.jpg","text":"","upvote_ratio":0.56,"created_utc":1675425070.0},{"title":"W1D4 was a surprise!","author":"poukepse","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10s8htx\/w1d4_was_a_surprise\/","text":"When my headphones rang out “run for 2 minutes” - I was really surprised. I’m happy to say I finished it all out - but I was pretty darn exhausted after. \n\nAny tips for building endurance or should I just keep on going with the week?","upvote_ratio":1.0,"created_utc":1675391191.0},{"title":"After going through the program and running a couple of 5K runs, I thought I’d treat myself to a new pair of running shoes","author":"bredditandshredit","url":"https:\/\/i.redd.it\/ckjqcc5r5tfa1.jpg","text":"","upvote_ratio":0.98,"created_utc":1675339929.0},{"title":"[WEEKLY THREAD] FEATS OF FRIDAY","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10sgqdw\/weekly_thread_feats_of_friday\/","text":"Let's brag a little. What did you accomplish this week?","upvote_ratio":1.0,"created_utc":1675418466.0},{"title":"New shoes, new place to run and a new personal best time. Sometimes things just work out well. I even had to deal with a felled tree at one point!","author":"bredditandshredit","url":"https:\/\/www.reddit.com\/gallery\/10rvm3q","text":"","upvote_ratio":0.95,"created_utc":1675359308.0},{"title":"Not able to finish a long run","author":"Federal-Progress-365","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10rzt9b\/not_able_to_finish_a_long_run\/","text":"UPDATE: I did it!!!!! I just told myself to reevaluate my mental and physical feelings when I wanted to stop but I pushed through!!\n\n\n\nI’m doing w5d2 tomorrow and looking at that 8min run scares me a little. \n\nOn the days that you aren’t able to complete the session, do you \n walk the remainder of the session or just stop and end your training?\n\nThank you!","upvote_ratio":0.84,"created_utc":1675369402.0},{"title":"My 5k Progress 18:42min! Chasing the crazy goal","author":"True_Cartoonist7022","url":"https:\/\/www.reddit.com\/gallery\/10rwz80","text":"","upvote_ratio":0.7,"created_utc":1675362654.0},{"title":"Week 3 -> Knee Pain","author":"Jag_Finance","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10rzg3k\/week_3_knee_pain\/","text":"Hello everybody!\n\nI recently started the C25K routine to get me started with some cardio in preparation for a 16km obstacle run in September. For many years I have only been working out my muscles and, shame on me, neglected my cardiovascular skills or lack thereof.   \n\n\nSince I started running I always have some knee pain after running on the inner side of the knee. What I mean is on the side that points to my other knee. And since week 2 workout 2 or 3 that pain remains for days afterwards. I thought it might be my body adjusting to the workload but after my first workout in week 3 I wanted to find out what the cause is.\n\nSo before I visit any doc I wanted to ask if any of you had that same experience and how I could get rid of it? Is it a tendon I have to strengthen with knee exercises or something entirely different?\n\nI am around 5,7ft tall and weigh around 176 lbs","upvote_ratio":1.0,"created_utc":1675368537.0},{"title":"Last years average km to January, 2023 💪","author":"virgoaliensuperstar","url":"https:\/\/i.redd.it\/r0gg0exzbpfa1.jpg","text":"","upvote_ratio":1.0,"created_utc":1675293600.0},{"title":"The difference in a day","author":"prissyelliot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10rfata\/the_difference_in_a_day\/","text":"I just completed (begrudgingly) week 5 day two and baby it was BRUTAL. I did week 4, day 3 on Monday and was absolutely *\\~flying\\~*, had so much fun, and felt so good - To the point that I marked the run as easy so I was prompted to skip. \n\nI am in a calorie deficit at the moment but it hasn't been an issue till now. **BUT** I work gruelling hours (15-hour days this week) so was only getting around 6 hours sleep a night. I can't believe the difference this makes. From flying to DRAGGING myself through the whole run.","upvote_ratio":1.0,"created_utc":1675308153.0},{"title":"Wanted to get back in shape. Used to use C25K by Zenlabs but now they're forcing analytics and not working unless location is turned on. Anyone got good alternatives?","author":"Ghostophile","url":"https:\/\/imgur.com\/a\/QYRqvXU","text":"","upvote_ratio":0.9,"created_utc":1675271952.0},{"title":"Fav running shoes","author":"Lauren_RNBSN","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10rfwi2\/fav_running_shoes\/","text":"Hi guys, what are your favorite running shoes? I know I need to really just go and try things on and have a pro help me, but just curious so I have a starting point.\n\nI have flat feet and they are fairly wide.","upvote_ratio":0.75,"created_utc":1675309877.0},{"title":"Poll: After completing C25K, how much time did it take to run your first 5K?","author":"LazyBoyD","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10razdh\/poll_after_completing_c25k_how_much_time_did_it\/","text":"Just a quick poll for those who have completed the program and have run a 5K, whether competitively or as part of week 8 day 3.\n\n[View Poll](https:\/\/www.reddit.com\/poll\/10razdh)","upvote_ratio":1.0,"created_utc":1675296943.0},{"title":"Tired from C25K","author":"smj1004","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10re8bu\/tired_from_c25k\/","text":"I’m on week 4 and I am feeling quite fatigued from running.  Not necessarily during or right after my run but throughout the day.  Even on my off days.  I’m not getting as much done (such as housework). Did this happen to anyone else?  Does the body eventually adapt and regain some energy?  My gut feeling is just to keep going and eventually I’ll adjust just wondering if anyone has any experience with this or insights other than more coffee?","upvote_ratio":1.0,"created_utc":1675305224.0},{"title":"It took me nearly 3 years to run my first 5K. It was still 100% worth it.","author":"Ktk22","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10qfobz\/it_took_me_nearly_3_years_to_run_my_first_5k_it\/","text":"I started running for the very first time in March 2020, and didn't follow any kind of structured plan - I just went out and ran for as long as I could, many days a week.\n\nUnsurprisingly, this meant I increased my running volume *way* too quickly, and experienced a string of unrelenting running injuries over the next two years. I dealt with shin splints, IT band syndrome, etc, and spent a lot of time seeing doctors and physical therapists. I kept trying to return to running after an injury, only to injure myself again.\n\nEventually, I returned to running using a program *even* more gradual than Couch to 5K. I started with running intervals of 30 seconds and walking intervals of 4 minutes - it was incredibly humbling but exactly what I needed.\n\nI eventually worked my way back up to re-starting couch to 5k, and knowing I am injury-prone, I really took my time with the program, and often repeated weeks along the way.\n\nAfter nearly 3 years, I'm finally \"graduated\" from C25K, and consistently running 5Ks about 3x per week. I am absolutely addicted, finding a huge amount of joy, and my run is always one of the best parts of my day. I honestly probably annoy everyone around me with just how excited I am about running, and how I always want to talk about it :)\n\nThis is all a long-winded way of saying that it's worth it to stick it out, even if you face setbacks. There is absolutely no shame in repeating weeks, having a really slow pace, or taking extra rest days when you need them. It's also not a lost cause if life gets in the way and you miss a week or month or more... you can always return!\n\nHopefully, running will be a lifelong journey, and so in my view, this program should be about learning to run in a way that's sustainable for you, and not about rushing to finish as quickly as possible. In my experience, it is absolutely worth the wait :)","upvote_ratio":1.0,"created_utc":1675212053.0},{"title":"Was supposed to run for 28min as part of W8D1... but ran for 30 minutes and then some more 😁","author":"Steelarm2001","url":"https:\/\/www.reddit.com\/gallery\/10qmrda","text":"","upvote_ratio":0.96,"created_utc":1675233557.0},{"title":"PSA: Don’t just run as your only form of exercise, add in strength training too! You might regret just running.","author":"Kind-Construction-57","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10qavv8\/psa_dont_just_run_as_your_only_form_of_exercise\/","text":"I began my c25k program in September after doing some walking for exercise. I had no real running foundation prior to C25k, and I was pretty out of shape. I went head first into the program, I was inspired by the people sharing success, and I had friends joining me and we shared our progress. I ran each week, and I was bummed if something came between me and my run. I had the goal of finishing my first ever 5k race under 30 minutes, and I did even better coming in well under 29 minutes. But this all came with a cost I was not aware of. \n\nAfter the race I was burnt out, my legs didn’t have it in them anymore. I rested a week thinking that’s all I needed. Nope, not even close. Tried two weeks. That lasted not long either. Long story short, I have some decent shin splints s that have been medically diagnosed. It’s been recommended I stop running for at least three months and stick to biking,elliptical, and\/or swimming. So I’m going for a gym membership and will work towards building a stronger foundation. That means working on my knees, quads, hamstrings, pretty much all my legs and feet. PT and Strength Training are the only things in my exercising future. \n\nPlease take care of yourself while participating in C25K program. Add in more strength training, take extra days for rest, and listen to your body. I think I tried to work through pains and that only served me well in the very short term. Hopefully in three months time I’ll be ready to restart the program, but this time do it pain free.","upvote_ratio":0.99,"created_utc":1675200114.0},{"title":"I can't believe it, I just ran for 20 minutes non-stop!","author":"mark49s","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10q0gsv\/i_cant_believe_it_i_just_ran_for_20_minutes\/","text":"I reached the dreaded W5R3 this afternoon and despite not feeling great I decided to have a crack at it. And I completed it! I can't believe that a month ago I was struggling to run for 60 seconds at a time, and I've just done 20 minutes! I didn't get quite as far as in previous runs, but still managed pretty much exactly 3km, so i'm happy with that. Now, on to Week 6!","upvote_ratio":0.99,"created_utc":1675175405.0},{"title":"W4D1 done!!","author":"PopGurll","url":"https:\/\/i.redd.it\/l1quryiq3kfa1.png","text":"After completing W5D3, got demotivated due to slow speed, went off track for months! I somehow managed to get myself togather to start running again! Started with W4D1. This time I am here to stay! 💪","upvote_ratio":1.0,"created_utc":1675230290.0},{"title":"Done! W8D3.","author":"somelittlepumpkins","url":"https:\/\/www.reddit.com\/gallery\/10qhaps","text":"Planning to do to more of the 30 min runs then start C210K program.","upvote_ratio":0.91,"created_utc":1675216446.0},{"title":"Hit 5k today 🙌🙌🙌🙌","author":"phynicle","url":"https:\/\/i.redd.it\/dzxxz4eu0ffa1.jpg","text":"Took alot of effort passing that 3k mark where I absolutely struggled. \n\nI think having a big lunch helped for that afternoon run. \n\nKeep at it, took me a while and many setbacks!","upvote_ratio":0.98,"created_utc":1675168781.0},{"title":"[WEEKLY THREAD] RANT WEDNESDAYS","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10qppt6\/weekly_thread_rant_wednesdays\/","text":"Things that make you go !@#$%&","upvote_ratio":1.0,"created_utc":1675245667.0},{"title":"Starting over c25k for the 5th time but this time I'm only completing my runs outside","author":"yuyithemermaid","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10py7ea\/starting_over_c25k_for_the_5th_time_but_this_time\/","text":"Completed W1D1 outside today and let me tell you.........I could barely finish. I think I avoided running outside because I was afraid of judgment being an overweight person but I've decided who cares! Yes I'm out of breath and yes I feel like I'm going to pass out but this is something I want to do for myself and no one else's business.","upvote_ratio":0.99,"created_utc":1675169386.0},{"title":"W2D1! took a few days off because of menstrual cramps being killer. comforted myself with food maybe a little too much. a little challenging, but feeling great!!!","author":"Phallenpheather","url":"https:\/\/i.redd.it\/xntlapvqsgfa1.jpg","text":"","upvote_ratio":1.0,"created_utc":1675190273.0},{"title":"Why am I so slow","author":"-crumbledore","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10q5dy9\/why_am_i_so_slow\/","text":"I did it, I can run a 5k! I’m so proud of myself. I’ve done it twice. But it took me 53 mins. I’m running at like 3.1 - 3.5 mph on the treadmill which I can comfortably walk at it’s that slow! \n\nSo will I get any faster? How long will it take me to shave a good 10 mins off my time?  I put the speed up to 6mph as an experiment, which would give me a 30 min 5k time which I read is a respectable time for a beginner. and I was literally SPRINTING - I couldn’t keep it up for more than 20 seconds. I have short legs I’m only 5’3 is that why I felt like I was sprinting? Maybe my stride is too short? Any tips or advice would be great fully received. Thank you 😊 x","upvote_ratio":0.92,"created_utc":1675187104.0},{"title":"Redid W3D3 after being sick for a week!","author":"chaosbeess","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10q432w\/redid_w3d3_after_being_sick_for_a_week\/","text":"Posted here last week because i got sick after W4D1 and was so sad I couldn't continue C25K for a bit right when it started getting really challenging for me. Well after lying in bed for a week I feel almost back to normal with the exception of the cough that is still haunting me. So I decided to redo a run from W3 instead of immediately returning to W4, and it went pretty great! Glad i scaled back as i had a coughing fit after both 3min intervals, but in terms of strength i feel like I haven't regressed much at all! In fact I felt faster than before and time flew by! I am going to decide on Thursday if i am doing another W3 run or moving on to W4, but I'm happy to be back!","upvote_ratio":1.0,"created_utc":1675184105.0},{"title":"What can I do to keep myself entertained on the longer runs?","author":"TalieRose666","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10q3183\/what_can_i_do_to_keep_myself_entertained_on_the\/","text":"I've just completed wk7d1, and am now just running for 25, 28 and 30 minutes at a time. (Which is amazing in intself, I never thought I could run non-stop for so long).  \n\n\nI really enjoyed the different sections of the earlier weeks, and having a nearish end in sight for the current section. Is there anything like this I can use for these longer runs?   \n\n\nI've heard of a zombie run app? Will this make running interesting?","upvote_ratio":1.0,"created_utc":1675181634.0},{"title":"I haven't ran since I got covid nearly two weeks ago. I only had w8d3 left and I desperately need motivation to get back into running!","author":"gottagofastjax","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10q6i5i\/i_havent_ran_since_i_got_covid_nearly_two_weeks\/","text":"Hello! I had a pretty standard covid experience, I had about 9 days of feeling sluggish\/totally lacking energy so I decided against running during that time. Now I am 13 days out from when I first had symptoms- I am feeling pretty much all better, still a bit more tired than usual but that could be because I drank this past weekend. I am starting to feel the negative effects of not running- my appetite is bigger and I am craving unhealthy food. I know the longer I go without running the harder it will be to get back into the swing of things and my unhealthy cravings will get worse. My willpower has plummeted. I was soooo sooo close to finishing the program but now I am weirdly nervous about running again! I desperately need motivation to have courage to try again. I appreciate any support! Thank you for reading!","upvote_ratio":1.0,"created_utc":1675189684.0},{"title":"Found an ‘easier run’ harder than a previous ‘difficult run’","author":"dylnmr101","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10pv8cq\/found_an_easier_run_harder_than_a_previous\/","text":"I did W5R3 last week which is 20 mins solid and I felt great. I did W6R1 (5 on, 3 off, 8 on, 3 off, 5 on) yesterday and I found it difficult during the run and I’m sore today. Any ideas why this might be?","upvote_ratio":0.9,"created_utc":1675159160.0},{"title":"Just finished W4 today and really enjoying it. Barely finished the 30 seconds on W1 so really proud so far. Dreading the jump in W5 though, seems like a big step? How did everyone else find this?","author":"FishermanPatient8384","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10pekwg\/just_finished_w4_today_and_really_enjoying_it\/","text":"","upvote_ratio":0.98,"created_utc":1675114034.0},{"title":"Secret on How to Run with Less Injuries & More Efficiency!","author":"ChrisWGault","url":"https:\/\/youtube.com\/shorts\/u5l4bFw_8qk?sub_confirmation=1","text":"","upvote_ratio":1.0,"created_utc":1675188832.0},{"title":"W8.2: I hit 30 minutes!!","author":"realpm_net","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10p4tlt\/w82_i_hit_30_minutes\/","text":"I had been promising myself a bit of a treat as soon as I graduated to 30 minutes. (5k is still a bit away as I’m running about 12:30\/mi). I was feeling really good at the halfway point and made the decision to just go for it. And it wasn’t that much harder than my previous run. \n\nI smoked for like 25 years. I was pushing 280 pounds at one point. And I’m just shy of 50 years old. I honestly never thought I would be able to do what I did this morning. I’m just so amazed and proud, and I wanted to share.","upvote_ratio":0.99,"created_utc":1675090747.0},{"title":"How to run lighter on my feet??","author":"JustBHD","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10pqco9\/how_to_run_lighter_on_my_feet\/","text":"","upvote_ratio":1.0,"created_utc":1675144885.0},{"title":"The shift in mentality around week 5 is wild to me.","author":"readingismyescapism","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10p5o4o\/the_shift_in_mentality_around_week_5_is_wild_to_me\/","text":"Today I finished W6D1 and thought \"oh, only five minutes? Easy!\" And then paused for a second because a week ago I was dreading the five-minute intervals, lol. It is really cool how much changes and how quickly things change. \n\nWeek 4 and Week 5 build your endurance for sure but remind yourself that the first time you encounter those longer intervals it is really about training your mind and building up the mental toughness you're going to need for the upcoming weeks.","upvote_ratio":0.99,"created_utc":1675092688.0},{"title":"Ran my first 5k today. This is the longest I've ran as an adult. Hoping to reduce the time in the coming weeks","author":"otunbabright","url":"https:\/\/i.redd.it\/3obgxdhj56fa1.jpg","text":"","upvote_ratio":1.0,"created_utc":1675061397.0},{"title":"Dont push it!","author":"No-Good-6695","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10p014v\/dont_push_it\/","text":"If your new to running & exercise like me, please just follow the program, dont do as i have done & end up like me with an ankle injury & unable to run for a while & most probably starting at wk1 again in a month or 2 ☹️. \nI got to WK8  in 11 weeks, done WK8 D1, 28 minutes, then on the D2 i felt good & carried on & ran for 43 minutes & 6.3k.\nGreat at the time but i then set out to just run 5k on every run, 😕 big mistake, \non the 5th 5k i got injured (peroneall tendinitis, i think) Im guessing its an overuse injury,the body not ready to do that much yet, suddenly increasing my running time by 12-15 minutes a run was a stupid thing to do, if i had just followed the run times, got to the end & just concentrated on 30 minute runs 3x a week for a few months maybe I'd still be running,& slowly adding a couple of minutes each week🤷‍♂️\nHowever tempted you feel,Please  just stick to the plan & you will get there.","upvote_ratio":1.0,"created_utc":1675079363.0},{"title":"A good plan or it needs tweaking?","author":"PRStingray","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10pm7v3\/a_good_plan_or_it_needs_tweaking\/","text":"","upvote_ratio":1.0,"created_utc":1675133763.0},{"title":"Couldn’t get through w4d3 last Friday. Took the weekend off to rest, and slowed my pace down 2 notches on the treadmill. Got it done today!!","author":"Federal-Progress-365","url":"https:\/\/i.redd.it\/llhm8r7i58fa1.jpg","text":"","upvote_ratio":1.0,"created_utc":1675085601.0},{"title":"2nd 5K run in the bag! Trust the process it works!","author":"bredditandshredit","url":"https:\/\/i.redd.it\/n9g5sb2231fa1.jpg","text":"","upvote_ratio":0.99,"created_utc":1675000028.0},{"title":"[WEEKLY THREAD] MORONIC MONDAYS","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10oya5e\/weekly_thread_moronic_mondays\/","text":"Don't be embarrassed. We all have questions sometimes.\n\nAnd yes, you need to do your rest day between runs.","upvote_ratio":1.0,"created_utc":1675072868.0},{"title":"how to find the time","author":"Traditional-Gap-4319","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10ou5gd\/how_to_find_the_time\/","text":"I live in the midwest where as you probably know, it starts getting dark at 5:00. I also happen to be a 20 year old girl who is obsessed with true crime and lives in the middle of nowhere, meaning there’s nowhere I can run that isn’t secluded. I work 7am-5:30pm weekdays, and it’s freezing here. \nSo what I’m asking is,,, where do you find the time and motivation to do 3 runs a week? help please 😭 i really don’t wanna wait until it gets warmer but I can’t find the motivation to wake up at 6am in negative temps. help <\/3","upvote_ratio":0.83,"created_utc":1675057647.0},{"title":"Week 4 in the bag! Feeling good but I know what’s coming next week.","author":"Eriol_Mits","url":"https:\/\/i.redd.it\/i9o9jhqq92fa1.jpg","text":"","upvote_ratio":0.98,"created_utc":1675014383.0},{"title":"Anyone else really enjoy running intervals?","author":"Icy_Tumbleweed_8232","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10oee15\/anyone_else_really_enjoy_running_intervals\/","text":"One unexpected perk of C25K for me has been enjoying intervals of running rather than just running the whole time. The journey is way more enjoyable than I expected, in other words, maybe even more than the end goal? Anyone else?","upvote_ratio":0.95,"created_utc":1675016353.0},{"title":"6 months ago I couldn't run 60 seconds. Today I ran 20 minutes (W5D3)","author":"tiredasday","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10nng9x\/6_months_ago_i_couldnt_run_60_seconds_today_i_ran\/","text":"Sorry if this reads like a journal entry - it basically is.\n\nAfter a few false starts to the program for the last 6 months, I finally made it to W5D3 and completed it. This has always seemed the most daunting jump for me, and I always quit the program early because I was sure I wouldn't be capable of it and I have a crippling fear of failure. I always labeled myself as someone who is not athletic and is not capable of much exercise. Today it feels incredible to trust my body and my resolve. I just never thought I could do this. Today I forgive myself for not previously believing in myself - that was the only difference between doing it and not. \n\nI don't know if this is helpful but it would have helped me when I started - if you can't even do W1D1, do what you can. And keep doing it, and then do a little more. The way your body can grow stronger will surprise you. C25K works, coming from the (now formerly) least physically capable person ever. And stop labeling yourself in negative limiting ways. You are capable of everything. From today on, I am going to refer to myself as a runner. I can fucking run!!","upvote_ratio":1.0,"created_utc":1674934560.0},{"title":"Hungover, going off <12 hours sleep over the past 4 days. Week 1 done and Week 2 started.","author":"BravePollution1785","url":"https:\/\/i.redd.it\/uf88llj631fa1.jpg","text":"","upvote_ratio":0.89,"created_utc":1675000072.0},{"title":"Finally graduated?!! My first 5k without stopping! So happy and proud that I stuck with this and am excited to be running a 5k race in Feb!! :-) Any recommendations on what to go for next and improving my time?","author":"oatmilq","url":"https:\/\/i.redd.it\/65sr5k0y3yea1.jpg","text":"","upvote_ratio":0.93,"created_utc":1674964005.0},{"title":"Every day is another stepping stone towards your goals! Stay focused everybody!","author":"letsstartanew2","url":"https:\/\/v.redd.it\/8463wcs8uxea1","text":"","upvote_ratio":0.7,"created_utc":1674960745.0},{"title":"W4D2 | it’s a slay","author":"DeathBecomesHerrrrrr","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10nmf7i\/w4d2_its_a_slay\/","text":"In December, I was really struggling with my mental health - the two usual culprits: depression & anxiety. For the sake of my brain, I committed to getting some exercise and fresh air to help quiet my mind a little bit.\n\nI’ve never been a fan of running, but then again, I never gave it a real try. I just needed something that had a low barrier of entry so I could simply leave my house, and go. \n\nMuch to my own surprise, running has been great. Ive found myself looking forward to my runs every week, and seen how much it helps minimize my stress. I’ve managed to run in a cold Canadian January, in the rain, at night, and even got myself up to run before work one morning. \n\nWeek four has ramped up! running 5 minutes solid felt challenging but I’ve been able to keep going - even when I’m slogging along in the final minute praying for the walk cue. \n\nVery happy to be sharing this journey with y’all.","upvote_ratio":0.94,"created_utc":1674931985.0},{"title":"Week 6, Day 2 Done! Very happy with my pace which included the 3 min walk!","author":"LazyBoyD","url":"https:\/\/i.redd.it\/12uk94hhpwea1.jpg","text":"","upvote_ratio":0.93,"created_utc":1674947036.0},{"title":"Week 5","author":"alluring_fog64","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10nxtr9\/week_5\/","text":"Hello lovely helpful people!\nSo I’ve never been a runner, I’m quite a bit overweight, and my previous attempts at c25k have gone badly. (Shin splints, struggling to breathe, general misery). I started up again this January, despite being heavier and less active than my last attempt (2018). It’s been going really well so far, I’m not really sure why this time is easier. I just finished week 4, which is the furthest I’ve ever gotten. Day 1 was good, but I started to struggle more with day 3, so I’m nervous going into week 5. I could use some advice on what the best approach is? Should I start week 4 over just in case? What should I do if I start to run completely out of breathe again? What do you all do to mentally get through a run you can physically do? I’ve been watching long videos to distract myself, but real 5ks aren’t on a treadmill","upvote_ratio":0.99,"created_utc":1674963186.0},{"title":"W1D3! took a few days off to recoup from some sore muscles and feeling great! week 1 in the bag!","author":"Phallenpheather","url":"https:\/\/i.redd.it\/gahtfqj65qea1.jpg","text":"","upvote_ratio":0.98,"created_utc":1674867567.0},{"title":"After completing week 7 and having a week off I thought I had to go for it today. No time limits just off for a run","author":"bredditandshredit","url":"https:\/\/i.redd.it\/d9ohbxpdomea1.jpg","text":"","upvote_ratio":0.99,"created_utc":1674825595.0},{"title":"C25K W7D1. Felt like dying and I am not impressed by my time but I am proud that I ran for 25 min straight!","author":"Minuku","url":"https:\/\/www.reddit.com\/gallery\/10mpjwy","text":"","upvote_ratio":0.97,"created_utc":1674838118.0},{"title":"W6D3 Question","author":"Such_Knee1480","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10muuwb\/w6d3_question\/","text":"I just did w6d3 today (22 min run). The program says that you should be able to do 2.25 miles in 22 minutes, but I was only able to do 1.90 miles. For the next workout should i repeat w6d3 until i hit 2.25 miles? Or continue onto W7D1?","upvote_ratio":1.0,"created_utc":1674850614.0},{"title":"Well, it was bound to happen. I failed w4d3","author":"Federal-Progress-365","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10mkpgt\/well_it_was_bound_to_happen_i_failed_w4d3\/","text":"I struggled through the first set of 5 min run and just couldn’t get my hr to calm down before the second 5 min run.  Couldn’t even get through 2 min of the second 5 min run even after slowing my pace way down\n\nHow many days back do you suggest I go to build up to week 4 day 3 again. Or just keep trying w4 d3?\n\nThank you!","upvote_ratio":0.97,"created_utc":1674825806.0},{"title":"Came back after a break sucks","author":"Aggravating-Floor-38","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10mlxpa\/came_back_after_a_break_sucks\/","text":"I had almost finished the program when life got really hectic so I put running aside for at least 2 months, don't even know the exact amount of time. Went on a run for the first time since then. Only aimed to do 1km to set realistic low expectations for myself, and even that suckkkkeddd. It was pretty tough. Facing yourself and seeing where you're at when you know and are used to a stronger version of yourself is really hard. But I'm really grateful that I went because I'd been procrastinating running for that very reason - I didn't want to see how low I'd got. So it's ok. I need to stay consistent now.","upvote_ratio":1.0,"created_utc":1674829117.0},{"title":"Is day one not 5k? (See comment)","author":"Level-Tough8716","url":"https:\/\/www.reddit.com\/gallery\/10mrwvt","text":"","upvote_ratio":0.62,"created_utc":1674843711.0},{"title":"W7D3 done.","author":"somelittlepumpkins","url":"https:\/\/i.redd.it\/8wi6i0nqbkea1.jpg","text":"","upvote_ratio":0.98,"created_utc":1674797131.0},{"title":"Where to start after 5 weeks off","author":"knopparp","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10my5iq\/where_to_start_after_5_weeks_off\/","text":"Long story short, I’ve been to physio and they’ve told me I need to take 5 weeks off because of both my legs being pretty knackered. Have to do strengthening exercises for the forseeable every day. \n\nMy question is, assuming I’m allowed to run again after 5 weeks, where do I start with couch to 5k?!\n\nI completed it at the beginning of Nov and have been pretty consistently running for 30-40 mins since, aside from a few breaks due to my calves giving out. \n\nAnyone that’s been through something similar, any advice would be appreciated! 😌","upvote_ratio":0.67,"created_utc":1674858636.0},{"title":"Feeling a little blah today","author":"runningaccount605777","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10ml9h9\/feeling_a_little_blah_today\/","text":"So my husband has been dealing with a sinus infection the last two weeks.  I thought I was safe but I woke up feeling a little blah.  I don't have the full blown infection like he has but definitely feel like I'm starting to get something.  \n\nSo do I keep my original schedule and get my W3D3 in or should I take it easy the next few weeks and just do a walk today?  \n\nThanks for all the advice so far.","upvote_ratio":1.0,"created_utc":1674827368.0},{"title":"Week 5!","author":"valokytkin","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10mg2sg\/week_5\/","text":"Hi all, \n\nI used to run a lot 5 years ago (was training for a half marathon) then I ended up with an injury that took me out for a while. As I was getting back into running in 2021. I was in a car accident and it's been a long road to recovery. \n\nI am now using couck 2 5k again and have reached the first dreaded 20 minute run. How do I get past the mental block?","upvote_ratio":1.0,"created_utc":1674808443.0},{"title":"Redoing W3R3 tomorrow","author":"HillcroftPansies","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10m85zg\/redoing_w3r3_tomorrow\/","text":"Monday’s W3R2 run was amazing, I felt light as a feather. Yesterday’s near identical run was the opposite and left me worn out and hurting. Still have some shin and calf tenderness today. Definitely don’t feel ready to tackle W4! Trying to focus on landing mid-foot and shorter strides. Leaning forward a little while trying to keep my chest raised - feels like a lot of mental work. Wish me luck!","upvote_ratio":0.92,"created_utc":1674781972.0},{"title":"[WEEKLY THREAD] FEATS OF FRIDAY","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10mhaxa\/weekly_thread_feats_of_friday\/","text":"Let's brag a little. What did you accomplish this week?","upvote_ratio":1.0,"created_utc":1674813668.0},{"title":"New to C25K","author":"FFJesse10","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10m1v38\/new_to_c25k\/","text":"Backstory, I am new to C25K, I am a paramedic that was just accepted to start as a career firefighter. So I am looking to get my cardio up before the 22 week academy starts. I go to the gym 3-4 times a week. So I am active, I just never run. \n\nI just finished week 2 day 1 on the app. I feel like week 2 is pretty easy, whereas week 1 kicked my butt honestly. I am assuming it is safe to trust in the app instead of trying to alter running\/walk periods? Day 1 of the academy starts March 6th. So I am wanting to be around the 5k mark going in to the academy. \n\nThanks!","upvote_ratio":0.94,"created_utc":1674765569.0},{"title":"Well done everyone.","author":"Art3mis86","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10lnx3u\/well_done_everyone\/","text":"Hi all, I just wanted to say a massive well done to everyone who is currently doing the C25K. I did it a couple of years ago and I know how hard it is to do, let alone get out and start it. To those who are lurking and are yet to start, do it, you've got nothing to lose, honestly it's the best thing I've done. I was bad shape in regard to health (mentally and physically) and C25K turned it all around for me. I'm now about to run my first marathon in April.\n\nAnyway, this isn't about me, it's about all of you beautiful people. You're amazing and you'll achieve your goals, it's amazing how adaptable your body is and don't underestimate what you can do. Trust the process and you will succeed. Well done everyone, go get it!","upvote_ratio":0.98,"created_utc":1674724879.0},{"title":"Not improving","author":"KookyFlamingo235","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10lwjns\/not_improving\/","text":"I’m very discouraged. I’m not improving at all and I even seem to be getting worse. Each day feels so much harder than the last and I’m not improving :( I read today (in the New York Times) that 10% of people will never improve their physical fitness (due to genetics). Should I just give up? Did anyone else have this experience?","upvote_ratio":0.83,"created_utc":1674752239.0},{"title":"W1D2 done, feeling amazing","author":"ste001","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10lptqm\/w1d2_done_feeling_amazing\/","text":"Just started C25K this Monday, now I'm almost at the end of the first week. Honestly, it wasn't hard at all for me, almost breezed through the first two days keeping a very slow pace (that I intend to keep to the end of the program).\n\n\nIt is my first time actually running, but I got some sort of a background: I played a lot of tennis when I was young, I swimmed for years, I briefly tried some others sports but then I basically stopped doing exercise once I started university. Covid also happened some years after I got back to practice swimming and then I never came back to it.\n\n\nSince I work in the IT field now and I'm more established in my position, I finally wanted to try something new. Initally I considered going back into the swimming pool, but then I read Shoe Dog and it inspired me to try running. This program fitted like a glove to what I wanted, but I really didn't know what to expect. I just had to try.\n\n\nBut boy, I didn't expect to like it so much. Maybe also the weather conditions help (cold, but not freezing cold) but I loved having a session, not breaking a sweat and not be super tired. I feel like it gives me the right amount of adrenaline and a great sense of accomplishment for doing it. \n\n\nNot to mention, a lot of the tips I read here before starting have been great. I always thought taking long strides was better, but going with a short stride and leaning a bit forward was an awesome tip. That and not keeping a fast pace to complete everything without problems were probably the best ones I read.\n\n\nI'm definitely looking forward to running right now since that first day, can't wait to go on to the next weeks of the program!","upvote_ratio":1.0,"created_utc":1674732983.0},{"title":"Can’t seem to pass week 7 day 1","author":"TopAnswer107","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10lu9zs\/cant_seem_to_pass_week_7_day_1\/","text":"I’ve completed every day since and didn’t have much trouble. Now I’ve been trying to complete w7d1 for the past week but can’t get past the 10 minute mark. I feel in pain at that point and agitated. Should I take a break and try again next week?","upvote_ratio":0.86,"created_utc":1674746580.0},{"title":"First Day","author":"Desnuts-1","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10lglh1\/first_day\/","text":"Hi!! Today is my first day and damn that was tougher than I thought it would be. I have probably worked out like 10 times in last two years but for some stupid reason I didn’t think I would be as bad. \n\nI’m so ashamed of myself. Even running a minute left me out of breath. \n\nIs this normal? At what point does it slightly start to feel easier to run?\n\nThanks so much! I have a feeling it’s going to be hard but I’m determined to see it through.\n\nEdit: I ran at 6mph and walked at 3mph","upvote_ratio":1.0,"created_utc":1674698738.0},{"title":"completed W4D1 but now I'm sick :(","author":"chaosbeess","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10lo6z5\/completed_w4d1_but_now_im_sick\/","text":"So far I've been keeping up with the program really nicely, only delaying one day because of my period. On Tuesday i did W4D1. It was definitely the most challenging one yet but it felt so good after i had completed it! But in the evening i started getting a cough and yesterday i felt feverish and headachy all day. Truly miserable! I'm feeling a bit better this morning but i can definitely still feel it in my throat, so W4D2 is definitely not happening today. I know I'm gonna have to rest until my throat feels better but this definitely sucks as I was doing so well and enjoying it so much😔 I might look into getting some more winterwear as I'm sure that must have contributed to me getting sick...","upvote_ratio":1.0,"created_utc":1674726140.0},{"title":"Week 3 Day 1","author":"bharat4ever","url":"https:\/\/i.imgur.com\/0amI1ah.jpg","text":"","upvote_ratio":0.93,"created_utc":1674685814.0},{"title":"oooh the moaning! my husband wanted to try so i have started again and man, he moaned his ass off. but week 2 in the bag, on to the next one","author":"cayosonia","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10lgt0t\/oooh_the_moaning_my_husband_wanted_to_try_so_i\/","text":"","upvote_ratio":0.8,"created_utc":1674699350.0},{"title":"W3D2!","author":"runningaccount605777","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10l7afq\/w3d2\/","text":"I showed up and failed again but got a lot closer than the previous tries.  I tired out at 48 seconds remaining on that last 3 minute run instead of the previous 1min 30 sec remaining.  I took an 18 second walk break and ran the last 30 seconds.  I will try again on Friday.  \n\nDo I get bonus points if it was snowing and hailing on me during the run???\n\nEDIT: Hail isn't accurate it was sleet which still hurt a bit lol","upvote_ratio":1.0,"created_utc":1674674968.0},{"title":"Restarting after injury","author":"No-Good-6695","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10lokvx\/restarting_after_injury\/","text":"I finished c25k a few weeks ago, ran 5k five times & had to stop runs 12 days ago because i injured my foot, physio said its tight ligaments & to keep stretching the ankle ligaments , its feeling a little better every day walking is helping, I'm hopeing to start again in 4 days time 🤞,\nWas wondering how much fitness i may have lost, should i just try maybe a two 10 minute runs with a 2 minutes walk between or should i just run for as long as i can, as long as my foot is ok ish. \nGetting this far & having to stop is soo annoying, 😬.","upvote_ratio":1.0,"created_utc":1674727878.0},{"title":"Period is hitting like a ton of bricks. Normal?","author":"IronIll","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10ljh6v\/period_is_hitting_like_a_ton_of_bricks_normal\/","text":"Hello all! Love this sub and seeing everyone’s journeys! I’m having a problem though and I’d love some advice! I completed W5D1 last week and was feeling great. This week I tried W5D2 and could not finish. Then I started my period. This entire week I’ve been trying to work out like normal but even walking at a usually easy 20 minute mile pace is making me exhausted, and I feel like my recovery between workouts is much slower. Today I went back to W4D2 but I couldn’t even get halfway through the run that I breezed through a few days earlier. People with periods, have you experienced this before? If so, how do you navigate? I was feeling so good about my progress thus far but the amount of backsliding I feel like I did this week has taken the wind out of my sails a bit.","upvote_ratio":0.78,"created_utc":1674707544.0},{"title":"Advice please. I’m having pain in my right side l, lower back that goes down into my butt. I’ve stretching, but can’t get rid of it. It’s just the one side that’s sore.","author":"Hot-Bat-5042","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10liq10\/advice_please_im_having_pain_in_my_right_side_l\/","text":"","upvote_ratio":1.0,"created_utc":1674705132.0},{"title":"Any truly free C25K apps for iOS?","author":null,"url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10l9r1z\/any_truly_free_c25k_apps_for_ios\/","text":"I know it’s been asked before, but being 2023 and apps have been updated since, I want to know if there any truly free apps for iOS they have no subscriptions","upvote_ratio":1.0,"created_utc":1674680859.0},{"title":"Are you running up\/down hills during C25K?","author":"chickenparmo","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10l2hre\/are_you_running_updown_hills_during_c25k\/","text":"Live in a very hilly area which makes the calves burn, but hoping that if I ever run in a flat area, I'll be flying through the air!\n\nGot any tips for running up\/down hills?","upvote_ratio":0.92,"created_utc":1674663554.0},{"title":"Need advice on whether to repeat Week 1 or push forward","author":"itmose","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10lisbn\/need_advice_on_whether_to_repeat_week_1_or_push\/","text":"Hi all. I finished week 1 day 3 on Tuesday and it felt almost as hard as day 1. I was able to finish, but only by walking for 105 seconds and running for 45 seconds for the second half (instead of the prescribed 90:60). My heart rate shot up to the high 180s on my last run. I’m in my early 20s and female. Tomorrow morning should be my week 2 day 1 run. \n\nI honestly don’t feel that I could even hold a conversation during those 60 second jogging intervals so I don’t know if I’m in shape enough to move forward. I walk at 3mph and run at 5.2mph - I was trying to run at 4.5-5 mph but it felt so slow for a run that I felt strained. \n\nShould I keep repeating week 1 until I feel like I can make it through perfectly? Or should I push forward to week 2 (with adjustments as necessary) in order to push myself further?\n\nThank you for the advice! Have a wonderful day.","upvote_ratio":1.0,"created_utc":1674705340.0},{"title":"W1D1 finally completed!","author":"iansime","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10kvo4s\/w1d1_finally_completed\/","text":"&#x200B;\n\nhttps:\/\/preview.redd.it\/biyqzn4v26ea1.jpg?width=3000&format=pjpg&auto=webp&v=enabled&s=7efb5bd7be6d8e0597efd7db34a043a61086ee37\n\nI tried W1D1 in November and I was absolutely destroyed - to the point that I sought out advice from my GP to make sure I was safe to continue.\n\nI realised that although I probably went too quickly, I was probably so unfit that I need to prepare for my next attempt. I started by doing a brisk 30 minute walk, 3 times a week for a month or so. I then started on a treadmill 3 times a week, starting with 30 seconds run & 2 min 30 seconds walk, repeated so that I did 8 chunks of 3 minutes.\n\nI gradually increased the run part of these 3 minute chunks to 45 seconds and then 1 minute, until I finally felt ready to try C25K again, and I was delighted to complete it MUCH more easily this time around!\n\nSo if you try C25K and fnd it too hard, I hope you can take some heart from my experience. Start more gradually, build up to it, and don't go too quickly when you attempt C25K.","upvote_ratio":0.98,"created_utc":1674642677.0},{"title":"Garmin Smartwatch\/Spartan Race - Research Study!","author":"GabeHernandez_Ollin","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10lbaup\/garmin_smartwatchspartan_race_research_study\/","text":"Hey there! \n\nMy name is Gabe Hernandez and I’m a grad student at Cal State Long Beach in my last semester of my M.S. in Athletic Training degree. For my thesis\/research project I’ve been conducting a study on Spartan racers who used a Garmin smartwatch in the last 5 years to record their race data using the Garmin Connect app. By entering so you can opt-in for a raffle for a **free Spartan race in 2023!** The deadline is 3\/4\/23 by 11:59 pm, so you still have time to run one if you’d like to participate in this study but don’t meet the eligibility criteria currently. While this may not be directly applicable to your interests in this subreddit page, I hope that this is able to reach a wider audience so that I may use this data to publish an official article after I graduate and represent the obstacle course racing community in scientific literature. If you’re interested the link for the survey is in my bio, or if you would like more info feel free to DM me. The link is listed below and you can also scan the QR code in this flier! \n\n[https:\/\/csulb.qualtrics.com\/jfe\/form\/SV\\_cYGrm3AoElbzR1s](https:\/\/csulb.qualtrics.com\/jfe\/form\/SV_cYGrm3AoElbzR1s) \n\n\\*\\*Just to be clear this study is for educational purposes only. This post is in no way an advertisement for my university, Spartan Race, or affiliated with this subreddit.\\*\\*\n\nThanks so much for your time and have a great day!\n\nGabe Hernandez, CSCS, SGX\n\nAROO!\n\nhttps:\/\/preview.redd.it\/bnthnl6oj9ea1.png?width=1080&format=png&auto=webp&v=enabled&s=bffe5604e88e71f120624c036273cc25547ff782","upvote_ratio":0.84,"created_utc":1674684623.0},{"title":"Almost half way to the end! Slowed my pace one notch and pushed through","author":"Federal-Progress-365","url":"https:\/\/i.redd.it\/oq150ro469ea1.jpg","text":"","upvote_ratio":1.0,"created_utc":1674662069.0},{"title":"fourth (I think?) time doing C25K and this time I recreated the Visual C25K guide in landscape so I can use it as a desktop wallpaper, PDF link in comments, and I'm happy to answer any questions and give tips for the program since I've done it a few times now 😁","author":"faceplanted","url":"https:\/\/i.redd.it\/v40axn7q76ea1.png","text":"","upvote_ratio":0.96,"created_utc":1674644469.0},{"title":"Something's going wrong, W4d3 right now (also advice on running speed)","author":"DoubleZOfficial07","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10kz6g9\/somethings_going_wrong_w4d3_right_now_also_advice\/","text":"So I started C25K a month ago and suddenly my progress is fading quickly rn. What's happening and what do you think I should do?  \n  \nMy progress recently:  \n  \nUpto W3: Progressed smoothly, no real fatigue post workout. \n  \nW4D1:[2.3mi] Out of breath (that 5 min really does a number!) but I managed to complete the run. \n  \nW4D2:[2.6mi] Did well, didn't feel too much pain.  \n  \nW4D3:[1.6mi] Really, really tired. Especially flummoxed as I made sure to slow down on my runs. Pain in either side of abdomen. Decided to repeat the run. \n  \nW4D3 (R):[1.3mi] Gave up, walked during one 5 minute jogging set. Too out of breath and pain in abdomen. I drank some water before, and didn't do my usual stretches, so maybe it's that?  \n  \nAfter that today I went back to square one and decided to do W1D1 again. Astonishingly, I was out of breath. It felt like I had just started the workout. Tbf I pushed myself to run harder on 5 of the 8 runs, but now I'm broke on whether to run faster or slower. There's something wrong going on with me. Could you please help?  \n  \nAdditional info: Around the time I plateaued I stopped eating a protein bar post workout. Also on that day I had noodles a couple hours before. And this is a long shot, but my decline could have be psychological(?) due to looking at the posts on this sub about how difficult the 5 min run is and the next weeks as well and that made me fall. Well idk if this info is any help, but thanks very much! :)","upvote_ratio":0.88,"created_utc":1674655006.0},{"title":"Road to 5K, day 2","author":"SeriousBoy2591","url":"https:\/\/i.redd.it\/ronsiynww8ea1.jpg","text":"","upvote_ratio":1.0,"created_utc":1674658968.0},{"title":"W1D2. a little sore from D1, but nothing I couldn't push past! feeling thankful for my theracane now","author":"Phallenpheather","url":"https:\/\/i.redd.it\/30dj1bp5t3ea1.jpg","text":"","upvote_ratio":0.98,"created_utc":1674597172.0},{"title":"Week 5 Day 3!","author":"kaylae21","url":"https:\/\/i.redd.it\/rzqozmwbq4ea1.jpg","text":"","upvote_ratio":0.98,"created_utc":1674608327.0},{"title":"Motivation","author":"thatgirllissalou","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10kngmh\/motivation\/","text":"I haven't run in years following an ankle injury. C25K got me out the door running when I first started 2011. Now pushing 50, working fulltime, doctorate student... motivation is lacking. I love reading everyone's journey! It's time I get back out there! Never was a 'natural' runner 'type', but it always felt so good after a run!!","upvote_ratio":0.94,"created_utc":1674613177.0},{"title":"W4w1 - I survived better than how I psyched myself out.","author":"WriterKen","url":"https:\/\/i.redd.it\/iwjsonncg4ea1.jpg","text":"","upvote_ratio":1.0,"created_utc":1674604971.0},{"title":"W4d2 I ran 3 minutes, 5 minutes, then ran 10 minutes straight! I was planning on doing the 5 minutes back to back, but was feeling good so I just kept going. It gives me some confidence that I can do this!","author":"Hot-Bat-5042","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10kmekf\/w4d2_i_ran_3_minutes_5_minutes_then_ran_10\/","text":"","upvote_ratio":0.95,"created_utc":1674610143.0},{"title":"[WEEKLY THREAD] RANT WEDNESDAYS","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10kv8dr\/weekly_thread_rant_wednesdays\/","text":"Things that make you go !@#$%&","upvote_ratio":1.0,"created_utc":1674640868.0},{"title":"W1D1 done! Feeling writey","author":"ceiimq","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10kbcmr\/w1d1_done_feeling_writey\/","text":"So I've never been able to run. Even when I was a kid and my parents would drag me hiking every Sunday, and I could walk for six hours straight without pain, I still couldn't run. I had allergic asthma back then, and the mandatory running test at school was my own personalized hell. Every time I failed it I'd hate sports a bit more.\n\nWhen I first found myself broke as a young adult, I started biking everywhere. The uphill climb to get home was hell at first, but I got better, and over the years I eventually started enjoying it. Sometimes I'd leave for work, change my mind, and just go for 100km instead. But even then I couldn't run. A dozen steps and my ankles would start burning like no pain I'd felt before. Unlike when I started biking it wasn't just a matter of puking in the shower afterwards. I just couldn't push through.\n\nAnd I don't know what it is about running specifically, but it's always been this is impossible dream, this wistful regret that never leaves the back of my mind.\n\nWhich brings us to now. I'm in my thirties and haven't been able to work for years, so I barely leave home. I couldn't bike even if I wanted to due to chronic pain. It's been years of feeling my body grow slower, heavier, less responsive until I finally reached this breaking point.\n\nBut I guess life experience isn't all bad. Even though my approach to cycling was always self-destructive and reckless, I've had that experience of looking at myself one day and realizing that something that used to feel impossible isn't even hard anymore. I can believe in it, I guess.\n\nI've also done a lot of progress with my self-esteem. I can read something like \"this program is designed to get anyone running, no matter their physical shape\" and actually believe that this applies to me - that I'm not uniquely broken.\n\nSo anyway, today was my first day. I had a medical appointment so I just used the opportunity to wear comfy clothes and go running right afterwards. It's not like I'd need proper gear for this much, and I wouldn't be able to afford that for the next few months anyway.\n\nThe first stretch was exactly as I remember. Fire in my ankles. Just pain pain pain pain pain. But 60 seconds can't be that long. And I wanted to believe it'd get better somehow. So I stuck with it, with tiny paces, barely a shuffle, and by the end of the minute I was still running. Better enjoy the next 90s before it starts again.\n\nWhen I started the second stretch I was a bit more clear-headed. I tried various step lengths and heights, partly to find the best one, partly just to make the hurt less repetitive. I realized I was just crashing on my feet without doing anything with them. Trying to actively move them felt weird, I didn't really have enough strength. But it helped. The pain was rising, but no faster than the first time. I could do this.\n\nRep three started out painful. I noticed myself shifting my weight forward to try and fall ahead. It's the same thing I do when walking gets hard and I know it's bad. I did my best to stay upright. Small steps, low steps, but without losing the momentum that I'd realized made things easier. It was definitely the hardest rep.\n\nDuring the walk before rep four, I crossed paths with another runner. I noticed his hands swinging prominently. I asked myself what I was doing with my own hands.\n\nAs I started running again, I tried paying attention to my arms. I'd always kind of rolled my shoulders back and forth while running, but it didn't feel like it contributed anything, so I tried other movements. I found something that felt right. Pumping my elbows and forearms parallel with my run, with as little torso twisting as possible, pulled me onward in a strange and encouraging way. It was hard to get right and once again I didn't feel like I had the right muscles, but as I kept trying stuff, rep four ended safety.\n\nThe second half was a breeze, comparatively. I wasn't sure at first, and was feeling a bit discouraged at the thought of redoing all I'd just done a second time. But I had things to pay attention to, movements I knew would make it easier if I could do them right, and I was also starting to trust the format more. \"Just do your thing\", I could tell myself. \"The rep will end soon enough\".\n\nBy the time of rep 6-7 I was able to get a visual idea of how far I'd be running with each one. I'd look ahead and it felt achievable.\n\n\"Start cooling down\", my app finally said. I went back to walking, and some random guy shouted \"Faster! What the hell was that\" and laughed. Fuck you, random guy. I did it and you can't discourage me anymore.\n\nMy experience with other physical activities tells me the second time is likely to be harder than the first. And I don't have an appointment this time so it's definitely going to take more determination to leave the house just to run. But I hope I'll be able to get into that groove again. It hurt, but it felt good, and I feel really proud.","upvote_ratio":1.0,"created_utc":1674582579.0},{"title":"Training for a 10k at the end of April. My W3D1 is done. I hate the wind.","author":"Christinamh","url":"https:\/\/imgur.com\/zpSQ3d7.jpg","text":"","upvote_ratio":1.0,"created_utc":1674565141.0},{"title":"How do you incorporate strength training?","author":"No-Bug6329","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10kmjjd\/how_do_you_incorporate_strength_training\/","text":"Hi! I just finished week 6 day 2. Time's flying and progress is coming quickly!\n\nI have not yet started to incorporate strength training. Im 5'8\" 153 pounds, so I have a bit of weight to lose... because I'm participating in the Chicago marathon in October (am I crazy?). Anyway:\n\n-What do you do to strength train?\n-how often do you strength train?\n-do you do it on the same or different days than running?\n-any tips for newbies?\n\nThanks! :)","upvote_ratio":1.0,"created_utc":1674610526.0},{"title":"When to start 10K training?","author":"Wooden-Addy","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10k3dxr\/when_to_start_10k_training\/","text":"I’ll be done with C25K next week. Is it recommended to go right into the 10K training app or run a couple 5Ks first? Any advice is appreciated.","upvote_ratio":0.94,"created_utc":1674559860.0},{"title":"Pace question","author":"lostmymind16","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10kclea\/pace_question\/","text":"Can someone please explain to me what this means for pace times? Please explain it like I'm 5 🤣. I'm completely new to running and plan to run a 5k later this year. TY!\n\n PACE STRATEGY\r\n(running segment is first)\r\n9:00 min\/mi: run 2 min\/walk 30 sec\r\n9:30 -10:45 min\/mi: 90\/30\r\n10:45 -12:15 min\/mi: 60\/30\r\n12:15 -14:15 min\/mi: 30\/30\r\n14:30 -15:45 min\/mi: 15\/30\r\n15:30 -17:00 min\/mi: 10\/30\r\n17:00 -18:30 min\/mi: 8\/30\r\n18:30 - 20:00 min\/mi: 5\/30","upvote_ratio":1.0,"created_utc":1674585553.0},{"title":"w1d1 done! became a distance runner after my first round of c25k... got sick and lost progress... finally restarting","author":"Phallenpheather","url":"https:\/\/i.redd.it\/nx4ga5apywda1.jpg","text":"","upvote_ratio":0.98,"created_utc":1674514289.0},{"title":"Today I Should've been running w5 d2 buuuuut...","author":"Healthy-Painter-3770","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10jln5k\/today_i_shouldve_been_running_w5_d2_buuuuut\/","text":"... I went and got fitted for proper running shoes instead!! Whooooo! \nI live in the sticks and rarely get into the big town with the running shop, so whilst I was going to wait until I graduated for this expensive treat, I did it today just incase I can't back anytime soon! \nApparently my left foot is neutral but my right I slightly overpronate, I had no idea! \nTomorrow I look forward to w5d2 in some beautiful lightweight runners :D","upvote_ratio":0.94,"created_utc":1674503486.0},{"title":"Road to 5k, day 1 aka the first step","author":"SeriousBoy2591","url":"https:\/\/i.redd.it\/ytv36cd5ruda1.jpg","text":"","upvote_ratio":0.98,"created_utc":1674487537.0},{"title":"Anyone else feel the climb from W3 to W4 is a bit much?","author":"Putrid-Television-22","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10jw053\/anyone_else_feel_the_climb_from_w3_to_w4_is_a_bit\/","text":"I know this whole program has been built in a way for a reason but I still feel like going from 9 minutes of jogging to 16 is a big climb for a beginner.\n\nLooking at W5 it even looks a bit easier compared to W4 to me especially when I'm done with W4 I don't think the climb will be that much going from W3 to W4.\n\nMaybe someone can explain why it is this way better to me and I'm still doing the program regardless but this is just something I had in mind after having completed W4 D1 a few hours ago.\n\nMaybe a 12 minute total jog instead for W4? Make it 2 min walk, 4 min jog and repeat it two more times? Doesn't that seem more realistic to go from W3 to W4?","upvote_ratio":1.0,"created_utc":1674530987.0},{"title":"I did it!!! Slowed my pace a little and got this done!","author":"Federal-Progress-365","url":"https:\/\/i.redd.it\/wxt04xignuda1.jpg","text":"","upvote_ratio":0.99,"created_utc":1674486293.0},{"title":"Week 3…. I started running… and jut kept going. 5km run done!!!","author":"HappyBouncyVoid","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10j7sth\/week_3_i_started_running_and_jut_kept_going_5km\/","text":"So……\n\nI have been using the Zombies!! Run!! App - which is amazing and am on week three. \n\nI did the five minute walk, then the five minute run and I was feeling good so I just kept going. And going. And going. All the way I was negotiating with myself - I’ll stop at the next lights. I’ll stop when I have done another 250m. But I didn’t stop. \n\nI was pretty slow and certainly very sweaty. But I ran 5km in 40:25 and then an extra 500m to get to my front door. \n\nPart of c25k is absolutely fitness - most of it perhaps. But there is absolutely a mental side to it as well. I’m not sure if I loved the run or hated it but mostly importantly - I DID IT. \n\nThanks to this sub for making it possible. Now I need to work out what I do next.","upvote_ratio":0.98,"created_utc":1674463177.0},{"title":"Tried to continue C25K after a few months away.. very quickly humbled!","author":"philobun","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10jmx56\/tried_to_continue_c25k_after_a_few_months_away\/","text":"Sorry first time posting so not sure if I need advice or motivation but I just tried to run W5D2 which is where I had got to a few months ago. Totally failed it and ran maybe max 6 mins over half an hour outside. Pretty demoralising but I want to stick to the program. Thinking I maybe start again at W3 or maybe W2 even? There are also a lot of hills and I’d only ever tried this on a treadmill before. Just feeling like I’ll never get there!","upvote_ratio":0.92,"created_utc":1674506579.0},{"title":"W7D1","author":"somelittlepumpkins","url":"https:\/\/www.reddit.com\/gallery\/10jrq5u","text":"I was dreading today, but this was the first run I actually enjoyed.","upvote_ratio":1.0,"created_utc":1674518438.0},{"title":"One sided hip pain?","author":"allenge","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10jtcb5\/one_sided_hip_pain\/","text":"I’m currently on W10D1 of c210k and near the ends of my runs (last 15 minutes or so) my right hip starts to hurt. By the time I’m finished my workout I’m limping a bit from the pain. It’s always the right side. Not sure if something about my form is off or if I’m not stretching enough\/properly? I took a week off to see if it would heal but today I started back and I felt it again. This hasn’t been an issue until I started to c210k program after graduating the 5k program. \n\nAny insight here?\n\nThanks in advance!!","upvote_ratio":1.0,"created_utc":1674522978.0},{"title":"Showed and did W3D1 again...","author":"runningaccount605777","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10jl475\/showed_and_did_w3d1_again\/","text":"Failed yet again.  I just can't keep running for that last 3 minute run.  I keep having to take a 20 second walk break past the halfway point.  None of my mind tricks seem to work this time :(","upvote_ratio":0.91,"created_utc":1674502207.0},{"title":"Starting out, how high do you let your heart rate get?","author":"itmose","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10jitnh\/starting_out_how_high_do_you_let_your_heart_rate\/","text":"I’m starting C25K for the first time ever, and I just finished Week 1 Day 2 yesterday. The first day was hard, and the second day felt a lot better. I know it only goes up from here. \n\nHowever, I am curious - how high do you let your heart rate get before you know you should slow down and let your body catch up? This week is 60 sec jog, 90 sec walk. I use a treadmill to comfortably walk at 3 mph and jog at 5.2 mph, and when I walk in between jogs, my heart rate can get down to about 145-150 bpm. The jog gets me up to 180 bpm by the end of the 60 seconds. This makes me nervous that it’s too high, so I tend to end my run and begin walking again about 5-10 seconds too early, once I see my heart rate hit 175 bpm. I feel physically fine, I just worry that my heart rate is too high. \n\nAdmittedly, I’m not in great shape but that’s why I’m starting the program. I’m in my early 20s and 5’4”, female. I use an Apple Watch to monitor my heart rate but I also use the built in heart rate sensor on the treadmill. They give me approximately the same reading as each other. \n\nThanks for any and all advice! Hope to make it through the program.","upvote_ratio":1.0,"created_utc":1674496743.0},{"title":"Sore hip - should I take a break to low impact","author":"prissyelliot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10jq0ku\/sore_hip_should_i_take_a_break_to_low_impact\/","text":"Hello! Completed W3D3 yesterday and realized when I got back that my hip was sore (like impact pain when I walked) although I didn't notice it while I was running. Set out with sore quads from traipsing up a big hill to a friend house Saturday night so might have been favoring something. Still a little sore today. Is it best to take another day of rest for my hip? For reference I run on footpaths so am wondering if the impact is a bit much.","upvote_ratio":1.0,"created_utc":1674514099.0},{"title":"[WEEKLY THREAD] MORONIC MONDAYS","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10j8zi1\/weekly_thread_moronic_mondays\/","text":"Don't be embarrassed. We all have questions sometimes.\n\nAnd yes, you need to do your rest day between runs.","upvote_ratio":1.0,"created_utc":1674468069.0},{"title":"Week 1, A New Hope (Finished)","author":"InSearchofaTrueName","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10j38e7\/week_1_a_new_hope_finished\/","text":"Hi all!\n\nI did C25K once years ago when I was truly was starting from couch potato, having never exercised seriously before in my life. I've run on and off ever since, but never really enjoyed it. I would always run consistently for a few weeks but then just quit out of sheer misery. I never once felt much joy and satisfaction in the process. Two or three times a year I would go through the same process. I'd do it reluctantly, suffer, and then give up swearing to never run again. What the heck are all these people who devote their lives to running getting from this? I'd ask myself.  And yet, I'd always start back up again in a few months when the weather was nicer or my birthday was close.\n\nA few weeks ago it hit me, and I accepted that I was going about it all wrong: yes, I could run three miles if I forced myself. But I've not given my body a chance to adapt to three miles so of course it was going to feel terrible. I squashed my ego and decided to restart the whole program from day one and friends I think that's the answer I was looking for. It was slightly uncomfortable, but manageable and I actually found myself having fun because my legs weren't feeling dead after 10 minutes and I could go at a pace that was fast enough to be enjoyable for me.\n\nSo I guess I'm going to see this through and work my way up to 10k four or five times a week (which has always been my goal) and maybe I'll actually like it this time!","upvote_ratio":1.0,"created_utc":1674446480.0},{"title":"I did it! Week 5, day 3. Wanted to give up but pushed through!","author":"LazyBoyD","url":"https:\/\/i.redd.it\/rqsavgp5ooda1.jpg","text":"","upvote_ratio":0.99,"created_utc":1674413887.0},{"title":"W4d1 completed! I was a bit nervous for the two 5 minutes stretch, but it wasn’t too bad. Definitely a little sore after this one though. Good luck everyone this week!","author":"Hot-Bat-5042","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10izzw5\/w4d1_completed_i_was_a_bit_nervous_for_the_two_5\/","text":"","upvote_ratio":0.96,"created_utc":1674436611.0},{"title":"My 5k is now 20:30mins! Long way to 15mins but I love the progress","author":"True_Cartoonist7022","url":"https:\/\/www.reddit.com\/gallery\/10ig6z4","text":"","upvote_ratio":0.81,"created_utc":1674381581.0},{"title":"W9D3 - What’s Next?","author":"riceforthewin99","url":"https:\/\/i.redd.it\/quhxjhl3ikda1.jpg","text":"","upvote_ratio":0.97,"created_utc":1674363421.0},{"title":"C25K done! Wasn't an actual 5k but very happy that I can run for 30 minutes consistently now!","author":"Chaosreignz","url":"https:\/\/i.redd.it\/eqyt0e9rvgda1.jpg","text":"","upvote_ratio":0.98,"created_utc":1674338055.0},{"title":"Week 6 done ✔","author":"somelittlepumpkins","url":"https:\/\/i.redd.it\/lp32dpxkrjda1.jpg","text":"22 minute jog was a killer 😳","upvote_ratio":1.0,"created_utc":1674354504.0},{"title":"Okay so I graduated today (again), although still need an official 5K. I’m a little concerned about the second picture though. Presumably that means I should be running (much) slower? I’m about 20kg overweight, which probably isn’t helping!!","author":"Alexis_Denken","url":"https:\/\/imgur.com\/a\/boAMDKK\/","text":"","upvote_ratio":1.0,"created_utc":1674370555.0},{"title":"W2D2 done even though I missed a week","author":"Legal-Big5760","url":"https:\/\/i.redd.it\/iir001fspjda1.jpg","text":"","upvote_ratio":1.0,"created_utc":1674353902.0},{"title":"To y’all doubters, My 5k down to 19mins! I’ll be back very soon! Goal is 12 mins","author":"True_Cartoonist7022","url":"https:\/\/www.reddit.com\/gallery\/10j2fxc","text":"","upvote_ratio":0.4,"created_utc":1674443997.0},{"title":"Booked my first 10k","author":"chickenparmo","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10hxrry\/booked_my_first_10k\/","text":"Finished week 1 of C25K today. Have played plenty of sports in the past, but Covid turned me incredibly lazy. \n\nSigned up for a 10k in September so going to use the next 10 weeks or whatever for C25K, then go for a 10k programme.\n\nLet's go!","upvote_ratio":0.95,"created_utc":1674325366.0},{"title":"Week 2 Day 3","author":"RedneckCousinFucker6","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10hwuqz\/week_2_day_3\/","text":"Had to dig deep today but finished it. Body has been a little bit sore but I was able to power through.","upvote_ratio":0.95,"created_utc":1674323096.0},{"title":"Best alternative to ZenLabs app with same schedule?","author":"StarSweeper94","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10i3uqr\/best_alternative_to_zenlabs_app_with_same_schedule\/","text":"I’ve done c25k 3-5 times over the years always using the Zen Labs app. I like their schedule, their interface, the voice prompts, everything works for me.\n\nWell I haven’t run in over a year and want to do c25k again but when I downloaded the app I saw that the full plan is now behind a pay wall! \n\nI’m trying to find an alternative and I know that I’ll have to deal with changes in the interface but I really want to keep the same schedule and run\/walk intervals.\n\nAre there any apps that use the same ones?","upvote_ratio":1.0,"created_utc":1674340867.0},{"title":"Avoiding overstriding when running slowly","author":"smittysomething","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10hv0aq\/avoiding_overstriding_when_running_slowly\/","text":"I'm currently on week 4 of C25K and I'm starting to develop quite a bit of leg pain.\n\nWeeks 1-3 were mostly fine. I started out heel striking which immediately gave me ankle issues, so I switched to a midfoot strike after a few days and everything was fine - until week 4.\n\nWeek 4 day 1 killed me. Near the end of the first 5 minute run I could feel shin pain, and I think I got shin splints or something as I needed to take a few days break to recover.\n\nWeek 4 day 2 I switched to a forefoot strike, which felt totally unnatural to me, and now my calves are tight and painful.\n\nI've read a bit and think that my issue is that I'm overstriding. Not by a lot, but I'm landing at least about a foot in front of my hips. I'd like to correct this, but I just don't see how it's possible. Sure, if I was sprinting it makes sense, but I'm running slowly and don't see how I can land with my foot underneath me without falling over. People seem to say that I should lean forward a bit and aim for a 180 cadence, but that would make me run way too fast to be able to make it to the end of the intervals.\n\nDoes anyone have any advice on what I should do?","upvote_ratio":0.91,"created_utc":1674318330.0},{"title":"Heavy Lifting while Training for 5K?","author":"GiraffeComic","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10hwpgw\/heavy_lifting_while_training_for_5k\/","text":"Hi everyone! So I decided I wanted to change my whole fitness goals and objectives last year. I had some health problems that were related to me bulking and building up a lot of strength as I was really into powerlifting at the time. I actually decided that I would apply for some fire departments in 2024 once I was done with my paramedic program.\n\nCurrently I am 25 y\/o, 5’8 and weigh about 240 lbs and I cannot run for the life of me. I used to be decent at 400m and 800m back in high school track but haven’t really ran since. \n\nI want to maintain my strength and continue my somewhat heavy lifting while trying to become a more well rounded athlete as it would be good for my career aspirations. Should I expect the normal 9 week program to work or will it take longer since I have to do more recovery because of my lifting? Does anyone have experience with this? Let me know!","upvote_ratio":1.0,"created_utc":1674322727.0},{"title":"Redo w3d3?","author":"Federal-Progress-365","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10hsz4b\/redo_w3d3\/","text":"I just finished day 3 of w3 and while I am not dying, I def felt a little tired and out of breath for my second 3 min run (the format was 2r2w, 3r3w x2, 2r2w). Couldn’t talk while I was running and needed more than a min to slow down my hr after the 3min runs. \n\nShould I repeat this day? Or move on to w4? The cooldown walk was fine","upvote_ratio":1.0,"created_utc":1674312834.0},{"title":"beginner","author":"butter-fingers-","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10i7qfb\/beginner\/","text":"hi, i haven’t exercise in a long time and i found this regime and i have a few questions:\nfirstly, is it ok to skip a rest day and exercise on that day as well, because before coming across this i used to go on the treadmill pretty regularly- almost everyday (i would do 40ish minutes of brisk walking with short bursts of running in between)\nsecondly- can i do other exercises on rest days (at-home ab exercise etc) or is it better to do those before\/after runs \nand lastly should i be stretching before each run?","upvote_ratio":1.0,"created_utc":1674351649.0},{"title":"W3D2 Could go further?","author":"mttbrlw","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10i0va3\/w3d2_could_go_further\/","text":"Hello. I completed week 3 day 2 this morning. The workout 'ended' and I still felt like I had more in the tank. During W3D1 I managed to run an extra few minutes after the the program ended and I could have easily ran further at the end of W3D2. \n\nShould I run further than the programme suggests when I feel I can go further, or better to not over do it? I wouldn't say I'm overly unfit, but am fairly new to running (and loving it I may add). I finished w3d2 this morning and almost had to force myself to stop at the end, I reckon I could have gone for a lot longer but also don't want to hinder future progress. Interested to hear what others have done in this situation?","upvote_ratio":1.0,"created_utc":1674333125.0},{"title":"HELP!","author":"Bug_freak5","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10hro7z\/help\/","text":"Uhm... I can't find the wiki guide so I'll just post this here. Currently at 4km under 40 minutes. Wanna accomplish 8km under that same time. Any routine would be helpful 👍.","upvote_ratio":0.69,"created_utc":1674308992.0},{"title":"W5D3 in the bag!","author":"username-fatigue","url":"https:\/\/i.redd.it\/s42eixtd8ada1.jpg","text":"And what a beautiful place to do it in!\n\nI'm not going to lie - it wasn't pretty and it wasn't easy. I wasn't sure that I could do it - I never seemed to hit my stride. But it just goes to show that it's a mental game - I set my mind to do it *and I did it*. \n\nSo pleased I did it when I did as well - I set out at about 6.30am and it was already starting to get hot! (Hawkes Bay, New Zealand.)\n\nHope other people in team W5D3 have good runs today!","upvote_ratio":1.0,"created_utc":1674239123.0},{"title":"Did a thing today.","author":"Dommo1717","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10hcwsv\/did_a_thing_today\/","text":"Technically today completed the program. Ran 3.3-ish miles, 30:00. Not blindingly fast by any stretch, but it’s fine. I will work on that part. \n\nNext goal: have a 5k obstacle course race coming up in about 2-1\/2 months. We shall see how that goes. Would have started the 10K program, but evidently that’s a paid app now, I’ll pass.","upvote_ratio":0.92,"created_utc":1674258180.0},{"title":"C25K 2 half marathon","author":"sullf","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10h1uti\/c25k_2_half_marathon\/","text":"Just booked into my first half marathon after starting C25K during the pandemic.  \nI try to stay active but always struggled with long-distance running.\n\nReally looking forward to the challenge 🙌","upvote_ratio":0.99,"created_utc":1674233576.0},{"title":"Showed up and did W3D3. That second 3 minute run killed me again and just missed the mark. I will be repeating this week next week. This video captures my run.","author":"runningaccount605777","url":"https:\/\/youtube.com\/shorts\/0FV8rtVqxnU?feature=share","text":"","upvote_ratio":0.94,"created_utc":1674250139.0},{"title":"7.1 Done, And a New Revelation","author":"realpm_net","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10h36fk\/71_done_and_a_new_revelation\/","text":"I ran W7.1 this morning.  It was a bit of a challenge, but not too bad at all.  While I was running, I had a revelation.  W5.3 is the turning point.  Once you can go 20, there's no question that you can go 22 or 25 or 28 or 30.  It's just a little bit further.  Your lungs aren't going to burst from two minutes on top of what you did two days ago.  Your achy legs aren't going to ache any worse from an extra two minutes.  Weeks 6 through 9 are just getting your body used to the extra motion- there's no longer any question as to whether or not you can do it.  Of course you can!\n\nNGL, W5.3 is a big milestone and a test of will.  But the program gets you ready for it.  And, what became clear to me today, once you've cleared it- you're gonna make it to the end.  You got this!","upvote_ratio":1.0,"created_utc":1674236623.0},{"title":"ran in the rain for the first time today! (W3D2)","author":"chaosbeess","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10h2cqz\/ran_in_the_rain_for_the_first_time_today_w3d2\/","text":"It was predicted to rain all day today so I figured I'd just go. Even though my home felt so cosy, I figured if I'd postpone I'd just want to do it less and since I live in the Netherlands I'm going to have to get used to running in the rain anyway. So I put on my raincoat with an extra warm layer underneath and went out. It even hailed while I was running but it was fine! Don't think I would have enjoyed running any longer than I did as my thighs were starting to hurt from being cold and wet but otherwise it wasn't as bad as it seems. i honestly just had to laugh when I stepped in a giant puddle trying to cross the street, fully soaking my foot. Treated myself with some snacks when i finished and took a hot shower to heat up and feeling proud of myself for pushing through it! I am a little salty that it was dry like an hour later...","upvote_ratio":0.94,"created_utc":1674234708.0},{"title":"W8D3 Complete!","author":"krysteline","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10hbu1j\/w8d3_complete\/","text":"Just finished the program this morning. I jog at a snails pace so while I \"graduated\", I only jogged about 2.1 miles in that 30min so I still have a ways to go before truly being able to run a 5k, but it will give me something to work up to. You don't have to be fast, just consistent! Keep at it y'all!","upvote_ratio":1.0,"created_utc":1674255890.0},{"title":"Sore calves? W4","author":"HalfOk4038","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10h90pe\/sore_calves_w4\/","text":"Hi everyone! I’ve just completed W4, but this week was a world of pain for my calves. I’m going slow slow slow (10:30\/km runs), and I’m not out of breath in the slightest but I have to keep stopping to stretch out. In W1 -3 my pace was more like 6:30-7kms. \n\nW4D3 was definitely slightly easier than W4D1 in that I didn’t have to stop as much haha. Do you think it’s just a matter of building up the strength in my legs? The last 5min run definitely felt easier than the first 3min run so I’m also wondering if I just need to warm up better than solely a 5min walk. Mainly just looking for any tips on easing calf tightness and encouragement that it will get easier and I will get faster one day!","upvote_ratio":1.0,"created_utc":1674250743.0},{"title":"Tomorrow I’ll run my fist 5k race.","author":"igorapmonteiro","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10gie6a\/tomorrow_ill_run_my_fist_5k_race\/","text":"I’m a bit nervous and trying to stay calm. Obviously I’m not running for podium, but I’ll do my best. Wish me luck.\n\nEdit:  title first**","upvote_ratio":1.0,"created_utc":1674175139.0},{"title":"How much does elevation change matter? I ran Wednesday and today at roughly the same time, but at higher elevation gain and loss today. I felt more exhausted today, I’m thinking it’s due to the steeper inclines on my road compared to the park I run at normally","author":"SlikDik77","url":"https:\/\/i.redd.it\/ry4ekni8q9da1.jpg","text":"","upvote_ratio":1.0,"created_utc":1674232981.0},{"title":"Another week in the bag, this was a hard one.","author":"Eriol_Mits","url":"https:\/\/i.redd.it\/1mkhp96q24da1.jpg","text":"","upvote_ratio":0.97,"created_utc":1674164541.0},{"title":"[WEEKLY THREAD] FEATS OF FRIDAY","author":"C25k_bot","url":"https:\/\/www.reddit.com\/r\/C25K\/comments\/10gt3vm\/weekly_thread_feats_of_friday\/","text":"Let's brag a little. What did you accomplish this week?","upvote_ratio":1.0,"created_utc":1674208863.0}]