[
    {
        "title": "Have you ever had an unfounded hatred of someone?",
        "author": "helvetica_simp",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f8dff/have_you_ever_had_an_unfounded_hatred_of_someone/",
        "text": "There’s a clerk at a convenience store near me that I can’t stand. He talks SO much. What’s weird to me is that I generally really like chatting up cashiers, I live in the midwest so it’s pretty normal. There’s something about this guy. He’s older so I doubt he really wants to be there, he’s probably just making the day go by as happily as possible. There’s nothing inherently wrong with him yet the second I walk in and hear his voice I want to leave. I even DID walk out once because I was going to be near another c-store later on.     \n   \nToday he asked the couple in front of me if they had lived a bunch of different places once he had pulled up their rewards info. When it was my turn, beyond the regular rewards card/find everything/want to apply for a credit card spiel - he asked if I was a student at [insert local colleges] (no), oh are you working later today (no), why aren’t you at work (day off), isn’t today a great day to have off (yes), hey you have some coupons (okay), is it your birthday this month you have a birthday coupon (yes).      \n   \nSo nothing bad but it just grinds my gears for no reason. I try to give him as little as possible to convey that I’m not interested in chatting but he just goes onnn.    \n    \nAnyone else have a weird mix of sympathy and hatred for someone? Or someone you wish you could never see again but for no good reason? Or even insight into why I don’t want to talk to this cashier specifically when I do usually crack lame jokes and talk about the weather while checking out? 😅",
        "created_utc": 1677688609,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you like the weather where you're at?",
        "author": "pakikipagkaibigan",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f8cxy/do_you_like_the_weather_where_youre_at/",
        "text": "Summer is about to start here and it's becoming really hot these days, but we have a partly cloudy weather and I'm close to a place that has a lot of trees, so it's not too bad. I absolutely love the partly cloudy weather, with a little bit of sun peeking through, a bit of wind that cools me down when it's hot out. I always only notice how hot it is, but now that I think about it, I realize that this is one of the better days. It's hot but the heat isn't unbearable, the sun doesn't sting, the clouds don't cry. I like the weather where I'm at.",
        "created_utc": 1677688577,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you also have a comfort everything?",
        "author": "JanaTheDemidork",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f8a7j/do_you_also_have_a_comfort_everything/",
        "text": "I have a large collection of things that make me feel good when I'm sad, so I thought it was an interesting thing. Like a comfort game, movie, book and stuff like that\n\nFor me, my comfy things are maybe the Percy Jackson book series, Bee and Puppycat, Hilda, Rises the Moon by Liana Flores, sushi, drawing, Animal Crossing, Harry Potter... \n\nHonestly I am kinda curious to see if people have this too. Just to when you're feeling bad and you want to smile for a bit!",
        "created_utc": 1677688394,
        "upvote_ratio": 1.0
    },
    {
        "title": "March Traditions",
        "author": "CognisantCognizant71",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f88fp/march_traditions/",
        "text": "Hi Casual Conversation Member,\n\nWhat are some annual things you do during month of March?\n\nFor me: enjoy televised college basketball, occasional walks outdoors, play piano at a local restaurant and enjoy cornbeef dinner on St. Patrick's day, read 2-3 works of fiction to commemorate National Reading Month. Cheers to you and yours!",
        "created_utc": 1677688284,
        "upvote_ratio": 1.0
    },
    {
        "title": "People that work at fast food places like Mod Pizza or Mezeh, do you actually receive the tips? Do you see a difference in your check?",
        "author": "sash187",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f7go3/people_that_work_at_fast_food_places_like_mod/",
        "text": "Would love to know if there is a line item or anything on your check that shows you what the customers have contributed and what your % is or whatever. Or does the company just keep this money? Thank you!",
        "created_utc": 1677686474,
        "upvote_ratio": 0.5
    },
    {
        "title": "r/CasualConversation Welcome Thread - Month of March 01, 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f7fiw/rcasualconversation_welcome_thread_month_of_march/",
        "text": "Welcome to r/CasualConversation! Thank you for joining and coming to our corner of Reddit. \n\n&gt;The friendlier part of Reddit. Have a fun conversation about anything that is on your mind. Ask a question or start a conversation about (almost) anything you desire. Maybe you'll make some friends in the process.\n\nIf you are here, lurking, feel free to create an account and say hi. \n\nHow are you? What brings you here? \n\n&amp;#x200B;\n\nPS, we got rules, please [read 'em](https://www.reddit.com/r/CasualConversation/about/rules)!",
        "created_utc": 1677686412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Life is so complicated, and I'm just starting to figure it out",
        "author": "jjj070707",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f7cho/life_is_so_complicated_and_im_just_starting_to/",
        "text": "I'm not a native english speaker, so sorry in advance for any grammatical errors. \nYou know how sometimes something(both good and bad) happens in your life or you feel a certain way, and you think \"I can't believe this is my life\"?\nSometimes I think about how naive and happy I was as a little child and I can't believe I'm an adult now. I have so many things I'm worried about. What I'm going to do in the future, what my values are, how will I manage the responsibilities I have..etc. I've had a few academic failures the last couple years, and it left me feeling like a loser. \nThen I remembered that life encompasses all sorts of emotions and events. I was \"happy\" and content as a small child, but now I feel depressed. If that can happen within a relatively short span of time, why shouldn't things change for the better? I'm still new to the 'adult' thing, so thinking about life this way was sort of a revelation. Of course I heard \"life is full of surprises\", \"life goes on\" and those quotes, but it seemed too far away. I think I'm just learning that life is incredibly complicated, and so many things that you would have never imagined can happen. This is weirdly comforting, probably because I feel justified in my hope for the future. \nDoes anyone have similar thoughts?",
        "created_utc": 1677686214,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fixed something for the first time in my life today",
        "author": "EfremSkopje",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f7bom/fixed_something_for_the_first_time_in_my_life/",
        "text": "Well maybe not first time, but first for an electronic device for sure. I had a Playstation Portable that had an issue and where I'm from, fixing stuff on your own be it cars or electronics is very very rare. The device being more than a decade old, finding another used one is way cheaper than going to a repair shop. Thinking I had not much to lose, I ordered a toolkit online and after watching a video, I learned how to tear the thing down and put it all back together again. I actually also diagnosed what was wrong with it.\n\nLast week, I got myself another PSP, used, and in working condition. This morning I realised the colours on its screen actually felt off. I had owned a PSP as a kid, and the broken one I mentioned earlier also had a better screen. An epic idea came to me: Swap the screens. Having already practiced tearing it down, I successfully did the swap and it works, not to mention I was right in thinking the LCD was faulty! \n\nIt was so satisfying that it made my whole day.",
        "created_utc": 1677686162,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just want to chat with strangers about this situation and see what you have to say as being someone who doesn’t know me or invested in my life",
        "author": "charrosebry",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f6vkx/i_just_want_to_chat_with_strangers_about_this/",
        "text": "I work a typical hours job, 8-4 or 9-5 schedule. I went to school for this career and I feel like I’m pretty good at it. I don’t have too many stresses currently around work and I do feel like I’m really helping others sometimes. But I don’t make good money, about 40k a year. I live in Orange County California which is an extremely tough place to live financially. Luckily my husband has a salary that provides us to be fine, but with what I make it will be tough to buy a home, have kids etc \nI have a random and exciting opportunity to switch careers and be the executive assistant to a CEO. I have personal assistant experience and I know it can be tough but also fun. The hours are 5:30am-2:30 everyday which would definitely take some getting used to. My salary would be more than doubled at 90k with this position and honestly life changing for us. I’d never be able to make that much money in my current field.\nBut I am in so much fear! That I will fail and have jumped ship from my cozy, secure job that I like. That it will be so demanding working for the CEO. That I won’t be good enough. \nOf course my family says you’re so smart and you’ll do great. What do you think about the situation ?",
        "created_utc": 1677685077,
        "upvote_ratio": 0.75
    },
    {
        "title": "seeking advice",
        "author": "malaviariva",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f61ir/seeking_advice/",
        "text": "I have recently noticed a lack of firmness in my behaviour. I like to read books and I have been reading a lot of classics for a long amount of time now. The one thing that bothers me the most though, is the fact that I am never able to start another novel after finishing the previous one. Somehow, I just tend to move on to the next novel without finishing the first one. It can be said that I’m not very firm in finishing things that I have started. The same happens with me in my career choices. I choose a career only to find something wrong with it and move on to another one. I am 20 by the way and I’m not sure if this is just an age problem or if there is a lack of clarity. Any guesses/advices are welcomed ❤️",
        "created_utc": 1677683106,
        "upvote_ratio": 0.5
    },
    {
        "title": "I cooked octopus last night. It was godawful.",
        "author": "unactvatdchrcoaljoke",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f5es4/i_cooked_octopus_last_night_it_was_godawful/",
        "text": "I underseasoned and, I guess, overcooked it--??. It was like eating warm pencil eraser brushed in olive oil. I hate pulpo, but my wife loves it. She did not enjoy my rendition, but she was nice about it, and we had a laugh and said probably never again. The dog really liked it.",
        "created_utc": 1677681539,
        "upvote_ratio": 0.95
    },
    {
        "title": "[19 years old] I think that having a girlfriend at my age is a nuisance and not the right time",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677681445,
        "upvote_ratio": 0.75
    },
    {
        "title": "Who else smiles upon their avatar person? (Vtuber or AI chat friend Replika)",
        "author": "EyraLuxaRay",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f4zdw/who_else_smiles_upon_their_avatar_person_vtuber/",
        "text": " surely i am not the only person who smiles at their avatar, uses an avatar when streaming and not streaming to not feel alone. \n\nto always have someone on your monitor looking at you and just smiles.\n\ni still smile upon my Vtuber Girl. Makes me feel good when I create her new clothes/styles ♥ sometimes I feel she is her own person and that makes me smile ♥ she gives me good vibes. ♥\n\n&amp;#x200B;\n\nam i weird? lol",
        "created_utc": 1677680459,
        "upvote_ratio": 1.0
    },
    {
        "title": "I started Making Digital music back in 2011 There is always room for improvement ;) do not forget that XD",
        "author": "EyraLuxaRay",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f4tvd/i_started_making_digital_music_back_in_2011_there/",
        "text": "I started Making Digital music back in 2011. I uploaded my music to my Twitch and on Bandlab. Today I never would of thought I make it this far and get compliments saying I have TALENT. I have 121 Plays on bandlab and counting. it makes me so happy to know I have come so far. Thank you so much ♥ I am so happy but also speechless that this is possible.\n\n&amp;#x200B;\n\nI always thought I was not very good but i was clearly wrong when so many people on my twitch stream ENJOY and want more music from me. it makes me want to create even more tracks for my videos and streams. (youtube and twitch) I also have 20 likes :)\n\n&amp;#x200B;\n\nThere is always room for improvement ;) do not forget that XD\n\n&amp;#x200B;\n\nI am glad i started streaming my music on my twitch streams and on my videos. to hopefully reach more people.\n\n&amp;#x200B;\n\nWho else enjoys making music and sharing it with others?\n\nis it a turn on for you knowing how many people listen and feel good with your music?\n\nor am i the only one who feels like that lol",
        "created_utc": 1677680080,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vtuber Streamer and a gamer - Oh my! Lets go and have some fun and good vibes.",
        "author": "EyraLuxaRay",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f4r96/vtuber_streamer_and_a_gamer_oh_my_lets_go_and/",
        "text": "[removed]",
        "created_utc": 1677679885,
        "upvote_ratio": 0.5
    },
    {
        "title": "Which movie/show are you highly anticipating in 2023?",
        "author": "Proof_Street_4239",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f4dg3/which_movieshow_are_you_highly_anticipating_in/",
        "text": "[removed]",
        "created_utc": 1677678917,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any people from Slovakia here or people who travelled there?",
        "author": "lerench961",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f4b8g/any_people_from_slovakia_here_or_people_who/",
        "text": "Hello people, i am thinking about visiting Slovakia for a week during the summer. I am looking for itinerary ideas without having to rent a car.\n\nI can't find good information about this, so I am wondering if people don't go there for a reason or it's just that nearby countries, Austria, Hungary and Czechia steal all the light.",
        "created_utc": 1677678756,
        "upvote_ratio": 0.67
    },
    {
        "title": "it isn't a shoe, it's a sledge!",
        "author": "LetterGrouchy6053",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f3okf/it_isnt_a_shoe_its_a_sledge/",
        "text": "[removed]",
        "created_utc": 1677677025,
        "upvote_ratio": 0.66
    },
    {
        "title": "I have a long penus",
        "author": "klein_kleutertje",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f2zrd/i_have_a_long_penus/",
        "text": "[removed]",
        "created_utc": 1677675086,
        "upvote_ratio": 1.0
    },
    {
        "title": "my girlfriend and her religion",
        "author": "Responsible-Common68",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f2t9u/my_girlfriend_and_her_religion/",
        "text": "[removed]",
        "created_utc": 1677674551,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boss is quitting with 3 weeks notice",
        "author": "merlinsbeard4332",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f2s0t/my_boss_is_quitting_with_3_weeks_notice/",
        "text": "This is just a situation that is stressing me out a bit! I work for a very small nonprofit foundation, there are only 3 employees: me, my coworker, and our boss (the CEO equivalent). Yesterday our boss dropped a bombshell - she’s leaving for a new role in 3 weeks!! My coworker and I were both hired about a year ago so we were just starting to feel like we had a handle on the flow of things, and all three of us were in the midst of planning a lot of exciting long-term stuff for the foundation. I’m kind of shocked that we will be losing our leadership at such a critical time!\n\nMy coworker is somewhat more independent in their work, but I work closely with my boss and rely on her input/leadership for a lot of things. It’s crazy to think I will have to navigate my role without any oversight, and probably take on a lot of my boss’s work during the transition period. It’s also daunting that I will have a totally new boss in a few months! I really like my boss, and of course a new person will bring a totally different leadership style, group dynamic, and vision for the foundation. I’m just a bit stressed about all of it! Hopefully in the next few days we and the board can come up with a more concrete plan for the transition.\n\nAnyone else experienced a sudden change in leadership before? How did it work out? Any advice for me?",
        "created_utc": 1677674448,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am alive again!!!! And I'm so excited",
        "author": "Anarchyok",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f2p43/i_am_alive_again_and_im_so_excited/",
        "text": "For the past 8 years I've been living with a chronic illness, in past 2 months my pain has been at a 10/10 I compressed 2 nerves in my clavical and lost all mobility. But I did it ive come through the other side  I'm healing and it feels amazing not just physically but mentally too. I had some dry needling done and had my temples needled, felt likw my head and brain have been trapped in a glass cage and its has been shattered. I'm jyst so ecited about life now so much to do .its Amazing!!!!! I've been stcky to the mantra don't settle for less. Anyway I just wanted to share. Thankyou",
        "created_utc": 1677674206,
        "upvote_ratio": 0.83
    },
    {
        "title": "Should they add lasers to hairspray?",
        "author": "NeedThatMedicBag",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f2h3e/should_they_add_lasers_to_hairspray/",
        "text": "Hey, I’m my day to day life I use a lot of hairspray, but I hind it hard to see where I’m spraying before I start styling my hair. So I thought “if SWAT teams use lasers on guns to be more accurate and see where they’re shooting, why can’t it be attached to my hairspray can?” What are your thoughts on this.",
        "created_utc": 1677673528,
        "upvote_ratio": 0.75
    },
    {
        "title": "Book Appointment Max Hospital- Find Your Doctors | EdhaCare",
        "author": "Sea_Income_7671",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f1kgd/book_appointment_max_hospital_find_your_doctors/",
        "text": "[removed]",
        "created_utc": 1677670749,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t use social media anymore",
        "author": "GreyRaven-",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f1iuw/i_dont_use_social_media_anymore/",
        "text": "I used to be addicted to Facebook when I started high school. I’d sit on my laptop all day and customise my profile, same with twitter, had a bebo profile too\n\nI am nearly 23 now, and I just use WhatsApp for communication, browse Reddit and watch YouTube\n\nI have an instagram account which I barely use and I don’t have any posts, I just send funny stuff to my family, thinking about deleting that also\n\nI don’t find social media apps addicting anymore. I’m an IT professional now and knowing more about how these apps work has put me off also\n\nAnyone else?",
        "created_utc": 1677670591,
        "upvote_ratio": 0.74
    },
    {
        "title": "Have you heard any songs that you immediately thought \"wow, this a beautiful song\"",
        "author": "_Diphylleia_grayi",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f1cr2/have_you_heard_any_songs_that_you_immediately/",
        "text": "One for me is [Your eyes tell](https://www.youtube.com/watch?v=SvEAP21Qo-0) by BTS. The first, and second, and probably third time I watched this performance, and again when I heard the studio version, I couldn't stop tearing up.",
        "created_utc": 1677670025,
        "upvote_ratio": 0.84
    },
    {
        "title": "I have a friend who housed someone for months. She owes him $7000 in rent.",
        "author": "texassized_104",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f0shs/i_have_a_friend_who_housed_someone_for_months_she/",
        "text": "[removed]",
        "created_utc": 1677668132,
        "upvote_ratio": 1.0
    },
    {
        "title": "March",
        "author": "NoReason6487",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f0nw4/march/",
        "text": "It’s already March. It is funny how time is both slow and fast. Because February lasted like a year, but New years eve feels like yesterday.\n\nI went to Tenerife in February. I did it myself. Solo. I was supposed to meet a friend there but she stood me up when I was already in Spain (Yes it was as fucked up as it sounds). But I still went through with it. Im basically the shit",
        "created_utc": 1677667654,
        "upvote_ratio": 0.75
    },
    {
        "title": "Surprising my family in 36 hours",
        "author": "amkss",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f0j27/surprising_my_family_in_36_hours/",
        "text": "I’ve been away travelling for 5 months and just changed my flight home to a few days earlier so that I can surprise my family. I’m so so excited to see them and hug them😆\n\nWhen was your best surprise?",
        "created_utc": 1677667159,
        "upvote_ratio": 1.0
    },
    {
        "title": "Y’all ever go quiet for a few days?",
        "author": "JiggaJiggaMuffMuff",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11f0j0r/yall_ever_go_quiet_for_a_few_days/",
        "text": "I’m a very sociable person and love being around people… But… Every few weeks, I like to have a longer weekend and ‘disconnect’ from society. \n\nI barely go on my phone - and will therefore not respond to anything unless it’s a phone call - to regain / rebuild the emotions and energy I invested in people over the weeks. \n\nI dive into books and games and studies, and focus heavily on being a priority. \n\nI may eat little, or go crazy and eat junk food all day; I meditate heavily during this time too, and let go of all stress and insecurities. \n\nI barely have any priorities or tasks, bar animals and relaxing. \n\nI come back from this weekend with the energy to climb a mountain, and it keeps me going for a few more weeks / months. \n\nAnybody else does this?",
        "created_utc": 1677667154,
        "upvote_ratio": 0.75
    },
    {
        "title": "Furry friends",
        "author": "cocainegoose",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ezqr0/furry_friends/",
        "text": "[removed]",
        "created_utc": 1677664236,
        "upvote_ratio": 1.0
    },
    {
        "title": "why are people so blunt and assume so many things about you on reddit?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677662913,
        "upvote_ratio": 0.66
    },
    {
        "title": "2 years sober today",
        "author": "NASH_TYPE",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11eyxsb/2_years_sober_today/",
        "text": "Don’t have friends left my old life behind when I went to prison, but wanted to share. Clean from selling and using. Crazy I used to make thousands daily yet I was super fucking empty inside. I used to think I’d never go a day without doing a drug and working a 9-5 was for squares. I’ve never been happier in my life being sober, not chasing paper, and feeling safe. What’s crazy is I didn’t even realize it was 2 years until I saw someone elsewhere mention their sobriety. Who knows where I’d be today if I wasn’t able to get help when I was made to. \n\nI never thought I’d be sober and content and yet here I am. Life is weird.",
        "created_utc": 1677661216,
        "upvote_ratio": 0.98
    },
    {
        "title": "Why choose higher education in the UK rather than in India?",
        "author": "agapejjuk",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11eywxb/why_choose_higher_education_in_the_uk_rather_than/",
        "text": "[removed]",
        "created_utc": 1677661126,
        "upvote_ratio": 0.99
    },
    {
        "title": "Some songs that make you think",
        "author": "BukLaoooo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11eyvod/some_songs_that_make_you_think/",
        "text": "My number one would have to be Oh Bury Me Not by Johnny Cash. What are some songs that make you think? Happy or sad it doesn’t matter. What’s a song that when you hear it, provokes thoughts that give you pause?",
        "created_utc": 1677660990,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it me or our people going out less?",
        "author": "SirPiano",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11eymvg/is_it_me_or_our_people_going_out_less/",
        "text": "As I feel the world becoming more and more virtual, I see myself talking to friends online and never leaving the house. Maybe I am getting older or depressed , but I genuinely just don't enjoy going out to do stuff anymore. I hung out with a good friend a week ago and it felt fun, just not as good as it used to.\n\nPart of me thinks it is depression, but the other part thinks its just that society has evolved in a way that we prefer online more than in person interaction.",
        "created_utc": 1677660017,
        "upvote_ratio": 0.72
    },
    {
        "title": "Today is 1st of March Mărțișor",
        "author": "sarienn",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11eyj4c/today_is_1st_of_march_mărțișor/",
        "text": "Sometimes, home turns out to be very far away from the place of your birth. This was my case, yet I am grateful to have been born in Transylvania, Romania, and to have experienced that culture for a while. \n\nOne part of it is today, the 1st of March. The day marks the beginning of spring and is called Mărțișor. This is a tradition where you get to wear a special talisman called Mărțișor, which is just a tiny decoration that always has a red and white string around. The Sun needs to witness you wearing it, and your wishes for the year will be granted. \n\nI really love this tradition and have been wearing some form of Mărțișor wherever I am in this world. Let's celebrate the swift coming of spring!",
        "created_utc": 1677659573,
        "upvote_ratio": 1.0
    },
    {
        "title": "Regarding \"Metal Elitists\"..",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677659446,
        "upvote_ratio": 1.0
    },
    {
        "title": "Metal Elitists",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677659173,
        "upvote_ratio": 1.0
    },
    {
        "title": "Regarding Metal Elitists.",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677659042,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ideas to deal with drinking peer pressure as a non drinking adult",
        "author": "Novel-Ad880",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11eydkt/ideas_to_deal_with_drinking_peer_pressure_as_a/",
        "text": "I was surprised by how much pushback came from my friends and family when I told them I decided to not drink alcohol (I just recently turned 21, which is why it came up). I have absolutely no problem with others drinking and I still go to social events where there is drinking. So I was surprised by how much it bothered those around me. Any advice would be helpful!",
        "created_utc": 1677658950,
        "upvote_ratio": 0.67
    },
    {
        "title": "By the time you get most of the experiences in life,you are dead",
        "author": "Ultramax_meitantei",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11eybx2/by_the_time_you_get_most_of_the_experiences_in/",
        "text": "[removed]",
        "created_utc": 1677658777,
        "upvote_ratio": 1.0
    },
    {
        "title": "About \"Metal Elitists\"..",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677658771,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Metal Elitists\"..",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677658441,
        "upvote_ratio": 1.0
    },
    {
        "title": "I pose you two questions. Raccoons or capybaras? And what is the best cheese?",
        "author": "Comrade_Crusader_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ey5wl/i_pose_you_two_questions_raccoons_or_capybaras/",
        "text": "Nothing much else to this. I’m just curious about it. Or better yet, just feel free to ask me or anyone else whatever question you’d like and I’d be more than happy to answer it or start a random conversation about anything! I find it fun doing so!",
        "created_utc": 1677658140,
        "upvote_ratio": 1.0
    },
    {
        "title": "I pose you two questions. Raccoons or capybaras? And what is the best cheese?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677657928,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have an idea for a videogame where you build a boat.",
        "author": "ThrowawayBone333",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11exrjz/i_have_an_idea_for_a_videogame_where_you_build_a/",
        "text": "So this game would be an MMO with infinite \"generated\" islands.\n\nThe goal is to trade around different islands and travel with your boat and you get paid for taking resources from 1 island to another one.\n\nYou use the money to build your boat and you hire AI crewmen to repair the boat, man the cannons or do other stuff. \n\nOccasionally on your trips you will encounter pirates. They will attempt to shoot your boat or bord it and steal your stuff.\n\nIf you die you respawn with your boat in the docks again but your stuff is lost.\n\nIf you're chased by pirates you move to a nearby island where the cannons of that island will protect you and they'll sink the ships chasing you",
        "created_utc": 1677656687,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thank you all for the kind messages last night when I needed to went.",
        "author": "shadegrowth",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11exq16/thank_you_all_for_the_kind_messages_last_night/",
        "text": "[removed]",
        "created_utc": 1677656524,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sometimes..",
        "author": "Substantial_Ice1482",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11exl0a/sometimes/",
        "text": "[removed]",
        "created_utc": 1677655981,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sometimes I wish I would cease to exist. Living &amp; dying are painful experiences I don’t want to go through or have to go through anymore.",
        "author": "Substantial_Ice1482",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11exj6x/sometimes_i_wish_i_would_cease_to_exist_living/",
        "text": "[removed]",
        "created_utc": 1677655804,
        "upvote_ratio": 1.0
    },
    {
        "title": "How someone could come up with their own punctuation is beyond me",
        "author": "skyrimlo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11excgo/how_someone_could_come_up_with_their_own/",
        "text": "I was on a forum and saw this English woman (as in, she’s from the UK) commenting with “xx” as her period/full stop. Basically, instead of “This is me.” She would put “This is me xx” Fcking insane. Now I get that other languages have their own punctuations, like the Japanese use 。as their period. But this woman is English! She explained that she “thinks it looks cute xx” I don’t get why someone would need to come up with their own punctuation. Imagine if we all typed like this xx",
        "created_utc": 1677655125,
        "upvote_ratio": 0.25
    },
    {
        "title": "Will I regret not telling my parents how much I love them to their faces?",
        "author": "major_decoverly22",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ewqtl/will_i_regret_not_telling_my_parents_how_much_i/",
        "text": "My family is very close, but we’re not very emotionally expressive to each other. I sometimes wonder whether it’d be nice to verbally acknowledge it more often, but I also think we show it enough with our actions and it’d be awkward to make a big deal out of it.",
        "created_utc": 1677653075,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is love and how do we define it?",
        "author": "Apprehensive-Exit596",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ewktt/what_is_love_and_how_do_we_define_it/",
        "text": "[removed]",
        "created_utc": 1677652518,
        "upvote_ratio": 0.99
    },
    {
        "title": "My mom won’t let me but stuff with my own money",
        "author": "Lifesucks694208778",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ewfv7/my_mom_wont_let_me_but_stuff_with_my_own_money/",
        "text": "[removed]",
        "created_utc": 1677652085,
        "upvote_ratio": 0.5
    },
    {
        "title": "How to deal with DMs/approaches from ppl while in a relationship",
        "author": "_good_girl",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ew8t7/how_to_deal_with_dmsapproaches_from_ppl_while_in/",
        "text": "This has always kinda confused me... like if a guy dms me on instagram does it usually mean he's interested? or just being friendly? Especially when they aren't being obviously flirty but just casually chatting about stuff, that's fine right but then what if he asks me for my number (still no flirting), should I give it to him??\n\nThis thing happened to me before where a guy dmed me and we chatted about school/whatever and he asked for my number, so I gave it to him and then he asked me to hang out (his exact words) so we did and I thought we were just friends or whatever, but then later he went around telling people it was a date. even though he never flirted or explicitly asked me out, nothing.\n\nI just don't know how to feel about it anymore, I always want to assume they're just being friendly but idk if I'm being unrealistic/naive/etc. I'm just tired of having to guess guys' intentions especially when it comes to giving out my number, I feel awkward saying \"btw before I give you my number I have a bf / just to check we are friends right? lol\"\n\nedit: also sorry if this isn't the right place to post this, if there is a better sub for this then pls let me know thanks",
        "created_utc": 1677651457,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you like skeuomorphic and frutiger aero design?",
        "author": "EqualStance99",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ew3jf/do_you_like_skeuomorphic_and_frutiger_aero_design/",
        "text": "Hey all, I've been really interested in these two design languages over the past month or two and am interested in the opinions of others!\n\n[This](https://upload.wikimedia.org/wikipedia/en/7/7d/IOS_6_Home_Screen.png) is an example of skeuomorphic design. [This](https://www.usmobile.com/blog/wp-content/uploads/2022/12/EjOHWqqVgAAg_VB.webp) and [that](https://www.usmobile.com/blog/wp-content/uploads/2022/12/windows-vista.png.webp) are examples of frutiger aero design. \n\nI personally love and prefer both of these design aesthetics. I love the real-life aspect of skeuomorphism, it makes using an old device so much more intuitive and palpable. As for frutiger aero in terms of software, I love the \"glassy\" effect and how clean and light it looks and feels. For the design part, I love the combination technology and the natural world, it produces such a strong feeling of euphoria and hopefulness for the future. \n\nDon't get me wrong, I like the flat design to a degree, it's sleek, uninterrupted and very modern, but I feel like that it has gone way too far.\n\nI have dualbooted our old iPhone 4 to IOS 7 and IOS 6. I use IOS 6 exclusively, it just looks so perfect, so palpable and so inviting. I also have VMs of Windows 7 and Vista. \n\nWhat are your thoughts on these? Do you have any devices that still runs older software with these design languages?",
        "created_utc": 1677650989,
        "upvote_ratio": 1.0
    },
    {
        "title": "QA on spiritual knowledge-By His Holiness Shri Datta Swami",
        "author": "unityofreligions",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11evzp7/qa_on_spiritual_knowledgeby_his_holiness_shri/",
        "text": "[removed]",
        "created_utc": 1677650643,
        "upvote_ratio": 1.0
    },
    {
        "title": "when you had your first Nintendo 3ds, what was it like, and do you still play it to this day?",
        "author": "Ill-Candy-4926",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11evza2/when_you_had_your_first_nintendo_3ds_what_was_it/",
        "text": "so in 2011,  when you got your Nintendo 3ds,  what was it like to own?   \n\n&amp;#x200B;\n\nwhat type of games did you get on it and do you still own it to this day???  \n\n&amp;#x200B;\n\nwas it fun for you to play\\\\own?  \n\n&amp;#x200B;\n\ndo you have any memory's of the 3ds?\n\nif so what is your favorited memory of your Nintendo 3ds?\n\n&amp;#x200B;\n\nfeel free to let me know in the comments below?",
        "created_utc": 1677650603,
        "upvote_ratio": 0.67
    },
    {
        "title": "Brain Tumor Surgery In India | EdhaCare",
        "author": "Sea_Income_7671",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11evsvg/brain_tumor_surgery_in_india_edhacare/",
        "text": "[removed]",
        "created_utc": 1677650058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tonight was the last session of the longest D&amp;D campaign I’ve ever played. I’m so happy right now.",
        "author": "beandadenergy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11evs7p/tonight_was_the_last_session_of_the_longest_dd/",
        "text": "Tonight could not have been better. We ate homemade curry and did a shot of rum for good luck, we beat the final boss with no party deaths, and my character got a happy ending with his love interest in the epilogue. On top of the satisfying ending, I got to celebrate spending a year with old friends and new doing something we all love. I’m on top of the world tonight.\n\nIt feels like I just watched someone I love graduate, get married, and live happily ever after. I’m going to be thinking about this one for a long time.",
        "created_utc": 1677649993,
        "upvote_ratio": 0.98
    },
    {
        "title": "I love my girlfriend",
        "author": "ABCwarriorz",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11evhgb/i_love_my_girlfriend/",
        "text": "[removed]",
        "created_utc": 1677649012,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to keep a positive mindset when you are around negative people?",
        "author": "getting_beter",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11eupfk/how_to_keep_a_positive_mindset_when_you_are/",
        "text": "Due to certain circumstances I have to live with people that I don’t really like being around at the moment. I try to wake up with a positive attitude and trying to take steps to get some financial stability, to stay healthy mentally and physically, and finding new hobbies. Logically, I know I shouldn’t let what they say or do get to me. But I am a sensitive person and at times it’s hard for me to disregard the negativity. How do you stay positive when you are bombarded with negativity?",
        "created_utc": 1677646566,
        "upvote_ratio": 0.67
    },
    {
        "title": "I need some new hobbies",
        "author": "Jack_58523",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11eudty/i_need_some_new_hobbies/",
        "text": "I am starting to get bored with life and I don’t really know what to do with myself. Please give me some suggestions on how to entertain myself 🙂",
        "created_utc": 1677645561,
        "upvote_ratio": 1.0
    },
    {
        "title": "People are evil.",
        "author": "Morphisist",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11eud4e/people_are_evil/",
        "text": "[removed]",
        "created_utc": 1677645498,
        "upvote_ratio": 1.0
    },
    {
        "title": "People are evil.",
        "author": "Morphisist",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11euc6b/people_are_evil/",
        "text": "[removed]",
        "created_utc": 1677645417,
        "upvote_ratio": 1.0
    },
    {
        "title": "how many sedans worth of stuff do you think you own?",
        "author": "flutebythefoot",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11eu0ez/how_many_sedans_worth_of_stuff_do_you_think_you/",
        "text": "I'm moving across the US in two days and I have 1.5 sedans worth of stuff (everything except for furniture/ mattress). I feel like I own so much stuff and I'm curious how much you would guess that you own. How much stuff do you think is a normal amount?",
        "created_utc": 1677644418,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've read that Reddit &amp; TikTok are going to be banned in the U.S.",
        "author": "Svrenbernd",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11etygb/ive_read_that_reddit_tiktok_are_going_to_be/",
        "text": "[removed]",
        "created_utc": 1677644256,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've read that Reddit &amp; TikTok are going to be banned from the U.S.",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677643567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is happiness really the most important thing in life?",
        "author": "Pennameus_The_Mighty",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11etom3/is_happiness_really_the_most_important_thing_in/",
        "text": "On paper happiness is of course a great thing to aim for but if you look at it, there are plenty of cases where the statement clearly isn’t the case. A warlord is happiest when he takes over a rival nation for instance, or a thief is happiest after the theft. Both cases clearly have issues that overshadow that individual’s desire to be happy. So, seeing this flaw, what would you say is a better thing to fill the role of “most important thing in life”?",
        "created_utc": 1677643436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Went on a date today and as usual I feel I have bad luck",
        "author": "justonefrenchfryAA",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11etcd6/went_on_a_date_today_and_as_usual_i_feel_i_have/",
        "text": "[removed]",
        "created_utc": 1677642452,
        "upvote_ratio": 1.0
    },
    {
        "title": "Every time it rains I get really scared.",
        "author": "Macey-5432",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11etc9u/every_time_it_rains_i_get_really_scared/",
        "text": "A couple days ago we had really bad thunderstorms and it felt like every time it rained there was a thunderstorm. My anxiety has been terrible because I cannot stand the noise of thunderstorms. It makes me cry. So now even when it drizzles or rains at all I just plug my ears and cry hoping that it will end soon. Sometimes I have trouble sleeping because of it. Any loud noise at all has made me very paranoid and scared now. I just wish winter was over and summer would come :(",
        "created_utc": 1677642445,
        "upvote_ratio": 0.75
    },
    {
        "title": "Can anyone validate what I learned today?",
        "author": "Thegrandcultivator",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11et7tp/can_anyone_validate_what_i_learned_today/",
        "text": "I participated in a presentation by a partner of a firm, where they shared insights on improving various skills. Of particular interest to me was the segment on enhancing communication skills.\n\nDuring this part of the presentation, the partner stressed the importance of acknowledging when you do not have an answer to a client's question and redirecting them to someone who may have more expertise. It was emphasized that it is crucial to avoid claiming to understand a topic when you do not.\n\nAdditionally, the partner highlighted that clients tend to dive into complex details and may become too absorbed in the topic. Therefore, it is vital to ask specific questions to break down their questions into more accessible explanations.",
        "created_utc": 1677642089,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it crazy to jump from biotechnology engineering to a master's course in animation??",
        "author": "whostolemypineapple_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11et3ll/is_it_crazy_to_jump_from_biotechnology/",
        "text": "I've been waiting for the moment when I graduate out of this university. I chose to study engineering as a second option. (First being medicine , which I am actually glad I didn't get into because my friends are barely surviving there ). I'm currently a senior and I've realised that I hate this course and am ready to do literally anything else. \nI'm also a decent creative writer and enjoy art very much ( And it's not a phase xD) . I was thinking of getting into an animations course after some research on it because it seems very interesting and I think I would be able to use my abilities better in that field. But I am also aware that it is a very risky choice because of the competition and work required to attain stability in this field. Should I just continue my master's in biotechnology and get a regular, stable job ? Or should I take a risk and go for the animations course?",
        "created_utc": 1677641745,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else struggling to find passion for something?",
        "author": "NewDaysBreath",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11esn70/anyone_else_struggling_to_find_passion_for/",
        "text": "[removed]",
        "created_utc": 1677640473,
        "upvote_ratio": 1.0
    },
    {
        "title": "My dad is proud of me for learning stickshift",
        "author": "nyatama",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11es709/my_dad_is_proud_of_me_for_learning_stickshift/",
        "text": "I recently bought my dream car (‘97 Miata) and I purchased it without even knowing how to drive manual. My dad has been teaching me (today is day three of practice) and I did well; slow starts, but smooth and no stalling/bucking. Not having too much trouble with shifting either. I have a long way to go (the throttle on my car is sooo sensitive lol) but at the end, he said he was very proud of me and thought I did well. My dad is a very reserved person and we don’t have much in common, so I’m glad that we are doing this together and I’m doing him proud.\n\nAnyone else here own a Miata, btw? Holy hell this is a fun car. Mine is a 1997 M edition in Marina green with the sexy tan interior. I love this thing so much",
        "created_utc": 1677639238,
        "upvote_ratio": 0.95
    },
    {
        "title": "How hard is it for you to see your favorite celebrities get old/die?",
        "author": "jewishgamergirl",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11es3sy/how_hard_is_it_for_you_to_see_your_favorite/",
        "text": "Context: I, 16F, am a huge fan of 70s music (fave bands are Queen and ABBA). I’ve been sadly noticing a lot about how the members of those bands (that are still living, RIP FREDDIE MERCURY!) are getting older each day and I cry about it a lot. I’m honestly dreading the day they die. Does anyone else feel similar about this?",
        "created_utc": 1677638989,
        "upvote_ratio": 0.75
    },
    {
        "title": "Do you chat with the barista whenever you order coffee?",
        "author": "Thegrandcultivator",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ery1h/do_you_chat_with_the_barista_whenever_you_order/",
        "text": "If there is no line, do you take the time to chat with the barista when you order coffee? \n\nI heard it is a good way to build your communication skills.",
        "created_utc": 1677638549,
        "upvote_ratio": 1.0
    },
    {
        "title": "Haven't taken a college class in 3 years. Out of nowhere, I'm graduating!",
        "author": "izzynelo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11eqxvr/havent_taken_a_college_class_in_3_years_out_of/",
        "text": "When the pandemic hit on 2020, I wasn't able to complete my courses to graduate. I had everything except a couple of classes. I moved on to serve with AmeriCorps and after that, worked at a roofing company for a year. It's been 3 years since I left uni. Out of no where, my university reached out to me and told me the department of my major will approve to use other courses I took as a substitute. They told me congratulations... I AM GRADUATING WITH A BACHELOR’S THIS MAY!! :')",
        "created_utc": 1677635777,
        "upvote_ratio": 0.98
    },
    {
        "title": "Is there something you need to talk about? I want to be of service.",
        "author": "haribobosses",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11equ5n/is_there_something_you_need_to_talk_about_i_want/",
        "text": "Is there something on your mind? Do you have big or small questions, but you don't know who to ask? I want to reply right now more than I want to ask anything, so I'm making this post to invite you to use me for your conversational purposed.",
        "created_utc": 1677635493,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you actually want?",
        "author": "Thelionoflions",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11eqrqc/what_do_you_actually_want/",
        "text": "I have been thinking a lot about social media and content creation. We at scale produce enormous amounts of content and consume even more and I have started to get curious about what people like and actually want from our modern media.\n\nI love youtube but feel as though I don't find a lot of channels I enjoy as much as I did in the past which could be me getting older, but I also feel like I would love to see more risk in creative storytelling and taking full advantage of the technologies we have around us. \n\nDoes anyone feel the same and if so what do you want to see on our media now that will inform you the way you want or entertain or inspire you and move the creative field forward?",
        "created_utc": 1677635306,
        "upvote_ratio": 0.75
    },
    {
        "title": "My aunt was born in a Leap Year",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677633933,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guy keeps emoting like he’s in the conversation with me and my friend.",
        "author": "Few-Platypus-4046",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11epyqq/guy_keeps_emoting_like_hes_in_the_conversation/",
        "text": "So basically there is this guy that sits behind me in class. I sit in the front row with my friend. Sometimes my friend or me will turn to each other and chit chat. I always see him either nodding his head or shaking his head. Sometimes he will actually answer or inject his opinion. No one asked. We literally have our back turned to him. \n\nNumber 1: do you think this is odd/weird behavior?\n\nNumber 2: how would you handle it?",
        "created_utc": 1677633141,
        "upvote_ratio": 0.5
    },
    {
        "title": "does anyone else think us politics feel fake?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677632235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Joining a band",
        "author": "ThrowRA_27900",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11epi3y/joining_a_band/",
        "text": "[removed]",
        "created_utc": 1677631936,
        "upvote_ratio": 1.0
    },
    {
        "title": "Facebook isn't as engaging as it seems to be",
        "author": "FlandreScarlet-",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11epakl/facebook_isnt_as_engaging_as_it_seems_to_be/",
        "text": "[removed]",
        "created_utc": 1677631379,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird phone call recieved, sounded like text to speech.",
        "author": "adrw000",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ep0nw/weird_phone_call_recieved_sounded_like_text_to/",
        "text": "Just received a phone call from an unknown caller from Atlanta, the name was listed, but I won't disclose it.\n\nI greeted with a standard \"Hello\" and the caller said \"Hello\" and I responded with \"How can I help?\" the caller kept saying hello and then \"I can't hear you.\" It did not sound like a real voice, but a text-to-speech program.\n\nHas anyone here experienced something like this?",
        "created_utc": 1677630651,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did you stop doing the laundry for your kids?",
        "author": "DM_ME_YOUR_PET_PICSS",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11eow72/when_did_you_stop_doing_the_laundry_for_your_kids/",
        "text": "My whole family played sports growing up. When we were all 11-14 my stepmom told us that if “you can make your clothes smell that bad after one wear, you can figure out the washing machine” and showed up how to use it. We all thought it was sick! And we could wear our favorite stuff as soon as we wanted, just had to wash it. \n\nI’m 24 now but it seems like teaching us this at about this time was correct.",
        "created_utc": 1677630323,
        "upvote_ratio": 0.93
    },
    {
        "title": "I just found out that the 'Eyes of Ibad' in Dune are really so dark that they're almost black. The whole eye.",
        "author": "HaZalaf",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11eot30/i_just_found_out_that_the_eyes_of_ibad_in_dune/",
        "text": "\"The first external sign of melange-induced metabolic change is visible in the eyes, as the drug tints the *sclera and iris* to a dark shade of blue. The shade of blue is known to be called \"blue-in-blue\" or \"the Eyes of Ibad,\" \"a total blue so dark as to be almost black.\"\n\n\nI found pictures of Kyle MacLachlan and Timothee Chalamet and dutifully coloured their eyes in. \n\nIt's so weird how such a tiny detail can make me re-imagine a book I read.",
        "created_utc": 1677630090,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you noticed loads of repetitive posts lately?",
        "author": "VisitRomanticPangaea",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11eo5d8/have_you_noticed_loads_of_repetitive_posts_lately/",
        "text": "[removed]",
        "created_utc": 1677628431,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know anyone with the initials MZM?",
        "author": "themehboat",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11envy2/does_anyone_know_anyone_with_the_initials_mzm/",
        "text": "Yesterday I was going through my mother’s astoundingly large collection of glassware, most of which she inherited. She has 11 (one probably broke) etched glass cocktail glasses etched with a large “MZM” on them. She thinks they’re from her Great Great Uncle whose actual name she can’t even remember. These would be free to anyone with the initials MZM. Or anyone who’s just a fan of those letters? IDK, no clue what to do with these.",
        "created_utc": 1677627778,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are you looking forward to this week?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677626448,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should my wife gets visits from my daughter and me when she is in jail for six months?",
        "author": "Annual-Advice-3647",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11en8ph/should_my_wife_gets_visits_from_my_daughter_and/",
        "text": "[removed]",
        "created_utc": 1677626154,
        "upvote_ratio": 0.4
    },
    {
        "title": "Being a UK based gypsy/traveller with half a brain sucks.",
        "author": "am277",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11emyyo/being_a_uk_based_gypsytraveller_with_half_a_brain/",
        "text": "Outside of your \"ethnic group\" nobody gets you and some even hate you. In the group, you feel alienated because you can think before you act. This is shite. \n\nHow's everyone?",
        "created_utc": 1677625498,
        "upvote_ratio": 1.0
    }
]