[
    {
        "title": "Anybody here drive for uber eats or used to drive for uber eats?",
        "author": "IAmNotAFetish",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11981l1/anybody_here_drive_for_uber_eats_or_used_to_drive/",
        "text": "I feel like the money is just ok. It's not great. It seems like it is mostly busy at night and that is when you have to do most of your driving. Is that true, though? I like that , for the most part, you can set your own hours but you generally only make like $10-12 an hour. What has been your experience driving for uber eats? Did you enjoy it?",
        "created_utc": 1677092491,
        "upvote_ratio": 1.0
    },
    {
        "title": "Life is good!",
        "author": "healthify101",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1197re4/life_is_good/",
        "text": " \n\nLife truly is a beautiful and wondrous thing! Just think about the simple pleasures that make it so special - breathing in the crisp, cool air on a bright, sunny day; playing with happy, smiling babies who remind us of the joy and innocence in the world; and marveling at the beauty and complexity of nature that surrounds us. These are the things that make life truly worth living, and remind us of the infinite potential and beauty that exists in the world around us.\n\nIt's important to take the time to appreciate these simple joys and to find moments of happiness and contentment in the everyday. Life may not always be easy, but by focusing on the good and staying optimistic, we can make the most of every moment and truly experience all the wonder and beauty that life has to offer. So let's embrace the joy and magic of life, and never forget just how truly amazing it can be!",
        "created_utc": 1677091850,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hope everyone has a beautiful sunshine day!",
        "author": "captivatedconcious69",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1197lw8/i_hope_everyone_has_a_beautiful_sunshine_day/",
        "text": "I hope everyone is having a great day!!!! Spread some shinsine and comment something good that happened today! I'm also trying to get more followers!",
        "created_utc": 1677091497,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guys who have never been in a relationship, do you feel like you miss out?",
        "author": "TalkNo9725",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1197aep/guys_who_have_never_been_in_a_relationship_do_you/",
        "text": "While waiting for the bus today, I saw a girl, she looked just like any other girl you meet on the road but there was something about her as if she had a glow, I can't describe it. I didn't have any particular inclination to go talk to her and also it would have seemed super creepy if I did. But it did make me wonder about my life and how I have always avoided relationships because of my conservative family and also because of my desire to be free of the drama that comes along with relationships, the rest of the bus ride I was questioning whether I was missing out on a part of life by not having that sort of connection with anybody.",
        "created_utc": 1677090757,
        "upvote_ratio": 1.0
    },
    {
        "title": "Building Self Confidence",
        "author": "Temple_Sarmiento",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11976ev/building_self_confidence/",
        "text": "Hey all! Socially awkward human here just looking to improve on being a conversationalist. I think this will help me improve with personal and public relationships. Leave a comment or dm me if your bored!",
        "created_utc": 1677090509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Building confidence",
        "author": "Temple_Sarmiento",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11973s5/building_confidence/",
        "text": "[removed]",
        "created_utc": 1677090341,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would rather only be able to eat breakfast food or dinner food for the rest of your life",
        "author": "Sea_Catch_630",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1196znm/would_rather_only_be_able_to_eat_breakfast_food/",
        "text": "[removed]",
        "created_utc": 1677090078,
        "upvote_ratio": 1.0
    },
    {
        "title": "my bestf will finally help me unalive myself today",
        "author": "yabboman",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1196yik/my_bestf_will_finally_help_me_unalive_myself_today/",
        "text": "how's your day going? i ate alot today and had so much fun. eent to a meetup with old friends a few days ago andi cant stop thinking about it. it was so much dfun.",
        "created_utc": 1677090012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else work in an office where the norm is to work through lunch?",
        "author": "twentysomething3",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1196i6w/does_anyone_else_work_in_an_office_where_the_norm/",
        "text": "I get so baffled by how common just working through lunch is in my office. My drive to work is pretty long so I can’t just go home but I am going to take my hour for lunch. Obviously, if I am super busy and stuff is pressed for time, I will shorten it or work through it. But so many people in my office just eat while they work if they eat at all. To the point that I feel guilty for always taking my lunch away from my desk. It feels like I’m going against the culture. \n\nAnd they aren’t skipping lunch to compensate for leaving early or anything like that. Idk, I just value that one hour away from the desk so much that if I can, I’m going to use it.",
        "created_utc": 1677088964,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I the only person who thinks most people who smiles in pictures be faking? I don't smile in damn near most of my pictures because if I try it's not gonna come off as the fakest smile ever.",
        "author": "llennaP_5",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1196fgs/am_i_the_only_person_who_thinks_most_people_who/",
        "text": "[removed]",
        "created_utc": 1677088811,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if you're happy and in therapy?",
        "author": "SeriousShane",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1196d55/what_if_youre_happy_and_in_therapy/",
        "text": "I (26m) have been doing cognitive behavioural therapy for some years now. The past couple of months I worked out a lot, took time for hobby's, met cool people through dating apps and have been doing relatively well at uni and work. I feel very confident and happy. I mostly have positive things to share during sessions. Recently, my therapist asked what I want to get out of therapy, since I seem much less dependent on it for my mental well-being. I'm not planning on quitting anytime soon. Regarding growing up and self-discovery, what questions or goals would you ask or set for yourself if you were in the same situation?",
        "created_utc": 1677088659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on Current Comics?",
        "author": "Gold_Activity_5503",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11961og/thoughts_on_current_comics/",
        "text": "[removed]",
        "created_utc": 1677087913,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just happy to be alive",
        "author": "Due-Discount4307",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1195u7j/just_happy_to_be_alive/",
        "text": "[removed]",
        "created_utc": 1677087419,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you prefer Android or Apple/IOS?",
        "author": "ConfusedBuffFucker",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11953za/do_you_prefer_android_or_appleios/",
        "text": "[removed]",
        "created_utc": 1677085695,
        "upvote_ratio": 1.0
    },
    {
        "title": "What have you purposefully lost in the lost and found?",
        "author": "blastfromthecurrent",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11952cc/what_have_you_purposefully_lost_in_the_lost_and/",
        "text": "Usually it was always coats and shoes for me, my family definitely didn’t have the money to be buying these things but once I would loose it on the bus or in the classroom I would just leave it because I was too embarrassed. They would always end up in the lost and found all dirty and scruffy and kids in school would call the kids who would go into the LF to find their stuff, dirty and poor. Being a dirty and poor kid being bullied already, I didn’t want a even bigger target on my forehead.",
        "created_utc": 1677085589,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can children demand half of their inheritance from the parent who is still living?",
        "author": "Necessary-Capital-92",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1194xkd/can_children_demand_half_of_their_inheritance/",
        "text": "My parents have passed away 18 years ago. About 5 years before they passed, my brother, 7 years older than me, demanded that our parents sell their house and give him his inheritance. I never could understand why-he and his wife made over $100,000 combined. My brother never said anything like they were in a crisis or they had a medical emergency. He just wanted it. My brother made no offers on helping them find a new place or to help them pack. In fact, my mom had cancer and dad had his second stroke. They were in no condition to pack up and move anywhere. I moved into the upstairs apartment with my kids so I could take care of my parents. My brother was furious. I ruined his plans, he screamed. I said I know. My brother thought he could bully them into selling. It was no sale.",
        "created_utc": 1677085281,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help me",
        "author": "Logical-Injury2556",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1194ilm/please_help_me/",
        "text": "[removed]",
        "created_utc": 1677084293,
        "upvote_ratio": 1.0
    },
    {
        "title": "what do you look for in a friend/acquaintance?",
        "author": "uphold_idiosyncrasy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1194fpu/what_do_you_look_for_in_a_friendacquaintance/",
        "text": "what traits or behaviours do people seek for before befriending a person?\n\nin a few weeks i'll be overseas with a bunch of people i've never met and i'd really like to be at my best and make some friends but i've never really been good at it and i thought maybe it's a behavioural issue (i'm very introverted).\n\nbut then again, different people have different preferences so maybe a few of y'alls could help me out?",
        "created_utc": 1677084100,
        "upvote_ratio": 1.0
    },
    {
        "title": "good to be here",
        "author": "VATSALA2991",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1194esw/good_to_be_here/",
        "text": " \n\nI believe that many people throughout the world are lonely, which is why they use these types of platforms to communicate, where others do not criticise you and can better understand you.\n\nI am one of them; there are times when we need someone to listen to us without passing judgement.",
        "created_utc": 1677084040,
        "upvote_ratio": 1.0
    },
    {
        "title": "GOOD TO BE HERE",
        "author": "VATSALA2991",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11941vs/good_to_be_here/",
        "text": "[removed]",
        "created_utc": 1677083193,
        "upvote_ratio": 1.0
    },
    {
        "title": "My family has been getting a Sports Illustrated magazine subscription that we didn’t sign up for! It also followed us when we moved.",
        "author": "turtleboxpenguintime",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1193xox/my_family_has_been_getting_a_sports_illustrated/",
        "text": "This has been a weird and funny ongoing occurrence. Back in 2020, one day we randomly got a SI magazine in the mail. We used to be subscribed to SI under my name like 4 years prior but my parents stopped that around 2016. This one was under my dads name, but they spelled his name wrong too. I asked everyone in my family if they had signed up and they all shrugged and said no. I didn’t complain because I do really like SI and was kinda stoked to read it again. \n\nAn additional thing to note is that we didn’t get every issue. We got like 80% of them but not all. \n\nAnyways, I eventually moved out and my parents moved across states here in the US. They moved from the south to New England, so a good distance away. \n\nWhen I went back to visit them for the holidays, I found the SI magazines there again (my mom was saving them for me). At first I thought it was because my parents set a forwarding address with USPS but when I checked the address it had their new New England address on it. \n\nI told my dad about it. At first he seemed puzzled but then he shrugged and said “well, we’re not paying for it, so it’s fine by me.”\n\nI guess I agree…but I just thought it was weird and funny. I do like the articles, they have pretty good journalists over there. What do you guys think?",
        "created_utc": 1677082906,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your go to Starbucks order?",
        "author": "Solid_Ad1205",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1193r2b/whats_your_go_to_starbucks_order/",
        "text": "Mine would have to be a cookie crumble frappe-chino 🍫☕️✨\nIt looks so pretty and its just the right amount of coffee &amp; sweet (for me 🤣)\nWhats your recommendations? Or do you not like coffee? Or do you like it black? 🖤",
        "created_utc": 1677082474,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m finally in a committed relationship and I’m happy!",
        "author": "shipierika04",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1193o24/im_finally_in_a_committed_relationship_and_im/",
        "text": "I just wanted to mention this. I’ve never been able to hold a relationship because I’ve never known what I wanted and it’s true when people say that you’ll never expect true love and that it just kinda sneaks up on you. Me (18F) and my boyfriend (19M) now had been best friends for years. We went through a lot of ups and downs and actually ended up hating each other for a good 2 years. I eventually sent him a message and a month later, we ended up being in a relationship (of course both of us were unsure if it was going to work out or not but we took the chance). We’ve now been together for a year now and we couldn’t be happier. We’ve moved in together, we have rings for each other, we hangout everyday and my favourite part is being able to just lay down next to him at the end of a long day, cuddle, and fall asleep next to each other. I never knew what true love felt like, I never understood how people could be with the same person for so long but I’ve finally found my person and I just wanted to tell somebody!",
        "created_utc": 1677082272,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whats your go to Starbucks order?",
        "author": "Solid_Ad1205",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1193mzl/whats_your_go_to_starbucks_order/",
        "text": "[removed]",
        "created_utc": 1677082204,
        "upvote_ratio": 1.0
    },
    {
        "title": "Really questioned my life at the bus stop today.",
        "author": "TalkNo9725",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1193k7x/really_questioned_my_life_at_the_bus_stop_today/",
        "text": "While waiting for the bus today, I saw a girl, she looked just like any other girl you meet on the road but there was something about her as if she had a glow, I can't describe it. I didn't have any particular inclination to go talk to her and also it would have seemed super creepy if I did. But it did make me wonder about my life and how I have always avoided relationships because of my conservative family and also because of my desire to be free of the drama that comes along with relationships, the rest of the bus ride I was questioning whether I was missing out on a part of life by not having that sort of connection with anybody.",
        "created_utc": 1677082026,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saw a girl today",
        "author": "TalkNo9725",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1193iju/saw_a_girl_today/",
        "text": "While waiting for the bus today, I saw a girl, she looked just like any other girl you meet on the road but there was something about her as if she had a glow, I can't describe it. I didn't have any particular inclination to go talk to her and also it would have seemed super creepy if I did. But it did make me wonder about my life and how I have always avoided relationships because of my conservative family and also because of my desire to be free of the drama that comes along with relationships, the rest of the bus ride I was questioning whether I was missing out on a part of life by not having that sort of connection with anybody.",
        "created_utc": 1677081928,
        "upvote_ratio": 1.0
    },
    {
        "title": "lonely people around the world",
        "author": "VATSALA2991",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1193hqk/lonely_people_around_the_world/",
        "text": " I believe that many people throughout the world are lonely, which is why they use these types of platforms to communicate, where others do not criticize you and can better understand you.",
        "created_utc": 1677081883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should we all just die when we are old ?",
        "author": "Anarates",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11936jo/should_we_all_just_die_when_we_are_old/",
        "text": "Most certainly,  it's a genuine question and not a troll or hate post. \n\nI will just put it out there , it's more of my bedtime existe. Crisis (Use of \"existe.\" Is intentional so as to symbolize a lack of overall significance and severity  since by morning I will forget it ,  but for now it will continue to rummage my mind , thus the world \"crisis\" )\n\nShould old people ... (I think rephrasing it would be better since I look more of a douchebag if I just say it simply ) \n\n\nIs there any meaning to living past the average age of retirement ? \nLike in most countries  , most employees retire at 60 , so is there any point living past that? \nYou have been married some 20 or 30 years , you have your son and may even have your grandson,  you may have achieved things (or may not have ). \nHasn't your life been ... done ?\nWhat comes next is just a senseless journey to nothingness, \nLife in itself is nothingness but in our younger years we live in this blissful illusion of \"oh, I must accomplish this\" or \"I must become a police officer\" or \"I must become rich\" or anything like this, but what comes after you have accomplished things?\nWhat comes after you have \"retired\" meaning your body is no more fit to function on the said position / designation ?\nWhat awaits you is just deterioration , you are just \"old\".The beginning to your end has certainly begun and mostly you will head closer to dusk inch by inch. \n\nWhy live then? What's the point?\n\nTo add to this, I understand things such as \"early retirement\" essentially something like \"I retired at 40, I have my life ahead of me, so much to do.\"\nBut I am afraid not everyone is getting an early retirement, thus my question, why live when you have become old?\n\nI am certain mos may remove this or people may be offended.\nSo I do apologize beforehand \n(I am apologising because my posts like these HAVE BEEN removed by mods on various subs )",
        "created_utc": 1677081237,
        "upvote_ratio": 1.0
    },
    {
        "title": "pick a number between 1-646 and i'll give you a song.",
        "author": "LE_grace",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11934nr/pick_a_number_between_1646_and_ill_give_you_a_song/",
        "text": "all songs are from my liked songs on spotify. i had fun doing this ages ago, so why not do it again? my music taste is a bit of everything, but mostly alt/indie rock or pop. still not at 666 likes songs, sadly, but maybe next time i will be lol",
        "created_utc": 1677081127,
        "upvote_ratio": 1.0
    },
    {
        "title": "pick a number between 1-646 and i'll give you a song",
        "author": "LE_grace",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11930cl/pick_a_number_between_1646_and_ill_give_you_a_song/",
        "text": "[removed]",
        "created_utc": 1677080896,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Courses You Can Take Online for Free",
        "author": "Aksharmultiservices",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1192ro4/best_courses_you_can_take_online_for_free/",
        "text": "[removed]",
        "created_utc": 1677080403,
        "upvote_ratio": 1.0
    },
    {
        "title": "I like looking at post histories to find new subs",
        "author": "ScrewedMcDude",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11922ju/i_like_looking_at_post_histories_to_find_new_subs/",
        "text": "Every once in awhile when a comment catches my eye, I will look at the user's post history to see what other subs they post in. I have found some of the greatest niche subreddits this way that I otherwise never would have stumbled across. Any stories about this to share? Other ways you like to find new subs?",
        "created_utc": 1677078552,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I fix my daily routine? What does yours look like?",
        "author": "Announcom",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11922gi/how_can_i_fix_my_daily_routine_what_does_yours/",
        "text": "I've never had a routine established ever since I was a child. I would always study, play, hang out, watch movies etc whenever I was feeling like it (or whenever I was pressured like if an exam was approaching for example). I have absolutely nothing fixed.\n\nEven when people ask me when do I sleep/wake up, I don't know how to answer because it changes nearly every day. Some days I would sleep at 12 in the afternoon and wake up 9 PM, other days I would literally sleep at 12 midnight and wake up 9 AM.\n\nI'm a college student right now, and so much of my time has been wasted already, and I do not plan to waste more time. I want to establish a daily routine and commit to it, but I'm finding it a little bit difficult in terms of planning it and in terms of dedication. This is really stressing me out a lot.\n\nWhat does your daily routine look like? Were you in my shoes before? Any tips for me?",
        "created_utc": 1677078542,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have this habit of trying to win back people after they change their attitude towards me",
        "author": "jus_vib1n",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1191qxu/i_have_this_habit_of_trying_to_win_back_people/",
        "text": "I know it's not going to affect me in any form but even then I constantly try to return their behaviour to the way it was in the beginning only to realise that it only further worsens it and even worse makes me feel horrible for trying so hard for people who don't even ultimately matter to me. I just don't want people to think of me badly but I have that I have this stupid thought process.",
        "created_utc": 1677077725,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have this habit of trying to win back people after they change their behaviour towards me",
        "author": "jus_vib1n",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1191mbm/i_have_this_habit_of_trying_to_win_back_people/",
        "text": "[removed]",
        "created_utc": 1677077501,
        "upvote_ratio": 1.0
    },
    {
        "title": "What country would you never travel to and why?",
        "author": "maryjane__of",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1191jhn/what_country_would_you_never_travel_to_and_why/",
        "text": "[removed]",
        "created_utc": 1677077359,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm Stupid",
        "author": "Competitive_Brief790",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11905tu/im_stupid/",
        "text": "When my ex-best friend and I had just met each other, I asked when Her birthday was. She replied, \"April 1st\". I tried my absolute hardest not to laugh going so far as to punching myself in the mouth to keep myself from laughing. But alas I couldn't contain myself and the words \" Your birth is a joke\" came out of my mouth before I could stop. She's now my ex-bestfriend because over time she got sick of my sense of humor and stopped being friend altogether. This is prolly why I've never really had friends. Oh well, tough crowd ig.",
        "created_utc": 1677074977,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are so many Craps players excessively superstitious about the game?",
        "author": "TheGolgafrinchan",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119016x/why_are_so_many_craps_players_excessively/",
        "text": "Playing Craps in a casino, the players are usually very superstitious.  This includes turning the dice a certain way before throwing, kissing the dice, blowing on the dice, rubbing the dice on the cloth, shaking the dice in a specific way, freaking out if someone is hanging a little bit over the edge (or inadvertently blocks a throw), getting angry when someone talks about the potential for a bad roll (i.e. \"I bet 7 comes up now!\"), etc, etc...\n\nHonestly, you don't see this kind of ritual adherence in Poker, Blackjack, Roulette, etc...  What gives?",
        "created_utc": 1677074781,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self-confidence",
        "author": "OkGrapefruit4419",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118zqww/selfconfidence/",
        "text": "Hey there,\n\nI’m a first year college student, and recently I’ve been having some self confidence issues.\n\nAll my life I’ve excelled in school, humanities and sciences both. I’ve been a 97th or above percentile student in every standardized test I’ve ever taken, and got a 1490 on my SAT. I know this sounds like gloating, but I think these things have kind of set me up to fail.\n\nI goofed off in highschool, so I wasn’t able to go to the type of prestigious university I could’ve if I had applied myself more, and right now I’m going to a local community college. This underachievement ruined my self-esteem.\n\nEvery now and then, I’ll receive some praise from a professor or a peer on some meaningless exam or project and I’ll feel the type of confidence I used to have in myself coming back, but then I’ll struggle for a while or talk to somebody that’s truly exceptional, and realize that I’m really not the phenom that I was told I was growing up.\n\nIt’s left me pretty dejected. It frankly makes me feel like an idiot for believing all the flattery I received when I was younger. Realistically, I know that I’m more capable than most, perhaps even more capable than a large majority of people, but everytime I think about the people who are *truly* brilliant, it makes me think that I just don’t stack up.\n\nFor anyone who’s had similar struggles, or anyone who has had self-image issues in general: What kinds of things do you think or do to keep yourself motivated and positive? Feel free to chime in even if you haven’t found the answer either, I’m interested to hear your story.",
        "created_utc": 1677074305,
        "upvote_ratio": 1.0
    },
    {
        "title": "I had the weirdest most vivid dream I've ever had",
        "author": "EpitomeOfHell",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118zndf/i_had_the_weirdest_most_vivid_dream_ive_ever_had/",
        "text": "[removed]",
        "created_utc": 1677074137,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel both paranoid and delusional.",
        "author": "greyth-human",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118zlat/i_feel_both_paranoid_and_delusional/",
        "text": "To most people It feels like they cancel themselves out, but I want to know why that my mood or how my day went. Can determine if I feel paranoid or delusional about the same thing. For example, let’s say someone noticed me or complimented me or I felt happy in the way, then I would feel delusional, where if someone stares at me all I would think is oh my God I bet they think I am pretty and gorgeous and they want to get to know me we’re on the other side if no one noticed me in a way or some thing happened like I got rejected for a simple thing then I feel paranoid for the rest of the day let’s give the same example someone stares at me, then all I’ll think is oh my God they hate me and they want to do me harm. they are going to ruin me and start a rumor. I fucking hate it.",
        "created_utc": 1677074027,
        "upvote_ratio": 1.0
    },
    {
        "title": "A bit excited",
        "author": "qiryde",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118zf20/a_bit_excited/",
        "text": "In around an hour I have to make a speech with my classmate for some kind of memorial gathering in my city.\nI've never done something like this before and I hope it goes well!",
        "created_utc": 1677073707,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which EDM songs make you love edm?",
        "author": "BoudicaandHozoinfan",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118yy2f/which_edm_songs_make_you_love_edm/",
        "text": "For me it's \"Mat Zo &amp; Porter Robinson - Easy\" and \"Above &amp; Beyond, Seven Lions - See The End ft. Opposite The Other\" ... but guess I was late to the party because it took 3 years ago XD\n\n#",
        "created_utc": 1677072876,
        "upvote_ratio": 1.0
    },
    {
        "title": "First time at doctor since leaving the army",
        "author": "lastaccountgotdoxxed",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118yppq/first_time_at_doctor_since_leaving_the_army/",
        "text": "I was in the army and never had I guess \"normal\" health insurance. Today I went to get a CT scan and the nurse said I needed to pre pay $398. \nI said, \"Oh, I guess my (new) insurance already has been billed?\" I was kinda shocked at the price.\nNope, I had to prepay them they'd bill the insurance and then I pay what's left. \n\"What's left? I'm paying $398 plus the $89 specialist doctor fee.\"\n\nShe said, \"Bless your heart dear. The CT scans usually start at $5000.\" \n\nI just stood there. What in the actual fuck. Is this my need healthcare? If so I'm might just take my happy ass back into the military.",
        "created_utc": 1677072457,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a way to look at downvoted comments first on reddit?",
        "author": "learningsumstf101",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118ye74/is_there_a_way_to_look_at_downvoted_comments/",
        "text": "A funny thing has happened on more than one occasion.  I found the most meaningful explanation or comment was downvoted by a huge margin.  They were 100% accurate, but not popular.  So thus the downvotes.  Popular votes, or the power of crowds, may not present the best answer.  Sometimes outliers are 100% right.  We should see the unpopular votes as easy as the upvoted stuff. What ya think peeps?  Is there a way to sort this?",
        "created_utc": 1677071841,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to start leaving the house without my phone. Should I?",
        "author": "loomman529",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118x54p/i_want_to_start_leaving_the_house_without_my/",
        "text": "So, every afternoon, I go for a walk around the sports centre in my town. I've been thinking about leaving the house without my phone. I usually stay out until after dark, and I don't exactly live a trustworthy town. But I do want to start going without my phone. At this point, it's just become second nature to have my phone in my pocket at all times when I'm outside my property.\n\nAnd I must admit, I am a little superstitious. I mean, I believe that the day I leave without a phone is gonna be the day I'll need to use it.",
        "created_utc": 1677069673,
        "upvote_ratio": 0.99
    },
    {
        "title": "what's your safe haven sites or apps",
        "author": "Katelynsparkles",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118ww52/whats_your_safe_haven_sites_or_apps/",
        "text": "For me it's Pinterest because there's so much inspirational good stuff in there I love. YouTube is my favorite app tbut lately I've been avoiding it because it's got too many but anyways I go there to watch &amp; replay some silent vlogs from people who live in Japan. Plus I go there for recipe tutorials bc it's easier to follow on yt lol. \n\n So what about you, what's your favorite webite or app?",
        "created_utc": 1677068902,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am in trouble...",
        "author": "Horus84",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118wukq/i_am_in_trouble/",
        "text": "[removed]",
        "created_utc": 1677068754,
        "upvote_ratio": 1.0
    },
    {
        "title": "Miss childhood",
        "author": "DrHabMed",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118wfvg/miss_childhood/",
        "text": "[removed]",
        "created_utc": 1677067428,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've been watching LotR since I was 8. For most of the time my favorite scenes were battles and epic moments. Now, as I got older my favorite scenes are those from Shire.",
        "author": "attraxion",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118wcre/ive_been_watching_lotr_since_i_was_8_for_most_of/",
        "text": "[removed]",
        "created_utc": 1677067178,
        "upvote_ratio": 1.0
    },
    {
        "title": "Importance of Medicine Delivery App",
        "author": "jackdani176",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118wb8q/importance_of_medicine_delivery_app/",
        "text": "[removed]",
        "created_utc": 1677067029,
        "upvote_ratio": 1.0
    },
    {
        "title": "I may be experiencing an identity crisis…..what if I’m right?",
        "author": "L5D4W34P0N",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118te3q/i_may_be_experiencing_an_identity_crisiswhat_if/",
        "text": "[removed]",
        "created_utc": 1677056404,
        "upvote_ratio": 1.0
    },
    {
        "title": "[eolkw",
        "author": "No_Paint_5213",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118t8gw/eolkw/",
        "text": "[removed]",
        "created_utc": 1677055783,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think hair dyeing isnt bad attitude",
        "author": "rinadong",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118t41n/i_think_hair_dyeing_isnt_bad_attitude/",
        "text": "Most people including have this impression that if someone dyes their hair, it can seem disrespectful or they dont really care about their work/other stuff. But on second thought, i realise that it isn't disrespectful and not bad attitude. It means you care about how you look, you try to present yourself nicely. What are yalls views on this?",
        "created_utc": 1677055316,
        "upvote_ratio": 1.0
    },
    {
        "title": "Proudly being a pick me girl!",
        "author": "LeadershipTrue8164",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118t0qv/proudly_being_a_pick_me_girl/",
        "text": "[removed]",
        "created_utc": 1677054964,
        "upvote_ratio": 1.0
    },
    {
        "title": "what's a song that can make or break a party depending on the crowd?",
        "author": "ClosetHorse",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118sc2j/whats_a_song_that_can_make_or_break_a_party/",
        "text": "Story time. \n\nI was thinking about how I was in (N)JROTC in high school (many years ago), and one day I played \"In The Navy\" by the Village People to see how my teacher would react (as you probably guessed, he was actually in the Navy).\n\nHe laughed. I did 50 push-ups. \n\nThis seems like a \"Makes or Breaks a Party Depending on the Crowd\" Kind of song. What's yours?",
        "created_utc": 1677052354,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for people to work with online!",
        "author": "jameselkinss",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118s8qz/looking_for_people_to_work_with_online/",
        "text": "[removed]",
        "created_utc": 1677051987,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your least and most favorite thing about visiting a hospital in America?",
        "author": "xparapluiex",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118rw3d/what_is_your_least_and_most_favorite_thing_about/",
        "text": "Obviously dealing with insurance, and how expensive it is is the worst. Getting better and having great hospital employees is the best.\n\nBut aside from those, what are some things that have made a hospital visit the best thing ever? Anything from the decor to the cafeteria to the gift shop. Even scrub colors for the nurses. What is something you wish every hospital had?\n\nI’ll engage with this in the morning because I don’t think of these things during the day 🙄",
        "created_utc": 1677050649,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spin on the “Wild Shape” DnD ability",
        "author": "Shin_Yi",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118rs78/spin_on_the_wild_shape_dnd_ability/",
        "text": "You can only wolf shape into things that you can understand. Example: to wild shape into a bear, you have to comprehend bear anatomy. To wild shape back you have to comprehend the anatomy of whatever race you play as",
        "created_utc": 1677050239,
        "upvote_ratio": 1.0
    },
    {
        "title": "I cut my own hair today, what does that tell you about my mental health?",
        "author": "triplesun313",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118rjih/i_cut_my_own_hair_today_what_does_that_tell_you/",
        "text": "I watched several YouTube videos, felt confident enough and it actually turned out surprisingly well! My roommate helped me clean up the back❣️ Last week I dyed the underside of my hair a bubble gum pink color (I’m blonde) and now I feel like I should commit and do the pink all over. It’s just hair right? I can always fix it later. Or it’ll grow. For extra context I am set to graduate college in august and I feel like this is the last chance I have to have fun hair before getting an adult job. Thoughts?",
        "created_utc": 1677049334,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your go to shoes?",
        "author": "bluedotnoodle",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118rifw/what_are_your_go_to_shoes/",
        "text": "[removed]",
        "created_utc": 1677049234,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just realized that Ving Rhames is the voice behind Arbys, after hearing the slogan for the millionth time.",
        "author": "poopmaester41",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118r5ht/i_just_realized_that_ving_rhames_is_the_voice/",
        "text": "I’m literally blown away by this revelation. I see Arby’s commercials all the time and this is the first time I put two and two together. Is this common knowledge? Wow, lol.",
        "created_utc": 1677047896,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going to be on my own for the first time in my life",
        "author": "clueless-clam",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118r3uo/going_to_be_on_my_own_for_the_first_time_in_my/",
        "text": "Hello all. I am 23 years old and in a month i will be on my own for the first time. It has happened very fast and unexpectedly, my family is loosing our house and we have 30 days to move out. \n\nI don’t want to move with them where they are going, so I’m opting to stay here. I am terrified as I have health issues and have never been on my own, but I guess now it’s sink or swim. \n\nI have calculated after all of my bills, including rent for the place I’m looking at, I will have 535$ for everything else for a month. This includes food, gas, toiletries, etc. \n\nI also have some savings to fall back on, and I plan on doordashing to make some extra cash. Is this doable or am I kidding myself?",
        "created_utc": 1677047731,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is the weirdest encounter you have ever had with another person?",
        "author": "StandardFee5124",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118qv7m/what_is_the_weirdest_encounter_you_have_ever_had/",
        "text": "For example it can be a complete stranger you don't even know or it could be something that is crazy and strange.\n\n\n\nPlease let me know what your strangest encounter with another person was I'd love to hear your stories and thoughts.",
        "created_utc": 1677046858,
        "upvote_ratio": 1.0
    },
    {
        "title": "anyone just listens to the same music over and over again? do you ever feed your emotions and feelings?",
        "author": "Akashh23_pop",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118q3h5/anyone_just_listens_to_the_same_music_over_and/",
        "text": "\n\nI don't have a girlfriend and never been in a relationship but Idk what I'm feeling. I'm 26 going to be 27 in two days. Can't believe what I am doing with my life like I don't even have my life sorted out. I don't have a college degree or a job and seems like I'm still living life in fear and boundaries. I see people in their 20s doing so much and meanwhile I'm sitting wondering lost all in my thoughts and end up listening to some comforting sad song over and over in my headphones and just feeding emotions while embracing thinking about life and what to do. Then feeling overwhelmed and emotionally drained. It's such a toxic feeling like why I'm destroying myself. I know nobody will help me expect me. Sighs",
        "created_utc": 1677044176,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anesthesia Experience",
        "author": "emerald_heart27",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118pk90/anesthesia_experience/",
        "text": "Have any of you guys ever been under anesthesia, or have been pronounced clinically dead or resuscitated? For me it was black and nothing once the gas kicked in. Would like to know if any of yours was similar to mine.",
        "created_utc": 1677042362,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just love programming and the process of learning",
        "author": "ChilllFam",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118pid6/i_just_love_programming_and_the_process_of/",
        "text": "My pre calc professor is very passionate about math and programming. I’ve stayed after class with him to talk about programming and have him show me stuff. I’ve been trying to get math credits to declare as a comp sci major after I taught myself how to code online. I haven’t had a lot of time to code lately because I’ve been focusing on my other classes but my teacher gave me a problem to work on, (if you wanted to know the details of the problem, check my account I recently posted about it) and it has just excited me so much. It’s a simple problem for most that work a software job I’d assume, but I’ve never done anything with recursion or classes or tree structures after learning about it, it’s been so fun to put it into action. I find myself sitting up at night thinking of how I can solve it, a few times I’ve popped out of bed cause I just had to try it out. I love the process of learning and nothing has stimulated my brain like this in a long time. I don’t have anyone that programs in my life really so I just wanted to share my excitement with someone.",
        "created_utc": 1677042189,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever been under anesthesia? I have, and can tell you what it’s like. I know it’s not death but it helped ease my fear if there’s an afterlife or not. I’d like to hear your experience to see if it was similar to mine.",
        "author": "emerald_heart27",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118pf6i/have_you_ever_been_under_anesthesia_i_have_and/",
        "text": "[removed]",
        "created_utc": 1677041936,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know the website that gives a happy/sad quiz checkup",
        "author": "BlueBillions",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118oy4r/does_anyone_know_the_website_that_gives_a/",
        "text": "It’s a website - has a bunch of questions - simple things like have you eaten today? Have you talked to a loved one? \n\nI saw it recommended for if you’re not feeling well.\n\nI just can’t remember the name of it. Anyone know?",
        "created_utc": 1677040402,
        "upvote_ratio": 1.0
    },
    {
        "title": "have you ever asked your employer for a different role? what do you think i should do about mine?",
        "author": "myaskredditalt21",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118owpi/have_you_ever_asked_your_employer_for_a_different/",
        "text": "[removed]",
        "created_utc": 1677040283,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you get over the guilt of breaking up with someone great?",
        "author": "Capable-Durian1556",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118ono1/how_do_you_get_over_the_guilt_of_breaking_up_with/",
        "text": "I had a short relationship with the best man I’ve met in my entire life. He genuinely just always wanted me to be happy and would jump through a lot of hoops for me just to solve little problems in my life without me asking or knowing until they were solved. He was great in every way and we liked eachother a lot. I broke up with him because of something really personal that I don’t really want to share, but to be clear it was nothing about who he was as a person or anything, just something more logistical which I knew would prevent us being together longterm so I decided to spare us both the amplified pain in the future and be realistic about it now. \n\nHe’s really torn up about it. I don’t think I’ve ever seen anyone as hurt over something I said as he was when I told him we can’t keep dating. When we had our breakup conversation he had to take 2 minutes to regulate his breathing, and the first thing he said to me is that it felt like a gut punch. That wasn’t my intention at all and I was trying to prep him a bit for bad news in the days leading up to it but I don’t think he got the hint. Even though he was that hurt he still treated me with the utmost respect and wished me the best. His friend called me to tell me he hasn’t been this upset since his grandma died which was 2 years ago. \n\nI just don’t know how I can get over hurting somebody like that when they’ve done absolutely nothing wrong… anyone out there been in a similar situation in the past who can offer some words? I’ve broken up with people before but I’ve never felt this type of guilt because it was often because I was being mistreated or cheated on. This time, the person I broke up with deserves the world.",
        "created_utc": 1677039494,
        "upvote_ratio": 1.0
    },
    {
        "title": "how would you feel if you woke up tomorrow and you were 15 again?",
        "author": "QuinnyIsACowboy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118oevw/how_would_you_feel_if_you_woke_up_tomorrow_and/",
        "text": "hypothetically, you wake up tomorrow and you’re 15 again but you still know everything you know now. the year is whatever year you were 15, not 2023. how would you feel? what would you do?",
        "created_utc": 1677038721,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I'm gonna start streaming/recording",
        "author": "CardinalCoder64",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118o9qa/i_think_im_gonna_start_streamingrecording/",
        "text": "Let's just get this outta the way: this is NOT advertising. This is me trying to start a conversation about the streaming/recording experience.\n\nSo I posted on r/Metroid that I would be doing a low % run of Metroid Prime Remastered on hard mode, meaning I would only get the mandatory items/upgrades and nothing more. It's gotten some positive feedback, and one person asked if I would be streaming/recording my run.\n\nI thought this would be a great idea! Having people watch me fail at an insanely difficult and stupid challenge? Now that's something I would watch.\n\nSo I went and ordered a capture card off Amazon. Thing is, I'm still trying to figure out how it would work. I want to play on my TV, but my PC is too far away to connect it. I do have a decent laptop with OBS...idk I'll figure it out when I get the card.\n\nI'm still debating on whether or not I should stream on Twitch or just upload my sessions to YouTube. Idk, what do you guys think?\n\nAlso, I do have a face cam on my laptop however it would be inconvenient for me to set it up since my laptop will most likely be placed beside the TV. So I'm probably just gonna capture the gameplay and audio and leave it at that. I do have a mic so I will be talking during the playthrough. It's gonna be kinda hard since I like to enjoy my games without talking, but I'll do my best to keep the commentary interesting.\n\nAnyone else here stream/record? If so, what is your experience? Any tips?",
        "created_utc": 1677038303,
        "upvote_ratio": 1.0
    },
    {
        "title": "With baseball season starting, let's start a causal conversation of who is your favorite team?",
        "author": "LeeCrunchesData",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118nmdd/with_baseball_season_starting_lets_start_a_causal/",
        "text": "My favorite team is the Braves.   I have been a fam since the early 90.  I remember vividly the worst to first Braves.  Being allowed to stay up late when the Braves won the series in 95.  Then the Yankees who beat them in the next 2. (BTW, they can suck eggs).",
        "created_utc": 1677036288,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need to talk",
        "author": "bigteddycrippin",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118nlpr/need_to_talk/",
        "text": "[removed]",
        "created_utc": 1677036229,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help",
        "author": "teddyUt",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118ni8a/i_need_help/",
        "text": "[removed]",
        "created_utc": 1677035929,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve never won anything",
        "author": "Opposite_Swimming337",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118ndoe/ive_never_won_anything/",
        "text": "I’m reading another Reddit post about people winning the lottery. I’ve never won money, raffles, or those instagram giveaways. Has anyone ever won any of those things?",
        "created_utc": 1677035560,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve never won anything",
        "author": "Opposite_Swimming337",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118nc83/ive_never_won_anything/",
        "text": "[removed]",
        "created_utc": 1677035440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clash Royale on PC?",
        "author": "ClashRoyaleAddiction",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118n9xu/clash_royale_on_pc/",
        "text": "[removed]",
        "created_utc": 1677035258,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just went to my very first concert",
        "author": "Lazyrainbowpanda",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118n8vb/i_just_went_to_my_very_first_concert/",
        "text": "I went to see Stray Kidz yesterday. It was so cool and loud. But I honestly really enjoyed it, though it was super surreal seeing the members in real life rather then on TV. I’m going to another concert again in Sydney with a friend, but my first time going to a concert was one of my favourite things to experience.",
        "created_utc": 1677035166,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you tell if a (girl's) wink is flirting or just friendly/playing?",
        "author": "BlackShadow2804",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118n6n0/how_do_you_tell_if_a_girls_wink_is_flirting_or/",
        "text": "How do you tell if a wink is flirting or just friendly/playing?\n\nI'm sure this is a really dumb question, but I can't figure it out.\nOne of my close friends got Snapchat recently and we've been talking quite a bit since (she moved to college and we had a little while where we didn't). Even more recently she has been winking at me every now and then, but she never really used to, unless maybe she was joking or something, so it's kinda caught me off guard. I feel like she's just being silly, cuz she has a boyfriend (emphasis on the *boy*) but I haven't seen any posts from either of them about their relationship in the last month so it may have ended?.... I really don't know, I'm terrible at reading people. Is she just being friendly/playing around or is it actually flirting?\n\nThanks",
        "created_utc": 1677034983,
        "upvote_ratio": 1.0
    },
    {
        "title": "On average, what would you tip on a $20 food delivery order?",
        "author": "jennvall",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118n59w/on_average_what_would_you_tip_on_a_20_food/",
        "text": "[removed]",
        "created_utc": 1677034873,
        "upvote_ratio": 1.0
    },
    {
        "title": "10 years ago today, Reddit saved my life. Now I wanna know how I can help you guys back.",
        "author": "Blucatt",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118n487/10_years_ago_today_reddit_saved_my_life_now_i/",
        "text": "So I’ve done my best to ensure that my post follows the subreddit rules, but there’s no way to know for sure until I post it. So here it goes: \n\n\nExactly 10 years ago today, I made [this post](https://www.reddit.com/r/SuicideWatch/comments/18zksv/im_going_to_kill_myself_tonight/) in the SuicideWatch subreddit. I wrote that, fully intending to end my own life just a few hours after submitting it. I was abused, I was losing my mind, and quite literally I had nothing and nobody. I was 14 years old. \n\n\n10 years later, I’m pretty much a completely different person. I got a good job, I moved away from home, I live with my lovely girlfriend, I’m getting justice against my abusive mother, and more. The thing that’s really struck me is just how much I’ve changed, and how close yet far away that time feels. I still remember that hopeless feeling, and all those restless nights and hours of staring at a blank wall. I still remember my first panic attack, my first overdose, my first self-harming. It was the worst feeling in the world. \n\n\nI was going to write a long-winded wall of text to describe just how bad things were, and how I turned them around. But then, I thought. Throughout all of my hardships, one of the thoughts that terrified and saddened me the most was that there’s other people going through the exact same thing as me, but will never see the support or kindness that I was afforded. I want to change that; I want to help. I want to use my story and my experience to benefit the lives of others, to improve their everyday quality of life. I want to make people feel okay. \n\n\nI hope at least one person will look back at my older posts or ask to hear more about my story, and use that information to benefit themselves. I also want to know what I can do to help others, to pull them out of that hole that I was in a decade ago. I want to hear about your experiences, the difficult things you’ve experienced, and how you overcame them. I want to empower, motivate, and excite people. But I can’t do it alone, and so I’m interested in the thoughts from the very community that helped save my life all those years back.\n\n\nAs for myself, a lot of people have been messaging me asking for updates because they’ve seen my previous posts. I’m doing well; I’ve been focusing on my writing and improving my productivity, following a regular schedule, etc. Things aren’t perfect, by any means. I still have pretty bad anxiety, I’m still dealing with problems back home, I’m trying to clean up my digital presence, and I’m trying to get a better job. But I’m alive, I’m okay, and I suppose that’s all someone can ever hope for, I guess.",
        "created_utc": 1677034802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this Scratch/rubbing back flirting?",
        "author": "theChavofromthe8",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118msmp/is_this_scratchrubbing_back_flirting/",
        "text": "Today I was at a club meeting , we took a group photo and this girl whom I have never even talked to side hugs me and the and the girl to her other side but she rubs/scratch my back a little, then we took another picture and she does the same thing.\n\nI have never talked to this girl and I am an average looking guy but I was looking my best that day wearing a nice fit and cologne but I’m not sure if may be just a quirk of her.\n\nI know I have to talk to her if I really want to find out but if something lime this happened to you would you take it as flirting?.",
        "created_utc": 1677033837,
        "upvote_ratio": 1.0
    },
    {
        "title": "plane or cruise",
        "author": "OnlyCryptographer707",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118mlwb/plane_or_cruise/",
        "text": "[removed]",
        "created_utc": 1677033273,
        "upvote_ratio": 1.0
    },
    {
        "title": "plane or cruise?",
        "author": "OnlyCryptographer707",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118merg/plane_or_cruise/",
        "text": "This is for people who enjoy going on holidays and like to travel to different countries \n\nWhen your going on holiday would you prefer\n\nTravelling on a plane to your holiday location or going on a cruise ship holiday?\n\nNo judgement you do you its just a friendly simple and easy conversation.",
        "created_utc": 1677032703,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quantum immortality has boggled my brain.",
        "author": "Sausage_fingies",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118mbp0/quantum_immortality_has_boggled_my_brain/",
        "text": "Have you ever had a near miss? Skidded off the side of the road and questioned how on earth you remained alive? Well, it may be the case that you didn't. Many worlds theory, a quantum mechanics theory held true by many of the top quantum professors, states that for every possible thought, action, and statistic, the universe splits in two. Quantum immortality states that for every time you could have died, for every near miss or drowning or statistical miracle of survival, you DID DIE. But the universe split at that moment, and since the you who died was no longer conscious, you are all that remained. In simple terms, you \"hopped\" into a universe where you survived.  \nIt's truly such a fascinating thing for me. You are immortal. Not to me, not to your mother or your father, but to you you will never ever die. You will be the first person to reach 200 years of age. You will be the first to witness extraterrestrial life, the death of humanity, the death of earth, the death of the stars, the death of the the universe.   \nTo live as long as you will is statistically impossible.   \nLess than  0.00000000000000000000001% . But nothing is a full zero! There is a non zero chance that someone someday will push their hand through a wall and the atoms and electrons will be arranged in \\*just\\* the perfect way to phase through each other. In the natural universe, you cannot live forever. It is so statistically improbable it's nearly certain. But you are not in the natural universe! You are in a universe where that improbability \\*did\\* occur! It must occur in one universe, and because you are conscious you must be in that universe, for if you were not conscious of it, the universe simply wouldn't exist!  \nThe prolonged consciousness explanation boggled my mind for a while, but it does make sense; you just have to think of it in reverse. You right now could easily go to the universe where you died, and that would be it. To go in a straight line forward would naturally lead to imminent death. However, we're not going forward. For if you are to skip to the you after those 100 tests, they would have needed to survived each time to be there now.  \nSo why is it that consciousness just \"hops\" from one random host to the other? If you died, you would be nonexistent. Unconscious. And unconsciousness is inherently impossible. Humanity and the world around us exists solely because we are conscious of it. Thus the unconscious you doesnt exist. To you, before you were conceived, the world did not exist. Existence did not exist. And to the world around you, you did not exist either! Yet it is solely because there are consciousnesses to perceive it, that you are alive, that you are tangible. It is solely because of this combination of your awareness and the awareness of others that you can be certain that you are real! A coma patient in an abandoned forest that will never be discovered is as good as nonexistent, for it is the perception of the mind that leads objects to \\*be\\*!   \nThe future you that is conscious depends on the you now and the you ten minutes from now to remain conscious. And time isn't linear; the future depends and shapes the past just as the past shapes the present. If you buy a house next year, that ripples down and affects the choices you make now. Yet in equal measures, \\*the choices you make now affect that future!\\*  \nThere is no divine reason necessarily that you end up where you are, it's simply that your future depends on you making these choices. For the future you that rolled a dice 10 times and got the same number in a row, you have to roll the dice 10 times for it to happen! Its forced! Yet so too, that future will not exist if you do not roll the dice 10 times and get the same number!  \nLife itself is a freaking temporal pincer manoeuvre!!! a time-bending tactical technique for missions: you approach it moving forward in time, and then also approach it in reverse moving backwards from the future – each side using the knowledge that the other side gained from having already experienced it. Red team got it from blue team who gave it to red team after recieving it from red team, who gave it go blue team after recieving it from blue team! The information is given by the same team who recieved it, thus that information has NO ORIGIN! Red team depends on being told the information by blue team, who depends on it being told to them by red team, etc etc. It has eternally been shifted back and forth and back and forth, and it is impossible to pinpoint who and when first learned it!  \nThe future informs the present which informs the future! You change the future by changing the present but because of what the future is, it is imperative that what happens to you in the present happens! Your future is set, but in equal measures your present is set. Yet nothing is set! It's all random! The future is certain because the present will make it so, and the present is certain because the past \\*has\\* made it so! But without the future the present cannot exist, for after this exact millisecond that you are reading this \\*\\*word\\*\\*, the present has shifted into the past and you are now in the future!  \nThus, there is no possibility that your future self tomorrow is non-existent, as if you were non-existent that future would not exist which would mean that the present right now could not exist. The future must exist as much as the past exist for the present to exist. If you didn't buy a couch last month you wouldn't have a couch now. But if you didn't have a couch now you wouldn't have bought it then! So in a way, quantum death is inevitable! You cannot die, you cannot blip into nonexistence, as for that to happen you would have had to never existed in the first place!  \nAAAAAAAAAA",
        "created_utc": 1677032458,
        "upvote_ratio": 1.0
    },
    {
        "title": "lanes or cruises?",
        "author": "OnlyCryptographer707",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118mbd5/lanes_or_cruises/",
        "text": "[removed]",
        "created_utc": 1677032434,
        "upvote_ratio": 1.0
    },
    {
        "title": "Comment a song you like, and I'll let you know if I like it or not.",
        "author": "Queue624",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118lotb/comment_a_song_you_like_and_ill_let_you_know_if_i/",
        "text": "I love listening to music, but I'm also really picky. So comment the best song you have in your mind and I'll leave a comment stating if I liked it or not. Virtual Cookies for anyone who comments a good song I have not heard. \n\nAdditionally:\n\n* Comment just one song\n* It can be any genre \n* It can be in any other language",
        "created_utc": 1677030651,
        "upvote_ratio": 1.0
    },
    {
        "title": "Giving up on learning how to swim (for now)",
        "author": "x3vicky",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118li7y/giving_up_on_learning_how_to_swim_for_now/",
        "text": "I’m discouraged, again. This is my 5th month of taking adult swimming lessons and I feel defeated. This process has been like a rollercoaster. I’m making some improvements but not much, I’ve had a major fear of drowning since I drown taking swimming classes as a child. These lessons were strictly because I can afford them and my friend and I were taking them together for the last 4 months but now she can no longer do them. \n\nI feel like I’ve exhausted all of the swim instructors and it’s understandable. It’s a group class so they can’t keep focusing on me and telling me the same thing over and over again. Every time I enter the building to swim my anxiety soars. I even take two shots of alcohol to take the pressure off but it’s not enough. I notice everyone else smiling in class after doing a practice “lap” and I can barely do two freestyle strokes without an alignment board so my attitude is sour almost every lesson.\n\nI definitely see myself trying this out again after I finish this month of classes but maybe I just need a hiatus. Maybe a different swim school? Maybe different days with different instructors. I don’t know, but for now I’m just tired and give up.",
        "created_utc": 1677030111,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a theory about why women tend to choose the \"bad guy\"",
        "author": "animal_intuition",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118l4la/i_have_a_theory_about_why_women_tend_to_choose/",
        "text": "I know there's a lot of theories about this subject, and the ones I've heard about are about the modern society, and upbringing, and psychology, and guys I've known have been curious about it, but I think they don't understand how deep rooted this instinct is in us women. \n\nNow, I don't precisely know the history, but I can imagine, way back when we were apes or whatever before that, and living in groups, that the females who chose to side with the ruthless, angry, confronting males lived through predator attacks, while the females who stuck with the soft, easy going, roll-over kind of males died while these males hid, ran or died themselves. \n\nMales were mostly physically bigger than the females, as the pattern goes, and sometimes their only chance of survival was to stick with a male and I guess more often than not, the big angry males were able to atleast intimidate predators, or maybe fight and win, or fight and lose, but that still gave the fam time to run away. \nBaby males could model the behaviour, and baby females started getting this shit ingrained in their dna.\n\nSo now, the pattern I'm seeing in others (and feeling myself sometimes) is if a guy is angry, ruthless, and dark with others, but with you, he's soft, caring, gentle, protective, it's like winning the lottery to our survival-obsessed brains. This is the fantasy male character of sooo many romance books, and there always atleast one in most tv shows or movies. \nAnd then there's more complexity to it, in today's world, but that's the gist of my little hunch anyway.\n\nWhat do you think?\n\nPlease note that this post is not intending to offend anyone, or be anti-feminist or anything. I'm talking about a whole different time. \nI know nature, and animals more than anything else, so I'm just thinking this could be interesting to talk about. Plus it's the middle of the night here, so I just hope I'm making sense.",
        "created_utc": 1677029028,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having a surgery tomorrow and tonight is my cake day! =)",
        "author": "1Emaxx",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118kvvr/having_a_surgery_tomorrow_and_tonight_is_my_cake/",
        "text": "I almost missed it! I don't really comment or post on Reddit much but I just replied to someone and noticed a cake next to my name. OMG! It's my cake day! 3 years and counting. Woo-hoo!\n\nOn other news, I have a spine surgery tomorrow and that the surgery costs $80K (though I pay only a few grand thanks to insurance) makes me feel really scared, as in how high stakes this whole thing is. I'm only 22. Any tips on jokes I can make with the surgeon before they put me under? :p\n\nAlso, what's going on with you beautiful folks? What's new in life? Tell me stories.",
        "created_utc": 1677028356,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can’t believe I got called a fucking indian over a hot chocolate",
        "author": "MakinBaconPancakezz",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118knfh/i_cant_believe_i_got_called_a_fucking_indian_over/",
        "text": "I was just at work and standing out the counter, when this guy comes in asks for a refill. I tell him sorry man, you can’t get a refill cause that’s only for when you buy in the store and don’t leave. Once you walk out we cant give you one. He says “no I’ve been sitting here the whole time.” I tell him “bro I’m sorry but I literally just say you walk in the door.” \n\nHe goes “no you didn’t.”\n\nI’m like, My guy you literally just walked in. I’m standing right here. I’ve been on this god forsaken register for like three hours\n\nHe says “no I didn’t you’re just confused. You must be imagining things.” \n\nAt this point I don’t even say anything, cause why bother. I just shrug in a “sorry bro” type way.\n\nHe then gets pissed and says “I want a refill for my hot chocolate” I tell em, even if I could my guy that’s just for coffees and teas, we don’t do refills for hot chocolate. He then waves a hand at me and says “okay. gracias pinche india” [thanks you fucking indian] and then leaves\n\nI just stood there like ????????? What??? Now what does that have to do with anything. Lmao I hate customer service. Honestly if he were nice I would have probably just done it anyway or something. Why you gotta be like that\n\nEdit: I have no idea why that flair is there",
        "created_utc": 1677027707,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sleepless Nights.",
        "author": "MaverickEyedea",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118iwjv/sleepless_nights/",
        "text": "*Some nights, I find it extremely hard to fall asleep. Despite having a joyful and busy day, sleep still evades me. Sudden waves of melancholy quietly flood my heart as I lay in my bed, cluelessly. As strange as it sounds, my heart feels overwhelmingly nostalgic about all the places I haven't explored, all the people I haven't encountered, all the literature I haven't read, and all the melodies I haven't heard. There's a profound longing for something nonexistent and an intense desire to escape into the infinite abyss of deep sleep, forever lost in its soothing embrace. There are no words to describe this inexplicable feeling. Does anyone else out there feel the same way as I do? I wonder.*",
        "created_utc": 1677023007,
        "upvote_ratio": 1.0
    },
    {
        "title": "I couldn't tell if it was a job interview or a coffee date.",
        "author": "JazzMansGin",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118iqr8/i_couldnt_tell_if_it_was_a_job_interview_or_a/",
        "text": "Today at the coffee shop, I tell you. You know, when it's packed and people are too close and you're just hearing their business, get used to it. \n\n&amp;#x200B;\n\nThey showed up just before I did, and I was still there when they left. I honestly, legitimately couldn't tell you. Too personal for a job interview but she was asking him for references as well. Got him telling his life story about sisters and Florida and folks in the Bahamas, then passive-aggressively disapproved of his neighborhood and openly questioned his social skills, sorta asking for a demo (walk over and introduce yourself to this table of other dudes who loudly work in the same field (finance-ish something or other idk). \n\n&amp;#x200B;\n\nI haven't gone on a date in forever and I'm still wondering whether that was an unusually invasive job interview...but he mentioned work so he already had a job...and she was just analyzing his use of his free time...his posture was too good though. But this would have been a first date - she was asking him to defend his friends and life choices?\n\n&amp;#x200B;\n\nIdk guys, I'm out",
        "created_utc": 1677022564,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for a chat bud",
        "author": "ur_amaazing",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118ie12/looking_for_a_chat_bud/",
        "text": "looking for a friend to chat with that will(won't) do the following:\n\n1) won't ghost me\n\n2) will check on me \n\n3)will support me\n\n4)will listen to my rants\n\nI will:\n\n1)listen to your rants\n\n2)check on you\n\n3)give you support\n\n4) have valid excuses for ghosting you",
        "created_utc": 1677021640,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it bad to lean on your elbow all the time while sitting?",
        "author": "Susanburr",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118i5cd/is_it_bad_to_lean_on_your_elbow_all_the_time/",
        "text": "I tend to do this when I’m sitting I prop my elbow up and just lean on it not sure if it’s bad.. I notice my neck tends to strain a lot but I’m not 100 percent sure if leaning on one’s elbow can cause this issue.",
        "created_utc": 1677021048,
        "upvote_ratio": 1.0
    },
    {
        "title": "Overwhelmed, good I guess",
        "author": "TexasTiger70",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118i14b/overwhelmed_good_i_guess/",
        "text": "[removed]",
        "created_utc": 1677020753,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was anybody else’s Reddit not working properly for like an hour earlier?",
        "author": "dustbin-account",
        "url": "https://www.reddit.com/r/CasualConversation/comments/118hyqb/was_anybody_elses_reddit_not_working_properly_for/",
        "text": "[removed]",
        "created_utc": 1677020590,
        "upvote_ratio": 1.0
    }
]