[
    {
        "title": "Would a commercial Pilot or Captain of a ship have more at stake?",
        "author": "mamaspark",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tm3vw/would_a_commercial_pilot_or_captain_of_a_ship/",
        "text": "I suppose there’s a lot at stake for all. And there’s container ships, oil ships, not just cruise ships. Seems the most high stakes but can’t decide? There also seems to be more air crashes than cruise ship crashes? A lot of thoughts can’t decide. Would love to know what you all think and if any experts have some anecdotes or facts to help me decide",
        "created_utc": 1679045248,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the middle of a rut",
        "author": "zoonbeams",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tl0m9/in_the_middle_of_a_rut/",
        "text": "I'm (36F, USA) currently dealing with a lot of physical issues, emotional issues, etc, and I'm in a rut that I'm trying to get out of. Just up in the middle of the night and looking to see if there's anyone else out there who's struggling - and letting you know you're not alone.",
        "created_utc": 1679041301,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can’t sleep",
        "author": "-usernamesarestupid-",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tkuhq/i_cant_sleep/",
        "text": "and today I had my last class of my masters studies. I will be graduating next week. This has been my 13 year olds dream and it is coming to an end. Friends leaving soon. It feels so bittersweet.",
        "created_utc": 1679040651,
        "upvote_ratio": 1.0
    },
    {
        "title": "Discover the world-changing events that have occurred on March 17th throughout history. From the invention of the rubber band to the beginning of the Syrian Civil War, this date has witnessed significant moments that have shaped our world. #StPatricksDay #March17th #History",
        "author": "FitBeach996",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tkcxs/discover_the_worldchanging_events_that_have/",
        "text": "[removed]",
        "created_utc": 1679038810,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hit me with your best song recs in these genres (I listen to all of these)",
        "author": "surfwaxgirlie",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tkclv/hit_me_with_your_best_song_recs_in_these_genres_i/",
        "text": "[removed]",
        "created_utc": 1679038777,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here's my history with smartphones and other mobile devices.",
        "author": "Kiteflyer59",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tk7u6/heres_my_history_with_smartphones_and_other/",
        "text": "What was going to be a short summary describing to a nontechy friend what kinds of mobile \"smart\" devices I've used over the years turned into a whole essay, and I thought it'll be cool to share it online. I crafted this from what was originally texting and explaining some terms so I kept some of that language in there. I'm going to substitute any personal information with generic terms you'll see in brackets. Luckily there wasn't a lot of that to replace so it wasn't a chore. Hope you enjoy!\n\n&amp;#x200B;\n\n Yeah, it dates back 12 years ago with my iPod touch. I only had that, no phone. I inherited my dad's old nonsmart touchscreen phone when starting \\[community college\\] in 2014. I was in college now so I wanted an \"adult\" phone too, like everyone else. I had to wait a bit though. At the time, when my mom was working at \\[mall\\], she bought me the almost three year old Samsung Galaxy S3 two years later for pretty cheap at a Sprint store in the mall. It was around Black Friday, so that may explain the price tag. Sprint no longer exists, as it has merged with TMobile a few years ago. It was carrier locked to Sprint Prepaid but cost only $80. That's pretty wild, a less than 3 year old flagship selling for that cheap, even for a carrier. Dang. Thanks mom for catching that sweet deal. Changed my life forever. Adjusting to Android wasn't that big a deal. People were right, it is more versatile than the iPhones are. This thing was a champ for doing what I needed and wanted, at least for the time being.\n\nCost remained the main theme. The iPhone was too expensive for my parents so we had to go for the lesser alternatives. Androids are great too, with wonderful variety across many brands. I was on the cheap phone train because that's all I knew, but that didn't go so well. The Galaxy slowed down and became frustrating to use over a  short period of time. That was quite shocking. I then learned it was a common issue with those older Samsungs. It was only 2 years until I had enough. Mom told me I'd have to buy a new one myself this time since it wasn't long ago since she got me the Samsung.\n\nMy next phone was pretty, made of aluminum with rounded edges, and dual front speakers, and a gorgeous display, but it was slow. The hardware inside was low end. It was the ZTE Axon 7 Mini retailing at $199.99. I recommended this phone to \\[another good friend\\], as he was having a tough time with his iPhones. He'd been wanting to go back to Android. I told him before the slowness kicked in for me so he, unfortunately, learned the hard way. We both got new phones shortly after, me, the OnePlus 3T I called the \"dinosaur\" and he the Samsung Galaxy Note 9. The OnePlus isn't that expensive for a powerful phone ($439) but has fast internals for much less than its flagship competition This bad boy's predecessor, the slightly lesser powered OnePlus 3 released earlier in the same year, was my dream phone after seeing a review from tech YouTuber Marques Brownlee. Absolutely fell in love with it. It was all I could ask for. It did everything right. This time around, I obliterated my phone usage habits and used a phone with the original battery for almost 5 years. Just incredible, what a turnaround. While I finally relented last year due to the aging of the phone's battery and hardware, he's still using his. He did get it after I got mine after all. He's definitely going to stay on Android when he upgrades. I hope he uses the Note until the wheels fall off.\n\nUnlike \\[good friend\\] I've never used an iPhone as my own phone. I have a long history with the iPod touch and iPad. I continued using my iPod as a secondary device to my Androids until it stopped powering on in early 2018. I went without an Apple device until later that year when I got an iPad for sale. Now I could download and play the games that I loved so much on the iPod, and once again, having a secondary mobile device.\n\nI figured I would then buy an older model iPhone as a starter device. The only rule I had is that the screen has to be larger than what's on the latest iPhone SE's. My intention was to run it as a secondary device to the OnePlus and eventual Android upgrade. What better way to get into the iPhone world than with one that's still powerful, looks and feels premium, and best of all, doesn't cost an arm and a leg? Enter the used market, a booming business, I would learn. \n\nThe website I chose is Back Market, it's a bit like eBay for used electronics. There are different \"refurbishers\" on the platform basically flipping old phones for profit. I think they buy old phones in bulk for cheap and sell them for higher prices, thankfully the prices I've seen are about the right value, lower, even in some cases, made lower with some flash sales. The platform supposedly holds them to a high standard, ensuring that only the best can be there. However, when the standard is that it only needs to be cleaned outside, (that's not so bad, since interiors of modern smartphones are designed to be dustproof out of the factory) battery health only needs to be like 80 to 85%, and the required phone features are tested to work, then the device clears for selling. The battery part is really what sucks. 80% is quite low, anything below that the iPhone will suggest you replace the battery. \n\nI nabbed an iPhone XS, the last phone with a pressure-sensitive display. Dang I miss that feature. It got removed starting with the iPhone 11. Not enough people even knew about the feature. Very sad, it made expanding icon menus and activating other pressing functions faster than a long press, which is what that iPhone and above uses.\n\nUnfortunately, the used phone was a dud. I ordered a phone of fair condition, which meant it would have visible scratches and scuffs on it but is functional. The one I got I noticed immediate ugly scratches on the display glass covered by the screen protector. It covered them enough to make it not so annoying but quite visible. I thought, hey, it's not so bad, I can ignore them, if I'm not looking at light colors where the scratches are then it's nearly invisible. Other than that, nothing was really wrong with it other than battery health. Not surprisingly, it was almost in need of replacing. I expected to hold onto it enough to go get the battery changed eventually but that was not the case.\n\nIt was working fine until all of a sudden a narrow portion of the right edge stopped responding. I could no longer type the rightmost letters of the keyboard. Nothing I did fixed it. Fortunately the site has a generous 1 year warranty. I sent it back free of charge. I decided to try again with the same seller, same phone model, except larger storage. Better condition, even. At first, this one was going well too. It was in better physical shape. But quickly, things went south. I knew I shouldn't have made the same mistake again. This one had obvious problems. Battery health was below acceptable this time. \n\nThe earpiece speaker was very weak. Siri would not recognize voice commands. I initially thought, this is fine. I haven't used Siri often in the past and I could handle the weak speaker by using speaker phone for calls and not care about it in other scenarios because the bottom speaker was working perfectly.\n\nAs the months went by though, I realized these were starting to bother me after all so once again, I did the same thing to return it. 100% refund at least, because I paid in full for this one. For the first device, I tried out a monthly payment plan on a third-party service integrated into the site called Affirm. Yeah, don't do that for used devices. You're paying off a loan, and the interest you pay is not refunded. I lost out on about $13 on interest. Talk about a double whammy. I've stayed off of the used market since. If I was going to get a phone, I was going to get a brand new one. I wasn't going to go through that trouble again, I've already gone through it twice. At least the seller was really nice about it. A+ for that.\n\nFunny enough, my family doesn't have bad experiences with used phones, and all have been bought at Best Buy, not Backmarket. Just like me, there's going to be people who had nothing but great things there, and people who had nothing but bad experiences with Best Buy preowned phones. Used devices are a gamble but do have the appeal of helping older devices live longer and helping the environment by reducing e-waste.\n\nFast forward to me making good money after starting \\[driving job\\], and me as a birthday present and reward for passing my CDL test and training program, and with the most compelling reason to buy a new phone (aging device), I shelled out over $1100 for an iPhone 13 Pro Max at the Apple Store. If I knew I was gonna leave \\[driving job\\] so soon I wouldn't have done this, but oh well. The phone is in amazing condition almost a year later and shows no signs of slowing down. I can probably bank on this thing for even longer than the OnePlus. Then that will take the sting of paying so much, but I know I could have paid less for at least a repeat like the OnePlus I have no idea if I'm going to buy another iPhone so I went all out on this one. So far, with my carrier not supporting eSIM yet, I can't even use the current iPhones as a phone, so that's holding up for now. Even picked it up in-store to get the in-person experience. Still have my all-paper Apple handbag too with the original box. What nice packaging. No wonder people buy these things. \n\nI will continue using a secondary phone, no matter what. Although it started unintentionally, it's been my thing for years,  and it not only helps me if my main device goes down but also to operate in both iOS/ iPad OS and Android. As a tech enthusiast, I need this combo. I can't imagine ever having one or the other. I guess I just got lucky with how things ended up for me. This whole thing is what lead me to get interested in the first place.",
        "created_utc": 1679038271,
        "upvote_ratio": 1.0
    },
    {
        "title": "Happiness is ...",
        "author": "cayan6",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tk6d1/happiness_is/",
        "text": "[removed]",
        "created_utc": 1679038132,
        "upvote_ratio": 1.0
    },
    {
        "title": "After few weeks of sadness due to sudden breakup, I got the news that I am accepted into my dream company. Also, I managed to graduate my master's degree with distinction",
        "author": "megadreamxoxo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tk39f/after_few_weeks_of_sadness_due_to_sudden_breakup/",
        "text": "I applied for a global graduate program and I managed to secure a position! The company gives a good salary package, suportive environment towards work life balance, and the workers seem chill. The selections were very tough but I'm proud for getting the positon. Meanwhile, my final semester result was just released and I managed to get a good result. Life has been difficult lately and I'm so lonely, so I would like to share the news to all of you here :)",
        "created_utc": 1679037796,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm stress that if I'm (somehow) is taking away from dad and I have not seen my dad in a while (more then a day) and if I'm in a mental hospital and they force drugs on me (without me hearing from dad first) im nervous that If that situation happens to me may be at that point be at immediate risk",
        "author": "nickmen1",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tjrt8/im_stress_that_if_im_somehow_is_taking_away_from/",
        "text": "[removed]",
        "created_utc": 1679036586,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having weird/violent dreams",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1679035883,
        "upvote_ratio": 1.0
    },
    {
        "title": "not crying a sign of weakness !",
        "author": "Dead_eye_99",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tjip0/not_crying_a_sign_of_weakness/",
        "text": "Not letting yourself go through the pain naturally and trying to suppress your emotion. sacred of taking the natural step of bearing the pain",
        "created_utc": 1679035682,
        "upvote_ratio": 1.0
    },
    {
        "title": "My ADHD medication reduces my imagination and creativity",
        "author": "smokay-_-",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tj073/my_adhd_medication_reduces_my_imagination_and/",
        "text": "Earlier this year I started doing content production for my favorite video game company - making videos for their social and I found that I'm significantly better at it when I'm not taking my medication.\n\nI've always been a big day dreamer and that's the basis for the videos I make - I listen to music and picture hypothetical scenes in my imagination which then turns to inspiration and then my videos often come out exactly how I imagine it. (The game is action sports related by the way which is my biggest passion). \n\nAnyways, on days that I take my medication, I don't get that vivid mental imagery and I feel like I'm lacking inspiration. I sit at my computer and nothing comes to me . \n\nSo I've realized that my adderall drastically reduces my ability to day dream and hinderes creativity, inspiration and maybe passion? \n\nBut it works out because I created a system - do the creative bits un medicated, then do the mundane, technical parts of the editing process medicated. \n\nJust thought this was interesting and wanted to share",
        "created_utc": 1679033875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are black people called Africa America?",
        "author": "RefrigeratorCivil693",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tiuoq/why_are_black_people_called_africa_america/",
        "text": "Why are black people called Africa America but the other race don’t have American in it for example white peoples are called Caucasian not Caucasian American, and Asian people are called Asian or what ever kind of Asian they are and not Asian Americans, and also with Hispanic they’re called Hispanic or Latino not Hispanic American?",
        "created_utc": 1679033330,
        "upvote_ratio": 1.0
    },
    {
        "title": "Instagram account suspended...",
        "author": "CuriousAndOutraged",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tikuh/instagram_account_suspended/",
        "text": "My Instagram account has been suspended... they asked first for my phone number... something they already have... then they gave me a number and asked to take a selfie with that number and some extra personal information... it looks like a hack... anybody has gone through this before?",
        "created_utc": 1679032403,
        "upvote_ratio": 1.0
    },
    {
        "title": "My girlfriend is just the f@#king cutest thing ever",
        "author": "assistantmuffin232",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tibch/my_girlfriend_is_just_the_fking_cutest_thing_ever/",
        "text": "[removed]",
        "created_utc": 1679031537,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the strangest compliment you’ve received?",
        "author": "Kiwigoagain",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tiag6/whats_the_strangest_compliment_youve_received/",
        "text": "Tonight I had a patient compliment my hand calluses and another comment on how strong my hands are lol\n\nWhat’s the most peculiar/strangest compliment you’ve received?",
        "created_utc": 1679031451,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m going to get into cosplay and making pornography",
        "author": "zero2stallion",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tia8o/im_going_to_get_into_cosplay_and_making/",
        "text": "[removed]",
        "created_utc": 1679031432,
        "upvote_ratio": 1.0
    },
    {
        "title": "Buscas ayuda en el amor deseas que tu ex regrese ?. Escríbeme que yo puedo ayudarte sin problema",
        "author": "7_palma-TaTa",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ti5cf/buscas_ayuda_en_el_amor_deseas_que_tu_ex_regrese/",
        "text": "[removed]",
        "created_utc": 1679030994,
        "upvote_ratio": 1.0
    },
    {
        "title": "New phone this weekend!",
        "author": "ArtVandalay47",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11thzsk/new_phone_this_weekend/",
        "text": "So sometime this weekend I'm going to get a new phone. I currently have the Galaxy S9 plus.\n\nI've had it for 5 years now. I have never dropped it, not a scratch on it, and I have never used a case or screen protector in all that time. \n\nSo why am I getting a new phone? Becasue they stopped doing security updates over a year ago and it has me concerned since I pay most of my bills with my phone with apps. \n\nI'm probably gonna pick up the S23 plus. I thought about getting the ultra. But it's way more phone than I need since I never use the cameras.\n\nI really hate the idea that I have to upgrade in fear of a security breach for a phone that's in mint condition. \n\nSo what about you guys? Have an old phone you dont wanna part with? Or are ya a tech junkie upgrading every 2 years or less?",
        "created_utc": 1679030476,
        "upvote_ratio": 1.0
    },
    {
        "title": "2022-2023",
        "author": "Winter_Criticism_672",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11thz5p/20222023/",
        "text": "[removed]",
        "created_utc": 1679030417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do you guys hate emogies so much?",
        "author": "Karyote300",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tfxly/why_do_you_guys_hate_emogies_so_much/",
        "text": "I'll be honest i don't like emogies myself but that doesn't mean i hate them I'm pretty okay with them but then i saw a post with emogies and everyone went wild it's like someone fucked their mom\nI understand that emogies seem childish but why do you hate it so much.",
        "created_utc": 1679024084,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have never understood the concept of beauty and beauty standards.",
        "author": "Character_Skirt3868",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tftm5/i_have_never_understood_the_concept_of_beauty_and/",
        "text": "It’s simple. I look at someone. They’re a person. Nothing in my brain is triggered to analyze the placement of their facial features or the shape of their torso. No one is ugly. Everyone is beautiful in so many different ways. I just don’t get it.\n\nI never do get crushes easily. If I do, it’s likely because of someone’s personality or because they had cool clothes on. Looks don’t matter. At all. I never judge people by their looks. I never judge people by their body type. How I see it, it’s all some social pressure to possess a random assortment of traits. So I never got to understand why my friends would say “she’s so pretty” or “he’s so ugly”. They’re both just people.\n\nDo you feel ugly sometimes? I do. I judge myself off other’s standards, not my own. It’s a bit ironic. But I have good news for you. You’re not ugly. I’m not trying to belittle anyone’s feelings, it’s ok to not feel ok with yourself sometimes. But you are beautiful. I don’t care which features you have or don’t have. I don’t care about your shape. If you think you’re ugly, I hope you can learn to love yourself some day. I still have a ways to go myself. But I guess sometimes, to see things clearly, you have to be blind.\n\nbtw I hope this subreddit is the right place to post this",
        "created_utc": 1679023774,
        "upvote_ratio": 1.0
    },
    {
        "title": "online dating is depressing",
        "author": "HouseSolid4782",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tfn8a/online_dating_is_depressing/",
        "text": "Gf dumped me 4 months ago. Just tried online dating by friend's suggestion. Only got a few matches and only got to go on two dates. Both of them, we hit it off until it turned out they were looking for sugar daddies. I'm not paying for that shit.",
        "created_utc": 1679023239,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is reddit mostly left-leaning?",
        "author": "idkjon1y",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tf6yf/why_is_reddit_mostly_leftleaning/",
        "text": "[removed]",
        "created_utc": 1679021980,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your dream?",
        "author": "Apprehensive_Hat_647",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tf1v6/whats_your_dream/",
        "text": "What’s your life long dream? For me, it’s always been to have a place of my own.\n I’ve never had one since I bounced around so much growing up. At the end of the day, I just want something to call my own that can’t be taken away from me.",
        "created_utc": 1679021580,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m going to surprise my girlfriend tomorrow and I’m so excited!!",
        "author": "Mr--Ravioli",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tewm8/im_going_to_surprise_my_girlfriend_tomorrow_and/",
        "text": "My girlfriend and I are both in college, but our universities are about 3 hours apart so we don’t see each other too often. Tomorrow she’s getting back from a spring break trip with her sister and I’m going to surprise her at her apartment. I’m hoping to somehow time it well enough so that I can be making a nice steak dinner when she gets back. Any other ideas for what I can do?",
        "created_utc": 1679021182,
        "upvote_ratio": 1.0
    },
    {
        "title": "Had a funny conversation with my 6 year old. While he was working on a \"homework project\".",
        "author": "Intelligent-Can-8027",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tetoq/had_a_funny_conversation_with_my_6_year_old_while/",
        "text": "[removed]",
        "created_utc": 1679020945,
        "upvote_ratio": 1.0
    },
    {
        "title": "Went for a walk for 3 days in a row!",
        "author": "Nearby-Goat-8798",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11teozy/went_for_a_walk_for_3_days_in_a_row/",
        "text": "[removed]",
        "created_utc": 1679020574,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why isn't there a dedicated cyber police force?",
        "author": "MysteriousTakes",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11teajf/why_isnt_there_a_dedicated_cyber_police_force/",
        "text": "I've been seeing a lot of news on cyber security and the issues always go to the police or the FBI. Depending on the issue, it's too advanced for the police and not important enough for the FBI to spend their time on it. So there's this gray area in which cybercrime isn't really being brought to justice. I feel like in the future, there will be a dedicated cyber force but I think we need one quickly.",
        "created_utc": 1679019474,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hope to meet some friends here！",
        "author": "Foreign_Mushroom_223",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11te6f5/i_hope_to_meet_some_friends_here/",
        "text": "Hey! My name is Anna and I am from Korea and immigrated to America America is a wonderful country\n\nBTW, I'm 38, so hopefully I'm not too old here! Ha ha\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nMy hobbies are fitness, swimming, running, golf, traveling, etc. I don't know your hobbies but maybe you can tell me？",
        "created_utc": 1679019158,
        "upvote_ratio": 1.0
    },
    {
        "title": "I indirectly called the director of interior design a fool",
        "author": "MisterPuffyNipples",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tdkxw/i_indirectly_called_the_director_of_interior/",
        "text": "I do IT support and I got a call today from the director of interior design to assist him with MFA. \n\nI get a call from him asking how to login now that we implemented MFA. I explain to him he can use the DUO push and how it works. He struggles to get it done because the push wasn't going to his phone. I say ok let's use the pass code that is available on DUO, and that I use it because it's **full**proof. See i always thought the saying was fullproof. I never really thought why or that it makes no sense. I just became accustomed to saying fullproof. So i tell him use the code because it's fullproof. I hang up and for the first time ever using  that term i think to myself, oh no—is that actually the saying? Because it really doesn't make sense. And then of course to  my horror, the phrase is foolproof",
        "created_utc": 1679017559,
        "upvote_ratio": 1.0
    },
    {
        "title": "just got accepted for a job!",
        "author": "d3vilestkitten",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tdi2t/just_got_accepted_for_a_job/",
        "text": "[removed]",
        "created_utc": 1679017349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Depressing 21st",
        "author": "insecure-chick",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tdhpk/depressing_21st/",
        "text": "I’ll be turning 21 tomorrow and im just so hurt by how i had planned to party in a hotel with my friends after going out clubbing and such for the first time since i’ll be legal. But now my friends all decided to back out last minute. Which sucks in terms of my birthday plan and splitting the cost for the hotel since the hotel prices for some reason just ended up being crazy expensive for this weekend. \nI just cant believe they decided to back out on my birthday since i had the most exciting night planned out. 😞 It just makes me feel so lonesome and depressed with how this happened and being stuck with somehow paying the hotel.",
        "created_utc": 1679017321,
        "upvote_ratio": 1.0
    },
    {
        "title": "F23, looking for casual conversation, what was your dream job as a young child? please read below:)",
        "author": "triplesun313",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tda2k/f23_looking_for_casual_conversation_what_was_your/",
        "text": "Hello! I am a 23 year old college student, I love making art, listening to music, and reading. I am planning on (legally) getting high (love Washington state) and would love to chat with some cool people:) feel free to send me a message if you have something in particular you would like to talk about:)",
        "created_utc": 1679016730,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is the fruit called grapefruit which it is not even anything grape like.",
        "author": "CascadeCicada",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11td918/why_is_the_fruit_called_grapefruit_which_it_is/",
        "text": "[removed]",
        "created_utc": 1679016657,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello all! Please talk to me, it's a long story...",
        "author": "Certain-Animal9285",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tcu33/hello_all_please_talk_to_me_its_a_long_story/",
        "text": "I don’t think i can be concise enough to contextualize my problem, but i sure will try. Another observation is that english is not my first language, so i apologize in advance if some grammar mistakes happen. This is not a question itself, it's some kind of venting, one that i need to share with someone and i would really enjoy some feedback, opinions, could be harsh, could be nice, if you think it's BS or whatever, i will take it, but as you'll probably notice, i don't have many people to share things.\n\nNever in my life the ‘social’ thing appealed to me, i was always a loner, since my teen years. Also, that style of life never actually bothered me, i’ve enjoyed solitude for all these years, even in childhood i did not have many friends, maybe one or two. With that way of living, there is always something else to balance it, and in my case was the novels, specially the old ones. It all started with the classics, Dostoevsky, one i read when very young, if i can recall i was 13 reading The Gambler, the easy ones, and with time it went to some more complex existential ramblings. Now, with this kind of life, you actually live a fantasy world, not the well known optimistic fantasy, but nevertheless a fantasy, of characters and wonderings, imaginary passions and even imaginary afflictions, you see things differently, i suppose some of you could relate to the feeling of reading great novels and for a while living life as part of it. When it comes to my life, i’ve always lived these stories as part of my own, and it has always been humoring me, really. Also, i’ve always believed that what goes on our mind wasn’t so different than reality, in the end reality can only be perceived from our own perspective, which comes from our mind anyway. The few social encounters that i’ve had, my references or joke attempts had always been about some books (it’s what i’ve known best afterall), and the circumstances a lot of times got awkward. As an example, i was taking German classes at some point, and there was this guy who missed two classes and some women were wondering what happened to him, then i said he might be having problems with becoming a bug (an easy reference to Kafka, and i thought people would get it, we were in a german class), but nobody got it, and i just heard a younger girl saying “so random…”.  \nThis kind of stuff, once again, never bothered me, at best i was amusing myself with it, and it didn’t matter what others thought.\n\nTo the most recent times, the problem came. I have met a woman… Yes, a woman, the great fragility of men, women… And i knew right away she was special, peculiar, and most importantly, like myself she was marginalized at her own wish. Both of us disliked social media, tattoos, bars, nightclubs, noise (and most things that a lot of people can’t live without in our time and age), and both of us lived a literary life - and by that i don’t mean a professor, or someone who works with it, but people who fantasize about it, who actually live it. In my country, literature is not very popular, it’s mostly about dancing, partying and etc., (you guessed it, its Brazil). This woman, at our first conversation, told me she bought a dual-language book (german and english \\[there wasnt a dual language with portuguese\\]), and it was Narcissus and Goldmund, a book from my favorite author (Hermann Hesse) that i had never known anyone who had even heard about it, here. Then, she asked me: “what are you? Narcissus or Goldmund?”, and i said “i’m probably more of a Siddhartha”, and this was, i believe, the first time in my life where someone actually got a weird reference of mine. I know that, for some of you, this might sound so absolutely boring, but it felt really special for me, and i knew that, if there is someone, she is the one.\n\nWe kept talking for a while, and it was absolutely gorgeous, i couldn’t stop thinking about her, and with time i decided i had to move forward, so i subtly started talking about more serious things, like the future, asking her about what she wants for her life, family, children, etc. Then, eventually, i slowly started showing her my affections, telling how much i thought she was different, at some point i even told her, out of nowhere, that in my 35 years of life, i would certainly remember if i knew someone as peculiar as herself, but i didn’t… remember. She wouldn’t respond very charismatically, but she did not have that much charisma since the beginning, so not a big deal for me anyway. I must add that a lot of our conversations, most of it actually, were texting, both of us were very busy at the time with work and all.\n\nBut, at a certain day she told me that she had feelings for someone, and that someone wasn’t me. This was so very painful that i will dismiss the words to describe it, “but ok”, i thought, i suppose affection comes with time, and she is not dating anyone, she only have feelings for this guy, this might change at some point. We kept talking, and i started realising that i wasn’t even close to be as important to her as she was to me, the imbalance was absurd, time has told me that, the more i talked to her, the clearer it became, and the more painful. For me, we were some lost souls who found each other, the only complement i came to know that i needed, but for her i was just a guy who liked the same things and nothing more.\n\nThis is not to say she has any fault on it, she was always very polite to me, but now, the solitude that i’ve always enjoyed became something of a punishment, i can’t bear it, this never bothered me before but after meeting here it feels like it bothered me since i was born. I’m even losing weight, and reading - the last few days - is just a kind of torture to remind me of her. She is a bit younger than me, 26, almost ten years, but this i don’t see as a problem, or is it?\n\nIt seems like i need to have a family and children now, and i mean literally, it actually feels like a NEED, for the sake of my happiness, and she is the one, clearly, for me. I am not the one for her, also clearly, this asymmetry appears to be incredibly unfair, though i know, rationally, it isn’t, it’s just part of life. Maybe my style of life since the beginning made me this way, unaware of how some things work and the frustrations are magnified in an almost intolerable way.",
        "created_utc": 1679015556,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m bored: Ask me a question. After I answer, change the question to make me look like a freak!",
        "author": "DoomScrollinDeuce",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tckq6/im_bored_ask_me_a_question_after_i_answer_change/",
        "text": "Just a fun little post to hopefully get some laughs.  I’m sure we can all use some laughter these days.\n\nHave fun!  Ask me anything. Try to keep it SFW, but anything goes!\n\nI’m bored: Ask me a question. After I answer, change the question to make me look like a freak!",
        "created_utc": 1679014861,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you could only eat one food for the rest of your life, what would it be? I'm torn between pizza and tacos!",
        "author": "Confident_Place_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tcipk/if_you_could_only_eat_one_food_for_the_rest_of/",
        "text": "[removed]",
        "created_utc": 1679014719,
        "upvote_ratio": 1.0
    },
    {
        "title": "Top Ten Numbers: thinking about making a tier list for every number, in my head i have them ranked up to 9,387,483,498",
        "author": "the_neighborhood_npc",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tchm8/top_ten_numbers_thinking_about_making_a_tier_list/",
        "text": "[removed]",
        "created_utc": 1679014636,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you feel or see more homeless , drug user or people who have mental problem in your area?",
        "author": "PingPongBall1234",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tc4x9/do_you_feel_or_see_more_homeless_drug_user_or/",
        "text": "[removed]",
        "created_utc": 1679013755,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can’t get over the things I’m ashamed of doing",
        "author": "normymacstan",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tbwcq/cant_get_over_the_things_im_ashamed_of_doing/",
        "text": "These were all when I were 15 or younger (22 now) But I feel like such a piece of filth for it.  \n\nToo much guilt to go on every day and act like everything’s fine when I know there’s too many things to take back.  I’ve violated peoples privacy and acted like a creep.  \n\nIt doesn’t matter how much growing I do.  I can’t take them back.",
        "created_utc": 1679013534,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think of using celebrity I V fluids, taking diabetic medication for weightloss, and as well as other health trends?",
        "author": "GreyEyedVampire",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tb64r/what_do_you_think_of_using_celebrity_i_v_fluids/",
        "text": "It honestly gives me Hunger Games vibes. It's  just so weird how the incredibly rich can just buy diabetes medicine for weight loss and IV fluid mixed with vitamins for a \"Pick me Up\". Meanwhile shortages in medicine and medical supplies happens globally all the time. Capitalism is to blame, and probably those who created these business, but I feel weirdly cheated about it. Am I alone about this?",
        "created_utc": 1679012109,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's my birthday 🎈",
        "author": "janaaa000",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tajo4/its_my_birthday/",
        "text": "Tell me one thing a 23 years old girl should know it.\n\n I made a decision to take this year as break from everything, I just want to live for me. I'm doing stuff for me and enjoying my time with myself.\n\n Where were you when you turned 23? \nWhere do you see yourself when you're 23?",
        "created_utc": 1679010572,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's my birthday 🎈",
        "author": "janaaa000",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11tachg/its_my_birthday/",
        "text": "[removed]",
        "created_utc": 1679010075,
        "upvote_ratio": 1.0
    },
    {
        "title": "first crush i think",
        "author": "regoshi73",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t9zjk/first_crush_i_think/",
        "text": "Hi, well, I think I fell in love for the first time and I've done quite well with her and I'd like to talk about it. So that the text does not remain so empty, I will describe myself: I am a tall boy who has a physical resemblance to the boy from blackjack 21 but I have a more miserable appearance lol and well, a very dual personality and well, a shy man with a lot, but a lot of courage lol",
        "created_utc": 1679009221,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the most intriguing secret of humanity, in your opinion?",
        "author": "Dulce_tentacion",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t92oy/what_is_the_most_intriguing_secret_of_humanity_in/",
        "text": " \n\nOn a summer night, I gathered with a group of friends around a bonfire for an evening of conversation and laughter. It all started with funny stories, but soon the conversation turned philosophical. One of us asked, \"What is the most intriguing secret of humanity?\" We all gave our opinions, arguing our reasons, from the origin of the universe to the purpose of life. But as we debated, something started to feel off. The darkness seemed denser, and we heard noises in the nearby bushes. The fire flickered unsettlingly, and a sense of someone watching us overtook us. The conversation became tense, as we tried to stay calm and figure out who or what was stalking us. Although we didn't reach a definitive answer about the most intriguing secret of humanity, the mysterious presence became our new obsession. We decided that each of us would investigate both the secret and the strange visitor, and we would gather again to share our findings. What was that mysterious being watching us from the darkness? And what deeper secrets about humanity could we uncover along the way? The night had taken an unexpected turn, but I couldn't wait to find out what the next gathering would hold.",
        "created_utc": 1679007222,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think depressed people can't take compliments easily?",
        "author": "Ghost3080",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t92kg/do_you_think_depressed_people_cant_take/",
        "text": "I notice that when someone compliments me about something, I don't know how to react. I had a girl last night telling me that I'm an amazing person and a lot of other positive things, but it simply doesn't go into my head, it's like I can't believe her.",
        "created_utc": 1679007214,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your greatest inhibitions? Who might you be and what might you do had they not been so prevalent?",
        "author": "venuswithoutfurs",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t91e3/what_are_your_greatest_inhibitions_who_might_you/",
        "text": "I tend to consider my identity in regards to questions of desires and aspirations and the actions taken to secure those, etc. There is another aspect, though, that I'm beginning to properly contemplate on - the inhibitions that impede on the rest. \nThese inhibitions remain unaddressed throughout my ventures towards success, and sometimes falsify themselves as benign motivations. For example, my fear of judgement is seen as an incentive for good behaviour, but it only enforces social stagnancy.  And there are countless more.\nI am realizing that the foundation of my being is built off of more fear and concern  (resulting in pseudo-motivations or inhibitions) than anything else.  With that, I wonder more about how I would be without them and if I could be without them. Some inhibitions are necessary for self-preservation but I am not referencing those.  For this post, I am asking for your opinions and ideas on this subject.\n\nQuestions: \n\n1. What are your driving inhibitions?\n2. Do you think you could ever soften and dismantle them? To any degree.\n3. Who would you be without?\n\n\nI'm *very* interested! I do not have an answer myself, and maybe these questions are inconsequential and useless, but I don't think there should be much shame in this curiosity.",
        "created_utc": 1679007139,
        "upvote_ratio": 1.0
    },
    {
        "title": "Those of you that have a roommate, how did you meet them?",
        "author": "Aqacia",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t8ope/those_of_you_that_have_a_roommate_how_did_you/",
        "text": "Been thinking about trying to find a roommate, as can't afford place all by myself fully in this day and age. Anyone living with anyone right now and would you recommend it?",
        "created_utc": 1679006346,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where did all the overweight people go? USA",
        "author": "kwjv",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t8ir7/where_did_all_the_overweight_people_go_usa/",
        "text": "I don’t need to clarify that being overweight doesn’t make you less human but I will anyways. But I feel like they’ve disappeared. There’s a few every once in awhile that I’ll see when I’m out and about, but I remember it wasn’t so rare before covid?",
        "created_utc": 1679005966,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the most unsettling thing you can hear from parrot?",
        "author": "Hoplite-Litehop",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t8cjm/what_is_the_most_unsettling_thing_you_can_hear/",
        "text": "I'm writing a short story and I want something.....\n\nAbsolutely bone chilling.\n\nSomething that if you were in the middle of the jungle you would dread to hear a parrot say",
        "created_utc": 1679005587,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Do You Think Of The Mobile Game Dragon Raja ?",
        "author": "KakeguruiKairenji",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t87gm/what_do_you_think_of_the_mobile_game_dragon_raja/",
        "text": "[removed]",
        "created_utc": 1679005269,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tell me one thing good that happened this week!",
        "author": "ColdHearted01",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t7um1/tell_me_one_thing_good_that_happened_this_week/",
        "text": "Hello! I'm new around here! I admittedly had a terrible week: lost power on Tuesday, and slept horribly on Wednesday, and it's the busy season at work and all—but I went to the gym today, and I have tomorrow off! (Along with a dentist appointment, but, well...)\n\nSo: how has your week been going, everyone, and tell me one good thing that happened? Thank you!",
        "created_utc": 1679004452,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just got my semiannual nosebleed. That means it's officially Spring!",
        "author": "We_Roll_This_Stone",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t7p6c/just_got_my_semiannual_nosebleed_that_means_its/",
        "text": "For as long as I can remember, my nose has spontaneously bleed twice a year, every year, always when the weather changes from warm to cold and vice versa.   \nI can tell when the season has changed this way. Not that it *will* change, mind you, it's not a prediction tool of any kind. It's about as useful as going outside and looking up. Most useless superpower ever. XD  \n\n\nAnyway, happy Springtime, northern hemisphere!  \n\n\nAnyone else have a useless superpower or odd seasonal event that happens to them regularly?",
        "created_utc": 1679004096,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips to help get an advantage in a potato sack race?",
        "author": "ExpressHousing4636",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t7lc5/any_tips_to_help_get_an_advantage_in_a_potato/",
        "text": "[removed]",
        "created_utc": 1679003857,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I ask for some general advice about this game dev grant?",
        "author": "Key_Investment_3544",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t7iax/where_can_i_ask_for_some_general_advice_about/",
        "text": "[https://www.screenaustralia.gov.au/funding-and-support/online/games](https://www.screenaustralia.gov.au/funding-and-support/online/games)\n\n&gt;\"Screen Australia will provide grants of up to $150,000 per successful application for production of a digital game **with a budget up to $500,000**\"\n\nWhat does it mean by \"**with a budget up to $500,000**\"?  \nDoes that mean I need to have money up-front before I can apply for the grant?",
        "created_utc": 1679003652,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grape jelly on a pb&amp;j is better than strawberry jelly",
        "author": "nbrinz",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t77s4/grape_jelly_on_a_pbj_is_better_than_strawberry/",
        "text": "[removed]",
        "created_utc": 1679002958,
        "upvote_ratio": 1.0
    },
    {
        "title": "Idk if this is a sign that i should back off or worry",
        "author": "polipioo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t76c3/idk_if_this_is_a_sign_that_i_should_back_off_or/",
        "text": "Today i was texting an old friend and i got worried. I asked twice how was he doing and he kinda dodged the question both times, instead he told me what he was doing.\n\nDo you think that question is too intimate? Am i reading too much into it?",
        "created_utc": 1679002860,
        "upvote_ratio": 1.0
    },
    {
        "title": "About to turn 20 in less than 3 hours",
        "author": "Skywolf2014",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t72om/about_to_turn_20_in_less_than_3_hours/",
        "text": "And even to this day it doesn’t feel real. I’m still in the mind set of a teen and not giving af in the world. Im fortunate to be in a good place rn. I think I just wanted to give ppl who are younger an advice: be yourself, that’s how you become happy. Don’t worry too much of things especially when ur applying to college, everything ur worrying abt will turn out fine. To ppl who are older, any advices for a 20 year old who’s soon gonna step into society?",
        "created_utc": 1679002621,
        "upvote_ratio": 1.0
    },
    {
        "title": "what’s everyone’s signature dish? what do you cook best? :)",
        "author": "blueberrypeachfizz",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t6xbq/whats_everyones_signature_dish_what_do_you_cook/",
        "text": "[removed]",
        "created_utc": 1679002275,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friends and reaching out",
        "author": "90DayThrowaway8",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t6gxc/friends_and_reaching_out/",
        "text": "Does anyone here just not hear from their friends if they aren’t the first person to reach out? What did you to do to either change the situation or get comfortable with it?",
        "created_utc": 1679001213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you take offense if someone who you’re not close with texts back immediately?",
        "author": "Cryptanthusman",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t6edo/do_you_take_offense_if_someone_who_youre_not/",
        "text": "When I’m talking to people over text I generally respond as soon as soon as I’ve both seen the text and have some downtime with which I can compose some sort of thoughtful response. \n\nSometimes I get a text and already am not busy with and on my phone, so naturally, I reply in pretty short order. Most people besides my girlfriend though usually seem to take subtle offense to a quick reply. Be it in the form of taking a longer delay than normal in their own reply or being particularly terse. \n\nIs there some sort of common courtesy with taking a similar period of time to reply as between previous messages? Or am I just overthinking people’s schedules and interest in written online communication?",
        "created_utc": 1679001051,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t get why some rich people are obsessed with clothes",
        "author": "skyrimlo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t69hx/i_dont_get_why_some_rich_people_are_obsessed_with/",
        "text": "I’m Vietnamese-American, so I know a lot of rich nail salon owners, who spend $50,000 on Cartier bracelets and watches. That shit dumb asf to me. Every poor street vendor in Vietnam has on a Burberry shirt or Chanel shirt. Knock-off designer clothes and fake jewelry are everywhere. Every dirt-poor street vendor in Vietnam living in the slums has a Chanel shirt and a Hermes bag. I remember buying street food from a vendor who had on a Gucci shirt and a Gucci purse.",
        "created_utc": 1679000737,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have many frenemies",
        "author": "truthandfreedom3",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t5sl2/i_have_many_frenemies/",
        "text": "Frenemies are friendly enemies. I only have long conversations with my roommate, and she has told me several times, that she hates me. I only have a long term relationship with my brother, but he doesn't send me money, or makes me ask for it every month - but my parents left their money with him, to support me. You know what they say: keep your friends close, but your enemies closer. What about frenemies?",
        "created_utc": 1678999661,
        "upvote_ratio": 1.0
    },
    {
        "title": "Life advice",
        "author": "luvales",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t5i4b/life_advice/",
        "text": "I'm 17, I like to draw and I would like to be a graphic designer, although I have a lot of doubts about it.  there are a few months left before admission, but now I don't know what to do at all.  I feel that I won't be able to pass the art exam and I won't be able to get where I want to go.  now it seems to me that this may be a mistake to be an artist and I should choose another profession, but the problem is that drawing is the only thing that interests me. also I am afraid that I will study there for several years and will not be able to do anything with drawing skills. idk what to do rn. \n \n(also english is not my mother language, so sorry for some mistakes)",
        "created_utc": 1678998995,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s a “normal” day?",
        "author": "Opening_Medicine_314",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t5e01/whats_a_normal_day/",
        "text": "I hate working out so I force myself to do it and then tell myself I can sit the rest of the day/evening. Is this what others do? Or do you workout but also go on walks and other activities daily? Just curious.",
        "created_utc": 1678998735,
        "upvote_ratio": 1.0
    },
    {
        "title": "making some friends?",
        "author": "takemeout_25",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t51gz/making_some_friends/",
        "text": "Trying to make friends :) 16-20\n\nHello, I'm 17 and looking for people to talk to. I'm trying to branch out as I dont go to a typical school (online) so I don't have a lot of friends. I'm a cancer survivor, feel free to ask questions about that. We could play minecraft or some kinda game? Dm me or reply below",
        "created_utc": 1678997931,
        "upvote_ratio": 1.0
    },
    {
        "title": "I guess I finally understand life",
        "author": "Revolutionarypanda13",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t4y7t/i_guess_i_finally_understand_life/",
        "text": "\n\n\n\nI turned 26 this week and I finally realised that I am not special, infact I am the opposite of that. I know it's something I should have known or realised earlier. The good part is I am accepting this fact really well. All these years I kept saying I was special, that all these pain and trauma would not be in vain, that the universe might finally show me some kindness, but I was wrong. The universe doesn't owe me anything and my pain and trauma might just be that. Nothing good is going to happen just because I went or going through it. I guess I finally understand life. It took me a long time to learn. Not gonna lie I am a little disappointed though. I saw others and always thought my life would have a balance like theirs bad and good-good and bad. It's not gonna. This is it.  Not gonna lie though, getting used to disappointment and uncertainty might take some time but I remind myself every day that I am not special and that I should stop thinking I deserve better.  It's funny because I suspected all of this as a child, but I dismissed it because I needed to survive and thinking this is it, would not have helped me survive. Thinking that I simply needed to survive till someone who understood me came and rescued me (because I thought I was special), is what helped me survive. But now that I am old enough, I have learnt the truth.\n\nSince I believe in the whole infinite number of us in the infinite number of universe, I do believe in one of them I never have to  stop thinking I am special. \nWhat is the one thing the other you in the other universe is definitely doing or not doing?",
        "created_utc": 1678997724,
        "upvote_ratio": 1.0
    },
    {
        "title": "making friend.",
        "author": "takemeout_25",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t4vew/making_friend/",
        "text": "trying to make friends :) 16-20\n\nHello, I'm 17 and looking for people to talk to. I'm trying to branch out as I dont go to a typical school (online) so I don't have a lot of friends. I'm a cancer survivor, feel free to ask questions about that. We could play minecraft or some kinda game? Dm me or reply below",
        "created_utc": 1678997543,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm being blackmailed by a bot and idk what to do",
        "author": "Correct_Ad_6999",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t4ssx/im_being_blackmailed_by_a_bot_and_idk_what_to_do/",
        "text": "[removed]",
        "created_utc": 1678997383,
        "upvote_ratio": 1.0
    },
    {
        "title": "I finally understand life.",
        "author": "Revolutionarypanda13",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t4s6m/i_finally_understand_life/",
        "text": "\n\nI turned 26 this week and I finally realised that I am not special, infact I am the opposite of that. I know it's something I should have known or realised earlier. The good part is I am accepting this fact really well. All these years I kept saying I was special, that all these pain and trauma would not be in vain, that the universe might finally show me some kindness, but I was wrong. The universe doesn't owe me anything and my pain and trauma might just be that. Nothing good is going to happen just because I went or going through it. I guess I finally understand life. It took me a long time to learn. Not gonna lie I am a little disappointed though. I saw others and always thought my life would have a balance like theirs bad and good-good and bad. It's not gonna. This is it. \n\nNot gonna lie though, getting used to disappointment and uncertainty might take some time but I remind myself every day that I am not special and that I should stop thinking I deserve better.  It's funny because I suspected all of this as a child, but I dismissed it because I needed to survive and thinking this is it, would not have helped me survive. Thinking that I simply needed to survive till someone who understood me came and rescued me (because I thought I was special), is what helped me survive. But now that I am old enough, I have learnt the truth.",
        "created_utc": 1678997343,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can one become the listener in a conversation?",
        "author": "sailordem",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t4s56/how_can_one_become_the_listener_in_a_conversation/",
        "text": "In every conversation I start, I end up being the only one talking at some point. The conversation won’t go on, unless I talk. But I want to find out more about the other person as well and I don’t think the other end of the conversation feels comfortable listening to me go off about stuff either😅. It could be because people don’t like me. But all of my closest friendships have also been like this and none of those people ever said they didn’t like me. How do you guys deal with this? Are there certain questions you use to make the other person more comfortable about taking more time for themselves to talk? Or have you maybe made any observations about people like me, who always lead the conversation alone and what we do wrong? Personally, I love hearing more about other people’s life, experiences, ideas,… and thats why I want to improve my communication skills.",
        "created_utc": 1678997340,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help I need just 7 people I joined this app called Temu. It legit has stuff dirt cheap. You get free money after so many people you invite to the app. And free gifts. I’m trying to get a espresso maker. Also if this",
        "author": "ragginrican",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t4kls/i_need_help_i_need_just_7_people_i_joined_this/",
        "text": "isn’t allowed on here atleast let it stay on here for 4 hours I just need 7 people and 4 hours left before the offer expires\n\nhttps://temu.com/s/idxWUVrufMgDist",
        "created_utc": 1678996848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking people interested in improving english or just casual conversation",
        "author": "ExplanationSuper2860",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t4il9/seeking_people_interested_in_improving_english_or/",
        "text": "Hello, strangers from the internet!  \nWe have an **english language club**.   \nIf you are interested in practicing English language, finding new friends or you can already speak English fluently you would find this really useful.  \nWe meet via zoom almost everyday and each session is of 1 hour.  \nOur requirements: Over 16 years old and at least lower intermediate english level.   \nSo, plz upvote so this message can reach its target audience.   \n**Comment below or dm me for full information!!**",
        "created_utc": 1678996731,
        "upvote_ratio": 1.0
    },
    {
        "title": "trying to make friends :) 16-20",
        "author": "takemeout_25",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t4hvd/trying_to_make_friends_1620/",
        "text": "Hello, I'm 17 and looking for people to talk to. I'm trying to branch out as I dont go to a typical school (online) so I don't have a lot of friends. I'm a cancer survivor, feel free to ask questions about that. We could play minecraft or some kinda game.",
        "created_utc": 1678996679,
        "upvote_ratio": 1.0
    },
    {
        "title": "What song have you guys been jamming out to recently?",
        "author": "Senior_Fish_Face",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t4ftm/what_song_have_you_guys_been_jamming_out_to/",
        "text": "Recently played through and beat Hi-Fi Rush, so for me it’s been The Beacon by The Glass Pyramids. \n\nAlways down to discover new music though, so with that said, what song have yall been listening to recently that’s caught your attention?",
        "created_utc": 1678996545,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm bored, trying to make some friends(16y-20y)",
        "author": "takemeout_25",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t4eog/im_bored_trying_to_make_some_friends16y20y/",
        "text": "[removed]",
        "created_utc": 1678996477,
        "upvote_ratio": 1.0
    },
    {
        "title": "stuck at home in bed with an annoying injury. what is everyone else up to?",
        "author": "summerstargarden",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t4ae7/stuck_at_home_in_bed_with_an_annoying_injury_what/",
        "text": "i got in between the dogs while they were scrapping to break them up, &amp; got a big chunk of my leg bitten out. we got the dogs apart so they’re okay, but my dad got a tooth through his thumb lol.\n\nanyway i just started reading my favorite book series over again, been watching podcasts, movies, shows, etc. but i am sooo bored, i want to enjoy the budding springtime. i should be all healed up by summertime though so its not too bad.",
        "created_utc": 1678996205,
        "upvote_ratio": 0.99
    },
    {
        "title": "What was an impactful moment in your life?",
        "author": "_-Sesquipedalian-_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t3uoj/what_was_an_impactful_moment_in_your_life/",
        "text": "For a job interview I have to describe a moment in my life which helped my personal growth. I have absolutely no idea what to write about, and could use some inspiration! Obviously I will write my own and experience but I just need some ideas in which direction to think.",
        "created_utc": 1678995176,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does friendship break hurts?",
        "author": "RemarkableTry877",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t3rl6/does_friendship_break_hurts/",
        "text": "[removed]",
        "created_utc": 1678994978,
        "upvote_ratio": 1.0
    },
    {
        "title": "My sister is 1 year sober today",
        "author": "feetbyamy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t34zc/my_sister_is_1_year_sober_today/",
        "text": "My sister has been struggling with addiction for a couple of years but today we celebrate her 1 year sobriety! It's been really tough but I'm glad she's finally getting better!",
        "created_utc": 1678993496,
        "upvote_ratio": 1.0
    },
    {
        "title": "i’ve been stuck on bed rest with a dumb stupid injury all week. what is everyone else up to?",
        "author": "cowgrlblues",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t2f0i/ive_been_stuck_on_bed_rest_with_a_dumb_stupid/",
        "text": "[removed]",
        "created_utc": 1678991870,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need name recommendations for my fish.",
        "author": "afsanah",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t2ez5/i_need_name_recommendations_for_my_fish/",
        "text": "I have a fish with no name. So can you guys suggest me some cute/funny names for him?\n\n He is a platy. \n\nDo you think orange is a good name for him?",
        "created_utc": 1678991867,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are bands and musicians where you can hear the whole discography up and down without disliking one song?",
        "author": "Dr-Causti",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t26gl/what_are_bands_and_musicians_where_you_can_hear/",
        "text": "For me it's probably Jefferson airplane. Recently when i was in the right \"mindset\" ;) for that era anyway and didn't know what the right music for the situation was, i put one of their albums in and realised after like 8 hours that I've pretty much been through all albums and just loved everything about it. That's the one band i can always listen too, no matter the daytime or mood.",
        "created_utc": 1678991336,
        "upvote_ratio": 1.0
    },
    {
        "title": "Proud of myself",
        "author": "Lovelanguage-dogs",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t1xul/proud_of_myself/",
        "text": "I made a new patient appointment with another doctor today.  This will be the 5th doctor in 5 years and I was going to stay with my current doctor who had me on medication that is making me very sick just because I didn’t want to be “that patient” and be a doctor hopper.  It’s not that I want them to just tell me what I want to hear, I just don’t want to be on medicine that makes me so sick that I’m scared to even eat and end up with disordered eating.  So, yay me.  It’s really hard to advocate for yourself over and over and over but I’m out here doing it.",
        "created_utc": 1678990800,
        "upvote_ratio": 1.0
    },
    {
        "title": "When nothing goes right, turn left?",
        "author": "Agent47B",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t1xbp/when_nothing_goes_right_turn_left/",
        "text": "I'm sorry I didn't know what to put as title. A bit frustrated about everything right now, life in general, because of the every small things going the wrong way. Wish there was turn off button. \n\nHowever, I'm trying to make things better. One at a time, slowly and gradually. Trying to pat my back for any small achievement. Isn't working out but hey, I'm trying. \n\nJoined gym too, so there's some progress. \n\nHope you are having a good day!",
        "created_utc": 1678990767,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mr. Fly got too high",
        "author": "OldgrowthNW",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t1n91/mr_fly_got_too_high/",
        "text": "I accidentally left an edible on the table. I noticed a lil fruit fly enjoying himself on the sugary sweet *nom nom nom*.. I thought of shoeing it away, but how could I decline it such sustenance.  Came back a little later.. ole’ fly died :( \n\nI’m hoping it was a better way to go than to be squished out of spite.",
        "created_utc": 1678990139,
        "upvote_ratio": 1.0
    },
    {
        "title": "Failed a drug test and got hired anyways!",
        "author": "nothingsatisfying",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t1kqw/failed_a_drug_test_and_got_hired_anyways/",
        "text": "I had to share this amazing news to someone! I can’t even tell you how incredibly lucky I feel. In my state, we have delta 8 pens that you can buy at pretty much any gas station. Unfortunately, they show up as THC on a drug test. I knew this information so I completely quit my nighttime routine hits off of the delta pen. I had a drug test today for a job (I’ve been jobless for 2 months and savings are getting way low). I hadn’t hit the pen in 16 days so I was hoping I would pass. Nope. I failed. I left the place I was hoping to get a job at quite disappointed and thinking of other places to work. I live in a very small town so the only jobs here is fast food, but if that’s what I’d have to do, Id just have to do it… anyways I get home and they called me back. The administration allowed me to be hired simply because they are short on help and have been trying to get corporate to change their THC policy because you can by these delta pens practically everywhere now. I cannot tell you all how grateful I am. And no, no more delta pens for me. This job has random drug tests so I absolutely do not want to risk it. Cheers everyone and thank you all for reading! :D",
        "created_utc": 1678989986,
        "upvote_ratio": 1.0
    },
    {
        "title": "I did a good thing today",
        "author": "Ash-Vs-Evil-Bread",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t198m/i_did_a_good_thing_today/",
        "text": "On the way back home from work my intrusive thoughts won and i jumped onto a rope swing, it broke of course, but I rolled it into the yard (it's just outside someones yard) with a note and an apology and that I'll pay for a replacement rope.\n\nWell they called a couple of hours ago, didn't want anything from me but they just wanted to thank me for offering to help. \n\nSo yay, ego and ass are still bruised but I think i did something right today",
        "created_utc": 1678989301,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ah, could I interest you in …",
        "author": "mtntrail",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t18ko/ah_could_i_interest_you_in/",
        "text": "So I just finished “Dog Stars”. post apocalyptic read on my Kindle by Peter Heller. I received an email from “Goodreads” stating “You just finished reading Dog Stars, here are some ideas on what you can do next.” WTF,\nwho is this Mr. Goodreads and how the heck did he know within an hour that I had finished reading a particular book?\nMerely a cog in the wheel!",
        "created_utc": 1678989260,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does it seem crazy to anyone else that in most developed countries we defecate into potable drinking water?",
        "author": "snazzydetritus",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t0rg0/does_it_seem_crazy_to_anyone_else_that_in_most/",
        "text": "[removed]",
        "created_utc": 1678988198,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oops a daisy..",
        "author": "MagicianIntrepid",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t0pi5/oops_a_daisy/",
        "text": "[removed]",
        "created_utc": 1678988087,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just slept 12 hours earlier than usual and don’t know if that’s bad",
        "author": "Throwawayabcnocme",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t0p6i/i_just_slept_12_hours_earlier_than_usual_and_dont/",
        "text": "Because I’ve been having trouble feeling sleepy till last minute.I think it has to do with having FOMO from just working plus me feeling miserable at my job(too much work discouraged and now I’m more socially isolated from being overworked by it being too busy).\n\nThe point is this week haven’t been able to feel sleepy till like late morning when it’s almost afternoon.I know yesterday was the latest I slept because was debating pulling an all-nighter or sleeping late since wasn’t feeling sleepy that night(Yesterday I ended up sleeping 11-6p.m)\n\nI was tired of not being able to feel sleepy till last minute so last night I decided to sleep way earlier than usual plus I was sleep deprived from other nights(I ended up sleeping at 9p.m last night,woke up at 1,fell asleep and woke up at 4a.m)\n\nI don’t know what’s wrong with me,added that it’s daylight savings,I used to sleep better before I got a job and have a feeling if I don’t fix my sleep.",
        "created_utc": 1678988066,
        "upvote_ratio": 1.0
    },
    {
        "title": "Points at Starbucks",
        "author": "JohnMullowneyTax",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t0og0/points_at_starbucks/",
        "text": "Todays surprise, my point totals at Starbucks was about to provide me with five (5) free brewed coffees, when I discovered that the  requirement changed to 100 points from 50, somewhere in the not too distant past…..\n\nDisappointed!!",
        "created_utc": 1678988019,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you listen to when drunk and nostalgic?",
        "author": "not_a_heretek",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t0nb7/what_do_you_listen_to_when_drunk_and_nostalgic/",
        "text": "[removed]",
        "created_utc": 1678987949,
        "upvote_ratio": 1.0
    },
    {
        "title": "Redditors are the best search engine out there!",
        "author": "meowerguy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t08zh/redditors_are_the_best_search_engine_out_there/",
        "text": "Hey everyone,\n\nI just wanted to take a moment to share how grateful I am for this amazing community. Whenever I'm looking for an answer to a question or trying to solve a problem, I always turn to Reddit first - and I'm never disappointed!\n\nWhat's really struck me is how willing everyone is to help out. Whenever I've posted a question, I've always received thoughtful, insightful answers from people who really know their stuff. And even when I've just been browsing, I've learned so much from the conversations and discussions happening here.\n\nIt's really amazing to be part of a community that values knowledge and helpfulness so highly. And what's even more impressive is how often Redditors have the answers to questions that can't be found on Google or other search engines. I can't count how many times I've added \"Reddit\" to the end of a search query and found exactly what I was looking for.\n\nSo, here's to all the amazing Redditors out there who make this platform such a valuable resource! Thank you for being so helpful, knowledgeable, and welcoming to everyone who comes here seeking answers.",
        "created_utc": 1678987097,
        "upvote_ratio": 1.0
    },
    {
        "title": "Make real friends",
        "author": "Fearless_Set_6335",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11t088q/make_real_friends/",
        "text": "I am 30F years old, came to the United States two years ago, because of the war in the country led me to foreign countries, and my friends went their separate ways, I am a person afraid of loneliness, before I posted on this software, either in scolding me, or younger than my age, did not chat a few sentences did not continue to chat, so now I want to make some friends with my age or older than me.",
        "created_utc": 1678987052,
        "upvote_ratio": 1.0
    }
]