[
    {
        "title": "I killed Malenia, Blade of Miquella for the first time!",
        "author": "Skhighglitch",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113fdg0/i_killed_malenia_blade_of_miquella_for_the_first/",
        "text": "Took me about an hour after not touching this character for a month to slay her. It was epic! I grabbed Black Knife Assassin Tiche and managed to stun lock her through most of her first and second phase. I let Tiche die after she scarlet-nuked and decided to let her come to me, have her attack first, then wail on her. She’s really nimble, but she’s easily staggered. The excitement on my face when she dropped and I felt like a badass. I’m probably gonna make a save state to help people take her on. I think it’ll be a very fun fight once I learn how to deal with her Waterfowl.\n\nBUT DUDE! IT TOOK ME FOREVER! IT WAS BADASS!",
        "created_utc": 1676513700,
        "upvote_ratio": 1.0
    },
    {
        "title": "do you like tv girl?",
        "author": "FinanceNo2773",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113f968/do_you_like_tv_girl/",
        "text": "[removed]",
        "created_utc": 1676513337,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got scammed today",
        "author": "fancyabiscuit",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113f31u/i_got_scammed_today/",
        "text": "[removed]",
        "created_utc": 1676512836,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best compliment you’ve ever gotten?",
        "author": "Realistic-Lemon8027",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113esz1/what_is_the_best_compliment_youve_ever_gotten/",
        "text": "[removed]",
        "created_utc": 1676511988,
        "upvote_ratio": 1.0
    },
    {
        "title": "yea",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1676511963,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else feel like they’re behind cause they can’t play an instrument or aren’t exceptionally good at something?",
        "author": "cloudymeatballdude",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113eqf8/anyone_else_feel_like_theyre_behind_cause_they/",
        "text": "I can draw and used to play some piano (some lullabies, nothing even remotely difficult and i quit the classes cause i felt inferior to the kids who started earlier and could play classical).\nI have many hobbies and yet i’m not good enough at any of them to be noticed or acknowledged. I always freak out about being forgotten one day. That after i pass away they wont remember me as a wonderful artist or a talented musician or anything of the sort. I’ll just be another nobody guy workin 9-5 who died. My diary would be considered so uninteresting it’d probably get thrown away.\n\nJust the thought of that makes me panic, i wish my parents had been more involved in my hobbies and made me take classes, if only my mother let me go on with my karate lessons or if they just taught me something sooner so that i’d be practicing it for a while now and would be pretty experienced at it.\nI feel as though i’ve wasted my life being average and not knowing how to do anything and it hurts to know i won’t amount to much. \nI look at people like Sixto Rodriguez, Kurt Cobain, Malala, anyone really. People i follow on social media showing their amazing and breathtaking art, or their music or comics and i think to myself why can’t i be skilled enough to do that? Despite drawing for years i’m only decent enough to sketch some fun characters and my anatomy is nowhere near good enough to make a comic. I wrote many short stories and deleted them cause they seemed subpar.\n\nI will get told i’m too young to be pessimistic but i’m 19 and i see PRETEENS that skateboard better than me and i cannot even practice out of embarrassment as i don’t wanna be publicly humiliated. I practice tricks at home sometimes but stopped trying when i saw skaters on youtube pulling off god level stunts.\n\nComparing yourself to others is counterproductive i know but i feel useless. Everyone is so ahead and worlds of talent ahead of me that even if i got better at skating or drawing or even picked up the piano again i would be below average and would not make a mark.\n\nCan someone help me out… how do i stop feeling like a pathetic loser amongst child protégés..",
        "created_utc": 1676511781,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think that mental health or substance abuse issues are genetic/hereditary?",
        "author": "Blueswiss02",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113e81k/do_you_think_that_mental_health_or_substance/",
        "text": "Could you be predisposed to have those issues if they run in your family even if you weren't directly exposed to those things in your childhood?",
        "created_utc": 1676510260,
        "upvote_ratio": 1.0
    },
    {
        "title": "do you 100% believe doctor's advice or opinions?",
        "author": "bookivorous",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113dpkm/do_you_100_believe_doctors_advice_or_opinions/",
        "text": "I feel like we should and we have to coz that's as reliable as the source of information gets but also there is infinite knowledge and it is only logical a human will err.\nEsp coz doctors amongst themselves always have such contrasting opinions it's very confusing whom to believe.",
        "created_utc": 1676508792,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to be more productive?",
        "author": "llennaP_5",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113dmfs/how_to_be_more_productive/",
        "text": "Lately, I haven’t been as productive as I would like. I haven’t been drawing as much as I should, exercising enough, always staying up past 11pm, and not going outside because I live in an apartment and there is no privacy in the city so every time I go outside I feel like somebody is watching me. The only thing I’m doing that’s good is holding in my seed, reading, virtual journaling, and meditating every now and again. And, my eating habits are decent, plus I drink a lot of water. Can somebody give me advice on how to get out of this slump of laziness because I feel like I’m vitamin d deficient because I’m never going outside because of I’m always in the house and lack of privacy and nothing to do and all the time it’s cloudy. Idk if I’m unmotivated or what but can somebody help me get out of this slump? Or give me advice if you have ever experienced what I’m going through. I’m not even interested in playing video games that much anymore.",
        "created_utc": 1676508547,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tell me something you're proud of that you've done recently, big or small I want to be proud with you!",
        "author": "viz2y",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113devo/tell_me_something_youre_proud_of_that_youve_done/",
        "text": "For me, I was able to actually pass my math test today with an 84.5% and I literally cried when I saw my grade because I was so happy\n\nI really wasn't expecting to pass and thought I would end up failing but I DID PASS AND IM SO HAPPY I CAN'T EVEN BELIEVE IT\n\nand the best part is that my teacher really believed in me (even when I had 4 late assignments up until yesterday, she still let me turn them in) and she's helped me so much and im so incredibly grateful to have her as my teacher 😁\n\nbut now I wanna hear what things you guys have done that you're really happy or proud of that might not be super impressive for other people, but mean a lot to you!!",
        "created_utc": 1676507931,
        "upvote_ratio": 1.0
    },
    {
        "title": "Debating on how I’m going to tell my girlfriends family I’m proposing, advice?",
        "author": "Ok_Illustrator5129",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113d2iq/debating_on_how_im_going_to_tell_my_girlfriends/",
        "text": "Title may sound dumb but is asking for blessing still a thing? I (25M) have been with my girlfriend (25F) for 5 years and I am ready to propose on our anniversary later this year. \n\nHowever, my girlfriend is not really close to her dad as they had ton of issues growing up (still kind of to this day) but very close to her mom. I should also mention that her parents are recently legally separated (divorced papers are going through). I’m not here to see how should I ask but do I just give them like a heads up “Hey, I love your daughter very much and plan on proposing on our anniversary”? I never really thought about it and I know time will fly by. Her dad is very old school Hispanic tradition but her mom isn’t. \n\nAny advice is appreciated!",
        "created_utc": 1676506969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asking for a friend 😅",
        "author": "Wilma_Dickfit-",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113cthj/asking_for_a_friend/",
        "text": "How many men wouldn’t actually mind dating a stud (masculine woman) but turning back more feminine slowest but surely… or y’all just like barbie girls 🥴",
        "created_utc": 1676506276,
        "upvote_ratio": 1.0
    },
    {
        "title": "do the cars people drive matter",
        "author": "GuidanceNew3310",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113ct06/do_the_cars_people_drive_matter/",
        "text": "[removed]",
        "created_utc": 1676506237,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your afternoon looking like?",
        "author": "ASpectralHandprint",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113clu4/whats_your_afternoon_looking_like/",
        "text": "[removed]",
        "created_utc": 1676505709,
        "upvote_ratio": 1.0
    },
    {
        "title": "People are frustrating…",
        "author": "ASpectralHandprint",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113cc3y/people_are_frustrating/",
        "text": "Do you ever come across a post by someone claiming they’re looking for deep and meaningful conversation but when you go to connect, they end up seemingly vapid?\n\nI wish people would really be certain with what they want.",
        "created_utc": 1676505000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else finding traveling tedious?",
        "author": "ageoflost",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113c3v1/anyone_else_finding_traveling_tedious/",
        "text": "My job sent me somewhere very remote to live and work, which don’t really bother me. What does bother me however, is how they think it’s a treat to have me traveling back all the time for random meetings and courses. Flying 2,5 hour trips all the time and having to live in hotels makes me tired to the bone. Frankly I just want to stay where I am and travel the least amount possible.",
        "created_utc": 1676504399,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird memory I can’t explain",
        "author": "Murky-Bank-9259",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113c25j/weird_memory_i_cant_explain/",
        "text": "I doubt this is the right place to ask, but I don’t know where else to and this has been on my mind for awhile. I (18) have this strange memory from when I was really young. I know it’s not a dream, it felt so real and I can easily differentiate between dreams and the “real world”. But I remember being really young and I was in my room. I was sitting in my mothers lap and she was sitting on my old window seat. \n\nThen I remember feeling this awful feeling, and then a very tall man in a disgusting and old looking blue monster costume walked in. I know it wasn’t a real monster, I remember knowing it was a man in a costume. He just kinda stood there and looked at me, and my mom didn’t seem to be aware of it. It’s always made me a bit uneasy but latley its been making me super uncomfortable and it gives me a bad feeling. \n\nI’m worried there’s some sort of underlying meaning behind this, I’ve always had this memory and it’s always made me feel weird. Any thoughts?",
        "created_utc": 1676504272,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are good subreddits to start Convo in?",
        "author": "GuidanceNew3310",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113bwqp/what_are_good_subreddits_to_start_convo_in/",
        "text": "[removed]",
        "created_utc": 1676503866,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mainstream type of business or hustle",
        "author": "Sensitive_Pay1829",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113bmbs/mainstream_type_of_business_or_hustle/",
        "text": "Not sure if this is the right sub for this question, but anyway.\nWhat do yall think will be trendy/profitable/popular job position or business/online hustle?\nIn 2016 we had dropshipping, in 2017 we had defi/crypto, in 2019/2020 we had SMMA, in 2021 we had nfts.\nWhat will be a main narrative in the next few years, to start now to get advantage when it happens?\nIs it going to be AI like everyone is saying or maybe something else?",
        "created_utc": 1676503104,
        "upvote_ratio": 1.0
    },
    {
        "title": "Watch Lockwood and Co on Netflix. It's a hidden gem and it's in danger of getting canceled",
        "author": "PammieLammie",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113bm24/watch_lockwood_and_co_on_netflix_its_a_hidden_gem/",
        "text": "It's sooo good. It's as if Harry Potter/Sherlock/Doctor Who had a baby with supernatural elements. It is well-written with great dynamics and chemistry between the characters and very cool world building. It has a little for everyone, some spookiness, comedy, romance, friendship, Sci fi, adventure and it has a killer soundtrack. It has only 8 episodes. It's so worth it. \nI'd you're planning to watch it, I suggest you watch it as soon as possible. And watch it all the way through because Netflix looks at completion rates and literally every view counts.\nI love it and Joe Cornish and Jonathan Stroud are wonderful writers. The Brits really know how to give us what we want. Let's save this show!",
        "created_utc": 1676503084,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which marital argument scene is better? Revolutionary Road or Marriage Story?",
        "author": "Letsbeheroines",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113bj68/which_marital_argument_scene_is_better/",
        "text": "[removed]",
        "created_utc": 1676502877,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was wanting an appreciation earlier this week for my work in an extracurricular I am involved with, and I received it today!",
        "author": "adepressedgoddess",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113athg/i_was_wanting_an_appreciation_earlier_this_week/",
        "text": "I’m so happy! I was recognized by the facilitators, like I had hoped to be, for taking the lead on the group project. Last week I went home unhappy when I didn’t receive one, but even though I so often feel unappreciated, I felt great today!",
        "created_utc": 1676501006,
        "upvote_ratio": 1.0
    },
    {
        "title": "anyone tried out the New Microsoft bing yet?",
        "author": "StandardFee5124",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113apvb/anyone_tried_out_the_new_microsoft_bing_yet/",
        "text": "Hello there has anyone been able to Try out the New bing yet I personally think it's incredible and I would like to get your thoughts on it I honestly never seen an AI like it it's absolutely mind blowing please don't hesitate to DM me I would love to hear from you and I would love to hear you're thoughts and opinions on it.",
        "created_utc": 1676500754,
        "upvote_ratio": 1.0
    },
    {
        "title": "Watching footages of how our body cells (white blood cells for instance) work so hard to protect us makes me emotional every time",
        "author": "Just1person_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113akjp/watching_footages_of_how_our_body_cells_white/",
        "text": "\nI was just watching a footage of how our white blood cells go around fighting any foreign body like little soldiers and I started tearing up. Like we have them all around our bodies, billions and billions of them, working hard 24/7 is just lovely to me  \n\nAppreciate your body, and if you have any autoimmune disease, then don't, plus I'm sorry",
        "created_utc": 1676500367,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling stuck in my home town but I know that I'll eventually move out",
        "author": "Just1person_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1139y7l/feeling_stuck_in_my_home_town_but_i_know_that_ill/",
        "text": "I just turned 20 last month and each year I realize more and more how I don't fit where I live. I want to go out and explore, meet new people, have fun, but I can't do any of that here\n\nI know 20 is still young and I have the world ahead of me, but feeling stuck it's frustrating you know?\n\nBut I know I'm destined to travel the world at some point in my life, not sure when but it will happen",
        "created_utc": 1676498799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone find particular productivity advice unhelpful for you?",
        "author": "graphingcalculator_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1139wzs/anyone_find_particular_productivity_advice/",
        "text": "I'm a teacher now, but some of the productivity advice I heard as a student (break things up into smaller tasks to avoid procrastination, do the most difficult task first, create a routine, etc.) simply do not work for some people. For instance, I can’t do the pomodoro technique or work in highly structured environments. It does not motivate me, and it makes work become even more of a chore.\n\nI also cannot reward myself to stay motivated. Perhaps it’s because I grew up in an abusive environment and was in a DV relationship for a while. I am used to feeling deprived of basic needs, so if I fail and don’t reward myself, it doesn’t have much of an effect because I am able to survive in that state of mind. If I do reward myself, I enjoy it, but I know the feeling of being in survival mode again, and I expect it. My mental state has actually improved a lot after being in therapy, and I don’t know how various techniques will be for me in the future, but I think my experiences now are worth mentioning.\n\nI have waves of productivity, and my work is much better when I am considering the tasks that I complete based on my mental state. It causes me less stress, which results in me being in a better mood and getting more done. When I’m forcing myself into a routine, I get more stressed, and that can cause me to burn out.\n\nI have tasks that are prioritized, and I also consider the difficulty of doing the task. If I’m in a bad state of mind, forcing myself to do a difficult task will be a grueling and unproductive process. If I do some of the easier tasks, I’ll at least get those out of the way. And then the next day, I’ll feel refreshed and ready to tackle the difficult task. If I’m in a bad enough mental state that I’m still not getting things done, maybe that’s a sign I need to take the day off work. I keep that open as an option. I’ve done it occasionally, but most of the time, it ends up being unnecessary. But having that as an option relieves the stress, which helps tremendously.\n\nIf it’s at the point where I’m feeling like I need to keep taking time off work, that would mean I’d probably need to look into a career change. So I don’t stress myself out over it. I’ll recognize that I’m struggling at the moment, and I have to do what I have to do, even if it means I end up quitting my job or something. Giving myself a little bit of space helps a lot, then I’m usually able to power through and get things done without work actually being affected.\n\nI also do not commit to one type of productivity tactic because my life is constantly fluctuating. If the productivity tactic you are trying to implement becomes stressful or anxiety-inducing, maybe you need to switch it up (even if you’ve been doing this successfully before).\n\nI’m not saying this is a perfect system (deadlines do exist), but maybe it would be helpful for some people…I’ve talked about it with students, and many of them found it very useful to hear this perspective. I tell them that it helped me to think about everything that would happen if I didn’t do well on an assignment. What options are there? List them all out. Even dropping out of college is an option, honestly. Failing at something is not the end of the world, even though it seems like it sometimes. Life is just a series of choices…I’ve learned to recognize that I just may not be as productive as some people no matter what I do, and there’s no point in putting pressure on myself to perform at the same level. It’s not a weakness, it’s just that my brain does not want to function at that capacity, and that’s okay, honestly.\n\nI’m curious what works for other people, when it comes to productivity?",
        "created_utc": 1676498714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on life",
        "author": "Reasonable-Aide5565",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1139f08/thoughts_on_life/",
        "text": "[removed]",
        "created_utc": 1676497440,
        "upvote_ratio": 1.0
    },
    {
        "title": "What kind of girly/aesthetic lists do you like to read?",
        "author": "hls52",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1139czp/what_kind_of_girlyaesthetic_lists_do_you_like_to/",
        "text": "I made a TikTok account a few days ago and have been posting slideshow style videos related to anything girly or aesthetically pleasing like romance, fashion, food, life goals, etc. \n\nI'd really like some inspiration for lists or groups of photos I can make videos for 😊 If anyone has any suggestions I'd love to hear!\n\nMy TikTok is: www.tiktok.com/@michellelhoney btw if you'd like to check it out 😌",
        "created_utc": 1676497293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on this?",
        "author": "NexicTurbo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1139aka/thoughts_on_this/",
        "text": "The intricate and convoluted undulations of droplets of liquid precipitation descending upon the uppermost structure of a habitat, the neurophysiological response generated by the reception and interpretation of aromatic molecules emanating from the baked dough of cereal grains infused with the byproduct of fermentative organisms, and the sensory stimulation engendered by the act of enveloping another's physical frame with one's own limbs serve to ameliorate the intangible essence of an individual.",
        "created_utc": 1676497127,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reconnected with someone I had an intense friendship with and realising that without the old intensity, we don’t click much at all",
        "author": "Klorainne",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1138gxf/reconnected_with_someone_i_had_an_intense/",
        "text": "I just wanted to talk about it and have that sort my thoughts a little. I had a codependent friendship a little while ago now that ended badly. At the time this other person was my whole world, days where they ignored me had a serious effect on my mental health and self worth and the ending of our friendship is what motivated me to go to therapy. \n\nI’ve grown a lot since then so when this person reached out and wanted a chance at rebuilding our friendship I cautiously agreed. But since then I’ve kind of realised they’re not the kind of person I really like. At the time of our toxicity they were the only friend I had but now I have many that I can compare them to and the fact is that I just don’t enjoy talking to them as much as I do my other friends.\n\nAnd it’s just weird. At one point in time I thought they were my platonic soulmate and we’d be in each other’s lives forever. It all feels very anti climatic but in a way I feel like I have more closure. I can’t romanticise this person anymore so I’m noticing all the ways we never really fit together. \n\nIt’s sad to let that go though. I don’t know what my plan is exactly from here, I don’t really want to speak with them anymore but I don’t want to be too mean about it.",
        "created_utc": 1676494995,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal to dry toothbrush after using it?",
        "author": "Susanburr",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1138d29/is_it_normal_to_dry_toothbrush_after_using_it/",
        "text": "Usually once I finish brushing my teeth I’ll shake the brush rapidly or suck out the excess water from the brush. My friend told me it’s very disturbing and weird to do and how I should just leave the brush to air dry. Is this a common thing to do?",
        "created_utc": 1676494719,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else do this?",
        "author": "odes1",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11389rd/anyone_else_do_this/",
        "text": "[removed]",
        "created_utc": 1676494468,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Dream from last night in full detail.",
        "author": "Ubsirdity",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11377aa/my_dream_from_last_night_in_full_detail/",
        "text": "[removed]",
        "created_utc": 1676491661,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got invited to an airbnb party in LA",
        "author": "conchis10",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1136zfq/got_invited_to_an_airbnb_party_in_la/",
        "text": "This girl in my group invited me to this huge house they rented, its got about 7 rooms and a jacuzzi and it’s in LA. I could only probably spend the night once because of work but it sounds fun. About 16 people are going. The problem is that I don’t know her well enough to go and I don’t know the people who will be there, but she sounds excited and insists it’ll be fun.",
        "created_utc": 1676491133,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it just me or when a restaurant worker says “enjoy your meal”, I enjoy it more?",
        "author": "ravenclaw188",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1136pqp/is_it_just_me_or_when_a_restaurant_worker_says/",
        "text": "[removed]",
        "created_utc": 1676490412,
        "upvote_ratio": 1.0
    },
    {
        "title": "The more I have been able to involve myself was playing classical music the more I actually appreciate playing pop music.",
        "author": "21P53E7S9lkIJ6sKc53O",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1136cr1/the_more_i_have_been_able_to_involve_myself_was/",
        "text": "There's a lot I like about the pop music community of musicians that as a classical musician and sometimes jazz musician I really don't get from playing other genres.\n\nIn classical music and jazz music you are oftentimes laying other people's music as people often call it, covers. In a lot of genres, covering music is looked down upon.\n\nI feel like this really misses out on the iterative process of music. And this is where I've come to really appreciate playing pop music as a classical musician. I don't always get to do vocal ensemble work as a classical musician so I have to venture out. If I want to work with other musicians and say rock for example, as a vocalist I'm expected tomorrow right by own songs. I'm not a lyricist. I really just want to practice the art of singing.\n\nEnter pop music. I would really like to think Bach Mass in b minor. Am I good enough to join a symphony inquire that is going to perform this piece? No. Pop music gives me the infrastructure to practice my basic musicianship and ensemble skills singing some Taylor Swift arrangement, well sign me up.\n\nHats off to you pop musicians.",
        "created_utc": 1676489458,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally getting back in shape",
        "author": "chefsenju",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1135kjv/finally_getting_back_in_shape/",
        "text": "I’m finally going to the gym consistently again after two years of being pretty inactive at the gym and it feels great and I just want to talk about the gym and working out with anyone",
        "created_utc": 1676487405,
        "upvote_ratio": 1.0
    },
    {
        "title": "General idea of how old one's account must be to post to various subs?",
        "author": "digitalUID",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1135egm/general_idea_of_how_old_ones_account_must_be_to/",
        "text": "[removed]",
        "created_utc": 1676486969,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your mental happy place today?",
        "author": "Recent_Worldliness72",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113592j/what_is_your_mental_happy_place_today/",
        "text": "Mine is on vacation with my parents, ten years ago, in Florida. They seemed happy and safe, and it was like being in a bubble with them. No stress and no time. Far away from home.  I am sitting by the pool reading a book and enjoying seeing them relax nearby. Later we will walk by the ocean. \nThis is an odd thing because I am not close with my parents, but for some reason it brings me great peace to think of this. I am so grateful for this memory.",
        "created_utc": 1676486585,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I stop myself from over eating?",
        "author": "Revolutionarypanda13",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113530l/how_do_i_stop_myself_from_over_eating/",
        "text": "Okay so I have been working out regularly for the past 11 months and also eating somewhat right. But I also have the habit of over-eating, stress eating. I try to avoid all sorts of junk. Sometimes I am successful, and sometimes I slip and end up eating the entire pizza, chips and what not. I am constantly worried about not loosing inches because of my frequent cheat days \n\nI would really appreciate tips to prevent myself from slipping from healthy eating frequently and staying on track .",
        "created_utc": 1676486162,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else get sad/angry when you see an attractive person out and about, but will never see them again?",
        "author": "observethebadgerking",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1134yc7/anyone_else_get_sadangry_when_you_see_an/",
        "text": "You know, you're choosing bananas at the supermarket or walking down the street, and you see someone you're incredibly attracted to. There's no reason for you to speak to them and you're in a setting where approaching someone with the interest of asking them out would be highly inappropriate. They're just there, and then they're gone. Highly unlikely that you'll ever see that person again. I guess I get too attached in that moment thinking of what could be, which I know is unhealthy as they are a complete stranger to me. I feel sadness and resentment that someone so attractive comes along when I least expect it and can do nothing about it, but when I actively look I don't get that sense of excitement. Anyone else get this way?",
        "created_utc": 1676485838,
        "upvote_ratio": 1.0
    },
    {
        "title": "I 16f was hanging out with my 17m bf. he made me laugh so hard that I accidentally farted. I'm so embarrassed.",
        "author": "dazzlingpotatoeshehe",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1134q5a/i_16f_was_hanging_out_with_my_17m_bf_he_made_me/",
        "text": "Sounds silly but I'm so embarrassed. He said it's fine and isn't grossed out. He was laughing about it too. I'm just afraid he'll see me differently.",
        "created_utc": 1676485270,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm in my forties and don't know how to use a napkin.",
        "author": "oddministrator",
        "url": "https://www.reddit.com/r/CasualConversation/comments/113419b/im_in_my_forties_and_dont_know_how_to_use_a_napkin/",
        "text": "Yes, I use napkins and, no, I don't leave the table with food smeared on me like blood from a Dexter murder scene. But I'm certain I don't know what I'm doing.  \n\nI use the napkin to wipe my face or hands when I feel something on them, but the second time I aim for a different section of the napkin. I'll try to keep it neat but, invariably, by the time I've eaten a third of my meal my napkin is a wadded ball fit to be thrown across the room after yelling \"Kobe!\"   \n\nBut right next to me will be all the other people eating with perfectly folded, but clearly used, napkins. \n\nAm I a savage, an idiot, or both? I have no idea how you all are managing this. If I keep my napkin folded well, even with refolding, I quickly run out of real estate on which to wipe. And, no, I'm not a messy eater...   just an embarrassingly poor napkin user.",
        "created_utc": 1676483529,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm convinced that every major city in the US has bad drivers.",
        "author": "aaman44",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1133zbl/im_convinced_that_every_major_city_in_the_us_has/",
        "text": "I've driven to a good amount of cities on the east coast and over in LA. Currently I reside in Atlanta and I was thinking the other day on my communte home, \"Man, driving sucks in all these cities\". I'm no perfect driver by any means, I've only been in one fender bender when I was a kid learning how to drive and accidently stratched my car when trying to get out of a tight space. Everyday on my communtes, I see people speeding, driving eratically, dangerously cutting people off, breaking traffic laws and I'm just like \"This is nuts\". People is Tesla's acting like the highway is a race, beat up malibus with the front bumper missing, pickup trucks with front lights as bright as the sun. Man, driving is already dangerous, but bad drivers make it all the more worse.",
        "created_utc": 1676483391,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got a job interview tomorrow that's 35 miles away from where I live",
        "author": "Ill_Case7441",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1133wdn/i_got_a_job_interview_tomorrow_thats_35_miles/",
        "text": "[removed]",
        "created_utc": 1676483171,
        "upvote_ratio": 1.0
    },
    {
        "title": "Social media seems to have invaded life and it seems impossible to completely ignore it.",
        "author": "dabyss9908",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1133rdn/social_media_seems_to_have_invaded_life_and_it/",
        "text": "A year ago, I decided to stop using Instagram, Snap and all socials that involved posting public life. I check Linkedin every now and then for professional purposes and reddit for some entertainment or discussion every now and then.\n\nOf late, I felt that peer pressure is a major part. I wanted to go completely off grid (excluding Whatsapp, Telegram etc). But at my workplace or when soeaking to friends, everyone uploads their lives on Insta. Went to a cafe? Had an impromptu meetup? Did an interesting thing? Everything was uploaded already. As a result, I tend to miss out on happenings. Like people come the next day and be like \"Did you see X went on a trek?\". At my workplace, I kinda feel irritated as I want to be completely professional. I'll friend a few people on insta (but before I leave the job Ig). \n\nI rarely check insta, and the only reason why I use it is because I might need it if I go on dates or need to exchange contact info.\n\nI get that sharing numbers with random people isnt safe  enough.  But, why do I need to have an active social media presence to prove that \"I have a life\"? I dont want my life to be on public. You want to know? Thats what dates or meetups are for. \n\nI meetup with friends, go to some places. Most of my days are meh. Kinda feel that insta has made conversations redundant. If I already reacted to your post with a fire emoji, why would I bother talking again? This became a ramble, but I'd like to know why you use social media. \n\nPS: Kinda inspired from the Social Dilemma documentary. (I have personally seen a prof discuss a social engineering research paper that mobilized opinions using weighted networks, and a complex set of matrix optimizations, so the movie hit home wven harder).",
        "created_utc": 1676482810,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is OnlyFans really worth it financially and mentally?",
        "author": "tasteelace",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1133oh3/is_onlyfans_really_worth_it_financially_and/",
        "text": "[removed]",
        "created_utc": 1676482603,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who wants to play, a little music quiz, and get a song recommendation?",
        "author": "harmonybrook",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1133k5h/who_wants_to_play_a_little_music_quiz_and_get_a/",
        "text": "Just answer a few questions, and I’ll try to pick a song you might like based off your answers :)\n\nPick a color scheme:\nA) neons and black \nB) earth tones \nC) primary colors \nD) pastels\n\nPick a morning beverage:\nA) coffee\nB) orange juice\nC) cereal milk\nD) lemon water\n\nPick a location:\nA) Forest\nB) beach\nC) city\nD) mountains\n\nPick the weather:\nA) rainy\nB) sunny\nC) snow\nD) balmy",
        "created_utc": 1676482346,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you have a core memory attached to a certain scent?",
        "author": "Valiant_Starr",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1133iv5/do_you_have_a_core_memory_attached_to_a_certain/",
        "text": "I know other people get this too, but I was just remembering it. This wasn’t today but one time I went to a diner and before eating I went to wash my hands. And let me tell you, the soap smelled like the soap I used when I was in elementary school. It brought me back heavily to those moments when I was little. \n\nIt’s strange that I found a core memory while in the bathroom lmao, but it was very a wholesome moment for me",
        "created_utc": 1676482279,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a virtual interview later this week and it's my first time using Zoom! Any tips/advice?",
        "author": "highland_dreamer",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1133efd/i_have_a_virtual_interview_later_this_week_and/",
        "text": "I've got an interview later this week for a position in the field I went to school for! I'm happy to have gotten this far in the process but nervous because I have never used Zoom and I'm worried something could go wrong like the link not working properly or I don't know I'm on mute or any number of things lol\n\nI guess I'm just looking for reassurance/tips from others that have done interviews over Zoom or just used Zoom in general, so anything would be greatly appreciated!!",
        "created_utc": 1676482052,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why so many scientist claim that god creating everything makes no sense in science when both sides religion and science claim that SOMETHING was created from NOTHING",
        "author": "GrapefruitBulky4306",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1133b1f/why_so_many_scientist_claim_that_god_creating/",
        "text": "[removed]",
        "created_utc": 1676481882,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is my first ever Reddit Post guys!!!",
        "author": "JackDawson786",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1132qfo/this_is_my_first_ever_reddit_post_guys/",
        "text": "btw guys its the first time that i created a post on reddit !!! just wanna see how this stuff works and all . I am a newbie lol if anyone got any tips on how to use Reddit  please feel free to comment and anyways have a good day everyone!!!",
        "created_utc": 1676480546,
        "upvote_ratio": 1.0
    },
    {
        "title": "self love",
        "author": "PossessionJazzlike66",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1132hnj/self_love/",
        "text": "i need to know what is considered self love. in my case i remind myself on a daily basis that i love myself and that i'm awesome, handsome, etc and all that shit. i want to know if this is self love or not. it DOES help me with my confidence and always keeps my head up in the skies and makes me believe i am indeed awesome.",
        "created_utc": 1676479913,
        "upvote_ratio": 0.99
    },
    {
        "title": "Where to travel alone",
        "author": "NotBorris",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1132422/where_to_travel_alone/",
        "text": "\"Be not solitary, be not idle.\"  I have no control over the first part of that statement, I'm not meant for something like that, but with the latter at least I have control over that.  Though I have no idea where I good place for someone to travel alone would be and that's what I'm asking.  There were images of a hiking trail made out of thin wood beams literally on the walls of a high cliff overlooking a beautiful ridge but I don't know where that is.  I would also like to visit a forest in Romania that has a lot of spooky shit going on, I don't really believe that kind of stuff but I would be more than happy if something weird would take me away.   \n\nIf anyone knows of a place in the world that would be fine for one person to travel to then I'd love to know.",
        "created_utc": 1676478908,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm new to this group and I'm looking for people to hang out with and do activities with. Is anyone interested in getting together and doing something fun?",
        "author": "Chris_hampton",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1131yii/im_new_to_this_group_and_im_looking_for_people_to/",
        "text": "[removed]",
        "created_utc": 1676478530,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you know if a lot of prize giveaways are fake?",
        "author": "Ben5544477",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1131g8u/do_you_know_if_a_lot_of_prize_giveaways_are_fake/",
        "text": "I remember as a kid there was a yogurt company that said they were giving away a bunch of prizes. They said just purchase and look on the bottom of the lid to see if you've won. So, I asked my parents to buy me the yogurt all the time. I probably opened about 1,000 of them and never won anything. Do you think that yogurt company was most likely lieing? Or do you think it's truthfully that they just made the prizes very rare?",
        "created_utc": 1676477168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally seem to have found an answer for my dandruff, trying not to cry happy tears",
        "author": "dirtyALEK",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11317fb/finally_seem_to_have_found_an_answer_for_my/",
        "text": "I’ve struggled with dandruff for more than a decade and it’s been an intense source of insecurity. Not to be gross, but I could shake out my hair and my arms would get tired long before the flaking stopped. Recently it seemed to take a turn for the worse and I vaguely assumed that my issue was a dehydrated scalp because it felt itchy and irritated. \n\n\nIn addition to just using head and shoulders I’ve tried using stronger versions of these shampoos, shampooing more often, less often, washing my hair every day, less than every day, just using conditioner, silicon scrubs to help work in shampoo, cleaning my pillow case more often, and even a scalp pick to try and get rid of the build-up manually. All of these methods yielded little to no result, and I eventually had to try to stop thinking about it because I’d get so frustrated it would derail my day. I generally try to be a very hygienic person, and this felt like I was somehow doing something wrong but I couldn’t figure out what it was and it was driving me mad. \n\n(TW: slight grossness) \n\nI then stumbled on a r/YSK post that talked about how dandruff, in some cases, isn’t caused by dehydration, but by a kind of fungus that lives on the scalp. It isn’t obviously visible, so I hadn’t had reason to suspect something like that. \n\nNot only does the fungus like water, dehydrating your scalp indirectly, but in response the rate at which your scalp sheds its skin goes into overdrive to try and get rid of it. There’s a specific kind of medicated shampoo with an ingredient that directly addresses this issue. (This isn’t an ad or something so I won’t mention it here, but if you have the same problem and suspect it might be same issue you can DM me if you’d like). \n\nI started feeling hopeful because this was a possible cause of the issue I hadn’t been aware of before and that I could try to address. I ordered the shampoo, used it for the first time yesterday, left it the lather for several minutes and repeated, and I could almost cry. \n\nI’m almost certain that this fungal thing was the issue because this shampoo basically nuked my dandruff, almost over night. I know it’s a little early to be celebrating as if the problem is over, but this is far and away the most dramatic effect of any of my attempts, and I’m optimistic that I’ve finally identified the issue and have an accessible solution.",
        "created_utc": 1676476540,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does it mean I'm particularly ugly if it takes messaging up to 30 people to get responses out of 5-6 of them and getting to have sex with only 15% of those responders on hookup apps?",
        "author": "SinancoTheBest",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11315uu/does_it_mean_im_particularly_ugly_if_it_takes/",
        "text": "[removed]",
        "created_utc": 1676476425,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey reddit, what's going on?",
        "author": "CrazyHorseFan",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1130x2d/hey_reddit_whats_going_on/",
        "text": "[removed]",
        "created_utc": 1676475757,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever pushed someone away because your friends did not approve?",
        "author": "Lonelytogethe",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1130jnp/have_you_ever_pushed_someone_away_because_your/",
        "text": "When I was in middle-high school there was this one girl who I always hanged out with. We where in many courses together  and we also somehow had the same after school program. \n\nI did not have many friends growing up and although I don’t know if she would consider me her friend… well she was the only friend I had. We would always be group partners… eat lunch together (everyday I worried she would one day miss school or somtehing and I would have to be alone…lol). I will never forget it: we where the only 2 person group for what was meant to be a 4 person project(s) in one of my courses for the entire semester. \n\n\nI kinda was a good student so a alot of people would be my “friend” so we could work on stuff together or so I could help them. I was happy to help them as for some reason it did not trigger my social anxiety as I was speaking about a topic I was comfortable with.\n\nThroughout my life people would talk shit about her right in front of me. One day another girl I liked even told me to straight stay away from her. The shit talking was constant and endless. I felt a lot of people where jealous of her or something because uase she was so nice and happy all the time. \n\nAt the time, I never had the courage to step up for her as I too did not have anyone on my side. \n\nNext thing I knew I never saw her again. She was a nice girl, I hope she is doing well.\n\nEveryday…she would see me she would hug me. It made me uncomfortable as hell but I loved it. Never in my life have I met another person like her.\n\nPeer pressure is real",
        "created_utc": 1676474747,
        "upvote_ratio": 1.0
    },
    {
        "title": "Many people in my job field look the same.",
        "author": "CrayonDelicacies",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1130jnd/many_people_in_my_job_field_look_the_same/",
        "text": "No point to this, just sharing. A good portion of rural water and wastewater workers in Louisiana are middle aged or late middle aged, with beards, and a little wide around the middle. I’m getting some suspenders soon, because suspenders or overalls seem to be part of the uniform. We seem to make up about a third of our field in this state. The rest are atypical, but most are still about the same age. Something like 75% of us are due for retirement within the next 5 years. We have some tall and skinny, some young people, we’re getting a lot more women in this field, but there’s such a huge number of us that are pudgy old bearded men who probably actually won’t retire. The man that runs the water system I actually live at fits the mold, but he’s 87 years old. \n\nThis is one of those jobs you end up doing for life. There’s a great deal of satisfaction somehow. I intend to stay at it myself. That may be why there’s so many that look the same. We all stick around long enough. Just like how some people’s pets start to look like their owners maybe. I don’t run into many former waterworks people, unless they’re retired, which seems to be rare, or those that worked for companies that treated them poorly. That’s also somewhat rare because they usually just find another company in the same field. \n\nI recommend it to anyone looking for a stable career. I’ve never met anyone who hated the job. \n\nJust sharing.",
        "created_utc": 1676474746,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reddit can be just as addicting as Tiktok",
        "author": "MarleyTheDogg",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11306pr/reddit_can_be_just_as_addicting_as_tiktok/",
        "text": "[removed]",
        "created_utc": 1676473790,
        "upvote_ratio": 1.0
    },
    {
        "title": "According to a recent study, car accidents ranked ninth out of the top ten causes of death world wide. It also ranked first among the top ten accident-caused deaths. Over 40,000 Americans die in car crashes every year.",
        "author": "MudPsychological4960",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11303np/according_to_a_recent_study_car_accidents_ranked/",
        "text": "[removed]",
        "created_utc": 1676473553,
        "upvote_ratio": 1.0
    },
    {
        "title": "According to a recent study, car accidents ranked ninth out of the top ten causes of death world wide. It also ranked first among the top ten accident-caused deaths. Over 40,000 Americans die in car crashes every year.",
        "author": "MudPsychological4960",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11303mb/according_to_a_recent_study_car_accidents_ranked/",
        "text": "[removed]",
        "created_utc": 1676473550,
        "upvote_ratio": 1.0
    },
    {
        "title": "I get why people feel like they need coffee",
        "author": "Skrubgub",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112zs8w/i_get_why_people_feel_like_they_need_coffee/",
        "text": "I just downed a medium cup of coffee from TimHortons and I feel like taking over the world. I used to get really shaky and even anxious to the point where I'd just do that nervous giggle randomly. \n\nNow I feel like I dusted off a flashlight and am focusing its light and burning a hole into solid steel! \n\nSuch a wild feeling. I do know that getting addicted to caffeine is a real thing so I keep it as a treat and limit to 2 every couple days so I don't build such a resistance to it.\n\nBUT I wish this was how we felt as a baseline. Just waking up ready to conquer and work. I wonder where we'd end up as a species?",
        "created_utc": 1676472707,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else think AI is a little overrated right now?",
        "author": "mikebalsaricci",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112zptx/does_anyone_else_think_ai_is_a_little_overrated/",
        "text": "I don't think it's that AI is that amazing at the moment, it's more that people are more predictable than we like to believe. For example I can ask a question here on Reddit and guess the answers with some pretty good accuracy. When you go into any comments section you see the same jokes a hundred times. Each time someone hit enter they thought they were the first person to say that. Even if you don't post it you probably thought the same thing (upvote). So if AI is just reading what people say and then responding with a randomized most popular answer or something like that, then that's all it could be. It may be more involved than that, but at the moment that's all it may as well be. It's just that we are so biased to think we're smart that when a program says what we were going to we think \"Wow, it must be brilliant.\"",
        "created_utc": 1676472534,
        "upvote_ratio": 1.0
    },
    {
        "title": "Insanity is one of those things that most psychological texts attempt to categorize, illustrate, and analyze, but never outright define. Indeed, from some standpoints, insanity and sanity are too relative to the individual and his circumstances to be given any single, all-encompassing definition. Th",
        "author": "MudPsychological4960",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112zftm/insanity_is_one_of_those_things_that_most/",
        "text": "[removed]",
        "created_utc": 1676471772,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you have a song with a memory/story attached to it?",
        "author": "PrettyLittle-Someday",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112zfm1/do_you_have_a_song_with_a_memorystory_attached_to/",
        "text": "I want to know if any of you have some stories attached to songs, and to just share one of mine!\n\nI have a couple songs with personal attachments to them, but my favorite is the story my mom told me:\n\nIt was around the time the Yugoslav wars (specifically the Bosnian war which she was caught up in) were happening, and she was walking home from school on this desolate, semi-destroyed road between towns. Then, out of nowhere her best friend from school pulls up in a nice looking car. \n\nShe asked if she wanted a ride home and my mom obliged, so her friend excitedly told her to hop in and introduced her to the chill, cool-guy who was driving and happily said “This is my cousin who is visiting from America! He has this cool American car that he brought with him!”\n\nThey chatted the rest of the ride home while the song Shine by Aswad was playing, and my mom said that it was just a really wholesome moment in time for what they were going through, and the song gave her hope in a way (it’s a really nice song, I recommend you give it a listen).",
        "created_utc": 1676471756,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally Swearing In To The Navy Tomorrow!",
        "author": "Mammoth-News-9344",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112yl0q/finally_swearing_in_to_the_navy_tomorrow/",
        "text": "I recently went for my bloodwork last Thursday and the waiver ended getting cleared Monday afternoon! After months of waiting and waiting, I will finally get to enlist! Cheers to new beginnings for me 💙🥂",
        "created_utc": 1676469456,
        "upvote_ratio": 0.99
    },
    {
        "title": "Am I wrong for wanting to distance myself from my friend?",
        "author": "HereReadingMan",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112ycvi/am_i_wrong_for_wanting_to_distance_myself_from_my/",
        "text": " First off I am very much a to the point, sometimes, monotone guy. I do joke a lot and get along with almost everyone; but one of my friends are always trying to start something and tells the rest of the group how I'm the one who causes the arguments. I can ask them if they wanted to go watch a movie together, they would say something like, \"We shouldn't.\" So I can agree and say, \"Okay. That's fair.\" But they would get mad at me because I didn't fight for a \"Yes\".\n\n I started to notice that they always put in a snarky comment as I'm speaking that can cause something to arise. To prevent that, I still continue to talk or brush it off. Doing this makes them mad and go, \"Do you see how rude they are?\" I went through a recent break up and expressed to this friend how I'm really sad and miss my ex. The friend said they love the way I talk my ex because it's \"wholesome\" and \"very kind loving\". BUT! The next day we were talking to someone about exes and the friend goes, \"  Oh yeah they're (me) obsessed with their ex. Always talk about them and can't get over them.\" The switch up is insane.\n\n They are very kind in some aspects and supportive so it makes me feel bad to be annoyed. Am I wrong for wanting to distance myself from them?",
        "created_utc": 1676468789,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is wrong with my cat",
        "author": "DependentAmoeba_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112xxwn/what_is_wrong_with_my_cat/",
        "text": "I've noticed that my cat (3 years old female) acts rude towards me when I'm days before and during my period.\n\nI thought I was crazy but I decided to observe her and she has the same attitude every single month.\n\nShe also hates it a lot when I'm very next to my dad (he's her favorite person).\n\nShe starts making weird angry noises and she puffs up when she sees me. She tries to attack me and I have to lock myself in my room and avoid her.\n\nWhen my period ends and I'm in normal days, she doesn't act like that. But she still hates when I'm near my dad.",
        "created_utc": 1676467548,
        "upvote_ratio": 1.0
    },
    {
        "title": "My husband told me something that blew my mind. Bad things don't happen to me because I'm cured or a bad person they happen to me because we're poor and we don't have the money to prevent/fix our problems.",
        "author": "Q8DD33C7J8",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112xrzd/my_husband_told_me_something_that_blew_my_mind/",
        "text": "My husband was rich for the first half of his life. He was able to prevent or fix any problems that arose. Now he's disabled and poor because I'm the only one working. I was complaining about bad things always happening to me. I said I felt cursed. He said your not cursed your poor. It hit me like a bolt of lightning omg yeah when he was rich he got away with everything. Now that he's poor he has crpa happen to him far more frequently and he as a person hasn't changed so it's not because he's a bad person or cursed he's just not able to afford to fix things or prevent them like he used to. This may be obvious to you but it never occurred to me.",
        "created_utc": 1676467043,
        "upvote_ratio": 1.0
    },
    {
        "title": "What habit are you most proud of breaking?",
        "author": "whostolemypineapple_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112xgqa/what_habit_are_you_most_proud_of_breaking/",
        "text": "I always had the habit of sleeping at 2 or 3 in the morning and waking up at 10 all groggy with dark circles, missing the first classes and ending up lagging in studies and going to bed at 3 again trying to finish it , but end up doing the same thing again. \nI moved residencies and my new roomates were morning birds who'd brighten up the room at 6am and go to bed at 11pm. That kind of shaped my schedules too. Also , waking up before sunrise is a whole different feel. Just waking up early makes you feel like you've done something productive and I'm so glad I got out of the habit of unhealthy sleep schedules.",
        "created_utc": 1676466062,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tech College is amazing!",
        "author": "Directive-CLASSIFIED",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112xa9o/tech_college_is_amazing/",
        "text": "Last year, I failed my first semester in engineering. I left my hometown and decided to try to go to a technical school, as I felt the need to study something and establish myself financially. \n\nSo, after a small amount of searching, I found a school that offered a \"Control and Automation\" program, which includes an apprenticeship and gives a Journeyman Electrician license at the end.\n\nI decided to go for it, and it's absolutely amazing! The teachers and the dean are extremely caring and always willing to help, the tuition is so cheap it's nearly free and the coursework is relatively easy yet very interesting. The only downside is that I have to take a 1-hour drive on the bus to get there. But other than that, I'm in a very good place right, nearly finished a quarter of my studies, and I debating whether get into the electrical trades or transfer to an engineering school.",
        "created_utc": 1676465473,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free Nursing Assistants Course With American HealthCare Academy",
        "author": "Aksharmultiservices",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112wyky/free_nursing_assistants_course_with_american/",
        "text": "[removed]",
        "created_utc": 1676464361,
        "upvote_ratio": 1.0
    },
    {
        "title": "I love my work do you?",
        "author": "sophiam24",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112wqoj/i_love_my_work_do_you/",
        "text": "[removed]",
        "created_utc": 1676463609,
        "upvote_ratio": 1.0
    },
    {
        "title": "if I ever have kids I want to be like my friends mother",
        "author": "Maybelle1999",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112wplb/if_i_ever_have_kids_i_want_to_be_like_my_friends/",
        "text": "My mother isn't a bad person, she's very lovely and I appreciate her so much, but one thing I learnt from an early age is that I couldn't sing and dance, friend advice,  talk about crushes or ask about relationship advice with her without being laughed at and made fun of.\n\nI remember when I first went to my friend's house, I found out it was weekly that they eat fresh bread with butter from the bakery and just chat about that stuff, and what surprised me is that her mother did not laugh, not once. She took everything seriously, gave serious advice no matter how silly she may of found it considering we were teenagers. \n\nShe makes the best popcorn, has so much knowledge about everything, is so funny and kind and constantly encourages her daughters to be creative, smart, amazing people. She's always treated her daughter's as equals and seeing my friend and her mum's relationship is so lovely to me. \n\nIf I ever become a mother I want to be like her.",
        "created_utc": 1676463504,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is wearing red to a wedding still gauche?",
        "author": "Mundane-Product9034",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112wfm9/is_wearing_red_to_a_wedding_still_gauche/",
        "text": "I bought a dress online labeled as “hot pink” and it throws more red. This is a black tie optional summer wedding. The dress itself is lovely it’s just the color I’m concerned about. \nIs red to a wedding taboo still?",
        "created_utc": 1676462528,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friends modesty is hurting people.",
        "author": "DollHead900",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112weco/my_friends_modesty_is_hurting_people/",
        "text": "[removed]",
        "created_utc": 1676462416,
        "upvote_ratio": 0.99
    },
    {
        "title": "Why is Christianity mocked so much ?",
        "author": "moe12727",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112wds0/why_is_christianity_mocked_so_much/",
        "text": "[removed]",
        "created_utc": 1676462386,
        "upvote_ratio": 1.0
    },
    {
        "title": "stuck btw higher studies and job",
        "author": "Namicatburglar666",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112vqyf/stuck_btw_higher_studies_and_job/",
        "text": "[removed]",
        "created_utc": 1676459965,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone pulled out in front of me without much warning, then approached me at a convenience store after",
        "author": "Disgruntled_Viking",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112uzr6/someone_pulled_out_in_front_of_me_without_much/",
        "text": "I heard them yell for me, I turned around and walked up to them, not knowing what to expect.  He apologized, said he didn't know what he was thinking and was on autopilot leaving his driveway.  I accepted his apology, we shook hands and walked off into the store.\n\nSad that this interaction seemed so unique with how things are in the world anymore.",
        "created_utc": 1676457043,
        "upvote_ratio": 1.0
    },
    {
        "title": "today my psych advised me to \"remain regimented in your routines, but practice being flexible with your feelings.\" it was a breath of fresh air.",
        "author": "myaskredditalt21",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112us03/today_my_psych_advised_me_to_remain_regimented_in/",
        "text": "i have a lot of shit going on in my head, but that's neither here nor there. without any clinical allowance, basically i can describe my biggest challenge like this: i will emotionally disown myself if i sense that i may be failing, and not \"showing up\" consistently feels like failing to me.\n\nbut it's impossible to \"show up\" the same way every day. that doesn't take away from the success of completing the task. maintaining my routines keeps me accountable for myself. i may wake up on monday and make my bed and take a shower and get ready for work with joy.\n\non wednesday, i might wake up quite literally having suicidal ideations. i could easily talk myself out of doing the things i need to do because i feel like that \"version\" of myself isn't presentable. my barrier is that i am flexible with my routines because i am rigid with my feelings. it's not sustainable, and i owe myself the chance to change my feelings vs. punishing myself by abandonment in my routines.\n\ni just thought that was a very peace-giving thought. i hope someone needed to read this today, and maybe that person is you!",
        "created_utc": 1676456191,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do children of wealthy families feel about their parents' wealth? Are they proud or embarrassed?",
        "author": "Necessary-Capital-92",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112ub8x/how_do_children_of_wealthy_families_feel_about/",
        "text": "[removed]",
        "created_utc": 1676454292,
        "upvote_ratio": 1.0
    },
    {
        "title": "question",
        "author": "obsessedwbootpolish",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112u9y1/question/",
        "text": "[removed]",
        "created_utc": 1676454141,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sick of having a mouth",
        "author": "Sonicsaitama420",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112u9pg/sick_of_having_a_mouth/",
        "text": "Have ya have ever felt like the only people you interact with ya don't give enough to talk about? And that it's hard to try and talk to people outside your circle while feeling that you cloud inside you that constantly suffocated ur self esteem. I'm at the age where it's considered abnormal, and I been really hating myself more and more. Anything to help me get better?",
        "created_utc": 1676454114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone else ended friendship with someone that you’d normally describe as wonderful, but for their one irritating quality that you couldn’t look past?",
        "author": "maruperu",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112tzoi/has_anyone_else_ended_friendship_with_someone/",
        "text": "For me, it was with an office colleague. She is super sweet, funny, empathetic, helpful, and overall great to be around. But she would arrive fifteen to twenty minutes later than our agreed upon meeting time. Lunch at the cafe? She’d tell you she’ll be there at noon, and show up at 12:20. I let her know many times that I don’t like waiting and that she could pick a time to meet that was based on her convenience - just that I would appreciate her being punctual. We typically met for lunch at the cafe or coffee in the break room - a few minutes walk from her desk. And yet, she’d make me wait. Eventually I lost interest in meeting her. I feel sad about it sometimes, though. She is otherwise so nice.",
        "created_utc": 1676452974,
        "upvote_ratio": 1.0
    },
    {
        "title": "How hard is it to say “some people are like this, and some people like that, it’s fine”?",
        "author": "heyhowsitgoinOCE",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112tu5s/how_hard_is_it_to_say_some_people_are_like_this/",
        "text": "Seriously it drives me mad the way people always feel the need to attack anybody with any lifestyle difference. Some people are couch potato’s, some people are gym junkies, it’s all good. Some people have kids, some people don’t, it’s all good. Some people wanna be sparkly precious and queer, some people want to be rough tough and absolutely kill their gender role. It’s all fuckin good man. We don’t have to take shots at each other. Life is not a sport, it’s a luxury high end big budget entertainment experience. Or maybe I’m just being intolerant of the people who feel that life is a sport. Oh god",
        "created_utc": 1676452329,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone getting feels that life’s moving faster lately",
        "author": "GakuhoAsano",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112trfi/anyone_getting_feels_that_lifes_moving_faster/",
        "text": "I am 21 and I have been graduating soon I couldn’t make graduate early because i got some health issues and at this time i am seeing all my friends getting married and living fullfiling life it makes me think that i aint getting life like them because i am poor(pissed also lol)",
        "created_utc": 1676451997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Think about it...",
        "author": "notcosy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112tckp/think_about_it/",
        "text": "Do you ever come to realisation that you're literally a slave to nostalgia? No matter how good your life is, you can't help but compare it to childhood memories that play in your mind like a broken loop. The present is good, but does it have the rosy film of past ? Will springs ever feel as they did when you experienced them as a child ? Will happiness ever feel as all encompassing and endless ? How can you ever be satisfied if you're trying to chase a feeling no longer attainable to your grown up self ?",
        "created_utc": 1676450253,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am just amazed how easy paperwork is in the USA",
        "author": "prisonbird",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112sx21/i_am_just_amazed_how_easy_paperwork_is_in_the_usa/",
        "text": "i live in the europe as an expat and the things i saw on youtube and experience of people i know about the USA amazes me. \n\nyou want to build a car in your garage with parts from 10 different cars and you need a licence plate ? check !\n\ndo you want to start an online business, get paid on your website etc. easy ! just register to this website and youre done. \n\ndo you want to import some spices from middle east ? you just fill a form to FDA and its done in couple days.\n\ndo you want to buy guns and enjoy some target practice ? it takes less paperwork to buy a gun in USA than buying a car in Spain.\n\ni think when they say \"land of freedom\" they literally mean it",
        "created_utc": 1676448474,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the activities I can do online?",
        "author": "It_hurtsss",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112slxz/what_are_the_activities_i_can_do_online/",
        "text": "I'm dead bored with life after my breakup. Also as college is almost done don't have much studying.\n\nMy ADHD also getting worse so can't study much. Now a days I'm paralyzed in bed because of depression and boredom. I used to talk 24/7 in relationship so the void sometimes hits hard when I get low. I always get the urge to break the no contact with ex as I really miss him.\n\nI'm interested in data analysis, organizing, listing and researching random topics on Google.",
        "created_utc": 1676447220,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone kept ringing my doorbell at 4:30 am",
        "author": "parasithe",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112sgr8/someone_kept_ringing_my_doorbell_at_430_am/",
        "text": "[removed]",
        "created_utc": 1676446655,
        "upvote_ratio": 1.0
    },
    {
        "title": "TIL that I held spoons in the wrong way my whole life",
        "author": "Warm_Video_4946",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112rr5z/til_that_i_held_spoons_in_the_wrong_way_my_whole/",
        "text": "Recently my parents started making remarks on how I eat. Unlike everyone, I held spoons like an actual hammer. I never saw anyone else in my life do it like that and I'm genuinely surprised.\n\nHas something like that ever happened to you, when you realized you've been doing something incorrectly or believing in something that was false (some \"fact\" for example) your whole life?",
        "created_utc": 1676443871,
        "upvote_ratio": 1.0
    },
    {
        "title": "How was your Valentine's day?",
        "author": "greg0525",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112rpm9/how_was_your_valentines_day/",
        "text": "Last week, my wife and I initially planned to go out to a restaurant or go out somewhere but as the day approached and it felt like a regular workday. I did not cancel my work that day and we decided to stay home instead and watch romantic movies.  \n\nWe are always excited when a special day is coming. Sometimes we think about grand plans but we often settle for simpler things, which is funny.  \n\nIt's interesting how we come to the realization that simpler activities can be just as, if not more, enjoyable than more elaborate ones. I also have to add the fact that we are more or less practical people.\n\nHowever, the day turned out to be quite eventful - my wife received and gave cookies at her office celebration, and I gave her a small basket with a flower and heart-shaped biscuit with a figure. We cherished this moment after I took her home from work. However, we failed to watch anything as we were too sleepy.\n\nI think that celebrating something does not have to be a big event, enjoying each other’s company can make it up for anything. Love can be expressed in simple ways.",
        "created_utc": 1676443705,
        "upvote_ratio": 1.0
    },
    {
        "title": "TIL that my whole life I held spoons in a wrong way",
        "author": "Warm_Video_4946",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112rp4p/til_that_my_whole_life_i_held_spoons_in_a_wrong/",
        "text": "[removed]",
        "created_utc": 1676443652,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's a glitch in the Matrix?",
        "author": "whostolemypineapple_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112rou5/whats_a_glitch_in_the_matrix/",
        "text": "I've heard of so many glitch in the Matrix stories, some of which seem so fascinating and unbelievable sometimes. I've had several instances like something happening to me but I wake up and it's actually happening to me. But how does that work???\nIs it just another term for a deja vu?? \nThe mind can play some freaky games lol ... Speaking of which ,\nhas it crossed anyone else's mind that maybe we all ARE in a 'Matrix' which is actually a video game where God is the gamer and we're all the characters of the game?",
        "created_utc": 1676443619,
        "upvote_ratio": 1.0
    },
    {
        "title": "People who are physically active every day, how do you do it?",
        "author": "hartssl",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112ro05/people_who_are_physically_active_every_day_how_do/",
        "text": "And to clarify I mean outside of a job that consists of a lot of physical activity. I’m asking people who work desk jobs, students, parents, etc. I know physical activity is good for you, and I know it feels better after, but like… how do you do it?!?!? The only time I can get myself to go be active is when I lift weights, but that’s because I work with a trainer, and since I pay to do that it keeps me accountable/motivated (somewhat haha). I’d like to start incorporating a different type of physical activity (not necessarily “exercise”) into my routine each day of the week but when it comes time to get off the couch, get dressed and get moving, it’s SO. HARD. I have ADHD so the executive dysfunction is real. It’s like I can see that active lifestyle I want for myself but it’s just out of reach, and the only thing stopping me is myself. 😩",
        "created_utc": 1676443529,
        "upvote_ratio": 1.0
    },
    {
        "title": "my dick size is only 1 cm",
        "author": "hi-hello-world",
        "url": "https://www.reddit.com/r/CasualConversation/comments/112rgfd/my_dick_size_is_only_1_cm/",
        "text": "[removed]",
        "created_utc": 1676442700,
        "upvote_ratio": 1.0
    }
]