[
    {
        "title": "Removing comments and posts !",
        "author": "sarahshockley",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hlrfn/removing_comments_and_posts/",
        "text": "[removed]",
        "created_utc": 1677893921,
        "upvote_ratio": 1.0
    },
    {
        "title": "why my posts and comments are being removed? 🥺",
        "author": "sarahshockley",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hlocx/why_my_posts_and_comments_are_being_removed/",
        "text": "[removed]",
        "created_utc": 1677893692,
        "upvote_ratio": 1.0
    },
    {
        "title": "I submitted a scammer to the Attorney General.",
        "author": "WeeklyPie",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hll3v/i_submitted_a_scammer_to_the_attorney_general/",
        "text": "[removed]",
        "created_utc": 1677893459,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey everyone, have you ever wondered why we yawn?",
        "author": "sarahshockley",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hljle/hey_everyone_have_you_ever_wondered_why_we_yawn/",
        "text": "[removed]",
        "created_utc": 1677893351,
        "upvote_ratio": 1.0
    },
    {
        "title": "A random text",
        "author": "humanwithfoodname",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hlh7t/a_random_text/",
        "text": "My friend randomly texted me “😘 I love you lady” today and it warmed my heart. I’ve had a long ass week &amp; had just gotten in from grocery shopping in the cold rainy miserable weather after working all day and I was just about to text her to complain when I seen she’d texted me first lol. \n\nOnce I saw what the text said it changed my mood completely. So grateful for her ❤️",
        "created_utc": 1677893171,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cosplay Ideas Needed!",
        "author": "Thtgirlwiththecoffee",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hldcn/cosplay_ideas_needed/",
        "text": "Hey everyone! I’m going to my first Megacon at the end of this month and I have no idea what to dress up as. I know everyone has preferences on movies, games or shows, etc. that they like so I’m open to all ideas to help me come up with something! Looking for female characters preferably blonde so I don’t have to wear a wig 💙",
        "created_utc": 1677892878,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sooo... weather is so weird everywhere right now, right? I'm currently experiencing a very not-typical March Thunder-snow storm.",
        "author": "soverylucky",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hld1t/sooo_weather_is_so_weird_everywhere_right_now/",
        "text": "I live in Canada, and in my 40+ years of life I've experienced March weather warm enough to get sunburns and snowstorms right up through to April, but never in my life have I experienced a mostly-snow, partial-rain storm where there was also thunder and lightning happening.  This is just all kinds of weird.",
        "created_utc": 1677892860,
        "upvote_ratio": 1.0
    },
    {
        "title": "randomly crying to a song",
        "author": "leandro-sus",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hl1t6/randomly_crying_to_a_song/",
        "text": "are you sometimes listening to a random Playlist just vibing  and suddenly a song you haven't listened to in a while starts to play and you just start crying for no reason or maybe nostalgia (you don't have any important memory associated with the song tho) because that just happened to me with whitesnake's here i go again",
        "created_utc": 1677892046,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your biggest heartbreak?",
        "author": "ari_peyton",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hl1c7/whats_your_biggest_heartbreak/",
        "text": "In anything, maybe in a relationship or any object. Anything. \n\n&amp;#x200B;\n\nI have a dog named Clyde, he was my bestfriend. We got him last 2020 in the amidst of pandemic. After years of being with him, 1 day he just get sick. We don't know what to do and we bring him to a vet. The vet says there is no cure for Parvo. It hurts. After a couple days he passed away.  \n\n&amp;#x200B;\n\nIf you have other dogs, it's important to take precautions to prevent the spread of parvo. This includes keeping your dogs up-to-date on their vaccinations, avoiding contact with dogs that are sick or have unknown vaccination histories, and regularly disinfecting your home and yard.",
        "created_utc": 1677892013,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best airport you've been to?",
        "author": "mary_jane_o_f",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hktxx/what_is_the_best_airport_youve_been_to/",
        "text": "[removed]",
        "created_utc": 1677891501,
        "upvote_ratio": 1.0
    },
    {
        "title": "I started to record my sleep six months ago. Today, I slept for nine hours and six minutes.",
        "author": "-m1-e2-a3-n4-",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hke35/i_started_to_record_my_sleep_six_months_ago_today/",
        "text": "I’ve been struggling and finding a hard time sleeping before the alarm reminds me to sleep already. My goal is always eight hours of sleep. For the past six months, the average time in bed is five hours and twenty-five minutes. I am glad that I slept for nine hours without any distractions. I woke up happy and energetic. 🙌🏻 I hope this continues until the end of the year. :D",
        "created_utc": 1677890369,
        "upvote_ratio": 1.0
    },
    {
        "title": "what form of media do you think helped shaped your humor/personality?",
        "author": "stainedwater",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hkdri/what_form_of_media_do_you_think_helped_shaped/",
        "text": "im just thinking about how my speech patterns irl and humor has changed since watching my favorite shows, like it’s always sunny, and some youtubers i used to watch religiously.\n\nso i’m curious! whether it’s a TV show, movie, book series, whatever! what media has changed you?",
        "created_utc": 1677890346,
        "upvote_ratio": 1.0
    },
    {
        "title": "a smile is such an underrated factor for attraction",
        "author": "TheBananaEater",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hk45e/a_smile_is_such_an_underrated_factor_for/",
        "text": " if a girl has all 3 theres a 99% chance id be attracted to her and those are looks, intelligence and a smile. I dont care if u make the pointless, vanilla conversations with me, as long as ur smiling ill be smiling.",
        "created_utc": 1677889671,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just found out I’m schizophrenic. Should’ve been able to diagnose myself. AMA I suppose.",
        "author": "TheAndorran",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hjlcg/just_found_out_im_schizophrenic_shouldve_been/",
        "text": "[removed]",
        "created_utc": 1677888366,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crypto and CBDCs",
        "author": "CranKBerryJuice",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hjajs/crypto_and_cbdcs/",
        "text": "[removed]",
        "created_utc": 1677887668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day dreams",
        "author": "Who4114",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hiqxp/day_dreams/",
        "text": "I want to know if people actively choose to daydream. Like I know that I day dream occasionally in random places in school at home and other places. But I'm genuinely curious to find out if people choose to day dream.",
        "created_utc": 1677886351,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think Im finally maturing and becoming and adult",
        "author": "_lemon_water_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hi48b/i_think_im_finally_maturing_and_becoming_and_adult/",
        "text": "Its midnight here and Im so proud of myself for keeping a job, being on time every morning and doing it good. For most people its nothing special I know but for me this was hardest part of life so far and some kind of unlocked mystery. I couldnt figure out how most people go to work every day and just do it. Also kind of enjoying it, not for money which is of course and lovely bonus, but I feel like Im useful part of society and acomplishing some goals every day. Weekends also feel much more deserved and not like any other day. Thats all thanks for reading :)",
        "created_utc": 1677884860,
        "upvote_ratio": 1.0
    },
    {
        "title": "I freaked myself out by how strong my urge to hit my dog was",
        "author": "azbycxdwevguhtisjrkq",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hhy1b/i_freaked_myself_out_by_how_strong_my_urge_to_hit/",
        "text": "My dog is 14, love her very much. She was my childhood dog and she has been a joy to have. About a year ago my dog started waking up in the middle of the night crying and panting. Nothing would settle her down. We took her outside, made sure she had water, gave her the chance to switch rooms. Nothing helped. She had always slept in bed with us so when she started her crying routine. We took her to the vet. She had dementia. Her symptoms are sundowning. Apparently dementia symptoms and confusion get worse at night. She got meds but the vet said she'll just get worse ac we'll just have to readjust the meds when that happens. \n\nWe have been pretty patient with her. She wakes us up every other night. Sometimes firm directions like telling her to lay down helps her with the confusion, some times it doesnt. She also started clawing at our faces when she wakes us up. She doesn't mean to hurt us. She has shown no aggression what so ever. I think she is just desperate for us to help her when she gets confused. I have scars on my arms from it. Normally i just push her, gently, off of me and wait for her to calm down. Sometimes she gets my neck.\n\nOver the last month i spent 3 weeks dog sitting 7 dogs for family. I haven't got much sleep in that time because i was watching 5 dogs and 2 dogs at a time. 2 nights ago my dog with dementia started having a bad night. She clawed at me and cried. Normally her worst episodes last for and hour and a half. She woke me up at 12 am then went back to sleep, I went to bed at 11pm. Then she woke me up at 4am. Except she isn't having a normal episode, it never ended. I work from home she kept trying to claw at me while i worked. So i locked her out of my office. She finally quit after 8 hours of non stop crying and clawing st me. \n\nThat night i took her for a walk so she could sleep through the night and i could sleep. She woke me up at 2am by clawing at my eyes. I was so enraged and sleep deprived that I almost punched her. Im not exaggerating i wanted to just throw her off the bed or smack her. Instead i picked her up and locked her out of my room. She proceeded to bang in the door and cry until i got up for work again. She has an appointment to adjust her meds next week. I love her so much but i genuinely wanted to hurt her and it scared me.",
        "created_utc": 1677884470,
        "upvote_ratio": 1.0
    },
    {
        "title": "Casual Friday - An awesome time during the week when we can talk about cool things",
        "author": "MajorParadox",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hhx0p/casual_friday_an_awesome_time_during_the_week/",
        "text": "",
        "created_utc": 1677884409,
        "upvote_ratio": 1.0
    },
    {
        "title": "Talkative Cat Purring For 5 Minutes Straight.",
        "author": "WesternMark4427",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hhana/talkative_cat_purring_for_5_minutes_straight/",
        "text": "[removed]",
        "created_utc": 1677882933,
        "upvote_ratio": 1.0
    },
    {
        "title": "Discover the secrets to a healthier and happier life",
        "author": "Ayomidedavid",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hh8vu/discover_the_secrets_to_a_healthier_and_happier/",
        "text": "[removed]",
        "created_utc": 1677882822,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where do you live and what are your hobbies every season?",
        "author": "BungOnMimosas",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hh7kb/where_do_you_live_and_what_are_your_hobbies_every/",
        "text": "I live in Salt Lake City and depending on the season my hobbies change quite a bit. \n\nWinter is obviously ski/snowboard season and that’s all I want to do\n\nFall and spring are rock climbing and hiking season\n\nSummers here kind of suck ass. They’re hot, dry, miserable, no good lakes or rivers near by. So summer is party, video game, and vacation anywhere but here season",
        "created_utc": 1677882740,
        "upvote_ratio": 1.0
    },
    {
        "title": "How/why do you listen to music? Is it toxic, or cathartic? And what are some songs that have triggered the strongest emotions for you?",
        "author": "harmonybrook",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hh3w8/howwhy_do_you_listen_to_music_is_it_toxic_or/",
        "text": "Do you listen to music to accentuate your emotions, of your bring out ones you wouldn’t have otherwise had, or to get them out of your system? \n\nFor me it’s both. But also having never really been in an relationship, I feel like I can only and only have experienced certain emotions through music. At the same time they still resonate with real emotions I’ve had, just different context. \n\nI feel like sometimes it can be cathartic, but also maybe more often toxic, as it can promote wallowing in my emotions.\n\nThoughts? Which is it for you?",
        "created_utc": 1677882516,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was just asked for my ID for the first time in years. My self-esteem has been really low lately, and it definitely gave me a little boost this morning. What small interactions like this make your day just that little bit better?",
        "author": "Dissessence",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hgwup/i_was_just_asked_for_my_id_for_the_first_time_in/",
        "text": "I was at my local dispensary and the sales person looked me up and down and asked for my ID. They jokingly said \"I'm so bad at guessing ages, so I've got to check\" but they didn't ID the two people ahead of me. I'd like to think my new skin care routine might be helping me out.",
        "created_utc": 1677882060,
        "upvote_ratio": 1.0
    },
    {
        "title": "17 and no longer homeless 🥳",
        "author": "SoupEnjoyer28",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hgoym/17_and_no_longer_homeless/",
        "text": "I just got approved to move into a place on Monday after being homeless for over a year now! 🎉 I don’t care if anyone sees this or not I just need to put it out into the universe. I can’t wait to have a shower and my own bed. This is such a great feeling and a relief. My cat and I are so hyped lol",
        "created_utc": 1677881567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im having Vietnamese food for the first time tomorrow!",
        "author": "Background_Smile_163",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hgbv6/im_having_vietnamese_food_for_the_first_time/",
        "text": "Ive had pretty much every asian cuisine there is but haven’t had a chance to try Vietnamese food yet. Its a pretty fancy restaurant so if anyone has recommendations that would be great!",
        "created_utc": 1677880746,
        "upvote_ratio": 1.0
    },
    {
        "title": "Broken Justice",
        "author": "BrokenJusticeBook",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hga8x/broken_justice/",
        "text": "[removed]",
        "created_utc": 1677880641,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could someone help me sort out the possibility that I might have been used?",
        "author": "TheUglyBarnaclez12",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hf7j5/could_someone_help_me_sort_out_the_possibility/",
        "text": "Earlier this week, I responded to a post about flatulence. Immediately afterward, I got a DM from the poster. We started talking and he convinced me to contact him on Telegram. I did and we started talking and swapping audio clips on there. However, he would often go hours without responding to some of my messages. Then, earlier today, almost all of the messages on Telegram were erased and I found that his Reddit profile has been erased. I gave him an ultimatum: he has until Sunday night to give me a response or I’m moving on from him. Could someone please tell me if this is a cause for concern? Thank you.",
        "created_utc": 1677878192,
        "upvote_ratio": 1.0
    },
    {
        "title": "How To Do A Full Body Detox. Easy Ways",
        "author": "zaahi16",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hez20/how_to_do_a_full_body_detox_easy_ways/",
        "text": " \n\nThere are several easy ways to do a full body detox. Here are some suggestions:\n\nIncrease your water intake: Drinking more water can help flush toxins out of your body.\n\nEat whole, unprocessed foods: Focus on eating whole, unprocessed foods such as fruits, vegetables, and lean proteins. Avoid processed and sugary foods.\n\nReduce or eliminate caffeine and alcohol: Both caffeine and alcohol can be hard on the liver, which plays a key role in detoxification.\n\nExercise regularly: Exercise helps to boost circulation, which can aid in the detoxification process.\n\nGet enough sleep: Sleep is important for your body to repair and regenerate, which can help with detoxification.\n\nTry a juice cleanse: A juice cleanse involves drinking only fruit and vegetable juices for a period of time, typically 1-3 days. This can help to flush out toxins from your body.\n\nTake Epsom salt baths: Epsom salt contains magnesium, which can help to relax muscles and reduce inflammation.\n\nUse a dry brush: Dry brushing is a technique where you use a dry brush to exfoliate your skin. This can help to stimulate your lymphatic system, which plays a key role in detoxification.\n\nRemember to consult with a healthcare provider before starting any detox program, especially if you have any underlying health conditions.",
        "created_utc": 1677877649,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gambling ads",
        "author": "spookyookykittycat",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hea20/gambling_ads/",
        "text": "Is it just me or have ads for random gambling apps/companies become more rampant? Everywhere!! Tubi, Prime, Youtube, etc. Gambling is so incredibly stupid and I’m sure those who are already addicted don’t need the ads to make them keep doing it and people who aren’t addicted aren’t going to fall for their stupid “sexy lady” promos or stupid bing noises of “winning”. I just want these ads to stop. It’s so incredibly stupid I cannot put it into words.",
        "created_utc": 1677876121,
        "upvote_ratio": 1.0
    },
    {
        "title": "when I start to wonder what worries a person has... that's how I know I love this person",
        "author": "Powerful_Ad8668",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11he82m/when_i_start_to_wonder_what_worries_a_person_has/",
        "text": "I mean 'wonder' as in 'want to hear all about it' wonder. I generally don't care enough to be willing to listen about other people's concerns in life, but certain people... I really want them to open up to me so that I get to know about them more. I'm curious what's on their mind, I wanna be by their side and share their worries.\nI think a lot of people have it differently, but for me it really is a sign that I have a deeper attachment to them than to others",
        "created_utc": 1677876000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day Dreaming",
        "author": "Who4114",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hdwjg/day_dreaming/",
        "text": "[removed]",
        "created_utc": 1677875276,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I be less ashamed of my sexuality and desires?",
        "author": "Noseasmamonguey",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hdk2d/how_can_i_be_less_ashamed_of_my_sexuality_and/",
        "text": "[removed]",
        "created_utc": 1677874499,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you use the front or back of your tongue when pronouncing the N in “need”?",
        "author": "OneZenMF",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hd96r/do_you_use_the_front_or_back_of_your_tongue_when/",
        "text": "I always use the back but I’m just now realizing for the first time in my life that you could use the front. Using the front still feels very odd to me though.",
        "created_utc": 1677873784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone have a fun baking recipe?",
        "author": "Big_Thoss",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hd8uq/anyone_have_a_fun_baking_recipe/",
        "text": "I recently made some lemon bars ([using this video](https://www.youtube.com/watch?v=9MzkLFv3yAs)) which turned out great! Curious if anyone has a recipe they're proud of or something",
        "created_utc": 1677873761,
        "upvote_ratio": 1.0
    },
    {
        "title": "I guess I am so lonely...",
        "author": "bullish_trad3r",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hcuyz/i_guess_i_am_so_lonely/",
        "text": "I just finished a movie called \"Ruby Sparks\". I wanted to share it with somebody. Then I realized I don't have anyone to share. It's not like I don't leave the house struggling severe depression. I do know people but there's just one or two person I can call friend. Most if the time I am okay with it. I'm an introvert. I like solidarity to some level. Being in crowd and dealing with people exhaust me. But I also like sharing things that I find funny, informative, usefull or silly. I don't talk to much but when I'm with my friend I don't shut up. It's like I'm always in power saving mode other then those short times I'm with someone I'm comfortable to be and to talk with. Someone that accepts me the way I am. Someone I can be myself near him. And I don't have many of them. And it sucks. Sometimes this thing we call life and loneliness and everything is too much. I've already lost my hope on so many things. I almost have no expectations therefore no disappointmens. It's ok generally but sometimes some things triggers some things and Voilà! \n\nAnyways. The movie.\n\n I like rom-com movies generally. When I first saw this movie I don't know where.. actually I think I watched Zoe Kazan movie and I wanted to watch more of her work. I think it was The Big Sick which was also a cute movie. Anyways. The trailer was interesting, story pulled me in other than Zoe. I was expecting it to be cute but it turned out amazing. I loved it so much. Especially story was great. Scenes near the ending was shocking to me. I don't want to spoil anything if anyone care to watch after this post but you'll know which scenes I'm talking about. Zoe's acting was so great. The fact that she was the writer of the movie was a huge plus for me. \n\nAnyways. Thanks for reading :/ I hope it was not a waste of time for you.",
        "created_utc": 1677872880,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to go to Japan.",
        "author": "uwukome",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hcuqq/i_want_to_go_to_japan/",
        "text": " So, ever since I started watching anime in my pre-teens, many moons ago, I have wanted to visit Japan. As an adult, I am less into anime, but I still very much want to go for other reasons. The cherry blossoms, Lolita, Sanrio, Pokemon Center, all of the videos I've watched of hotels and places to visit, etc. There's even a Lucky Cat temple I want to place a cat at! Desperately! \n\n Before I go, I want to learn some of the language and more about the culture and what's appropriate. It'll probably be a long time before I can go even though I'm in my late 30's. I'm not financially stable and have a lot of health problems, but I WILL go. I will get there. In the meantime, I'm going to study and continue to research places to visit.\n\n Have you been to Japan? Do you live there? I'd love to hear about others experiences.",
        "created_utc": 1677872864,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm bloody starving and I need a distraction.",
        "author": "tated744",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hchgr/im_bloody_starving_and_i_need_a_distraction/",
        "text": "Long story short I'm having a hard time and I just need a distraction till I can finally eat again after the weekend.\n\nTalk about anything, ask me anything, just help keep me occupied and thinking about something else for the evening.",
        "created_utc": 1677872013,
        "upvote_ratio": 1.0
    },
    {
        "title": "what’s your least favorite tv show?",
        "author": "QuinnyIsACowboy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hcckk/whats_your_least_favorite_tv_show/",
        "text": "got off work early and room mates are out and i’m bored so let’s talk! what’s your least favorite TV show? for me, it’s friends or big bang theory. i could NEVER get into either and i never understood people who did. i was not a fan of the office either but i “got” it. i could see the appeal and why others would like it. but friends and big bang are just so BAD",
        "created_utc": 1677871700,
        "upvote_ratio": 1.0
    },
    {
        "title": "My grandma and I were once mistaken for muslims despite being athetists.",
        "author": "Skystar2002",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hc83g/my_grandma_and_i_were_once_mistaken_for_muslims/",
        "text": "Today I had lunch with my grandmother and we were recalling previous experiences we shared together and one of the funniest ones we remember was that time back when I was a little girl when my grandma and I were surprinsingly mistaken for muslims despite both of us being athetists. \n\nIt happened when I was around 11 or 12 years old if I remember correctly. I was staying at my grandma's house on a really cold and windy day and we had to go buy some meat. \n\nMy grandma didn't want us to go outside without something to keep our heads warm and protected from the wind, but we didn’t have any hats or hoodies at our disposal at that time. (My grandma has never been a fan of wearing hats or covering her head in general.)\n\nSo both of us ended up going to the supermarket with bulky woolen scarves wrapped around our heads. We went to get some meat at the supermarket's butcher section and the woman selling the meat saw us buying some pork and she said to my grandma:\n\n\"Are you sure you want to buy this, ma'am? It's pork.\" \n\nMy grandma casually replied saying she already knew it was pork and she wanted to buy it. \n\nThe woman sold us the pork and didn’t say anything but she kept looking at us in a surprised way. \n\nWe didn't realise what had happened until we came back home and took off our scarves and we both laughed and continue to laugh at it to this day! \n\nHas a similar experienced happened to you before? For what were you mistaken as? What was your reaction and the one of the people that mistook you for said thing? Please feel free to share your experience!",
        "created_utc": 1677871414,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do VTubers creep out anybody else?",
        "author": "SUPERSTARWARRIOR",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hc2a5/do_vtubers_creep_out_anybody_else/",
        "text": "I really don't get why they're so popular. They look so weird and soulless, and it's harder to get behind them compared to, say, a character from a show/game, because it's an actual person in live time behind it. \n\n(What a VTuber is:)\n\n&gt; A VTuber, or virtual YouTuber, is an online entertainer who uses a virtual avatar generated using computer graphics. Real-time motion capture software or technology are often—but not always—used to capture movement.",
        "created_utc": 1677871045,
        "upvote_ratio": 1.0
    },
    {
        "title": "The sales girl loved my necklace so much, I just took it off &amp; gave it to her.",
        "author": "MSRegiB",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hbxnj/the_sales_girl_loved_my_necklace_so_much_i_just/",
        "text": "My hubby &amp; I were in a big box store &amp; a sales woman commented on the necklace I was wearing, she said she really liked it, she thought it was sooo cool. I just started making jewelry, I haven’t sold any, I just gave it away at Christmas &amp; have given away some as gifts since Christmas. I told her I made it &amp; she just couldn’t believe it. She said well I would love to buy one just like that if you have another one. I said that’s ok I’ll just give you this one as I took it off &amp; put it around her neck &amp; so I just gave it to her. She was in total disbelief, I told her I just wanted a hug &amp; a new friend &amp; I told her to pass on her talent for free to someone  else because art should be shared. It was such a wonderful feeling to give this to her &amp; see her surprise &amp; gratitude &amp; her genuine love for something I made. I say this not to brag on myself but to share how wonderful it felt, I have done this before at a fast food drive through where a very young girl loved a sterling silver ring I had on. I took it off &amp; gave it to her &amp; she couldn’t believe it but I told her she had to stay in school &amp; to go on to continue her education. \n\nI believe with all my heart that what you sow, sow shell you reap. It’s a law as true &amp; solid as the law of gravity. She made my day more then I made hers I assure you.",
        "created_utc": 1677870739,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you like party card games? I really need advice",
        "author": "samantharamirez",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hbr9h/do_you_like_party_card_games_i_really_need_advice/",
        "text": "[removed]",
        "created_utc": 1677870347,
        "upvote_ratio": 1.0
    },
    {
        "title": "My psychologist was a narcissist",
        "author": "AssociationIcy98",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hbq3p/my_psychologist_was_a_narcissist/",
        "text": "\n\nSo I suffer from epilepsy and I was paralyzed and while I was paralyzed my psychologist told me : you are not that sick . She also told me that models are stupid and called me stupid numerous times. I told her I want to be an actress and he told me a story about how she used to sing a piano and no one came and she couldn’t make any money and she told me my mom deserves to die .",
        "created_utc": 1677870276,
        "upvote_ratio": 0.99
    },
    {
        "title": "A dilemma in my life.",
        "author": "WesleyIsTrash",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hbpmc/a_dilemma_in_my_life/",
        "text": "I’m a high school senior graduating in June. After 4 long years I’m finally going to be done with high school and moving on to college. My graduation ceremony is on a weekday after the last day of school at 8pm. \nBut one problem stands in the way. One of my favorite bands of all time is touring and they’re performing 30 minutes from me on the same day and time as my high school graduation ceremony. \nI know I should be happy to graduate high school and attend the ceremony, but I feel I don’t feel it’s 100% worth it to sit for over an hour just to cross the stage for 20 seconds. What are y’all’s thoughts on this.",
        "created_utc": 1677870247,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommend me a book",
        "author": "_4ga_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hbo22/recommend_me_a_book/",
        "text": "So yeah, second year in a row I aspire to read more and fail miserably. Maybe it’s because I never really read fiction. Can you recommend something? Preferably sci-fi or crime.\nI’m not a huge fan of fantasy tho, but will definitely check.",
        "created_utc": 1677870149,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever been mistaken for a member of a religion you don't believe in?",
        "author": "Skystar2002",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hbikq/have_you_ever_been_mistaken_for_a_member_of_a/",
        "text": "[removed]",
        "created_utc": 1677869839,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just realized I havent hugged anyone in 15 years.",
        "author": "Demmanueloff",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hb0e5/i_just_realized_i_havent_hugged_anyone_in_15_years/",
        "text": "[removed]",
        "created_utc": 1677868855,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am not Carol",
        "author": "MammothDirect8173",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hawrp/i_am_not_carol/",
        "text": "For the last 7 years now I have received probably over 50 calls from old ladies talking to carol. I am not Carol. Usually when I get wrong number calls, I send a quick text back of “sorry wrong number!”, but the issue is these are all old ladies calling me off their landlines so I can’t send anything. Somewhere along the road, there had to be a major miscommunication in which Carol’s entire friend group was given my number thinking it was hers, and I would’ve thought they would’ve realized after this many years, but alas I have gotten 4 calls for Carol in the last 2 days. Sometimes I feel bad, I hope Carol’s friends see her and get to talk to her. But more of the time I’m frustrated and really tired of getting all these phone calls. I’m not really sure what to do at this point. What would all of you do in this kind of situation? Just soak in the comedy of it?",
        "created_utc": 1677868683,
        "upvote_ratio": 1.0
    },
    {
        "title": "Name a fictional character, faction, etc. and I'll suggest an oatmeal that fits!",
        "author": "Tactical-Kitten-117",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11haohe/name_a_fictional_character_faction_etc_and_ill/",
        "text": "I did this for tea about a month ago, so I thought I'd make one about my other obsession, oats!\n\nName a fictional character, faction, group, etc. and I'll come up with some kind of flavor I think they'd like.\n\nFor characters I don't already know, I'll only do minimal research on them, so I'd be more accurate with popular characters from things like Star Wars, Star Trek, popular anime characters, etc. Name any character regardless, but I thought I'd mention it\n\n(and/or additionally, ask anything you'd like to know about oats ☺️)\n\nI'll start with one character as an example. Baby Yoda/Grogu from Star Wars the Mandalorian. I'm thinking he'd like savory oats, due to his appreciation for eggs. Perhaps a chili mango bowl of oatmeal, with a sunny side up egg or two. Sweet, savory, if not a little unusual of a combination. Doesn't make much sense, like his species. But it'd probably be delicious!",
        "created_utc": 1677868329,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mods everyone please forgive me if this is too unrelated, but the rise of landlords taking up real estate and expecting us to pay them whatever number they want has inspired me to create this subreddit",
        "author": "Ivebeendoingurmom",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11hafk9/mods_everyone_please_forgive_me_if_this_is_too/",
        "text": "[r/ReportRentals](https://www.reddit.com/r/ReportRentals) \n\nhttps://www.reddit.com/r/ReportRentals\n\n\n\nHere we help each other and make each other aware of other rentals as well as making fun of them, No one should rent a trap hole",
        "created_utc": 1677867990,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey guys! I created a subreddit where we can critique and be aware of shitty rentals! I was wondering if anybody would like to join?",
        "author": "Ivebeendoingurmom",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h9zoy/hey_guys_i_created_a_subreddit_where_we_can/",
        "text": "[removed]",
        "created_utc": 1677867465,
        "upvote_ratio": 1.0
    },
    {
        "title": "With the escalating use of electronics, home outlets should come standard with more than two receptacles.",
        "author": "thecabeman",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h9q5i/with_the_escalating_use_of_electronics_home/",
        "text": " We're constantly unplugging one thing to plug in another temporarily. Yes, I'm aware of power strips/extensions and we use those for the areas that need things plugged in constantly. I also know they have the 'two receptacle, two USB' outlets, but that doesn't help if you have three plugs.\n\n&amp;#x200B;\n\nExamples: Air Freshener and lamp, but want to charge phone and use it. Microwave and coffee pot, but want to use the blender. Humidifier and doorbell (our doorbell doesn't work so we have one that plugs in with a speaker), but want to charge laptop.",
        "created_utc": 1677867174,
        "upvote_ratio": 1.0
    },
    {
        "title": "Celebrity admirer",
        "author": "AssociationIcy98",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h9557/celebrity_admirer/",
        "text": "So basically I was in another country and they took pics and videos of me right at the entrance of the airport ( I later found out it was because a celebrity told them so ) . Anyway in the hotel I stayed I had a mutual connection that knew him and he secretly recorded me without my knowledge and permission and I later found out it was also for the celebrity. Anyway I talked to him on the phone he seemed very nice he complimented me a lot said a have a lovely voice and that I am very beautiful and even said he would love to take me out when I am older because he is deeply in love …the story basically",
        "created_utc": 1677866531,
        "upvote_ratio": 0.99
    },
    {
        "title": "Ive been having crazy mood swings",
        "author": "Pizaster2",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h94ej/ive_been_having_crazy_mood_swings/",
        "text": "One second im full of love and wanna hug everyone. And the next im plotting to kill. Ok not that far, but like i get so full of rage and anger randomly(but i never act on them) and its entirely out of my character. Im a hopeless romantic type. What gives?",
        "created_utc": 1677866509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you get crushes as an adult?",
        "author": "srcg612",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h8mnz/do_you_get_crushes_as_an_adult/",
        "text": "I work a food service job and have a crush on one of the regulars. They always come in around the same time and order the same thing and sometimes if it isn’t too busy we’ll make small talk. \n\nI’m 22 now but one thing I miss about being a kid was just “like-liking” someone. Just enjoying being able to see them and talk to them every once in a while and not expecting anything to come of it. My coworkers keep telling me I should just ask for their number but I just want to let them get their food in peace and not make it complicated. I don’t need to have anything more than what I have now, I just like seeing them :)\n\nDo any of you have crushes you don’t do anything about? Who is it? Do you feel similar?",
        "created_utc": 1677865962,
        "upvote_ratio": 1.0
    },
    {
        "title": "I finally lost my daily tiredness",
        "author": "creespop",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h7yg9/i_finally_lost_my_daily_tiredness/",
        "text": "I don’t if anyone had this problem but i was always so sleepy and tired through the whole day and i knew it was because i always fell asleep when TV was running.\n\nThe problem i had was that i couldn’t fall asleep without the TV running but like 2 weeks ago i forced myself to move the TV out of my bedroom and try to sleep without it.\n\nOn the first few day it took my like 1-2 hours to fall asleep but it got better within the next few days.\n\nNow i feel like i have so much more energy through the day because the TV isn’t interrupting my sleep.\n\nI hope it will stay like this because i feel so much better.\n\nAnyone here had a problem like this too?",
        "created_utc": 1677865197,
        "upvote_ratio": 1.0
    },
    {
        "title": "I reached 200 days on reddit today!!",
        "author": "conchis10",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h7kyp/i_reached_200_days_on_reddit_today/",
        "text": "Do I completely understand that it’s a very small and insignificant number compared to most of you? \n\nYes\n\nDid I still get excited and decided to celebrate with a selfie? \n\nYes\n\nLemme see how long you guys have been in here for!",
        "created_utc": 1677864779,
        "upvote_ratio": 1.0
    },
    {
        "title": "My therapist made me change with a casual statement",
        "author": "Pass_the_Lasagna",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h7j74/my_therapist_made_me_change_with_a_casual/",
        "text": "She said what i already knew, but needed to hear apparently.\n\n'You won't get a better self esteem from coming here. You will get a better self esteem from actively stopping to bash yourself down and actively giving yourself positive affirmations instead. The wolf you feed. It's shitty but that's how it works.'\n\nSince then i actively try to stop it when the 'desperate victim self destructive' program is trying to take the wheel and try to be actively kinder to myself instead.\n\nI already feel better about myself.\n\nMaybe someone else needs to hear this too",
        "created_utc": 1677864723,
        "upvote_ratio": 1.0
    },
    {
        "title": "I reached 200 days on Reddit today!",
        "author": "conchis10",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h7f2y/i_reached_200_days_on_reddit_today/",
        "text": "[removed]",
        "created_utc": 1677864604,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the slickest thing you have done or seen somebody do on an airplane?",
        "author": "Necessary-Capital-92",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h7e8q/what_was_the_slickest_thing_you_have_done_or_seen/",
        "text": "On a flight from Denver to Dallas, I was in a first class seat. As the plane continued to board, an exhausted looking pregnant lady was passing me, I asked to see her ticket. She held it up with a confused look. I saw that it was an isle seat in coach. I said to her, “You have the wrong seat, that is my seat and I am in your seat.” I stood up grabbed my bag from the overhead and headed to her seat in coach, winking to the flight attendant. I saw that she was getting the lady settled in first class. A few minutes later, another gentleman from first class was dragging his bag aft. As he passed me, in a low voice he called me an A\\*\\*H\\*\\*\\*. I looked surprised, and he said, “I couldn’t let you be the only one”. Mid flight the first cabin flight attendant brought us both drinks and a snack. She thought what we did was great and she said the people we had given ours seats were really enjoying the experience and kindness, almost as much as she was.",
        "created_utc": 1677864579,
        "upvote_ratio": 1.0
    },
    {
        "title": "I reached 200 days on Reddit today!",
        "author": "conchis10",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h7a0c/i_reached_200_days_on_reddit_today/",
        "text": "[removed]",
        "created_utc": 1677864449,
        "upvote_ratio": 1.0
    },
    {
        "title": "I reached 200 days on Reddit!",
        "author": "conchis10",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h71x0/i_reached_200_days_on_reddit/",
        "text": "[removed]",
        "created_utc": 1677864199,
        "upvote_ratio": 1.0
    },
    {
        "title": "Today I reached 200 days on reddit!",
        "author": "conchis10",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h6wl3/today_i_reached_200_days_on_reddit/",
        "text": "[removed]",
        "created_utc": 1677864036,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made a synthwave/synthpop song about navigating emotional and psychological abuse. I hope you like it!",
        "author": "clem_zephyr",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h6mmq/i_made_a_synthwavesynthpop_song_about_navigating/",
        "text": " [https://open.spotify.com/track/07FlcI1kv5dx9NzXoNk5BY?si=34596741556c44f2](https://open.spotify.com/track/07FlcI1kv5dx9NzXoNk5BY?si=34596741556c44f2)",
        "created_utc": 1677863725,
        "upvote_ratio": 1.0
    },
    {
        "title": "why did we replaced black with person of color?",
        "author": "Inven13",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h6jn0/why_did_we_replaced_black_with_person_of_color/",
        "text": "As a black person myself I keep wondering why is it that a good amount of people use person/people of color to refer to black people, my guess is that it has something to do with respect or something but I still can't see how is it disrespectful to call a black person black if people still call white people white.",
        "created_utc": 1677863633,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think The Dick Van Dyke show has become my new favorite home sick show.",
        "author": "DickTooRadical",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h6iww/i_think_the_dick_van_dyke_show_has_become_my_new/",
        "text": "[removed]",
        "created_utc": 1677863611,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something that all people should feel at least once in their lives is the relief that you feel after putting to work something after you thought it was broken or doesn't work propperly",
        "author": "glez_fdezdavila_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h65e3/something_that_all_people_should_feel_at_least/",
        "text": "Longshort story: yesterday I built for the very first time a PC by myself. The thing is that when I turned it on it didn't display anything on the screen. My heart sank to the floor because I couldn't figure it out what could be casuing it, so since I did everything right I thought the Mobo could be broken and there was no one to help me but I only had to update the BIOS and even though it was a pain in the ass to do it everything went well. \n\nSince that experience left me tired as fuck I decided to continue today. I booted it up, installed windows but I noticed that the PC only detected one of the two RAM sticks, so after trying all that I could to make them work it still detected only one, and the feeling I had was something that I could only describe with [this](https://i.kym-cdn.com/photos/images/newsfeed/002/258/832/235.jpg) . After I started panicking because this meant either send the mobo or the Ram back to get a new one, It turns out that I wasn't fully pressing the sticks in the slots, because I knew that I had to apply force to install them but I was afraid of breaking them, but I can finally breath a sigh of relief knowing everything is ok\n\nBuilding PC for myself is something that I wanted to do but I hope that I don't have to do again in areally long time",
        "created_utc": 1677863218,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (F34) trying new habits to share with others on this sunny day, not a big thing but hopefully it can be useful for people.",
        "author": "VannaUri",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h5r0a/i_f34_trying_new_habits_to_share_with_others_on/",
        "text": "SABI, Small act big impact.\n\nThis is my third week doing it. Activities based on humanity to share with fellow workers at lunch time.  \nI'm trying to give free lunch to 10 random people. It's not big, but I know it can have an impact on those who are experiencing difficulties. I've also experienced where I can't go for lunch, for this experience I've had I try to share with those who may be experiencing it. I am grateful to have a good job, a good salary and a comfortable place to live.\n\nBlessed to bless.",
        "created_utc": 1677862698,
        "upvote_ratio": 1.0
    },
    {
        "title": "My passion is finally paying off",
        "author": "Pound-Brilliant",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h5kap/my_passion_is_finally_paying_off/",
        "text": "I am currently in high school, and after losing money trading for around 5-6 years, my last 5 stock trades have all been profitable and I finally feel like I made a decent amount. Im really into the stock market, and my research and lost money is finally beginning to pay off",
        "created_utc": 1677862264,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are Instagram thots so pervasive on reels?",
        "author": "stonetear2017",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h5666/why_are_instagram_thots_so_pervasive_on_reels/",
        "text": "So, I use Instagram reels for memes and stuff I can send to my buddies. But it seem and feels like IG is pushing thots and thirst traps a lot. One reel of it and your whole feed of reels is full of it. \n\nI try to actively hit not interested in all of them but I’m having a hard time removing them from my reels Lol. \n\nTo reset, I go to my shared meme reels and like a bunch of those",
        "created_utc": 1677861364,
        "upvote_ratio": 1.0
    },
    {
        "title": "i’m eating at a cafe and it is GOOD",
        "author": "KaleidoscopeMuch8270",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h543a/im_eating_at_a_cafe_and_it_is_good/",
        "text": "i’m watching my favorite movie, i’m comfortable, &amp; i’m eating really good. i don’t mean to brag i just never get to relax like this. \n\ni want to talk to everyone who sees this post. let’s get to know each other!",
        "created_utc": 1677861233,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some things that have delighted you recently?",
        "author": "gubb_maria",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h513e/what_are_some_things_that_have_delighted_you/",
        "text": "2023 has really had an eye-opening, lovely, and scary few months for me. (New relationship, diagnoses, and just general figuring out life stuff) Whenever I start to get too overwhelmed with work, with my close relationships, or just in general, I try to find time to reflect on what I can be grateful for. Recently, I've been delighted by so many things and it's really reminded me of the beautiful balance life is, difficulty and delight. \n\nI've been delighted by:\n\n\\-My cat, Scotch, bringing up a new toy in the mornings for me to throw. It helps wake me up and I love that he wants to play with me!\n\n\\-My sleepy girlfriend who, in her sleep, throws an arm over me and kisses my forehead &lt;3\n\n\\-Slow morning light in my room. Grateful to have a room and a warm bed to wake up in.\n\n&amp;#x200B;\n\nWhat has delighted you over the past three months?",
        "created_utc": 1677861045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you rather have a 4 day work week, but 2 of those days you have to be in the office, or 5 days but all virtual?",
        "author": "apikoros18",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h4vwj/would_you_rather_have_a_4_day_work_week_but_2_of/",
        "text": "[removed]",
        "created_utc": 1677860716,
        "upvote_ratio": 1.0
    },
    {
        "title": "DAE Cry from romance in movies or love songs…",
        "author": "harmonybrook",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h4u3t/dae_cry_from_romance_in_movies_or_love_songs/",
        "text": "[removed]",
        "created_utc": 1677860596,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does everyone actually have bad \"mental health\" or is just become a standard excuse for being standard lazy?",
        "author": "therantwriter",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h4h5t/does_everyone_actually_have_bad_mental_health_or/",
        "text": "While I empathize with this issue, many people are struggling with poor jobs, low wages, and whatnot.\n\nI also think a lot of people spend their whole day reading these memes about bad mental health and then keep using that as an excuse instead of just getting up, putting their phones away and getting to work. \n\nWould like to hear some thoughts and examples on this!.",
        "created_utc": 1677859763,
        "upvote_ratio": 1.0
    },
    {
        "title": "Update: I aced that science quiz!! 😝",
        "author": "mxry_13",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h4gvk/update_i_aced_that_science_quiz/",
        "text": "I was literally about to cry when my teacher was showing us our marks. My anxious self was about to break down. I was praying so much, it was insane. I’ve officially become the person that’ll get super upset if they don’t get above 80 on tests or anything. I’m just so proud of the progress I made so far!! 😭👏🏾",
        "created_utc": 1677859747,
        "upvote_ratio": 1.0
    },
    {
        "title": "People who work or have worked in Hollywood, how hard is it to make it there?",
        "author": "AssociationIcy98",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h429o/people_who_work_or_have_worked_in_hollywood_how/",
        "text": "I am an aspiring actress, I did theater 3 times and I always wandered what does it take to make it big …looks ? know the right people? All of the above?",
        "created_utc": 1677858768,
        "upvote_ratio": 0.99
    },
    {
        "title": "People who work or have worked in Hollywood, how hard is it to make it there ?",
        "author": "AssociationIcy98",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h3xrd/people_who_work_or_have_worked_in_hollywood_how/",
        "text": "[removed]",
        "created_utc": 1677858446,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just realised how much my family likes my best friend and it makes me so happy",
        "author": "jinlikesgin",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h3pai/i_just_realised_how_much_my_family_likes_my_best/",
        "text": "So, as the title say, I (F19) just realised how much my family likes my best friend (F18).\nAnd it somehow made me feel really happy! \n\nWe've only been best friends for about two years, but it's that type of friendship were we are at each others houses a lot of the time. Nearly daily. We just spent casual time together, reading, cooking, just talking. \nWe have the same big friend group, but also share the same 'small circle'. Her, her brother, our best friend and me. \nWe spent a lot of time with each other, and I'm on very good terms with her parents, having inside jokes and being welcomed into their house at all times.\n\nAnd today one of my sisters decided to step out of the family's plan for tomorrow evening (a crime dinner) and just sort of messed things up with the planning. And my mother immediately goes \"JinLikesGin, would you like to ask BestFriend to come with us?\" \nKeep in mind that it's a family dinner, and my family likes to keep things, well, within family at such matters. \n\nAnd it's so sweet and really made me happy. I'm will go over to hers soon to tell her, I know that she'll be so happy to hear that!",
        "created_utc": 1677857838,
        "upvote_ratio": 1.0
    },
    {
        "title": "My neighbor is loud as heck and I want to rant a bit",
        "author": "PolyethyleneLezBean",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h3p9a/my_neighbor_is_loud_as_heck_and_i_want_to_rant_a/",
        "text": "Don't get me wrong, I don't mind if they're just having friends over. The problem is, of all the places, they go to the damn student housing instead of any of the many cafes and hangout places. Like no kidding, there's so much places to hangout and be loud as they want throughout the campus road. But no no, let's be loud here, a place where people come to take a rest from the tiring life of uni student.\n\nThey're so loud that I can even hear them in my sleep. And I'm not going to let them justify about me sleeping earlier than others. It's a place to rest, not a place to be loud. I just don't understand their mindset really. What do they seek from that action? They sacrifice everyone living here just because they don't want to be in the crowd? What's wrong with going to cafes?\n\nAnyway, have you ever had experience like that? An obnoxious neighbor with a very questionable decisions?",
        "created_utc": 1677857836,
        "upvote_ratio": 1.0
    },
    {
        "title": "My neighbor is loud as heck and I want to rant a bit",
        "author": "PolyethyleneLezBean",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h3oqk/my_neighbor_is_loud_as_heck_and_i_want_to_rant_a/",
        "text": "Don't get me wrong, I don't mind if they're just having friends over. The problem is, of all the places, they go to the damn student housing instead of any of the many cafes and hangout places. Like no kidding, there's so much places to hangout and be loud as they want throughout the campus road. But no no, let's be loud here, a place where people come to take a rest from the tiring life of uni student.\n\nThey're so loud that I can even hear them in my sleep. And I'm not going to let them justify about me sleeping earlier than others. It's a place to rest, not a place to be loud. I just don't understand their mindset really. What do they seek from that action? They sacrifice everyone living here just because they don't want to be in the crowd? What's wrong with going to cafes?\n\nAnyway, have you ever had experience like that? An obnoxious neighbor with a very questionable decisions?",
        "created_utc": 1677857799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Undecided on going back to office or quitting.",
        "author": "iguanahugs",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h3kwu/undecided_on_going_back_to_office_or_quitting/",
        "text": "[removed]",
        "created_utc": 1677857520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you get alot talking about you getting married, by parents or others??",
        "author": "Sykolewski",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h36v2/do_you_get_alot_talking_about_you_getting_married/",
        "text": "[removed]",
        "created_utc": 1677856499,
        "upvote_ratio": 1.0
    },
    {
        "title": "being a teenage girl in Dallas",
        "author": "adoremone45",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h33dw/being_a_teenage_girl_in_dallas/",
        "text": "[removed]",
        "created_utc": 1677856238,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it bad to stick your face under faucet while brushing your teeth?",
        "author": "Susanburr",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h2atl/is_it_bad_to_stick_your_face_under_faucet_while/",
        "text": "Im wondering if it’s bad for my neck or can cause strains. I do this a lot while brushing to simply rinse my mouth. I know that a lot of people use cups so it must be strange for me to be bending over like that rinsing my mouth lol. Sometimes I get odd sore feeling inside my neck and whenever I eat food seems to get trapped on the side of my throat…",
        "created_utc": 1677854145,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (F30) just embarrassed myself over the phone lol",
        "author": "EerieQuerymyDreary",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h298d/i_f30_just_embarrassed_myself_over_the_phone_lol/",
        "text": "So I’m going on a trip tommorow to see my boyfriend and to check out Maryland before I move there. I wanted to leave a cute voicemail on his phone to tell him how excited I am to see him again. knowing he wouldn’t pick up so early in the morning and    Surprisingly, he picked up the phone. “Hey Jaxxe what’s wrong?”\nIm like, “ohh shit” \nSo completely embarrassing as I apologize for waking him up and told him to get some rest as he’s giggling while I’m stammering. \n\nLol",
        "created_utc": 1677854029,
        "upvote_ratio": 1.0
    },
    {
        "title": "wash your hands",
        "author": "ArtfulWizard",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h1s7l/wash_your_hands/",
        "text": "One of the casualties of COVID is \"happy birthday\".  The beloved song that we sing on this occasion has become an accelerated anthem.  Since COVID has passed and we now find ourselves not wanting to wash our hands for extended periods, we rush through the words at an accelerated pace.  The next generations will grow to think their special day is not a marathon, but a sprint.",
        "created_utc": 1677852791,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wash your hands",
        "author": "ArtfulWizard",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h1k1t/wash_your_hands/",
        "text": "[removed]",
        "created_utc": 1677852178,
        "upvote_ratio": 1.0
    },
    {
        "title": "Solo Lady Vacation - seeking ideas",
        "author": "Pencil_bun",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h188n/solo_lady_vacation_seeking_ideas/",
        "text": "Hi friends,\n\nAn idea has taken hold of me (F35): I'd like to take a short solo trip. A couple days to de-stress away from my family (M42, M1), preferably somewhere warm, preferably a direct flight out of DCA or IAD.\n\nI'm thinking hotel + beach + spa, maybe? I don't have ~~much~~ any past spa experience, but I think I'm in a mode where it might be just what I need. I'd also be willing to check out something yoga-oriented, or even a silent retreat. I'd generally like something calm, somewhere beautiful.\n\nThis idea is in its infancy, but I'd like to move on it before my motivation wanes. \n\nCan anyone make a recommendation? Or share a story of your own restorative solo trip? Or recommend a book to bring with me on said trip? If you're a spa person, what services would you recommend to a newbie who's not sure if it is her thing?",
        "created_utc": 1677851346,
        "upvote_ratio": 1.0
    },
    {
        "title": "Happy Birthday",
        "author": "ArtfulWizard",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h0zpz/happy_birthday/",
        "text": "[removed]",
        "created_utc": 1677850688,
        "upvote_ratio": 1.0
    },
    {
        "title": "Happy Birthday",
        "author": "ArtfulWizard",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h0yr8/happy_birthday/",
        "text": "[removed]",
        "created_utc": 1677850612,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should you do when someone is crying?",
        "author": "Stalinskayaaa",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h05kr/what_should_you_do_when_someone_is_crying/",
        "text": "So for some info, i'm a uni student and currently live in a dorm, for some time now i noticed one of my roommates would randomly start crying, most of the time is when we go to sleep witch isn't so bad cuz i can just ignore them and pretend it doesn't happend, but one time they kinda started tearing up beside me while i was on my computer and i had no idea what to do. I always hated crying and still do, i just can't understand how someone would not be ashamed to do that in front of others, don't get me wrong i get that people should not bottle up emotions and what not, but i can't help find it extremely unconfortable. My opinion aside, what would be a normal way of handeling that sort of situation so i don't become super awkward and do or say stupid stuff?",
        "created_utc": 1677848366,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just saw a bunch of kids playing \"Imaginary Among Us\" and it was the funniest shit I've seen this month!",
        "author": "JAR_2004",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11h0326/just_saw_a_bunch_of_kids_playing_imaginary_among/",
        "text": "So I always take the bus to return home from college.\n\nA few minutes ago, I saw that the bus was suddenly filled with a dozen elementary school children who were on a field trip alongside their teachers.\n\nAnd then the kids started playing what they called \"Imaginary Among Us.\"\n\nBasically one of the kids yelled: \"There's three impostors among us!\" and then five seconds later the same kid yelled: \"Emergency meeting! A body has been found!\"\n\nAnd for the next five minutes all the kids started accusing each other of being the impostor saying things like:\n\n\"Lizzy vented!\"\n\n\"No, Lizzy was with me doing tasks!\"\n\n\"I saw John at electrical!\"\n\n\"No, you're lying!\"\n\nExcept everyone was making everything up because they weren't playing the actual video game! They were iust yelling at each other while sitting on the bus and I was laughing so hard! Heck, they even accused a child of being the impostor for no reason, and that child defended himself saying he was dead and that he had been killed by the kid that had accused him! And remember...all of this was imaginary, none of them was playing the actual video game!",
        "created_utc": 1677848170,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you ever feel too bored to sleep?",
        "author": "Secure-Imagination11",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11gxzl7/do_you_ever_feel_too_bored_to_sleep/",
        "text": "I don't know how to explain this feeling, but it's 6am and everytime I feel sleepy my brain zaps back awake like I want to do something else. Maybe because my day off is tomorrow.",
        "created_utc": 1677841674,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does it feel like subreddits dedicated to cities sometimes just turn into paranoia/Nextdoor type situations?",
        "author": "FakeReceipt",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11gwhl7/why_does_it_feel_like_subreddits_dedicated_to/",
        "text": "There are several cities I like to sort of check on in Reddit, and many of them have like 70% of the time people reporting articles about crime/things-going-wrong/doomposting. Or weird random shit like \"did anyone hear a boom? was it a gunshot?? an explosion??\"\n\nI mean, fuck, Seattle for example has like 2-3 subreddits and they're all toxic and miserable as hell.",
        "created_utc": 1677835917,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get free Doge daily widraw to your wallet directly",
        "author": "Poisonivy-24",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11gwe8y/get_free_doge_daily_widraw_to_your_wallet_directly/",
        "text": "[removed]",
        "created_utc": 1677835559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chainmail armor seems incredibly useful during an apocalypse",
        "author": "No-Appointment-4929",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11gvzkk/chainmail_armor_seems_incredibly_useful_during_an/",
        "text": "If zombies or mutants ever became a thing, chainmail seems like it would be really good at keeping someone's teeth or nails from sinking into you.  Or thick leather. It just feels like people get infected in really stupid ways when some sort of armor coild have prevented that. But specifically chainmail seems useful. I feel like if something happened it would definitley be in style",
        "created_utc": 1677833970,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are we becoming more lonely with each passing generation?",
        "author": "GreasyPeter",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11gvxig/why_are_we_becoming_more_lonely_with_each_passing/",
        "text": "[removed]",
        "created_utc": 1677833744,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have this really bad habit of frequently changing numbers.",
        "author": "jus_vib1n",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11gvkzt/i_have_this_really_bad_habit_of_frequently/",
        "text": "As a child, I was very outgoing and my personality was very extroverted and sometimes childishly eccentric though I was generally liked I was also unpopular among many groups of people, I don't want to have any connection with those guys and feel a sense of relief knowing they have no way of contacting me. So I developed this bad habit of changing numbers in frequent intervals, mostly when I got new phones and it became a habit, I just didn't like the feeling that people who have disrespected me, made me feel expendable can just enter my future in any way and just hit me up one day like nothing happened.",
        "created_utc": 1677832383,
        "upvote_ratio": 1.0
    }
]