[
    {
        "title": "How do you see people who are taller than you?",
        "author": "regoshi73",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pp02v/how_do_you_see_people_who_are_taller_than_you/",
        "text": "I am someone a little tall in a country of small people and it bothers me to be taller and I feel that I make others feel bad and I would like to know if it is something I think or if it really makes people uncomfortable",
        "created_utc": 1678653137,
        "upvote_ratio": 1.0
    },
    {
        "title": "someone to talk about pens",
        "author": "regoshi73",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pomyx/someone_to_talk_about_pens/",
        "text": "[removed]",
        "created_utc": 1678652298,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just shaved part of my eyebrow on accident. I'm absolutely mortified",
        "author": "hueymayne",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pocly/i_just_shaved_part_of_my_eyebrow_on_accident_im/",
        "text": "I'm freaking out right now. I just was using my electric shaver and was trying to shave the middle part of my eyebrows and my hand got unsteady and I accidentally just shaved a little chunk out of my eyebrow. I'm literally mortified right now. It looks uneven and totally noticeable. I don't know what to do.",
        "created_utc": 1678651621,
        "upvote_ratio": 1.0
    },
    {
        "title": "BORED!",
        "author": "pro4tae",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11po788/bored/",
        "text": "[removed]",
        "created_utc": 1678651270,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would you define a classroom?",
        "author": "regoshi73",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pnmrd/how_would_you_define_a_classroom/",
        "text": "It's like a genetic fight, I mean, you're too young to know that there are study techniques, so your grades depend on your intelligence and not your abilities.",
        "created_utc": 1678649924,
        "upvote_ratio": 1.0
    },
    {
        "title": "Office workers who still go into the office to work, what is preventing you from working from home?",
        "author": "world_citizen7",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pnksq/office_workers_who_still_go_into_the_office_to/",
        "text": "Note: this post is geared towards people who have a job role that capable of working from home. So for example, not someone who is for example a network administrator that requires physically checking cables or hardware. Its a job that you can fully do from home.",
        "created_utc": 1678649793,
        "upvote_ratio": 1.0
    },
    {
        "title": "Went on a first date. Could be the one but she wears way too much makeup and hair extensions. I mean how do I tell her that’s kind of a deal breaker.",
        "author": "simms217",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pndx8/went_on_a_first_date_could_be_the_one_but_she/",
        "text": "So the top kind of explains it but I haven’t seen her without makeup on and without hair extension. She showed me how long her natural blonde hair was and down past her shoulders. I think she is way to beautiful to be wearing tons of makeup and colors her eyebrows. Help me out because it’s a deal breaker if I can’t lightly tell her she doesn’t need all of it.",
        "created_utc": 1678649359,
        "upvote_ratio": 1.0
    },
    {
        "title": "tips for socializing in a school environment",
        "author": "regoshi73",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pnatt/tips_for_socializing_in_a_school_environment/",
        "text": "I feel the classrooms as a survival of the best genetics, I mean, you are too young to learn study techniques so your grades will depend on your IQ and the same with genetics for sports and things like that.",
        "created_utc": 1678649154,
        "upvote_ratio": 1.0
    },
    {
        "title": "I started making music recently out of curiosity and I'm in love with my songs",
        "author": "iStretchyDisc",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pmufe/i_started_making_music_recently_out_of_curiosity/",
        "text": "This is not some sort of attempt to self-promote, as making music is a hobby of mine and very personal, if that makes sense.\n\nAnyway I got inspired to start making music within the past few months. Initially I did it bc I was bored but when I started making banger tracks I was hooked. (I know basic music theory btw.)\n\nI have like twenty (plus) songs and all of them are total bangers, in my opinion. They're all different genres but extremely catchy and nice to listen to. Some sound like they came from an indie game or a movie, others like something you'd hear in a club. I unironically listen my own these songs daily - added them to my Spotify playlist and everything.\n\nI guess you could say it's sort of an ego thing, but I genuinely think the songs are good, which is what brings me to listening to them.",
        "created_utc": 1678648104,
        "upvote_ratio": 1.0
    },
    {
        "title": "EN UN FUTURO DISTÓPICO ¿QUE PREFIEREN?",
        "author": "Aleking_1",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pmdrc/en_un_futuro_distópico_que_prefieren/",
        "text": "&amp;#x200B;\n\n1. Dar paso a una inmortalidad humana.\n2. Dejar las cosas así y esperar la extinción de nuestra especie.\n3. Dar paso al desarrollo de la ingeniería biológica (modificación de genes, hormonas y neuronas).\n4. Dar paso al desarrollo de la ingeniería ciborg (fusión del cuerpo orgánico con dispositivos no orgánicos).\n5. Dar paso a una nueva elite compuesta por vida inorgánica netamente.",
        "created_utc": 1678647045,
        "upvote_ratio": 1.0
    },
    {
        "title": "would you keep or return a new phone you got the same day you saw something traumatic.",
        "author": "FBRftw",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pm3g3/would_you_keep_or_return_a_new_phone_you_got_the/",
        "text": "So I can't post the story on this subreddit but if you do want to read it its on my profile.\n\nThis may sound very strange but I want to know what the average person would do in this situation.\n\nLong story short, I see the aftermath of a morbid car accident right after I bought my new phone. I just want to know what the average person would do. Would you keep the phone or would you return it/swap it out to avoid associating it with a bad memory?",
        "created_utc": 1678646385,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dress like you did when you graduated high school. Let's see who can guess...",
        "author": "JavaMamma0002",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pm0ob/dress_like_you_did_when_you_graduated_high_school/",
        "text": "I have never thrown a party for myself, with the exception of our wedding reception. I am having a \"Dress like you did the the year you graduated.\" \n\nI'll be wearing Jincos, halter top and DCs.",
        "created_utc": 1678646205,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm bored...",
        "author": "JavaMamma0002",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pls4b/im_bored/",
        "text": "[removed]",
        "created_utc": 1678645675,
        "upvote_ratio": 1.0
    },
    {
        "title": "Serious question: Would you keep a new phone you got the same day you saw something traumatic? (TW: gore)",
        "author": "FBRftw",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11plqor/serious_question_would_you_keep_a_new_phone_you/",
        "text": "This may sound very strange but I want to know what the average person would do in this situation.\n\nSo I got a brand new after many years of using an old piece of crap. I was super excited and couldn't wait to use it. On the drive home I see a blocked intersection and we are stuck there so I assume an accident just happened. I see a smashed SUV and a bicycle that is absolutely destroyed. I see many people getting out of their cars with a very concerned look and some people are even panicking. I see one of the people that were in the in the SUV breaking down in tears. At that point I knew something horrible happened. \n\nThey move the SUV and that's when I see it. I see the mangled body of a cyclist. Although I'm from a far, I see blood oozing out of his head on the pavement. This is my first time seeing a a dead person in such a graphic way. I immediately feel terrible ans depressed. Not only for the cyclist that was just enjoying a nice day on his bike not knowing it was his last but also for the driver of the SUV who is going to live the rest of their life with someone's death on their hands. \n\nThe remaining day I was depressed and spent the day with my family. Now it's the next day and starting at my unopened phone. I want to know other people's perspectives to see if they would go ahead and use the phone or would the return it/swap it out. Logically I know it doesn't make difference and it has nothing to do with it but I'm worried about associating it with that terrifying image and depression that followed.\n\nThank you for reading all this.",
        "created_utc": 1678645579,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you enjoy your daily life more and not have FOMO?",
        "author": "Cbsanderswrites",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pllhk/how_do_you_enjoy_your_daily_life_more_and_not/",
        "text": "I'm an easily dissatisfied person. When I lived abroad for 6 months, I missed my friends and people in the Midwest so much and couldn't wait to get back to normal life. Now, three years later, I want to move again. I'm mostly happy with my life and goals, plus my husband and I are about to try for a baby—so it's definitely not a great time to pick up and move! I'll need my people for this upcoming journey of parenthood. But I see so much on social media with people who are living in beautiful locations like Cali, Italy, New Zealand, etc. Even city apartments in NYC (though I would never want to live in NYC) give me FOMO like I'm really making the wrong choices in life. It gets hard to appreciate my flat Midwest area, especially in the winter. Summer is a bit easier. I live in a city where there's tons of concerts, trails to bike on, restaurants and bars to explore. \n\nAnywho—anyone feel the same or have any advice?",
        "created_utc": 1678645242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think you’ll be happy in the future?",
        "author": "CryptoNightjar",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11plhzl/do_you_think_youll_be_happy_in_the_future/",
        "text": "For me I've stopped living an imagined future where things are better for me.\n\nI don’t want to wake up someday and realize I missed out life as I kept dreaming about the future.\n\nDuring my life of 33 years, it seems like I was always convincing myself, that the next thing I buy, or the next instagram or reddit post I view, or the next relationship I have will make me happy. \n\nIt’s why I think we’re always scrolling online, why it’s like something is always missing, and it’s why I was convinced that the main ingredient of being happy was : ‘’The future’’\n\nLike everyone I am full of desires that I say will come someday. Someday this, someday that, somewhere, anywhere other than in the life I have now. \n\nLoving now is the opposite, it's knowing that life doesn't happen someday, it's happening right now regardless of what's to come.\n\nSo here I am, struggling to but paying my bills, talking to my grandmother everyday, writing, supporting art, and talking to you guys on reddit. \n\nIt’s not the dream life, but it’s the best life I have at the moment. And I’m inexcusably happy.",
        "created_utc": 1678645018,
        "upvote_ratio": 1.0
    },
    {
        "title": "When you hit on a girl you either get a girl or a funny story, so here I am",
        "author": "rocLeeroy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pl6z8/when_you_hit_on_a_girl_you_either_get_a_girl_or_a/",
        "text": "[removed]",
        "created_utc": 1678644287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi there!",
        "author": "Carefulife",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pl3zd/hi_there/",
        "text": "How's your life going so far? Tell me, what have you been up to lately? Have you done anything fun or exciting over the past few days or weeks? Maybe you tried a new restaurant or went on a fun adventure? I always love hearing about people's experiences and learning new things, so feel free to share whatever comes to mind!",
        "created_utc": 1678644092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi there!",
        "author": "Carefulife",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pl034/hi_there/",
        "text": "[removed]",
        "created_utc": 1678643855,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel lost...",
        "author": "Marx662",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pkiln/i_feel_lost/",
        "text": "Hi there... today I just wanna share my story while I listen to Linkin Park's album A Thousand Suns and I eat Maruchan. Today's my last day at the office, I quit my job because I couldn't get enough positive surveys from customers lately, that's the most important metric that we have. I worked as a Tech Support rep for one of the biggest tech companies in the world (I won't say its name, I will only say that it is a popular search engine). It is ridiculous how your technical knowledge does not matter at all to them, nor the rest of the skills rest that you have, our performance is based on the opinion/perception of people who do not know how to use their products. I feel hurt. I'm not the first one leaving because of this, I won't certainly be the last one. I didn't want to leave.. but I have to prioritize things, such as mental health, my University studies (I'm a Software Engineering student). I've got no family. I do have a few friends so I'm thankful. The girl that I'd had a relationship with for almost two years, she broke up with me yesterday. I've been drinking and crying every night for the last two weeks... yesterday was the first night I didn't drink until I got knocked out, in fact, I didn't drink at all. I already have a new job but after being on the top of the world, I don't seem to be able to approach it positively. I feel so sad, alone, betrayed, angry... I know I must keep going, but it had never been so hard...",
        "created_utc": 1678642716,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nutrition Hot Topics/Questions",
        "author": "Flow3rprincess",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pkg8x/nutrition_hot_topicsquestions/",
        "text": "I'm close to becoming a dietitian and I'm honestly just curious what most people have questions on regarding food/nutrition. Also totally open to hot takes",
        "created_utc": 1678642562,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't see the sizes of things sometimes.",
        "author": "unhinged-baker",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pkaf6/i_cant_see_the_sizes_of_things_sometimes/",
        "text": "Do any of you have weird or odd traits that are just head scratchers for you?\n\nSo, I used to work at a couple cafes and while there I realized I often could not see the sizes between small, medium, or large cups/containers. Like almost every time I literally had to hold them side by side to compare otherwise it was a 50/50 chance for me to put the wrong thing in someone's order.\n\nI don't understand why my eyes are like this. I do this with other objects too...but it's only not living objects. Like containers, even vehicles sometimes, occasionally buildings etc...",
        "created_utc": 1678642195,
        "upvote_ratio": 1.0
    },
    {
        "title": "I realized I don't need to always make grocery or shopping lists if",
        "author": "Leftshoulderguy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pk4hu/i_realized_i_dont_need_to_always_make_grocery_or/",
        "text": "[removed]",
        "created_utc": 1678641804,
        "upvote_ratio": 1.0
    },
    {
        "title": "Definition of a Boomer",
        "author": "IntroductionPast3342",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pk1ui/definition_of_a_boomer/",
        "text": "I'm a bonafide Boomer - born in the 1950s.  Boomers have always been the generation after WWII, born between 1946 and 1964.  Suddenly I'm seeing people in their 20s, 30s, 40s referring to themselves as Boomers - what the heck is with that?  Please, someone educate me!",
        "created_utc": 1678641632,
        "upvote_ratio": 1.0
    },
    {
        "title": "When you hit on a girl you either get a girl or a funny story so here I am",
        "author": "gooch-liker",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pjvu0/when_you_hit_on_a_girl_you_either_get_a_girl_or_a/",
        "text": "[removed]",
        "created_utc": 1678641239,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it weird that I’m bothered that my boyfriend has anime girls with big boobs on random stuff he has?",
        "author": "anrezee",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pjq76/is_it_weird_that_im_bothered_that_my_boyfriend/",
        "text": "For some reason I always attract anime nerds. Anyways ever since before I met him he had stickers of anime girls with big boobs/butt on stuff like his water bottle and I know he had one on something else in his house (I forgot what the item was). \n\n\nAnyways, yesterday he did a modification to his bike and he showed me it and to my surprise it was a very graphic anime girl with big tits and big butt. I felt bothered because my body looks nothing like that. I know it’s just my insecurity talking 🙁.",
        "created_utc": 1678640869,
        "upvote_ratio": 1.0
    },
    {
        "title": "DOES ANYONE ELSE REMEMBERS Y2K??",
        "author": "Karyote300",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pjoys/does_anyone_else_remembers_y2k/",
        "text": "[removed]",
        "created_utc": 1678640788,
        "upvote_ratio": 1.0
    },
    {
        "title": "A lot of non-controllable things are falling out of place",
        "author": "prakritikhu",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pj69o/a_lot_of_noncontrollable_things_are_falling_out/",
        "text": "Work things, plans with friends and family, weather and what not \n\nI'm in a deep spiral, running around trying to fix things and I'm really overwhelmed right now\n\nWhenever I get overwhelmed, it gets the best of me. I have a tendency to check everything tens of times and i just exhaust myself and I forget to put my energy to things I can control. \n\nCan someone talk some fucking sense into my head? \n\nMuch appreciated.",
        "created_utc": 1678639602,
        "upvote_ratio": 1.0
    },
    {
        "title": "People that work at graveyards",
        "author": "FrontProfessional715",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11piufj/people_that_work_at_graveyards/",
        "text": "[removed]",
        "created_utc": 1678638827,
        "upvote_ratio": 1.0
    },
    {
        "title": "When you realize your birthday sucks",
        "author": "behiindmyeyes",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pi9cx/when_you_realize_your_birthday_sucks/",
        "text": "It’s my birthdayy :)\n\nI decided to stay at home since I was super busy with school and I’m a very broke college student.\n\nI let my friends come over for a game night and it seems the night just got worse and worse. \n\nI won’t explain too much just know the night ended with me cleaning up a pile of chunky throw up—and it wasn’t even from me—\n\nThe carpet is kinda ruined too from the immense amount of water on it but yeah \n\nI feel like my social battery is at 2% and I just wanna be alone and sleep , happy birthday",
        "created_utc": 1678637435,
        "upvote_ratio": 1.0
    },
    {
        "title": "I like poking around free streaming apps more than the paid ones",
        "author": "redditloginfail",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11phn7j/i_like_poking_around_free_streaming_apps_more/",
        "text": "It's kind of like searching through a thift store.  When you find something good that you had been searching for at a bargain price, it's an extra thrill.  Beyond just the saving money, it's the fun of the hunt.\n\nIf I pay for a steaming app, I usually just watch the 2 good things on it then cancel it quick before it becomes a pointless drain.  It's kind of a rushed feeling, which I prefer to avoid.  Kind of like renting a VHS tape and then having to return it quick before you get all the late fees.\n\nWho else feels the same?",
        "created_utc": 1678635958,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self-love and healing includes taking back ownership of all the small things you once adored 🤍",
        "author": "wonderingwoman6",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11phkdn/selflove_and_healing_includes_taking_back/",
        "text": "There are 3 parts to it. I’ve been focusing on part 1 the most so far: things I love that are dear to me, that my ex frowned upon. Like listening to my favorite band and solo artist on full volume, cooking by my rules in my kitchen without his criticism in my ear, watching my favorite show that he could care less about. It could mean anything for anyone, so long as it’s something you loved which they didn’t appreciate.\n\nBut I’m coming to realize part 2 might just be a critical component to healing, if not more compelling than the first. What I mean is not shying away from the things you loved that your ex also liked, that you shared memories together over. I love this tomato seafood pasta, and he cooked it for us once which I’ll always remember. I couldn’t bring myself to eat the same dish, let alone cook it, for a long time. I would get those waves of sadness and break down. I gave in to the power he had on me and accepted that he robbed me of a source of joy, as little of a thing as it may sound. But I recently cooked that dish and felt the growth. I felt like I took back ownership and lifted this weight of feeling robbed. I’m trying to do the same in all aspects and make choices based on what I truly enjoy, rather than lying to myself and giving it to this lost relationship that should no longer hold me down.\n\nThe 3rd part is tapping into what it is that you may have loved at any point in this journey, but either didn’t realize it or give it the time of day. Maybe it’s a hidden talent or hobby, a knack for writing or poetry, a goal that’s been collecting dust on the shelf. \n\nWhatever it is that speaks to you in any of these 3 parts, I encourage you to explore that space and honor it. It will hurt for some time. It will feel silly or futile at times. It will even feel like you’re backtracking into the past. But it’s up to us to make the decisions, big and small, that shape who we are and no one can steal that right from us. Not today. Not ever. Please let me know your thoughts below! Love you, thank you, and always be unapologetically YOU.",
        "created_utc": 1678635761,
        "upvote_ratio": 1.0
    },
    {
        "title": "My sibling practicing bass in midnight",
        "author": "Bulldoginspace",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11phk6h/my_sibling_practicing_bass_in_midnight/",
        "text": "It was midnight and my brother was practicing bass in his room. I could hear it standing in front of my room. I told mum about it and she thought I was crazy. She said she couldn't hear any sounds(her room is further away from his room than mine) and was frustrated that I woke her up for nothing. The moment he heard our conversation he stopped playing. Only to start playing three minutes later. So I whispered to mum. She yelled to leave her room and his bass stopped again. I feel bad for our neighbors(we live in an apartment)",
        "created_utc": 1678635747,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Earthquake Survival Move",
        "author": "Few_Establishment287",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11phgr7/best_earthquake_survival_move/",
        "text": "\nI see earthquake \"emergency preparedness\" videos where in 1 example @hkworldjapan on insta posted them showing their earthquake simulator and said basically to hide under something. I googled and google said to do that same thing but I just had my own non educated possibly very dumb idea. I think buildings are likely the most dangerous place to be during an earthquake right? So assuming their was viable emergency exit method shouldn't the idea be to get out ASAP? \n\n\nSorry if this is a stupider question than I think but this really been making me scratch my head",
        "created_utc": 1678635510,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else get irritated aa fuck when people message you first (or plan something) and then say nothing at all?",
        "author": "StonedAnacondaMan",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11phg0m/anyone_else_get_irritated_aa_fuck_when_people/",
        "text": "For example when a 'friend' tries to act like they really want to chill with you after a long time, hits you up asking and then just continues to ignore you saying yeah sure or your subsequent messages for like a month... like at this point just fuck you, delete me. \n\nOr when someone messages you about something you have posted on Marketplace, asking if you still have it, you tell them you do, they just leave you on seen and say nothing again, even when you message them again... like fuck you. Don't waste my time and message me first about something you obviously don't want. If you didn't read the description, then you should have before messaging the person... if you changed your mind then simple say that, it isn't difficult; just show some respect and courtesy and let it be known, don't initiate a conversation and then just run away from it. \n\nI don't care who it is; the shit is disrespectful and annoying. It isn't like I went out of my way to message you first.",
        "created_utc": 1678635460,
        "upvote_ratio": 1.0
    },
    {
        "title": "My grandma just died and it’s not as devastating as I thought it would be",
        "author": "CannolisRUs",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ph0b0/my_grandma_just_died_and_its_not_as_devastating/",
        "text": "She has been on her way out for a while now, she had a stroke 3 years ago. She recovered from that incident, but my family wanted her in a nursing home so if it ever happened again someone would always be around to take her to the hospital. In those nursing home years I spent a decent amount of time visiting, but it was always sad how at the end of the day it was all the same, her family would say goodbye and see her next time. \n\nLast night she had a heart attack and died immediately. It’s sad, and I know it hurts even worse for my mom and her siblings, but I’m glad my grandma is finally at peace because I can’t imagine nursing home life being that great. \n\nI’m the youngest grandson, and she was the last surviving member of her 12 brothers and sisters. It’s almost done full circle type shit that she died hours before my birthday. Like the oldest in the family dying on the birthday of the youngest weirdly seems fitting. I’ll definitely remember it. \n\nI’ve always been a “celebrate life” type of person instead of “mourn death”. Although it’s worked for me, the only person in my life to die was two good friends, so I’ve been fortunate enough to not have to do much mourning. But it’s sad to think that my grandma is the first of a long road of death in my family. Hopefully not for a while, but my aunts and uncles and parents are getting older.\n\nAnyways I’m just rambling now. Funny just last night I was watching a show where a bunch of friends had a “send off” for their dead friend and one character said “well if we keep moping around they’ll be too worried to move onto the afterlife, so cheers”",
        "created_utc": 1678634363,
        "upvote_ratio": 1.0
    },
    {
        "title": "Overthinking",
        "author": "Constant_Sun_3314",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pgte4/overthinking/",
        "text": "[removed]",
        "created_utc": 1678633894,
        "upvote_ratio": 1.0
    },
    {
        "title": "I use Spreadsheet to keep track of my daily activities now",
        "author": "heisei",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pgs1i/i_use_spreadsheet_to_keep_track_of_my_daily/",
        "text": "Ever since I gave birth my memory has become worse. I decided to keep track of what I bought, how often I bought detergent  , how often I cleaned cat water tower and so on. It helps me a lot to visually manage my activities and prepare things beforehand. I don’t know how to call it better. For example I see that I have changed the water filter for 2 months ago and need to buy new one again for cat fountain.",
        "created_utc": 1678633808,
        "upvote_ratio": 1.0
    },
    {
        "title": "sort of messed up a math exam",
        "author": "Clean_Elevator_2247",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pgi5s/sort_of_messed_up_a_math_exam/",
        "text": "Mess up would be a strong word, but I was expecting a 100 and I was super confident with my preparation and the test went amazing and I was convinced that I'll get a centum, this is my school's final year's final math exam and I wanted to be school topper. But i messed up an integration question, all steps were right but i forgot to multiply a constant while substituting, I'm not one of those \"my life is ruined coz of this paper\" person but man I could've easily gotten a 100, a 99 is good enough eh?",
        "created_utc": 1678633160,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some of your funniest 'whoops I misspoke' moments?",
        "author": "Slagathor4321",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pghrz/what_are_some_of_your_funniest_whoops_i_misspoke/",
        "text": "Yesterday my boyfriend had asked me where we would find a step ladder that would reach our vaulted ceiling. I was trying to say 'home depot or lowes' but what came out was 'hoe's'. \n\nWhat are some funny ways you have misspoken?",
        "created_utc": 1678633133,
        "upvote_ratio": 1.0
    },
    {
        "title": "What bad memories form your gaming time I want to forget?",
        "author": "BoudicaandHozoinfan",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pgfyf/what_bad_memories_form_your_gaming_time_i_want_to/",
        "text": "For me it's just the rage from darkest dungeon, I remember raging that game during it's release which cause a fuss among my parents TBH, and it took 1 month for me to delete it. \n\nBut then I decided to try more RNG games like DD, yeah can it's kinda a fuss, and that's where I found another one I need to forget : Gacha.\n\nIt took like this year to wake me up, after another rage from a game that has some DD flashbacks. Yeah quite unpleasant.",
        "created_utc": 1678633002,
        "upvote_ratio": 1.0
    },
    {
        "title": "Multitarea",
        "author": "RicBeSa2023",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pfyh7/multitarea/",
        "text": "[removed]",
        "created_utc": 1678631705,
        "upvote_ratio": 1.0
    },
    {
        "title": "The internet cookbook",
        "author": "Who4114",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pfvv7/the_internet_cookbook/",
        "text": "It sounds odd but I had an interesting idea. I want to make a recipe book with recipes from internet strangers. One limitation is it can't break the bank.\nI want breakfast, lunch, dinner, and dessert. So put a link to your recipe in the comments or type the thing out.",
        "created_utc": 1678631502,
        "upvote_ratio": 1.0
    },
    {
        "title": "Casual convo",
        "author": "No_Education_9879",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pfrbu/casual_convo/",
        "text": "[removed]",
        "created_utc": 1678631161,
        "upvote_ratio": 1.0
    },
    {
        "title": "Casual conversation",
        "author": "No_Education_9879",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pfp9h/casual_conversation/",
        "text": "[removed]",
        "created_utc": 1678631003,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you guys think Thumbelina is a good baby name?",
        "author": "isasmellz",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pflma/do_you_guys_think_thumbelina_is_a_good_baby_name/",
        "text": "My brother and SIL are naming their new baby, my niece, Thumbelina. \n\nMy mom told me months ago that SIL loves the name Thumbelina, but feels kind of embarrassed and probably won’t do it.\n\nSIL sent a text in the group chat with the sonogram and said “meet baby Ellie!!” And i was like aww Ellie so cute! Then she told me later that Ellie is short for Thumbelina. \n\nI just kind of hate it and think it’s…absurd?  Seems like a hard name to age into? \n\nI want to open the dialogue with you all. Maybe I will gain a new sense of historical understanding. It’s whimsical, I’ll give it that.",
        "created_utc": 1678630722,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your favorite all-you-can-eat food?",
        "author": "Starfoxmarioidiot",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pfkag/whats_your_favorite_allyoucaneat_food/",
        "text": "I’m having some health problems and I can’t eat like I used to. I’m fantasizing about the all you can eat shrimp at Sizzler. So gross. So greasy. So tasty. I’ve never been a big eater, but not having the choice at the moment makes it more appealing to just pig out.",
        "created_utc": 1678630616,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moved my family of 3 to a new state without family or friends around.",
        "author": "Every-Formal-5157",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pfjmz/moved_my_family_of_3_to_a_new_state_without/",
        "text": "[removed]",
        "created_utc": 1678630566,
        "upvote_ratio": 1.0
    },
    {
        "title": "I viewed my crush’s LinkedIn profile with the anonymous setting off and then deleted account - will they see that I was the one who viewed?",
        "author": "marshmellomusique",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pffkj/i_viewed_my_crushs_linkedin_profile_with_the/",
        "text": "I’m embarrassed and don’t want them to know I viewed his profile, but it doesn’t necessarily mean I like them right? I see them at work and it’s hard to read what they’re thinking, but it’s better to keep romance out of the workplace?",
        "created_utc": 1678630256,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Thumbelina a good baby name?",
        "author": "isasmellz",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pffhu/is_thumbelina_a_good_baby_name/",
        "text": "[removed]",
        "created_utc": 1678630251,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switches and switchboards",
        "author": "schleepydawg",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pff4u/switches_and_switchboards/",
        "text": "I’m a 24 year old person, and in my country it’s quite normal to live with your parents until you have to move out for job/marriage to a different city. I’ve lived in the same house all my life, and now my parents, nearing their 60s want to upgrade the house. They want to make it more modern, more classy, you get the likes.\n\nI get it, the house is old. The interiors are old. But man I hate the change. It’s like my house is losing its personality. They’re changing things I grew up with. Today, my mom decided to call a guy and change all the switchboards in the house. The old ones were tiny, grey switches with a huge separate regulator. Now they switches are big and white and swanky and cool but I absolutely hate them. One of old the switchboards had two switches - one for the light inside a room, and one outside. The new switchboard has reversed the switches and that just made me cry. I can’t even rely on almost 25 years’ worth of muscle memory in my own house. I know it’s their house more than it is mine. I know change is good. I know this is prettier looking. But god it’s like somebody is tearing apart every single quirk of my house and turning it into something different. \n\nI know I’m too old to be feeling sad about something so stupid, and I guess that’s why I’ve come to internet strangers and haven’t gone to anyone else. Sorry for the rant.",
        "created_utc": 1678630224,
        "upvote_ratio": 1.0
    },
    {
        "title": "OUPS WRONG WAY",
        "author": "just_an_introver",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pfbvh/oups_wrong_way/",
        "text": "[removed]",
        "created_utc": 1678629966,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I respond to a guy who keeps asking me to meet one on one and isn’t respecting my boundaries?",
        "author": "povlookingforlove",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pf275/how_do_i_respond_to_a_guy_who_keeps_asking_me_to/",
        "text": "He used to be a friend that I confided in until he yelled at me for kissing my guy friend who he “hates”. He trespassed into my locked bedroom (to drop off something I asked for back) when he stayed at my place when I was out of town. He also left a handwritten note and wine. He keeps asking to meet one on one when he visits, whereas I haven’t initiated for years and even didn’t respond once. I’ve also invited others to join for a previous one. I haven’t replied to his most recent request to meet and he can see that I’ve read the message. Should I still reply? Or just say I’m busy? Is there a way I can express that I have zero interest like calling him a “bro” or “dude”? But I also don’t want him thinking we’re close enough to even be bros or anything that’ll encourage him. Thank you!",
        "created_utc": 1678629206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Religion Scares Me",
        "author": "ThatSapphicLesbian",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pey62/religion_scares_me/",
        "text": "[removed]",
        "created_utc": 1678628886,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daylight savings…",
        "author": "prismaticintellect",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11peuyx/daylight_savings/",
        "text": "🎶🎶 It’s the most miserable day of the yeeeeeaaaaaarrr 🎶🎶\n\nAnyone else not the biggest fan of today? I’m an early riser, and it’s still a struggle once the time shifts.",
        "created_utc": 1678628626,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ever got to the stage of “everything that can is going wrong in my life” where all you can do is laugh about it?",
        "author": "officepancakes",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pet80/ever_got_to_the_stage_of_everything_that_can_is/",
        "text": "I think I’ve just sprained my ankle while walking normally. Not twisted it moving too quickly, or landed at a bad angle while distracted as I’ve done before, this time I felt a pop and immediate pain in my ankle during a normal step on flat tiles on a path in my home I traverse dozens of time a day.\n\nThe last 2 months have been so gruelling physically and mentally that this is just amusing at this point",
        "created_utc": 1678628479,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's crazy how ChatGPT can adapt its responses to explain the same thing to a five-year-old, an academic scholar, in binary code, and even capture a celebrities unique style of talking.",
        "author": "sunghooter",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pe7ud/its_crazy_how_chatgpt_can_adapt_its_responses_to/",
        "text": "[removed]",
        "created_utc": 1678626669,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two things happened to me today..",
        "author": "mrpessimistik",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pe469/two_things_happened_to_me_today/",
        "text": "[removed]",
        "created_utc": 1678626360,
        "upvote_ratio": 1.0
    },
    {
        "title": "Keep me up?",
        "author": "General_Worth8251",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pd6nl/keep_me_up/",
        "text": "Tldr, i couldnt help but stay up until 2 last night. Unfortunately it was also daylights savings time, so that mean 2am suddenly became 3 and i woke up at 6 cause my body's used to doing so.\n\nThat being said in order to get enough sleep im going to have to stay awake for most of the day until later this evening to get a goodsnights sleep.\n\nAnyone willing to help me stay up? We could make deep conversation or play a few games. I just need to stay awake and some interaction could help with that.",
        "created_utc": 1678623398,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I translate reddit posts and comments to other languages?",
        "author": "Canigetmynickname",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pcxwd/how_do_i_translate_reddit_posts_and_comments_to/",
        "text": "My friend is new to reddit and he doesn’t really know english.\n\nHow can I make his reddit workflow easier for him?\n\nIs there a way to translate text on reddit immediately without going to google translator?",
        "created_utc": 1678622598,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it a good thing to purposely forget something? and is it difficult?",
        "author": "BoudicaandHozoinfan",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pcx1y/is_it_a_good_thing_to_purposely_forget_something/",
        "text": "Just want to ask this?\n\nEven though if that memory was a non-harmful one but something that makes you uncomfortable, is it okay to forget it?\n\nAnd how difficult it is to forget?",
        "created_utc": 1678622523,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Reddit feed just had 12 ads in a row.",
        "author": "Smokeysquirrel0",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pcsye/my_reddit_feed_just_had_12_ads_in_a_row/",
        "text": "[removed]",
        "created_utc": 1678622168,
        "upvote_ratio": 1.0
    },
    {
        "title": "今週はお仕事でしたが、風邪気味でした。",
        "author": "nom-non",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pcic3/今週はお仕事でしたが風邪気味でした/",
        "text": "[removed]",
        "created_utc": 1678621113,
        "upvote_ratio": 1.0
    },
    {
        "title": "I finally completed the Augmented Reality missions on Batman Arkham City.",
        "author": "Somerandomdickhead",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pc7cx/i_finally_completed_the_augmented_reality/",
        "text": "Yes, i’m aware this game came out 13 years ago and yes i’m aware everyone else that’s played it has long since finished it.\n\nBut I can’t tell you the pain I went through to get these done, it was on/off 6 months of failure and no sign of improvement until today when I somehow fluked it. I can think of maybe only 2 other times when I felt the relief I did beating these missions.\n\nI know most people probably think that “this is just a video game who cares?” After going through what I went through, I care and I want to let people know I did it.\n\nThank you for letting me brag about my accomplishment.",
        "created_utc": 1678620012,
        "upvote_ratio": 1.0
    },
    {
        "title": "I will never be anyone's first choice",
        "author": "only-_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pbpph/i_will_never_be_anyones_first_choice/",
        "text": "I just realised that I have never been anyone's first choice. No one has ever made a plan or cancelled a plan just because I'm not there not has anyone asked me first or even second for that matter if they want to go out , i have always been the last person to be asked. This is not an ego thing or anything, it's just that no one has ever wanted me anywhere if I'm there fine otherwise also it's fine. \nI have had soo many friendship heartbreaks. Even when what the other person did the most cruel thing to me , i strive not to ever hurt their feelings in the slightest and those people never seem to be guilty about their actions either. I'm just there for people to hurt and be their support when they have nowhere else to go.\nI'll never ever be anyone's priority.",
        "created_utc": 1678618267,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think life is worth living no matter what?",
        "author": "Totallynotshaft",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pbkk5/do_you_think_life_is_worth_living_no_matter_what/",
        "text": "[removed]",
        "created_utc": 1678617752,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've learned that no food can taste better than your first piece of food after 24 hours of not eating",
        "author": "wt_anonymous",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pb1sz/ive_learned_that_no_food_can_taste_better_than/",
        "text": "Bit of a story:\n\nThree years ago around this time of year, I woke up very ill one day but didn't stay home anyways. I was in pain and very naseous, just looking at food made me want to vomit. And it only got worse as the day went on which I wasn't expecting (it wasn't so bad in the morning, thought I was just tired). So I didn't eat anything the entire day. I also didn't eat dinner the day before (fell asleep early), so I was running on fumes really.\n\nEventually around 6pm I finally went to a urgent care as I felt absolutely miserable. I was very, very constipated but that's not really important. On the way out of the doctor's office, I actually passed out from stress, hunger, and pain. I really didn't feel hungry at that moment though, my stomach just hurt.\n\nThey wheeled me back into the doctor's office and called an ambulance for me. While I was there, they asked if I had eaten which I said no. And they tested my blood sugar and it was pretty low. So they gave me some keebler cheese and peanut butter crackers. \n\nI've had keebler crackers before, they're alright. But these were no ordinary crackers. It felt like I was eating god's own personal crackers. They were so amazingly good after having not ate in so long. It almost immediately kick started my hunger again and I felt *extremely* hungry, like I was a recently awoken zombie, which sucked as I wasn't able to eat for the next four hours as they took me to the hospital (and didn't let me finish the crackers) (:",
        "created_utc": 1678615863,
        "upvote_ratio": 1.0
    },
    {
        "title": "Took me 50 years to get it",
        "author": "ChristostomosPrime",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11pajo4/took_me_50_years_to_get_it/",
        "text": "Is it a common thing among those of you who would know, to experience a period of un-anticipated, unsolicited, maturity in your 50's. A kind of feeling of thankfulness of a true view of life, and your place in it. When it started happening to me I was touched by moments of joy that had no root cause on earth, but a sense of understanding of the world around me. Without detailing every thought these moments grew into feeling of thankfulness that changed my life, for the better. So is this a common theme in the aging process?? What's next that I don't know about???",
        "created_utc": 1678614074,
        "upvote_ratio": 1.0
    },
    {
        "title": "Enjoying working on my hobbies is more engaging and fun that online dating.",
        "author": "adrock_99",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p9xnv/enjoying_working_on_my_hobbies_is_more_engaging/",
        "text": " I thought better work on things in real life, wasted too much time online dating without much success. While I do feel I miss on the companionship part of life, working on my hobbies of cooking, writing and skateboarding really make me for connected to real life stuff. I think abandoning hope of other liking me sounds bad on paper, but puts more importance on doing things without the help and approval of others. \n\nI have wasted to much time wanting people or friends to say good stuff and giving approval. I even was that friend who was the plan maker and wanting everyone to come join me in doing things. Not anymore. It's not that I don't care for others, but I wanna be valued for my contribution or at least also be asked by others to join them in doing stuff. But I stopped all that and have been doing things alone, It does feel I am way connected to things that ever before. Hope am able to do the same in the future.",
        "created_utc": 1678611795,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I just had my first experience with sleep paralysis",
        "author": "CardinalCoder64",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p9hrx/i_think_i_just_had_my_first_experience_with_sleep/",
        "text": "It was scary. Happened just minutes ago.\n\nMy eyes were open, I could see the room clearly. However, I couldn't move my neck to look around, neither could I move my body. I've heard that people see \"black figures\" in the room they're in during sleep paralysis, but I didn't see any. Instead I heard noises. Like thousands of fuses breaking and a lot police sirens. It sounded like it was coming from outside. I wanted to get up to see what was going on, but I couldn't move. This was a telltale sign that I was in sleep paralysis, and once I finally realized it, I remembered a trick to break me out of it, which is to move my toes. So I did, and oddly enough, it worked. The loud noises disappeared and my body \"woke up\". After I broke out of it, I had to remind myself where I was at. It was a rather frightening experience.\n\nHas anyone else experienced sleep paralysis? If so, what was your experience?",
        "created_utc": 1678610072,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learn and Enjoy",
        "author": "E-KingHiTech",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p94se/learn_and_enjoy/",
        "text": "[removed]",
        "created_utc": 1678608649,
        "upvote_ratio": 1.0
    },
    {
        "title": "im going insane",
        "author": "Head-Media8128",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p8jad/im_going_insane/",
        "text": "why do i only want attention and a love story from older guys i know it’s wrong and stupid and unrealistic but i think i need to delete tiktok or something PLZ someone help why do i feel this way",
        "created_utc": 1678606347,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it even possible to cultivate meaningful relationships and social circles anymore?",
        "author": "BeefPho-",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p8as3/is_it_even_possible_to_cultivate_meaningful/",
        "text": "I’m not even specifically talking about dating here although it’s included, but in general it feels like todays society is slowly devolving and quite frankly I’m very worried. \n\nSeems like everyone carries this mentality that everyone is disposable at anytime for any reason. People don’t know how to communicate anymore, run when there is even the slightest issue and have absolutely no problem completely deleting multi-year friendships out of thin air like it never happened. \n\nI also work in the customer service/sales industry and do very well financially, but something I’ve noticed in this field is that everyone is socially awkward. \n\nGranted I live in the US and maybe the culture is different in other places, but long story short, I’m sick of it here. I’m sick of the way people are treated and how we treat each other. No one gives a shit about anyone but themselves and being courteous and professional just don’t exist anymore. \n\nEven when I went to the Jack n the Box tonight after work for a quick lazy meal, the drive through lady didn’t say a word to me. No hey how’s your night going, no confirming my order, didn’t even say thank you after I said thank you for helping me….literally not a word. Granted she could of been tired, but good grief, not a single word? \n\nI want to move out of here, but I have no idea where I’d go. All I know is I’m certain social media and the internet is partially responsible for todays collapsing social skills, but how do we fix it or at least prevent it from getting worse?",
        "created_utc": 1678605504,
        "upvote_ratio": 1.0
    },
    {
        "title": "u/オート様 Thank you about[ wellCome Message ] , back to me.",
        "author": "nom-non",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p855o/uオート様_thank_you_about_wellcome_message_back_to_me/",
        "text": "thank you , these`s. \nI like Viedo Game. Sure I player , too.\nIf yours want to getting about Fantasy Game Because, Please back to me,or I send to wright URL.  sure I want to getting to try Email Friends.",
        "created_utc": 1678604958,
        "upvote_ratio": 1.0
    },
    {
        "title": "Funny Viral Video",
        "author": "E-KingHiTech",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p7sly/funny_viral_video/",
        "text": "[removed]",
        "created_utc": 1678603739,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why I can't forget the bad memories of my gaming?",
        "author": "BoudicaandHozoinfan",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p7jwd/why_i_cant_forget_the_bad_memories_of_my_gaming/",
        "text": "Why there's still some memories of the game I've dropped even though I not part of the community or anymore?\n\nI feel like it's like a scar or some sort of trigger switch",
        "created_utc": 1678602889,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wanna give a boy flowers on our first date",
        "author": "JustChaiMeMF",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p739z/i_wanna_give_a_boy_flowers_on_our_first_date/",
        "text": "I matched with a boy on feeld, and I was about to go on vacation so we decided to meet after I get back. We’ve been texting and calling now for almost two weeks and I’m totally smitten! He seems absolutely perfect for me, and he’s said to me he really appreciates effort from his dates since he’s a big romantic and is usually the one to make cute plans, give gifts, etc. \n\nWhile we’ve chatted, he’s mentioned a reason he likes me is how I’ve talked about the ways I like to be sweet to my partners/would be sweet to him, so I want to really show him that I’m not just all talk and make our first date special :) \n\nHe’s already said he’d like to make plans for what we’d do, so I think bringing him a gift like flowers would be cute and make him blush. He’s said he likes floral scents and the colors orange and pink, he hasn’t said he likes flowers specifically, but I think he’ll appreciate the gesture even if it’s not his ideal gift - I’d rather it be a surprise than make it perfect, I figure more meaningful gifts can come when we know each other better. \n\nI’ve been thinking a lot about how I’d do it. I’ve never gotten flowers on a date myself, and to some people, holding flowers the entire date could be cumbersome, but it’s also cute and a reminder of the gift throughout the date (as long as it’s not raining too much hopefully, lol). I also thought maybe I could keep them fresh in some damp paper towels in my car and give them to him at the end of the date, but idk, feels a little bit less romantic to me. Maybe I could give them to him and then offer to leave them in the car? That might be the best bet. \n\nHave you ever given gifts on the first date with someone before?",
        "created_utc": 1678601331,
        "upvote_ratio": 1.0
    },
    {
        "title": "Home alone for the first time in years and I'm terrified!",
        "author": "polnareffs_chest",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p6yay/home_alone_for_the_first_time_in_years_and_im/",
        "text": "I'm visiting back home and my family is out of town for the night. It's just me and my two dogs and I'm TERRIFIED. I am used to living with roommates so I'm never completely alone. Even when they're gone I have neighbors a wall away in my apartment. Being in a house with no people directly nearby is freaking me out, plus I've been reading horror movie synopsises lately so I'm thinking about all the scary creatures that could get me and things that could happen. Any tips or advice or anyone else out there who's a big baby like me? It's dark now which adds to the fear since during the day I was fine",
        "created_utc": 1678600881,
        "upvote_ratio": 1.0
    },
    {
        "title": "The funniest video I've ever seen was removed from youtube years ago, I just found it again",
        "author": "THEYCALLMETYTY",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p6duu/the_funniest_video_ive_ever_seen_was_removed_from/",
        "text": "[https://web.archive.org/web/20170709223653/https://www.youtube.com/watch?v=J1\\_\\_EFqSJng](https://web.archive.org/web/20170709223653/https://www.youtube.com/watch?v=J1__EFqSJng)\n\nNSFW warning, only 5 minutes long and pretty disgusting but I have never laughed harder",
        "created_utc": 1678599058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cute SO stories?",
        "author": "fluffrito",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p5txd/cute_so_stories/",
        "text": "My gf and I are breaking up due to unlucky circumstances, and as much as its going to hurt its the only way forward. What are some cute stories you have about your SO or how you met? Need to have hope for something again in the future :)",
        "created_utc": 1678597331,
        "upvote_ratio": 1.0
    },
    {
        "title": "I almost got mauled by a friggin Bear",
        "author": "Ijustbechillaxing",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p5ivf/i_almost_got_mauled_by_a_friggin_bear/",
        "text": "It was my family’s first camping trip, in California bear country somewhere and we had no idea what we were doing. \n\nIt was the second night and I had to take a pee but I didn’t want to walk all the way to the little toilets on the campsite. So I walk and do my business in front of the tent. \n\nOnce I’m done I go to lay back down and within five seconds I can see the silhouette of a big ass bear walking in front of the tent.\n\nI went to sleep but when I woke up the next morning my dad(who slept in the car to honk the horn and scare them away) says, “yea I saw them watching you, I was gonna yell but you got in just in time”. \n\nNow I just think about how I almost got my stomach ripped open trying to take a piss.",
        "created_utc": 1678596375,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird how fast time flies? People growing up etc..",
        "author": "herrylilo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p5ege/weird_how_fast_time_flies_people_growing_up_etc/",
        "text": "It feels like just yesterday I was on tumblr with some only friends I met doing tinychats and webcam groups, some posts are still on tumblr of all of us, we all lost contact years ago, I was 15 at the time and the posts on there are from 2011 now.. every person who liked the post of us all was part of our friend group and it’s so weird seeing their last time posting on tumblr being 2013 some 2015 some as late as 2018.. I’ve stalked some of these people and they are just totally different, it’s weird how fast people grow up and move on from everything and everyone, anyone else feel this way? I’m 30 now and have been sick the past 5 years with multiple ailments , in and out of surgeries so I’ve done literally nothing thus far which is unfortunate, but seeing all these people as full on adults now it’s just weird to me, nobody really even talks anymore and I remember a time where we would run to our computers after school and group chat until the next morning, it’s so sad.",
        "created_utc": 1678595990,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it just me or is the lastest season of You just...not good?",
        "author": "ProtocolPro23",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p5ba4/is_it_just_me_or_is_the_lastest_season_of_you/",
        "text": "Like the previous seasons I would legit get upset when he or Love killed someone that got in their way. The story and character development was on point every season and I was deeply invested.\n\nThe lastest season I do not care about any of those rich people or what happens to them.\n\nIf its not just me, can you discuss why you like this latest season? Maybe ive missed something.",
        "created_utc": 1678595699,
        "upvote_ratio": 1.0
    },
    {
        "title": "Buying weed legally",
        "author": "FoodNood",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p5b0w/buying_weed_legally/",
        "text": "[removed]",
        "created_utc": 1678595677,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reddit could be the death of us all?",
        "author": "lilFireMermaid",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p58wd/reddit_could_be_the_death_of_us_all/",
        "text": "Imagine you’re a writer for Black Mirror and you’re about to write a new episode. This episode must involve Reddit in a substantial way. \n\nWhat do you write?",
        "created_utc": 1678595480,
        "upvote_ratio": 1.0
    },
    {
        "title": "What song are you listening to?",
        "author": "flowerhoney10",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p4p3h/what_song_are_you_listening_to/",
        "text": "I'm just curious to see what everyone's listening to; maybe we have the same taste, or I'll find some new music.\n\nThe song I'm listening to is the 1977 jazz fusion classic \"Birdland\" by Weather Report.",
        "created_utc": 1678593811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free Software for Windows 11",
        "author": "Aksharmultiservices",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p4ecy/free_software_for_windows_11/",
        "text": "[removed]",
        "created_utc": 1678592930,
        "upvote_ratio": 1.0
    },
    {
        "title": "Head phone",
        "author": "First_Agent_9566",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p4dlh/head_phone/",
        "text": "What is your favorite way to listen to music on your phone? I know it's different for IPhone and Android users. As in ear piece/head phone type of way obviously. I love my old school Android with the wires hanging down that gets caught on everything.😂😂 \n\n\nYeah yeah I know what your thinking... I'm not trying to have a debate about what type of phone is better. \n\nI love them both but rather have an android. Don't hate. I'm only one person. It's not gonna make a huge deal that I rather not have an iPhone even though I know prettyuch every one rather have that.",
        "created_utc": 1678592867,
        "upvote_ratio": 1.0
    },
    {
        "title": "My dad thinks everyone should love knowledge like he does",
        "author": "skyrimlo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p46rl/my_dad_thinks_everyone_should_love_knowledge_like/",
        "text": "We’re Vietnamese. He thinks his cousins are dumb for watching celebrity game shows, model runways, and shows about wealthy Vietnamese men falling in love with prostitutes. He believes people should be using the Internet to learn about history, geography, see how people in other countries live, etc. He spends his time watching history videos about Chinese dynasties and vlogs from Viet people in Norway or Australia to see what life is like there.\n\nWhat he can’t understand is that not everyone cares about knowledge. If they want to watch stuff that he considers “dumb,” like supermodels or celebrities, then let them.",
        "created_utc": 1678592302,
        "upvote_ratio": 1.0
    },
    {
        "title": "went for a swim today and I'm so happy",
        "author": "driedseaplant",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p3zk5/went_for_a_swim_today_and_im_so_happy/",
        "text": "I developed a fear of the ocean after watching a video where it started with just showing the ocean's surface then transitioned going below it where a shark was waiting. I think the video was edited but still scared the eff out me. It affected me badly I avoided swimming in the sea for yeaarrssss. Finally, gathered the courage to go to beach and swim alone T^T I missed how comforting the sea was. decided to post bcoz I was that proud of myself today haha have a good day everyone~~",
        "created_utc": 1678591720,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I shift my perspective of (myself / my experience?) to a positive one again?",
        "author": "AlwaysChic38",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p392o/how_can_i_shift_my_perspective_of_myself_my/",
        "text": "My dad abused my mom when she was pregnant with me and unintentionally caused my partial blindness. They were teen parents babies having a baby. Both abused themselves by their own parents especially my dad. No finishing high school, post edu, poor, you know the drill concerning teen parents. They knew what they knew and they did their best at the time. I was continually abused by both parents as I grew up in different ways (mom developed a drug addiction and dad was physically, emotionally, and verbally abusive). There’s so much more but this is the gist of it all.\n\nMy dad caused my premature birth due to abuse (4mo early). Which led to a host of medical issues as an underdeveloped baby, which led to me needing oxygen, which caused my partial blindness. Which has effected my entire life.\n\nAs a young adult 24f my blindness is causing havoc on my life in ways I get so frustrated with. I at least right now am not the person I want to be yet. I can’t do the things I want to do due to environmental issues like lack of transportation, etc. I get so angry when I face obstacles that are due to my blindness. I feel as though I’m being punished for my dads actions and he gets off scot free (in a way of sorts, guilt ears at him). \n\nGrowing up I had a positive attitude towards my blindness and all that happened to me. I knew I could do great things despite my rough start in life. I knew I had to make good from the cards I was dealt and have continued to pursue this notion (I’m almost done with my grad degree for mental health therapy!!!) I’m the first in my family to get a bachelor’s degree and a masters degree soon!!! I plan to move to NYC where transportation is more excessively available to practice therapy after!!!! \n\nI’m going to therapy myself for all of this which has been very helpful!!\n\nI don’t want to be angry, frustrated, lacking, etc because of my blindness. I need encouragement and a good pep talk please. 🖤",
        "created_utc": 1678589613,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are signs that a girl likes you?",
        "author": "TheSt0rmBringer",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p344j/what_are_signs_that_a_girl_likes_you/",
        "text": "[removed]",
        "created_utc": 1678589222,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone like deep house music?",
        "author": "omniscientchar",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p2wfc/does_anyone_like_deep_house_music/",
        "text": "[removed]",
        "created_utc": 1678588628,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying not to eat sweets everyday is so hard.",
        "author": "IAmNotAFetish",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p2tfh/trying_not_to_eat_sweets_everyday_is_so_hard/",
        "text": "I eat sugary snacks like cookies, candy, cake or milkshakes like every day and I drink juice (mostly the zero sugar kind, but that is just as bad) and milk too. I am already overweight so this is something I need to cut out. I find it much harder to cut out juices and milk than sugary foods. I try to force myself to like water so that I don't drink as much juice and milk. I still find myself needing a dessert after most meals, though. Anyone got some advice on how I can limit my sweet intake and not miss it too much?",
        "created_utc": 1678588405,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are relationships as good as people make them out to be on social media?",
        "author": "throwmeout_22",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p2ivb/are_relationships_as_good_as_people_make_them_out/",
        "text": "[removed]",
        "created_utc": 1678587587,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like my life was better when it was worse and I'm missing it so damn much",
        "author": "Nimyron",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p29qg/i_feel_like_my_life_was_better_when_it_was_worse/",
        "text": "It's 3 AM and I've noticed lately that this is the time where I start having a feeling of dread and nostalgia but still. I miss my old life.\n\nSee right now I've got my own little flat, a well paid job, I live in a nice city and I'm gonna graduate soon (the job is an internship but will turn into an actual job after graduation). I've reach the stability that so many people can only wish for. I even enjoy my job and I'm quite happy in my life, like genuinely happy. My mind is at peace, I feel fine and all.\n\nA few years ago, I was a student living in a shared house with other students. I didn't have much money, just an allowance from my parents and I was often eating shit to end the month because I had spent way too much money into alcohol. I mean, a bottle or two a week (or more if there was parties) isn't cheap, yes I was quite possibly alcoholic and most of the time I was drinking to deal with depression. I was never really sure if the next day would be better or worse. I ran into many problems where I lived, clogged up pipes, dangerous people, fermented food exploding in the shower, needing hours of cleaning after a party, sniffing powder with strangers in my room, rats in the kitchen, broken dishwasher (really a problem when you live in a house shared by 9 people) etc... Doesn't sound great, right ?\n\nNowadays each day is fine, my pipes are fine, my place is clean, organized, functional. There's never any trouble anymore and that's kinda the problem. Back then, lots of shit was happening but it gave me some great stories to tell and every time there was a happy moment, I was making the most of it, I cherished those moments and I remember them fondly.\n\nThat's what I miss. Now, everything is dull and boring, everything is just too stable. I can't even find it in myself to get mad drunk anymore, and that's something I used to do on a weekly basis.\n\nI have no idea how to find new moments of intense euphoria like I had back then and I was hoping that some people who are more experienced with life could give me some insight.",
        "created_utc": 1678586880,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone ever complimented you on something other than appearance?",
        "author": "EyeDclareBankruptcy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p29jj/has_anyone_ever_complimented_you_on_something/",
        "text": "For the longest time I’ve gotten compliments on my speaking voice. I’ll never understand it because I can’t really hear it, you know?\n\nAfter a few rough years, I’m trying to put myself together again. I’m freakin 43(F) and I’ve Googled “How do I know I’m pretty.” Even on Reddit, I can’t believe I’m admitting to this.\n\nTwice in one week I got complimented on my voice again. It had been so long, I forgot that it was “a thing.” \n\nIt really brightened me up. I still have  NO idea if I’m considered attractive, but to know there’s something about me that interests people made my heart happy.",
        "created_utc": 1678586865,
        "upvote_ratio": 1.0
    },
    {
        "title": "I had the best day!",
        "author": "throwmeawawaway",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p28ux/i_had_the_best_day/",
        "text": "Today, altho cold, was great! We went to an oyster shuck in the park in SC near the coast. Huge buckets of roasted oysters to shuck along with food trucks and music.\n\nWe then got bbq.\n\nI am from the coast and definitely felt like I missed the fun and beauty of the coast. There is always so much to do. I never get out much living in the midlands and there is way too much crime.\n\nTodays trip was almost like going back in time when things were simpler. All the new people moving into the area havent completely ruined it yet. \n\nIf I get a high enough paying (rent there has skyrocketed)  remote job i might move back to a smaller town. I dont mind driving 30 mins to get to stuff.\n\nHave you ever been to SC and what did you think?",
        "created_utc": 1678586810,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever suddenly stopped liking a certain food for no real reason?",
        "author": "Mrs-Plantain",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p1y0j/have_you_ever_suddenly_stopped_liking_a_certain/",
        "text": "I've come to the realization that I just don't like pizza. \n\nI ate it all the time growing up. Then I slowly got kind of picky on where I would eat pizza from. Then I found myself making excuses for it like \"I like pizza, *theirs* is just really greasy\" or \"I love pizza, I just think *theirs* is too thin\". Last weekend I had pizza with my partners family and I got to the car and had like an epiphany: I just don't like pizza anymore. For a few years I've been avoiding tomato sauce because of GERD/hiatal hernia, so I would only eat chicken bacon ranch or pickle pizza or something with a white sauce. But even now if the red sauce doesn't physically bother me, I still don't like it. \n\nHas this ever happened to you?",
        "created_utc": 1678585969,
        "upvote_ratio": 1.0
    }
]