[
    {
        "title": "I got one of the best compliments I've ever received yesterday",
        "author": "tvrocker",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l6dy4/i_got_one_of_the_best_compliments_ive_ever/",
        "text": "So before I go telling everyone what has kept a smile on my face for the past 48 hours I wanted to give a small bit of background.\n\nI am a straight, white, 22M, and I was raised in a very small community of people who were the same as me; white, straight people. I have tried most of my life to NOT be racist and try to be inclusive for everyone, and to be honest, I didn't feel as if anyone ever noticed (the small community I was raised in isn't very accepting of \"others\")\n\nBasically over the past 14 months I've finally come out of my own shell and made a lot of new friends, some are people of colour, some are a part of the LGBTQ+ community (so sorry if I'm missing letters there, I never said I was smart or had a good memory) and because I never really had those types of people as my friends I was very oblivious to the struggles that marginalized groups feel. I don't treat anybody any differently and I always try to be a friend and listen when someone has problems, literally just the way I was raised.\n\nAnyways, now to the compliment, I was hanging out with my friends, and because I'm one of the only white guys in the group, my friends like to poke fun at the white boys (it's hilarious ok, no disrespect from either side, it's just boys bein' dudes) and a friend of mine yells out: \"Hey I just heard (insert my name here) say the N word!\" \n\nEveryone laughed for a bit and finally another one of my friends chimed in. \"Yeah, no way in hell. (again, my name) is one of the most accepting people I've ever met, this guy ain't said shit\"\n\nEveryone laughed again, but his compliment really stuck with me, I take great pride in this compliment, and I want to stay this way forever.\n\nAnyways, that's my story, I love people, and if you take away one thing from this post let it be this:\n\nBE A FRIEND TO EVERYONE!",
        "created_utc": 1678212171,
        "upvote_ratio": 1.0
    },
    {
        "title": "I put an ad out on craigslist for wanting a small unfurnished studio/creative space and the only hit so far was some weirdo focusing on my gender.",
        "author": "Fancy_Leshy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l6d0k/i_put_an_ad_out_on_craigslist_for_wanting_a_small/",
        "text": "When they emailed about my inquiry, he asked for my age, gender, and occupation. I was a little taken back by the asking for gender but I figured maybe it's standard or something. \n\nI sent them the info they wanted (I don't know this persons info at all, and their email name is \"First Last\" so yea.. big red flag) and I had marked myself as she/they as my gender. They immediately replied with \"who is they\" so I brushed it off and said oops typo, I meant to write she/her. Again, immediately responded with well are you a man or a woman. \n\nAt that point I replied that the conversation was making me uncomfortable and I am no longer interested. I did add in that I was born female and currently am female and asked them to stop messaging me. Again, the replied immediately with well if you're born a woman you are a woman and is it because you look like a man? you seem awkward and confusing to be around.\n\nI blocked them and reported the conversation. So that's what I get for trying to use craigslist lol.",
        "created_utc": 1678212116,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's tiring being an Indian sometimes",
        "author": "medico-dingo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l6725/its_tiring_being_an_indian_sometimes/",
        "text": "[removed]",
        "created_utc": 1678211766,
        "upvote_ratio": 1.0
    },
    {
        "title": "any server invites?",
        "author": "Decor_Bluff04",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l5y7u/any_server_invites/",
        "text": "[removed]",
        "created_utc": 1678211217,
        "upvote_ratio": 1.0
    },
    {
        "title": "does anyone feel like they're just living the same lifestyle for so many years and it feels like we have a fixed mindset?",
        "author": "Akashh23_pop",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l5u6g/does_anyone_feel_like_theyre_just_living_the_same/",
        "text": "\n\n\n\nI feel like the world is changing so much every single day to an year. Like I see people changing how they dress and how they use to talk and not being themselves anymore. It feels like so many people follow or copy each other and some are becoming so successful and have done so much self improvement whether it's physical appearance or internally. Sometimes when I look at someone, I just wonder and ask myself how they get their life straight or how they got this job and this house. \n\nIt feels like everyone I know or heard of has changed into something so wonderful and amazing and I see myself in the mirror at times like I'm just this same old person as I was 10 years ago. Not has evolved or changed about me. I'm still this insecure softy introvert with no social skills and zero confidence and vision in life. I feel like I'm just living life just to pass another day by. And majority of the people I know have already been so ahead of me. They are making connections networking and maturing with age. Learning to take on responsibility and working on strengthening themselves from any fears. Making money and using their brain to get ahead in life in every aspect of life. Meanwhile I'm just watching everybody taking some sort of actions and trying to learn but I feel like I'm not inputting nothing in my mind and soul. I feel so left out of myself like I just don't feel connected with myself at times. Idk what is could be, whether it's confusion or worries or shame or something. I can't figure it out. But honestly I just don't like living this type of way. Being 27 now and almost reaching 30s in no time and still not having figured out what kind of job to do, when will I ever face my fears and overcome my problems. When will I find my willpower and courage. All these questions and worries just haunt me everyday",
        "created_utc": 1678210959,
        "upvote_ratio": 1.0
    },
    {
        "title": "Richard Simmons should come out of retirement for a one-off DVD and giveaway",
        "author": "sillybob86",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l5tum/richard_simmons_should_come_out_of_retirement_for/",
        "text": "I  think Richard Simmons should come out of retirement and do a one off  DVD,  something to appeal to nostalgia with perhaps some new mixed in...\n\nMake  the DVD in secret. Then go live with it..   In some of the DVDs, there should be essentially a \"Golden ticket\"  for a few folk, to have an all  expense paid trip to meet the legend himself, and perhaps make a workout  DVD with just the ticket winners- as a memento.",
        "created_utc": 1678210936,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are the most hated redditors hated?",
        "author": "Shadow_Galecross",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l5sp9/why_are_the_most_hated_redditors_hated/",
        "text": "Hello fellow redditors , I have recently made a very controversial post on reddit and got the more than justified hate of the game's community. \n\nThat made me think , every community has their 'forbidden users'. I'm getting into the reddit history rabbit hole and would love to know about why are most hated redditors hated. It might be a good idea to not post usernames because you could get reported for hate and harassment and I'm only interested on what they did.\n\nThank you in advance",
        "created_utc": 1678210864,
        "upvote_ratio": 1.0
    },
    {
        "title": "My mom got me a rice cooker now all I want to eat is onigiri",
        "author": "celerysoup39",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l5nwe/my_mom_got_me_a_rice_cooker_now_all_i_want_to_eat/",
        "text": "I love rice, I’d eat it with every meal if I could. I also love foods from just about anywhere in the world but especially Japan. I made meals with rice for a few weeks out of the blue but no matter how carefully I monitored the rice it always burned and stuck to the bottom. My mom decided to make my life easier and got me an early birthday gift of a rice cooker. It’s the best gift I’ve ever gotten. I cannot stop using it, it just makes cooking rice so easy! Add your rice, add your water, place the lid and tap the button; 20 minutes later you have perfect rice! It blows my mind that I’ve never had one before and will probably never stop using it. Now I can make so many different foods much easier. Stir fry was my previous go-to, but then this week I rediscovered onigiri and now it’s all I want to eat. You can put anything in them, fish, meat, vegetables, I’m going to try the classic tuna mayo today and am excited for it, I know it will be the most delicious one yet! Do you like onigiri? Do you have a rice cooker and isn’t it the best device ever? What gadgets have you gotten or been gifted that you’ve gotten a lot of use out of/enjoy using?",
        "created_utc": 1678210558,
        "upvote_ratio": 0.99
    },
    {
        "title": "Why are the most hated redditors hated?",
        "author": "Shadow_Galecross",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l5mpt/why_are_the_most_hated_redditors_hated/",
        "text": "[removed]",
        "created_utc": 1678210482,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm a senior?",
        "author": "TheGiantKorean",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l4sld/im_a_senior/",
        "text": "[removed]",
        "created_utc": 1678208561,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for advise",
        "author": "SamuelJoseOntiveros",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l4qy1/looking_for_advise/",
        "text": "[removed]",
        "created_utc": 1678208471,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for advise",
        "author": "SamuelJoseOntiveros",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l4o23/looking_for_advise/",
        "text": "[removed]",
        "created_utc": 1678208304,
        "upvote_ratio": 1.0
    },
    {
        "title": "lookng for advise",
        "author": "SamuelJoseOntiveros",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l4m9r/lookng_for_advise/",
        "text": "[removed]",
        "created_utc": 1678208191,
        "upvote_ratio": 1.0
    },
    {
        "title": "People that are on a self improvement trip, how is it going so far and what made you start it ?",
        "author": "stjohn_jr",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l4lik/people_that_are_on_a_self_improvement_trip_how_is/",
        "text": "[removed]",
        "created_utc": 1678208142,
        "upvote_ratio": 1.0
    },
    {
        "title": "MPFL Reconstruction Surgery",
        "author": "seasaltedoreo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l4ab0/mpfl_reconstruction_surgery/",
        "text": "I tried posting about this in all relevant sub reddits so I am sorry if this doesn’t belong here but I haven’t got any answers yet so here goes nothing. \n\nI twisted my knee while playing sports and it ended up dislocating my patella and completely tearing off MPFL.\n\nThis is the first time it happened and I have two options, either to go with physiotherapy or surgery. I have consulted two doctors, each suggested different options. \n\nI am 25 so can deal with the surgery pain. If I go ahead with physio I am afraid it may happen again. I am very confused as to which would be correct. If anyone can share their experience, it will be a great help.",
        "created_utc": 1678207443,
        "upvote_ratio": 1.0
    },
    {
        "title": "I speak up for myself today and I feel pretty good about it.",
        "author": "ahaeood",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l47tk/i_speak_up_for_myself_today_and_i_feel_pretty/",
        "text": "I’m the kind of person who if someone offended me, I would ignore, pretend like it didn’t bother me and proceed to repeat the conversation in my head for the next couple years. I’m brown skin Asian who was made fun of for my skin color all my life despite majority of people on my country are dark skin. Pale skin is the beauty standard and women would bleach and bleach their skin to fit in. I’ve never done that, even under my mom’s pressure. \n\nToday when the girls take a group selfie and post in the work group chat “happy women’s day”, one of the guy open the photo and said very loudly “who take this photo and make (my name) so black” and I quickly respond “what’s wrong with being black? I’m ok with my skin color so if you have a problem it’s a you problem” \n\nHe then say “I just meant they could have at least edited it a little for your sake” and I reply “actually I’m beautiful enough on my own I don’t need anyone to pretend they’re outrage just to say I’m not beautiful for being black in the photo” \n\nHe just went completely silent. The whole office was uncomfortable and a girl said I shouldn’t have reacted too much. But I personally feel great. I’m not happy with how people “jokingly” bully me and I stand up for myself. So after the girl said that to me, I proceed to reply to the picture posted “Thanks for wishing us a happy women's day. We work in an diverse workplace with men, women, and people with variation of skintones, heights etc. Here's to hoping that 2023 is a more inclusive year where everyone is welcomed ❤️”\n\nI don’t know what it is about today that made me standup for myself nonstop and not letting any slight go unnotice, but I’m glad I speak up and I will always defend myself from now on.",
        "created_utc": 1678207284,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is something you did today that made you happy?",
        "author": "False_Sympathy_4351",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l3ir7/what_is_something_you_did_today_that_made_you/",
        "text": "[removed]",
        "created_utc": 1678205700,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got fired yesterday",
        "author": "ReflectionKey1896",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l38xd/i_got_fired_yesterday/",
        "text": "I joined this nice startup job in a new city, moved there, started a new life thinking that I will be free of the old issues. It was going all well. I reported on time, worked past my signout time and delivered all my work on time. \n\nYesterday they told me that they will have to let me go because the client I was working with is going. I am very devastated. I moved to a new city, hardly know anyone here and now the only thing that was going well in my life is gone. \n\nI will start posting for new jobs from tomorrow but right now I am just too sad.",
        "created_utc": 1678205076,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got fired yesterday",
        "author": "ReflectionKey1896",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l337k/i_got_fired_yesterday/",
        "text": "[removed]",
        "created_utc": 1678204734,
        "upvote_ratio": 1.0
    },
    {
        "title": "I cried for the first time in CBT today",
        "author": "unselfish_fries",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l2u7h/i_cried_for_the_first_time_in_cbt_today/",
        "text": "Anyone else just feel really tired after they've been to therapy?\n\nAnyway, it was really constructive and I'm glad I went to it today. I'm going to spend my evening watching some crap on the TV haha\n\nWhat about everyone else?",
        "created_utc": 1678204156,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever lost a friend?",
        "author": "cherrymartini2",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l25m1/have_you_ever_lost_a_friend/",
        "text": "Feels strange to have once felt like you’ve known this person forever and will continue to, only to find out you were viewing them through rose-coloured glasses. \n\nRose-coloured in the sense that this person had told me how trigger-happy they are with other friends and family, throwing a tantrum over the smallest rift and sometimes being verbally and physically abusive. At the time I thought: she must be exaggerating or they must have done something that was wildly out of line to deserve it. They were so sweet to me. I thought I was special.\n\nWell, turns out I’m not special. What I’ve learned is that if you think you’re exempt from a behavioural pattern- you’re probably next.",
        "created_utc": 1678202595,
        "upvote_ratio": 1.0
    },
    {
        "title": "i'm gonna have a baby in less than 2 weeks!",
        "author": "BubblefartsRock",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l20sw/im_gonna_have_a_baby_in_less_than_2_weeks/",
        "text": "my wife's induction date got moved up so now we'll be having our first child in less than two weeks! i've never felt this anxious/excited/nervous about something before. \n\ndoes anyone have some advice for how to make this transition from no kids to parenthood as smooth as possible? we've bought just about everything we need and read about every book we can, but i still feel SO unprepared.",
        "created_utc": 1678202283,
        "upvote_ratio": 1.0
    },
    {
        "title": "i'm gonna be having my first child in less than two weeks.",
        "author": "BubblefartsRock",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l1u4n/im_gonna_be_having_my_first_child_in_less_than/",
        "text": "[removed]",
        "created_utc": 1678201831,
        "upvote_ratio": 1.0
    },
    {
        "title": "What can I do to stop myself from being an anxious attachment type?",
        "author": "Sprite_dog",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l1ks7/what_can_i_do_to_stop_myself_from_being_an/",
        "text": "Hey,\n\nI don't really know how to word this, but I am finding that whenever i seem to get a big connection or emotional attachment to someone I am finding myself continously getting anxious, way more than usual.\n\nI am struggling to be able to contain the anxiety and I'm worried it almost causes me to self destruct. Almost doubt everything connected to it.\n\nDoes anyone have any advice on some things I could do to better myself here.\n\nThanks!",
        "created_utc": 1678201218,
        "upvote_ratio": 1.0
    },
    {
        "title": "r/CasualConversation resources, rules, etiquette, support and more",
        "author": "CasualMods",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l1kmw/rcasualconversation_resources_rules_etiquette/",
        "text": " We have a lot to offer in terms of reading material to better your time here.\n\nNow on to our resources…\n\n# Etiquette\n\n[https://www.reddit.com/r/CasualConversation/wiki/etiquette](https://www.reddit.com/r/CasualConversation/wiki/etiquette)\n\nUnsure how to be casual? Well come on in, read our etiquette and it's full of nice helpful information on how to properly conduct yourself.\n\n# Support\n\n[https://www.reddit.com/r/CasualConversation/wiki/support](https://www.reddit.com/r/CasualConversation/wiki/support)\n\nLooking for support but can't find quite the right place to get it? Look no further, we have an extensive wiki of very helpful places to call, visit or vent. It's okay to ask for help.\n\n# Directory\n\n[https://www.reddit.com/r/findareddit/w/directory](https://www.reddit.com/r/findareddit/w/directory)\n\nWe have a huge wiki page of a bunch of very helpful and related subreddits. Sometimes, this sub isn't the right place for your post. Be sure to check it out, your thread might get better attention elsewhere.\n\n# Rules\n\n[https://www.reddit.com/r/CasualConversation/about/rules](https://www.reddit.com/r/CasualConversation/about/rules)\n\nConfused on why a thread was removed? Not sure if you are breaking some of our rules? Read them right here. They are pretty easy to follow. We go in much greater detail on them in the wiki.\n\n# Personal Information PSA\n\n[https://www.reddit.com/r/CasualConversation/wiki/pi](https://www.reddit.com/r/CasualConversation/wiki/pi)\n\nGotta protect our privacy right? The internet can be a scary place, overly sharing your personal info may not always be the best thing to do. Be internet safe and read our stance regarding personal info.\n\n# FAQ\n\n[https://www.reddit.com/r/CasualConversation/wiki/faq](https://www.reddit.com/r/CasualConversation/wiki/faq)\n\nDo you have a question on how a few things work here? Read our FAQ which outlines some of the most asked questions we receive.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Feedback?** [Message the mods.](https://www.reddit.com/message/compose?to=%2Fr%2FCasualConversation)\n\nWant more from us? 👀\n\n[Twitter](https://twitter.com/CasConvo) | [IRC](https://kiwiirc.com/nextclient/#irc://irc.snoonet.org:+6697/#casualconversation) | r/SeriousConversation",
        "created_utc": 1678201212,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you guys think about the attachment theory?",
        "author": "nora_nin",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l1ezk/what_do_you_guys_think_about_the_attachment_theory/",
        "text": "There’s a theory in psychology that is called attachment theory and I’m not going to explain what it is because I would over simplify it, to the point it makes no sense. For those who have gotten into it, what do you think about it? Has it helped you approaching relationships in your life? Did you talk about it with your SO, family and friends?\n\nI’ve known about it for a while now and I feel like it has helped me to realise what my unhealthy habits are and try to actively correct them, to the point where my needs in relationships have drastically changed. \n\nI realised it today watching a video on avoidant people and I don’t recognise myself in those statements anymore. I still have a lot to figure out on how to be a better friend and partner, but I think I’m on my way, thanks to researching more into psychology theories.",
        "created_utc": 1678200825,
        "upvote_ratio": 1.0
    },
    {
        "title": "How important is a “good” day at work?",
        "author": "rawoyster",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l1c6a/how_important_is_a_good_day_at_work/",
        "text": "It might be naïve and I bet a lot of folks would argue work is work but I’d like to work in a place where the days are not just “ok” or “fine” or “bad.”  I have had a few days I can recall that gave me energy and I enjoyed or expected to be the way I anticipated and I don’t know when work slowly became something that I can’t say is good. \n\nAnyway, I’m hoping you all that work have more good days than not.",
        "created_utc": 1678200630,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm quitting energy drinks",
        "author": "Ephemeral_Beholder",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l1agj/im_quitting_energy_drinks/",
        "text": "I've recently found that I'm more anxious and jittery than I thought. The obvious answer could be excess caffeine, but it could be other stuff I'm working through as well. Either way, I don't want to add fuel to the fire with these anymore. I want to spend my money on something else, something healthier. It's gonna be hard because I really like them, but I need to.",
        "created_utc": 1678200512,
        "upvote_ratio": 1.0
    },
    {
        "title": "I finally made a multiplayer Minecraft server!",
        "author": "Moondust221",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l1814/i_finally_made_a_multiplayer_minecraft_server/",
        "text": "This sounds so stupid and not spectacular but I’ve been trying to get this to work for 5 years now! I’ve wanted to play modded Minecraft with friends but I couldn’t figure it out, I’m not very good with computers. I had one hosted by a 3rd party server a while ago and I loved it but the cost racks up fast. Well I asked my friend who is a server technician for some help and finally set one up! I ran commands and now anyone on the same WiFi as me can play. I sorted all the mods last night and it’s ready for my boyfriend and I! It took us like 4 hours but it works! I’m so excited to just play the game together with my bf when I get home from work today. It’s not much of an achievement but I’m so proud of it. Anyone else proud of anything? Or are you playing any cool games?",
        "created_utc": 1678200346,
        "upvote_ratio": 1.0
    },
    {
        "title": "People need to bring back CAWGS",
        "author": "allknowingfungus",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l10zx/people_need_to_bring_back_cawgs/",
        "text": "When was the last time we heard about ⚙️? Does anyone today even remember⚙️? Back in the old days it was always ⚙️. Have we forgotten the greatest technological advancements were all because of ⚙️?",
        "created_utc": 1678199863,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cawg",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1678199707,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just found out this girl I liked also likes me back and I can’t sleep",
        "author": "Particular-Account-3",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l0iae/just_found_out_this_girl_i_liked_also_likes_me/",
        "text": "It’s getting really annoying, the past few days I found out a girl (I thought I’d have no chance with) liked me and we started talking I can’t stop thinking about her when I’m sleeping\n\nI go to bed extremely tired and sleep deprived and then my brain floods me with the thought of her and the fact she’s got interest in me\n\nNot sure if this is because it’s my first time actually having a girl openly like me\n\nI used to be really self conscious during puberty and bullied for my appearance, I dropped out, went to the gym everyday and cut my ugly hair and got older. Finally comfortable \n\nIs this a normal thing at all? Suddenly I’ve got really bad insomnia getting 3 hours sleep. I’ve tried meditating and thinking of other things but it’s just really hard at night",
        "created_utc": 1678198598,
        "upvote_ratio": 1.0
    },
    {
        "title": "Another Casual Tuesday Talk",
        "author": "Whenitrainsitpours86",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11l0604/another_casual_tuesday_talk/",
        "text": "",
        "created_utc": 1678197747,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need a PI in UT",
        "author": "shunmeidontcare",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kzw3d/i_need_a_pi_in_ut/",
        "text": "[removed]",
        "created_utc": 1678197095,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need a Private Investigator",
        "author": "shunmeidontcare",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kzuxl/i_need_a_private_investigator/",
        "text": "[removed]",
        "created_utc": 1678197015,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm working on becoming a better person and I'm kinda pumped up about it",
        "author": "cyborg-waffle-iron",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kzpsb/im_working_on_becoming_a_better_person_and_im/",
        "text": "I'm 19, been living out in the real world for about six months now. I moved out of my parents house to another city 400 miles away. And life has been pretty decent.\nI've been having a lot of introspective moments lately. Comparing the man I am now to the man I would like to be. Thinking about what I can do to become that. \n\nThis is largely going to be stuff relating to improving my self discipline, and learning new skills that will serve me well in the real world. I've been trying to rely on my electronics less, so i've switched my smartwatch to an analog watch face while I look for / save for a nice automatic wrist watch (I'll get that Omega Speedmaster someday but my first one will probably be a Seiko or something). I'm working on predicting weather from the clouds, and i'm revamping my \"every day carry\" to include some extra stuff I always find myself wishing I had, mainly a flashlight and a notebook. I'm in the process of shopping around for a gym in the area so I can start working out with some more proper equipment.\n\nSome other things on the list are learning a martial art, learning to do some body work on cars (I can do most mechanical work but i've never done anything cosmetic or body related), and hunting for a motorcycle and project car.\n\nThanks for reading... what skills are goals are you all working towards?",
        "created_utc": 1678196653,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are your opinions on weekend Friday?",
        "author": "Ok_Professional_2123",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kzoa8/what_are_your_opinions_on_weekend_friday/",
        "text": "so some workplaces and/or schools are making Friday a weekend too, i want to know opinions on it. i wanna know reasoning though, not just \"oh yeah i want weekend Friday\" because you know everyone wants an extra day off- but i just wanna know people factual opinion. will it make a difference? is it worth it?",
        "created_utc": 1678196541,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal to be talking to someone and notice how they're jumping to different conclusions about what you're saying as you're talking?",
        "author": "mikebalsaricci",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kzjmu/is_it_normal_to_be_talking_to_someone_and_notice/",
        "text": "Is that a normal thing to notice or do you think that's weird? How do you deal with that if you notice that? Do you mention it? It's not really something I noticed until lately. If you notice this how do you deal with it? It just makes me feel uncomfortable like people are trying to guess what you're going to say next. Does that not bother you? Is that a problem with me or the person I'm talking to?",
        "created_utc": 1678196202,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal to be talking to someone and notice how they're jumping to different conclusions about what you're saying as you're talking?",
        "author": "mikebalsaricci",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kzi2p/is_it_normal_to_be_talking_to_someone_and_notice/",
        "text": "[removed]",
        "created_utc": 1678196089,
        "upvote_ratio": 1.0
    },
    {
        "title": "friend wants me to \"grade\" his essay",
        "author": "throwyawayycollege",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kzfjr/friend_wants_me_to_grade_his_essay/",
        "text": "My friend received a low-ish grade on a 15-page essay and was given the chance to edit it and hand it in a second time. He asked me to read the new version of his essay and give harsh feedback on any mistakes he might have made, so that he can correct them and get a good grade this time. He said he knows it's a lot of work and he understands if I don't want to do it.\n\nIf you were in my position, would you do it? It's gonna take at least a couple of hours. It's not like I wouldn't be willing to do it, and I do have the time for it, but I have a history of not setting boundaries with people and don't want to just go overboard with helping people for nothing in return and have them lose respect for me in the process.\n\nIs there any way to compromise and still help him out a little?",
        "created_utc": 1678195901,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just finished my book (Think Again by Adam Grant) and now I'm looking for a new book to read.",
        "author": "-A1i",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kyux4/i_just_finished_my_book_think_again_by_adam_grant/",
        "text": "These are things that I have:\n\n1. Energy\n\n2. Free time for reading books\n\n3. Passion for learning to improve myself and my life.\n\n\nAnd these are things that I don't have:\n\n1. Any ideas about what I want to read. \n\n2. Any ideas about what topic I'd like to read about. \n\n3. Any good book club to join.\n\n4. Any ideas about where I can find some new books.\n\n\nI need to find my new book, as soon as possible! So I would appreciate any help! 😄🙏",
        "created_utc": 1678194334,
        "upvote_ratio": 1.0
    },
    {
        "title": "dear all",
        "author": "calimanka",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kyh21/dear_all/",
        "text": "[removed]",
        "created_utc": 1678193286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Give me volunteering/ community service ideas!",
        "author": "Capricious_Critic",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ky78r/give_me_volunteering_community_service_ideas/",
        "text": "[removed]",
        "created_utc": 1678192539,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am a loser",
        "author": "Young_Mallard915",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ky35w/i_am_a_loser/",
        "text": "that's it. I'm a loser. I am an uninteresting, fat, unproductive loser. I have nothing to show for myself. Everyone around me has something to be proud about. My friends are getting good jobs and scholarships. My mother is a fair way through her weightloss journey and is doing great. Even my brother has something to be proud of. He's a fender bender driver at the local speedway.\n\nAnd then there's me. I failed my ATAR. I made a commitment to go to the gym and failed that. I've never had a gf/bf. I have no social skills. I do nothing but sit on my fat ass and play my playstation in a messy room that I'm too lazy to clean.\n\nI work two shifts a week at a shitty job and am scared to apply for others because of the treatment I got from a former boss. I also don't wanna work longs days because, again, I'm lazy. I try to get new jobs but get no replies because everyone \"needs\" staff but they don't when I apply. \n\nI ruined my own fucking life and I have the audacity to blame it on everything but ME. I hate myself. \n\nI could at least try and fix this fuck up of a life, but no. Instead I'll sit on my untidy bed, in my messy room, listening to songs that I don't resonate with.",
        "created_utc": 1678192236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which song best represents you in this very moment as you're reading this?",
        "author": "JustSomeApparition",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ky0zn/which_song_best_represents_you_in_this_very/",
        "text": "Gut reaction! Don't overthink it! Whichever one pops in your head, and is fitting.\n\nReady? Go!\n\nMine: [Assemblage 23 – The Noise Inside My Head](https://youtu.be/da7StUzVh3s)",
        "created_utc": 1678192075,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stuck in the back of a car for 12 hrs AMA",
        "author": "khoolkat",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kwpu7/stuck_in_the_back_of_a_car_for_12_hrs_ama/",
        "text": "[removed]",
        "created_utc": 1678188302,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m stuck in the back of a car for 12hr road trip. AMA",
        "author": "khoolkat",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kwnqn/im_stuck_in_the_back_of_a_car_for_12hr_road_trip/",
        "text": "[removed]",
        "created_utc": 1678188126,
        "upvote_ratio": 1.0
    },
    {
        "title": "Happiness and social media",
        "author": "sarienn",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kwk0o/happiness_and_social_media/",
        "text": "I am happier than ever, and I love my life with all my heart. I am also the least active I have ever been on social media, and I do not feel much incentive to post. \n\nI have been a very, very early adopter of pretty much any platform out there, having used Facebook since before it was open to the public, for example. While I never was addicted to it, I did use to post stuff and gain a decent followers base, and... it just did not and does not matter. \n\nThis makes me think about the fake expectations and fake lives presented on social media. Is any of you truly influenced by what you observe others post? And do you ever find yourself posting when you feel at your best? If you are active on social media, why? What motivates you?\n\nAnd what on social media brings value to you? To me, communities such as this one, where people are committed to be respectful and start nice conversations do motivate me.  I also follow professional communities in my areas of interest. What brings you on whatever social platform(s) you use?",
        "created_utc": 1678187823,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you were given a magic button that would kill every redditor, including yourself would you...",
        "author": "VietQVinh",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kwdhl/if_you_were_given_a_magic_button_that_would_kill/",
        "text": "[removed]",
        "created_utc": 1678187291,
        "upvote_ratio": 1.0
    },
    {
        "title": "I didn’t do anything yesterday and now I feel bad.",
        "author": "SarcasticJustBecause",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kwb9g/i_didnt_do_anything_yesterday_and_now_i_feel_bad/",
        "text": "Yesterday when I got home from school I was tired. I immediately plopped down on my bed and went on my phone. But that’s all I did yesterday. That’s not unusual for me, but I think what I feel bad about is going to sleep at 8. Considering what time I wake up that’s not even a bad time to go to bed, but I just feel so horrible and unaccomplished. I’ve racked my brain for any chores or homework I could’ve done instead, but everything was taken care of. I don’t know why I feel so bad.",
        "created_utc": 1678187108,
        "upvote_ratio": 1.0
    },
    {
        "title": "A lady at my sons daycare, thought my son was her husband's affair child",
        "author": "throwaway4sinfulax",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kw4qe/a_lady_at_my_sons_daycare_thought_my_son_was_her/",
        "text": "This happened about a year ago, I remembered it because I saw the husband dropping off his son at school this morning.The kids are 3 months apart and they started school at different times.   \n\nThere were only 2 black kids at my sons daycare.  The carers used to say that the kids looked alike but I didn't see it and I didn't pay attention to them. \n\nOne day when I was going to pick up my son, I saw this lady looking excited when she saw me and I sort of stood back a little.  I don't like people and I am terrible with small talk. Anyway, few months pass and we are now talking more than the cursory hellos. She said she had been fighting with her husband since her son started school.  She thought my son was her husbands affair child and he had both kids at the same daycare. I didn't meet her for a few months because the husband did most of the drop in/off. She said when she saw me, she was relieved.  The reason she was relieved was because my son is mixed and I am the black parent in the mix.\n\nI was offended at first but then I  realised that it is very possible for some people to do what she was thinking about. It wasn't the case this time but it could have as well happened.",
        "created_utc": 1678186576,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to cope with losing a sentimental item?",
        "author": "New-Organization3527",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kw0gr/how_to_cope_with_losing_a_sentimental_item/",
        "text": "[removed]",
        "created_utc": 1678186195,
        "upvote_ratio": 1.0
    },
    {
        "title": "Desperate for Help: Seeking Advice to Ease Burden of Medical Expenses on my Parents",
        "author": "Eachquiver97",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kvpvs/desperate_for_help_seeking_advice_to_ease_burden/",
        "text": "As I sit here typing this post, I can't help but feel a sense of guilt wash over me. For as long as I can remember, I have been an issue for my parents. My health issues have always required medication, and I know how hard my parents work to ensure I get the necessary medicines. I want to help them at least with something, anything that can make their lives a little easier. That's why I'm reaching out to you, the Reddit community, for advice and guidance.\n\n&amp;#x200B;\n\nI recently heard about the CharityRx platform, and I was intrigued. The idea of discounted medications sounded too good to be true, but I was desperate to find a way to help my parents. I want to make sure that they don't have to sacrifice anything else just to pay for my medical expenses. However, I'm a bit hesitant to trust a platform I haven't used before. \n\nThat's why I'm asking for your help.\n\n&amp;#x200B;\n\nHave any of you used the CharityRx platform before? Has anyone benefited from it? I would love to hear about your experiences, whether positive or negative. I want to make an informed decision before investing time or money into this platform.\n\n&amp;#x200B;\n\nI know that my parents have always done everything in their power to ensure I have what I need. They've sacrificed so much for me, and I feel like I owe it to them to try and ease their burden in any way that I can. That's why I'm turning to you for help. If you have any tips, advice, or personal experiences using the CharityRx platform, please share them with me.\n\n&amp;#x200B;\n\nI'm not asking for pity or sympathy. I'm just a person who wants to help their parents in any way that I can. I know that I can't change my health issues, but I can try to make things easier for my parents. If the CharityRx platform can help me do that, then I'm willing to give it a try.\n\n&amp;#x200B;\n\nThank you in advance for any advice or guidance that you can offer. It means the world to me to know that there are people out there who are willing to help others in need.",
        "created_utc": 1678185236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stalking my ex and getting excited! JUICY GOSSIP",
        "author": "SuitableKick982",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kvpv0/stalking_my_ex_and_getting_excited_juicy_gossip/",
        "text": "Hi guys, I (22f) had a sad break up with an ex (28m) 4.5 months ago. We were long distance. \n\nI am with someone new now and could not be any happier! However I always worried my ex would struggle to find someone after our break up. I genuinely wanted him to find someone to love again. It’s like after you breakup, you still somehow care for your ex. Just the history and all.\n\nAnyway, I stalked his Reddit for the first time after our breakup and he is consulting Reddit for dating advice! He was unsuccessful with his first tinder date he was seeing for 3 weeks ish, and now plans on asking out a girl who works at a store he goes to a lot! \n\nFrom that, I can see that he’s opening himself up to people, but some struggles here and there. \n\nReply to this thread if you wanna gossip about him!! I don’t have any girlfriends to chat with. Idk just seems to exciting and kinda sad for me.",
        "created_utc": 1678185233,
        "upvote_ratio": 1.0
    },
    {
        "title": "You ever make an error while speaking to yourself in your head?",
        "author": "thatbananaone",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kvp24/you_ever_make_an_error_while_speaking_to_yourself/",
        "text": "This happens to me somewhat frequently actually. I'll talk to myself in my head all the time, either imagining scenarios or making commentary about whatever I'm doing. Today I was in the shower and I mentally called my luffa a...sea urchin. That is the most incorrect thing I've ever said to myself in my head. I was glad I didn't actually say that to someone in real life.\n\nDo you guys do this too?",
        "created_utc": 1678185161,
        "upvote_ratio": 1.0
    },
    {
        "title": "Let's Chat About Cooking, Self-Care, and More: A Casual Conversation",
        "author": "sarahshockley",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kvl9e/lets_chat_about_cooking_selfcare_and_more_a/",
        "text": "Hey there, fellow Redditors! How's everyone doing today? It's a beautiful day outside, and I hope you're all enjoying it.\n\nI wanted to start a casual conversation with all of you and hear what's been on your minds lately. Maybe you've discovered a new hobby or interest that you're excited about, or perhaps you're dealing with a challenge that you'd like to share with others. Whatever it is, let's chat about it!\n\nPersonally, I've been getting into cooking lately and experimenting with new recipes. It's been a great way to relax and unwind after a long day, and I love the satisfaction of creating a delicious meal from scratch. Do any of you enjoy cooking as well? What are your favorite recipes or dishes to make?\n\nOn a different note, I've also been thinking a lot about the importance of self-care and taking time for oneself. With everything that's been going on in the world, it can be easy to get caught up in the chaos and forget to prioritize our own well-being. How do you all practice self-care? What are some tips or tricks that have worked well for you?\n\nAnyway, I don't want to ramble on too much. I'd love to hear from all of you and learn more about your interests, passions, and experiences. Let's have a fun and engaging conversation!",
        "created_utc": 1678184819,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saving a ton of money by cooking at home like $300/month",
        "author": "Surveytheplanet",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kvj0l/saving_a_ton_of_money_by_cooking_at_home_like/",
        "text": "For the past month, I am cooking at home. Oh man, what a difference it creates in my budget. I use olive oil, organic veggies, and grass-fed chicken. I cook with all the healthy stuff and still, I do not touch my usual mark of eating outside. Possibly the best decision I made and hoping to stick to it.",
        "created_utc": 1678184618,
        "upvote_ratio": 1.0
    },
    {
        "title": "To developers",
        "author": "mmrgan_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kvhgz/to_developers/",
        "text": "[removed]",
        "created_utc": 1678184474,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who got through breakups during cancer?",
        "author": "Damnt_Dermatitis",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kuz4f/who_got_through_breakups_during_cancer/",
        "text": "Anyone here who got through romantic and friendship breakups during a cancer battle? Could you forgive?\n\nDays ago I started thinking about trying to reset everything and starting from zero with my ex, putting all the efforts on her side. I feel I can be better than feeding bad feelings. Although my cancer has a good prognosis, it thought me that life is too short (and quality of life is even shorter) for that.",
        "created_utc": 1678182844,
        "upvote_ratio": 1.0
    },
    {
        "title": "I finally self-published my poetry book!",
        "author": "Idolikememes",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kuydt/i_finally_selfpublished_my_poetry_book/",
        "text": "I haven’t properly got anyone too into poetry to celebrate this with so I wanted to post it on here. But yeah, I’ve published a poetry book! It took much longer than I thought to gather what I wanted in it and make it coherent (the amount of name changes I went through for both individual poems and the collection itself was immense), but yesterday it finally came out on e-book and soon it’ll be available in paperback.\n\n\n\n\nIt’s such a surreal experience to know that soon I’ll be able to HOLD my work, physically. It’s something I aimed for ever since I was a kid. I hope that version of me is happy now.\n\n\n\n\nI know I can’t NAME the book, rules are rules, but I don’t care. I feel like, even if just one person buys it, that’s enough for me. I can prove that I did it, you know? I achieved something, in my eyes, big. That’s enough for me :))",
        "created_utc": 1678182777,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a Community for Families of someone with mental health sickness",
        "author": "sheikkha",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kuxls/looking_for_a_community_for_families_of_someone/",
        "text": "[removed]",
        "created_utc": 1678182694,
        "upvote_ratio": 1.0
    },
    {
        "title": "We wouldn't live in such comfort now if it weren't for the oil discovery.",
        "author": "vulpineacaridae790",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kuioz/we_wouldnt_live_in_such_comfort_now_if_it_werent/",
        "text": "The discovery and subsequent extraction of oil have been one of the most transformative events in human history. It has revolutionized how we live, work, and entertain ourselves and allowed us to achieve a level of abundance that was once unimaginable. \n\n&amp;#x200B;\n\nI'm tired of people who call for the closure of oil companies. For some reason, all of them tend to omit that if it weren't for oil, there wouldn't be any technological progress, no smartphones, internet, or social media where people adore to express their opinions about how oil companies harm our planet. \n\n&amp;#x200B;\n\nPeople forget that without oil, there wouldn't be any Uber or accessible electrical power. I doubt they could make online orders and get them quickly and cheaply if we still had used horses. Good luck opening a dropshipping business on Amazon or traveling from the US to Europe for some fancy ecological event in the coal era. \n\n&amp;#x200B;\n\nLet me remind you that all the plastic stuff you use is also a product of the petroleum industry. I doubt another vegan could buy fresh tomatoes or avocado each day if it wasn't for diesel transport. Oh, and there are also the fertilizers that allow growing more crops than ever before so that people won't have to starve for lack of food.\n\n&amp;#x200B;\n\nI don't claim that oil isn't harmful to the planet. It is, and I truly hope humanity can find a better alternative for it soon, but let's face it for now, the whole modern economy is residing in oil refining and companies like UPET that ease oil recovery. \n\n&amp;#x200B;\n\nI'm pissed off whenever another group of green advocates tries to destroy a drilling rig in an exalted rush to save the planet while wearing rubber sneakers manufactured from oil and using newfangled gadgets shipped on diesel boats. \n\n&amp;#x200B;\n\nIt's hypocrisy in its purest form.",
        "created_utc": 1678181168,
        "upvote_ratio": 1.0
    },
    {
        "title": "I care for WomanKind",
        "author": "truthandfreedom3",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kue71/i_care_for_womankind/",
        "text": "But I don't care for ManCruel. Happy International Women's Day. In the end I practice returning kindness. But women, in general, are more loving then men. Speaking as a man. \n\nWho do you care for?",
        "created_utc": 1678180681,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a life fear of yours? Not “I’m scared of balloons” or whatever but something that concerns you. I’ll start.",
        "author": "ihatemakinguser132",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kue13/what_is_a_life_fear_of_yours_not_im_scared_of/",
        "text": "I absolutely worry that my emotional expression is stunted. So much so that I have questioned myself as to whether or not I am sociopathic, but I dispel that as I have at least been capable of being acutely sad as fuck. Idk maybe I have empathy burnout.",
        "created_utc": 1678180662,
        "upvote_ratio": 1.0
    },
    {
        "title": "You ever think about how weird death can be?",
        "author": "deviantmoth",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ku2t5/you_ever_think_about_how_weird_death_can_be/",
        "text": "Like somebody could be 109 years old. Lived through both world wars, survived 3 pandemics and a staircase or a wet floor is what takes them out",
        "created_utc": 1678179517,
        "upvote_ratio": 1.0
    },
    {
        "title": "The problem isn't within guns' accessibility but in the fact that people don't know how to handle them safely.",
        "author": "orientedwyeth924",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ktz9h/the_problem_isnt_within_guns_accessibility_but_in/",
        "text": " I'm neither pro-guns nor against it. I simply believe that having a gun is a personal choice. Besides, no law can stop someone from buying a weapon. I highly doubt that criminals get their firearms legally otherwise, the black market wouldn't thrive, and police wouldn't have much of an issue solving shooting cases.",
        "created_utc": 1678179141,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meeting new people is not always interesting",
        "author": "Away-Perspective1777",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kty5q/meeting_new_people_is_not_always_interesting/",
        "text": "I want to vent about a guy I met on a date some time ago and how I ignored the three red flags about him.\n\nI matched with the guy on a dating app and we started chatting. He was quite opposite to the men I have met so far. He appeared (or tried to appear) a cool guy by wearing all black and long hair with many tattoos and rings on his ears. He seemed like a nice guy to talk to as he was genuinely invested in our initial conversations, which I really liked about him.\n\nAs for me, I am quite a nice person. I mean, when you look at me first, you will smile at me even though I am a complete stranger to you, I just have that kind of face. And I will smile back at you because I like to make people comfortable around me as I know how it feels to be left alone in a room full of people.\n\nSo after chatting up for some days, we decided to meet. He brought his mom's car since he was visiting her as he used to live in another city for a long time. As I hopped in, he started to drive but the traffic was making the commute exhausting. So said he knew a shortcut and will take it, which was fine with me since I lived in the city. However, he drove inside a street that was not the correct route and I immediately told him that this is not the way to go. He kept on insisting that he knew the shortcut, even though he doesn't live in the city anymore, so I didn't say anything anymore (1st red flag). And voila, we met a dead end. I just looked at him and smiled since words were not needed here to explain, \"I told you so!\" He backed up the car and somehow managed to bring it out in the road. \n\nWe reached a cafe that he said he wanted to visit the day he saw it while driving around. We went inside and sat at a table. The ambiance was truly nice. There was good music and few people talking among themselves. As we sat down, the waiter brought the menu. I ordered a chicken sandwich and he just ordered a coffee. We started chatting and having a good time. But I found it interesting that he behaved quite the opposite from his chats as he kept on interrupting me when I was saying something and narrated his glorious tales of his \"wasted life\" (his words not mine). I being a shy person didn't say anything after that. \n\nAs the food came, I didn't expect the sandwich to be so huge. So I asked the waiter to pack half of it as I will take it home and he did that. But after finishing up, the waiter didn't bring the packed half of the sandwich and seemed to have got busy with other customers. I tried to get his attention but he was working alone for the night and seemed busy. Here, my date understood my trouble and called the waiter immediately. When he arrived, the waiter started to apologize profusely to me that it was a genuine mistake and that he will bring the takeout instantly. I told him it was not a big deal and just give hand over the takeout. Here it took an interesting turn, even though the waiter was talking to me and apologizing, my date seemed more offended than me since the waiter wasn't looking or talking to him (2nd red flag). I could see he was trying to get the waiter's attention and make a big deal, while I didn't want the situation to escalate into something that would ruin the night, and tried to make the situation light by laughing about it. (cue: uncomfortable laughter) \n\nAfter we left the place, he dropped me off and said he had a good time and will meet me when he visits the city next time. I surely didn't want that but I left with a quick nod.\n\nHe left the city and went back to his place. He started calling me often and talking about how sweet of a person I am. Mind you, I didn't like him at all and just listened to his rants as I feel that everyone needs someone to listen. \n\nSoon he went to Goa for a vacation. He called me up when he got drunk and started ranting that I should not love him and look for someone who is a better fit according to my needs. Somehow, he got the idea that I had fallen head over heels for him even though I never called him or send any message. Maybe this proves how full of himself he was (3rd red flag). \n\nEventually, he did figure out that I was not interested in him and suddenly stopped calling or messaging. I hope he is doing well now and learned to accept people as they are.\n\nThank you for reading!",
        "created_utc": 1678179024,
        "upvote_ratio": 1.0
    },
    {
        "title": "Been trying to decide what kind of recognition gift to gift boss",
        "author": "Lololife112",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ksq9f/been_trying_to_decide_what_kind_of_recognition/",
        "text": "I have an awesome boss, he sees the effort I put into my work and he values me a lot. I'm very dependable and all and whenever I need someone helps me anyway he can. I've been looking around at what kind of little recognition prize I can gift him that would be cool. Maybe a mug or a pen that says best boss or something like that. Anyone ever done this?",
        "created_utc": 1678174553,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to set boundaries without being an asshole",
        "author": "BattleLegendBlue",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kryqf/how_to_set_boundaries_without_being_an_asshole/",
        "text": "i keep losing friends as of late. but when i think about it more, i realize, i didnt like any of them to begin with. it usually goes something like i meet someone, i get bad vibes, but im too afraid to say anything so i end up hanging out with them until i snap and end up having to hastily explain \"im sorry, but you make me viscerally uncomfortable and have the entire time ive known you, but ive just been too afraid to say anything. sorry i led you on for months lol\"\n\nin the instances where the person actually does something wrong, where everyone can nod their heads and go \"yeah thats fucked up\" i blow up way more than i should and end up seeming like an asshole. maybe i am one? i try not to be, but its hard when i surround myself with either flat out terrible people or people i dislike.\n\nthe more i think about it, the more i realize its kind of cruel. but every time ive tried to set completely healthy boundaries in my life ive been punished for it, and now i have no idea how or when to say enough is enough before it reaches a boiling point. any advice?",
        "created_utc": 1678171902,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to set boundaries but not be an asshole?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1678171814,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do dogs get tired of barking?",
        "author": "kisara__sims",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11krngi/do_dogs_get_tired_of_barking/",
        "text": "This is just a random question. I have dogs and for me they don't stop barking, they don't get tired.  They bark to everything and sometimes it sucks, but I still love them lol.",
        "created_utc": 1678170877,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reddit seems so strict and uninviting",
        "author": "Melodic-Ingenuity-62",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kr9hf/reddit_seems_so_strict_and_uninviting/",
        "text": "[removed]",
        "created_utc": 1678169646,
        "upvote_ratio": 1.0
    },
    {
        "title": "i started writing today and i’m really embarrassed about it",
        "author": "dontknowanymoretbf",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kqyfu/i_started_writing_today_and_im_really_embarrassed/",
        "text": "[removed]",
        "created_utc": 1678168737,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thinking about concepts for a painting",
        "author": "ghostorfallingleaf",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kqqql/thinking_about_concepts_for_a_painting/",
        "text": "Originally was going to make a painting of a sisyphus-like figure rolling a rock up a hill to represent the repetitiveness of something, buuut thought the meaning might get muddled because the image might get associated more with “earned punishment” than just “repetition.” So, now I’m trying to think of other ways to represent the idea. \n\nFor any creative folks, do you ever incorporate symbolism? How do you brainstorm?",
        "created_utc": 1678168096,
        "upvote_ratio": 1.0
    },
    {
        "title": "I love my job.",
        "author": "YesiFuckedTed",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kqoyn/i_love_my_job/",
        "text": "I love my job.\n\nI love my job. I’m just a regular cashier at a grocery store; but what makes it all worth it,  is my customers. \n\nI love having conversations with them, I love that customers remember me when they come back or ask about me, I love when they ask how my day is, I love when they compliment me, today a couple came through my line offered me some cookies they purchased, and it made my day! \n\nI enjoy being told I’m kind, helpful, etc. I’m still going to school right now to pursue a better career, but I can say being a cashier will be a memorable job for me. \n\nEven if I’m in a bad mood before I go to work, my customers always leave me with a smile on my face when I go home.",
        "created_utc": 1678167949,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are any male ballet dancers down to be interviewed?",
        "author": "Appropriate_Wall_663",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kqkd2/are_any_male_ballet_dancers_down_to_be_interviewed/",
        "text": "Delete if not allowed!\n\nAre any male ballet dancers interested in being interviewed? I'm doing a research study for university and I'm struggling to find male ballet dancers to interview. It will take around 20 mins. I am also from Australia, so if your timezone is different, let me know and I will accommodate to you!\n\nYour time would be greatly appreciated! Thank you!",
        "created_utc": 1678167558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Freshly cracked trans femme -- literally just figured it out today",
        "author": "danaraman",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kq7p3/freshly_cracked_trans_femme_literally_just/",
        "text": "Hi! I'd love to talk about the figuring things out phase I've been going through -- hopefully with a calm perspective? Despite how crazy finding out you're trans is, this has actually been amazingly pleasant experience. AMA",
        "created_utc": 1678166512,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have everything i thought i wanted but i’m not very happy.",
        "author": "Franklyn-Chacha",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kq700/i_have_everything_i_thought_i_wanted_but_im_not/",
        "text": "I’m still pretty young but i have a lot of things I’ve wanted for the past several years. I have a nice PC, an amazing dog, an nice family, I don’t have an financial problems, I don’t have any problems at school, etc. But even after all that I’m no as happy as I thought I would be once I had it all. Don’t get me wrong I am very grateful for everything I have but still. I’m not exactly sad but I’m. not really happy either. Is it cause I’m not an adult yet?",
        "created_utc": 1678166459,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trivia Night Help",
        "author": "smarttypants1",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kq5np/trivia_night_help/",
        "text": "[removed]",
        "created_utc": 1678166354,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trivia Night Help!",
        "author": "smarttypants1",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kq3na/trivia_night_help/",
        "text": "[removed]",
        "created_utc": 1678166197,
        "upvote_ratio": 1.0
    },
    {
        "title": "My brother acts possessive of our pet cat.",
        "author": "Few-Platypus-4046",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kpyhc/my_brother_acts_possessive_of_our_pet_cat/",
        "text": "We just got the cat. He was the one that asked for the cat. So we finally got one from our uncles farm. \n\nI was going to pet the cat. He sternly told me. “Don’t touch my cat.” \n\nWhat do you think of this behavior? Is it acceptable?",
        "created_utc": 1678165792,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have bells palsy and when I smile I now look like a pirate 🦜",
        "author": "BeautifulDragon94",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kpo6h/i_have_bells_palsy_and_when_i_smile_i_now_look/",
        "text": "That is all. My doctor doesn't know what caused it or how long it will take my face to recover, thankfully it's a mild case. \n\nNone the less I would like some really funny Pirate jokes to say. \n\nThankfully it is getting better but it's like half my face decided to take a nap. And talking and eating is a pain but hey I've been able to make my hubby and myself laugh.",
        "created_utc": 1678165005,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you answer no to three or more of these questions your insufficiently embedded in the interpersonal world and in danger of spiraling down word pesychologically.",
        "author": "joeepeterson03",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kp5le/if_you_answer_no_to_three_or_more_of_these/",
        "text": "1. Have you been educated to the level of your intelectual ability or ambition? \n\n2. Do you use your free time in a way thats engaging, meaningful, and productive?  \n\n3. Have you formulated solid and well-articulated plans for the future? \n\n4. Are you, and the ones your close to free from any serious physical health issues, or economic problems? \n\n5. Do you have friends and a social life? \n\n6. Do you have a stable and satisfying intimate partnership? \n\n7. Do you have functional familial relationstips? \n\n8. Do you have a career- or at least a job-that is financially sufficient, stable and, if possible, a source of satisfection and opportunity?",
        "created_utc": 1678163546,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you answer no to three or more of the questions I put in the comments your insufficiently embedded in the interpersonal world and in danger of spiraling down word pesychologically.",
        "author": "joeepeterson03",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kp0pc/if_you_answer_no_to_three_or_more_of_the/",
        "text": "1. Have I been educated to the level of my intelectual ability or ambition? \n\n2. Do I use my free time in a way thats engaging, meaningful, and productive?  \n\n3. Have I formulated solid and well-articulated plans for the future? \n\n4. I'm I, and the ones I'm close to free from any serious physical health issue. or economic problems? \n\n5. Do I have friends and a social life? \n\n6. Do I have a stable and satisfying intimate partnership? \n\n7. Do I have functional familial relationstips? \n\n8. Do I have a career- or at least a job-that is financially sufficient, stable and, if possible, a source of satisfection and opportunity?",
        "created_utc": 1678163167,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am obsessed with this tiny island in the middle of Lake Victoria.",
        "author": "PhiliDips",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11koybi/i_am_obsessed_with_this_tiny_island_in_the_middle/",
        "text": "I was scrolling around Google Maps a few weeks ago looking at the island settlements within Lake Victoria. I was thinking about how vast it is, and I was wondering what the remotest settlement is on the island. \n\n[I think I've found it.](https://en.wikipedia.org/wiki/Nabuyongo_Island)\n\nThere is literally *no* information on Nabuyongo Island. One of very few conversations I could find on the subject was this one [Quora thread](https://www.quora.com/Why-is-there-no-information-about-the-people-who-live-on-Nabuyongo-Island-in-the-middle-of-Lake-Victoria) and even that doesn't really go anywhere. But the island *must* be inhabited. It's what the satellite images show.",
        "created_utc": 1678162978,
        "upvote_ratio": 1.0
    },
    {
        "title": "Your nickname’s superpower?",
        "author": "Maleficent-Squash-52",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kot9j/your_nicknames_superpower/",
        "text": "Just curious, what superpower would you have based on your nickname?\nMine’s probably causing destruction by squashing things with 52 fingers.",
        "created_utc": 1678162596,
        "upvote_ratio": 1.0
    },
    {
        "title": "я гей",
        "author": "chupep228",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kofyc/я_гей/",
        "text": "[removed]",
        "created_utc": 1678161601,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spam is the human equivalent of wet animal food",
        "author": "travischickencoop",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11koc8g/spam_is_the_human_equivalent_of_wet_animal_food/",
        "text": "I mean think about it, it’s a collection of the meats we like as a species ground up into a blob, and if we eat it and water we’ll probably survive fine\n\nMaybe not healthy but we won’t die\n\nIf cats were the ones that took care of humans they’d probably feed us Spam and Water",
        "created_utc": 1678161308,
        "upvote_ratio": 1.0
    },
    {
        "title": "100% serious. Saw a thread about average number of sexual partners. Is there any data out there for what the average is for men who *have* sex regularly? Like removing anyone with less than say 10 partners. What does the average look like? Do we know?",
        "author": "statistically_curiou",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ko9d0/100_serious_saw_a_thread_about_average_number_of/",
        "text": "[removed]",
        "created_utc": 1678161080,
        "upvote_ratio": 1.0
    },
    {
        "title": "What lyrics in a song have you had wrong almost your entire life?",
        "author": "castlerox71",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11knxdf/what_lyrics_in_a_song_have_you_had_wrong_almost/",
        "text": "[removed]",
        "created_utc": 1678160147,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wish we could live in a non judgemental world",
        "author": "kellybaby22",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11knsjk/i_wish_we_could_live_in_a_non_judgemental_world/",
        "text": "Where everyone would just get along and accept  people for who they are, no racism and bullying everyone is nice to each other. Wouldn't it be nice to live in a world live that ?",
        "created_utc": 1678159789,
        "upvote_ratio": 1.0
    },
    {
        "title": "skincare is so fucking awesome",
        "author": "actuallyzer0",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11knpbg/skincare_is_so_fucking_awesome/",
        "text": "I used to not give a damn about all this fancy skin care stuff. the most i would do is use a face wash in the shower, but for the past couple days I've been using a face mask every night, using facial cleanser every morning, moisturizing any chance I get, and man it feels good. I already feel so much better about myself in the two days I've been doing this so I can't imagine how much better about myself I'll feel in the long run &lt;3",
        "created_utc": 1678159548,
        "upvote_ratio": 1.0
    },
    {
        "title": "I constantly crave Christmas time ever since my grandma passed",
        "author": "rangusmcdangus69",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11knl8y/i_constantly_crave_christmas_time_ever_since_my/",
        "text": "My grandmother passed away a couple of years ago. We used to always have Christmas at her house and once we lost her, It has made Christmas not as special anymore. \n\nThe past 2 Christmases have just felt empty. And now I find myself constantly wanting Christmas time. Even now, just a mere couple months since December, I just get this crave for Christmas time. The music, the coziness, snow, grandma’s food. It’s odd, but I have a feeling others may feel the same way. Is this a common occurrence?",
        "created_utc": 1678159238,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do people on Reddit tend to be so cruel to one another?",
        "author": "az-a-lany",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11knjj8/why_do_people_on_reddit_tend_to_be_so_cruel_to/",
        "text": "I see some really nasty things being said on Reddit, and it’s just sometimes shocking to see the language people use against others. I don’t see why these individuals can’t just keep scrolling and not put any emotion or effort into something that they clearly don’t want to be apart of. It can be disheartening at times, though I know it shouldn’t matter.",
        "created_utc": 1678159114,
        "upvote_ratio": 1.0
    },
    {
        "title": "I really like tall women",
        "author": "flabbery2",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11knf65/i_really_like_tall_women/",
        "text": "A pretty face on some long legs is a different gravy. Don't get me wrong, I like em short, medium, and tall. I just hate it when I see a tall lady walking with her shorter friends and hunching her back to not look so big.\n\nI'm thinking \"stand up straight you goddamn amazonian. Work that thang (sorry for the cringe)\"\n\nBut yeah just wanted to let my thoughts out after seeing an absolute bombshell while I was out today who stood out in the crowd due to her height.",
        "created_utc": 1678158782,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are you guys up to right now?",
        "author": "Lololife112",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11knc5c/what_are_you_guys_up_to_right_now/",
        "text": "Just woke up, time to get my day started, start this 16hr shift soon. Best part of my day today was earlier heading to the gym for leg day and then picking up my kids from school, they were so excited. What about you guys?",
        "created_utc": 1678158560,
        "upvote_ratio": 1.0
    },
    {
        "title": "What To Do Bored",
        "author": "Any_Drag3177",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kmxzr/what_to_do_bored/",
        "text": "My friends aren't exactly the outgoing type. I'm a bit bored right now and got nowhere to go. Where would you go when you're bored on a weekday? Where could I meet some new people?",
        "created_utc": 1678157511,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel trapped and I can't run to the people I'm supposed to be able to run to.",
        "author": "Tired_Human_Being",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kmqu7/i_feel_trapped_and_i_cant_run_to_the_people_im/",
        "text": "[removed]",
        "created_utc": 1678157004,
        "upvote_ratio": 1.0
    },
    {
        "title": "What To Do",
        "author": "Any_Drag3177",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kmlnz/what_to_do/",
        "text": "[removed]",
        "created_utc": 1678156637,
        "upvote_ratio": 1.0
    },
    {
        "title": "I asked a woman out on a date Sunday, &amp; she said yes!",
        "author": "OGCeeg",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11kmjbd/i_asked_a_woman_out_on_a_date_sunday_she_said_yes/",
        "text": "I've been single for over a year, &amp; have tried my hand at the dating game. A few days ago, I matched w/ this woman on Bumble, &amp; right off the bat, we vibed very well together. We both love horror movies, Dungeons &amp; Dragons, &amp; going to concerts!\n\nI'm super pumped &amp; so happy, not just b/c she's super sweet &amp;  kind, but she is waaaay out of my league in terms of looks. Here's to a good date on sunday!",
        "created_utc": 1678156473,
        "upvote_ratio": 1.0
    }
]