[
    {
        "title": "Perception and Opinion",
        "author": "DreamAreReality",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11age0e/perception_and_opinion/",
        "text": "[removed]",
        "created_utc": 1677206611,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was using the bathroom and got pee in my eye.",
        "author": "lilmisstrauma",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11afrnq/i_was_using_the_bathroom_and_got_pee_in_my_eye/",
        "text": "[removed]",
        "created_utc": 1677204766,
        "upvote_ratio": 1.0
    },
    {
        "title": "Today I realized how impactful representation can be.",
        "author": "anonymous_7476",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11afcsv/today_i_realized_how_impactful_representation_can/",
        "text": "All my life, I've done many sports/activities that are done by very few POC. I've been skiing/snowboarding since the age of 5, and I also fly gliders. Both sports involve almost entirely Caucasian participants. \n\nHonestly, it never bothered me one bit. While experiences are definitely different for others, I have never experienced racism on the ski hill or on the airfield. I never felt things were harder for me, however, I just realized that I can count on 2 hands the number of brown skiers/snowboarders I met (this includes my own family, who all ski), and I have never skied with any brown skier beyond a blue run. I'm the only brown person I know in the world that can ski at an advanced level (and I'm not that advanced, like I can't do anything at the terrain park).\n\nUntil yesterday\n\nI was just scrolling through Instagram, and I saw this guy pop a quad backflip. His face was covered, and I checked out his insta, turned out he was a brown guy.\n\nI felt an immense wave of emotion there, like in my 14 years of skiing/snowboarding, I had never seen a person that looks like me do any tricks at the terrain park, let alone a quad backflip. Honestly, it felt so inspiring, and while this person shouldn't be treated differently, he's an inspiration to me.\n\nYesterday I understood why representation is so important, it makes you put away any of your doubts, the slightest thoughts you had of possibly bad genetics, etc. \n\nI feel inspired, and I hope I can inspire others.",
        "created_utc": 1677203576,
        "upvote_ratio": 1.0
    },
    {
        "title": "Join me for dice and slots with unlimited faucet, grab treasure boxes to share BTC bonus pool! #Dice #Slots #BTC #Gaming #OnlineCasino #crypto #onlinegaming",
        "author": "ExpensiveDimension6",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11af7l8/join_me_for_dice_and_slots_with_unlimited_faucet/",
        "text": "[removed]",
        "created_utc": 1677203147,
        "upvote_ratio": 1.0
    },
    {
        "title": "what color is the number 14?",
        "author": "asususal",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11af56h/what_color_is_the_number_14/",
        "text": "I was chatting with my classmate and he asked me this.. I was surprised when we answer with same colour. I asked my mom and she told me same colour too. So I'm asking you what colour is the number 14?",
        "created_utc": 1677202950,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s something you saw someone else do that lives rent free in your head?",
        "author": "Loud-Fairy03",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11af4zb/whats_something_you_saw_someone_else_do_that/",
        "text": "I had a camp counselor once who ate everything with a fork and a knife, and I mean everything. I watched her a chocolate chip cookie with a fork and a knife. This was years ago but I just can’t stop thinking about it lol",
        "created_utc": 1677202934,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just need to vent",
        "author": "Alex_Spencer12",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11af343/i_just_need_to_vent/",
        "text": "[removed]",
        "created_utc": 1677202784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Colon Biopsy",
        "author": "Zipperclown-m",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11aey1z/colon_biopsy/",
        "text": " So I (45m) had a positive fit test which lead to a colonoscopy, in it they found abnormal cells, so I went back yesterday and had some biopsies taken, I was able to see the entire process which was kind of cool, but now I am in a holding pattern waiting the 10 to 14 days for the results to come back from the lab. Dr told me that is more cells are found in the areas she took the biopsies then it will be forwarded to oncology. I am trying hard not to be distracted but its a losing battle. Only positive is that I haven't had to pay anything since I use VA healthcare (scary in its own right). Any tips on how to relax and ride this out, I used to joke that the only thing that scared me was finding a sharpie cap but not able to find my giggling toddler. well I was wrong., as I am currently freaking terrified of the unknown and anxious for the doc to call.",
        "created_utc": 1677202378,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I encountered some “discrimination” for having tattoos today and it’s cracking me up.",
        "author": "gravetinder",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11aeo86/i_think_i_encountered_some_discrimination_for/",
        "text": "[removed]",
        "created_utc": 1677201623,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wanna be a trans bilionaire who will build a town and have sex with lesbians and give them free houses in my town if I like them.",
        "author": "Southern-Touch-7388",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11aeda7/i_wanna_be_a_trans_bilionaire_who_will_build_a/",
        "text": "[removed]",
        "created_utc": 1677200793,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can monks or anyone else stop themselves from bleeding by the force of will?",
        "author": "bandageddoll",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ae1e6/can_monks_or_anyone_else_stop_themselves_from/",
        "text": "I’ve read about monks being able to control their temperature and other unconscious bodily functions. Is there an example of someone who can stop themselves from bleeding through capillary restriction or anything like that?",
        "created_utc": 1677199849,
        "upvote_ratio": 1.0
    },
    {
        "title": "I kind of want the world to end.",
        "author": "cat_in_the_sun",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11adsgy/i_kind_of_want_the_world_to_end/",
        "text": "[removed]",
        "created_utc": 1677199152,
        "upvote_ratio": 1.0
    },
    {
        "title": "Be honest: Are you attractive?",
        "author": "NedTugentz",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11adqci/be_honest_are_you_attractive/",
        "text": "[removed]",
        "created_utc": 1677198981,
        "upvote_ratio": 1.0
    },
    {
        "title": "whoop there it is! 5 q's for ya ;p",
        "author": "LorelaiGranger",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11adoct/whoop_there_it_is_5_qs_for_ya_p/",
        "text": "1. something you're looking forward to this weekend?\n\n2. what blows the wind out of your sails?\n\n3. book you've been thinking about reading?\n\n4. watch anything fun lately?\n\n5. is it hard for you to get into things?",
        "created_utc": 1677198823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Be honest: Are you attractive?",
        "author": "NedTugentz",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11admri/be_honest_are_you_attractive/",
        "text": "[removed]",
        "created_utc": 1677198703,
        "upvote_ratio": 1.0
    },
    {
        "title": "To all the former college students, what do you do when you just want to drop out but you also don't want to go back home, aside from obviously getting your own place?",
        "author": "spontaneouscobra",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ad8xy/to_all_the_former_college_students_what_do_you_do/",
        "text": "Recently I feel like all I'm doing is just wasting time and money for nothing, I'm a fine arts major and my classes don't even interest me (they have me doing classes like colour theory and sculpting, I'm more into 2D drawing and digital art). On top of that, most of the time I dont even want to get up to go to class and would rather stay in bed the whole day. I feel I should just drop out but the last thing I want to do is move back in with family.",
        "created_utc": 1677197670,
        "upvote_ratio": 0.99
    },
    {
        "title": "Happy birthday to me!",
        "author": "Expensive-Ferret-339",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ad2fp/happy_birthday_to_me/",
        "text": "[removed]",
        "created_utc": 1677197189,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m really not looking forward to being an adult in the society we’ve created.",
        "author": "Gabe750",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11acv1p/im_really_not_looking_forward_to_being_an_adult/",
        "text": "I live in the US and am early 20’s. I just want to live simply. I think the luxuries we enjoy are not worth the cost of our time and fulfillment in life.\n\nI don’t understand why somebody can own millions of acres of land and I can’t even afford rent while I work full time. Who let this happen? \n\nI feel as though we have been tricked into believing the system we live in benefits the majority of humans. \n\nWhy do government’s I never chose get to have so much effect on my life?",
        "created_utc": 1677196666,
        "upvote_ratio": 1.0
    },
    {
        "title": "is there a redecorating floor plan app?",
        "author": "Ok_Accountant_8716",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11acp84/is_there_a_redecorating_floor_plan_app/",
        "text": "I am trying to redecorate my room by moving things around, but I don't want to move things around just to find it that the stuff doesn't fit. \n\nIs there an app where I can input the dimensions so then I can see what fits and what doesn't? \n\nIf it doesn't make any sense please let me know",
        "created_utc": 1677196228,
        "upvote_ratio": 1.0
    },
    {
        "title": "As I gotten older, I have taken more pills.",
        "author": "Castor_Deus",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11acn68/as_i_gotten_older_i_have_taken_more_pills/",
        "text": "I get the impression, as I write it, that that is a very click-baity title. Apologies. What I am talking about is somthing I never thought I needed when I was 25 or younger. Vitamin D tablets during the winter. Vitamin B (especially B12) foor energy. Iron supplements. I won't go into diet here but it does seem as I have gotten older, these pills have become more important. Anyone else?",
        "created_utc": 1677196073,
        "upvote_ratio": 1.0
    },
    {
        "title": "F22 Looking for friends",
        "author": "Mysterious_Pay_4626",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11aci8f/f22_looking_for_friends/",
        "text": "Hello im a 22 yo portuguese girl. I would like to make friends, i am going through a bad phase in my life thats been going on for a lot of years now and i would like to make some friends. I like animals, rollerskating, journaling, to draw, to read, to meet new places and pretty mich to be on my bubble. If you feel like we can connect mu msg are open",
        "created_utc": 1677195697,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I achieve a healthy work-relaxation balance?",
        "author": "Any_Respond_9011",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ac2tj/how_do_i_achieve_a_healthy_workrelaxation_balance/",
        "text": "My  life is increasingly looking like a hectic mangle between productive  work (studying, personal projects) and relaxation. I can't work for more  than 15-20 minutes on something without checking social media, or  consuming a few minutes of a video/movie/podcast. When I purposefully  try to do something relaxing, I also feel a random strong need to work  on something, even though at that moment I'm tired/not in the mood for  it. Because of this, I can't really relax for any significant amount of  time.\n\nI feel like this is destroying both my productivity and my mental health.\n\nWhat could I do about it?",
        "created_utc": 1677194598,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it me or is everyone attractive now? (US)",
        "author": "Complete_Undurian6",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11absjw/is_it_me_or_is_everyone_attractive_now_us/",
        "text": "[removed]",
        "created_utc": 1677193875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it me, or is everyone suddenly attractive now?",
        "author": "Complete_Undurian6",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11abah6/is_it_me_or_is_everyone_suddenly_attractive_now/",
        "text": "[removed]",
        "created_utc": 1677192630,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you finish your drink in one go or drink it throughout your day?",
        "author": "m00-shroom",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11aaxjg/do_you_finish_your_drink_in_one_go_or_drink_it/",
        "text": "Just drinking some chamomile tea at work today and thinking about how I always finish my drinks quickly. I hate drinking caffeinated/high sugar drinks b/c I end up getting a quick sugar high and crash. Doesn’t matter if I’m in a rush or if I’m relaxed, I’m the same.",
        "created_utc": 1677191741,
        "upvote_ratio": 1.0
    },
    {
        "title": "What things are you glad you will never have to experience again when you die?",
        "author": "Special_Soft_6040",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11aalax/what_things_are_you_glad_you_will_never_have_to/",
        "text": "I had this conversation with a few friends. Things I will thankfully never have to go through anymore once I am deceased. \nMortgages, underpaid jobs, crappy customers being the most common responses. I said pop up ads, shitty streams, dental pain, waiting in queues. What are your responses?",
        "created_utc": 1677190910,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am so happy right now that I could just go outside and scream",
        "author": "SeaworthinessFew3618",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a9uf3/i_am_so_happy_right_now_that_i_could_just_go/",
        "text": "[removed]",
        "created_utc": 1677189083,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else dislike a sibling?? (Used to hate him with a passion) Would it be bad if I cut him off entirely one day/block him?? I wouldn’t be able to get away from him yet cause he shows up to family events &amp; home occasionally.",
        "author": "PrincessGoth99",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a8zv4/does_anyone_else_dislike_a_sibling_used_to_hate/",
        "text": "My brother used to be my favorite sibling growing up till I turned 12, that’s when he went down his problematic path &amp; started treating me poorly by taking out all his internal anger on me. I was miserable living in the same home as him &amp; my mum disregarded all my complaints about him despite knowing all he did (not just to me but everyone, he starts lots of drama) &amp; how toxic he is. He stole all my money when I was 12 (over $300) &amp; sold a precious item of mines without permission, &amp; was nothing but a headache for me years later till he finally left the house when I was 16. But ever since, he stays over time to time &amp; still is annoying &amp; thinks I’m “cool” with him due to not ignoring him when he talks (which I want to do). He isn’t as bad as he was back then (he’s not fully reformed tho) but he never apologized (mind you he’s 8 years older than me) &amp; I still bear rancor towards him, but I guess it’s not obvious due to being nice/chill but if he had a brain he’d see how I never initiate talks with him or respond to some of his comments unlike with others. I gave up on mending things long ago as my attempts were always thrown away the second he treated me bad again &amp; he still gets on my nerves.",
        "created_utc": 1677186968,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suggestions for good daily journals/ diaries/ apps that don’t include writing words?",
        "author": "poker_roach",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a8w29/suggestions_for_good_daily_journals_diaries_apps/",
        "text": "Hello! I am in search of a good journal or diary (can be paper or digital) for daily tracking of mood, activities, sleep, that don’t include writing, just symbols and pictures or even stickers. Does anyone have a suggestion for one that is fun to keep up with? TIA!",
        "created_utc": 1677186706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Despite what people believe about men, I know single guys that keep their homes really clean. What male stereotypes don’t apply to you?",
        "author": "Nurse2778",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a8mua/despite_what_people_believe_about_men_i_know/",
        "text": "So, that. I was chatting with some female friends and they said that guys are messy with their houses, but I know some guys that keep their homes clean.\n\nWhat's an stereotype that doesn't apply to you?",
        "created_utc": 1677186085,
        "upvote_ratio": 1.0
    },
    {
        "title": "My dad told me he loves me for the first time",
        "author": "No_Contribution2112",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a7xeb/my_dad_told_me_he_loves_me_for_the_first_time/",
        "text": "My dad is on the autism spectrum and had problems communicating and sharing his feelings with others. Today he muttered out the words “I love you” to me and I felt like crying it was the first time hes said it to me and I think the first time hes said it to any of his kids so that means i am special to him",
        "created_utc": 1677184376,
        "upvote_ratio": 1.0
    },
    {
        "title": "Young adults addicted to porn",
        "author": "ValeryBe",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a7g10/young_adults_addicted_to_porn/",
        "text": "[removed]",
        "created_utc": 1677183184,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this a bad friend? What Should I do?",
        "author": "CoverBoring2374",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a6l73/is_this_a_bad_friend_what_should_i_do/",
        "text": "So, I have a best friend I care for very deeply, I know she is the only friend I can trust when discussing something and she won't judge me. However, she suffers from severe depression and other issues. Other issues that impede her from functioning in society, hold a job, etc.  However, she met her bf about a year ago, but they bf lives in another country. I have noticed since they have been together, when he has to go back to his country, she becomes more depressed and less engaged. She will go days &amp; weeks without talking to me. But when we do talk, she will talk about him and has made time for him. She does not always talk about him, but when she does, it is about issues with the visa, etc. So, it does make me feel some type of way at times. But I know that is just part of being an adult and people will usually put their SO first.\n\nAnyway, I am a photographer and I asked her if she would be interested in being my assistant. I asked her if she would be open to me sharing concepts I create. I wanted someone I can trust and get feedback on, as well as clients I work with, and she agreed. She knows I would be paying her. This past Monday, I texted her and said, \"Hey, are you available to talk this week? I wanted to go over a concept.\" She never replied back, I then texted her the next day and told her, \"Listen, there is no pressure, I just want to discuss a concept. I have no expectation of you coming with me to a shoot. Just talking about the concept is perfectly fine. As those are more the things I am concerned about, than the assistant come with me to a shoot.\" She still did not reply, so the next day, I texted her and said, \"If you can't handle something like this, its totally fine. But please let me know, as I have to find an assistant.\" And she still did not get back to me, this made me feel some type of way. As I am always there for them, I always am understanding. I understand if someone has issues, but this really made me feel some type of way, because she left me hanging. So now I am anxious, having to find a stranger be my assistant.",
        "created_utc": 1677181102,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gonna graduate and get my chemical engineering degree in May. Looking for jobs is fucking hard",
        "author": "Shnitzel-",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a6jtg/gonna_graduate_and_get_my_chemical_engineering/",
        "text": "Title says it all. Not gonna complain too much though, I’m in a highly fortunate position as I have no debt, and parents who are willing to let me borrow from them to get my life started if I have to move.",
        "created_utc": 1677181007,
        "upvote_ratio": 1.0
    },
    {
        "title": "It was fun having the World Cup in December instead of Summer",
        "author": "scaptastic",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a6hqz/it_was_fun_having_the_world_cup_in_december/",
        "text": "It was an amazing vibe, it was nice to talk to fans about the games day to day and watch them in school instead of just talking on the internet or time to time with acquaintances. The World Cup might work better if it’s held in a temperate country in the summer and a warm country in the winter, with the temperature flipping every four years. This was the first World Cup I’ve seen end to end and it think the time of year benefitted it.",
        "created_utc": 1677180864,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I help my mother through this rough path?",
        "author": "Odd-Dot3210",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a6fsz/how_can_i_help_my_mother_through_this_rough_path/",
        "text": "My mother is going through a very rough period in her life. \nContext: she launched a business with 2 partners at the beginning of summer. The business is a product supply one. She doesn't have experience as a business woman, she used to work as an English teacher in a public school for the last 20 years. \nLike any starting business, they needed funds so they issued a request to a bank for a loan. The loan is still unblocked (but approved) and the companies they bought product from are calling her everyday to see when they can retrieve their money (I don't know what it's called in english but they bought without paying the whole sum)\nShe borrowed money from friends and family meanwhile the arrival of the bank's loan, but it was only supposed to be for a brief period (1month tops) until she can pay them back. \nShe's so down and tired. As I am writing this she is sobbing in her room, probably sinking into the pessimistic view of future and we all know how that can end. \nI don't know how to help, really, how can I support her morally? \nPlease let me know.",
        "created_utc": 1677180735,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone have any awful experiences with teachers or professors? I’ve had some truly entitled teachers and I’d love to hear your stories!",
        "author": "RedLuna_23",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a693q/anyone_have_any_awful_experiences_with_teachers/",
        "text": "[removed]",
        "created_utc": 1677180279,
        "upvote_ratio": 1.0
    },
    {
        "title": "Let's build a punk/rock wedding playlist!",
        "author": "cellsnek",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a5z99/lets_build_a_punkrock_wedding_playlist/",
        "text": "Hello! I'm getting married next year, and I would love to hear your song suggestions for a punk/rock playlist! Other wedding ideas and advice are also welcome and appreciated. I used to be a professional event coordinator so I've got the big things down pretty confidently, but I'm not the most creative person, so I welcome all ideas!\n\nExample songs we have so far:\n\n-Slow Songs:\nSmother Me by The Used\nYellow by Coldplay\nI'm Lost Without You by Blink-182\nNever Say Never by The Fray\n\n-Party Songs:\nGirlfriend by Avril Lavigne \nStill Into You by Paramore\nThnks fr th mmrs by Fall Out Boy\nBad Romance by Halestorm (cover, originally by Lady Gaga)",
        "created_utc": 1677179607,
        "upvote_ratio": 1.0
    },
    {
        "title": "im now a fifth wheel.",
        "author": "goyola-wini",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a5z7u/im_now_a_fifth_wheel/",
        "text": "im living wth 2 roommates since mid January and we all work together in the same place. around two weeks ago two girls from office started hanging out with these two(one of these girls tried to get w me in January and had to reject her) well now they been hanging out since then and few days ago they became a thing, now it's already 5th day in row they come home and do double daty kinda stuff and wht used to be me casually chilling in the living room became me leaving the living room cuz of how weird these two girls are looking at me for being there, like telling me not to be there.\n\ni don't like coming home anymore as I feel forced to go to my room instead to leave them love fucmhm birds alone and it's getting annoying... they can't hangout anywhere else as they don't want to be seen by anyone from the office and it's a small city where i am and yea probably they'll b seen by one of the 100 ppl that work w us tbh.. but still, it's not cool -.- I don't wanna start dating someone either nor do i like hanging outside every day so it's either laying on my bed, overstaying at work, or being uncomfortable w these 4..\n\ni feel like it's gonna get even more weird if i try telling my roomies to stop bringing them over and at this stage im just waiting them to get over each other...",
        "created_utc": 1677179603,
        "upvote_ratio": 1.0
    },
    {
        "title": "Couples who live together, how often do you go through one tube of toothpaste?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677179529,
        "upvote_ratio": 1.0
    },
    {
        "title": "My plans for the day",
        "author": "spookyookykittycat",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a5xie/my_plans_for_the_day/",
        "text": "Hello, I've been super stressed out over gaining weight lately so to distract myself from this last hour on my stationary bike, I am here to tell you my plans for the day.\n\nOnce I'm finished work I'm going to visit someone's house that I will be petsitting for this weekend to learn how to feed her cute lil male pug. Then, as a treat for myself for the weekend, I wanted to get some cheap gummy bears from Walmart and some coconut rum shooters to make rummy gummies to snack on. Then I have some adulting to do (replace my windshield wipers/bring trash cans to my backyard, etc) before I can finally get into my Pjs and my bed and crochet for the rest of the night while keeping my mind numb watching South Park.\n\nWhat are your plans for today (or the weekend)?",
        "created_utc": 1677179481,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just caught $300+ in fraud charges from Amazon!",
        "author": "Mad_Max_Kelley",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a5os4/just_caught_300_in_fraud_charges_from_amazon/",
        "text": "How are you today? I have a little bit of a bittersweet vibe going on. I try to be conscientious of my spending, but for 3 months someone has been siphoning from my precious oasis. Have you ever been scammed or stolen from? I kind of feel like a detective, but for a crime against myself.",
        "created_utc": 1677178904,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need advice from someone here on a legal matter",
        "author": "shunmeidontcare",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a5m8m/i_need_advice_from_someone_here_on_a_legal_matter/",
        "text": "[removed]",
        "created_utc": 1677178755,
        "upvote_ratio": 1.0
    },
    {
        "title": "How have you overcome any social anxiety you’ve experienced?",
        "author": "Ohnoitsbrokenn5",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a5kpd/how_have_you_overcome_any_social_anxiety_youve/",
        "text": "I realize that when I’m in a group or around new people I really struggle to keep a conversation going or even starting one to begin with. It’s like I want to talk and involve myself but I find it difficult to think of things to say and/or continue after I started something.",
        "created_utc": 1677178646,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to overcome jealousy?",
        "author": "Timely_Water_7047",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a56m4/how_to_overcome_jealousy/",
        "text": "[removed]",
        "created_utc": 1677177670,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your opinion on Argentina?",
        "author": "MissIndik",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a4d07/whats_your_opinion_on_argentina/",
        "text": "[removed]",
        "created_utc": 1677175692,
        "upvote_ratio": 1.0
    },
    {
        "title": "It’s currently 71°F/22°C where I live. In February!",
        "author": "Wifimuffins",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a43a7/its_currently_71f22c_where_i_live_in_february/",
        "text": "[removed]",
        "created_utc": 1677175074,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it just me or has the US postal mail gotten ridiculously slow?",
        "author": "F1RST-1MPR35510N",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a3opk/is_it_just_me_or_has_the_us_postal_mail_gotten/",
        "text": "[removed]",
        "created_utc": 1677174109,
        "upvote_ratio": 1.0
    },
    {
        "title": "What have you learned from your biggest mistakes?",
        "author": "Geeki_dude",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a3jqs/what_have_you_learned_from_your_biggest_mistakes/",
        "text": "[removed]",
        "created_utc": 1677173775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something in life you thought would be really challenging that turned out to be easy, and something you thought would be easy that turned out to be really challenging.",
        "author": "aFestiveFlamingo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a3ams/something_in_life_you_thought_would_be_really/",
        "text": "[removed]",
        "created_utc": 1677173162,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any business owners here who are struggling with Google or FB campaigns? I can Audit for Free",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677173003,
        "upvote_ratio": 1.0
    },
    {
        "title": "Let's play a fun game !",
        "author": "Ryandock16",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a37jb/lets_play_a_fun_game/",
        "text": "Hi everybody ! I'm sitting here waiting for my red dead redemption 2 to finish installing on my pc, so i thought, why not appreciate different cultures on reddit with others !!! \n\nIt's simple, all you have to do is mention which culture or place you come from, and the replies will appreciate it ! I think in times where hate is so prevelant, we need this.\n\n\nLet's go !",
        "created_utc": 1677172944,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the dirtiest fine print you've seen in a contract?",
        "author": "Necessary-Capital-92",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a2uw2/what_is_the_dirtiest_fine_print_youve_seen_in_a/",
        "text": "[removed]",
        "created_utc": 1677172101,
        "upvote_ratio": 1.0
    },
    {
        "title": "today's my birthday but I don't even feel like it's a special day or anything",
        "author": "Akashh23_pop",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a29vb/todays_my_birthday_but_i_dont_even_feel_like_its/",
        "text": "So I turned 27 today and I don't know I just don't feel like it's my birthday or if it's a special day or anything and even yesterday or past week I wasn't waiting for this moment or looking forward to it. I don't really like how to express it. I'm always so consumed in my thoughts and my worries that I end up not living life in a present moment and I'm just always feeling low like I just hate it.",
        "created_utc": 1677170724,
        "upvote_ratio": 1.0
    },
    {
        "title": "to the people who used to have plans for their future and get anxious of it , what are your advice or the things you have learned?",
        "author": "keiskrt_875",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a2736/to_the_people_who_used_to_have_plans_for_their/",
        "text": "I'm 21 and it's been a second nature of me to plan things ahead especially of my future. I want to be in control because if I don't I feel like everything is gonna go wrong. I'm trying to correct that mindset.",
        "created_utc": 1677170546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else like reassurances when you're feeling down?",
        "author": "shad94",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a1ibd/does_anyone_else_like_reassurances_when_youre/",
        "text": "Hello there, friends! I don't know if this has to do with genuine healthy reassuring needs or plain neediness, but do you need reassurances when you're feeling down? As a metaphor, when you're down, do you all enjoy getting picked back up? I know that you have to pick yourself up primarily but do you think that having reassurances, whether from a significant other or close friends, makes all the difference in the world?",
        "created_utc": 1677168885,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you found your platonic soulmate?",
        "author": "Klorainne",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a1cb2/have_you_found_your_platonic_soulmate/",
        "text": "I feel like so many people forget about how meaningful and defining a close friendship can be so I wanted to ask! Do you have someone in your life you consider a platonic soulmate? How did you meet? What about them makes them so special to you?",
        "created_utc": 1677168481,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do any of you think you have found your platonic soulmate?",
        "author": "Klorainne",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a1atf/do_any_of_you_think_you_have_found_your_platonic/",
        "text": "[removed]",
        "created_utc": 1677168382,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (26M) think my girlfriend (21F) is trying to baby trap me. She is so young. Why is she worried about this …",
        "author": "base_rick44880",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a11t2/i_26m_think_my_girlfriend_21f_is_trying_to_baby/",
        "text": "[removed]",
        "created_utc": 1677167784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Approaching people at work, gym etc is perfectly acceptable",
        "author": "StaticNocturne",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a11mo/approaching_people_at_work_gym_etc_is_perfectly/",
        "text": " \n\nA good chunk of reddit seems to believe that a man may only connect with a woman during crepuscular hours of the 2nd blood moon of the year (on leap years) and only once she has initiated a conversation and only in outdoor, urban, busy environments where she may abort the interaction blah blah\n\nLook, yeah I know we all know someone who knows someone who once smiled at a man on the sidewalk who proceeded to follow her back to her house and watch her through the window as she slept, and I know that being flirted with by someone you're not interested in can be uncomfortable, but come on.\n\nMy parents, grandparents and aunts and uncles met each other at work - not just colleagues but bosses/subordinate relationships - and many of my friends met their partners the same way. Another friend met his fiance by wandering over to her table where she was sitting with her family and briefly talking then giving her his number, another friend saw her working at the checkout in a supermarket and went in then admitted he only went in to chat to her and six years later they're married.\n\nI don't want to inspire the wrong behaviors and I think everyone should operate with social awareness and tact and learn to read nonverbal cues and take no for an answer and so on but telling guys they can't ask someone out at the gym or at their workplace or when their family are around or if they don't smile at you first etc just leaves people feeling lost for options meanwhile many guys are still meeting people this way.\n\nIn most cases if someone extremely charming and attractive showed interest in you, you'd be flattered, even if you were midway through taking a shit and they popped their head under the cubicle, so often this just applies to people who's attention wouldn't be appreciated in any context. But you'll never know unless you give it a go - worst case an awkward moment every time you walk past them at the gym, best case a lifelong relationship.\n\nThoughts?",
        "created_utc": 1677167772,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where have you been banned from and why?",
        "author": "SolidTranceBeats",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a0ube/where_have_you_been_banned_from_and_why/",
        "text": "[removed]",
        "created_utc": 1677167261,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where was the last place you got banned from and why?",
        "author": "SolidTranceBeats",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a0sa4/where_was_the_last_place_you_got_banned_from_and/",
        "text": "[removed]",
        "created_utc": 1677167114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Show me your best Side Pinezo",
        "author": "Powerthrucontrol",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a0oyb/show_me_your_best_side_pinezo/",
        "text": "In my dreams last night, my physical trainer complained about the strength building exercise of the Side Pinezo. She then did a crouching twisting motion that she warned me was highly uncomfortable and highly dangerous. I'm curious. What do you think a Side Pinezo would look like?",
        "created_utc": 1677166881,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am moving out of my parents house soon!",
        "author": "No_Task_921",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a0ocx/i_am_moving_out_of_my_parents_house_soon/",
        "text": "I(21)m very happy that I have this opputurnity. My friend(23) of 5 years was looking for roomate in neighbouring state where they study and work already. I send my CV to every company so I can have job right away. I started packing and its getting stresful but Im still really happy. Hoppefully interviews go well, I have few lined up. Anybody have some advice what I shouldnt forget. That feelling Im forgeting something is there like always.",
        "created_utc": 1677166838,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tell me something you know that most people don't",
        "author": "Clownthosh",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a0iht/tell_me_something_you_know_that_most_people_dont/",
        "text": "It could be something from your area of expertise or personal experience or world view. Something you've noticed that you think most haven't.",
        "created_utc": 1677166420,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it just me, or are pickles not that crunchy anymore?",
        "author": "cpullen53484",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a0ibr/is_it_just_me_or_are_pickles_not_that_crunchy/",
        "text": "Is it just me, or are most pickles from well known pickle brands not that crunchy anymore? like the aren't soft either, its like a weird inbetween. the only types of pickles that are crunchy are claussen deli cut pickles.",
        "created_utc": 1677166408,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do doctors give preferential treatment to patients in established careers?",
        "author": "pillnob",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11a0cn8/do_doctors_give_preferential_treatment_to/",
        "text": "Do doctors give more favorable treatment towards patients who are successful in their careers?\n\n I am a male (28) who hasn't been to a MD since 2018. Noticed something different about my last two visits to two different doctors. \n\n For most of my life prior to this I never felt like I could establish good rapport with any of the medical doctors I would encounter. \n\n In 2019 I started an amazing job at a fortune 500 aerospace company. I was asked by both doctors where I worked and after stating the name of the company the conversation and visit immediately took a turn to a positive note, both with better outcomes than I had originally expected. \n\n I know the healthcare system preaches \"oaths\" and that all patients are treated equally. But I definitely feel if i said unemployed the experience would not have been the same.",
        "created_utc": 1677166005,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally starting to recover after an intense surgery 6 months later!",
        "author": "RedLuna_23",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119zfij/finally_starting_to_recover_after_an_intense/",
        "text": "Last summer I was diagnosed with a rare form of Chiari Malformation. My chances of survival were pretty good, but I had an almost 90% chance of being paralyzed within 5 years if I didn’t get surgery. \n\nHere’s the gist of what was happening: \nMy cerebellum/brain stem was sitting really awkwardly in my skull, causing it to sit right on top of my spine.\n\nMy skull was deformed in the back (a birth defect) so it didn’t allow much room for my brain to sit. \n\nTherefore causing the top of my spine to continually put pressure on that part of my brain for all these years. \n\nI’ve had the worst migraines, muscle weakness, pain when exerting myself, numbness, tremors, and a whole ton of other problems all my life.\n\nI had been to every specialist since I was about seven. It wasn’t noticeable and I seemed fine, but I complained so much about everything that my parents kept taking me to doctors.\n\nI hated having MRI’s, CT Scans, Blood Draws, and a multitude of different tests. But I knew that something was wrong, even at a young age. \n\nEveryone says I was so strong for going through with all of this, but I really have my parents to thank. \n\nAnyways, after a few years my pediatrician said I should get a brain scan. It was a last resort, but other specialists couldn’t find anything wrong with my sinuses, thyroid, muscles, etc. \n\nI got a brain scan in June of 2022. By the end of July they had called back with results. Told us everything, how I needed surgery asap, and how to get in touch with a surgeon.\n\nI spent the first 2 months of school dreading the surgery. When September 30th came around, I went to the hospital. \n\nGot tons of blood tests that day, went to a hotel, and tried to sleep soundly for the last time in a while. \n\nI had to be at the hospital at 6am the next morning, I was walked through everything, got a few more tests, and was put under anesthesia at 8am. \n\nThe surgery was 5 hours. I woke up at about 1:30 in the afternoon and was in so much pain. My bedsheets and gown were soaked in blood.\n\nThey had shaved a huge patch of my hair off and my head was sticky. I was in a neck brace with 4 ivs in my arms. \n\nIt was pretty scary. But both my parents were right there when I woke up. A nurse told me how well it went, and that the were all so happy.\n\nThe first night I spent in the ICU, didn’t get any sleep. And I spent another week up in my own room. \n\nIt was incredibly painful. It took me a while to be able to stand. My neck felt awful, and my rib was sore.\n\n(Side note, they cut out a piece of rib to graft my skull back together.)\n\nI’ll skip ahead through the next few months.\n\nStayed at home for a month, went back to school in a neck brace and rolling bag. Near Christmas I got the neck brace off. \n\nNow 6 months later, I’m allowed to start playing tennis again, exercising, going on runs, and other more exerting activities.\n\nMy headaches have gone down so much after they removed all that pressure. The other things will take time. \n\nBut I’d just like to say that I’m incredibly grateful to everyone who helped support me.\n\nI couldn’t have done it without my parents, friends, nurses, surgery team, and my neurologist.\n\nThanks for reading.",
        "created_utc": 1677163663,
        "upvote_ratio": 1.0
    },
    {
        "title": "got into my dream uni, dont know what to do now",
        "author": "DysphoricSandRat",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119zdf0/got_into_my_dream_uni_dont_know_what_to_do_now/",
        "text": "i worked hard, got good grades and got into the best university in my country. Now, i dont enjoy studying my major or my uni experience in general. i was always an introvert but ive been trying to make friends in my uni, no success yet as ive only made few acquaintances. i feel empty inside and i dont know what to do.",
        "created_utc": 1677163501,
        "upvote_ratio": 1.0
    },
    {
        "title": "As our office is on a hybrid schedule, looking at the calendar, I don't think anyone else on my team is in today.",
        "author": "cdubz-1986",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119y9dx/as_our_office_is_on_a_hybrid_schedule_looking_at/",
        "text": "Morning folks. \n\nI work a hybrid schedule and different days, different people on my team are in the office. However, from looking at the calendar, it does not seem anyone else is in today. \n\nSo the good news is - I get to sit here and play music all day while working. \n\nThe other side of it is - if that is the case, there should be a policy of \"if you are the only one in, you should just be allowed to go back home and work from there\" - defeats the purpose of being in the office if you are the only one there.\n\nAnyone else have this sort of thing happen? \n\nAnd how has your week been going? Any weekend events to look forward to?",
        "created_utc": 1677160414,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Anyone Else Irrationally Terrified Of Black Holes?",
        "author": "drunksouls69",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119y90s/is_anyone_else_irrationally_terrified_of_black/",
        "text": "Is anyone else terrified of black holes?\n\nThere's nothing else that terrifies me more than black holes. Nothing. Not asteroids. Not gamma ray bursts. Not Cthulu. Not even your mom.\n\nBlack holes.\n\nThis has been a persistent pants shitting fear I've had ever since I was a small child.\n\nI've always been a space nerd. I read a lot of Wikipedia as a kid.\n\nWhen I finally discovered black holes I could barely even look at them. But the morbid curiosity prompted me to read more.\n\nI found out...\n\nThese are the most powerful things in the universe. They are like... Fuck ups in the space time continuum. Objects so dense they bend spacetime in on itself. The gravity is so strong it crushes anything into it, even light. Which is why they're black.\n\nImagine being in close proximity to one. Imagine the pure unfiltered terror. \n\nIt's just a void. There's nothing in it. When you finally get sucked into it, it's just infinite blackness and crushing gravity. There will be no ground for you to land on, nothing to see. And the worst part is, you'll never escape it.\n\nIf it's a small one, you'll be spaghettified long before you ever get that close. You'd be dead.\n\nBut a supermassive black hole will not spaghettifi you. Assuming you're in a space ship or some kind of suit to keep you breathing, you would remain in tact and fully conscious during your descent into the supermassive black hole. You would experience falling into literal nothing with no escape. You'd see the entire universe bending and warping behind you.\n\nBeing next to hyper massive objects speeds up time significantly. Even the Earth does it a bit.\n\nTime dilation next to a black hole would mean that by the time you actually get crushed by the singularity, the universe may have already experienced heat death. That's how insane this is.\n\nWhat's even scarier than just falling into a black hole on your own is having one swing by and slowly devour your entire planet with you on it. Imagine being present when this happens. Seeing the black mass in the sky as your planet is ripped apart. Imagine seeing the sun ripped to pieces.\n\nYeah. This is terrifying. I'm not sure if it's the blackness, or the infinite nothingness, or the inescapable destructive power. But this is the scariest thing in the universe.\n\nWhen I was a kid, I knew all this. \n\nAnd I told myself: \"Well we're way too far away from any of these to ever experience one.\"\n\nAnd that's half true.\n\nBut what I didn't know was...\n\nSome black holes move. Like, Ricky bobby fast. They sonic the hedgehog through the universe at near light speed sometimes.\n\nThis is the worst. The worst thought.\n\nAt any moment, we could get very unlucky.  A rogue traveling black hole could swing by our solar system at any time. We would never see it coming. They're black holes. Scientists can only see the effects they have on surroundings, not the actual holes themselves.\n\nIt would just happen. Without warning.\n\nAt best, the solar system would be scrambled. Planets thrown all about. Sun possibly destroyed.\n\nAt worst, you get to see your entire planet devoured with you on it.\n\nThis is the worst possible apocalypse we could have. I can't even imagine it. \n\nOh yeah, and I'm sure you've heard a lot of people talk about a supposed Planet X. They say there's evidence of a very large planet or object in the outer reaches of our solar system throwing shit around and causing a gravitational mess. Scientists have been trying to find it for many years, but they can't seem to.\n\nIt just recently came out that they think it's a black hole out there. That's why they can't see it.\n\nYeah. This might be a lot closer than we think it is. I've metaphorically shit my pants over this several times.\n\nOverall, I just can't fathom this shit. I can't get over it. It's a fear I've never been able to shake.\n\nIn No Man's Sky you are encouraged to fly into black holes because they teleport you closer to your goal in game. But I just CANNOT do it. Whenever I run into one on accident I shudder and look away from my screen. Sometimes I'll even load a save so I don't have to look at the fucking thing.\n\nIf I do have to fly into one, I take my headphones off and look away from my TV.\n\nWhenever I see a black hole picture or video I also just can't look at it. I can't do it.\n\nIt's real bad. It's so bad.\n\nI know the world will end, but pray to whatever you believe in that it's not this way. \n\nI just wanted to see if anyone else shared my batshit crazy phobia.\n\nHave fun sleeping tonight. Once you know you can never unknow.",
        "created_utc": 1677160386,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm so tired.",
        "author": "1sa6311a",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119xzhy/im_so_tired/",
        "text": "The wear and tear on a person from work, and family, and just plain living life can be a lot sometimes. I know that's par for the course, but I can't help but feel like I should not be this tired. Physically, mentally,  and emotionally I am just Tired. As a recovering addict, days like this are so hard sometimes. I don't want to be fucked up. I just want to be able to get through a day without every moment being a colossal effort.",
        "created_utc": 1677159667,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's my 50th day on Reddit😆",
        "author": "Smooth-Ant-4895",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119xwq2/its_my_50th_day_on_reddit/",
        "text": "Waah the world and its opinions and thoughts are vastly different from the world I come from. Weird. I enjoy it but weird. It's like a window to the outer world. Me likes😁",
        "created_utc": 1677159455,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is anyone else a huge fan of City of God? I just love that movie so much.",
        "author": "user6876",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119xqd3/is_anyone_else_a_huge_fan_of_city_of_god_i_just/",
        "text": "[removed]",
        "created_utc": 1677158975,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm not trying to give people an existential crisis, but this life doesn't make any sense, so why try and make sense of it all?",
        "author": "Just1person_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119xnul/im_not_trying_to_give_people_an_existential/",
        "text": "Something we don't realize is that we as humans don't make sense at all, the way we were born (coming out from another human being!!!) the way we grow, the way we live, the way our body (especially our brain) work, and even our death, and let's not forget how insane our plant is (a floating rock as people say), so why try and explain and make sense of it? I'm not talking about science and all of that, I'm talking about steering about how we look for example, how people perceive us, our insecurities, fear of judgment, living life how other people want us to live, why waste our time on this insane world by doing things that we don't want to do?\n\nTrust me, I'm not a rich person who is trying to simplify everything and tell people “to live life” because we still have bills to pay, we still have jobs to maintain, we still have stuff we have to work through, BUT what I'm trying to say is, let's not take thing too serious, yes you have to work but try having fun every now and then, yes you have bills to pay? But try buying something nice for yourself every now and then, yes you having a hard time, but try doing something you really enjoy every now and then\n\nAnd again, STOP caring about what people think of you, as long as you're a decent human being who treats people with basic human respect and kindness, that's what really matters\n\nSending love to everyone who's reading this",
        "created_utc": 1677158773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone ever have a gut feeling about knowing you don’t fit in?",
        "author": "Glittering_Glove_372",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119xkzy/does_anyone_ever_have_a_gut_feeling_about_knowing/",
        "text": "Having a discussion with a friend, I felt this way a couple years back when I moved in with some people and instantly felt like I didn’t belong, no matter how hard I tried I couldn’t express the real me and consequently kind of retreated inwards and got shy which is the opposite of my personality. \n\nMy question to you guys is, do you ever have gut feelings that you don’t fit in, in a social setting?",
        "created_utc": 1677158543,
        "upvote_ratio": 1.0
    },
    {
        "title": "24M At the final hours of work and I have nothing to do",
        "author": "mohidalga",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119xbyv/24m_at_the_final_hours_of_work_and_i_have_nothing/",
        "text": "Yo! Call me Dalga, I’m from Jordan, quite reserved but I try to be an outgoing person. I’ve got plenty of memes and would welcome music recommendations as I explore new genres. I usually listen to metal, but everything else is obviously welcome haha.\n\nI am a poet, I enjoy reading, gaming, collecting bottled caps and then use them as slingshot ammo, all the random stuff you can think of. Dark humour is more than welcome. It’s the only thing that makes me laugh these days! \n\nThanks for reading, I wish you well, and can’t wait to hear from you. Both genders are more than welcome.",
        "created_utc": 1677157823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Working towards change, and i’m getting results..",
        "author": "cloudymeatballdude",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119x3x0/working_towards_change_and_im_getting_results/",
        "text": "I’m 19M, turning 20 in half a year and i’m in my foundation year, planning to study Criminal Justice.\nI ran and won student rep despite me hating being in charge. I make small talk despite not being a big fan of talking to people. And now i’m on good terms with almost every person in my year. I don’t share too much of my personal life except maybe with the two people i’m closest too (not exactly best friends but they’re kind people).\n\nI found myself wanting to change this year. I didn’t want to have the same experience i did in my last university (dropped out cause i wanted to change my major, used to be in healthcare), So i did the opposite of what i usually do. Instead of laying low i ran for student rep, instead of keeping to myself i talked to everyone. Instead of isolating myself i started to make animal balloons and sometimes make them for kids if we’re in a queue, once i gave two kids a balloon each while we were all waiting at the barber for a haircut.\nThey were so happy and thanked me and the mother seemed relieved they had something to distract them a bit, they even got upset when they had to put the balloons away when it was haircut time. I’m in a different country and miss my sister which is why i like to make kids happy, the same way i used to cheer her up.\n\nI always used to judge other dudes, saying nah we wouldn’t get along, they’re all too different from me. \nBut now despite whatever barrier seems to be between me and other guys wether personality etc i still give them a chance and i realized lots of people i never looked at twice before make good genuine friends.\n\nI think i was judgmental cause of past experiences with bullies but i am starting to realize those experiences don’t have to dictate the rest of my social life.\n\nThere’s still a lot for me to work on, my confidence (always been sorta pissed that i got short genes lmao what kinda guy is 5’5) and there’s a lot of self improvement to be done. Extra emphasis on the confidence part.\n\nBut i think i’m on a better track than i was last year, and that’s something worth celebrating, i’m doing it. \n\nI think i’ll be alright. Just wanted to share, thanks for reading.",
        "created_utc": 1677157174,
        "upvote_ratio": 1.0
    },
    {
        "title": "should I take an L if I lose",
        "author": "sleepi_owl",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119w94j/should_i_take_an_l_if_i_lose/",
        "text": "[removed]",
        "created_utc": 1677154420,
        "upvote_ratio": 1.0
    },
    {
        "title": "Child locked in cage, while going shopping",
        "author": "WelderProof6511",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119w72h/child_locked_in_cage_while_going_shopping/",
        "text": "[removed]",
        "created_utc": 1677154241,
        "upvote_ratio": 1.0
    },
    {
        "title": "I used to think _________ was lame, until I __________.",
        "author": "jelly_blood",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119vwkp/i_used_to_think_was_lame_until_i/",
        "text": "What do y’all think?\n \nFor me, I‘ve always thought Don’t Stop Believin by Journey (and Journey in general lol) was lame, until Tony played it in the Sopranos’ finale.",
        "created_utc": 1677153282,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can one advertise themselves if I have no experience in teaching?",
        "author": "rinadong",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119vkk9/how_can_one_advertise_themselves_if_i_have_no/",
        "text": "Im 17 and waiting for university to start, i have almost no experience(highest qualification is secondary 4 end of year aka grade 10)cos i dropped out of school. I want to teach guzheng as a hobby, a way to spend time while waiting, and for experience. But i dont know how to start, the only way i can rely on now is hoping any of my parents colleagues' children are interested to learn guzheng. And right now there's only one, and it is half-forced by their parents. I can't ask my friends since they are all busy and there's literally a guzheng cca in my previous school so they wld have joined if they're interested. Anyone knows how i can start accepting students? In other words how can I advertise myself, who has almost zero experience?",
        "created_utc": 1677152117,
        "upvote_ratio": 1.0
    },
    {
        "title": "I thought ____________ used to be lame, until I ___________.",
        "author": "jelly_blood",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119vke0/i_thought_used_to_be_lame_until_i/",
        "text": "[removed]",
        "created_utc": 1677152101,
        "upvote_ratio": 1.0
    },
    {
        "title": "Started a call center job and on the first call I was scolded by the end user",
        "author": "polmeeee",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119vdou/started_a_call_center_job_and_on_the_first_call_i/",
        "text": "Couldn't get a job in my area of study (software engineering) so I took some interim jobs, needed to pay the bills so a friend recommended a call center job that pays well which I accepted.\n\nPicked up my first call and due to audio issues, my inexperience and the computer hanging up made for the most unpleasant interaction ever.\n\nI don't know what to think, thinking that I have to do this everyday makes me hate looking forward to everything.",
        "created_utc": 1677151436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interested in making money on Facebook and Instagram, guys?",
        "author": "Tixteen-",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119vcrw/interested_in_making_money_on_facebook_and/",
        "text": "[removed]",
        "created_utc": 1677151340,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the viable options for leveraging one's Instagram and Facebook followers as a means of generating income?",
        "author": "Tixteen-",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119v9hc/what_are_the_viable_options_for_leveraging_ones/",
        "text": "[removed]",
        "created_utc": 1677151015,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does it freak you out to know you've been somewhere that something bad happened?",
        "author": "duppy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119v6yz/does_it_freak_you_out_to_know_youve_been/",
        "text": "I have two examples. Each gave me an unpleasant feeling, but in different ways.\n\nAt the 1996 Atlanta Olympics, I went to see the U. S. men's basketball team play China. On the way back I passed through Centennial Park, where a bomb exploded a few hours later. This gave me a feeling of dread, just shock at what happened, and also some relief that I was not there at the time.\n\nIn Milwaukee, there is an old hotel called the Ambassador. It's right across the street from a concert venue called The Rave. Very convenient if you don't want to drive after getting messed up after a show. I saw on a documentary recently that Jeffrey Dahmer had killed one of his victims in that hotel, and it creeped me out to think that I had slept in that vicinity.",
        "created_utc": 1677150754,
        "upvote_ratio": 1.0
    },
    {
        "title": "Today I felt really sad so instead of drowning in sadness I did a 20 minute HIIT workout and feel amazing!",
        "author": "Dekioni",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119v1az/today_i_felt_really_sad_so_instead_of_drowning_in/",
        "text": "[removed]",
        "created_utc": 1677150180,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying not to sleep so I can hang out with a friend",
        "author": "Amujinkoy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119urnn/trying_not_to_sleep_so_i_can_hang_out_with_a/",
        "text": "Listening to some old rap while scrolling Reddit and watching some league of legends streaming. Life is peaceful but the temptation of sleep strikes me evermore. What time is it now for you? for me it's 7:46",
        "created_utc": 1677149194,
        "upvote_ratio": 1.0
    },
    {
        "title": "What motivates parents to have children? Is there a specific reason behind their decision?",
        "author": "Apprehensive-Exit596",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119ukmr/what_motivates_parents_to_have_children_is_there/",
        "text": "I am curious about the motivations behind parents' decision to have children. I was wondering whether there is a specific reason or purpose that drives this choice, or if it is simply a natural biological urge. I am interested in understanding the factors that contribute to this decision and the responsibilities that come with raising a child.",
        "created_utc": 1677148423,
        "upvote_ratio": 1.0
    },
    {
        "title": "Productive Hobbies",
        "author": "Chaiandchant",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119udnm/productive_hobbies/",
        "text": "[removed]",
        "created_utc": 1677147661,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fear and Insecurity",
        "author": "Chaiandchant",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119uc6u/fear_and_insecurity/",
        "text": "[removed]",
        "created_utc": 1677147514,
        "upvote_ratio": 1.0
    },
    {
        "title": "If the economy was a person, who is his mother?",
        "author": "krkrkrfin",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119u5fl/if_the_economy_was_a_person_who_is_his_mother/",
        "text": "[removed]",
        "created_utc": 1677146792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling like going home?",
        "author": "Own_Surround5135",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119t9p3/feeling_like_going_home/",
        "text": "[removed]",
        "created_utc": 1677143350,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is up with streaming services these days?",
        "author": "Patient_Fix_3674",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119t7ct/what_is_up_with_streaming_services_these_days/",
        "text": "Why are there so many streaming services in the U.S.? The benefits of streaming services are getting slimmer by the day. Other countries have 1-2 streaming services with almost everything on it and its cheaper. I recently visited Canada and they had Netflix with some HBO Max content and their Disney+ had Hulu content. Remember when it was just Hulu and Netflix?",
        "created_utc": 1677143107,
        "upvote_ratio": 1.0
    },
    {
        "title": "You have 1 day left on the Earth. What would you do?",
        "author": "mishtid0i",
        "url": "https://www.reddit.com/r/CasualConversation/comments/119t5wy/you_have_1_day_left_on_the_earth_what_would_you_do/",
        "text": "[removed]",
        "created_utc": 1677142950,
        "upvote_ratio": 1.0
    },
    {
        "title": "You have only 24 hours left on earth. What would you do?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677142703,
        "upvote_ratio": 1.0
    }
]