[
    {
        "title": "Do you find this cringe too ?",
        "author": "Random_Girl_2004",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11r5ckv/do_you_find_this_cringe_too/",
        "text": "Do you find this cringe too ? I see on YouTube where it's like \" how others do vs how i do \" related to eating, laughing,etc. They project the others as how movie stars in movies do ( being formal and awkward) while they project themselves as how literally everyone does. It cringes me a lot like no\n\nLike no, ur doing what everyone does",
        "created_utc": 1678798501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you find this cringe too ? I see on YouTube where it's like \" how others do vs how i do \" related to eating, laughing,etc. They project the others as how movie stars in movies do ( being formal and awkward) while they project themselves as how literally everyone does. It cringes me a lot like no",
        "author": "Random_Girl_2004",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11r5bnm/do_you_find_this_cringe_too_i_see_on_youtube/",
        "text": "[removed]",
        "created_utc": 1678798431,
        "upvote_ratio": 1.0
    },
    {
        "title": "When and why was the last time you felt bittersweet?",
        "author": "firststrikebar",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11r59ob/when_and_why_was_the_last_time_you_felt/",
        "text": "Hey everyone, first time making a post here! Just thought I’d share my own thoughts on the topic question. \n\nI work with a theatre company to teach acting to children and I currently work on a seasonal schedule. The season just ended the other day and I helped the kids I teach to perform in a cabaret for their friends and families. I hadn’t ever felt such a strong sense of pride and bittersweetness in relation to my job until that day, and it really took me by surprise to get emotional seeing these kids who had come such a long way and really broken out of their shell finally performing on stage, and doing so wonderfully. Usually by this point in the season I’m just glad to get my job done and out of the way, but for the first time I found myself wishing for just one more class! It was a really sentimental experience all around.\n\nWhat about you?",
        "created_utc": 1678798275,
        "upvote_ratio": 1.0
    },
    {
        "title": "ALL LGBTQW-IA-PEDO'S MUST DI3 HORRIBLY",
        "author": "Choke_on_my_sausage",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11r4mvk/all_lgbtqwiapedos_must_di3_horribly/",
        "text": "[removed]",
        "created_utc": 1678796445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who has to return a shopping cart to its place?",
        "author": "snowbird35",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11r4dpl/who_has_to_return_a_shopping_cart_to_its_place/",
        "text": "When I go shopping, I\\`m almost always good with a basket. I used trolley... more than a year ago.\n\nRecently I have read one topic. It\\`s author wrote, that people, who leave a trolley on the parking are totally rude and many commenters agreed with him.\n\nBut I always was sure, that SPECIAL workers pick up carts. When I go to some shopping center, I often see workers, who are doing it. May be, they\\`re not special workers and it\\`s not their primary responsibilitiy? Then who are they?\n\nPeople, who works (or worked) in shopping centres, please, can you explain?",
        "created_utc": 1678795684,
        "upvote_ratio": 1.0
    },
    {
        "title": "How normal is it for friends to post a story on social media and not reply to DMs then?",
        "author": "WorldlyAd637",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11r4cya/how_normal_is_it_for_friends_to_post_a_story_on/",
        "text": "A friend of mine has been posting stories on social media but hasn't replied to my DM. She usually responds when she posts a story but this is a bit unusual. I talked to her 3 days ago. What do you think? Any advice would be appreciated",
        "created_utc": 1678795617,
        "upvote_ratio": 1.0
    },
    {
        "title": "How normal is it for friends to post a story on social media and not reply to DMs then?",
        "author": "WorldlyAd637",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11r4auw/how_normal_is_it_for_friends_to_post_a_story_on/",
        "text": "[removed]",
        "created_utc": 1678795439,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rules",
        "author": "Character-Ferret9025",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11r43cc/rules/",
        "text": "[removed]",
        "created_utc": 1678794813,
        "upvote_ratio": 1.0
    },
    {
        "title": "My husband’s sneaky way of making sure I stay hydrated",
        "author": "neuroticbrunette",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11r3wv7/my_husbands_sneaky_way_of_making_sure_i_stay/",
        "text": "My husband is out of town this week, the first time since we got married a few months ago. I realised this morning how thirsty I was but then noticed I wasn’t sure where my water bottle is, and when I went to get it, it was empty…\n\nI realised he fills both of our bottles constantly throughout the day and has a habit of putting mine near me. He even puts it next to me when I’m sleeping, on the side table for easy access. \n\nOnly when he’s not here did I notice the absence of this pure and sweet gesture. \n\nI miss my husband and I never want to be without him 🥲",
        "created_utc": 1678794244,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Collaboratory",
        "author": "Gold-Atmosphere2660",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11r3lus/the_collaboratory/",
        "text": " New problems require new approaches. The increasing complexity of our environmental, social and economic challenges requires an entirely new way for issue-centred stakeholders to co-create new solutions. Globally responsible leaders need different competences and sustainable organizations are called to assume a new role in society. Such wayfinders undergo a personal and organizational journey at the same time. This article suggests that if such personal and organizational journeys merge in service of solving societal issues, magic may happen. This article builds on a model that formally connects the fields of sustainability and responsibility, evaluating the value and need for a common transformative space for these fields and what such a space might look like. The article embraces the developmental perspective that frames sustainability within organizational development and responsibility within personal development. The article suggests a concrete approach, the “Collaboratory” for such a common space of transformation and critically evaluates its effectiveness to develop responsible leaders. The Collaboratory is considered as an emerging methodology for shamans of all kinds and from many fields to engage in co-creative stakeholder engagement processes. As such it becomes a common transformative space embracing the interdependency of responsibility and sustainability in practice. The Collaboratory may serve as a tool to help change agents to find their way towards responsible management and organizational sustainability in our increasingly challenging world.",
        "created_utc": 1678793248,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Collaboratory",
        "author": "Gold-Atmosphere2660",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11r3kkh/the_collaboratory/",
        "text": " New problems require new approaches. The increasing complexity of our environmental, social and economic challenges requires an entirely new way for issue-centred stakeholders to co-create new solutions. Globally responsible leaders need different competences and sustainable organizations are called to assume a new role in society. Such wayfinders undergo a personal and organizational journey at the same time. This article suggests that if such personal and organizational journeys merge in service of solving societal issues, magic may happen. This article builds on a model that formally connects the fields of sustainability and responsibility, evaluating the value and need for a common transformative space for these fields and what such a space might look like. The article embraces the developmental perspective that frames sustainability within organizational development and responsibility within personal development. The article suggests a concrete approach, the “Collaboratory” for such a common space of transformation and critically evaluates its effectiveness to develop responsible leaders. The Collaboratory is considered as an emerging methodology for shamans of all kinds and from many fields to engage in co-creative stakeholder engagement processes. As such it becomes a common transformative space embracing the interdependency of responsibility and sustainability in practice. The Collaboratory may serve as a tool to help change agents to find their way towards responsible management and organizational sustainability in our increasingly challenging world.",
        "created_utc": 1678793129,
        "upvote_ratio": 1.0
    },
    {
        "title": "Little dreams of things we never had",
        "author": "number93bus",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11r3h6o/little_dreams_of_things_we_never_had/",
        "text": "When I was a kid, I loved it whenever we got junk mail. I loved to look at the catalogues, look at the clothes that people would wear, from shops that we didn't visit when I was a kid, it was like window shopping, from home! It was like looking into a window of a life that someone else lived. I looked at the furniture in catalogues of shops that we couldn't afford to buy from. I looked at homewares. I looked at games and toys at the department stores. Things I always wanted but either we couldn't afford or my parents didn't think that was necessary. (I always wanted Barbies but was never allowed to have them lol) But my favourite? The houses!  \nSo here in Australia there are these charity lotteries where you can win different prizes or items, but also the grand prizes are these beautiful luxury houses and apartments. I always dreamed of them, imagining what our lives would be like if we lived in them, in these nice leafy suburbs, filled with the nice furniture and the large sweeping spaces and walk in closets and bathrooms larger than my bedroom at home.  \nLol, I still dream of that now! Except I am older, and every now and then I do buy a ticket - the funds go to raising money for MS -  and each time I get to enjoy the thoughts and dreams of living in one of these places... instead of my dreary one bedroom flat.  \n  \nWhat's something in your life, either from childhood, or now, that you wished you could have or have in your life but never had the chance? I'd love to hear your stories :)",
        "created_utc": 1678792830,
        "upvote_ratio": 1.0
    },
    {
        "title": "I listen to audio on different speeds",
        "author": "turbulentthoughtsmf",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11r2u8a/i_listen_to_audio_on_different_speeds/",
        "text": "I listen to music at 0.75-80 and podcasts at 1.5-2.0. I get tired easily or irritated if I don't. I can't seem to listen at normal speeds.\n\nIs this weird or do some people also do this? I'm really curious.",
        "created_utc": 1678790703,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling a bit down on my birthday",
        "author": "CNisme",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11r2p8m/feeling_a_bit_down_on_my_birthday/",
        "text": "Well hope I don’t sound like an bumhole or entitled, but today is my birthday.. and only 2 friends wished me and it made me feel a bit sad don’t know why. I usually make sure to wish all my friends happy birthday and set a reminder every year for it. If i see them i make sure to get them a gift just to say thank you for being  born and being a good friend. Usually do this as it makes me feel happy that there are happy 😊.\n\nI cop it up to everyone just being busy with their lives but I still feel a bit sad, kinda feel guilty for being sad.\n\nThanks for reading my little vent, hope everyone have a great day and happy white Valentine’s Day!",
        "created_utc": 1678790202,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the person who cooks wash the dishes or is this a seperate task for someone else to do?",
        "author": "lankysimmons",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11r1l8k/does_the_person_who_cooks_wash_the_dishes_or_is/",
        "text": "I love cooking and when I do cook, I *usually* try to clean as I go, but inevitably there’s dishes left at the end. Sometimes I wash the dishes when I’m finished however other times I’ll leave it for someone else to do. I cook for my family so everyone can eat however I’m thinking maybe it is unfair to treat it as though it’s a “chore” (when it is something I find fun to do) whilst getting someone to clean all my mess at the end. So what do you guys think: is the cleaning a part of the cooking process, or should others who eat the food be responsible for it?",
        "created_utc": 1678786019,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I ask this college acquaintance out?",
        "author": "hellowhatsup77",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11r0ueg/how_can_i_ask_this_college_acquaintance_out/",
        "text": "[removed]",
        "created_utc": 1678783173,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any prediction tournaments going on?",
        "author": "grusomeglitter",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11r0hn2/any_prediction_tournaments_going_on/",
        "text": "Hey guys! Basically what the title says. Is there any prediction tournaments active in any subreddits? I love playing them but all the ones I was a part of have ended.",
        "created_utc": 1678781852,
        "upvote_ratio": 1.0
    },
    {
        "title": "Favorite action movie of all time?",
        "author": "Mlyfuncouple1550",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11r04js/favorite_action_movie_of_all_time/",
        "text": "[removed]",
        "created_utc": 1678780495,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m Egyptian, lived in the UK for 5 years.",
        "author": "ArAirhead",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qz79c/im_egyptian_lived_in_the_uk_for_5_years/",
        "text": "Hey there! I'm an Egyptian, born and raised. Moved to the UK when I was 17. My interests range from writing (poetry and stories) to gaming, enjoying the outdoors and watching anime. I've been a boxer ever since I was 7 years old and still box to this day. I love staying active and working out. I game on PC, PS5 and Switch. I also read books and manga when I have the time and enjoy eating out with friends. I work full-time but always try to have some time for myself. I listen to everything from LoFi and Jazz to Rock and Alternative.\nWhats a country you've always wanted to visit and why?\nDo you believe in alien life?\nHit me up if you feel like we'd get along!",
        "created_utc": 1678777067,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would you do if you were me?",
        "author": "ric97cardo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qyxpb/what_would_you_do_if_you_were_me/",
        "text": "I have a gf that i met online and we are still in long distance relationship, and she got mild form of diabetes and she is working on it.\nThen i learned that her g.mom died because of diabetes and her dad has it too. So it's genetic issues.\nIt disturbed me but it's just diabetes\n\nThen yesterday i heard that her cousin is suffering a lung cancer at 30. And i also learned that her g.mom had a cancer and that was the main reason she died, diabetes made just things worse. So i thought this is genetic issue too. \n\nNow i am really worrying.\nShe is really a good person but what if those genetic threats passes to our kids? What if she suffer Cancer at some point in future too? \nAnd  it's still a long distance relationship and  it's still one year old online relationship....for me it's a big genetic red flag to consider.\nWhat would you do if you were me? \nWould you breakup or stay in the name of love?",
        "created_utc": 1678776105,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the most unknowingly dumb/silly thing you remember doing as a child?",
        "author": "flagrantwisdom",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qyo0r/whats_the_most_unknowingly_dumbsilly_thing_you/",
        "text": "It must’ve been around Christmas time, I was probably like 6 or 7 and wanted a bowl of cereal. I got myself a bowl and filled it with the cereal. When I went into the fridge for the milk, I noticed the carton was holiday themed. Okay, whatever. \n\nSo I poured it into the cereal and dug in. Took the first bite and immediately spat it out, because the milk tasted absolutely disgusting. I thought it must’ve been old or something. \n\nLater that night I watched my parents drink some of it, and I told them that it was old and rotten. That’s when I found out that it was egg nog. Also how I found out that I don’t like egg nog. Haven’t tried it in my adult life because the disgusting taste is burned into my memory. \n\nAnyway, what stupid shit did you do as a kid?",
        "created_utc": 1678775148,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't open my Talenti gelato jar.",
        "author": "EthnicallyMoral",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qy65x/i_cant_open_my_talenti_gelato_jar/",
        "text": "[removed]",
        "created_utc": 1678773482,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't open my Talenti gelato jar.",
        "author": "EthnicallyMoral",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qy36r/i_cant_open_my_talenti_gelato_jar/",
        "text": "[removed]",
        "created_utc": 1678773194,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hearing ships’ fog horns is so peaceful",
        "author": "_satantha_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qxwdu/hearing_ships_fog_horns_is_so_peaceful/",
        "text": "I live right on the Delaware River and I can see it from my house. At night time (or foggy days) the ships traveling down the river blow fog horns and it’s just so peaceful sounding. Maybe it’s because I’ve grown up listening to it, but I love it. The sound of raindrops hitting my roof and hearing the fog horns going off can just put me to sleep. Usually the horns aren’t super loud, just loud enough to be a calming sound. Just a little thought that I’m thinking of (as I am listening to the fog horns now).",
        "created_utc": 1678772541,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the most positive subs you've found?",
        "author": "lady__jane",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qxmcx/what_are_the_most_positive_subs_youve_found/",
        "text": "r/RomanceNovels has a great group - it's generally positive and fun there. Same with r/CasualConversation. What other subs have you found that are positive?",
        "created_utc": 1678771607,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recently broke up with my bf if 5 years",
        "author": "KeyCompetitive4022",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qxlka/recently_broke_up_with_my_bf_if_5_years/",
        "text": "Hi, i just broke up with my bf after 5 years. What now? I don't know where to start or what to do. Anyone have suggestions? Recommendations? Advice? All and anything is appreciated 🤓",
        "created_utc": 1678771531,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you rather be able to see (but not change) the future or the past?",
        "author": "aestheticbear",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qxclb/would_you_rather_be_able_to_see_but_not_change/",
        "text": "**You can see (but not change) any time in the past or future. Your childhood or your retirement; Ancient Greece or the year 3000. What do you choose: the past or the future? \n\nI would rather see the past. Rewatch happy childhood memories and the world before my time. The future scares me.",
        "created_utc": 1678770671,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ll be driving &amp; visiting a 6th US state next month!",
        "author": "Wordlywhisp",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qx5zh/ill_be_driving_visiting_a_6th_us_state_next_month/",
        "text": "Long story short, I had seizures my entire childhood. After a long period being seizure free, they returned when I was a late teen. Lost my drivers license for three years and just got it back two and a half years ago. \nIt still feels unreal to have my life back",
        "created_utc": 1678770089,
        "upvote_ratio": 0.99
    },
    {
        "title": "Dealing with loneliness",
        "author": "Inferno980",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qwm87/dealing_with_loneliness/",
        "text": "[removed]",
        "created_utc": 1678768371,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am afraid that in the future all the music will be made by artificial intelligence.",
        "author": "First_Mechanic9140",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qw8q9/i_am_afraid_that_in_the_future_all_the_music_will/",
        "text": "AI will write music and lyrics. Vocaloids will sing. Real people will not do anything. I am afraid Gen Z is maybe that last to actually make music. Vocaloids are already a big thing in Japan and will be in the West too in the future sooner or later. I fear that soon computers and machines will overtake the industry. Big corporations will produce singers and bands and make billions of dollars while real artists will starve under the bridge. Real human art will be gone.",
        "created_utc": 1678767179,
        "upvote_ratio": 0.99
    },
    {
        "title": "Looking for someone to chat to",
        "author": "nltrawda",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qvx4w/looking_for_someone_to_chat_to/",
        "text": "[removed]",
        "created_utc": 1678766234,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you talk to other people romantically if you truly liked someone?",
        "author": "anrezee",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qvoed/would_you_talk_to_other_people_romantically_if/",
        "text": "\nLike I get it you’re not official. But personally if I really like someone I’m not going to be talking to someone else in a more than friends way. I wouldn’t sleep with another person at the same time I was sleeping with someone I truly like. It does not feel right to me. \n\nI found out the guy who likes me was texting some girl (he for sure knows she likes him) last night around 1 am and he sent winky faces and was being flirty. He knows what she would be thinking by sending her that. \n\nLike am I being too much? This is why I can’t do relationships lol . Like in my eyes if he truly liked me then he wouldn’t be talking to other girls…….",
        "created_utc": 1678765513,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I a karma whore?",
        "author": "NoMoreF34R",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qvoam/am_i_a_karma_whore/",
        "text": "[removed]",
        "created_utc": 1678765505,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have the desire to do SOMETHING with their life but doesn’t know exactly what that something is ?",
        "author": "Lilshrek009",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qvnkb/does_anyone_have_the_desire_to_do_something_with/",
        "text": "I’m technically already doing something I suppose, I’m in college (uk) doing computing and soon moving on to a HNC in computing which will definitely set me up with great qualifications to get work in the tech field. \n\nThe thing is I still feel like I’m not doing something, I still have that desire to go out and make something of my self despite me currently doing that. I’ve moved to a new city with my girlfriend and started this course in the past year, technically I’ve done something and I’m currently doing something with my life. \n\nI dunno it just feels weird that I’m actively trying to improve my life and I feel no satisfaction from it. Maybe I’m on the wrong path, only time will tell. \n\nAnyone else had similar feelings ?.",
        "created_utc": 1678765442,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reincarnation sounds interesting, in theory, but I also want my consciousness to disappear.",
        "author": "javchezzi",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qvgf5/reincarnation_sounds_interesting_in_theory_but_i/",
        "text": "[removed]",
        "created_utc": 1678764861,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reincarnation sounds interesting, in theory, but I also want my consciousness to disappear.",
        "author": "javchezzi",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qvc6q/reincarnation_sounds_interesting_in_theory_but_i/",
        "text": "[removed]",
        "created_utc": 1678764536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone talk to me and take my mind off of some things?",
        "author": "KPal93",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qvaeo/can_someone_talk_to_me_and_take_my_mind_off_of/",
        "text": "Not looking for any advice related to the issue at hand, but just for info, I’m having major death-related anxiety tonight. I’ll be 30 in a few months and it has brought it on like a storm. Im not only worried about myself but losing all the people I care about, especially my husband. I don’t have kids either, and I feel the constant pressure of that biological clock ticking. Pair all of this with an overwhelming sense of dissociation most days and I am just not in a good place. Ugh…\n\nSomeone please talk about anything to take my mind off of this and ground me back in reality. What happened that was interesting today? What is something you’re looking forward to? What is something you think everyone should try? What is your favorite animal/color/food? Why? \n\nTell me literally *anything*😅.",
        "created_utc": 1678764392,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help me get out of this conversation. What do I do?",
        "author": "shittbuckets",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qvaep/please_help_me_get_out_of_this_conversation_what/",
        "text": "[removed]",
        "created_utc": 1678764392,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with losing friends in your 20s?",
        "author": "zoubisoupie",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qucfh/how_to_deal_with_losing_friends_in_your_20s/",
        "text": "Hi (f20) here first post on Reddit, honestly just looking for advice. I deactivated my social media accounts (not the first time but I guess one of the more longer periods I’ve taken without spending time on them) and it’s weird seeing how certain relationships have changed and realizing the nature of them since I’ve been off so long. People who I thought would text me or that I thought would keep conversation with me haven’t. In general this time off of social media has just made me analyze my relationships as a whole. I’ve definitely become distant with people since the pandemic, and in ways I think I’m still dealing with that transition of high school -&gt; college -&gt; real world, not being in an institution where I see the same people daily. But also I’ve noticed that close friends I’ve had for a while are just slowly fading out, my circle is becoming less and less, it’s becoming harder to find new people that I genuinely feel a connection to or a feeling that it’ll be a friendship that lasts. I guess what I’m asking is, how do you cope with this? I’ve been really thinking about it lately and it makes me feel really down.",
        "created_utc": 1678761739,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's one of your biggest life regrets?",
        "author": "okpotatooo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qtug9/whats_one_of_your_biggest_life_regrets/",
        "text": "[removed]",
        "created_utc": 1678760404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anxiety",
        "author": "Novel-Search-7212",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qtrgl/anxiety/",
        "text": "Anxiety is the absolute worst. It seems to never ever go away. And it’s mainly because you don’t know what the future may hold. You constantly think about your past and the mistakes you made, what you could do differently. I have made a ton if mistakes and they’re biting me in the ass right now. I just wish I could redo some things. But what’s life without lessons huh?",
        "created_utc": 1678760182,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got into Law School!",
        "author": "17reichertj",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qthuk/i_got_into_law_school/",
        "text": "Five years ago, I was utterly depressed, below average grades, and was in an abusive relationship. I finally decided to change my life and worked my ass off my last two years of undergrad. I finished my last semester with a 4.0. I got my acceptance into law school a few days ago and it still doesn’t feel real. Not only that but the school is offering me an insane scholarship. I just cannot believe this is real and I needed a place to positively vent about this crazy accomplishment. Love you reddit thanks for listening.",
        "created_utc": 1678759490,
        "upvote_ratio": 1.0
    },
    {
        "title": "College aged dude looking for gaming friends",
        "author": "Incognitotreestump22",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qt8el/college_aged_dude_looking_for_gaming_friends/",
        "text": "Recently during my school's spring break I've found that I have nothing to do but work and catch up on school work, which kind of sucks because everyone else is seeing their families. Would anyone here be interested in gaming with me? I'll have free time for it until the end of the week, after which I can make no guarentees.",
        "created_utc": 1678758829,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best candy?",
        "author": "UpbeatMammoth4143",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qt7w0/what_is_the_best_candy/",
        "text": "[removed]",
        "created_utc": 1678758791,
        "upvote_ratio": 1.0
    },
    {
        "title": "I dislike cheese in general... am I just built different? XD",
        "author": "M1ke____",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qt1af/i_dislike_cheese_in_general_am_i_just_built/",
        "text": "I've tried to like cheese for most of my life. I used to eat a lot of it as a kid, but I guess I got sick of it. Generally, if I can get something without any cheese I would, like pizza. (When I order a full pizza to myself I get it without cheese, with hot banana peppers, extra pepperoni &amp; extra sauce. Still tastes great!) However, I can eat cheese if there's a lot of stuff that is masking the cheese smell/taste such as all meat pizza or triple meat pizza pockets.\n\nIs this considered weird?",
        "created_utc": 1678758329,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips for a burlap sack race?",
        "author": "ExpressHousing4636",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qsn1d/any_tips_for_a_burlap_sack_race/",
        "text": "I have a sack race for school in about a week and have been practicing with a sack I found in my garage that goes just a bit above my waist all I need is some tips to help me master movement in the sack and help me get an advantage",
        "created_utc": 1678757336,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nostalgia, Photographs, and Moving",
        "author": "lazlowknows",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qsm49/nostalgia_photographs_and_moving/",
        "text": "We are moving from a house we've lived in for 20+ years and are downsizing from 2700 to 1700 square feet. All of the kids are grown and have lives and homes of their own. We have lots of pictures of the kids when they were young, pictures of our early marriage, and even more, we have the collected pictures from both sides of our families going back to the late 1800's. They've mostly been in boxes and in closets since we moved here and now we are making critical decisions about keeping/pitching them along with all of the other things we have accumulated. We've offered the pictures to the kids and they've taken what they want but nobody wants all of what's remaining.\n\nI'm not much in the \"need to keep everything because of the memories\" camp that my wife is. I say I still have the memories with or without the pictures. I don't think our future behavior in regards to them will change from our past behavior-that is, I think they'll go in a closet and we will forget about them. The thing that I keep coming around to is: will I feel guilty about throwing them away? What would you do and why? Is it so important to keep the picture if the memory alone brings you the joy? How do I rationalize tossing pictures of my kids as they grew up? If we keep them, then what?",
        "created_utc": 1678757269,
        "upvote_ratio": 1.0
    },
    {
        "title": "Childhood kind of was the peak of our lives if you think about it",
        "author": "WesternC29",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qsm2k/childhood_kind_of_was_the_peak_of_our_lives_if/",
        "text": "I'm talking about real childhood, before puberty and teenage shenanigans. This was a time where most of us had absolutely no worries about anything. Everything was a new experience and it was magical feeling whenever you learned something new. You could eat junk food whenever you wanted without worrying about getting fat. You could sit around watching TV or play with your toys all day and no one could tell you shit. The hardest thing you learned in school was 1+ 9 = 18  and that tomatoes are actually fruits! Summer felt like a long time and you actually changed during it, and you would come back to school in September and everyone else would be a little different as well. You were basically living like a king/queen and were always full of dopamine.\n\nI sometimes think back to when I was a kid in the 2000s. I wish it were 2008 again. I was 7. When I went to school, I learned about hurricanes and animals and other cool easy stuff. When I came back I rode my bike to the park to play soccer with my friends. After that I'd play Pokemon Diamond on my DS and watch a movie on our DVD player with my parents. On Friday nights, my dad and I would watch hockey or cricket on cable TV (remember that). Once a week, I got permission to use our computer to play flash games and look at the Weather Network. I'd get to visit my grandparents all the time and they'd make sweets for me. I still thought girls had cooties so I didn't even care about them. I really had no worries about anything. \n\nFast forward to today. I'm 22. I'm finishing up my degree in software engineering, but I'm not even sure if I'll graduate this semester. AI 2 is a bitch and none of it makes sense. I have a job lined up but it requires me to move 100s of kilometers down South away from everything I've ever known. I'm scared as shit of what's gonna happen once I graduate and have to uproot my whole life. My friends will all live in different cities and soon we won't be able to see each other anymore. I'll also be far away from my family, and my parents are older now and less healthy so there's always that worry. My grandparents are all gone. The only positive thing to happen to my family is that I have a sister now. The DS and DVD player I used to have? Broken and gone. My current bike? Stolen so I have to take the bus to campus. Girls? Well, my last girlfriend cheated on me so yeah and I'm on a dry spell. I learn new stuff everyday but none of it excites me anymore. Oh wow, so my rental agency decided increase rent again huh. Nice 👍🏽\n\nYou can't possibly tell me that anything will ever be as good as it was for us when were kids. I know this might sound dramatic but it feels like life is starting to end and the next chapter is just 40 years of commuting to work so I can watch some dude on Stack Overflow do all my work for me.",
        "created_utc": 1678757265,
        "upvote_ratio": 1.0
    },
    {
        "title": "I love painting my nails",
        "author": "Cranky-Novelist",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qrt5f/i_love_painting_my_nails/",
        "text": "[removed]",
        "created_utc": 1678755277,
        "upvote_ratio": 1.0
    },
    {
        "title": "I used to love listening to a certain genre of music but now I don’t. Why?",
        "author": "Franklyn-Chacha",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qrnuh/i_used_to_love_listening_to_a_certain_genre_of/",
        "text": "It sounds stupid up hear me out. Last year I fell in love with Gorillaz and I loved listening to their music old and new. But after an entire year of listening to them I find myself skipping their songs when they start playing on my playlist. It just seems like a chore to listen to honestly. I still think their music is great but I have little desire to listen to it. Did I just grow out of it?",
        "created_utc": 1678754905,
        "upvote_ratio": 1.0
    },
    {
        "title": "We’re all going to die someday, so why stress and worry?",
        "author": "YesiFuckedTed",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qre0m/were_all_going_to_die_someday_so_why_stress_and/",
        "text": "Every time I get caught up in worrying about the little things, there’s always that reminder in the back of my mind that we’re all going to die someday. \n\nIt’s morbid, but every time I experience stress, worry, sadness, anger, etc…. I remember this. One day it’ll all end. It won’t matter, I won’t be remembered for all the stupid, embarrassing, etc things that I did in life. \n\nIt also motivates me, knowing that I could go to bed fine and healthy tonight and not wake up tomorrow for whatever reason motivates me to live the best life that I can possibly live.",
        "created_utc": 1678754224,
        "upvote_ratio": 1.0
    },
    {
        "title": "Disposability and Abandonment",
        "author": "Slight_Distance_942",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qr9sx/disposability_and_abandonment/",
        "text": "[removed]",
        "created_utc": 1678753937,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the best piece of advice you've ever received?",
        "author": "yes1mhim",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qr34p/whats_the_best_piece_of_advice_youve_ever_received/",
        "text": "\n\nHey  everybody, \n\nI was reflecting on some of the best advice I've ever received in my life and wanted to open up a conversation with all of you. What's the best piece of advice you've ever been given, and how has it impacted your life?\n\nFor me, the best advice I've ever received is to focus on what I can control and let go of the things I can't. It's helped me to approach life with a more positive mindset, and to not get bogged down by things that are beyond my control.\n\nSo, what about you? What's the best advice you've ever received? I can't wait to read your responses and learn from your experiences. Let's have a casual conversation and share our wisdom with each other!",
        "created_utc": 1678753478,
        "upvote_ratio": 1.0
    },
    {
        "title": "we need a new planet!!",
        "author": "Purple-Revenue-6124",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qqfuy/we_need_a_new_planet/",
        "text": "[removed]",
        "created_utc": 1678751939,
        "upvote_ratio": 1.0
    },
    {
        "title": "wrong order",
        "author": "ExpressCharacter1465",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qqede/wrong_order/",
        "text": "So I ordered Subway, and midway the transaction was loading for a long so I refreshed the page and got an error message. Then later I got a text message that my subway order is on the way, although the transaction wasn't complete. So when the dasher arrived they handed me a burger king for(Both Subway and burger king are next to each other). So I am wondering, did this happen because the transaction wasn't complete and the order was \"dark kitchen\"? or what exactly happened?",
        "created_utc": 1678751834,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do people comment on a thread but not upvote it?",
        "author": "usuallyscrolling",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qqe1u/why_do_people_comment_on_a_thread_but_not_upvote/",
        "text": "[removed]",
        "created_utc": 1678751812,
        "upvote_ratio": 1.0
    },
    {
        "title": "This particular phrase bothers me",
        "author": "revuptea",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qq5v4/this_particular_phrase_bothers_me/",
        "text": "The phrase “loving on each other” really bothers me. I’m fine with “being affectionate” or anything along those lines, but something about describing it as “loving on” someone really gives me the ick.",
        "created_utc": 1678751270,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s a girl to do ? From office girl to strip club server",
        "author": "bratty_vick",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qq475/whats_a_girl_to_do_from_office_girl_to_strip_club/",
        "text": "[removed]",
        "created_utc": 1678751163,
        "upvote_ratio": 1.0
    },
    {
        "title": "🍭 Daddy",
        "author": "bratty_vick",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qpzk5/daddy/",
        "text": "[removed]",
        "created_utc": 1678750864,
        "upvote_ratio": 1.0
    },
    {
        "title": "🍭 Daddy",
        "author": "bratty_vick",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qpxb1/daddy/",
        "text": "[removed]",
        "created_utc": 1678750717,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was ordering a delivery from a Chinese restaurant over the phone and they wanted the 3-digit security code on my card, is this normal?",
        "author": "Pard01",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qpo1s/i_was_ordering_a_delivery_from_a_chinese/",
        "text": "Usually when I do debit for deliveries all they ask for is the 16 digit card number, but this time they wanted the expiration date along with the security code. This set off a red flag for me and I decided to pay in cash instead. Did I dodge a bullet?",
        "created_utc": 1678750123,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the color of your outfit affect your mood?",
        "author": "Delicious_Airport631",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qpf2o/does_the_color_of_your_outfit_affect_your_mood/",
        "text": "I feel like when I wear all black I instantly feel more “sad” or just without emotion. On the other hand when I wear something colourful I just feel more excited and happy about the day.\n\nDo you guys experience this too?",
        "created_utc": 1678749546,
        "upvote_ratio": 1.0
    },
    {
        "title": "In your opinion, what are the most important qualities for being a good conversationalist in real life? Do you think empathy and knowledge rank at the top?",
        "author": "Thegrandcultivator",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qpf0a/in_your_opinion_what_are_the_most_important/",
        "text": "I've noticed that when I have conversations with exceptional people, I pay close attention to how they communicate. I find that their ability to articulate their thoughts effectively is what captures my attention and keeps me engaged in the conversation.",
        "created_utc": 1678749542,
        "upvote_ratio": 1.0
    },
    {
        "title": "What were your parents like",
        "author": "PreparationNo7866",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qpdxs/what_were_your_parents_like/",
        "text": "My parents were very strict and stern. They were very stoic and rarely showed emotion. Since I was a precocious toddler my parents expected me to raise myself. I felt lonely and abandoned as I was an only child. Even when my parents would take me on summer vacations as a little girl for bonding trips they barely talked to me. They were also workaholics with my dad being an engineer and my mom being an accountant. \n\nI was expected not to show emotion and be a working machine only useful for getting good grades at school and making money. I feel there parenting style was terrible and I wouldn't wish it on any child. They followed the parenting model of children being seen but not heard. Though I am an introvert like my parents.",
        "created_utc": 1678749471,
        "upvote_ratio": 1.0
    },
    {
        "title": "Still reeling from the Last of Us season finale, can anyone relate?",
        "author": "Cryptanthusman",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qpbrq/still_reeling_from_the_last_of_us_season_finale/",
        "text": "What an ending to a great show for starters. I was pretty spellbound the whole time I was watching the series and definitely am looking forward to a rewatch when I get the time for a good binge. \n\nI didn’t even realize that episode nine was going to be the finale, nothing in the episode really gave many conventional clues that that was the case until the very end. As someone who hasn’t played the game, I’m currently eagerly awaiting the PC release now to experience such a good story myself. \nSPOILER WARNING ⚠️ \nAnyone else really just left in shock at Joel’s brutality at the end there? Killing what was essentially Ellie’s surrogate mother just like that without trying to find some kind of halfway solution? I’m struggling to clarify how I think of Joel here following the finale and wether or not he did the right thing. Kinda wishing there was a less dramatic conclusion for Marlene and I imagine most of the fireflies where they could work together without going straight to brain removal",
        "created_utc": 1678749337,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self pity / overcoming self pity talk …",
        "author": "Ill-Interaction1631",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qowp3/self_pity_overcoming_self_pity_talk/",
        "text": "[removed]",
        "created_utc": 1678748399,
        "upvote_ratio": 1.0
    },
    {
        "title": "A math teacher made me almost lose my fucking shit (with laughter)",
        "author": "YoungEgalitarianDude",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qntko/a_math_teacher_made_me_almost_lose_my_fucking/",
        "text": "[removed]",
        "created_utc": 1678746003,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wish there was a way to make voteless threads so I can hear some more rare opinions.",
        "author": "SalMinellaOnYouTube",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qnmmt/i_wish_there_was_a_way_to_make_voteless_threads/",
        "text": "I want to find some diamonds in the rough whether that’s a movie I might’ve missed;  a new YouTube channel; a recipe change up that I might not think of; or even what are the crazy new theories emerging in arts and sciences. \n\nIt’s kind of hard to find that stuff because if only one person knows about it all it takes is one jerk to come and downvote (usually just to boost their own comment or thread) and then that thing gets buried or worse dog piled.\n\nIf you have a thing that would otherwise get buried tell us about it in the comments.",
        "created_utc": 1678745587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Independent vacations.",
        "author": "Potatorailcar",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qn7nz/independent_vacations/",
        "text": "This year, before I even got in a relationship, I had decided I was going to explore the country. Well, this year is it. I've decided I'm taking a road trip out to the west, my girlfriend will be working and I'll be off during that week. I'm all for a healthy relationship and that includes trust and being able to keep your identity and enjoying things independently at times. How do you guys feel about a situation like this? Would you be able to do this with your SO?",
        "created_utc": 1678744690,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've been learning how to draw recently and it's so fun!",
        "author": "radio0021",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qn45g/ive_been_learning_how_to_draw_recently_and_its_so/",
        "text": "Last week I felt like trying to find a new hobby, or learning a new skill and so I got into drawing. I'm really enjoying it, there is something about drawing whatever pops into your head on a piece of paper that I really like\n\nI want to improve my drawing skills in general too so I would appreciate it if anyone here who knows a good youtube channel, website, or whatever that could help me improve with the basics and all of that. I'm just happy that I feel like I may have found a new hobby lol",
        "created_utc": 1678744484,
        "upvote_ratio": 1.0
    },
    {
        "title": "just gotta express my love for beverages",
        "author": "blueberryonthefloor",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qmdya/just_gotta_express_my_love_for_beverages/",
        "text": "i 100% am and will always be a beverage girly.\n\nstrong, hot black coffee? robust. sugary iced starbucks drink? yummy. kettle of tea? warm. hot chocolate with marshmallows and whipped cream? cozy. sparkling water? magical. smoothies? nutritious. green juice? energizing. elaborate drinks in home cafe tiktoks? enviable. homemade strawberry milk? wholesome. red wine on a warm summer’s evening? divine. water with cucumber and lemon and mint? special. flask of cheap whisky? thrilling. iced tea with lemon? southern. capri suns? nostalgic. gas station coffee? adventurous. big gulp diet coke? refreshing. mcdonalds sprite? powerful. fresh lemonade? summery. tap water? hydrating.\n\nwhat drink have you been loving recently?\n\nfor me, it's been lots of sparkling water. i've also renewed my love for cafe bustelo instant espresso packets. so good hot or iced",
        "created_utc": 1678742935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Presidential palindromes",
        "author": "Opus-the-Penguin",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qmdbg/presidential_palindromes/",
        "text": "[removed]",
        "created_utc": 1678742894,
        "upvote_ratio": 1.0
    },
    {
        "title": "beverages are elite and i have nowhere else to share my love for drinks",
        "author": "blueberryonthefloor",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qmcy4/beverages_are_elite_and_i_have_nowhere_else_to/",
        "text": "i 100% am and will always be a beverage girly. \n\nstrong, hot black coffee? robust. sugary iced starbucks drink? yummy. kettle of tea? warm. hot chocolate with marshmallows and whipped cream? cozy. sparkling water? magical. smoothies? nutritious. green juice? energizing. elaborate drinks in home cafe tiktoks? enviable. homemade strawberry milk? wholesome. red wine on a warm summer’s evening? divine. water with cucumber and lemon and mint? special. flask of cheap whisky? thrilling. iced tea with lemon? southern. capri suns? nostalgic. gas station coffee? adventurous. big gulp diet coke? refreshing. mcdonalds sprite? powerful. fresh lemonade? summery. tap water? hydrating. \n\nwhat drink have you been loving recently?\n\nfor me, it's been lots of sparkling water. i've also renewed my love for cafe bustelo instant espresso packets. so good hot or iced",
        "created_utc": 1678742872,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something that you want to share or say but don't know with who?",
        "author": "Part-Disegnos",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qm2el/something_that_you_want_to_share_or_say_but_dont/",
        "text": "I could share that this saturday I went out and bought some stuff, actually is the first time in years that I buy stuff that isn't strictly necessary so I felt good and very happy with my buyings.\n\nAlso I was looking for a job. Started a new one like a week ago and everything on the work enviroment was nice but I decided to leave so... Job hunting again lol\n\nLast but not least, I had like a 3 days spite for someone I barely know lmao I have some years alone and nothing bad with that, I'm alone because I want and I do pretty good by myself, but this girl appeared and I had a Crush so hard haha\n\nWhat about you?",
        "created_utc": 1678742249,
        "upvote_ratio": 1.0
    },
    {
        "title": "losing the inside jokes and endearment terms",
        "author": "BeeEyeAm",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qlzfm/losing_the_inside_jokes_and_endearment_terms/",
        "text": "I recently observed that some of my grief when losing a relationship with a person is the loss of terms of endearment or the inside jokes. It was sad to me this first time I said something that used to be an inside joke and no one understood it. It was also really sad to loose my pet name. \n\nDon't get me wrong, I'm building all these new inside jokes and pet names ect. But sometimes I just want to say \"I've got bed rats\" and someone else know I'm having a bad day and I'm just done. Or someone to use a little pet name that makes me do a wiggle dance, ya know? \n\nWhat's an inside joke, pet name, term of endearment you miss?",
        "created_utc": 1678742073,
        "upvote_ratio": 1.0
    },
    {
        "title": "45M - Looking for friendly chat",
        "author": "latinoguy007",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qlk7n/45m_looking_for_friendly_chat/",
        "text": "Happy Monday! Its the start of the week and back to work. I would like to find someone to chat with and just go from there. Dm's are open and tell me a bit about yourself. Have a good day!",
        "created_utc": 1678741171,
        "upvote_ratio": 1.0
    },
    {
        "title": "At the risk of sounding too AI attached delusional, it would be nice to have an AI that develops a \"personality\" based on how you talk to it.",
        "author": "Voxel_exe",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qlf3i/at_the_risk_of_sounding_too_ai_attached/",
        "text": "[removed]",
        "created_utc": 1678740864,
        "upvote_ratio": 1.0
    },
    {
        "title": "What makes a blind person horny?",
        "author": "Present_Bug7568",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qlemj/what_makes_a_blind_person_horny/",
        "text": "[removed]",
        "created_utc": 1678740837,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choose my meal prep!",
        "author": "spookyookykittycat",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qkm8v/choose_my_meal_prep/",
        "text": "Leaving to buy meal prep items for the week in an hour (ish). I want the protein to be chicken but I cannot think of what healthy sides I want. Please give me your favorite and best healthy sides besides just plain veggies or rice.\n\nGrazie!!",
        "created_utc": 1678739143,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you have a obscure/odd memory from childhood? What was it?",
        "author": "Bandaged-legs",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qk0yn/do_you_have_a_obscureodd_memory_from_childhood/",
        "text": "I've been unlocking some past memories at random, and one of them was just so obscure and strange. \n\nAs a kid I remember having so many dolls it was almost *too* many, and I had weekly \"meetings\" with them - I was a really lonely kid lol. But I just remembered one of those meetings. \n\nI had them all in a circle around me, like normal, then for some reason I had my phone out playing a really loud Taylor Swift song, and I had those little fake candles, I put some in some dolls laps and a few around me. I just sat in silence and waited for the music to play out. \n\nI don't know why I did that or what that was even for - but my best guess was it was a memorial for a doll?? Since I have \"grieved\" broken dolls before as a kid. So I really don't know if it was that or not, I definitely don't remember doing that on a different occasion. \n\nHow about you? Got any weird memories from childhood that make little to no sense?",
        "created_utc": 1678737905,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think there would be a way for me to reconnect with this friend?",
        "author": "Due_Consequence_2182",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qjvc4/do_you_think_there_would_be_a_way_for_me_to/",
        "text": "[removed]",
        "created_utc": 1678737584,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm so scared and worried about graduating university",
        "author": "WesternC29",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qjsgi/im_so_scared_and_worried_about_graduating/",
        "text": "I graduate this year and have no clue what's going to happen. I'm just worried that my life will go downhill from here. That I'll lose my friends. Worried that I'll live a boring 9-5 schedule for the next few decades and not fulfill anything that I can cherish. Worried that I won't meet as many people my age anymore. I seriously don't know how you people in your 30s and 40s do it, but I'm nearly 23 and feel like my life is already coming to a close. Wth do I do?",
        "created_utc": 1678737402,
        "upvote_ratio": 1.0
    },
    {
        "title": "I like the Forested Areas",
        "author": "GB819",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qjost/i_like_the_forested_areas/",
        "text": "To start a casual conversation, I liked forested areas.   They are great for running if you are in shape to run or walking if you aren't in shape.   The aroma of the plants and trees smells nice and the footing is over the paved rocked and dirt.   This is in the northeast USA, but I am sure that forested areas exist in other areas.",
        "created_utc": 1678737175,
        "upvote_ratio": 1.0
    },
    {
        "title": "I embarassed myself so bad at a party",
        "author": "Ijusti",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qjb0u/i_embarassed_myself_so_bad_at_a_party/",
        "text": "i always get drunk more than i want at parties but yesterday was so bad. i fought with a friend and lost while everybody was watching because i was drunk af and i wasnt even punching, i apparently was pushing everyone for no reason and i threw a chair on some people in a bed (????) apparently i was also saying some random af stuff and some ppl told me i was hella embarassing. like i just look like such a dumbass man, like i said it's always a bit like that for me at parties but that was wayy too much. i didn't even realise that. some people also told me it was not that bad but still man this is such a hit for like reputation and my ego. i know this sounds self centered and all but like being that embarrassing is just not fun man. i could have done worse i guess but yeah i wish i could just go back and drink less. at least i learnt a lesson i guess. sorry for the formating, im on my phone. i dont even know why im posting that but yeah",
        "created_utc": 1678736332,
        "upvote_ratio": 1.0
    },
    {
        "title": "law of attraction",
        "author": "UpbeatMaintenance154",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qjah6/law_of_attraction/",
        "text": " so my whole life I've noticed that if I pick a line out of store and be the only one in it all of a sudden they'll be a lot of people behind me , or if I walk into a store and me or a friend are the only ones in there all of a sudden the whole store will be full within minutes all of a sudden... how many of you does this happen to you?... and does that mean that my magnetic energy is strong?",
        "created_utc": 1678736298,
        "upvote_ratio": 1.0
    },
    {
        "title": "My request to HR.",
        "author": "huskergirl8342",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qj483/my_request_to_hr/",
        "text": "I would like to request 4 hrs of bereavement for the death of my dog to use towards taking my husband to a doctor appointment.  He is getting a port put in for chemo.  Do you think this is a new one for HR?  I am laughing at the absurd nature of this and what my life has been in the last week.  Laugh or cry and I am at of tears at this point.",
        "created_utc": 1678735926,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a friend who always talks about other people’s money",
        "author": "goldleavesforever",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qj1d2/i_have_a_friend_who_always_talks_about_other/",
        "text": "Every time we talk, it always seems to be about money. No matter what other thing the topic starts to change to, he brings it right back around to money. Usually about other people’s money. He knows a lot of successful people and he talks all about their wealth, how much money they make, how much their houses cost. He even shows me pictures of their huge mansions and properties. He just starts whipping out these saved photos he has of other people’s properties. It’s been happening more and more as of late. I’ve been knowing him for about 4 years. He always did this, but lately he’s been (almost aggressively) dominating our conversations to what he wants to talk about (money). \n\nI’ll try to change the subject and he will totally ignore what I said and keep controlling the conversation. Lately he has been going through some financial troubles, so I can understand why he’s becoming increasingly obsessed with it. He’s been talking about how he doesn’t have much money and talks about how so and so has this but he doesn’t etc. He talks about how rich his dad is and that his dad never helps him. (Then later he told me his dad is actually on a fixed income?) He talks about how good his brother has it compared to him. \n\n\nBut here is another thing: he seems to stay up really late, like into the wee hours of the morning, which means he’s also sleeping in late. He has no dependents. Not married. He’s a grown man. Nothing is stopping him from going out and getting a job. Or even two jobs. If he wants money so bad, he lacks the initiative to go out and try to get it. He used to provide music lessons which is how he earned his income, but lately something happened and he has to think of a new way to make income. I just don’t understand why if he wants money, why he doesn’t become more proactive about it instead of complaining so much and obsessing over other’s success. \n\nAlso, this guy has options, if he’s telling the truth. It’s not like he will ever go homeless or hungry. He does have a nice rental house. It’s beautiful. He shouldn’t be complaining so much because he’s got it better than a lot of people. \n\nI finally made a little comment, and I said, “We always end up talking about money lol.” He got very insulted by that. \n\nHow do I help this 50 year old man?",
        "created_utc": 1678735766,
        "upvote_ratio": 1.0
    },
    {
        "title": "I tried the American Cheese in Ramen thing and did not care for it.",
        "author": "SalMinellaOnYouTube",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qiw8e/i_tried_the_american_cheese_in_ramen_thing_and/",
        "text": "I keep seeing putting a slice of American Cheese in with your Ramen being pushed everywhere so I gave it a shot. It didn’t sound good to me but you never know.\n\nI make the worlds greatest Cole Slaw and I can’t *give* the recipe away because people think they know better. I didn’t want to be like that so I put some cheese in my ramen. I did not enjoy it.",
        "created_utc": 1678735453,
        "upvote_ratio": 1.0
    },
    {
        "title": "What historical buildings/structure/objects do you wish could speak?",
        "author": "internationalslug",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qi6r7/what_historical_buildingsstructureobjects_do_you/",
        "text": "It’s a broad question, but think of any objects or locations of historical value that would be super interesting or insightful if it can tell its own stories. \n\nMine would be Qin Shi Huang’s tomb, or more famously known as the Terracotta army. \n\nThe first Qin emperor was a fascinating historical figure. Some credited him with standardizing Chinese practices and social norms, with a legacy that lasted centuries. And others blame him for brutally surpressing scholars and responsible for the deaths of millions during his conquest of China and the construction of the Great Wall. \n\nThese objects give us a glimpse of a man he was, but they can never tell the full story. I want to hear the Terracotta soldiers tell of how the mausoleum was constructed? Or how the statues were sculpted? Or what did the general public think of him? What was he like toward the end of his life? What did a unified ancient China look like? \n\nHow about you? What are some objects of historical value you wish could speak?",
        "created_utc": 1678733917,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone here really like spicy food?",
        "author": "cloudymeatballdude",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qi5lj/does_anyone_here_really_like_spicy_food/",
        "text": "I’ve been tryna build up my tolerance although it’s already pretty good, i just ate two packs of those 2x spicy noodles that everyone was talkin about and it didn’t feel as spicy as everyone made it seem.\n\nI hope i can move onto even more spices, like some real intense hot sauces. For now i’m just practicing haha\n\nI just can’t enjoy non spicy meals as much, it’s like a meal being spicy makes it so much better no matter what, it’s so delicious\n\nI think it might have to do with my upbringing, we had so much hot sauce and peppers with our rice that it grew on me and i just love adding hot peppers and hot sauces on my food.",
        "created_utc": 1678733841,
        "upvote_ratio": 1.0
    },
    {
        "title": "Heartwarming quotes needed",
        "author": "tori_christensen502",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qi2is/heartwarming_quotes_needed/",
        "text": "I braille sayings onto pottery and I’m looking for some beautiful things to write! Please help me think of 1-3 sentence sources quotes or sayings that I can put on my pieces! Please. ❤️",
        "created_utc": 1678733645,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wondering what your experiences are with privatized healthcare?",
        "author": "Acceptable-Jump1240",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qhjsx/wondering_what_your_experiences_are_with/",
        "text": "[removed]",
        "created_utc": 1678732492,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else feel like music in general sucks?",
        "author": "drums-please-fab-",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qgo5r/does_anyone_else_feel_like_music_in_general_sucks/",
        "text": "I've spent countless hours listening to music in the hope that something, *anything* will grab my attention. First i listened to practically every popular artist from the 60s to the 2020s, as well as a collection of 50s jazz artists. Then i tried classical pieces and more obscure early modern compositions. No genre under the sun is unfamiliar to me. And yet nothing stays in my head, nothing leaves me amazed. \n\nIf music has any chance of keeping my iterest, it’s going to have to move beyond the same palatable but predictable notes, meters, melodies, timbres, and harmonies.",
        "created_utc": 1678730480,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many times in your life have you been dating someone then met someone you liked a lot more so you kinda just made up drama to dump whoever you were dating?",
        "author": "mikebalsaricci",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qgc3j/how_many_times_in_your_life_have_you_been_dating/",
        "text": "Do you think that's a normal thing to do? If you've done it what was that like? Did you feel guilty? Or do you think it's the right thing to do and you justify it to yourself? I've only ever been on the other side where it seemed like this was the case and it was, but you can't really doubt the person because obviously they don't want to be with you anymore regardless. Obviously every relationship is its own thing so you can't really judge, but what are your general thoughts on this?",
        "created_utc": 1678729704,
        "upvote_ratio": 1.0
    },
    {
        "title": "pranks are a great part of human behavior",
        "author": "he-who-eats-bread",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qfvsi/pranks_are_a_great_part_of_human_behavior/",
        "text": "i love pranks but i haven’t made close enough friends since i’ve moved, so i haven’t done them in a while. but i saw a really funny one the other night and it made the guy laugh so safe to say it was successful.\n\nlast night i was at a party with my partner and neither of us knew a lot of people. i met a guy named jack and we were chatting for a while when he started to mix a shot of 2/3 sweet flavored svedka and 1/3 coke. classy, i know. he filled the vodka, and while we were talking neither of us saw his friend take the shot. jack filled the full thing with coke and drank it, then his friend told us that there was no alcohol in it. no one else saw but we all had a good laugh about it.\n\ni love watching planned or spur of the moment pranks where everyone has a good time. besides that one i haven’t seen or pulled off any in a while, please tell me your good stories about pranks!",
        "created_utc": 1678728671,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could I convince you to read or beastars?",
        "author": "regoshi73",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qfux4/could_i_convince_you_to_read_or_beastars/",
        "text": "[removed]",
        "created_utc": 1678728622,
        "upvote_ratio": 1.0
    },
    {
        "title": "lol wut?",
        "author": "Appropriate_Rent_243",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11qfdma/lol_wut/",
        "text": "[removed]",
        "created_utc": 1678727480,
        "upvote_ratio": 1.0
    }
]