[
    {
        "title": "How do you find good people to have good people to interact with? I am trying Pen Pals, my thoughts in here",
        "author": "bfeeny",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p1qsy/how_do_you_find_good_people_to_have_good_people/",
        "text": "So I just started doing the pen pal thing. I have a combination of domestic and international pen pals. The thing that is hard, is finding people that are kind, interesting and put effort into their letters. If you think about it, it's very similar to how casual conversation can be. Sometimes you may be out, say at a bar, and you can't get anyone to talk, or people talk and it's just the most dry conversation, etc. Sometimes its amazing.\n\nMy thoughts with pen pals is it's a bit of a numbers game. You can only do so much diligence, and then you just have to try it, and if it's not working you just say goodbye to those people and replace them with others.\n\nI put some of my ideas into a video I posted to one of the pen pal groups, thoughts? ideas?\n\n[https://www.dropbox.com/s/f6y6lve63rgy680/Pen%20Pal%202%20-%20SD%20480p.mov?dl=0](https://www.dropbox.com/s/f6y6lve63rgy680/Pen%20Pal%202%20-%20SD%20480p.mov?dl=0)",
        "created_utc": 1678585400,
        "upvote_ratio": 1.0
    },
    {
        "title": "I left for college and got a new cat, and now my two childhood cats hate me",
        "author": "LimeKittyGacha",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p1n2x/i_left_for_college_and_got_a_new_cat_and_now_my/",
        "text": "[removed]",
        "created_utc": 1678585105,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you all think that having a social media account that follows friends/family but never posts anything is kinda creepy?",
        "author": "caramelcoconutmuffin",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p1l18/do_you_all_think_that_having_a_social_media/",
        "text": "I understand not being active on social media as I only upload a few pics a year on instagram. But there are some people I personally know who I mutually follow that just lurks while never having any posts or shares.",
        "created_utc": 1678584939,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m a 40M smoking pot for the first time",
        "author": "Savings_Bar_435",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p1auu/im_a_40m_smoking_pot_for_the_first_time/",
        "text": "This is pretty good stuff. I’ve never done pot before but my wife and kids are out of town and I had a six pack and figured why not try some Mary Jane?\n\nWell I went to the pot store and bought a pre roll and just lit that sucker up. \n\nRight now I feel like I have superhero hearing, like there’s clocks in other rooms I can hear ticking. And I can hear my heart beating in my chest. I also have bloodhound like sense of smell. \n\nAnd now I don’t know if I’m getting paranoid. I might be but might not. I hope I don’t I hate being paranoid",
        "created_utc": 1678584145,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone feel like this ?",
        "author": "Racha_bmj",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p18g0/does_anyone_feel_like_this/",
        "text": "I used to be in a dark place mentally which led me to be blinded and pretty much an asshole, being hurt made me think a lot of nonsense and I ended up hurting myself lol \nSince I’m doing better, I just look back and think « how the fuck did I overthink that shit and made all of this up » \nNah but like fr it’s crazy how being bad mentally can really stuck u in a vicious cycle \nAnd not gonna lie, sometimes I juste regret those moments, I wish I was more conscious",
        "created_utc": 1678583954,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m a 40M and sitting here smoking pot for the first time.",
        "author": "Savings_Bar_435",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p170z/im_a_40m_and_sitting_here_smoking_pot_for_the/",
        "text": "[removed]",
        "created_utc": 1678583843,
        "upvote_ratio": 1.0
    },
    {
        "title": "whats the best subreddit for random questions?",
        "author": "QLX1",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p11nc/whats_the_best_subreddit_for_random_questions/",
        "text": "whats the best subreddit for random questions?\n\nFor example This one requires long questions and other things\n\nAskreddit can buy too busy sometimes\n\nAsk didn't seem vary engaging",
        "created_utc": 1678583432,
        "upvote_ratio": 1.0
    },
    {
        "title": "whats the best subreddit for random questions?",
        "author": "QLX1",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p0xuh/whats_the_best_subreddit_for_random_questions/",
        "text": "[removed]",
        "created_utc": 1678583153,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone bored and wanting to chat? :p",
        "author": "Far_Cap7189",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p0t5d/anyone_bored_and_wanting_to_chat_p/",
        "text": "24yo gay dude living in Paris here, I’m not specifically looking for a romantic relationship or sexting, I just feel like chatting with a stranger… I’m also a good listener, I promise haha 🫶",
        "created_utc": 1678582813,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any good Bollywood recommendations?",
        "author": "ice-malice",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p0nq5/any_good_bollywood_recommendations/",
        "text": "I keep seeing Bollywood films on Netflix that look pretty interesting, but I don’t even know where to start. Anyone out there have any Bollywood suggestions or can point me in the right direction? Really trying to expand my film taste :)",
        "created_utc": 1678582407,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are peoples headlights getting absolutely ridiculous or is it just me?",
        "author": "Pooky-Almighty",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p08q4/are_peoples_headlights_getting_absolutely/",
        "text": "I live in the rural Midwest, and I commute to work at 6AM so this might be a more local issue, but man it seems like it’s getting absolutely insane how bright they are. \nI drive a little 07 civic, and I just get skillfucked by these guys with those bright ass headlights. \n\nIt occurred to me a few weeks ago… I was driving to work and I completely spaced that I had my brights on. Not one person flashed me or did anything to notify me that I was fucking up. I remember getting my license 10 years ago and if I had my brights on for slightly too long back then I was getting flashed.",
        "created_utc": 1678581304,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you find good people to have Casual Conversation with? I am trying Pen pals, some of my thoughts in here",
        "author": "bfeeny",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p06yv/how_do_you_find_good_people_to_have_casual/",
        "text": "So I just started doing the pen pal thing.  I have a combination of domestic and international pen pals.  The thing that is hard, is finding people that are kind, interesting and put effort into their letters.  If you think about it, it's very similar to how casual conversation can be.  Sometimes you may be out, say at a bar, and you can't get anyone to talk, or people talk and it's just the most dry conversation, etc.  Sometimes its amazing.\n\nMy thoughts with pen pals is it's a bit of a numbers game.  You can only do so much diligence, and then you just have to try it, and if it's not working you just say goodbye to those people and replace them with others.  \n\nI put some of my ideas into a video I posted to one of the pen pal groups, thoughts? ideas?\n\n[https://www.youtube.com/watch?v=LiVHzcXqyMY&amp;t=9s](https://www.youtube.com/watch?v=LiVHzcXqyMY&amp;t=9s)",
        "created_utc": 1678581176,
        "upvote_ratio": 1.0
    },
    {
        "title": "Las películas de terror ya no dan miedo y pecan de ridículas.",
        "author": "greenapplepocket",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p06l5/las_películas_de_terror_ya_no_dan_miedo_y_pecan/",
        "text": "el género de terror en general aparte de perder popularidad en los últimos años ha demostrado también la baja calidad que tienen estas películas actualmente, al punto de que las películas de terror pre-2015 generalmente no dan nada de miedo y dependen solo de screamers o CGI baratos. ¿están de acuerdo?",
        "created_utc": 1678581149,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone tell me the difference between these sports?",
        "author": "RefrigeratorCivil693",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11p05px/can_someone_tell_me_the_difference_between_these/",
        "text": "So I’m just a little confused on what the difference between these three sports. So any help would be helpful.\n\nSo any ways what is the difference between Cheerleading, Majorette, and Drill Team? \n\nIs one of them harder or easier to do? Do you need to be more flexible to do one or is one more choreographed?\n\nIf anyone could clear this up and explain to me that’ll be helpful.",
        "created_utc": 1678581085,
        "upvote_ratio": 1.0
    },
    {
        "title": "My cat brings me things, and just stares at me when I don't take the gift.",
        "author": "Bandaged-legs",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ozudp/my_cat_brings_me_things_and_just_stares_at_me/",
        "text": "It's mostly tea bags, she started doing it as a kitten and has definitely perfected the craft of gifting - she used to poke holes in the bags with her little teeth. Now a few years later she seems to of learned how not to ruin the important part of the bag. \n\nI've been sad a lot lately and I realized my emotions equate to how many \"gifts\" she gives me, like how last night I was crying, and she went back and forth - kitchen to bedroom, giving me black tea, tea bags. Everytime she got one she'd gently headbutt my leg so I'd look at her, then she would wait for me to grab them. When she stopped I had seven teabags and a very proud cat making biscuits on my blanket. I just couldn't feel sad after that. \n\nShe gives me other things too, socks, rags, her toys, my stuffed animals, the list continues. \n\nAnyway, this all made me curious, do you have a pet that gives you things?",
        "created_utc": 1678580274,
        "upvote_ratio": 1.0
    },
    {
        "title": "Social Loner?",
        "author": "Emsflyer1984",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ozmxt/social_loner/",
        "text": "Just a quiet observation, looking for some validation.  I find myself in this weird place where I am social to degree, I hang out with work friends after work, etc… But I feel a weird romantic draw to being a loner. I think and dream about solo hikes in the mountains, lots or self reflection, hanging at home by myself getting lost in some music…. It’s a weird juxtaposition. I want to hang out with my friends but I also just want to be alone with my thoughts.  I believe I get this from my father. He was a regular guy, worked a blue collar job, and had a few friends but at the end of the day, he was home with us, playing is steel guitar, writing short stories and poems, watching the news…. I always got the sense that my father longed to live at sea, just drifting among the waves with his thoughts… Does anyone else have this feeling of both being social and wanting to be a loner? I have friends who are social butterflies and really hate to be alone. Just thrive on social contact. Others who don’t come out when they’re invited. Who just stay to themselves. I feel like I’m both. Social and loner.",
        "created_utc": 1678579748,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some youtubers that were way better years ago or passed their peak in your opinion?",
        "author": "TheFinalSkittle",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ozmue/what_are_some_youtubers_that_were_way_better/",
        "text": "(Not including Pewdiepie because he is literally retired)\n\nFor me its Markiplier or Flamingo (He’s a roblox youtuber alot of you probably wont know who he is) Mark was just so much better 5-7 years ago. It used to be actually funny content that I could watch for hours and now something about him just isn’t the same.",
        "created_utc": 1678579742,
        "upvote_ratio": 1.0
    },
    {
        "title": "good or evil? Villan or hero?",
        "author": "The_blacknwhite",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oz7uw/good_or_evil_villan_or_hero/",
        "text": "[removed]",
        "created_utc": 1678578728,
        "upvote_ratio": 1.0
    },
    {
        "title": "i’m so in love that it hurts",
        "author": "mmtittle",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oyhka/im_so_in_love_that_it_hurts/",
        "text": "i’m so in love with her. she only just left an hour ago and i already miss her more than anything. she is so kind and funny and pretty and just such a wonderful person and for some reason, she chose ME??? today was our three month anniversary and i didn’t even realize until she pointed it out. i cant wait to have a future with her.",
        "created_utc": 1678576928,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which anime girls do you want in a Boxing tournament? (for a crossover anime, explain your picks)",
        "author": "Twili95",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oyg4z/which_anime_girls_do_you_want_in_a_boxing/",
        "text": "Nikaidou from Dorohedoro because she participated in a Boxing tournament in the manga for a few panels. I hate that the anime skipped it.\n\nGamo-chan from Don't Toy with Me, Miss Nagatoro because she does martial arts.\n\nMinori from Toradora because Ami insulted her for hitting too hard (called her Hercules for being uncharacteristically aggressive)",
        "created_utc": 1678576828,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it just me or was Subway better tasting 20 years ago?",
        "author": "ratatard",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oy8r3/is_it_just_me_or_was_subway_better_tasting_20/",
        "text": "I remember Subway sandwich as the best thing ever. Over time they removed the oil and the red vinegar, replacing them with more processed sauces like chipotle and ranch. The bread that used to be good in itself somehow changed and now it needs to be toasted to be somewhat edible. Even the meats and vegetables are not as tasty as it used to be. \n\nOr maybe everything is only in my mind and the complex sauces and the toaster are actually improvements. \n\nWhat's your opinion?",
        "created_utc": 1678576323,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why North Korea leaders won't give up their power?",
        "author": "QuorusRedditus",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oy06p/why_north_korea_leaders_wont_give_up_their_power/",
        "text": "Why would anyone want to be leader of hungry, ill and poor people instead of giving up and surrender to South that is 57 times richer and have super high tech? \n\nMy reasoning is: its better to be cleaner or cook, employed by rich person than to be a king of beggars.\n\nI would prefer to have real life benefits than to lie to myself that im important. \n\nNorth Korea, generals and other top officials, on paper, are at the top hierarchy of their country but at the same time their salary and standard of life is still bad compared to just ordinary person in South Korea. \n\nSure, you won't be starving from hunger within North Korea borders because soldiers will confiscate food for you, but hunger is not even a thing in XXI century and we even waste 50% of food in Europe and US.\n\nSo what is the point of keeping this terrible organisation of terror and torture and being in the top of hierarchy when bottom or other hierarchies are better?",
        "created_utc": 1678575771,
        "upvote_ratio": 1.0
    },
    {
        "title": "I love girls so much",
        "author": "bean-supreme",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oxob3/i_love_girls_so_much/",
        "text": "just like platonically in the most arbitrary ways like how we love sharing new lotion that smells good and getting silly cocktails at brunch. Or share stickers and cute stationery and makeup in the bathroom or if we don't have a pad or tampon we'll all of a sudden become extroverted and ask around. For late night milkshakes or bringing you midol and asking to text us when you get home and keeping each other safe\n\nidk I love girls lol",
        "created_utc": 1678574991,
        "upvote_ratio": 1.0
    },
    {
        "title": "DAE have life periods where you feel bored by everything? What do you do?",
        "author": "summerv1bes",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oxcfz/dae_have_life_periods_where_you_feel_bored_by/",
        "text": "Rn I am trying to distract myself because all I want is weed, which I am staying away from for numerous reasons. It's hard at times like these tho!",
        "created_utc": 1678574199,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do we buy expensive smartphones?",
        "author": "Total-Drama---",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oxc49/why_do_we_buy_expensive_smartphones/",
        "text": "Obviously, not all of us. Obviously, some of us need better devices for work.\n\nBut many of us don't. We don't even like calling people anymore, we're just texting. We only need our phones for whatsapp, reddit, twitter... and we take pictures from time to time.\n\nEven cheap smartphones have great battery, most of us buy new phone every 2-4 years so it's not like more expensive devices will stay with us longer.\n\nTo be clear, I'm one of those people. US DOLLARS IS NOT MY CURRENCY, I'M PRESENTING YOU THE PRICE IN MY CURRENCY JUST TO SHOW YOU THE DIFFERENCE - I paid 2300 for my phone last year and I bought my mom a phone for 900 this year. Honestly, I don't see much of a difference. Her phone has 4/128GB, fast charging, takes great pictures. Sure, my device has better parameters but... I don't need them for reddit lmao\n\nWhy do we buy expensive smartphones? Do you really need your device, would it make any difference if you paid less?",
        "created_utc": 1678574178,
        "upvote_ratio": 1.0
    },
    {
        "title": "I really enjoy studying polytheistic religions!",
        "author": "DerelictB",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ow44h/i_really_enjoy_studying_polytheistic_religions/",
        "text": "In my personal experience, I have found that monotheistic religions like Christianity feel constricting in their emphasis on a single deity. Conversely, polytheistic religions provide a wider range of options for worship and belief. \n\nFor example, in Greek mythology, there are numerous gods and goddesses to choose from, each representing a unique set of values and principles. This allows for a more personalized approach to spirituality, which is very appealing to me. As an example, one of my coworkers has a tattoo of an Egyptian god that resonates with her personal beliefs and values.",
        "created_utc": 1678571225,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t get why people hate when I call or text them when I’m just in the next room or upstairs or down the hall",
        "author": "MooMooTheDummy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ow2pi/i_dont_get_why_people_hate_when_i_call_or_text/",
        "text": "Like sure I could get up and go talk to you but why for one sentence should I drop everything I’m doing and go walk to you. Also it’s more about training you\n\nBecause do people ever actually walk to the other room to talk to someone? No we just yell back and forth and it’s very much not practical considering that I’m hard of hearing so there’s a good chance you’ll have to yell very loud and I’ll hear you yelling but keep yelling WHAT?! Until eventually I walk out just for you to say “haha look at this video!” Which maybe bad example you should really just text me the link but you know or it’s like pass me the remote idk\n\nBasically I’m hard of hearing so yelling back and forth is really is wasting both of our time. And even with two people with perfect hearing i still don’t see the point of yelling just text or call \n\nThis whole technology has made us lazy yea that’s the point lazy=easier\n\nAlso too often have I been accused of ignoring something especially if I’m busy in my room  and my door is shut there is no way imma hear you yelling my name. So then you gotta come to my room knock on the door and interrupt me then you get annoyed at me for what could’ve been a two second text conversation \n\nAlso if I do happen to hear you yelling I’ve sorta been trained accidentally to know that it means meal time. So I’ll probably run right past you and into the kitchen then be confused that there’s no food",
        "created_utc": 1678571129,
        "upvote_ratio": 1.0
    },
    {
        "title": "Had a great conversation with an interesting Lyft driver.",
        "author": "john510runner",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ow1a8/had_a_great_conversation_with_an_interesting_lyft/",
        "text": "He’s turning 50 later this year. He said he’s driving Lyft for extra money for trips to see 50 states before the year is over. His 12th state of the year will be Kentucky for the Kentucky Derby. After that he said he’s going to do a road trip for months to see the other 38 states. Frank you’re the most interesting Lyft driver ever. Anyone else have fun conversations while riding Lyft/Uber?",
        "created_utc": 1678571033,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal for your parents, even now that I'm an independent adult, to ask if you're eating?",
        "author": "MidlandsRepublic2048",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ovmq3/is_it_normal_for_your_parents_even_now_that_im_an/",
        "text": "For reference, I have no history of eating disorders or anything like that. I do have to press of episodes but I usually end up eating more when those episodes happen. It's just a sign that they care??",
        "created_utc": 1678570045,
        "upvote_ratio": 1.0
    },
    {
        "title": "I keep having these weird dreams about being at college.",
        "author": "IAmNotAFetish",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ovlat/i_keep_having_these_weird_dreams_about_being_at/",
        "text": "I'm 40. I have actually thought about going back to school, but it seems most nights I will have a dream where I forgot to take a final exam , or I will get lost trying to figure out where one of my classes is or that my mom gets mad at me for being late to class. Lol I feel like these dreams are trying to tell me something. Anyone of y'all have these same type of dreams ?",
        "created_utc": 1678569943,
        "upvote_ratio": 1.0
    },
    {
        "title": "Online friends",
        "author": "Shaystadium88",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ovb6k/online_friends/",
        "text": "I’m in college full time and a lot of the friendships I have we barely speak anymore because of our schedules. So honestly I’m just looking for people to chat with about anything. It would probably be sporadically but still it would be nice to have people to talk to about random things! If you’re interested message me :)",
        "created_utc": 1678569253,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (M30) wife is expecting our first child next week. I’ve had a rather bizarre experience with her. I put on some weight with minimal changes to lifestyle but then it came on quick. My doc has attributed it to stress, diet and Couvade Syndrome! AMA about this experience?",
        "author": "Clydesdale__12",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ov5vm/my_m30_wife_is_expecting_our_first_child_next/",
        "text": "\n\n[Here](https://imgur.com/a/HaGQRwu) is a little timeline of my size over the past 9 months. I’ve gone from about 160 pounds into the 260s. My doctor hasn’t found any other underlying conditions and therefore have pinned it on Couvade Syndrome, a temporary disorder a partner can go through while their significant other is pregnant. Due to hormonal imbalances, it creates phantom pregnancy symptoms and amplifies things like weight gain and food cravings. Althought my diet isn’t as good as it should be right now, this extreme weight gain this fast couldn’t be possible due to just food alone. It normally isn’t quite this extreme, and my doctor has never seen anything this severe, but my body has clearly wanted to really mimic my wife’s experience.  \n\nIt’s been a wild 9 months as this has happened and as you can see by the last picture, I’m looking more pregnant than my wife these days. Wondering if anyone here has been through something similar and what you did to reverse it one the baby came? AMA?",
        "created_utc": 1678568894,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you ever imagine what you would wear to the red carpet or met gala or smth?",
        "author": "prettydotty_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ouvui/do_you_ever_imagine_what_you_would_wear_to_the/",
        "text": "[removed]",
        "created_utc": 1678568225,
        "upvote_ratio": 1.0
    },
    {
        "title": "a giveaway opportunity",
        "author": "No_Measurement1852",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oumg4/a_giveaway_opportunity/",
        "text": "[removed]",
        "created_utc": 1678567568,
        "upvote_ratio": 1.0
    },
    {
        "title": "A GIVEAWAY OPPOTUNITY",
        "author": "No_Measurement1852",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ouhlz/a_giveaway_oppotunity/",
        "text": "[removed]",
        "created_utc": 1678567235,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your favorite number and why?",
        "author": "theDataHunkie",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ou7h4/whats_your_favorite_number_and_why/",
        "text": "23 and 9 for me. \nSentimental value for 23 and sports for 9. \n\nI know it’s a dumb question, but it’s a Saturday mid March. Let’s just be stupid. \n\nGot a lucky/fav number?",
        "created_utc": 1678566544,
        "upvote_ratio": 1.0
    },
    {
        "title": "In my entire existence, only one human I’ve ever met has put me before them. That is my father.",
        "author": "KBMBRO",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ou5td/in_my_entire_existence_only_one_human_ive_ever/",
        "text": "I as a man, have never really truly thought about this before. I find it incredibly bizarre, and sad that the only human, soul, being that has ever truly put me before them. Is my father. All those people, friends, relationships, family members. He has been the constant. \n\nWhat bitter sweet realisation.",
        "created_utc": 1678566422,
        "upvote_ratio": 1.0
    },
    {
        "title": "anyone else get insanely introspective when they get high?",
        "author": "BagBeneficial8060",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11otghi/anyone_else_get_insanely_introspective_when_they/",
        "text": "[removed]",
        "created_utc": 1678564710,
        "upvote_ratio": 1.0
    },
    {
        "title": "GUCCI, LV etc are actually not worth it, &amp; they matter more to middle class than they do to rich.",
        "author": "ErenaVsdv",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11osxr4/gucci_lv_etc_are_actually_not_worth_it_they/",
        "text": "GUCCI, LV ahh... these status symbols. Well, let me tell you they are not worth it. I don't even understand why pay 5000 for something you can get in 50. Well, I know there's difference in quality, but not soooo huge.\n\nI wear Gucci, I wear LV, &amp; I also wear $15 dresses... It's rather an article that matters, rather than brand. If you can easily afford something, no problem, BUT if you are cutting on your other costs, having less fun, so as to save money to buy a Gucci, it is not worth it. \n\nGucci Matters, really it is a status symbol, but sadly it matters only for Middle Class. I know. \n\nLast weak, I went to a Gucci Store, wearing a $25 dress. I went it. I was dressed in the most simple way. My dress spoke that its a copy. The sales girl was like mehh.. \"She's gonna waste our time\". Her attitude was really pathetic. The Manager was however very kind. He handled me, I finalised 3 articles. I just paid for them. The Manager &amp; the sales girl were kind enough to see me off, and that was indeed the MOST FUNNY EXPRESSION SHIFT i ever saw. The salesgirl went from mehhh to Ohkay to OHHH WHAT, well, because, that $25 dress was overshadowed by 1 million dollar car. That's what it is.\n\nSO, I just wanna say, if you can buy it as easily as $ 10 dress, then it is worth it. If you struggle to buy it, NO. Focus on bigger prospect guys. When you are rich, you ARE rich. You need not prove it. \n\nI am writing this post because today one of my student was arguing with me on this topic, so I think I gotta speak.",
        "created_utc": 1678563399,
        "upvote_ratio": 1.0
    },
    {
        "title": "After 4 years of being a NEET i've finally gone to therapy and i feel a lot better, any advice for a 22 years old with no social skills or experience living alone for the first time?",
        "author": "TheGhostPizza1234",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ost8q/after_4_years_of_being_a_neet_ive_finally_gone_to/",
        "text": "What the title says, the isolation from the pandemic absolutely wrecked my mental health, which wasn't even the best in the first place, and i wasted four years of college doing nothing, my parents who are (rightfully) worried decided that i should go back to living with them but first i should go to therapy, after a great session and starting to get medicated on anxiety they are now talking on sending me off to live alone for a year in a different province to study, if i get good grades and put my life together they'll return to paying my college tuitions.\n\nBasically all this time i was sharing an apartment with my sisters and they basically did everything (pay water and electricity bills, and rent,ect) and i was living as if i was dead, so any advice for someone a former Shut-in starting to live alone?",
        "created_utc": 1678563100,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get a phone call yesterday that the PD found my two stolen bikes!",
        "author": "1ClevelandSteamer4u",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oss9h/get_a_phone_call_yesterday_that_the_pd_found_my/",
        "text": "Have you gotten your stolen bike back? I’ve had them stolen before but this is the first time they’ve been returned. I’d love to hear about anyone else getting good news like this.",
        "created_utc": 1678563036,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would you do if it started raining milk?",
        "author": "SpottedPintoBean123",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11osi4y/what_would_you_do_if_it_started_raining_milk/",
        "text": "[removed]",
        "created_utc": 1678562364,
        "upvote_ratio": 1.0
    },
    {
        "title": "JUST watched jo jo rabbit",
        "author": "cartboarding",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11os5zf/just_watched_jo_jo_rabbit/",
        "text": "[removed]",
        "created_utc": 1678561540,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to see a MC villain in the fantasy genre become more main stream.",
        "author": "UmdAccount3087",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11os5s4/i_want_to_see_a_mc_villain_in_the_fantasy_genre/",
        "text": "\nA villain who’s is EVIL from the first time we see him and all the way through the story. No redemption arc for him.\n\nMC who eventually become a villain like Light Yagami/Walter White don’t count.\n\n\nA straight villain from the get go. These stories do happen, but they tend to be thrillers, true crime shows.\n\nWould like to see them more in the fantasy genre. I’m know there are some out there, but they aren’t main stream.",
        "created_utc": 1678561527,
        "upvote_ratio": 1.0
    },
    {
        "title": "do you identify with a faith or religion?",
        "author": "AbleBullfrog8748",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oryf0/do_you_identify_with_a_faith_or_religion/",
        "text": "[removed]",
        "created_utc": 1678561065,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shaved my head and regretted it instantly",
        "author": "Desperate_Aide_4807",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11orqay/shaved_my_head_and_regretted_it_instantly/",
        "text": "Its not that my forehead is big or anything but my face looks too round after i shaved my head and its actually effected my life greatly. \nI literally dont have the confidence to go up to girls and try speak to them anymore",
        "created_utc": 1678560523,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you like oats?",
        "author": "InvestigatorProper99",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oqzu5/do_you_like_oats/",
        "text": "I opted oats as it's a healthy option as breakfast or when I crave something healthy to eat.\nIs there anyone (like me)who doesn't like the taste of oats in whatever way it is cooked.",
        "created_utc": 1678558744,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a band from my past?",
        "author": "picklesCucumber",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oqvjj/looking_for_a_band_from_my_past/",
        "text": "There was a 2 man music group for the 2010's ish. They had a music video where all the women got pregnant(when they went by) and ran at them like zombies. Does anyone know the name of this group",
        "created_utc": 1678558452,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the most underrated movie you've seen, and why do you think it deserves more recognition?",
        "author": "ellacharles_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oqjzs/what_is_the_most_underrated_movie_youve_seen_and/",
        "text": "Underrated movies often provide a unique perspective on filmmaking and explore thought-provoking themes. Some of the most underrated films include \"Eternal Sunshine of the Spotless Mind\" and \"The Iron Giant,\" both critically acclaimed but underappreciated upon release. These hidden gems are a treasure trove for film enthusiasts looking for something different and can offer life-changing messages. Give them a chance, and you might discover your next favorite film.",
        "created_utc": 1678557676,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the most underrated movie you've seen, and why do you think it deserves more recognition?",
        "author": "ellacharles_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oqdrq/what_is_the_most_underrated_movie_youve_seen_and/",
        "text": "[removed]",
        "created_utc": 1678557258,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oof",
        "author": "Agitated-Asparagus76",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oqamj/oof/",
        "text": "[removed]",
        "created_utc": 1678557034,
        "upvote_ratio": 1.0
    },
    {
        "title": "I finally had surgery to fix my wrists, and I'm estatic.",
        "author": "Pepperidgefarm-s",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oq9yw/i_finally_had_surgery_to_fix_my_wrists_and_im/",
        "text": "I've had ganglion cysts in my wrists for about 11 years. They developed while I was in basic training, and had gotten worse ever since. They've interfered with so much in my life. From work, to being able to play my guitar, the pain after awhile would get overwhelming. \n\nI had seen three doctors in the past about my wrist pain. Two of them confirmed what the problem is, and didn't offer solutions to correct them, saying they would \"go away on their own\". The third took xrays, didn't find anything, and basically told me I shouldn't be in pain. \n\nFast forward 11 years, and I pull a mulch log off of a pile of frozen mulch logs, and the pain almost put me to the ground. I had enough and decided to do something about it. I went in to see an orthopedic surgeon. From the time I contacted the clinic, to me actually getting surgery, took about a week of my time. 11 years of pain, solved and acted upon in a matter of a week. \n\nI'm so excited to be able to to do things without constant wrist pain. The first thing I want to do when they heal is push ups.",
        "created_utc": 1678556993,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spotify app that makes a 'Discover Daily' feed for new music 🎉",
        "author": "Famous-Tie-3780",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oq7fc/spotify_app_that_makes_a_discover_daily_feed_for/",
        "text": "My romanian friend and I got annoyed with trying to find new music on Spotify.\n\nSo we built a program that takes a song and shortens and learns what the \"best\" 10-60 seconds are to so that you can discover new music every day that's curated to your taste\n\nIt uses genre/class/valence/key/BPM/chorus/bridge/5000+ unique hyper genres and other factors\n\nApp Store link: [https://apps.apple.com/us/app/smores-music-discovery/id1626768775](https://apps.apple.com/us/app/smores-music-discovery/id1626768775)\n\nWould love any feedback/criticisms/feature requests, thanks :)",
        "created_utc": 1678556806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you have a favourite painting?",
        "author": "-DedicatedToYou-",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oq1tx/do_you_have_a_favourite_painting/",
        "text": "Do you have a favourite painting? Has any painting ever really resonated with you? Occasionally, I will come across a painting that evokes deep feelings in me, even when I can't verbalise exactly why. Monet's '[The Magpie](https://artsandculture.google.com/asset/the-magpie/rQGnadHwK8lSmg?hl=en-GB&amp;ms=%7B%22x%22%3A0.5%2C%22y%22%3A0.5%2C%22z%22%3A9.516395198332104%2C%22size%22%3A%7B%22width%22%3A1.7608966180619758%2C%22height%22%3A1.2375000000000012%7D%7D)' immediately puts me at ease whenever I see it, it feels so dreamy! So, what is your favourite painting?",
        "created_utc": 1678556416,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vivid dream",
        "author": "Waxflower8",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oq122/vivid_dream/",
        "text": "I remember I think I was in my tweens or early teens. During that time I was dealing with sleep paralysis every other day.\n\nIt’s like you’re just laying there then you hear this white noise in your ears. The louder it gets, the more difficult it was to move and you have to try wiggling around before the last boom in your ears. But this time I got stuck and fell into a very realistic looking dream. \n\nI was under water  on floor level. There was this gold coin falling from above and this announcer voice said that I was chosen to enter a game and if I wanted to play, I had to catch the coin but if not then I’d let the coin fall to the ground and wake up. The whole situation freaked me out so I let it fall to the ground and woke up.\n\nI know it was just a dream but sometimes I wonder if the dream would continue if I chose to catch the coin. And would I have actually enter the game or just like any other dream the plot would change. I guess as long as it was a vivid dream I would have control of keeping it that way idk.\n\nBut anyway I thought it was the coolest dream I’ve ever had🤣 Even though it scared the crap out of me.",
        "created_utc": 1678556365,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was looking at my old photos today from 3 years ago and I realized how sad my eyes seemed in all of it. Those were tough times. I’m glad my smile is reaching my eyes now.",
        "author": "taecrisp",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11opzzl/i_was_looking_at_my_old_photos_today_from_3_years/",
        "text": "It’s weird how I hear in movies, lyrics or read from quotes the cliche line “i see sadness in your eyes” or whatever. Never really thought it was real until I saw them in mine. It’s funny now thinking back i thought I looked good in all those photos, happy even, but now I see is a girl with such emptiness and dead eyes. \n\nIt reminded me of the things I was going through back then. Lost a loved one, went through a bad break up, so many other things weren’t going my way. life screwed me over and over. \n\nWeren’t good memories but I’m glad so I got my smile back.\n\nBecause I deserve to be happy. We all do.\n\nJust here to say that whatever you’re going through right now, it shall pass. It will get better.\n\nHold on to your smile.",
        "created_utc": 1678556289,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got some really nice bikes stolen last summer while on vacation and just got a call from the area PD saying they recovered them!!!",
        "author": "1ClevelandSteamer4u",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11opp5l/got_some_really_nice_bikes_stolen_last_summer/",
        "text": "[removed]",
        "created_utc": 1678555536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone feel like they want something greater in life?",
        "author": "someoneintheworld2",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11opmca/does_anyone_feel_like_they_want_something_greater/",
        "text": "Everyone I know seems to be pretty content with their life. They're happy going to work or school and coming back home to relax. Everyone is doing what they like, and I'm really glad everyone is happy. But when I compare myself to them, I feel as though I don't quite fit in. I'm not happy with that simple lifestyle, and I always want something greater.\n\nNo one seems to think the same way I do. No one seems to want to do more. When I ask people about what they want from their lives, they always say they want a good job and a good family. They'll soon get these things and they'll get to relax and do whatever makes them happy. I'm truly happy for them, and I wouldn't want to change that. But it feels so empty for *me* to live such a life as that.\n\nI feel like I'm reaching for something, but I don't even know what it is or how to get it. I just know that I want to make a difference in the world. I'm not saying I want to become Gandhi or Tesla or whatever, and I’m not romanticizing this either. I just want to leave some mark on the world. I know how unlikely this is, but I can't stop how I feel, nor will I. Am I weird? Why does everyone seem so happy with such a simple lifestyle? Why doesn't anyone want to reach for something greater?",
        "created_utc": 1678555336,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you believe that everything really happens for a reason? (and no I don't mean it in that way)",
        "author": "Just1person_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11opm51/do_you_believe_that_everything_really_happens_for/",
        "text": "Not in the “oh I got stabbed two years ago but everything happens for a reason” way, I mean like the tiny little things that happen throughout the day, like dropping your keys on your way to work, or dropping your favorite cup in the most random way ever, sneezing, and all these little stuff, are they really random or is it just the universe’s way of having fun?",
        "created_utc": 1678555324,
        "upvote_ratio": 1.0
    },
    {
        "title": "I could really use your help for my high school thesis",
        "author": "Mathis20050316",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11opfwa/i_could_really_use_your_help_for_my_high_school/",
        "text": "I am a 17-year-old from Belgium and I am doing research on the genetic modification of people whose modifications are also passed on to their offspring. With this, I want to know what you think about it and it would be very helpful for me if you could fill it in. I hope it is somewhat clear and if not, please feel free to comment, I am certainly not a professional. \n\n[https://forms.gle/VnLbLpFpR58CMt6p9](https://forms.gle/VnLbLpFpR58CMt6p9)",
        "created_utc": 1678554889,
        "upvote_ratio": 1.0
    },
    {
        "title": "Listened Billie Eilish for the first time",
        "author": "that-robot",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ooz5n/listened_billie_eilish_for_the_first_time/",
        "text": "When she got popular, all the marketing material the media used was short cuts from the music video of \"bad guy\". Especially the tri-cycle scene and the mumbled parts of the song. And I thought \"here another edgy teenager, mumbling things and calling it a song while acting \"different\" and \"impulsive\".\n\nI've never listened a song of her.\n\nLast night, YouTube Music played \"No Time To Die\" in a generated playlist and... it is beautiful. It's like she has two types of songs in her albums. Some have mumbled lyrics with simple tempo in the background and some are -still a little bit mumbled- lyrics but with a much softer tone with a beautiful music.\n\nAnd she has a very nice voice.\n\nNow I am listening No Time To Die for the twentieth time.",
        "created_utc": 1678553757,
        "upvote_ratio": 1.0
    },
    {
        "title": "does anyone remeber 4chan?",
        "author": "OutrageousWait6858",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ooy4m/does_anyone_remeber_4chan/",
        "text": "[removed]",
        "created_utc": 1678553686,
        "upvote_ratio": 1.0
    },
    {
        "title": "As I'm getting older I have less and less patience for songs that have excessively long, \"weird\" intros",
        "author": "Petallus",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oor05/as_im_getting_older_i_have_less_and_less_patience/",
        "text": "Why do you think I wanna listen to 45 seconds of \"eeEeeEeEEEEEeeeEe\" before your actual song begins?? A lot of it is weird for the sake of being weird and doesn't add to the music (Alt-J anyone?). Don't get me wrong, I still love long songs, but I tend to either just skip the intro or just fully skip the song if it's bad enough.",
        "created_utc": 1678553171,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is special about Twitter?",
        "author": "Canigetmynickname",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oony5/what_is_special_about_twitter/",
        "text": "I honestly don’t understand what is the difference between Twitter and Reddit or Instagram.\n\nI heard there is a lot of conflicts.\n\nPlease, tell me what is so special about it, I maybe even want to try it.",
        "created_utc": 1678552956,
        "upvote_ratio": 1.0
    },
    {
        "title": "It takes a lot for me to not mess with text scammers. I know I know, the active phone number issue.",
        "author": "BunnyRambit",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oonll/it_takes_a_lot_for_me_to_not_mess_with_text/",
        "text": "I understand that they’re trying to see if it’s an active number or whatever and not to respond. Usually I get weird links and some dumb message like “my grandma couldn’t believe this worked!”  Well just this morning I got my first “is this “Jeff?” This is ‘Julie.’” Im a girl and my name starts with an L so it’s totally bogus. I never respond but it’s so hard not to mess with them! Quite a long time ago, before scamming like this was an issue, I got a text from someone. I had a fun time using a publishers clearing house joke and how I was already rich and had a good laugh with my boyfriend. \n\nHas anyone here gone ahead and responded to scammers and had fun? What’s your story?",
        "created_utc": 1678552930,
        "upvote_ratio": 1.0
    },
    {
        "title": "Healthy Eating",
        "author": "pandaocean168",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ontzv/healthy_eating/",
        "text": "What are some foods i can eat that are healthy, my mom is getting on my nerves about what i eat (probably worried). If i ate healthy or healthier she wouldn’t be on my ass about what i eat. Does anyone know where i can start to eat healthy?",
        "created_utc": 1678550828,
        "upvote_ratio": 1.0
    },
    {
        "title": "So excited to have my friend back and hopefully make another friend in her partner",
        "author": "altsideofthestreet",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11onmr3/so_excited_to_have_my_friend_back_and_hopefully/",
        "text": "One of my best friends has been living in another state for the past couple years and not only is she moving back, but her boyfriend is moving with her. I've met him a few times and I think he's great, we get along well and seem to have a lot in common. And he's such a wonderful partner to my friend. One time when I was visiting them, his sister admitted that he doesn't have much in the way of good friendships- that he's a really nice guy and unfortunately gets taken advantage of a lot as a result. It really broke my heart to hear.\n\nI'm so excited to have one of my best friends back in town, but I'm also bonus excited because I feel like her boyfriend and I can become friends too.\n\nThere's nothing I love more in my life than friendships. My friends are one of my top priorities in life and I would do anything for them. I've been hoping my friend would move back to town and I'm so thrilled it's happening.\n\nI'm just feeling so happy about all this and had to express it somewhere :)",
        "created_utc": 1678550345,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it werid I can't sleep without my stuffed animal dog?",
        "author": "Cutestwokiki",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11onifb/is_it_werid_i_cant_sleep_without_my_stuffed/",
        "text": "[removed]",
        "created_utc": 1678550042,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else just hate life transitions?",
        "author": "PhaedraRion",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11onhlb/anyone_else_just_hate_life_transitions/",
        "text": "My partner and I got the keys for our first house two weeks ago. We can't move in yet as it's an older home that does need a bit of repairs (kitchen and bathrooms). Met some contractors, still waiting for quotes to come in.\n\nWe have long hated this house we've been renting in. It came with a lot of furniture that we don't like, and now I can actually see the move happening post-repairs and renovations, I can't help but feel even more of that itch to just get out of here. I can't wait to leave this place!\n\nI always seem to have this issue with big or small life transitions. The waiting period is agony. I wish I can just fast forward life.",
        "created_utc": 1678549984,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think my professor doesn't deserve his job.",
        "author": "yash_vardhan_sharma",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11onexm/i_think_my_professor_doesnt_deserve_his_job/",
        "text": "It's been so overwhelming with exams approaching and ny professors didn't even bother completing the syllabus. And my exams are probably in the end of this month or the beginning of the next month. It's so scary that i can't help procrastinating, it's annoying honestly. I need to start studying but when i do try to do that i get reminded to the 6 due practical reports. My teachers make me hate a subject i love it's so shit.",
        "created_utc": 1678549805,
        "upvote_ratio": 1.0
    },
    {
        "title": "סיורי חופים",
        "author": "yair1515",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11omw5f/סיורי_חופים/",
        "text": "[https://tiulim.net/%D7%9E%D7%AA%D7%99-%D7%9C%D7%94%D7%96%D7%9E%D7%99%D7%9F-%D7%94%D7%99%D7%9B%D7%9F-%D7%9C%D7%98%D7%99%D7%99%D7%9C-%D7%95%D7%9E%D7%94%D7%9D-%D7%9E%D7%95%D7%A2%D7%93%D7%99-%D7%94%D7%A7%D7%A8%D7%95%D7%96/](https://tiulim.net/%D7%9E%D7%AA%D7%99-%D7%9C%D7%94%D7%96%D7%9E%D7%99%D7%9F-%D7%94%D7%99%D7%9B%D7%9F-%D7%9C%D7%98%D7%99%D7%99%D7%9C-%D7%95%D7%9E%D7%94%D7%9D-%D7%9E%D7%95%D7%A2%D7%93%D7%99-%D7%94%D7%A7%D7%A8%D7%95%D7%96/)",
        "created_utc": 1678548462,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just signed the lease for my first apartment",
        "author": "JediMemeLord",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11omrxf/i_just_signed_the_lease_for_my_first_apartment/",
        "text": "&amp; this feels a little surreal. I’m so excited. My home situation has really sucked the past year so this is such a massive win for me. \n\nit’s nice feeling like you have your shit together. I have my own car, my own car insurance, my own health insurance. i’m 100% financially independent &amp; comfortable with the new job I got \n\nbut I have no idea where to start with getting my shit moved. it all happened so fast. I’ve moved once before but this is the first time I’m moving by myself so *any advice would be awesome*. I have plenty of help from my friends so I’m not worried about the actual moving of furniture part. I guess the getting settled aspect is what I find a little daunting lol\n\n2022 and 2023 have been years of many firsts for me &amp; I’m welcoming all the change with open arms 🫶🏼",
        "created_utc": 1678548140,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does traditional career values work anymore?",
        "author": "deviantmoth",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11omo62/does_traditional_career_values_work_anymore/",
        "text": "Can you really leave school, go to college, get a degree, work a 9-5 or on call. Go on vacation every August. Live the same rigid routine 24/7 for the rest of your life and still get fulfillment out of it? Because I feel like if I did that, I'd get to 50 like \"Where the fuck did the last 25 years just go?\" \n\nI've just left my job setting up PA and lighting for events due to health reasons and currently volunteering at an animal shelter while working on training in animal handling and welfare. I had the opportunity to get a 9-5 doing administration and I personally just can't see the fulfilment. So I'm curious about other people's opinion on it.",
        "created_utc": 1678547865,
        "upvote_ratio": 1.0
    },
    {
        "title": "Giving up soda/cutting down on it",
        "author": "pandaocean168",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11omkbf/giving_up_sodacutting_down_on_it/",
        "text": "I work at a Movie Theater, so at my job soda is free, so i drink it often. My mom is worried and keeps getting on my nerves about it. Soda is tempting to drink at work as it’s free and i’m there a good amount of time. How can i give up soda or at least cut down on it?",
        "created_utc": 1678547592,
        "upvote_ratio": 1.0
    },
    {
        "title": "Turning 20 in 3 days… suggest me ANYTHING new to try!!",
        "author": "skyelimess",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11omcxz/turning_20_in_3_days_suggest_me_anything_new_to/",
        "text": "For my 20th birthday, I wanted to take some inspiration from the allure videos where people do “9 things that they’ve never tried before.” Suggest me literally ANYTHING you think I should do: a new hairstyle, new coffee order, new hobby, music, etc!! Little things or big things, I just want to get the joy and benefit of trying something different:)",
        "created_utc": 1678547064,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am learning five languages at the same time.",
        "author": "uncreativeelf",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11om7jw/i_am_learning_five_languages_at_the_same_time/",
        "text": "[removed]",
        "created_utc": 1678546694,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you ever have these little inside jokes with yourself?",
        "author": "throwitawaybongybong",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11om5nw/do_you_ever_have_these_little_inside_jokes_with/",
        "text": "For example, a certain Wiz Khalifa track I like begins and ends with this line from a feminine voice with a thick West Coast accent, \"Oh my gawd, Bonnie!\"\n\nAs if Bonnie was acting especially out of line.\n\nI have a bad habit of saying \"oh my god\" when I get frustrated. Now when I get like that and say it, I also tell myself that I'm \"acting like Bonnie.\"\n\nIs that funny? I found it humorous, just a little thing to make my tedious days more interesting.\n\n\"Quit acting like Bonnie,\" I tell myself.",
        "created_utc": 1678546552,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hacked!",
        "author": "SecretSession7303",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11olci0/hacked/",
        "text": "[removed]",
        "created_utc": 1678544402,
        "upvote_ratio": 1.0
    },
    {
        "title": "HACKED!",
        "author": "SecretSession7303",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ol9ws/hacked/",
        "text": "[removed]",
        "created_utc": 1678544206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Users who live in big cities, how often do you see people you know (or used to know) accidentally? Has this frequency changed with your age or always remainded similar? When you see them, how often do you try to talk to them?",
        "author": "An_best_seller",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oknsf/users_who_live_in_big_cities_how_often_do_you_see/",
        "text": "By the way, people that you expect to see somewhere (family in your/their house, colleagues at work, workers in a shop etc.) shouldn't be accounted. And people that you've seen in the past but never interacted/talked with, shouldn't be accounted neither.\n\nIf you don't live in a big city, please say in what kind of territory you live in your comment.",
        "created_utc": 1678542565,
        "upvote_ratio": 1.0
    },
    {
        "title": "https://www.youtube.com/watch?v=TdcBFp8BfgI",
        "author": "nashmanvideo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11okgbg/httpswwwyoutubecomwatchvtdcbfp8bfgi/",
        "text": "[removed]",
        "created_utc": 1678541985,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your favorite activity to wind down for the day?",
        "author": "DreamerEveryday",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ok55l/what_is_your_favorite_activity_to_wind_down_for/",
        "text": "Today was a very productive day for me, got work done, and even met new people over the phone that I thought were my type.  Now, I'm trying to wind down.  Should head to dinner shortly. \n\nBut, I would like to hear what you do to wind down.  I listen to audiobooks, or relaxing music.  Sometimes chat quietly with an old friend if available. Spend a few minutes with my cat if he is in the house. Or come to Casual conversation here : )",
        "created_utc": 1678541118,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm starting to actually really enjoy cooking",
        "author": "alunacas",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ojut1/im_starting_to_actually_really_enjoy_cooking/",
        "text": "Context: While growing up, a lot of the responsibility for cooking meals fell to me, which took most of the joy out of it. Recently though, I've begun to get into cooking for just myself and I understand why people like it so much. \n\nI'm out of practice at the moment, but picking it up again quickly. I'd love to know what others find enjoyable to cook. Unfortunately I'm rather lacking in culinary creativity at the moment.",
        "created_utc": 1678540293,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm reading and listening to music, and I just felt so grateful. What are you thankful for?",
        "author": "jjj070707",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oj7p6/im_reading_and_listening_to_music_and_i_just_felt/",
        "text": "I'm reading a book that I've been meaning to pick up for the past couple weeks. It's written by a 103 year old philosopher, and he answers some frequently asked questions. He talks about what a 'good' and healthy life means to him, and he also gives wise words on what values people should have in order to live a fulfilling life. \n\nIn between chapters, I picked up my phone and came across My heart will go on by Celine Dion. It brought back the memories of watching the movie in the theater a couple months ago, and I was just entranced in the music. Maybe it's the book having an effect on me, but I felt really grateful for having eyesight, ears, a functioning brain, headphones that made it possible for me to enjoy both the book and the music. I've been in a funk these past few months, so it was surprisingly pleasant that I felt this way. \n\nIt's certainly not anything monumental, but I just wanted to put it out that I felt this way.",
        "created_utc": 1678538378,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone here who lived under the Soviet union and is homosexual or has any stories about that?",
        "author": "temmporomandibular",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oiy4j/anyone_here_who_lived_under_the_soviet_union_and/",
        "text": "Care to share your experience? How was things in the Soviet union for homosexual people? You had any relatives, grandpa/grandma etc, who were like that. What did they think? And if you were like that yourself. Could you describe how things were? I'm just curious.",
        "created_utc": 1678537572,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone here who lived under the Soviet Union and is homosexual?",
        "author": "temmporomandibular",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oivvg/anyone_here_who_lived_under_the_soviet_union_and/",
        "text": "[removed]",
        "created_utc": 1678537380,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend goes everywhere with a MacBook on his head. Is he ok?",
        "author": "basafish",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oic7z/my_friend_goes_everywhere_with_a_macbook_on_his/",
        "text": "[removed]",
        "created_utc": 1678535717,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Romanian prime minister has a new AI robot assistant named Ion. What do you think?",
        "author": "Minekratt_64",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oi8r7/the_romanian_prime_minister_has_a_new_ai_robot/",
        "text": "[removed]",
        "created_utc": 1678535404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I weird, as a grown man, to involuntarily say 'ahh' right after the first gulps of a thirst-quenching drink?",
        "author": "CheeseFace83",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ohyox/am_i_weird_as_a_grown_man_to_involuntarily_say/",
        "text": "[removed]",
        "created_utc": 1678534475,
        "upvote_ratio": 1.0
    },
    {
        "title": "wanting to learn new languagess",
        "author": "ladyluxsolaris",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oh5h3/wanting_to_learn_new_languagess/",
        "text": "[removed]",
        "created_utc": 1678531690,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have heard ‘Kiss From A Rose’ so many times this week. I didn’t go looking for it.",
        "author": "Imaginary-Tap-3361",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oh2vp/i_have_heard_kiss_from_a_rose_so_many_times_this/",
        "text": "So, I’m at a salon where the song is being played and I just realized I’ve heard the song in 4 different contexts this week.\n\n- I finally finished Yellow Jackets and the characters sing the song in the third-to-last episode\n\n- I’ve been watching Community reruns on YouTube and the last episode had the song in a karaoke scene.\n\n- It was also recommended to me since Seal was on Kelly Clarkson’s show. I like  Kellyoke.\n\n- 4th time at the salon today. \n\nI’ll never get bored of this song but this has been random!",
        "created_utc": 1678531415,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I know if this girl likes me",
        "author": "TheSt0rmBringer",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ogzun/how_do_i_know_if_this_girl_likes_me/",
        "text": "[removed]",
        "created_utc": 1678531114,
        "upvote_ratio": 1.0
    },
    {
        "title": "I used to play with hornets (lighthearted story)",
        "author": "AdvancedDeer5897",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ogplq/i_used_to_play_with_hornets_lighthearted_story/",
        "text": "[removed]",
        "created_utc": 1678530054,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (32m) \"Glowed Up\". I feel bad about the amount that I pursue women for sex, even if I don't want to sleep with them",
        "author": "Warphim",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ogjxx/i_32m_glowed_up_i_feel_bad_about_the_amount_that/",
        "text": "[removed]",
        "created_utc": 1678529486,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to use reddit, to improve communication skills?",
        "author": "Canigetmynickname",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11oghbk/how_to_use_reddit_to_improve_communication_skills/",
        "text": "I recently started using reddit. I really like it, because it really helps me:\n-improve my english\n     lot of new words. Still idk how to remember all of ‘em.\n\n-learn new things.\n\n-share with each other useful skills.\n\n-deliver my opinion clearly.\n\nAnd much more. I wonder is there a way to better use this great Social Network.\n\nSend your tips and tricks for new reddit users. Maybe, there is a way that makes your comment/post insane amount of upvotes. Or is it a matter of time?",
        "created_utc": 1678529231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone wanna be part of a group chat",
        "author": "Emotional_Side811",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ogfuy/anyone_wanna_be_part_of_a_group_chat/",
        "text": "We can get to know each other and talk about random topics. Groupchat z are a great way of getting to know others ! Comment or message me if you’re interested:))",
        "created_utc": 1678529091,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got free coffee… again!",
        "author": "greendandelion0450",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ogffm/i_got_free_coffee_again/",
        "text": "Occasionally, I get coffee from Costa before college- large cappuccino, no chocolate. I have that “buy 8 drinks, get 1 free” thing on the app and, on Wednesday, I collected my 8th bean, and received a reward for free coffee.\n\nThursday morning, same order, same location. I scan my QR code- error. I scan it again- error. The woman then said “Don’t worry about it” and gave me my coffee. I later checked the app and saw I still had that Free coffee reward.\n\n10 minutes ago, completely different location. Same situation- error, scan again, error, “Don’t worry about it”, reward is still in the app. \n\nDoes that mean I’ll get unlimited free coffee? Because, if so, HECK YEAH! Anyone else have a similar experience? Are you getting unlimited free coffee as well?",
        "created_utc": 1678529049,
        "upvote_ratio": 1.0
    },
    {
        "title": "anyone want to be part of a Group chat?",
        "author": "Emotional_Side811",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ogeqx/anyone_want_to_be_part_of_a_group_chat/",
        "text": "[removed]",
        "created_utc": 1678528984,
        "upvote_ratio": 1.0
    },
    {
        "title": "I kept my promise in 2008 that I would taste Johnnie Walker Green Label one day.",
        "author": "zirlatovic",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ogbir/i_kept_my_promise_in_2008_that_i_would_taste/",
        "text": "I watched The Man From Earth in 2008. There is a small scene (Just 3 seconds or something) about Johnnie Walker Green Label. At end of the movie, I promised myself that I would taste Johnnie Walker Green Label.\n\nUntil September 2020, I'd never tasted any alcoholic beverages even beer. The first whiskey I taste was in 2021. It was Johnnie Walker Black 12 years but I guess It was the wrong choice for the first whiskey tasted.\n\nAnyway, keeping drink beer. Tasted a lot of times Jamerson Whiskey.\n\nOn 2 December 2022, I finally tasted Johnnie Walker Green Label. I liked it.",
        "created_utc": 1678528700,
        "upvote_ratio": 1.0
    }
]