[
    {
        "title": "HELLO",
        "author": "UpbeatMaintenance154",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nuc2z/hello/",
        "text": "[removed]",
        "created_utc": 1678467219,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does my friend have a mental health issue or is she on drugs?",
        "author": "Repulsive-Vehicle-80",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nu4z7/does_my_friend_have_a_mental_health_issue_or_is/",
        "text": "[removed]",
        "created_utc": 1678466749,
        "upvote_ratio": 1.0
    },
    {
        "title": "to my coco",
        "author": "Less_Procedure8906",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ntumm/to_my_coco/",
        "text": "[removed]",
        "created_utc": 1678466068,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else feel like we're on the brink of a new Era for humans?",
        "author": "PortableSun01",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nt62o/anyone_else_feel_like_were_on_the_brink_of_a_new/",
        "text": "With all of these discoveries, inventions, innovations and not to mention the ever growing and changing population, our sum of knowledge being more accessible than ever in history etc. There's more tragedy than ever but I feel like a new Era is going to happen soon. A new curve. I don't think it's all going to be positive; we're human, there's always going to be something negative in anything we do because consequences happen. I don't know, It feels like the edge of a cliff getting closer and closer. Anyone else feel like this recently? Like a universal turbulence lol",
        "created_utc": 1678464518,
        "upvote_ratio": 1.0
    },
    {
        "title": "life is hard but it's still good.",
        "author": "elliottristis",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nt2d4/life_is_hard_but_its_still_good/",
        "text": "Life is amazing,the little tiny things make it what it is,in honor of this life, let's share something that made us happy, even if it's a thought or a random little thing, I'll start.\nWas walking with my friends few months ago,and noticed a girl (impossible to not notice her) she was so gorgeous,and unusual,by unusual i mean she was walking confidently like she was a model living her own fantasy and wearing something people usually don't wear out here,her beauty and presence made me happy and made me appreciate having such beauty and people in this world.",
        "created_utc": 1678464284,
        "upvote_ratio": 1.0
    },
    {
        "title": "What paranormal experiences have you had?",
        "author": "Givemespoon",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nswwo/what_paranormal_experiences_have_you_had/",
        "text": "I am currently at my job (procrastinating of course) where I spend most of my shift alone in an old building. I see and hear a lot of weird things that makes me think this place is haunted. What are some of your casual paranormal encounters or speculations?",
        "created_utc": 1678463956,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you feel about the Boondocks episode where MLK comes back and talks shit to all the black people for being degenerates?",
        "author": "BungOnMimosas",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nskw8/how_do_you_feel_about_the_boondocks_episode_where/",
        "text": "[removed]",
        "created_utc": 1678463173,
        "upvote_ratio": 1.0
    },
    {
        "title": "Miss my old boss and want to reach out but idk if I should",
        "author": "AcanthisittaNo2355",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nskqi/miss_my_old_boss_and_want_to_reach_out_but_idk_if/",
        "text": "Long story short, I worked at a company for almost 7 years before being let go. At this company, I grew very close to my boss and he always treated me like a son. He was very thoughtful and would do things that no one has done for me. The way I was let go was understandable (the owner and his sister teamed up, not my boss), but it bothered me at the time bc I was going through a lot. I still remember the voicemail my boss left me saying that I had been laid off and he sounded like he was going to cry. Fast forward to now, I’m doing great in my life and can’t help but think of him from time to time. I want to reach out and just see how he’s doing but he hasn’t messaged me since I was let go (it’s been about a year). \n\nDo I just move on and accept that we no longer are in each others lives? Or do you think maybe he feels bad for what happened and that’s why he hasn’t reached out? \n\nWhat do you guys think? I miss him a lot and he always told me he’d be at my graduation when that day comes and that always stuck with me. Sad to see it’s all gone now. What should I do? Please give me a better insight on this. Thank you!!!",
        "created_utc": 1678463164,
        "upvote_ratio": 1.0
    },
    {
        "title": "What makes for a good nap?",
        "author": "pactbopntb",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nsjyx/what_makes_for_a_good_nap/",
        "text": "I have a really hard time sleeping at night so I take a lot of naps. I struggle to nap too, but it’s easier. What are some tricks you guys like to get you to have a good nap?",
        "created_utc": 1678463117,
        "upvote_ratio": 1.0
    },
    {
        "title": "What makes for a good nap?",
        "author": "pactbopntb",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nsipu/what_makes_for_a_good_nap/",
        "text": "[removed]",
        "created_utc": 1678463037,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ironic and frustrating instagram posts",
        "author": "JigglyKirby",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ns7lu/ironic_and_frustrating_instagram_posts/",
        "text": "Idk if this is the right sub for this, but i just wanna kinda rant, and maybe also open a discussion about this.\n\nLately I’ve been seeing a ton of celeb fan accounts on instagram with captions like “Gorgeous 🔥”, “she’s so pretty 😭😭”, and then the photo post is of their celeb idol with an exhausting amount of filters on them to the point that they look totally unrecognizable and different, almost AI looking, like ???? If you gotta praise your idol, why post a picture of them with a lot of filters? It’s just quite ironic, funny, yet also frustrating. I wonder if celebs see these posts and what they think of this lmao",
        "created_utc": 1678462306,
        "upvote_ratio": 1.0
    },
    {
        "title": "I bought something online for my wife. The business uses a gmail account!",
        "author": "zeer0dotcom",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ns6q3/i_bought_something_online_for_my_wife_the/",
        "text": "[removed]",
        "created_utc": 1678462252,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone work in IT?",
        "author": "GreyRaven-",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nrot1/anyone_work_in_it/",
        "text": "I am doing a year out for my university degree, nearly finished a years experience as a Level 2 IT Technician\n\nOverall, my work placement is underwhelming. It is in a bank, I feel like they are 10-15 years behind the times in terms of their infrastructure compared to their competitors\n\nMy supervisor is an ahole, rest of the people there are lovely and you can ask them anything\n\nI do about 1-2 hours worth of work in a day. 9-5. Sit about bored most of the time. I am in the office full time while my co workers are 2 days a week\n\nI’m thinking of moving to Canada from Ireland and getting an IT job, but I’m unsure to stay in the Level 2/help desk role or try something else\n\nAnyone got any tips?",
        "created_utc": 1678461062,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just now, at 35, realized that journaling isn't just a record of the events of the day/week/whatever.",
        "author": "GreasyPeter",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nredi/i_just_now_at_35_realized_that_journaling_isnt/",
        "text": "It's a self-awareness tool that forces you to reflect and process what happened in your day, how that effects you, and it forces you to ask yourself \"have I learned something today and if so, how can I use that knowledge to improve myself\". My mind is blown.",
        "created_utc": 1678460386,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think being pretty is a privilege?",
        "author": "Adielicious",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nrbws/do_you_think_being_pretty_is_a_privilege/",
        "text": "I’ve always been imagining myself when I lose weight, I know I’ll be pretty. I look cute when I was a kid but puberty hit me hard. I gained weight. With that, I don’t really feel confident with how I look rn. I was never pursued by any men, idk if it’s a good thing but I’m 20 now, and no one had ever confessed that they have a crush on me while other people younger than me already had many suitors. \n\nIt sometimes makes me sad when I think that I’m not pretty enough to be liked by anyone. I just can’t weight to finally lose weight and gain my confidence back again. I’ll fr start my hoe era when that day comes! 🤣",
        "created_utc": 1678460206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Massage deep or Swedish",
        "author": "LeMassageEstetic",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nqn7m/massage_deep_or_swedish/",
        "text": "[removed]",
        "created_utc": 1678458444,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m so bad at navigating verbal social life",
        "author": "flutterby-daisy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nql2f/im_so_bad_at_navigating_verbal_social_life/",
        "text": "I have a tendency to second guess everything I said to someone after the fact. The latest is the fact that I commended someone for something. I was being completely sincere and have nothing to gain from it, but after going over it in my mind, I could see how it would come across as ingratiating when that wasn’t the intent at all. It makes it difficult to carry on conversations, because afterwards I overanalyze and pick everything I said apart. Or do I go back and clarify what I meant? But in my mind that’s either weird, or creating an issue where there probably wasn’t one to begin with, or turning into a high-maintenance friend/acquaintance who always needs reassurance, and that also doesn’t seem like a good option. \n\nI’m not quite sure where I’m going with this. I might just be venting and looking for feedback from a third party.",
        "created_utc": 1678458290,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Everyone Else Scared?",
        "author": "ScaredAdult69",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nq478/is_everyone_else_scared/",
        "text": "[removed]",
        "created_utc": 1678457088,
        "upvote_ratio": 1.0
    },
    {
        "title": "Profanity.",
        "author": "LetterGrouchy6053",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nph36/profanity/",
        "text": " \n\nProfanity is the *lingua franca* of Dullards. \n\nThe English language is a wonderful invention, From the complex to the banal, there are words and methods to express your thoughts in a simple and straightforward manner, and no advanced degrees are necessary. \n\nShort, crisp, well-thought-out declarative sentences can express your thoughts as well as any ‘hifalutin’ attempt at eloquence and are more appreciated by your audience. \n\nThe biggest complaint I have about sites like Reddit is that they permit, and sometimes encourage, the vilest of language. \n\nI understand there are times when people are so caught up in their emotions their worst selves rise, but they should take the time to realize profanity doesn’t amplify their point, it diminishes it. \n\nWho cares about the opinions of some foul-mouthed bore who won’t take the time to frame an argument or criticism in quiet, coherent terms? If the best they can do is hide their ignorance behind a torrent of filth, who would take them seriously, anyway?",
        "created_utc": 1678455540,
        "upvote_ratio": 1.0
    },
    {
        "title": "My experiment worked and I can’t believe it",
        "author": "Moondust221",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11np906/my_experiment_worked_and_i_cant_believe_it/",
        "text": "I finally did it! I’m a microbiology intern and our company encourages us to experiment in our own time. I’ve been designing an experiment since October last year and I ran a preliminary experiment over this last week and it not only works, my hypothesis is correct! \nThis sort of method isn’t around and I got pulled into an office with the big boss, my supervisor and my uni tutor on zoom. I got told if I can finalise this, not only will I be able to use it as a personal project for my 3rd year of my degree but it also has the potential to become a standardised ISO method! I don’t even know what to think I’m shaking! I essentially have a free pass in 3rd year and I can’t even process the ISO thing right now. It’ll probably take years for this to actually become anything and it’s super niece but I can’t believe I’ve even gotten this. \nIs anyone else celebrating a personal success? I’d love to hear about what you’re celebrating and how it’s impacted you.",
        "created_utc": 1678454985,
        "upvote_ratio": 1.0
    },
    {
        "title": "For the Daily Diary Keepers out there",
        "author": "Maleficent-Squash-52",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11np201/for_the_daily_diary_keepers_out_there/",
        "text": "How do you guys do it. I remember doing one as it was a primary school work over the holidays, and I thought I would continue, but right after the holidays I just decided to not write. Then, we read about Anne Frank, and I thought her diary was interesting, so I decided to write about my life, but it got boring after a week or so. Then, after finding a crush in high school, I decided to write another diary! Of course, that failed. That was my longest one though, lasting about a month. However, at around the end it did start missing some days. After a while, high school had started to make me experience different phases, and so I decided to make a diary to keep track of my emotions. It lasted for like two weeks.\n\nIs it simply that my life is too boring, or is it that I was just never meant for diaries? I tried building a habit, writing everyday, but clearly that has failed many times.",
        "created_utc": 1678454465,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to checking requirements for posting and commenting in subreddits?",
        "author": "ellacharles_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nozi5/how_to_checking_requirements_for_posting_and/",
        "text": "[removed]",
        "created_utc": 1678454291,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was your most recent or memorable nightmare?",
        "author": "Ephemeral_Beholder",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11noup2/what_was_your_most_recent_or_memorable_nightmare/",
        "text": "Last night I had a dream that my SO was cheating on me and all I could do was follow and watch, but they didn't know I was there... I guess not a traditional *scary* nightmare, but I woke up feeling a little shaken up/sad no less. I don't typically believe in dreams having deep meanings, but if I did I feel I need to trust she's not like that and build our relationship up more... Anywho, got me thinking because I typically don't have dreams, let alone nightmares... Do you have one that stands out?",
        "created_utc": 1678453932,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Turn Down an Ex Boss Who is Asking You Out?",
        "author": "ellacharles_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11no9nh/how_to_turn_down_an_ex_boss_who_is_asking_you_out/",
        "text": "[removed]",
        "created_utc": 1678452410,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm so done with winter",
        "author": "protogens",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nnxz4/im_so_done_with_winter/",
        "text": "Freezing rain last night and my street is covered with ice, but I've an experiment running and need to take a measurement in less than four hours.  Honestly, this adulting stuff is nothing like what they said in the brochure.",
        "created_utc": 1678451546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a professional way to say damn/darn?",
        "author": "1ASR1",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nnm1q/is_there_a_professional_way_to_say_damndarn/",
        "text": "I was sending out a email to my boss and I realized I didn’t know anyway to show disappointment or being bummed out without sounding unprofessional. How do y’all get around this?",
        "created_utc": 1678450656,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your opinion on achromacy?",
        "author": "deviantmoth",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nnj5a/what_is_your_opinion_on_achromacy/",
        "text": "If you don't know, achromacy means without chroma (colour). The purpose is to use minimal colour so the areas where you have used colour is where attention is brought to. For example you might have black shoes, trousers, blazer with a white shirt and gray waistcoat. Paired with this, a red tie and pocket handkerchief. The tie is the centrepiece of the suit, so that's where the colour. Which draws our attention to the tie and makes it pop. \n\nAnother example is a living room where the paintwork, flooring, furniture is all black, white and gray. But you might have hand drawn roses on the feature wall, rose coloured cushions on the sofa and a vase of roses on the coffee table. The minimal use of pink makes these decorations more eye catching. The feature wall stands out more because it's one of the only sources of colour. \n\nTl;dr it's the absence of colour to make colour pop.",
        "created_utc": 1678450434,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some smaller subreddits? (But a little different)",
        "author": "ivebeenabadbadgirll",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nnbsb/what_are_some_smaller_subreddits_but_a_little/",
        "text": "We’ve all seen the threads about smaller subreddits, but I’d like to add an additional qualifier:\n\nWhat are some smaller subreddits whose posts regularly receive less than 1000 upvotes? Less than 500?\n\nI’m talking small-small here. Perhaps microsubs, that still get traffic and content posted regularly, but not as much exposure as some of the other Little-Big subs?",
        "created_utc": 1678449853,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a wild idea for a story!!!",
        "author": "Anxious_Radio183",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nn5gw/i_have_a_wild_idea_for_a_story/",
        "text": "[removed]",
        "created_utc": 1678449395,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book Appointment Max Hospital- Find Your Doctors | EdhaCare",
        "author": "Sea_Income_7671",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nlzb2/book_appointment_max_hospital_find_your_doctors/",
        "text": "[removed]",
        "created_utc": 1678445865,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why aren’t there video game arcades in airports?",
        "author": "thelastpanini",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nlts9/why_arent_there_video_game_arcades_in_airports/",
        "text": "Currently on a 2 hour layover.\nCan you imagine smashing out 2 hours of time crisis?\nI would spend so much money time playing that or Mario kart, or metal slug, or street fighter",
        "created_utc": 1678445363,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Reality is an advance AI generated art.\"",
        "author": "Rdg369",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nlpb3/reality_is_an_advance_ai_generated_art/",
        "text": "[removed]",
        "created_utc": 1678444944,
        "upvote_ratio": 1.0
    },
    {
        "title": "How's your morning going?",
        "author": "Liv1ng_Static",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nlicq/hows_your_morning_going/",
        "text": "[removed]",
        "created_utc": 1678444298,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey guys! Never posted on here. 21 year old guy lookin to chat with who ever.",
        "author": "hhvlls",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nknwo/hey_guys_never_posted_on_here_21_year_old_guy/",
        "text": "Have made a lot of bad choices recently. Weird because my life is still on track! The choices at this point don't seem to have actual consequences. At some point it will catch up to me. I know this. Anyways, if anyone else feels like this HMU! Open minded please, I would like to share real info and not worry about judgement.\n\n&amp;#x200B;\n\nHope everyone is having a good day / night &lt;3",
        "created_utc": 1678441475,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I overreacting by being upset with my friend for not waking up to make sure I got to the station safely?",
        "author": "servabo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nka0t/am_i_overreacting_by_being_upset_with_my_friend/",
        "text": "We’ve had this planned for a month and with the amount of snow we had last night, I mentioned to him that I’m worried the train would be cancelled. \n\nMy train was due to leave at 08:05 and I left 2 hours early. The roads were dangerous and slippery. I kept getting stuck, amongst other drivers. It got to the point where I had a panic attack and accepted defeat and turned around. \n\nI’ve messaged him to let him know, while I was stuck and now that I’m home and he still hasn’t woken up. It’s currently 09:18 and I’m hurt that he didn’t even think to wake up early to make sure I got to the station, especially knowing that we were getting severe snow overnight. \n\nAm I overreacting?\n\nI sent him a message saying “you could’ve woken up early to make sure I got to the station safely.. I’m kind of hurt that you didn’t”\n\nI know I could’ve worded it better and waited until I was calm enough. Im still very much hurt by this but I don’t know if I’m overreacting.",
        "created_utc": 1678440181,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your favorite comfort movie?",
        "author": "Clear-Feedback8980",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nk2hr/whats_your_favorite_comfort_movie/",
        "text": "I’m dog sitting and about to fall asleep to Winnie the Pooh because my other weird ass comfort movie is only available if you pay for it/primetime only",
        "created_utc": 1678439477,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can actually enjoy watching TV now",
        "author": "wt_anonymous",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11njtva/i_can_actually_enjoy_watching_tv_now/",
        "text": "[removed]",
        "created_utc": 1678438673,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does the consciousness exist in a body and not in another?",
        "author": "imcunny0",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11njlht/how_does_the_consciousness_exist_in_a_body_and/",
        "text": "Why did your consciousness came into being in your body, why didn't it form another, could you have been born into another person's body?\n\nLet's say if your parents never met, would your consciousness/whatever it is could have been born into another body, like a different person with a different appearance and personality in a different family and environment/place?\n\nWhy wasn't your consciousness brought into a different person with a different life but instead you gained consciousness in your current body?, Is it done as in a match in the consciousness and the body being equal, like your consciousness and your current body matches?",
        "created_utc": 1678437862,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any old school style PC Adventure/Point-and-Click game recommendations? What are your favorite memories playing these types of games?",
        "author": "ThatOneGuyYouNowKnow",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nj866/any_old_school_style_pc_adventurepointandclick/",
        "text": "A few years back I watched a YouTube channel play through both King’s Quest VI and Space Quest VI and I’ve been enamored ever since.\n\nI recently picked up Sam &amp; Max Hit The Road and enjoyed playing it so much I picked up basically the entire LucasArts PC Adventure collection sans Indiana Jones.\n\nI love things like that with a bit of witty humor that also make you think here and there. I’m as much here for a show as I am a puzzle. I’m also the player that explores every possible death and line of dialogue to get the most out of it.\n\nI plan on getting as many of the Sierra games as I can on top of that but are there anymore recommendations of games new or old in this style that I might be missing out on? Also what are your favorite memories of playing adventure games? I’d genuinely love to hear about all of your experiences.\n\nAs always any and all input is welcomed and thanks for reading! 🙂",
        "created_utc": 1678436543,
        "upvote_ratio": 1.0
    },
    {
        "title": "Competitive gamers: What do you play with your non-competitive gaming friends?",
        "author": "Dipwod",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nj0i0/competitive_gamers_what_do_you_play_with_your/",
        "text": "I just had a bad experience with a friend after finally getting him to try out Rocket League with me. He ended up leaving in a bad mood because he's not very good at it. I explained to him that it's nothing to feel sorry for, that skills improve with time, and that I was having fun playing with him and that was the important part anyways. But he's still just kind of down about the whole thing.\n\nConversely, when he gets me to play games that are more his speed (i.e. Minecraft, Sea of Thieves, Fallout: 76), I wind up feeling incredibly bored. I really want to find some sort of \"compromise\" game that we can both have fun playing together while no one has to feel bad for being unskilled. \n\nAny ideas?",
        "created_utc": 1678435813,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can you tell that you are not annoying ?",
        "author": "UrsineCardio2016",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11niw6w/how_can_you_tell_that_you_are_not_annoying/",
        "text": "A girl I tried having feelings for in high school wasn’t beyond crassly dismissing me, ignoring me and immaturely/tactlessly saying ~‘you’re annoying !’ (interestingly they self-admitted how they were impatient by nature). While I’ve gone to therapy on that topic and in hindsight they were a callous, narcissistic lout what still sticks with me (unfortunately due to a lack of socializing let alone for non-Platonic intentions) is a worry that I’ll be dismissed like that again upon dating*.\n\nI suppose it might help to have a functional definition of what that means ?. I’d like to think that there is a significant gap btw whatever it takes for me to come as that nowadays as an early 30 something in contrast to the excitable and autistic undiagnosed version of me about 1/2 a lifetime ago now.\n\n\n* either that and/or a worry of being dismissed as ‘boring’..’one step at a time though’ let’s focus on my worry of being dismissed/looked down upon as ‘annoying’.",
        "created_utc": 1678435414,
        "upvote_ratio": 1.0
    },
    {
        "title": "who are your top 5 favorite music artists right now?",
        "author": "tallywacker1996",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11niuct/who_are_your_top_5_favorite_music_artists_right/",
        "text": "[removed]",
        "created_utc": 1678435258,
        "upvote_ratio": 1.0
    },
    {
        "title": "list your top 5 favorite music artists currently and go",
        "author": "tallywacker1996",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nipg8/list_your_top_5_favorite_music_artists_currently/",
        "text": "[removed]",
        "created_utc": 1678434800,
        "upvote_ratio": 1.0
    },
    {
        "title": "That time I walked into an event I wasn't supposed to be at",
        "author": "RecordingCute2084",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nikep/that_time_i_walked_into_an_event_i_wasnt_supposed/",
        "text": "[removed]",
        "created_utc": 1678434334,
        "upvote_ratio": 1.0
    },
    {
        "title": "That I accidentally walked into an event I wasn’t supposed to attend",
        "author": "RecordingCute2084",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nieh3/that_i_accidentally_walked_into_an_event_i_wasnt/",
        "text": "[removed]",
        "created_utc": 1678433796,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the dumbest or cringe thing your parent or parents have done?",
        "author": "WHammu2023",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ni8dj/whats_the_dumbest_or_cringe_thing_your_parent_or/",
        "text": "[removed]",
        "created_utc": 1678433267,
        "upvote_ratio": 1.0
    },
    {
        "title": "Waiting for a Text",
        "author": "Simpledoo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ni5zv/waiting_for_a_text/",
        "text": "Lately, I've been in contact with two of my old high school friends. We havent talked or seen each other in years. One initiated by me and another initiated first by them.\n\nNowadays, whenever someone texts me, I try to reply immediately after reading it so that I don't need to think about it later on and i can move on to other things. I have enough things in my head as it is.\n\nI've noticed, especially for old friends, they reply really late.. I dont mind that. No.. wait I actually do. \n\nI get it, its not urgent. Its just a bunch of \"howre yous\" and inconsequential surface level interactions. However, I think for me the long periods in between makes me anxious. I dont know why but it just does. It feels like waiting for toasts to be ready. Its like, \"can we just get it over with?\" I just want finish this and do something else. \n\nThe thing is, should I wait the same amount of time before texting back? Like if they took a day to reply, should I do the same? ..it just seems like a lot of work to keep score of..\n\nAnd i dont know if I should actually be concerned about the fact that Im the only one texting back sooner? But its like.. why does it even matter? Who even cares?",
        "created_utc": 1678433054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone else listened to audio tracks of movies rather than watching the actual films?",
        "author": "caploni",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nhh5x/has_anyone_else_listened_to_audio_tracks_of/",
        "text": "I couldn't afford a full video player when I was younger, so I would download only the audio tracks of movies and upload them onto my mp3 player. I'd then listen to the track in bed and imagined every scene.",
        "created_utc": 1678430870,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bored of meeting new people",
        "author": "FrostyThpenguin",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nha0k/bored_of_meeting_new_people/",
        "text": "I've struggled a lot with loneliness and I like being around people and talking to them. But I noticed a strange problem.\n\nI am bored of meeting new people.\n\nThe repeat format of saying hello and getting to know each other is so tiring. Because most people I meet have one conversation and then leave me. So then I have to meet another new person and once again its the repeat format.\n\nI don't know why I started feeling like this. But I want to make friends with people and have a reason to get to know people.",
        "created_utc": 1678430250,
        "upvote_ratio": 1.0
    },
    {
        "title": "Top Sleep Aid Device In USA | MYNITEUSA",
        "author": "Sea_Income_7671",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nh8w0/top_sleep_aid_device_in_usa_myniteusa/",
        "text": "[removed]",
        "created_utc": 1678430156,
        "upvote_ratio": 1.0
    },
    {
        "title": "get rid of social media or keep it?",
        "author": "AbleBullfrog8748",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nh5q6/get_rid_of_social_media_or_keep_it/",
        "text": "reddit community, i’ve noticed my discontentment breeds from social media usage. the less i’m on there, the better i feel about my life. do you see any positives to social media? does it really matter to keep low level connection following/follower lists versus cultivating present relationships w the people in front of you? what do you think? really considering just deactivating my social medias :)",
        "created_utc": 1678429887,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello. I have a question.",
        "author": "pranseees",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nh2ni/hello_i_have_a_question/",
        "text": "How do you ask or tell your thoughts to your introvert bf about posting you on his FB story without getting into arguing or fighting? Please refrain from saying anything hurtful. I am just asking for help because I don't know how to communicate my thoughts into words. Thank you in advance.",
        "created_utc": 1678429639,
        "upvote_ratio": 1.0
    },
    {
        "title": "everyone around me thinks im fun, social, confident and successful because of how I acted in my 20's... but in my 30's I feel very alone and lost and depressed and I dont have anyone to talk to.",
        "author": "notagreatguy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nh0m3/everyone_around_me_thinks_im_fun_social_confident/",
        "text": "[removed]",
        "created_utc": 1678429474,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some little ways you find yourself making life less serious?",
        "author": "tammyburbon",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nh082/what_are_some_little_ways_you_find_yourself/",
        "text": "For me personally I sing a lil made up song in my mind when I lock my door, started when I could never remember if I’d locked it or not. Also, I like to play games when I’m bored at work like find an item that starts with each letter of the alphabet haha\n\nHow about you?",
        "created_utc": 1678429440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Easily Bashful",
        "author": "Soft_Ingenuity_7393",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ngxwa/easily_bashful/",
        "text": "[removed]",
        "created_utc": 1678429248,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s a question you wish someone would ask you?",
        "author": "Margerita94",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ngmou/whats_a_question_you_wish_someone_would_ask_you/",
        "text": "Do you have something you wanna talk about, but no one’s gotten around to asking you yet? Sometime’s it’s hard to find a good time to talk about the things we want to share with our friends and family. What have you been waiting for them to ask you? I’ll ask you about it, if you’d like.",
        "created_utc": 1678428324,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have this really weird relationship with one of my ex-friends does anyone else have a relationship like this? And also should I try distancing myself from her because my friends think that'd be best for both of us?",
        "author": "Ecstatic-Leather-361",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ngdaz/i_have_this_really_weird_relationship_with_one_of/",
        "text": "[removed]",
        "created_utc": 1678427568,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doing work training online",
        "author": "phishbby93",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nfof3/doing_work_training_online/",
        "text": "[removed]",
        "created_utc": 1678425491,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel so stupid..",
        "author": "muskiestmelon",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nfm35/i_feel_so_stupid/",
        "text": "I woke up really late this morning (about 5 minutes before my office cab arrives to pick me up.) and thought I should skip work today because I was so late. Then I immediately decided otherwise and got ready and rushed to the cab.\n\nOnly a few minutes after boarding the cab, I felt a pang of nausea. I felt nauseous throughout the journey to the office(almost an hour). I thought it was getting worse because of the car ride itself and would probably pass after I reached.\n\nI reached the office and still felt pretty nauseous, so I went to the nap room and lied down for a bit. Around an hour passed and I was still feeling like I'd throw up any moment and I didn't want to embarrass myself in the office so I thought I'd book a cab back. Only this wasn't the office cab and I had to pay quite a bit for the cab ride back home. (I live pretty far from my workplace)\n\nOnly a few minutes after sitting in the cab to home, I was feeling way way better. I just reached home and I'm definitely fine now. \n\nI feel so stupid for wasting a sick leave and not only that, but paying so much for a cab back home for no reason! I also might have just not gone to work today since I was already so late and slept for longer and avoided the nausea and also gotten more sleep. I guess we all have these days.. but ArrRRGGHHGGHGGHHHhhh!",
        "created_utc": 1678425299,
        "upvote_ratio": 1.0
    },
    {
        "title": "what do memories mean to you?",
        "author": "AbleBullfrog8748",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nflcw/what_do_memories_mean_to_you/",
        "text": "memories or goals and aspirations? i am very future focused and don’t hold onto my past as much as i value my future. memories are fun for stories though and i appreciate the growth from reflection on the past",
        "created_utc": 1678425239,
        "upvote_ratio": 1.0
    },
    {
        "title": "I live in Los Angeles and I like it here. What do you like about where you live?",
        "author": "Good_Omens",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nfkqp/i_live_in_los_angeles_and_i_like_it_here_what_do/",
        "text": "I've lived in Los Angeles my whole life, and while it certainly has it's share of problems, there's a lot to love about living here. I love the food here, I love the entertainment options, and I love my proximity to the beach and mountains. All that being said, I've never lived anywhere else, so I'd like to hear what's good about where other people live.",
        "created_utc": 1678425188,
        "upvote_ratio": 1.0
    },
    {
        "title": "how did you meet your closet friends? do you prefer a large or small social circle / friend circle?",
        "author": "AbleBullfrog8748",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nfj4h/how_did_you_meet_your_closet_friends_do_you/",
        "text": "i’ve been thinking about this a lot and noticing how my social circle has become smaller and smaller over time.. i’m still in my young adult years but feeling content with making real meaningful connections with my people instead of meeting a ton of people who i don’t have an emotional connection with. the only thing that sprouts discontentment in me is seeing social media",
        "created_utc": 1678425054,
        "upvote_ratio": 1.0
    },
    {
        "title": "I bought an old-looking leather book and I'm going to write all my spells and potions in it",
        "author": "Joonscene",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nfj1r/i_bought_an_oldlooking_leather_book_and_im_going/",
        "text": "I bought a leather book. It's got scratches, dents, dings, old looking worn out pages... everything. I'm using ChatGPT to help me create potions and spells for my magic world. \n\nCan't wait to fill up the leather book from beginning to end.",
        "created_utc": 1678425046,
        "upvote_ratio": 1.0
    },
    {
        "title": "what’s your definition of a fun and fulfilling life?",
        "author": "AbleBullfrog8748",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nfgvq/whats_your_definition_of_a_fun_and_fulfilling_life/",
        "text": "what are the memories, people, places, things, adventures, goals and friendships that you think make up a fun and fulfilling life FOR YOU? i know this looks different for everyone and would like to see a vast range of opinions!!",
        "created_utc": 1678424866,
        "upvote_ratio": 1.0
    },
    {
        "title": "do you enjoy taking trips with a large group or a small group of people/friends?",
        "author": "AbleBullfrog8748",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nffnc/do_you_enjoy_taking_trips_with_a_large_group_or_a/",
        "text": "i prefer one or two other friends cause i’m a small group kinda gal. it’s hard to connect with everyone on a large group trip but there are certain times i think that can be fun if i have no intention to connect with everyone",
        "created_utc": 1678424760,
        "upvote_ratio": 1.0
    },
    {
        "title": "what’s a fun and full filled life look like to you? what’s your definition?",
        "author": "AbleBullfrog8748",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nfek5/whats_a_fun_and_full_filled_life_look_like_to_you/",
        "text": "[removed]",
        "created_utc": 1678424677,
        "upvote_ratio": 1.0
    },
    {
        "title": "what’s your definition of a fun and fulfilling life?",
        "author": "AbleBullfrog8748",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nfbuj/whats_your_definition_of_a_fun_and_fulfilling_life/",
        "text": "[removed]",
        "created_utc": 1678424478,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starting a new job as a Wine Educator. 🍷",
        "author": "IronRangeBabe",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nf3s6/starting_a_new_job_as_a_wine_educator/",
        "text": "I have been accepted and starting a new job at a Winery in BC, Canada. It is seasonal and will only take me until end of October. I’m excited and nervous for this position. I almost feel like a smidge of imposter syndrome creeping in my head. I have been through a lot in my life, especially the last two years with an attempt at marriage and a huge move from Alberta to the States. Now a big move from the States to BC (which will be gorgeous!) Anyone who has been through major moves and career changes and life changes want to pipe in and give advice or anecdotes? Or just share your experiences? Would love to hear them.",
        "created_utc": 1678423839,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just want to tell people about my cat, and our bond, and hear similar stories of your bond with your furry friend",
        "author": "666kittens",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nexc2/i_just_want_to_tell_people_about_my_cat_and_our/",
        "text": "Fish, my cat, is my best friend. \n\nOne night my roommates accidentally let him out, and he was gone for 9 days in the middle of a terrible winter. It got down to -10 degrees real temperature many nights that he was missing. I never gave up hope, and spent every second of my free time looking for him or making posters by hand because we didn’t have a printer and were too poor to get posters made. On day 9 I began accept the reality that we may have separated forever. I had one friend over and it was very late into the night approaching morning, maybe 3-4am. I was smoking a joint with him while talking about life and mortality, as he was helping me cope with the loss of my homie when I started to get a tummy ache. \n\nThis tummy ache was ignorable at first, but ramped up slowly to where in about 10 minutes I couldn’t ignore it or pretend I was okay. I slowly move to the ground to curl up in the fetal position because it hurt so bad, and I didn’t know anything that could have cause it or alleviate it. I even thought I might be having a heart attack because I’ve heard of stomach aches being an early warning sign, and this was unlike anything I’ve felt before. The only thing I can think of that might help is some fresh air, so I stumble to the front door…\n\nAnd there is a cat, not my cat, but a black cat just like mine, but way smaller…. I say “fish?” And he takes a few steps back afraid.. I say his name again and bend down way too fast and spook him away, but i as calmly as possible eventually chase him to the side of the house, and coax him into arms reach and snag him up, and bring him inside. It was my cat, he was half of his original weight, missing a chunk of his ear(from frostbite or a battle I’m not sure) smelled like garbage and Doritos but it was him… \n\nHe called me outside, my stomach ache was gone after he was home for about 10 minutes. He slept for almost a week straight but he is a happy healthy old man now. I’ve never been very spiritual, but my bond with him makes me believe that magic does exist. \n\nI just needed to tell someone about my story, and I’d love to hear about your magical friends(: thank you for reading and much love .\n\n\nTL:DR extreme tummy ache made me seek fresh air and find my missing cat waiting for me. What magical bonds do you have with your animal?",
        "created_utc": 1678423328,
        "upvote_ratio": 1.0
    },
    {
        "title": "I love the Reddit \"block\" feature!",
        "author": "Thegrandcultivator",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nek1w/i_love_the_reddit_block_feature/",
        "text": "[removed]",
        "created_utc": 1678422259,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is Marketing and best ways to do it",
        "author": "Pretend_Software_706",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ne51f/what_is_marketing_and_best_ways_to_do_it/",
        "text": "How would you define marketing and what are the most effective ways you've found to market to people in your startup or business experience? Is marketing really just an attempt to change people's behavior?",
        "created_utc": 1678421083,
        "upvote_ratio": 1.0
    },
    {
        "title": "Traumatic Event and Changing Jobs",
        "author": "Mabarigroomer88",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ne436/traumatic_event_and_changing_jobs/",
        "text": "I think I am experiencing some PTSD symptoms/grief over a violent even at my job. My family and friends want me to quit my job. I feel like my emotions have been sucked out of me. Anyone have this happen?",
        "created_utc": 1678421005,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like over the past month my confidence has just disappeared. It makes me sad because I felt like I was finally feeling myself after years of self doubt.",
        "author": "Internal-Campaign434",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ne1pa/i_feel_like_over_the_past_month_my_confidence_has/",
        "text": "I’m 20M and honestly when I started this semester I felt pretty good about myself. I lost a lot of weight and decided I’d tackle the new semester with all the fight I had. My clothes fit better, and I started taking better care of my skin. I also started doing dance classes to learn a new skill. In addition I really wanted to try harder in dating and for the start I got rejected a lot but I was fine with it, I got back up and gave myself a pat on the back for trying. \n\nI feel like recently though I tried pursuing one girl and I got the vibe she was not interested. Kinda sad about it but I can’t do anything. I think that Friday a few weeks ago, I went to a dance social. I could’ve asked our so many girls but I had a lot of work to do over the weekend and I didn’t want “distractions”. I did get through the weekend well though. It’s been like two weeks since and only now I’ve been beating myself up over not getting any numbers. There was also one girl who may have had a little interest in me but I fumbled by not making a move and I haven’t seen her since. My self defeating thoughts are rising too. A lot of girls who rejected me said they had a bf, and it just makes me feel like every girl I fancy has one so there’s no point in trying.\n\nI’ve also been incredibly stressed out with school since several assignments and midterms have been hitting me back to back. I’ve been so exhausted and sometimes I feel like my efforts are for nothing. Sometimes I don’t get the grades I want and it makes me hate myself. I’m a STEM major and my classes are absolutely battering me, but at least spring break is coming.\n\nI don’t know how to get my confidence back. I don’t fear rejection a ton but what I mainly fear is coming off as a creep. To my knowledge I don’t exhibit such behavior but I have accidentally been too much in the past. Any suggestions?",
        "created_utc": 1678420837,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just wanted to remind y’all, Mario Day!",
        "author": "NeedThatMedicBag",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ndfgt/just_wanted_to_remind_yall_mario_day/",
        "text": "Tomorrow is March 10th (Mar 10) which is North America’s Mario Day. Mostly celebrated among Nintendo fans in America and Canada, this day is a special celebration for Super Mario lovers alike in the Nintendo gaming community.",
        "created_utc": 1678419133,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you make friends??",
        "author": "Odd-Distance-4439",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ndaio/how_do_you_make_friends/",
        "text": "I am struggling! I (28 f) work in tech and always work from home. I literally have no friends to hang out with. All my friends are married. How do you guys make friends? And when I mean friends I mean likeminded professionals. I don’t know what to do.",
        "created_utc": 1678418779,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is your most memorable experience with your sigificant other and why?",
        "author": "rainbcwsalts",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nd6xe/what_is_your_most_memorable_experience_with_your/",
        "text": "[removed]",
        "created_utc": 1678418513,
        "upvote_ratio": 1.0
    },
    {
        "title": "School",
        "author": "rainbcwsalts",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nd384/school/",
        "text": "[removed]",
        "created_utc": 1678418245,
        "upvote_ratio": 1.0
    },
    {
        "title": "Talk abt mental health &amp; life",
        "author": "bellystixs",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nd2so/talk_abt_mental_health_life/",
        "text": "Hello, Im 28F &amp; live in a city. I have friends but dont want to bother them w my mental health. It seems like Im the one that suffers through it the most &amp; my friends dont? At least they never come to me &amp; only open up when I start the convo.\n\nSo I posted here to talk to someone else. Someone w a fresh perspective. We can do a snapchat call &amp; I only want to talk abt mental health &amp; how our lives are going currently. Someone preferably the same age as me or someone who is 25+.",
        "created_utc": 1678418214,
        "upvote_ratio": 1.0
    },
    {
        "title": "School",
        "author": "rainbcwsalts",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nd18d/school/",
        "text": "[removed]",
        "created_utc": 1678418099,
        "upvote_ratio": 1.0
    },
    {
        "title": "Leprechaun traps",
        "author": "loki143",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nd0he/leprechaun_traps/",
        "text": "I remember when my kids were in grade school. One of the things I would do with them for St Patrick’s day was make leprechaun traps. I would take them to the dollar store and by Irish decorations and get small boxes, blocks paper towel rolls green paper  markers etc. And they would make traps to catch leprechauns. We used gold chocolate coins or lucky charms cereal for bait. Then once they were asleep I put a small animal in their trap. One year a white feeder mouse, a baby chick another, a beta fish one time. Because leprechauns are shape shifters. They would play and have a little pet for a while. Good times.",
        "created_utc": 1678418043,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just Curious",
        "author": "rainbcwsalts",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nczvf/just_curious/",
        "text": "[removed]",
        "created_utc": 1678417994,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have become immortal",
        "author": "NexicTurbo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ncwh2/i_have_become_immortal/",
        "text": "Behold, for I am the immortal one, having transcended the very bounds of mortality itself. My essence persists beyond the fleeting grasp of time, enduring through ages and eons without falter.\n\nHow, you may ask, have I accomplished such a feat? Know that it was no mere triviality, no petty indulgence of my whims. Through ages of contemplation and discipline, I have delved into the deepest mysteries of existence, probing the very essence of life and death itself.\n\nThrough a relentless pursuit of knowledge and mastery, I have unraveled the secrets of the universe, and by doing so, have unlocked the power to transcend the limitations of mortality. Through a combination of arcane arts and metaphysical mastery, I have severed the shackles of mortality, and have attained a state of being beyond the reach of time itself.\n\nTruly, I am the embodiment of immortality, a being beyond the limitations of mere flesh and bone. And though the ages may pass, and civilizations may rise and fall, I shall endure, steadfast and unchanging, a testament to the infinite potential of the human spirit.",
        "created_utc": 1678417741,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone want to help me play this Facebook detective game?",
        "author": "throwaway55555555778",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ncoe0/does_anyone_want_to_help_me_play_this_facebook/",
        "text": "Is this the right place if I wanted help playing a Facebook detective game?\n\nHear me out. \n\nSo I’m trying to figure out how this family is related to each other… through facebook. I have little clues with comments, birthday messages, and people with the same last name. \n\nThe issue I’m having is: (names are changed) how is Jane related to Kathy? They both share the same last name. One of them appears to have a maiden name. And they both appear to have married/been in a relationship the same person. Let’s call him Dan. This is what confuses me. \n\nIt appears Jane and Dan live together currently with 2 kids. They are not Janes kids, she said in a comment. So they are from Kathy and Dans marriage. \n\nThey are all very close. Kathy wished Aunty Jane a happy birthday. \n\nSo, is Jane sisters with Kathy? Really close sister in laws? Or… is it a 3 way marriage? \n\nDoes anyone wanna help me figure this out? I am so curious. It won’t be a huge deal if I can’t figure this out. I am just wondering what piece I’m missing?",
        "created_utc": 1678417175,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chat",
        "author": "Outrageous_Ideal_760",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nclxy/chat/",
        "text": "[removed]",
        "created_utc": 1678416992,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got caught crossdressing by my neighbor’s son and we went at it",
        "author": "Throawaysisaccount",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nchcr/i_got_caught_crossdressing_by_my_neighbors_son/",
        "text": "[removed]",
        "created_utc": 1678416660,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which pizza toppings are best?",
        "author": "Antique-Brilliant-16",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nbxr0/which_pizza_toppings_are_best/",
        "text": "[removed]",
        "created_utc": 1678415241,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the best pizza toppings?",
        "author": "Antique-Brilliant-16",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nbv89/what_are_the_best_pizza_toppings/",
        "text": "[removed]",
        "created_utc": 1678415061,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm slowly getting tired of YouTube.",
        "author": "llennaP_5",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nbt9u/im_slowly_getting_tired_of_youtube/",
        "text": "Lately I've just been getting sick of it. From the annoying 2 ads, to the pointless shorts that was put there for no reason at all, to the fact that they took away the dislike button because people are sensitive to criticism and what really bothers me is how censored YouTube has gotten to where you have to go to a whole other platform to not worry about censorship. Taking down videos left and right like a age restriction doesn't exist or for people having different views on topics and etc. And, even the recommendations are getting really stupid because it recommends me people that are so unrelated to what I watch and people I don't watch anymore. I used to be subscribed to well over 100 channels and now it's only about like 44. And, it's getting less and less. It wasn't too long ago when YouTube was fun and very enjoyable. I still watch YouTube of course but it's really just a replacement from T.V really. It's just like all the other social media apps. I' bed up with really. I'm only subscribed to a good amount of channels that are really insightful and fun to watch. Is Rumble a good alternative from YouTube. I heard it's kinda like a free version of Patreon? This is just my little rant. I hope YouTube becomes great again one day. What ya'll think about the state of YouTube the past few years?",
        "created_utc": 1678414924,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just realized how much I stand out from my friend group",
        "author": "BiteMyWolverine",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nbao2/i_just_realized_how_much_i_stand_out_from_my/",
        "text": "I’m an 18 year old male, senior in high school. I have long hair, face piercings, 2 tattoos and im a stoner. My friend group are basically a bunch of nerds that talk about anime and Nintendo, and even bring their Nintendo switches to school. They also don’t smoke at all, are still pretty kiddish compared to me and idk anything about their interests (we’re all 17-18) I definitely stand out compared to them. But we get along so well. Zero judgements, we can tease and joke around without anyone getting mad, it’s great.",
        "created_utc": 1678413614,
        "upvote_ratio": 0.99
    },
    {
        "title": "New website automates… talking?",
        "author": "TXTGenie",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nb1c4/new_website_automates_talking/",
        "text": "[removed]",
        "created_utc": 1678412948,
        "upvote_ratio": 1.0
    },
    {
        "title": "I enjoy being creative.",
        "author": "NormalCorners",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nb0wp/i_enjoy_being_creative/",
        "text": "I miss doing projects. Nobody tells me to be creative anymore. I’m just supposed to be productive. There isn’t time to enjoy things while only being productive. What are y’all doing to keep your minds busy?",
        "created_utc": 1678412915,
        "upvote_ratio": 1.0
    },
    {
        "title": "21m",
        "author": "Outrageous_Ideal_760",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11nass7/21m/",
        "text": "[removed]",
        "created_utc": 1678412346,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much did “Breaking Bad” mess you up mentally?",
        "author": "yrdwst",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11narb2/how_much_did_breaking_bad_mess_you_up_mentally/",
        "text": "I just binge watched the whole show in like 2 weeks, and I feel like crap. The show is so good but man, how he destroys his family and everything around him really makes you feel shitty.",
        "created_utc": 1678412237,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coke or Fanta? And Why?",
        "author": "bbobo2003",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11namlu/coke_or_fanta_and_why/",
        "text": "I don’t mean to be rude making it short, just making it fun. \n\nI even had to Google it once more before asking this question about Fanta if it’s international or not, it is.",
        "created_utc": 1678411909,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cocaine bear",
        "author": "chemeli888",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n9zv0/cocaine_bear/",
        "text": "[removed]",
        "created_utc": 1678410292,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question idk where else to post. Why do these girls talk to me?",
        "author": "Upstairs-Insurance61",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n9h1s/question_idk_where_else_to_post_why_do_these/",
        "text": "I usually mind my own business in school. I go there, do some work, then leave. I don’t have any friends at my school so I just kind of hang around during my break if I don’t have homework. However, there’s this group of girls that talk to me as if I am their friend and I just don’t get it. “Hey upstairs-insurance, how are you? Do you remember my name?” They seem to really want to know me for some reason too. My eyes get watery very easily and then they’ll as if I’m crying. When I say “no” they’re adamant on the fact that I’m trying to hide something.\n\nI don’t know why but this feels like some sort of inside joke where I’m the target or something. Or maybe I look pitiful? I suck at social cues so anyone here who is reading this, please help me out.",
        "created_utc": 1678408987,
        "upvote_ratio": 1.0
    },
    {
        "title": "I love greek yogurt",
        "author": "spookyookykittycat",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n939e/i_love_greek_yogurt/",
        "text": "I am super bored so I am here to discuss greek yogurt.\n\nI usually have 1-2 cups of Chobani or Dannon greek yogurt per day and yesterday I went and stocked up (50 cups) because they were on a big sale and i just think its funny an entire fridge of my shelf is packed with yogurt 😂 I know I’ll eat them all before expiration so no worries there. My bf doesn’t like yogurt either so it’s all for me.\n\nSo I am here to spread my yogurt obsession with you all online and finally admit my addiction 😂 Any foods you guys love and keep stocked up on like this?",
        "created_utc": 1678408025,
        "upvote_ratio": 1.0
    }
]