[
    {
        "title": "Are +1s a thing of the past?",
        "author": "Calvinb1108",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116iafa/are_1s_a_thing_of_the_past/",
        "text": "Disclaimer: this is just a discussion, I'm not planning to bring this up or change the situation. I don't want this posted anywhere else.\n\nTLDR; bridesmaid not given a guest for upcoming wedding\n\nA friend of mine is getting married soon and I am a bridesmaid. I'm the only single bridesmaid (unsure about groomsmen) and I wasn't offered a guest spot. I'm not offended in any way (I had my own wedding once, and I know how stressful and expensive it is), but I am disappointed and I'm wondering if this is what I can expect as a single person attending a lot of weddings moving forward.\n\nI'm going through a divorce and not seriously dating anyone, although I have been seeing one guy regularly (the bride and groom have met him). I'm also very introverted and I find it difficult to socialize in large groups. I know the wedding is not about me in any way and regardless I will be there with bells on, but I am anxious and stressed about it. Luckily I will have a lot of friends there, but they are all in relationships and essentially I will be the 15th wheel.\n\nThis will be my second time being a bridesmaid since the split and I wasn't offered a guest either time. As far as I can tell from the outside, these are not low budget/small guestlist events.",
        "created_utc": 1676826896,
        "upvote_ratio": 1.0
    },
    {
        "title": "What videos would be a youtube national registry?",
        "author": "imactuallykools",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116hswe/what_videos_would_be_a_youtube_national_registry/",
        "text": "Since 1989, the library of congress has indoctrinated 25 films every december for preservation in the national film registry. This is basically that but for youtube videos. It will function the same way as the national film registry minus the rule that it has to be at least a decade old, as that REALLY limits it. So, what videos would be preserved, and what what would the first 25 be? I have a take on it that you can see here:\n\nhttps://youtube.com/playlist?list=PLBMQWO_ldWBLusb7DBK0OvNtHGZqiw01a",
        "created_utc": 1676825768,
        "upvote_ratio": 1.0
    },
    {
        "title": "Baby sounds EXACTLY like Trippie Red",
        "author": "EnvironmentalCash846",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116hhea/baby_sounds_exactly_like_trippie_red/",
        "text": "[removed]",
        "created_utc": 1676825053,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I find...",
        "author": "isaacsirchards3",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116hcf3/where_can_i_find/",
        "text": "[removed]",
        "created_utc": 1676824763,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theres a girl(probably 10 years)playing badminton all alone, its sad.",
        "author": "snotcar",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116h7s6/theres_a_girlprobably_10_yearsplaying_badminton/",
        "text": "I just came from class and I saw  a girl trying to play badminton all alone in the pavement at my apartment. She is hitting the cork once, then going to the other side and hitting it again. It's looks so sad, it's 10 pm maybe that's why there are no other friends to play by but still it's sad seeing her like that. \n\nShe went home now, I don't see her anymore, I wish I could go and play with her but I don't know her and also it will be weird trying to approach a little girl this late. \n\nI think being alone suits better when you are grown up but man it's terrible looking at a kid that lonely. Hope she finds a nice friend.",
        "created_utc": 1676824511,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your personal interests and hobbies?",
        "author": "Amran_hossan",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116h1ga/what_are_your_personal_interests_and_hobbies/",
        "text": "[removed]",
        "created_utc": 1676824144,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your personal interests and hobbies?",
        "author": "Amran_hossan",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116gzdk/what_are_your_personal_interests_and_hobbies/",
        "text": "[removed]",
        "created_utc": 1676824032,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this term/title right to call to a person directly?",
        "author": "imcunny0",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116grjf/is_this_termtitle_right_to_call_to_a_person/",
        "text": "So is this term \"this girl\" or \"this boy\" an appropriate title to refer to someone directly, \n\neg. Where are you going, this girl,\n\nThis boy, take your watch away,\n\nGet in the office, this girl,\n\nJust in case, I don't make use of these words, and I'm talking about people using this words to refer to someone directly, as a title, to replace their names if their names are unknown, so is this a right use of words?",
        "created_utc": 1676823654,
        "upvote_ratio": 1.0
    },
    {
        "title": "My father and brother died within 1 year, which was a very difficult ordeal for me to accept",
        "author": "bayu_creations",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116gnoo/my_father_and_brother_died_within_1_year_which/",
        "text": "I am a graduate of a private university who graduated 7 years ago. I experienced such a difficult story. When I was studying in semester 6, my brother left me and my father died too. I was frustrated at that time the burden of thoughts and costs hindered my education so that one day it turned out that God was fair by giving me so many miracles of sustenance so that I could graduate from a private university while still completing my thesis. After graduating from university, I looked for a job, did not get an application, the company always refused no calls, so I took the job of a teacher because I had family dependents while I was left looking for a little bit of fortune given by God, I am always grateful until now.  \n\n\nage 28, male    \n\n\ndo you guys have the same experience?",
        "created_utc": 1676823458,
        "upvote_ratio": 1.0
    },
    {
        "title": "opinion but moreso fact",
        "author": "InstanceResponsible6",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116fjwg/opinion_but_moreso_fact/",
        "text": "[removed]",
        "created_utc": 1676821894,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve realized recently that a large number of people don’t understand that gender identity and sexual orientation are not correlated.",
        "author": "bluewhalebluejay",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116f9c2/ive_realized_recently_that_a_large_number_of/",
        "text": "[removed]",
        "created_utc": 1676821484,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dating this new girl, it's been 3 weeks.",
        "author": "Natural20Twenty",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116f2c8/dating_this_new_girl_its_been_3_weeks/",
        "text": "Yesterday I worked a 12 hour shift. 8am to 8pm. She's from out of town and stayed over for the weekend and chilled at my place while I worked. \n\nAnd when I walked into the house after shift she greeted me with a rum and coke a kiss and dinner in the oven.\n\nI'm floored. She is amazing.",
        "created_utc": 1676821236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can ugly women find someone?",
        "author": "DatingAdviceGalore",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116esp6/can_ugly_women_find_someone/",
        "text": " I always see guys only want pretty girls. They'll ask them out, they'll swipe right and stuff on them. But what what about ugly (or even average) girls? Never have I ever seen a man looking for a woman who is conventionally unattractive or average-looking woman.\n\nI am average height and weight: 5'3\" and 152 lbs (last I checked). I dislike using make-up or shaving body hair or whitening my teeth to oblivion or having my hair \"on fleek\", so I never partake in those things. Wearing those convenionally feminine, \"flattering\" clothes isn't my thing either. My face is severely asymmetrical, I have a huge nose, one mild lazy-eye, lopsided lips, crooked-ish teeth, acne-scar covered face. Have pretty much no ass and zero boobs so body does not meet standards either. Basically, I'm unattractive in any conventionally-set standard, if you get my gist. (My hygiene is immaculate, though).\n\nIs there any hope for women like me? Are there any men who truly do not care about looks and will love you for you?",
        "created_utc": 1676820871,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who was a memorable childhood temporary friend that you closely bonded with for only a short time, while you were traveling with your parents?",
        "author": "TheSanityInspector",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116eeq4/who_was_a_memorable_childhood_temporary_friend/",
        "text": "My parents took me along to a large square dance festival, and I played with other children on the lawn outside. I still remember how intensely immersed I became in playing with this one boy, pretending to be superheroes. \n\nAnother instance was when we visited the Washington Monument, back when they would still let you walk up the steps. My parents struck up a conversation with a family in line with us. The boy and I bonded, and when it was time to go back down, our parents allowed us to go down the steps alone together. We raced down, taking the steps three at a time, vaulting over the handrails, etc. Great fun!",
        "created_utc": 1676820339,
        "upvote_ratio": 1.0
    },
    {
        "title": "My bf was comparing us (F20)",
        "author": "aqweru",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116e104/my_bf_was_comparing_us_f20/",
        "text": "my bf keeps comparing us, like the title says. \nYesterday morning I went to mardi gras w my friends and went to eat. I planned to spend time w my bf after his work but I told him that I threw up today, was still feeling drunk, and was super tired from the parade and that I won’t be able to see him. \nThis was when he was getting off literally at 7:30pm WHICH he went to a PARTY and he was gonna see me AFTER he visited the PARTY. He starts texting me after I ate my meal at the restaurant (where I still feel gross and tired) and let him know that I wouldnt meet up with him because I’ve been up since 9am and barely slept today to drop off my dad at the airport. \n“You know how pissed you’d be if I did that to u”\n“Idc but we’re not equal “\nThen he starts saying how glad he is that I went out because I don’t go out blah blah. \nHis kind words after what he said don’t feel the same bc im thinking why the hell he would be comparing us? I was out from 10am till 7pm and yes I did say we would hang out after work but things came up and I let him know. I don’t see why he would compare us when I wouldn’t get mad if he was hungover and tired because it’s UNDERSTANDABLE. \nThe fact that he’s not understanding w me is getting to me. Does anyone else see my point?",
        "created_utc": 1676819823,
        "upvote_ratio": 1.0
    },
    {
        "title": "how come my posts on other subreddits show as removed for others but i can still see them?",
        "author": "MButkus1995",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116duqp/how_come_my_posts_on_other_subreddits_show_as/",
        "text": "[removed]",
        "created_utc": 1676819555,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m happy",
        "author": "ShyChili",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116dcg6/im_happy/",
        "text": "I feel genuinely happy. \n\nIt’s been so long since I felt like this, that I cried tears of joy. Everything is just working out at the moment. My antidepressants are FINALLY working, after spendig years trying to find ones that work. I’m getting married in five months to the love of my life. University is great. I’m preparing to write my bachelor with my best friend, on a topic I’m really passionate about. My left foot is fucked up, but I’m getting surgery in 3 weeks and after that it’ll hopefully work the way it’s supposed to. I have an exciting placement coming up at a really cool place. Work is good. My energy levels haven’t been this high since I was 10, before I got depressed.\n\nI just feel great. Happy. Content. Life is amazing, and I am so grateful for everything and everyone I have in my life. \n\nWhat brings you joy? What are you grateful for? Small or big, I want to hear it all!",
        "created_utc": 1676818849,
        "upvote_ratio": 1.0
    },
    {
        "title": "网友谈中国的过去现在与将来",
        "author": "jingcaiwangwenji",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116ciuv/网友谈中国的过去现在与将来/",
        "text": "[removed]",
        "created_utc": 1676817691,
        "upvote_ratio": 1.0
    },
    {
        "title": "What can I do at home to reduce the time I spend looking at my laptop?",
        "author": "Total-Drama---",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116cf5m/what_can_i_do_at_home_to_reduce_the_time_i_spend/",
        "text": "Dumb but serious question. I'm not asking about going for a walk etc, I'm asking only about home activities. \n\nI read books and work out, I like cooking but that's not enough. I need to find something exciting so I don't spend my free time on Reddit and other social media.\n\nI write books on my laptop. I learn new language using the Internet and Duolingo. I got used to involving my laptop into everything I do at home - it started with educational intention. I watch movies in foreign language without subtitles to learn. When I'm cooking I have some English stand up or podcast in the background so I have more experience with that language too.\n\nAt this point I feel like I'm addicted and it gets in a way of my life quality. I would cut off the Internet for a few weeks but I can't do that - I need to write, I need to learn. And it's hard to separate it from browsing social media etc. \n\nI just have rather sensitive eyes, I'm not feeling well after a few hours staring at screens so I need to do something about it.\n\nWhat do you guys do at home without the Internet?",
        "created_utc": 1676817559,
        "upvote_ratio": 1.0
    },
    {
        "title": "i was on 🍄 yesterday and my trip was smooth asf man really peaceful",
        "author": "arikutuu",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116c17c/i_was_on_yesterday_and_my_trip_was_smooth_asf_man/",
        "text": "i woke up and took them around 6 am and man from right then and there i completely ignored my phone , i was outside mostly the whole day enjoying the sunlight and the breeze , i was toking my bong , tbh it wasn’t such a bad day , it was an okie day that i enjoyed in my own way : , ]",
        "created_utc": 1676817007,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dressing alt doesn't mean you're unique, dressing blandly doesn't mean you're not self expressing",
        "author": "Standard-Image181",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116bxb4/dressing_alt_doesnt_mean_youre_unique_dressing/",
        "text": "Alternative styles aren't really unique nor are you really expressing yourself. Merely copying what others are doing. Hence all the same septum rings, and all of the same style of clothing, tote bags etc.\n\nAnd being bland doesn't mean you're not expressing yourself. Expressing yourself means expressing who you want to be, if that is white polo and khakis so be it. Expressing yourself doesn't mean standing out or not being bland, it doesn't even mean being unique, it means dressing how you want.\n\nI myself don't dress to stand out but i dress in a pretty unique style, even alt people have said my style is really cool, but all this hatred towards \"boring\" people and the pretentious assumption that you're unique because you're a man who painted your nails really gets under my nerves, as if you're not doing because it's cool right now.",
        "created_utc": 1676816875,
        "upvote_ratio": 1.0
    },
    {
        "title": "I had the craziest and most realistic dream of my life and it's not even close",
        "author": "JustGotFookinBanned",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116bvx4/i_had_the_craziest_and_most_realistic_dream_of_my/",
        "text": "I would consider myself an overthinker which I now feel like could be a reason why I have very realistic dreams pretty often, but this dream had the feeling of it genuinely happening like it was real life, while having the craziest premise I've ever experienced, which was entering a black hole.\n\nIt started off with me just being in a crowd of maybe 30 people in an area that seemed to resemble some kind of city square with a fountain in the middle. Everyone was dispersed enough to each other where we weren't jam packed, but close enough to perhaps call out and get someone's attention very easily. Now this very quickly shifted gears as everyone in the area including myself began to look at the same part of the clear blue sky. It wasn't straight up, but more like looking at an angle where the sun may set. Out of nowhere in the spot where everyone was looking, a tiny black dot appeared and its presence was immediately felt. I could definitely feel some kind of force all over my body, which got stronger and stronger since the black dot got bigger and bigger. Soon it became apparent it was a black hole since it looked exactly like the depictions of one where it has a ring of light surrounding it and bending over the top. As it got closer, it felt like I was being pulled into it as if my legs were still planted on the ground and my body was being stretched into it, and my FOV began to rise like if you cranked your FOV to max in a video game. I also had this feeling of realizing what was happening, and that this would be the end of me, but I wasn't scared for some reason. Instead the only thought I had was \"I hope this doesn't hurt\", which at this time it didn't, but I definitely had this very strange sensation throughout my entire body. At this point I didn't see anyone else and I didn't see my body anymore. It was like only my eyes went into the black hole and once I was inside, the feeling was unbelievable. The only way I can put it is it felt absolutely divine. Like some kind of godly energy that felt so real and so powerful, unlike any feeling I've experienced before and that's still an understatement. Then out of nowhere, it felt like some kind of being was filling my mind with all sorts of other worldly things, almost all of which I can no longer remember. The only thing I do remember very vividly though is that it told me I now understand Latin, and right as that happened it felt like a switch was just flicked on and boom, I felt Latin bursting inside me and I'm like \"holy fucking shit I can understand Latin\". I could also see what I imagine was Latin text all around me in red letters. Now obviously I don't think any of this was correct Latin, but it truly felt like it was and it felt like I was now a god at the Latin language. Then for some reason I immediately thought of the Latin phrase \"memento mori\" which means \"remember you must die\". I had already known about this phrase so it's not like my brain manifested it out of nowhere in a dream (how insane would that have been lol). I don't remember much inside the black hole following this, but the dream wasn't over. The next thing I remember was walking out of a movie with a bunch of people, one of which for some reason felt like they were my friend even though I didn't recognize them and they made a comment about how great they feel now, as if they had also just experienced what I experienced. I felt great too, I felt like an untouchable god. Then to show how great my \"friend\" felt, he goes and pulls the fire alarm in the movie theater lol, like there were no consequences to anything anymore. And that's about where the dream ended. I've had other crazy wild dreams but nothing that made me feel the way I felt in this one.\n\nThoughts? What's the craziest dream you've ever experienced? I'd love to hear it.",
        "created_utc": 1676816828,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any cis people with a normal name they don't identify with?",
        "author": "Own-Aerie-8743",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116bvig/any_cis_people_with_a_normal_name_they_dont/",
        "text": "Not to exclude trans people but it already makes sense why you wouldn't identify with your dead name, if anyone wrongly calls you that, esp if it goes against your gender \n\nNot to exclude those with weird names but it's obvious why you don't identify with that name. If your name is \"Number 16 Bus Shelter\" for example \n\nI have a normal name that matches my gender and I don't hate it but it doesn't feel like me and I don't see many people talking can relate to that specifically. Like in a wow there is nothing wrong with my name but I feel like this name matches my vibes better",
        "created_utc": 1676816813,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone up to talk?",
        "author": "yungtrxst",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116bsky/anyone_up_to_talk/",
        "text": "My life is in a weird place but I don’t really have anybody to talk to about it with, I’d really like to hear what other people think I should do in my position",
        "created_utc": 1676816693,
        "upvote_ratio": 1.0
    },
    {
        "title": "The funniest thing about living in a small town with no tourists or anything is meeting people from different parts of the world for the first time",
        "author": "Just1person_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116bqan/the_funniest_thing_about_living_in_a_small_town/",
        "text": " \nI lived in a small town all of my life now, but yesterday I decided to go to the city for the first time in 4 years,  although I was so excited to see all these people from different countries, I was extremely nervous for some reason, which was funny to me, because why am I nervous about seeing another human being who is just like me? And then I told myself that I need to leave my town every now and then to make thing less awkward and nerve racking \n\nIf you ever experienced that, I would love to hear yalls stories",
        "created_utc": 1676816581,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frustrated College Graduate",
        "author": "YeStan1998",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116b8t0/frustrated_college_graduate/",
        "text": "Long story short, it’s recently been 3 years since I graduated from a 4-year university and I’ve yet to secure my career job. I graduated February 2020, we all know what came next, and since then worked a couple minimum wage jobs that I ultimately ended up quitting.\n\nThe most frustrating part about the past three years is I’ve had interviews with FOX, COMCAST, Power 106, and numerous ones at NBCUniversal, however nothing panned out, but all the other smaller companies I’ve applied for haven’t even reached out for an interview. (If all these huge companies are interviewing me, why aren’t local/small businesses?)\n\nI had went through a whole interview process with NBCUNIVERSAL prior to this past Christmas and everything went great, however after the New Year they informed me the job I had applied for was being retracted due to mass layoffs and budget cuts. The hiring manager and director of the department both informed me they planned on giving me the job, but it was out of their control at that point.\n\nAlthough much more has happened the past 3 years, I continue to be patient and hopeful I’ll have the opportunity to work in entertainment.\n\nI don’t need sympathy or comfort, I just want for whoever else is out there going through something similar that you’re not alone.",
        "created_utc": 1676815877,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've been having nightmares and I don't know why",
        "author": "imsorrymateWHOT",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116b2t3/ive_been_having_nightmares_and_i_dont_know_why/",
        "text": "Yesterday I dreamed that I killed someone.\n\nI was in a big place that felt like a shopping mall/airport that curved like a c and the center had a closed garden. I was in a queue waiting for something with a couple people right next to an elevator (of those separated from everything with glass walls to see it going up). The elevator wasn't there, and I was bored so I rested my forehead against the center of the doors that open to the glass space. The door opened (malfunction of sensors?) and I wasn't really surprised, but then the woman that was behind me in the queue jumped into this place, that goes about 1m (3/4 feet?) below the ground with the bottom of the elevator machinery, probably because of boredom too.\n\nThing is, the doors suddenly closed, and I obviously started panicking, fast. I looked up to try and see if the elevator was coming down but I couldn't see anything. There was a red button to make an emergency stop so I pressed it with my forehead, but it didn't work because I could hear the elevator running. People around me were panicking too and it got a crowd. I started smashing my forehead to the button but it wasn't working, the elevator had reached our floor and wasn't stopping. Before the elevator went all the way down I turned backwards and started running. People screamed but I kept running until I reached the garden/big open place in the middle. Then it ends.\n\nNothing, I just wanted to talk about it. I woke up with a feeling of panic and dread and it didn't go away for an hour or so. Then my chest calmed down but I can't stop thinking about it.\n\nA couple days ago I dreamed that I was eating what looked like a fried fish, but I remember I wasn't sure if it was really dead, even if fried. I started cutting it's tail to see for a reaction, and a bit else. Turned the plate around and just to make sure I cut though it's throat. When the knife went down i could feel its tendons and arteries and me cutting though them. It reminded me of what I imagined the guy from 127hours must have cut though in his arm. I was horrified and the fish started trying to jump, half dead, panicked. It was looking at me. I, in terror, pushed the knife all the way though with force, as to not make it suffer so much anymore.\n\nWoke up with same dread and unsettling gut-feeling.\n\nI seem to have dreams where I am the cause of death in a horrible way.",
        "created_utc": 1676815600,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is height really such a big deal in dating?",
        "author": "Crimson_Nightwing",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116as17/is_height_really_such_a_big_deal_in_dating/",
        "text": "I keep hearing quotes on insta like 'ladies, always go for tall men.' And, 'keep your standards high and stay away from short men' etc etc.' However, irl I see plenty of guys, as short as 5'4 dating beautiful women (some even taller than them without heels).\n\nMoreover, I personally knew 3 girls, all of whom when single were saying that they will not give a chance to a guy less than 6ft have now boyfriends who are all 5'6 - 5'8 range. \n\nMoreover, some of the most desired men from footballers like Leo Messi to actors like Daniel Radcliff and Gael Garcia are all below 5'8. So is this height craze just superficial and overhyped statement and not such a dealbreaker in real life for dating?",
        "created_utc": 1676814731,
        "upvote_ratio": 1.0
    },
    {
        "title": "I accepted a new job &amp; bf all in one day :)",
        "author": "mileygirl08",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116aofr/i_accepted_a_new_job_bf_all_in_one_day/",
        "text": "I can't believe it.  I interviewed &amp; accepted a temporary job of my dreams to teach circus arts to kids.  I have never felt so qualified and aligned with a job before in my life. \n\nlater, my friend reached out to me to ask if i was going to the bar to see my friend's band. I didn't plan on it but decided to made a night out of it before I leave town for the week. \nI was hopping between 4 friend groups (ranging from 21-60+ y/o) &amp; so excited to got to see everyone including my dad. \n\nThen I met an amazing guy (that actually has his life somewhat together) &amp; we hung out all night. turned out it was his family's bar, and he is next in the family line to own it. \n\nwe're going on our first official date after I get back from my solo birthday road trip. :))\n\nwhat a day, 2.18, i won't forget. &lt;3 \n\n\n\n\nxxxxxxx\nI was debating if I even wanted to make it to my 25th birthday, or just disappear along the path of my trip. I haven't felt like I've had anything going for me in a long time. \nnow I have reasons to come home &amp; be 25.",
        "created_utc": 1676814424,
        "upvote_ratio": 1.0
    },
    {
        "title": "Turning 19 soon and would like to get my mom a gift. Any ideas?",
        "author": "1234deal",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1169usf/turning_19_soon_and_would_like_to_get_my_mom_a/",
        "text": "My mom and I havent seen eye to eye on a lot of stuff but she's worked hard and she went through the work of raising and birthing me without a lot of thanks on my part. I dont want something really cheesy or grandiose cuz neither of us are like that. I'm also terrible at coming up with gift ideas myself. Any ideas? Is a gift certificate too tacky? Would a nice card suffice? I have a hard time writing down my feelings or sharing them with her in general.",
        "created_utc": 1676811983,
        "upvote_ratio": 1.0
    },
    {
        "title": "What the fuck is up with fashion shows",
        "author": "lemonrainbowhaze",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1168nl3/what_the_fuck_is_up_with_fashion_shows/",
        "text": "[removed]",
        "created_utc": 1676807872,
        "upvote_ratio": 1.0
    },
    {
        "title": "this year my Resolution was to keep my house today and today is the first day my family are coming to visit......",
        "author": "burkeymonster",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116844y/this_year_my_resolution_was_to_keep_my_house/",
        "text": "[removed]",
        "created_utc": 1676805599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are historical events forgotten ?",
        "author": "ivohric",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116814u/why_are_historical_events_forgotten/",
        "text": "[removed]",
        "created_utc": 1676805252,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does it mean when a guy text you quickly but the messages are dry ??",
        "author": "Tiny-Work-1854",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1167jgn/what_does_it_mean_when_a_guy_text_you_quickly_but/",
        "text": "[removed]",
        "created_utc": 1676803437,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is anyone watching Seinfeld in 2023?",
        "author": "PrettyFlyForAReply",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1167gh4/is_anyone_watching_seinfeld_in_2023/",
        "text": "[removed]",
        "created_utc": 1676803143,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't figure out what to do, which career path to take",
        "author": "far_from_earth",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11679uz/cant_figure_out_what_to_do_which_career_path_to/",
        "text": "So the thing is I am a business and management graduate. I completed my Bachlores in Business Administration around this time last year . I did 2 months Intern during my last semester at a commercial bank. After completition of bachelors I was in desperate need of a job so I started working for this project but due to some personal reason I had to leave it.\n\n Then I joined Master currently I am doing MBA currently at the end of 1st semster. Now the thing Is I want to start working but idk which path to take. Yes Ik by now I should have it figured out but nope I dont know what to do. \n\nI have classes early morning till 9 AM after that I am completely free. So now I want to start working but I can't figure out where to apply. I have intern experience at bank but I don't want to get into corporate sector now. I just want to work somewhere where it is less hectic then banks? By less what I mean is when you work at bank (as per experience, talks and observation )it's hectic: 10am-5pm sometimes even more especially during end of the month, 6 days a week, work pressure, dresscode, hard to manage time for studies and assignemnt, etc. and I don't want to get into it at this moment. I want to work somewhere else but I can't figure out where, I can't figure what to do. I am planning to apply in some NGOs/INGOS, or similar but still I am so confused. \n\nSo please share your insight and suggestions \n\n\nThanks for reading",
        "created_utc": 1676802503,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone made me want to be in love, but not necessarily with them. Does that make sense?",
        "author": "Ancient_Ad_4820",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11678v9/someone_made_me_want_to_be_in_love_but_not/",
        "text": "I met someone and we had a great time. We’re keeping touch but I don’t think it’ll go anywhere and that’s ok cause I’m not sure about this person anyway. \n\nHowever, I’ve been feeling a bit down cause finding love/getting into a relationship seem like an impossible task. I want to be in love but I’m not gonna get hung up about this person cause deep down I know it’s not about them but what they triggered in me, or reminded me I could have. \n\nDoes that make sense or is this this a feeling of love for this specific person that I’m not letting myself engage with?",
        "created_utc": 1676802409,
        "upvote_ratio": 1.0
    },
    {
        "title": "This a public announcement for all my veggies haters out there, let’s talk about it",
        "author": "Just1person_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1166sgz/this_a_public_announcement_for_all_my_veggies/",
        "text": "I can not understand how a person can prefer veggies over fruits! Like how?! I could starve myself to death before eating any kind of vegetables (except potatoes, we love potatoes) \n\nWith fruits, they have all these sweet flavors and textures that anyone can enjoy, but veggies are just bland and depressing \n\nIf you're a veggies hater like myself, what's your Savior fruit?",
        "created_utc": 1676800835,
        "upvote_ratio": 1.0
    },
    {
        "title": "New chill music is coming out 🔥🔥🔥",
        "author": "7friday_official",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1166fnn/new_chill_music_is_coming_out/",
        "text": "[removed]",
        "created_utc": 1676799462,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is making you happy atm?",
        "author": "uwupricklypear",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1166e66/what_is_making_you_happy_atm/",
        "text": "It’s the morning and I woke up earlier than I usually manage to, I’ve had breakfast and my sister went out for a walk so I am chilling with a cup of tea in the living room just thinking about my life. \n\nI’m feeling excited and happy about my life. Last week I was offered a job I really wanted and I will officially start my dream career in September. Yesterday I broke my personal record for a 5k. I’m crocheting a summer hat and I am loving it. I’ve spent time with my family this weekend without the pressures of work or university. I’ve been active and eating well. The sun is shining and I am excited to go out on my long run today, it’s just one of those days where things are lining up and you feel great. \n\nWhat are you happy about/thankful for?",
        "created_utc": 1676799300,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am a year 12 student looking into political correctness. If you know or have an pinion on the matter could you please take your time to fill this out. All will be taken into consideration. Thank you!",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1676799089,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your most embarrassing Uber story?",
        "author": "thelonelyvirgo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11640gx/whats_your_most_embarrassing_uber_story/",
        "text": "I was reading an article that explains how you can check your ratings from drivers. (Settings &gt; Privacy &gt; Privacy Center &gt; Would you like to see a summary of how you use Uber?) \n\nTurns out that I have a perfect record! \n\nAnd yet…I feel it might not be completely accurate.\n\nA few years ago, I was meeting someone at Starbucks. They had laid the groundwork for a breakup and I wasn’t super jazzed about it. \n\nI explained to them that I wanted to take an Uber because I was anxious (and that anxiety was validated by their breakup with me lmao). I knew I’d be too upset or distracted either way, so I opted for an Uber. It wasn’t far, less than five miles from my home.\n\nI ordered an Uber when it was all said and done. I did my best to hold it together. No sooner did I get into their car did I burst into tears. My driver was not from the United States and was visibly alarmed by my behavior (which I also felt bad about). I didn’t do anything crazy, I just couldn’t stop crying.\n\nHe tried his best to console me, but I couldn’t really focus on anything but my own sadness, coupled with not wanting to broadcast that sadness to people on the road.\n\nHe turned on calming music. He tried to talk to me. None of it worked. I don’t think I’ve ever seen a more uncomfortable human being, let alone someone I was stuck in a car with for twenty minutes.\n\nWhen I got home and got some privacy, I rated him and accidentally tipped him $60 instead of $6. (I paid $77 to get broken up with and make a nice eastern Indian man moderately uncomfortable).\n\n**Bonus story**\n\nA few weeks after that encounter, I went out with a friend and had a few drinks. I overestimated my abilities and nearly vomited in the back of the driver’s car. Thankfully, the warning he gave me about paying $250 to have the upholstery cleaned seemed to cure my temporary sickness, but I know he had to be annoyed by my bellyaching.",
        "created_utc": 1676789928,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going on a date with a guy (nervous)",
        "author": "GuyTalksTV",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1163tn3/going_on_a_date_with_a_guy_nervous/",
        "text": "I (20 M) am going on a date with a guy I met on tinder. I’ve always considered myself as straight, but lately I’ve been questioning it again. \n\nWe’ve had a few conversations over text.\nWe’re going to get dinner and see a movie a week from today. I’m so nervous",
        "created_utc": 1676789181,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any Zillenial babies here?",
        "author": "EstablishmentOdd7929",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1163rf9/any_zillenial_babies_here/",
        "text": "[removed]",
        "created_utc": 1676788938,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are are so many CKJV ideographs hard to type out?",
        "author": "MickeyWong",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1162jfx/why_are_are_so_many_ckjv_ideographs_hard_to_type/",
        "text": "Something I’ve been doing research on recently is that Chinese characters can be similar across many parts of Asia as “CKJV ideographs”. When typing them out on a screen, I noticed that some of them look very different. For the most part I see people see these characters in a san-serif font, while some others use a more regular serif font. Some characters dont exist and aren’t even registered into this thing call the Unicode, so they don’t appear as text; instead they are made out by using these blocky boxes which I’m assumes arranges multiple characters as components and converts them into something that fits into one character slot. I’m using an online database called https://zi.tools for reference. How exactly does this work? Is it possible to get more characters registered into the Unicode to have them be readable as text?\n\nI was also thinking I could somehow use these for my own creations if possible.",
        "created_utc": 1676784475,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just realized that today is my cake day!",
        "author": "wildcatginn",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1162hkx/i_just_realized_that_today_is_my_cake_day/",
        "text": "[removed]",
        "created_utc": 1676784285,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just gave my dog a taco",
        "author": "DogTacoGiver1",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1162gcd/i_just_gave_my_dog_a_taco/",
        "text": "[removed]",
        "created_utc": 1676784154,
        "upvote_ratio": 1.0
    },
    {
        "title": "With Baseball season starting just casual conversation. Who is your favorite team?",
        "author": "LeeCrunchesData",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1161t6d/with_baseball_season_starting_just_casual/",
        "text": "[removed]",
        "created_utc": 1676781961,
        "upvote_ratio": 1.0
    },
    {
        "title": "today was a sweet and sour day",
        "author": "eclipse113",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1161dhf/today_was_a_sweet_and_sour_day/",
        "text": "I'm a waiter, I got 5 bucks from yesterday's tip, my pen leaked, I helped a lot in the kitchen slicing fruit, a coworker dropped tacos and I got to eat them lol, I got to taste clericot, the coworker who dropped the food got me to attend the customers the tacos were for (they waited 30 mins for their tacos and a pasta that never came) there were problems with the cash cut and I ended the day with 20 cents, bit I am happy after all.",
        "created_utc": 1676780505,
        "upvote_ratio": 1.0
    },
    {
        "title": "Life - A Bruh Moment",
        "author": "ffsstfualready",
        "url": "https://www.reddit.com/r/CasualConversation/comments/116134d/life_a_bruh_moment/",
        "text": "[removed]",
        "created_utc": 1676779564,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to stop spending so much time on my computer",
        "author": "IAmNotAFetish",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1160tx7/i_want_to_stop_spending_so_much_time_on_my/",
        "text": "When I am at home, I spend almost all of my free time on my laptop. I need more hobbies to get me off of my laptop. I don't have any real, close friends. I spend way too much time on reddit and twitch on my laptop. It helps me to feel less lonely. However, I am just going to have to get used to being alone with my thoughts sometimes. I would like some encouragement. Thanks",
        "created_utc": 1676778745,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's something interesting or exciting that has happened to you recently?",
        "author": "CuddleUber",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1160oxk/whats_something_interesting_or_exciting_that_has/",
        "text": "I'll go first, I got my first gaming console and been playing my favorite game.\n\nThe reason it's such a big deal is because coming from a poor background I never thought I'd be able to afford it but today not only I got a console but a game worth 80 euros which as a kid I would have never thought I'd ever buy..\n\nFunny how time changes",
        "created_utc": 1676778295,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's something interesting or exciting that has happened to you recently?",
        "author": "CuddleUber",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1160mjr/whats_something_interesting_or_exciting_that_has/",
        "text": "[removed]",
        "created_utc": 1676778089,
        "upvote_ratio": 1.0
    },
    {
        "title": "Takeoff of the week",
        "author": "Correct-Volume-3278",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115zw5g/takeoff_of_the_week/",
        "text": "[removed]",
        "created_utc": 1676775862,
        "upvote_ratio": 1.0
    },
    {
        "title": "I like how random everything in the big Lebowski is",
        "author": "adepressedgoddess",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115zlcy/i_like_how_random_everything_in_the_big_lebowski/",
        "text": "[removed]",
        "created_utc": 1676774990,
        "upvote_ratio": 1.0
    },
    {
        "title": "Working on Power Point Presentation for Bio. What's your favorite animal?",
        "author": "MelodicHunter",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115zdkl/working_on_power_point_presentation_for_bio_whats/",
        "text": "Hey, people! What's up?  \n\n\nAfter struggling with chronic pain and depression, I am trying to catch up on school work!  \n\n\nWe had to pick an endangered species in our state and make a power point presentation about them.  I am NOT about the presentation part, but I do love a good power point, so it's at least fun to work on?  \n\n\nIt's about the northern goshawk. I absolutely love birds and I've always loved raptors.  I wish falconry was still more common and easy to get into, because I would be there in a heartbeat.  \n\n\nBut, I currently have a cockatiel and two pigeons, so that counts for something?",
        "created_utc": 1676774359,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if we made flavored ice cubes that made the drink turn the flavor?(ex: water to watermelon with 3 watermelon flavored ice cubes)",
        "author": "Dan-timothy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115zc7x/what_if_we_made_flavored_ice_cubes_that_made_the/",
        "text": "[removed]",
        "created_utc": 1676774244,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey y'all here's how it is.",
        "author": "yeahnothanks12367",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115z7l2/hey_yall_heres_how_it_is/",
        "text": "I'm 23. I joined the USAF when I was 18 and got discharged at 20 for minor misconduct, failure to clean my room. I was depressed and I think I warranted a mental health discharge. Anyways now I can't stop thinking about rejoining the military and am actively working to get my discharge upgraded. Gonna finish this associates and then a bachelors. I've got a 3.8 and I'm on the dean's list which is pretty cool after all the time previously I've dropped out. I've got a job interview on the 21st for an overnight warehouse job which I could definitely use. I'm gonna start volunteering at some organization that is military or veteran facing and build that track record for years. Keeping my nose clean not a dang thing on my record and gonna keep it that way. Pretty smart guy got a 98 on the asvab back then and hopefully can do it again. Doing all the research to make a strong application, gathering evidence and relevant documentation. Been doing good in my day to day habits, going to the gym 4+ times a week for months and definitely seeing results in the mirror and the way I feel. Kind of slacked recently on the cardio, recently I actually got a bit winded just running a few blocks which was a wake up call now that I've skipped the run at the end of the workout a few times in a row. Gonna fix that and overall try to workout more intensely now especially as summer approaches. Pretty lonely basically all the time but so calloused now that I can survive and thrive despite that. Staying consistent with learning guitar and Norwegian every day (jeg elsker Norge!) as well as journaling. Starting to incorporate meditation and drawing as well into the routine. Been making sure to walk the dogs more often consistently, love being out in nature. I cannot stop thinking, sometimes my head feels so heavy I can't keep myself looking at the horizon and have to look down at my feet. I've been free of nicotine and weed for a long while now and really dialed back the caffeine and alcohol. Had three beers tonight, first alcohol in a week or more. Analyzed my relationship with alcohol and felt really good that I genuinely practice moderation in general. Balance is so key, in all facets of life. Allowing myself to be proud of my progress now while simultaneously not deluding myself as to how far yet I still have to go. No self pity allowed. I've been reading consistently too, mostly war memoirs recently, I just finished Generation Kill and now I'm reading Hero Living nightly and internalizing it. Listening to great music as opposed to my depressed days where all I used to listen to was dark trap, rap, and lofi. The further I go the further I have left. Anyways, end rant. Such a strange knife-edge balance I exist in between ecstatic greatness and utter despair. It all hinges on not breaking, forging myself in the crucible. Alright, thanks y'all. Peace.",
        "created_utc": 1676773859,
        "upvote_ratio": 1.0
    },
    {
        "title": "How was your day?",
        "author": "linenback",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115z1ck/how_was_your_day/",
        "text": "Did you work today? Did you have the day off? What did you do? Was it a good day? A bad day?\n\nPersonally I tried getting work done this morning but I have been less productive than I would have liked. I didn't make any plans so... here I am.",
        "created_utc": 1676773370,
        "upvote_ratio": 1.0
    },
    {
        "title": "trying to motivate myself to get up and do a few things",
        "author": "neonglowputty",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115z0tw/trying_to_motivate_myself_to_get_up_and_do_a_few/",
        "text": "its a rest day for me. i need these days often because i have a chronic illness and if i dont rest a lot, i get sick\n\nproblems is, ive done too much resting, and now my brain is in a funk. that mood where im incredibly bored and no activity sounds good or holds my attention. i know that if i get up, take a shower, and tidy up my space a little bit (i have some dishes in here and laundry i need to fold 😅) i will feel a lot better and will think of something i want to do\n\nthe struggle is getting myself to get my butt up and do it lol. what are some ways you motivate yourself in times like this?",
        "created_utc": 1676773327,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am baffled by Jimmy Buffet/his fans...",
        "author": "wonderingwhy12",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115yisg/i_am_baffled_by_jimmy_buffethis_fans/",
        "text": "Now don't come at me- I do like some of his songs. \nHis music falls into so many different genres, and I can't quite get a handle on where he actually falls. Is he country? gospel? tropic? folk? rock? All of it LOL? Like I dunno. \n\nAlso, have you seen those tailgate vids on youtube? They are *wild*. His fans are the strangest cross-section of people (mostly white it seems). A fuck ton of drunk boomers  LOL, and weirdly quite a lot of frat/sorority kids. Are any of you fans? Or I guess it's Parrotheads, right? Wild stuff man...fill me in if you can. (I know I can read his wikipedia, but that only tells you so much.)",
        "created_utc": 1676771964,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey. What's going on tonight? Ask me anything to distract me from my sadness...",
        "author": "GreenEyes_BlueSkies",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115ygwo/hey_whats_going_on_tonight_ask_me_anything_to/",
        "text": "What's going on with you all tonight?  I'm just so sad and I need a distraction from my own thoughts.\n\nAnd no!  I don't want to talk about why I am sad though.\n\nI am 29, female.\n\nWhat did you guys do today?  Ask me anything.  All topics are on the table.",
        "created_utc": 1676771810,
        "upvote_ratio": 1.0
    },
    {
        "title": "No idea what to do about my little fictional world",
        "author": "AdventurersScribe",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115xkti/no_idea_what_to_do_about_my_little_fictional_world/",
        "text": "I have been fascinated with sci-fi and fantasy ever since I was a kid. I even started trying to write a thing or two when I was in elementary. Of course if was mostly crap and heavily influenced if not downright copied things from other works I was reading or watching.\n\nLater on I kinda reformed and managed to spit out a sci-fi story that felt pretty good, it was original and completely new. Then I fixated on my fantasy world. I didn't share it pretty much with anyone. There were tons of mistakes of course, especially in the first work I finished (160 ish A5 pages). Many mistakes, some logical mistakes as well but I moved on to other works as it was just a practice and the skeleton of that story was pretty good. Never published tho cause I'd need to rework it heavily.\n\nSince then I have a lot of problems with actually getting into writing and adding to my world. I have so many ideas and started so many small stories, yet I don't seem to be able to finish any or to actually add much more to the world, or better to put those ideas on paper and I'm utterly terrified to share it with people because I'm afraid of negative reviews or generally bad reception of my work.\n\nIdeas are not the problem, I have just too many of those. An idea for a long Saga with mostly thought out parts, of course it's just a skelet, just the basic big points and the general vision of the story, big plot points etc. On the other hand I want to work on history, mythology, fauna and the world in general. Even did some map drawings and worked on a wiki (currently 80 pages, many titles but not completely filled). Sometimes I feel like I'm about to explode with these things and I really want people to see my world, I want to tell more about it but so far it's nowhere near actually being presented. It's a very important thing for me and I have tons of notes, names, everything. \n\nThe world is mostly set as a medieval fantasy with magic, creatures, races, gods etc. I'm trying to keep some stuff as realistic as possible, it gets kinda graphic sometimes and overall it's not a happy place, at least not most times. But there's a lot of beauty in there and since I just love the monters from any kind of books,games, movies, mythologies etc I am always creating or adapting them into my world and stories.\n\nIf anyone would want to know more, I'll gladly talk about some parts.\n\nTL,DR: I have started creating a fantasy world but am afraid of bad reception so I'm not putting much effort into actually writing the stories.",
        "created_utc": 1676769226,
        "upvote_ratio": 1.0
    },
    {
        "title": "As a White guy, I sometimes would go to a Chinese cafe and just sit down and listen to the many conversations.",
        "author": "Thegrandcultivator",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115xigw/as_a_white_guy_i_sometimes_would_go_to_a_chinese/",
        "text": "It is a plus because it have delicious food, but I think many of the people assume that a White guy can't understand Chinese, which leads to hilarious, and sometimes sensitive conversations happening around me. \n\nI like to frequent that cafe and order some chow mein or some popcorn chicken and just listen to the conversations around me.\n\nIt motivates me to learn new languages.",
        "created_utc": 1676769028,
        "upvote_ratio": 1.0
    },
    {
        "title": "I recently lost some weight and can now call myself a \"healthy\" weight according to the BMI scale.",
        "author": "GreasyPeter",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115xcuw/i_recently_lost_some_weight_and_can_now_call/",
        "text": "I'm a straight man but I was taking a look down at my waste area sitting in this chair and I realized now qualify as a snack. I imagine some women agree (I would hope, haha). This is a new sort of confidence I haven't had in a long while.",
        "created_utc": 1676768563,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your thoughts about waiting to eat until everyone else has gotten their food?",
        "author": "Ulrich-Stern",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115x71z/what_are_your_thoughts_about_waiting_to_eat_until/",
        "text": "When I was younger, I was taught to wait until everyone else got their food before eating mine if I got mine first. \n\nNow, I don't do that as often anymore, at home at least since it's just my mom and I. I try to wait when I'm at like a work lunch or something. And I think I'd wait if on a date.\n\nWhat do y'all think? Do you wait? Should we wait? Why or why not?",
        "created_utc": 1676768093,
        "upvote_ratio": 1.0
    },
    {
        "title": "Essentia is the best bottled water ever",
        "author": "wearenotyourkind_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115wx2a/essentia_is_the_best_bottled_water_ever/",
        "text": "I love essential water, I think it’s better than any other bottled water. Their isn’t many waters I like but essentia is by far the best one I ever had, I know some people say all water tastes the same but I promise it doesn’t. Go drink a ice cold essentia on a hot summer day and you’ll see what I’m talking about. What is everyone else’s take on this?",
        "created_utc": 1676767266,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m supremely lonely",
        "author": "eggplantmctwist",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115wkpv/im_supremely_lonely/",
        "text": "I mean, not much else to say. I’m a mom/wife/teacher in my 30s with no real friends of my own. I suffer from depression and have been feeling really great the last year or so. Recently though I just feel so damn lonely. I just want someone to talk to, to get to know. \n\nI also think it comes from the fact that we are really in the trenches of parenthood and my husband and I very much are living the “same shit, different day” kind of life.\n\nI’m escaping into Stardew Valley and really finding it way too exciting when I become friends with the NPCs. I’m hoping spring will help my mood.",
        "created_utc": 1676766243,
        "upvote_ratio": 1.0
    },
    {
        "title": "We all need to love ourselves first",
        "author": "Coldshroom",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115wfcz/we_all_need_to_love_ourselves_first/",
        "text": "Navigating through a difficult relationship right now, and I fear that if I leave it, I will not be able to find anyone else. Then I realise this desperation is exactly why my standards of men are so low that I tend to get into relationships like this. I want to remind myself and everyone who see this post that we all deserve so much love. If I learnt anything, endless compromises won't get your more love. Time to love myself the way I love others.",
        "created_utc": 1676765827,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally a cold, winter day - anyone else excited to just make a cold weather dinner?",
        "author": "cdubz-1986",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115wf60/finally_a_cold_winter_day_anyone_else_excited_to/",
        "text": "Happy weekend all - hope it's been going well for you.\n\nThis winter especially it has been quite the mild winter - this past month was the warmest on record in over 90 years. And today, well we finally got back to having a normal, below freezing winter day; normally as we would have a lot of those, it gets tired quickly.\n\nBut since we haven't had this in a decent bit of time, well, that means...winter cooking. It was wonderful roasting a cornish henz and having stuffing, and fresh gravy...even after eating, it just smells so nice in here. \n\nWhat are some of your favorite go-to winter meals? Any memories associated with them? \n\nAnd well cornish hen, stuffing, and fresh cranberry sauce: https://imgur.com/a/Inxdh2i",
        "created_utc": 1676765810,
        "upvote_ratio": 1.0
    },
    {
        "title": "Download Psychology in Your Life Third Edition |by Sarah Grison| [PDF FORMAT]",
        "author": "ebooksblogg",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115vafx/download_psychology_in_your_life_third_edition_by/",
        "text": "## Details of the e-book\"Psychology in Your Life 3rd edition \":\n\n# Authors: by Sarah Grison Michael GazzanigaPublisher: W. W. Norton &amp; Company; Third edition (July 1, 2019)Format: PDF Paperback: 768 pagesLanguage: English ISBN-13: 978-0393673913ISBN-10 ‏: ‎039367391XThe price: 19.99$,[Direct Download of the book \"Psychology in Your Life Third Edition \" in PDF FORMAT](https://www.ebooksblogg.com/2023/02/download-psychology-in-your-life-third.html)",
        "created_utc": 1676762686,
        "upvote_ratio": 1.0
    },
    {
        "title": "Superpowers: Shrinking vs. Teleporting",
        "author": "Emoisum",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115v7gs/superpowers_shrinking_vs_teleporting/",
        "text": "My wife adamantly dislikes Ant-Mans powers because she compares it to teleporting. Only in the aspect of hand to hand combat, which has the upper hand? \n\nHer argument is that they're just shrinking out of the way and still have to avoid, where as a teleporter isn't \"there\" and bamfs out of the way. \n\nIgnoring other feats: Shrinking vs. Teleporting in hand to hand combat? (Her reference is Nightcrawler vs. Ant-Man) I know itd ultimately come down to experience and what not, but let's just ignore that.",
        "created_utc": 1676762452,
        "upvote_ratio": 1.0
    },
    {
        "title": "Long ago, my mother took me and my little brother with her to the grocery store....",
        "author": "3erfvbyh",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115umf1/long_ago_my_mother_took_me_and_my_little_brother/",
        "text": "When we were about to check out, my little bro saw a little person for the first time... he gasped and yelled \"look mom, that guy looks like Donkey Kong!\". She abandoned her cart and we all hurried out of the store with him. She busted out laughing outside and we asked her what was going on. She could not explain.",
        "created_utc": 1676760921,
        "upvote_ratio": 1.0
    },
    {
        "title": "what's something weird your pet does?",
        "author": "pissed_leopard",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115tvng/whats_something_weird_your_pet_does/",
        "text": "[removed]",
        "created_utc": 1676758993,
        "upvote_ratio": 1.0
    },
    {
        "title": "This year I decided to watch a movie everyday that I haven’t watched before.(WEEK 7)",
        "author": "seri0usj0ker",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115toav/this_year_i_decided_to_watch_a_movie_everyday/",
        "text": "I gave then a ratings on how much i liked it \n\nThis was the 7th week\n\nFeel free to ask about why that particular rating\n\n\n43 the iron giant 1999 {7.5/10} (February 12)\n\n44 groundhog day 1993 {8/10} (February 13)\n\n45 phone booth 2002{8/10} (February 14}\n\n46 sick 2022 {7/10} (February 15)\n\n47 ant man 3 2023 {7/10} (February 16)\n\n48 infinity pool 2023 {6.5/10} (February 17)\n\n49 sharper 2023 {7.5/10} (February 18)",
        "created_utc": 1676758480,
        "upvote_ratio": 1.0
    },
    {
        "title": "I always gets surprised when someone is attracted to me",
        "author": "elissa3636",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115sm56/i_always_gets_surprised_when_someone_is_attracted/",
        "text": "[removed]",
        "created_utc": 1676756324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should Americans feel lucky to have everything? (For example, having every brand, able to access anything or large number of people from every ethnic groups)?",
        "author": "XDerkan",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115rb2s/should_americans_feel_lucky_to_have_everything/",
        "text": "Is it just me or I feel like you guys have everything? As I said in the title, everytime I see something about US, I am just saying wow they are very lucky that they born in America or wow they have everything. For instance, ethnic groups, you guys have millions of millions of people from each counrty, especially from Asia and it's just hurts me that many beautiful Asians are living there where I am just imagining to find one. Thank you in advance. I just wanted to express my opinion.",
        "created_utc": 1676754324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Many years ago, a friend described the perfect egg",
        "author": "death-jazz",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115qz5z/many_years_ago_a_friend_described_the_perfect_egg/",
        "text": "It was at a sleepover for a friend's birthday. In the morning the host's mother was going to cook bacon and eggs for the 6 or 7 of us, and she asked us how we like our eggs. I don't remember for sure but I imagine she wasn't intending to cook each guest's eggs exactly as they liked; it was more intended like a vote where the majority would decide how the eggs were done.\n\nEach kid cast their vote, runny or firm, until last of all it came to M, who said: \"I like my eggs flipped and for the yolks to be cooked around the outside with just a fine layer of nice, almost jelly-like yolk in the middle.\" The mother sighed and shook her head, and we all laughed. This was probably twenty years ago, but for whatever reason it's one of those little life moments that embedded itself in my memory.\n\nIn recent years I've switched from having cereal to one fried egg and either a sausage or some bacon for breakfast, because that seems to be better for my body type and metabolism. I don't pay a lot of attention when I'm cooking the egg, but sometimes it comes out just the way M described and in my opinion, that is the perfect egg.\n\nOf that group, M is the only one I kept in touch with, and to this day he remains one of my closest friends. I've never brought this memory up but I will next time I see him. I wonder if he even remembers that party. Before I mention anything though, I'll ask how he likes his eggs - see if the answer is still the same.\n\nWhat's a 'little life moment' that has always stayed with you?",
        "created_utc": 1676753857,
        "upvote_ratio": 1.0
    },
    {
        "title": "My cousin used to bully me quite badly. (I was told years later that she did it because she liked me). Is it normal to bully someone you like?",
        "author": "leaf_earth_light",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115qiqs/my_cousin_used_to_bully_me_quite_badly_i_was_told/",
        "text": "(Just so you know she isn't blood related to me) \n\nMy cousin who I used to see quite often who I don't see much anymore due to family conflict used to bully me quite alot. She would always try and find a way to insult me or be rude and embarrass me. There were times where she would kick me and punch me and get me in trouble if I hit back. She was 13 at the time and I was only 11, she was taller than me aswell. One time I was at an outdoor event playing with other kids and she was there and I think I was talking to another girl and trying to impress her by saying I went on a huge rolla coaster ride and didn't find it scary at all. Unfortunately while I was talking to this girl my cousin who was trying to embarrass me told the girl that I used to cry like a little girl whenever I was at amusement parks and couldn't go on rides (mind you I had never been to an amusement park with my cousin so she was making it up). This annoyed me so much so in response I insulted my cousin. I can't quite remember what I said but I probably shouldn't have said it because shortly after I insulted her, she yanked my shorts right down and unfortunately my underwear came down with it exposing me bare infront of the girl I was talking to and the other kids. There was roars of laughter and it was extremely embarrassing. What made it even more embarrassing was my cousin saying \"woopsie daisy\" mockingly when she pulled down my shorts \n\nI didn't tell anyone about this specific incident  but my family members told me years later that she used to pick on me because she liked me (She wasn't blood related btw) but I still get angry thinking about her because of the bullying she did to me. Is it normal for kids to bully other kids because they fancy them?",
        "created_utc": 1676753232,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anger is a destructive emotion and I believe it is unnecessary.",
        "author": "DerelictB",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115q34c/anger_is_a_destructive_emotion_and_i_believe_it/",
        "text": "Anger is a powerful and a harmful emotion. When experienced at its most intense level, it can be the most destructive of all emotions. For instance, road rage is a situation that is often fueled by anger, causing drivers to react impulsively and aggressively. If individuals are able to let go of their anger and ignore the incident, they can easily move on. However, road rage is often triggered by the heat of the moment.",
        "created_utc": 1676752643,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Story Of Gerald: The Current Storyline",
        "author": "OMNI909",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115pzbr/the_story_of_gerald_the_current_storyline/",
        "text": "Hello to everyone here. Today i will be telling you a story of chaos which originated as the weirdest youtube comment string i have ever seen. So i decided to wasted an hour copying and pasting EVERY SINGLE COMMENT. Anyways i hope you enjoy....\n\nDay 1: My friends have been telling me about this new app called 'desktop goose' Maybe i will install it?\n\n (for those of you that dont know 'desktop goose' is a 'malware' that will make a goose appear on your screen and pull memes on the screen. if you want more info[https://www.youtube.com/watch?v=EQx6fyrZDWM](https://www.youtube.com/watch?v=EQx6fyrZDWM) theres the link to a video about it. Anyways back to the story)\n\n Day 2: The dang devil has been wrecking havoc all day. Not cool. \n\nDay 5: I have decided to name him Gerald. Gerald is cool sometimes. \n\nDay 20: I now have 10 Geralds protecting my desktop at all times.\n\n Day 50: My desktop is now nothing but Geralds. I've never felt better\n\n Day 100: A chicken tried to infiltrate my desktop and was instantly shredded by the mass of Geralds  \n\n  Day 609: The Gerald army has taken over the screen and the cursor is not responding.The computer is very effective at warming the room \n\nDay 2000: I can't hear anything but the honking. I can't sleep.\n\n Day 10000: a chicken tried to impersonate a goose. Did not end well for the chicken\n\n Day 20000: The city is filled with honks and angry screams of people getting stolen by the army of Geralds I don't know how much I'll be able to resi- qimfhwkmsl\n\n Day 30000: The Geralds has filled both northern and southern America, and was accidentally sent over to Europe. Geralds are taking over.\n\n Day 35000: The Geralds started building Camps for chickens, cause chickens are now rare. They try to save the chickens.\n\n Day 35001: the coronavirus kills thousands of geralds but the geralds wont stop spreading\n\n Day 50000: The Earth is now Gerald. \n\n Day 60,001: The Geralds have taken over the Milky Way. They are now proceeding to take over the universe.\n\n day 100,000 : the geralds are getting extinct slowly and the heaven and hell space is filling up day 150,001: the last Gerald has died. the 5 lucky chickens began reproducing and began colonising the entire universe.  (some chickens got revived by some traitor but then was caught and killed)\n\n  IN AN ALTERNATE UNIVERSEEEEE (where the geralds never died)\n\n&amp;#x200B;\n\nDay 200,00000: Geralds discovered science they created a virus that turn humana into Geralds\n\n \n\n Day ???: You thought it was over? It's been so long that time has died, days don't exist anymore.  Just Gerald. They say god doesn't play dice, but Gerald plays god.  Alternate universes have succumb to Gerald. He is no longer a goose, not even an entity nor being.  Words nor actions can even fathom Gerald. Just Gerald. Only Gerald.  He plays with existence and his honks cause the very fabric of reality to shake like a long rope across a canyon.  Fuck geese, and fuck Gerald.\n\n&amp;#x200B;\n\n  BACK IN MAIN UNIVERSEEEEEEEE \n\n&amp;#x200B;\n\n day ERROR: CAN NOT DISPLAY, NUMBER WAY TO BIG:  all the geralds somehow revived due to an unknown reason and now they are somehow colonizing another existence,  and it's outside of the simulation.  \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n DAY  R̵̥̱͖̰͍̹͉̫͕͈͔̼̰̦̯̠̎̇̃̐̑̄̾̈̆̔̅̒E̷̡̛̪͈̭̤̠̙̩̜͉̣̜̮̙͂̄͑̚͝D̴̨̡̨̧̛̪̜͙̫̣͖͖͇̻̪̠̱͚͓͔̗͕̝̻͔͍̳̈́̂̆͛̓̔͂͆̆̈́̑͐̒̇̕Ą̶̡̨̢̘̩͍̠̺̬̠̜͔̫͇͚͚̻̻̗͍̬̗̖̟͙̜̝̞̏̾ͅC̶̢̡̧̮̺̭͖̗͎̙̬͉̦͇͍̹̖̭̬͉͈͗̿͂̓̋̀͛̇͂̌͐̿͊͑̓̃͌̾̎̚͝ͅŢ̶̱̠̻̘̤̝̖̱̙͌͌̉̃̇̊́͐̕̕͘͝Ẻ̷̼͔̱̱͉͍̖̮̙̥̫̘̪͈͗̅̂̿̕͜Ḍ̴̫̟̉̊̒̃̍̀̍̍̋̃̀̉͝͝  : THE GERALDS HAVE ESCAPED THE SIMULATION AND ARE TEARING DOWN THE MULTIVERSE SEND HELPPPPPPP. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n  IN YET ANOTHER PARRALEL UNIVERSE:  (where the main protaganist had a dream of everything that happened in the other 2 universes)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n  Day 0: oh youre finally awake!\n\n&amp;#x200B;\n\n  Day 1: The dang devil has been wrecking havoc all day- wait, this feels familiar. \n\n Day 2: I deleted the goose, I had bad vibes from it, plus it was annoying. \n\n day 3: There's one more goose left....  and you have no idea now they're slowly multiplying and trying to send themselves to cloud.  \n\n Day 4: All websites only display the text \"hjonk\" now\n\n&amp;#x200B;\n\n  . now its up to you. You get to decide where the story goes next along with the comment section of the original yt string. i await your decisions...................",
        "created_utc": 1676752507,
        "upvote_ratio": 1.0
    },
    {
        "title": "It always cracks me up when people ask reddit to check on my mental health when they disagree with what I say.",
        "author": "No_Pomegranate2580",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115pz62/it_always_cracks_me_up_when_people_ask_reddit_to/",
        "text": "It always happens with mild differences of opinions.  The holding call in the Superbowl was correct, I like educational method A but not B.  I don't like a certain video game.  I don't understand why people do it, why would anyone care?",
        "created_utc": 1676752502,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s a conversation",
        "author": "silentlegion116",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115plsz/whats_a_conversation/",
        "text": "What are some not day to day mundane things to talk about, what’s a conversation with basis and conclusions . I think i have a misunderstanding of the whole concept of conversations .",
        "created_utc": 1676751990,
        "upvote_ratio": 1.0
    },
    {
        "title": "feeling down about past relationship",
        "author": "i_am_ry_an",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115ph2u/feeling_down_about_past_relationship/",
        "text": "I was dating the girl of my dreams for about a year and as her family issues got worse, she started getting worse and worse panic attacks. we decided to go out separate ways in October so she could focus on mental health issues, but I'm missing her. we were super compatible and were best friends. I tried reaching out to her at the beginning of the month to get drinks, but she said she \"isn't looking for a relationship\". I told her I just wanted closure or avoid ending everything on a bad note but she hasn't responded. I just feel pretty depressed about it and hope she knows that I care about her. I hope one day we can reconnect\n I don't want to be pushy about it at all so I know I shouldn't text her if she isn't going to respond but goddamn do I miss her. what would be best for me to keep my head up?",
        "created_utc": 1676751800,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's a subreddit that you have no reason to post in, but is always fun for you to lurk?",
        "author": "crypticsillyposter",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115p0fa/whats_a_subreddit_that_you_have_no_reason_to_post/",
        "text": "[removed]",
        "created_utc": 1676751162,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to convey to people that if they are in a tough place in public, they can come to me?",
        "author": "tipofanacorn",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115on75/how_to_convey_to_people_that_if_they_are_in_a/",
        "text": "[removed]",
        "created_utc": 1676750652,
        "upvote_ratio": 1.0
    },
    {
        "title": "It is rare to start needing glasses in your 20s",
        "author": "MainBiscotti9050",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115of1a/it_is_rare_to_start_needing_glasses_in_your_20s/",
        "text": "\nWhile taking a shower i was thinking about the fact that i saw really blurry, because i wasn’t wearing my glasses, and then i started thinking about how i only recently started wearing glasses a couple of months ago, and realized that it is actually rare for people my age (25) to start needing glasses for the first time in your life. They either need them when they’re kids or when they are about 40 years old or older. Is this true from your experience aswell. All of my friends who wear glasses, all got them for the first time when they were kids. My case is not very normal. Has any of you people had perfect eyesight in your teens and then needed glasses in your 20s?",
        "created_utc": 1676750343,
        "upvote_ratio": 0.99
    },
    {
        "title": "I never feel angry",
        "author": "BigFrame8879",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115n7qy/i_never_feel_angry/",
        "text": "Road rage incident tonight and the other guy was not only in the wrong but flew into a hulk like rage. \n\nAnd I never felt any anger, and I never do anymore.  I used to have anger issues but I just feel chill AF all the time these days, even if someone is raging at me. \n\nCan anyone else relate?",
        "created_utc": 1676748643,
        "upvote_ratio": 1.0
    },
    {
        "title": "I´m finishing my master´s degree this year and i just want to live and have fun afterwards",
        "author": "strawburry-coke",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115n0d9/im_finishing_my_masters_degree_this_year_and_i/",
        "text": "[removed]",
        "created_utc": 1676748253,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there something such as a music addiction?",
        "author": "Prestigious-Rise4826",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115mjh8/is_there_something_such_as_a_music_addiction/",
        "text": "I literally cannot go a single day without listening to music, I’m not talking abt just having background noise, it has to be specifically a song, and I actively hunt for new music to add to my current rotation, while it hasn’t affected my ability in any part of my life, it’s just weird that I’m this attached to music that I couldn’t help but wonder is there something such as a music addiction",
        "created_utc": 1676746993,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend's ripped underwear",
        "author": "bbygirlshorty",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115mj7q/my_boyfriends_ripped_underwear/",
        "text": "My boyfriend has a hole in either one of his underwears or one of socks. Yesterday I wore one of his underwear, and it cracked a HUGE hole between the booty cheeks. 🤣😭 I showed it to him and he didn't thought it was funny at but laughed with me. Then I told him to keep them still, so that when his mom does his laundry she's gonna be like wtf 💀💀💀🤣",
        "created_utc": 1676746972,
        "upvote_ratio": 1.0
    },
    {
        "title": "MLM's degrading friendships",
        "author": "AlaskaFI",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115mice/mlms_degrading_friendships/",
        "text": "You know, I find myself avoiding friends who are in an MLM, their spouse is in an MLM or they keep inviting me to their friends mlm or \"shopping parties\". They can be surprisingly pushy about trying to make me go to events that sell products that I don't use, or buy their whizzbang of the week. \n\nOtherwise these are usually nice people.  I feel for them, but it also makes me feel used.  And over time that cools the relationship until our only contact is when they try to sell me things.  I guess I don't understand why people ever want to attend these high pressure sales events if they don't want the product.",
        "created_utc": 1676746911,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Can You Express Your Rightful Outrage?",
        "author": "GreenFireTM",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115ly97/how_can_you_express_your_rightful_outrage/",
        "text": "[removed]",
        "created_utc": 1676745364,
        "upvote_ratio": 1.0
    },
    {
        "title": "I allowed myself to spend money",
        "author": "Shot-Bobcat-2759",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115ly62/i_allowed_myself_to_spend_money/",
        "text": "I have a 2008 Toyota Yaris which I brought to the dealer to get 3 recalls done. \n\nThey also did an inspection and found a loose and squealy belt. No surprise to me, that thing squeals like a banshee when the engine is cold. \n\nCost to do everything was $100…ugh, maaaybe I can do the belt later? Nah screw it, $100 is a drop in the bucket for my net worth, give me that service. I would keep procrastinating it otherwise.",
        "created_utc": 1676745357,
        "upvote_ratio": 1.0
    },
    {
        "title": "Enjoying old(er) songs that i never listened to back then. What songs or genres are you enjoying now that you never cared for back in the day?",
        "author": "Meatloafxx",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115lnig/enjoying_older_songs_that_i_never_listened_to/",
        "text": "Grunge rock was never ever my thing at its height in the 90s. Far from it actually. And now i've been binging on Nirvana, Pearl Jam, and Alice in Chains lately. I'm loving 70s funk and disco even though i thought it was embarrassing to enjoy that era when i was younger. Superstition by Stevie Wonder is now one of my all time jams. Much of the 80s hits has a nostalgic cheesiness that i dig which is part of its charm, yet most of these songs were either \"whatever\" to me as a child. What songs or genres are you retroactively enjoying now?",
        "created_utc": 1676744566,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tell me something nice you've bought for yourself recently!",
        "author": "Gh0sti3pi",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115lg5k/tell_me_something_nice_youve_bought_for_yourself/",
        "text": "It doesn't have to be anything expensive, maybe just something you've wanted for a while and finally got.\n\n I finally bought myself (an older model) iPad for the sole purpose of drawing! I've wanted one forever but I have a very hard time justifying spending money on myself (sometimes even for necessities lol).  I'm the exact opposite when it comes to spending on my family/friends though. Anyways, I'm kinda proud of myself, but also feeling a little guilty. Haha!",
        "created_utc": 1676744029,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is chat gpt?",
        "author": "Few_Initiative3490",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115le5e/what_is_chat_gpt/",
        "text": "[removed]",
        "created_utc": 1676743877,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do people find it okay to respond to a text months later?",
        "author": "Dizzy_Opportunity861",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115ldte/how_do_people_find_it_okay_to_respond_to_a_text/",
        "text": "I'll text someone asking him to hang out sometime. They'll deliberately ignore the text for months, but when they need me to do a favor for them, they'll reply, \"Ahh sorry I didn't see the text/ I forgot to reply / I was busy\" - come on, it doesn't take more than 2 minutes to say \"Sorry man I'm busy\" or something like that. And then they will proceed to ask me for a favor or something like that. \n\nThis doesn't happen very often, and I don't mind it that much, but it happens frequently enough that it just frustrates me how they can have personalities like that. It happens when I disagree with someone on something, the last guy did this because I preferred some anime he disliked to some that he liked. Very petty. I have no problem cutting these people off but it sometimes feels many people out there only want to exploit others' kindness and that frustrates me.",
        "created_utc": 1676743851,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a way of earning money?",
        "author": "Few_Initiative3490",
        "url": "https://www.reddit.com/r/CasualConversation/comments/115lcf2/what_is_a_way_of_earning_money/",
        "text": "[removed]",
        "created_utc": 1676743755,
        "upvote_ratio": 1.0
    }
]