[
    {
        "title": "help me find out what happened",
        "author": "legamen11",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n92g7/help_me_find_out_what_happened/",
        "text": "So as a kid i played this game called Experiment z zombies on my phone and all of my friends used to play it with me and years later i wanted to revisit the game but the game hasnt got an update since i played it years ago and barely anyone even play the game the developer of the game is \"Cyclops games\" i went to their twitter and they said they had an second account they will be using but the account doesnt exist anymore if anyone can find any info about what happened to the developer of the game or the game itself and why did it stop getting updates please tell me. I also tried to find info but i couldnt",
        "created_utc": 1678407966,
        "upvote_ratio": 1.0
    },
    {
        "title": "21M",
        "author": "Outrageous_Ideal_760",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n8poi/21m/",
        "text": "[removed]",
        "created_utc": 1678407097,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spoonerisms will never not be funny",
        "author": "Largerer",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n8fnx/spoonerisms_will_never_not_be_funny/",
        "text": "Like please dont correct yourself or start stuttering just own it, I obviously know what you meant lol\n\nIdk its just funny when ppl get all flustered, even funnier when the spoonerism is still a complete sentence that makes sense",
        "created_utc": 1678406458,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spoonerisms will never not be funny",
        "author": "Largerer",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n8d31/spoonerisms_will_never_not_be_funny/",
        "text": "[removed]",
        "created_utc": 1678406303,
        "upvote_ratio": 1.0
    },
    {
        "title": "hi anyones like philosophy?",
        "author": "loljoker200",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n89ei/hi_anyones_like_philosophy/",
        "text": "I learn about metaphysic , existentialism , materialism , weiwu (purposelessness) , nihilism ,absurdism ,pluralism . If anyone's like philosophy feel free to dm / comment :D",
        "created_utc": 1678406050,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cleaning up and found we had over $1000 worth of unused restaurant gift cards!",
        "author": "mkymouse73",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n82hf/cleaning_up_and_found_we_had_over_1000_worth_of/",
        "text": "We knew we had them lying around as we got them as gifts over the years but never got to using them, well COVID happened, and most weren’t restaurants we had been going to regularly.\nNow we’re trying to make it a point to use at least one a week, a free dinner out! And it’s fun to try restaurants we hadnt been to before.  Use those gift cards!",
        "created_utc": 1678405587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Soy nueva en esto alguien que me pueda explicar cómo funciona esto??",
        "author": "RoussPink",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n7rcg/soy_nueva_en_esto_alguien_que_me_pueda_explicar/",
        "text": "[removed]",
        "created_utc": 1678404852,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm not too young that people don't take me seriously, nor am I old enough that people actually take me seriously.",
        "author": "Mohamed99egy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n7hiy/im_not_too_young_that_people_dont_take_me/",
        "text": "Sorry for the complex structure of title, but it sums up briefly a problem that I'm currently facing in my social life.\n\nSo I'm in my early 20's, I'm legally considered an adult and a productive member of the society.\n\n\nMy relatives and strangers stopped treating me like a child who has a narrow understanding of the surrounding world, now I engage in deeper conversations and communicate my multi-dimensional opinions and give my valuable input to any subject that's thrown at me.\n\nBut I still feel like I'm not old enough, it's like that I'm not quite there yet to be fully considered a serious grown ass man, even my looks doesn't suggest my age and I look 3 years younger, even one time a local plumber came to our house and he addressed me as \"dear\" which in my native language is fatherly way of addressing young kids. I felt like 14 years old lol.\n\n\nI know this could be too much of a first world problem and maybe I'm being a drama king, but I'd be glad if I found people who felt the same as I do\n\n\nThanks for reading up till this point, I hope your day has been amazing!",
        "created_utc": 1678404234,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else has this weird relationship with reddit where you post stuff and then delete it after few hours",
        "author": "Consistent-Algae5632",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n73ww/anyone_else_has_this_weird_relationship_with/",
        "text": "This is so strange because objectively this is the only social media where no one knows who I am and yet this is a place where I feel most embarrassed to keep up my posts/comments.. but I can’t be the only one right?",
        "created_utc": 1678403371,
        "upvote_ratio": 1.0
    },
    {
        "title": "What I see in the mirror doesn’t match the image of myself in my head.",
        "author": "sgtlizzie",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n6o3q/what_i_see_in_the_mirror_doesnt_match_the_image/",
        "text": "So I just avoid mirrors LOL. Seriously though, I have a healthy self esteem, but when I see myself in the mirror I see the overweight middle aged Mom that I am. Its kind of a smack in the face. Then I walk away and say eff it. Nothing’s changing anytime soon. Except the weight. Just had a hysterectomy, so no more internal pain stopping me.",
        "created_utc": 1678402380,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much inequality do white women face in America compared to people of ethnic minority backgrounds?",
        "author": "Friendxx",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n69qt/how_much_inequality_do_white_women_face_in/",
        "text": "I often hear white women say they face inequalities in America, but how much inequalities do they face compared to say African Americans and Asian Americans?\n\nEspecially a lot of the most vocal and public white women about this issue tend to be well-educated, in good careers, and fairly attractive, I wonder if they face much discrimination at all.",
        "created_utc": 1678401486,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Phone is the Modern Day Cigarette",
        "author": "WyattFromDennys",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n655u/the_phone_is_the_modern_day_cigarette/",
        "text": "Everybody is sucked into it, so many are addicted and don't even realize. Early on cigarettes were deemed healthy because nobody knew the consequences of them, only after years of research and seeing the effects of it play out in users, we now know how unhealthy they are.\n\nWe have no idea what social media, doom scrolling, and instant gratifications will do to our brains, our society. My parents are addicted, my friends, sisters, colleagues; I am addicted. I try to kick the habit of reaching for my phone. I delete the apps and remove notifications, but constantly find myself being sucked back in without it being a conscious action.\n\nIt is an parasite of the mind, an infection. Social media companies are tapping into the primitive parts of our brains and are using it for their own benefits and power; rotting our minds from the inside. To the people thousands of years in the future, wondering what it must have been like to be the first children of carbon and silicon, it's a sad world. A world of addiction, of exploitation, of desire, of vain.\n\nI hope the world will wake up and reject this path we are on and return to the likes of Epictetus or Aurelius. To use the technology not to selfishly exploit, but to bring us together and make this a better society.",
        "created_utc": 1678401206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just waiting for those NeuroLink chips to fail, why? Just because, I mean it’s a chip in your freaking brain, order 66 anyone?, No just kidding with you but really.",
        "author": "Reaper_Rapi",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n5ydk/just_waiting_for_those_neurolink_chips_to_fail/",
        "text": "Imagine in a funeral, you’re just sitting there mourning a loss in person, and all you hear from the other guy, or from the dead guy is the Burger King commercial just playing on a dead guy‘s brain, how creepy or funny would that be",
        "created_utc": 1678400795,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m just waiting for those NeuroLink chips to fail",
        "author": "Reaper_Rapi",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n5ssj/im_just_waiting_for_those_neurolink_chips_to_fail/",
        "text": "[removed]",
        "created_utc": 1678400447,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guys! You have 2 brains! Here me out.",
        "author": "Old-Wrangler9830",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n5qmh/guys_you_have_2_brains_here_me_out/",
        "text": "Imagine you're in a foreign country. You've traveling with someone you've known your whole life. Walking through the streets, a market, stopping and seeing whatever your companion wants to do.\n\nProblem is, your companion only speaks gibberish. In fact, everyone does. No patterns in the sounds to objects picked up multiple times. Just noise.\n\nSo you sit there and watch these odd intentional interactions occur, maybe images of your times seeing those objects in the past flits by, or a similarly shaped but different colored version in that spot in that place. That's how your day goes. Serene, usually, but void of any communication.\n\nNow watch this:\nttps://youtu.be/wfYbgdo8e-8\n\nFUCKING THINK ABOUT IT\n\nWhen you pull into your drive way, suddenly realising you've been autopiloting for God knows how long.\n\nTHAT'S YOUR MUTE BRAIN DRIVING\n\nWhen you did your first class presentation, and were so anxious you shut down and couldn't figure out how to speak.\n\nTHAT'S YOUR MUTE BRAIN BEING FORCED TO TAKE OVER. No Brocha's area, no speech.\n\nADHD and you just keep having these feelings and images pop though your head?\n\nTHAT'S YOUR MUTE BRAIN NOT KNOWING WHAT THE THREAT IS, CAUSE YOU'RE AND ANXIOUS AND IT IS JUST POPPING OFF WHATEVER IT CAN ACTUALLY COMMUNICATE. OR IT'S BORED WITH WHAT YOU'RE LOOKING AT.\n\nTake stimulants to treat ADHD?\n\nUpping your analytical side's ability to wrangle in the right brain.\n\nIt's evolutionarily sound. You're cutting meat with a stone knife, a complex task for an animal, focusing with your analytical left brain. Right brain is just chilling, listening to sounds and processing all this visual field stuff.\n\n*twig snap*\n\nThought field blows up. Sound was from that direction, kind of behind me. Same sound as thicker stick, thing breaking must be heavy. Heavy things are usually predators. What cover did I see over there a bit ago - head turns to sound as you move to cover you instinctually remember.\n\nHUGE FUCKING ADVANTAGE DEFENSIVELY. THAT'S YOUR MUTE BRAIN WATCHING YOUR BACK.\n\nCarry that idea forward. Apologies in advance if any\n\nSchizophrenia - Mute brain developing crude language abilities?\n\nAutism - Hyper sensitivity to stimuli and your mute brain can't handle it?\n\nPTSD - Mute brain being shoved through a traumatic experience, and it can't understand the words people are saying. It doesn't know what the fuck to do with these horrendous visual and emotional memories, and nothing it's been shown had reassured it it can't happen again.\n\nDreams and day dreams - it's active and your analytical side is interfacing with these images, unaware there's another, semi-independent brain generating them. You know you heard the person next to you talking, but when they say \"hello?\" - startling you to attention - you just can't process the words. Left brain suppressed by right brain.\n\nHere's more...\n\nYou know that time you knew exactly where in a book a piece of information was, but you just can't remember the word?\n\nMute brain is remembering.\n\nYou know how you have those flow states - physically or mentally?\n\nBoth hemispheres in sync.\n\nCan't focus on work because your daily stresses? Mute brain not wanting to work on the task in front of you.\n\nThat first time you \"realized you were an individual?\"\n\nLeft brain diverging from right brain for the first time.\n\nSuck at talking to attractive people? Blurt out things unintentionally?\n\nMute brain being completely surprised at what's going on and overriding your you brain in the excitement.\n\nWork better with an organized workspace?\n\nLess distracting for visual sensitive mute brain.\n\nDo better at a task after visualizing it?\n\nPrepping left body controlling right brain with what to expect to do as you do it.\n\n\nThis all makes so much fucking sense I just can't even.",
        "created_utc": 1678400318,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why am I crazy and why can’t I meet anyone else as crazy?",
        "author": "I-want-to-unalive",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n5dy5/why_am_i_crazy_and_why_cant_i_meet_anyone_else_as/",
        "text": "There’s so so much I want to do and no one I know (I’m 15) wants to do anything they just want to stay inside all day. I want to do so many things I’m crazy I love the pain I feel when I do endurance sports and I live for the adrenaline rush. I want to try travel the world and there’s so many sports I want to achieve just I’m to scared to do it alone.",
        "created_utc": 1678399558,
        "upvote_ratio": 1.0
    },
    {
        "title": "After years of post college burn out, I'm finally getting back into reading. My modest book haul for this month!",
        "author": "claimingthemoorland",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n54pi/after_years_of_post_college_burn_out_im_finally/",
        "text": "[Books! ](https://i.imgur.com/XZdQtPK.jpg)\n\nThe Gunslinger- Stephen King. \nOur Man In Havana- Graham Greene. \nMigrations- Charlotte McConaghy. \nWelcome to Night Vale- Joseph Fink &amp; Jeffrey Cranor.",
        "created_utc": 1678398990,
        "upvote_ratio": 1.0
    },
    {
        "title": "THE GOAT",
        "author": "hiihaveissues911",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n4eot/the_goat/",
        "text": "[removed]",
        "created_utc": 1678397361,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else get depressed if they spend any real amount of time at home?",
        "author": "annethepirate",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n46d8/anyone_else_get_depressed_if_they_spend_any_real/",
        "text": "I love staying home and hate going out. I'm a homebody. \n\nBeing home also makes me depressed though... I feel like I need to spend most of the day out. That, or maybe \"the grass is always greener...\"\n\nDoes anyone else have this? (If so, they're probably not on reddit, lol)",
        "created_utc": 1678396821,
        "upvote_ratio": 1.0
    },
    {
        "title": "This country, I know Crufts is on, no need for Dad's to go to the dogs!",
        "author": "hafgrimmar",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n3eze/this_country_i_know_crufts_is_on_no_need_for_dads/",
        "text": "The country's dad's are broken, not all, but most.. new TV \"reality\" show, tool box, bus travels about with tradesfolk (or celebs?) to teach young adults(?) how to use tools..!!\n\nI'm assuming some sort of research has been carried out that suggests this is needed and naturally will be watched, but honestly?\n\nIs this the standard of dad's?\nI remember spending time in my dad's shed, smell of wood shavings and lubricating oil.\n\nI built a bicycle from pieces scavenged at the top, think I was 6, just got supervision and a \"tightness\" check when I was done. But, that was a proper nuts, bolts, loose ball bearings (grease packed into race to hold them).\n\nAny number of small things to build, cold frames for the garden, 30' radio mast that needed a bottle waterproof cap, I had no issue with 30' up on 2\" aluminium tubing.. why would I?\n\nAnd yes,bit was a while back, late 60's, early 70's. But I'm struggling to blame Maggie for this. Someone please make sense of this madness.",
        "created_utc": 1678395117,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just turned 26. I have no friends or a partner but want to do something for my birthday.",
        "author": "burnout4672",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n36fq/just_turned_26_i_have_no_friends_or_a_partner_but/",
        "text": "Looking for ideas I guess? Like the title states I have no in person friends. I’m single as well. So basically no one to make plans with. Also I have an incredible number of food allergies so going out to eat is also 100% impossible.\n\nI kind of just want this day to be over but figure I should do…something?",
        "created_utc": 1678394553,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm a travelling musician- Two divorces down! - Ask me anything",
        "author": "Tough-Try-2681",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n2wpc/im_a_travelling_musician_two_divorces_down_ask_me/",
        "text": "[removed]",
        "created_utc": 1678393936,
        "upvote_ratio": 1.0
    },
    {
        "title": "Never room with your besties.",
        "author": "nyutacom",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n28fm/never_room_with_your_besties/",
        "text": "Moved into a home with 2 close people in my life and I couldn't regret it more. I woke up to the trash completely ripped open by one of their dogs, they left for work after seeing it. Saw ants all over the shower due to a roommate spilling something sticky and not cleaning it. Ants are over the trash. Mind you, I clean everything and only ask them to take the trash out on their way to work due to me being home most of the days. All this mess happened in one day, I am frustrated and unmotivated but I know they won't clean it and the trash won't clean itself. \n\nanyone care for a motivating and uplifting chat? haha",
        "created_utc": 1678392395,
        "upvote_ratio": 1.0
    },
    {
        "title": "One of my favorite things to do in the morning is to grab a quick cup of coffee from Starbucks or Peets and have a small chat with the baristas.",
        "author": "Thegrandcultivator",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n25da/one_of_my_favorite_things_to_do_in_the_morning_is/",
        "text": "It really does make their and my day when you treat them with respect and kindness.\n\nI don't like how people dehumanize service workers, so I always make sure that I acknowledge them as human beings. This means not being on my phone when ordering drinks up front, unless it is an emergency.\n\nI find that treating service workers with respect usually entail better service too!",
        "created_utc": 1678392201,
        "upvote_ratio": 1.0
    },
    {
        "title": "How To Earn Bitcoin on Cointiply (Earn Bitcoin Reward)",
        "author": "Silver-Performance35",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n1z52/how_to_earn_bitcoin_on_cointiply_earn_bitcoin/",
        "text": "[removed]",
        "created_utc": 1678391803,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you could turn into an animal, what would you wanna be?",
        "author": "Coineanach99",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n1xy5/if_you_could_turn_into_an_animal_what_would_you/",
        "text": "[removed]",
        "created_utc": 1678391724,
        "upvote_ratio": 1.0
    },
    {
        "title": "How To Delete MetaMask Account (Remove MetaMask Wallet)",
        "author": "Silver-Performance35",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n1s1g/how_to_delete_metamask_account_remove_metamask/",
        "text": "[removed]",
        "created_utc": 1678391324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Found out I should be left handed",
        "author": "girtonpalace",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n1iau/found_out_i_should_be_left_handed/",
        "text": "As long as I can remember I use my right hand for writing, drawing, picking stuff up etc. Always had terrible handwriting and can’t even draw a circle without it being oddly shaped or jagged. \n\nBut I’ve always eaten (if it’s like chips or a bar), drunk, and smoked (yes I know it’s bad) with my left hand. When I play football (soccer) I can’t pass with my right foot I always have to use my left. I asked my friends, all of whom are right handed, if they do this and they all said no they use their right hand. I always thought it was weird that I do this. I’m also left eye dominant which I red is mostly if you’re left handed.\n\n\nToday I found out that up to the age of 6 I used my left hand for everything including drawing and scribbling, and when I went to school the teachers forced me to use my right hand. Basically I’m not really right handed hence why I can’t write legibly, but am too old to really train my left hand. Ffs",
        "created_utc": 1678390690,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it really true that if you want something really really bad, the universe makes it come true?",
        "author": "Revolutionarypanda13",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n0z2q/is_it_really_true_that_if_you_want_something/",
        "text": "There's something that I really want and have been wishing for, praying for it day and night for almost a year now. I keep seeing this kind of quote everywhere and it really got me thinking if it's true. Or even worth believing in.",
        "created_utc": 1678389485,
        "upvote_ratio": 1.0
    },
    {
        "title": "do you think we'll see 4-day work weeks within the next decade or two?",
        "author": "sakiliya",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n0ukk/do_you_think_well_see_4day_work_weeks_within_the/",
        "text": "Millennial here, born in '94. I freelanced for a couple of years when I finished my Master's and always took the Friday off to pursue a hobby or new skill, relax, or catch up on chores. \n\nBut then I moved out to a bit of a nicer place, and there was a full-blown economic crisis in my country. I got a full-time job that paid in USD (foreign currency for me) and they don't let me take Friday's off. I still have 2 other part-time jobs apart from this to sustain even a basic lifestyle, hence the full work week (I even work weekends but those are personal freelance projects). \n\nAnyhoo, I'm seeing a lot of debate online about how 4-day work weeks are better (and I've done 5 days &amp; 4 days, and can honestly say yes, absolutely). I know Sweden and (some?) Scandinavian countries do them but where is the rest of the world on this? Do you think we'll see this becoming more of a norm in the next decade or two? I mean I don't think I'd have seen working from home be a thing either, but here we are, eh.",
        "created_utc": 1678389198,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if the afterlife is what we believe and wish it to be?",
        "author": "TTLYShittyThrowAway",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11n075t/what_if_the_afterlife_is_what_we_believe_and_wish/",
        "text": "Want to go to heaven? Granted. Want to fly and travel around the earth as a ghost? Granted. Want to haunt people who hurt you? Granted. There is none and you just retire to a void forever? Granted. I really really wish this with all of my being.",
        "created_utc": 1678387724,
        "upvote_ratio": 1.0
    },
    {
        "title": "I finally broke it off with a toxic friend",
        "author": "aaaahhatelife",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mzt2o/i_finally_broke_it_off_with_a_toxic_friend/",
        "text": "Feeling proud of myself that I stood up for myself and didn’t listen to her, it’s like a huge breakthrough for me bc I’ve always been the type to try and keep the peace no matter what and no show my anger. But I did it, I told her off right to her face and I took the train home so I didn’t have to see her or her scam artist friends 😁",
        "created_utc": 1678386795,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do women love cologne so much?",
        "author": "imareallifehobbit",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mzoj1/why_do_women_love_cologne_so_much/",
        "text": "I've always found cologne and perfume to be extremely intrusive and annoying. It's like forcing someone to smell you whether they want to or not. I understand that it does invoke emotions and sometimes even attraction but it just seems very intrusive to me.",
        "created_utc": 1678386509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Update: \"'prof: highest score is 100%.' it was me I got the 100%\"",
        "author": "Ox-Moi",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mzmjh/update_prof_highest_score_is_100_it_was_me_i_got/",
        "text": "[Original Post ](https://www.reddit.com/r/CasualConversation/comments/11egsmx/prof_highest_exam_score_is_100_it_was_me_i_got/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button)\n\n\nI mentioned in the original post that there was a second section of the chem exam. We just got it back and I wanted to post an update. I had a lot of kind comments, love, and support so I thought some may like to know. :)\n\nI did it again, I mentioned that I knew for a fact one question was wrong but that was the only one wrong!! He called out the highest score as 96% on that section and I screamed a little inside like omg please let it be me. He announced it at the beginning of class so I had to wait till the end to find out. And it was me and AGHHH\n\nSo my overall score for the exam is a 98% and I'm beyond happy :')\n\n\n\nI also spoke with him Tuesday as I finally got my testing accomadations approved(mostly needed for my math courses) , and he said he was surprised to see my email because of how I did on the exam. So 1) he knows who I am 2) he knows who I am enough to remember my work and 3) surprised that I need accommodations/I'm at a disadvantage because of how well I did.\n\nI come from a smaller school so there isn't many profs in my field and being a Chem major it's super important for me to build good relationships and I think I'm making an awesome first impression already.\n\n\nI have my math midterm in 30mins and I'm not as confident with the algebra but I'm feeling great and hopefully that'll help me out :)",
        "created_utc": 1678386378,
        "upvote_ratio": 1.0
    },
    {
        "title": "After 15 years in the same profession and tripling my pay I've realized I haven't advanced at all thanks to the economy.",
        "author": "1898smo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mzdna/after_15_years_in_the_same_profession_and/",
        "text": "[removed]",
        "created_utc": 1678385816,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did you manifest into happening in your life?",
        "author": "Overall_Age7627",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mzcb3/what_did_you_manifest_into_happening_in_your_life/",
        "text": "[removed]",
        "created_utc": 1678385733,
        "upvote_ratio": 1.0
    },
    {
        "title": "Language is weird",
        "author": "deviantmoth",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mz3g8/language_is_weird/",
        "text": "4 is just a triangle with two lines overlapping. Yet it means something. We have assigned meaning to it. But what's wierd about language is when we see 4, we don't even think about the shape of it. We don't see the shape, we simply just see the number 4. It exists as its own thing.",
        "created_utc": 1678385170,
        "upvote_ratio": 1.0
    },
    {
        "title": "Historical moments.",
        "author": "TriniDream",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mypwi/historical_moments/",
        "text": "In the past 10 years what world wide events do you think will be highlighted in history books in the future? I’m sure the obvious Covid will have its own chapter lol",
        "created_utc": 1678384320,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally moving out at 31",
        "author": "mrackham205",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11myozl/finally_moving_out_at_31/",
        "text": "I’ll be moving out in a few weeks. I’ll admit to being a little ashamed that it’ll be the first time I’ve *really* lived out on my own. I’m a bit of a late bloomer and I made a lot of mistakes in the past, but my parents have been unbelievably supportive towards the mass of broken flesh that is me.\n\nI’m excited, but also incredibly anxious about it. There are still many things I don’t know about the world, things I know I can only learn from experience. And yet I’m still afraid of failure, of falling back into bad habits and addictions, of being unable to balance my mental health and taking the fastest way down a parking garage, of losing the few precious friends I’ve made along the way.\n\nThey say courage isn’t about “not being afraid” but about moving forward despite that fear. I know that I’m probably not ready to live out on my own, but it seems that people are never truly ready for the trials that beset them. \n\nBut more secretly, I’m just glad that I won’t have to relate to [Welcome to My Parents’ House](https://youtu.be/3YXUWWZJXpE) anymore.",
        "created_utc": 1678384264,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting Up Early",
        "author": "-_Abyssal_-",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mye7s/getting_up_early/",
        "text": "How do people do it?!\n\nFor the last few months, I tend to just stay in bed when I don't have to go anywhere, so my day doesn't start until noon or so. I've tried things like not having my phone around, but it didn't work.\n\nAny people that have or had the same problem? If not anymore, what did you do?",
        "created_utc": 1678383557,
        "upvote_ratio": 1.0
    },
    {
        "title": "Capybara super hero",
        "author": "leonaidon",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11my7am/capybara_super_hero/",
        "text": " \\#capybara #superhero\n\nOnce upon a time, in the depths of the Amazon rainforest, there lived a capybara named Carl. Carl was no ordinary capybara. He possessed superhuman strength and the ability to fly. He had always known that he was different from the other capybaras in his community, but he never quite understood why.\n\nOne day, while Carl was out exploring the rainforest, he stumbled upon a group of animals who were being attacked by a band of ruthless poachers. Without hesitation, Carl swooped down from the trees, his cape fluttering behind him, and used his super strength to subdue the poachers.\n\nThe animals were grateful to Carl for saving their lives, and they began to see him as a hero. From that day on, Carl made it his mission to protect all the animals of the Amazon rainforest.\n\nCarl spent his days flying through the canopy, keeping a watchful eye on the creatures below. Whenever he spotted any danger, he would swoop down and use his incredible strength to protect them. His cape billowed behind him as he flew, a symbol of hope and protection to all the animals of the rainforest.\n\nAs news of Carl's heroic deeds spread, he became known as the Capybara Superhero. His legend grew, and animals from all over the world began to seek him out for help. Whether it was rescuing endangered species from the clutches of poachers or helping to rebuild habitats destroyed by human activity, Carl was always there to lend a hand.\n\nOver time, Carl realized that he wasn't alone in his mission to protect the animals of the Amazon rainforest. He formed a team of like-minded animals, and together they worked to ensure that the rainforest remained a safe and thriving home for all creatures great and small.\n\nYears passed, and Carl grew older, but his commitment to protecting the animals never waned. Even when he could no longer fly as high or move as fast, his spirit remained strong, and his cape still fluttered behind him as a symbol of hope to all who knew him.\n\nAnd so, the Capybara Superhero became a legend in the animal kingdom, a symbol of strength, courage, and compassion. His story was told and retold for generations, inspiring countless animals to stand up for what they believed in and to fight for a better world for all.\n\nimage by AI DALLE",
        "created_utc": 1678383104,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am 30 years old and would like to meet some interesting friends, but at my age, if I don't work hard, I will soon be out of business, so I rarely make friends in my age group, and I myself am a person who doesn't like to be alone, so I hope to make some local American friends",
        "author": "Better_Tip2637",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mxgsy/i_am_30_years_old_and_would_like_to_meet_some/",
        "text": " Looking to make some local American friends, but I hope you're not under 30. I'm not discriminating against age, it's just that all these people who add me are too far apart in age and always send me messages saying those hard things.",
        "created_utc": 1678381393,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m trying to get back into a game I really enjoy but I haven’t played in ages and I wouldn’t be able to play at the skill level of my account. Any advice?",
        "author": "Moondust221",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mxbkw/im_trying_to_get_back_into_a_game_i_really_enjoy/",
        "text": "I’ve been trying to go back to playing league of legends lately because they reworked my main character after nerfing her into the ground. Only issue is I’m not good enough to play at my current rank even if my character hadn’t been changed. Any advice on how to overcome the toxicity? It stopped me playing a while back because I’m literally a one trick pony and people hated her so my own teammates started banning her because of her pretty poor rapport. I’m a level 7 mastery 300,000 mastery points on her. Is there any way to like scale back account level without infuriating people because I haven’t played in like a year? I don’t want to get a new account because of all the skins/scores I’ve accumulated. Anyone else struggling with something like this?",
        "created_utc": 1678381071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got a life changing job offer",
        "author": "IUseThisAtWork",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mx012/got_a_life_changing_job_offer/",
        "text": "After months of search, I got a job that pays okay, but it's not enough for me to move out on my own. However, just couple of days ago, a huge conglomerate offered me a position and salary that'll give me the financial freedom I need, especially since I'm getting a divorce. Things were looking pretty bleak before, but I got rid of the negative stuff, and now things have started to look up for me.\n\nIf you are currently facing challenges, please know that your time to shine will come. Believe in your own capabilities and do not let anyone discourage you &lt;3\n\nKeep on swimming!",
        "created_utc": 1678380311,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't tell if my classmate is just awkward around women or if he doesn't like me",
        "author": "adios-bitchachos",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mwsv3/i_cant_tell_if_my_classmate_is_just_awkward/",
        "text": "Doesn't matter either way, I just feel like speculating lol.\n\nWe're in med school. The two of us plus my friend went to the same undergrad university so we have history together.\n\nHe always actively avoids eye contact with me and never reciprocates when I speak casually to him. Today he walked over to hand me a sign-in sheet and I said \"Thank you! ☺\" His response was \"Mhm 😑\" kept his eyes down, and as I signed it, his head was practically turned all the way around to avoid looking at me til I handed it back.\n\nI dont think it's a crush because I think he has a crush on my friend (who is married). He's the opposite with her - mostly ignores her too but will occasionally go out of his way to talk to her and boast how they go \"way back\" from undergrad - and mind you I will also be standing right there and he completely ignores me lmao. \n\nI dont see him interacting much with other women so I think he's just weird around women in general but his frosty behavior towards me and markedly friendlier behavior towards my friend sometimes makes me question if he finds me annoying or something. \n\nI find it pretty amusing and sometimes lightly tease my friend once it's just the 2 of us hanging out - cause I dont wanna embarrass him. Her husband also finds it kind of amusing because he's caught this guy kind of staring in our direction one time when we went to the same party 😂.",
        "created_utc": 1678379843,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was talking to a girl on ig",
        "author": "44tech1n",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mwn8p/i_was_talking_to_a_girl_on_ig/",
        "text": "She sent me the first message, after then we talked every day for like 2 weeks. During those 2 weeks she invited me to her city, made plans to go for a trip to hang out and wanted to meet me in my city as well. She was also sending pictures of her during these two weeks of time we casually showed outfits to each other etc. \n\nToday while we were talking about the trip we’ve planned she told me the hotel prices were expensive and I casually told her that we can stay in tents and do a little camping trip. Out of nowhere she started to act like bro what do you mean I should say I have relationship and so on. During our conversations I didn’t even hit on her maybe one or two compliments during the past days. \n\nThis world never seize to amaze me…",
        "created_utc": 1678379459,
        "upvote_ratio": 1.0
    },
    {
        "title": "Now my cats are cats those walked by themselves",
        "author": "CalypsoNP",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mwlbb/now_my_cats_are_cats_those_walked_by_themselves/",
        "text": "[removed]",
        "created_utc": 1678379334,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to make a house without TV not boring.",
        "author": "AnthraciteKid",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mwkj1/how_to_make_a_house_without_tv_not_boring/",
        "text": "[removed]",
        "created_utc": 1678379280,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do video games lead to obesity",
        "author": "nicki2055",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mwhyi/do_video_games_lead_to_obesity/",
        "text": "I wonder if I’m gaining weight because I’ve been playing video games all day. Look at boogie2988 the guy is probably fat because when not doing videos he’s in his room playing video games all day.",
        "created_utc": 1678379104,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate looking for a job.",
        "author": "pactbopntb",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mwfik/i_hate_looking_for_a_job/",
        "text": "The places I like don’t call me back, it seems like no one’s hiring, and my references choose now not to answer their phone. \n\nJob hunting stinks.",
        "created_utc": 1678378936,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to do when the people you know for years don't want to stay in touch or stop showing interest?",
        "author": "Responsible-Rub5582",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mwf3m/what_to_do_when_the_people_you_know_for_years/",
        "text": "I'm the kind of person who likes to stay in touch with everyone, but most of the time people just left, my all school friends left me, I know they are busy but It makes me upset that probably I'm never going to meet them again in my life :(",
        "created_utc": 1678378909,
        "upvote_ratio": 1.0
    },
    {
        "title": "“In real life there's no algebra”",
        "author": "Many-Substance628",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mw7s2/in_real_life_theres_no_algebra/",
        "text": "[removed]",
        "created_utc": 1678378423,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm sick",
        "author": "CalypsoNP",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mw5gq/im_sick/",
        "text": "[removed]",
        "created_utc": 1678378267,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just learnt that some ppl are more stupid than us but they're very successful because they work hard.",
        "author": "Infinite-Passenger13",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mw37y/i_just_learnt_that_some_ppl_are_more_stupid_than/",
        "text": "Lol I don't mean to offend anyone, I'm in the lazy gang as well haha. Today I just sit near a guy who's a genius. But when I started to talk to him, he seemed pretty stupid. He was, though, very simple minded. He couldn't remember small stuff and probably had bad problem solving skills... but he is good at what he does. I think that's kinda cool haha.\n\nAnyways, Work hard &amp; work smart. Have a nice day yall.",
        "created_utc": 1678378125,
        "upvote_ratio": 1.0
    },
    {
        "title": "Give Your Spirit a Boost and Visit Some Old Friends",
        "author": "mysoncallsmeold",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mvs1f/give_your_spirit_a_boost_and_visit_some_old/",
        "text": "Last night I met up with 8 old friends of mine I had made 20 years ago in an old neighborhood we'd lived in.  It was a group of 8 women and we all met because our kids went to school together and we all volunteered at the school etc., we even played Bunco together until suddenly it all exploded, many of us got divorced and moved away.  \n\nOne of the ladies that still lived there threw out a casual get together a \"girls night\".  I can't tell you how fun it was to connect with old friends.  It was like we'd never been apart even though for some of us, we haven't seen each other in 18 to 20 years.  \n\nThink of an old friend or even a family member that's in your proximity, get together!  The meeting has inspired me to look for other friends and reach out to them.",
        "created_utc": 1678377431,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm finally moving on from my last relationship and it feels great.",
        "author": "CelticChief",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mvjk9/im_finally_moving_on_from_my_last_relationship/",
        "text": "Tl;dr: I just moved on from the woman I thought I would marry after 9 months and life feels great right now.\n\nHey everyone! I want to preface this by saying I don't think either of us were bad people who wanted to hurt each other. I think we genuinely loved each other but we both had our issues and it eventually led to us hurting each other in a massive way. \n\nI was definitely emotionally unavailable at times, I had issues with stress and anxiety that she pushed me to get therapy for (which I'm eternally thankful for, I've grown a massive amount from therapy with my amazing therapist!). She could be emotionally manipulative tbh. Any comment or action I did that she disagreed with could be met with a comment of how I'm just like my father (something she knew hurt me deeply) or accusations of being a bad person or toxic (sometimes true, like I said I was far from perfect) but often times looking back I was often just asserting a bit of independence or wanting to do something for myself, which again looking back seemed to terrify her. Eventually this all came to a head as I made a life-altering decision, which she believed I did by myself but I always quietly believed I included her in, she absolutely could have said no but didn't, only for her to change her mind and accuse me of never giving her a voice in it which I absolutely feel like I did. \n\nThis led to distrust, animosity and hurt on both sides, a cycle of break ups and make ups, her ghosting me when I was a low point, us getting back together when she was in a tough place and then culminating in a terrible break up where we both said horrible things to each other.\n\nThis was all a while ago and since then I've went through cycles of loathing myself, hating her, wanting her back, being suicidal and being at peace in random cycles (it was a real time let me tell you lol). Anyway a few days ago I survived a horrible, life threatening situation and reacting by reaching out to her in a very pathetic way that makes me cringe to think about. She quite rightfully blocked me on the app without replying. After that I spent the last few days doing some heavy introspection and soul searching and finally feel like I've made peace with everything that happened.\n\nWe loved each other greatly, fought for each other as hard as we could, but the hurt we caused each other and the aforementioned massive decision I made eventually sunk us. I hope she's doing great honestly, I can now look back at the good parts of the relationship (like 95% honestly) with fondness, learn the lessons I need to learn about myself and continue to grow into the best version of myself and understand and forgive her actions. I am now surrounded by amazing friends and doing what i believe to be my purpose in life. Life feels really good right now and I feel really hopeful for the future!",
        "created_utc": 1678376856,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I tell my mom she's pretty without sounding weird about it?",
        "author": "Puzzleheaded_Tree290",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mv5rt/how_do_i_tell_my_mom_shes_pretty_without_sounding/",
        "text": "I don't know if the fact that we're not blood related makes it more or less weird. My mom is gorgeous, I mean she's stunning, to be honest, I'd be lying if I said I've never felt jealous of her. She's six feet tall and has perfect skin, really long and healthy brown hair, these big anime looking eyes. Even her voice is pretty, she's french, she has such a soft accent.\n\nI don't want to sound weird about this, like I'm attracted to my mom or something, she's just really, really pretty. A lot of my friends have mentioned it before as well, when I was in high school one guy straight up told me he had a crush on her. I mean, I don't want her thinking it's something weird either, I just want her to know she's beautiful.",
        "created_utc": 1678375919,
        "upvote_ratio": 1.0
    },
    {
        "title": "For my manga readers.",
        "author": "abluebirdswings",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mv3aj/for_my_manga_readers/",
        "text": "I am reading Venus In The Blind Spot by Junji Ito and though all of it is excellent Amigara Fault left me very shaken up. I read it last night in my room with only my lamp on, and some ambient music. Needless to say it was really good. This is my first exposure to Ito outside of the awful anime, so i was just wanting to hear opinions on his work and maybe get some other recommendations.\n\nSide note: I also picked up Tomie and Go Go Laser Ranger which i'll start today.",
        "created_utc": 1678375757,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am very happy and very sad at the same time when it's my mum and dad's birthday",
        "author": "friendzonefluffy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mv2o9/i_am_very_happy_and_very_sad_at_the_same_time/",
        "text": "So before I start, my mum and dad are my heartbeats. I hate that I am working so far away and can't see them everyday. \nToday's my mum and dad's birthday. Yes, both of them, together. I love it because of obvious reasons and hate it because it's one less party in a calender year.\n\nAnyways, I'm always really happy and really sad at the same time today. This happens every year, same date. I rejoice that it's a day of enjoyment and good memories. On the same hand, I am pretty sad that time is flying. Just yesterday I was playing with my mum's hair and sitting on my dad's shoulders. Today, I'm almost 30, working away from home. I miss my parents the most today. Their birthday means 1 less year with them. I have bad dreams of their inevitable demise one day and the thought of their absence from my life is terrifying. Is it normal or I just think too much?\n\nI try to take as much motivation from this day to make myself more available to my parents and brother. Our days are limited. Let's make the most of today with our friends and loved ones.",
        "created_utc": 1678375713,
        "upvote_ratio": 1.0
    },
    {
        "title": "why words matter.",
        "author": "LetterGrouchy6053",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mudu6/why_words_matter/",
        "text": "[removed]",
        "created_utc": 1678374054,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do people decide where to live before getting a job there?",
        "author": "GroundbreakingWill48",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mudjg/how_do_people_decide_where_to_live_before_getting/",
        "text": "I obviously want to make sure homes and jobs are both open but idk my brain goes stress mode and I all of a sudden feel like I have no clue how to find both those things, also without living in a big city..",
        "created_utc": 1678374037,
        "upvote_ratio": 1.0
    },
    {
        "title": "Prize Picks",
        "author": "Neither-Barracuda656",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11muc7a/prize_picks/",
        "text": "[removed]",
        "created_utc": 1678373952,
        "upvote_ratio": 1.0
    },
    {
        "title": "One of my sisters just called and asked to send her daughter's Flat Stanley to me and I can't be more happy.",
        "author": "Synchro_Shoukan",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mubyh/one_of_my_sisters_just_called_and_asked_to_send/",
        "text": "I moved out of state in 2009, leaving everyone behind. Family was dysfunctional and my sisters were too young to legally come with me so I left them with an abusive mother.\n\nAnyways, sister hits me up and tells me about Flat Stanley, says she has nobody out of state to send it to and I'm the only one that can help. It feels amazing to have her come to me with something so banal, yet so meaningful, so now I'm waiting for my Flat-niece to arrive and I can go take some pics of our adventures together. It's kinda weird because I haven't met my niece and nephew in person yet, so this will be a good chance for me to show my love, lol.\n\nBut yeah, wanted to share with people, life is pretty great after some really lonely times.",
        "created_utc": 1678373936,
        "upvote_ratio": 1.0
    },
    {
        "title": "The storms make me feel like I’m dying",
        "author": "Macey-5432",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mtutk/the_storms_make_me_feel_like_im_dying/",
        "text": "So we’re supposed to get a really bad storm today and I barely slept last night because I know there will probably be thunderstorms. They scare me to the point were I will be crying and plugging my ears. I can’t stand the sound of them. I live in a city so I know the change of our house getting struck is very low. I’m not really afraid of the lightning itself but the sound of it is terrible. I get panic attacks during these storms because the rain is too loud as well. And I’m terrified right now because I heard we are going to have a terrible storm today and I’m feeling awful about it.",
        "created_utc": 1678372741,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need suggestion",
        "author": "Ok-Possibility449",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mtt0y/need_suggestion/",
        "text": "I am spending time in Naples, Florida and I nned to get more contact lenses.  My prescription expired a few months ago.  I nned to get a new prescription in order to purchase lenses but everywhere i ask, they want to do a complete eye exam and to charge for that.  My home optometrist says there is no need as he looks after that regularly.  Any suggestion of where I can get an eye exam that deals only with the prescription for contacts and does not involve a complete exam?",
        "created_utc": 1678372608,
        "upvote_ratio": 1.0
    },
    {
        "title": "Immigrant Mother's Struggle",
        "author": "spi4ka_258",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mtpko/immigrant_mothers_struggle/",
        "text": "My mom had me when she was 21, with my father who was an absolute piece of work. Eventually, he tried to harm her when she wanted to divorce him. He was addicted to gambling and used to spend all his money on it. He even lost his business to it, but my mom stood up and helped him take his life back. Unfortunately, he did it again, and she had to leave him to protect me from that kind of life.\n\nMy grandma is disabled and a true narcissist. My mom has been working her ass off since she was 19, but my grandma doesn't even appreciate my mom's work to keep her alive with a roof over her head. On many occasions, she has talked to my mom awfully, been abusive, and tried to control her. My mom is putting her in her place, but unfortunately, it still affects her. My grandma is living with her.\n\nMom immigrated to the EU when I was a child and remarried here to another piece of work. She managed to bring me and my grandma here, a classic story for every immigrant, I think. My stepfather tried to groom me, was financially and verbally abusive to all of us until my mom left him. He tried to blame her for cheating, for using him to get an EU passport. Although she divorced him years after taking that passport, she stayed with him because she loved him and tried to help him.\n\nNow I'm married myself and starting my career path. My husband is earning more than enough to support both of us, and we're kinda well off, but we're still very young (early twenties). Today, I had a talk with my mom, which made me reconsider everything. She told me she had a cold a few days ago but couldn't afford to take a few days off work (she's a small business owner). She told me she knows that at some point, grandma will need professional care, and she can't afford it. Our country doesn't have any support in our case. She was crying and told me that she's so scared because she feels so alone. I was crying with her but trying to remain calm.\n\nI want to get her a house by taking out a loan. I can afford it in a few years. I told her about it, and she was shocked. She forgot that she can rely on somebody. She's so used to supporting her shitty husbands, me, or my grandma that she forgot that I want to help her.\n\nShe smokes and she's in her 40s. She eats fast food because she doesn't have time to prepare anything normal. She has problems with her sleep, and she's just tired. I'm thinking about helping her find a new career path, something that doesn't include working at night (she has a night club). I'm so sad knowing that my mom - the only family I have ever known, the mom who despite our fights gave me everything she had, the mom who never had a life to give me a life - is struggling, and now I can't help much.\n\nThe worst part is still hearing her crying voice whispering that she's so alone. I'll hear it in my nightmares.\n\nMaybe somebody has had a similar experience? I'm trying to find some working solutions for her, but I don't even know where to start. Maybe someone else is living through something similar. I feel so lonely in this immigrant experience nightmare.",
        "created_utc": 1678372366,
        "upvote_ratio": 1.0
    },
    {
        "title": "dark chocolate is so amazing oh my god",
        "author": "Naeco72",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mti1r/dark_chocolate_is_so_amazing_oh_my_god/",
        "text": "[removed]",
        "created_utc": 1678371847,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi! I'm new.",
        "author": "LisaCrooks",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mtea3/hi_im_new/",
        "text": "[removed]",
        "created_utc": 1678371579,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi there!",
        "author": "LisaCrooks",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mtcge/hi_there/",
        "text": "[removed]",
        "created_utc": 1678371453,
        "upvote_ratio": 1.0
    },
    {
        "title": "My marriage for no apparent reason has turned better than ever",
        "author": "ArnoldhBraunschweigr",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11msnaj/my_marriage_for_no_apparent_reason_has_turned/",
        "text": "I'd like to preface this with, my marriage has always been good and we love each other. But we'd talk to each other in raised voices once in a while, she'd be frustrated with me, vice versa.\n\nThe last month or two, though, she's always in a good mood, I'm always in a good mood, we joke, laugh, cuddle together, romance, etc. We're going on dates again, we're even going on a concert later this year.\n\nI have literally no idea what has changed, but I'm happy. Hopefully I'm doing something right! It also makes me want to work even harder on our relationship and also on stuff at home that needs doing.",
        "created_utc": 1678369706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello! I'm new.",
        "author": "LisaCrooks",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11msfq7/hello_im_new/",
        "text": "[removed]",
        "created_utc": 1678369168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just had my first decent cup of coffee",
        "author": "geT___RickEd",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ms0vd/just_had_my_first_decent_cup_of_coffee/",
        "text": "After finally moving together with my SO I didn't own anything to make coffee. And after falling down the coffee rabbit hole on youtube, I bought an Aeropress, a (hopefully decent) handgrinder, a set of scales and a few varieties of \"good\" coffeebeans.\n\nAnd compared to the stuff I used to drink (cheap filtercoffee maker with preground supermarket coffee), the difference is staggering. For the first time ever I don't feel the need to pour milk into my coffee and I can taste a sweet note I didn't know coffee can have.\n\nI'm really looking forward to trying out different roasts from different areas of the globe, not to mention getting my grind size and general recipe dialed in. \n\nMy SO doesn't drink coffee at all, my parents think the cheap way to bitter stuff is fine and her parents use a capsule machine (they even wanted to gift me a Nespresso one, I declined because Nestlé). All of them think I spent way to much money on it. So I'm stuck enjoying my decent coffee all alone. I can only recommend trying it out if one has the disposable income",
        "created_utc": 1678368047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nothing Special Happened on My Birthday and I Actually Liked It",
        "author": "Ok-Philosopher2499",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mrfav/nothing_special_happened_on_my_birthday_and_i/",
        "text": "Yesterday was my 24th birthday and while nothing extraordinary happened, I had a perfectly fine day at work. After that, I went back home, received my parcel and had a good night's sleep. Surprisingly, apart from my family and my two best buds, no one wished me happy birthday, but I didn't feel sad or down in any way. In fact, I quite liked it this way - no pressure, no fuss, just a chill and relaxed day. Gonna treat myself some good food on the weekend!",
        "created_utc": 1678366379,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why don't (most?)houses in America have window shutters or proper doors?",
        "author": "RandomGreekPerson",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mr0is/why_dont_mosthouses_in_america_have_window/",
        "text": "I have seen it in videos of break ins, attempted break ins ,even in movies.\n\nBad guy outside the house, people lock their flimsy doors and windows that can be taken down by a kick from an average person.\n\nWhy not a proper reinforced door and sturdy window shutters that would prevent someone from just throwing a stone at a window and just walking in?",
        "created_utc": 1678365142,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who do you think will get in the top 10 in Eurovision 2023?",
        "author": "diana_obm",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mqnu2/who_do_you_think_will_get_in_the_top_10_in/",
        "text": "[removed]",
        "created_utc": 1678364069,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hannibal vs True Detective",
        "author": "prosaver433",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mqkx0/hannibal_vs_true_detective/",
        "text": "[removed]",
        "created_utc": 1678363803,
        "upvote_ratio": 1.0
    },
    {
        "title": "any subreddits for ppl struggling with their faith?",
        "author": "justifixdangxr",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mqfzy/any_subreddits_for_ppl_struggling_with_their_faith/",
        "text": "[removed]",
        "created_utc": 1678363363,
        "upvote_ratio": 1.0
    },
    {
        "title": "y’all ever feel like you was out of your body for like a split second",
        "author": "paulcaya",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mqfhb/yall_ever_feel_like_you_was_out_of_your_body_for/",
        "text": "[removed]",
        "created_utc": 1678363319,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else watch Agretsuko?",
        "author": "Darth_Zounds",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mq5qf/does_anyone_else_watch_agretsuko/",
        "text": "Basically, my housemate and I watched season 5, and I just today saw season 1.\n\nPulling a George Lucas, I know.\n\nI just find it such a cute show that has a lot of interesting character interactions.\n\nWhat do you y'all think?",
        "created_utc": 1678362477,
        "upvote_ratio": 1.0
    },
    {
        "title": "hair growth",
        "author": "Life-Secretary1038",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mppad/hair_growth/",
        "text": "[removed]",
        "created_utc": 1678360901,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which era in this chart would you say was your childhood?",
        "author": "Overall-Estate1349",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mpndp/which_era_in_this_chart_would_you_say_was_your/",
        "text": "And which shows in particular would you say were your favorites here? The image focuses on the Boomer, Gen X, Millennial, Zoomer, and Gen Alpha eras.\n\nhttps://i.redd.it/xs8vysv2idla1.png",
        "created_utc": 1678360708,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which era in this chart was your childhood?",
        "author": "Overall-Estate1349",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mpmu5/which_era_in_this_chart_was_your_childhood/",
        "text": "[removed]",
        "created_utc": 1678360654,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which era in this chart was your childhood?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1678360614,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to make an alter ego",
        "author": "GlassPresentation280",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mpdpa/how_to_make_an_alter_ego/",
        "text": "[removed]",
        "created_utc": 1678359727,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stupid tickets IT people have to deal with",
        "author": "arker-tech-vids",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mox7u/stupid_tickets_it_people_have_to_deal_with/",
        "text": "[removed]",
        "created_utc": 1678358019,
        "upvote_ratio": 1.0
    },
    {
        "title": "24M from Finland looking for a chat",
        "author": "SamiLuke",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11moqsb/24m_from_finland_looking_for_a_chat/",
        "text": "Hi, i am Sami and like the title says, i'm from Finland. My english isn't the greatest, but i think you'll get what i mean. i enjoy reading books ( just finished Harry potter and order of the phoenix) and next i'm gonna pick up Illuminatus trilogy.\n\nright now i am on sick leave from work till next tuesday, due to back injury, so i have a lot time on my hand.\n\nlately been playing with my ps5 again, since i dont have better things to do, i mean you at some point you just can't watch movies and shows.\n\nwell, can't think more right now, but hit me up or smth.\n\ndont be creep.",
        "created_utc": 1678357373,
        "upvote_ratio": 1.0
    },
    {
        "title": "I finally have Covid",
        "author": "mayipleaseehavebread",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mop6m/i_finally_have_covid/",
        "text": "I’m just so mad, was meant to be seeing lamb of god tomorrow night after it being rescheduled countless times due to the pandemic, I work in education and have stayed masked up even with people acting like it isn’t around anymore. Got all my jabs so I’m very lucky in the sense that it’s just a little cold and my back aches, I always test when I get a sniffle and this one gave me the lightest positive\n\nI just really wanted to see lamb of god, one band I have never seen live and it looks like I never will \n\nIm just venting, I know it could be a hell of a lot worse, but for me this is super sucky. I was so proud to have not caught it, and here we are.",
        "created_utc": 1678357206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whelp, I'm 40.",
        "author": "zero_ph_uqs_given",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mnh0y/whelp_im_40/",
        "text": "That's right, today is my birthday. I really dunno what to do next. I know I'm no longer carded at the liquor store. 🤣 The lady said she may still card me as I don't look 40. I took that as a compliment. Honestly that's all I got. I'm shit at starting conversations but it's so early and I'm awake.\n\nAnywho, I hope anyone who stumbles across this has a great day. ✌️💜🌮",
        "created_utc": 1678352497,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Finally Did It. ✨✨💪",
        "author": "Imaporter",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mmu6l/i_finally_did_it/",
        "text": "I Finally Did It. *Sigh*\n\nIn my entire 22 years on this earth I finally went up to a woman I found attracted and tried to get her # here’s how it went...\n\nMe approaching the girl sitting down after contemplating for so long on a ferry. \n\nMe: “Excuse me, I wanted to tell you that I think that you’re beautiful and wanted to know if I can get to know you.” (I said this a little bit too fast because I was nervous\n\nHer: “....” (probably because she didn't understand what I said because I said it kinda fast lol)\n\nMe: Smiling awkwardly “What’s your name”\n\nHer: “it's Mya”\n\nMe: “Nice to meet you Mya”\n\nMe: “Are you from here?”\n\nHer: “Yes I am, hbu you”\n\nMe: “Yeah, im from (I said where im from)”\n\nHer: “Ok cool”\n\nMe: Smiling Awkwardly looking at the floor “...”\n\nHer: “...”\n\nMe: “Do you have have a Bf?”\n\nHer: “Yes I do”\n\nMe: “Ok later” walks off awkwardly \n\nLooking back at our conversation I didn't even tell her my name 🤦‍♂️. \n\nI'm 6’4, Skinny fit, a lot of people have told me im handsome but all this time I just never had the guts to go up to a girl and try to get her # but I finally did it. \n\nThis is a lost but now im sure I can do it again and next time pull out a W. 💪",
        "created_utc": 1678350030,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hug your dog(s) for me today",
        "author": "Mike-eh",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mmmg5/hug_your_dogs_for_me_today/",
        "text": "One month ago, I had my two happy and healthy dogs at my side.\n\nTwo weeks ago, we had to put our Max down due to old age (14.5 years), and yesterday we heard from the vet that the growth in our Bo's neck is a mast cell tumor. \n\nKeep your dogs near and dear, squeeze them a little tighter and appreciate the moments your have together, you never know which will be the last one",
        "created_utc": 1678349223,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dark capybara",
        "author": "leonaidon",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mmjub/dark_capybara/",
        "text": " In the dense forests of South America, there was a legend about a creature that haunted the locals. It was said to be a giant rodent, larger than any other species known to man, with razor-sharp teeth and a thirst for blood. This creature was known as the \"Capybara of the Night.\"  The legend of the Capybara of the Night was born from the experiences of the indigenous people who lived in the area. They claimed that, at night, they would hear strange noises coming from the forest, like the sound of heavy breathing and rustling of leaves. They also reported sightings of a large, dark shape moving through the trees.  Many villagers were afraid to venture into the forest at night, for fear of encountering the Capybara of the Night. But one brave hunter decided to face his fears and went into the forest in search of the creature.  As he walked deeper into the forest, he heard the same eerie sounds that the villagers had described. Suddenly, he saw movement in the bushes ahead of him. He raised his gun, but before he could fire, the Capybara of the Night leaped out of the bushes and attacked him.  The hunter fought for his life, but the Capybara of the Night was too strong. Its razor-sharp teeth tore through his flesh, and he fell to the ground, bleeding profusely. The creature then dragged his body deeper into the forest, never to be seen again.  After this incident, the legend of the Capybara of the Night only grew stronger. People became even more afraid of the forest, and many believed that the creature was a curse sent by the gods to punish them for their sins.  To this day, some locals still claim to hear the sounds of the Capybara of the Night in the forest at night. They warn visitors to stay away from the area, lest they meet the same fate as the hunter who dared to challenge the creature.",
        "created_utc": 1678348941,
        "upvote_ratio": 1.0
    },
    {
        "title": "What has been your best stage of life so far?",
        "author": "Bear_necessities96",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mmj9e/what_has_been_your_best_stage_of_life_so_far/",
        "text": "So far for me the best period has been that period between the late teens and the early 20s (17-25 years I would say) it was a period of growing a lot of new experiences and probably because it was the years pre- pandemic (2014-2019 mostly) I moved away, I started to live alone, I said goodbye to friends and loved ones (miss my cat), I dropped out college and had the worst hangovers of my life lol, also I fell in love for the first time and got heartbroken, I learned what was being depressed, homesick and anxious, I got lost (career talking) and of course found myself I learned what I like sexually and romantically and I just keep doing it.\n\nSo yeah early 20s probably the best period of my life so far. Wbu? \n\nAlso I need to talk about the music of those years (2014-2017 were silver if not golden years of music)",
        "created_utc": 1678348888,
        "upvote_ratio": 1.0
    },
    {
        "title": "What situation is too challenging for men to handle?",
        "author": "Asolution007",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mm61j/what_situation_is_too_challenging_for_men_to/",
        "text": " It is difficult to identify a specific situation that men can't handle as it varies from person to person. However, some challenging situations that may overwhelm men include extreme stress, emotional trauma, loss of loved ones, and mental health issues, among others.",
        "created_utc": 1678347587,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a situation that a man can't handle?",
        "author": "Asolution007",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mlzvc/what_is_a_situation_that_a_man_cant_handle/",
        "text": "[removed]",
        "created_utc": 1678346976,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone else learned to \"communicate\" with their right brain?",
        "author": "Old-Wrangler9830",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mlrxo/has_anyone_else_learned_to_communicate_with_their/",
        "text": "[removed]",
        "created_utc": 1678346201,
        "upvote_ratio": 1.0
    },
    {
        "title": "I dropped my chips😞",
        "author": "Fancylotl",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mlr7k/i_dropped_my_chips/",
        "text": "I recently got a bag a flaming hot Funyuns like. A week ago and decided to open them today. And just as I was about to take my fist ring, the bag decided to fall out of my hands. \n\nNow that’s gonna be the only thing that I think about for the rest of the week.",
        "created_utc": 1678346135,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you trust other people's accounts of events and experiences?",
        "author": "Connect_Cat_636",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mlp3t/do_you_trust_other_peoples_accounts_of_events_and/",
        "text": "Do you trust other people's accounts of events and experiences on Reddit? Other people's interpretations of events are unrelated to my own experiences, so I cannot believe them.",
        "created_utc": 1678345929,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mothers of Reddit who are in STEM or Tech, what is your experience of the work/life balance? What do you do for a living, and would you recommend it?",
        "author": "PathToJoy_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11mljij/mothers_of_reddit_who_are_in_stem_or_tech_what_is/",
        "text": "Hi!\n\nI'm currently trying to figure out whether I'm interested in going down either of the STEM or Tech paths, and how it would balance with having a family. For some background, I'm in my second year of college and majoring in human biology. I'm very lost on what to pursue, but I know that having a family in the future is important to me -- and with that in mind, it might help narrow down my options. I'm still undecided on whether STEM suits me, and what career to research. I've never looked into Tech before, but it seem intriguing to me from what I've read. Ultimately, my ideal goal is to have a job with a decent salary that is flexible for raising kids. So I'd love to hear your experiences. Thanks in advance for sharing :)\n\n&amp;#x200B;\n\n\\*\\*\\*Also not sure if this is the right subreddit to post a question like this, so please redirect me if not.",
        "created_utc": 1678345376,
        "upvote_ratio": 1.0
    }
]