[
    {
        "title": "Casual? ✅ Friday? ✅ Ready to have a Casual Friday talk with cool people? ✅✅ ",
        "author": "MajorParadox",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11b4to6/casual_friday_ready_to_have_a_casual_friday_talk/",
        "text": "",
        "created_utc": 1677279616,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your copium?",
        "author": "Clownthosh",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11b46nr/what_is_your_copium/",
        "text": "Copium is just an internet or meme slang for anything that helps you cope with life, or anything that makes life worth the suffering!\n\nSo what is your copium? Gym, significant other, pet, hobbies or something else?",
        "created_utc": 1677277982,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your copium?",
        "author": "Clownthosh",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11b44f0/what_is_your_copium/",
        "text": "[removed]",
        "created_utc": 1677277831,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get over losing friends as you grow older?",
        "author": "quite--average",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11b42jm/how_to_get_over_losing_friends_as_you_grow_older/",
        "text": "I have lost touch with friends over the years but this instance made me really heartbroken. We were a group of 4, 2 of them had some stupid fight with the third and they stopped talking to the third friend and eventually those 2 also stopped talking to me for some reason. I didn’t even have any beef with any of them (and they agree). We were a really tight knit group and suddenly the group got divided in 2-2. Those two people now from talking to me almost everyday, went on to not even picking up my calls. \n\nI feel really disheartened today since it’s my birthday and I wish all 4 of us were together. I am feeling super childish that I am feeling this way. What to do about it?",
        "created_utc": 1677277702,
        "upvote_ratio": 1.0
    },
    {
        "title": "I came really close but didn’t accomplish my goal and I’m feeling kinda bummed about it.",
        "author": "stonedrunescaper",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11b3a3d/i_came_really_close_but_didnt_accomplish_my_goal/",
        "text": "I set a goal for myself of $30/hr by 30. I didn’t make it. I got more than the top pay range for the role but it’s not my goal. My goal was $30 and I got to $29.80. \n\nThe job does have really good benefits and generous time off but I am still kinda low about it.\n\nI don’t want to sound ungrateful. I know there are people dealing with much worse. It’s more about being bummed I missed that number.",
        "created_utc": 1677275712,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just called Xfinity and had my plan dropped by $25",
        "author": "GandalfDaGangsta_007",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11b2yna/just_called_xfinity_and_had_my_plan_dropped_by_25/",
        "text": "Last fall I noticed my rates went up $25 and kept forgetting to call. Just finally looked online and I had a $25 “XFI complete” plan added to my account randomly. \n\nIt was to give me unlimited data. Looking at my data, I don’t use even 1GB a month. \n\nSo I cancelled this random add on and my internet is $61 instead of $89\n\nAlso, what do you pay for internet?",
        "created_utc": 1677274916,
        "upvote_ratio": 1.0
    },
    {
        "title": "Every single day, I hear the same *ting* sound from the same corner of my apartment.",
        "author": "Fancy_Leshy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11b2s93/every_single_day_i_hear_the_same_ting_sound_from/",
        "text": "I have no idea what it could be. It sounds like something bouncing off an empty mason jars metal lid. My art desk and supplies are all in that corner but there isn’t anything there that could make the noise I’m hearing. \n\nI was once *at* my desk when I heard it! It made me scribble a line by accident because it was so loud and startled me so much. It sounded like the exact center of the corner of the room under all my stuff.\n\nI dug into the pile and found only sketchbooks and art books, nothing metal or hard anywhere to emulate the noise. \n\nI still have no idea what it could be. Im baffled every time I hear it",
        "created_utc": 1677274471,
        "upvote_ratio": 1.0
    },
    {
        "title": "Late 20's moved back to home state and hating it.",
        "author": "njo1",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11b22u2/late_20s_moved_back_to_home_state_and_hating_it/",
        "text": "Lived across the country for a while on my own, things got financially difficult and I had a connection back on the East Coast which helped me financially. I've had to move back in with family after not living with them for years. I feel like a little kid, there's too many people in this state, rent is so high that I can't even afford to move out, and the weather is absolutely awful. I am grateful for my job and that I had a place to go but, I'm losing my absolute mind here!! I really don't want to live here but have to for now. I dont know how to feel better about this. Been back about 6 months now.",
        "created_utc": 1677272745,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I weird to think it says a lot (and not in a goood way)…",
        "author": "harmonybrook",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11b1z48/am_i_weird_to_think_it_says_a_lot_and_not_in_a/",
        "text": "[removed]",
        "created_utc": 1677272492,
        "upvote_ratio": 1.0
    },
    {
        "title": "كيفية الاستعلام عن المخالفات المرورية في السعودية برقم الهوية 1444",
        "author": "PeaCautious3352",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11b1fm2/كيفية_الاستعلام_عن_المخالفات_المرورية_في_السعودية/",
        "text": "[https://fi5dmtk.com/%d8%a7%d9%84%d9%85%d8%ae%d8%a7%d9%84%d9%81%d8%a7%d8%aa-%d8%a7%d9%84%d9%85%d8%b1%d9%88%d8%b1%d9%8a%d8%a9-%d9%81%d9%8a-%d8%a7%d9%84%d8%b3%d8%b9%d9%88%d8%af%d9%8a%d8%a9/](https://fi5dmtk.com/%d8%a7%d9%84%d9%85%d8%ae%d8%a7%d9%84%d9%81%d8%a7%d8%aa-%d8%a7%d9%84%d9%85%d8%b1%d9%88%d8%b1%d9%8a%d8%a9-%d9%81%d9%8a-%d8%a7%d9%84%d8%b3%d8%b9%d9%88%d8%af%d9%8a%d8%a9/)",
        "created_utc": 1677271161,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did your first date go?",
        "author": "vapegod_420",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11b1dh3/how_did_your_first_date_go/",
        "text": "Like legit your first date. Not with your current partner or last date. \n\nBut for me it went mehhh. We literally just walked to a close fast food place after school.  During the date out of nowhere I wanted to play Forza 4. Even though it was already a old game at that time lol. At the end of the date it was a awkward hug because their mom picked them up.\n\nA week later one of their friends asked me how did it go even though I never mentioned it to them lol. Overall good learning experience I guess lol.",
        "created_utc": 1677271014,
        "upvote_ratio": 1.0
    },
    {
        "title": "طريقة التحويل الدولي من بنك الراجحي 1444",
        "author": "PeaCautious3352",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11b152d/طريقة_التحويل_الدولي_من_بنك_الراجحي_1444/",
        "text": "[https://fi5dmtk.com/%d8%a7%d9%84%d8%aa%d8%ad%d9%88%d9%8a%d9%84-%d8%a7%d9%84%d8%af%d9%88%d9%84%d9%8a-%d9%85%d9%86-%d8%a8%d9%86%d9%83-%d8%a7%d9%84%d8%b1%d8%a7%d8%ac%d8%ad%d9%8a/](https://fi5dmtk.com/%d8%a7%d9%84%d8%aa%d8%ad%d9%88%d9%8a%d9%84-%d8%a7%d9%84%d8%af%d9%88%d9%84%d9%8a-%d9%85%d9%86-%d8%a8%d9%86%d9%83-%d8%a7%d9%84%d8%b1%d8%a7%d8%ac%d8%ad%d9%8a/)",
        "created_utc": 1677270425,
        "upvote_ratio": 1.0
    },
    {
        "title": "New to Reddit please help me with upswing",
        "author": "wonderworld223",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11b14gd/new_to_reddit_please_help_me_with_upswing/",
        "text": "[removed]",
        "created_utc": 1677270378,
        "upvote_ratio": 1.0
    },
    {
        "title": "طريقة تحويل الزيارة إلى إقامة في السعودية والمستندات المطلوبة",
        "author": "PeaCautious3352",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11b13ib/طريقة_تحويل_الزيارة_إلى_إقامة_في_السعودية/",
        "text": "[https://fi5dmtk.com/%d8%aa%d8%ad%d9%88%d9%8a%d9%84-%d8%a7%d9%84%d8%b2%d9%8a%d8%a7%d8%b1%d8%a9-%d8%a5%d9%84%d9%89-%d8%a5%d9%82%d8%a7%d9%85%d8%a9/](https://fi5dmtk.com/%d8%aa%d8%ad%d9%88%d9%8a%d9%84-%d8%a7%d9%84%d8%b2%d9%8a%d8%a7%d8%b1%d8%a9-%d8%a5%d9%84%d9%89-%d8%a5%d9%82%d8%a7%d9%85%d8%a9/)",
        "created_utc": 1677270315,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just wanted to tell that I made so terrifying face on the mirror that I genuinely freaked out A LOT and thought that I was losing my mind for a little bit",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677268736,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's something that is really popular now, but in 5 years from now we will regret or be embarrassed for doing or having it?",
        "author": "FlightAttendant_7882",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11b07pc/whats_something_that_is_really_popular_now_but_in/",
        "text": "I like recording myself dancing on TikTok, but I think that I will regret in the future when I see again my videos.\n\nDo you do or have something now that you think you will be ashamed when you look it back? Like using flip flops outside home or whatever.",
        "created_utc": 1677268089,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's something that is really popular now, but in 5 years from now we will regret or be embarrassed for doing or having it?",
        "author": "FlightAttendant_7882",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11b04bn/whats_something_that_is_really_popular_now_but_in/",
        "text": "[removed]",
        "created_utc": 1677267859,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Oscars",
        "author": "poolside123",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11azrb2/the_oscars/",
        "text": "[removed]",
        "created_utc": 1677266945,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel... guilty? Sad? that the career path I'm considering isn't in high demand and doesn't seem to help society",
        "author": "Relevant_Engineer442",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11azo25/i_feel_guilty_sad_that_the_career_path_im/",
        "text": "For context, I am a freshman in college. For a while I've been considering botany (plant science) for my future career. I'm passionate about biology and working with plants seemed like something that would make me happy. Maybe. But by all accounts, it doesn't seem like botanist positions get good pay. It doesn't seem like those kinds of jobs are in high demand. It also seems so much less fulfilling than being a doctor, someone who assists the elderly, a social worker, even a teacher. It feels kind of worthless, like why pay for a degree that isn't super needed by society? Does anyone else feel this way?",
        "created_utc": 1677266709,
        "upvote_ratio": 1.0
    },
    {
        "title": "Breakup - lonely",
        "author": "b4ndw4g0n2k16",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11azfcz/breakup_lonely/",
        "text": "As title states. Just broke up with my GF of over 1 year for very valid reasons, but now that loneliness is creeping in. What does everyone recommend that I might do to combat this over the next 4 days as I’ll pretty much be alone for the entirety of if. For context, I will be working but I work with senior citizens so there’s not much I can do while at work to keep it all at bay. Once Mondays roll around I’ll be back at school for the week, but I anticipate the weekends being rough.",
        "created_utc": 1677266102,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do raisins actually go well with anything?",
        "author": "world_citizen7",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11aza8x/do_raisins_actually_go_well_with_anything/",
        "text": "Raisins are fine on their own, but as soon as you add it to cookies or cake or even a trail mix, it ruins the entire dish. I can't think of anything raisins go well with. What are your thoughts?",
        "created_utc": 1677265747,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your answer on the question, what the back of a tree is?",
        "author": "ceptashot",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11az5oh/whats_your_answer_on_the_question_what_the_back/",
        "text": "[removed]",
        "created_utc": 1677265425,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your most “that’s so New York” story?",
        "author": "ilovenycny",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ayy6y/whats_your_most_thats_so_new_york_story/",
        "text": "[removed]",
        "created_utc": 1677264919,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need to talk anyone please ?",
        "author": "Ok_Celebration3136",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ayqjj/need_to_talk_anyone_please/",
        "text": "Confession :(\n\nHello everyone, I am posting here today because I am questioning my future a lot and because deep down I don't know if I want to continue living. If you want to understand why, I will tell you my story, but be warned, it's very long, so feel free to read it or not.\n\nIt all started in 5th grade when I was a good student, I was top of my class, which made me the teacher's pet. Unfortunately, the other kids in my class didn't like that, so they started to isolate me and refuse to let me play with them during recess. They gave me some nicknames like \"four-eyes\" (because I wear glasses) or \"Mickey\" (because my ears stick out a bit and look bigger), but nothing too bad.\n\nIn middle school, a particular group of people who went to the same elementary school as me singled me out as the \"victim\" and said that no one should hang out with me under any circumstances. For four years, I was punched, kicked, spat on, pushed around, tripped, slapped, hit with a compass or pencil sharpener blade. Sometimes, they would grab me and drag me behind the school out of sight, and beat me up with five or six of them while I was alone. The more I tried to defend myself, the harder they hit me, so I ended up just letting them do it.\n\nIn 7th grade, my parents and I had a car accident. A truck coming at high speed cut us off, and we collided head-on. Both my parents died instantly, but I remained conscious. I still remember, the car was upside down, there was blood all over my parents, and I was completely weak. I knew something was stuck in my stomach because of the blood flowing out. I eventually passed out after five minutes. I came out of it without any lasting injuries; the big piece of glass that had lodged in my stomach had not touched any organs, according to the doctors. But here's the thing, I am an only child, so I am alone. I was placed in a foster family, a very nice single man, but he is a truck driver, so we don't see each other much. I thought that becoming an orphan might calm down those who were harassing me...\n\nOn the contrary, he started to say that I didn't belong in this world, that I should have died with my parents... During 8th grade, two guys I didn't know, who were in another 8th-grade class, decided to help me, and I agreed to become their friend... What a mistake... They were put in the same boat as me, and despite trying to support each other, they didn't handle it as well as I did. They both suffered from depression, one luckily moved away and changed schools, the other ended up committing suicide by hanging himself at home.\n\nWhen the teachers asked us if we had any idea why he did it, they all said it was my fault, that I was a dangerous psychopath who had deliberately pushed him into depression and suicide just for \"fun.\" Since then, I have become completely asocial, I have developed social phobia, I have never had any friends, never had anyone to rely on (except for the two guys I just told you about), I have no social experience, so I can't make friends... That's why I gave up the real world to focus on the virtual world. I only live through online games, in online games, people consider me equal to them, and I am extremely social and spend my time joking online, the complete opposite of the real me. I also visit a lot of forums like this one to try to help people, listen, and comfort them",
        "created_utc": 1677264389,
        "upvote_ratio": 1.0
    },
    {
        "title": "My entrance exam for uni is in 19 hours!",
        "author": "Wolfxtreme1",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ay2qh/my_entrance_exam_for_uni_is_in_19_hours/",
        "text": "I am 23 and haven't had the easiest of times in the last 8 years... But after a long time I managed to save enough money to apply at the university that I wanted (University of Amsterdam). Tomorrow is the day that I have to take my first test in years and is to decide if I get in to study something I actually enjoy! I am terrified and excited!!!",
        "created_utc": 1677262746,
        "upvote_ratio": 1.0
    },
    {
        "title": "T-Mobile got hacked",
        "author": "Expert-Incident-007",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11axwft/tmobile_got_hacked/",
        "text": "[removed]",
        "created_utc": 1677262303,
        "upvote_ratio": 1.0
    },
    {
        "title": "alredo sauce is so superior to marinara when it comes to pasta it's not even funny",
        "author": "RobertLee2354",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11axu3n/alredo_sauce_is_so_superior_to_marinara_when_it/",
        "text": "[removed]",
        "created_utc": 1677262140,
        "upvote_ratio": 1.0
    },
    {
        "title": "T-Mobile got hacked",
        "author": "Expert-Incident-007",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11axt04/tmobile_got_hacked/",
        "text": "[removed]",
        "created_utc": 1677262060,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any guys here ever dressed as a girl by their moms/sisters during childhood?",
        "author": "Rockstud101",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11axhfg/any_guys_here_ever_dressed_as_a_girl_by_their/",
        "text": "\nI grew up in a household with 2 older sisters and an aunt, so I have several pics of me wearing frocks, saree or in makeup. This happened until I was like 8. Just wanted to ask is this a common thing or just me?\n\nEdit: [This is me](https://imgur.com/a/AEKjiYy)",
        "created_utc": 1677261260,
        "upvote_ratio": 1.0
    },
    {
        "title": "Making friends is the worst",
        "author": "nothingworthliving",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ax6qx/making_friends_is_the_worst/",
        "text": "[removed]",
        "created_utc": 1677260484,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Manager\" told me to \"keep my mouth shut\" in a \"friendly\" way",
        "author": "qwert4556w6ywyyw",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11awyal/manager_told_me_to_keep_my_mouth_shut_in_a/",
        "text": "[removed]",
        "created_utc": 1677259893,
        "upvote_ratio": 1.0
    },
    {
        "title": "I love my nephew and niece so much",
        "author": "TheThirdTit",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11awlxl/i_love_my_nephew_and_niece_so_much/",
        "text": "[removed]",
        "created_utc": 1677259062,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thinking of moving at the end of the year. Where should I go?",
        "author": "Noseasmamonguey",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11avyxf/thinking_of_moving_at_the_end_of_the_year_where/",
        "text": "I’ve lived in Philadelphia for the past 5 years.  It’s been great but I feel that it’s time for a change.  Everyone that lives in this city seems to get stuck here forever and I don’t want that. As great of a city as it is, there’s better places to live.  Also, I feel that I would have a better social life in a place where people are more friendly/what I am used to from where I grew up. \n\nThings i miss the most are easy access to nature and friendlier people. \n\nHere’s my thinking so far, in no particular order:\n\n- SLC, Utah -&gt; outdoors lovers paradise, however I’m concerned with the size and the lack of diversity. \n\n- Las Vegas -&gt; loved LV when I visited at age 16. Would be the kinda place I’d only live for a year. Nevada is very beautiful to me, but I’m also a sucker for cold/rain/snow and there’s not a lot of it there. \n\n- Dallas -&gt; shot in the dark here.  Definitely doesn’t fit my personality but Texas seems fun and Dallas seems nice. Would definitely pick over Houston and Austin. \n\n- Buffalo, NY / Toronto, Canada -&gt; grew up in this area so I know what’s up, however not sure if I would wanna move back that close to home.  Same concerns with lack of diversity in buffalo. \n\n- San Juan, PR -&gt; another shot in the dark. Love PR, speak a bit of Spanish, but don’t wanna get called a gringo / move there and not fit in. \n\n- Miami -&gt; I hate everything that city stands for but at the same time I want a piece of the action. \n\n\nI’m of course open to any suggestions and advice.  Thanks everyone!",
        "created_utc": 1677257468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is my teacher not at school but isn't sick?",
        "author": "Historical-Meat-7841",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11avxzz/why_is_my_teacher_not_at_school_but_isnt_sick/",
        "text": "So my Philosophy teacher hasn't been at school for 2 months (she's been off since 16th December) at first I thought she had an illness of some sort or going through a depressive episode but recently I found her social media and she posted a photo of herself going out with her friends looking perfectly fine. I don't think she would've gotten fired as she is extremely nice and everyone's favourite teacher. Anyone have any ideas why she isn't at school?",
        "created_utc": 1677257408,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel resentful towards my mom and don’t know what to make of these feelings",
        "author": "throwraaccount777",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11avor4/i_feel_resentful_towards_my_mom_and_dont_know/",
        "text": "[removed]",
        "created_utc": 1677256757,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boyfriend appreciation post",
        "author": "prettypuffin",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11avdar/boyfriend_appreciation_post/",
        "text": "Currently in a long distance relationship but honestly, I’ve never been this happy. \n\nI’ve never been treated like the princess he makes me feel. It’s so nice to know that there’s someone who thinks about you as much as you think about them. He sticks by in the toughest times and is my rock when I need him. And I try my best to do the same for him.  \n\nHe’s so caring and sweet and funny as hell. Makes me laugh so much my tummy hurts. We can talk for hours and hours without getting bored or being stuck without a topic. He’s smart and challenges me on topics and makes me think beyond my own opinions. \n\nI used to be someone that would see others in relationship and would think that would never happen to me. But now there’s this guy that spoils me and makes me feel loved and happy and like I’m enough. I can’t wait to be able to see him this summer, to hold him and cuddle and go on dates.  \n\nJust wanted to spread my joy and love.",
        "created_utc": 1677255950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is there so much biase towards women when it comes to relationship advice",
        "author": "njdovdsn",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11av4ac/why_is_there_so_much_biase_towards_women_when_it/",
        "text": "[removed]",
        "created_utc": 1677255307,
        "upvote_ratio": 1.0
    },
    {
        "title": "So, my doctor just told me that I might have an eating disorder",
        "author": "namonaki248",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11auseq/so_my_doctor_just_told_me_that_i_might_have_an/",
        "text": "I went in to get a regular blood test and for a checkup, so I had to measure my height and weight and all that. When I met up with the doctor so that they can fill in some information, like if my family has a history of cancer, if I'm allergic to anything, etc., they told me that I'm really underweight. To give some context, I'm a dude, 5'6\", and I weigh 116 lbs. I'd told the doctor that, while it's really close, it's still within the \"normal\" BMI weight range. So then, we got into the topic of eating habits.\n\nIf you're curious, I eat a total of maybe 6000-7000 calories during the weekend, do a water fast for 2-3 days based on how much I weigh or how bloated I'd felt leaving the weekend, eat an average of 200-600 calories per day until the weekend hits again and rinse and repeat. I've been doing this for about 4 years now (kinda surprised past doctors never brought this topic up, but it might've been out of respect for boundaries). I think that it's because it was out of the scope of the appointment and perhaps to respect boundaries, they didn't go into too much detail about it. They'd just told me that this can lead to various problems and that I should, within my current comfort level, try to eat a bit more or spread out the calories within a normal daily health range. And take multivitamins, too lol\n\nBut man, I'd never been confronted about this before, and it really puts some perspective into what I've been doing to myself. But, honestly, I don't have a problem with it because I'm just so used it, and I don't even know where to begin to get out of it. To be frank, I don't want to. I feel happiest when I see how thin I am in the mirror. Maybe that's a symptom that I have to come to terms with. But yeah, sorry for the random and long post. Nothing more I want to say. I just found it interesting and wanted to share it.",
        "created_utc": 1677254474,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend gave me a winter jacket that smalls like him and I really like wearing it because of how it smells.",
        "author": "goofandaspoof",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11aus6q/my_friend_gave_me_a_winter_jacket_that_smalls/",
        "text": "A couple weeks ago my friend had set up this kind of proxy-date with me and a friend of his where him, his friend and I were going to hang out. He thought me and this girl would be a good match. As the night went on, it became apparent that I was not dressed appropriately for the weather (I do have a good winter jacket, but elected to wear a different one because it looked cooler lmao). \n\nWe were walking by his place and he told us to wait and got me a big winter jacket. He apparently got it thrifting for like $20 and said I could just keep it. Its a great jacket and very warm. \n\nThe funny part is that it smells very much like him, and when I wear it I actually like that. \n\nFor context I am absolutely not into guys, but something about wearing the jacket is really comforting to me.",
        "created_utc": 1677254460,
        "upvote_ratio": 1.0
    },
    {
        "title": "What media did you consume whilst going through your \"edgy\" phase?",
        "author": "Historical-Meat-7841",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11auqf9/what_media_did_you_consume_whilst_going_through/",
        "text": "I remember back in '08 I'd watch Sonic the Hedgehog amv's with songs like animal I have become or monster playing in the background. I'd also play RPGS like FF or Fallout.",
        "created_utc": 1677254344,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pls give me some Karma 🙃",
        "author": "Substantial_Cut_2939",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11aty5r/pls_give_me_some_karma/",
        "text": "[removed]",
        "created_utc": 1677252275,
        "upvote_ratio": 1.0
    },
    {
        "title": "A day experience with the kid I tutor",
        "author": "VividConcept464",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11atx0e/a_day_experience_with_the_kid_i_tutor/",
        "text": "I was telling her to maintain tidiness while writing when I heard some faint blabbering. Because, I have my eyes on her copy, I had to look up at her to understand she was indeed the source. I raised a brow, and with an authorative tone I asked her what she was mumbling. Immediately, she shook her head trying to mend her mistake. \"It is nothing!!\" She said while I kept my stare at her fixed. Eventually, she gave it up to me. She was mimicking some of my common orderings to her.\n\n \"Darling, don't do it that way.\" \n\n\"No! You should do it this way. Go on you are doing well.\"\n\n\"Very good, you did it! \"\n\n\"Oh bad, let me tell you how to do this. Your pronunciation is wrong, Baby\"\n\nWhich wonders me more is that this 7 year old girl mimicked my accent very accurate!",
        "created_utc": 1677252185,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone can't sleep without pillows surrounding them?",
        "author": "mary_jane_of",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11atv7m/does_anyone_cant_sleep_without_pillows/",
        "text": "I don't get the people who only have 1 pillow for their head and can sleep comfortably. I can't sleep without pillow on each of myside and on my feet. Is it just me?",
        "created_utc": 1677252049,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free Online Education Sites",
        "author": "Aksharmultiservices",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11atjpp/free_online_education_sites/",
        "text": "[removed]",
        "created_utc": 1677251217,
        "upvote_ratio": 1.0
    },
    {
        "title": "went to westlife's concert tonight",
        "author": "tobefreee",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11at8qv/went_to_westlifes_concert_tonight/",
        "text": "That's it, 29yrs old, been suffering from depression for years, went to my first concert alone. Lucky to have very hype neighbours sat next to me, had fun to join them in screaming, waving, singing.",
        "created_utc": 1677250417,
        "upvote_ratio": 1.0
    },
    {
        "title": "When I was younger, I was terribly afraid of ghosts. I always fear that a ghost under my bed would grab me. Guess what I did that immediately eliminated my fear?",
        "author": "iFoegot",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11at37j/when_i_was_younger_i_was_terribly_afraid_of/",
        "text": "[removed]",
        "created_utc": 1677249998,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who else is fine with sleeping less then 8 hours?",
        "author": "complainabout",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11at1i2/who_else_is_fine_with_sleeping_less_then_8_hours/",
        "text": "So i know experts say you need 7-8 to sleep but the ideal is 8 hours of sleep. \nI mean sometimes i manage to do this but most of the time it's between 5.5-7 hours to sleep. \nBut man i really feel energy Sometimes after 5 hours i be wide awake because i feel like my body is fully rested. Sometimes i force myself to go back to sleep but sometimes that makes it worse and wish i would just had stayed up, i dont feel as good as i felt when i first woke up.  Im active during the day the as well so i would think i would sleep longer but nope i feel totally fine after 5/6 hours sometimes. Dont even require a nap during the day either, but can sleep 8 hours sometimes and still might want a nap later. It just all depends",
        "created_utc": 1677249870,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m unstable and abusive.",
        "author": "kyrakid",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11aszup/im_unstable_and_abusive/",
        "text": "After 2 years my boyfriend has broken up with me and rightfully so. I was emotionally and verbally abusive towards him and it affected his kids. My moods are unstable and when I’m angry its like I can’t control what I say. If I could afford psychiatric help I would’ve gotten it a long time ago. I feel terrible for what I’ve done and my promise to myself is to be a better person and never hurt someone else the way I have again.",
        "created_utc": 1677249742,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some silly things that you thought when you were a kid?",
        "author": "CriticalRoll2322",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11aswm5/what_are_some_silly_things_that_you_thought_when/",
        "text": "When I was a kid I thought that “maximum capacity” signs were showing the record for the most people who had ever been in that building at one time.\n\nI also thought that “lip balm” was “lip blam”. What are some silly things that you misunderstood when you were a kid?",
        "created_utc": 1677249496,
        "upvote_ratio": 1.0
    },
    {
        "title": "When I was a kid I thought that “maximum capacity” signs were showing the record for the most people who had ever been in that building at one time.",
        "author": "CriticalRoll2322",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11asvyw/when_i_was_a_kid_i_thought_that_maximum_capacity/",
        "text": "[removed]",
        "created_utc": 1677249446,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just so you know, the '/s' sarcasm indicator is absolutely required on Reddit.",
        "author": "ZQuestionSleep",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11asvtl/just_so_you_know_the_s_sarcasm_indicator_is/",
        "text": "[removed]",
        "created_utc": 1677249436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does therapy really help? Has it benefited you &amp; how has it altered your life? Or is it an expense that does not yield the same return?",
        "author": "pku003",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11asm80/does_therapy_really_help_has_it_benefited_you_how/",
        "text": "My friend(45F) had an ugly break up after a 9 year relationship and I do not know how to help her &amp; was contemplating therapy, thus the above question. Please help me out. Thanks :)",
        "created_utc": 1677248735,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anybody here just happy?",
        "author": "QuestionEcstatic5307",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11asls0/anybody_here_just_happy/",
        "text": "I know that life is tough and unfair but sometimes you just accept life for what it is and be happy. Try to do the best you can, be kind to others, don’t bother about other people’s business and just go about living your life, making the most of what you have and not worry about what you don’t have and what you lost.",
        "created_utc": 1677248704,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need to take a train from Frankfurt to Bremen",
        "author": "Many-Substance628",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11arjgu/need_to_take_a_train_from_frankfurt_to_bremen/",
        "text": "[removed]",
        "created_utc": 1677245728,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone wanna talk?",
        "author": "Sweet_Spinach",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11are59/anyone_wanna_talk/",
        "text": "I’m fresh off of making content and in a fluster of emotions. Today I’m putting OF behind me as I’ve accepted a very good paying job in my field of study. I’m happy and sad. I’ve had a lot of fun and now that it’s gone I feel like I’ll crave it. You know? Anyway, thanks for reading!",
        "created_utc": 1677245290,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have been learning about financial literacy, and I got an email today saying my credit score went up!",
        "author": "tangledclouds",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11arbap/i_have_been_learning_about_financial_literacy_and/",
        "text": "Guys I am so happy. I was raised in a neglectful household and was not taught such important adult matters such as finance.\n\nI decided to learn financial literacy as I gain these adult skills. \n\nAs you can imagine, I didn't have much of a credit score. It was also lower due to medical bills.\n\nI tackled those bills, and got with a bank. Then, I applied for a starter credit card with a low line of credit, maybe only a few hundred dollars.\n\nI made several tiny purchases and paid them off as fast as the next day.\n\nIn just a few months, my score has gone up over 100 points! It is now considered very slightly above average, so we are getting there! \n\nI am so happy, haha! Adulthood!",
        "created_utc": 1677245045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I the only one?",
        "author": "wantwaturhaving",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ar02w/am_i_the_only_one/",
        "text": "I have sat alone in the darkness of my mind for so long that I have lost track of time. Days blend together like a cruel, meaningless dream. I am but a shell of a human being, hollow and devoid of purpose. The world outside these walls may continue to spin and turn, but to what end? There is no grand design, no ultimate meaning. Life is a cosmic joke, a cruel trick of the universe. We are all just insignificant specks, born to work, suffer and die. And what of the legacy we leave behind? It too will fade into obscurity, lost in the abyss of time. The only truth that remains is the crushing weight of nothingness, the void that consumes us all. So here I lay, a prisoner of my own mind, awaiting the inevitable end. For what is the point of life if not to simply wait for death?\n\n\nTo those who suggest we can make our own meaning, the idea that we can create our own meaning and purpose assumes a certain level of privilege and agency that not everybody has. What about those who are born into poverty, oppression, or illness? Are they not entitled to a sense of meaning and purpose in their lives? By suggesting that we can simply create our own meaning, we ignore the pervasive systemic issues that prevent the majority of people in the world from living life on their own terms.\n\nSome people may struggle with the implications of nihilistic ideologies, it is important to recognize that this is not inherent to the philosophy itself. Rather, it is a result of societal structures and individual circumstances that prevent people from accessing the resources and support they need to cope with the challenges of life. Perhaps we could challenge the societal structures that prevent people from accessing those resources they need to live meaningful and fulfilling lives? But even then, to what end?\n\nThe idea that life has no inherent meaning is the logical conclusion. Yes, exploring different perspectives can be interesting and informative, but it doesn't change the fact that life is ultimately meaningless. Engaging in creative or artistic pursuits or seeking out spiritual guidance may offer temporary distractions or provide a sense of comfort, but those things ultimately do not change the fundamental nature of reality.\n\nI'm so over this existence.",
        "created_utc": 1677244088,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you're looking for a cool comfort show, watch Lockwood &amp; Co, it's British and it has a great soundtrack",
        "author": "morbidlibrarian",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11aql7f/if_youre_looking_for_a_cool_comfort_show_watch/",
        "text": "[removed]",
        "created_utc": 1677242818,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to date an American girl.",
        "author": "First_Mechanic9140",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11aqkkd/i_want_to_date_an_american_girl/",
        "text": "[removed]",
        "created_utc": 1677242759,
        "upvote_ratio": 0.99
    },
    {
        "title": "Hey I want new friends",
        "author": "Busyprettymff",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11aqge5/hey_i_want_new_friends/",
        "text": "[removed]",
        "created_utc": 1677242380,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to make friends here tbh..I left twitter it got exhausting mentally…I’m gender fluid and I’d like to make friends talk o random stuff tbh ..anyone can text me",
        "author": "Busyprettymff",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11aqf7u/i_want_to_make_friends_here_tbhi_left_twitter_it/",
        "text": "[removed]",
        "created_utc": 1677242272,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey y’all ..maybe I’d get used to reddit and like it more than twitter",
        "author": "Busyprettymff",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11apowr/hey_yall_maybe_id_get_used_to_reddit_and_like_it/",
        "text": "[removed]",
        "created_utc": 1677239856,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you play a game where the protagonist isn't voiced but instead you ask your own questions with a microphone?",
        "author": "SupremeEmperorNoms",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11apo69/would_you_play_a_game_where_the_protagonist_isnt/",
        "text": "A long time ago, I played a game called Wizardry 8, which had a unique method of interacting with other characters within the RPG. They all had their own programmed responses to specific key words that you could type in and ask them about. This allowed you to not only take \"unlocked\" words that you found in the world but also type in your own questions and have them answered if the character has the information you're looking for!\n\nThis was an EXTREMELY old game, so I am fairly certain the same mechanic could be not only adopted but improved upon. Essentially, allowing us to speak directly to the characters within the game without the need for a \"word by word\" system the last one used. Voice recognition software has gotten better and better, so having the ability to ask your own questions to the characters could be extremely immersive, especially if they had their own unique takes and perspectives on the questions you ask. No more \"drop menus\" or text choices, instead characters know about topics or don't and respond accordingly to what you ask them.\n\nSo, the question is this, would you try a game that allows you to have actual conversations with the characters in the game, or would the idea of doing something so active or new turn you off? Do you need to have that list of questions your character can ask that you choose from? What would make you hesitate or excite you?",
        "created_utc": 1677239776,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why I prefer Western animation over Japanese animation (aka anime).",
        "author": "First_Mechanic9140",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ap30q/why_i_prefer_western_animation_over_japanese/",
        "text": "I am not claiming that Western animation is better, because it is all subjective, just why I prefer to watch it. \n\nModern Western (mainly American) animation is very inclusive. It shows characters of different skin colors, portrays LGBTQ+ characters in a very natural way. I love shows like \"She-Ra and the Princesses of Power\", \"The Owl House\", \"Amphibia\", \"Infinity Train\", etc. They are very inspiring and also mature enough to enjoy at any age.\n\nAnime, on the other hand, really creeps me out. It has a problem with blatant oversexualization, especially of underage characters who look like middle-schoolers (arguments like \"she's actually 1000 years old dragon/demon/vampire\" are invalid). Anime is extremely sexist, there are things like harem which I absolutely can't stand.\n\nI used to like Japanese animation quite a lot, but now that I am not a high schooler anymore, I see how problematic it can be. Obviously not all anime shows are like this, but there is still very unnerving tendency that isn't gonna change any time soon. \n\nP.S. I am a guy, if that matters.",
        "created_utc": 1677237641,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me with a new demonstration speech idea?",
        "author": "Monthly_Vent",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11aou8h/help_me_with_a_new_demonstration_speech_idea/",
        "text": "Okay so just for context I am a college student taking a COMM class. \n\nTwo days ago I was *supposed* to complete my demonstrative speech, but I chickened out and ditched class. \n\nMainly it was my idea. I had this shit idea that I’ve been planning for a week and while typing it out I realized that explaining what everyone else already knew how to do was not exactly a great idea… You see, my original plan was explaining how to break down information, separated into breaking down instructions, sentences, and body movements. For the first two, they stem from the fact I grew up with a comprehension problem, so I had to figure out how to interpret information the way most people do. The last one was a trick I use to help motivate myself, borrowed from those struggling with depression, anxiety, and ADHD. However, halfway through I realized trying to explain this to a group of people who don’t actually have this problem is a terrible idea. I feel like I’m explaining the obvious here. \n\nSo I’m planning to scratch that idea and present a different one. Problem is, *I have no clue what*. For some reason this class has this thing where they like asking questions, so I can’t just do something I don’t know much about since my answer will be “I have no clue I just googled it” which might impact my grade. So basic ideas suck unless I want to take some time and do a ton of research on something I don’t even care about. \n\nThe rules of the speech is that there must be some kind of visual aid (whether that be yourself or a physical object. Can use slides but not videos, and slides must only have pictures and a few bullet points maximum.). It must follow a introduction, 3 main points, and a conclusion, written in outline form for the professor. We have 4-6 minutes to demonstrate our thing, but I’ve done speeches where I’ve gone an extra minute longer and gotten extra credit for having a great audience response, so if I somehow make it fun I can probably do okay\n\nI really like to learn about psychology and environmental science, though for some reason my brain can retain (environmental science is one of those “I really like learning about it but idk what’s going on 25% of the time :D”). I also like drawing but I don’t have an artist’s eye and I can’t seem to comprehend the rules enough to actually do a demonstration on it. I also like spiders, but I’m not allowed to own any and half of the class has a thing against bugs anyways soooo. Also was very into disability activism for a time, so I can probably pick that up faster than some other info depending on how much medical jargon there is (not very good with vocab words. Part of the comprehension issue)\n\nI’ve had how to tell if a source is being biased but I don’t think I would know how to answer any of the questions they’ll throw at me since I struggle with it sometimes too. \n\nA part of me wants to go back and stick with my original idea, because I worked out this really unique way to engage the audience that I don’t think anyone else has done before but I’m really struggling with how to explain this to an audience that instintually has done this for their entire lives. And plus it’s so personal to me that I’m not sure how I can respond if they don’t take it well. (They did laugh at one guy for displaying autistic-like behaviors. He’s now the class’ laughing stock. It makes me sad and a bit afraid.) \n\nSo uhhhh.. help ;w;;",
        "created_utc": 1677236721,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I feel overwhelmed when I talk to too many people at once?",
        "author": "henlo_oo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11aneuj/why_do_i_feel_overwhelmed_when_i_talk_to_too_many/",
        "text": "[removed]",
        "created_utc": 1677231190,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sometimes I feel Like Im going to die in the waiting room of a Doctor",
        "author": "Fun-Agent-7667",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11anday/sometimes_i_feel_like_im_going_to_die_in_the/",
        "text": "Rn Sitting in one, for 3 hours strait now. Twisted my ankle, already spend the entire Wedneday in the hospital waiting. It isnt their fault, they are understaffed and the ER got a large influx of patients from ambulances. I think im also going to sit here until Noon ( 10:21 CET currently) just to get my remitrance to a radiologist, and if Im unlucky I cant Go there until monday. The Problem is, just sitting here is not great for my Back (I have scoliosis), Standing up is bad for my ankle and there is simply not enough room here to lie down. I also cant really do excercises for my back because of the ankle. If I had some sort of DVT I think id just fall asleep in a waiting room and not wake up because here are at least 3 people that are way higher on the priority and also will be waiting one or two hours",
        "created_utc": 1677231016,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which band sounds like a combination of Linkin Park and Backstreet Boys?",
        "author": "kaijisheeran",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11an5xp/which_band_sounds_like_a_combination_of_linkin/",
        "text": "My friend joked that Paramore is Avril Lavigne and Evanescence combined. I find it interesting so I thought of something too. I said Metallica is Bon Jovi and Black Sabbath combined.  \nWhat do you think is BSB and Linkin Park conbined? I admit I'm a fan of these two so I wanna see the combo in your opinion lol",
        "created_utc": 1677230185,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your most embarrassing moment that you just wished to get lost at that moment?",
        "author": "kisara__sims",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11amvaj/what_is_your_most_embarrassing_moment_that_you/",
        "text": "It is when me and my friend playing around while walking out of the school and then I tried to do a piggy back on her while approaching her. We ended up face flat on the floor at the front of school while there are hundreds of students passing by. Lol.",
        "created_utc": 1677228992,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just turned 28. I feel like I’ve done nothing with my life and I hate it.",
        "author": "Not_A_Llama_1",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11amnhc/i_just_turned_28_i_feel_like_ive_done_nothing/",
        "text": "I feel like I’ve wasted my good years and am nowhere where I need to be compared to my peers. I’ve disappointed my family and I am just spinning my wheels here where I am. \nHow’s everyone else’s Friday.",
        "created_utc": 1677228108,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my crush playing hard to get or is she politely rejecting me indirectly ?",
        "author": "L5D4W34P0N",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11am9ws/is_my_crush_playing_hard_to_get_or_is_she/",
        "text": "TLDR: I need perspective on whether or not my crush is interested in me or If im reading the situation incorrectly.\n\nI (27M) had just moved into town and started a new job last year in the fall. At this new job, a very beautiful woman with her captivating presence, met my gaze as she walked by to sit at her desk. I was smitten and for the first time in a long time i felt a sense of nervousness absorb me. \n\nI didn’t talked to her for a few months since I started at this job. i just knew *of* her. Just her name really. there were lots of times at work where we would make eye contact from a far. But i did experience times where she would just look at me once. kinda like “I am aware of ur existence, but not today..” kinda look lol\n\nI am an ambivert. I know not to bother people who just want to exist without being a focal point. but i am also outgoing enough to initiate and respond to an interaction positively. Im not usually shy, but she makes me a nervous wreck. my own anxiety makes it difficult for me to read her signals. \n\nEarlier this month I get a random text saying “hi this is  (my crush’s name) from work” . Heart racing from shock not knowing wtf to say next. apparently she got my number from a co-worker who i talk to on occasions. we. hit. it. off immediately! After an hour of texting getting to about each other on the surface level, the next day I saw her her at work. I began walking up to her to strike a convo. She reciprocated positively, she was playing with her hair, smiling, stepping closer and closer, etc. \n\nafter the work day feeling amazing…\nI decided to text her about our pleasant interaction and asked her out. She politely rejected me saying that she wasn’t to ready to date anyone, and that she hopes to remain friends.  She even said that she would be down to hang out sometimes . Surprised by her response, I gracefully took the rejection on the chin and apologized if I came on too strong. \n\nShe assured me that it was ok and we moved on from the convo.  the next day at work until present day we would just say hi to each other. honestly there was no awkwardness. she maintained eye contact and smiles during our brief interactions at work. I was relieved that she didn’t avoid me. \n\nwe would still text each other post rejection, but her response was slower and shorter each time. she barely shares anything about herself and rarely asks anything about me.  Feeling insecure about the lack of response, and being left on read for hours at a time. I decided to ask her directly if she would like me to keep my distance incase she felt shy or uncomfortable by flat out rejecting me, and she said no. \n\nShe insisted that I *don’t* keep my distance and she is happy to remain friends.  Her mixed signals  are driving me a lil crazy. I have very strong feelings for her already, I even told her subtly that I liked her. I hope to someday peruse her romantically, but not if she is genuinely not interested in me this way.  what do you guys think? I could use perspective",
        "created_utc": 1677226627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever noticed how much harder it is to WOW people with gifts nowadays?",
        "author": "RationalIdiot",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11am50z/have_you_ever_noticed_how_much_harder_it_is_to/",
        "text": "Like 10 to 20 years ago ferrero rocher chocolates would be appreciate, buying someone mcdonalds was a legit treat and buying gaming consoles was something only the rich can do. \n\nNowadays unless you buy someone an iphone everything else seems meh and almost insulting. \n\nPerhaps its just a big city dweller thing but ive noticed things that WOWED back in the day just doesnt anymore",
        "created_utc": 1677226103,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many TV game shows is too many?",
        "author": "venomandvaccine",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11am2qd/how_many_tv_game_shows_is_too_many/",
        "text": "I can't speak for the whole of civilisation but on British TV there are far too many game shows occupying space that could be used for something educational or something else which is a lot more entertaining.\n\nA good example being the game show called \"pointless\"\nAnd it really is exactly that.\nHosted by celebrities that have no point.",
        "created_utc": 1677225858,
        "upvote_ratio": 1.0
    },
    {
        "title": "what's up",
        "author": "Alternative-Bowl6563",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11alzt3/whats_up/",
        "text": "[removed]",
        "created_utc": 1677225573,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many TV game shows is too many?",
        "author": "venomandvaccine",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11alzc6/how_many_tv_game_shows_is_too_many/",
        "text": "[removed]",
        "created_utc": 1677225520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is anybody else young and not leave the house often?",
        "author": "ummolay",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11alp7t/is_anybody_else_young_and_not_leave_the_house/",
        "text": "I’m 21 from the UK and I don’t really leave the house anymore, it’s not because I have social or any kind of anxiety about going outside, it’s just because there’s genuinely not much to do anymore and my friends always cancel plans. Another factor is the fact that everything is always on strike over here, busses, trains, nurses etc.\n\nI am genuinely down to do most things but whenever I make plans or ask people on the day or the before they will just come up with an excuse to not go. I enjoy my own company and like to be in the comfort of my own home but not constantly. \n\n\nI feel like I’m wasting my young years by just sitting around and being bored, I genuinely wish I did leave the house more and socialised with people.",
        "created_utc": 1677224416,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just gotta share",
        "author": "jackfaire",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11alo3j/i_just_gotta_share/",
        "text": "For a long time I lived paycheck to paycheck and had three hour commutes. That's three hours from home to work and then another 3 from work to home. Just to make sure I could have food on my table and keep the lights on with a roof over my head.   \n\n\nUnexpected bills hurt a lot during that time and I eventually had to move in with family but even then things were still really tight. About a year and a half ago I took a job that finally pays me the kind of wages I can live on.   \n\n\nToday I got paid and got hit with an unexpected bill. I tossed some other bills around figured out which i can pay next paycheck or the one after that and handle them. I'll be fine. This unexpected bill is nothing more than a minor annoyance.   \n\n\n I can't describe how utterly amazing that feels. Something that 2 years ago would have had me stressed, laying in bed freaking out is only something I just have to juggle now.",
        "created_utc": 1677224299,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is something that isn’t that wild but that you feel has only ever happened to you/a handful of people?",
        "author": "vlazuvius",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11alha7/what_is_something_that_isnt_that_wild_but_that/",
        "text": "I’m not looking for that time Nicholas Cage asked you to be his stunt double while you were walking your dog, but rather something that manages to be both unique and mundane.\n\nAs an example, the memory that triggered this question:\n\nI grew up on a ranch, and when I was in elementary school a large snowfall followed by a fast melt caused a bridge on the ranch to wash out. They couldn’t fix it until the weather improved, so for two weeks my dad drove me to the are where the bridge was, and I had to walk across planks that were stretched over the rushing water to get to the truck of another ranch hand on the other side, so that he could drive me the rest of the way to the bus stop.\n\nWhat are your weird little experiences like this?",
        "created_utc": 1677223571,
        "upvote_ratio": 1.0
    },
    {
        "title": "Manufactory High Quality CAS: 288573-56-8 1-BOC-4-(4-FLUORO-PHENYLAMINO)-PIPERIDINE KS-0037",
        "author": "cindylaa",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11al6j3/manufactory_high_quality_cas_288573568/",
        "text": "[removed]",
        "created_utc": 1677222426,
        "upvote_ratio": 1.0
    },
    {
        "title": "do you believe in astrology? if so, what’s your sign?",
        "author": "QuinnyIsACowboy",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11akv6z/do_you_believe_in_astrology_if_so_whats_your_sign/",
        "text": "i personally think it’s fun and there’s a lot of accuracies and coincidences that happen for me to think it’s 100% fake. however, i would not base my life off of it and don’t blame my sign for my actions haha! \ni am an aries! what are you?",
        "created_utc": 1677221234,
        "upvote_ratio": 1.0
    },
    {
        "title": "this is like a simulation thing",
        "author": "hhhjngghjjj",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11aksci/this_is_like_a_simulation_thing/",
        "text": "[removed]",
        "created_utc": 1677220950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Defeating Pandemic Brain",
        "author": "Murky-Highway-4493",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11akje5/defeating_pandemic_brain/",
        "text": "[removed]",
        "created_utc": 1677220059,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Elon Musk remarried just curious?",
        "author": "Ok-Beautiful-3615",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ajy4j/did_elon_musk_remarried_just_curious/",
        "text": "[removed]",
        "created_utc": 1677217961,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unofficial LPT Request: How to stop yourself from unblocking someone.",
        "author": "Ok_Topic3020",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ajrcm/unofficial_lpt_request_how_to_stop_yourself_from/",
        "text": "[removed]",
        "created_utc": 1677217315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Up late!",
        "author": "notmenotme24",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11aiyd5/up_late/",
        "text": "I'm up late and wanna chat with somebody. What's your favorite album? Do you like visual art (paintings, sculpture)? Does astrology mean anything to you? (I'm a Taurus if it does 😊). Comment your answers!!! Let's get talkin'. Under 18 DNI, I am 24.",
        "created_utc": 1677214638,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where does one go to practice using a wingsuit?",
        "author": "sunward_Lily",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11air8u/where_does_one_go_to_practice_using_a_wingsuit/",
        "text": "Every once in a while I come across a really awesome video on the internet of someone jumping off a high building/mountain/whatever in a wingsuit and then just going insane, doing rolls and flips and loop-de-loops and I'm astounded.\n\nI have no idea how they get so good at something like that because a wingsuit seems to me like something you don't really have much of a chance to practice.  Like, if you're a novice wingsuit person (wingsuitor?) where do you go to practice a complete 90 degree inversion, or a 360 roll, or a complete loopy thingy safely?  \n\nWingsuits seem to me like something you have to get absolutely right on the very first try, or else you won't be around to make another attempt...\n\nIf anyone who has actually done that could help me understand how exactly people get so good at such a dangerous (and awesome) hobby without, ya'know....*dying* right off the bat, I'd be eternally grateful.  :D",
        "created_utc": 1677213974,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your desires?",
        "author": "WorkingPotential1982",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11air5s/what_are_your_desires/",
        "text": "One thing I’ve learned through Buddhism is that we all have some kind of desire to an extent. So what desires do you have when you wake up? There is nothing special in my life that gets me moving, but generally I like the idea of seeing other people being happy.",
        "created_utc": 1677213966,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should I do with my week off before starting my new job?",
        "author": "SupaHotFlame",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ai6uw/what_should_i_do_with_my_week_off_before_starting/",
        "text": "Starting a new job shortly I will have a week off before I start. What should I do during my week off? Been feeling a bit down recently.  \n\n\n\\-Thinking about going to therapy for the first time, mental health has not been great recently so its something I definitely want to check out.   \n\\-New job gives me a generous work from home benefit. Thinking about maybe getting a new desk and chair. I'm a gamer so I already have a really good monitors/keyboard/mouse. Anything else I should use the work from home benefit on?  \n\\-Really need to find a better daily routine, I find myself skipping a lot of meals and not going to sleep/waking up when I want to.    \n\n\nAnything else I should use this week on? Don't usually get this much time off so want to make sure I utilize it as best as I can.",
        "created_utc": 1677212109,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is in your opinion the best city in the world?",
        "author": "RoundTurtle538",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ahnz5/what_is_in_your_opinion_the_best_city_in_the_world/",
        "text": "[removed]",
        "created_utc": 1677210455,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I go back to a master's degree largely so I can play lacrosse for my university?",
        "author": "Illuminati_721",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ahf96/should_i_go_back_to_a_masters_degree_largely_so_i/",
        "text": "[removed]",
        "created_utc": 1677209710,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m 48 and I live with my parents",
        "author": "Icy_Introduction8445",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ahakm/im_48_and_i_live_with_my_parents/",
        "text": "[removed]",
        "created_utc": 1677209335,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Power of Genuine Friendships: How My Authentic Connections Have Shaped Me into a Better Person",
        "author": "Ryuu_Orochi",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11ah266/the_power_of_genuine_friendships_how_my_authentic/",
        "text": "Friends play a vital role in our lives, they bring us joy, comfort, and support during tough times. But what happens when these relationships are not just based on convenience or common interests but on genuine feelings of care and respect? This is when we can see the true power of friendship.\n\nThroughout my life, I have been lucky enough to form a few authentic and organic friendships that have allowed me to grow and become a better person. These relationships have challenged me to be my best self, pushed me to step out of my comfort zone, and most importantly, provided a safe space for me to be myself.\n\nOne of my closest friends, for example, has taught me the importance of empathy and understanding. They have shown me how to listen, to be there for others, and to always try to see things from their perspective. This has helped me become a more compassionate and empathetic person and has improved not just my personal relationships but also my interactions with others in general.\n\nAnother friend has taught me the value of honesty and accountability. They have always encouraged me to be honest with myself and with others, even when it's difficult, and have held me accountable for my actions. This has helped me become a more responsible and trustworthy person and has also improved my self-esteem and confidence.\n\nLastly, I have a friend who has taught me the importance of self-care and self-love. They have shown me how to prioritize my mental and physical health, to take time for myself, and to celebrate my accomplishments. This has helped me become a happier and more balanced person and has also improved my relationships with others.\n\nIn conclusion, genuine and organic friendships have a profound impact on our lives. They provide us with a support system, challenge us to be our best selves, and help us grow and become better people. So, let's cherish these relationships and work to cultivate them, as they are truly invaluable.",
        "created_utc": 1677208622,
        "upvote_ratio": 1.0
    },
    {
        "title": "of course I can't be definitive and saying this but I'm a firm believer that humans have stopped evolving a long time ago",
        "author": "mjones4000",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11agv05/of_course_i_cant_be_definitive_and_saying_this/",
        "text": "[removed]",
        "created_utc": 1677208021,
        "upvote_ratio": 1.0
    },
    {
        "title": "Perception and Opinion",
        "author": "DreamAreReality",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11agloc/perception_and_opinion/",
        "text": "Is perception and Opinion the same. Like when talking to someone for the first time , whats the difference between how i precieve them vs my opinion of them. I don't understand what the actual difference between the two would be like how does perception not Fall in the same category as a opinion?",
        "created_utc": 1677207255,
        "upvote_ratio": 1.0
    },
    {
        "title": "I currently have an exact $XX00.00 account balance after bills and its tickling my brain.",
        "author": "cum_bubble69",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11aggsc/i_currently_have_an_exact_xx0000_account_balance/",
        "text": "[removed]",
        "created_utc": 1677206841,
        "upvote_ratio": 1.0
    },
    {
        "title": "if the 80's made a comeback, as well as in 40 years from now, this current decade, what will you do?",
        "author": "Ill-Candy-4926",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11age2n/if_the_80s_made_a_comeback_as_well_as_in_40_years/",
        "text": "if the 80's made a comeback in 2023,  and in 40 years years from now  this current decade,  what would you do?\n\nfeel free to voice your opinion below!",
        "created_utc": 1677206616,
        "upvote_ratio": 1.0
    }
]