[
    {
        "title": "Putting deposits down on appointments will make people who are ill feel forced to go in",
        "author": "thisisgarbage12345",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114y0eb/putting_deposits_down_on_appointments_will_make/",
        "text": "Maybe an unpopular opinion but I think that forcing people to put a non transferable deposit down for any sort of an appointment will make clients feel pressured to go in sick so that money isn’t wasted. \n\nI had two appointments today where I had to put deposits down and I woke up with a scratchy throat. I can’t afford to let almost 200$ fly out the window for no reason so I had to go in for both even though I’m feeling slightly unwell. I took a COVID test and it was negative but obviously going anywhere sick is not okay. I feel terrible but also slightly angry that I couldn’t reschedule for a different day without losing the money. Equally, I feel bad for small business owners who are forced to make clients put a deposit down because so many clients no-show. It’s such a lose lose situation. \n\nRandom thought of the day I guess.",
        "created_utc": 1676668967,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was your first date like with your S/O?",
        "author": "Honeysucklinhoney",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114ww7m/what_was_your_first_date_like_with_your_so/",
        "text": "Probably like a lot of people, me and my husbands “first date” wasn’t that at the time. I asked him out for pancakes at 10 pm and we spent like three hours in the parking lot talking. \nDid you have a real date planned? Or was it more like looking back on it you realized there was a point in time when hanging out turned into a date? Also how’d y’all meet? Sappy? accidentally?",
        "created_utc": 1676666152,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did anybody else while listening to the radio get a brief pause and then continued like normal but then paused again to a woman reading numbers out?",
        "author": "Spiritual-Clock5624",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114whcq/did_anybody_else_while_listening_to_the_radio_get/",
        "text": "I was in my car listening to music as usual and then everything cut off for like 30 seconds until the music came up again. And then a couple minutes later, the radio stopped again but a woman reading numbers was replaced this time and then after she stopped the radio started again. \n\nI’m fairly certain this isn’t normal because this is the first time I’ve ever heard this happen.",
        "created_utc": 1676665113,
        "upvote_ratio": 0.99
    },
    {
        "title": "Antidepressants are useless when triggers cause your mental illness to relapse",
        "author": "Fair_Organization898",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114w3ra/antidepressants_are_useless_when_triggers_cause/",
        "text": "No amount of medication is going to prevent my depressive episodes. That’s what mental illness is like. Once I get triggered into an episode, I go into a dark place for many months before coming back out. And my #1 triggers are stress, current events happening around the world and people (family).",
        "created_utc": 1676664145,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is UK culture closer to US culture or European culture?",
        "author": "Basic-Title4676",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114w2x7/is_uk_culture_closer_to_us_culture_or_european/",
        "text": "[removed]",
        "created_utc": 1676664093,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mayor of Kingstown (possible spoiler)",
        "author": "thatgirlsonfire",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114vxkm/mayor_of_kingstown_possible_spoiler/",
        "text": "I'm obsessed with this show! I wish there were more episodes. I'm super interested in bunny and Mikes relationship. I think bunny is such a badass too. I'm also wondering if Iris is just gone now or dead or if she'll be back. Anyone?",
        "created_utc": 1676663734,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dang, I’m 23f and I kind of really want kids",
        "author": "Basicb1tch00",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114vqmn/dang_im_23f_and_i_kind_of_really_want_kids/",
        "text": "[removed]",
        "created_utc": 1676663248,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is no one talking about the UFO?",
        "author": "Poddx",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114virm/why_is_no_one_talking_about_the_ufo/",
        "text": "[removed]",
        "created_utc": 1676662695,
        "upvote_ratio": 1.0
    },
    {
        "title": "In 90 days I'll turn 18",
        "author": "FakeButRealAsian",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114v56t/in_90_days_ill_turn_18/",
        "text": "And honestly? I'm petrified to \"become an adult\". I feel like my mental age capped back in 2020. I feel like I'm everything but mature and just... Feel kinda disappointed as well? \n\nI don't have had any glow up nor any \"stupid teen\" stories to tell. I do have friends but we're (or rather they are) a bunch of busy people. No drinking or partying, we're staying on the bright side haha (which I totally don't mind either! I'm grateful they're willing to give me a chance.) \n\nAnyone else turning 18 (or any other 'major' milestone) soon? How do you feel about it? \n\nOh, it'll also be in the mids of my (equivalent to) senior finals. So yayyy me",
        "created_utc": 1676661733,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have I been listening to music wrong all my life?",
        "author": "Ragadon5v2",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114v3mj/have_i_been_listening_to_music_wrong_all_my_life/",
        "text": "[removed]",
        "created_utc": 1676661622,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lockwood and Lucy have my heart (Lockwood &amp; Co - Netflix)",
        "author": "PammieLammie",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114uk6m/lockwood_and_lucy_have_my_heart_lockwood_co/",
        "text": "I love the show and I love their relationship. One of the best TV tropes and it's such an interesting concept. Great book adaptation and great soundtrack!",
        "created_utc": 1676660247,
        "upvote_ratio": 1.0
    },
    {
        "title": "went to watch pathan after drinking 180ml of vodka and worte this about a girl i liked ....should i become a poet or songwriter i really love frank ocean",
        "author": "Own_Schedule9561",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114ufsz/went_to_watch_pathan_after_drinking_180ml_of/",
        "text": "It's been a few months \nI went to movie not thinking about you\nI took a few sips thinking about how good the movie would be when you never even slipped my mind\nBut the first thought that went across my mind was what jt would be like if you would sit beside me instead of my bestfriend\nI would focus on you instead of king khan seeing the emotions the happiness the joy the sadness in your face goddamnnn i wish you sat beside me today\nI love my bestfriend but i love you more\nI never in my life would think i would cry over a girl even after months of not seeing her and not talking to her\nshid i must have a shitty mental health or maybe this girl was just magical \nBro how tf did i legit just cry in a movie theater thinking about her i must be so sad\nI wish i was a poet or someone who could expesss it much better \nIts just i have feelings for you\nOut of all the problems sadness and joy in my life the thing making me the most happy and sad is you\nI remember the first time you smiled at me it was the best day of my life \nGoddddd!!! It was like a dream i could not imagine it happen \nNow that i think of it it was the most contagious thing in my life",
        "created_utc": 1676659935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I go to my friends bday party?",
        "author": "starbucks-refresher",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114t6rc/should_i_go_to_my_friends_bday_party/",
        "text": "Pros:\n- it’s a joint bday party (close 2 friends)\n- a chance to see and spend a fun time with friends\n\nCons\n- it’s 11 at night which I feel is kind of late (prob end around 12-1) \n- I feel like I won’t miss much if I don’t go",
        "created_utc": 1676656814,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do I make up to my friend for being a temporary yet massive dick?",
        "author": "cresentcube",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114smvk/how_do_i_make_up_to_my_friend_for_being_a/",
        "text": "[removed]",
        "created_utc": 1676655398,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m so tired of gaming negativity.",
        "author": "that_one_hunter_main",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114skir/im_so_tired_of_gaming_negativity/",
        "text": "At this point, I can’t even look at the comments section of any game without seeing people making a sarcastic comment about how the game and the developer is horrible. I watched for months as the community of a video game I like has complained about the lack of content, and then as the new season was announced, complain that the new maps were reused content. As I can kind of understand that, it just makes me sad. What happened to getting on with the boys on a Friday night after a long week of work or school? Playing until 3 am and laughing your asses off? Getting really excited for a new update and what items or weapons it might bring?",
        "created_utc": 1676655236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clearing out student loans",
        "author": "bumblebigD",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114rnds/clearing_out_student_loans/",
        "text": "Hey guys just curious to hear your stories of how you managed to close your student loans. \n\nJust a background: I am now working off my bachelor's loan, planning to take up loans again for my master's. just put off by the huge amount and the grind again",
        "created_utc": 1676652957,
        "upvote_ratio": 1.0
    },
    {
        "title": "If I had to do life again, I would have chosen North Sentinel island.",
        "author": "awesome_pinay_noses",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114rlj4/if_i_had_to_do_life_again_i_would_have_chosen/",
        "text": "[removed]",
        "created_utc": 1676652841,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else forget how old you are? Especially after Covid restrictions?",
        "author": "CandidIndication",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114raek/does_anyone_else_forget_how_old_you_are/",
        "text": "I have to constantly remind myself that no, I’m not 25- I’m 27 this year. \n\nI had this issue last year as well.\nI can’t help but to feel like it’s some what related to the pandemic lockdowns we had? \nAlmost like I lost that time sitting in my house and now my brain doesn’t register that as 2 full years with I guess ‘landmarks’ such as my birthday or holidays. \n\nAny one else feel this way?",
        "created_utc": 1676652135,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does someone mean by referring to a certain group as \"The Cool Kids TM\"?",
        "author": "Beau_bell",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114pzwv/what_does_someone_mean_by_referring_to_a_certain/",
        "text": " Not necessarily high school or teen setting, could also mean apartment  complex, workplace, roommates, etc. anything like that at all. If  someone said this to you about a certain group of people, what would  your impression be?",
        "created_utc": 1676649813,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just listened to \"wildest dreams\" by Taylor swift. it's my first time listening this song and omg I'm going crazy 😭😭 .",
        "author": "Random_Girl_2004",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114pw52/i_just_listened_to_wildest_dreams_by_taylor_swift/",
        "text": "[removed]",
        "created_utc": 1676649663,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't get over my crush",
        "author": "Fafeed96",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114psxj/cant_get_over_my_crush/",
        "text": "I have a work crush and she is something else.\nMy day is always better when we talk.. The thing is we don't  work in the same department so we don't have reason to talk . It's usually when we are having lunch or at the cafe waiting for coffee. And I find myself always smiling when she looks at me or run into each other.\nShe smiles too! ( And it's a genuine smile not the polite kind ) but getting closer has been hard and I tried going on bumble hoping I'd meet someone but I keep swiping left on people..",
        "created_utc": 1676649546,
        "upvote_ratio": 1.0
    },
    {
        "title": "i just tried Chatgpt and i conversed with it for 1 whole hour",
        "author": "Novel_Might4270",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114pgua/i_just_tried_chatgpt_and_i_conversed_with_it_for/",
        "text": "Holy shit, the chatbot is really good (Not perfect but quite resembling human). And i could discuss so many topic which other people around me might not be interested in.",
        "created_utc": 1676649071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Break From The News",
        "author": "CognisantCognizant71",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114p1ls/break_from_the_news/",
        "text": "[removed]",
        "created_utc": 1676648487,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever been in a position where you had to choose a good career opportunity (money) over love?",
        "author": "OneLeftTwoLeft",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114ohol/have_you_ever_been_in_a_position_where_you_had_to/",
        "text": "[removed]",
        "created_utc": 1676647732,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone ever fully overhaul their wardrobe?",
        "author": "DarlingDevilPaw",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114o1f0/does_anyone_ever_fully_overhaul_their_wardrobe/",
        "text": "I'm genuinely curious if people just get whole new wardrobes when they feel their clothes have become outdated. The reason I got on this thought was due to my style recently changing. I've always just worn dark clothing. Jeans and shirts with a jacket on top. I didn't like to think about my outfits.\n\nNow I find myself loving the dark academia and bohemian clothing, but funding a whole new wardrobe would cost SO MUCH. Especially coming from someone who prefers thrifting and buying from second hand shops. It's wild.",
        "created_utc": 1676647111,
        "upvote_ratio": 1.0
    },
    {
        "title": "Baseball streaming",
        "author": "zillygooose",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114n94c/baseball_streaming/",
        "text": "What service do y’all use to watch baseball in the USA? \nI only have Roku streaming &amp; I really want to watch this season. I used FuboTV last year but it was kind of expensive and I only used ton for baseball so I felt like the large cost wasn’t very relevant to my needs.",
        "created_utc": 1676646026,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm too old for getting into music production AGAIN?",
        "author": "Ok-Clerk-8310",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114lopa/im_too_old_for_getting_into_music_production_again/",
        "text": "[removed]",
        "created_utc": 1676643790,
        "upvote_ratio": 1.0
    },
    {
        "title": "Old 8mm Movies",
        "author": "angryscout2",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114l1xr/old_8mm_movies/",
        "text": "[removed]",
        "created_utc": 1676642684,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend said he's never felt so special.",
        "author": "IamaLuna-tic",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114ktkj/my_boyfriend_said_hes_never_felt_so_special/",
        "text": "We're both in VERY strict parents, so we can't have a lot of dates, but we manage to sneak out every now and then. We've known each other for years, and we were best friends first, and now we're a couple, so we're really comfortable around each other. \n\nWe told each other that we loved each other two weeks ago for the first time, but I loved him way before then. \n\nFor Valentines day, I wrote him a letter that stated every single reason as to why I loved him. It was a lot of pages, and when I gave it to him he stared at it, then started tearing up. He kept staring at the paper, and wouldn't look at me. I said \"Um, do you like it? It was kind of rushed, im sorry...\" \n\nWhen he put down the letter (I shit you not it was like ten good minutes of silence as he stared at it) he just said \"I love you.\" and kissed me, and hugged me and kept kissing me. I was laughing and told him I loved him too. \n\n\"NO, but like I love you.\" \n\n\"Okay, I love you too.\" \n\n\"GOD I DONT HAVE THE WORDS RIGHT NOW! I love you.\" \n\n\"I love you too.\" \n\n\"You're so...\" then he grabbed the letter again. \"Shit, I've never felt this special. I don't think anyone ever written, LET ALONE SAID, this many nice things about me, ever. Fuck, I feel amazing. Thank you. Thank you. Thank you. I love you.\" \n\nI started crying because he looked like he wanted to but was holding it together, and he was so sweet. \n\nI FEEL AMAZING! that was yesterday. I cant stop smiling.",
        "created_utc": 1676642048,
        "upvote_ratio": 1.0
    },
    {
        "title": "COMPRE TUDO PARA SUA CAS OU ESCRITORIO",
        "author": "TATILENA",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114krcx/compre_tudo_para_sua_cas_ou_escritorio/",
        "text": "[removed]",
        "created_utc": 1676641870,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wear sweaters and jackets because they feel like hugs",
        "author": "aneenonico",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114kon0/i_wear_sweaters_and_jackets_because_they_feel/",
        "text": "I always wear jackets whenever I go outside even if it’s not cold. But recently, I’ve been wearing long-sleeved shirts or those thin sweaters when I’m at home. It’s not something that I do everyday, the reason why is because they feel like hugs. I rarely get hugs, my family doesn’t usually express their love through physical touch. My friends live far away so I can’t really hug them and a bunch of them don’t like hugs that much as well. I have no problem initiating a hug but I always tense up and get anxious if someone else touches me. Virtual hugs don’t really click to me either since… I can’t physically feel them so.\n\nSo yeah, jackets will do for now I guess. And plushies, I have a lot of them even as an “adult”. And pillows… oh well.\n\nWhen’s the last time you’ve hugged someone? Or the last time someone hugged you perhaps",
        "created_utc": 1676641651,
        "upvote_ratio": 1.0
    },
    {
        "title": "what was the moment that made you realize you want to marry your partner?",
        "author": "punkalution",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114kn0c/what_was_the_moment_that_made_you_realize_you/",
        "text": "[removed]",
        "created_utc": 1676641513,
        "upvote_ratio": 1.0
    },
    {
        "title": "Every IT person I spoke to called me stupid or ignorant when I suggested the fix to an issue they disagreed with.",
        "author": "DaAriP",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114k7cm/every_it_person_i_spoke_to_called_me_stupid_or/",
        "text": "My internet provider installed a new wireless modem and after that my computer continually had the blue screen of death (tcp/ip sys failure) at least once if not a dozen times a day and my printer could no longer be found on the network (even after properly connecting it to the new modem/router). \n\nI reset the tcp/ip and reinstalled the printer driver to no avail. I asked many techs to help me out and suggested looking into the modem software because i never had the issue until the modem was changed. but every one of them insisted the issue is with my computer and that the internet had nothing to do with the issue. So after a year of frustration I bought and installed another router as an access point and guess what! The error is now fixed. I can print again and the tcp/ip and bad pool caller are no longer an issue. \n\nI just wish I could understand why so many people dismiss my ideas on a lot of topics and just treat me like I’m stupid.",
        "created_utc": 1676640188,
        "upvote_ratio": 1.0
    },
    {
        "title": "Everyone knows you should respect veterans who don’t want to talk about the war….",
        "author": "Texasmucho",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114k1u7/everyone_knows_you_should_respect_veterans_who/",
        "text": "unless you were me as a kid.  As a result of repeatedly asking my great grandfather about WW1, he told me a few things he never told anyone.  \n\nHe told me over and over that war was Hell, and he hoped that the good Lord would accept him when he died.  I would say “That’s great! What happened!” \n\nNow I understand that he was in pain, but maybe my youthful ignorance helped him talk about it.  It wasn’t easy, he only told me a few things, but what he did tell me I never forgot.  \n\nHe fought in Europe in the trenches.  The fighting was very bad.  At one point he was MIA for a while until he was found again. \n\nI’m going to add recollections in the comments.",
        "created_utc": 1676639718,
        "upvote_ratio": 1.0
    },
    {
        "title": "hello everyone, i am Tom and i am here to talk about...my friend",
        "author": "bigman0602",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114j332/hello_everyone_i_am_tom_and_i_am_here_to_talk/",
        "text": "I was pretty strange kid in my childhood (though i am 15 now) because my parents weren't educating me about socialization. I met a lot of people on the internet, caused many and many things, created tens if not hundreds of accounts....But one day i met my best friend: Niko. He was from saudi Arabia and was 2 years older than me(when me met each other he was 14). He was pretty chill and cool person so we became friends really quick. We talked alot about everything, he was very good at english in comparison with me(Cuz i am serbian). And one day he gone offline for 33 days. I was worrying, was spamming and etc just to see at least him writing \"Hi\". It was painful 33 days of my life. But he returned... with bad news. He wrote this \"Oh hi Tom, sorry for not being online...i had problems with my health. We can play tomorrow\". I was hyped! But then next day he writes this \"Hello Tomathy. I know you missed me, i missed you too, but i have very bad news for you. I have brain cancer, and my tumor was growing this month. I really liked to talk and play with you. You're truly the very best friend i ever had. I want you to create a video on my channel when i am gonna be dead. I am so sorry to tell you, but if i wouldn't tell you, you would be more sad. Thank you again\" and then he sent me his gmail and password. When i first saw this message i was sad...no...i was terrified. I was crying, crying a lot. After several days i got a call from his parents. They said that his son telled them to call me when he gonna die. I was shocked when they said \"Muhammad Shareef said to us to call you\", because I didn't know that his name was Muhammad and not Niko, like he told me. I listened to them carefully anyways and after they hung up...i was terrified. My one and beloved friend, the very best friend has died. I was in total shock. I...I didn't make the video about his death that i promised to do. This happened 4 months ago. I am still in shock of what happened. My very best friend, Muhammad Shareef, rest in peace in heaven, I will never forget you",
        "created_utc": 1676636574,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I contact my dead moms best friend after 10 years of no contact?",
        "author": "swedeinsuede",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114ipw8/how_do_i_contact_my_dead_moms_best_friend_after/",
        "text": "My mom died of cancer in 2012, when I was 19. She had one best friend who used to spend  time at our house when I grew up. She was a single mom and liked to come to our house in the summer with her son. \nWhen my mom died in 2012 I had some contact with her for a few months, and then nothing. Me and my family was struggling to cope with the loss of mom and I kind of forget about her best friend.\nA few times a year she comes to mind, but now I really want to contact her! I miss her and I want to know how her life is. I still have her number but I have no idea what I should write to her after all this time! Or should I call her? I'm scared it's gonna be awkward...\nAny suggestions?",
        "created_utc": 1676635302,
        "upvote_ratio": 1.0
    },
    {
        "title": "New year's resolution that you a actually kept.",
        "author": "Lifesaver693",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114hmdl/new_years_resolution_that_you_a_actually_kept/",
        "text": "[removed]",
        "created_utc": 1676631662,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does she like me?",
        "author": "FagitoLord",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114h6e0/does_she_like_me/",
        "text": "For lunch today i stopped at DeliDeluca to get a burger. \nIn the counter there was this cute girl who was smiling at me and asked me wierdly alot of questions about my burger. \nI said thanks and said il just sit over there til its done. \n\nWhen she was making it i was her peeking at me like 10 times, then i saw her walking over to me, she stoped behind an isle and took a breath and walked over to me and gave me my burger(smiling like crazy) i told her «wow you braught me the burger, thats good service!» (They dont bring the food to you at this place) she smiled and giggled then a walked out. \n\nI came out of a rly bad relationship 3 years ago and i havent dated since, and i am rly nervous about dating again. My past relationship didnt end very well and now i dont trust any girl. \n\nDid she come on to me or am i delutional??",
        "created_utc": 1676630803,
        "upvote_ratio": 1.0
    },
    {
        "title": "does anyone else feel like they are the friend who has to put the effort in?",
        "author": "Natamalie",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114gd6x/does_anyone_else_feel_like_they_are_the_friend/",
        "text": "Checking in with family and friends, initiating a meet up, family get togethers, friend dinners, all that stuff. \n\nI am generally extroverted I know but I feel and have seen if I don't put in the effort people don't initiate contact with me. Even my parents and siblings! \n\nIt's not that I don't feel as though they don't care about me. It's more that I feel a bit like some aspects are one sided. It's odd! \n\nAre you the effort friend? Or are you more likely to hang back and wait for people to contact you? I'd love to hear your take!",
        "created_utc": 1676629227,
        "upvote_ratio": 1.0
    },
    {
        "title": "COMPUTER ASSISTANT (TITLE 32)",
        "author": "ExtensionDrama7945",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114gay0/computer_assistant_title_32/",
        "text": "[removed]",
        "created_utc": 1676629110,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm a nanny, a teacher, a neuroscience MA, an artist, a model and a performer. AMA.",
        "author": "SHybrid",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114fzhe/im_a_nanny_a_teacher_a_neuroscience_ma_an_artist/",
        "text": "[removed]",
        "created_utc": 1676628506,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm a nanny, a teacher, a neuroscience MA, an artist, a model, a performer, a cook and head of a medieval reenactment group. Pretty much no one has a clear picture of all the things I do, including myself sometimes.",
        "author": "SHybrid",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114fvjs/im_a_nanny_a_teacher_a_neuroscience_ma_an_artist/",
        "text": "[removed]",
        "created_utc": 1676628171,
        "upvote_ratio": 1.0
    },
    {
        "title": "I dunno about the rest of the world...",
        "author": "mandux2017",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114fvgh/i_dunno_about_the_rest_of_the_world/",
        "text": "But in my country it was only a couple years ago we were a nation of amateur epidemiologists. Now its become obvious we've turned into a nation of amateur meteorologists. Myself included.",
        "created_utc": 1676628163,
        "upvote_ratio": 1.0
    },
    {
        "title": "Administrative Assistant Support [OA] Apply Online 2023",
        "author": "ExtensionDrama7945",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114fjlz/administrative_assistant_support_oa_apply_online/",
        "text": "[removed]",
        "created_utc": 1676627028,
        "upvote_ratio": 1.0
    },
    {
        "title": "Simping",
        "author": "babygehem",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114eql8/simping/",
        "text": "[removed]",
        "created_utc": 1676623602,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know or do \"sleep calls\"?",
        "author": "danny14lim",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114ejiw/does_anyone_know_or_do_sleep_calls/",
        "text": "Before I explain what is a sleep call, let me give a backstory to my past. I will try to summarize it as good as I can, sorry if it is too long.  \n\n\n4 years ago, I got cheated twice by 2 ex GF in different timeline. Which caused phobia and trauma to me, because I got cheated in a row. After all this, pandemic happened and took a huge toll and damaged on me that already going through a lot. All these causes me to lose sleep and kinda lost my mind. I find many ways to find back my sleep until eventually I found out that rain sound help me sleep. Until today, I have been using this way to sleep, I have tried to remove it and sleep normally, but I could not. Then one day, me and my close friend talking in calls and end up sleeping. The next day I was surprised because I was able to sleep. I think one of the main reason is that there was someone with me in the call, and it gives me comfort and secure feeling that led to me able to sleep without any issue.\n\n&amp;#x200B;\n\nBasically for me, sleep calls is like both people call then they can talk, or one person sleep-another person company or both also sleep together. Because no matter what the other person do or make any noise, i don't mind it and i able to sleep because knowing someone with me while sleeping give me comfort and secure feeling. It's almost like you're cuddling and hugging someone to sleep, but in calls and far away. Sleep calls with someone really helps me a lot and able to go through many things because of it.\n\n&amp;#x200B;\n\nBut it is so hard to find someone to sleep call without they thinking it's weird or I don't know if people think the same or not. Plus, most of my friend is from another country, so our timezone is very different. But can you guys let me know, is it only me that is like this and weird. Or any of you know and does this too? Sorry if i said anything wrong or my grammar/English is bad. Thank You.",
        "created_utc": 1676622766,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm tired of consuming so much but creating nothing",
        "author": "ilovebeingreplaced",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114ecnh/im_tired_of_consuming_so_much_but_creating_nothing/",
        "text": "[removed]",
        "created_utc": 1676621969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blog name suggestions",
        "author": "Thereluctantwriter",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114ec13/blog_name_suggestions/",
        "text": "Hey folks, I am writing a blog that dabbles in various topics and I am trying to find a good witty title for it. I want something that has the word curious or curiosity in it. I would really appreciate if anyone could help me with it.\n\nRight now the only thing I have in mind is “Cultivating Curiosity”",
        "created_utc": 1676621892,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone suggest a good witty name for a blog with the word curious/curiosity in it?",
        "author": "Thereluctantwriter",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114eav2/can_anyone_suggest_a_good_witty_name_for_a_blog/",
        "text": "[removed]",
        "created_utc": 1676621758,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does one get over anxiety when things dont seem to be working out well",
        "author": "Tendai_Loui",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114dw1h/how_does_one_get_over_anxiety_when_things_dont/",
        "text": "[removed]",
        "created_utc": 1676620103,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's finally settling in, I start my new job tomorrow.",
        "author": "KenboSlice786",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114dvy6/its_finally_settling_in_i_start_my_new_job/",
        "text": "I honestly don't know how exactly to feel. I'm excited, and sad at the same time.\n\nFor some background I've worked at the same restaurant for 13 years and started out as a dishwasher and have been serving and bartending for the last 10 years. My sisters boss is opening a new restaurant and it's just all nice craft beer (which is something I am passionate about) and good bar food. She offered me a job right out the gate and I took it on a whim because I felt like I needed a change.\n\nMy previous job was and will always be my home. I have learned so much and have made so many good friends there, hell my best friend is the head chef there.\n\nOf course, I told me I will fill in when I am able to, but it's weird to think I won't really be there anymore.",
        "created_utc": 1676620093,
        "upvote_ratio": 1.0
    },
    {
        "title": "My fiancé gave me the wedding ring on Valentine's Day!! I'm so happy!!!!1!",
        "author": "Elena_1966",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114dd52/my_fiancé_gave_me_the_wedding_ring_on_valentines/",
        "text": "Happier than I should be... eh whatever, I'm 56 and it's my first ever real relationship.\n\nI don't have hands so cannot wear the ring normally. He gave me a necklace. I thought it was very pretty.\n\nHe said \"Open it!\" with a very serious but happy tone. I used a piece of paper to wedge the two parts of the charm apart, only to find a ring encrusted with beautiful diamonds. I'M SO HAPPY!!! It was of course 3 days ago but I'm still happy!\n\nWedding is in 18 days",
        "created_utc": 1676617993,
        "upvote_ratio": 1.0
    },
    {
        "title": "Non-family based phone plans",
        "author": "Purple_rain_cloud",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114d2rl/nonfamily_based_phone_plans/",
        "text": "[US Specific] People who have no family/friends to share a phone plan with, what kind of plan do you currently have?\n\nFor context, I am looking for a plan with decent data and unlimited calling + text without breaking the bank😤. I currently use an At&amp;t prepaid plan, but I'm thinking of switching over due to data constraints.",
        "created_utc": 1676616914,
        "upvote_ratio": 1.0
    },
    {
        "title": "There’s a raccoon on my roof…",
        "author": "aresbravo07",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114c6om/theres_a_raccoon_on_my_roof/",
        "text": "So I’m having a fun night. Heard some noises, thought nothing of it. Then realized it sounds like footsteps and something tearing something up. I went outside to find a massive raccoon on my roof (2nd story) and he’s torn up some shingles. It’s currently just chilling at the top of my roof not really doing anything. Apparently there’s no emergency service animal control here in town so I’m at a loss as to what to do… I thought about shooting it with a crossbow but that seems wildly overkill.",
        "created_utc": 1676613622,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I get over the fear of my parents dying ?",
        "author": "medico-dingo",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114bz4r/how_do_i_get_over_the_fear_of_my_parents_dying/",
        "text": "I'm a 17 year old living with my parents as of now . Long story short, untill I was 13 I used to live my cousin in the city and my parents had their medical practise in a rural setting. They used to travel 250 miles every four days to just meet me and spend a couple of days. When I turned 13 my parents decided to move to the city to spend some time with me ( I'm their only child ) and the country I live in it's very difficult to start a new medical practise from scratch so I think they are still not making what they used to do before. \n\nMy mum is so attached to me that she never leaves me alone . From still tucking me to bed every night  and giving me a glass of water while I'm studying etc..I'm so much attached to my parents. that the fear of losing them breaks me into pieces. I've disappointed them many times in the past and still I can't figure out how to do better in life . So much sacrifices they've made for me both financially and mentally and here I am not coming up to their expectations. Even then they're always cheerful and never let me know that they've faced a lot of problems because me whether it was me being a pre-term child ( 7th month ) to not scoring good in a very important exam. \n\nAll of these combined. I've recently started to have worrisome thoughts of losing them ( especially my mum). Just a snap of this thought and I start crying like a baby in just a couple of seconds. \n\nPS : English isn't my first language so pardon me. Any advise would be appreciated. Thanks for your time stranger.",
        "created_utc": 1676612857,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just drank and ate for free at the bar",
        "author": "tattedintrovert",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114bw1y/just_drank_and_ate_for_free_at_the_bar/",
        "text": "So I went in and ordered my usual 805 on tap with the usual bartender that works when I use to go once every blue moon with my lady friend and roast each other all night. It isn’t very often I go out drinking lately because the cost of just trynna stay alive fuckin sucks. He doesn’t ask me for payment or if I wanna keep my tab open which is whatever, even though I’m watching him ask everyone else. Four 805s and an order of onion rings later I remind him “hey bro, I never gave you my card”. He’s says “yeah I know you, don’t worry about it give it to me after.” We start chattin and shooting the shit and I find out this is his last shift and I ask him for a shot of tequila and the tab (shot because it’s cold af outside and I gotta walk home). He rang me up for the 3$ shot only. The shit bag part of me wanted to walk out and pretend everything is Gucci, but my conscious took over so I asked asked him for the actual tab for everything I ate and drank that night and and he said “wtf you talking about you good to go, you see the pen in front of you? You’re all set I got you already.” And then he gave me another shot on the house.” Bless him. I’m faded af. Have a blessed evening everyone.",
        "created_utc": 1676612546,
        "upvote_ratio": 1.0
    },
    {
        "title": "How important are friends in high school?",
        "author": "mythicat_exe",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114bibr/how_important_are_friends_in_high_school/",
        "text": "I'm currently in my 2nd semester in grade 9, and haven't really had an irl friend since grade 6 (I have a few online friends). I recently moved to a smaller town, with MUCH less people than my old city. There are pros, such as more breathing room, and stuff, but the cons are, well, friends. Everyone in my school either knows eachother since early elementary school, or by family (cousins, family friends, etc.). I am a fairly shy person, and don't talk at all in school, and I'm getting over 90's and almost 100's in all my classes so far. Is having a friend important in high school, such as for help (not only homework, but decisions and stuff), support, and stuff? I'm not sure whether or not I should push my self to get in with friends, or just stick with my few online friends. I'm sorry if this post does not make sense, I'm sorry.",
        "created_utc": 1676611204,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do American women these days really only want the top 1% men?",
        "author": "imareallifehobbit",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114bg0v/do_american_women_these_days_really_only_want_the/",
        "text": "There's been stuff all over youtube about this. Almost everyone (including experts) are saying that American women's expectations are getting so insane and unreasonable and they make it seem like they all only want 6 foot tall millionaires. Which is the 1% of men or less. Just wanted to see what you guys thought about this. Especially the ladies out there. Do you feel like you're being unfairly represented?",
        "created_utc": 1676610987,
        "upvote_ratio": 1.0
    },
    {
        "title": "Everyone on Earth is an asshole.",
        "author": "Audie_Studios",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114b805/everyone_on_earth_is_an_asshole/",
        "text": "Every single existing human on this planet seems to be a huge pain in the ass. I have a dream to publish a sandbox game that I'm making, and it hopefully gets popular. People mock me, and treat me like an asshole for being myself. It makes me hate upset with myself. It makes me want to throw everything I've done, all this progress I've made with this game away. Its not just this. I do other things I like, for example, writing. It seems like  all people want to comment about it, wether it be online or in person, is \"Ain't readin allat 💀💀\" or \"kill yourself you're a waste of oxygen\". Comments like these make me want to end it all. Why would you even say this? What twisted, horrible person do you got to be to say that kind of shit?\n\n\nPeople like these, actually, people in general, humanity itself, makes me wonder questions about myself. It makes me think; will anyone ever like me? Am I a \" ok\" person in this world? It makes me refuse to believe anyone would like me. Why is everyone so fucking rude?",
        "created_utc": 1676610224,
        "upvote_ratio": 0.99
    },
    {
        "title": "Is there going to be a world war, or even bigger?",
        "author": "mythicat_exe",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114b4uc/is_there_going_to_be_a_world_war_or_even_bigger/",
        "text": "[removed]",
        "created_utc": 1676609973,
        "upvote_ratio": 1.0
    },
    {
        "title": "Birthday party",
        "author": "Taplinnn",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114azek/birthday_party/",
        "text": "[removed]",
        "created_utc": 1676609464,
        "upvote_ratio": 1.0
    },
    {
        "title": "I turned 21 today",
        "author": "qazwsxedc000999",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114at34/i_turned_21_today/",
        "text": "Hello!\n\nI have turned 21 today. In the U.S. that’s a pretty big deal and stuff. Legal drinking age and all. It’s almost midnight so technically it’s almost not my birthday, but that’s okay.\n\nI’m a college student, and I’ve been working really hard toward getting my degree. I’ve finished my minor but not my major yet, but both are in kinda boring topics so I don’t talk about it much.\n\nI dunno. I’m a business major (MIS: Management Information Systems) so I feel like a super boring person. My minor is in Graphic Design. When I say “business” major I really just mean in the college of business, which is a section under my University that deals with anything from Aviation to Healthcare Management. I really enjoy my major but it’s kind of a boring topic.\n\nBottom line is, it’s my birthday and I feel like a super average person. There’s not much to celebrate but I’m still happy about it.",
        "created_utc": 1676608879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sciency discussion: Let’s talk about the psychological/neurological effects of long term repetitive mindless activities/work.",
        "author": "KPal93",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114apow/sciency_discussion_lets_talk_about_the/",
        "text": "[removed]",
        "created_utc": 1676608557,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s are currently perusing and how did you reach there?",
        "author": "No-Camera389",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114aoa3/whats_are_currently_perusing_and_how_did_you/",
        "text": "We always start things in the mind of ending it somewhere where we dream of but we end up in the wrong place initially, later we aberrant and reach our passionate dreams. \nI stared with bachelor of engineering course , perused masters in web development and currently an entrepreneur.\nThis is how life changes!",
        "created_utc": 1676608421,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Sciencey” discussion: What are your thoughts about the potential neurological and psychological effects of mindless, monotonous activities/work long term?",
        "author": "KPal93",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114ahz3/sciencey_discussion_what_are_your_thoughts_about/",
        "text": "[removed]",
        "created_utc": 1676607839,
        "upvote_ratio": 1.0
    },
    {
        "title": "Colleting Traumas",
        "author": "MP4GALAHAD",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1149wr2/colleting_traumas/",
        "text": "[removed]",
        "created_utc": 1676605908,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are you go to cry songs?",
        "author": "3angle83",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1149qf3/what_are_you_go_to_cry_songs/",
        "text": "Gonig through a funk and hav ing a few drnks. Most people drunk text their ex girlsfrineds, but I liek to listen to songs and cry it out, so it hit me with yoour best! (or wosrt)",
        "created_utc": 1676605327,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you do when you sincerely aren’t sure that you’ll be able to get another boyfriend?",
        "author": "adepressedgoddess",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1149hzl/what_do_you_do_when_you_sincerely_arent_sure_that/",
        "text": "[removed]",
        "created_utc": 1676604594,
        "upvote_ratio": 1.0
    },
    {
        "title": "Based vs Biased",
        "author": "bfangwoof",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1149h0e/based_vs_biased/",
        "text": "[removed]",
        "created_utc": 1676604500,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lonely in love, but who cares. Right?",
        "author": "SpareMeMyLife",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1149d5k/lonely_in_love_but_who_cares_right/",
        "text": "[removed]",
        "created_utc": 1676604153,
        "upvote_ratio": 1.0
    },
    {
        "title": "As of Tomorrow I will be out of two payday advance debts.",
        "author": "ProtocolPro23",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11499vy/as_of_tomorrow_i_will_be_out_of_two_payday/",
        "text": "Finally got myself out of a payday advance loop worth $1000.\nNever again!\nThose loans are so predatory. I have been working slowly and surely to erase all my debt. There are still a lot of things left but last year I paid off 5 credit cards/store cards (I know I know) and now just got rid of these two payday advances.\n\nWorking slowly and surely to not owe on anything revolving. \n\nMy goal is to be totally debt free except student loans by August 2024!",
        "created_utc": 1676603874,
        "upvote_ratio": 1.0
    },
    {
        "title": "Had one of the best days ever today!",
        "author": "themildenthusiast",
        "url": "https://www.reddit.com/r/CasualConversation/comments/114956g/had_one_of_the_best_days_ever_today/",
        "text": "I  was feeling stressed initially this morning due to life stuff.  I was able to drop my 2 boys with my dad for the afternoon and have an impromptu therapy session (due to a cancellation), followed by an hour walk with my best friend. She then offered to pay for my manicure and pedicure if I went with her! So of course I went. After that I leisurely went to the gym for 30 minutes and did a 10 minute hydro massage while i playing mediation music. Just felt good to have a self care day and to de-stress.",
        "created_utc": 1676603477,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with a moody person who can’t communicate",
        "author": "jem_jem_",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1148zcq/how_to_deal_with_a_moody_person_who_cant/",
        "text": "I’m a 25M and I’m in a talking stage with this girl, well we don’t have any label yet, so we met last October via friends of friends and we hit it off since then. We go on nightouts, road trips, beach, eat outs, listen and sing to old hits together, even brought her at my place and all that. But after 2 months of knowing her, she showed her true colours of being moody and being poor at communicating. She has this habit of she’ll just be out of mood of nowhere, will put out an attitude and won’t tell you why. Yes, I’m the happiest man whenever we’re together but I get tired too, like why not communicate like a fucking adult for crying out loud. Thinking of just ending things with her",
        "created_utc": 1676602996,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I take my dogs for a walk?",
        "author": "mullethefish",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1148qou/should_i_take_my_dogs_for_a_walk/",
        "text": "[removed]",
        "created_utc": 1676602288,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am CC",
        "author": "cecitorres",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11481ji/i_am_cc/",
        "text": "# I would like to introduce myself out of mannerisms and courtesy\n\nI am 4 a 3rd yr college student I am single I read tarot cards for free and do energy healing not for profit. I am a light and love believer and have a positive out look on life looking for friendly innocent conversation.",
        "created_utc": 1676600185,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi",
        "author": "cecitorres",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1147xpj/hi/",
        "text": "[removed]",
        "created_utc": 1676599864,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible my neighbor may judge where I live?",
        "author": "shittbuckets",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1147wjs/is_it_possible_my_neighbor_may_judge_where_i_live/",
        "text": "My neighbor brought my family some ground beef today. Prior to this he has never seen my home before, he has lived here for a year. I am worried since he came inside my home, he may make fun of what I have with his housemates/ coworkers or that he may think differently of me and my family as less than him. He has this big house with a pool and a guest house. He is kind of handsome however we both live differently. He is very accomplished and my family is not, it’s like he is on top and we are on the bottom.",
        "created_utc": 1676599773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sometimes you do nothing wrong and it still doesn't work",
        "author": "Wolfxtreme1",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1147u0h/sometimes_you_do_nothing_wrong_and_it_still/",
        "text": "So about a month ago I started dating this girl, extremely beautiful woman, patient and smart. Throughout this last month we've been trying to see where things go, I supported her on some of her issues and she did so in mine. We were finding our own way for things to workout and today I got the words \"I should and I want to feel more but is not there\", so I offered to take a step back off all this and see things with perspective, having some space because she thinks of me as a great friend that she doesn't want to lose. The things is, I don't see things that way, and I think it is more usual than it seems. Not being on the same page can be a B\\*, I have hope that this break will give a much needed perspective for a better prospect in a relationship, although I would be sad if it isn't so, nothing much I can do... We did everything right, we understood each other and we accepted each other. Sometimes you make no mistakes, and still fail... That is life",
        "created_utc": 1676599557,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was hoping someone can explain gaslighting",
        "author": "OutdoorzExplorerz",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1147tqh/i_was_hoping_someone_can_explain_gaslighting/",
        "text": "I went from never hearing it, to hearing it every day. The context seems to change a lot, which makes me think that it means different things to different people. \n\nI just googled it, and it said the following: “Gaslighting is a manipulative tactic in which a person, to gain power and control of another individual, plants seeds of uncertainty in another person's mind. The self-doubt and constant questioning slowly cause the individual to question their reality.”\n\nYet, I think I’ve seen people use the term to describe anything someone says that they feel is over the line. \n\nAm I correct in my assessment that the term seems to have different meanings depending on who is using it?",
        "created_utc": 1676599535,
        "upvote_ratio": 1.0
    },
    {
        "title": "Haven't written for fun in 4+ years. For the past week, I've managed a chapter a day across three different works.",
        "author": "earthwulf",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1147fps/havent_written_for_fun_in_4_years_for_the_past/",
        "text": "Working on some Kindle Vella projects. Feels good to be writing again, like finding a long lost friend. When I bring it up to friends and family they are indifferent at best, so I just wanted to share.",
        "created_utc": 1676598382,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I get scared when I do this?",
        "author": "CompetitiveBike653",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1147832/why_do_i_get_scared_when_i_do_this/",
        "text": "Is it weird that I get scared whenever I jump up and down while looking at the night sky? (This is only at night, and when jumping up and down) I do this sometimes to thrill me, but it usually just ends up with me running back inside in fear. \n\nAnd Is this just me?",
        "created_utc": 1676597748,
        "upvote_ratio": 1.0
    },
    {
        "title": "I keep letting him hurt me",
        "author": "Scary_Dog_5626",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11470op/i_keep_letting_him_hurt_me/",
        "text": "For context I’m 20 f and he is 19m i am currently pregnant by my bf but its been a living nightmare all he does is lie and text other females but try to blame it on me. I try changing my mood for him everything. Hold back my feelings saying im fine after every argument but whole time im falling deeper and deeper into depression and feelings for him is no more but my heart keep telling me he is going to change.",
        "created_utc": 1676597140,
        "upvote_ratio": 1.0
    },
    {
        "title": "I accidentally told my interviewer I cured covid.",
        "author": "alcoholicker",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1146vil/i_accidentally_told_my_interviewer_i_cured_covid/",
        "text": "Had a job interview and I was out of my mind tired. She asked me what my best accomplishments were. I told her very seriously I cured covid. What I was trying to say was I beat covid in a personal capacity accomplishment.",
        "created_utc": 1676596725,
        "upvote_ratio": 1.0
    },
    {
        "title": "My flat mates cook for me when I don’t have much to eat",
        "author": "lmao_3",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1146tcw/my_flat_mates_cook_for_me_when_i_dont_have_much/",
        "text": "It’s so nice and they’re really nice people. But I feel so bad. It’s not that I don’t have money I just don’t cook often because my course is kinda hectic and I don’t really know a lot of cooking so every now and then when I’m making myself some food in the kitchen and my flat mates are there too, they make some for me as well. I appreciate it a lot but I don’t know how to pay them back for it. My cooking isn’t particularly great. How do I show my appreciation? I always say thanks and how much I appreciate it, I’ve even tried turning it down a few times but they’re too nice.",
        "created_utc": 1676596547,
        "upvote_ratio": 1.0
    },
    {
        "title": "Practice conversation",
        "author": "gilk_agundez16",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1146stk/practice_conversation/",
        "text": "I have a job interview next week, I'm looking where I can have a conversation in English as I haven't practiced in a while. What do you guys think are my best options. A simple google didn't help much this time.\n\nI don't need any technical conversation. I like movies, videogames, sports and such things. \n\nI've head of apps. But, most of them are wellness apps not for chat. Is there anywhere else in reddit I should look for?\n\nIs twitch a right idea? I'm in my 30's, but feel old for new technologies/social apps. \n\nAny help is appreciated",
        "created_utc": 1676596507,
        "upvote_ratio": 1.0
    },
    {
        "title": "where to chat?",
        "author": "gilk_agundez16",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1146mzn/where_to_chat/",
        "text": "[removed]",
        "created_utc": 1676596038,
        "upvote_ratio": 1.0
    },
    {
        "title": "Y'all - can we just talk about ChatGPT and how crazy it is?!",
        "author": "Scared-Currency288",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1146849/yall_can_we_just_talk_about_chatgpt_and_how_crazy/",
        "text": "I tried it for the first time, just a few minutes ago.  I fed it a short story (bullet points) really, of a movie script I wanted to write, and asked if it'd write one for me.  The first round was good but got cut off abruptly.  The second try... I had chills up my spine!  Not going to lie, there was something to validating about seeing my story come to life right in front of my eyes, because the AI understood my message/why I was trying to convey.\n\nI almost can't believe this is real.\n\nHas anyone else have a great moment with ChatGPT that they'd care to share?",
        "created_utc": 1676594837,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever wanted to know anything about Medellin, Colombia? Here's your chance",
        "author": "Potential-Bike2",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1145li1/have_you_ever_wanted_to_know_anything_about/",
        "text": "I'm a 31 yo girl from Medellin that likes to share experiences and conversations. I've lived almost all my life here (except for a couple of months that I lived in Madrid, Bogota and NYC).\n\nDo you want to ask me anything about this place or our lives here?",
        "created_utc": 1676593060,
        "upvote_ratio": 1.0
    },
    {
        "title": "I really really really need a cat",
        "author": "kaibabill0",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11457ob/i_really_really_really_need_a_cat/",
        "text": "[removed]",
        "created_utc": 1676592028,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got to watch my cat get spayed!",
        "author": "the-sleepy-elf",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1145768/i_got_to_watch_my_cat_get_spayed/",
        "text": "I work in reception at a vet clinic so unfortunately don't get to see the surgeries which is one of my passions. I've processed plenty of records and doctors notes for our spays but I don't get to actually see the procedure. \n\nBut our doctor let me watch as she performed my own kitten's spay today. Even though it was quick and over in the blink of an eye it was the first time I actually got to see a surgery done in real life and not just recorded video!\n\nIt was so cool. Probably one of the coolest things I've seen. I'm super happy I was given the privilege of watching.",
        "created_utc": 1676591997,
        "upvote_ratio": 1.0
    },
    {
        "title": "where you chatting from...???",
        "author": "kaibabill0",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11456gz/where_you_chatting_from/",
        "text": "[removed]",
        "created_utc": 1676591938,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't imagine being so attractive that I'd find people coming on to me annoying",
        "author": "nekolalia",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1144yxm/i_cant_imagine_being_so_attractive_that_id_find/",
        "text": "I always hear about women finding sassy and clever ways to get rid of all the irritating dudes who keep hitting on them, and it just reminds me that I must be ugly af because nobody ever hits on me. If I get a compliment of any sort from any person, I'm always super flattered. \n\n(I am married btw, but I don't count my husband or past partners who I pursued first, I'm talking about strangers.)",
        "created_utc": 1676591369,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parents, gush about your kid below. When was the first time your kiddo made your heart melt?",
        "author": "raptoraptorr",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1144rl1/parents_gush_about_your_kid_below_when_was_the/",
        "text": "I’ve been in a real shit mood this week and nothing makes me feel happier than parents talking about their kids. That right there is pure love ❤️",
        "created_utc": 1676590842,
        "upvote_ratio": 1.0
    },
    {
        "title": "girl stares at me for 3 months",
        "author": "UwUnicornGirl",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1144m1j/girl_stares_at_me_for_3_months/",
        "text": "[removed]",
        "created_utc": 1676590423,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am watching Atypical on Netflix (my mental health english course teacher has been playing eps for us from time to time.) I’m enjoying it",
        "author": "adepressedgoddess",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1144jou/i_am_watching_atypical_on_netflix_my_mental/",
        "text": "I’m really liking it. I’m about to start on episode 4. I may actually just end up spending the majority of today watching it. I’m really liking the show, I didn’t even realize Jennifer Jason Leigh is in it (she looks pretty different!) I can’t believe there are four seasons",
        "created_utc": 1676590251,
        "upvote_ratio": 1.0
    },
    {
        "title": "tipping takeout....",
        "author": "hashtagperky",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1144aa3/tipping_takeout/",
        "text": "Then I go in to pick it up. Why do all these different locations... not just Domino's but every damn pizza place.... when I go in to carry out... make me sign a receipt with a big TIP section? I don't get it. I specifically wrote $0 tip online when I paid immediately. \n\nBut now they make me play the weird game of looking like an ass and writing $0 and signing it off.\n\nSeems every pizza place does it besides Domino's.\n\nI'm doing carry out. I'll tip if I do delivery or eating in, but I'm not tipping carry out. \n\nOnline Pay needs to end at online pay. I've ordered online for pickup and paid other restaurants too. They don't make me sign a receipt with a tip section. It seems pizza places are the only ones that do it.",
        "created_utc": 1676589558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my ex over me or it is a rebound",
        "author": "Key_Possession_5720",
        "url": "https://www.reddit.com/r/CasualConversation/comments/11447gd/is_my_ex_over_me_or_it_is_a_rebound/",
        "text": "(Burner Account)\n\nI really need a females point of view on this but men feel free to give me your opinions and advice.\n\nMe and my ex were together for 1 year and 3 months, first 6 months was heaven on earth, things became rocky around 1 year and she claims to mentally clocked out 3 months before it ended. She also feels as if she was in the relationship by herself which i totally understand. Part of the break up was that I was poor when it came to communication (which im working on) We decided to end on good terms and be friends. I did stuff to get my mind off her like going to the gym again, going on dates and focusing on college/university. We kept it in contact regularly speaking at least once or twice a month. \n\nAround the 4th month of us being broken up she sends me a TikTok along the lines of \"me complaining about my new boyfriend to my ex\" I laugh at it and i then go on to mention how i've been on a coupe of dates. She then asks how long I've been talking to the girl, where do i know her from and how'd we meet. I then tell her and then she tells me how she's been talking to a new boy for about 2-3 months.\n\nCouple days later she send me a video of her deleting old pictures of us and then a few days later she sees me at a party and gives me quick side hug then leaves.\n\nI then go out on a date a week later with the girl i've been casually dating and post on my story the drinks in the picture there is not evidence that i am with a girl. She then replies to my story asking who the girl is i the send laughing emojis and kept it at that. She then send me a video of me and her first date and says \"dont go forgetting your roots\" I thought this was her way of trying to get me back so i tried my luck and asked if she would like me to take her out on a date and she then ask if im serious with the girl i took on the date. I told her that me and the girl have agreed that this is just casual and were not looking for anything serious with each other at the moment (which was actually the truth) but if she doesn't want to the its genuinely fine she then says shes not saying she doesn't want to she just doesn't want to lead me on.\n\nI then let curiosity get the best of me and ask if theres any possibility of us trying again. She then goes on to say that she doesn't know but as right no but in ther future maybe because she feels as if we both haven't changed or healed from the break up and the same problems will arise and she still gets a heart sinking feeling when she sees me because i was her best friend. She then goes on to say that until shes healed enough she cant jump into anything with me just yet because she wouldn't be the best version of herself for the both of us. I replied saying that i'd be down to try again when we've healed and matured.\n\nThe next day is valentines and she post a bouquet of roses from her new boyfriend or whatever (i dont know) with a note that read \"ill love you forever\" then post them together. I admittedly get angry because how could you tell your ex there is a possibility of you guys getting back together and then post ur new relationship or whatever and you've only knowing for about 2-3 months and you guys are saying you love each other so i let my anger take over and respond and say i take back everything i said about me being down to try again in the future. She gets angry and it leads to small argument which resulted in me removing her from social media.\n\nWithin minutes she then EMAILS ME asking why i removed her i then send her a paragraph short summary i said i didn't appreciate being lied to and if there no future in us working things out then i don't see a point in being friends.\n\nShe then says that she wasn't lying and she meant it but she'll change her answer to no so that way i can move on and she cant hold me back then she says how she does value my friendship and she would've never gave me an ultimatum like that. But if i don't want to be friends she cant force me to he her friend. \n\nShe the goes on to tell our mutual friend who originally put us together that she feels like she moved on quicker because she me mentally checked our during the relationship and that theres still love but she doesn't wanna be in a relationship by herself again and if i /we both matured the she would've tried again but right now she doesnt know.\n\nShe also blocked me but unblocked me today\n\nGuys lemme know what you think has she moved on and or is it a rebound?\n\nThank you for reading feel free to ask any question",
        "created_utc": 1676589349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anybody else struggle getting into new shows or maybe movies?",
        "author": "Valiant_Starr",
        "url": "https://www.reddit.com/r/CasualConversation/comments/1143ups/anybody_else_struggle_getting_into_new_shows_or/",
        "text": "Nothing too serious here but just wondering. I want to see the Last of Us show but idk if it’s partially that’s it’s not over and I may binge it or cause of work. I love the game and definitely want to see it. Like I’d rather watch a 15-20 show for a few episodes but not a movie cause it’s like 2 hours.\n\nDoes this have a name lol? Or is it due to my poor time management",
        "created_utc": 1676588465,
        "upvote_ratio": 1.0
    }
]