[
    {
        "title": "Will this work for preheating? Glass V60",
        "author": "IkarusX86",
        "url": "https://i.redd.it/5sf1s5f027ja1.jpg",
        "text": "",
        "created_utc": 1676815710,
        "upvote_ratio": 1.0
    },
    {
        "title": "Making Vanilla sweet cream cold brew starbucks at home",
        "author": "Bakinator93",
        "url": "https://www.reddit.com/r/Coffee/comments/116a6bo/making_vanilla_sweet_cream_cold_brew_starbucks_at/",
        "text": " So ive tried making my own version at home and CANNOT seem to get it to taste as good as the stores. I can make the sweet cream part pretty close but the cold brew flavor/ratio is not. am i using the wrong roast of coffee? the wrong ratio of water to cold brew? Any tips helpful...my wallet is hurting lately. tips??",
        "created_utc": 1676812950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hear me out",
        "author": "Queen_duval",
        "url": "https://i.redd.it/x4aceodpr6ja1.jpg",
        "text": "My besties are so weird about sugar and creamer with their coffee. I tend to drink mine black. However, in an attempt to try and get em off the hard stuff a little I tried something…. Protein instead of creamer. Has anyone else tried this?? Thoughts?? \n\nIt’s magical",
        "created_utc": 1676812244,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hazelnut coffee 🥰",
        "author": "Caffeinated_veins",
        "url": "https://i.redd.it/056bij8np6ja1.jpg",
        "text": "",
        "created_utc": 1676811558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vietnamese coffee help (uk based)",
        "author": "careykaleidoscope",
        "url": "https://i.redd.it/2d7fq95j66ja1.jpg",
        "text": "Have some coffee from Buon Ma Thot and it’s incredible. Very chocolatey when brewed, almost like a mocha. Hoping to find some more like it for when we inevitably (and quickly) run out. Any recommendations?",
        "created_utc": 1676805128,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] The Daily Question Thread",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/1167tep/mod_the_daily_question_thread/",
        "text": " \n\nWelcome to the daily [/r/Coffee](https://www.reddit.com/r/Coffee) question thread!\n\nThere are no stupid questions here, ask a question and get an answer! We all have to start somewhere and sometimes it is hard to figure out just what you are doing right or doing wrong. Luckily, the [/r/Coffee](https://www.reddit.com/r/Coffee) community loves to help out.\n\nDo you have a question about how to use a specific piece of gear or what gear you should be buying? Want to know how much coffee you should use or how you should grind it? Not sure about how much water you should use or how hot it should be? Wondering about your coffee's shelf life?\n\nDon't forget to use the resources in our [wiki](http://www.reddit.com/r/Coffee/wiki)! We have some great starter guides on our [wiki \"Guides\" page](https://www.reddit.com/r/Coffee/wiki/guides) and [here is the wiki \"Gear By Price\" page](http://www.reddit.com/r/Coffee/wiki/gear#wiki_coffee_gear_suggestions) if you'd like to see coffee gear that [/r/Coffee](https://www.reddit.com/r/Coffee) members recommend.\n\nAs always, be nice!",
        "created_utc": 1676804418,
        "upvote_ratio": 1.0
    },
    {
        "title": "K-Max or ZP6 for different types of brewing?",
        "author": "Teleporterr",
        "url": "https://www.reddit.com/r/Coffee/comments/1167opw/kmax_or_zp6_for_different_types_of_brewing/",
        "text": "I’m currently on the fence between the K-Max or ZP6. The differences in my location being that the K-Max is marginally more expensive, but it has the alluring magnetic catch cup, and the ZP6 might have more flavor clarity? As the ZP6 is sold out at izpresso there’s probably also a longer wait for it. \n\nI’m never going to use either for espresso. I brew mainly pour-over, aeropress, french press and clever dripper/hario switch. \n\nAny differences I should be aware of? Is there a difference in grind speed or other aspects of work flow?",
        "created_utc": 1676803942,
        "upvote_ratio": 1.0
    },
    {
        "title": "how is espresso made on an industrial scale",
        "author": "semitrop",
        "url": "https://www.reddit.com/r/Coffee/comments/1167541/how_is_espresso_made_on_an_industrial_scale/",
        "text": "I was wondering how espresso is made on an Industrial scale for things like tiramisu or those plastic bottles of coffee you find at the grocery store.\n\n\nDo they have like an automated maschine with hundreds of portafilters just cranking out shots like a madman?\n\nI found a Maschine which can apparently do 5 litter per batch but this seems really small if you need to fill a whole semi.\nhttps://www.swiss-espresso-extractor.com/en/product.html\nBut they only exist since 2005 so there has to be an other approach.(also: James Hofmann should do a review of this thing, look at the size of this puck)\n\nOr do companys like califia just flat out lie about their drinks containing espresso?\n\nTo clarify I'm only asking about espresso, a french press like brewer is pretty scalable I think.",
        "created_utc": 1676802038,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking at getting into making my own espresso. Currently have a Keurig and want to get away from it as I've noticed the coffee sucks compared to traditional coffee houses. Best entry level recommendation ?",
        "author": "kmartin167",
        "url": "https://www.reddit.com/r/Coffee/comments/1163fcw/looking_at_getting_into_making_my_own_espresso/",
        "text": "Give me your best recommendation for machines as well as accessories!",
        "created_utc": 1676787670,
        "upvote_ratio": 1.0
    },
    {
        "title": "Togainu No Chi Crack With Torrent Download Pc Game",
        "author": "Character-Coffee-452",
        "url": "https://pcgamesbits.info/togainu-no-chi-crack-2/",
        "text": "",
        "created_utc": 1676785156,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anti-spill re-usable coffee cup recommendations?",
        "author": "ManateeGames",
        "url": "https://www.reddit.com/r/Coffee/comments/1160un7/antispill_reusable_coffee_cup_recommendations/",
        "text": "Hi everyone! I’m in desperate need of some recommendations for re-usable coffee cups. I want to make coffee at home to take with me to uni. Once I’m finished with my coffee, I’d like to be able to store it in my backpack to not have to carry it around.\n\nI’ve tried this in the past (with my latest attempt being with a Hydroflask coffee cup) but ultimately gave up very quickly as the cups I’ve had have ended up leaking or spilling the last drops into my bag, or would just generally leak around the lid as I would drink. I don’t readily have access to a sink between classes to clean my cup, so I need something as leakproof as possible!\n\nBudget isn’t an issue as I’d like a good investment since I’d be using it 4-5 times a week. Thanks!",
        "created_utc": 1676778813,
        "upvote_ratio": 1.0
    },
    {
        "title": "is Coava Juan Fransisco Pira decaf?",
        "author": "happybaconbit",
        "url": "https://www.reddit.com/r/Coffee/comments/1160k0v/is_coava_juan_fransisco_pira_decaf/",
        "text": "",
        "created_utc": 1676777869,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got a new mug",
        "author": "Diarrhea_099",
        "url": "https://www.reddit.com/r/Coffee/comments/116028s/i_got_a_new_mug/",
        "text": "So i got a new mug... it's pretty sassy. Surprised at how effective it is, though. I just bought it as a joke but it works very well as a social repellent, which is good for me bcos i am not a morning person.   \nI'll leave a link if y'all interested.\n\n[peace and quiet mug](https://surejosh.myshopify.com/)",
        "created_utc": 1676776362,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bastard Brew Coffee Co.",
        "author": "Natural_Annual6970",
        "url": "https://www.reddit.com/r/Coffee/comments/116025j/bastard_brew_coffee_co/",
        "text": "Bastard Brew Coffee Co. is a small Veteran owned and operated business out of San Diego, CA. \n\nWe specialize in small batch roasted to order coffee! Not only are we able to provide fast shipping but it is also free!\n\nFollow us on social media and check out our website for daily content and new updates! \n\n[Bastard Brew Website](https://www.bastardbrew.co)\n\n[Instagram](https://www.instagram.com/bastardbrewco)\n\n[Facebook](https://www.facebook.com/Bastardbrewcoffeeco)",
        "created_utc": 1676776354,
        "upvote_ratio": 1.0
    },
    {
        "title": "i got a new mug...",
        "author": "Diarrhea_099",
        "url": "https://www.reddit.com/r/Coffee/comments/115zwav/i_got_a_new_mug/",
        "text": "So i got a new mug. It says what I've been trying to say for a while.  \nI'll leave a link to where I got mine. Ur welcome.",
        "created_utc": 1676775875,
        "upvote_ratio": 1.0
    },
    {
        "title": "I bought this burr grinder for under $100. Good investment.",
        "author": "Javasndphotoclicks",
        "url": "https://i.redd.it/w7m5jo5bq3ja1.jpg",
        "text": "",
        "created_utc": 1676775454,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kurve/similar sieve vs getting a better grinder for pour overs",
        "author": "Unityofcomplexity",
        "url": "https://www.reddit.com/r/Coffee/comments/115zmia/kurvesimilar_sieve_vs_getting_a_better_grinder/",
        "text": "Recently I have been brewing more pour overs and getting annoyed by the microfines over extracting as my brew generally taste good but theres always that annoying hint of overextraction.",
        "created_utc": 1676775076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bless the maker!",
        "author": "mangoskipjack",
        "url": "https://i.redd.it/1jx9zjdqo3ja1.jpg",
        "text": "",
        "created_utc": 1676774927,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dude, Nespresso is 100% adding something to the pods.",
        "author": "Kaneshadow",
        "url": "https://www.reddit.com/r/Coffee/comments/115v15j/dude_nespresso_is_100_adding_something_to_the_pods/",
        "text": "I start every day with 520mL of pour over, so I'm not usually a \"pod\" guy.  I can't stand Keurig in the slightest.  But my company recently got a Nespresso, and one afternoon I decided I could use a boost and made one.  \n\nIt's decent.  If you use the tall pod it makes a normal cup of coffee, not an espresso, and it's totally acceptable.  But I'm not here to talk about the coffee.\n\nThe cup finishes with a solid half inch of foam on top.  Like at first I thought they made pods with latte foam built in or something.  It's not, and the company and this weird battalion of internet crusaders insist it's \"just crema.\"  Another cadre of scoffing but clearly incurious detractors say that the machine somehow aerates the coffee more to make the foam.\n\nThis foam is not from the coffee.  You could float a nickel on it, it's ridiculous.  At first I was thinking a starch, like rice dust or something, but the other thing about the foam is it doesn't go away- if you don't wash the mug the foam will dry there like an old loogie.  It's protein foam.  They are adding egg white powder or something.  \n\nI won't rest until I solve this mystery and uncover the truth.",
        "created_utc": 1676761998,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ode 2 (gen 2) grind setting for Breville Precision Brewer?",
        "author": "Jazzlike_Suspect2557",
        "url": "https://www.reddit.com/r/Coffee/comments/115uo73/ode_2_gen_2_grind_setting_for_breville_precision/",
        "text": "I have a relatively new Breville Precision Brewer and my old Solis Maestro grinder has been difficult to dial in lately (So I still haven't landed on what works best for that grinder and the precision Brewer).\n\nSo, I bit the bullet and ordered a Fellow Ode Gen 2 (gen 2 burrs), which I'm anxiously awaiting. Curious what a good starting place is for grind size. Fellow says to grind pourover coffee between 4-8 and electric coffee makers between 7-9.\n\nI realize that the precision Brewer is an electric coffee maker, but given the customizability of it, I'm wondering if it makes more sense to start in the pourover range. Anyone have both of these appliances and can offer input? Gen 1 experience should still be valid as since even though the grind settings are different, Fellow does have a chart where I can convert between the two generations.\n\nThanks for any feedback.",
        "created_utc": 1676761056,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vietnamese iced coffee, one of my favorites",
        "author": "spectral_tease",
        "url": "https://i.redd.it/f691jh26h2ja1.jpg",
        "text": "",
        "created_utc": 1676760281,
        "upvote_ratio": 1.0
    },
    {
        "title": "Baratza part interchangeability",
        "author": "myfufu",
        "url": "https://www.reddit.com/r/Coffee/comments/115tmwx/baratza_part_interchangeability/",
        "text": "Hey guys - I'm excited about the new EncoreESP, but have a Virtuoso+.\n\nIn light of the common burr upgrade and obvious reuse of parts between the Encore and V+, anyone happen know if the EESP adjustment system can be retrofit into the V+?",
        "created_utc": 1676758380,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this some weird coffee recipe I don’t know about? I’m genuinely confused by this.",
        "author": "Equivalent-Trash1122",
        "url": "https://i.redd.it/l51wiy5ga2ja1.jpg",
        "text": "",
        "created_utc": 1676758060,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommendations! New Breville Barista Pro Owner",
        "author": "BaseGroundbreaking74",
        "url": "https://www.reddit.com/r/Coffee/comments/115shdz/recommendations_new_breville_barista_pro_owner/",
        "text": "Picking up my new (to me) Breville Barista Pro tomorrow evening. I usually just drink starbucks lattes and was going to pick up a bag of their Signature Roast to start out with. But wanted to source some recommendations for other good options!\n\nWill primarily be making milk drinks, vanilla and peppermint lattes are my current favorite 🙂",
        "created_utc": 1676756075,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much syrup do you add to coffee?",
        "author": "Diligent_Jury_9956",
        "url": "https://www.reddit.com/r/Coffee/comments/115rmxd/how_much_syrup_do_you_add_to_coffee/",
        "text": " I've always preferred adding sugar to a normal 10 oz, and a splash of milk or whatever cream I have in the fridge. Jsut I never know how much is good, some mornings the coffee is perfect others I dotn bother😭",
        "created_utc": 1676754770,
        "upvote_ratio": 1.0
    },
    {
        "title": "I like my coffee iced in the form of espresso with small amount of milk (like half a cup). Whenever I order an iced latte in the US, it’s got a ton of milk. Is there a easy way to order at cafes? I’ve tried asking for iced cortado but it gets confusing..",
        "author": "Secret-Decision5861",
        "url": "https://www.reddit.com/r/Coffee/comments/115qt56/i_like_my_coffee_iced_in_the_form_of_espresso/",
        "text": "",
        "created_utc": 1676753627,
        "upvote_ratio": 1.0
    },
    {
        "title": "[question] Is there a more elegant way to get beans from the bag to the dosing cup?",
        "author": "ashpow",
        "url": "https://www.reddit.com/r/Coffee/comments/115qnpk/question_is_there_a_more_elegant_way_to_get_beans/",
        "text": "My current method of clawing them a few at a time isn't really cutting it. I can't be the only one spilling beans, can I?",
        "created_utc": 1676753413,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is your day going?? here is coffee time!",
        "author": "sweetfatbottomed",
        "url": "https://i.imgur.com/KIKsN3f.jpg",
        "text": "",
        "created_utc": 1676751369,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee Float",
        "author": "ShinePuzzleheaded530",
        "url": "https://www.reddit.com/r/Coffee/comments/115o6dt/coffee_float/",
        "text": " Try making a Coffee Float – it's a cool and refreshing way to enjoy coffee on a hot summer day. Place a scoop of your favorite ice cream in a glass, add chilled espresso or cold-brew coffee, then top it off with a dollop of whipped cream and a sprinkle of chocolate shavings. Enjoy!",
        "created_utc": 1676749994,
        "upvote_ratio": 1.0
    },
    {
        "title": "The mods here take no criticism",
        "author": "scienceshmaience",
        "url": "https://www.reddit.com/r/Coffee/comments/115nzom/the_mods_here_take_no_criticism/",
        "text": "Any slight post of disagreement gets taken down. Commented with go message the mods. Why does it need to be a private conversation, why not have an actual discussion on the subreddit itself, why aren’t posts that try to improve this place valuable? Isn’t the whole point of this sub to actually get the coffee community together?",
        "created_utc": 1676749739,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I post here without being taken down?",
        "author": "scienceshmaience",
        "url": "https://www.reddit.com/r/Coffee/comments/115mpgn/how_do_i_post_here_without_being_taken_down/",
        "text": "I’ve read all the guidelines and I truly don’t understand, why is it that if I build something that’ll get people excited about coffee.. I’m not selling anything I literally just built something with my own hard earned money and time. Seriously what’s the point mods?",
        "created_utc": 1676747440,
        "upvote_ratio": 1.0
    },
    {
        "title": "My son said it's the best present he has received:)",
        "author": "Honest_Employee7613",
        "url": "https://i.redd.it/8xq1asf9xzia1.png",
        "text": "",
        "created_utc": 1676747379,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best electric grinder for whole beans?",
        "author": "Pitiful-Demand-1529",
        "url": "https://www.reddit.com/r/Coffee/comments/115m1pz/best_electric_grinder_for_whole_beans/",
        "text": "I use reusable pods with my nespresso machine and like to grind my own coffee. I recently purchased a manual burr grinder but is too much hastle. \n\nLooking for good electric burr grinders under 70$. Really confused as there are too many options and reviews which are mixed. Nespresso needs medium fine to fine grind. \n\nAny recommendations? \n\nI am currently looking at this one but really need some input from people who have tried different grinders.\n\nhttps://www.amazon.com/ENZOO-Electric-Detachable-Cleaning-Percolator/dp/B08SW9Z9LG/ref=dp_prsubs_1?pd_rd_w=DzZ7o&amp;content-id=amzn1.sym.69d203e2-d5c7-48d3-8a0c-a85edadacea7&amp;pf_rd_p=69d203e2-d5c7-48d3-8a0c-a85edadacea7&amp;pf_rd_r=AKXJZ4XPX82W04D46K9B&amp;pd_rd_wg=woB1Q&amp;pd_rd_r=38200f9a-8e72-40f4-9c11-9792c906286f&amp;pd_rd_i=B08SW9Z9LG&amp;psc=1#aw-udpv3-customer-reviews_feature_div",
        "created_utc": 1676745631,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm gathering a list of all the beans in the world (at 8000+ so far)",
        "author": "scienceshmaience",
        "url": "https://www.reddit.com/r/Coffee/comments/115ltlz/im_gathering_a_list_of_all_the_beans_in_the_world/",
        "text": "I'm basically in the process of scraping all the information about the coffee world (paying a good sum of money to do so on server costs :) ), worst case is I get some pretty awesome personal benefit.. There's certainly quite some work to do but I'm super exciting by whats currently available and what is to come. Since this r/coffee is super against self promos I won't link anything..\n\nAbout 500+ US based roasters thus far, almost 10k individual beans.",
        "created_utc": 1676745035,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nespresso",
        "author": "ginaavril",
        "url": "https://www.reddit.com/r/Coffee/comments/115l0ng/nespresso/",
        "text": "There’s no going back to the local coffee shops I used to like… it just doesn’t compare",
        "created_utc": 1676742893,
        "upvote_ratio": 1.0
    },
    {
        "title": "instant",
        "author": "Previous_Airport6290",
        "url": "https://www.reddit.com/r/Coffee/comments/115kr9f/instant/",
        "text": "hey actually i do like coffee but i hate sugar \nand i tried black coffee for the first time and it didn't liked it.\n\ni want to ask is it okay to drink coffee with milk and without sugar.\n(as i tried it and did liked it)\ni mean can i drink it on a regular basis will that be okay?\nand is there any name for this type of coffee like with milk and without sugar?",
        "created_utc": 1676742187,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for basic home drop/filter coffee set up",
        "author": "Fallways",
        "url": "https://www.reddit.com/r/Coffee/comments/115kmzn/advice_for_basic_home_dropfilter_coffee_set_up/",
        "text": "Hi there! \nI’m all set up for espresso at home (Profitec Go and Mazzer Super Jolly, wdt, small scale) but am curious to try pour over and occasionally just feel like a drip coffee or two. \n\nWhat’s holding me back is needing a second grinder plus a scale etc. There was a wealth of “intro to espresso setups” info but I haven’t seen the same for pour over so I thought I’d ask here. \n\nI’m eyeing up a baratza encore,basic  Hario scales and a V60. Is that the basic setup most people would recommend? We already have the fellow goose neck kettle. \n\nShould I consider the Ode V2 if I can stretch the budget? It seems an obvious upgrade but I don’t know enough about pour over to know if I’ll appreciate the upgrade (let alone the SSP upgrade question).  \n\nAll advice is very much appreciated!",
        "created_utc": 1676741859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Troubleshooting/Sanity Check; This *has* been ground too course for espresso right?",
        "author": "FlakTotem",
        "url": "https://www.reddit.com/r/Coffee/comments/115kbv2/troubleshootingsanity_check_this_has_been_ground/",
        "text": "I bought a espresso machine yesterday, and went to a couple of local shops to try and get some pre-ground beans for it. I'm a newbie, so could very well be wrong, but I *think* they both messed up.\n\nThe first gave me a medium grind. The second gave me the grind pictured. Both yielded 40g in less than 5 seconds.\n\nIs it the coffee, or should I be looking into something else?\n\nhttps://preview.redd.it/9pxbo57aezia1.jpg?width=3000&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=7ad8a346596ffb68c75945c073c96bd7aed74c2c",
        "created_utc": 1676741030,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is this?",
        "author": "Qmart",
        "url": "https://i.redd.it/yg6s7byyr0ja1.jpg",
        "text": "What is this machine?  My friend wants to buy one.\nTo me it looks like a complicated pour over….\nI don’t see a brand name, so Google hasn’t been helpful",
        "created_utc": 1676739692,
        "upvote_ratio": 1.0
    },
    {
        "title": "Drip machine with flow rate control?",
        "author": "bubbahotep99",
        "url": "https://www.reddit.com/r/Coffee/comments/115jcir/drip_machine_with_flow_rate_control/",
        "text": "Anyone know of a drip machine that has a flow rate control? \n\nI know the Technovorm with the thermal carafe has a flow rate control lever but I'm looking for a more standard cheapo drip machine. \n\nJames Hoffman had a couple in Europe that were no name machines with a flow control.  Looking for something that can be purchased in the US.",
        "created_utc": 1676738400,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee question!",
        "author": "Explorer_girl19",
        "url": "https://www.reddit.com/r/Coffee/comments/115j0xq/coffee_question/",
        "text": "With the recent derailed train in Ohio and all the chemicals in the water I have no begun seeing people coffee creamer sizzle and pop when they add it to their coffee.\n\nWhy? This only happens at the surface and it lasts for only a few seconds while you pour the creamer and about a second or two when you stop. I have seen people say this is because chemicals in the water. \n\nBUT! I do not live near Ohio and I actually noticed this a few days before I began seeing it everywhere. To me this is normal, I can’t recall a memory of this happening exactly but I do know I’ve taken note of it before.\n\nSo is it Chemicals in our water? I don’t doubt it if there was stuff before hand.",
        "created_utc": 1676737519,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to make my french press coffee stronger",
        "author": "mushmushmushmus",
        "url": "https://www.reddit.com/r/Coffee/comments/115ix4x/how_to_make_my_french_press_coffee_stronger/",
        "text": "Ive been using a french press for a while now, but ive never been able to get a good solid coffee taste. I add more grounds, but the flavor is still watery, what should i do?",
        "created_utc": 1676737225,
        "upvote_ratio": 1.0
    },
    {
        "title": "Drip coffee problem [v60]",
        "author": "No_Web",
        "url": "https://www.reddit.com/r/Coffee/comments/115iru8/drip_coffee_problem_v60/",
        "text": "Every time I make a drip at home, it never comes out like it did at my favourite coffee shop. It's always overextracted. There's pouring the filter with boiling water, preinfusion etc. I've been fiddling with the grinder setting - no matter if it's a medium grind or particles the size of kosher salt, I can never go below 3-3.5mins of brewing time when I'm brewing more than 12g of coffee.\nIn the beginning I set a rule of 6g/100ml. Later, I reduced the coffee dose. At times I poured the beans to melt into the coffee, and at other times topped up patiently. I tried gentle stirring with a set, spoon and nothing.\nEach time, I don't get what I'm used to: the fruity, floral quality I can smell in my favourite coffee shop covers up the weight of the insistent bitterness (I use Fig Brazil or Tutti fruti coffee).\nWhat am I doing wrong?",
        "created_utc": 1676736829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bought a Philips 3200 LatteGo... What can I get that's better?",
        "author": "coloradofever29",
        "url": "https://www.reddit.com/r/Coffee/comments/115iqf1/bought_a_philips_3200_lattego_what_can_i_get/",
        "text": "My wife and I bought a Philips 3200 LatteGo. We love how automatic it is, but hate how slow it is.\n\nI'm willing to spend a little more money if necessary (preferably not), but is there anything for less than $1500 that's better?",
        "created_utc": 1676736715,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee in The Woods",
        "author": "SeparateConcert9041",
        "url": "https://www.youtube.com/watch?v=nmkFY1kYS5Q",
        "text": "",
        "created_utc": 1676736714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee maker “built in”",
        "author": "Bringasd",
        "url": "https://www.reddit.com/r/Coffee/comments/115imu0/coffee_maker_built_in/",
        "text": "Need some help with a coffee maker recommendation, please!  We are finishing a custom kitchen and have an appliance garage that will have pocket doors and a spot for a coffee maker.  The area is “pre-plumbed” with a water line hook up.  We are looking for:\n- Coffee maker that can hook up to the water line so we don’t have to fill a tank\n- WiFi (nice to have)\n- Make regular coffee + specialty drinks\n- fits into the current opening which is 24in wide (though pocket doors will reduce by a few inches) and 17in deep.  Height not an issue: \n\nPrice is not an issue, though not sure we need a custom built in since it will be behind closed pocket doors.\n\nI am completely overwhelmed but the options available - welcome thoughts/suggestions!!\n\nPS - I have a picture of the space but couldn’t figure out how to post it w/out deleting the text.",
        "created_utc": 1676736434,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone found a metal reusable K cup that doesn’t overflow?",
        "author": "Garaged_4594",
        "url": "https://www.reddit.com/r/Coffee/comments/115igdm/has_anyone_found_a_metal_reusable_k_cup_that/",
        "text": "[removed]",
        "created_utc": 1676735954,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does different coffee have different subjective effects?",
        "author": "is_reddit_useful",
        "url": "https://www.reddit.com/r/Coffee/comments/115ifx2/does_different_coffee_have_different_subjective/",
        "text": "I've been using Lavazza Crema e Gusto coffee, which contains arabica and robusta. Recently, after watching a documentary on Illy, I bought Illy Classico, which is 100% arabica.\n\nI expected the only differences to be flavour and level of caffeine. I indeed saw differences in flavour and strength. But the effects also seem different.\n\nThe Lavazza Crema e Gusto seems to create more rushy body feelings at first, and Illy Classico seems to affect my body less obviously, while still significantly affecting my mind. Also, when Illy Classico wears off, I get anxiety that I don't get when Lavazza Crema e Gusto wears off.",
        "created_utc": 1676735915,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adjusting for Odd Evolution",
        "author": "thedunderchief1",
        "url": "https://www.reddit.com/r/Coffee/comments/115iazf/adjusting_for_odd_evolution/",
        "text": "I am fairly new to specialty coffee, so please forgive my ignorance. I just brewed a washed, single-origin Kenyan (details below). When fresh and hot, I was getting notes of fig, passion fruit, hibiscus, and dried orange peel. It was quite lovely. However, as it cooled, the flavor turned to vegetable soup. Is there some way I can adjust my brew process/extraction to narrow in on the fruity/floral side of this coffee and avoid the vegetal side?\n\nOrigin: Kenya, Kirinyaga\\\nRoast: Light\\\nRoaster: Joe Sippers Roastery\\\nProcess: Washed\\\nGrind: Fresh ground; Medium-Fine\\\nGrinder: Baratza Encore\\\nBrewer: AeroPress\\\nBrew Temp: ~95°C\\\nBrew Ratio: 11g coffee to 200g water\\\nBrew Process:\\\n-Add hot water to grounds and seal with plunger.\\\n-Infuse 4 minutes.\\\n-Swirl brewer.\\\n-Infuse additional 30 seconds.\\\n-Push plunger through hiss (~30 seconds).",
        "created_utc": 1676735524,
        "upvote_ratio": 1.0
    },
    {
        "title": "It makes me a different feel when I drink coffee!!",
        "author": "Most-Performance8088",
        "url": "https://i.redd.it/8n78gl5kwyia1.jpg",
        "text": "",
        "created_utc": 1676735149,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a good price to pay for fresh coffee? I paid $25 for the small bag at my local roaster in Astoria Queens and $90 for the larger bag delivery.",
        "author": "Babypipes",
        "url": "https://i.redd.it/dr7damo6b0ja1.jpg",
        "text": "",
        "created_utc": 1676734050,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cant remember name of small roaster I found on here a while ago.",
        "author": "Modern_chemistry",
        "url": "https://www.reddit.com/r/Coffee/comments/115hcg2/cant_remember_name_of_small_roaster_i_found_on/",
        "text": "Havent been making pour overs in a while, but I feel like getting back into it, only I cant remember the roaster I used to use often.  They were small batch, craft.  Something like B&amp; something B&amp;W or B&amp;R. .. i really cant remember, but i just remember this ethopian I once had that was incredible.  Any help appreciated.  Thanks",
        "created_utc": 1676732891,
        "upvote_ratio": 1.0
    },
    {
        "title": "How could I improve the brewing with a Sage/Breville precision brewer?",
        "author": "ashyjay",
        "url": "https://www.reddit.com/r/Coffee/comments/115h9o1/how_could_i_improve_the_brewing_with_a/",
        "text": "I've had the brewer for almost a year now, and I've stopped using it as no matter how I brew the coffee always tastes hollow and very weak. I've tried very fine ground beans almost espresso fine, to very coarse ground which doesn't change much. \n\nI've got it currently set on my brew at 96c, 60 seconds of bloom with the minimum amount of water and the slowest drip speed. I also use a 1:15 ratio and using Filtropa aroma brown filters.\n\nI have held off buying the V60 adaptor, and it's only really used for cold brewing.\n\nAny help would be appreciated.",
        "created_utc": 1676732674,
        "upvote_ratio": 1.0
    },
    {
        "title": "Americano w/ 300 calories?!",
        "author": "ejsfsc07",
        "url": "https://www.reddit.com/r/Coffee/comments/115h99w/americano_w_300_calories/",
        "text": "I'm not counting calories or anything, but I was browsing the menu at my local coffee shop and saw that next to a 12 oz Americano it had 300 calories listed. That seemed rather... high? I thought it was just espresso/hot water, so like 20 cals max....",
        "created_utc": 1676732641,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much grind adjustment makes a noticeable taste difference to most people?",
        "author": "PMLdrums",
        "url": "https://www.reddit.com/r/Coffee/comments/115gzak/how_much_grind_adjustment_makes_a_noticeable/",
        "text": "I recently watched a Lance Hendrick video where he mentioned an experiment that showed people to notice a difference of 5 degrees celsius in espresso, but not 3 degrees. I'm wondering is there a certain number of microns that is noticeable? Like when I'm adjusting my grind size for a brew, is one 22-micron click going to make ANY noticeable difference? Or should I go for 3, or 5, or maybe more. \n\nYes, I could do an experiment myself and try to do a blind tasting with identical cups numbered on the bottom and blah blah, no I'm not doing that lol",
        "created_utc": 1676731863,
        "upvote_ratio": 1.0
    },
    {
        "title": "never seen this before - a blend of different roasts of a single origin. is this normal? It’s delicious, regardless…",
        "author": "Big_Masterpiece_5019",
        "url": "https://i.redd.it/cvd88a66myia1.jpg",
        "text": "",
        "created_utc": 1676731533,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is the story of lord Shiva bhasmasura?#StoryOfLordShiva",
        "author": "Trick_Donkey_6061",
        "url": "https://i.redd.it/tochpnf530ja1.jpg",
        "text": "",
        "created_utc": 1676731346,
        "upvote_ratio": 1.0
    },
    {
        "title": "seasoned specialty coffee drinkers, are you ever surprised anymore?",
        "author": "qpockets",
        "url": "https://www.reddit.com/r/Coffee/comments/115gq6l/seasoned_specialty_coffee_drinkers_are_you_ever/",
        "text": "I've been doing this for a while now, and this morning i found myself thinking i was 'finally almost through this bag' which i then almost immediately felt bad about, as i hadn't really experimented with it at all.\n\n\nSome context: i enjoy shopping around and getting new beans almost every time, the rare occasion i'll enjoy something so much to buy a 2nd or 3rd time (aside from a year or two stint where i was loyal to a local roaster until they were sold and the quality declined). there's a lot out there, a lot of talented folk growing and roasting coffee, and i want to experience as much of it as possible. i generally know what flavor profiles i prefer, but also enjoy trying new types.\n\n\nNow that i'm experienced in all the brewers and variables at my disposal, i find myself losing interest pretty much right off the bat if a coffee doesn't show some promise.\n\n\nAlways start out brewing in a V60, and depending on how that goes, assign to a different method or plan to try tweaking for the next brew. But occasionally there will be the bag that i can't theoretically find any promise in and it becomes a slog to get through. In the past i've still experimented with these bags, but never was able to save one, so i've mostly quit doing that.There was once a while ago with one such bag that was brought back to life by a mocha pot, but that was before i had used the mocha pot very much.\n\n\nAm i just jaded? overcome by ego? or is this just something that happens with experience?\nI guess i'm just looking for some hope, or confirmation, or someone to knock me down a peg. would be happy with any/all of the above.\ni know that some flavors just \"aren't for me\" but is it really possible to figure that out with a single brew? should i just quit trying flavor profiles that i'm \"fairly certain\" aren't my thing? i don't think that can be it, because even beans from the same place change over time. \n\nSmall aside: i keep saying 'flavors' and 'flavor profiles'. just to clarify, in my head, that's a combination on what i know of the 1) region, 2) roast 3) process and lastly, with a grain of salt, 4) the flavor profile listed on the roaster's description.\n\n\nGenerally in life i hold a \"never stop learning\" mindset, but it seems like with coffee i've reached the end of personally useful knowledge, with the exception of doing something i really can't afford like buying an espresso machine.\n\n\nAlso, reading back over this it sounds a littly braggy. it probably is, but i'm not saying i'm the best coffee brewer in the world now or anything. i've just found what works for me. great chance if i served a cup of my coffee to a World Barista Championship judge, they'd spit it back in my face.\n\nthat is a much longer post than i was expecting, thanks for reading\n\nTLDR; Jaded local man complains about knowing too much",
        "created_utc": 1676731111,
        "upvote_ratio": 1.0
    },
    {
        "title": "Probably a long shot, but do any growers/roasters possible to try a Washed vs Natural of the same crop?",
        "author": "NakaNakaNakazawa",
        "url": "https://www.reddit.com/r/Coffee/comments/115gnae/probably_a_long_shot_but_do_any_growersroasters/",
        "text": "I'd like to better understand the *in the cup* difference between Washed and Naturals. I think it'd be a very fun experiment to try them side by side of the same crop. I can't imagine I'm the only person who's thought of this, but I'm guessing most (all?) growers go strictly with one of the other. But, I figure if this does exist, then this community would know where I could find it.\n\nBarring that, I'd be interested in other coffee recommendations to contrast the differences between washed and natural.",
        "created_utc": 1676730870,
        "upvote_ratio": 1.0
    },
    {
        "title": "I could use a recommendation for a small, reliable coffee pot.",
        "author": "A_Dapper_Goblin",
        "url": "https://www.reddit.com/r/Coffee/comments/115gh66/i_could_use_a_recommendation_for_a_small_reliable/",
        "text": "I don't need anything fancy, but I've been using a Mr. Coffee brand coffee pot. It only makes up to 5 cups at a time. I just like regularly relaxing with some decaf coffee with some vitamin D milk in it. But after my old coffee pot broke (after many years of use) it seems like the new design for this brand (which seems to be the only one I can find around here) is honestly terrible. The basket for the filter keeps not wanting to go down all the way, which causes it to back up and get coffee and grounds everywhere, then I have to throw it all out, clean the machine, and go without. I hate ordering stuff online, but I'm willing to do so if someone can recommend one that isn't so liable to mess up.",
        "created_utc": 1676730374,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yes, this was TOTALLY worth it!",
        "author": "quietlifeintheforest",
        "url": "https://i.imgur.com/MF9Et1d.jpg",
        "text": "",
        "created_utc": 1676730239,
        "upvote_ratio": 1.0
    },
    {
        "title": "Complementary grinder for pourover (and aeropress) - already own a NZ for espresso",
        "author": "Moerkskog",
        "url": "https://www.reddit.com/r/Coffee/comments/115fzjp/complementary_grinder_for_pourover_and_aeropress/",
        "text": "I've been investigating grinders in the 300-400 euro price range for aeropress and pour overs as it seems the NZ gives me more bitter tasting cups when the roast profile is medium or light. I'm wondering if there's any good compliment to the NZ or if I am just not making any sense. I was looking at flat burr grinders to have something completely different to the NZ, mainly looking at the Fellow Ode. For espresso, I want to keep the NZ for now.\n\nWhat would be a good one",
        "created_utc": 1676728911,
        "upvote_ratio": 1.0
    },
    {
        "title": "My very first steps...",
        "author": "LHAvocat",
        "url": "https://www.reddit.com/r/Coffee/comments/115fxv8/my_very_first_steps/",
        "text": "Hello, fellas !\n\nA couple of weeks ago, during a sleepless night with my 4 month-old daughter, I watched a YouTube video made by James Hoffmann. The dude seemed nice and his video, at this time of the night, felt like ASMR. I enjoyed it and watched more. Many more. \n\nI don't really know why but what he did seemed fun. So, a couple of days later, I bought an Aeropress online and some Yirgacheffe from my local coffee shop, following their advice. \n\nI then tried to make some coffee with all that, following the \"ultimate Aeropress technique\" from Hoffmann (11g of coffee for 200g of water), but I have a problem : I don't even know what Yirgacheffe coffee is supposed to taste/feel like...\n\nWhat I get at the end of my process is a really \"tea-like\" coffee : very light and as if I put some sugar in it even if I did not. \n\nDon't get me wrong : i was very satisfied with my result. \nI enjoyed it a lot. \nBut is this what I am supposed to get at the end of the day ?\n\nFYI : I usually drink filter coffee from the supermarket and/or Nespresso pods. \n\nThank you very much for your time,\nLove you all,\nEven tough you're probably going to ruin me because a grinder and a better scale now seems required...\n\nLH",
        "created_utc": 1676728801,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fellow ode: gen 2 or 1.1+2.0 burrs?",
        "author": "Moerkskog",
        "url": "https://www.reddit.com/r/Coffee/comments/115fhjr/fellow_ode_gen_2_or_1120_burrs/",
        "text": "Over here in Europe you can get the gen 1.1 + 2.0 burrs for about 350 euro, vs paying over 420 euro for the gen 2 version. Is it worth getting the gen2? I read the upgrades in many YT videos and honestly, I don't care that much about static or pushing the beans in myself.",
        "created_utc": 1676727413,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best deals on beans??",
        "author": "rowrtg9",
        "url": "https://www.reddit.com/r/Coffee/comments/115e06y/best_deals_on_beans/",
        "text": "[removed]",
        "created_utc": 1676722416,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dead tired after consuming coffee?",
        "author": "yessirrj0sh",
        "url": "https://www.reddit.com/r/Coffee/comments/115d72b/dead_tired_after_consuming_coffee/",
        "text": "I’ve been drinking coffee everyday for about a year now. I drink 2 cups a day (first cup is 12oz, second is 9oz). At first I would feel jittery and have lots of energy, but the last month I’ve been feeling dead tired. Should I take a break from coffee?",
        "created_utc": 1676719226,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm trying to upgrade my coffee game. I usually use tap water when brewing, should I use water bottles or get a filter? what are your filter recommendations?",
        "author": "ChriscoSauce",
        "url": "https://www.reddit.com/r/Coffee/comments/115d6n1/im_trying_to_upgrade_my_coffee_game_i_usually_use/",
        "text": "",
        "created_utc": 1676719184,
        "upvote_ratio": 1.0
    },
    {
        "title": "team umizoomi goodbye time machine the creepypasta banned episode",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/115cwr1/team_umizoomi_goodbye_time_machine_the/",
        "text": "that was banned episode of team umizoomi it was given to the Nickelodeon each episode knowing to the graphic content i never was this movie \n\ni had the post office in mail box i had the disc i took out with DVD player they cut to the special features menu with making time machine camera interview voice actors and how to burn the DVD the disc said Goodbye Time Machine it was due to the violent stuff \n\ni was in 3 am challenge and i clicked play it started off in epic theme song then it went to the title card the movie named Goodbye Time Machine it showed 3 main characters as geo milli and bot who worked in umi friend \n\njust for a minute the bot said today we are going to learn about the human body this would be graphic was not for the kids movie bot pulled out of his knife they shoved milli into the belly screen then grabbed geo and slammed his knife on the road \n\nso much blood the blood didn't look like for his live action it looked more animated the bot said what the fuck are you doing to me it was any Nickelodeon characters who was saying the f word and s word bot then responded you got blood guts and all that shit now SHUT THE FUCK UP I WILL KILL YOU ARE MOTHERFUCKER IT WAS PIECE OF SHIT \n\nit was so disturbing for the children's movie bot pulled his knife and said this knife won't do that they pulls out the chainsaw whick looks animated save the image from gallery it turns to camera and it said this is the time machine \n\nit then the end of the film the next movie was called a nightmare on UFO house it was parody of a nightmare on elm street \n\nit shows milli in whale house it was mourning geo's death she howled out this was only for nightmare she starts to the nightmare for about 8 minutes she goes with next scene it's time for last meal did you wany shit my ass in fish burger she went for fish burger sat down on my table and eats the fish burger \n\nthis dream was about in last 5 minutes it showed milli was eating i am done with this shit bot have arrived saying you have 2 choices i kill you OR kill himself she picked with terrible nightmares \n\nit was animated fire alarm the bot said DO IT then milli pick claws in my head milli's corpse fell on the floor as animated blood matter \n\nmilli use to commit the dreams about the UFO city it then the police car arrived and arrested bot in 2 minutes bot is in jail with security cameras it was so graphic to had the nightmare after that the episode ended with epic credits \n\nit was dramatic credits playing and it then cuts back to the bonus features menu that night a moon came i told my mom that is what's gonna to be happened after that we destroy the disc and put it in trash can and put it on garbage truck events that episoded who also haunted me so next time if you see any this with this movie don't watch it and otherwise there was dramatic credits",
        "created_utc": 1676718091,
        "upvote_ratio": 1.0
    },
    {
        "title": "machine sonic 3 lost scene the creepypasta",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/115c9us/machine_sonic_3_lost_scene_the_creepypasta/",
        "text": "i was thinking that machine sonic 3 YouTube channel full parts in Mexico when i noticed that the lost scene part 0 the another crash the video of the version in machine sonic they got 1 video i sat down on my mouse \n\nit started with machine sonic look at my finnish line but then the storm came instead of the train and caused of the explosion due to the red traffic signal like the rabbit chasing the fox then a momment happened a image of destroyed machine sonic with red bloodshot eyes the screen cut to black and the only credits was dramatic title and copyright in 2020 were the directors r.i.p machine sonic 1954-2017 which was odd with machine sonic 3 released in 2019 i delete the YouTube channel and delete it away to abandoned trash truck \n\nthe scene haunt me this next week",
        "created_utc": 1676715542,
        "upvote_ratio": 1.0
    },
    {
        "title": "Succubus Affection Crack With Torrent Download Pc Game",
        "author": "Character-Coffee-452",
        "url": "https://pcgamesbits.info/succubus-affection-crack-2/",
        "text": "",
        "created_utc": 1676709568,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got a Porlex Mini 2 and it ruins my coffee",
        "author": "EducationalFall4344",
        "url": "https://www.reddit.com/r/Coffee/comments/115apqu/i_got_a_porlex_mini_2_and_it_ruins_my_coffee/",
        "text": "So since I'm the only Coffee drinker in my household I thought it would be exagerrating to buy a big electric Gründer. Reading about the Porlex, praised as one of the best hand grinders, I chose to get one of those instead.\n\nSince then my Coffee tastes bad: bitter, sludgy, just off. I replaced my old French Press, blamed it on the beans. But then I realized: It's the freaking Porlex.\n\nThe grind is all over the place. So many fines, I could paint pictures with it. Coarse pieces that I could wear around my neck. This thing cost me 70 bucks, why would anyone recommend it?\n\nSo what are your experiences with it? Is there a way to fix this thing or can you recommend small electric grinders / other alternatives? And does grinding fresh yourself really matter that much if you can get small batches of home-roasted beans every week from your local roaster?",
        "created_utc": 1676709194,
        "upvote_ratio": 1.0
    },
    {
        "title": "crema products for barista express",
        "author": "irish-coach",
        "url": "https://www.reddit.com/r/Coffee/comments/11586py/crema_products_for_barista_express/",
        "text": "Has anyone got anything from crema for the breville barista express. Looking to upgrade some things like the porta filter, tamp, basket etc and they look cool but just haven't seen much about them except adverts and their page",
        "created_utc": 1676699431,
        "upvote_ratio": 1.0
    },
    {
        "title": "Planetary Annihilation Titans Crack With Torrent Download Pc Game",
        "author": "Character-Coffee-452",
        "url": "https://pcgamesbits.info/planetary-annihilation-titans-crack-2/",
        "text": "",
        "created_utc": 1676696169,
        "upvote_ratio": 1.0
    },
    {
        "title": "With the release of the Baratza Encore ESP, will it be possible to mod existing Encores to use the new adjustment system?",
        "author": "LimitedWard",
        "url": "https://www.reddit.com/r/Coffee/comments/1156g4x/with_the_release_of_the_baratza_encore_esp_will/",
        "text": "I recently upgraded to a Niche for espresso, so I don't think my Encore will be getting much use considering I can just use my Niche for filter as well when I want to change things up.\n\nRather than letting my existing Encore collect dust, I'd want to upgrade it for espresso and gift it to my brother who's currently using a cheap $60 grinder. Now that the ESP was announced, I was wondering if anyone knew whether the parts are interchangeable.",
        "created_utc": 1676693363,
        "upvote_ratio": 1.0
    },
    {
        "title": "My first attempt at a #Cafe #Cubano would you try this ? #coffeebreak #specialtycoffee #goodmorning",
        "author": "Apaxngh1",
        "url": "https://youtu.be/uoEAj0l2Kc8",
        "text": "",
        "created_utc": 1676691394,
        "upvote_ratio": 1.0
    },
    {
        "title": "Worked with Bellwether Coffee Roasters this week and was gifted a bag of James Hoffmanns solar roasted custom profile coffee from his latest video! Thought y’all might find it interesting.",
        "author": "LoMeinBoi",
        "url": "https://i.redd.it/so8bc7ykrwia1.jpg",
        "text": "",
        "created_utc": 1676691135,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get me into coffee",
        "author": "RaichuZap",
        "url": "https://www.reddit.com/r/Coffee/comments/1155r5c/get_me_into_coffee/",
        "text": "Hi all! I’m a big tea drinker. Despite trying to drink coffee I’ve just never enjoyed it. I find the flavour bitter and unappealing, no matter the kind I try. However I like coffee flavoured chocolate and coffee cake, so there must be a way. Any suggestions would be greatly appreciated!",
        "created_utc": 1676691085,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dark Chocolate Mocha 🌑 what’s your favorite kind of #sipping #chocolate ? #shorts #coffee #cafe",
        "author": "Apaxngh1",
        "url": "https://youtu.be/DZcfvDwknkQ",
        "text": "",
        "created_utc": 1676687321,
        "upvote_ratio": 1.0
    },
    {
        "title": "What am I missing out on by not using a Moka pot?",
        "author": "FlittyO",
        "url": "https://www.reddit.com/r/Coffee/comments/1153086/what_am_i_missing_out_on_by_not_using_a_moka_pot/",
        "text": "",
        "created_utc": 1676682500,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best espresso maker - not loud!",
        "author": "Training_Ad_4162",
        "url": "https://www.reddit.com/r/Coffee/comments/1152wcg/best_espresso_maker_not_loud/",
        "text": "What’s the best espresso, macchiato , etc fancy drink machine? It just can’t be loud like those small Nespresso are… something quiet would be amazing since it’s going to be outside of a bedroom area. Don’t care how much I suppose.. so hit me with all your best recs! Also, freestanding - not built in!!",
        "created_utc": 1676682190,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a v60 Worth Getting Familiar With?",
        "author": "Skoddie",
        "url": "https://www.reddit.com/r/Coffee/comments/1152nx4/is_a_v60_worth_getting_familiar_with/",
        "text": "I'm shy to admit it, but I don't think I fully understand what a v60 is \"about\". My preferences for coffee currently are for lighter roasts brewed at a high coffee to water ratio for a strong cup with a lot of mouthfeel. There is a lot of discussion here &amp; elsewhere around getting good coffee with a v60, but I haven't been able to decide if what counts as 'good' by v60 standards is a style of coffee I'm interested in. That said, it would be easy for me to start playing with one given my current setup, and the cost isn't terribly high, but I'm unsure if the time investment of dialing in my cup with a v60 would give me coffee I enjoy.  \n\n\n**Current setup:**\n\n* Stagg EKG Kettle\n* Baratza Encore\n* Aeropress\n* Prismo attachment\n   * I double the metal filter/gasket with a paper filter\n* Hario v60 drip scale\n* Filtered water\n\n**Current Default Recipe:**\n\n* 20g\\* light or medium roasted coffee\n   * Currently drinking Moongoat Yeast Nic &amp; Colo Rosas\n* 200ml of water @ 95°\n* 2 minute brew\n* 30 second settle following swirl\n* Pressed through with minimal pressure to open the Prismo in \\~30 seconds\n\n*\\*I am not currently measuring the weight after grinding*  \n\n\nThis produces a high strength (ratio wise) cup that tastes decently extracted and feels heavy &amp; thick in the mouth. I am very pleased with this recipe, and wouldn't be unhappy to drink it every day for the rest of time.  \n\n\n**Given this background, is there anything a v60 could offer that would either exceed the interesting qualities of the coffee I'm making now, or if nothing else, provide some flavor variety in the coffee I'm drinking?**",
        "created_utc": 1676681525,
        "upvote_ratio": 1.0
    },
    {
        "title": "Every new grinder has been a huge leap in coffee quality",
        "author": "RenGoesMad",
        "url": "https://www.reddit.com/r/Coffee/comments/11521r0/every_new_grinder_has_been_a_huge_leap_in_coffee/",
        "text": "You just never know how much better something can be until you experience it yourself. I'm on my 4th new grinder in 2 years. The first upgrade to a proper grinder was a Baratza Encore coming from a $20 blade grinder. That was when I actually started adjusting grind size and learning how it affects taste. I was experimenting a lot and getting  a big mixed bag of results, but sometimes I nailed it and was really impressed. After seeing what sifting out the fines did with that grinder I realized that there are probably more accurate grinders I could get to have that cleaner taste I noticed when I sifted.  I would lose about 30% of the coffee when I was sifting so it seemed to make financial sense to get something that wouldn't need that step. I still love the encore for big french press batches, but it doesn't get much use otherwise. \n\nHand grinders appealed to me because it looked like they were built very solid and would likely have tight calibrations. Also, they are much less compared to the high-end electric ones. The JX from 1zpresso was what I settled on since I do mostly pour over and didn't need ultra fine capability. I have to say it was a huge upgrade and I though I was done until the burrs wore out. Well it took about a year to realize I can't fine tune my methods any further to improve the taste. Again, I would sift fines and notice that increased clarity I was after. Even though it tends to taste a little watery when you sift the fines thoroughly I could tell I wanted the taste to move in this direction. I wanted more acidity, more fruity notes, less bitter, dark notes. \n\nThe latest, and king thus far, is the recently acquired ZP6 special. I felt stupid for buying it because I didn't fully believe it could be much better coming from the same company with a very similar looking burr. It was a worthwhile leap of faith. I tried to visually match the grind size I was already at on the JX. The first batch was a little astringent at 70 clicks, but going down to 60 on the second was incredible. I'm going to keep going finer until I'm close to where I started flavor wise and then find the sweet balance in the middle. If I had to put a number on it I'd say it's 25-30% more delicious than my average cups with the JX. Flavors are popping out now that were well buried before. It's like there was a flavor fog in my mouth and it's finally cleared and I can see what was there all along. \n\nI'm using the new Tetsu Kasuya switch recipe atm and loving it. I always prefer the switch for natural coffees for some reason. \n\nI'm curious what other grinders people have had this experience with. It would be nice to go electric some day when I have the funds to treat myself. \n\nI have no affiliation with any of these companies and do not care if you love them or hate them. I'm just interested in drinking great coffee every day.",
        "created_utc": 1676679730,
        "upvote_ratio": 1.0
    },
    {
        "title": ":)",
        "author": "Comfortable_Edge4671",
        "url": "https://i.redd.it/jxaksm0nqvia1.png",
        "text": "",
        "created_utc": 1676678719,
        "upvote_ratio": 1.0
    },
    {
        "title": "BDB steam boiler heating issue",
        "author": "OkAd1706",
        "url": "https://www.reddit.com/r/Coffee/comments/1150xmn/bdb_steam_boiler_heating_issue/",
        "text": "Purchased a second hand breville dual boiler which wouldn’t hold temp and had a small leak. Opened up and inspected to find a couple common o ring leaks which I then replaced with a full o ring set and now no longer leak.\n\nThe steam temp is set at 135C, only gets up to 113 (sometimes less) then starts dropping. I tried emptying boilers and refilling a few times, now it doesn’t produce steam out of the wand at all and water isn’t hot when emptying steam boiler.\n\nWhen I empty it and turn back on it starts at about 70-80 degrees, is that normal or should it be lower due to being empty and filling with cold water.",
        "created_utc": 1676676618,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which coffee design is better?",
        "author": "Haru825",
        "url": "https://www.reddit.com/r/Coffee/comments/1150po1/which_coffee_design_is_better/",
        "text": "So, I'm an ambassador for a coffee drink brand would it be possible for a few people to fill out a google form to see which design is better? It is completely anonymous.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/wy63rhq31uia1.png?width=677&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=a455d9950f6da96f96b68e798e5f82bedd2d798e",
        "created_utc": 1676676023,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which coffee design is better",
        "author": "Haru825",
        "url": "https://www.reddit.com/r/Coffee/comments/1150oqa/which_coffee_design_is_better/",
        "text": "So, I'm an ambassador for a coffee drink brand would it be possible for a few people to fill out a google form to see which design is better? It is completely anonymous.  \n For the referred part you can put Susan OSU \n\n&amp;#x200B;\n\nhttps://preview.redd.it/dyozzddv0uia1.png?width=412&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=8e2f188dcaf4df2dcdede5fb2c784ee19666345e",
        "created_utc": 1676675955,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which coffee design is better?",
        "author": "Haru825",
        "url": "https://www.reddit.com/r/Coffee/comments/1150nwp/which_coffee_design_is_better/",
        "text": "[removed]",
        "created_utc": 1676675890,
        "upvote_ratio": 1.0
    },
    {
        "title": "anybody else find a rock in there coffee beans?",
        "author": "GL_Carl",
        "url": "https://i.redd.it/7ycmgk45ivia1.jpg",
        "text": "",
        "created_utc": 1676675856,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which coffee design is better?",
        "author": "Haru825",
        "url": "https://www.reddit.com/r/Coffee/comments/1150mbv/which_coffee_design_is_better/",
        "text": "[removed]",
        "created_utc": 1676675770,
        "upvote_ratio": 1.0
    },
    {
        "title": "Plumbed in coffee machine",
        "author": "BirdieV29",
        "url": "https://www.reddit.com/r/Coffee/comments/114zhpl/plumbed_in_coffee_machine/",
        "text": "Any recommendations for plumbed in coffee makers? There doesn’t seem to be a lot on the market. Would be for my home but we do drink quite a bit daily. We want something reliable, good quality, even open to something that also had espresso options.",
        "created_utc": 1676672770,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aeropress as a lever machine?",
        "author": "Flonjon",
        "url": "https://www.reddit.com/r/Coffee/comments/114z1e8/aeropress_as_a_lever_machine/",
        "text": "Hey,\n\nSo I have been trying to dial in my grind on my Aeropress for a minute and didn't realize my grinder wasn't aligned. I was getting bitter and sour coffee. After I aligned it though it started tasting kind of flat and hollow. So I just kept grinding finer till I was grinding two clicks from the burrs touching. Pushing the water through on such fine grounds was a serious workout, but the coffee is pretty flavorful and not bitter surprisingly. \n\nHas anyone tried this?\n\nCheers,\nFlonjon",
        "created_utc": 1676671611,
        "upvote_ratio": 1.0
    },
    {
        "title": "Check out my best selling coffee mug - May the coffee be with you!",
        "author": "ShinePuzzleheaded530",
        "url": "https://www.reddit.com/r/Coffee/comments/114yyir/check_out_my_best_selling_coffee_mug_may_the/",
        "text": "[removed]",
        "created_utc": 1676671401,
        "upvote_ratio": 1.0
    },
    {
        "title": "Great...",
        "author": "OverlordVII",
        "url": "https://i.redd.it/c6vyatwn1via1.jpg",
        "text": "",
        "created_utc": 1676670315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anybody familiar with 5.5bar pseudo espresso? Any tips?",
        "author": "Separate_Wave1318",
        "url": "https://i.redd.it/t3vorwebruia1.jpg",
        "text": "",
        "created_utc": 1676666831,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nespresso machine at work, anyone have tips to make *less* sh*t espresso.",
        "author": "crustation1",
        "url": "https://i.redd.it/o55uvg8tpuia1.jpg",
        "text": "what can be done? seems like there isn’t even enough coffee in the pods to pull more than a true single, cofffee also brews incredibly quick",
        "created_utc": 1676666328,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this comparison true? 2 different acid types?",
        "author": "jehCe",
        "url": "https://i.redd.it/gvdq6h7vzsia1.jpg",
        "text": "",
        "created_utc": 1676663492,
        "upvote_ratio": 1.0
    },
    {
        "title": "wanna know good coffee shops at east coast, US, please share what you got.",
        "author": "No-Assignment6962",
        "url": "https://www.reddit.com/r/Coffee/comments/114vlxx/wanna_know_good_coffee_shops_at_east_coast_us/",
        "text": "hello good people, \n\ni am korean in korea, drinking coffee mostly by cheap powders.\n\nnext month gonna visit north carolina and surrounding area for weeks.\n\nso i hope to know what is good places to have good coffee place, in advance.\n\nif anyone knows some good places near 27514, please let me know, thank you !!!!",
        "created_utc": 1676662917,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your favorite Light/Medium roast brand in the U.S.?",
        "author": "ocean432",
        "url": "https://www.reddit.com/r/Coffee/comments/114vhk9/whats_your_favorite_lightmedium_roast_brand_in/",
        "text": "I'm really enjoying using an old percolator and would like to try something really high quality as a treat to myself.   Suggestions appreciated.",
        "created_utc": 1676662605,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can we talk about the Orea 3 brewer?",
        "author": "Wendy888Nyc",
        "url": "https://www.reddit.com/r/Coffee/comments/114vg5a/can_we_talk_about_the_orea_3_brewer/",
        "text": "The Orea 3 is popular now, probably due to popular YouTube creators and a recent SCA World Cup champion using the brewer to win. Do those of you who have it consider it a \"game changer\" or even a brewer worth owning; does it make your brews taste better than other flat-bottom brewers? (I have Kalita 155 and Stagg X which never clog)\n\nDoes the Negotiator filter thing make such a difference, or is using the Kalita filters good too. Then there's the no by-pass recipe; is that a big deal when using the brewer? Please share anything about the Orea 3 if you're using it.",
        "created_utc": 1676662505,
        "upvote_ratio": 1.0
    }
]