[
    {
        "title": "need advice on what coffee machine to buy",
        "author": "carrot_cake_99",
        "url": "https://www.reddit.com/r/Coffee/comments/1045m18/need_advice_on_what_coffee_machine_to_buy/",
        "text": "Hi,\n\nSo, I've been spending a lot of money during college on Starbucks and am looking for a more affordable long-term option. Last week, I tried my buddy's Dunkin' ground coffee blend variety and was absolutely blown away by the taste. I'm sure there are much better ones too. \n\nCan anyone here link me to a decent coffee machine under $100 and throw some suggestions as to which packs taste best? Also, I'm specifically looking for ground &gt; k pods since I have heard the pods are much more expensive.\n\nThanks!",
        "created_utc": 1672941985,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the strangest parameters you’ve brewed with?",
        "author": "The_BrainFreight",
        "url": "https://www.reddit.com/r/Coffee/comments/1045fq0/what_are_the_strangest_parameters_youve_brewed/",
        "text": "I had this one light roast Colombian where I had to grind it absurdly coarse for a full well expressed flavour.\n\nI have a really hard time dialing in but when I do (near the end of a bag) I’m ecstatic and my days couldn’t be better (even if I’m stuck on the toliet afterwards)",
        "created_utc": 1672941597,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fellow Opus Grinder Announced at CES. 40mm Conical Burrs, Claims of Espresso-French Press, $195, Available February 21st",
        "author": "-Tommy",
        "url": "https://www.reddit.com/r/Coffee/comments/10455nx/fellow_opus_grinder_announced_at_ces_40mm_conical/",
        "text": "From Engadget:\n\nhttps://www.engadget.com/fellow-opus-grinder-first-look-ces-2023-042743290.html\n\nThis looks like it’s a competitor to the Encore. Interested to see if it includes the de-ionizer from the Ode V2 and how well it performa for espresso at this price point. \n \nThoughts?",
        "created_utc": 1672940903,
        "upvote_ratio": 1.0
    },
    {
        "title": "the new baby creepypasta",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/104467d/the_new_baby_creepypasta/",
        "text": "she is walked in the elephant it can make the dinosaur fossil so i build the mammoth and i build the cenozoic animal it was the largest mammals called the elephant after build the pachyderm in the Africa she is went to the sleep at the bed \n\nthe whole pregancy i had the nightmare of the baby after the COVID 19 it was closed down and open on June 24th 2021 \n\nwhen i heard the news would be the little girl i prepared to the house she is would be the evil plan z the letters of the alphabet ends with the y there will be evil plan z her name is Rosie \n\nRosie's father is not happy he was always smoking the dirty cigarette he gets pissed at every night and so i miss Rosie \n\nin the Janaury 7 2023 i knocked on the door a fake smile \n\nshe is on the security camera after the few months \n\nyou stupid son of a b🟥🟦🟩🟨🟪\n\nshe was the gorilla and the baby she is all like this \n\nshe is on the tragic van crashed the YouTube channel terminated due to the violators copyright strike \n\nshe is died on the van crashed she is put cockroaches came out of my mouth",
        "created_utc": 1672938517,
        "upvote_ratio": 1.0
    },
    {
        "title": "What grind size for steeped coffee in a tea bag",
        "author": "Novir_Gin",
        "url": "https://www.reddit.com/r/Coffee/comments/10445ro/what_grind_size_for_steeped_coffee_in_a_tea_bag/",
        "text": "Hello\n\nI enjoy going camping and on my last trip to scotland I found these tea bags filled with coffee and thought that'd be perfect for camping. The resulting coffee wasn't anything super special but much better than instant coffee and less hassle then cowboy coffee.\n\nNow I would like to make my own bags (fresh and high quality beans) but I am unsure about the grind size. I am using a knock aergrind and usually brew with an aeropress.\n\nMany of you will probably try to crucify me for being so blasphemous but this is about convenience.",
        "created_utc": 1672938489,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] Show off your gear! - Battle-station Central",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/10445dp/mod_show_off_your_gear_battlestation_central/",
        "text": "Let's see your battle-stations or new purchases! Tell us what it is you have, post pictures if you want, let us know what you think and how you use it all to make your daily Cup of Joe.\n\nFeel free to discuss gear here as well - recommendations, reviews, etc.\n\nFeel free to post links to where people can get the gear but please no sketchy deal sites and none of those Amazon (or other site) links where you get a percentage if people buy it, they will be removed. Also, if you want battle-stations every day of the week, check out /r/coffeestations!\n\nPlease keep coffee station pictures limited to this thread. Any such pictures posted as their own thread will be removed.\n\nThanks!",
        "created_utc": 1672938464,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bodum Chambord French Press Plastic Filter Removal",
        "author": "cbright09",
        "url": "https://www.reddit.com/r/Coffee/comments/104447w/bodum_chambord_french_press_plastic_filter_removal/",
        "text": "Hi I was wondering if anyone has removed their plastic filter from the Chambord presse before and what nuts and bolts I would need to use to keep using it plastic free press by chance",
        "created_utc": 1672938383,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gaggia Classic- can I use the crema perfetta filter after changing the OPV spring?",
        "author": "iddmmd",
        "url": "https://www.reddit.com/r/Coffee/comments/10441jz/gaggia_classic_can_i_use_the_crema_perfetta/",
        "text": "Hello,\n\nI just ordered the 9 bar OPV spring and a bottomless portafilter to try and step up my game.  However, my wife loves heavy crema and wants to keep using the creme perfetta filter.  Does that filter require the 12 bar pressure of the stock machine?  If I change the spring, will it stop working?  If I don't change the spring will my bottomless filter coffee taste bad?  We have a decent grinder that seems to work well with the machine currently.\n\nThanks for the help.",
        "created_utc": 1672938204,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone tried UJJO Hot Sauce for Drinks in their coffee?",
        "author": "doubleflusher",
        "url": "https://www.reddit.com/r/Coffee/comments/1043t5z/has_anyone_tried_ujjo_hot_sauce_for_drinks_in/",
        "text": "My daughter bought me both the mild and hot versions. I'm honestly a little scared to try them. Just wanted to hear any opinions before I besmirch my perfect brew.",
        "created_utc": 1672937657,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lois's suicide creepypasta",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/1043nb2/loiss_suicide_creepypasta/",
        "text": "the creepypasta was the scary story about the animated TV show Richard the cockroach \n\nas you may animation TV on the Sega airing in the 2017 rated TV channels \n\nadult cartoons on TV very disturbing kids movie that ruin childhood of the TV episodes with the first episode in season 2 \n\nthe animation flip card and videos final cut of the season 0 fear of the quahog city i was complained \n\nthe theme song played as the piano and episode began Lois playing with the traingle follow end of an the parasite concert \n\nthe episode with the concert ended discontented loudly the eyes glowing red at the the end of the concert \n\nby that door there was no sound in the movie for about 30 seconds be heard in the background \n\nthe camera zoomed into the Lois face sobbing and evil the screen turned censored blur after 30 seconds \n\nthe animation turned volume 0% his stomach sliced open and filled with the human blood \n\nit was sick he was still sobbing blood coming from his eyes the blood is now the kids film \n\nshe is laying down on the brain there were squashes all over his brain rushed out into the spider web \n\nthere was no sound they were blood shot of the camera he put his claws down bloody tears on the hair as the deep voice laughter returned \n\nshe is open the stomach door pulling out of the intestines vomitted on the brain \n\nshe is call the police to watch the video in 15 minutes later \n\nshe became deep voice the camera pulled back she is put the dog fur in the mouth \n\nthe huge explosion with the animated blood and hammer splattered against the horse tail she is on the lungs above the brain the episode cut to the end credits animation directors \n\ni was so sick swollen and red so i was figure out \n\nwho worked on the kids movie she is like the sonic the hedgehog movies it was viruses malware and 500 error codes she is got blue screen of death \n\ndue to the animated movies i got the no clue nobody to the Sega animation who ever happened",
        "created_utc": 1672937258,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Chemex is making me lose my mind!!!!!!!",
        "author": "BodyComprehensive594",
        "url": "https://www.reddit.com/r/Coffee/comments/10439lp/my_chemex_is_making_me_lose_my_mind/",
        "text": "Everyone raves about how amazing the Chemex is but I’ve been experimenting for 3 weeks now following different guides online and haven’t been able to produce a single good cup of coffee.\n\nCurrently I’m grinding my beans very course, using high quality medium roast beans, heating filtered water to 200 degrees, following the bloom / pour timing….. and yet…. It’s trash.\n\nMy main issue recently has been that it keeps producing a very bitter brew no matter how many variables I change. Where is the smoothness I was promised!",
        "created_utc": 1672936312,
        "upvote_ratio": 1.0
    },
    {
        "title": "dead tails doll creepypasta",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/1042pyc/dead_tails_doll_creepypasta/",
        "text": "the creepypasta story of the lost episode to the exist \n\nwhen they airing the tails doll TV show the episode number the TV station was the lost episode the episode 666 they called the dead tails doll \n\nabout this missing episode the lost episode created by the gamejolt it was too quiet \n\nwas made later 666th episode existence yes oh course exactly \n\ntalk about the tails doll they became angry to forbid it \n\nin fact asked the lost episode ending the question \n\na few years ago after the event when i happened to lost episode \n\ngrabbed the paper rushed out of the building \n\ni typed the url it had the website address and it to me website \n\ni clicked on the link a video start downloading i clicked play the file was dead tails doll flv \n\nthe sonic doll looked so depressed the knuckles doll was angry with the villain and evil for his toys \n\ntails doll sonic doll knuckles doll Amy doll and shadow doll go on the holiday at the Canada however the blimp was taking off the blimp taking videos the ocean at the camera tails doll broke the window and was crashes to the sea to get the life jacket and life car it showed tails doll lying on the coral live action showed photo real life of his mangled corpse \n\nthe sonic doll was sitting at the kitchen table as the crying more pained and real life the screen was bluring shadows looking in the door \n\nsobbing and crying it was at the very end a title card reading 1 year later she is looking at the fridge there was no sign of the goldfish \n\nsonic doll knuckles doll and Sally doll visit the tails doll's grave walked towards the cemetery all of the houses looked abandoned when they reached the grave tails doll laying on the tombstone just like did before\n\nthe camera zoomed inside the sonic doll's mouth and the uvula is disgusting they got the security camera on the mouth wall the episode came to the close at the the end there were no credits no one heard at the 2017 date of death \n\nfor gueests who have died like carlos do carmo and Peter Ackerman dates of the deaths the final scene of the tails doll with the corpse tails doll in real life \n\nwhen the movie is over try to use the tombstones death of people who are still alive \n\nhowever guest star was died yet \n\nall of the deaths are listed same date",
        "created_utc": 1672934939,
        "upvote_ratio": 1.0
    },
    {
        "title": "Slowly getting better at latte art. Any tips or tricks from you guys?",
        "author": "Pete_da_yete",
        "url": "https://i.redd.it/v2s0zlz2haaa1.jpg",
        "text": "",
        "created_utc": 1672934471,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doom?",
        "author": "Swimming-Potato-300",
        "url": "https://www.reddit.com/r/Coffee/comments/1042a8l/doom/",
        "text": "I hadnt had coffee in years and my old coworker tried to hook me on coffee, so she bought me a large something something from Dunkin. I drank it and later wanted so badly to rip all my flesh off and it was one of the worst feelings I have ever experienced",
        "created_utc": 1672933868,
        "upvote_ratio": 1.0
    },
    {
        "title": "First time I see a hollow bean",
        "author": "pclement",
        "url": "https://www.reddit.com/r/Coffee/comments/10417az/first_time_i_see_a_hollow_bean/",
        "text": "Anybody else ever noticed strange beans like this one? It is a beauty!\n\nhttps://preview.redd.it/7fw0pl8tp8aa1.png?width=1598&amp;format=png&amp;auto=webp&amp;s=eeb6352e59f7d714c0d5e42a7aaae2189adef088",
        "created_utc": 1672931279,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good Place to Start?",
        "author": "JackieJams",
        "url": "https://www.reddit.com/r/Coffee/comments/10405h2/good_place_to_start/",
        "text": "I worked as a barista and really fell in love with coffee, though I left that job around 6 months ago I've been getting a lot more interested in coffee, where would you recommend as starter hobby equipment?\n\nI just picked up some quality locally roasted coffee beans (I'm from around Seattle) and thinking of getting a Chemex as my first pour over but figured I'd see what people that are more in tune with all this would recommend.",
        "created_utc": 1672928669,
        "upvote_ratio": 1.0
    },
    {
        "title": "New to espresso making",
        "author": "solskjaer92",
        "url": "https://www.reddit.com/r/Coffee/comments/103zdo8/new_to_espresso_making/",
        "text": "Hi, I’m new to making espresso, but have been drinking coffee for years with French press. I was wondering if anyone had any tips? Im using bean to cup machine with customisable grind.\n\nIm struggling to stop the espresso flowing before 8 seconds, is usually 6-7 seconds. Despite grinding finer nothing seems to delay the flow of coffee.\n\nAre some bean origins better for espresso than others? I love my yirgacheffe but wondered if it wasn’t the best for espresso. The crema is disappointing.\n\nThanks in advance for any comments!",
        "created_utc": 1672926549,
        "upvote_ratio": 1.0
    },
    {
        "title": "Leaking group head on my Delonghi Dedica, even after recently changing seal",
        "author": "berlinson",
        "url": "https://www.reddit.com/r/Coffee/comments/103ys1l/leaking_group_head_on_my_delonghi_dedica_even/",
        "text": "Recently, this has been happening with our almost three year old Dedica, and I don't know why. The machine still puts out a shot of espresso, but liquid now runs down the side of the portafilter, as well as out of the spouts where the coffee would usually pour in to the cup. The portafilter is not being overloaded with coffee at any time, and there are no other signs that there is anything wrong with the machine. I changed the group head seal about four weeks ago. Ideas?",
        "created_utc": 1672924802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Timemore C3 vs 1zPresso Jx",
        "author": "KBDFan42",
        "url": "https://www.reddit.com/r/Coffee/comments/103wx8x/timemore_c3_vs_1zpresso_jx/",
        "text": "The C3 is around 60USD where I live, and the JX is 110USD. Do you think the JX is that much of an upgrade over the C3? I solely brew pourover.",
        "created_utc": 1672918833,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which idiot forgot to remove the preheat water 🙋‍♂️",
        "author": "2211mg",
        "url": "https://i.redd.it/183p9qfb09aa1.jpg",
        "text": "",
        "created_utc": 1672916728,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] The Daily Question Thread",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/103w8ao/mod_the_daily_question_thread/",
        "text": " \n\nWelcome to the daily [/r/Coffee](https://www.reddit.com/r/Coffee) question thread!\n\nThere are no stupid questions here, ask a question and get an answer! We all have to start somewhere and sometimes it is hard to figure out just what you are doing right or doing wrong. Luckily, the [/r/Coffee](https://www.reddit.com/r/Coffee) community loves to help out.\n\nDo you have a question about how to use a specific piece of gear or what gear you should be buying? Want to know how much coffee you should use or how you should grind it? Not sure about how much water you should use or how hot it should be? Wondering about your coffee's shelf life?\n\nDon't forget to use the resources in our [wiki](http://www.reddit.com/r/Coffee/wiki)! We have some great starter guides on our [wiki \"Guides\" page](https://www.reddit.com/r/Coffee/wiki/guides) and [here is the wiki \"Gear By Price\" page](http://www.reddit.com/r/Coffee/wiki/gear#wiki_coffee_gear_suggestions) if you'd like to see coffee gear that [/r/Coffee](https://www.reddit.com/r/Coffee) members recommend.\n\nAs always, be nice!",
        "created_utc": 1672916412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aeropress vs Moka Pot: Which is the Better Brewer?",
        "author": "Homegrounds",
        "url": "https://www.homegrounds.co/aeropress-vs-moka-pot/",
        "text": "",
        "created_utc": 1672913867,
        "upvote_ratio": 1.0
    },
    {
        "title": "good morning",
        "author": "ShamaAlR0maithi",
        "url": "https://i.redd.it/uwkidmyk87aa1.jpg",
        "text": "",
        "created_utc": 1672913301,
        "upvote_ratio": 1.0
    },
    {
        "title": "7 Best Coffee Urns in [Y] (Detailed Reviews)",
        "author": "Homegrounds",
        "url": "https://www.homegrounds.co/best-coffee-urns/",
        "text": "",
        "created_utc": 1672910274,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee Everyday！",
        "author": "HaoJ0324",
        "url": "https://i.redd.it/d681wkmkq6aa1.png",
        "text": "",
        "created_utc": 1672907242,
        "upvote_ratio": 1.0
    },
    {
        "title": "ERC",
        "author": "OneInteraction1",
        "url": "https://ercfilenow.com/desire77",
        "text": "",
        "created_utc": 1672904201,
        "upvote_ratio": 1.0
    },
    {
        "title": "creepypasta bendy thee unknown episode",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/103slhm/creepypasta_bendy_thee_unknown_episode/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/bhy793k876aa1.jpg?width=690&amp;format=pjpg&amp;auto=webp&amp;s=611e65d96a6ae614765eaa028ea8ef6e87f44829\n\ni am terrible episode of the bendy don't judge me i hate bendy and the ink machine when i opened the door she is run to the mail box down stairs had every chapters 1-3 \n\na few weeks later i got the phone call for my grandma i picked up the phone it has no problem she is put it on the TV room there was 1 episode primeval ink but there was going \n\nthe song played with a 34 year old bendy carrying the new born Boris she is playing with the baby toys about in the 10 seconds the room is dark Boris bites the bendy's finger \n\nthe title card from the episode just an black background it was blood black \n\nBoris running from the bendy's train toy in that night she is holding the flashlight walls drawn on the blood and pointing the gun why did make out the Boris \n\nbendy woked up in the ocean she is on the coral a few momments later he found the eel i vomit my lobster she is stab him in 15 times before a demon shows up YOU F INK INK DEVIL YOU BLACK LIQUID B \n\nshe is arrived at home reached the art room from my camera then came up disturbing image bendy's headless body lay on the ink box the static filled with the TV screen it turn black just disapeared into the text it says the end is near the blast screaming of the speakers it were on 100% volume i turn it down to the 37% it was the noise i was really scared i fall the TV on the floor and destroyed it with a axe she is just the parrot fish on the blue background they throw the TV into the grass \n\nso i went to my bathroom she is goes to the hotel and sleep on the living room tonight with a bed i woked up from the hotel i went to my kitchen and cooking the tiger prawns i arrested from my police car the cops say that on the bendy episode i was on the news report at the news 9 i was correct with the videos and sounds on the episode footage",
        "created_utc": 1672902853,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best tasting coffee maker",
        "author": "MattelBEAST",
        "url": "https://www.reddit.com/r/Coffee/comments/103sgmw/best_tasting_coffee_maker/",
        "text": "I am looking for a new coffee machine. I had a philips bean to cup machine and found it good, but the milk frothing was not the best. Now I am looking for an alternative. From my research delonghi and sage (breville) are top picks for me. I am not sure if the \"hassle\" with sage (it is not fully automatic) is worth it for me. I would like to compare the coffees they both make, but I do not have access to them. Does anybody have experience with these brands? Can you suggest any other machine?\n\nThe specific models I was looking into is DeLonghi Prima Donna, Sage Barista and Sage Oracle Touch.\n\nI would like to spend under 1200 EUR, but could splurge 2500 EUR if the machine makes the coffee I want.",
        "created_utc": 1672902371,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fellow releasing new sub-$200 grinder",
        "author": "jamandahalf",
        "url": "https://www.engadget.com/fellow-opus-grinder-first-look-ces-2023-042743290.html",
        "text": "",
        "created_utc": 1672901636,
        "upvote_ratio": 1.0
    },
    {
        "title": "Expensive coffee",
        "author": "noce96",
        "url": "https://www.reddit.com/r/Coffee/comments/103s6i8/expensive_coffee/",
        "text": "Does anybody know any really good expensive premium coffee, micro-lot I believe it's called. I was watching a video on YouTube about the difference between cheap and expensive coffee and some of the expensive coffees that were reviewed got up to $80 a pound. Would like to have some for special occasions. Like whatbis the cream of the crop coffee?",
        "created_utc": 1672901412,
        "upvote_ratio": 1.0
    },
    {
        "title": "talk:nlhj8ghc8t9a1.jpg",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/103row9/talknlhj8ghc8t9a1jpg/",
        "text": "the iPhone 15 comes to the alive they got home from the apple store let me guess after the iPhone creepypasta \n\ntroll pasta \n\n1 keeps trolling the item at this file \n\n2 keep buying the iPhone 15 pro at the apple store \n\n3 just the creepypasta monster or even the iPod pro \n\n4 so this is the just fans at the apple store \n\n5 introducing iPhone 666 having the event cinemas movie theatre TV spots and iPhone commercials \n\n6 restart the computer to keep the launching the apple pro \n\nthe fan link \n\nit was over by the unikitty \n\n[https://www.reddit.com/user/Unlikely-Coffee-3077/comments/1026bg3/iphone\\_666\\_iphone\\_15\\_of\\_the\\_hell\\_the\\_creepypasta/](https://www.reddit.com/user/Unlikely-Coffee-3077/comments/1026bg3/iphone_666_iphone_15_of_the_hell_the_creepypasta/)",
        "created_utc": 1672899755,
        "upvote_ratio": 1.0
    },
    {
        "title": "My setup today went from this to the second picture",
        "author": "cbars100",
        "url": "https://www.reddit.com/gallery/103qvkq",
        "text": "",
        "created_utc": 1672897156,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have experience with this product?",
        "author": "HaoJ0324",
        "url": "https://i.redd.it/04ywjjluv5aa1.jpg",
        "text": "",
        "created_utc": 1672896963,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sour Coffee on my breville barista express",
        "author": "Viper6447",
        "url": "https://www.reddit.com/r/Coffee/comments/103qng3/sour_coffee_on_my_breville_barista_express/",
        "text": "I recently got a BBE and have pulled shots with the right pressure, at a ratio of 1:2, at around 27 seconds and with 16 g but my shots are still super sour! Is there anyway I can fix this to get my shots tasting better?",
        "created_utc": 1672896447,
        "upvote_ratio": 1.0
    },
    {
        "title": "TOMT Coffee Edition - a coffee for going to bed?",
        "author": "BUY_GUNS_TAKE_LSD",
        "url": "https://www.reddit.com/r/Coffee/comments/103p8oo/tomt_coffee_edition_a_coffee_for_going_to_bed/",
        "text": "Having a moment where I think I might have been in an alternate dimension here: maybe three or four years back, I was able to buy a certain (now forgotten) brand of **decaf coffee that was designed for nighttime consumption.** As best I can remember, it was from a somewhat **major brand** (i.e. Dunkin, Lavazza, not a small roaster) and likely had a **purple logo.** It was a pretty decent and tasty cup of coffee, especially considering the whole decaf/night gimmick.\n\nIt was decaffeinated obviously and IIRC had another ingredient that was supposed to relax you or induce sleep, possibly chamomile. I was buying this in the Philadelphia metro area and actually only ever found it in one particular Acme grocery store. Searching Acme's website and the internet at large has yielded no results. Does anyone know what I am talking about? I greatly appreciate any leads!!",
        "created_utc": 1672892191,
        "upvote_ratio": 1.0
    },
    {
        "title": "How To Make Cannabis-Infused Coffee",
        "author": "Forbritipoe",
        "url": "https://medicatedroots.com/how-to-make-cannabis-infused-coffee/",
        "text": "",
        "created_utc": 1672892157,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about Gevalia varieties.",
        "author": "GlueSprayingMushroom",
        "url": "https://www.reddit.com/r/Coffee/comments/103p1vy/question_about_gevalia_varieties/",
        "text": "For any Gevalia drinkers out there- does anyone have a comparison of the:\n\n- Signature blend\n- House blend\n- Traditional blend\n\n\nThanks!",
        "created_utc": 1672891638,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm Noob with a moka coffee pot looking to get into non instant coffee any recommendations for grinders &amp; grind coarseness?",
        "author": "MemeSupreme9",
        "url": "https://i.redd.it/6n7g442gw6aa1.jpg",
        "text": "As the title suggests I'm completely new to the coffee world. I've been drinking pretty much nothing but instant coffee at home (which i have a picture of in this post) most of the time and/or your generic cappuccino / mocha at cafe's. \n\nI want to broaden my horizons a bit (both in terms of flavour and style of coffee) and have been watching some James Hoffman videos (one randomly came up on my feed and because I was looking into coffee I figured I'd have a look). He recommended that grinding at home has multiple benefits regarding the storage, and degradation of coffee etc as opposed to pre ground beans.\n\nI'm not against buying ground coffee but I'm also curious about home ground coffee. I've looked at a few grinders but it seems a bit difficult to tell the difference and whether I should go manual or automatic. \n\nPrice wise I'm looking for something affordable so probably up to AU $100-150 would be my budget. Any advice or recommendations would be greatly appreciated 🙂",
        "created_utc": 1672891212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee in Bergamo/Milan Italy",
        "author": "Andreacassar",
        "url": "https://www.reddit.com/r/Coffee/comments/103osw5/coffee_in_bergamomilan_italy/",
        "text": "Hello everyone, next week I'm going to spend 5 days mainly in Bergamo and Milan and I'm looking for any coffee shops you people will recommend a visit. I will also spend a day around Brescia and Monza. Thanks in advance.",
        "created_utc": 1672890930,
        "upvote_ratio": 1.0
    },
    {
        "title": "Heey everyone,",
        "author": "Icy-Literature5175",
        "url": "https://www.reddit.com/r/Coffee/comments/103ntib/heey_everyone/",
        "text": "I have a question regarding v60 manually brewed coffee. I read that the water temperature used affects the acidity/bitterness of coffee taste. Can anyone explain this? \nThanks",
        "created_utc": 1672888160,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any surefire way to make coffee not disgusting?",
        "author": "KomradeBulldops",
        "url": "https://www.reddit.com/r/Coffee/comments/103nk3y/is_there_any_surefire_way_to_make_coffee_not/",
        "text": "Under medical advice, I was told to start drinking coffee as it apparently helps with something I'm dealing with right now. That being said - I can not stand this stuff. I've tried different roasts, different types of coffee, and different preparation methods. I've spent well over $400 on equipment (to be fair, I went all out on the electric kettle since I am also a tea drinker) and did research before every purchase to make sure I knew what I was buying and how to use it properly. No matter what I do, the final product is revolting. As in - makes me gag 10 minutes later when I get a hint of the aftertaste that apparently lasts the rest of your natural born life. Is all coffee just hardcore dirt water? As someone that quit smoking years ago, coffee just tastes like licking an ashtray - even through literally a 1:1 coffee/milk ratio in an attempt to make it taste not disgusting. This isn't a trolling post or hateing on people that drink coffee - this is me genuinely giving this my best effort in an attempt to better my personal health and coming up completely short. I would welcome anyone that knows more about this than me to tell me where I'm going wrong. For reference, I have been hand-grinding the freshest, most sourcable, highest reputation beans I can get my hands on with an expensive, reputable hand grinder and using either a french press or drip cone. I've been following \"how-to\" videos from people like James Hoffman that seem to (at least to a complete layman) know what they're talking about and be generally well liked. I'm just at a loss and basically out of ideas on where to go from here.",
        "created_utc": 1672887458,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which one is the best: Intelligentsia or Blue Bottle Coffee?",
        "author": "tatossian",
        "url": "https://www.reddit.com/r/Coffee/comments/103n739/which_one_is_the_best_intelligentsia_or_blue/",
        "text": "Both offer great coffees, similar preparation. Which one would you rather have on a daily basis? ☕️",
        "created_utc": 1672886432,
        "upvote_ratio": 1.0
    },
    {
        "title": "Applewood Smoked Coffee",
        "author": "Sanguinus09",
        "url": "https://www.reddit.com/r/Coffee/comments/103msfn/applewood_smoked_coffee/",
        "text": "Hey all, I’m new to the whole coffee game and here’s what I’ve discovered: I love the Moka pot, the French press is a close second, black coffee is something I deeply appreciate and medium roasts are my go to. \n\nAs with everyone here, I’ve watched lots of James Hoffman and despite having only been in this coffee world for about 2 months, have really come to love it. \n\nNow, I’m not willing to buy big expensive equipment and I usually pay $20 for a pound. \n\nOne thing I’m super curious about: do you all think I can use my drum smoker to roast my coffee? I’m willing to experiment but I really think making KC bbq style coffee would be awesome, especially as a gift to a bunch of friends. No, it wouldn’t be great coffee, but maybe I could make something descent? \n\n(Oh, and if the smoker is a no go, I’m using a crappy 30$ popcorn machine from good will, lol)",
        "created_utc": 1672885315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any coffee I can buy or make in the U.S that comes close to coffee from Malta or Italy?",
        "author": "Ok-Suit6589",
        "url": "https://www.reddit.com/r/Coffee/comments/103lp01/is_there_any_coffee_i_can_buy_or_make_in_the_us/",
        "text": "",
        "created_utc": 1672882380,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any reasonably priced programmable coffee makers that don’t have plastic where the water touches?",
        "author": "thatdamnvegan",
        "url": "https://www.reddit.com/r/Coffee/comments/103lloa/are_there_any_reasonably_priced_programmable/",
        "text": "",
        "created_utc": 1672882134,
        "upvote_ratio": 1.0
    },
    {
        "title": "Breville dual boiler steam boiler problem",
        "author": "mastermjeed",
        "url": "https://www.reddit.com/r/Coffee/comments/103lfv9/breville_dual_boiler_steam_boiler_problem/",
        "text": "\nHey I a have a problem with my steam boiler in my breville whenever I plug it the steam boiler start heating without turning on the machine is there a solution?",
        "created_utc": 1672881699,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee Concept Question",
        "author": "FreestyleFootwear",
        "url": "https://www.reddit.com/r/Coffee/comments/103jfv0/coffee_concept_question/",
        "text": "I am starting up an online coffee store and was going to give it a UK royalty theme.   Further, I was going to replace the faces of royalty with dogs.. kind of like dogs playing poker.   However, my wife thinks this is offensive because of the history of coffee and the ties to colonialism. \n\nI think that's a stretch and hardly a risk of causing offense, but maybe I'm out of touch?   She equated it to Uncle Ben's rice and their need for a brand overhaul.   Thoughts?",
        "created_utc": 1672876636,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee similar to Dunkin’s original?",
        "author": "CharacterExpensive97",
        "url": "https://www.reddit.com/r/Coffee/comments/103j94i/coffee_similar_to_dunkins_original/",
        "text": "Sorry if I’m asking in the wrong section, but I’m looking for a coffee that has the same taste as Dunkin’s. It’s for a friend, she’s not into flavored coffees. Any ideas/help is welcome",
        "created_utc": 1672876175,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I order coffee without getting charged for an 'extra' shot?",
        "author": "Vivid_Scientist9931",
        "url": "https://www.reddit.com/r/Coffee/comments/103ihce/how_do_i_order_coffee_without_getting_charged_for/",
        "text": "In Australia at least, although assuming this is similar elsewhere, most coffee shops offer S/M/L takeaway coffees with 1/2/3 espresso shots in them, respectively.\n\nMy partner and I typically order one half strength M flat white (1 shot) and a small flat white with an extra shot (2 shots).\n\nTo my mind that is the exact same number of espresso shots, and even volume of milk, as ordering one standard small (1 shot) and one standard medium (2 shots) but we are always charged a fee for the 'extra' shot in the small.\n\nWhen I've tried to explain previously that I don't think we're actually getting an 'extra' shot I typically get looks which suggest that maths in the order of 1+2 is too hard, or that I'm just being difficult.\n\nHow do I order this on a shop so that it easily gets my point across please?",
        "created_utc": 1672874308,
        "upvote_ratio": 1.0
    },
    {
        "title": "FREE broken Elektra Microcasa a leva for parts (you pay shipping)",
        "author": "Janeiac1",
        "url": "https://www.reddit.com/r/Coffee/comments/103icxy/free_broken_elektra_microcasa_a_leva_for_parts/",
        "text": " I sent my machine to have the seals replaced and paid The UPS Store to  pack it. UPS destroyed the machine with rough handling (dented boiler  and bent steam wand) and so paid for a replacement. They offered me the old one back to salvage. If you are someone who works on espresso  machines, and are trying to fix one of these, there are usable parts on  my old one. US shipping will be around $45. No, I won't unpack it to  take pictures.",
        "created_utc": 1672874033,
        "upvote_ratio": 1.0
    },
    {
        "title": "7 eleven iced coffee chillers",
        "author": "HonestlyZee",
        "url": "https://www.reddit.com/gallery/103hobe",
        "text": "",
        "created_utc": 1672872442,
        "upvote_ratio": 1.0
    },
    {
        "title": "used my bialetti steel moka pot once and it's base is stained/scorched. these stains are also faintly visible from the inside. is it still usable?",
        "author": "Obvious-Arm1191",
        "url": "https://www.reddit.com/gallery/103gp5r",
        "text": "",
        "created_utc": 1672870181,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee question",
        "author": "Foxis_rs",
        "url": "https://www.reddit.com/r/Coffee/comments/103gf1i/coffee_question/",
        "text": "Hello /r/Coffee !\n\nI am a truck driver in the USA, and a large part of the job is needing to stay alert for long drives on the interstates. My question is probably something not many will know the answer to, but maybe some can relate. I strongly believe I have ADHD, but I have never been officially diagnosed in of this. One of the effects is that caffeine and sugar have the reverse effect and it makes me tired. But I’ve noticed that sometimes I’m more alert instead of tired, which is how it should be. \n\nWhy is it that sometimes I get the benefit of caffeine, and most times I don’t? Thanks for the replies in advance.",
        "created_utc": 1672869568,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee and winter love",
        "author": "LaraTony",
        "url": "https://i.redd.it/e63q5uro35aa1.jpg",
        "text": "",
        "created_utc": 1672869429,
        "upvote_ratio": 1.0
    },
    {
        "title": "y'all. I'm still in shock that I found this. it works great!!! I'm gonna get it cleaned up and descaled but I'm already pumped to start brewing with it",
        "author": "Thefiveofusaredying",
        "url": "https://i.redd.it/xjlzek5935aa1.jpg",
        "text": "",
        "created_utc": 1672869283,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to order coffee so I don't get charged for an 'extra' shot?",
        "author": "Vivid_Scientist9931",
        "url": "https://www.reddit.com/r/Coffee/comments/103g6gu/how_to_order_coffee_so_i_dont_get_charged_for_an/",
        "text": "In Australia at least, although assuming this is similar elsewhere, most coffee shops offer S/M/L takeaway coffees with 1/2/3 espresso shots in them, respectively.\n\nMy partner and I typically order one half strength M flat white (1 shot) and a small flat white with an extra shot (2 shots).\n\nTo my mind that is the exact same number of espresso shots, and even volume of milk, as ordering one standard small (1 shot) and one standard medium (2 shots) but we are always charged a fee for the 'extra' shot in the small.\n\nWhen I've tried to explain previously that I don't think we're actually getting an 'extra' shot I typically get looks which suggest that maths in the order of 1+2 is too hard, or that I'm just being difficult.\n\nHow do I order this on a shop so that it easily gets my point across please?",
        "created_utc": 1672869012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best quality beans for the money?",
        "author": "m6rabbott",
        "url": "https://www.reddit.com/r/Coffee/comments/103frjo/best_quality_beans_for_the_money/",
        "text": "Hi coffee lovers,\nI’m looking for the best high quality option for the price? I’d imagine there are some “sleepers” out there I’m not aware of. Currently buying Philz brand. I prefer blonde to medium roast. Any insight or suggestion would be appreciated!",
        "created_utc": 1672868037,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long can these whole beans in bag?",
        "author": "artbyak",
        "url": "https://www.reddit.com/gallery/103fn2d",
        "text": "",
        "created_utc": 1672867766,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many cups of coffee / mg of caffeine do you consume in a day. What time is your first &amp; last cup.",
        "author": "foreverandfourdays",
        "url": "https://www.reddit.com/r/Coffee/comments/103efbb/how_many_cups_of_coffee_mg_of_caffeine_do_you/",
        "text": "",
        "created_utc": 1672864949,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Much Money Do Americans Spend on Coffee Each Month?",
        "author": "viktorcoffee",
        "url": "https://www.reddit.com/r/Coffee/comments/103ctcv/how_much_money_do_americans_spend_on_coffee_each/",
        "text": "[removed]",
        "created_utc": 1672861213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chemex Heater Recs?",
        "author": "quokka3d",
        "url": "https://www.reddit.com/r/Coffee/comments/103cg8q/chemex_heater_recs/",
        "text": "Currently using mug warmers for my 2 Chemexes which are closer to lukewarm than I’d like.\n\nI’ve tried my electric stove top with the Chemex Wire separator, but that’s just way too hot, cooks the flavor right out of the coffee.\n\nLooking for something in between, anyone got a setup they’d recommend?",
        "created_utc": 1672860374,
        "upvote_ratio": 1.0
    },
    {
        "title": "30% off popular Baratza grinders at many distributors",
        "author": "SonnyG696",
        "url": "https://www.reddit.com/r/Coffee/comments/103c3ei/30_off_popular_baratza_grinders_at_many/",
        "text": "Seems like Baratza is having 30% off everywhere on things like the Sette and Encore grinders, I don’t recall such a huge savings before!\n\nI just got an Gaggia classic Pro recently so decided to pick up the Sette 270wi for what seems like an incredible deal for a quality weighing espresso grinder",
        "created_utc": 1672859567,
        "upvote_ratio": 1.0
    },
    {
        "title": "me_irl",
        "author": "Comfortable-Coffee-7",
        "url": "https://i.redd.it/kiy25r3cgz9a1.png",
        "text": "",
        "created_utc": 1672858525,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any good cooking recipes that use coffee, either brewed or ground?",
        "author": "unccl",
        "url": "https://www.reddit.com/r/Coffee/comments/103bm19/are_there_any_good_cooking_recipes_that_use/",
        "text": "I have a bunch of coffee that needs to get used any fun recipes you guys have?",
        "created_utc": 1672858467,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee withdrawal",
        "author": "sweet_fiction",
        "url": "https://www.reddit.com/r/Coffee/comments/103aq6o/coffee_withdrawal/",
        "text": "Hello, I have been drinking coffee almost every single day for weeks, if not months now. I stopped drinking it about a week ago. Then I started feeling anxious and trouble sleeping. I haven’t slept for 2 nights already. My brain felt active but my body felt tired.I legit tried so hard to sleep and I couldn’t. This is rare for me. I even took melatonin and it didn’t work much. I even called in to work. I tried to work today but I felt drained and left early. I had half a cup of coffee today but threw it away. Has anyone else experienced this? Do you think it’s coffee withdrawal? Thanks for reading.",
        "created_utc": 1672856426,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grinders: Barataza Encore or maintaining Boudm bistro?",
        "author": "Puck85",
        "url": "https://www.reddit.com/r/Coffee/comments/103am4d/grinders_barataza_encore_or_maintaining_boudm/",
        "text": "The encore is down to $118 on amazon right now. My Bodum bistro just popped the plastic ring around the grinder.\n\nI could replace this ring by buying another burr for $23, but is the encore worth the upgrade? \n\nThe Bodum has been working for years and works well, but is showing its age a bit with a broken power light and wear on the siding. I've also always found it to be messy because some of the grounds get stuck when falling into the glass, and I always have to shake those out by tipping it sideways. Would the encore be cleaner, or a worthwhile upgrade?",
        "created_utc": 1672856164,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have experience with the Dr. Coffee coffee machine brand?",
        "author": "sheldon_y14",
        "url": "https://www.reddit.com/r/Coffee/comments/103ahal/does_anyone_have_experience_with_the_dr_coffee/",
        "text": "I looking to buy a coffee machine locally (I live in Suriname) for commercial uses. There aren't many options to choose from once you go commercially. One dealer here sells machines, but they are on the expensive side, and it seems they have the monopoly since almost everyone works with their brands of coffee (Puro and Miko). There is another one, but theirs is also expensive; Lavazza. \n\nI happened to find a dealer that sells the Dr. Coffee machines, specifically the F10 model. It's not that expensive and it seems to have all the functionalities I need, but I wanted to know if there is anyone that has any experience with these machines and the brand itself. Is it something to recommend?",
        "created_utc": 1672855849,
        "upvote_ratio": 1.0
    },
    {
        "title": "5 days without coffee... still have a severe non stopping headache resistant to all painkillers.... somebody help me",
        "author": "Karim_Ashraf3",
        "url": "https://www.reddit.com/r/Coffee/comments/1039uky/5_days_without_coffee_still_have_a_severe_non/",
        "text": "",
        "created_utc": 1672854430,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nespresso citiz &amp; milk vs Nescafé dolce gusto",
        "author": "emanresutroffewol",
        "url": "https://www.reddit.com/r/Coffee/comments/1039rer/nespresso_citiz_milk_vs_nescafé_dolce_gusto/",
        "text": "Hey everyone!\nFirst of all I'm completely new to coffee making, I've never owned a coffee machine, and right now I found a good deal on citiz &amp; milk and dolce gusto, and I'm torn between the two options, from what I've seen on the internet it seems to me that Nespresso citiz requires some skill from the barista, for example; when making a latte and cappuccino you have to take care of the milk yourself, while dolce gusto does everything for you, also I never drank all the different flavors like macchiato and lungo, I'm more of a latte and espresso man.\nIt'll be really great if you guys help me decide which machine should I own, thank you in advance.",
        "created_utc": 1672854227,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help picking out a birthday present",
        "author": "Navicorn",
        "url": "https://www.reddit.com/r/Coffee/comments/1039p11/need_help_picking_out_a_birthday_present/",
        "text": "My partner and I have always been avid Tea drinkers. Over the Thanksgiving holidays he became acquainted with my brother-in-law's espresso machine and started expressing a new found interest in coffee. \n\nHe did some research and bought himself a Chemex and it's really ramped up from there.\n\nWhat we own:\n\nVariable temp. Gooseneck (already owned due to tea)\n\nBialetti Express and Brikka (surprise gift from me because he liked the Chemex and I figured that was the next step)\n\nMilk frother/steamer (already owned due to tea)\n\nCapresso burr grider (gift we got years ago but barely used due to owning a drip machine - and tea)\n\nSome bags of decent coffee beans that I purchased from Little Waves (gifted with mokka pots)\n\nCold brew coffee pitcher for the fridge\n\nSince I gifted him the mokka pots he's been experimenting with blended drinks. I still don't care for coffee - but I do taste his creations, I want to remain supportive as he's been getting a lot of enjoyment out of his new surprise hobby. Which brings me to my issue, eventhough he's falling in love with coffee and its something he clearly enjoys, he still mainly drinks tea. He only really has fun with the Mokka pots on the weekends (when he has time, he's still getting used to the brew method so it's too complicated to use right before work) and he only likes using the Chemex if he's going to be home all day (weekends) or if there's a small group of people coming over. He's doesn't want to accidentally make too much coffee then have it go to waste while he's at work because he knows I won't drink it. \n\nIt's his birthday soon, so I've been researching brew methods. I really want to find him his daily driver that he can easily use in the mornings. He really enjoys the taste of the pour over, so I want to purchase him one of the single cup pour over brewers that he can place over his mug. I figure if this is something that sticks around a couple more months (anniversary) I will feel comfortable replacing the grinder with something high quality. \n\nAnyways, I've narrowed it down to a couple of models: Kalita Wave, Hario V60, Clever Dripper, Origami and Hario Switch. \n\nI'm willing to purchase any combination or all of these at once but it seems redundant to get the Clever and the switch and I dont know what material is best. The V60 comes in glass, metal and ceramic. The other problem is, he owns several le creuset mugs (they're his favorite) and they are 21 oz. mugs. I've learned from the mokka pots that a cup doesn't always mean 8 oz. so I have no clue what size I should be getting for a 21 oz mug. I've tried to ask Google and the results were - confusing. I really want to get more than one so he can experiment with the flavor profiles and choose which one he likes best. \n\nAlso, he's been using an old well loved kitchen scale to measure coffee. I think it's time to get him a scale that's made for pour over coffee brewing. Again my success finding good advice on Google has been challenging. Any suggestions would be much appreciated, are there any big enough so that he can brew with the Chemex on them?",
        "created_utc": 1672854072,
        "upvote_ratio": 1.0
    },
    {
        "title": "Specialty coffee roasters in Ukraine",
        "author": "kailoz",
        "url": "https://www.reddit.com/r/Coffee/comments/1039j2z/specialty_coffee_roasters_in_ukraine/",
        "text": "I am going to Lviv next week and I want to buy specialty coffee from different roasters. \n\nI usually buy from three champs, Madheads, and Svit Kawy, but I want to try new ones.\n\nThanks in advance",
        "created_utc": 1672853684,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trouble brewing great coffee. Please help.",
        "author": "Strata5Dweller",
        "url": "https://www.reddit.com/r/Coffee/comments/1039iih/trouble_brewing_great_coffee_please_help/",
        "text": "Hey everyone, thanks for taking a look at this for me. I'm trying to brew some really great coffee, but I cannot make sense of what I'm doing wrong, or if I simply don't like this style of coffee. \n\nI'll summarize my gear here:\n\n* 1zpresso k-max grinder\n* Fellow Ode kettle\n* Chemex (6 cup) /w chemex bleached filters\n* RO Water /w  ThirdWave mineral pack added that winds up measuring 100ppm hardness, 40ppm alkalinity, pH 6.0-6.5.\n\n&amp;#x200B;\n\nCoffees I've tried thus far and my impression of them:\n\n* Flatlander Signature Blend - Didn't like, tasted like a bit harsh. I think this i\n* Huckleberry Bom Senso - I liked, tasted pretty smooth and balanced. (Huckleberry considers \"Medium roast\")\n* Common Voice Canopy - I hate it. It taste like what what sheet of cardboard would taste like what I imagine licking cardboard taste like. Like brown paper cardboard.  (CV considers \"Dark Roast\"\n* Onyx Krampus - same as the Common Voice Canopy. (Onyx considers \"Dark Roast\")\n* Bulk Costco House Blend (it is extremely dark roast) - It's okay. It's smoother than the Common Voice/Krampus, doesn't scream 'cardboard' up front, so I actually enjoy it more than those two, but it's not great by any means. \n\n&amp;#x200B;\n\nCommon Voice describes the Canopy as \"Dark Roast\", so I've brewed it two different ways so far:\n\n* 1: 187F water, grind size 7.6 (medium-coarse in my mind) 30G coffee, 500G water. Rinsed filter, and total brew time of around 5 minutes using James Hoffman chemex recipe. It comes out to an extremely satisfyingly flat bed of grounds when all done, and it taste absolutely awful. \n* 2: 196F water, grind size 7.3 (medium in my mind, for the most part) 20G coffee, 320G water. Rinsed filter, and total brew time of around 4m 30s using James Hoffman chemex recipe.  Same as above, and the initial flavor is just as cardboardy as attempt 1.\n\n**Same as above with the Onyx Krampus.** \n\nBulk Costco House: \n\n* 183F water, grind size 8.0 (Coarse in my (perhaps flawed) opinion), 30G coffee, 500G water. Comes out fine. It's smoother than the others, but it has too much smokiness to it to be something I'd call good, let alone delicious.\n\nI seriously feel like I'm messing something up here. I have a hard time imagining that both of these \"dark roast\" coffees can be so harsh and awful. The Huckleberry Bom Senso was pleasant. Good, even. I wouldn't consider it amazing, but I was able to get a much better cup with those beans instead. \n\nI think I hate acidity in coffee, but I know i have a difficult time distinguishing between acidity and bitterness, so sometimes I wonder if I'm simply confusing the two. Trade considers the Canopy coffee \"Sweet and smooth\" and I'm going \"Smooth? What!?\" \n\nPlease help me. I've read James Hoffman's book, I think I am brewing with decent technique, but I think I am missing something here. Either my technique is missing something, or I am clearly don't like a flavor profile others enjoy. I cannot tell. \n\nThanks!",
        "created_utc": 1672853644,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any recipe suggestions for this unlabeled hourglass pour-over? I’ve had it for years, long before I learned how to brew properly. Closest approximation I can find online would be Brim or Cafe Brew. It doesn’t have a channel like Chemex and it doesn’t have an open bottom like V60.",
        "author": "acmaleson",
        "url": "https://www.reddit.com/gallery/1039bzb",
        "text": "",
        "created_utc": 1672853215,
        "upvote_ratio": 1.0
    },
    {
        "title": "1ZPresso JX-Pro vs J-Max - worth the price difference?",
        "author": "Full-Sympathy5201",
        "url": "https://www.reddit.com/r/Coffee/comments/103950x/1zpresso_jxpro_vs_jmax_worth_the_price_difference/",
        "text": "Hi all,\n\nI'm looking at buying a 1ZPresso to upgrade over my Baratza Encore so I can better appreciate specialty coffee. I'm trying to decide whether it's worth spending an extra $40 for the J-Max. From what I've read, the general consensus is a little mixed on whether or not the J-Max is really that much better. I don't have any immediate plans to use it for espresso (may buy a machine down the line, but not right away), so it sounds like the JX-Pro should be more than sufficient for my needs of pour over and Aeropress. \n\nIs my hunch accurate here? Anything else to keep in mind?\n\nThanks!",
        "created_utc": 1672852764,
        "upvote_ratio": 1.0
    },
    {
        "title": "The center Cone burr seems off center and is producing an inconsistent grind. I’ve double checked alignment of the ring burrs. Any other ideas? (Baratza Virtuoso +)",
        "author": "LElige",
        "url": "https://i.redd.it/rxqaunion3aa1.jpg",
        "text": "",
        "created_utc": 1672851940,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switching recipe based on roast?",
        "author": "BlkCdr",
        "url": "https://www.reddit.com/r/Coffee/comments/1038rxc/switching_recipe_based_on_roast/",
        "text": "I generally drink medium roast coffee from a couple different specialty roasters in my area. I recently picked up a bag of honey processed, Abore from Ethiopia from roaster I’ve never tried before. It it was very underwhelming. It basically just tasted like coffee flavored water. It could be the brew method, could be the coffee, could be a bad roaster or it could be my unsophisticated palate. \n\nI brew with a Breville Grind Control and I generally get results that I’m really happy with. It’s kind of an infusion/drip hybrid brewer. \n\nDo you brew or grind differently with a very light roast. If so, finer grind, more coffee, longer infusion?  It wasn’t cheap, so I’m trying to get better results without wasting too much more coffee.",
        "created_utc": 1672851920,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee Maker with Water Line or Automatic Refills",
        "author": "Several-Praline-2277",
        "url": "https://www.reddit.com/r/Coffee/comments/1038pz3/coffee_maker_with_water_line_or_automatic_refills/",
        "text": " Hello, can anyone provide suggestions for a coffee maker for our office? We have about 15 employees and specifically would like to have a water line/automatically refillable machine. Thanks for your suggestions!",
        "created_utc": 1672851801,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] Inside Scoop - Ask the coffee industry",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/1038lpa/mod_inside_scoop_ask_the_coffee_industry/",
        "text": "This is a thread for the enthusiasts of /r/Coffee to connect with the industry insiders who post in this sub!\n\nDo you want to know what it's like to work in the industry? How different companies source beans? About any other aspects of running or working for a coffee business? Well, ask your questions here! Think of this as an AUA directed at the back room of the coffee industry.\n\nThis may be especially pertinent if you wonder what impact the COVID-19 pandemic may have on the industry (hint: not a good one). Remember to keep supporting your favorite coffee businesses if you can - check out the weekly deal thread and the coffee bean thread if you're looking for new places to purchase beans from.\n\nIndustry folk, feel free to answer any questions that you feel pertain to you! However, please let others ask questions; do not comment just to post \"I am _______, AMA!” Also, please make sure you have your industry flair before posting here. If you do not yet have it, contact the mods.\n\nWhile you're encouraged to tie your business to whatever smart or charming things you say here, this isn't an advertising thread. Replies that place more effort toward promotion than answering the question will be removed.\n\nPlease keep this thread limited to industry-focused questions. While it seems tempting to ask general coffee questions here to get extra special advice from \"the experts,\" that is not the purpose of this thread, and you won't necessarily get superior advice here. For more general coffee questions, e.g. brew methods, gear recommendations for home brewing, etc, please ask in the daily Question Thread.",
        "created_utc": 1672851565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone explain why my coffee is so weak tasting?",
        "author": "Paralith10",
        "url": "https://www.reddit.com/r/Coffee/comments/10383ld/can_anyone_explain_why_my_coffee_is_so_weak/",
        "text": "So I have just gotten a new bag of lavazza super crema to try(just for kicks) and I’m struggling with it tasting very weak. \n\nMy normal go to coffee is local store brand Honduran Marcala light roast, which has a decently bold body and walnut/chocolate notes. default brew method is using Aeropress, with the box stock recipe. 14g espresso ground coffee, 175° water to the #1 mark, stir for 10-15 sec and press slowly over ice. I usually add a little vanilla syrup and top off the rest of my 12oz cup with soy milk. This tastes like nice strong coffee/late. It’s my favorite. \n\nFollowing the exact same recipe and method with the super crema makes a super weak flavored coffee. It’s like I used half the coffee. What gives? Any tips or ideas?",
        "created_utc": 1672850345,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ecuadorian Coffe The Best Coffee",
        "author": "Dry_Faithlessness466",
        "url": "https://www.reddit.com/r/Coffee/comments/10381x7/ecuadorian_coffe_the_best_coffee/",
        "text": "This is going to be my first on Reddit about coffee just because I have to say that Ecuadorian Highland Coffee is the one of the best coffees I have ever tasted.  Its aroma and flavor it is just unique. It is a must try. Now I can't start my day without my Ecuadoria coffee",
        "created_utc": 1672850232,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help With Coffee Brand",
        "author": "Yam_Best",
        "url": "https://www.reddit.com/r/Coffee/comments/1037xtt/help_with_coffee_brand/",
        "text": "Hello, I am new to this space and I created a cool t-shirt design on Etsy and was just asking if you can have the time to just add a good review to my page or a bad one if you would like I just need exposure. \n\nthank you.\n\n[https://www.etsy.com/listing/1371057300/coffee-is-always-a-good-idea-t-shirt?ref=listings\\_manager\\_grid](https://www.etsy.com/listing/1371057300/coffee-is-always-a-good-idea-t-shirt?ref=listings_manager_grid)",
        "created_utc": 1672849962,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moccamaster question; my coffee grind isn't getting all soaked.",
        "author": "sloppynipsnyc",
        "url": "https://www.reddit.com/r/Coffee/comments/1036z5h/moccamaster_question_my_coffee_grind_isnt_getting/",
        "text": "Hey all,   \n\n\nI got a Moccamaster for Christmas. Today I made a batch of coffee for myself and 4 other people. I measured out 70g of coffee, and filled it to 1.25L of water.  \n\n\nI noticed after I pulled out the grinds, not much of the grinds were wet, just the top. Does this mean I grinded it too fine? I hand grind my coffee with a Hario.  \n\n\nThanks",
        "created_utc": 1672847683,
        "upvote_ratio": 1.0
    },
    {
        "title": "Industry specific question: has anyone worked in both NYC and another major city (SF, Chicago, LA, etc)?",
        "author": "SnooOnionsThrowRA",
        "url": "https://www.reddit.com/r/Coffee/comments/1036yfn/industry_specific_question_has_anyone_worked_in/",
        "text": "Currently living in NYC. I have a ton of barista experience and a little roasting / QC experience. Currently looking to relocate and I’m gonna start applying to jobs actively.\n\nHas anyone worked FOH or roastery / production jobs in NYC vs. other cities? Anything differences to note? How’s tipping? Bar pace (I’ve worked in some of NYC’s busiest cafes)? I’m really leaning towards the Bay Area, but I do realize it’s just as expensive as it is here, so that isn’t great. Thanks!",
        "created_utc": 1672847634,
        "upvote_ratio": 1.0
    },
    {
        "title": "☕️ Collaboration sought for developing ROAST AI, a coffee recommendation system",
        "author": "CovidAnalyticsNL",
        "url": "https://www.reddit.com/r/Coffee/comments/10368ub/collaboration_sought_for_developing_roast_ai_a/",
        "text": "Hello,\n\nI am a PhD Student in machine learning based in the Netherlands with a passion for coffee. I am seeking collaboration on a project to develop ROAST AI, a coffee recommendation system that helps customers find the best coffee for them.\n\nI have observed that many online specialty coffee subscription services in the Netherlands send their customers a selection of specialty coffees that may not necessarily align with their preferences. While this may be acceptable for the first few deliveries, eventually the customer may become disinterested if they do not receive coffee that meets their taste standards.\n\nAs a PhD student, I have gained expertise in various algorithms and machine learning techniques that I believe could be used to allow customers to rate the coffee they receive through such subscriptions. This data could then be analyzed using various AI algorithms to create customer taste profiles based on the results of cupping tests. These tools have the potential to provide insight into what customers want and assist in the selection of specialty coffees that are more likely to be enjoyed by a wider range of customers.\n\nI am seeking a collaboration with someone who runs an online specialty coffee subscription service and already has a customer base. My focus would be on developing ROAST AI and analyzing customer feedback data and developing the various models to predict customers needs.\n\nI have reached out to various coffee subscription services and they seem interested and enthusiastic about the idea at first, but quickly lose interest once we get to the data collection phase. It has been a challenge to find a partner who is willing to commit to the data collection and analysis process, which is necessary for the success of the ROAST AI. Despite these setbacks, I am still determined to find a partner who shares my vision and is willing to work with me on this exciting and innovative project.",
        "created_utc": 1672845856,
        "upvote_ratio": 1.0
    },
    {
        "title": "New drip coffee maker: replace Bunn, or go for the Moccamaster",
        "author": "itsok_1975",
        "url": "https://www.reddit.com/r/Coffee/comments/1036813/new_drip_coffee_maker_replace_bunn_or_go_for_the/",
        "text": "Our 11 year old Bunn is having issues where it doesn't spray the coffee consistently, and I am ending up with watery coffee 75% of the time. I went through a long cleaning process, and it was better for a few days, now not working again. I hate change, and until now we have been happy with the Bunn, but I have heard things about the Moccamaster so I am also considering it. We don't grind our own beans, we get locally roasted coffee weekly. I love coffee and it is an important part of my day, but I don't want to have to do anything fussy (\"manual intervention\" of the machine). \n\nI can spring for the Moccamaster, but I have read some comments where people feel like they overspent on the Moccamaster or have various frustrations for it being as pricey as it is. While I do appreciate good coffee and love having great coffee at home, I wouldn't say I have such a refined coffee palate that the Bunn wouldn't be fine for my needs. Please help me make a decision that I won't regret- I can't face many more watery coffee mornings. :)",
        "created_utc": 1672845795,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Brew Chemex Coffee with Ian Williams of Deadstock Coffee",
        "author": "coffeezilla0101",
        "url": "https://www.youtube.com/watch?v=OuBdkSgWZ8E&amp;t=41s",
        "text": "",
        "created_utc": 1672844504,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the lightest roast that you know of?",
        "author": "squashpot",
        "url": "https://www.reddit.com/r/Coffee/comments/1035n3e/whats_the_lightest_roast_that_you_know_of/",
        "text": "",
        "created_utc": 1672844350,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help trying to find the perfect everyday setup.",
        "author": "Call_Me_Ikea",
        "url": "https://www.reddit.com/r/Coffee/comments/1035f8i/need_help_trying_to_find_the_perfect_everyday/",
        "text": "So i‘ve started making coffee lately, and i quite enjoy the process. The thing is just i only own a moka pot (or two actually) and i would like to find an aöternative coffee maker because i don‘t particularly like the taste a moka pot produces. The thing is though i nether have enough space in my room, nor do i have the money for an expresso machine. I need a small inexpensive way to make coffee, without loosing the „manual“ part of making coffee in a moka pot.",
        "created_utc": 1672843755,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to clean a new moka pot?",
        "author": "akulakul",
        "url": "https://www.reddit.com/r/Coffee/comments/10358ah/how_to_clean_a_new_moka_pot/",
        "text": "Hi, I just bought a moka pot and have trouble with acidic flavor that comes from the new pot, I ran coffee trough 4 times and washed it a lot, now I left it in hot water with soap and hope that does the trick. Any tips on how to get rid of the acidic flavor of the pot, would be much appreciated.",
        "created_utc": 1672843228,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee subscription service advice",
        "author": "eyesoftheworld1234",
        "url": "https://www.reddit.com/r/Coffee/comments/1034uig/coffee_subscription_service_advice/",
        "text": "Hi- wondering if there are any strong opinions on a great coffee subscription service. Currently using Trade. It’s been a solid experience but feels a bit steep at $25 per bag ($20 when you prepay for six months). Any advice?",
        "created_utc": 1672842158,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffees of 2022!",
        "author": "Rosetotheryan",
        "url": "https://i.redd.it/w0o39ji9t2aa1.jpg",
        "text": "",
        "created_utc": 1672841710,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Coffee Trends Aerocano #shorts #coffee",
        "author": "apocalypse422",
        "url": "https://youtube.com/shorts/BjL_9tkH5x4?feature=share",
        "text": "",
        "created_utc": 1672841569,
        "upvote_ratio": 1.0
    },
    {
        "title": "Add salt to your coffee (sound on)",
        "author": "mercurial-v",
        "url": "https://v.redd.it/sv4f0n6ja1aa1",
        "text": "",
        "created_utc": 1672841375,
        "upvote_ratio": 1.0
    },
    {
        "title": "Turns out the K-plus without a handle weighs exactly 666 grams",
        "author": "K5785B",
        "url": "https://i.imgur.com/I4JyzJf.jpg",
        "text": "That explains who's behind the coffee tasting so good",
        "created_utc": 1672841142,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else warm their mug like this? Works with most of my mugs and the v60 to preheat it. My attempt to waste a little less water.",
        "author": "Goat7410",
        "url": "https://i.redd.it/7qtq5a8wq2aa1.jpg",
        "text": "",
        "created_utc": 1672840916,
        "upvote_ratio": 1.0
    },
    {
        "title": "DF64 w/ SSP MP or Ode Gen 2?",
        "author": "jaydrury1992",
        "url": "https://www.reddit.com/r/Coffee/comments/1033nzo/df64_w_ssp_mp_or_ode_gen_2/",
        "text": "I currently have a DF64 with stock burrs which performs very well for medium/dark roast espresso but it leaves a lot to be desired when grinding for pour overs (seems to produce a lot of fines and muddled flavours). My current predicament is to either upgrade the DF64 to SSP MP burrs to potentially get much better pour over and light roast espresso or get the Fellow Ode Gen 2 as a dedicated brew grinder.\n\nThese are my current pros/cons for each:\n\n**DF64 w/ SSP MP**\n\nPros:\n\n* More consistent grind for pour overs\n* Better grind consistency for light roast/turbo shots\n\nCons\n\n* Potentially detrimental when grinding for medium/dark roast espresso\n\n**Ode Gen 2**\n\nPros:\n\n* Dedicated grinder for pour overs so I don't have to adjust between grind sizes\n* Potential to upgrade to SSPs in the future\n\nCons:\n\n* Slightly more expensive than just buying SSPs for the DF64\n* Takes up more space having 2 grinders\n\nI mainly drink light roast for pour overs and medium/light roast espresso so am unsure which would be the best option out of the 2. \n\nIf anyone can give me their experience or advice with these 2 options it would much appreciated.  \n\n\nThanks",
        "created_utc": 1672838775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tried James Hoffman’s French press method but got super murky coffee.",
        "author": "WonderWuffle",
        "url": "https://www.reddit.com/r/Coffee/comments/1033l50/tried_james_hoffmans_french_press_method_but_got/",
        "text": "Hi! I recently got off the plastic pods side of coffee, and today was my first time making a cup from actual beans. I followed James hoffman’s [guide](https://youtu.be/st571DYYTR8) to making coffee with a French press pretty closely. I had medium roast while beans that were supposedly roasted recently, which I ground with the Hario Skerton Pro (manual burr grinder) to a medium coarseness (I just googled medium coarse coffee and tried to match my grind size to what I saw on google). \nJames recommends 30 g coffee per 500 g water, so I did 15 grams for 250 grams of water. This seemed like a lot of grounds for 1 cup, but I pushed through. I followed the rest of his recipe pretty exactly, but my cup didn’t really look like his. In the video, his cup is significantly lighter and bright, while mine was super dark and fairly bitter. Any advice on what could have went wrong would be appreciated.",
        "created_utc": 1672838536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Add salt to your coffee (sound on)",
        "author": "mercurial-v",
        "url": "https://v.redd.it/jgvxj1ia72aa1",
        "text": "",
        "created_utc": 1672834334,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee grinder for 300-400 dollars",
        "author": "khouf1120",
        "url": "https://www.reddit.com/r/Coffee/comments/1031m0f/coffee_grinder_for_300400_dollars/",
        "text": "Good evening (or morning ;)), i hope you all doing great.\n\nI have had timemore C3 for the past year and i have been thinking of upgrading to a better grinder, preferably an electric one, for drip coffee, is there anything better than ODE fellow? And is the niche zero even an option that is good for drip? Or is it better for espresso alone, and is there something better?",
        "created_utc": 1672832642,
        "upvote_ratio": 1.0
    },
    {
        "title": "quapity mice themed roasts?",
        "author": "mice1322",
        "url": "https://www.reddit.com/r/Coffee/comments/1031frl/quapity_mice_themed_roasts/",
        "text": "brain tood me to incorporate ‚’mice’ more into my daiky life. i am a coffee 100 drinker, and as such, i wanted to create a ‚mouse’ themed coffee. I Was thinking of griiinding (eek!) up MOUSE BONES into a fine powder...",
        "created_utc": 1672832062,
        "upvote_ratio": 1.0
    }
]