[
    {
        "title": "An ode to my Ode",
        "author": "scottvs",
        "url": "https://www.reddit.com/r/Coffee/comments/10bk6np/an_ode_to_my_ode/",
        "text": "My encore turned 7 last year. No problems, no complaints, just a bunch of good coffee. V60, Wave, Chemex, siphon, aeropress, Behmor, and more. It was as dependable as anything in my life. I threatened to upgrade the burrs on a regular basis, but since I was happy, why bother?\n\nThen I found a sale. \n\nAs a ChanuChristmaKwanzica present to myself, I bought a black Fellow Ode for $200. Brought it home and plopped it in the Encore’s spot on the counter. And let’s be honest, whatever your personal opinion of Fellow products, they take design seriously, and make pretty gear. \n\nSo the Ode looks GOOD. One man’s opinion, but I’m that man, and I was happy the moment I put it on the counter. I had a couple of pounds of old beans lying around for just such an occasion, so I broke it in, grinding up and down the dial from coarse to fine and then I waited. \n\nYou see, I picked it up and brought it home in the early evening, and knew that drinking a cup at that hour would have kept me awake well past my bedtime. A first world problem, if ever I’ve found one. So I waited. I rewatched the Hoffman videos with the Ode and I watched the clock, like a child wanting to sleep so Santa would come. \n\nNext morning and here we go. I went with my switch, hybrid style;\n-\t150g of water, just off the boil\n-\t30g of coffee\n-\tanother 100g of water on top, and a quick stir\n-\tAlexa, set a 2 minute timer\n-\topen the switch, wait for space and pour another 125g\n-\twait again, pour final 125g\n\nBOOM!!! I honestly wondered if the cup was so good because of the grinder, or just because I was paying closer attention and my coffee was alway pretty good anyway. \n\nIt was the Ode. \n\nDay after day, and with each cup,!with each pot, I’m learning my preferred setting for each brewer, and the coffee is getting better. \n\nI’m over the moon happy with the Ode. It’s faster, quieter, and I end up with better coffee than with the encore. \n\nNow I think my Bonavita kettle is nervous that I may look into a Stagg…",
        "created_utc": 1673687581,
        "upvote_ratio": 1.0
    },
    {
        "title": "Discovered a nice coffee shop in Cologne",
        "author": "optimalResistance",
        "url": "https://i.imgur.com/oClCVX2.jpg",
        "text": "",
        "created_utc": 1673685575,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bellman stove top milk steam",
        "author": "SidKop",
        "url": "https://www.reddit.com/r/Coffee/comments/10bje86/bellman_stove_top_milk_steam/",
        "text": "Still struggling to get great steamed milk with this. Anyone had similar struggles with the wand getting too hot and what methods did you use to fix it? I’ve tried steaming in cold water before starting the milk - which kinda works. However, none of the YouTube videos use this technique and they start straight away and get great results .",
        "created_utc": 1673684495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Opening a small Coffee Spot. Looking for advise, inspiration and experience.",
        "author": "BankDeezNutz",
        "url": "https://www.reddit.com/gallery/10bi78r",
        "text": "",
        "created_utc": 1673680007,
        "upvote_ratio": 1.0
    },
    {
        "title": "MoccaMaster manual half pot basket setting doesn’t work?",
        "author": "FactoryReboot",
        "url": "https://www.reddit.com/r/Coffee/comments/10bh0kz/moccamaster_manual_half_pot_basket_setting_doesnt/",
        "text": "Every time I flip to half pot (I’ve triple checked it to maker sure it’s not closed) the coffee comes out very over extracted. In fact it’s so bad I’ve just developed a whole pot rather than half pot habit. \n\nThe water seems to borderline line flow at half pot setting. Is something wrong with the basket, user error, or is the machine just bad at half pots?",
        "created_utc": 1673675854,
        "upvote_ratio": 1.0
    },
    {
        "title": "chefwave espresso machine?",
        "author": "aurora_heart7350",
        "url": "https://www.reddit.com/r/Coffee/comments/10bg3s8/chefwave_espresso_machine/",
        "text": "Has anyone tried this machine? Is it good?",
        "created_utc": 1673672838,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help with making coffee that tastes like Tim's french vanilla",
        "author": "NolanonoSC",
        "url": "https://www.reddit.com/r/Coffee/comments/10bg28t/need_help_with_making_coffee_that_tastes_like/",
        "text": "I have a keurig and the French vanilla cups are really good but I want to make it with ground coffee cuz I'm broke, I'm not sure what to use since I've tried light roast french vanilla flavoured grounds \n[This is the good tasting shit I want to replicate](https://i.imgur.com/GnsUlEQ.jpg)",
        "created_utc": 1673672703,
        "upvote_ratio": 1.0
    },
    {
        "title": "The dial of barometer on my Delonghi espresso machine is not working",
        "author": "mrmessy4life",
        "url": "https://www.reddit.com/r/Coffee/comments/10bfr6a/the_dial_of_barometer_on_my_delonghi_espresso/",
        "text": "It was working alright for over a year until this morning.  Nothing has changed but the dial on the pressure gauge didn’t move at all. It stayed at zero.  There was still coffee coming out, taste a bit under extracted but not too bad.  \nI wonder what could go wrong?",
        "created_utc": 1673671741,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the optimum flow rate for a gooseneck kettle in a V60?",
        "author": "KBDFan42",
        "url": "https://www.reddit.com/r/Coffee/comments/10belmz/what_is_the_optimum_flow_rate_for_a_gooseneck/",
        "text": "I’m trying to get the best cup at home, so I want to optimise the brewing process.",
        "created_utc": 1673668145,
        "upvote_ratio": 1.0
    },
    {
        "title": "To what extent does the gooseneck kettle matter?",
        "author": "KBDFan42",
        "url": "https://www.reddit.com/r/Coffee/comments/10bdiay/to_what_extent_does_the_gooseneck_kettle_matter/",
        "text": "I’m using a small 300ml gooseneck pouring kettle. I’m wondering how much does it matter. I noticed that the spout was noticeably shorter than say the Fellow Stagg EKG, or even the Hario Buono. I recently got a Comandante C40 and I want to get the best out of it.",
        "created_utc": 1673664846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Modest Coffee fire sale discussion - what'd you get? How are you brewing? How are you storing the other 5 bags?",
        "author": "cheddarvillains",
        "url": "https://www.reddit.com/r/Coffee/comments/10bd9jh/modest_coffee_fire_sale_discussion_whatd_you_get/",
        "text": "My case of the Enthusiast arrived today and I got the Colombia Cauca. Looking forward to trying it out tomorrow!\n\nAlso, for anyone interested, they were really successful with emptying out that huge inventory of 5,000 cases - right now they just have 114 units of decaf left.",
        "created_utc": 1673664111,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do some people often say that the mokapot is dangerous and messy? I haven't found mine to be either",
        "author": "Life-Drink5874",
        "url": "https://www.reddit.com/r/Coffee/comments/10bd2nm/why_do_some_people_often_say_that_the_mokapot_is/",
        "text": "",
        "created_utc": 1673663551,
        "upvote_ratio": 1.0
    },
    {
        "title": "no alcohol bourbon flavoring for coffee",
        "author": "Due-Soft",
        "url": "https://www.reddit.com/r/Coffee/comments/10bc53c/no_alcohol_bourbon_flavoring_for_coffee/",
        "text": "I don't like the alcohol burn in my coffee and I love bourbon. Has anyone used a bourbon flavoring in brewed coffee.",
        "created_utc": 1673660915,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got a percolator for Christmas and I’ve been enjoying 2 weeks of the best coffee I’ve ever had",
        "author": "Chewbock",
        "url": "https://v.redd.it/8l084i31eyba1",
        "text": "",
        "created_utc": 1673659861,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pour Over Kettle Cool Down Considerations",
        "author": "njuk-njuk",
        "url": "https://www.reddit.com/r/Coffee/comments/10baz1w/pour_over_kettle_cool_down_considerations/",
        "text": "Assuming you have a desired temperature in mind, and are able to accurately heat water in your gooseneck to this temperature, then how important is it to maintain this temperature for the duration of your pour over (V60)?\n\nAre V60 recipes typically built around a diminishing water temp, or is it better to keep the temp as close to the desired temp throughout?\n\nI have a Hario V60 “Buono” stovetop kettle. Once boiling, I can take it off the heat source until the water drops to my desired temp — using an accurate thermometer to verify.  I never really considered the temperature drops after that, once I start my brew, so am curious if I should be more meticulous in this regard.\n\nI could move it back to the burner, now off but holding heat from the initial boil, and that should do something to slow the temp drop.  I can’t imagine, however, reheating the kettle between pours.\n\nGenerally curious how people consider the consistency of their water temp during the ~3 minutes pour over duration.  Wondering if an electric kettle that holds its temp is something I should consider at some point.",
        "created_utc": 1673657675,
        "upvote_ratio": 1.0
    },
    {
        "title": "Opinions on the Flair Espresso &amp; Cafelat Robot et al",
        "author": "rib-ribbit",
        "url": "https://www.reddit.com/r/Coffee/comments/10ba98k/opinions_on_the_flair_espresso_cafelat_robot_et_al/",
        "text": "Hello brain trust,\n\nIf you have or used one of these manual lever machines, what are you opinions of them? \n\nShot quality?\n\nWorkflow (time required and ease of use just to pull a shot)?\n\nDo you use it everyday/regularly (or do you default to your other extraction methods)?\n\nAlthough portable, do you actually take it with you when travelling?\n\nAre they worth the spend (seems quite pricey for what they are)?\n\nI've got about 8 different machines/contraptions to make a cuppa at home, and looking to add another to the collection.\n\nThanks!",
        "created_utc": 1673655717,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone help me find this site?",
        "author": "AdamTheHedgehog",
        "url": "https://www.reddit.com/r/Coffee/comments/10b9z7k/can_someone_help_me_find_this_site/",
        "text": "I remember a site recently that sells frozen coffee pots that let you specify your particular preferences. How much sugar, what flavor, level of cream/milk. It also sold stuff like Boba Tea and Mocktails.",
        "created_utc": 1673654986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inside my moka pot, safe to drink?",
        "author": "ag-honeybee",
        "url": "https://i.redd.it/zg5k34w8txba1.jpg",
        "text": "",
        "created_utc": 1673652867,
        "upvote_ratio": 1.0
    },
    {
        "title": "For home coffee brewers and baristas.",
        "author": "Wonderful_House6919",
        "url": "https://www.reddit.com/r/Coffee/comments/10b7rg3/for_home_coffee_brewers_and_baristas/",
        "text": "After spending 8 years in the coffee industry as a specialty Barista. I decided to start a coffee newsletter this year to share my passion about coffee and things I learned over the years. If that’s something interesting for you. Here is the link to sign up: \n\nhttps://thecafenerd.substack.com",
        "created_utc": 1673649354,
        "upvote_ratio": 1.0
    },
    {
        "title": "is caffeine content relatively the same regardless of brewing method if you use the same amount of beans?",
        "author": "thekperson",
        "url": "https://www.reddit.com/r/Coffee/comments/10b6ru1/is_caffeine_content_relatively_the_same/",
        "text": "like if i used 15g of coffee beans and brewed it properly using a moka pot, drip, pour over, press, etc would the final caffeine content be roughly the same? or does brewing method play a big role in caffeine extraction?",
        "created_utc": 1673646947,
        "upvote_ratio": 1.0
    },
    {
        "title": "Idea for brewing small amount of beans at the end of a bag",
        "author": "montagdude87",
        "url": "https://www.reddit.com/r/Coffee/comments/10b6oy4/idea_for_brewing_small_amount_of_beans_at_the_end/",
        "text": "I had 6g of beans left at the end of a bag, not enough to make a pour over, so I ground them, threw them in my Hario Switch, and made them with my usual recipe, just scaled down to 100g of water. It came out really good! It actually brought out more of the tasting notes than when I used the V60, which was stronger on the fruity notes but less on the Earl Grey notes that are supposed to be present. That's one thing I like about the Switch, you can use the same recipe for a wide range of doses and coffee types and still get good results. That probably applies to other immersion brewing methods as well. Another time I did this with only 3g of a different bag of coffee, and that came out good too.\n\nWhat do you do when you get to the end of a bag?",
        "created_utc": 1673646752,
        "upvote_ratio": 1.0
    },
    {
        "title": "VOCs that make coffee bitter?",
        "author": "nat-one-on-bones",
        "url": "https://www.reddit.com/r/Coffee/comments/10b4lun/vocs_that_make_coffee_bitter/",
        "text": "Hi all! I’m a Chemical Engineering student doing research on removing compounds from coffee during the brewing process to alter the taste. Coffee has over 1000+ VOCs, or volatile organic compounds that effect taste and smell. I want to focus on one or two that specifically impact the bitter coffee profile. Does anyone know of a specific compound that does this? \n\nThanks!",
        "created_utc": 1673641710,
        "upvote_ratio": 1.0
    },
    {
        "title": "Latte Art... with choccy milk?",
        "author": "LYDWAC",
        "url": "https://www.reddit.com/r/Coffee/comments/10b3kqi/latte_art_with_choccy_milk/",
        "text": "The title says it all, is it possible? A sin in coffee culture?",
        "created_utc": 1673639189,
        "upvote_ratio": 1.0
    },
    {
        "title": "Breakfast",
        "author": "Jonartos",
        "url": "https://i.redd.it/4go0yjs65vba1.jpg",
        "text": "",
        "created_utc": 1673638609,
        "upvote_ratio": 1.0
    },
    {
        "title": "A coffee shop changed my life (mildly)",
        "author": "tilt",
        "url": "https://www.reddit.com/r/Coffee/comments/10b21mn/a_coffee_shop_changed_my_life_mildly/",
        "text": "Up until 3 weeks ago I was downing a mug of milky instant every morning. I have a friend who is Into Coffee, but I never thought of doing it myself or paid any attention to his process - probably too complicated and expensive, and besides I'm not a big coffee drinker. When I visit every few months he disappears into the kitchen and comes back with a lovely cup, but that's all.\n\nWell, in my hometown last month I saw 'V60' written on a menu at my local coffee shop and I had no idea what it was, so in an inexplicable fit of courage I just ordered it. It could have been anything. It might not even have been coffee, though I have been watching James Hoffman videos for a few months despite not being into coffee, just because I respect the nerdery and presentation quality, so I probably dimly recognised 'v60' as something coffee-related.\n\nIt arrived on the table, looking like some sort of science experiment, and changed my life (in a small way).\n\nSo clean, bright, flavourful! For about a week after, I couldn't stop thinking about it. That coffee, man, why was I drinking instant when THAT existed in the world? It was like my friend's coffee, but somehow seemed more attainable. Something *I* could do.\n\nI embarked on a quest to find the nicest, cheapest, simplest way to make 'good coffee' at home. I discovered that the V60 has a bit of an art to it, and indeed subsequent coffees at the shop weren't quite as a good as the first. But the seed was planted and I had no choice but to let it grow.\n\nFast-forward a few weeks and I now have a Wilfa Svart, a clever dripper, a V60 and a subscription to a local place who roast to order.\n\nThe life-changing part? My wife and I now wake up early and look forward to sharing a cup of nice coffee together before the kid wakes up, discussing the flavour and technique etc as I read and she studies.\n\nIt's a small thing, and it's early days, but it's given us back a bit of quality time and shared ground together. It's nice to wake up and have something to look forward to every morning, even as simple as a cup of good coffee.",
        "created_utc": 1673635445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Baratza customer service",
        "author": "justsomenickname12",
        "url": "https://www.reddit.com/r/Coffee/comments/10b1m21/baratza_customer_service/",
        "text": "Today I realised that my Encore burr holder is broken. I tried to buy a new one from Baratza directly, but they wouldn’t ship to the Netherlands. I then tried to find a retailer in the Netherlands that could sell me replacement parts, but couldn’t find any. \n\nI decided to contact Baratza directly, and they quickly replied requesting my address to send me a replacement burr holder free of charge!\n\nI do not work for Baratza, I’m not affiliated with them, and other than a free burr holder, they have not paid me anything. Just a happy customer and wanted to share my experience here!",
        "created_utc": 1673634415,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help with a coffe machine. Recently started drinking coffe.Simple two cups max. will use both ground and kcups. No plastic though, prefer the machine to be all steel or alum.",
        "author": "Beginning-Occasion85",
        "url": "https://www.reddit.com/r/Coffee/comments/10aywai/need_help_with_a_coffe_machine_recently_started/",
        "text": "",
        "created_utc": 1673627760,
        "upvote_ratio": 1.0
    },
    {
        "title": "How has your local specialty scene changed over the past five years?",
        "author": "gedrap",
        "url": "https://www.reddit.com/r/Coffee/comments/10axohu/how_has_your_local_specialty_scene_changed_over/",
        "text": "",
        "created_utc": 1673624764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fantastic Little Coffee Roaster",
        "author": "kc0bfv",
        "url": "https://i.redd.it/7m9o35blvtba1.jpg",
        "text": "",
        "created_utc": 1673623293,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you calibrate or match grinders when trying to compare 2 grinders",
        "author": "thebrieze",
        "url": "https://www.reddit.com/r/Coffee/comments/10awisi/how_do_you_calibrate_or_match_grinders_when/",
        "text": "Do you try to match them closest in draw down time, and then compare taste? To me that seems to have a lot of variables, including if one grinder produces more fines than another at the same average grind size\n\nOr you could match closest in taste, and then look for slight taste nuances between them as well as draw down time differences as cues - but this seems even less precise. \n\nSo what’s the best way to do it?\n\nFor reference, I’m trying to compare my df64 with SSP MP burrs with my 1zpresso K series grinder - for pour over only",
        "created_utc": 1673621819,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] What have you been brewing this week?/ Coffee bean recommendations",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/10awgyk/mod_what_have_you_been_brewing_this_week_coffee/",
        "text": "Hey everyone!\n\nWelcome back to the weekly /r/Coffee thread where you can share what you are brewing or ask for bean recommendations. This is a place to share and talk about your favorite coffee roasters or beans.\n\nHow was that new coffee you just picked up? Are you looking for a particular coffee or just want a recommendation for something new to try?\n\nFeel free to provide links for buying online. Also please add a little taste description and what gear you are brewing with. Please note that this thread is for peer-to-peer bean recommendations only. Please do not use this thread to promote a business you have a vested interest in.\n\nAnd remember, even if you're isolating yourself, many roasters and multi-roaster cafes are still doing delivery. Support your local! They need it right now.\n\nSo what have you been brewing this week?",
        "created_utc": 1673621689,
        "upvote_ratio": 1.0
    },
    {
        "title": "Encore vs Cuisinart",
        "author": "yamaotter",
        "url": "https://www.reddit.com/r/Coffee/comments/10aw4j8/encore_vs_cuisinart/",
        "text": "I have a Cuisinart DBM8 burr grinder that I use with an automatic drip machine. And my home coffee sucks. Would a grinder upgrade to the Baratza Encore (or something near it in price) make a big difference? They're both burr grinders, but the Baratza seems to get a ton of good press. I'm obviously no conneseur -- just trying to get half decent tasting coffee at home. Thanks.",
        "created_utc": 1673620776,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pods or Beans??",
        "author": "shecalledmeray",
        "url": "https://www.reddit.com/r/Coffee/comments/10aviyn/pods_or_beans/",
        "text": "I just discovered this coffee brand on Amazon called Grind and they seem to sell both nespresso pods and coffee beans. I am wondering which to get and if they taste the same. What is everyone’s opinion on both and which is better?",
        "created_utc": 1673619192,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to make perfect espresso shot with Breville Cafe Roma",
        "author": "EstiCRho",
        "url": "https://www.reddit.com/r/Coffee/comments/10au6hw/how_to_make_perfect_espresso_shot_with_breville/",
        "text": "I'm using a stock Breville Cafe Roma and I can't get a perfect shot. I  use 13g of ground coffee because it barely fits in the portafilter if I use more. Plus, for 25 seconds of extraction, I get around 90g of brewed coffee. So my question is : how can I pull the best shot possible with the equipement I have?\nThank you",
        "created_utc": 1673615428,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was genuinely surprised to find this.",
        "author": "Reafghkh",
        "url": "https://i.redd.it/umlbgi1z5tba1.jpg",
        "text": "",
        "created_utc": 1673614612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Acaia Lunar (£285) vs Bemece (£17.8) from Amazon. Needed a scale for the camper van that’s cheap and USB-C rechargeable - certainly not same quality, but good enough if it lasts.",
        "author": "pullTheSpro",
        "url": "https://v.redd.it/rnmprmz4nuba1",
        "text": "",
        "created_utc": 1673614495,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the actual scientific literature on excessive consumption of coffee?",
        "author": "SteveSonOfJobs",
        "url": "https://www.reddit.com/r/Coffee/comments/10at8y6/what_is_the_actual_scientific_literature_on/",
        "text": "I'm being repeatedly told by friends and family that I should cut down, but I'm not convinced. Surprisingly caffeine tolerance can be built very quickly if you push it just a little",
        "created_utc": 1673612552,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] The Daily Question Thread",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/10arr9m/mod_the_daily_question_thread/",
        "text": " \n\nWelcome to the daily [/r/Coffee](https://www.reddit.com/r/Coffee) question thread!\n\nThere are no stupid questions here, ask a question and get an answer! We all have to start somewhere and sometimes it is hard to figure out just what you are doing right or doing wrong. Luckily, the [/r/Coffee](https://www.reddit.com/r/Coffee) community loves to help out.\n\nDo you have a question about how to use a specific piece of gear or what gear you should be buying? Want to know how much coffee you should use or how you should grind it? Not sure about how much water you should use or how hot it should be? Wondering about your coffee's shelf life?\n\nDon't forget to use the resources in our [wiki](http://www.reddit.com/r/Coffee/wiki)! We have some great starter guides on our [wiki \"Guides\" page](https://www.reddit.com/r/Coffee/wiki/guides) and [here is the wiki \"Gear By Price\" page](http://www.reddit.com/r/Coffee/wiki/gear#wiki_coffee_gear_suggestions) if you'd like to see coffee gear that [/r/Coffee](https://www.reddit.com/r/Coffee) members recommend.\n\nAs always, be nice!",
        "created_utc": 1673607610,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Ultimate Guide to Coffee: 50 Types and Their Definition",
        "author": "xirasume",
        "url": "https://coffeeteaser.com/the-ultimate-guide-to-coffee/",
        "text": "",
        "created_utc": 1673607599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Timemore C3 Chestnut grind settings for cold brew",
        "author": "AznBladeXx",
        "url": "https://www.reddit.com/r/Coffee/comments/10armzv/timemore_c3_chestnut_grind_settings_for_cold_brew/",
        "text": "Hi guys I’m very very new to the coffee scene and especially new to cold brewing. \n\nI have a Timemore C3 manual grinder and noticed the grind settings differ from the Timemore C2.\n\nI’ve tried to find other Reddit posts that answer this question but can’t seem to find it.  \n\nTimemore has ranges for specific brew methods. The highest I saw was (17-20) for French Press.  \n\nOne question I have is can I go beyond 20 clicks? I want a even coarser grind for cold brew. Not sure if this grinder is capable. \n\nIf the answer is yes my next question is what’s the best click for Cold Brew using this grinder? \n\nThanks so much for anyones help. Hoping this post will help others too.  Cheers",
        "created_utc": 1673607169,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am looking for a coffee grinder, that can grind until a certain amount of grams.",
        "author": "Excellent-Expert-927",
        "url": "https://www.reddit.com/r/Coffee/comments/10aqv2l/am_looking_for_a_coffee_grinder_that_can_grind/",
        "text": "For instance I want to grind exactly 45g coffee. \nI use a wilfa grinder currently. And with it, I can set a time amount for grinding. Which is not very precise. After geindingyI need to put the grounded coffee on a scale to measure the grams. \nBut instead I would like a grams counter, that live weighs the coffee that is grinded, and stops when it has reached the set amount. \n\nDoes that even exist?",
        "created_utc": 1673604230,
        "upvote_ratio": 1.0
    },
    {
        "title": "DF64v4: Any advice for pour-over coffee? (Stock Burrs)",
        "author": "OneVeryOddFellow",
        "url": "https://www.reddit.com/r/Coffee/comments/10apyyh/df64v4_any_advice_for_pourover_coffee_stock_burrs/",
        "text": "I purchased a DF64 grinder a little over a month ago, and have had a terrible time getting acceptable pour-over grounds out of it.\n\nI have tried most of the recommended steps: I aligned the burrs. I decided to remove one layer of the V4 declumper (I left in the one with the horizontal slats, and removed the one with the protruding circle. I RDT every time I grind. No matter what I do, my v60 brews come out muddy and bitter tasting. My draw-downs are a minute+ longer than I was used to with my old Baratza Encore, and the brews taste worse. I have tried grinding at settings between 75-50, all relative to touch point, using the stock Italmill burrs.\n\nThe only thing I can think of is seasoning, as I have ground \"only\" \\~1kg of coffee through it so far. Is that *still* not enough for me to notice any meaningful improvement? I am honestly at my wit's end- this whole charade has completely sapped the joy out of making coffee for me. To all more fellow DF64 owners out there: Should I just grind more coffee through it in the hopes that it will improve? Should I completely remove the stock v4 declumper and replace it with the mythos 1 style one? Any advice would be appreciated.",
        "created_utc": 1673600828,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know where you can get these or a product that is similar. Haven’t been able to find them in over a year but I loved having them. Thanks",
        "author": "lnort24",
        "url": "https://i.redd.it/s6zoxfnj7tba1.jpg",
        "text": "",
        "created_utc": 1673597138,
        "upvote_ratio": 1.0
    },
    {
        "title": "Business Coffee Chat Event - Diversity, Equity, and Inclusion – Is it mainstream now? How is the BFSI industry embracing DEI",
        "author": "fives-digital",
        "url": "https://www.fivesdigital.com/coffee-chat-with-fives",
        "text": "",
        "created_utc": 1673595737,
        "upvote_ratio": 1.0
    },
    {
        "title": "BON JOVI INVENTED THE FLAT WHITE",
        "author": "loujamads",
        "url": "https://www.reddit.com/r/Coffee/comments/10ao2yz/bon_jovi_invented_the_flat_white/",
        "text": "I met Bon Jovi in a shell service station at lemington spa in 1983 on the way back from my cousins graduation. Their van had broken down and we’re waiting for a new driver.\n\nThe coffee machine inside the station was broken and was dispensing only small amounts of milk at any one time. Bon jovi bought everyone a coffee and when bringing them to his crew and band he declared “even the coffee machine is broken, here’s your flat whites”\n\nTwo years later I was in a cafe in Sydney, Australia and noticed the board read ‘flat white’. \n\nWhen I entered to ask what a ‘flat white’ was she explained the drink to me. I asked if she or anyone she knew was ever on tour with Bon Jovi, she blankly nodded to me, slightly shocked and a little confused as I backed out of the cafe smiling.\n\nBon Jovi Invented the flat white.",
        "created_utc": 1673593651,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Abruptly Stopped Drinking Caffeine And This Happened - Chubbyemu",
        "author": "capmerah",
        "url": "https://www.youtube.com/watch?v=yZgQdZ8aReo",
        "text": "",
        "created_utc": 1673590080,
        "upvote_ratio": 1.0
    },
    {
        "title": "Drip Grinder Thoughts - Ode Gen 2 with SSP burs or Vario W+?",
        "author": "pehrk",
        "url": "https://www.reddit.com/r/Coffee/comments/10ammtp/drip_grinder_thoughts_ode_gen_2_with_ssp_burs_or/",
        "text": "",
        "created_utc": 1673588840,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some good dark roasts for filter that I can order direct from roaster in Canada?",
        "author": "AaronF108",
        "url": "https://www.reddit.com/r/Coffee/comments/10amk95/what_are_some_good_dark_roasts_for_filter_that_i/",
        "text": "Title says it really.  I have a monthly subscription pack and am trying an assortment of delicious light roasts every month, however I also love dark roasts, and am wondering if you have any suggestions for some good dark roasts that I can order fresh from the roaster online?  I am currently drinking Phil and Sebastian's Alter Ego dark and it's quite good!  Looking to switch it up from time to time and thought the fine folks of reddit might have some good suggestions for roasters that I may be overlooking.   \n\nThanks!",
        "created_utc": 1673588613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grinder Recommendations",
        "author": "FNM0100",
        "url": "https://www.reddit.com/r/Coffee/comments/10alb11/grinder_recommendations/",
        "text": "Hello, I've been looking for some grinders that I can upgrade to from my Breville Grinder Pro. I was looking at options around **A$800** for espresso mainly. Current options are **mahlkoning x54 (A$990)**, **Eureka Mignon Specialista (A$729)** and **DF64E (A$650)**. I am looking for a flat-burred grinder and those two were the ones that caught my eye. \n\nI really like that the DF64E's burrs can be interchanged with SSP burrs and are easily upgradable, however, the more reputable brands have (imo) better designs. The mahlkoning seems to grind super slow, which is quite a shame and Eureka Mignon seems to have nothing special about it.\n\nThere are also some coffee grinders from China that seem promising, one from quite a big brand, **Timemore Sculptor 078 (A$920)**, which uses a 78mm burr. However, that seems to only do filter coffee. There is also the **Barsetto E6** **(A$1367)** (basically only for mainland China), which also seems very promising but way out of budget.\n\nThe upcoming Fellow Espresso Grinder also seems like a decent competitor and with the new anti static technology they've implemented onto the ODE (very significant feature imo), it seems like it might be worth the wait.\n\nRight now, I'm kinda leaning towards the DF64E, however, should I wait for the Fellow, or should I just get one of the three mentioned above?",
        "created_utc": 1673584675,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are Mayan mochas lattes spicy?",
        "author": "blxhshmulti",
        "url": "https://www.reddit.com/r/Coffee/comments/10aksyr/are_mayan_mochas_lattes_spicy/",
        "text": "I’m drinking a Mayan mocha and it leaves like burning sensation like peppery",
        "created_utc": 1673583206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bro coffee isnt working",
        "author": "3sperr",
        "url": "https://www.reddit.com/r/Coffee/comments/10akc7t/bro_coffee_isnt_working/",
        "text": "I tried instant coffee, and I feel the same after. How do people just drink coffee and feel awake later like its some sort of energy potion, but when I drink coffee, it does absolutely nothing? Maybe I just need to put an absolute shitload of instant coffee in my cup. Like 5 tablespoons. Maybe that'll work. I just need it to work. My workload requires consistently staying up until at least 1am.",
        "created_utc": 1673581865,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any idea where I can find a glass basket like this one?",
        "author": "jonclark",
        "url": "https://www.reddit.com/r/Coffee/comments/10aiwnh/any_idea_where_i_can_find_a_glass_basket_like/",
        "text": "https://m.youtube.com/watch?v=D5VUNlltgNE \n\nI’ve searched all over the interwebs without any luck.",
        "created_utc": 1673577838,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking to upgrade my grinder",
        "author": "Anferny8",
        "url": "https://www.reddit.com/r/Coffee/comments/10aiwaq/looking_to_upgrade_my_grinder/",
        "text": "Hey all! I recently switched from a Kuerig coffee maker to a OXO brand automatic brewer, but also use a French press. I have a cheap \"blade\" style grinder that kinda stinks. I am torn if I should make the investment, but I am looking at the Baratza Encore, Ode Fellow gen 2, and the OXO conical burr grinder. I know they wildly vary in price, that's why I am torn. I would greatly appreciate input from anyone here.",
        "created_utc": 1673577808,
        "upvote_ratio": 1.0
    },
    {
        "title": "This Coffee Brewing Method Delivers the Biggest Jolt of Caffeine. Answer: Pour Over",
        "author": "Silent-Armadillo-859",
        "url": "https://www.yahoo.com/lifestyle/coffee-brewing-method-delivers-biggest-180100225.html",
        "text": "",
        "created_utc": 1673567459,
        "upvote_ratio": 1.0
    },
    {
        "title": "If I was a tiny speck sized person in ur coffee what would happen?",
        "author": "New_Raspberry_2353",
        "url": "https://i.redd.it/lkum3z6bqqba1.jpg",
        "text": "",
        "created_utc": 1673567128,
        "upvote_ratio": 1.0
    },
    {
        "title": "If I was a tiny speck sized person in ur shoe what would happen?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1673567095,
        "upvote_ratio": 1.0
    },
    {
        "title": "Capresso to Virtuosa+ Is it worth the upgrade?",
        "author": "ovr_the_cuckoos_nest",
        "url": "https://www.reddit.com/r/Coffee/comments/10ae9ti/capresso_to_virtuosa_is_it_worth_the_upgrade/",
        "text": "I'm 99% brewing through my Moccamaster. I'm just not sure I can justify going to the Vario. Is there another grinder ~$300 that I should be thinking about instead?",
        "created_utc": 1673565838,
        "upvote_ratio": 1.0
    },
    {
        "title": "People who think grind size doesn't matter for immersion brewing",
        "author": "SteveSonOfJobs",
        "url": "https://www.reddit.com/r/Coffee/comments/10adsjl/people_who_think_grind_size_doesnt_matter_for/",
        "text": "Stop, please stop. You're probably the reason the clever dripper never caught up",
        "created_utc": 1673564707,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone feel the same?",
        "author": "Striking-Warning9533",
        "url": "https://www.reddit.com/r/Coffee/comments/10adgue/anyone_feel_the_same/",
        "text": "Caffine cannot wake me up but will make my hands shake and nervous. So now I am still tired as f and also having weakness of hand and restless! That is terrible!",
        "created_utc": 1673563939,
        "upvote_ratio": 1.0
    },
    {
        "title": "Made this for some friends still using scoops and cups to measure coffee for filter coffee. Hope to convert more people.",
        "author": "Extra-Willow7737",
        "url": "https://i.redd.it/5xcodhvevoba1.jpg",
        "text": "",
        "created_utc": 1673562634,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aeropress",
        "author": "ggiaquin16",
        "url": "https://www.reddit.com/r/Coffee/comments/10acqr1/aeropress/",
        "text": "Hey all! A friend recommended using an aeropress but I am struggling to get a nice flavor. I have the fellow modification and a paper filter on top of it. I found a blog talking about stirring the slurry 3 times, seal it up for 2 minutes then stir again 3 times before pressing. I am wondering if anything in this process might be wrong or if it’s the beans? I’ve been using a more coarse grind.\n\nIn comparison, my chemex comes out great with the same grind.",
        "created_utc": 1673562220,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is a test",
        "author": "Ashamed-Fix6220",
        "url": "https://www.reddit.com/r/Coffee/comments/10acgae/this_is_a_test/",
        "text": "Post creation test",
        "created_utc": 1673561550,
        "upvote_ratio": 1.0
    },
    {
        "title": "sdfsdf",
        "author": "Ashamed-Fix6220",
        "url": "https://www.reddit.com/r/Coffee/comments/10aceeo/sdfsdf/",
        "text": "sdfsdf",
        "created_utc": 1673561433,
        "upvote_ratio": 1.0
    },
    {
        "title": "test",
        "author": "Ashamed-Fix6220",
        "url": "https://www.reddit.com/r/Coffee/comments/10acd0e/test/",
        "text": "test",
        "created_utc": 1673561349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee haul",
        "author": "Annoyingz_12",
        "url": "https://i.redd.it/byqgm0bl6qba1.jpg",
        "text": "",
        "created_utc": 1673560496,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jura purchasing questions - pricing, accessories, dealers...",
        "author": "tom_moscone",
        "url": "https://www.reddit.com/r/Coffee/comments/10abhgj/jura_purchasing_questions_pricing_accessories/",
        "text": "My family recently stayed at a rental house with an automatic Miele espresso/coffee machine and my dad was obsessed. We think it would be a good gift idea for him, so I have been doing some research. Jura brand looks like a good option for combination of coffee quality, ease of use, reliability, ease of maintenance, and support. It's a gift so we'd rather pay a somewhat inflated price for the top brand if it means he's more likely to be able to get service and support for the unit years down the road.\n\nBut it is very expensive, especially for the higher end models that include LCDs to make programming and maintenance easier, and there are still accessories you need to buy on top of the base unit. So I have some buying questions:\n\n* What discount off MSRP should I expect to get when negotiating with Jura dealers? Keeping in mind I might also bundle in some of the accessories for milk, cleaning, water filtration... maybe the cup warmer accessory if that isn't too over-the-top.\n* Do they ever have sales, and what is sale pricing typically?\n* Is there any advantage purchasing from a local dealer versus an internet dealer? For example, is all service and support from Jura corporate regardless?\n* How is pricing for replacement parts and labor hours out of warranty? Do they come to your home, do they have local service centers/affiliates, or do you have to ship in?\n* Is Jura's water filtration system (\"Clearyl\") worth looking into, or are there better/cheaper options that do the same thing, or is tap water fine anyway with regular descaling?\n* For anyone here that has a Jura machine, what do you do for milk and water filtration? Do you use any of the Jura accessories or do other brands offer better priced alternatives? To be honest, Jura's milk accessories seem kind of stupid- you either have the one where you're supposed to keep a freezer pack ready like you're packing a kid's school lunch, or you have the one's that are insanely overpriced mini-fridges that maybe make more sense for an office.",
        "created_utc": 1673559355,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee straight from the bean",
        "author": "Strong_Constant_1190",
        "url": "https://i.redd.it/h8qth1mospba1.gif",
        "text": "",
        "created_utc": 1673555841,
        "upvote_ratio": 1.0
    },
    {
        "title": "while testing my stove to see if it was just electric or induction, this happened. it's aluminum. I only used water to test my stove. I rinsed with water and also tried diluted vinegar but this remains. is this normal?",
        "author": "northernbrownie",
        "url": "https://i.redd.it/gg0vup85opba1.jpg",
        "text": "",
        "created_utc": 1673554298,
        "upvote_ratio": 1.0
    },
    {
        "title": "With Arabica coffee futures having taken a nose dive lately, where are you buying high quality beans in bulk?",
        "author": "idoescompooters",
        "url": "https://www.reddit.com/r/Coffee/comments/10a8whi/with_arabica_coffee_futures_having_taken_a_nose/",
        "text": "As evident by the $JO fund that tracks coffee futures, which I do own.",
        "created_utc": 1673553312,
        "upvote_ratio": 1.0
    },
    {
        "title": "Simple Latte",
        "author": "daizyluna",
        "url": "https://i.redd.it/07tcrrbujpba1.jpg",
        "text": "",
        "created_utc": 1673552848,
        "upvote_ratio": 1.0
    },
    {
        "title": "h",
        "author": "Negative-Coffee-5374",
        "url": "https://i.redd.it/c41icdrfepba1.jpg",
        "text": "",
        "created_utc": 1673551029,
        "upvote_ratio": 1.0
    },
    {
        "title": "hii",
        "author": "Negative-Coffee-5374",
        "url": "https://www.reddit.com/r/u_Negative-Coffee-5374/comments/10a7xyo/hii/",
        "text": "",
        "created_utc": 1673550942,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] Show off your gear! - Battle-station Central",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/10a7qhg/mod_show_off_your_gear_battlestation_central/",
        "text": "Let's see your battle-stations or new purchases! Tell us what it is you have, post pictures if you want, let us know what you think and how you use it all to make your daily Cup of Joe.\n\nFeel free to discuss gear here as well - recommendations, reviews, etc.\n\nFeel free to post links to where people can get the gear but please no sketchy deal sites and none of those Amazon (or other site) links where you get a percentage if people buy it, they will be removed. Also, if you want battle-stations every day of the week, check out /r/coffeestations!\n\nPlease keep coffee station pictures limited to this thread. Any such pictures posted as their own thread will be removed.\n\nThanks!",
        "created_utc": 1673550460,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hario 2 filters for clever dripper",
        "author": "Dark_Sytze",
        "url": "https://www.reddit.com/r/Coffee/comments/10a7ffw/hario_2_filters_for_clever_dripper/",
        "text": "Hi everyone,\n\nMy coffee grinder arrived today, so I finally got to try out making coffee at home. I bought the clever dripper and some nice Indonesian coffee beans. Then when I went to make the coffee I checked James Hoffman's video on the clever dripper, and realized my filters look different.  \nThe girl at the shop sold me hario 02 filters, which are cone shaped....\n\nNow I'm wondering, is this a big problem? Can I finish this package of filters before buying the correct ones?",
        "created_utc": 1673549756,
        "upvote_ratio": 1.0
    },
    {
        "title": "Acid reflux from homemade coffee",
        "author": "Electrical-Taste4985",
        "url": "https://www.reddit.com/r/Coffee/comments/10a6xn2/acid_reflux_from_homemade_coffee/",
        "text": "Hi,\n\nSo I’ve always gotten coffee from coffee shops and never had a problem. Recently I started making coffee at home, I started with kicking horse and Starbucks beans. For cream I have table cream and hazelnut creamer. I’ve experimented with different combos but I find every time I make it at home I get heartburn from drinking it, has anyone else had this problem?",
        "created_utc": 1673548553,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee Beer: A Complete Guide",
        "author": "Homegrounds",
        "url": "https://www.homegrounds.co/coffee-beer/",
        "text": "",
        "created_utc": 1673547511,
        "upvote_ratio": 1.0
    },
    {
        "title": "How old is too old BEFORE roasting?",
        "author": "LittleMizz",
        "url": "https://www.reddit.com/r/Coffee/comments/10a64fv/how_old_is_too_old_before_roasting/",
        "text": "I bought an expensive 250g bag of single origin Ethiopian coffee from a nice coffee/tea store local to me, roasted the day before I bought it.\n\nBut it says on the bag that the coffee was actually harvested a full year prior, December 21. Isn't that... Pretty fuckin long ago? Just can't seem to Google an answer on this since all the answers I get refer to age AFTER roasting, which I already know. \n\nTaste wise it was unfortunately only ok. Not really my style, a little too tea-like, fairly high acidity and pretty much nothing else. Taste notes of \"sweet,\" \"red grapes\" and Earl Grey, haha.",
        "created_utc": 1673546592,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee Valentine Png Valentines Day Coffee Sublimation - Etsy UK",
        "author": "Chance_Base_2589",
        "url": "https://etsy.me/3QxNnv4",
        "text": "",
        "created_utc": 1673546504,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about blender vs. grinder",
        "author": "HooptyDooDooMeister",
        "url": "https://www.reddit.com/r/Coffee/comments/10a5jr0/question_about_blender_vs_grinder/",
        "text": "I'm a greedy greedy little dwarf and am very stingy with my money. I've been using coffee grounds for a few years. \n\nCo-worker brought in a blender recently, so I tried using it as a grinder substitute. Wow, what a night and day difference! I would've bought a blender or a grinder or anything had I known it made *that* much difference.\n\nBut that leads me to my question. Does a grinder make *that* much difference compared to a blender? Going from grounds to beans was a whole level of an upgrade. Would switching from a blender to a $30 grinder (or whatever you guys recommend) worth prying the cold hard cash from my greedy little dwarf hands?",
        "created_utc": 1673545193,
        "upvote_ratio": 1.0
    },
    {
        "title": "combating the tannins in coffee?",
        "author": "b1jan",
        "url": "https://www.reddit.com/r/Coffee/comments/10a4wko/combating_the_tannins_in_coffee/",
        "text": "hey all,\n\nthis might be a weird post, so apologies if my question seems absurd. \n\ni notice that when i have my coffee, about midway through i am finding a 'tannins' kind of mouth-feel. that dryness you get from a glass of wine or black tea. not to the same extent, but somewhat. after my cup, my mouth feels 'bad breath' like, and that dryness remains until i eat something or enough time passes. \n\nanyone else experience this, and any ideas how to combat it? i would prefer *not* to eat before or during my coffee (intermittent fasting)\n\nhappy to hear any thoughts",
        "created_utc": 1673543610,
        "upvote_ratio": 1.0
    },
    {
        "title": "New 1zpresso jx max question for zero out \"closed burr\" calibration",
        "author": "letsbefrds",
        "url": "https://www.reddit.com/r/Coffee/comments/10a46m0/new_1zpresso_jx_max_question_for_zero_out_closed/",
        "text": "Hello I just received my jx max. I upgraded from the jx Pro because I really wanted the magnetic cup, external dial and the grey color.\n\n\nFor the jx-pro out the box it came at zero and calibration. I received the jx max and it came and zero too. I did 2 full rotations for aeropress like the chart said and the grinds came out super coarse. So I was like huh maybe it wasn't dialed so I decided to zero it out and it landed somewhere in a 7.\n\nI'm able to turn counter clockwise to 7 before I can't turn anymore? Is this jx Max not calibrated correctly out the box? Or am I just using this wrong?",
        "created_utc": 1673541904,
        "upvote_ratio": 1.0
    },
    {
        "title": "Breville Barista Express not working when turned on",
        "author": "nonsane_matty",
        "url": "https://www.reddit.com/r/Coffee/comments/10a3wxv/breville_barista_express_not_working_when_turned/",
        "text": "So I’ve recently ran into an issue where my BBE is not functioning as intended.\n\nWhen powered on I normally hear the pumps engaging and the power button LED starts the breath.\n\nYesterday, when powered on, the pump’s engaged as normal except steam started pouring out of the group head. I tested the boiler with a food thermometer and noticed it was over 100c. So I unplugged the machine for the day.\n\nThis morning, when powered on, the pumps did not engage. The machine was completely silent, no steam was coming from the group head (probably because the pumps didn’t pull more water from the tank), and the boiler had reached a temperature of 130c.\n\nTLDR:\n- pumps have stopped engaging.\n- no water being pulled from tank.\n- boiler reaching temperatures over 100c.\n\nI’m really confused about what’s happening, and I am hoping someone could provide me with insight and guidance. Really hoping this isn’t an issue with the control board, and that there may be something I have overlooked.\n\nThank you for your time.",
        "created_utc": 1673541247,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommendations for shops or marcas to look for in Medellín?",
        "author": "Soytaco",
        "url": "https://www.reddit.com/r/Coffee/comments/10a21um/recommendations_for_shops_or_marcas_to_look_for/",
        "text": "[removed]",
        "created_utc": 1673536617,
        "upvote_ratio": 1.0
    },
    {
        "title": "should I get a really cheap hand grinder when I have arthritis, or continue to get pre ground?",
        "author": "jellyfish125",
        "url": "https://www.reddit.com/r/Coffee/comments/10a1spn/should_i_get_a_really_cheap_hand_grinder_when_i/",
        "text": "Started to make coffee at home to save some money as I'm in a tighter spot at the moment, and I didn't have a coffee maker, so I got a French press from Ikea (I think it was around 10-15$?) it makes pretty good coffee, though, I've noticed sometimes the finer grounds come through in to the cup. I don't notice them texture wise, so it doesn't bother me. \n\n\nOne thing I've noticed however when I was learning to use it, was that EVERYONE says to NOT use pre ground coffee and to use beans instead because it is fresher and whatnot. Seems fair, but I want to know how much of a difference it is, as the only grinders in my price range are hand grinders, but I've got arthritis and my *other* grinder is enough of a problem. I'd get one of the similarly cheap electric grinders, but I've also heard they ruin beans and Arnt worth it?\n\nI guess what I'm wondering, would it still be worth it to get a 10$ hand grinder and suffer the pain each morning to grind it, or to just keep either getting pre ground or having it ground at the store? I've been happy enough with what I'm getting with pre ground coffee (Balzac's in this case) but if it's a massive difference I might just get one. Otherwise I'll likely wait till I'm working again and save up for an electric grinder. Also, if anyone knows of cheaper coffee grinders thst are good for people with arthritis let me know!",
        "created_utc": 1673535961,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee and anxiety, looks for some tips",
        "author": "nhabz",
        "url": "https://www.reddit.com/r/Coffee/comments/10a12rv/coffee_and_anxiety_looks_for_some_tips/",
        "text": "I have very complicated relationship with coffee.\n\nI’ve been drinking it for years and for whatever reason, it’s really starting to bring out my anxiety. It’s at the point of where if I drink too much, I’ll have a full blown panic attack.\n\nIs there any way that I’m able to still enjoy the drink that I love and not experience these awful side-effects?\n\nThanks,",
        "created_utc": 1673534056,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Morning Ritual",
        "author": "AlbertLewis54",
        "url": "https://teesdesk-usa.com/the-morning-ritual-coffee?s=hanes-5250&amp;c=Maroon&amp;p=FRONT",
        "text": "",
        "created_utc": 1673533049,
        "upvote_ratio": 1.0
    },
    {
        "title": "Relax",
        "author": "NazliNazNazli",
        "url": "https://i.redd.it/ctxd8qqkxlba1.jpg",
        "text": "",
        "created_utc": 1673527051,
        "upvote_ratio": 1.0
    },
    {
        "title": "Enjoy these perfect coffee companion playlists on Spotify. Start your morning off right with hot latte and these calming focus driven playlists. The perfect way to set you up on your day ☕️☕️☕️☕️☕️☕️☕️",
        "author": "musicman500",
        "url": "https://www.reddit.com/r/Coffee/comments/109y49l/enjoy_these_perfect_coffee_companion_playlists_on/",
        "text": "CALM SLEEP INSTRUMENTALS  \n[https://open.spotify.com/playlist/5ZEQJAi8ILoLT9OlSxjtE7?si=d00b0af4c5da464f](https://open.spotify.com/playlist/5ZEQJAi8ILoLT9OlSxjtE7?si=d00b0af4c5da464f)\n\nMEDITATION AND YOGA\n\n[https://open.spotify.com/playlist/6JtLBg3bS2QHqLKxHmkVrw?si=ec3647de3a5d4bc3](https://open.spotify.com/playlist/6JtLBg3bS2QHqLKxHmkVrw?si=ec3647de3a5d4bc3)\n\nMINDFULNESS AND MEDITATION  \n[https://open.spotify.com/playlist/43j9sAZenNQcQ5A4ITyJ82?si=c2b6dea36583401e](https://open.spotify.com/playlist/43j9sAZenNQcQ5A4ITyJ82?si=c2b6dea36583401e)\n\nMONDAY MORNING CHILL  \n[https://open.spotify.com/playlist/1iZWtDZj940zG0tWBMXLez?si=53461d4c1f2d4e7f](https://open.spotify.com/playlist/1iZWtDZj940zG0tWBMXLez?si=53461d4c1f2d4e7f)\n\nSLEEPY PIANO\n\n[https://open.spotify.com/playlist/3kzuO9N4JWrjS7aW92yX6a?si=25bb81443b07443d](https://open.spotify.com/playlist/3kzuO9N4JWrjS7aW92yX6a?si=25bb81443b07443d)\n\nLOFI CHILL\n\n[https://open.spotify.com/playlist/3vXTOu6yyNgYbAQZt3F8yS?si=991e75234c594a'3c](https://open.spotify.com/playlist/3vXTOu6yyNgYbAQZt3F8yS?si=991e75234c594a3c)\n\nSOFT PIANO\n\n[https://open.spotify.com/playlist/56Sr2ABgSNe2uWlMp3ZG7l?si=e469ffdb0d7b427d](https://open.spotify.com/playlist/56Sr2ABgSNe2uWlMp3ZG7l?si=e469ffdb0d7b427d)",
        "created_utc": 1673525324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Widow Makers Dark Roast - 1 lb (16oz)",
        "author": "WardCoffee",
        "url": "https://www.reddit.com/gallery/109y29j",
        "text": "",
        "created_utc": 1673525131,
        "upvote_ratio": 1.0
    },
    {
        "title": "Capresso infinity burr grinder problems",
        "author": "beerbaron105",
        "url": "https://www.reddit.com/r/Coffee/comments/109xxmu/capresso_infinity_burr_grinder_problems/",
        "text": "I just took it apart and cleaned every spec of coffee out of the grinder. Put it back together and the grinder is still struggling to start, motor struggling to turn the grinder for the first ten seconds then it slowly starts to move, finally getting up to speed after about 30 seconds.\n\nIs this unit toast?",
        "created_utc": 1673524719,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interesting Coffee Experiences in London",
        "author": "pinheadoats",
        "url": "https://www.reddit.com/r/Coffee/comments/109x3ia/interesting_coffee_experiences_in_london/",
        "text": "Hi all,\n\nI'm traveling to London tomorrow and I thought that I could ask this sub for some unique or interesting coffee related things to see.\n\nAlso, recommendations on the best coffee shops to try are very welcome!\nI'll be based around Clapham but I will he traveling around.\n\nThanks!",
        "created_utc": 1673521655,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is espressogear.com legit?",
        "author": "ookwrd",
        "url": "https://www.reddit.com/r/Coffee/comments/109x28a/is_espressogearcom_legit/",
        "text": "[removed]",
        "created_utc": 1673521527,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] The Daily Question Thread",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/109wyle/mod_the_daily_question_thread/",
        "text": " \n\nWelcome to the daily [/r/Coffee](https://www.reddit.com/r/Coffee) question thread!\n\nThere are no stupid questions here, ask a question and get an answer! We all have to start somewhere and sometimes it is hard to figure out just what you are doing right or doing wrong. Luckily, the [/r/Coffee](https://www.reddit.com/r/Coffee) community loves to help out.\n\nDo you have a question about how to use a specific piece of gear or what gear you should be buying? Want to know how much coffee you should use or how you should grind it? Not sure about how much water you should use or how hot it should be? Wondering about your coffee's shelf life?\n\nDon't forget to use the resources in our [wiki](http://www.reddit.com/r/Coffee/wiki)! We have some great starter guides on our [wiki \"Guides\" page](https://www.reddit.com/r/Coffee/wiki/guides) and [here is the wiki \"Gear By Price\" page](http://www.reddit.com/r/Coffee/wiki/gear#wiki_coffee_gear_suggestions) if you'd like to see coffee gear that [/r/Coffee](https://www.reddit.com/r/Coffee) members recommend.\n\nAs always, be nice!",
        "created_utc": 1673521211,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help…..",
        "author": "Robw_1973",
        "url": "https://www.reddit.com/r/Coffee/comments/109w206/i_need_help/",
        "text": "I need some help. Just before Christmas I got hit with a bad dose of the ick. \n\nSince then I haven’t been able to drink coffee - like literally none at all for a month. The smell, the taste it’s just making me feel Ill. I love coffee, love it. I’d rather give up booze (which I’ve also not had any of since I was I’ll).\n\nWhat can I do to get my coffee mojo back? \n\nI’ve got tickets to the London Coffee Festival in April - I really, really, really want to go as a coffee drinker. \n\nI need help.",
        "created_utc": 1673517883,
        "upvote_ratio": 1.0
    },
    {
        "title": "How important is a good grinder for a Moka pot?",
        "author": "Dangerous-Hour6062",
        "url": "https://www.reddit.com/r/Coffee/comments/109vh9n/how_important_is_a_good_grinder_for_a_moka_pot/",
        "text": "I know that a superb grinder will make a vastly better brew than an average grinder for something like a V60, and that AeroPress is more forgiving with subpar grinders. \n\nBut what about Moka pot? Will the differences between average and good grinders be apparent?",
        "created_utc": 1673515757,
        "upvote_ratio": 1.0
    },
    {
        "title": "hello neighbour alternate ending creepypasta",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/109uywu/hello_neighbour_alternate_ending_creepypasta/",
        "text": "have you heard 2018 video game hello neighbour i still love game i will tell you \n\ni got email of gamejolt made by an live action \n\ni downloaded video \n\nthe video is hell neighbour flv \n\ni watched video it had warning \n\n&amp;#x200B;\n\n[warning screen ](https://preview.redd.it/t5d5kdtdskba1.jpg?width=600&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=7931e10fe490392a7bb9919f72c77087972b062a)\n\nit started with video game house was destroyed she asking hello neighbour she had fluttershy from my little pony her eyes are red pupils are blue YOU WILL HATE ME SHUT UP I DON'T CARE she grabbed knife NO GO AWAY i took picture of hello neighbour's father towards her grandpa she started eat shadow man NOT GIVING TO YOU the level ended with brown sky \n\ni uploaded video on Google photos \n\nif gamejolt sees video don't play it at 3 am",
        "created_utc": 1673513809,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having issues with grind size using Timemore C2 Chestnut with V60",
        "author": "Argae",
        "url": "https://www.reddit.com/r/Coffee/comments/109uclf/having_issues_with_grind_size_using_timemore_c2/",
        "text": "Hi guys, I recently got the Timemore C2 Chestnut hand grinder. However, I am finding that even when put on the finest grind setting, the water is moving through the V60 filter way too quickly. I am getting brew times of 45 seconds for 15g coffee or 2 minutes for 30g coffee. The recommended setting for v60 using this grinder is 14-18 clicks from the finest setting. However it is apparently too coarse when I use even the finest setting.\n\nNote, I am using $14 Aldi coffee beans (my sincerest apologies /r/coffee). Is this likely to cause such a huge difference in grind coarseness and brew time? I also have found that I have to grind finer than most people recommend using my Baratza Encore - I use the 6 setting where most people recommend 12-14.\n\nAny help would be greatly appreciated.",
        "created_utc": 1673511421,
        "upvote_ratio": 1.0
    }
]