[
    {
        "title": "Philips 3200 super automatic bitter espresso after cleaning and greasing brew unit",
        "author": "BobbyG0417",
        "url": "https://www.reddit.com/r/Coffee/comments/11qok5m/philips_3200_super_automatic_bitter_espresso/",
        "text": "I'm having an issue with my Philips 3200 after I cleaned and greased the brew unit.  The espresso is extremely bitter and un-drinkable.  I have cleaned and greased this machine several times in the past with no issues.  I did the same thing I've always done today and when I went to make a shot of espresso afterwards and it was horrendous.  \n\nI proceeded to make 10 more thinking maybe there was some grease that got into a line or something but its still the same.  Has anyone had a similar issue or have any ideas on how to fix this?",
        "created_utc": 1678747613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else do this?",
        "author": "Your-cousin-It",
        "url": "https://www.reddit.com/r/Coffee/comments/11qnx16/does_anyone_else_do_this/",
        "text": "I’m a bit of a weirdo: I like drinking black coffee and chasing it with some cream. I like mixing them too, but I just really like the rich, dark flavour of coffee, followed by a smooth shock of cream\n\nDoes anyone else enjoy this or am I odd for even trying it?",
        "created_utc": 1678746202,
        "upvote_ratio": 1.0
    },
    {
        "title": "coffee and cigarettes",
        "author": "Wild-Pickle1841",
        "url": "https://youtu.be/up59QXc_wCo",
        "text": "",
        "created_utc": 1678745389,
        "upvote_ratio": 1.0
    },
    {
        "title": "Heart problems. I have to switch to decaf.",
        "author": "Whatusedtobeisnomore",
        "url": "https://www.reddit.com/r/Coffee/comments/11qnbaj/heart_problems_i_have_to_switch_to_decaf/",
        "text": "Any recommendations? Is there a way to get decaf to taste the same? Is there life after latte?",
        "created_utc": 1678744899,
        "upvote_ratio": 1.0
    },
    {
        "title": "A pair of lungs in a Cypriot coffee grains… somebody! Anybody! Tell me what this means",
        "author": "bigboichriss",
        "url": "https://i.redd.it/xa4gcftybmna1.jpg",
        "text": "",
        "created_utc": 1678744055,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nespresso in a drip maker made best coffee ever. Why?",
        "author": "kshoe163",
        "url": "https://www.reddit.com/r/Coffee/comments/11qmwqx/nespresso_in_a_drip_maker_made_best_coffee_ever/",
        "text": "My Nespresso machine broke beyond repair and I had dozens of pods left. \n\nI cut them open and used the coffee in my drip maker.  It made the best coffee I ever had.  After those were gone I replicated the experiment recently when I was gifted some Italian “pods” not Nespresso and from Italy with the same results. Anyone know why?  And how I can replicate without mortgaging the house on more pods?\n\nI appreciate any advice.",
        "created_utc": 1678744040,
        "upvote_ratio": 1.0
    },
    {
        "title": "Non-coffee drinker needing help",
        "author": "prince_pisspants",
        "url": "https://www.reddit.com/r/Coffee/comments/11qm2v4/noncoffee_drinker_needing_help/",
        "text": "Hey coffee aficionados…\n\nI’m a professor and took a new job beginning this fall. I will be teaching an 8:30am class and started thinking about ways I could encourage my students to be excited to show up and, hopefully, engage well with my course. \n\nI had the idea to set up a little coffee/tea bar thing. Thing is, I’ve never had coffee in my life—let alone brewed it—and wouldn’t even know where to start. Can anyone provide some recommendations do to this so that it is both good (i.e., I don’t want to set out nasty coffee that eventually nobody would drink) and cost-efficient (i.e., I’d like to do this often, so I don’t want to break the bank)?\n\nThanks for any insights!",
        "created_utc": 1678742278,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help finding what is that?",
        "author": "FisherDgo",
        "url": "https://www.reddit.com/gallery/11qlp54",
        "text": "",
        "created_utc": 1678741460,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm bringing the coffee shop home with this Vanilla Caramel Latte candle.",
        "author": "aromaismytherapy",
        "url": "https://i.redd.it/z0pey099hkna1.jpg",
        "text": "",
        "created_utc": 1678740563,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s going on with build up of grounds on the edge? Using a JX Pro girder with Hoffman’s pour over technique.",
        "author": "Larix-24",
        "url": "https://i.redd.it/6xbj5mlx0mna1.jpg",
        "text": "",
        "created_utc": 1678740343,
        "upvote_ratio": 1.0
    },
    {
        "title": "You *DESERVE* this!!! (oc)",
        "author": "DaveKellett",
        "url": "https://www.reddit.com/gallery/11qkrv1",
        "text": "",
        "created_utc": 1678739471,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the improvement in taste worth upgrading from Timemore C2 to Kingrinder K6, in your opinion?",
        "author": "Kaettae",
        "url": "https://www.reddit.com/r/Coffee/comments/11qkpwl/is_the_improvement_in_taste_worth_upgrading_from/",
        "text": "Hi all, I am tempted to upgrade from my Timemore C2 to a Kingrinder K6. I brew with an Aeropress a lot of the time, but also Moka pot, cafetiere (French press) and occasionally Clever Dripper - so not pourover or espresso. \n\nThe only way I can justify the upgrade is if the coffee is noticeably better in these brewing techniques, as I'm happy with my C2's workflow. I'm still relatively new to this hobby, and so am trying beans from all different origins and roasters, and want to make sure I'm getting the most out of each cup - I have had a few bags of acclaimed beans that have disappointed me despite constant experimentation with the brew technique, so want to make sure my grinder isn't a weak link. On the other hand, I don't mind the grind time, capacity, internal grind size calibration etc of the C2, so those aren't reasons that make me want to upgrade. Just interested to know how big the difference in taste would actually be between these two grinders, assuming both are seasoned, if anyone has experience of both. Thanks!",
        "created_utc": 1678739365,
        "upvote_ratio": 1.0
    },
    {
        "title": "This u",
        "author": "Subway_traveler",
        "url": "https://i.redd.it/1l1ee0ygrlna1.jpg",
        "text": "",
        "created_utc": 1678737160,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I find good specialty coffee in the United States?",
        "author": "Papagato",
        "url": "https://www.reddit.com/r/Coffee/comments/11qj3kq/how_do_i_find_good_specialty_coffee_in_the_united/",
        "text": "I just moved to the US and so far I'm very disappointed with the coffee available. \n\nIn Europe, cities usually have a wide array of cafes offering really coffees brewed well. The beans often come from local micro roasters that source unique coffees with a huge range of flavor profiles. And the baristas will often guide you through the tasting experience, helping you really appreciate the intricacies of coffee. This obviously applies to cool, bustling, international cities, but it also applies to poorer central or eastern European countries such as Romania or Poland. Even countries that generally have a very low standard of coffee will usually have a few cafes or roasteries like this.\n\nI'm originally from Australia, which has a great coffee scene, and I've found similar experiences in producer countries like Guatemala and El Salvador.\n\nBut I'm struggling to find anything like that in the US.\n\nI'm in Washington D.C., and I've been madly visiting cafes and roasteries with little success.\n\nEven the most celebrated cafes seems to be focused on mixing crazy drinks with sugary syrups or mounds of whipped cream, rather than exploring the interesting flavors inherent to the beans themselves. And it's pretty much always served in a disposable paper cup with a plastic lid, even if I'm sitting inside. \n\nI've found a few places with interesting beans, but they're generally sourced from entire regions rather than specific farms, and they haven't been brewed particularly well. \n\nI just spent a few days in New York, where I had a bit more success in parts of Brooklyn, but generally the same trends applied. Profit-oriented, fast-turnaround coffee places that don't let you appreciate the joy that coffee can give you.\n\nHow do I find this place I'm looking for? I'm sure it exists, but I just don't know where to look. As an example of what I'm looking for, the most enjoyable cafe I've ever visiting was [Substance Cafe](https://www.youtube.com/watch?v=t0DD0sXNpqE) in Paris. There's no food, no music, no weird additions to the coffee, just a place to really appreciate flavors.",
        "created_utc": 1678735890,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sheetz brew",
        "author": "MaxMiller214",
        "url": "https://v.redd.it/7phku303elna1",
        "text": "",
        "created_utc": 1678732733,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't hate me but I need decaf bean recommendations",
        "author": "SeverEveryFate",
        "url": "https://www.reddit.com/r/Coffee/comments/11qgnko/dont_hate_me_but_i_need_decaf_bean_recommendations/",
        "text": "In Toronto, and just found out I'm pregnant so need to cut down my caffeine intake. Any favourite decaf options that I can buy locally or order?",
        "created_utc": 1678730448,
        "upvote_ratio": 1.0
    },
    {
        "title": "Upgrade grinder or machine?",
        "author": "eKg1991",
        "url": "https://www.reddit.com/r/Coffee/comments/11qfylg/upgrade_grinder_or_machine/",
        "text": "Currently, I have a Baratza Encore with upgraded burr and a Rok espresso maker. Any coffee above a fine grind goes with my Chemex. I have got quite a bit of good use out of my Encore and at the finest grind setting I think it does a pretty decent job. I use my Rok espresso maker fairly often, but it can be difficult to achieve the right bar pressure consistently, so I am looking to upgrade.\n\n&amp;#x200B;\n\nThe only problem is -- If I do end up upgrading to a new espresso machine such as a Breville, Gaggia, etc.. Is my grinder going to hold back the quality of espresso that the new machine can produce?\n\n&amp;#x200B;\n\nThanks!",
        "created_utc": 1678728837,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to do, be it rituals, habits, advice, recommendations, before a big event where you'll consume a butt load of coffee?",
        "author": "leinahtan4",
        "url": "https://www.reddit.com/r/Coffee/comments/11qetd1/what_to_do_be_it_rituals_habits_advice/",
        "text": "There's an upcoming Coffee event coming this weekend, Manila Coffee Festival, and I was concerned about the amount of caffeine I'll be consuming. This'll be my first public event that I'll be going to, and I don't want to be overly anxious or worse overload (my taste-buds/on caffeine) to the point it would ruin my entire experience.\n\nWhat are some things I could do throughout the week to prepare? \n(I am lowering my caffeine consumption by half this week)\n\nWhat are things I should keep in mind during the event? \n\nWhat are some common etiquettes in a bigger coffee event?",
        "created_utc": 1678726133,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long off roast?",
        "author": "onthefly83",
        "url": "https://www.reddit.com/r/Coffee/comments/11qesjj/how_long_off_roast/",
        "text": "[removed]",
        "created_utc": 1678726078,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Philips recommends brewing 150 cups before adjusting the grinder of a new super-automatic coffee machine?",
        "author": "f1xxmAn",
        "url": "https://www.reddit.com/r/Coffee/comments/11qdjd5/why_philips_recommends_brewing_150_cups_before/",
        "text": "What changes after this many cups? Do other vendors provide customers with the same recommendation?",
        "created_utc": 1678723172,
        "upvote_ratio": 1.0
    },
    {
        "title": "who sells Hario products in store? (US)",
        "author": "rippthejackerr",
        "url": "https://www.reddit.com/r/Coffee/comments/11qcog3/who_sells_hario_products_in_store_us/",
        "text": "",
        "created_utc": 1678721142,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please fill in the blank. I love coffee but__________",
        "author": "CoffeeCultureRevival",
        "url": "https://www.reddit.com/r/Coffee/comments/11qcn07/please_fill_in_the_blank_i_love_coffee_but/",
        "text": "",
        "created_utc": 1678721047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee selection decreasing?",
        "author": "Agnostalypse",
        "url": "https://www.reddit.com/r/Coffee/comments/11qbudx/coffee_selection_decreasing/",
        "text": "Apologies if this is the wrong place for this, but has anyone else noticed the selection of coffee available at most stores, particularly Walmart, has been decreasing rapidly? Between January and now, all of our imported varieties, like central American and Ethiopian blends, are gone from the shelves entirely.  \n\n\nNot surprisingly, they were the more affordable options as well. Has anyone else encountered this or just jumping to conclusions over an isolated occurrence?",
        "created_utc": 1678719171,
        "upvote_ratio": 1.0
    },
    {
        "title": "My mom told me that drinking coffee every morning is bad for my brain and I will get “addicted.” Is she right?",
        "author": "jasonmonocle",
        "url": "https://www.reddit.com/r/Coffee/comments/11qaxfm/my_mom_told_me_that_drinking_coffee_every_morning/",
        "text": "I’m 17. I’ve been very busy lately with schoolwork and trying to get into a good college. I’ve had to change my sleep schedule as well so now I’m only getting about 4 or maybe 5 hours every night and waking up early. I’ve been dead tired from when I wake up till past noon and it’s not very nice. So I decided to try out coffee. I’ve never had it before and so I just bought a thing of instant coffee. I’ve had one cup every morning for the past week and it’s been great! I’ve had just enough energy to focus and get stuff done without feeling hyper and my quality of sleep hasn’t been negatively impacted. For reference I guess, I use 2 teaspoons of instant coffee grounds, 1 and a half teaspoons of sugar, and a decent splash of milk. It tastes good and gives me energy for the day. \n\nBut my mom noticed my new routine and got upset with me, saying that I’m too young to develop a coffee “addiction” and that I should stop drinking it because it’ll “stunt my growth” and is bad for my brain…Is she right? I tried googling stuff but I literally just got a bunch of conflicting results. I figured I’d ask here. I’ve enjoyed the coffee so far and it’s helped, but I don’t want to make it a part of my routine if it’s bad for me.",
        "created_utc": 1678717001,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accidentally bought pre-ground and I have questions…",
        "author": "TTYY_20",
        "url": "https://www.reddit.com/r/Coffee/comments/11qaal4/accidentally_bought_preground_and_i_have_questions/",
        "text": "So I purchased a can of Illy beans. Sadly didn’t realize it was pre-ground until I was stowing it away in the caffe cabinet. \n\nThe coffee is ground for espresso, however I don’t own an espresso machine :P what’s my experience going to be like if I run these grounds through aeropress?",
        "created_utc": 1678715472,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alternatives to MapCap with similarly sweet and fruity notes?",
        "author": "donobinladin",
        "url": "https://www.reddit.com/r/Coffee/comments/11q9yhn/alternatives_to_mapcap_with_similarly_sweet_and/",
        "text": "Have been drinking madcap for years but stopped when they started asking $40 a pound for their beans. Haven’t found a great alternative yet and hope this crowd can help me find light roasts with similar bright fruit notes.",
        "created_utc": 1678714653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Grinder for Coffee and Espresso",
        "author": "fastbeer",
        "url": "https://www.reddit.com/r/Coffee/comments/11q90gk/best_grinder_for_coffee_and_espresso/",
        "text": "Does one exist? I've been a coffee person for a while now, but recently got a Gaggia Classic Pro so I'm starting to dabble in new equipment. I use a Bodum Bistro as my grinder and never had any complaints with how it grinds. Always consistent and my coffees are perfect. \n\nI've noticed that when I pull a shot from the gaggia that it brews a little bit too quickly. I'm thinking my grind isn't fine enough with the bistro and I need to grind finer . Does there exist a grinder that works for both coffee and espresso purposes? Seems like to get great espresso you need a specific grinder, but maybe I'm missing something",
        "created_utc": 1678712339,
        "upvote_ratio": 1.0
    },
    {
        "title": "creepypasta tails doll true version",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/11q8uis/creepypasta_tails_doll_true_version/",
        "text": "the movie origins \n\nin 1994 the dolls are alive too it was create the live action she wants to develop the horror film on her life \n\nsince nintendo launches the Sega in 1988 this film is not appropriate for minors \n\nthe curse logo without font the red background is doll was bloody \n\nthis movie didn't have franchise anymore \n\nwe can see tails doll old form he has red eyes and not eyebrows he's often creepy smile \n\nthe DVD \n\ni am age of the 20 i loved tails doll \n\ni was going to attic and i find a box it said don't open it with a marker and DVD on the floor cursed tails doll 2016 with a pen \n\ni put DVD in Xbox 360 \n\nthen the menu came it had 3 options play bonus features and set up i click on it \n\npilot \n\nthe title cursed tails doll appeared \n\nit is not a horror movie is a biography movie \n\nin white text with black background \n\nbut the texture was not animated there is no much \n\nshe give the fox doll \n\nthe mother was insane and b word \n\nthe next scene in the room playing with tails doll \n\nshe goes to big w he left the room \n\nthe tails doll stand up it is the puppet and say i am the leader now \n\nshe is won't forget rouge doll becomes angry \n\n6 years later the car was drives to the garage \n\ntails doll throws sonic doll sonic doll fell on the road then the van crush him \n\nthe dolls arguing to tails doll \n\nrouge doll argue him \n\ntails doll throw rouge doll on the road \n\nthe song can you feel the sunshine but in reverse and instrumental played [https://www.youtube.com/watch?v=WFPaXB2d1gA](https://www.youtube.com/watch?v=WFPaXB2d1gA) \n\nthen he evil laughs he threw shadow doll on the road then crush him \n\ntails doll say to espio doll is over and throw her \n\ntails doll throws dolls she is didn't notice \n\nthe music stops \n\nshe takes tails doll he saw sonic doll her helmet is broken her arm is lost and body is worn and rejoin the car \n\n1 month later i was in Christmas this is exactly in tails doll 2 \n\ntails doll become angry tails doll gave cybertruck key to dog the dog become whimper and he is dying \n\n11 years later she moved the another house to seeing tails doll it said why you're holding this creepy fox doll \n\nat night the same reverse music played \n\ntails doll holding a knife he was on Larry bed he cut on Larry chest and she screaming that make Michael waking up and tails doll don't move \n\nhe put tails doll on the table \n\ntails doll:that's right me \n\ntails doll speak with her voice i'm going to kill you \n\nMichael become angry and put tails doll in the box you are nothing to me \n\nhe scotched the box for keeping tails doll and he wrote don't open it \n\nshe screamed for Larry IS OVER and she left out the house \n\nshe is become upset \n\nthen back to the main menu with without credits \n\naftermath \n\ni open this box and i saw tails doll with red eye qand wrote Michael on the red shoe i taped the box and put it on the drawer \n\ni was so worried i tried to get rid of the tails doll i throw in the window \n\ni was so scared and i saw sonic doll it says you know tails doll he is a liar and envious \n\ni lose the mind this is the computer animated film in tails doll universe \n\ni say with the doll",
        "created_utc": 1678711882,
        "upvote_ratio": 1.0
    },
    {
        "title": "4 steps of Harley",
        "author": "Tight-Climate7329",
        "url": "https://i.redd.it/mh5o29qgijna1.jpg",
        "text": "",
        "created_utc": 1678709917,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best affordable burr grinder?",
        "author": "mirandac858_",
        "url": "https://www.reddit.com/r/Coffee/comments/11q83o4/best_affordable_burr_grinder/",
        "text": "Looking for the best affordable burr grinder on Amazon. I am honestly not looking to spend over $80, if possible. I use a drip coffee maker and I grind my beans at home using a really old grinder that was given to me by my parents and to be quite honest, it sucks. I often find that the grinds are uneven, which is most likely affecting the taste. I have heard people here recommend a burr grinder. Any tips/tricks would also be greatly appreciated. How coarse should I be grinding them?",
        "created_utc": 1678709869,
        "upvote_ratio": 1.0
    },
    {
        "title": "Instant coffee supposedly with best environmental footprint?? How is instant coffee being produced?",
        "author": "stimmen",
        "url": "https://www.reddit.com/r/Coffee/comments/11q7mmn/instant_coffee_supposedly_with_best_environmental/",
        "text": "So there was this article recently on [theconversation.com](https://theconversation.com) about environmental footprints of different ways to prepare coffee: [https://theconversation.com/heres-how-your-cup-of-coffee-contributes-to-climate-change-196648](https://theconversation.com/heres-how-your-cup-of-coffee-contributes-to-climate-change-196648)\n\nAnd they came to the conclusion, that instant coffee has the best environmental footprint. \n\nI found this hard to believe, since the production of instant coffee involves a number of energy intensive extra steps. So I had a deeper look at the sources they used in the article. \n\nApparently this 2009 article was foundational for their analysis: \n\nHumbert et al, \"Life cycle assessment of spray dried soluble coffee and comparison with alternatives (drip filter and capsule espresso)\" [https://www.sciencedirect.com/science/article/pii/S0959652609001474](https://www.sciencedirect.com/science/article/pii/S0959652609001474) (probably behind a paywall for most of you?)\n\nIncluded in this study is the table you find below. Consider the marked line: **As far as I understand it they calculate with 2,22 kg of green coffee to produce 1 kg of instant coffee.** \n\n***Is that a realistic assumption?*** I find that very hard to believe, I researched a little bit and came to the conclusion, that they would need much more than 2,22 kg of green coffee to produce 1 kg of instant coffee.\n\nAnyway, this ratio is key why in their analysis instant coffee has the best environmental footprint.\n\nBut perhaps they made a mistake here?\n\nSo anyone here can shed light to this question?\n\nhttps://preview.redd.it/20jgae82whna1.png?width=1010&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=566df89970d5d3a0548f980fc75a7b93278e31a0",
        "created_utc": 1678708534,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello - help with the Comandante grinder, grind settings, clicks and all that",
        "author": "vlakiades",
        "url": "https://www.reddit.com/r/Coffee/comments/11q7e9w/hello_help_with_the_comandante_grinder_grind/",
        "text": "Hello and have a good day,\n\nI ordered these coffee beans from a store in Cyprus ( I am from Cyprus):\n\nhttps://shop.richcoffee.com/product/ethiopia-alemayehu-daniel/\n\nhttps://shop.richcoffee.com/product/kenya-kilimanjaro-coffee/\n\nhttps://shop.richcoffee.com/product/honduras-comsa-single-origin/\n\nI just would like for you to help me with the grind settings with the Comandante, with how much grams of coffee  I should grind, clicks and similar things... THe espresso machine I have is the 9barista... I would love to have your help... all that for espresso but I also have a coffee for the Ibrik.\n\nThanks in advance",
        "created_utc": 1678707824,
        "upvote_ratio": 1.0
    },
    {
        "title": "At an AirBnb for 4 weeks, they only have a french press, help please",
        "author": "r_plantae",
        "url": "https://www.reddit.com/r/Coffee/comments/11q69wm/at_an_airbnb_for_4_weeks_they_only_have_a_french/",
        "text": "Nornally I just have drip coffee. Can someone give me a qick run down on what to grind to buy and how long to wait before drinking? Like wont the second cup be way stronger than the first? Seems weird. Just help this coffee baby please.",
        "created_utc": 1678704168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do older beans need a different grind size for proper extraction?",
        "author": "IkarusX86",
        "url": "https://www.reddit.com/r/Coffee/comments/11q5ljy/do_older_beans_need_a_different_grind_size_for/",
        "text": "Hi, i am still new to the fresh coffee beans thing.\nI had a bag of beans i use regularely on the shelf for 2-3 weeks longer then normal because i was playing around with some others.\ntried to make these again, but suddenly the the coffee underextracted/sour with a recipe that worked perfectly earlier. is this normal? does extraction change drastically when beans get older and more stale?",
        "created_utc": 1678701791,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] The Daily Question Thread",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/11q5jjc/mod_the_daily_question_thread/",
        "text": " \n\nWelcome to the daily [/r/Coffee](https://www.reddit.com/r/Coffee) question thread!\n\nThere are no stupid questions here, ask a question and get an answer! We all have to start somewhere and sometimes it is hard to figure out just what you are doing right or doing wrong. Luckily, the [/r/Coffee](https://www.reddit.com/r/Coffee) community loves to help out.\n\nDo you have a question about how to use a specific piece of gear or what gear you should be buying? Want to know how much coffee you should use or how you should grind it? Not sure about how much water you should use or how hot it should be? Wondering about your coffee's shelf life?\n\nDon't forget to use the resources in our [wiki](http://www.reddit.com/r/Coffee/wiki)! We have some great starter guides on our [wiki \"Guides\" page](https://www.reddit.com/r/Coffee/wiki/guides) and [here is the wiki \"Gear By Price\" page](http://www.reddit.com/r/Coffee/wiki/gear#wiki_coffee_gear_suggestions) if you'd like to see coffee gear that [/r/Coffee](https://www.reddit.com/r/Coffee) members recommend.\n\nAs always, be nice!",
        "created_utc": 1678701626,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you have a preferred brew temp?",
        "author": "vesper108",
        "url": "https://www.reddit.com/r/Coffee/comments/11q5a1m/do_you_have_a_preferred_brew_temp/",
        "text": "I am finding I like around 185° for most lighter single origins. I do a slightly hybrid method usually where it’s immersion for about 30 seconds then filtered through a v60",
        "created_utc": 1678700632,
        "upvote_ratio": 1.0
    },
    {
        "title": "the cuphead show mugman's rampage the creepypasta",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/11q36ys/the_cuphead_show_mugmans_rampage_the_creepypasta/",
        "text": "we are fans of the cuphead show the pilot came out in 2021 never see her again\n\nshe went to the big w i was so excited\n\ni went to my house it showed me DVD and said The Cuphead Show Lost Episode Mugman's Rampage\n\nit was an unaired episode that was never air on Netflix it was bad idea i put DVD on DVD player then the menu came it has 2 options play and bonus features and i clicked play\n\nthe theme song was the same and because mugman is a b word the episode started outside the house during the night it cuts to mugman's room then mugman started sobbing it then displayed white text in the dark red background 9 hours later it cuts to the school she put books in desk\n\nmugman was confused why did she doing that\n\nshe slammed the door tears coming out of the eyes\n\ni don't want to your coming with me\n\nprincipal Henry grabs the mugman arms and drags into her office it cuts to mugman out of the school\n\nthen cut to the house at night mugman enter his house cuphead waiting for angry and disappointed\n\nshut up mugman cuphead shouted at mugman\n\n(clears throat) did you like beating the people that is what your like it cuphead punched mugman\n\nthen sent back to the bed it was blamed her parents beat her up mugman was sobbing for 3 minutes mugman stopped crying and looked at the security camera\n\nwhy mugman said\n\nwhy did you do this to me they always bullying me everyday my famil was cruel at me who cares\n\nmugman starts to crying again mugman stopped crying mugman looks up with red eyes and she says\n\nenough \n\nmugman went down stairs to the kitchen and pulls out a sharp knife mugman walks over to elder kettle \n\ni was wrong mugman stabbed elder kettle in the stomach elder kettle screaming in pain and agony stomach open as guts come out they weren't real life guts they looked animated i was so shock i was mad that favourite character gets killed \n\nchalice came down to see mugman silted elder kettle stomach open elder kettle coughing out blood mugman raised the bloody knife and stabbed elder kettle in the head killing him chalice shock in fear to tell cuphead what mugman had done mugman grabbed chalice chalice started screaming as he heard skull cracked mugman crushed his skull and dropped chalice in the ground \n\nshe walked up the stairs with carteen's room and grabs the bat \n\ncarteen wake up i have gift for you \n\ncarteen woke up to see mugman cover in blood with a wide smile holding a bat carteen started screaming as mugman raised the bat and hit carteen over and over again he stopped screaming we while mugman broke his leg with a bat how to did cuphead not hear that \n\ncuphead pulled off his bed waking him up \n\nmugman what the hell cuphead scream \n\nyou made my life you big fat bastard \n\nthey ran to room to see lifeless body on the floor \n\noh my god cuphead said \n\ncuphead hear mugman screaming cuphead pushes the mugman seeing her mug head crushed \n\nbut cuphead began to cry mugman hits cuphead into the bat she approaches cuphead and drags him into the basement as the scene cuts to black \n\nthe scene cuts to cuphead strapped to table he looks at tool box and sees the weapons she used to kill the carteen \n\nmugman what are you doing this \n\nmugman walks up to cuphead and she starts to speak \n\ni'm doing because of you you bullied me for years family are abuse me for no reason nothing butt of the joke the family never cared about me after all you everyone bullying you if you think reviving the dead and now your life ends here \n\nplease let me go i was do anything cuphead begged \n\nmugman turns around \n\nnow every to the last momment \n\ncuphead screaming in pain as blood and organs on the wall \n\nthen the screen cuts to mugman looking us at the red eyes \n\nhey you i have seen him what did you did you suspended you are not allowed to revive my family from the dead you are next so be careful what to do \n\nthen mugman punches the camera to go static \n\nit cuts to black then it shows the credits with sad music playing then the movie ended it cut back to the main menu \n\nthis is was the DVD wasn't it 4 minutes later saying that the lost episode it was 13th episode of the season 1 and season 1 was cancelled the reason why the episode was made this it was showing on Netflix think it was final episode of season 1 \n\ni found the reason after that day i decide to record the video and take the screenshots of the lost episode for some reason i burned the DVD she told me that we are ever seen \n\nif you find the DVD with the title mugman's rampage watch at the risk",
        "created_utc": 1678692812,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did the Moccamaster thermal carafe get a redesign?",
        "author": "confused-caveman",
        "url": "https://www.reddit.com/r/Coffee/comments/11q33xy/did_the_moccamaster_thermal_carafe_get_a_redesign/",
        "text": "Im looking at their web site and the thermal carafe looks substantially different. But even amazon has both products and the non-black lid shows up first for me. Google seems to get worse by the month and suprisingly I didnt see anything relevant about this. The reason I ask is because there were some negative reviews on the all steel carafe basically being a poor pourer. Thank you.",
        "created_utc": 1678692500,
        "upvote_ratio": 1.0
    },
    {
        "title": "Timemore electric vs Ode 2",
        "author": "evidenc3",
        "url": "https://www.reddit.com/r/Coffee/comments/11q2x8f/timemore_electric_vs_ode_2/",
        "text": "[removed]",
        "created_utc": 1678691812,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weekend fun",
        "author": "greeneyedgirlinaz",
        "url": "https://i.redd.it/16r0qudirhna1.jpg",
        "text": "",
        "created_utc": 1678688753,
        "upvote_ratio": 1.0
    },
    {
        "title": "Perfect Sunday.",
        "author": "greeneyedgirlinaz",
        "url": "https://i.redd.it/0iyrobtkghna1.jpg",
        "text": "",
        "created_utc": 1678685075,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did I stop craving coffee",
        "author": "Own-Top3605",
        "url": "https://www.reddit.com/r/Coffee/comments/11q124w/why_did_i_stop_craving_coffee/",
        "text": "[removed]",
        "created_utc": 1678685052,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why am I not craving coffee anymore",
        "author": "Own-Top3605",
        "url": "https://www.reddit.com/r/Coffee/comments/11q0ylf/why_am_i_not_craving_coffee_anymore/",
        "text": "[removed]",
        "created_utc": 1678684705,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone buy beans in bulk, then vacuum seal and freeze it in portions?",
        "author": "Romcho64",
        "url": "https://www.reddit.com/r/Coffee/comments/11q0e4u/anyone_buy_beans_in_bulk_then_vacuum_seal_and/",
        "text": "Found some great beans from a local roaster that I like, but at 18 bucks(CAD) per 12 oz bag, it gets pretty expensive... Now this roaster has 5lb bags for sale at 82 bucks, which would bring my cost down to a bit over a dollar, per ounce of beans.\n\nI watched James Hoffman's video about this and apparently it's fine to do, however do I need to wait a while for the beans to de-gas before I seal them and freeze them?",
        "created_utc": 1678682859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need a roach proof expresó machine.",
        "author": "Intelligent_Bike_219",
        "url": "https://www.reddit.com/r/Coffee/comments/11pz1x0/need_a_roach_proof_expresó_machine/",
        "text": "[removed]",
        "created_utc": 1678678737,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weekly Brew thread! What are you brewing?",
        "author": "gbabyyurd57",
        "url": "https://www.reddit.com/r/Coffee/comments/11pyrfn/weekly_brew_thread_what_are_you_brewing/",
        "text": "Since Ive seen some people make note that there wasnt a thread this past week, i’ll make it!",
        "created_utc": 1678677883,
        "upvote_ratio": 1.0
    },
    {
        "title": "4am coffee Tokyo",
        "author": "BKearns123",
        "url": "https://www.reddit.com/gallery/11pyr7o",
        "text": "",
        "created_utc": 1678677866,
        "upvote_ratio": 1.0
    },
    {
        "title": "A new way to enjoy your coffee - JITTERMUG",
        "author": "WillTawoOkojie",
        "url": "https://v.redd.it/4h5e4x1opgna1",
        "text": "",
        "created_utc": 1678676019,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why would decaf make me feel shaky when regular doesn't?",
        "author": "Lycanthrowrug",
        "url": "https://www.reddit.com/r/Coffee/comments/11pxg2o/why_would_decaf_make_me_feel_shaky_when_regular/",
        "text": "I usually drink 3 cups of coffee per day, two in the morning, and one in late afternoon, but a friend of mine noted that I seem to have a \"paradoxical\" reaction to caffeine, which I can drink later in the day without it interfering with my sleep.\n\nThe weird thing I've noticed if I drink decaf coffee, it makes me feel more \"wired\" with symptoms like a fast/pounding heartbeat, when regular coffee with caffeine never does this. Does decaf still contain some physiologically active compounds that could cause that reaction?",
        "created_utc": 1678674239,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a one cup cold brew coffee maker?",
        "author": "the_sleepwalker3",
        "url": "https://www.reddit.com/r/Coffee/comments/11pwz4y/is_there_a_one_cup_cold_brew_coffee_maker/",
        "text": "I am in search of a one cup cold brew maker kind of like the keurig. All that I can find is an one cup iced coffee maker. I would like one that brews it cold. Anyone know if this exists?",
        "created_utc": 1678672963,
        "upvote_ratio": 1.0
    },
    {
        "title": "Slow extraction using Breville barista max on highest grind size setting",
        "author": "Blitz-x-venomz",
        "url": "https://www.reddit.com/r/Coffee/comments/11pwx5y/slow_extraction_using_breville_barista_max_on/",
        "text": "Hey everyone,\n\nI am using the Breville barista max which I just bought for myself. I bought it as it is perfect for my daily life as it is an all in one machine. This is my first coffee machine so if I use the wrong lingo, I apologise in advance\n\nI am currently trying to pour myself double shots of espresso. After trying it a lot of times the shots always seem to trickle out of the basket and taste bitter An average time per double shot is around 50 seconds at the moment. \n\nI heard that I may be grinding too fine but I am currently on the maximum grind setting of 30 (the most coarse) and it still trickles out. I also read that I may be using too many grinds, it is recommended I use 20-22gs and I am currently using 16gs. I read that I need to distribute the grinds too, I also do this and get the same result. I’ve tried changing one and keeping the other the same and it’s the exact same problem. \n\nDoes anyone have any suggestions? As it is making me want to pull my hair out and I’ve wasted an entire bag of coffee beans so far",
        "created_utc": 1678672822,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please go away!",
        "author": "lifeisbutadream77",
        "url": "https://www.ebay.com/itm/364178096613?mkcid=16&amp;mkevt=1&amp;mkrid=711-127632-2357-0&amp;ssspo=pev10courws&amp;sssrc=2051273&amp;ssuid=pev10courws&amp;var=&amp;widget_ver=artemis&amp;media=COPY",
        "text": "",
        "created_utc": 1678672507,
        "upvote_ratio": 1.0
    },
    {
        "title": "But Dad Coffee is Delicious",
        "author": "lifeisbutadream77",
        "url": "https://www.ebay.com/itm/364180496611?mkcid=16&amp;mkevt=1&amp;mkrid=711-127632-2357-0&amp;ssspo=pev10courws&amp;sssrc=2349624&amp;ssuid=pev10courws&amp;var=633633616842&amp;widget_ver=artemis&amp;media=COPY",
        "text": "",
        "created_utc": 1678672485,
        "upvote_ratio": 1.0
    },
    {
        "title": "This may sound like dumb question but is 5pm too late for a coffee?",
        "author": "LordForte",
        "url": "https://www.reddit.com/r/Coffee/comments/11pvmxv/this_may_sound_like_dumb_question_but_is_5pm_too/",
        "text": "Some days I drink coffee at 4pm and some days at 5pm. Usually I can fall asleep around the time I like like 12am or 1am but lately it's been keeping me up way longer until like 2 or 3am and I'm not 100% sure if it's the coffee or just psychological. I've suffered from insomnia bad 2 years ago but for the most part controlled it ok recently but past week I been drinking more coffee around 4 or 5pm because I get sleepy at work. And at least past couple days I haven't been able to go to sleep at good time and when I do I can only sleep 4 hours. I know a lot people recommend you stop drinking way earlier than 5 I just find it weird and inconsistent how like just last week I could absolutely fall asleep after drinking it around 5 and now out of nowhere I can't past couple days and now my insomnia is back.",
        "created_utc": 1678669364,
        "upvote_ratio": 1.0
    },
    {
        "title": "Eggon says “Bank run tomorrow”",
        "author": "Comfortable-Coffee-7",
        "url": "https://v.redd.it/3utpeyrmbfna1",
        "text": "",
        "created_utc": 1678664420,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do some roasts just taste like… coffee?",
        "author": "trybalfire",
        "url": "https://www.reddit.com/r/Coffee/comments/11pt0xu/why_do_some_roasts_just_taste_like_coffee/",
        "text": "I recently got a washed Kenya and honey Ethiopia from the same roaster, both pretty lightly roasted and both were bland and tasted like.. coffee. However I’ve had darker naturals from South America that were absolutely vibrant and lively (albeit not my preferred palette). What causes this if it’s not just being darkly roasted?",
        "created_utc": 1678662643,
        "upvote_ratio": 1.0
    },
    {
        "title": "the BIRTH CONTROL pill in your MORNING K-CUP",
        "author": "theTRUTHaboutKCUPS",
        "url": "https://i.redd.it/sxeagxpj0ena1.png",
        "text": "",
        "created_utc": 1678661379,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a Fellow Ode Gen 1 a good value for $140?",
        "author": "pinstripes607",
        "url": "https://www.reddit.com/r/Coffee/comments/11pscrf/is_a_fellow_ode_gen_1_a_good_value_for_140/",
        "text": "I just copped one at HomeGoods and can’t decide whether or not to keep it. Till now I’ve been using a 1zpresso JX. How will the quality compare?",
        "created_utc": 1678661043,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I boil coffee in a stainless steel carafe safely?",
        "author": "Schindlers_Fist1",
        "url": "https://www.reddit.com/r/Coffee/comments/11ppphb/can_i_boil_coffee_in_a_stainless_steel_carafe/",
        "text": "In the interest of not spending a lot of money on a new coffee maker or espresso machine, I'm curious if I can use my existing thermal carafe to boil my grounds on an electric coil stove top. Lid off, about 5 cups, for no longer than 4 minutes, maybe. \n\nI'd hate to damage it if I can avoid it, but I can use a normal saucepan if need be. The carafe is just more convenient.\n\nThanks.",
        "created_utc": 1678654823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for opinions: I’m writing a marketing plan for a coffee brand project for my college. Questions below. TIA",
        "author": "stuumadden",
        "url": "https://www.reddit.com/r/Coffee/comments/11pp6d9/looking_for_opinions_im_writing_a_marketing_plan/",
        "text": "1. I have been looking at reusable bags online as I’m interested in taking an eco friendly approach to packaging. A lot of the options are made of MOPP/PET which isn’t ideal. There are some that are made from canvas. My question is, are the canvas ones effective? Better than paper? Package longevity is a priority but not at the risk of compromising flavor. \n\n2. This is purely opinion but what are some traits or aspects you dislike about new coffee products today?\n\nThanks y’all!",
        "created_utc": 1678653549,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scale case needed?",
        "author": "Riveninoah",
        "url": "https://www.reddit.com/r/Coffee/comments/11poh4q/scale_case_needed/",
        "text": "I'm finding myself traveling more than usual lately and i bring my coffee gear with me, just a aeropress, water heater and my mini mill grinder. \n\nthat stuff i'm fine packing around my clothes as it wont matter much if it gets squished, but my scale worries me a bit. I don't have an expensive scale, but i'd like it to last. \n\ndoes it matter if scales are squished between clothes and it'll be fine a few times a year? or should i go and hunt for some form of a hard case with padding? \n\nif it helps, it's this scale here - works surprisingly well\n\n[https://www.amazon.com/dp/B0BJKJ15FF?psc=1&amp;ref=ppx\\_yo2ov\\_dt\\_b\\_product\\_details](https://www.amazon.com/dp/B0BJKJ15FF?psc=1&amp;ref=ppx_yo2ov_dt_b_product_details)\n\n\\----- i'm also thinking about getting a rechargable timemore as well, does anyone know if there are travel cases for that?",
        "created_utc": 1678651914,
        "upvote_ratio": 1.0
    },
    {
        "title": "Economic Single Dose Coffee Bean Cellar",
        "author": "Icy_Ad1787",
        "url": "https://www.amazon.com/stores/page/4ADE7002-F16A-4528-B797-696FB113B42B?maas=maas_adg_2A5001193C22D20EA2EC7579C9D00308_afap_abs&amp;ref_=aa_maas&amp;tag=maas&amp;ingress=0&amp;visitId=610e77c8-d997-4425-82c1-3313ee782c3a",
        "text": "",
        "created_utc": 1678650787,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fellow Ode Gen 2: worthy upgrade over a Barazta Encore?",
        "author": "very1",
        "url": "https://www.reddit.com/r/Coffee/comments/11pn893/fellow_ode_gen_2_worthy_upgrade_over_a_barazta/",
        "text": "I have an Encore that has served me well for the last 10 years or so, still does, technically. I've never done much maintenance other than the occasional dusting and bushing.\n\nHowever the Fellow Ode Gen 2 seems really, really nice, and I have a friend who's just getting into coffee who I can probably sell my Encore to. Has anyone else experienced an upgrade doing this? I pretty much only do pour-over and sometimes cold brew and immersion.",
        "created_utc": 1678648989,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can milk thistle potentiate coffee, so that its effects last longer or/and be stronger?",
        "author": "Matiseli",
        "url": "https://www.reddit.com/r/Coffee/comments/11pn7uc/can_milk_thistle_potentiate_coffee_so_that_its/",
        "text": "Thanks",
        "created_utc": 1678648960,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cafecito Lady introduction",
        "author": "CafecitoLady",
        "url": "https://v.redd.it/u7hxt6uxfena1",
        "text": "",
        "created_utc": 1678648553,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] The Official Deal Thread",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/11pn0g5/mod_the_official_deal_thread/",
        "text": "Welcome to the /r/Coffee deal and promotional thread! In this weekly thread, industry folk can post upcoming deals or other promotions their companies are holding, or promote new products to /r/Coffee subscribers! Regular users can also post deals they come across. Come check out some of the roasters and other coffee-related businesses that Redditors work for!\n\nNote that this thread will be weekly at least for the duration of the COVID-19 outbreak, since many roasters are running more specials than usual to drum up business.\n\nWe encourage everyone to post deals here especially since many roasters are holding specials to drive business affected by the COVID-19 outbreak. However, note that there will be zero tolerance for shady behavior. If you're found to be acting dishonestly here, your posting will be removed and we will consider banning you on the spot. If you yourself are affiliated with a business, please be transparent about it.\n\nThere are a few rules for businesses posting promotional material:\n\n- You need to be active in /r/Coffee in a non-self-promotional context to participate in this thread. If it seems you are only here to promote your business in this thread, your submissions will be removed. Build up some /r/Coffee karma first. The Official Noob-Tastic Question Fest weekly thread, posted every Friday, would be a good place to start, and check out what is on the Front Page and jump in on some discussions. Please maintain a high ratio of general /r/Coffee participation to posts in this thread.\n\n- If you are posting in this thread representing a business, please make sure to request your industry flair from the mods before posting.\n\n- Don't just drop a link, say something worthwhile! Start a discussion! Say something about your roasting process or the exciting new batch of beans you linked to!\n\n- Promotions in this thread must be actual deals/specials or new products. Please don't promote the same online store with the same products week after week; there should be something interesting going on. Having generally “good prices” does not constitute a deal.\n\n- No crowdfunding campaigns (Kickstarter, Indiegogo, etc). Do not promote a business or product that does not exist yet. Do not bait people to ask about your campaign. Do not use this thread to survey /r/Coffee members or gauge interest in a business idea you have.\n\n- Please do not promote affiliate/referral programs here, and do not post referral links in this thread.\n\n- This thread is not a place for private parties to sell gear. /r/coffeeswap is the place for private party gear transactions.\n\n- Top-level comments in this thread must be listings of deals. Please do not comment asking for deals in your area or the like.\n\n- More rules may be added as needed. If you're not sure whether or not whatever you're posting is acceptable, message the mods and ask! And please, ask for permission first rather than forgiveness later.",
        "created_utc": 1678648490,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which should I keep and which should I sell 100% Colombian.",
        "author": "Pristine_Anus",
        "url": "https://www.reddit.com/gallery/11pl63z",
        "text": "",
        "created_utc": 1678644225,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you deal with coffee dust from your grinder every day?",
        "author": "TheRealGrabo",
        "url": "https://i.imgur.com/jBhWdkb.jpg",
        "text": "",
        "created_utc": 1678643218,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is Equator Coffee served?",
        "author": "evanino",
        "url": "https://www.reddit.com/r/Coffee/comments/11pkkhw/why_is_equator_coffee_served/",
        "text": " *Equator Coffee* is boring, bitter, and most times stale.  The company must have awesome sales folks, but they are pushing a coffee that is not as good as Peet's to gift shops, cafes, and even hotels.  I don't even want to get started with how bad Peet's is.\n\nIn northern CA we have soo many choices, and I have tried lots of them.  The best coffee offered online is Karl The Fog Coffee for the cool people that take home brewing seriously, and in-store is Blue Bottle Coffee if you must go to a busy expensive coffee shop.\n\nBut where I live there is literally a coffee shop on almost every corner, with a very small few of them being any good. Also, I guess the only people brewing coffee at home have Keurig. LoL",
        "created_utc": 1678642834,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stainless steel french press peeping noise",
        "author": "GermanMachinist",
        "url": "https://www.reddit.com/r/Coffee/comments/11pkig5/stainless_steel_french_press_peeping_noise/",
        "text": "I'm at a friends and we are cooking. At breakfast we noticed a quiet constant peeping noise coming from it, after using and cleaning it. \nJust right now it started doing that again, only noticeably louder after cleaning it again.\nMy question: what the fck? Why is it making noise?!",
        "created_utc": 1678642706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pourover substitutes when traveling overseas",
        "author": "NomNomVerse",
        "url": "https://www.reddit.com/r/Coffee/comments/11pkc24/pourover_substitutes_when_traveling_overseas/",
        "text": "I'll be traveling to the UK soon but need my daily fix. I do pourovers every morning with high quality beans to start my day but need a travel/airplane carry on-friendly solution when I get to the UK from the states. I've tried a few instant options like Copper Cow, Luminous Coffee's and Ritual's instant coffee, and other types of coffee where you steep them like a bag; I found all of them to be incredibly lacking of the body, complex flavor and caffeine compared to a pourover.\n\nDoes anyone have a recommendation for something as close as you can get to a pourover but instant coffee they can recommend that I can travel with? I'm afraid I'll have to resort to Starbucks VIA  (or Starbucks shops) to get my caffeine. (Also any awesome third wave shops near the city centers of London/Edinburgh/Dublin are much appreciated.)",
        "created_utc": 1678642295,
        "upvote_ratio": 1.0
    },
    {
        "title": "What attributes do you track or care about while you are experimenting with various blends and brewing methods?",
        "author": "ketodnepr",
        "url": "https://www.reddit.com/r/Coffee/comments/11pk8e9/what_attributes_do_you_track_or_care_about_while/",
        "text": "I am embarking on a specialty coffee journey and want to be better at tracking various parameters in my brews. What do you guys track usually 1) for the blends you buy/roast 2) for the brews you make?",
        "created_utc": 1678642059,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ow wow - a few clicks coarser made a huge difference",
        "author": "Popular-Afternoon-23",
        "url": "https://i.redd.it/yhugocd5wdna1.jpg",
        "text": "I'm still trying to figure this all out - have a 1zpresso J-max and have been toying with really good lighter roast beans for about a year.\n\nFor a while, I had been getting really great cups consistently - then hit a stretch of fermented / 'experimental' beans that I started out loving, then I soured on them. Hehe.\n\nAnyways - lately I've been in a rut and everything has been too burnt tasting despite using light to light-medium roasted beans. Today - I just opened this bag from JBC Coffee roasters and the first cup was - f#$k still with that burnt taste. So I moved my grinder two whole numbers more coarse (using a chemex brewer), and VOILÀ! \n\nI can taste the notes that the roaster and reviews mention, and the unpleasant bite of bitter is gone!\n\nIs this a general rule - with good beans lighter roasted, go coarser to get a better cuppa?",
        "created_utc": 1678641881,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get into coffee that isn’t just pure sugary drinks?",
        "author": "rosecoloredcamera",
        "url": "https://www.reddit.com/r/Coffee/comments/11pjdht/how_to_get_into_coffee_that_isnt_just_pure_sugary/",
        "text": "I don’t like any drinks with caffeine unless they’re full of sugar, but I’m so tired all the time and I really want to like “purer” coffee for the caffeine without inevitable sugar crashes like you get from tasty Starbucks drinks. I love mochas and frappes, but I don’t know how much they’re actually getting me caffeinated. And they’re definitely not healthy. \n\nHow can I wean from mochas to other coffee drinks with slightly less sugar? What sort of drinks might I enjoy that are similar?",
        "created_utc": 1678640067,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electric Kettle: Stagg EKG-look-a-like",
        "author": "nogjk",
        "url": "https://www.reddit.com/r/Coffee/comments/11pjam6/electric_kettle_stagg_ekglookalike/",
        "text": "Looking for a BIFL electric kettle for a while. I know Stagg EKG is the top of the line, but I stumbled upon this brand, InTasting. \n\n&amp;#x200B;\n\nIt looks exactly like the Stagg EKG in appearance and function. Does anyone have experience with it or recommend it?",
        "created_utc": 1678639879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Water for coffee in Berlin, Germany?",
        "author": "sshhissasecret",
        "url": "https://www.reddit.com/r/Coffee/comments/11piv8o/water_for_coffee_in_berlin_germany/",
        "text": "I’m newly finicky about my coffee thanks to some great birthday presents. I am using bottled distilled water and Third Wave Water sticks in Berlin, Germany (the water is quite hard here). The bottles aren’t on a deposit system although they can be recycled, so this generates a lot of plastic waste. I’d love it if someone in this sub can give me suggestions for similarly good (coffee) water that doesn’t create so much garbage. Does anyone here live in Berlin, even, and can tell me what they do/what they buy? Thanks in advance :)",
        "created_utc": 1678638881,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hummingbird Coffee",
        "author": "fragrantsock",
        "url": "https://www.reddit.com/r/Coffee/comments/11pih85/hummingbird_coffee/",
        "text": "Made coffee this morning and used my water pot to boil some water, had some water left in from the night before, forgot I had made HUMMINGBIRD food in it…..\n\nI made some really sugary coffee",
        "created_utc": 1678637960,
        "upvote_ratio": 1.0
    },
    {
        "title": "creepypasta the cuphead show gone",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/11pi24g/creepypasta_the_cuphead_show_gone/",
        "text": "has anybody heard of the cuphead show it's a kids film that is still today \n\ni used work on the show i found a old DVD \n\nit was called the cuphead show the unaired episode gone \n\ni had to find out \n\ni found a Xbox 360 i insert the DVD and it started \n\nthere was no theme song it just skipped to the episode \n\nit cut to cuphead sitting on chair near the fireplace \n\ninside of cuphead's house it was pure darkness \n\nhe was reading the book the pages were all blank \n\nhe threw book into the fire he was something \n\ncuphead seemed distraught his clotyhs were torn \n\nhis shirt fall on the floor cuphead slowly sobbed \n\ncuphead walks to the door it is ran to the frog pond \n\nthe screen got darker cuphead shivered with fright \n\nis that is it cuphead said \n\ncuphead got down to the stairs he saw a hole \n\ncuphead fell on the hole as the hole is deep \n\ni do not want to do this anymore cuphead sobbed loudly \n\nhe was ran up and goes back to the house \n\ni will miss you cuphead said \n\ncuphead sat on the couch it is still crying \n\nthe the cuphead show theme song slowly played through the TV cuphead started to cry \n\nthe image faded out a picture of my brother appeared \n\nthe TV showed security cameras of my house \n\nthey all died cuphead sobbed \n\nmy own brother is gone but are you sure what they is \n\ni was crying \n\nall my brothyer is gone too cuphead sobbed \n\ncuphead turned to the face he glared at me \n\nyour life is a lie it was never real cuphead said \n\ni was shock dude my jaws was wide open \n\nthe episode emded with no credits just cuphead looking sad \n\ncuphead pulled out the gun he press it \n\ngoodbye carnival cuphead sobbed before pulling the trigger \n\ncuphead body shown for 3 seconds then the DVD ended \n\nthe DVD eject itself i put back in the case \n\ni sold the DVD it is too late \n\nif you find the DVD get rid of it",
        "created_utc": 1678636954,
        "upvote_ratio": 1.0
    },
    {
        "title": "Join the Mailing List",
        "author": "DirtySouthCoffeeCo",
        "url": "https://v.redd.it/xhaa0zgpfdna1",
        "text": "",
        "created_utc": 1678636355,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does this happen and is it a problem?",
        "author": "CauliflowerPlenty879",
        "url": "https://i.redd.it/qtdhlpmredna1.jpg",
        "text": "The tip is 'empty' and squished. This happens quite often to my v60 brews.",
        "created_utc": 1678636034,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mr Hyde Coffee",
        "author": "Mrhydecoffee",
        "url": "https://www.reddit.com/gallery/11phl3v",
        "text": "Mrhydecoffee.com",
        "created_utc": 1678635816,
        "upvote_ratio": 1.0
    },
    {
        "title": "For people interested! How to make a cup of coffee from scratch! https://youtu.be/C8lDujsmaQs",
        "author": "Emenselogic",
        "url": "https://www.reddit.com/r/Coffee/comments/11phczx/for_people_interested_how_to_make_a_cup_of_coffee/",
        "text": "",
        "created_utc": 1678635247,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to make cold brew without having to pay for fancy pitchers?",
        "author": "Gurgop",
        "url": "https://www.reddit.com/r/Coffee/comments/11ph5dh/how_to_make_cold_brew_without_having_to_pay_for/",
        "text": "I only have a coffee machine that is only good for hot coffee, how do I make cold brew that will take minutes than a day?",
        "created_utc": 1678634715,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just got a Moccamaster…. I have now been converted and need more stuff for it lol",
        "author": "TheeLuckyCommander",
        "url": "https://www.reddit.com/r/Coffee/comments/11pg24y/just_got_a_moccamaster_i_have_now_been_converted/",
        "text": "Used a French press for over 6 years and decided to switch it up finally after been tired of coffee grounds in my drink. This thing is amazing and makes great coffee everytime, whether it’s a great morning or I’m hungover. Any accessories people like for it that I should get",
        "created_utc": 1678631986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pour one out for my dead homie - 15 1/2 years young",
        "author": "strangecargo",
        "url": "https://i.imgur.com/1VNRd2S.jpg",
        "text": "",
        "created_utc": 1678631523,
        "upvote_ratio": 1.0
    },
    {
        "title": "Favorite cold brew for coffee lovers.",
        "author": "MichelleinWendell",
        "url": "https://i.redd.it/xyxai5cyqcna1.jpg",
        "text": "",
        "created_utc": 1678628025,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why You Should Drink Coffee Before Your Workout",
        "author": "topinfopk",
        "url": "https://www.reddit.com/r/Coffee/comments/11pekkf/why_you_should_drink_coffee_before_your_workout/",
        "text": " \n\nWhen you exercise, coffee is a well-known supplement that can increase your strength, endurance, power, alertness, and energy levels. Numerous people drink coffee before working out because it gives them a caffeine increase.\n\nAlthough consuming coffee before exercising may improve both physical and mental efficiency, not everyone should.\n\nPeople who are sensitive to caffeine might prefer a refreshment or snack without caffeine before working out. 96% of people who consume caffeine do so through beverages like coffee, fizzy drinks, or tea.\n\n[Click Here](https://www.topinfopk.com/2023/03/why-you-should-drink-coffee-before-your.html) to Learn More!!!",
        "created_utc": 1678627760,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dirty South Coffee Company Loves Hunting and the Outdoors. We will be your perfect coffee before heading out the door before a beautiful day out hunting.",
        "author": "DirtySouthCoffeeCo",
        "url": "https://v.redd.it/9s8x3rehgcna1",
        "text": "",
        "created_utc": 1678624505,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hario Skerton Pro Disassembly for Cleaning",
        "author": "Abject_Yoghurt954",
        "url": "https://www.reddit.com/r/Coffee/comments/11pcuam/hario_skerton_pro_disassembly_for_cleaning/",
        "text": "I'm jjst starting out grinding at home and decid3led to get the Hario Skerton Pro. The instructions say I need to clean it before the first use and that I need to take out both the imner and outer burrs. Fhe Outwr burrs seeme to be held down by this screw on bracket. The shaft is also held in place by a spring and I am reluctant to mess with it. I cant find any disassembly info on line. Should I unscrew the bracket? Do I need to take out the spring?",
        "created_utc": 1678622300,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any Can't Miss Coffeeshops in Edinburgh?",
        "author": "theFuzz1",
        "url": "https://www.reddit.com/r/Coffee/comments/11pavmq/any_cant_miss_coffeeshops_in_edinburgh/",
        "text": "Wife and I will be in Edinburgh in a couple weeks. I always associate fine coffee with Italy, but I know Hoffman's British.... so there's got to be good coffee in all of the UK, right?! Could anyone recommend places we should definitely hit up or avoid?",
        "created_utc": 1678615264,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] The Daily Question Thread",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/11pav1v/mod_the_daily_question_thread/",
        "text": " \n\nWelcome to the daily [/r/Coffee](https://www.reddit.com/r/Coffee) question thread!\n\nThere are no stupid questions here, ask a question and get an answer! We all have to start somewhere and sometimes it is hard to figure out just what you are doing right or doing wrong. Luckily, the [/r/Coffee](https://www.reddit.com/r/Coffee) community loves to help out.\n\nDo you have a question about how to use a specific piece of gear or what gear you should be buying? Want to know how much coffee you should use or how you should grind it? Not sure about how much water you should use or how hot it should be? Wondering about your coffee's shelf life?\n\nDon't forget to use the resources in our [wiki](http://www.reddit.com/r/Coffee/wiki)! We have some great starter guides on our [wiki \"Guides\" page](https://www.reddit.com/r/Coffee/wiki/guides) and [here is the wiki \"Gear By Price\" page](http://www.reddit.com/r/Coffee/wiki/gear#wiki_coffee_gear_suggestions) if you'd like to see coffee gear that [/r/Coffee](https://www.reddit.com/r/Coffee) members recommend.\n\nAs always, be nice!",
        "created_utc": 1678615219,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Friedhats beans just \"popped\"",
        "author": "edgar_was_wright",
        "url": "https://www.reddit.com/r/Coffee/comments/11paa6k/my_friedhats_beans_just_popped/",
        "text": "My new Friedhats beans just opend with an unexpectedly loud \"pop\". The lid (including the seal) nearly blew out of my hand and there was a significant pressure release, more akin to what you'd expect from a forgotten bottle homeade of ginger beer in the back of your fridge.\n\nI have little experience with Friedhats and their products. The last bottle I bought came with a broken seal already. So is this normal? Do they pressurize their bottles with nitrogen or something? Was this a product of the \"Extended Fermentation\" these beans have undergone (see back), or have they just gone bad somehow? I am so confused.\n\nThe coffee looks, smells and tastes great btw. Pour over definitely has some funk to it, Cognac/Whisky like notes and a bit of fruit and dark chocolate. Solid 5/7. I just hope it was safe to drink 😅\n\nPictures of the suspect:  \n[https://imgur.com/MG00uHm](https://imgur.com/MG00uHm)  \n[https://imgur.com/C1Ss1gg](https://imgur.com/C1Ss1gg)  \n[https://friedhats.com/products/colombia-potosi-xo-omni](https://friedhats.com/products/colombia-potosi-xo-omni)",
        "created_utc": 1678613101,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beans, Roasters and log app",
        "author": "da030",
        "url": "https://www.reddit.com/r/Coffee/comments/11p8t2o/beans_roasters_and_log_app/",
        "text": "Hey everyone!\n\nIn my search for a decent way to explore new roasters and beans to try, I started building my own log of Roasters and Beans (mostly based in the Netherlands, but this can basically be everywhere).\n\nYou can create a Roaster, and then add Beans to a specific Roaster. From there you can start using the Bean to post to your ‘feed/log’.\n\nCurrently in a very early stage where I am exploring which direction the app should focus on as many of you coffee lovers seem to log all the technical details for pulling the perfect shot over and over. Something that can be done from the app using the notes section while posting which Bean you’ve used to brew a cup. \n\nI am looking for feedback. Would you use this, how would you like to use this? What should be definitely in for you to start using it etc…\n\nThe app is about exploring new beans or roasters in the first place, I’ve added a social aspect similar to Untappd as this works very well for me in the exploration for beers. But perhaps, it has no meaning in the coffee community.\n\nFeel free to use this Testflight or PlayStore link, keep in mind this is an alpha version, everything can be broken and will change over time. Onboarding the app is still kinda boring. \n\nIf you want to be part of this journey, that means a lot, feel free to report bugs or feature requests, I will try to keep you guys updated every now and then.\n\nhttps://testflight.apple.com/join/cBgJ85wo\n\nhttps://play.google.com/apps/internaltest/4701668763953989142\n\nCheers!",
        "created_utc": 1678607402,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best coffee setup for single-cup and occasionally brewing for a crowd",
        "author": "CloudSea7223",
        "url": "https://www.reddit.com/r/Coffee/comments/11p8ms6/best_coffee_setup_for_singlecup_and_occasionally/",
        "text": "I make 1-2 300ml cups of coffee daily for myself, and occasionally have friends or family over and want to make coffee for 4-5 people at a time. My current daily driver is an AeroPress which doesn’t scale very well for more than 2 cups. \n\nIf money and counter space were no object, I would stick with the AeroPress or a single-cup pour over and keep a Moccamaster or other high-end drip machine for when I need it. \n\nUnfortunately that’s not an option, so I’m hoping to get a single brewer that I can use both for my personal daily use and for making coffee for a group. The main options I’m considering are a Chemex 10-cup or a Hario V60 Size 03. \n\nWhich of these would you all recommend? Is it possible for these to work equally well for a single cup and for several? I would appreciate any brewing tips and I’m very open to other ideas/suggestions. Thanks!",
        "created_utc": 1678606713,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't get my pour over coffee to stay hot",
        "author": "NurseFunBun",
        "url": "https://www.reddit.com/r/Coffee/comments/11p8l4z/cant_get_my_pour_over_coffee_to_stay_hot/",
        "text": "Y'all I just got the Cosori Pour over coffee carafe. I've got the recipe down, and I'm heating my water in a tea kettle, even to boiling, and by the time I get my coffee into a cup it's only warm. What am I doing wrong?! Lol it tastes delicious but I shouldn't have to microwave it right??\n\nI'm not going super slow either. I put my syrup in the cup before the coffee is done, add a little cream, but I don't think it's enough to make it that cool. (Its half and half so it's refrigerated and if it's that I'm going to feel super dumb lol). \n\nIdeas? 🤷🤷",
        "created_utc": 1678606537,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pretty much exact to what I expected !",
        "author": "Critical-Selectied",
        "url": "https://i.redd.it/3c3h9xg2b9na1.jpg",
        "text": "",
        "created_utc": 1678604421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Favorite espresso roast? Or espresso monthly subscription?",
        "author": "converselvr",
        "url": "https://www.reddit.com/r/Coffee/comments/11p7rrd/favorite_espresso_roast_or_espresso_monthly/",
        "text": "Hi there! I’m still pretty new to brewing espresso at home. I recently got a Breville Barista Express and I love it! Bur I’m getting kinda sick of the beans I have. I was thinking to join Atlas coffee club, but was curious how folks like it! \n\nAlso if you have any recommendations for espresso, I would love to check it out!",
        "created_utc": 1678603653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice on espresso machine for a small restaurant",
        "author": "nottaken2601",
        "url": "https://www.reddit.com/r/Coffee/comments/11p7gzx/need_advice_on_espresso_machine_for_a_small/",
        "text": "",
        "created_utc": 1678602613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does black iced coffee or iced coffee w/milk and no sugar taste bitter?",
        "author": "Free_Instruction_290",
        "url": "https://www.reddit.com/r/Coffee/comments/11p70k8/why_does_black_iced_coffee_or_iced_coffee_wmilk/",
        "text": "Once in a while it doesn’t taste bitter- but it seems that almost all small biz coffee are so bitter and almost icky without an added element. I started drinking coffee w/o sugar so I got used to it and prefer to not add sweetener for health reasons but sometimes I don’t even drink the whole cup because it tastes gross despite mostly getting through it. I was told that small businesses use dark roasts? But I don’t know exactly why it’s so sour!!",
        "created_utc": 1678601078,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blacbilesehelgm 2trilliunrdariqeshintommygankereku***~~#~~***",
        "author": "rehulsyuaibmoses",
        "url": "https://i.imgur.com/YvyJsjN.jpg",
        "text": "",
        "created_utc": 1678600947,
        "upvote_ratio": 1.0
    }
]