[
    {
        "title": "Onyx coffee in a retail setting",
        "author": "KansasBrewista",
        "url": "https://www.reddit.com/r/Coffee/comments/10ysrzp/onyx_coffee_in_a_retail_setting/",
        "text": "Yesterday I saw that one of my favorite cafes has stocked quite a number of onyx beans. But the boxes have no roast date. I even opened one up and checked the bag. I know onyx has a great reputation for their beans. But could they be unloading old, potentially stale beans into their wholesale customers?",
        "created_utc": 1676037759,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blooming auto drip mind blown",
        "author": "NashvilleSunn",
        "url": "https://www.reddit.com/r/Coffee/comments/10ysflp/blooming_auto_drip_mind_blown/",
        "text": "So I’ve been in a cycle of pour over, aeropress and French press with my auto drip in between for a while. \n\nI love the non auto methods (no issue with drip either), especially the rituals of each process. \n\nHowever, on work days I’ve just found that the time I’m spending on those methods isn’t conducive for a productive morning. \n\nRecently I’ve settled into using my auto drip during the week and French press on my days off. \n\nI like consistency so I buy high quality beans available at most National groceries: stumptown, intelligentsia, counter culture etc…  and grind them myself.\n\nI weigh water and use that weight to calculate the weight of beans for a given batch. I use purified water always for my coffee. \n\nThe results have been great. However… \n\nSeveral days ago I saw a post on Instagram where someone suggested blooming your auto drip beans. \n\nSo I started incorporating the method into my drip coffee routine. Water, double the weight of the beans, heated in my electric kettle. Pour over the beans, wait 40 seconds and turn the machine on. \n\nThe results have been stunning. As good or better than any drip I’ve had at any of our local coffee shops. \n\nAnd I’m not brewing acid bombs that seem to be the go-to profile at most coffee shops these days. \n\nThe best part is that adding blooming to my auto drip routine adds little time to the process. \n\nIf you haven’t bloomed your auto drip coffee before I highly recommend it.",
        "created_utc": 1676036890,
        "upvote_ratio": 1.0
    },
    {
        "title": "Newbie, first time using hand grinder, need advice for Timemore c3 hand grinder. And does coffee bean quality affect grind size ?",
        "author": "handicaplock",
        "url": "https://www.reddit.com/r/Coffee/comments/10yr74f/newbie_first_time_using_hand_grinder_need_advice/",
        "text": "  Timemore’s guide say 7-8 click is for espresso, 13-16 for pour over. I’m using moka pot ( bialleti brikka) so as guide on internet say that moka pot grind size should be  coarser than espresso so I choose 12 click, my coffee is light roast, after grind the coffee turn out too fine , it get through my moka pot metal filter and coffee taste gross. Should I break the guide rule and go beyond 12 into 13-16 click. And does coffee bean quality affect grind size ? I’m a lil bit worry about my coffee bean because it is not a fancy kind of bean, just a local normal kind of bean.",
        "created_utc": 1676033442,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get an amazing taste of flavour with bevzilla coffee",
        "author": "Simple-Persimmon-689",
        "url": "https://ekaro.in/enkr20230210s20905373",
        "text": "",
        "created_utc": 1676033113,
        "upvote_ratio": 1.0
    },
    {
        "title": "Batman Arkham Vr Vrex Crack With Torrent Download Pc Game",
        "author": "Character-Coffee-452",
        "url": "https://pcgamesbits.info/batman-arkham-vr-vrex-crack-3/",
        "text": "",
        "created_utc": 1676032760,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nestle Coffee Mate",
        "author": "spjalle",
        "url": "https://www.beveragefltd.com/product/nestle-coffee-mate-200g-to-450g/",
        "text": "",
        "created_utc": 1676029479,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inflation has come for your morning brew as Starbucks rewards will require 2X the points for coffee",
        "author": "NineteenSixtySix",
        "url": "https://www.cbc.ca/news/business/starbucks-reward-points-changes-1.6741255",
        "text": "",
        "created_utc": 1676028345,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] The Daily Question Thread",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/10yp4wb/mod_the_daily_question_thread/",
        "text": " \n\nWelcome to the daily [/r/Coffee](https://www.reddit.com/r/Coffee) question thread!\n\nThere are no stupid questions here, ask a question and get an answer! We all have to start somewhere and sometimes it is hard to figure out just what you are doing right or doing wrong. Luckily, the [/r/Coffee](https://www.reddit.com/r/Coffee) community loves to help out.\n\nDo you have a question about how to use a specific piece of gear or what gear you should be buying? Want to know how much coffee you should use or how you should grind it? Not sure about how much water you should use or how hot it should be? Wondering about your coffee's shelf life?\n\nDon't forget to use the resources in our [wiki](http://www.reddit.com/r/Coffee/wiki)! We have some great starter guides on our [wiki \"Guides\" page](https://www.reddit.com/r/Coffee/wiki/guides) and [here is the wiki \"Gear By Price\" page](http://www.reddit.com/r/Coffee/wiki/gear#wiki_coffee_gear_suggestions) if you'd like to see coffee gear that [/r/Coffee](https://www.reddit.com/r/Coffee) members recommend.\n\nAs always, be nice!",
        "created_utc": 1676026809,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hand Of Fate 2 A Cold Crack With Torrent Download Pc Game",
        "author": "Character-Coffee-452",
        "url": "https://pcgamesbits.info/hand-of-fate-2-a-cold-crack-2/",
        "text": "",
        "created_utc": 1676021599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Great Decaf Coffee in Ontario, Canada?",
        "author": "JHC2",
        "url": "https://www.reddit.com/r/Coffee/comments/10ymewi/great_decaf_coffee_in_ontario_canada/",
        "text": "For my espresso hobby.  I prefer darker roasts (Full City+ and Vienna). Suggestions welcome.",
        "created_utc": 1676020998,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cafelat Robot Barista Model",
        "author": "JHC2",
        "url": "https://www.reddit.com/r/Coffee/comments/10ym845/cafelat_robot_barista_model/",
        "text": "Any suggestions on how or where to find a used one will be appreciated.  I’m in Ontario, Canada. Happy to chat.",
        "created_utc": 1676020630,
        "upvote_ratio": 1.0
    },
    {
        "title": "Protocol for measuring percentage of coffee fines?",
        "author": "blackmalt",
        "url": "https://www.reddit.com/r/Coffee/comments/10ylcvm/protocol_for_measuring_percentage_of_coffee_fines/",
        "text": "I'd like to compare the level of fines between my grinders and am  wondering how to normalize grind level between them. Would the following  protocol be accurate/useful enough?  \n\n\n1. Dial in a shot of espresso so that each grinder produces the same  shot time with the same amount of coffee (e.g. 30 sec, 10 gram in, 20  gram out).  \n2. Grind the same amount of coffee at this grind level and transfer into  a 250 micron sieve. Shake for a minute and measure the weight.   \n3. Attach a battery-powered blower and a custom cap to the sieve (see  comment below) in order to apply air pressure to blow out more fines.  Measure the weight.   \n\n\nI tried this with a friend's Kingrinder K4, grind level set to 46 clicks. Here are the results: \n\nSlowly cranking (about 80 RPM)  \n\n* Initial ground coffee weight: 10.13 gram (includes RDT)\n* After 1 minute of shaking: 9.20 gram\n* After blower: 8.33 gram\n\nUsing an electric screwdriver (a few hundred RPMs)  \n\n* Initial ground coffee weight: 10.08 gram (includes RDT)\n* After 1 minute of shaking: 7.86 gram\n* After blower: 6.51 gram\n\nDo these results make sense? Would they be comparable to another grinder adjusted to produce the aforementioned 30 sec shot?",
        "created_utc": 1676018953,
        "upvote_ratio": 1.0
    },
    {
        "title": "At least my coffee pot does this",
        "author": "JuhoS87",
        "url": "https://i.redd.it/3n7qwmblobha1.gif",
        "text": "",
        "created_utc": 1676018064,
        "upvote_ratio": 1.0
    },
    {
        "title": "It’s the little things in life",
        "author": "KingJoe710",
        "url": "https://i.redd.it/hsoo4u294dha1.jpg",
        "text": "I’ve been diving pretty deep into the world of espresso lately. I started with a ROK and didn’t have much success pulling a palatable shot. \n\nI picked up a GCP a couple of weeks ago and have really been enjoying tinkering with it and learning how to dial in shots. \nAfter hours of researching proper grind sizes, WDT techniques, puck preparation, temp surfing, and tons of awful shots. I finally managed to pull a shot with pretty even distribution, and actually managed to hit one of the tasting notes listed in the bag! It took a little longer to pull than what I was shooting for and still needs some work but man! Let me tell ya I was soooo stoked when I sipped my cup and it wasn’t an awful sour mess. \n\nNew grinder gets here today and I can’t wait to tinker and get it dialed in. Really enjoying this journey so far.",
        "created_utc": 1676017410,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee grounds as home fragrance?",
        "author": "bogdaniii",
        "url": "https://www.reddit.com/r/Coffee/comments/10ykez6/coffee_grounds_as_home_fragrance/",
        "text": "I love coffee, i'm making daily home brew with single origin coffee.  \nDoes anyone know an efficient way to use the daily coffee grounds as a home fragrance?   \nI mean a way to really extract the natural perfume out of it, not just simply letting it to dry on a plate. Something that could replace my home fragrance diffusers that i'm buying like once a month.",
        "created_utc": 1676017143,
        "upvote_ratio": 1.0
    },
    {
        "title": "How different flavours of coffee is made? How flavours in coffee is added when coffee in itself is kind of a flavour?",
        "author": "Zombiekeeda",
        "url": "https://www.reddit.com/r/Coffee/comments/10ykb66/how_different_flavours_of_coffee_is_made_how/",
        "text": "",
        "created_utc": 1676016938,
        "upvote_ratio": 1.0
    },
    {
        "title": "octonauts and the kwazi's depression creepypasta",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/10yk3d1/octonauts_and_the_kwazis_depression_creepypasta/",
        "text": "everyone was 2010 octonauts it was dark \n\ndon't post episode on YouTube or else channel was suspended due to a copyright claim by bbc \n\nfew months ago i am trying to find episodes parents to be on computer website with loaded with viruses risky as most no virus \n\ni watched 12 episodes after all i was so bored \n\nepisode called octonauts and the kwazi's depression however it was 6 seconds \n\ndue to from 2020 octonauts and the colossal squid this is only project \n\ni was confused episode was scrapped i should watch it \n\nturns out i was big mistake \n\nepisode began with usual theme song however part of submarine and pirates didn't appear in episode and when the title card appeared it was blood red instead of blue after theme song episode started \n\nkwazi sitting in coral at great lakes it was saltwater crocodile line of live action audio being fucked up \n\nkwazi:no hard feelings i am understand \n\nit cuts to octopus house there was no sound this was a lost episode \n\nafter 2 minutes kwazi begins to cry kwazi filled with pain in 30 seconds this wasn't real life crying this was animated sadness it made me vomit \n\nimage of dead starfish with head cut off and stomach split opening this is weird i am used dead starfish i carried on \n\nback to scene kwazi crying louder he stops crying screen with red eyes please don't think am i do kwazi with a gun kwazi put gun in his mouth with animation blood matter \n\nepisode ends peso crying over kwazi's dead body before cuts to black the credits came something like faint static \n\nscreen cuts to picture kwazi from octonauts and the colossal squid cutting his arm off with a saw this was disturbing blood covering with his orange skin kwazi had red eyes with brown pupils i had to turn volume down to 13% audio being played in the background distorted version of octonauts end credits played in reverse image cuts to black with text said i am god ending the episode \n\nit is in 4 days i am having very bad nightmares i talked to parents i can't watch octonauts seeing that kwazi covered with blood into my souls \n\nif you see any episode octonauts and the kwazi's depression do not watch it",
        "created_utc": 1676016464,
        "upvote_ratio": 1.0
    },
    {
        "title": "Brew Fresh Coffee Anytime with Coffee Pods!",
        "author": "United-Economist1521",
        "url": "https://www.reddit.com/r/Coffee/comments/10yjc1j/brew_fresh_coffee_anytime_with_coffee_pods/",
        "text": " \n\nCoffee pods are a great way to make a hot cup of coffee quickly and conveniently. With the Brew Fresh Coffee Anytime Coffee Pods, you can enjoy a fresh cup of coffee without having to wait for the machine to warm up or make a pot of coffee. The Brew Fresh Coffee Anytime Coffee Pods make it easy to enjoy a fresh cup of coffee in the comfort of your home or office.\n\nThe Brew Fresh Coffee Anytime [Coffee Pods](https://www.tworiversdirect.com/collections/coffee-pods)come in a variety of flavors, from light and mild to dark and bold. Each pod contains the perfect amount of freshly-ground coffee beans for one cup of coffee. The pods are compatible with most Keurig style machines, making it easy to make a delicious cup of coffee any time you want.\n\nBrew Fresh Coffee Anytime Coffee Pods are made with 100% Arabica coffee beans that are ethically sourced. They use a specially designed process to ensure that the coffee beans are evenly roasted and freshly ground, delivering a rich and flavorful cup of coffee. The pods are also air-tight sealed to keep the beans fresh and to protect the flavor of the coffee.\n\nBrew Fresh Coffee Anytime [Coffee Pods](https://www.tworiversdirect.com/collections/coffee-pods) are a great way to enjoy a fresh cup of coffee without having to wait for the machine to warm up. The pods are pre-measured, so you get the right amount of coffee every time. Plus, they are easy to use and clean up.\n\nBrew Fresh Coffee Anytime also offers a variety of other coffee products, such as ground coffee, espresso pods, cappuccino pods, and more. Their products are designed to make brewing coffee easy and convenient, so you can enjoy a fresh cup of coffee anytime you want.\n\nBrew Fresh Coffee Anytime makes it easy to enjoy a fresh cup of coffee any time you want. With their convenient coffee pods, you can make a delicious cup of coffee quickly and easily. Plus, their other products make it easy to make specialty coffees like cappuccino or espresso. So if you're looking for a convenient way to enjoy a fresh cup of coffee, Brew Fresh Coffee Anytime has the perfect products for you.",
        "created_utc": 1676014555,
        "upvote_ratio": 1.0
    },
    {
        "title": "Liverpool",
        "author": "Additional-Ad9871",
        "url": "https://www.reddit.com/r/Coffee/comments/10yi295/liverpool/",
        "text": "Hi there - I’m going to Liverpool next week for a couple of days staying on Drury Lane near the docks. Looking for recommendations for good independent coffee shops. Something like Bold Street Coffee. Thanks.",
        "created_utc": 1676009770,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kingrinder K4",
        "author": "Coffee2Shabby",
        "url": "https://www.reddit.com/r/Coffee/comments/10yh0dl/kingrinder_k4/",
        "text": "What would be the ideal grind size clicks for the K4 to produce espresso with medium roast coffee?\n\n&amp;#x200B;\n\nThanks",
        "created_utc": 1676006083,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resident Evil 2 Crack With Torrent Download Pc Game",
        "author": "Character-Coffee-452",
        "url": "https://pcgamesbits.info/resident-evil-2-crack-5/",
        "text": "",
        "created_utc": 1676005888,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cup of Excellent Jury",
        "author": "Onion_Slight",
        "url": "https://www.reddit.com/r/Coffee/comments/10ygmax/cup_of_excellent_jury/",
        "text": "Did anyone have experience of COE Jury?",
        "created_utc": 1676004799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Single-serve coffee maker that also makes clean hot water?",
        "author": "Katsuko88",
        "url": "https://www.reddit.com/r/Coffee/comments/10yfxni/singleserve_coffee_maker_that_also_makes_clean/",
        "text": "I have an old Hamilton Beach FlexBrew 49988 (address below so you can see) that I think has finally given up the ghost today. And unfortunately that model is no longer available nor can I seem to find anything quite like it. \n\nOn one side it was designed for single serve travel cups/mugs, the other for straight hot water. \n\nI drink both coffee and tea, but never a lot at once so this had been perfect. No wasted carafe and I didn't need to worry about about loose coffee grounds getting into the tea (which often happens when I use the Keurig at work). \n\nI guess alternatively, if I have to get a combined one, are there any models that allow for especially tall travel mugs? Or all they all the same size? \n\nDoes anyone have any recommendations? \n\n.\n.\n.\n.\n\n(https://hamiltonbeach.com/flexbrew-programmable-single-serve-coffee-maker-with-hot-water-dispenser-49988)",
        "created_utc": 1676002529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird thing happened with coffee recipe / V60",
        "author": "satoriyam",
        "url": "https://www.reddit.com/r/Coffee/comments/10yey6v/weird_thing_happened_with_coffee_recipe_v60/",
        "text": "Hi guys!\n\nI used my normal v60 grind with a new coffee from Colombia, except that I used a \"pulse pour\" technique as opposed to my regular \"one pour\". The first cup I made with this was heavenly. So much that I had to do it again following the same parameters. The second cup was incredibly amazing as the first one. A few days later, I came back to the same coffee and the same parameters I used. Now my coffee tastes weird, bitter, hollow, sour and somewhat over extracted. I was so perplexed by this that I even made another cup for my girl (she tasted both first cups) and she also noticed the huge difference in taste despite using the same recipe.\n\nHas this ever happened to any of you guys?\n\nThanks in advance for your thoughts!",
        "created_utc": 1675999448,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thrift shop grab for $7.99!",
        "author": "maybemason64",
        "url": "https://i.redd.it/rp2oza3llbha1.jpg",
        "text": "I’m pretty sure it’s the Stelton Theo Coffee Maker and it’s almost new in quality!",
        "created_utc": 1675999025,
        "upvote_ratio": 1.0
    },
    {
        "title": "Craziest latte flavors you enjoy?",
        "author": "Bakersbaby",
        "url": "https://www.reddit.com/r/Coffee/comments/10yd45b/craziest_latte_flavors_you_enjoy/",
        "text": "I made one today with banana milk, cinnamon and vanilla.  Banana bread latte!",
        "created_utc": 1675994176,
        "upvote_ratio": 1.0
    },
    {
        "title": "Speedway gas station cappuccino",
        "author": "Medinaj0435",
        "url": "https://www.reddit.com/r/Coffee/comments/10yd0vn/speedway_gas_station_cappuccino/",
        "text": "\nHey guys does anyone know the closest way to get to those machines that have the French vanilla cappuccino in gas stations? I bought a powder from Sams Club and mix it with milk but it just does not taste the same",
        "created_utc": 1675993919,
        "upvote_ratio": 1.0
    },
    {
        "title": "Your Comedy Minute: Starbucks Is So Expensive #Coffee #Tulsa #Oklahoma #...",
        "author": "yourcomedyminute",
        "url": "https://youtube.com/watch?v=NrMnjgvmkvM&amp;feature=share",
        "text": "",
        "created_utc": 1675993606,
        "upvote_ratio": 1.0
    },
    {
        "title": "did any one try dipping coffee?",
        "author": "Blackdiamondsud",
        "url": "https://www.reddit.com/r/Coffee/comments/10ycs5t/did_any_one_try_dipping_coffee/",
        "text": "Did anyone try dipping coffee? \nDid you dip instant coffee or any other type of coffee grounds?\nIsn't it too acidic for the gum?\n\nI've tried dipping nescafe instant coffee and it was too ac8dic to continue trying it, otherwise, it gave me an incredibly nice buzz \n\nTalk about you experiences please",
        "created_utc": 1675993231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to buy 1zpresso KPlus?",
        "author": "DenserCow",
        "url": "https://www.reddit.com/r/Coffee/comments/10ycqsq/where_to_buy_1zpresso_kplus/",
        "text": "",
        "created_utc": 1675993125,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best tasting pre ground coffee to use in a drip coffee machine? What ratio for a full pot?",
        "author": "Impressive_Mouse103",
        "url": "https://www.reddit.com/r/Coffee/comments/10yc28t/what_is_the_best_tasting_pre_ground_coffee_to_use/",
        "text": "",
        "created_utc": 1675991241,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experimental / Fun Coffee Roaster Reccomendation",
        "author": "EconomistAware",
        "url": "https://www.reddit.com/r/Coffee/comments/10ybilh/experimental_fun_coffee_roaster_reccomendation/",
        "text": "Hey gang,\n\nLooking for some new roasters to try, specifically those that use odd and experimental processing techniques leaning more on the side of \"artificial\" tasting notes rather than more traditional ones. Think the likes of B&amp;W and Dak in Amsterdam. If anyone knows any that are more popular and well established, please chime in. I would normally go to Dak for this need, but I just can't justify how much shipping is to the US from them right now. :/",
        "created_utc": 1675989766,
        "upvote_ratio": 1.0
    },
    {
        "title": "Comandante: Beans falling through",
        "author": "yan-gee",
        "url": "https://www.reddit.com/r/Coffee/comments/10yb77c/comandante_beans_falling_through/",
        "text": "In about one out of 10 grinds on my few months old Comandante I find whole coffee beans in the ground coffee bed. Is this normal?\n\nI usually grind medium (20clicks) and I have no idea how something so big can get through such a small opening undamaged.",
        "created_utc": 1675988871,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quick caffeine approximation for Moka pot? With weight measurement &amp; health repercussion queries",
        "author": "funkyRhymes",
        "url": "https://www.reddit.com/r/Coffee/comments/10yawzp/quick_caffeine_approximation_for_moka_pot_with/",
        "text": "Hi crew, longtime casual drip and french press coffee enjoyer! Apologies for the somewhat newbie question, but I am venturing in the world of moka / espresso, and as I am on a budget moka it is.  I'm not sure of /r/coffee's opinion here but if I measured out 25g of robusta / cafe bustelo for my 6cup moka pot.  The scientific evidence is a little wavering (esp given the variables involved) but if I use my 6cup moka pot with 25g robusta, am I looking at somewhere in the neighborhood of 200-300g of caffeine or 500-600g caffeine?? The FDA recommendation is about 400mg so I'd prefer to stay under that, for my longterm health so I can enjoy coffee for a while! :) Apologies if this is not the right forum to ask this question, and pls redirect me if there's a better place! thank you",
        "created_utc": 1675988104,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do any reputable roasters make real medium-dark or dark roast anymore?",
        "author": "fukinay",
        "url": "https://www.reddit.com/r/Coffee/comments/10y9oa1/do_any_reputable_roasters_make_real_mediumdark_or/",
        "text": "I’ll start off by saying I do not enjoy most 3rd wave / lighter roasts at all. I grew up in the 90s and used to full bodied smoky darker roasts. I don’t care to taste sweet (translation: acidic) and fruit in my coffee. I’ve tried several medium-dark and dark roasts well known roasters and disappointed with how bland and watered down they are. They’re smooth and kinda taste like coffee, but that’s about it. My latest disappointment was with Sight Glass “Banner Dark” blend from San Francisco. I made it using a French Press. It was like a medium roast - not even medium dark. I live in the SF Bay Area btw so there are many roasters here but only familiar with a few. Any recommendations? Until then I’ll go back to a medium or dark Philz Coffee blend. Thanks!",
        "created_utc": 1675984968,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm in coffee purgatory. please help.",
        "author": "SameerAlam99",
        "url": "https://www.reddit.com/r/Coffee/comments/10y926b/im_in_coffee_purgatory_please_help/",
        "text": "[removed]",
        "created_utc": 1675983511,
        "upvote_ratio": 1.0
    },
    {
        "title": "CREM EX3?",
        "author": "Soy_chunks",
        "url": "https://www.reddit.com/r/Coffee/comments/10y8fhx/crem_ex3/",
        "text": "Howdy friends! I’ve been trying to get my coffee concept off the ground for about 4 years now and I just hit (what I think) is a spring of good luck. \n\nI’m about to open my concept in a already established beer and wine bar in my area, and the owner of said bar literally just gave me an espresso machine for free. His reasoning is that he wanted to make this concept work for his business and mine as well which is awesome for sure. \n\nBut the issue here is I’m not familiar at all with this brand or machine and I’ve been in the industry for about 12 years now. It’s a CREM EX3 and there’s barely any solid info on them online. They seem to be popular over the pond, but I have so many questions about this machine and I have yet to find answers. \n\nIf you are familiar with the EX3 or any other machine in the CREM line up, I’d love to chat. \n\nThanks in advance!",
        "created_utc": 1675982020,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got a weird gift. Cold brew it?",
        "author": "SameerAlam99",
        "url": "https://www.reddit.com/r/Coffee/comments/10y8ffm/i_got_a_weird_gift_cold_brew_it/",
        "text": "TLDR: Can I make a cold brew with extremely fine grinds?\n\nSo, I recently got a gift of a Lebanese blend of pre ground coffee. The coffee feels and looks like powder to which I was first confused. The instructions at the back indicate using an ibrik/cezve to brew it, which explains the powder consistency. However I don't have an ibrik/cezve and it's really hard to get one in the country I live in. \n\nI wanted to ask if it's possible to use such an extremely fine grind in a cold brew. I'm interested in a cold brew, and it's the perfect coffee that's gone a bit old that I can use but I'm scared it'll just mix into the water and become sludgy and I won't be able to filter it. If it's not possible, I'll try to brew it in a small pot of some sort, but thought I should ask first.",
        "created_utc": 1675982016,
        "upvote_ratio": 1.0
    },
    {
        "title": "Latte with two extra milks - thoughts?",
        "author": "Professional_Long215",
        "url": "https://www.reddit.com/r/Coffee/comments/10y8exb/latte_with_two_extra_milks_thoughts/",
        "text": "",
        "created_utc": 1675981984,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moccamaster reservoir and water is orange-brown.",
        "author": "Time_Definition5004",
        "url": "https://www.reddit.com/gallery/10y79vs",
        "text": "I’ve had a Moccamaster for years and years, and I’ve never had this happen before. I’ve rinsed it and descaled multiple times, but it’s not helping. I have a query out to the company, but I’d like like to pick your brains and see if you can bump some ideas off me. Better yet, if you’ve had this happen to you, how did you resolve it? pictures are after descale and clean. Tube is clear. No slime I can see. Thanks all.",
        "created_utc": 1675979315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stuck with Keurig At Work",
        "author": "poorbanker",
        "url": "https://www.reddit.com/r/Coffee/comments/10y6wvk/stuck_with_keurig_at_work/",
        "text": "Hey folks - I am usually just a morning coffee drinker, but occasionally have a second cup after lunch.  I start my day with an Americano or latte that I make at home in my Bambino and I'm very happy with it.  In the afternoon, I'm stuck with my office's Keurig.  Are there any decent kcups out there that I can use?",
        "created_utc": 1675978441,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee with a diplomatic stamp of approval",
        "author": "MSG2RSO",
        "url": "https://www.reddit.com/r/Coffee/comments/10y6ndt/coffee_with_a_diplomatic_stamp_of_approval/",
        "text": "My foreign service friends, in 2021 I set out to start my own veteran owned coffee company that matched my love of world travel and coffee. From my time as an MSG Sudan, Serbia, and Hungary, to now with DSS I’ve learned that coffee might be the true key to diplomacy.\n\nFrom Japan, Korea, Kenya, and Tanzania to Hungary, Serbia, Czech Republic, Sudan, Germany, Egypt and many more, coffee has always been a way to easily connect with others. Whether it was having a cup of coffee with diplomats while drifting down the Nile river or quickly finishing your coffee before country team starts, coffee has been a connecting factor at each embassy I’ve been too. As I continue to travel around the world with my family I want to share the coffee I enjoy with everyone else. \n\nThat’s why I started Diplomatic Immunity Coffee, coffee beans sourced from around the world, fresh roasted, to provide you with robust coffee perfect for anytime of the day. \n\nI’m donating 10% of all proceeds to charitable causes. Take some time and check out my site, I’m sure the names of the coffees and their descriptions will atleast give you a laugh. I don’t think I can add selling coffee as an EER bullet 😂\n\nhttps://diplomaticimmunitycoffee.com\n\nhttps://instagram.com/diplomaticimmunitycoffee_llc?igshid=YmMyMTA2M2Y=",
        "created_utc": 1675977840,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I please have suggestions for canadian whole beans similar to Stumptown Holler Mountain?",
        "author": "j_a97",
        "url": "https://www.reddit.com/r/Coffee/comments/10y5fo6/can_i_please_have_suggestions_for_canadian_whole/",
        "text": "Hello everyone! 😊 i’ve been trying unsuccessfully the last while to find a canadian alternative for the Holler Mountain blend from Stumptown. I wasn’t a fan of Happy Frog Coffee and i’m currently working my way through a bag of BirchBark medium roast that has the same flavour notes according to the bag but I am not really enjoying. I dont even like the smell of the beans :( Im considering trying the heritage roast from Pilot or nostalgia from 49th Parallel but was wanting some opinions first. Im open to any suggestions but at this point ive tried 6 companies, 3 of which were canadian and the stumptown is by far my favourite. Thanks!",
        "created_utc": 1675974935,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I develop my palate?",
        "author": "LuckPuzzleheaded9118",
        "url": "https://www.reddit.com/r/Coffee/comments/10y46wy/how_can_i_develop_my_palate/",
        "text": "Currently new to the speciality coffee. I use aeropress to brew at home. I'm more into light roasted coffees and mostly all of them taste the same to me. Need suggestions as to how can I develop the palate",
        "created_utc": 1675972045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Replacement for Bonavita 8-Cup Glass Carafe Coffee Brewer",
        "author": "SekaiIchiapple",
        "url": "https://www.reddit.com/r/Coffee/comments/10y3ur6/replacement_for_bonavita_8cup_glass_carafe_coffee/",
        "text": "Hi y’all - I’m new to this page so I’m not sure if I’ll get roasted for wanting to brew drip coffee at home so please be gentle. I have an espresso set up, but my partner prefers making drip coffee. We were gifted a [Bonavita 8-Cup Glass Carafe Coffee Brewer](https://concentratedcup.com/products/bonavita-8-cup-glass-carafe-coffee-brewer) a few years ago and we recently broke it by dropping it. \n\nSince I know nothing about drip brewers I just know that this one was better than our old $20 Mr coffee I am looking for a replacement of similar quality but my max price would be $150. I’d be happy to re-buy this one but I’m not sure if there’s something better out there. Any ideas?",
        "created_utc": 1675971262,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mid life crisis",
        "author": "devilkid94",
        "url": "https://www.reddit.com/r/Coffee/comments/10y2sfw/mid_life_crisis/",
        "text": "Hello people. Let me tell you my story. I am 28, I live in London with my wife who’s a doctor. I have just started my career. Been just a few months since I got a job as a barista at a cafe. I make fairly decent coffee now. I make around £1300-1500 depending on the amount of shifts I take. The job is satisfying for me. The people and the manager at my workplace is amazing as of now. Really supportive and helpful. I feel that I am not getting enough time to spend with my wife and my cat. I don’t wanna be 50 and in a dead end job. Since the cafe is a franchise I know that if my put in the work and time I can become a manager and all. I don’t know if that’s what I want. I feel depressed a lot of the times. \n\nAny advice is welcome :)",
        "created_utc": 1675968915,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gooseneck alternative",
        "author": "greyberry1",
        "url": "https://i.redd.it/rzlftbkw39ha1.jpg",
        "text": "",
        "created_utc": 1675968865,
        "upvote_ratio": 1.0
    },
    {
        "title": "French Press Grind Size help",
        "author": "Electrical-Ad347",
        "url": "https://www.reddit.com/r/Coffee/comments/10y28hs/french_press_grind_size_help/",
        "text": " Hi everyone,\n\nI have a Breville Barista Pro that I use for espresso, which has a built-in grinder.\n\nI'm in the mood to start doing French Press coffee this winter though. My question is, can you recommend an appropriate grind setting on this machine for a French Press technique? I'm expecting to have to play around with it to fine tune it to my preferences, but I'm really just looking for a good place to start.\n\nThanks!",
        "created_utc": 1675967641,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grind size for French Press",
        "author": "Electrical-Ad347",
        "url": "https://www.reddit.com/r/Coffee/comments/10y1i6g/grind_size_for_french_press/",
        "text": "Hi everyone,\n\n&amp;#x200B;\n\nI have a Breville Barista Pro that I use for espresso. I'm in the mood to start doing French Press coffee this winter though. My question is, can you recommend an appropriate grind setting on this machine for a French Press technique? I'm expecting to have to play around with it to fine tune it to my preferences, but I'm really just looking for a good place to start.\n\n&amp;#x200B;\n\nThanks!",
        "created_utc": 1675965976,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boom",
        "author": "Rage-Fire3838",
        "url": "https://i.redd.it/528z1peyt8ha1.jpg",
        "text": "",
        "created_utc": 1675965519,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the “cheapest” home espresso machine that is much better than a moka pot and decent cafe substitutes?",
        "author": "Maleficent-Number-10",
        "url": "https://www.reddit.com/r/Coffee/comments/10y0tug/what_is_the_cheapest_home_espresso_machine_that/",
        "text": "For record, I’m disappointed with all pod machines I’ve tried.",
        "created_utc": 1675964445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clever &amp; Aeropress seem soooo similar yet produce different cups. Is it just that push?",
        "author": "Maleficent-Number-10",
        "url": "https://www.reddit.com/r/Coffee/comments/10y0rtk/clever_aeropress_seem_soooo_similar_yet_produce/",
        "text": "Title. \n\nLooking at Hoffmann recipes. They are nearly the same. \n\nFine ground. 2 minutes. Stir. Drain. \n\nYet they taste different and I like the clever while endlessly let down with the glorious aero press.",
        "created_utc": 1675964321,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you try to drink more water when you're drinking coffee?",
        "author": "Competitive-Age7181",
        "url": "https://www.reddit.com/r/Coffee/comments/10y0rbo/do_you_try_to_drink_more_water_when_youre/",
        "text": "Pretty self-explanatory. I'm not sure if coffee actually dehydrates me, but I feel like it's the responsible thing to do... Am I the only one? What do you think?",
        "created_utc": 1675964289,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it time for a new coffee maker? or wait and keep this?",
        "author": "Public_Prompt8300",
        "url": "https://www.reddit.com/r/Coffee/comments/10y08rn/is_it_time_for_a_new_coffee_maker_or_wait_and/",
        "text": "I am using a Hamilton Beach flexbrew and a mixespresso to make coffee but they also get blocked I don't know if it is due to the water. ( i might switch to liquid creamer instead of solid) Anyway so I was cleaning the HB and while its working it tastes awful. I have used vinegar and a chorlox wipe to clean so did I run this? These were just purchases since I could not be without coffee so now I would like to have a more permanent one that will last. \n\nI want to choose the size with the cup 8-12 or 14, a removable reservoir, and a way to make tea if I ever go down the hot tea route. But I can keep what I have if I can get rid of the awful taste and switch over to bottle water with liquid creamer.\n\nTIA",
        "created_utc": 1675963111,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone help me understand World AeroPress Championship recipes?",
        "author": "AigisAegis",
        "url": "https://www.reddit.com/r/Coffee/comments/10xzpbd/can_anyone_help_me_understand_world_aeropress/",
        "text": "I should preface this by saying that I know all the usual caveats for WAC recipes. They're not practical for everyday home brewing, they're tuned to a specific coffee, they're made for a specific water composition, so on and so forth. I get that I can't expect to plug a given WAC recipe in for any coffee and get something magical from it. I don't really even care to try.\n\nRather, I'm curious about a very specific trend in WAC top flight recipes. Everything that I know (or think that I know) about making coffee indicates that it's ideal to chase the highest level of extraction possible without extracting \"tannins\". Everything that I (think I) know about brewing with an AeroPress indicates that maximizing extraction means grinding as fine as possible without causing channeling, using a relatively low dosage of coffee (e.g. 1:16), using very hot water, and steeping for as long as is feasible.\n\nBut basically every WAC top finisher for years now has done the exact opposite of all of this. They almost all seem to grind very coarse (they previously ranked the coarseness 1-10 where 1 is very fine and 10 very coarse, and it seems that 8/10 was the most common ranking given), use relatively cool water (80C is common, anything over 90C is rare, almost nobody ever uses 100C), steep for less time than the competition rules seem to allow them (almost universally brew times of less than two minutes), and most mystifyingly to me, use enormous doses of coffee (typically nothing lower than 1:11 even after dilution, and as high as *1:3* during the brew).\n\nI'm just an amateur, but like I said, that's all nearly the exact opposite of what I've been taught results in good extraction. It seems like most WAC recipes would result in a wildly underextracted cup. This goes way beyond brews suited to a particular coffee - at first glance from my untrained eyes, it *looks* like most recipes go against what I thought were generally good brewing principles.\n\nSo why are so many of them like that? Am I fundamentally misunderstanding something about extraction and flavour, or is there something about the WAC tournament environment that adds context which I'm missing?",
        "created_utc": 1675961879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grinder Advice (Europe)",
        "author": "khenning",
        "url": "https://www.reddit.com/r/Coffee/comments/10xyg1m/grinder_advice_europe/",
        "text": "We are moving to The Netherlands in early March and I'll be starting my coffee setup from scratch.  I'll only be doing drip to start and will be getting a Moccamaster since they're widely available over there and relatively affordable.  But I need a grinder to go with it.  Right now I have three options:\n\n1. Baratza Encore - €179\n2. Wilfa Svart - €149\n3. Eureka Filtro - €126\n\nIn my mind the Filtro seems to be the no-brainer with the flat burrs and cheapest price.  Am I missing something or are there other options I should consider?  I'd be willing to go up to €250 if there was a good argument to do so.",
        "created_utc": 1675958793,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long after 'roasted-on' date should we wait to grind and use?",
        "author": "omarhani",
        "url": "https://www.reddit.com/r/Coffee/comments/10xyc2z/how_long_after_roastedon_date_should_we_wait_to/",
        "text": "I'm buying freshly medium roasted beans (fresh = days before purchase) and I'm finding it's a bit sour coming out of my espresso machine. My ratios are good and grind is fine. Should I be waiting a while before grinding and making my coffee? How long?",
        "created_utc": 1675958528,
        "upvote_ratio": 1.0
    },
    {
        "title": "What type of coffee would you recommend to a tea drinker?",
        "author": "CoraRosalie",
        "url": "https://www.reddit.com/r/Coffee/comments/10xy9t2/what_type_of_coffee_would_you_recommend_to_a_tea/",
        "text": "I have never really tried coffee, and have always wanted to but have no idea where to start. I'm British, and had my first cuppa age 2🤣\n\nWhat kind of coffee would you recommend? I'm not a massive fan of swert drinks, I drink my English breakfast tea with no sugar. There's so many types I don't know where to start.",
        "created_utc": 1675958401,
        "upvote_ratio": 1.0
    },
    {
        "title": "3 cup moka pot funnel in 6 cup moka pot?",
        "author": "lunabear_07",
        "url": "https://www.reddit.com/r/Coffee/comments/10xxsbo/3_cup_moka_pot_funnel_in_6_cup_moka_pot/",
        "text": "Does anybody know if a 3 cup moka pot funnel can be used in a 6 cup moka pot. I should have purchased a 3 cup pot, but I'd like to keep the 6 cup for making coffee for two people. I like to have one cup (and I essentially make an americano), but filling the funnel with coffee means it's too strong and using less grounds means less coffee quality, so I'm wondering if I could use a 3 cup funnel in my 6 cup pot. Thanks!",
        "created_utc": 1675957163,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fellow Carafe Explosion",
        "author": "COBengal",
        "url": "https://www.reddit.com/gallery/10xxoey",
        "text": "I was using my Fellow Carafe this morning, I poured a cup of coffee, put on the silicone lid and walked away. I heard a loud pop. I saw my carafe had popped off the lid and coffee was all over. I checked the Fellow carafe and the inner glass lining cracked. Has anyone experienced this?",
        "created_utc": 1675956883,
        "upvote_ratio": 1.0
    },
    {
        "title": "octonauts and the death of cone snail creepypasta",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/10xxeal/octonauts_and_the_death_of_cone_snail_creepypasta/",
        "text": "they made lost episode of octonauts besides toy story i like with other animated films from 2020s the movie called octonauts and the death of cone snail it was big mistake dude \n\ni wasd get the DVD it cut menu with play all bonus features and creature report and i clicked play it started off opening scene song it then cut to static and then movie started cone snail fighting the crab he was go on blimp trip to Mexico so loud i had to turn down volume at 13% he started to cry he told him that cone snail crashes the blimp into sponge and he was dead \n\nalternate ending \n\nit then to next scene funeral for cone snail bursted into tears everyone was crying the text it said r i p cone snail 1991-2016 a faded picture of cone snail's mangled body faded into black then end credits and cut back to DVD menu i took the DVD and i smashed it with a hammer it was never did could have so more issues if you happen to DVD do not watch it",
        "created_utc": 1675956176,
        "upvote_ratio": 1.0
    },
    {
        "title": "octonauts 666 creepypasta",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/10xwy7b/octonauts_666_creepypasta/",
        "text": "everyone was 2010 octonauts i told you that with dark \n\ni was look up octonauts i saw movie title octonauts 666 i never found it \n\nstory \n\nit began with no theme song or submarine it began with aquatic city live action looked glitchy barnacles was running away from sea cucumber as sea cucumber jumps on him mangled bodies of barnacles \n\nfew injuries in death with broken neck a hole with intestines barnacles didn't move at all \n\nfocusing on octopus house sea was dark skin was black and aquatic car painting on white \n\nvoice actor was been tortured kwazi was sobbing move to basement peso was sitting on swimming pool \n\nshe crack open a Pepsi it will become drunk bottle of apple snail potion after vomiting 2 times her head cracked open and blood on the ocean kwazi ran down slide and screamed we saw dead penguin inside covered with violet snails \n\ncarrots sitting on dinner table carrots has now blood stained he stabbed himself with super villain barnacles and peso is dead he said WHY DON'T GO TO SPONGE AND BITE BY A GODDAM BOBBIT WORM YOU BITCH she ran to room and cried out \n\nkwazi and Sheldon burning the barnacles and peso behind him tombstone albino humpback whale shot dashy the pet x ray tetra ran to inklin the octopus kwazi ate the corpse of inklin the octopus and the live action recgonized \n\nshe went to room x walls have beenstriped then grey bricks computer machines was broken now in all pieces just a few days kwazi's eyes were bloodshot she write mail in mail box and read it \n\ndear kwazi \n\nour pirates of people by only one thing \n\ni was barnacles walking on coral feeding eel for fish food \n\ni ever since captain barnacles died grew apart by suicide and accidents \n\nafter many days jumping to sponge and ripped apart by bobbit worm  \n\nif you don't then you will die it will crushing you're body \n\nat last mail carrots \n\ncarrot hanging with vent at noose around her neck the wounds pool of blood as kwaizi screamed and looking on bobbit worm in nuclear \n\nthe light turned black and cuts to credits \n\ni was watching the movie who created five nights at freddy's 0 i don't know if octonauts 666 is",
        "created_utc": 1675955066,
        "upvote_ratio": 1.0
    },
    {
        "title": "Onyx v60 guide Ode setting",
        "author": "saxnbass",
        "url": "https://www.reddit.com/r/Coffee/comments/10xw4gp/onyx_v60_guide_ode_setting/",
        "text": "In the Onyx V60 brew guide, Elika mentions grinding on a 1 on the Fellow Ode; obviously this refers to the Ode 2 with the original burrs. Does anyone know what the recommended grind setting would be on the Ode with the Gen 2 burrs? For reference, he said 10 on the Encore and 20 clicks on a Commandante C40.\n\n&amp;#x200B;\n\n[https://youtu.be/V30qg\\_pQ9mY](https://youtu.be/V30qg_pQ9mY)",
        "created_utc": 1675953023,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hack for massive clarity improvement inspired by the Timemore Sculptor",
        "author": "Crunkjudas",
        "url": "https://www.reddit.com/r/Coffee/comments/10xw3wm/hack_for_massive_clarity_improvement_inspired_by/",
        "text": "One thing the Sculptor does is take advantage of static rather than trying to overcome retention with tech like the Ode. It occurred to me that I could do the same thing with my 1zpresso hand grinder. I usually give it a few good whacks to knock anything clinging to the burrs and catch cup off into the grounds, but I’ve stopped doing that. I discard the fines stuck to the burr side and run a finger around the top of the catch cup to discard the fines there. It adds about 5 seconds to my workflow and instantly boosted clarity.",
        "created_utc": 1675952986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting back into coffee after getting over my GERD. Any recommendations for an affordable manual grinder ?",
        "author": "Nickyweg",
        "url": "https://www.reddit.com/r/Coffee/comments/10xw2uv/getting_back_into_coffee_after_getting_over_my/",
        "text": "",
        "created_utc": 1675952907,
        "upvote_ratio": 1.0
    },
    {
        "title": "octonauts lost DVD creepypasta",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/10xvqbu/octonauts_lost_dvd_creepypasta/",
        "text": "i have been octonauts fan i collected videos toys and DVDs \n\n10 years later due to new episodes i go on eBay for buying octonauts DVD \n\ni got the DVD and put it on DVD player it showed no trailers it popped out to DVD menu they got 3 buttons play bonus features and creature reports \n\nhowever it wasn't octonauts episode theme song was old \n\n1 theme song sounded funny \n\n2 live action showed pirate otter \n\n3 barnacles drives the amphibious vehicle he was smashing radio in amphibious vehicle \n\n4 at the point she went to sea volcano and gets volcano snail and zombie worm \n\n5 characters were in octonauts submarine was nothing octonauts was able to seen in submarine \n\nwhen episode was started it was creepy octonauts walking down coral characters were sitting on clam crying \n\ngoing for 3 minutes screen turning into black octonauts were in octopus house for no reason \n\nafter the credits theme song didn't play at all and hewas crying after cut back to DVD menu i am so scared \n\nhowever i haved no reason at all forever if i was you i am not buying the DVD and because not for sale",
        "created_utc": 1675951978,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nespresso Vertuo",
        "author": "Sorrywhat8961",
        "url": "https://www.reddit.com/r/Coffee/comments/10xvobw/nespresso_vertuo/",
        "text": "Looking for the best espresso pod flavors for espresso, I like things that are creamy and on the sweeter side… also is there any physical store I can buy them from or is it only online??",
        "created_utc": 1675951835,
        "upvote_ratio": 1.0
    },
    {
        "title": "octonauts the lost episode creepypasta",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/10xv6qj/octonauts_the_lost_episode_creepypasta/",
        "text": "i'm sure many people about octonauts after this episode \n\ni waas looking up some octonauts DVDs on Amazon it said \n\nthere was a DVD it said octonauts rare episode in yellow sharpie i popped DVD and i clicked play there was minute of a static then cut to theme song it is not normal it was very loud i heard a screeching noise submarine sliding down Christmas tree worm \n\nbarnacles going with pirate ship part of the reef i looked as hermit crab and i here real potion warning do not drink it camera for 5 seconds eyes turned red and grab a sea anemone chopping heads off until they died \n\npeso were watching TV he then said bye bye you little stupid penguin before kill it us for rest of the episode we saw \n\nlast scene showed barnacles in graveyard with dead corpses he said i am going to find you instead of credits there was Russia it cut back to DVD menu then barnacles knocking on the door and i open it barnacles killed me \n\nif you find this DVD in Amazon don't add to shopping list or barnacles will kill you",
        "created_utc": 1675950539,
        "upvote_ratio": 1.0
    },
    {
        "title": "DF64 to replace current setup",
        "author": "Z-Sneezy",
        "url": "https://www.reddit.com/r/Coffee/comments/10xuzw9/df64_to_replace_current_setup/",
        "text": "I currently use the OXO Conical burr for filter coffee (mostly aeropress), and a 1Zpresso J Max for espresso. I'm considering getting the DF64 to replace both. However, I'm unsure if the workflow will be annoying switching grind size back and forth daily. It should be as simple as spinning the dial, but I'm not sure if there is anything I might be missing.",
        "created_utc": 1675950006,
        "upvote_ratio": 1.0
    },
    {
        "title": "I use a handheld vacuum to clean up any spilled grounds or while I’m cleaning my ginder",
        "author": "Naturebrah",
        "url": "https://i.imgur.com/Vitga5d.jpg",
        "text": "",
        "created_utc": 1675949861,
        "upvote_ratio": 1.0
    },
    {
        "title": "Let's see if all the hype is true.",
        "author": "wandering_geek",
        "url": "https://i.imgur.com/Wg7qJiP.jpg",
        "text": "",
        "created_utc": 1675948790,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it just me, or does instant coffee kinda suck?",
        "author": "3sperr",
        "url": "https://www.reddit.com/r/Coffee/comments/10xtzry/is_it_just_me_or_does_instant_coffee_kinda_suck/",
        "text": "I dont mean the taste. It tastes pretty good to me. But the thing is, I dont drink coffee for the taste lol. I drink it for the enegy.\n\nWhen I drink instant coffee, I feel nothing after I drink it. No energy boost, no extra awareness, nothing. Im not desensitized because that's been happening ever since I started. I havent tried expresso coffee yet, but I will soon. Does expresso coffee really have such a big upgrade from instant coffee? Everyones saying expresso is way stronger and way better. I cant wait to try it out this summer. \n\nAnyways, instant coffee sucks in terms of giving you energy. I drink it because I'm like \"might aswell get something than get nothing\". But I still feel the same after I drink it lol. Does anyone else detect no increase in energy after drinking instant coffee?",
        "created_utc": 1675947081,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Morning Ritual",
        "author": "NoChildhood7781",
        "url": "https://teesdesk-usa.com/the-morning-ritual-coffee?s=hanes-5250&amp;c=Black&amp;p=FRONT",
        "text": "",
        "created_utc": 1675946766,
        "upvote_ratio": 1.0
    },
    {
        "title": "WeChat verification",
        "author": "Riquenn",
        "url": "https://www.reddit.com/r/Coffee/comments/10xtqll/wechat_verification/",
        "text": "i can't verify my",
        "created_utc": 1675946289,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] The Daily Question Thread",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/10xs0iy/mod_the_daily_question_thread/",
        "text": " \n\nWelcome to the daily [/r/Coffee](https://www.reddit.com/r/Coffee) question thread!\n\nThere are no stupid questions here, ask a question and get an answer! We all have to start somewhere and sometimes it is hard to figure out just what you are doing right or doing wrong. Luckily, the [/r/Coffee](https://www.reddit.com/r/Coffee) community loves to help out.\n\nDo you have a question about how to use a specific piece of gear or what gear you should be buying? Want to know how much coffee you should use or how you should grind it? Not sure about how much water you should use or how hot it should be? Wondering about your coffee's shelf life?\n\nDon't forget to use the resources in our [wiki](http://www.reddit.com/r/Coffee/wiki)! We have some great starter guides on our [wiki \"Guides\" page](https://www.reddit.com/r/Coffee/wiki/guides) and [here is the wiki \"Gear By Price\" page](http://www.reddit.com/r/Coffee/wiki/gear#wiki_coffee_gear_suggestions) if you'd like to see coffee gear that [/r/Coffee](https://www.reddit.com/r/Coffee) members recommend.\n\nAs always, be nice!",
        "created_utc": 1675940409,
        "upvote_ratio": 1.0
    },
    {
        "title": "Streets Of Rogue Crack With Torrent Download Pc Game 2021",
        "author": "Character-Coffee-452",
        "url": "https://pcgamesbits.info/streets-of-rogue-crack-2/",
        "text": "",
        "created_utc": 1675937336,
        "upvote_ratio": 1.0
    },
    {
        "title": "20% fines from Timemore Slim?",
        "author": "Prosper0_cz",
        "url": "https://www.reddit.com/r/Coffee/comments/10xpgjs/20_fines_from_timemore_slim/",
        "text": "I was sensing a lot of bitterness in my coffee (AP or V60) and came to the conclusion the culprit might be fines.\n\nMy grinder is Timemore Slim.\n\nI decided to try and sift fines from the coffee using a common kitchen sieve. I weighed my standard dose (12 grams) and ground it relatively coursely (ca.18-19 clicks).\n\nI was shocked with the result.\n\n2.3 grams is basically 20%. And even visually, that's a massive amount. On my fingers it really felt like a very fine coffee powder - perhaps not as fine as supermarket-bought espresso pack but still.  \n\n\nWhat do I do now (before changing grinders:-/). I tried the alignment test (rotating the grinder body whilst only holding the handle) and it seemed to me it was rotating freely at around 9 clicks. I feel like that's not perfect but it's not terrible either. Understand 8 is really good already.  \n\n\nAny recommendations?",
        "created_utc": 1675930733,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grinder Suggestions Under $300?",
        "author": "Mullet0ver",
        "url": "https://www.reddit.com/r/Coffee/comments/10xnuaj/grinder_suggestions_under_300/",
        "text": "Currently have a Lido ET and have been using an OXO Barista Brain w/scale (was a cheap used marketplace buy). I always weigh out my beans beforehand, so I never use the integrated scale.  I do like the OXO,  but there is a noticeable difference between it and the manual Lido.\n\nRight now, 60% of the time I brew drip on a Moccamaster.  I did just pick up a Clever dripper, which I am loving, so that may become my primary. Also brew french press and V60. No espresso.\n\nLooking to up the consistency of the electric grinder. Have it narrowed between the Eureka Mignon Filtro/Crono and the Baratza Virtuoso+.  Open to other options under $300 as well.\n\nThe Virtuoso+ was my first choice due to availability of parts, but the build quality of the Eureka seems like a biig upgrade, so now I am second guessing.\n\nSuggestions?",
        "created_utc": 1675924914,
        "upvote_ratio": 1.0
    },
    {
        "title": "Breville Barista Express Impress vs Philips 3200 Lattego",
        "author": "DarkKn1ght743",
        "url": "https://www.reddit.com/r/Coffee/comments/10xmzk5/breville_barista_express_impress_vs_philips_3200/",
        "text": "Hello, I am a total and compete beginner to coffee. Somehow, I was able to get the breville barista express impress for a total steal from a local seller which seems pretty intimidating for someone like me. The other option recommended to me by a friend was the Philips 3200 lattego since it is way more efficient and has pre set options.\n\n&amp;#x200B;\n\nShould I just sell the breville and purchase the Philips (for full price) or keep this and learn the life of coffee. I personally value convenience at this time of my life and would love to just get coffee with a touch of a button. \n\n&amp;#x200B;\n\nWould love to hear any feedback or advice.",
        "created_utc": 1675922123,
        "upvote_ratio": 1.0
    },
    {
        "title": "Subnautica Crack With Torrent Download Pc Game",
        "author": "Character-Coffee-452",
        "url": "https://pcgamesbits.info/subnautica-crack-2/",
        "text": "",
        "created_utc": 1675912990,
        "upvote_ratio": 1.0
    },
    {
        "title": "According to Timemore on their Facebook group. The sculptor 064 will not be compatible with any other 64mm burrs",
        "author": "burntmoney",
        "url": "https://www.reddit.com/r/Coffee/comments/10xji5s/according_to_timemore_on_their_facebook_group_the/",
        "text": "That seems like a really dumb decision.",
        "created_utc": 1675911699,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tropical Weather - Ethiopian Blend by Onyx Coffee Lab",
        "author": "Lickformine",
        "url": "https://i.redd.it/tr3hikosd4ha1.jpg",
        "text": "A literal cup of sunshine composed of two Ethiopians. One natural and one dried and fermented, resulting in a fruit forward, heavy bodied cup with delicate floral notes.",
        "created_utc": 1675911656,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I foam Minor Figures Barista oat milk without a steam wand?",
        "author": "adesireformorecows",
        "url": "https://www.reddit.com/r/Coffee/comments/10xh1oy/how_do_i_foam_minor_figures_barista_oat_milk/",
        "text": "Pretty much the title.\n\nI own a Nespresso milk frothener, plus one of those 6£ amazon electric handheld whisks, and a classic manual milk frother. No matter what I use there is simply no way to get even the microest foam out of the Minor Figures Barista oat milk.\n\nAlpro oat barista is great when i foam it using the manual frother - which is my favourite as the results are much silkier than with the nespresso/electric whisk. But there seems to be no way in hell to work with MF barista.\n\nDoes anyone have any tips? Is it really either steam wand or nothing?",
        "created_utc": 1675905179,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you used this Chemex accessory???",
        "author": "Upbeat_Vermicelli983",
        "url": "https://www.reddit.com/r/Coffee/comments/10xg0ba/have_you_used_this_chemex_accessory/",
        "text": "I weekly user of hand make coffee with 6cup Chemex.\n\nI purchased an Brew Clip. They say it improves brew time.\n\nWhat been your experience???",
        "created_utc": 1675902521,
        "upvote_ratio": 1.0
    },
    {
        "title": "Try out accessory for Chemex have you used it ???",
        "author": "Upbeat_Vermicelli983",
        "url": "https://www.reddit.com/r/Coffee/comments/10xfs31/try_out_accessory_for_chemex_have_you_used_it/",
        "text": "I just order a Brew Clip for my Chemex. My Chemex is by hand not auto type. \n\nMy hope is it will protect from a stall and give me bit more wiggle room with grind size because it has more breathing room.\n\nWhat your thoughts ???",
        "created_utc": 1675901953,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fully auto machine with good grinder?",
        "author": "sheera3308",
        "url": "https://www.reddit.com/r/Coffee/comments/10xf9d2/fully_auto_machine_with_good_grinder/",
        "text": "Weird question, but I have a fully auto Delonghi Espresso machine, i.e. it grinds whole beans and spits out espresso.\n\nIt has an option of using preground coffee, which I used once and it was not good. That being said, in my quest to upgrade in phases, would it make sense to get a good grinder (perhaps Niche) and use the preground slot in the Delonghi, would that be better than using whole beans in the Delonghi?",
        "created_utc": 1675900715,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much is too much?",
        "author": "Pentylenetetrazole",
        "url": "https://www.reddit.com/r/Coffee/comments/10xdni8/how_much_is_too_much/",
        "text": "How much coffee is too much?\n\nI’ve been drinking like 10 cups per day.",
        "created_utc": 1675896940,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question from a newbie: which machine to get (and when)?",
        "author": "newbeeee13",
        "url": "https://www.reddit.com/r/Coffee/comments/10xbkhw/question_from_a_newbie_which_machine_to_get_and/",
        "text": "I have been drinking mokka pot coffee for 2 decades but only recently got interested in specialty coffee. I am now considering buying an espresso machine since I really love espresso-style coffee and it’s what I am used to. However I am the only one in my household to drink coffee and I only have 1-2 shots /day (currently using bialetti for 1 cup, usually with milk frothed by hand, I know 🙈) so I am not sure it’s worth the hassle of a semi-automatic. \n\nSince I have discovered alternatives e.g. manual lever machines like Flair, or 9barista, I have been wondering: \n* Would you recommend these as a start into the espresso world? \n* Which would you recommend (up to max 400€)? \n* Or would you recommend putting the decision off until I figure out more what kind of coffee I like (e.g. which roast, as apparently different machines handle them differently, and play around with different methods)?\n\nI also recently got an aeropress (I have no experience with filter or full immersion techniques but tried the Aeropress at a friend’s and really liked the coffee - even without milk) and a comandante c40 grinder and a scale to go with it (after an electric blade grinder that I hated). So in case you have advice on how to experiment and what to try out with that set-up, any advice is much appreciated.",
        "created_utc": 1675892175,
        "upvote_ratio": 1.0
    },
    {
        "title": "You taking this deal?",
        "author": "atashka777",
        "url": "https://i.redd.it/zd6z79l7r2ha1.jpg",
        "text": "",
        "created_utc": 1675891956,
        "upvote_ratio": 1.0
    },
    {
        "title": "More sustainable way to use a Keurig.",
        "author": "BacchaeMortem",
        "url": "https://www.reddit.com/r/Coffee/comments/10x96vq/more_sustainable_way_to_use_a_keurig/",
        "text": "So I know a lot of people that are generally into their coffee don't like Keurig's but I have one and am trying how to use it sustainably. I was given some reusable coffee pods, and read that medium grins coffee works best for that, does anyone know a bulk medium grins coffee on Amazon?",
        "created_utc": 1675886706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cone Filters vs Basket Filters",
        "author": "heaven_dweller",
        "url": "https://www.reddit.com/r/Coffee/comments/10x8quh/cone_filters_vs_basket_filters/",
        "text": "Why are cone filters thicker than basket filters?",
        "created_utc": 1675885655,
        "upvote_ratio": 1.0
    },
    {
        "title": "¿Qué bebidas energéticas puedo consumir que no sean café? - Auto Mercado",
        "author": "wsiconectadigital",
        "url": "https://automercadoesmilugar.com/que-bebidas-energeticas-puedo-consumir-que-no-sean-cafe/",
        "text": "",
        "created_utc": 1675885285,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whole Bean vs Ground",
        "author": "Irrish84",
        "url": "https://www.reddit.com/r/Coffee/comments/10x7z3j/whole_bean_vs_ground/",
        "text": "Hey folks. Long time coffee drinker, first time poster. So forgive me if this is a subject that’s been beaten to death. \n\nI drink a lot of coffee, both 10 cup and single brew (with #2 filters) and was thinking if I should up my game and switch to the whole beans and grind, or keep with already ground beans. As the title suggests: What are the benefits/differences of going to work route and grinding vs ground? \n\nAnother post had this nice grinder on it, C2, and it looks nice enough to create this post and pick the minds of my fellows. \n\nThanks!",
        "created_utc": 1675883801,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I use a candle🕯️ for heating vacuum pot?",
        "author": "Fluffy_Gur8714",
        "url": "https://www.reddit.com/r/Coffee/comments/10x7kt2/can_i_use_a_candle_for_heating_vacuum_pot/",
        "text": "",
        "created_utc": 1675882864,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee College: Everything You Wanted to Know about Coffee Making in One Lecture",
        "author": "koavf",
        "url": "https://www.openculture.com/2023/02/coffee-college-everything-you-wanted-to-know-about-coffee-making-in-one-lecture.html",
        "text": "",
        "created_utc": 1675882074,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommend me a carafe/coffee server",
        "author": "reverze1901",
        "url": "https://www.reddit.com/r/Coffee/comments/10x6jak/recommend_me_a_carafecoffee_server/",
        "text": "Been drinking coffee for about 20 years now, and believe it or not, i've always drank out of a diner mug at home. So, i'm looking for a carafe that has a well designed spout (finishes the pour cleanly), and comes with a lid (the fellow one looks great, but doesn't come with a lid). Around 500 ml would be ideal. \n\nThank you in advance for your suggestions!",
        "created_utc": 1675880277,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to purchase timemore c2?",
        "author": "llmercll",
        "url": "https://www.reddit.com/r/Coffee/comments/10x6c3g/where_to_purchase_timemore_c2/",
        "text": "I'm located in the us, north carolina. What website should I purchase the tinemore g2 coffee grinder from? I don't see it for sale anywhere.\n\nI also dont want to get a fake",
        "created_utc": 1675879802,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much coffee should i drink a day?",
        "author": "fungus_snake3848",
        "url": "https://www.reddit.com/r/Coffee/comments/10x5qe1/how_much_coffee_should_i_drink_a_day/",
        "text": "I know that the limit is 3 cups a day what i like my mokka pot a lot and everytime i do coffee and fill my basket its 20g of ground coffee - does that mean that i drink the amount of coffee in 4 nespresso capsule??? (Each capsule contains 5g)",
        "created_utc": 1675878364,
        "upvote_ratio": 1.0
    },
    {
        "title": "Okami Hd Proper Skidrow Crack With Torrent Download Pc Game",
        "author": "Character-Coffee-452",
        "url": "https://pcgamesbits.info/okami-hd-proper-skidrow-crack-2/",
        "text": "",
        "created_utc": 1675875967,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi! Machine saeco intuita hd8750, after cleaning i have issues with returning the black part on second picture back in? any ideas?",
        "author": "snipeE23",
        "url": "https://www.reddit.com/gallery/10x4jel",
        "text": "",
        "created_utc": 1675875556,
        "upvote_ratio": 1.0
    }
]