[
    {
        "title": "Recommended Roasters.",
        "author": "Own_Communication827",
        "url": "https://www.reddit.com/r/Coffee/comments/10ttuv6/recommended_roasters/",
        "text": "Hello enthusiasts, beginner and seasoned brewers,\n\nI have been enjoying the beans of a local roaster near me for some time. (Black and white coffee roasters)\n\nHowever, I'd like to branch out and see what other roasters have to offer. I can appreciate different types of espresso, but I have 2 general \"types\" of beans I'm looking for.\n\n1. I'd like to find a bean that has incredible texture, and a classic style flavor. I would love to find something that has a surprisingly thick and syrupy feel to it, and preferably with that classic chocolate or caramely flavor to it.\n\n2. I'd also like to find a roast that is nearly opposite. Something wildly fruity, almost suspiciously so. I had a strawberry flavored roast from Black and white from a roaster called Guzman that almost had a strawberry yogurt flavor that I loved. As this has been discontinued, I want to know if anyone knows of something like this. Passion fruit or even pineapple would be something exciting to me.\n\n\nI'd like to thank those of you you fully read my post, and thank in advance anyone who takes the time to introduce me to the coffees I haven't had the pleasure of experiencing.",
        "created_utc": 1675551221,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your preferred brewing method and why?",
        "author": "llmercll",
        "url": "https://www.reddit.com/r/Coffee/comments/10tt3td/what_is_your_preferred_brewing_method_and_why/",
        "text": "is there a brewing method that is objectively the best? what do you prefer and why?",
        "created_utc": 1675549291,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee order",
        "author": "Calm-Cauliflower838",
        "url": "https://www.reddit.com/r/Coffee/comments/10trfq5/coffee_order/",
        "text": "Coffee order ideas from Starbucks, I’m sick of my order",
        "created_utc": 1675545130,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sustainable way to make coffee?",
        "author": "llamallamallama1991",
        "url": "https://www.reddit.com/r/Coffee/comments/10tr03y/sustainable_way_to_make_coffee/",
        "text": "Hello fellow addicts and lovers of coffee,\n\nI really like products that last a long long time, and don’t come with a bunch of disposable plastic thingies. Yeah the keurig in the office is convenient, but the brew isn’t all that and it’s SO MUCH PLASTIC. \n\nI’ve heard of the Moka Pot and it seems like a great choice. Are there any other good options? What are the most reliable brands?\n\nThanks y’all ❤️",
        "created_utc": 1675544038,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your favorite ground coffee ?",
        "author": "Gstone716",
        "url": "https://www.reddit.com/r/Coffee/comments/10tqryt/whats_your_favorite_ground_coffee/",
        "text": "I know buying whole beans is better but I’m unable to grind my own beans currently so I’m looking for what’s everyone’s favorite ground coffee ?",
        "created_utc": 1675543456,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bodum mesh coffee filter",
        "author": "LandsFinest",
        "url": "https://www.reddit.com/r/Coffee/comments/10tq2dn/bodum_mesh_coffee_filter/",
        "text": "I have been using my Bodum pour over coffee kit for quite awhile. When I am done I just wash the metal/mesh filter quickly with some warm water  dish soap and my hands.  My question is how long are these filters good to last ? Also should I just be letting them soak in vinegar overnight  rather than using soap and water ?",
        "created_utc": 1675541710,
        "upvote_ratio": 1.0
    },
    {
        "title": "New home espresso machine",
        "author": "sahaaj07",
        "url": "https://www.reddit.com/r/Coffee/comments/10tpj82/new_home_espresso_machine/",
        "text": "I recently got an entry level espresso machine and its a very basic one. I am having some problem frothing milk using my machine. The milk frother of my machine is a cylindrical pipe with an open end from where the steam comes out. But I have seen that most of the machines have a milk frother which have several holes at the bottom. Could that be the reason I am not a le to froth milk correctly?\n\nAlso any tips to make better coffee are welcome.\nThanks😊",
        "created_utc": 1675540436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee machine making weird hissy sounds and doesn't fully dispense the coffee? I sent it to the manufacturer though and they said there's nothing wrong with it?",
        "author": "hatethissomuchthrowa",
        "url": "https://www.reddit.com/r/Coffee/comments/10toy0l/coffee_machine_making_weird_hissy_sounds_and/",
        "text": "Could anyone advise how I can perhaps fix it myself.",
        "created_utc": 1675538984,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good morning! 😭",
        "author": "simple_mech",
        "url": "https://i.redd.it/4nsbyifcd9ga1.jpg",
        "text": "",
        "created_utc": 1675536191,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long do Starbucks coffee beans last?",
        "author": "ml5c0u5lu",
        "url": "https://www.reddit.com/r/Coffee/comments/10tnav0/how_long_do_starbucks_coffee_beans_last/",
        "text": "I somehow had a bag of veranda blend beans hidden in the back of my cabinet for the last two years. I opened them up and they smell decent, almost chocolatey. Is it safe to try them?",
        "created_utc": 1675534946,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone had this happen in their cafetière?",
        "author": "aaahhhhhhgaeo",
        "url": "https://www.reddit.com/gallery/10tmtw1",
        "text": "I don’t think it’s mold- it happened overnight and think it might be something to do with excess oil &amp; dish soap mixing. So so weird and it’s currently soaking in white vinegar and baking powder to eliminate any risks but just wondered if this has happened to anyone else?",
        "created_utc": 1675533811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question for coffee roasters (home and commercial)",
        "author": "TheSixthMan90",
        "url": "https://www.reddit.com/r/Coffee/comments/10tmqwg/question_for_coffee_roasters_home_and_commercial/",
        "text": "Hi all. I have a question for you coffee roasters. Have any of you noticed a reduction in the quality of green beans and the quality of the cup as a result? I have ordered from a lot of different online vendors and the beans are moldy, sour, insect damaged etc. And, my roasts are not as good as they use to be even tho my roasting techniques have not changed. Eventually, I tried different roasting techniques to try and compensate, but to no avail. Has anyone else had this problem?",
        "created_utc": 1675533620,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tasted Delicious. The flow rate seemed slower than usual, noticed a pool of water on top of the puck. Lavazza Espresso Italiano - Medium (Roasted: 08/10/22) BBP, 19 Second grind time, lowest temperature, default double shot extraction.",
        "author": "SharkSapphire",
        "url": "https://youtube.com/shorts/xSOi1kP32go?feature=share",
        "text": "",
        "created_utc": 1675531888,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nickelodeon blood splat creepypasta",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/10tlpm1/nickelodeon_blood_splat_creepypasta/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/y9z6a6dy37ga1.png?width=412&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=ef8babed3c7081d06fd536fd5593cba871051ad1\n\ni heard of them rare in Europe country of future and so i went to Canada and hotel with her blimp and taxi you're just some like \n\nneon lights work as an Xhosa version alongside DVDs and videos i was eating sea cucumber \n\nshe went to insect cafe with insect cook book spiders beetles and water bugs i was coloring flying vehicle windows with green pencil i will never will \n\nanother thing to hotel and i love Amercian hotel you can cook popcorn in microwave living in closet \n\nyou can watch abc for kids i was watching news 7 \n\nshe left as the bed it is look like Alex's old house they watches the fox 8 \n\nyou can eat eel in restaurant i was watching TV the Canadan hotel number is 268 \n\ni was checking blanket in closet she is go on the boat \n\nabout stay in Canada you got 400 dollars and so i got no money \n\nin an hotel rushed out of the jeep \n\nwatching news 7 she is about tornado destroys house \n\nshe is on Tesla \n\nit is like fox 8 watching TV shows \n\nthere is the dead cockroach in oven \n\nit is like world war 2 \n\nshe checked the fridge inside the TV set \n\ni was cooking crab i had no choice アル put TV in DVD source \n\ni need my money looking in direction with Canadan hotel \n\ni didn't couple of weeks under furniture beside the TV disc was damaged \n\ni noticed that disc he was available visit him hotel \n\nduring in kitchen in this hotel i was watching abc for kids full of sound and video computers analog source screen speakers they got 3d photos \n\nit was technical static they got no signal DVD on sink \n\nthey got smart card mp4 stored on DVD destroy both discs oh well Netflix is not connected to internet on TV i forgot about him \n\ni asked him it was ancient character ran out of door and go up the elevator you can rides the cybertruck \n\noh well i was about it \n\ni had from video signal under my static brings the discs \n\ni left as store goes back to hotel and knocking on the door it was DVD drive into television it was disc from photos and videos the full screen video \n\nget back in bathroom i saw that movie a disgusting nightmare fish logo to be blood splat since 2017 it was blood fish logo \n\nwith a loud high sound tearing our ears bright color of black and white with blood mouse logo \n\ni did nothing black screen screen flickered an old video blood splat logo nick jr dinosaur logo fading to black glitched out burst of white noise attic was flooded power were out electric buzz of lights hospital doors with small windows \n\ngroan of pain electronic buzz tearful sobbing image of nick jr seal logo guttural roars scream of tearing \n\nscreaming and sobbing sound of animated agony mauled by cruelty \n\ncontinued down office building millipedes hiding under the bed Mexico language noise was so bad digital white noise \n\npicture of image Nickelodeon dinosaurs logo cry out in horror broke our minds \n\nNickelodeon orange splat TV cable logo of same name lay on dissection table \n\nimage stark of movie \n\nhis splat was side his splat was chainsaw on red skin pain was both red splat \n\nafter he failed white noise with blood shot translated to English subtitles \n\nblood curling scream teared up sobs eating dark souls with ear 100% volume \n\nimages of terrible torture screaming and crying i could hear the maniacal laughter of Nickelodeon \n\nit was lower they put in night vision around his button \n\nfront of night vision in our glove \n\ncovered with black skin Nickelodeon was sobbing \n\n5 minutes it is going to be torture \n\nit was just blank Nickelodeon logo with blood stained walls and gore on floor drip of white liquid \n\ncables and wires with the long invertebrate \n\nit was terminated over time that Nickelodeon's suit \n\nwith Nickelodeon eyes voice of surgeon \n\nguttural anguish sink with running mud water just that screaming and crying \n\nIIIIIIIIIII \n\nas TV show ended i was so sick falling on the kitchen around the bedroom \n\ni was vomiting i rushed to the toilet i was going up the elevator and out of the hotel goes back to hotel and going to bathroom disc tray open from TV movie cable was gone i did not watch it \n\ni was vomit to toilet water at sewer it was alligator terrible images i heard voice in the TV i returned to elevator terrible nightmares go on floor 6 i was goes back to hotel i got trash can at Canadan store and vomit to piles of maggots \n\ni was hide from 1st bedroom under my closet with extreme graphic TV show \n\na few months after was in hotel i was last week i didn't have to hotel i was go on power button and i turn TV off \n\ni returned to Canada in 30 years later \n\nfound footage \n\nit can have Nickelodeon blood fish logo with following blood splat logo \n\n[https://www.deviantart.com/beastwoodbros/art/Nickelodeon-Exe-Fish-Logo-948060748](https://www.deviantart.com/beastwoodbros/art/Nickelodeon-Exe-Fish-Logo-948060748)",
        "created_utc": 1675531155,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommendations for barrel-aged coffees?",
        "author": "Zogonzo",
        "url": "https://www.reddit.com/r/Coffee/comments/10tkpwk/recommendations_for_barrelaged_coffees/",
        "text": "My bf and I went to the Starbucks Reserve in Seattle, and he really liked the whiskey barrel aged cold brew. I'd like to get him some beans for V-day. I googled it, but there are a few brands, and I don't know which to get. Does anyone have personal experience with any and can make recommendations?",
        "created_utc": 1675528784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Healthy Coffee Idea Which Also Balances Blood Sugar Levels",
        "author": "Damanjain",
        "url": "https://www.sturdylifestyle.com/article/best-healthy-coffee-breakfast/5643/",
        "text": "",
        "created_utc": 1675524869,
        "upvote_ratio": 1.0
    },
    {
        "title": "Water hardness and drawdown time for pour over",
        "author": "montagdude87",
        "url": "https://www.reddit.com/r/Coffee/comments/10tj2hy/water_hardness_and_drawdown_time_for_pour_over/",
        "text": "tl;dr I used harder water than normal to brew my coffee with a pour over dripper but kept everything else the same. The drawdown time was much faster but the taste was the same.\n\nI'm visiting my parents for the next few days and decided to bring my Kalita 155, hand grinder, and one of my coffees on the trip. They have harder water. I'm not sure what the TDS is, but it's really obvious, for example, based on how it dries your skin out after a shower. They just have a regular water filter for drinking water and making coffee, tea, etc. For reference, my water at home is about 150 ppm (120 after a Brita filter).\n\nI knew their water was harder, but I didn't know how this would affect my brew, so I just used the same grind setting I normally use for this coffee. The drawdown time was much faster, by something like 45 seconds, so I was worried that it would be under-extracted. However, the coffee tastes great, and I don't think I can tell a difference between it here and how it tastes at home. It seems the increased extraction power of the harder water has simply caused the brew to finish faster, and the two effects have canceled out, resulting in a cup with the same extraction level as if I had used softer water. This was very surprising to me. Can anyone corroborate this effect for pour over coffee?\n\nNote, I'm not advocating using hard water for brewing if you can avoid it. I was just really surprised at the huge difference in drawdown time and associated minimal difference in taste.",
        "created_utc": 1675524622,
        "upvote_ratio": 1.0
    },
    {
        "title": "Long time V60 user here trying to refresh and improve my technique so I feel comfortable brewing expensive coffee. Please critique my method!",
        "author": "quietlifeintheforest",
        "url": "https://www.reddit.com/r/Coffee/comments/10tikpr/long_time_v60_user_here_trying_to_refresh_and/",
        "text": "I'm 42 and have been a coffee drinker since the mid 90's when the Seattle coffee scene was brought to my Northeast US city, and really want to get super dialed in so I can expand into more gourmet brews! \n\nI've been using a V60 for five years, playing around, sometimes getting lazy and not caring about taste, but generally getting constable with pour technique, etc. \n\nI use a glass V60, but am thinking of switching to ceramic for heat retention. \n\nI have been using a Baratza Encore, cleaning it with Grindz every few months. \n\n16.7g coffee with 280ml of 98°C water\n\n30s bloom, 150g water by 1:30, 280g water by 2:30. \n\nI find I'm finishing drawdown at the 3:45-4:00 mark. I've tried dropping the grind but I seem to be at that wall where going down two clicks drops the brew time under 3:00 and it's too weak. \n\nI have noticed that my \"travel grinder\" - a Lido ET - is MUCH more consistent so I'm switching to that at around two full turns on the adjustment. \n\nI also ordered boxed, tabless Hario filters after seeing they may be faster. \n\nIf anyone can suggest ANY changes that might dial my brew in, I am open to anything.",
        "created_utc": 1675523367,
        "upvote_ratio": 1.0
    },
    {
        "title": "What can I do with an old Verismo V machine?",
        "author": "xseanprimex",
        "url": "https://www.reddit.com/r/Coffee/comments/10tice3/what_can_i_do_with_an_old_verismo_v_machine/",
        "text": "I bought this machine when I worked at Starbucks years ago. The pods are all discontinued and the machine has sat on a shelf in my basement for a couple of years. What can I do with it? Any ideas are welcome.",
        "created_utc": 1675522797,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got my first ever barista job, stoked and nervous",
        "author": "1yaeK",
        "url": "https://www.reddit.com/r/Coffee/comments/10ti4n9/got_my_first_ever_barista_job_stoked_and_nervous/",
        "text": "I'm 23 and never finished school or hardly had any work experience before this but I decided to knuckle down and work on my passion for coffee. I will be one of the new baristas at a local specialty cafe and I am both excited and anxious. There's still a lot that I have to learn (don't ask me to pour any latte art just yet). \n\nI live in Italy, so the dynamics of working behind the espresso machine in a specialty shop are a little interesting, being in a country that's very traditional when it comes to coffee, so you kind of have to learn how to make the specialty blends that come in taste more like an improved version of a classic Italian espresso. Overall I hope it will be a positive learning experience for me.\n\nDo you have any advice for a new barista? I feel good about where I am but I'm also scared to get things wrong.",
        "created_utc": 1675522217,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to properly adjust the grind size on timemore chestnut c3?",
        "author": "Impossible_Ad1231",
        "url": "https://www.reddit.com/r/Coffee/comments/10thre7/how_to_properly_adjust_the_grind_size_on_timemore/",
        "text": "Got it in September 2022 and been using it since. Adjusting grind size always felt not quite right for me because I was scared of burrs going dull. And also I don't know how to check if I'm on an absolute zero click. Anyone knows how to make sure that I'm doing it properly?",
        "created_utc": 1675521194,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yah It’s coffee time",
        "author": "pinkyerdbeeren",
        "url": "https://i.redd.it/d0t4t63b48ga1.jpg",
        "text": "",
        "created_utc": 1675521044,
        "upvote_ratio": 1.0
    },
    {
        "title": "Orea V3 Restock on official site",
        "author": "DougalMcGuire",
        "url": "https://www.reddit.com/r/Coffee/comments/10th7nm/orea_v3_restock_on_official_site/",
        "text": "They're now shipping to the US\n\nhttps://shop.orea.uk",
        "created_utc": 1675519675,
        "upvote_ratio": 1.0
    },
    {
        "title": "As you sip your morning coffee, can you guess who left these reviews? Coffee nerds vs. beer snobs.",
        "author": "BoyMeetsWort",
        "url": "https://youtu.be/z6uIQOS1Ol8",
        "text": "",
        "created_utc": 1675517889,
        "upvote_ratio": 1.0
    },
    {
        "title": "Milk steamer doesn’t make my milk hot enough",
        "author": "duckbomb23",
        "url": "https://www.reddit.com/r/Coffee/comments/10tg4s6/milk_steamer_doesnt_make_my_milk_hot_enough/",
        "text": "Title. when I steam my milk to froth it in the built in espresso machines steamer it doesn’t get hot at all. Is this a skill issue or is it the steamers fault? Any help appreciated thank you!",
        "created_utc": 1675516440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choose between these two",
        "author": "Emotional-Coffee-521",
        "url": "https://www.reddit.com/r/u_Emotional-Coffee-521/comments/10tfx2n/choose_between_these_two/",
        "text": "Choose between these two",
        "created_utc": 1675515758,
        "upvote_ratio": 1.0
    },
    {
        "title": "French Press Help!",
        "author": "vulturedad",
        "url": "https://www.reddit.com/r/Coffee/comments/10tfsoh/french_press_help/",
        "text": "So my partner and I are both coffee lovers and are planning on finally starting our home setup. Since it's her birthday soon, I wanted to surprise her by getting a burr grinder and french press to start us off but I wanted to ask the experts (you guys) if my choices were sound. I am working with a lower budget but I was thinking of [this burr grinder](https://www.sageappliances.com/uk/en/products/coffee-grinders/bcg820.html?sku=BCG820BSSUK) and [this french press](https://www.amazon.co.uk/Heemburg-French-Press-Coffee-Maker/dp/B07X7RJ79V/ref=psdc_10706881_t1_B004XGBLVE?th=1). \n\n&amp;#x200B;\n\nI did see Frieling recommended as a good french press but I'm in the UK so it's awkward to get and out of my budget right now. I figured allocating most of the budget to the grinder was a good way to ensure a decent first home brew experience! I can't really go higher than the price for the grinder linked and a french press under £60 would be ideal.\n\n&amp;#x200B;\n\nRecommendations are much appreciated!",
        "created_utc": 1675515397,
        "upvote_ratio": 1.0
    },
    {
        "title": "Proud Mary selling Black Jaguar for $200 a cup this week.",
        "author": "cboshuizen",
        "url": "https://www.afr.com/companies/retail/absolutely-mindblowing-melbourne-cafe-serves-200-cup-of-coffee-20230203-p5chsf",
        "text": "",
        "created_utc": 1675514764,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I replicate what I consider to be \"high quality\" coffee?",
        "author": "PiracyofTheSeas",
        "url": "https://www.reddit.com/r/Coffee/comments/10te5bz/how_do_i_replicate_what_i_consider_to_be_high/",
        "text": "It is no secret that big businesses selling coffee are the worst.   \nI wouldn't want to drink from another cup of joe that has too much sugar, milk, or burnt flavours in it.  \nHowever, smaller businesses care about making good quality coffee with precision.   \n\n\nWhenever I drink coffee, I expect  different assortments of coffee beans, spices, subtle notes of fruit, or sweet flavours like caramel or chocolate without being excessive. I also expect it to be mixed with milk, a shot of espresso, or some liquid extracted from plants to intensify feeling \"high\". I can no longer stay caffeinated since I've become resistant to the effects of coffee. I have to drink multiple cups to achieve the \"effect\".  \n\n\nWhat must I do to achieve such quality of coffee?  \n\\-Do I have start spending a fortune or can I economically budget my purchases?  \n\\-Should I just cook the coffee or do I need to buy machinery?  \n\\-Where can I buy the best coffee beans, spices, chocolate, fruits, floral flavours, and tree nuts?  \n\\-How can I intensify the acidity of my coffee and achieve a strong effect?  \n\n\nAny answer or advice would be appreciated.",
        "created_utc": 1675509554,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] The Daily Question Thread",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/10tdu5f/mod_the_daily_question_thread/",
        "text": " \n\nWelcome to the daily [/r/Coffee](https://www.reddit.com/r/Coffee) question thread!\n\nThere are no stupid questions here, ask a question and get an answer! We all have to start somewhere and sometimes it is hard to figure out just what you are doing right or doing wrong. Luckily, the [/r/Coffee](https://www.reddit.com/r/Coffee) community loves to help out.\n\nDo you have a question about how to use a specific piece of gear or what gear you should be buying? Want to know how much coffee you should use or how you should grind it? Not sure about how much water you should use or how hot it should be? Wondering about your coffee's shelf life?\n\nDon't forget to use the resources in our [wiki](http://www.reddit.com/r/Coffee/wiki)! We have some great starter guides on our [wiki \"Guides\" page](https://www.reddit.com/r/Coffee/wiki/guides) and [here is the wiki \"Gear By Price\" page](http://www.reddit.com/r/Coffee/wiki/gear#wiki_coffee_gear_suggestions) if you'd like to see coffee gear that [/r/Coffee](https://www.reddit.com/r/Coffee) members recommend.\n\nAs always, be nice!",
        "created_utc": 1675508411,
        "upvote_ratio": 1.0
    },
    {
        "title": "After spending 8 years in specialty coffee..",
        "author": "Wonderful_House6919",
        "url": "https://www.reddit.com/r/Coffee/comments/10tdpv3/after_spending_8_years_in_specialty_coffee/",
        "text": "👋 Hey coffee lover! As a coffee enthusiast and barista the past 8 years working in specialty coffee. I'm always on the lookout for new and exciting things in the coffee world. That's why I'm excited to share my love of all things coffee with you through our coffee-themed newsletter! Whether you're looking for brewing tips, insider news, or recommendations for the best coffee beans and cafes, you'll find it here. If this sounds interesting to you than join me on this coffee journey by signing up now! ☕️ \n\nhttps://thecafenerd.substack.com",
        "created_utc": 1675507962,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is the best coffee out there?",
        "author": "Redaky",
        "url": "https://www.reddit.com/r/Coffee/comments/10tdgbx/what_is_the_best_coffee_out_there/",
        "text": "i mean i know it is personal…but i am just curious on your opinion on the sortiment and taste",
        "created_utc": 1675507102,
        "upvote_ratio": 1.0
    },
    {
        "title": "cleaned my chestnut c2 and now it grinds unevenly",
        "author": "kate12af",
        "url": "https://www.reddit.com/r/Coffee/comments/10t8omk/cleaned_my_chestnut_c2_and_now_it_grinds_unevenly/",
        "text": "i disassembled my timemore c2 and cleaned it with care as shown in youtube tutorials. now the grind size is terrible – some parts r super big and some r sand like. tried to reassemble it, but it didn’t fix it.\nused it for 7 months, my grind size is 28 for v60. new burr set costs more than the grinder itself. what should i do?",
        "created_utc": 1675497456,
        "upvote_ratio": 1.0
    },
    {
        "title": "homemade drink",
        "author": "ramin_ashtab",
        "url": "https://vm.tiktok.com/ZTRG8XBKG/",
        "text": "",
        "created_utc": 1675495564,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please tell me I’m not alone!",
        "author": "VanillaBlues1895",
        "url": "https://www.reddit.com/r/Coffee/comments/10t71hr/please_tell_me_im_not_alone/",
        "text": "I’ve recently discovered a new drink at my favorite coffee shop!! I say recent as in the last month, anyway, it’s a white chocolate lavender iced coffee with sweet foam at the top and it’s by far my absolute favorite!!!! I need to know how to make this at home, what brand of lavender syrup do they use??? Do I have to put it in with white chocolate or can I just have it in my vanilla coffee at home????",
        "created_utc": 1675492079,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dungeon Siege Collection Crack With Torrent Download Pc Game",
        "author": "Character-Coffee-452",
        "url": "https://pcgamesbits.info/dungeon-siege-collection-crack/",
        "text": "",
        "created_utc": 1675487218,
        "upvote_ratio": 1.0
    },
    {
        "title": "Teaching my first coffee seminar tomorrow! Wish me luck.",
        "author": "ItsssYaBoiiiShawdyy",
        "url": "https://www.reddit.com/r/Coffee/comments/10t5i0e/teaching_my_first_coffee_seminar_tomorrow_wish_me/",
        "text": "Hi everyone, \n\nJust thought I’d spread a little word that I’ll be bringing the world of specialty coffee to 18 unsuspecting folks tomorrow morning.  \n\nI’m a lecturer for a university (kinesiology) but I’ve never lectured on coffee. Although, coffee has been a massive, massive passion of mine since 2018. \n\nDuring my 3 hour seminar, I’ll be brewing 8 coffees for them using drip, French press, pour over, and even espresso. They’ll get a taste of coffees (I personally roasted) from across the creator and will include washed, natural, black honey, and one anaerobic. We’ll talk about growing, processing, roasting, brewing, etc. just about everything \n\nIm stoked to blow their minds with a taste of all that coffee can be! Wish me luck and thanks for reading!",
        "created_utc": 1675486736,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electric Gooseneck Kettle is necessary",
        "author": "RoughFuture3042",
        "url": "https://www.reddit.com/r/Coffee/comments/10t3j2l/electric_gooseneck_kettle_is_necessary/",
        "text": "How necessary it is to have a gooseneck electric kettle to make coffee, I am from Chile and the options that Amazon has are all configured for 110 volts while here the electrical outlets are 220 volts, and the options that can be purchased locally such as that of brewista (which is currently the only one) have a significant surcharge, that's why my question",
        "created_utc": 1675480469,
        "upvote_ratio": 1.0
    },
    {
        "title": "Started with black then to latte now an avid nitro fan. So sweet there’s no way to resist one. I present the vanilla nitro sweet cream cold brew. ☕️",
        "author": "MakMarbles-14306",
        "url": "https://i.redd.it/myeek89254ga1.jpg",
        "text": "",
        "created_utc": 1675472874,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to control caffeine intake when using a moka pot?",
        "author": "fungus_snake3848",
        "url": "https://www.reddit.com/r/Coffee/comments/10t0arl/how_to_control_caffeine_intake_when_using_a_moka/",
        "text": "A Nespresso capsule has 5g of coffee. One full basket in my moka pot contains 20g. I dont want to get addicted to caffeine, how can i control it? \n\nIve been taught to fill the basket all the way to the top, but can i use it with only half basket full? \nAlso, do different kinds of beans contains different amount of caffeine?",
        "created_utc": 1675471006,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need you valuable suggestion:)",
        "author": "Repulsive_Athlete_45",
        "url": "https://www.reddit.com/r/Coffee/comments/10t03k2/need_you_valuable_suggestion/",
        "text": "Can you please suggest a good instant coffee brand from this? Thank you!\n\n•North End\n•Nescafe\n•Maccoffee\n•Beanies\n•Moccona\n•Davidoff\n•Lavazza\n•Nobel Cafe\n\nI have tried Nescafe, Maccoffee and Davidoff. Of which, I liked Davidoff most.",
        "created_utc": 1675470451,
        "upvote_ratio": 1.0
    },
    {
        "title": "Freeze distilled milk",
        "author": "dr-mercurial",
        "url": "https://www.reddit.com/r/Coffee/comments/10szgyf/freeze_distilled_milk/",
        "text": "I want to try the freeze distilled milk used in barista championships but I wonder if there is a faster process to do it at home.\n\nFor those unfamiliar: freeze distilling milk starts with freezing milk completely than melting it inside your fridge till half the volume is liquid again. The whole process takes around 30 hours, removes a lot of the water content and leaves you with a doubly concentrated milk.\n\nWhy not cut the process to 25% of the time by simply only freezing half the volume then separating the liquid? The water freezes first then the proteins and fat last so theoretically it should work. Right?",
        "created_utc": 1675468785,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee Digital Art",
        "author": "Traditional-Zebra373",
        "url": "https://i.redd.it/dti8i18xa2ga1.png",
        "text": "",
        "created_utc": 1675468649,
        "upvote_ratio": 1.0
    },
    {
        "title": "delicious discovery",
        "author": "havenfyre",
        "url": "https://www.reddit.com/r/Coffee/comments/10szcku/delicious_discovery/",
        "text": "so I just figured out I can mix ground cinnamon into my coffee grounds and then brew it in my French press. it turned out delicious. I'm probably not the first to do it but boy is it yummy.",
        "created_utc": 1675468452,
        "upvote_ratio": 1.0
    },
    {
        "title": "Goodbye Keurig, hello espresso. Excited to learn how to make some decent espresso drinks. Read a lot of posts here and pulled the trigger on the barista express as my first foray into the....hobby?",
        "author": "ThatGuyGetsIt",
        "url": "https://i.imgur.com/fwAXsdg.jpg",
        "text": "",
        "created_utc": 1675468169,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cold Brews Effects on Cholesterol?",
        "author": "pakyaki",
        "url": "https://www.reddit.com/r/Coffee/comments/10sz3kf/cold_brews_effects_on_cholesterol/",
        "text": "So I've recently went to the eye doctor and they noticed that I might have a cholesterol issue in one of my eyes. I personally believe its due to my 10 cups of expresso I drink every day. Obviously I need to cut back on the amount of coffee I drink... And all of the fast food, soda, and fat filled processed foods... I strictly drink expresso at home and at work they have Kruger machine for k-pods which I use about 2x a day. I am only 21 so I am surprised that this is and issue but also not surprised due to my habits.\n\nDoes cold brew coffee affect cholesterol similar to expresso?",
        "created_utc": 1675467783,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it okay to suddenly start drinking coffee again after 6 month of no coffee?",
        "author": "Hussein7ahmed",
        "url": "https://www.reddit.com/r/Coffee/comments/10syt0g/is_it_okay_to_suddenly_start_drinking_coffee/",
        "text": "This is all because I have an exam next week and I need to fix my sleep schedule but when I wake up early I can't feel tired because I would need to study, so I thought about drinking coffee again. I stopped drinking coffee because I felt like it started to have a negative effect on my mood and I felt like I was becoming dependent on it. In addition, at the end of the day I would feel like shit when I drink it. So I was wondering, would drinking it again after a bit of a break bring those negative effects along with it?  \nThanks!",
        "created_utc": 1675467013,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help",
        "author": "combatwambat747",
        "url": "https://www.reddit.com/r/Coffee/comments/10sy00e/help/",
        "text": "heyoooo i’m looking for ground coffee beans to try im a usual keruig user but now switching to a coffee pot cause they don’t make a strong enough coffee for keruig lol i like a chocolatey black strong coffee thank you!!!",
        "created_utc": 1675464964,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee kit ideas- how to create a flat white from a bag of beans!",
        "author": "kaese_meister",
        "url": "https://www.reddit.com/r/Coffee/comments/10sxxyf/coffee_kit_ideas_how_to_create_a_flat_white_from/",
        "text": "Hi all,\n\nI've had a read of the FAQs but it's a little overwhelming. I enjoy coffee- Greek is my fav to make at home, or nespresso shots when I'm being lazy, but when drinking coffee out I always opt for flat whites.\n\nA Colombian friend has given me a bag of beans she brought back to the UK with her, and frankly- I have no idea what to do with it!\n\nSo my question that I'm keen to hear opinions on...\n\nAssuming you had only minimal kit (nespresso machine + milk frother, Greek coffee pot, small cafetiere) + a bag of coffee beans and £100-£150 to spend- what kit would you spend it on?\n\nAs above- i love espressos and flat whites, so kit ideas to turn my bag of beans into one of those is the ideal answer!\n\nI also get quite into things like this- so I'd rather buy 1 bit of kit top of the range + rest sub par with the aim of later upgrading the sub par bits, than going half-arsed on all the kit and needing to upgrade every bit later down the line (in case that makes any difference!).\n\nAnyhow! thanks in advance for advice/ suggestions! 😀",
        "created_utc": 1675464824,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sage dose pro recommended?",
        "author": "AshlovesFood",
        "url": "https://www.reddit.com/r/Coffee/comments/10swyy7/sage_dose_pro_recommended/",
        "text": "So I can get the sage dose pro for less than £115 in the UK ... I'm thinking of purchasing it for my husband who's recently got into coffee  and looks forward to opening a new pack of pre ground coffee for it's freshness. Is it worth it ? My budget is around £120 and he loved these coffee beans from a certain store but they wouldn't grind them for him... We have the sage Bambino already and he'll use it for espresso and cappuccino mostly. I've seen a lot of reviews about a french press and pour over but not within an espresso machine.",
        "created_utc": 1675462441,
        "upvote_ratio": 1.0
    },
    {
        "title": "Filter Coffee Machine Hold Grains",
        "author": "GHHOOSSTTT",
        "url": "https://www.reddit.com/r/Coffee/comments/10swumz/filter_coffee_machine_hold_grains/",
        "text": "My filter coffee machine thermos head always hold the coffee grains. How can I get rid of that? -/Delonghi with a thermos pot (ICM 710),",
        "created_utc": 1675462158,
        "upvote_ratio": 1.0
    },
    {
        "title": "should I get a aeropress?",
        "author": "candy_duchy",
        "url": "https://www.reddit.com/r/Coffee/comments/10sv8jz/should_i_get_a_aeropress/",
        "text": "currently I have a moka pot its nice im still messing around with it try to get the best out of it but I was thinking about a aeropress because I wanted something that would be faster to make. and I was thinking about trying out a light roast but I know moka pots dont do too well with light roasts. I have a eletric stove so even if I use hot water in a moka pot it takes forever. I also think a aero press would be easier to clean since its plastic. but would a aero press work with keurig water? the only thing I have for hot water besides stovetop or the microwave is a kerig it might as well be the hot water machine because no one uses it for coffee ever. the model I have is one of the fist ones so their is a option for brew and the temperature can be adjusted. and their is also just a \"hot water\" button I have no idea what temperature it is but its not adjustable. so would kerig water work for a aero press or would I need another way to get hot water?",
        "created_utc": 1675458300,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cursed coffee curdling crisis",
        "author": "mtrw85",
        "url": "https://www.reddit.com/r/Coffee/comments/10sv1e0/cursed_coffee_curdling_crisis/",
        "text": "I make the same coffee every morning with the same coffee machine with the same beans and the same soy milk. Sometimes it curdles and sometimes not. And it can't be about age because sometimes a non-curdle day follows a curdle day and I'm on the same carton/packet of milk/beans. What is going on here? Are aliens trying to send me some kind of code?",
        "created_utc": 1675457844,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Hario Switch fit with the Timemore 360ml server?",
        "author": "lollo67",
        "url": "https://www.reddit.com/r/Coffee/comments/10sufnc/does_hario_switch_fit_with_the_timemore_360ml/",
        "text": "",
        "created_utc": 1675456360,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just made my best cup yet",
        "author": "Colonel-Burton-27",
        "url": "https://www.reddit.com/r/Coffee/comments/10stzw0/just_made_my_best_cup_yet/",
        "text": "Method:\nV60 plastic size 01\n1st pour- 50ml \n2nd pour- 130ml\n3rd pour- 210ml\n4th pour- 300ml\n45 seconds in between\n\nCoffee bean:\nDunkin original\n\nAmount: 18g\n\nGear:\n1Zpresso jx-pro set on 3.5 rotations from “0”\n\nI just started making coffee less than a month ago. I’m ready to upgrade my beans. What do you guys suggest?",
        "created_utc": 1675455310,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know where I can get a Clever Dripper in Seattle?",
        "author": "cellar_monkey",
        "url": "https://www.reddit.com/r/Coffee/comments/10stugp/does_anyone_know_where_i_can_get_a_clever_dripper/",
        "text": "Just curious if anyone physically stocks them.\n\nP.S. Fonté has them but I can't make it before they're closed.",
        "created_utc": 1675454952,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I the only one that doesn’t like coffee flavored things but loves coffee?",
        "author": "SluttyCricket",
        "url": "https://www.reddit.com/r/Coffee/comments/10stp9s/am_i_the_only_one_that_doesnt_like_coffee/",
        "text": "",
        "created_utc": 1675454598,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee Lovers",
        "author": "butmycoffee",
        "url": "https://i.redd.it/turi8jmfi2ga1.jpg",
        "text": "Coffee themed apparel for all the coffee lovers 😊",
        "created_utc": 1675453154,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please enjoy this mug I got my wife for Christmas 😂",
        "author": "MatthewRTRCT",
        "url": "https://i.redd.it/o6vzzesfe2ga1.jpg",
        "text": "",
        "created_utc": 1675451811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Low caffeine, high quality coffee?",
        "author": "BurningBeechbone",
        "url": "https://www.reddit.com/r/Coffee/comments/10ss3qj/low_caffeine_high_quality_coffee/",
        "text": "This might be sacrilege on this sub, but is there a good coffee for pourover that also has a fairly low caffeine content (but not decaf)? I love my coffee, but I can only ever drink like 4oz because I can’t tolerate caffeine very well, but still want a little in the morning to get me going. \n\nI don’t want to just water it down because It loses its flavor.",
        "created_utc": 1675450669,
        "upvote_ratio": 1.0
    },
    {
        "title": "This coffee bar in Rome has a portafilter as a door handle..",
        "author": "Ben1567",
        "url": "https://www.reddit.com/gallery/10srmsp",
        "text": "",
        "created_utc": 1675449471,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's great now the whole family wants one",
        "author": "IntroductionOwn6562",
        "url": "https://i.redd.it/pnj55owsp0ga1.jpg",
        "text": "",
        "created_utc": 1675449431,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone know why my coffee is doing this? Info in comments.",
        "author": "Matt100398",
        "url": "https://i.redd.it/126nqgzx62ga1.jpg",
        "text": "",
        "created_utc": 1675449290,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm in search of a mokapot, made out of stone or granit.",
        "author": "mategabo",
        "url": "https://www.reddit.com/r/Coffee/comments/10sr9ot/im_in_search_of_a_mokapot_made_out_of_stone_or/",
        "text": "Hello guys, i'm introducing my gf to speciality coffee, and she always tells me about a mokapot that is made out if granite, or some kind of stone. Do you know about anything like this? If you have one, can you send me a pic of it? Or if you know the name of it, please tell me. We want to find it, beacuse she tells me it was great, and also i think, maybe the extra thermal inertia would help make better coffee. \n\nIt was looking like the picture, burgundy color top part, bottom gray. We are not sure about the shape of the handle.\n\nPic: https://imgur.com/a/ZRytzIW\n\nThank you beforehand.",
        "created_utc": 1675448553,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cupping \"party\" in Aarhus, Denmark",
        "author": "tharobc",
        "url": "https://www.reddit.com/r/Coffee/comments/10sqs8z/cupping_party_in_aarhus_denmark/",
        "text": "Bit of a long shot maybe but I'd like to better develop my tasting skills alongside some like minded people. \n\nI'm thinking of organising a small cupping evening here in Aarhus where I live and am looking for a handful of r/coffee folk from near here who might want to get involved. \n\nBasic idea would be that we would all bring a single coffee each, taste and compare notes. \n\nI can provide a venue (my kitchen!), Grinder, kettle and probably some cupping bowls. \n\nLet me know if you'd like to get involved and sorry to the mods if this is not allowed.",
        "created_utc": 1675447371,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any good low acid Keurig cups available in Canada?",
        "author": "NowKissPlease",
        "url": "https://www.reddit.com/r/Coffee/comments/10sqnx5/are_there_any_good_low_acid_keurig_cups_available/",
        "text": "My Stepdad has really bad heart burn but he'd rather face it than give up his daily coffee. He uses a Keurig machine and prefers things as low maintenance as possible. \n\nI was hoping to find some brand/line of Keurig compatible cups that are low acid and easier on his stomach or general advice on which types of brews are generally better for heartburn prone folks who can't live without their coffee.\n\nThank you so much!",
        "created_utc": 1675447105,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cupping \"party\" in Aarhis, Denmark",
        "author": "tharobc",
        "url": "https://www.reddit.com/r/Coffee/comments/10sqnb1/cupping_party_in_aarhis_denmark/",
        "text": "Bit of a long shot maybe but I'd like to better develop my tasting skills alongside some like minded people. \n\nI'm thinking of organising a small cupping evening here in Aarhus where I live and am looking for a handful of r/coffee folk from near here who might want to get involved. \n\nBasic idea would be that we would all bring a single coffee each, taste and compare notes. \n\nI can provide a venue (my kitchen!), Grinder, kettle and probably some cupping bowls. \n\nLet me know if you'd like to get involved and sorry to the mods if this is not allowed.",
        "created_utc": 1675447064,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tried looking online for help, I dun-goofed.. please help if possible",
        "author": "ChrisFromAldi",
        "url": "https://www.reddit.com/r/Coffee/comments/10sq15c/tried_looking_online_for_help_i_dungoofed_please/",
        "text": "Hey there fellow coffee lovers.  So a few days ago I now realise I screwed up potentially quote badly. My housemate is half Italian and bought me a Percolator so we can have the occasional espresso together when we both need a fast wake up. For the record, im the main coffee drinker, I'm starting to experiment with different types and generally having fun, whereas my housemate drinks tea and knows virtually nothing other than \"espresso\" about coffee.\n\nSo a few days ago, I was cleaning the house in a whirlwind because I had guests coming in the evening and I *may have* put the top half of it in the dishwasher not realising they don't go in there and then activated said dishwasher with the chemical tablet...\n\nI now have a very grey-ish top half of the percolator and the other half is clean and ready to go (housemate caught my mistake but too late so got to the bottom half before I did and explained to me they shouldn't go in there.. Is there any way to save the top half of this little thing or have I done it too much damage?",
        "created_utc": 1675445527,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Espresso Machine Under $200: 9 Expert Picks!",
        "author": "Homegrounds",
        "url": "https://www.homegrounds.co/best-espresso-machine-under-200/",
        "text": "",
        "created_utc": 1675444685,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] What have you been brewing this week?/ Coffee bean recommendations",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/10sp2l4/mod_what_have_you_been_brewing_this_week_coffee/",
        "text": "Hey everyone!\n\nWelcome back to the weekly /r/Coffee thread where you can share what you are brewing or ask for bean recommendations. This is a place to share and talk about your favorite coffee roasters or beans.\n\nHow was that new coffee you just picked up? Are you looking for a particular coffee or just want a recommendation for something new to try?\n\nFeel free to provide links for buying online. Also please add a little taste description and what gear you are brewing with. Please note that this thread is for peer-to-peer bean recommendations only. Please do not use this thread to promote a business you have a vested interest in.\n\nAnd remember, even if you're isolating yourself, many roasters and multi-roaster cafes are still doing delivery. Support your local! They need it right now.\n\nSo what have you been brewing this week?",
        "created_utc": 1675443199,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oxo 8-cup low temp issues?",
        "author": "InsulinJunkie72",
        "url": "https://www.reddit.com/r/Coffee/comments/10soaue/oxo_8cup_low_temp_issues/",
        "text": "Hello!\n\nI'm just a unsophisticated coffee drinker who was trying to replace a Keurig K-Supreme (I use refillable pods in it, so I'm not THAT much of a heathen) for myself and my father.   Low usage - maybe 5 cups a day between the two of us.   \n\nI purchased an Oxo 8-cup due to its single cup functionality and excellent overall reviews. However, I've tried both single cup into mug, and four cup into carafe - and it seems like the coffee just doesn't get very hot at all.   This is without adding any milk or other additives.  It's not that hot to begin with, and cools off quickly.\n\nSearching on here, I've seen a mention or two of this with the Oxo 8-cup, and there are several mentions of it in the Amazon reviews.\n\nIs my unit just a dud - so I should just exchange it - or it is just the way this unit is?   My Keurig K-Supreme gets noticeably hotter, and the coffee stays warmer much longer.\n\nThanks in advance for any help!",
        "created_utc": 1675441291,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s everyone’s favourite Japanese roastery?",
        "author": "dreamsun90",
        "url": "https://www.reddit.com/r/Coffee/comments/10snntd/whats_everyones_favourite_japanese_roastery/",
        "text": "Any exclusive coffee roastery beans that’s only available in Japan.",
        "created_utc": 1675439757,
        "upvote_ratio": 1.0
    },
    {
        "title": "Final Fantasy iii Multi10 Plaza Crack With Torrent Download Pc Game 2021",
        "author": "Character-Coffee-452",
        "url": "https://pcgamesbits.info/final-fantasy-iii-multi10-plaza-crack/",
        "text": "",
        "created_utc": 1675439617,
        "upvote_ratio": 1.0
    },
    {
        "title": "starbucks veranda blend equivalent in India",
        "author": "lpk86",
        "url": "https://www.reddit.com/r/Coffee/comments/10snekb/starbucks_veranda_blend_equivalent_in_india/",
        "text": "I love Starbucks's blonde roast. But its 1000rs/200gms(way costlier) Is there an alternative for this blonde roast in India?",
        "created_utc": 1675439106,
        "upvote_ratio": 1.0
    },
    {
        "title": "Espresso dialing",
        "author": "Mountain-Bid-4042",
        "url": "https://www.reddit.com/r/Coffee/comments/10smy97/espresso_dialing/",
        "text": "I recently started at a new coffee shop and I’ve been practicing dialing espresso in the mornings. I have a firm understanding of how all our machines work as well as the average flavor profile we aim for, but I still don’t feel super confident dialing. \nCurious to hear other peoples tips and tricks or routines they use when they dial. I never realized how many factors were so important and I feel a little lost lol, I have found that once I have a decent tasting espresso that making myself a cortado is a good way to confirm the shot is where we want it. \nAnyways pls help",
        "created_utc": 1675437944,
        "upvote_ratio": 1.0
    },
    {
        "title": "Second sip always tastes better?",
        "author": "caick1000",
        "url": "https://www.reddit.com/r/Coffee/comments/10smssq/second_sip_always_tastes_better/",
        "text": "Maybe this is just me, but my first sip of coffee in the morning tastes a little off, bitter or stronger, but the second one onwards tastes better.\n\nI use an app to rate the brews I make, and if I use the first sip as reference I would rate it way lower than the second sip.\n\nAny idea why?",
        "created_utc": 1675437551,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bonavita Connoisseur Reassembly Question",
        "author": "sound_a_whale_makes",
        "url": "https://www.reddit.com/r/Coffee/comments/10smpat/bonavita_connoisseur_reassembly_question/",
        "text": "In the process of deep cleaning my Bonavita Connoisseur, I disassembled the shower head. However, while putting it back together, I found an extra part (rubber, see pic for reference) that I cannot seem to figure out where it originated.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/dn7mbd0spzfa1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=f1bbb67930434aa54d378401759c677216fa384d\n\nUnfortunately, the online manuals do not show a part, so I would appreciate any help making sure I reassemble my beloved Bonavita correctly! Anybody know where this rubber part goes?",
        "created_utc": 1675437310,
        "upvote_ratio": 1.0
    },
    {
        "title": "Niche Zero - the grinder to beat?",
        "author": "simple_mech",
        "url": "https://www.reddit.com/r/Coffee/comments/10sluco/niche_zero_the_grinder_to_beat/",
        "text": "Howdy y’all! I currently have an older super jolly and looking for an upgrade. \n\nEverything I read/watch keeps pointing back to the Niche Zero as the best bang for your buck. Anything more and you’re veering into the diminishing returns zone. \n\nI want to stay under $2,000, ideally under $1,500 yet I haven’t seen anything worth spending nearly double the Niche Zero’s price.\n\nIs this just my impression? Any recommendations other than the grinders presented in JH’s video?",
        "created_utc": 1675435073,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee prices soar to ‘silly’ levels in the GTA – but consumers keep paying",
        "author": "ziggygazzo",
        "url": "https://www.thespec.com/ts/business/2023/02/03/seven-bucks-for-a-latte-coffee-prices-soar-to-silly-levels-in-the-gta-but-consumers-keep-paying.html",
        "text": "",
        "created_utc": 1675434327,
        "upvote_ratio": 1.0
    },
    {
        "title": "If your expresso came upsidedown? Delta Coffee made Inverted coffee extraction system, did you heard about it?",
        "author": "V1t4m1n4r",
        "url": "https://www.reddit.com/r/Coffee/comments/10slctx/if_your_expresso_came_upsidedown_delta_coffee/",
        "text": "&amp;#x200B;\n\n[Delta Q Rise](https://preview.redd.it/vyz457q7fzfa1.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=b8017f55906bb709a6cf78b1563719ad499afc43)",
        "created_utc": 1675433774,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is awesome and incredible find!",
        "author": "Business_Leadin",
        "url": "https://i.redd.it/hxyk4rzfczfa1.jpg",
        "text": "",
        "created_utc": 1675432919,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why would I find grinds at the bottom of my aeropress coffee?",
        "author": "Arrhythmania",
        "url": "https://www.reddit.com/r/Coffee/comments/10skouh/why_would_i_find_grinds_at_the_bottom_of_my/",
        "text": "I made a coffee today using the inverted method. I used 16g coffee to 240g of water and at the bottom of my mug I found quite a few grinds despite using a filter. What could cause this?",
        "created_utc": 1675432009,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best instant coffee?",
        "author": "Purple-Ad-5148",
        "url": "https://www.reddit.com/r/Coffee/comments/10ska5p/what_is_the_best_instant_coffee/",
        "text": "I know this may cause outcry in this sub. But I don’t have access to a machine. So which instant tastes the best? Strength is not an issue actually too strong coffee makes me sick.",
        "created_utc": 1675430815,
        "upvote_ratio": 1.0
    },
    {
        "title": "1zpresso JX-Pro or K-Pro",
        "author": "Sophene",
        "url": "https://www.reddit.com/r/Coffee/comments/10sjyps/1zpresso_jxpro_or_kpro/",
        "text": "I have searched and read a lot, but still haven't been able to choose between one of these two.\n\nThe money imma pay is pretty close so it's not an issue of price.\n\nI'll be purchasing a Wacaco picopresso (and maybe an additional basket) and thinking of using it way more frequently, but also will be using a moka pot and from time to time, a French Press as well.\n\nFrom what I've gathered, they say JX-Pro is great for espresso, and very good for the rest while K-Pro is great for the rest (?) and very good for espresso but I'm still not sure as the opinions were conflicting. Could you guys help me a bit?",
        "created_utc": 1675429860,
        "upvote_ratio": 1.0
    },
    {
        "title": "yoga is the world beneficial exercise found ever",
        "author": "Funny-Cap2378",
        "url": "https://i.redd.it/xf7niyos1zfa1.jpg",
        "text": "",
        "created_utc": 1675429405,
        "upvote_ratio": 1.0
    },
    {
        "title": "SBUX - WTF",
        "author": "Secret_Buffalo_",
        "url": "https://www.reddit.com/r/Coffee/comments/10sjorr/sbux_wtf/",
        "text": "Starting off by saying I rarely buy Starbucks coffee. I just so happened to get a gift card firbthe holidays and just got around to using it. I used to work there about 13 years ago. I've since had a lot of experience roasting and cupping lots of different coffee's, and enjoying coffee from a wide variety of independent roasters.\n\n Just opened a bag of the Tribute Blend. This is a joke, right? Starbucks roast all their coffee almost identically and puts it in different bags? I mean, I haven't had their \"blonde\" but at this point I am half expecting to open the bag to real the same char roasted coffee that I've been getting the last decade or so.\n\n My first impression upon taking a whif of the bag when I opened it was \"I'm going to be honest, that smells like pure gasoline\".",
        "created_utc": 1675429036,
        "upvote_ratio": 1.0
    },
    {
        "title": "For the past year my coffee has tasted mediocre.",
        "author": "Toubaboliviano",
        "url": "https://www.reddit.com/r/Coffee/comments/10sjkg3/for_the_past_year_my_coffee_has_tasted_mediocre/",
        "text": "I’m not sure what’s causing this.  I recently upgraded my grinder, have refined my techniques and experimented with coarser, finer, 100c vs 95c, Chemex, Aeropress, and French press.  I’m almost at the point of not wanting coffee anymore.  Coffee has just been tasting hollow, or sometimes very bitter almost “green” or like raw potatoes\n\nAny recommendations?",
        "created_utc": 1675428638,
        "upvote_ratio": 1.0
    },
    {
        "title": "Upgrading from a Hario Skerton Plus for better coffee taste",
        "author": "thomasvdb_be",
        "url": "https://www.reddit.com/r/Coffee/comments/10sj1x7/upgrading_from_a_hario_skerton_plus_for_better/",
        "text": "The past days I've been reading several posts in this sub about manual grinders and was a bit suprised by the \"backlash\" on the Hario Skerton Plus about grinding consistency.\n\nThe reason I started to look for a new grinder was actually the duration of the grinding which becomes a bit of pain to do multiple times a day. It seems that upgrading my grinder to a Comandante or a 1Zpresso can really bring down the grind time.\n\nBut will the grinding consistency increase that much?\n\nI took a photo of the my last grinding and was wondering; is this grinding really that inconsistent?  \nThis has been grinded with a setting of 6 \"clicks\".\n\nJust curious that I don't regret the cost of the upgrade.  \nSwitching to grinding coffee beans myself has already been a massive upgrade compared to pre-ground coffee. Will I experience such a massive upgrade again?",
        "created_utc": 1675426962,
        "upvote_ratio": 1.0
    },
    {
        "title": "happy tree friends cuddles calm down creepypasta",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/10six0a/happy_tree_friends_cuddles_calm_down_creepypasta/",
        "text": "if you didn't not for children or big babies it was cuddles the rabbit \n\non February **3 2023 m**e and her friends \n\ni was cooking fish for dinner i bought happy tree friends DVD and i found it \n\nyou have been warned i was under construction \n\nso after fish was done i went to living room \n\nlogos played such as mondo media \n\nthere was menu with gigantic bonus features menu i grabbed remote and clicked play \n\ni answer to wrong \n\nanimation was playing with cuddles lumpy lifty shifty toothy flaky and Russell cuddles was hit by a car first thing off cuddles arm which was blood dripping from road will be dead with me \n\nso what did you mean \n\ni heard scream cuddles was kidnapped it wasn't animation program cuddles open door to car park they got train on train track \n\nscream was stopped should about to tear \n\ncuddles looked so crazy i was picking up to train track sorry about that i had put that bitch to sleep \n\nhe went outside to lumpy's trailer i clicked stop button \n\ni don't think so i clicked play button i saw lumpy bunch of cutss on his face with esophagus choked \n\nlumpy coughed and said cuddles you need to calm down you are becoming maniac you killed 200 people here \n\ncuddles replied no listen i will let kids watch this cuddles grab venus fly trap and venus fly trapped lumpy's head blood was squirting on cuddles's face cuddles laughed like a villain cuddles left lumpy's trailer she gets trash can open it bunch of dead raccoons it was horrific grotesque and terrifying \n\nthen back to car park cuddles screams in agony cuddles chasing girl girl yelled out CALM DOWN CUDDLES scene glitched out \n\ni was not watch it i was stop it is too late cuddles uncovered lens type of basement behind him lifty petunia Russell and toothy tied up upside down butt naked screaming in pain \n\ncuddles said that's all folks villains might have evil things there are some dark side of my house i am kidnapper my victims now my villain see what have to say \n\nRussell said please cuddles you have to calm down cuddles grabbed axe and stabbed him with head then petunia \n\npetunia said cuddles Russell is right what did you say i am so sorry just please let us go cuddles pused petunia's eyes lastly toothy \n\ntoothy said you are messed up twisted motherfucker CALM DOWN CUDDLES cuddles scream in agony he stuck hand in his toothy's stomach and ripped out intestines and ate him then spit it out that ones disgusting \n\ncuddles jumps on train and open another door and saw fliqpy exploded body with a oven he opens oven then close it up cuddles put some glove and heart surgery \n\ncuddles said you think smarter then ones don't you then eats the heart \n\n5 hours later he drags girl brown bag over head her hands are tied up she is still screaming then he grabs the knife she begins cut you i was shocked it was sniffles i am going to the hide \n\nsniffles hides from closet cuddles comes back and screams in agony cuddles screams sniffles and cuddles start to fight \n\nsniffles rips cuddles ears and bangs his head on his fridge fall to the floor sniffles grabs hammer and smashes cuddles's head off \n\nanimation starts to black out sniffles cuts to outside sniffles running the bus stop and a van heading to road sniffles yells out STOP van quickly stops in the van it was lifty \n\nlifty asked him what the hell happened \n\nsniffles replies cuddles killed Russell petunia and toothy lifty opens driver door and sniffles hop in they throwed camera out of the van and all the way into the bus stop animation glitches it cuts to black and cut to static i could hear sniffles voice what did you have your done I KILLED MY FAVOURITE CHARACTER I HAVE ENOUGH FOR YOU GOODBYE \n\nafter 20 seconds of static it showed sniffles hanging from a noose paper on the wall drawing of an bloody and naked cuddles before lifty as he said i am the real winner he grabbed a knife and cuts sniffles's throat sniffles commited suicide for killing her animated character cuddles drove his knife crack on the screen while cuddles evil laugh in final 2 minutes then end credits showing that cuddles on carpet \n\ni got up and destroys DVD player and i broke it with the DVD inside i put DVD back in DVD cover then i burned it \n\ni forbid it for watching happy tree friends  \n\ni was in mondo media since 1999-2016 to cancel happy tree friends for good because watch the lost episode i was decide to parody of sausage party (2016) on Netflix it contains swearing words and food cahracters gets killed",
        "created_utc": 1675426518,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee is the energy drink! Did you try?",
        "author": "Funny-Cap2378",
        "url": "https://www.reddit.com/gallery/10si47e",
        "text": "",
        "created_utc": 1675423705,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] The Daily Question Thread",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/10shng6/mod_the_daily_question_thread/",
        "text": " \n\nWelcome to the daily [/r/Coffee](https://www.reddit.com/r/Coffee) question thread!\n\nThere are no stupid questions here, ask a question and get an answer! We all have to start somewhere and sometimes it is hard to figure out just what you are doing right or doing wrong. Luckily, the [/r/Coffee](https://www.reddit.com/r/Coffee) community loves to help out.\n\nDo you have a question about how to use a specific piece of gear or what gear you should be buying? Want to know how much coffee you should use or how you should grind it? Not sure about how much water you should use or how hot it should be? Wondering about your coffee's shelf life?\n\nDon't forget to use the resources in our [wiki](http://www.reddit.com/r/Coffee/wiki)! We have some great starter guides on our [wiki \"Guides\" page](https://www.reddit.com/r/Coffee/wiki/guides) and [here is the wiki \"Gear By Price\" page](http://www.reddit.com/r/Coffee/wiki/gear#wiki_coffee_gear_suggestions) if you'd like to see coffee gear that [/r/Coffee](https://www.reddit.com/r/Coffee) members recommend.\n\nAs always, be nice!",
        "created_utc": 1675422012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is anyone able to help me with ideas on what is going wrong with this Sage Oracle? As soon as the pre-infuse stops, it basically does nothing… could it just be descaling that is required? Sorry I couldn’t post this in the questions thread because it is a video",
        "author": "Ghetto9877",
        "url": "https://v.redd.it/f731s9v5xzfa1",
        "text": "",
        "created_utc": 1675421795,
        "upvote_ratio": 1.0
    },
    {
        "title": "Monday Coffee Cup lol..",
        "author": "GrowUpNext",
        "url": "https://v.redd.it/9bunfkspdyfa1",
        "text": "",
        "created_utc": 1675421161,
        "upvote_ratio": 1.0
    },
    {
        "title": "cafetière recommendations",
        "author": "Keepcosy",
        "url": "https://www.reddit.com/r/Coffee/comments/10sh98w/cafetière_recommendations/",
        "text": "Hey, I'm on the hunt for a new cafetière. Has anyone got any recommendations?",
        "created_utc": 1675420464,
        "upvote_ratio": 1.0
    },
    {
        "title": "but first coffee ☕",
        "author": "ferhiibrahim",
        "url": "https://i.redd.it/8fn620s7izfa1.jpg",
        "text": "",
        "created_utc": 1675416761,
        "upvote_ratio": 1.0
    },
    {
        "title": "is this Turkish coffee maker any good?",
        "author": "Phat_Potatoes",
        "url": "https://i.redd.it/5ozxwmddwxfa1.jpg",
        "text": "",
        "created_utc": 1675415307,
        "upvote_ratio": 1.0
    },
    {
        "title": "EU moccamaster hotplate, lengthen auto-off",
        "author": "Ket-Detective",
        "url": "https://www.reddit.com/r/Coffee/comments/10sf99a/eu_moccamaster_hotplate_lengthen_autooff/",
        "text": "Hello, I have just purchased a moccamaster select because I’m lazy and pouring water over ground coffee is too much like hard work in the morning.\n\nOne of the primary reasons I bought this thing was because it has a hot plate but EU regs state for the device past 2015 mean it turns off after 40 minutes.\n\nThis is not ideal, I wanted the machine to brew me a big batch of coffee and keep it warm for at least 2 hours.\n\nI know, just make another batch bro! But the moccamaster shines when it’s at full capacity and I don’t want to drink “20 cups” of coffee (6 mugs).\n\nCan it be modified to bypass the auto off? Most posts about modifying the hot plate consist of cutting the wires to disable it - which is the complete opposite of what I want to achieve.\n\nI want 2 hour old stale coffee dammit.\n\n(Real reason I got this and want the time extended, I’m expecting a child and just wanted to make brewing coffee easier and keep it hot while doing other things)",
        "created_utc": 1675412725,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gary Grigsbys WCar In The West Gog Crack With Torrent Download Pc Game",
        "author": "Character-Coffee-452",
        "url": "https://pcgamesbits.info/gary-grigsbys-wcar-in-the-west-gog-crack/",
        "text": "",
        "created_utc": 1675408210,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guys, can we drink coffee without sugar? And is it okay to add fresh milk?",
        "author": "IamButtmannn",
        "url": "https://www.reddit.com/r/Coffee/comments/10sdprv/guys_can_we_drink_coffee_without_sugar_and_is_it/",
        "text": "Sorry, just a newbie here. I was drinking nescafe for my whole life, and I'm fed with it after seeing some bad news, + I like to cut my sugar take, too.",
        "created_utc": 1675407125,
        "upvote_ratio": 1.0
    }
]