[
    {
        "title": "What's the next great leap in coffee?",
        "author": "Aspected1337",
        "url": "https://www.reddit.com/r/Coffee/comments/11saf88/whats_the_next_great_leap_in_coffee/",
        "text": "Assuming specialty coffee has been normalized enough, what's the next big thing to be watching for that'll make coffee taste even better? A new way to make coffee beans? Coffee pods? I'm very excited to hear.",
        "created_utc": 1678916876,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cold Brew vs Chilled Filter Coffee",
        "author": "Short_Mention",
        "url": "https://www.reddit.com/r/Coffee/comments/11saagr/cold_brew_vs_chilled_filter_coffee/",
        "text": "Hey guys, I had some questions about making cold (brew/filter) coffee at home. \n\nMethod:\nI’m looking at both cold brew and chilling filter brew (hot-&gt;cold). What yields better results while using specialty coffee? I wanna make sure I do justice to the coffee, and retain as many origin characteristics as I can, which I THINK may be an issue with cold brewing (correct me if I’m wrong).\n\n(Filter) Extraction:\nWhich leads me to my next concern, extraction. Specifically, I’m trying to make a concentrate I can pour over tonic water. I know cold brew concentrates are popular for this, but if I wanted to filter brew it, I’m guessing it would be closer to the extraction of a “ready to drink” cold brew and the flavour could be muted when mixed with tonic water. Is there a way to increase extraction while not making it taste like burnt rat ass? (Grind finer/brew longer? Use more coffee per ml of water?).\n\n(Cold brew) Grind size/time:\nNext concern is grind size. I’m using a Hario MMS-1B (yes I will upgrade soon, just waiting for the end of this study term). How many clicks should be ideal for cold brew (right now I’m going off of a chart I found online)? Are there any drawbacks to grinding finer? What would happen if I let it steep for longer? \n\nI know some of this is very subjective and up to taste, so I’m open to hearing what you may have tried and what conclusions you came to.\n\nThanks a bunch!",
        "created_utc": 1678916587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee Recommendations for French Press",
        "author": "MisoSoupFGC",
        "url": "https://www.reddit.com/r/Coffee/comments/11s8n5m/coffee_recommendations_for_french_press/",
        "text": "Hello! I've been brewing French Press coffee for about 2 years now using a Baratza Encore and a Bodum press and I've tried a few different beans, ranging from the couple of brands I started with from Amazon and then tried a couple of different bags from Airship before trying a Stumptown roast and then ordering a fresher version of Holler Mountain from Stumptown's website. That's what I'm still using today and it's... okay, but my frame of reference for FP coffee is just what I make at home and I find myself getting something close to what I read about online and then the next cup might be the most bitter thing I've ever tasted.\n\nI've tried different grind levels, brew methods, adjusted time, the Hoffman method, etc., and I've decided to just start from scratch and that seems like it always starts with a good roast. If anybody has any recommendations or maybe think Holler Mountain is where it's at and I need to just fine-tune my methods, I'd love to hear it!",
        "created_utc": 1678912996,
        "upvote_ratio": 1.0
    },
    {
        "title": "Q: Has anyone tried Madrinas cold brew and is it good? I want to try caramel and cookies and cream.",
        "author": "SpokeyDokey720",
        "url": "https://www.reddit.com/r/Coffee/comments/11s8gg7/q_has_anyone_tried_madrinas_cold_brew_and_is_it/",
        "text": "",
        "created_utc": 1678912591,
        "upvote_ratio": 1.0
    },
    {
        "title": "Single cup coffee maker/grinder recommendation.",
        "author": "Unable-Worker3606",
        "url": "https://www.reddit.com/r/Coffee/comments/11s8fyw/single_cup_coffee_makergrinder_recommendation/",
        "text": "I've got a Phillips lattego 3200 and love it. Have had it for a few years but have found that I primarily use it for black coffee or an occasional cappuccino. Originally I was doing a lot of espresso but that slowed but I still. Always bought espresso roast beans. However when I want coffee it's either watery or I need to do 4 grinds/batches to get a full cup and if I wanted to try different beans I'm out of luck...no way to clean out the hopper and I don't have a separate grinder.\n\nQuestion: I'm the only coffee drinker in the house. Would like something that makes one cup or 12oz. I would like it to be automatic, push a button and it grinds beans and brews. Ideally It wouldn't hold a whole bag and Id be able to know when it's empty or able to empty it. I've basically described the Phillips but it's an espresso maker first. Maybe I need to go back to a pour over and buy a grinder... Would rather have convenience of one unit rather than 3. \n\nThoughts?",
        "created_utc": 1678912562,
        "upvote_ratio": 1.0
    },
    {
        "title": "Varying quality in speciality coffee",
        "author": "Valuable-Tea1031",
        "url": "https://www.reddit.com/r/Coffee/comments/11s7vns/varying_quality_in_speciality_coffee/",
        "text": "I've got a Trade subscription and recently got a bag of beans that were really bad, just really bitter flavors with a grainy taste (opposite of \"clarity\" I suppose). Now, after watching Hoffmann's video on specialty coffee, one of the giveaways I suppose that suggested it might not be a great bag of beans was lack of any information of the roast level or source of the beans, it was just \"Ethiopia\" but it did state some flavor notes to expect. There was also a lack of online info about the roaster.\n\nAre small roasters better? When i think of the well know large roasters, I imagine these massive vats of coffee and wonder if beans get mixed up, or how often they clean their equipment.\n\nAny advice for shopping for the best quality beans?",
        "created_utc": 1678911329,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choosing handgrinder",
        "author": "AlpaPure",
        "url": "https://www.reddit.com/r/Coffee/comments/11s59vk/choosing_handgrinder/",
        "text": "Timemore C3, Timemore Slim 3, 1Zpresso Q2\n\nI am considering buying a new hand grinder. It should be suitable for home use and handy enough for occasional traveling. I brew mainly in Aeropress and Chemex, sometimes in Moka pot. My budget is around 100$. Which one of the listed grinders would you choose and why? Do you know better option? Thanks in advance.\n\nSome specific questions:\n\nIf C3 and Slim 3 have the same burrs, they probably grind the same. Difference in dimensions doesn't seem significant. Only other difference is that C3 has some plastic parts. Are there any problems with them? Slim 3 is 40$ more expensive, so I would like to know, if it's worth it.\n\nAre Comandante-like heptagonal burrs of Q2 a lot better than Timemore's S2C 660 burrs? I don't really like design of Q2, but noticeably better grinding results would change my mind.\n\nThanks for any suggestion or answer :)",
        "created_utc": 1678905826,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts and comments on the Rattleware Cupping Brewer",
        "author": "SheldonvilleRoasters",
        "url": "https://www.reddit.com/r/Coffee/comments/11s3y7w/thoughts_and_comments_on_the_rattleware_cupping/",
        "text": "I saw one of these brewers in a promotional giveaway/contest and was intrigued.\n\n[Here](https://imgur.com/a/h2VuROM) is what it looks like. \n\nThe purpose of the brewer is to make cupping more sanitary and less communal.  The coffee is brewed in a larger batch and then is portioned out into individual cupping glasses for people to cup on their own vs everyone dipping a spoon in the same bowl.  It makes about 10oz of drinkable brewed coffee so it could be used as a regular immersion brewer for one if you are so inclined.  \n\nThe directions state to add 30g of coffee to the brewer and then add 500g of hot water.  Let that sit for four minutes, then break the crust.  You need to then let the silt settle to the top of the bed of grounds however, the directions do not state how long that should be.  The silt should all fall through the narrow throat at the bottom of the brewer. \n\nThen, you carefully place the stopper over the opening to the ground bed.  You need to CAREFULLY hold this stopper in place as you decant the coffee into individual glasses or a mug. \n\nWhen I brewed my first batch, I added a saucer on top of the brewer for the first four minutes and then placed it back after crust breaking and spooning off the foam/grounds.  I then set a three minute timer for the silt to settle. \n\nThe result was a hot cup of decent immersion brewed coffee with very little silt.  The coffee was still a bit cloudy, but it was a nice immersion brew. \n\nFor cleanup, you remove the stopper, then swirl the remaining liquid to loosen up the grounds and then pour into a sink strainer.  You will need one of those gooseneck flexible cleaning brushes to clean that cavity at the bottom.  You could also use a splash of urn cleaner as well.  Since it's immersion, there is a film of oil on the glass after brewing so skipping scrubbing is not an option. \n\nPros:  Nice little personal brewer with no filters you need to buy -- so sustainable.  Produces a great cup of immersion brewed coffee with minimal silt (less than you get with Sibarist filters).  Also, a very sanitary way of performing a group cupping. \n\nCons: Very fragile. You can easily crush this thing in your hands if you are too rough.  The first one I bought arrived completely destroyed/shattered.  Had to file a return claim with Amazon.  Second one arrived in tact but the glass is very thin.  Just wondering how long it will last me considering my clumsiness.  Cleaning requires a flexible brush.  Although ideal for showcasing one coffee for a tasting, it would be very expensive to have a fleet of these fragile vessels in a lab environment.  An official cupping requires five sample batches per coffee on the table.  So that would be $210 (without shipping) in equipment per flight of coffee.  So great for coffee sampling, but for by-the-book cupping -- not so much. \n\n\nOther notes:  Cost me $41 USD (delivered) from Amazon.  Do the math on deeply discounted ones on amazon since you may have to pay significant shipping charges.  I think Rattleware charges $40 but shipping is extra.  Also, this is basically the Hoffmann FP technique but a bit cleaner and will allow you to decant without stirring up the grounds.   I definitely recommend putting a saucer on top of the brewer while steeping and settling.  It retains a lot of the heat.",
        "created_utc": 1678903111,
        "upvote_ratio": 1.0
    },
    {
        "title": "You found coffee!",
        "author": "Super_Print3318",
        "url": "https://i.redd.it/fq2vwy86sxna1.jpg",
        "text": "",
        "created_utc": 1678900703,
        "upvote_ratio": 1.0
    },
    {
        "title": "Worship coffe.",
        "author": "Super_Print3318",
        "url": "https://i.redd.it/5jmvrws2rxna1.jpg",
        "text": "",
        "created_utc": 1678900356,
        "upvote_ratio": 1.0
    },
    {
        "title": "the bad dinosaur 2017 the good dinosaur creepypasta",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/11s2lzg/the_bad_dinosaur_2017_the_good_dinosaur/",
        "text": "i was fan of the good dinosaur i was buying the the good dinosaur book on the target however she is my favourite movie it is about the the good dinosaur i had it on the evil dionsaur and the evil dionsaur 2 arlo's revenge on YouTube \n\nwhen i was at grandparents we had in early 2020s she is on DVD i know remember was in 10th birthday my the good dinosaur blue ray is broken it took with the DVD \n\n&amp;#x200B;\n\n[DVD cover](https://preview.redd.it/gqdsafqmdxna1.png?width=575&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=df5db487cd2783c0f7fe224146dfdf01a16e3a4a)\n\nin 12th birthday my grandma went to the big w i ran over to the DVDs i caught my eye it was some kids film sat on the DVD cover with a nick jr logo with a blue marker wrote THE BAD DINOSAUR i buy it just a nick jr kangaroo logo case with the the good dinosaur this is the another copy of the good dinosaur \n\nmy grandma is here i held the DVD along with how to train your dragon toy on the way home i showed my grandma the DVD she just looked blank it's a DVD don't watch it it might have some inappropriate content i ignore that what my grandma said i kept DVD in my grandparents house \n\ni rushed to my bedroom and popped the DVD the good dinosaur came out in 2015 in a year ago it took up for 3 minutes at my DVD but not often the DVD finally started with a few seconds of static come to find out the DVD already played it was plays the end credits there was no sound she won't read any credits in the evil title screen i rewind the DVD and as it it was ejected \n\n&amp;#x200B;\n\n[main menu ](https://preview.redd.it/48ajd41tixna1.png?width=571&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=29d982c736497d9ce38cb240d95351b9147d241e)\n\na few minutes later i even turned off the lights i was thinking it now the arlo's voice in the main menu the bonus features menu was very dark when i saw the DVD the acrocanthiosaurus eyes are yellow and his DVD menu was shaking \n\nat least an hour this is not for adult swim movie only the TV blare loud static i could have fallen asleep around 11 pm my grandma was sleeping at the time moth flying at night static causes of the eardrums however there was no intro in the static shown of the DVD menu and static was still playing spot looks at arlo it cuts arlo in the ptranodon nest arlo starts crying looking into the river on the play button on DVD menu arlo stares at the river this is where things get unnerving \n\nthe good dinosaur DVD menu was reverse arlo eyes start turning darker now seen as bloodshot eyes his brown pupils arlo towards spot she attempting to strike him hitting buck to the tail and started groaning in pain groaning over his tail \n\narlo stared at spot his cloths were gone his eyes were so dark he had no eyes his fur had the dark red bruising a couple seconds of white noise spot stares at him arlo is crying he does it spot shouts out SO ARLO NO arlo was not shown but was heard screaming his screams were echoing what the hell did you watching this is horrifying i still gazed into the horror screen the sound of blood flowing spot stood in the place until arlo was sure it is dead \n\nthen cut to arlo on the grass he was all bloodied and his face full of tears he even blood flowing on the mouth and began violently choking on it arlo dying for minutes it was so painful i tried to put DVD in DVD cover but DVD player is 500 error code i pressed the power button and attempt to turn it off and nothing worked i looked up to my horror screen it was arlo he laid on the grass other than arlo footsteps \n\ncut to spot was right to his arlo he had cuts scars and bruises with blood still pouring out of him spot had a gaunt face he looked scared arlo creepily walked behind spot i here the voice of the the good dinosaur DVD menu why why are you acting like this there was nothing do this to me i hate you (door slams shatters) arlo said in the main menu i was so rude \n\njust as things getting started the good dinosaur DVD menu jumpscares and my TV cut to the static",
        "created_utc": 1678900242,
        "upvote_ratio": 1.0
    },
    {
        "title": "A coffee alternative?",
        "author": "kennethasteiner",
        "url": "https://www.reddit.com/r/Coffee/comments/11s2i6w/a_coffee_alternative/",
        "text": "Just started a new sub related to coffee alternative I found.  Check out - \n\nr/wearerasa\n\nHave to love it!!",
        "created_utc": 1678900008,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffeeventures",
        "author": "coffeecat_cafeandbar",
        "url": "https://trueadventurecoffee.com/category/craft-coffee-101/",
        "text": "",
        "created_utc": 1678899644,
        "upvote_ratio": 1.0
    },
    {
        "title": "HOME CAFE | ASMR COFFEE",
        "author": "Jineeselected",
        "url": "https://v.redd.it/4putx39fwyna1",
        "text": "",
        "created_utc": 1678896221,
        "upvote_ratio": 1.0
    },
    {
        "title": "All-around grinder",
        "author": "aregina",
        "url": "https://www.reddit.com/r/Coffee/comments/11s0ixt/allaround_grinder/",
        "text": "Looking for recommendations or tips for a good all-purpose grinder - and cost not being a barrier.\n\nI grind for 250 ml of brewed coffee for myself every morning, and twice on the weekends. More often when people are over.\n\nIn order of decreasing frequency, I jump between the Areopress, Kalita pour over, French press, Clever Dripper, Moka pot, and Rancilio Silva.\n\nThanks!",
        "created_utc": 1678895807,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mystery: Coffee bean and roast affect grind QUALITY?? Especially \"dust\" formation??",
        "author": "mentalharvester",
        "url": "https://www.reddit.com/r/Coffee/comments/11s01iy/mystery_coffee_bean_and_roast_affect_grind/",
        "text": "I seem to have discovered something that until now was a mystery to me:\n\nIt seems that the type of coffee bean (porousness?) and its roast level affect grind *quality* much more than I previously thought. \n\nFor the past month or two, I've been grinding through 500grams/1 pound of fully washed, medium roast, Central/Latin American beans, that on paper should be perfect. Tried everything from brew method, to water temperature to grind size. Barf.\n\n**When grinding \"porous\" (for a lack of a better word) beans that are roasted medium and above, even when using a high quality hand-grinder set at medium/coarse, the grinds sometimes have a LOT of dust in them making the brew quite bitter and nearly undrinkable.**\n\nWhy isn't this subject talked about more?\n\nOr have I been living under a rock this entire time?\n\nSeems like all coffee aficionados talk about is grind quality, water temperature, roast level and brew methods etc. \n\nAm I on to something, or totally wrong? \n\nDiscuss.",
        "created_utc": 1678894795,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bentley's ten dollar drink",
        "author": "all_fair",
        "url": "https://www.reddit.com/r/Coffee/comments/11rztx1/bentleys_ten_dollar_drink/",
        "text": "Is anyone familiar with \"The Ten Dollar Drink,\" from Bentley's? Where could I find the kind of supplies to make that at home? I don't have an espresso machine, but I imagine using Brazilian beans, shaving some dark chocolate into it, and adding European cream would create a similar taste. Any advice on a particular kind of Brazilian coffee, special tricks for how to make the drink, or any other things I need to know to recreate it at home for my SO?",
        "created_utc": 1678894328,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help with breville. Already gone through a bag of beans :/",
        "author": "Prestigious-Shop1983",
        "url": "https://www.reddit.com/r/Coffee/comments/11rzqhb/need_help_with_breville_already_gone_through_a/",
        "text": "So, I’ve had a breville barista express for a while now and can’t pull anything that is not over extracted. I started off with the breville rec of setting to grind level 5 and the grind amount at 3 o’clock - over extracting. Tried turning up the grind level to 6, then 7, no adjustment to grind amount, then 6 and 7 with lower grind amount. Got advice from a friend who has one to set the grind level to 1/2 tested and still over extracting. Found a post in here that suggested setting grind level to 7 and turn amount to 1 o’clock and it won’t even pull a shot. I’m putting all my weight into tamping but still no luck.  I am currently using espresso beans from a local coffee shop. Can anyone give me advice?",
        "created_utc": 1678894126,
        "upvote_ratio": 1.0
    },
    {
        "title": "Espresso newbie in need of assistance",
        "author": "Flymania117",
        "url": "https://www.reddit.com/r/Coffee/comments/11rzghs/espresso_newbie_in_need_of_assistance/",
        "text": "Hi all! Hope you're doing well :)\n\nI recently acquired a Sage Barista express machine and am really enjoying it, but I'm having trouble understanding certain aspects of the \"dialing in\" process. I'm currently trying to dial in some cheap commodity coffee to try and get to grips with some of the concepts without wasting good coffee, but I've run into an issue that is beyond my knowledge in espresso brewing.\n\nBasically, I'm dosing 18g of beans at the finest outer burr setting and the inner burr set to 5. I distribute the grounds with a DIY wdt tool and use the included tamper. I pull the shot with the program function enabled so I can time it to be between 25 and 30 seconds. It takes about 9-10 seconds for any liquid to fall in the cup, and the pressure gauge sits at about 12 o'clock. \n\nAll that  said, I'm getting a low flow rate despite the pressure seemingly being normal, and even a 30 second shot only yields about 25g of coffee. I figured increasing the grind size would help with the flow rate, but wouldn't that lower the pressure as well?\n\nI'm still quite new to this stuff, so any help would be appreciated!\n\nThanks in advance!",
        "created_utc": 1678893528,
        "upvote_ratio": 1.0
    },
    {
        "title": "Employee Retention Tax Refund. Do you know What It Is?",
        "author": "joseabonillajr",
        "url": "https://davidallenfunding.blogspot.com/2023/03/employee-retention-tax-refund-do-you.html",
        "text": "",
        "created_utc": 1678892538,
        "upvote_ratio": 1.0
    },
    {
        "title": "coffee for most occasions (cold, hot, fast, slow)",
        "author": "zayzay_919",
        "url": "https://i.redd.it/e8lnfr77gyna1.jpg",
        "text": "",
        "created_utc": 1678890766,
        "upvote_ratio": 1.0
    },
    {
        "title": "UK Coffee Enthusiasts, What is Your Daily Coffee?",
        "author": "dinkleberg92",
        "url": "https://www.reddit.com/r/Coffee/comments/11rxzv7/uk_coffee_enthusiasts_what_is_your_daily_coffee/",
        "text": "I'm on the look out for a lower cost, decent coffee, that I can drink daily and supplement with exotic beans as I go. What are your favourites?",
        "created_utc": 1678890412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there something different with whole foods hometown blend beans?",
        "author": "mtbandrew",
        "url": "https://www.reddit.com/r/Coffee/comments/11rxq0x/is_there_something_different_with_whole_foods/",
        "text": "The last two bags have a burnt taste. I haven't changed anything else. I'm in the Denver region. The beans look and smell fine",
        "created_utc": 1678889823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electric kettle for V60",
        "author": "bkimura",
        "url": "https://www.reddit.com/r/Coffee/comments/11rwjf0/electric_kettle_for_v60/",
        "text": "Hello,\n\nI am going to be switching from a clever dripper to a Hario V60 and am in the need for an electric gooseneck kettle.  I am considering the Fellow Stagg EKG and the Bonavita with temperature control.  The Bonavita is significantly cheaper but doesn't have the flow restriction that is offered by the Stagg.  How important is this flow restriction for making great coffee using a V60?  Is it worth paying the extra money for the Stagg over the Bonavita strictly for the flow restriction benefit or would you quite frankly notice no difference in coffee flavor using one over the other?  I'd be interested in hearing from people that have used both kettles with a V60 or other pour over brewer.  Thank you.",
        "created_utc": 1678887209,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who are your favorite coffee roasters?",
        "author": "N2OCoffee",
        "url": "https://www.reddit.com/r/Coffee/comments/11rvpqx/who_are_your_favorite_coffee_roasters/",
        "text": "Please share your favorite coffee roasters.\n\nMine are Onyx Coffee Lab, Sweet Bloom Coffee Roasters, Pair Cupworks, and Black &amp; White Roasters (all in the US).\n\nI'm curious to check out other roasters around the world.",
        "created_utc": 1678885343,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cashmere Tank top - A Fashion Statement",
        "author": "anna060",
        "url": "https://www.reddit.com/r/Coffee/comments/11rvhnu/cashmere_tank_top_a_fashion_statement/",
        "text": "&amp;#x200B;\n\n[Women Cashmere Tank Top](https://preview.redd.it/bysawripgwna1.jpg?width=1440&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=9651aabee5a271628bea581e3ede9cfbdf93e9ed)\n\n \n\nA [cashmere tank top](https://www.gobicashmere.com/us/collections/women-top/) for women is a stylish and comfortable clothing item made from the soft and luxurious fibers of the cashmere goat. In warmer weather, cashmere tank tops are typically sleeveless and lightweight, making them ideal for layering or wearing alone.\n\nWhen shopping for a [womens cashmere tank top](https://www.gobicashmere.com/us/collections/women-top/), there are several factors to consider, such as the quality of the cashmere, the fit and style of the tank top, and the color options available. Tank tops made of high-quality cashmere fibers that are soft, durable, and pill-resistant are ideal.\n\nCashmere tank tops are available in a variety of necklines, from scoop to V-neck, and fits, from fitted to loose. Choose a style that complements your body type and your personal preferences.\n\nFinally, cashmere tank tops come in a variety of colors, ranging from classic neutrals like black, white, and grey to vibrant hues like pink, blue, and green. Consider which colours will complement your current wardrobe and add versatility to your outfits.\n\n**Style Cashmere Tank Top in Different Ways :**\n\nA cashmere tank top for women is a versatile wardrobe piece that can be dressed up or down depending on the occasion. Here are some ways to wear a cashmere tank top:\n\n1. Pair with jeans: For a casual and comfortable look, pair a cashmere tank top with a pair of jeans. For a stylish yet casual look, pair a slim-fitting tank top with skinny jeans and ankle boots.\n2. Layer with a blazer: Add a tailored blazer to your cashmere tank top to dress it up. This outfit is ideal for a business casual setting or a night out. Dress it up with dress pants or a pencil skirt.\n3. Wear with a skirt: For a feminine and elegant look, pair a cashmere tank top with a skirt. A flowy midi skirt with a fitted tank top or a pencil skirt with a loose-fitting tank top are both good options.\n4. Add sparkle and interest to your outfit by accessorizing your cashmere tank top with a statement necklace, earrings, or bracelets. For colder weather, a scarf or hat can be a stylish addition.\n5. Layer with a cardigan: Layer your cashmere tank top with a chunky knit cardigan for a cozy and comfortable look. This is ideal for a relaxed day out or lounging at home.\n\nOverall, depending on the occasion, a cashmere tank top can be dressed up or down and styled in a variety of ways to suit your personal taste and style.\n\nWomens Cashmere tank tops are generally appropriate for wearing in mild to cool weather. Cashmere fibers are soft and lightweight, providing warmth and insulation while also being breathable and moisture-wicking.\n\nTo stay warm and cozy in cooler weather, layer your cashmere tank top with a cardigan, blazer, or jacket. In warmer weather, wear the tank top alone or layer it with a lightweight sweater or shawl.\n\nIt is important to note that cashmere is a delicate fabric that must be properly cared for in order to retain its quality and softness. Hand washing cashmere is recommended, or use a delicate cycle in your washing machine with cold water and a mild detergent. Never use fabric softeners or bleach on cashmere, and never tumble dry it as this can cause shrinkage or damage to the fibers.",
        "created_utc": 1678884786,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice on grinder burrs",
        "author": "Wild_Grocery3554",
        "url": "https://www.reddit.com/r/Coffee/comments/11rujny/need_advice_on_grinder_burrs/",
        "text": "Hi!  \n\n\nI'm about to buy a used Ditting KR 804 grinder. I asked the seller for some photos of the burrs (since they've never been replaced and I know replacing them is pretty expensive).\n\nWhat do you think - is there much life left in these?  \n\n\nAny advice on this (or any tips about buying a Ditting KR 804 in general) is really appreciated!\n\n&amp;#x200B;\n\nhttps://preview.redd.it/lar9x9019wna1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=4a2c22c3babf893dbc1979757d47327388d0f81d\n\nhttps://preview.redd.it/1uhbaa019wna1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=be1608fca0dc84e70c74041cbb265cabd38bb396",
        "created_utc": 1678882284,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nespresso or Fully Automatic Espresso Machine?",
        "author": "slidesarmed",
        "url": "https://www.reddit.com/r/Coffee/comments/11ruj8t/nespresso_or_fully_automatic_espresso_machine/",
        "text": "Nespresso Pixie vs Philips EP2220/10\n\nSo i don't want any hassle/maintenance etc. and i want to drink decent espresso shots at home. The capsule prices are not a huge deal for me but i'm afraid of getting bad coffee out of these Automatic Machines.\n\nIf i'm not wrong Nespresso provides decent Espresso-like coffee. But i've read mixed opinions on Philips EP2220.\n\nIf i have to use more than 4 capsules for one decent high caffeine coffee, thats a problem as well.\n\nNespresso Pixie is way cheaper than Philips EP2220/10 as well.",
        "created_utc": 1678882249,
        "upvote_ratio": 1.0
    },
    {
        "title": "I meant to post this yesterday but…",
        "author": "Mereunit",
        "url": "https://www.reddit.com/r/Coffee/comments/11rtgsi/i_meant_to_post_this_yesterday_but/",
        "text": "☕️ 🥧",
        "created_utc": 1678879274,
        "upvote_ratio": 0.5
    },
    {
        "title": "Sage Dose Control fan stuck :(",
        "author": "hannahyaldnif",
        "url": "https://www.reddit.com/r/Coffee/comments/11rsvqw/sage_dose_control_fan_stuck/",
        "text": "My Sage Dose Control machine has been making extremely clumpy coffee grinds. I’ve followed tutorials to deep clean the machine but once I reach the fan section I’m stuck. I can’t seem to pull the fan out, I’ve tried pliers and a vacuum but nothing seems to work. It seems like the fan is larger than the space I need to pull it through so it’s impossible to get it out. Does anyone have any advice? I don’t want to give up on this machine :(",
        "created_utc": 1678877504,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ethiopian Shoondhisa brewing struggles",
        "author": "MinaDarsh",
        "url": "https://www.reddit.com/r/Coffee/comments/11rsnx6/ethiopian_shoondhisa_brewing_struggles/",
        "text": "Heya, trying out a roast from Manhattan Coffee Roasters, Shoondhisa (filter), it was roasted on the 27th of Februari and kept in the original bag, shut with the air pressed out before closing it.\n\nNow, I'm still trying to brew a good cup with this with either a V60-like Kono 01 brewer with tabbed Hario (JP) or Sibarisʇ filters. But also tried to brew it a few times with my AeroPress. On the V60-like I first tried the Hario filters and 24 clicks on my Comandante C40 (stock shaft). When I tried this this resulted in a 6 minute draw-down. The cup tasted very weak, hard to tell if there was any over- or under-extraction, just very absent flavours. I tried it too then with the Sibarisʇ filters and 19 clicks on the C40, I did get a 4 minute brew time, but this still tasted weak.\n\nSo, I figured there might be a massive bypass going on (I couldn't get the Sibarisʇ to fit snug into the Kono, not perfectly at least), so my next idea was to switch to the AeroPress, starting with 18 clicks, but also tried 24 and 26 clicks, whatever I do, I don't seem to be getting rich flavours from this bean.\n\nFurther variables are filtered tap water with a Brita, the water in the Netherlands is very good, medium-soft, brewing at 100°C, Hoffmann Ultimate for both the Kono and AeroPress. When grinding it's also very clear that there is a massive amount of fines, no matter if I use a spray of water on the beans or not. My question, I'm running out of ideas on how to make this bean into a good cup of coffee and starting to regret buying this bean, is there anything that I could still try?",
        "created_utc": 1678876817,
        "upvote_ratio": 1.0
    },
    {
        "title": "Latte Art",
        "author": "Flashy_Wall_8678",
        "url": "https://i.redd.it/1foc6nu1qvna1.jpg",
        "text": "",
        "created_utc": 1678875899,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] The Daily Question Thread",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/11rrwrw/mod_the_daily_question_thread/",
        "text": " \n\nWelcome to the daily [/r/Coffee](https://www.reddit.com/r/Coffee) question thread!\n\nThere are no stupid questions here, ask a question and get an answer! We all have to start somewhere and sometimes it is hard to figure out just what you are doing right or doing wrong. Luckily, the [/r/Coffee](https://www.reddit.com/r/Coffee) community loves to help out.\n\nDo you have a question about how to use a specific piece of gear or what gear you should be buying? Want to know how much coffee you should use or how you should grind it? Not sure about how much water you should use or how hot it should be? Wondering about your coffee's shelf life?\n\nDon't forget to use the resources in our [wiki](http://www.reddit.com/r/Coffee/wiki)! We have some great starter guides on our [wiki \"Guides\" page](https://www.reddit.com/r/Coffee/wiki/guides) and [here is the wiki \"Gear By Price\" page](http://www.reddit.com/r/Coffee/wiki/gear#wiki_coffee_gear_suggestions) if you'd like to see coffee gear that [/r/Coffee](https://www.reddit.com/r/Coffee) members recommend.\n\nAs always, be nice!",
        "created_utc": 1678874417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starting the coffee journey - best complete set for 400$ ?",
        "author": "chloratine",
        "url": "https://www.reddit.com/r/Coffee/comments/11rqznb/starting_the_coffee_journey_best_complete_set_for/",
        "text": "I'm shifting from fresh press / italian mokka to Espresso. And I watched too many James' videos... Big mistake!\n\nI have a budget of 400€ (France based). I first had a look at something automatic like the Krups Virtuoso or the more classic Delonghi Dedica, but then I realized I would favor better coffee over automatic. I'm looking at the **Flair Classic** at this stage.\n\nBut then I don't have a grinder (only a blade one, so it doesn't count). I'm reluctant to spend the same amount on grinder and machine, is it ... normal? Expected? Any model you recommend? I was thinking manual to get, again, better quality coffee without spending too much.\n\nThoughts?",
        "created_utc": 1678871292,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bean Differences Ups and Downs for a Rookie",
        "author": "WitcherLord",
        "url": "https://www.reddit.com/r/Coffee/comments/11rqyf7/bean_differences_ups_and_downs_for_a_rookie/",
        "text": "Hey there, I've recently started to look coffee as a brewing culture amd an entire different hobby. I used to be \"just a coffee mate\" guys when it came to preparing for my own besides of boutique coffee shops. Where I'm from it's mad expensive to buy entry level grinders but I've ordered what I can for the least price possible to just get into brewing coffee. \n\nAnd I think that whatever equipment you use, going from using roasted coffee or even instant to grinding beans freshly is a huge jump. Hoping this will improve my coffee experience immensely compared to using \"normal\" coffee. Thinking about getting light roasted south American beans.\n\n And just like getting into whiskey or bourbon tasting, I feel like it would be more productive to getting started with tasting a wide, generous palette. So what types of beans would provide a lengthy scale of flavours for a starter to experience? I'm not a native speaker and I hope I expressed my mind properly, thank's for your time.",
        "created_utc": 1678871174,
        "upvote_ratio": 1.0
    },
    {
        "title": "A simple V60 recipe to dial in any coffee",
        "author": "couchpotat0-",
        "url": "https://www.reddit.com/r/Coffee/comments/11rpvhx/a_simple_v60_recipe_to_dial_in_any_coffee/",
        "text": "I need a base recipe that I use for every coffee when dialing it in that I can easily adjust the amount of pours/ratio etc. \n\nShould I just do a 1:16.6 ratio with 250g water with 2 pours including the bloom, then increase the pours if I need to from there? Any help would be great!!!",
        "created_utc": 1678867417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this too much ?",
        "author": "Capital-Wrongdoer613",
        "url": "https://i.redd.it/5rdsth43fwna1.jpg",
        "text": "I think its not but my parents told me i drink too much. I drink every other day just 1 cup. Im 17 if that plays some role",
        "created_utc": 1678866191,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee Roastery expansion into the Netherlands",
        "author": "Academic_Step_4120",
        "url": "https://www.reddit.com/r/Coffee/comments/11rpdvo/coffee_roastery_expansion_into_the_netherlands/",
        "text": "[removed]",
        "created_utc": 1678865754,
        "upvote_ratio": 1.0
    },
    {
        "title": "Last chance to file a claim in the nestle class action",
        "author": "Glum_Maximum_4418",
        "url": "https://openclassaction.com/settlement_nestle_coffee_mate.php",
        "text": "",
        "created_utc": 1678859727,
        "upvote_ratio": 1.0
    },
    {
        "title": "Our housemates have this nifty tea light stand for keeping their pots of tea warm. Wondering how it will go for coffee if I place a glass carafe like the Hario range server on top. Too hot?",
        "author": "JvD8818",
        "url": "https://i.redd.it/2azqpwr0qvna1.jpg",
        "text": "",
        "created_utc": 1678857747,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this a good deal for a first espresso machine (home)?",
        "author": "ei2468",
        "url": "https://i.redd.it/l9vf07pplvna1.jpg",
        "text": "",
        "created_utc": 1678856293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Home Roasting",
        "author": "gbabyyurd57",
        "url": "https://www.reddit.com/r/Coffee/comments/11rmjgi/home_roasting/",
        "text": "So im very intrigued with roasting my own beans, so I went ahead and bought the Nuvo Eco Ceramic handheld roaster! Just want to see if anyone has any experience with this? Im pretty excited to test it out, even if it turns to sh**. Also, where is a good place to get great green beans?",
        "created_utc": 1678856122,
        "upvote_ratio": 1.0
    },
    {
        "title": "Costa Rica Specialty coffee tour recommendation in Monteverde (Santuario Ecologico or Cafe Monteverde)",
        "author": "jessi-poo",
        "url": "https://www.reddit.com/r/Coffee/comments/11rm2e4/costa_rica_specialty_coffee_tour_recommendation/",
        "text": "hi, figured this would be the right place to post this for anyone who's gone to Costa Rica and specifically tried out coffee tours there. \n\nLooking for a specialty coffee tour. Don Juan is popular and looks fun but I don't really care for sugar or chocolate to that degree other than it's yummy and it seems less geared towards more coffee nerds/enthusiasts.\n\nI'm down to the following 2:\n\n* [santuario ecologico coffee tour](https://santuarioecologico.com/coffee-experience-with-chris)\n* [cafe monteverde coffee tour](https://www.cafedemonteverde.com/pages/coffee-tour)\n\nBoth seem to offer very much specialty coffee tours really digging into the processing and roast and even cupping! Anyone done both or has a preference? Why?\n\nI'm leaning towards Santuario Ecologico, there is coffee tasting with different brew methods and even tasting coffee in various cup shapes! seems smaller producer, local perhaps?\n\nCafe Monteverde has regular traditional cupping and seems larger production\n\nThx!",
        "created_utc": 1678854630,
        "upvote_ratio": 1.0
    },
    {
        "title": "Temporarily Downgrading to an Inexpensive Bean — What Would You Get?",
        "author": "djmuaddib",
        "url": "https://www.reddit.com/r/Coffee/comments/11rm2ad/temporarily_downgrading_to_an_inexpensive_bean/",
        "text": "So I normally get a 24 oz bag of Counter Culture Hologram from Wegmans for about $25, and occasionally some nice stuff from local roasters. But recently I made the mistake of buying a goddamn house and now I have to be a little extra frugal the next few months. Anyone have a good downgrade pick? Or a good deal? Would be willing to buy a 5 lb bag if it gets me a discount (I know, I know...).",
        "created_utc": 1678854623,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did anyone watch this youtube video? Tim Hortons Secrets: The unsponsored truth",
        "author": "HedgyFermatian43",
        "url": "https://www.reddit.com/r/Coffee/comments/11rkw12/did_anyone_watch_this_youtube_video_tim_hortons/",
        "text": "[removed]",
        "created_utc": 1678851210,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gun to your head, unlimited access to any origin/region/processing method/roast degree, what are you brewing and how are you brewing it to avoid being executed?",
        "author": "DangerousSushi",
        "url": "https://www.reddit.com/r/Coffee/comments/11rjvjl/gun_to_your_head_unlimited_access_to_any/",
        "text": "I’m going with a Dunkin’ medium roast blend keurig cup.",
        "created_utc": 1678848491,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philips Automatic user here trying to justify the branded filters. Thoughts?",
        "author": "jamblamIT",
        "url": "https://i.redd.it/nnabfc06wuna1.jpg",
        "text": "",
        "created_utc": 1678847702,
        "upvote_ratio": 1.0
    },
    {
        "title": "Breville Infuser: weird behaviour after steaming",
        "author": "intransient",
        "url": "https://www.reddit.com/r/Coffee/comments/11rit67/breville_infuser_weird_behaviour_after_steaming/",
        "text": "My apologies if this is old hat -- my searches suggest not. I'm enjoying what my Breville Infuser is capable of, coming from simpler single boiler machines. However, problems arose after I decided to switch my order of operations, now steaming milk first, then pulling shots after. I like the idea of the freshest coffee possible. However after using the steam wand, the Infuser pulls shots very differently. The water is about 15 degrees hotter, and the shot twice the volume! The temperature boost I can understand, coming from steam temp -- though with a PID I hoped for better with this machine. I'm most surprised that it pulls a substantially different volume. If I pull consecutive shots, they remain at the higher volume.\n\nI know that tomes have been written about the Infuser pulling successive shots differently, but I couldn't find much about this problem. I find consecutive shots to be pretty well regulated, but a steam cycle blows its rhythm.\n\nI clean and descale regularly, as the machine requests. When pulling shots after steaming, I wait for the purging to finish after shutting the steam off. \n\nThanks for your thoughts.",
        "created_utc": 1678845931,
        "upvote_ratio": 1.0
    },
    {
        "title": "How I set the tone for a productive day: Coffee and Candlelight",
        "author": "aromaismytherapy",
        "url": "https://v.redd.it/6gviv6023tna1",
        "text": "",
        "created_utc": 1678843988,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me",
        "author": "Shot-Coffee-1601",
        "url": "https://www.reddit.com/r/u_Shot-Coffee-1601/comments/11rgxfr/me/",
        "text": "Yeah that's pretty much all of it.",
        "created_utc": 1678841808,
        "upvote_ratio": 1.0
    },
    {
        "title": "DF64 Grinder is getting coffee bits stuck in the burrs (friction sound when turning off)",
        "author": "PHGHMB",
        "url": "https://www.reddit.com/r/Coffee/comments/11rfcqv/df64_grinder_is_getting_coffee_bits_stuck_in_the/",
        "text": "Calling all DF64 owners! As the title says, I am having issues with my DF64. Coffee is getting stuck in the burrs, making it hard to lower the grind size and creating a friction noise when turning off the grinder.",
        "created_utc": 1678838472,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Aussie Style brunch and coffee in San Francisco",
        "author": "TraditionalJudge4545",
        "url": "https://www.reddit.com/r/Coffee/comments/11rf8s0/best_aussie_style_brunch_and_coffee_in_san/",
        "text": "[removed]",
        "created_utc": 1678835958,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone try Ode gen 2 with moka pot?",
        "author": "Individual_Seesaw869",
        "url": "https://www.reddit.com/r/Coffee/comments/11rf42b/anyone_try_ode_gen_2_with_moka_pot/",
        "text": "I know the Ode gen 2 will not do espresso.   Supposedly not for moka either, but has anyone tried?\n\nI am debating on whether to spend the money on a moka pot.  I probably could get one and if the ode gen 2 doesn't work well I do have a Capresso Infinity that can grind finer.  Just don't want to have to fish the Capresso out of basement storage every time I want to use a moka pot.",
        "created_utc": 1678820501,
        "upvote_ratio": 1.0
    },
    {
        "title": "[UK Only] Hario V60 Mugen free to a good home - please just cover postage.",
        "author": "grumpy_sludge",
        "url": "https://i.redd.it/0wieq1oqjsna1.jpg",
        "text": "",
        "created_utc": 1678819310,
        "upvote_ratio": 1.0
    },
    {
        "title": "COLD BREW CANS ~ Cheap Options?",
        "author": "DiligentBroccoli7002",
        "url": "https://www.reddit.com/r/Coffee/comments/11re4ec/cold_brew_cans_cheap_options/",
        "text": "Does anybody know of any cheap way to buy cans of cold brew in bulk? I love the cold brew cans but the starbucks ones run around $3 a pop. The cheapest I have seen are still more than $1.5 per can. Anybody know any cheap options for regular unsweetened cold brew cans (multipacks)?",
        "created_utc": 1678818384,
        "upvote_ratio": 1.0
    },
    {
        "title": "Newbie Figuring out what I like - cold brew methods",
        "author": "arbitrary_rhythm",
        "url": "https://www.reddit.com/r/Coffee/comments/11rdq1h/newbie_figuring_out_what_i_like_cold_brew_methods/",
        "text": "Forgive my lack of correct terminology... I've searched this thread but couldn't find what I was looking for. \n\nNot a coffee drinker, I usually stick with tea. Never really liked the flavor of coffee unless it's so packed with sugar and cream that it tastes like a milkshake instead of coffee lol. \n\nLast week while out of town I tried a cold brew from a local coffee shop in the area. It was just a black cold brew with a pump of brown sugar syrup and honey. But it was different than cold brew I've tasted in the past. This one was ?thick? and very rich in flavor without being bitter (perks of cold brew I guess, same deal for tea). Even with the minimal sugar I didn't mind the taste but really what got me was the consistency of it, the only word I can think of to describe it is thick... Not syrupy, just \"dense\" maybe is a better word. \n\nIf anyone can make sense of the random words I'm throwing out let me know... It would be much appreciated. Is it best to just try a cold brew recipe online and see if it's what I'm looking for? Thanks!",
        "created_utc": 1678817508,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to dial beans without using a ton",
        "author": "trybalfire",
        "url": "https://www.reddit.com/r/Coffee/comments/11rddus/how_to_dial_beans_without_using_a_ton/",
        "text": "Ended up getting a competition lot of some very good beans, but it’s becoming quite clear that it will take me some time to dial them in. How can I quickly dial beans in without doing it one cup at a time and wasting all my beans to dial?",
        "created_utc": 1678816795,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you clean the glass carafe for the Ninja Hot and Cold Brewer?",
        "author": "Tsquires1922",
        "url": "https://www.reddit.com/r/Coffee/comments/11rd0fq/how_do_you_clean_the_glass_carafe_for_the_ninja/",
        "text": "The black handle has some movement to it which means water can get under there and build up mold but I can’t figure out how to remove the black part to clean it. It’s extremely poorly designed if you can’t take it apart. I’ll attach a photo in the comments. Thanks for your input!",
        "created_utc": 1678815969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee Newbie seeks advice on cold mocha",
        "author": "AwkwardPromotion9882",
        "url": "https://www.reddit.com/r/Coffee/comments/11rcs0s/coffee_newbie_seeks_advice_on_cold_mocha/",
        "text": "Recently started drinking coffee and I am lazy so I tried to find a way to make one batch a week. My solution was to mix a batch of mocha in a blender and leave it in a pitcher to drink throughout the week, filling my ice cube tray with coffee to complement. My simple recipe is one part instant coffee, one part sweetener(sugar), and one part pure cocoa powder mixed in the blender with hot water. When I pour my coffee from the pitcher in the morning on my coffee cubes I add regular milk after for a delicious, quick treat.\n\nMy persisting problem is at the end of the batch at the bottom of the pitcher is always a lot of goop that tastes bitter, which I would presume is cocoa powder slop. This makes me think the rest of the coffee pitcher is not getting enough cocoa powder and also haven't figured out a clever way to salvage the last portion of my coffee batch.\n\nAny advice on how to improve my methods would be appreciated.",
        "created_utc": 1678815474,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to cover myself in that sweet bean juice we call coffee and absorb it directly into my body, much like a thorny desert lizard does with water?",
        "author": "CoffeeScholar43",
        "url": "https://www.reddit.com/r/Coffee/comments/11rc2tk/is_it_possible_to_cover_myself_in_that_sweet_bean/",
        "text": "[removed]",
        "created_utc": 1678813949,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vesuviana coffee maker repair assistance.",
        "author": "jaunehope",
        "url": "https://www.reddit.com/r/Coffee/comments/11rbyg5/vesuviana_coffee_maker_repair_assistance/",
        "text": "My boyfriend likes thrifting and antique shopping and knowing I am a coffee enthusiast he bought a 1948 electric vesuviana coffee maker  The issue with it is that it's missing the \"\"portafilter\" (not being an Expresso machine I wouldn't define it as such but it looks like it). I cannot find a original spare but I know that several companies have done similar models till the 1980s and l wanted to know if someone knows if any of those filters are compatible with a vesuviana. The diameter of the vesuviana filter is 62 mm.\nThanks in advance.",
        "created_utc": 1678813693,
        "upvote_ratio": 1.0
    },
    {
        "title": "Milk and coffee sucks compared to cream, why?",
        "author": "snowywinter420",
        "url": "https://www.reddit.com/r/Coffee/comments/11rbfi8/milk_and_coffee_sucks_compared_to_cream_why/",
        "text": "So I'm  a big coffee drinker as most people are.\n\nI'm really into Kirkland ground coffee from Costco.  I add a bit of cream and it tastes delicious.\n\nI ran out of cream so I've been adding a little 2% milk instead.  It sucks so bad!!!!\n\nWhy?",
        "created_utc": 1678812571,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rant Thread",
        "author": "PenchantForNostalgia",
        "url": "https://www.reddit.com/r/Coffee/comments/11rb5zf/rant_thread/",
        "text": "I need to rant. Over in r/bend, we have a Friday rant thread to vent our frustrations, but we don't have that here.\n\n&amp;#x200B;\n\nI'm so frustrated with the lack of consistency in labeling with coffee. I don't always have time to go to a coffee shop to buy their beans directly, so I buy their beans at the grocery store. I saw a new local roastery that I'd never heard of, and they not only had African beans (my favorite), but they were Yirgacheffe! The bag was \\~$15, and overall seemed solid. They weren't labeled with any kind of roast, other than the notes. You'd figure that Yiracheffe beans with a roast profile would be specialty coffee.\n\n&amp;#x200B;\n\nI was surprised and not very happy when I opened the bag and the beans were roasted as dark as Starbucks' beans. \n\n&amp;#x200B;\n\nI just really wish there were guidelines for labeling, or some sort of system so you could know what you were getting. I finally got through the last of the bag this morning, and have a new bag of Coava beans waiting for me for tomorrow.",
        "created_utc": 1678811993,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] Inside Scoop - Ask the coffee industry",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/11ratfp/mod_inside_scoop_ask_the_coffee_industry/",
        "text": "This is a thread for the enthusiasts of /r/Coffee to connect with the industry insiders who post in this sub!\n\nDo you want to know what it's like to work in the industry? How different companies source beans? About any other aspects of running or working for a coffee business? Well, ask your questions here! Think of this as an AUA directed at the back room of the coffee industry.\n\nThis may be especially pertinent if you wonder what impact the COVID-19 pandemic may have on the industry (hint: not a good one). Remember to keep supporting your favorite coffee businesses if you can - check out the weekly deal thread and the coffee bean thread if you're looking for new places to purchase beans from.\n\nIndustry folk, feel free to answer any questions that you feel pertain to you! However, please let others ask questions; do not comment just to post \"I am _______, AMA!” Also, please make sure you have your industry flair before posting here. If you do not yet have it, contact the mods.\n\nWhile you're encouraged to tie your business to whatever smart or charming things you say here, this isn't an advertising thread. Replies that place more effort toward promotion than answering the question will be removed.\n\nPlease keep this thread limited to industry-focused questions. While it seems tempting to ask general coffee questions here to get extra special advice from \"the experts,\" that is not the purpose of this thread, and you won't necessarily get superior advice here. For more general coffee questions, e.g. brew methods, gear recommendations for home brewing, etc, please ask in the daily Question Thread.",
        "created_utc": 1678811211,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fellow French Press: The Brewing Beauty Everyone’s Waited For",
        "author": "Homegrounds",
        "url": "https://www.homegrounds.co/fellow-french-press-review/",
        "text": "",
        "created_utc": 1678810659,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your favorite go to recipe using a Comandante C40.",
        "author": "Wrekfin",
        "url": "https://www.reddit.com/r/Coffee/comments/11rabe3/whats_your_favorite_go_to_recipe_using_a/",
        "text": "V60 or flat bottom brewer. It doesn't matter. I'm looking to try some new brews.",
        "created_utc": 1678810142,
        "upvote_ratio": 1.0
    },
    {
        "title": "10 Surprising Health Benefits of Cold Brew Coffee",
        "author": "WillingCoach",
        "url": "https://www.youtube.com/watch?v=PjAiJk4-hVU",
        "text": "",
        "created_utc": 1678809391,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to clean stainless steel mesh drip filter?",
        "author": "oic123",
        "url": "https://www.reddit.com/r/Coffee/comments/11r9qv3/how_to_clean_stainless_steel_mesh_drip_filter/",
        "text": "I have this Buphalo stainless steel mesh filter that I use for traveling, but after using for a few weeks, most of the small holes in the mesh have become clogged with coffee.\n\nOf course I wash it thoroughly after every use, but since I used the wrong grind a few times, it's become clogged and very slow at filtering.\n\nCan anyone recommend a good method to clean out all the coffee stuck in the mesh? \n\nPics in comments. Thanks!",
        "created_utc": 1678808929,
        "upvote_ratio": 1.0
    },
    {
        "title": "timemore sculptor vs df64v",
        "author": "nodnarb_thebarista",
        "url": "https://www.reddit.com/r/Coffee/comments/11r9qpu/timemore_sculptor_vs_df64v/",
        "text": "I know these are not out yet, but I was curious what everyone’s thoughts were. Im leaning towards the DF64v.",
        "created_utc": 1678808918,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Morning Ritual",
        "author": "DwightSaunders223",
        "url": "https://teesdesk-us.com/the-morning-ritual-coffee?s=hanes-5250&amp;c=Black&amp;p=FRONT",
        "text": "",
        "created_utc": 1678806832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best mold free coffee?",
        "author": "Ok-Scene-9442",
        "url": "https://www.reddit.com/r/Coffee/comments/11r7v2n/best_mold_free_coffee/",
        "text": "What are everyone’s favorite mold and mycotoxin free coffee brands?\n\nSo far I’ve only tried Purity Coffee which are great. They are pesticide-free, mold tested and even share their certificate of analysis as proof of their mycotoxin testing.",
        "created_utc": 1678804705,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommendations for someone that doesn't like coffee?",
        "author": "shethanthegod",
        "url": "https://www.reddit.com/r/Coffee/comments/11r77ny/recommendations_for_someone_that_doesnt_like/",
        "text": "Normally I just drink energy drinks for my caffeine in the morning...but that's def not the healthiest and they also just do not make me feel that great so I'm looking for an alternative. I don't really like coffee, but maybe one of yall might know of something that I might like. So if you've got like suggestions for like a k-cup or other quick/easy coffee or something that u think I might possibly like, lmk",
        "created_utc": 1678803201,
        "upvote_ratio": 1.0
    },
    {
        "title": "I tried the underextracted/overextracted side-to-side pourover comparison",
        "author": "mart0n",
        "url": "https://www.reddit.com/r/Coffee/comments/11r63u1/i_tried_the_underextractedoverextracted/",
        "text": "In a very recent thread, someone asked \"[what is bitter and what is sour?](https://www.reddit.com/r/Coffee/comments/11q9twr/what_am_i_tasting/)\".\n\nIn that thread, someone suggests brewing 10g of coffee in 200g water (overextracted, bitter), then 10g coffee in 100g of water and topping up to 200g (underextracted, sour), and comparing the two.\n\nI struggle a lot with bitter vs sour, and I'm very new to pourovers, so gave this a try today. \n\nThe overextracted cup:\n\n* More \"full\" (more body?)\n* More of a generic coffee taste\n\nThe underextracted cup:\n\n* More bland\n* More palatable overall\n\nThe more I drank, the harder it was to tell them apart. I think this was more down to taste fatigue than temperature.\n\nI used Square Mile's [Telila Honey Yukro](https://shop.squaremilecoffee.com/products/telila-honey-yukro), roasted 25 days ago, which has \"juicy\" notes that I have entirely failed to achieve. This is the first bag of beans I've ever used for pour over. I used a Kalita 102 with unbleached filters, and water straight off the boil. Beans ground in a Knock Aerspeed at 2:9.\n\n&amp;#x200B;\n\nI would be interested to hear other people's experiences in discerning bitter vs sour, how your palette has grown more refined... and how you achieve the juicy notes advertised in your beans!",
        "created_utc": 1678800481,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could coffee grounds sit in a French press overnight, then be heated in the morning, and still taste good?",
        "author": "max02c",
        "url": "https://www.reddit.com/r/Coffee/comments/11r60gx/could_coffee_grounds_sit_in_a_french_press/",
        "text": "I’m trying to find a way to have coffee automatically made for me in the morning, however, there are a few rules to this:\n1. Reliable in method and good flavor\n2. Take up little space on my counter\n3. Be under $100\n\nThis rules out automatic drip machines as you’ll break two out of three of those anytime. So my next thought was some sort of way to have something automatically dispense hot water into a French press but I can across automatic tea makers. I want to use this with coffee grounds but the only problem is that they’ll sit in the water overnight before heating up which seems wrong.\n\nAny thoughts or suggestions?",
        "created_utc": 1678800243,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my virtuoso+ grinding evenly? This is setting 28 for french press",
        "author": "marginflex",
        "url": "https://i.redd.it/8nd4i7u5fpna1.jpg",
        "text": "",
        "created_utc": 1678799520,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Technovorm Mochamaster truly lives up to the hype, but multiverse help you if you accidentally put the grounds bin in slightly wrong and leave the room… it’s punishingly messy. I still love it though.",
        "author": "Brandanp",
        "url": "https://www.reddit.com/r/Coffee/comments/11r4d72/the_technovorm_mochamaster_truly_lives_up_to_the/",
        "text": "",
        "created_utc": 1678795638,
        "upvote_ratio": 1.0
    },
    {
        "title": "coffee grinder under 20 dollars",
        "author": "CraZeYT",
        "url": "https://www.reddit.com/r/Coffee/comments/11r4aq1/coffee_grinder_under_20_dollars/",
        "text": "",
        "created_utc": 1678795427,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s in your cup this morning?",
        "author": "Mereunit",
        "url": "https://www.reddit.com/r/Coffee/comments/11r48x5/whats_in_your_cup_this_morning/",
        "text": "I’m suffering through this bag of Kirkland French Roast beans. Apologizing to my grinder and my French press for putting them through this. Just two more pounds to go. 😖",
        "created_utc": 1678795294,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is Robusta C. canephora \"Pierre ex A. Froehner\"?",
        "author": "051190",
        "url": "https://www.reddit.com/r/Coffee/comments/11r35c9/why_is_robusta_c_canephora_pierre_ex_a_froehner/",
        "text": "Does anyone know why Robusta's binomial name usually has \"Pierre ex A. Froehner\" added onto the end? I've tried googling to find out the origins of the taxonomy but no luck. Anyone have a good source?",
        "created_utc": 1678791759,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you change the ratio with Tetsu’s 4:6 method from 1:15? Or is it designed only for that ratio?",
        "author": "couchpotat0-",
        "url": "https://www.reddit.com/r/Coffee/comments/11r340y/can_you_change_the_ratio_with_tetsus_46_method/",
        "text": "",
        "created_utc": 1678791643,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] The Daily Question Thread",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/11r23s4/mod_the_daily_question_thread/",
        "text": " \n\nWelcome to the daily [/r/Coffee](https://www.reddit.com/r/Coffee) question thread!\n\nThere are no stupid questions here, ask a question and get an answer! We all have to start somewhere and sometimes it is hard to figure out just what you are doing right or doing wrong. Luckily, the [/r/Coffee](https://www.reddit.com/r/Coffee) community loves to help out.\n\nDo you have a question about how to use a specific piece of gear or what gear you should be buying? Want to know how much coffee you should use or how you should grind it? Not sure about how much water you should use or how hot it should be? Wondering about your coffee's shelf life?\n\nDon't forget to use the resources in our [wiki](http://www.reddit.com/r/Coffee/wiki)! We have some great starter guides on our [wiki \"Guides\" page](https://www.reddit.com/r/Coffee/wiki/guides) and [here is the wiki \"Gear By Price\" page](http://www.reddit.com/r/Coffee/wiki/gear#wiki_coffee_gear_suggestions) if you'd like to see coffee gear that [/r/Coffee](https://www.reddit.com/r/Coffee) members recommend.\n\nAs always, be nice!",
        "created_utc": 1678788016,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are these beans okay to use? Never seen that white stuff before",
        "author": "poulnyrup",
        "url": "https://i.redd.it/1gz5cp1gkpna1.jpg",
        "text": "",
        "created_utc": 1678783226,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which coffee goes best with milk - Suggestion needed",
        "author": "stuck319",
        "url": "https://www.reddit.com/r/Coffee/comments/11qzt1a/which_coffee_goes_best_with_milk_suggestion_needed/",
        "text": "[removed]",
        "created_utc": 1678779272,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on new espresso machine and grinder set-up",
        "author": "Blue-Fly-",
        "url": "https://www.reddit.com/r/Coffee/comments/11qzexm/advice_on_new_espresso_machine_and_grinder_setup/",
        "text": "I am looking to upgrade my set-up from a Breville Infuser to a Heat Exchanger. Don't think I need a Dual Boiler. Need some views on espresso machine and grinder.\n\nOn average, per day, I make 4 milk-based coffees and may occasionally have an espresso. I enjoy the workflow and optimising the variables in making the coffee, but I'm not a purist.\n\nIn terms of espresso machine, I am very keen on the ECM Mechanika Slim VI and have just seen it in real life - Looks fabulous. But I'm not fully decided yet. My main requirements are: (1) Preinfusion (2) Decent steam power (3) Temperature control: Three-way switch on ECM SLim Vi or Profitec Pro 400 with 3 PID temperature is sufficient, I don't necessarily need PID where I can select any temperature (4) E61 brew head (5) Not too large in size (6) Relatively Fast heat-up time (\\~15 mins) and (7) Easy workflow.\n\nI will soon be going into a store to see the Profitec Pro 400, Profitec Pro 500 PID, Quick Mill QM67 and some Rocket machines in real life. The ECM quality seems very impressive and solid. If anyone has any thoughts on how these compare, would be great to hear some views.\n\nMy other question is on grinder (I currently have the Breville Smart Grinder Pro). I normally use Medium Roast and go through 500g or 1 kg at one time. I don't change the beans between each grind. I'm currently looking into single dosing (or put enough beans in hopper for 2-3 days worth of drinks) as I don't believe I should fill up the hopper given I only make max 5 cups per day.\n\nThe 3 options are Eureka Oro Mignon, DF64 or Niche Zero (Pricey and flat burrs version might be released soon?). I am also very drawn to Eureka Specialita - I will mainly use this for doing single doses and the hopper just makes it more versatile in case I need to do a few more drinks at one go. I'm aware there's the flat burrs vs conical burrs debate, but good to hear your views on these grinders above. Thanks much",
        "created_utc": 1678777814,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee",
        "author": "Dreamcatcherr09",
        "url": "https://www.reddit.com/r/Coffee/comments/11qz424/coffee/",
        "text": "Coffee",
        "created_utc": 1678776746,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I feel sleepy even after having coffee? like it doesn't have any effect on me...",
        "author": "Capable_Floor_8006",
        "url": "https://www.reddit.com/r/Coffee/comments/11qy00x/why_do_i_feel_sleepy_even_after_having_coffee/",
        "text": "",
        "created_utc": 1678772883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for Kona Farmer who used to post in usenet Newsgroups",
        "author": "Harborseal12",
        "url": "https://www.reddit.com/r/Coffee/comments/11qxdao/looking_for_kona_farmer_who_used_to_post_in/",
        "text": "Hi!  I'm looking for a Kona coffee farmer/roaster who used to post in usenet newsgroups.  Several of us bought her coffee and loved it.  Does anyone remember her name or farm?  She also sold macadamia nuts.",
        "created_utc": 1678770735,
        "upvote_ratio": 1.0
    },
    {
        "title": "Survey to learn more about the behavior of coffee consumers from San Francisco, California.",
        "author": "CoffeeUTN",
        "url": "https://www.reddit.com/r/Coffee/comments/11qvxsj/survey_to_learn_more_about_the_behavior_of_coffee/",
        "text": "[removed]",
        "created_utc": 1678766292,
        "upvote_ratio": 1.0
    },
    {
        "title": "Acaia lunar and pearl",
        "author": "Bangkokserious",
        "url": "https://www.reddit.com/r/Coffee/comments/11qvog4/acaia_lunar_and_pearl/",
        "text": "I currently own the lunar and do both espresso and pour over with it. I've read some comments and there are some people that own both the lunar and the pearl.  For those that own both do you find the experience using the pearl for pourover that much better.   \n\nThe lunar works overall but the platform is a bit smaller for pourover use.  \n\nI realize it is a high cost and there are lower priced scales out there. But I figure I like the performance of the lunar so I would want something similar. Ideally I would have gotten the pearl to begin with but it is a bit of a workaround to fit under espresso machines.",
        "created_utc": 1678765515,
        "upvote_ratio": 1.0
    },
    {
        "title": "Survey to learn more about the behavior of coffee consumers from San Francisco California",
        "author": "CoffeeUTN",
        "url": "https://www.reddit.com/r/Coffee/comments/11qv9z4/survey_to_learn_more_about_the_behavior_of_coffee/",
        "text": "[removed]",
        "created_utc": 1678764356,
        "upvote_ratio": 1.0
    },
    {
        "title": "creepypasta evilnik scrapped",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/11qu7cz/creepypasta_evilnik_scrapped/",
        "text": "the following creepypasta is parody of a Godzilla please enjoy \n\nchapter 1 \n\ni don't know if tell you about the story did you remember about lost episode i had some toys and DVDs i went to attic with a flashlight i looked around the attic it was red and looked like a DVD cover of evilnik maybe it is evilnik Christmas the DVD cover looks really weird the title was scrapped it was just 1 p the only episode was scrapped i put DVD in Xbox 360 it showed DVD warning screen then the menu came it has 3 options play all set up and bonus features i clicked play all button but something wrong with the logo the logo was red and there's blood dripping down in the background it says hell the music was slowed down and reverse but the music was slowed down too the title card showed up then the episode started \n\nchapter 2 \n\nwhich was footage he's going to the scrapyard motor was upset the prank he is going to deliver some vans motor to do buzz's job at night then it faded to the another scene there was no responds then the doors are closed itself like a jumpscare then the 2 spikes jammed the motor's eyes motor eyes are gone motor screamed sound animated i saw blood coming out of the eyes i can hear the termite shield it was violent and gore face fell off and blood was coming out then it faded to the junkyard there were old TVs wrecked cars and vintage computers then buzz we saw motor in the shed i banned this episode and because motor's brutal death then the ending music before a credits started a picture of eyeless motor face were popped off on the screen then the end credits played then back to the main menu \n\nchapter 3 \n\ni eject the DVD to show my mom about the lost episode my mom was very upset episode was very brutal the lost episode found something in the attic about the buzz plush i got a screenshot of motor's death before my mother destroys a DVD with a hammer i will never that lost episode again \n\nfootage \n\nif you found the lost episode don't watch it",
        "created_utc": 1678761347,
        "upvote_ratio": 1.0
    },
    {
        "title": "Colombian Coffee is my passion",
        "author": "emotionoes",
        "url": "https://www.reddit.com/r/Coffee/comments/11qtq1u/colombian_coffee_is_my_passion/",
        "text": "I am from Colombia and I want to sell my coffee. I have 200 pounds. Does anyone want really good coffee. DM if interested",
        "created_utc": 1678760084,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wedding Registry Help",
        "author": "FitchnerAuBarca",
        "url": "https://www.reddit.com/r/Coffee/comments/11qtavk/wedding_registry_help/",
        "text": "I'm frantically looking for recommendations on the following:\n\n* Automatic drip coffee maker. Price range = $100 - $300\n* Electric burr grinder. Prince range = $100 - $150. Something that would grind coffee applicable for the coffee machine, pour over, and a French press.\n* Gooseneck kettle. Price range = $40-$60\n\nI've always wanted nicer equipment for making coffee and since I'll be getting married in a few months, I figured this would be the time to take the plunge. Thanks everyone for any advice that you can provide.",
        "created_utc": 1678759004,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starbucks medium roast vs dark roast",
        "author": "Human-Teach-728",
        "url": "https://i.redd.it/hy11evwc0mna1.jpg",
        "text": "",
        "created_utc": 1678758161,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do the fellow Carter mugs still have issues?",
        "author": "fukishen",
        "url": "https://www.reddit.com/r/Coffee/comments/11qr79e/do_the_fellow_carter_mugs_still_have_issues/",
        "text": "As the title says, are they still prone to stink? Are there better alternatives out there? Any other issues that aren't as highlighted?",
        "created_utc": 1678753771,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clever dripper vs Hario switch",
        "author": "orangebun0914",
        "url": "https://www.reddit.com/r/Coffee/comments/11qq8o3/clever_dripper_vs_hario_switch/",
        "text": "Hello, I'm a casual coffee drinker who usually go for  the cappuccino/flat white options. I would like to expand into specialty coffee and am deciding between a Clever or a Switch for home use. Been reading quite a bit on both of them but I'm really on the fence as to which to get. There's so many factors involved I can't really decide. (Glass vs plastic. Or how the Switch could function as a V60. Read some reviews that the Switch produces a better cup but I'm not sure if I would be able to discern it) \n\nWould really love you guys' thoughts on it.",
        "created_utc": 1678751455,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ever had unroasted beans?",
        "author": "Melodic_Cantaloupe88",
        "url": "https://www.reddit.com/r/Coffee/comments/11qq7wa/ever_had_unroasted_beans/",
        "text": "Hello, I will be trying unroasted beans for the first time tomorrow. I will ground them myself and brew in a french press. \n\nI know the unroasted beans are known to taste absolutely nothing like our beloved roasted coffee. But am curious if anyone here has had them and might have a tip for me? \n\nMany thanks!",
        "created_utc": 1678751410,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommend coffee beans for a gift?",
        "author": "lLovePikachu",
        "url": "https://www.reddit.com/r/Coffee/comments/11qpkkd/recommend_coffee_beans_for_a_gift/",
        "text": "Hello! As a coffee fan but with no discerning taste buds, could someone recommend some coffee beans for my favourite siblings birthday? They do have taste buds so your recommendations will go to good use. \n\nBudget is a couple of hundred pounds for a regular size pack (ok, I don’t know what a regular size coffee bean pack is so I’m thinking 250g-350g?).\n\nI’m in the UK if that matters. \n\nMany thanks!",
        "created_utc": 1678749900,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone tried making cowboy coffee?",
        "author": "Wooden-Photo-2783",
        "url": "https://www.reddit.com/r/Coffee/comments/11qp8gm/has_anyone_tried_making_cowboy_coffee/",
        "text": "Saw a video by Kent Rollins on how to make cowboy coffee. Curious to see what everyone's thoughts are on this, especially based on the normal Do's and Don't of \"proper\" coffee. Have you ever made this? How was it?  \n\n[How to Make Cowboy Coffee](https://www.youtube.com/watch?v=7UAoT21eqXI)",
        "created_utc": 1678749127,
        "upvote_ratio": 1.0
    }
]