[
    {
        "title": "Fellow Ode burrs v1.1 vs v2?",
        "author": "BlackBlackBread",
        "url": "https://www.reddit.com/r/Coffee/comments/10m44na/fellow_ode_burrs_v11_vs_v2/",
        "text": "I've got a Fellow Ode with the v1.1 burrs. I'm really happy with it, but I can't let go the idea of pursuing the specialty v60 coffees I've tasted in coffee shops and I wonder if it's the burrs holding me back.\n\nI've read a lot of reviews comparing to v1 saying the v2 are absolutely worth the upgrade, but not much has been said comparing them to v1.1. Did anyone make this upgrade? If anyone compared those two to SSPs, are the v2 closer to v1.1, closer to SSPs or somewhere in the middle?",
        "created_utc": 1674771152,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone tried blossom coffee roasters?",
        "author": "Glitch-v0",
        "url": "https://www.reddit.com/r/Coffee/comments/10m43y5/anyone_tried_blossom_coffee_roasters/",
        "text": "I was looking into getting their [single origin sample box](https://blossomcoffeeroasters.com/products/single-origin-sampler-box), and was wondering if anyone had experience with them, or if there is a company with a similar package that they do recommend.  \nThank you for any advice or experience to share.",
        "created_utc": 1674771103,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know the menessa coffee maker?",
        "author": "jbellas",
        "url": "https://www.reddit.com/r/Coffee/comments/10m3zmp/does_anyone_know_the_menessa_coffee_maker/",
        "text": "[https://recetasbellas.files.wordpress.com/2023/01/1-1.jpg](https://recetasbellas.files.wordpress.com/2023/01/1-1.jpg)\n\nI was able to see this mid-century Menessa coffee pot at a vintage sale.\n\nIt is used to make coffee and tea.\n\nDoes anyone have it used in the past or use it currently?\n\nThank you very much. \n\nRegards, Juan.",
        "created_utc": 1674770802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Menessa Coffee Maker",
        "author": "jbellas",
        "url": "https://i.redd.it/mijk8sj3lgea1.jpg",
        "text": "",
        "created_utc": 1674769856,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the Kalita Wave worth it?",
        "author": "SameerAlam99",
        "url": "https://www.reddit.com/r/Coffee/comments/10m365n/is_the_kalita_wave_worth_it/",
        "text": "Hey, I'm new to the coffee world. I bought an Aeropress and a timecore c2 a couple of months ago and am loving the process of playing around with different brews and techniques. However, I feel like I'm missing out on the benefits of percolation brews. I live in a country where it's hard to get great coffee delivered, and I have a limited budget cause I don't earn a lot. I'm getting a plastic v60 but I'm wondering whether buying a Kalita Wave 185 is worth the additional expense, or should I rather save the money to buy more and better beans, coffee, and equipment.",
        "created_utc": 1674768803,
        "upvote_ratio": 1.0
    },
    {
        "title": "Low maintenance automatic espresso machine + low maintenance milk system",
        "author": "eradovan",
        "url": "https://www.reddit.com/r/Coffee/comments/10m249j/low_maintenance_automatic_espresso_machine_low/",
        "text": "I need a recommendation on a machine that is fully automatic in that I can make a one touch latte or cappuccino (and any any other drink options said machine may make) but I want an incredibly low maintenance machine and am willing to entertain options of any price range. I noticed the Jura Z10 requires cleaning the system daily, and to me that is not acceptable and something I would realistically *never* follow. I'm very busy and constantly sleep deprived so frankly I want a no BS machine that will be reliable and will only need periodic maintenance.",
        "created_utc": 1674766213,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I fix my grinder? Wilfa Svart, less than a year old..",
        "author": "TomandFin",
        "url": "https://v.redd.it/oqesr1brmhea1",
        "text": "",
        "created_utc": 1674764553,
        "upvote_ratio": 1.0
    },
    {
        "title": "Organic coffee club subscriptions?",
        "author": "Jazzlike_Ad5654",
        "url": "https://www.reddit.com/r/Coffee/comments/10lzvyb/organic_coffee_club_subscriptions/",
        "text": "Hi everyone, are there any clubs or subscriptions that offer, organic sampler packs?\n\nIdeally I'm looking for a company that sells a variety of organic sampler packs from different companies, so that we can taste them before purchasing larger quantities from the company.\n\nThank you in advance!",
        "created_utc": 1674760593,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to clean",
        "author": "EnvironmentalSet1267",
        "url": "https://www.reddit.com/r/Coffee/comments/10lzdwi/how_to_clean/",
        "text": "How would clean the water level tube on an perlocleator, I found old perlocleator that I could get mostly clean but clean the tube the person the use regularly only rinsed it out poorly after each use and there is a lot of build up in the tube.",
        "created_utc": 1674759374,
        "upvote_ratio": 1.0
    },
    {
        "title": "Upgrade from Encore for espresso and v60",
        "author": "Mahtayto",
        "url": "https://www.reddit.com/r/Coffee/comments/10lyzku/upgrade_from_encore_for_espresso_and_v60/",
        "text": "Hi, I’m looking to upgrade from my berratza encore I’m not sure what options to consider. I was looking at the D64 which looks great but it’s quite expensive. Would a hand grinder offer best value at a lower cost for my case or should I stick with an electric grinder. I’m typically making 2 cups today, one v60 and one espresso.",
        "created_utc": 1674758370,
        "upvote_ratio": 1.0
    },
    {
        "title": "AeroPress: Immersion Time, Invert or Not, Press the Puck, Swirl or Stir, Bloom or Not, Brew Temp and more questions thoroughly answered by James Hoffman.",
        "author": "elessarjd",
        "url": "https://www.youtube.com/watch?v=jBXm8fCWdo8",
        "text": "",
        "created_utc": 1674757850,
        "upvote_ratio": 1.0
    },
    {
        "title": "New to AeroPress, whats the fastest way to Experiment &amp; Learn?",
        "author": "Informal_Elephant911",
        "url": "https://www.reddit.com/r/Coffee/comments/10lymvh/new_to_aeropress_whats_the_fastest_way_to/",
        "text": "Can I keep the ratio same say 55grams to 1 litre and brew a very small batch say 5 grams of coffee and 100ml water to master my technique, grind size etc? And brew multiple batches to test it out?\n\n  \nIf I keep the ratio the same, does it even really matter if I brew 11 grams of coffee of 1 gram?\n\nI'm trying to find the fastest way to experiment with different variables without wasting much. This is something that I didn't see being discussed in any YouTube video I've watched so far.\n\nI'm trying to taste what underextracted is and what overextracted tastes like etc to start building a profile for tasting coffee and understanding my errors in a better way.",
        "created_utc": 1674757456,
        "upvote_ratio": 1.0
    },
    {
        "title": "My first time making a latte and I accidentally made the Reddit icon 😂",
        "author": "Pancakeo9",
        "url": "https://i.redd.it/qrt5zyf6xgea1.jpg",
        "text": "",
        "created_utc": 1674755918,
        "upvote_ratio": 1.0
    },
    {
        "title": "Troubleshooting for moka pot",
        "author": "Immediate-Meaning-38",
        "url": "https://www.reddit.com/r/Coffee/comments/10lxx19/troubleshooting_for_moka_pot/",
        "text": "Hi folks!\n\nHope everybody's morning is good!\n\nI need advice on brewing with moka. I have just got my moka brewer (Italian, Princessa Lavazza model produced by some brand called Bolzano, 6cup), brewed the first time with it and got a problem. \n\nI brewed coffee first time with it following recipe of James Hoffman (put boiled water into water section, else - as he advises), and it started brewing like less than a minute after I put it on the stove (with very low fire)! Before I brewed with same method using Bialetti 3cup moka, and it took a while (with pre-boiled water) to brew. Here it was almost right after I put it, the coffee had weird color (a bit to blue side) and underextracted, altho not too bad.\n\nI am scared if that's the problem of the moka. Could it be? Or is it because I'm brewing first time with it? Or why should it happen?\n\nP.S. Bialetti is made of aluminum, and this is perhaps made of steel. Could that have a play?\n\nSorry, maybe that's a stupid question but i'm really perplexed, with appreciate help! Thanks!\n\nhttps://preview.redd.it/jfc58chqdfea1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=6b2ef6307990010585397ba5f01af25237123fb2",
        "created_utc": 1674755667,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where are beans best kept freshest? Hopper or in the bag?",
        "author": "Majesty1985",
        "url": "https://www.reddit.com/r/Coffee/comments/10lx9r7/where_are_beans_best_kept_freshest_hopper_or_in/",
        "text": "I’ve a long running internal debate over whether I should fill the hopper of my grinder with beans or to keep them in the bag and replenish with each use. \n\nI guess I just want to keep my beans as fresh as possible until they get used. I use Caribou coffee exclusively. Perfect for my budget.",
        "created_utc": 1674754038,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nothing beats freshly roasted coffee beans",
        "author": "GMKgirl003",
        "url": "https://www.reddit.com/r/Coffee/comments/10lx9qp/nothing_beats_freshly_roasted_coffee_beans/",
        "text": "If you love freshly roasted coffee beans, then you should check out Anchor &amp; Tree coffee roasting company. It’s based out of Sacramento, but they do ship. :)\n\nHere is a news article on them too. \n\n\nhttps://dailycoffeenews.com/2023/01/25/former-cropster-manager-launches-anchor-tree-coffee-in-sacramento/?fbclid=PAAaZDxiwiKsKg4G3w2PzA-UL4E-yGe8Tj-jMbDK1f8BTkwKL8xaJ77XQ135k",
        "created_utc": 1674754037,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone tried the flavor swirls at Dunkin’ Donuts? Some of them sound pretty good but I’m not sure which to try. I’m most intrigued by almond and caramel, but what’s your favorite?",
        "author": "Psychotic_incense",
        "url": "https://www.reddit.com/r/Coffee/comments/10lx1q3/has_anyone_tried_the_flavor_swirls_at_dunkin/",
        "text": "",
        "created_utc": 1674753475,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve grown to appreciate instant coffee",
        "author": "justinsdrown",
        "url": "https://www.reddit.com/r/Coffee/comments/10lwflh/ive_grown_to_appreciate_instant_coffee/",
        "text": "I’m sure it’s blasphemous here. But I first gained a taste for it during my years working as a security officer. You didn’t always have a coffee pot. Hot thermos and a single serve instant coffee packet? Now that’s easy to prepare for. What’s interesting is at first I wasn’t a fan. After a while there was something about the rugged taste that grew on me. Almost like camp food. You adjust your expectations and your brain is happy to have it. So there you have it. My confession. The instant coffee enjoyer has arrived.",
        "created_utc": 1674751964,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gaggia Classic: shots are too fast even with pressurized portafilter",
        "author": "dumbass_laundry",
        "url": "https://www.reddit.com/r/Coffee/comments/10lw8kq/gaggia_classic_shots_are_too_fast_even_with/",
        "text": "Recently got a Gaggia Classic Pro and I have a Baratza Encore grinder. I know the grinder isn't really meant to do espresso, but I figured that it would at least work with the pressurized basket.\n\nMy shots (even on the finest that my grinder can do and the pressurized basket) take about 10 seconds. I'm very lost.\n\nAny idea what my issue may be? Brewing with the regular basket is also fast since my grind isn't fine enough. Any advice to get up and running with something decent tasting would be much appreciated.",
        "created_utc": 1674751493,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] Show off your gear! - Battle-station Central",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/10lvs72/mod_show_off_your_gear_battlestation_central/",
        "text": "Let's see your battle-stations or new purchases! Tell us what it is you have, post pictures if you want, let us know what you think and how you use it all to make your daily Cup of Joe.\n\nFeel free to discuss gear here as well - recommendations, reviews, etc.\n\nFeel free to post links to where people can get the gear but please no sketchy deal sites and none of those Amazon (or other site) links where you get a percentage if people buy it, they will be removed. Also, if you want battle-stations every day of the week, check out /r/coffeestations!\n\nPlease keep coffee station pictures limited to this thread. Any such pictures posted as their own thread will be removed.\n\nThanks!",
        "created_utc": 1674750363,
        "upvote_ratio": 1.0
    },
    {
        "title": "21 Coffee Quotes To Enjoy With Your Morning Brew",
        "author": "Homegrounds",
        "url": "https://www.homegrounds.co/coffee-quotes/",
        "text": "",
        "created_utc": 1674749974,
        "upvote_ratio": 1.0
    },
    {
        "title": "My 2 grinder setup",
        "author": "mirceastr",
        "url": "https://i.redd.it/age2hmtkdgea1.jpg",
        "text": "",
        "created_utc": 1674749325,
        "upvote_ratio": 1.0
    },
    {
        "title": "What setup should I begin with?",
        "author": "Latte_lover_1987",
        "url": "https://www.reddit.com/r/Coffee/comments/10luxx2/what_setup_should_i_begin_with/",
        "text": "I am looking to start my coffee station setup and I am a bit hesitant on the choice. The two options that I am considering are the Breville Barista Express or the Gaggia Classic Pro. Based on online reviews those are the best two options as a starter, but I am open to other suggestions. Both fit my price range but there are a number of things to consider. I had a bad experience with a Breville Barista touch, where it did not reach brewing temperatures and was always pulling sour shots. So that makes me hesitant on choosing the Breville route again. However, if I go with the Gaggia then I will have to pair it with a grinder so I am open to suggestions. \n\nFew things that I read online in reviews and I am looking for help. The grinder on the Breville it seems is not the best, but would that make a big difference to a beginner? Considering that I mainly have milk based coffee drinks. Also does it make a difference in extraction that the Breville does not have the standard 58mm portafilter? Also in terms of getting tampers or a bottomless portafilter as an example?\n\nAnything else that I missed?",
        "created_utc": 1674748271,
        "upvote_ratio": 1.0
    },
    {
        "title": "You have very little time",
        "author": "Fit-Coffee-9172",
        "url": "https://www.reddit.com/r/u_Fit-Coffee-9172/comments/10lul4r/you_have_very_little_time/",
        "text": "[removed]",
        "created_utc": 1674747379,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ode Brew Grinder Gen 2 for Pressurized Basket Espreso",
        "author": "karabas_barabas",
        "url": "https://www.reddit.com/r/Coffee/comments/10lu8zw/ode_brew_grinder_gen_2_for_pressurized_basket/",
        "text": "I've spent weeks scouring this sub, other coffee subs, countless YouTube videos and realized that I don't have the money nor the patience to get an enthusiast/pro setup, tinker with settings, etc. I want as simple of a setup as possible while retaining good functionality. \n\nI have a cheap espresso machine with a pressurized basket that I will not be replacing any time soon. I make about 1 double shot every 2 days. Our primary drinking is French press. \n\nI know the Ode Brew Grinder Gen 2 isn't suitable for espresso, but that assumed a non-pressurized basket. Will it be fine for a pressurized basket? I don't have enough of a palette to distinguish between amazing shot and really good shot, so keep that in consideration.",
        "created_utc": 1674746510,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dark roast sample pack",
        "author": "Frosty-Goose2063",
        "url": "https://www.reddit.com/r/Coffee/comments/10lu1bz/dark_roast_sample_pack/",
        "text": "Looking to buy a dark roast coffee gift/sampler for a coffee lover. Any suggestions. Person likes dark roasts.",
        "created_utc": 1674745955,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cupping - is it the truth?",
        "author": "institutesynth",
        "url": "https://www.reddit.com/r/Coffee/comments/10ltz2d/cupping_is_it_the_truth/",
        "text": "Hello All,\n\nI'm a newbie to the homebrewing world, and I've started off with launching myself into v60 pour over. \n\nI recently purchased a bag of washed Ethiopian light roast beans. All my brews I have made have had the most fantastic aroma - bergamot/concord grape/lemon, yet the flavor has been severely underwhelming.\n\nEach brew I've been changing a variable at a time to no avail. It was suggested to me to try a cupping with the beans to find their flavor profile - and that's what I did. Again, the taste was quite lacking, some notable 'coffee' flavor and hints of black tea, but nothing I would describe as great or delicious.\n\nFor note, I am not trying to capture the aromas as taste, but more-so bring out some defined, perhaps interesting flavors.\n\nNow rather than trying to dial in this bean, is the cupping a true reflection of how the bean will taste when brewed correctly? Am I aiming for something that isn't there?",
        "created_utc": 1674745799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to buy espresso beans?",
        "author": "ChadleyChandler",
        "url": "https://www.reddit.com/r/Coffee/comments/10ltqyn/where_to_buy_espresso_beans/",
        "text": "I’m looking to order espresso beans online. What is the best company to order from when it comes to quality and price? Thanks :)",
        "created_utc": 1674745222,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffeefriend.de warning",
        "author": "Pomensch",
        "url": "https://www.reddit.com/r/Coffee/comments/10ltarq/coffeefriendde_warning/",
        "text": "For anyone thinking about ordering from them, dont! I purchased coffee from them for 80euros per Kilo and they send me 7 Month old coffee. After contacting the customer support they told me that its fine because its younger than a year and i have to cover for shipping if i want to return it. I am so pissed at them right now. Am i in the wrong ?",
        "created_utc": 1674744037,
        "upvote_ratio": 1.0
    },
    {
        "title": "My new shirt",
        "author": "FunParsnip6199",
        "url": "https://i.redd.it/fabrqgcweeea1.png",
        "text": "",
        "created_utc": 1674743573,
        "upvote_ratio": 1.0
    },
    {
        "title": "Affordable Hand Grinder",
        "author": "Weekly_Blueberry7570",
        "url": "https://www.reddit.com/r/Coffee/comments/10lt0zb/affordable_hand_grinder/",
        "text": "Hi Everyone,\n\nI'm looking for an affordable hand grinder to use with my Aeropress. Can you recommend some models for me to look at?\n\nAlso - any recommended sellers to order my beans from in the UK?  \n\n\nThanks",
        "created_utc": 1674743301,
        "upvote_ratio": 1.0
    },
    {
        "title": "Forgot to put water in my Mocha pot and melted the rubber gasket to the basket :(",
        "author": "QUERCUS_PTOLEMY",
        "url": "https://www.reddit.com/r/Coffee/comments/10ls6os/forgot_to_put_water_in_my_mocha_pot_and_melted/",
        "text": "How stupid was that?! All the coffee in the basket was burned and the gasket had started to melt. Luckily I realised what was happening in time and cooled the whole thing down under a cold tap. The kitchen smells of burned plastic now. Do we reckon my Bialetti is a write-off?",
        "created_utc": 1674740879,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is this grinder?",
        "author": "therowingconductor",
        "url": "https://i.redd.it/qccg8jwsnfea1.jpg",
        "text": "Does anyone have any idea what this grinder is? The only identifying feature I can see is the espresso Italians mark on the front but nothing else... Any help much appreciated!",
        "created_utc": 1674740653,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made an app that lets you alarm your laptop when you step away to order coffee",
        "author": "singhm11",
        "url": "https://www.reddit.com/r/Coffee/comments/10lrzzq/i_made_an_app_that_lets_you_alarm_your_laptop/",
        "text": "☕️ We've all been in a situation where we've had to leave our MacBook in a public place like a coffee shop or library, only to be left feeling anxious about the safety and having to ask strangers to watch our device.\n\nI’ve made an app that lets you alarm your MacBook when you go away to do something and if someone tries taking your laptop while you’re gone, it rings a loud alarm.\n\nYou can download me at www.getcly.de. I'd love to hear your feedback on how I can help you and any user experience suggestions you may have :) ❤️",
        "created_utc": 1674740327,
        "upvote_ratio": 1.0
    },
    {
        "title": "Game Dev Tycoon v1 Crack With Torrent Download Pc Game 2021",
        "author": "Character-Coffee-452",
        "url": "https://pcgamesbits.info/game-dev-tycoon-v1-crack-2/",
        "text": "",
        "created_utc": 1674737627,
        "upvote_ratio": 1.0
    },
    {
        "title": "(iced coffee) how do i get it all gradient looking ?",
        "author": "skrooe",
        "url": "https://www.reddit.com/r/Coffee/comments/10lr36w/iced_coffee_how_do_i_get_it_all_gradient_looking/",
        "text": "(I was following this video where it’s 1tbsp instant coffee + 1/4hot water. Pour milk then the coffee mix then add ice. )\n\nAlso I know nothing about coffee lol\nI followed the video process except I added the ice in last, but then it ended up looking nothing like in the vid, it all just blended together",
        "created_utc": 1674737491,
        "upvote_ratio": 1.0
    },
    {
        "title": "This product is so good Highly recommended got told about it a week ago it’s brilliant",
        "author": "Lucajack07",
        "url": "http://Thecoffeewarmer.com",
        "text": "",
        "created_utc": 1674736273,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sharing with my coffee enthusiast friends....",
        "author": "AthleticTiger",
        "url": "https://www.reddit.com/r/Coffee/comments/10lqjwl/sharing_with_my_coffee_enthusiast_friends/",
        "text": "Proud Mary, A coffee shop in Austin, Texas is offering an award winning batch of Black Jaguar Panama Geisha coffee that was purchased at auction for $2,000 lb.for $150 a cup. Only 22 cups are being offered.\n\nPanama Geisha coffee is consistently among the finest coffees in the world. I have purchased 50lbs. of a varietal for my Destination Coffee Club soft launch, 200ml bags will be available to buy this afternoon at a fraction of the cost. Check back!\n\n#Coffee #CoffeeTime #CoffeeLover #geishacoffee",
        "created_utc": 1674735653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Varia VS3 comparisons?",
        "author": "wiiiiktor",
        "url": "https://www.reddit.com/r/Coffee/comments/10lpt4c/varia_vs3_comparisons/",
        "text": "Anyone has done a solid side-by-side comparison on the Varia VS3 against the likes of Niche, and Eureka Oro single dose? Would be interesting to know more about how these compare. Alternative Brewing did a pretty good one, just want to see what some of you think who's done similar comparisons.",
        "created_utc": 1674732914,
        "upvote_ratio": 1.0
    },
    {
        "title": "Leaking Gaggia Classic?",
        "author": "chamelious",
        "url": "https://www.reddit.com/r/Coffee/comments/10lpimg/leaking_gaggia_classic/",
        "text": " \n\nMy GC leaks from the steam arm. Its a pain but probably not worth fixing for the hassle, unless the leak is liable to cause issues actually pulling shot, does it reduce/increase the pressure anything like that?",
        "created_utc": 1674731795,
        "upvote_ratio": 1.0
    },
    {
        "title": "[MOD] The Daily Question Thread",
        "author": "menschmaschine5",
        "url": "https://www.reddit.com/r/Coffee/comments/10lp9hz/mod_the_daily_question_thread/",
        "text": " \n\nWelcome to the daily [/r/Coffee](https://www.reddit.com/r/Coffee) question thread!\n\nThere are no stupid questions here, ask a question and get an answer! We all have to start somewhere and sometimes it is hard to figure out just what you are doing right or doing wrong. Luckily, the [/r/Coffee](https://www.reddit.com/r/Coffee) community loves to help out.\n\nDo you have a question about how to use a specific piece of gear or what gear you should be buying? Want to know how much coffee you should use or how you should grind it? Not sure about how much water you should use or how hot it should be? Wondering about your coffee's shelf life?\n\nDon't forget to use the resources in our [wiki](http://www.reddit.com/r/Coffee/wiki)! We have some great starter guides on our [wiki \"Guides\" page](https://www.reddit.com/r/Coffee/wiki/guides) and [here is the wiki \"Gear By Price\" page](http://www.reddit.com/r/Coffee/wiki/gear#wiki_coffee_gear_suggestions) if you'd like to see coffee gear that [/r/Coffee](https://www.reddit.com/r/Coffee) members recommend.\n\nAs always, be nice!",
        "created_utc": 1674730808,
        "upvote_ratio": 1.0
    },
    {
        "title": "Try this again.. wanting to start selling coffee online.. maybe..",
        "author": "GoPlugMeIn",
        "url": "https://www.reddit.com/r/Coffee/comments/10ln7zz/try_this_again_wanting_to_start_selling_coffee/",
        "text": "So.. for some reason.. my post earlier got removed.. cause /u/playinggrumsonmars claimed I was some nigerian dude scamming? Someone explain how asking about starting an online coffee business. if its over saturated or not.. and that I am a software engineer thus I can build my own site.. is somehow related to a scam or nigerian crap..?? I am baffled?\n\nDidnt even get a response as to why it was taken down.\n\nIs asking about possibly starting some sort of online coffee selling business not allowed?\n\nNot promoting anything. Not selling anything. Just asking about if its even worth trying or not.. if the market is oversaturated.. and if it is a potentially worthy idea.. how to source greens, etc for the best prices and get bag/labels made to sell coffee and ship in bags?\n\nIf that is offensive some how.. my apologies. I am a software developer.. I build enterprise web apps, etc. I mentioned that mostly to indicate that part of why I am thinking of this is the costs to create a web store/presence, etc.. is not a big issue for me as I know how to do a lot of that already.\n\nAt the very least.. if you're going to remove my post.. could you do me the decency of explaining what I violated or why? REally hope it wasn't because some response claimed I was a nigerian scam.",
        "created_utc": 1674721743,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rate my newbie setup (it's pre-ground decaf, I can't have caffeine)",
        "author": "goblinkate",
        "url": "https://www.reddit.com/gallery/10lmksl",
        "text": "",
        "created_utc": 1674718957,
        "upvote_ratio": 1.0
    },
    {
        "title": "JX Pro vs. JX Pro S?",
        "author": "691-2730",
        "url": "https://www.reddit.com/r/Coffee/comments/10ljrhm/jx_pro_vs_jx_pro_s/",
        "text": "On both Amazon and the JX Pro website, there are two different options for the JX Pro grinder: JX Pro, and JX Pro S. What is the difference? Is it just the color of the handle? I can't discern any other difference or find anything about this online. A different name for a color option seems strange..",
        "created_utc": 1674708475,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cupping has different taste from sipping?",
        "author": "venomoussquid",
        "url": "https://www.reddit.com/r/Coffee/comments/10ljbq0/cupping_has_different_taste_from_sipping/",
        "text": "I got these Sightglass Banner Dark beans, and when I was cupping I got the expected tastes, smoke, chocolate, caramel. However, out of curiosity I decided to sip from the cup instead of the spoon, it just tasted sour. Why am I getting completely different tastes?",
        "created_utc": 1674707033,
        "upvote_ratio": 1.0
    },
    {
        "title": "I miss coffee",
        "author": "blackhawk309",
        "url": "https://www.reddit.com/r/Coffee/comments/10lj67p/i_miss_coffee/",
        "text": "I absolutely love drinking black coffee, but the last couple of years, the caffeine has really got the best of me.\n\nIt’s odd, because I generally don’t feel that way if I drink other drinks with caffeine in it. It almost makes me feel like I can pass out, and I’m so jittery it just isn’t enjoyable.\n\nSure I could drink decaf, but maybe there’s something I’m not thinking of.\n\nLet me hear your thoughts, \nThanks!",
        "created_utc": 1674706544,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Perfect Cup of Coffee Every Time: A Review of the Nespresso Vertuo Next 11719 Coffee Maker Review",
        "author": "Appliances_Review",
        "url": "https://appliancesreview.co.uk/instant-cafe-quality-coffee-a-perfect-kitchen-companion-with-the-nespresso-vertuo-next-11719-coffee-machine/",
        "text": "",
        "created_utc": 1674705627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electric grinder making powder on coarse setting?",
        "author": "ckirby7",
        "url": "https://www.reddit.com/r/Coffee/comments/10li8ql/electric_grinder_making_powder_on_coarse_setting/",
        "text": "Hi, my electric burr grinder is set to the most coarse setting and it's making coarse grind plus some extra fine powder. Is this normal or is my grinder too low quality? I don't want the powder, obviously",
        "created_utc": 1674703639,
        "upvote_ratio": 1.0
    },
    {
        "title": "Used Coffee Ground to Coffee Liquor?",
        "author": "Ill-Pride-2312",
        "url": "https://www.reddit.com/r/Coffee/comments/10li4ox/used_coffee_ground_to_coffee_liquor/",
        "text": "I was scrolling through reels on IG when I came across a reel of the title. Does anyone have experience recycling used grounds this way?\n\nThe process was as follows: \nMix used grounds with some sort of sugar, wait, then pour vodka through it as if making coffee.",
        "created_utc": 1674703289,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just got an ad for this drip brewer on Instagram. Looks… vaguely familiar.",
        "author": "EATING--GARBAGE",
        "url": "https://simplygoodcoffee.com/products/the-olson",
        "text": "",
        "created_utc": 1674702427,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee Simp",
        "author": "Surrealopinion",
        "url": "https://www.reddit.com/r/Coffee/comments/10lhnjq/coffee_simp/",
        "text": "Check out my store, Coffee imp, where coffee addicts can buy merch. [https://coffeesimpca.etsy.com](https://coffeesimpca.etsy.com)",
        "created_utc": 1674701869,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best coffee machine for gift? Help.",
        "author": "cake_overdose",
        "url": "https://www.reddit.com/r/Coffee/comments/10lgs2y/best_coffee_machine_for_gift_help/",
        "text": "I'm looking for a coffee machine to gift my bf, problem is, I know nothing about them. \n\nNotes: \n-He drinks coffee all through out the day so something that can make and keep multiple cups worth would be nice. \n-He almost always only drinks black coffee so none of those capsules please. \n-He likes fresh ground coffee but the instant one is what he drinks almost always cause of time and convenience so if this could be solved by a machine... \n-Nothing too expensive please. \n\nPlease suggest brands or even what type of coffee maker to look for cause I am clueless.",
        "created_utc": 1674699275,
        "upvote_ratio": 1.0
    },
    {
        "title": "A healthy diet hack for coffee drinkers",
        "author": "Enviro-man",
        "url": "https://www.reddit.com/r/Coffee/comments/10lglb6/a_healthy_diet_hack_for_coffee_drinkers/",
        "text": "   This is a way for coffee drinkers to get more veggies in their diet.   Instead of using cream or half and half or soy milk, etc, try using regular V8 or high fiber V8 juice.   \n\nIt reduces the bitterness in coffee as well as milk products do.   Give it a try, I hope you enjoy it as much as I do.",
        "created_utc": 1674698725,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starting an online business.. feasible.. or too saturated..",
        "author": "GoPlugMeIn",
        "url": "https://www.reddit.com/r/Coffee/comments/10lgl6w/starting_an_online_business_feasible_or_too/",
        "text": "Hey all.\n\nI am a software engineer.. build SAAS/cloud apps, etc. I also have a few hobbies.. one of which is coffee. For a while now I've really enjoyed roasting beans of my own.. saves a bit of money.. with a couple of decent roasting machines.. I wouldn't mind roasting a few dozen lbs a day to sell. \n\nI am curious though.. as there are for sure a LOT of coffee options to buy bagged coffee beans (or ground).. is it just too stupid to think of doing something like this? The one advantage I have is I can build/deploy the site myself.. so I don't need to use some crappy GoDaddy or what not site.. though it would take me a bit of time to build the site.. it wouldn't be anything super fancy.\n\nAssuming that its not a horrible idea.. the other aspect is buying green beans to roast at as cheap a price (without being crap quality) I could.. and I assume to buy coffee bags with logo/details/etc that I would put the roasted beans in and sell. There would be shipping as well.\n\nI usually seem to buy green beans from a few places.. but they also sell coffee beans (roasted).. so not sure I could resell their beans. Plus.. I would rather source direct and bypass them if possible.. to save money. Any idea how to source green beans right from farmers.. or is there some distribution process that most resellers go to?\n\nCoffee bags.. I've found a bunch of those vinyl (I think..or plastic) bags with foil or so interior, little air gap thingy on it.. and bought a sealer.. and has a zip thingy on it to open it. But those wouldn't work obviously for some sort of \"retail\" online coffee selling. So I assume I'd want to find someone that can print a logo, details like 1lb, 5lb, etc.. name/etc for bags. Any thoughts where to get that done and likely in bulk?\n\nThen there is cost. The green beans alone run me like $6 a lb right now. Plus energy/time to roast, weigh and bag.. and then the cost of the bags to put them in.. and then shipping. I feel like it would run about $10 to $12 with no profit for a 1lb bag. 5lb and 10lb would probably be more profitable I assume.. given the same cost for roasting and bags.. assuming I can roast 5lbs at a time of the same beans in the same manner.\n\nHonestly.. just looking to do this as a side thing. But.. to be transparent.. if it wasn't going to earn me the equivalent of about 100K a year (full time) or more in profit.. which is what I would need to survive where I live (after taxes mind you).. I don't know that it would be worth all the manual work.\n\nI read that coffee carts/trucks are extremely profitable.. but given the cost of a truck/van (looked up a 30 year used one for like 50K.. wtf..), gas, and literally having to manually work the process.. but also find the right spot to be able to sell enough to make it worth the costs.. I would think selling bags of coffee online might be more profitable.\n\nAlright.. that's all I can think of. Anything else any of you know of.. think of.. ??",
        "created_utc": 1674698715,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Painted a Coffee Bean ☕",
        "author": "matthewgoetzka",
        "url": "https://i.redd.it/lvuphzao6cea1.png",
        "text": "",
        "created_utc": 1674698574,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for some darker roast bean rec's for espresso",
        "author": "arvint1",
        "url": "https://www.reddit.com/r/Coffee/comments/10lgadm/looking_for_some_darker_roast_bean_recs_for/",
        "text": "Hey guys, \n\n(Before I post I did do some digging on reddit too see past recommendations) but curious to see what people have been having good luck with as sadly I don't have a roaster close enough to me to grab fresh beans from. I have tried Black and White's \"the traditional\" and while it has been AMAZING in my v60 pour over, using espresso (using a breville bambino) no matter what I do I just can't get it to stop being uncomfortably sour (unless I pour an extremally long shot) . My sister had some random dark roast costa rica beans from the world market (no roast date on them) so who knows how stale they are but i ground them up and pulled a shot and it was leagues beyond anything I tried (not trying to hit on black and white's coffee, I absolutely love it in my pour over setup). The traditional from black and white is medium-dark roast, but the world market one is a pretty dark roast coffee which I guess tells me that my palate prefers a more dark roast coffee. I seem to not enjoy acidity too much but that chocolaty/vanilla/sweet/maybe even a tiny bit burnt taste I do seem to enjoy (not too much on the burnt). Was curious if anyone had any recommendations for good dark beans I could order online that are pretty fresh from the roaster? My grocery stores do have some but the roast dates are always around 4 weeks ago which I feel like is a bit too old, if i'm not mistaken. \n\nTl;dr looking for a dark roast coffee bean rec, i prefer chocolate/vanilla/maybe even a little burnt taste but not too much on that, have no access to fresh beans close to me so looking for an online roaster/source.\n\nThanks so much!!",
        "created_utc": 1674697859,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Is the Best Way to Learn Latte Art?",
        "author": "radbrutter",
        "url": "https://www.reddit.com/r/Coffee/comments/10lfn9v/what_is_the_best_way_to_learn_latte_art/",
        "text": "I'm struggling to get the foam to be heavy enough maybe? Not sure how to get foam that makes the top white but also can push other stuff out of the way if that makes sense ",
        "created_utc": 1674696004,
        "upvote_ratio": 1.0
    },
    {
        "title": "Comandante C40 for espresso.",
        "author": "KingJoe92",
        "url": "https://www.reddit.com/r/Coffee/comments/10lfkm8/comandante_c40_for_espresso/",
        "text": "[removed]",
        "created_utc": 1674695794,
        "upvote_ratio": 1.0
    },
    {
        "title": "POWER",
        "author": "ExceptionalXDesign",
        "url": "https://www.reddit.com/r/Coffee/comments/10lfi0f/power/",
        "text": "[removed]",
        "created_utc": 1674695587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moka Pot Caffeine Content Analysis and Discussion",
        "author": "Fourskin44",
        "url": "https://www.reddit.com/r/Coffee/comments/10lff5n/moka_pot_caffeine_content_analysis_and_discussion/",
        "text": "How much caffeine, in milligrams, is there in a 3-cup Bialetti brewed with Cafe Bustelo? I'm getting very mixed answers in my research, and I prefer to be precise about the amount of caffeine that I consume daily. Thanks, all.",
        "created_utc": 1674695362,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am trash and I like cold brew. How can I make mine taste like Stok?",
        "author": "CostcoDogMom",
        "url": "https://i.redd.it/hogi70mfsbea1.jpg",
        "text": "",
        "created_utc": 1674693795,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to start a ice coffee Buisness from home?",
        "author": "Wangbodyalex",
        "url": "https://www.reddit.com/r/Coffee/comments/10let1p/how_to_start_a_ice_coffee_buisness_from_home/",
        "text": "I'm in NC and would like to sell coffe from glass bottles. Maybe on a small level first. Do I really need all the license &amp; permits before getting my feet ( toes really) wet in the game ? It's not realistic",
        "created_utc": 1674693638,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to start a coffe business from home (cold) what should I start with? and any tips on how to make",
        "author": "Wangbodyalex",
        "url": "https://www.reddit.com/r/Coffee/comments/10leaes/i_want_to_start_a_coffe_business_from_home_cold/",
        "text": "",
        "created_utc": 1674692236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Delicious",
        "author": "Ok_Educator_1741",
        "url": "https://i.redd.it/xwyqcb8aibea1.jpg",
        "text": "",
        "created_utc": 1674690372,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting the inflation coffee cup narrative right",
        "author": "trumpfamily2020",
        "url": "https://old.billionaireclubcollc.com/getting-the-inflation-coffee-cup-narrative-right/",
        "text": "",
        "created_utc": 1674687316,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roaster spotlight: Friedrichs Coffee Roasters out of Des Moines, Iowa. A favorite of mine for their incredible quality, great selection, and fantastic pricing.",
        "author": "rightinthepujols",
        "url": "https://i.imgur.com/eTtXgdr.jpg",
        "text": "",
        "created_utc": 1674686811,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to make hotel breakfast style of coffee?",
        "author": "DK4427",
        "url": "https://www.reddit.com/r/Coffee/comments/10lc31i/how_to_make_hotel_breakfast_style_of_coffee/",
        "text": "I know this is a bit unusual question, but lately I was wondering how they make coffee in big hotels. That kind that looks quite like americano, maybe a bit on a weak side, and has a very distinctive taste. You can usually pour it from canisters with air pumps. \n\nI tried preparing something similar with all sorts of methods (filter, french press, cooking ground coffee... Turkish style etc.) but can't get even remotely close to that distinctive taste. \nHas anyone have any experience or knowledge about this?",
        "created_utc": 1674686583,
        "upvote_ratio": 1.0
    },
    {
        "title": "Time for a grinder upgrade.",
        "author": "ezypee",
        "url": "https://www.reddit.com/r/Coffee/comments/10laqri/time_for_a_grinder_upgrade/",
        "text": "As per the title, my Hario Skerton PRO, while a good entry level grinder, isn't cutting it. The grinds are either too small or too big, it takes forever to grind a pussy little 30 grams and the lack of and actually grind setting is a lot when you're constantly making pour overs and cold brew. \n\nI've settled on one of the 1zpresso hand grinders (yes I do like grinding by hand, just not for 2 minutes per brew), and from what I can tell the grinding burrs are exactly the same across all of the models, it's just some have more QOL features. \n\nDoes anyone have any experience with the different models? I'm curious as to whether the K-Max is really worth the extra $100 to $200 or if it's just a mark-up for suckers, of which I definitely have an aptitude for. \n\nThanks in advance.",
        "created_utc": 1674683277,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a make, brand of this coffee maker.",
        "author": "MrTelly",
        "url": "https://i.redd.it/98tthrdptaea1.jpg",
        "text": "",
        "created_utc": 1674682106,
        "upvote_ratio": 1.0
    },
    {
        "title": "Braun coffee multi serve coffee maker",
        "author": "jwsassy1",
        "url": "https://www.reddit.com/r/Coffee/comments/10l9x5g/braun_coffee_multi_serve_coffee_maker/",
        "text": "I just took new coffee maker out of box today that I got for Christmas same problem.  Finally took a bike air pump &amp; used it to see what happened wow it worked go figure. Tried the straw, turkey baster didn't work.",
        "created_utc": 1674681261,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best home coffee machine for a gift?",
        "author": "cake_overdose",
        "url": "https://www.reddit.com/r/Coffee/comments/10l9jpa/best_home_coffee_machine_for_a_gift/",
        "text": "I'm looking for a coffee machine to gift my bf, problem is, I know nothing about them. \n\nNotes: \n-He drinks coffee all through out the day so something that can make and keep multiple cups worth would be nice. \n-He almost always only drinks black coffee so none of those capsules please. \n-He likes fresh ground coffee but the instant one is what he drinks almost always cause of time and convenience so if this could be solved by a machine... \n-Nothing too expensive please. \n\nPlease suggest brands or even what type of coffee maker to look for cause I am clueless.",
        "created_utc": 1674680382,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got this random ad today figured I would see what y'all thought promising or novelty?",
        "author": "d1yb",
        "url": "https://youtu.be/7qfmun0oejc",
        "text": "",
        "created_utc": 1674680073,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best pourover to carry in local shop",
        "author": "tryingmybestonoddday",
        "url": "https://www.reddit.com/r/Coffee/comments/10l9b0c/best_pourover_to_carry_in_local_shop/",
        "text": "Coffee shop owners, baristas, and enthusiasts: what kind of pour over or other coffee makers do you carry in your store that sell the best? What would you like to see being sold?\n\nCurrently carrying Chemex, Melitta, Hario V60, and Aeropress. Looking to switch things up. Maybe introduce a French press.",
        "created_utc": 1674679783,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does putting 10 tea spoons of instant coffee in 1 cup and drinking have any affect",
        "author": "Kaden766",
        "url": "https://www.reddit.com/r/Coffee/comments/10l980e/does_putting_10_tea_spoons_of_instant_coffee_in_1/",
        "text": "",
        "created_utc": 1674679574,
        "upvote_ratio": 1.0
    },
    {
        "title": "i need this shirt",
        "author": "Shirtsamazon",
        "url": "https://i.redd.it/yghzkwn049ea1.jpg",
        "text": "",
        "created_utc": 1674679495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Let's try",
        "author": "Exciting-Coffee-5146",
        "url": "https://www.reddit.com/r/u_Exciting-Coffee-5146/comments/10l89si/lets_try/",
        "text": "Let's try",
        "created_utc": 1674677250,
        "upvote_ratio": 1.0
    },
    {
        "title": "My KinGrinder didn’t fit inside my plunger like some others, so I made an adaptor to use the grinder itself as a plunger",
        "author": "im_cleaner",
        "url": "https://imgur.com/a/DyzXiOB/",
        "text": "",
        "created_utc": 1674674392,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just read the weirdest Money Diary in Refinery29. This person drinks an inordinate amount on coffee…",
        "author": "human_of_reddit",
        "url": "https://www.reddit.com/r/Coffee/comments/10l6x5r/just_read_the_weirdest_money_diary_in_refinery29/",
        "text": "Hypnotist - £78k a year - Shropshire\n\nMonday\n\nI immediately spend £450 on coffee and instantly regret it. I didn’t need 100 coffees. I manage to drink about 24 of them before I’m immediately rushed to hospital. My stomach is pumped and I feel a lot better. I tip the doctor £25 and make my way to work.\n\nI hand out the remaining 76 coffees to my fellow employees and I’m rewarded with a pay rise. I’m now on £79k a year. You know what that means? Time for a coffee! \n\nI order one coffee and then about 40 more. After drinking about 12 of them, I start to feel weird again and ring in sick.\n\nFor dinner, my partner makes espresso martinis. I down about 5 before falling soundly to sleep.\n\nTotal spent - £16k (forgot to mention that I bought a brand new Toyota Prius)\n\nTuesday \n\nI find £500 by the side of the road and immediately invest it. By lunchtime, I’m worth £250m. By late afternoon, I’ve lost it all.\n\nI’m going out for dinner tonight at Costa Coffee. It’s me and the girls. To save money, we sneak alcohol in and neck it in the toilets. I buy around 30 ham and cheese paninis and tip the barista about £50.\n\nTotal spent - £1230\n\nWednesday \n\nIt’s the first day of the trial and I’m feeling anxious. I hand out some left over paninis to my legal team and we work on my alibi.\n\nI’m looking fresh in a Chanel dress I picked up for £40k from the local market.\n\nIt’s a tough morning of cross examination and I cheer myself up with...COFFEE! I make my way to Cafe Nero and order myself 200 Lattes with oat milk. I’m starting to feel queasy after the first 28 or so and tell the judge that I won’t make it back for the afternoon.\n\nThat does NOT go down well and I’m taken to the local jail for being in ‘contempt of court’.\n\nAfter a quick bribe, I escape jail and my partner picks me up outside Starbucks where I stock up on Americanos. Annoyingly the Prius only has 1 cup holder so I put the other 70 in the boot.\n\nThey spill everywhere and my partner swiftly divorces me. Between the trial and the divorce, I start to feel a bit down and cheer myself up with a couple of Espressos made from my new coffee machine.\n\nTotal Spent - £25k (legal fees and forgot to mention that I bought 12 coffee machines)\n\nThursday\n\nReally not in the mood for court today but the judge is insisting. I swing by the local cafe and stock up on Mochas. This is going to be a LONG day.\n\nAfter the first 16 Mochas, my vision starts going a bit blurry and I can barely concentrate on the forensic evidence. I need to get my head straight so I order a peppermint tea... and 50 cappuccinos. But weirdly, the more coffee I have, the more jittery and nervous I get.\n\nI’m eventually found not guilty or maybe it was guilty. I barely remember.\n\nI come home to find that my partner has cleared out the apartment. He’s taken everything... including the coffee machines.\n\nI load up my rifle and go looking for him..\n\nTotal Spent - £12\n\nFriday\n\nIt’s the dead of night and I can barely feel the heavy rain that’s beating down on my head. I’ve found my partner or should I say ex-partner.\n\nHe’s already moved on - he’s on a date with a leggy blonde in a nearby Pret. He’s already on his 4th flat white. It must be going well.\n\nI press my face up against the window and remember when we used to go to Pret. It feels like yesterday and a million years ago at the same time. Could I really go through with this?\n\nBefore I have time to answer the question, a smiling Pret employee hands me a dozen black coffees. ‘But I didn’t order this’ I say to her. ‘It’s from the man in there’ she says.\n\nI look back at my partner and he’s looking right at me. He smiles warmly and raises his coffee cup. I raise mine too.\n\nHe’s moved on and so have I. Sometimes we mourn the end of relationships rather than celebrate the time we had together. Just because it ended, it doesn’t mean the relationship wasn’t successful.\n\nI fire off a couple of rounds into the night sky and smile to myself. Maybe I’ll get myself a small tea :-)\n\nTotal spent - £250k (bought a lovely 3 bed a couple miles south of Shropshire)",
        "created_utc": 1674674108,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you pay $150 for a cup of coffee?",
        "author": "WorkSpeed",
        "url": "https://www.reddit.com/r/Coffee/comments/10l6pza/would_you_pay_150_for_a_cup_of_coffee/",
        "text": "[https://www.statesman.com/story/entertainment/local/2023/01/25/proud-mary-austin-coffee-black-jaguar-geisha-hartmann-estate-panama/69840474007/](https://www.statesman.com/story/entertainment/local/2023/01/25/proud-mary-austin-coffee-black-jaguar-geisha-hartmann-estate-panama/69840474007/)\n\nProud Mary will be selling eleven 8-oz cups of coffee at $150 each in Austin and Portland.  Has anyone ever tried such an expensive cup of coffee like this before?  What was your experience with it?",
        "created_utc": 1674673638,
        "upvote_ratio": 1.0
    },
    {
        "title": "Freshly bought coffee becoming stale very quickly....",
        "author": "greenkomodo",
        "url": "https://www.reddit.com/r/Coffee/comments/10l5t98/freshly_bought_coffee_becoming_stale_very_quickly/",
        "text": " I seem to be getting an issue with my beans going stale very quickly. I lived in different countries and bought from many different roasters and when I open the bag it smells so fresh and with all the flavours. Give it a few days or maybe a week and the beans smell like they have gone bad. I always keep them in the original bag and am so careful to seal it 100%. I have also tried those glass tupperware containers but I think its the same issue.  The proof is in the brews as there is basically no flavour anymore. Any tips?",
        "created_utc": 1674671526,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ouch",
        "author": "spuddenly",
        "url": "https://i.redd.it/fveoxt0px9ea1.png",
        "text": "",
        "created_utc": 1674671339,
        "upvote_ratio": 1.0
    },
    {
        "title": "Judge my coffee recipe?",
        "author": "Duckman93",
        "url": "https://www.reddit.com/r/Coffee/comments/10l560x/judge_my_coffee_recipe/",
        "text": "Hopefully this is allowed. \n\nI’d like critique on my current coffee making process. I’m a complete amateur and am looking to improve. I get very confused my (in my head) confusing ratios and recommendations.\n\nCurrently I use a Chemex, baratza encore, and cheap kettle (not temp controlled). I don’t use a scale\n\nGrind setting of 20 on the encore, I use 1 tbsp per 8oz of coffee. \n\nThoughts?",
        "created_utc": 1674670025,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me choose a better hand grinder",
        "author": "TemperanceTarotXIIII",
        "url": "https://www.reddit.com/r/Coffee/comments/10l3xid/help_me_choose_a_better_hand_grinder/",
        "text": "Hello guys,\n\nI've been using my Hario MSS-1 for more than one year now but I would love to upgrade my hand grinder with something with a higher grind size consistency - too big difference in the Hario; at the same time, I'm on a budget, €100 (alo because I would like to buy a Clever Dripper as well lol). I looked around eshops here in Greece and found a couple of nice ones: Timemore C2 (between €80 and €100), Rhino Hand Coffee Grinder (around €60). I'm not sure if there's much more. I could even buy it from abroad, if I'm able to stay in my budget but buying locally would be more comfortable. Thanks in advance!",
        "created_utc": 1674667098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee Machine Recommendation",
        "author": "Responsible-Math2227",
        "url": "https://www.reddit.com/r/Coffee/comments/10l3rt9/coffee_machine_recommendation/",
        "text": "My Keurig broke the other day, and I would love to make my own drinks (perhaps with espresso). Are there any inexpensive ones that are pretty user friendly? What do you recommend?",
        "created_utc": 1674666694,
        "upvote_ratio": 1.0
    },
    {
        "title": "Durable Travel thermos that doesn't leave a metallic taste?",
        "author": "CilariousHunt",
        "url": "https://www.reddit.com/r/Coffee/comments/10l3pwz/durable_travel_thermos_that_doesnt_leave_a/",
        "text": "So I'm now working more frequently from the office, issue is the office coffee is awful (common problem I hope) and I was wanting to bring in my own in a thermos which I can drink en route and in the office. I'm too self conscious to take a grinder and make all that noise before that's asked. Problem is all my travel flasks are lined with what I'm assuming is steel on the inside and it leaves a metallic taste with the coffee when I do drink it, not ideal.\n\nAnyone got any recommendations for something which would make this a non issue? Ability to store at least 500mls of coffee and being easy to clean  is a must, dishwasher safe would be a bonus but not necessarily if it is really simple to clean.",
        "created_utc": 1674666559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ceramic V60 Pre-Heating Hack",
        "author": "Eppit",
        "url": "https://www.reddit.com/r/Coffee/comments/10l3od4/ceramic_v60_preheating_hack/",
        "text": "The ceramic V60 is known to require lots of pre-heating due to its high thermal inertia. Basically, its really good at retaining its temperature, so if not adequately preheated it will actively cool your coffee bed while brewing.\n\nHoffman talks about this in his updated V60 single cup brew guide, noting that simply pre-rinsing the filter with your brewing water isn't sufficient to pre-heat the V60. He recommends running it under a tap beforehand, which I tried, but at least with my kitchen setup, uses a lot of water, takes additional time, and adds extra steps (literally and figuratively).\n\nIn search of a better method, I tried just putting the V60 on my kettle (I use a Fellow, which fits the V60 perfectly) with the kettle lid in the V60 while heating the kettle. Now the steam from the kettle pre-heats the V60 while it is getting up to temperature!\n\nThis was such an aha moment for me, partially because it is so stupidly simple, but also it turns what was previously a flaw into a feature. I place the V60 on, walk away and forget about it, when I'm ready to brew the V60 is nice and hot. Further, now that thermal inertia is actually working in my favor, actively heating the coffee bed to keep it at temperature I want.\n\nI only occasionally pop in here, so apologies if this is already well known (it seems so obvious in hindsight), but if it isn't, this was too good not to share.",
        "created_utc": 1674666452,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reduce static mess in Fellow Ode by touching the catch|cup during grind",
        "author": "edwardog",
        "url": "https://www.reddit.com/r/Coffee/comments/10l365x/reduce_static_mess_in_fellow_ode_by_touching_the/",
        "text": "Since purchasing a Fellow Ode I’ve had issues with static causing fines to cling to the underside of the grinder and make a mess.\n\nI’ve tried sprinkling in water and it helps but still noticed that when I touched the catch|cup after grinding, I could perceive a static shock.\n\nIt got me thinking: “if my body can be a big enough sink for the charge imbalance in this thing to want to balance out with me and it can conduct well enough that it happens by just touching it after… what if I touch it during operation to behave as a ground?”\n\nExperiment conclusion: it works for me.\n\nTL;DR Fellow Ode works better when you hold its hand while grinding.",
        "created_utc": 1674665227,
        "upvote_ratio": 1.0
    },
    {
        "title": "1zpresso JX Pro",
        "author": "_makoccino_",
        "url": "https://www.reddit.com/r/Coffee/comments/10l2fz7/1zpresso_jx_pro/",
        "text": "I've had this grinder for over a year now and very happy with it. However, last few days, the burrs, central shaft, everything just fall apart mid grinding. \n\nI took it apart to clean it and make sure nothing is broken. When I did that I noticed that the sliding column had peeled off a couple of the metal rings on it.\n\nSo my questions are:  \n\na) is that normal  \nand  \nb) is that why it falls apart\n\nI wanted to order a new sliding column but it's not in stock. So I have to dust off my old crummy Cuisinart grinder for now.",
        "created_utc": 1674663433,
        "upvote_ratio": 1.0
    },
    {
        "title": "Assassins Creed Odyssey Crack With Torrent Download Pc Game 2021",
        "author": "Character-Coffee-452",
        "url": "https://pcgamesbits.info/assassins-creed-odyssey-crack-3/",
        "text": "",
        "created_utc": 1674662823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was gone for a week, came home and coffee beans looked like this:",
        "author": "Woah-Kenny",
        "url": "https://i.redd.it/wfkrzjnq79ea1.jpg",
        "text": "Anybody know what that is. Never seen anything like it. It's got a spicy smell. Kinda reminds me of that tamarind they use for Mexican candy.",
        "created_utc": 1674662614,
        "upvote_ratio": 1.0
    },
    {
        "title": "Toddy Cold Brew Tips",
        "author": "samgocubsgo",
        "url": "https://www.reddit.com/r/Coffee/comments/10l1qet/toddy_cold_brew_tips/",
        "text": "Hey all, I’ve had my Toddy Coffee maker for a while now and love it but curious what recipes, tips, grounds, etc. others have had success with?\n\nFor the longest time, I just do 12 Oz of grounds, 7 cups of water and then take 1/2 cup of the cold brew it makes with 1/2 cup water and 1/2 cup oat milk. \n\nLove it but always looking for inspo to change things up",
        "created_utc": 1674661728,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ratio 8 - Brews as good as it looks!",
        "author": "Or1skiny",
        "url": "https://imgur.com/a/frOjFop",
        "text": "",
        "created_utc": 1674661677,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee to poop!! Method diffrences",
        "author": "kenshinkan08",
        "url": "https://www.reddit.com/r/Coffee/comments/10l12sr/coffee_to_poop_method_diffrences/",
        "text": "Besides the fact I'm addicted to caffeine and I need the fix to feel normal I drink it when I get up right before work to poop everyday. Here lately I have beenot doing that and I hate having to randomly poop at work or throughout the day I like it planned Because I am taking my breaks early just to do that I had a simple question. I've always used the drip coffee maker making a heaping scoop 3 tablespoons with Folgers or some other basic coffee. I bought an arrow press 1st because I wanted to lower the acidity At 175 like the inventor but I end up never doing it because I'm trying to get the best food possible and feel like that will make it not as effective now I'm thinking of getting a source for a soul but basically I just want to know what method is the best way to brew specifically for pooping.  Drip strong arrow press expresso,  Also in curious the amount of grounds used how that affects it and decalf if anyone has any experience with that I'm very sensitive to caffeine plus I heard if you take too much caffeine that will dry your stool",
        "created_utc": 1674660058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I the asshole",
        "author": "2023st",
        "url": "https://www.reddit.com/r/Coffee/comments/10l0q6o/am_i_the_asshole/",
        "text": "Am I the ass hole for dropping my friend that is saying that I can’t talk about my ex when I just want to talk to my other friend. Let’s call the first friend,A and the other friend, P. And the “ Asian trio I was adopted in” and now she is the whore in this situation. Our freshman year she went around our entire school and either slept or fucked almost every single guys here. So am I an asshole??",
        "created_utc": 1674659163,
        "upvote_ratio": 0.5
    },
    {
        "title": "Is this the right size grind for aeropress?",
        "author": "RobbieC333_",
        "url": "https://www.reddit.com/gallery/10l0onv",
        "text": "",
        "created_utc": 1674659056,
        "upvote_ratio": 1.0
    },
    {
        "title": "Worship Coffee.",
        "author": "Jumpy_Ocelot5753",
        "url": "https://i.redd.it/xo0tidry77ea1.jpg",
        "text": "",
        "created_utc": 1674656478,
        "upvote_ratio": 1.0
    },
    {
        "title": "(OC)Worship Coffee.",
        "author": "Jumpy_Ocelot5753",
        "url": "https://i.redd.it/4u54xb8p77ea1.png",
        "text": "",
        "created_utc": 1674656399,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee Grinder Advice",
        "author": "DimkaBelikov",
        "url": "https://www.reddit.com/r/Coffee/comments/10kznfn/coffee_grinder_advice/",
        "text": "Hi all!\n\n&amp;#x200B;\n\nLooking to take the plunge and upgrade from my cheap electric grinder to something a bit more consistent. Looking into my budget, I see everyone recommending the Baratza Encore, which normally is $170 give or take. I also saw a lot of good reviews about the Baratza Virtuoso+ for $250. I now come to realize that the Encore is $120 on Amazon and I was wondering if it was worth it to pick up the Virtuoso for pretty much more than double the price of the Encore, or if there's a better grinder that serves as a middle ground between them?\n\nMy main use for it is for pour-overs and ideally eventually some okay espressos. I know neither is particularly good for espresso, but my machine isn't really anything top notch either. I really want it to be electrical too, my wife has very little patience for manual grinders :P\n\n&amp;#x200B;\n\nThanks for your input!",
        "created_utc": 1674656299,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just wanted to share my most fav one!!",
        "author": "Jumpy_Ocelot5753",
        "url": "https://i.redd.it/rft5xt6w67ea1.png",
        "text": "",
        "created_utc": 1674656122,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Morning Ritual",
        "author": "LarryMartinez785",
        "url": "https://teesdesk-usa.com/the-morning-ritual-coffee?s=hanes-5250&amp;c=Maroon&amp;p=FRONT",
        "text": "",
        "created_utc": 1674654631,
        "upvote_ratio": 1.0
    }
]