[
    {
        "title": "New beans. First time trying koji fermented coffee.",
        "author": "luag",
        "url": "https://imgur.com/a/aiO6pji",
        "text": "",
        "created_utc": 1676539997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just had a caffeine overdose",
        "author": "Flimsy_Hovercraft907",
        "url": "https://www.reddit.com/r/Coffee/comments/113lic6/just_had_a_caffeine_overdose/",
        "text": "This will sound very stupid, but yesterday I was making myself a cold brew. I was using a recipe with 16oz water to 84g coffee. Well, I don't really weigh my coffee, and I had this scoop which said that it was 7g of coffee beans completely filled. So I thought I'd just use that, but here's where I mess up. Instead of measuring the coffee first, I just ground a whole lot of it, and then proceeded to measure it. Meaning that I added 12 scoops (7 * 12 = 82{close enough}) of ground coffee. It feels so stupid to me now that I didn't think that grinding the coffee first would just mess the scoop up, and God knows how many g of coffee ended up in that cold brew. But whatever amount it was, I drank it first thing in the morning the next day. Soon I had all the typical symptoms of overdose, my heart rate was up, I was feeling super nauseous. Thank God it didn't get any worse. I guess I learnt my lesson then, curse these scoops, I'll use a proper scale next time.\n\nP.S. I'm also 14 so I guess that makes it even worse",
        "created_utc": 1676535005,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nanopresso bitter shots",
        "author": "Toblerone7272",
        "url": "https://www.reddit.com/r/Coffee/comments/113jzni/nanopresso_bitter_shots/",
        "text": "I recently got a nanopresso with the barista kit and had made a handful if great shots (from what I can tell). A couple days ago however, a shot came out very bitter and maybe sour. Since then I can not make a good tasting shot. I have read other posts about this and have tried everything from changing grind size, water temp, roast, brew time and ratio. I have not been able to make a shot that I can enjoy. The problem is I don't know what I did differently as I used to be able to make good shots. Anyone who has experience with this would be very helpful. \nBTW: I am very new to this whole thing if you couldn't tell, anything helps.",
        "created_utc": 1676529003,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advantages of Cafec Abaca over V60 untabbed",
        "author": "KBDFan42",
        "url": "https://www.reddit.com/r/Coffee/comments/113j5x0/advantages_of_cafec_abaca_over_v60_untabbed/",
        "text": "What are some of the advantages that the Cafec Abaca has over the regular V60 untabbed? I see the Abaca being recommended a lot here so I’m considering switching.",
        "created_utc": 1676526021,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mundo cafeína ☕",
        "author": "alejandra_ute",
        "url": "https://i.redd.it/sxg52no5oiia1.png",
        "text": "",
        "created_utc": 1676520499,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for recommendations ☕️",
        "author": "nuvsbjorkadork",
        "url": "https://www.reddit.com/r/Coffee/comments/113han5/looking_for_recommendations/",
        "text": "My mom drinks coffee most mornings, and she always uses coffee mate brand vanilla creamer. While I'm not knocking it, I have been trying to convince her to switch to a healthier alternative, but she's worried it won't taste as good or be as sweet. Does anyone have recommendations for healthier coffee creamer that's still sweet? ☕️ (any kind, dairy or non- dairy ❤️ )",
        "created_utc": 1676519651,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grinder Reccomendations?",
        "author": "philmon64",
        "url": "https://www.reddit.com/r/Coffee/comments/113h7kn/grinder_reccomendations/",
        "text": "A few years ago I bought a repro Kitchenaid A9 grinder.  I thought it was a cool, powerful, retro looking grinder, and I felt it worked pretty well.   \n\n\nRecently, I've started paying more attention to my coffee variables and I've noted that it doesn't grind terribly evenly  I've now done an experiment and I think actually it's rather bad.  This is the same grind, but I ran it through a sifter into two piles ... the stuff that made it through the sifter, and the stuff that didn't.  \n\n\nFirst ... anybody else out there have an A9?  What is your experience?  Any ideas what I could do about this?  \n\n\nSecond, what's out there for  a home grinder that gives an adjustable, reasonably  even grind?  Reccomendations?\n\nhttps://preview.redd.it/46u4ohgc2hia1.jpg?width=972&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=450836d8c1a337d5575475c3f4816dd83c1c7c0d",
        "created_utc": 1676519368,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grinder reccomendations",
        "author": "philmon64",
        "url": "https://i.redd.it/p276r3461hia1.jpg",
        "text": "",
        "created_utc": 1676518651,
        "upvote_ratio": 1.0
    },
    {
        "title": "wangwind (@wangwind)’s videos with original sound - wangwind",
        "author": "howieecomm",
        "url": "https://www.tiktok.com/t/ZTRtCyfkG/",
        "text": "",
        "created_utc": 1676516369,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any experience with heycafe h1?",
        "author": "beezylito",
        "url": "https://www.reddit.com/r/Coffee/comments/113eynh/any_experience_with_heycafe_h1/",
        "text": "I want to upgrade from my Urbanic 070s and am considering the Heycafe H1. I make espressos half the time and Hario v60s the other half.\n\nDoes anyone have experience with the Heycafe h1?",
        "created_utc": 1676512465,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Specialty Bean] I saw some of the bean descriptions referred CQI and ICP Score. Can I use that to be considered to buy the good cup of coffee ?",
        "author": "Fuse_monogatari",
        "url": "https://www.reddit.com/r/Coffee/comments/113euv6/specialty_bean_i_saw_some_of_the_bean/",
        "text": "",
        "created_utc": 1676512151,
        "upvote_ratio": 1.0
    },
    {
        "title": "I drank a lot of decaf (again), so you don't have to: my recommendations",
        "author": "vivianvixxxen",
        "url": "https://www.reddit.com/r/Coffee/comments/113cs12/i_drank_a_lot_of_decaf_again_so_you_dont_have_to/",
        "text": "Back in August, [I made a post](https://www.reddit.com/r/Coffee/comments/wm628e/i_drank_a_lot_of_decaf_so_you_dont_have_to_my/) where I reviewed a bunch of decaf coffees I'd tried and gave my ranking. In the comments, people offered up a ton of recommendations for other decafs to try. While I didn't get to try them all, I did try a whole bunch.  \n\nAs I wrote last time, Swiss Water Processed decafs always taste off--that opinion has been reinforced by this recent tasting.  I won't write them off completely--so, if you have a recommendation that you think might change my mind, definitely drop it in a comment.  Sugarcane/Ethyl Acetate decaffinated coffee is still the best, imo.\n\nThe following list is from favorite to least favorite (i.e. the Olympia is #1).\n\n-------------------------\n\n**Olympia | Asterisk, San Sebastian, Colombia | Caturra | EA**\n\nAn excellent decaf. It has an wonderful, juicy acidity and none of the usual markers of a decaf. It does lack in the complexity and intrigue you might expect of a similarly bright, yet caffienated, coffee, but that's a minor gripe. There's a chance that when tasted alongside an \"OK\" third wave coffee, I wouldn't be able to identify the decaf one.\n\n**Counter Culture | Urcunina, Nariño, Colombia | EA**\n\nA really surprising decaf. Whole bean in the bag, I could smell the \"decaf-ness\" of it, but once brewed that smell went away. The taste of the decaffeination is well-hidden by an abundance of acidity. Like most decafs, it's fairly one-note, but the note is clear, bright, and sustained.\n\n**B&amp;W | Gedeb, Yirgacheff, Ethiopia | EA** \n\nSomewhat acrid, but mellowed out by an extremely round and full body. You couldn't fool me with this, but it's reasonably pleasant.\n\n**Equator | Ethiopia Alemu Tukule Natural | SW**\n\nOne of the better SWP decafs I've had. However, it's a bit sharp around the edges and still carries that *je ne sais quois* that SWP always has that marks it like a flaming beacon as decaf (and in particular SWP).\n\n**Theory | Peru | SW**\n\nI'm becoming a real decaf conniseur--I was able to identify the process just by smelling it. Luckily, the smell wasn't terribly strong, which boded well. The smell of SWP persists in the brew, but the taste is actually quite nice. There's a really bright acidity that I've never found in an SWP. Unfortunately, the decaf-mustiness is still there, and there isn't a ton of complexity. Still, not bad at all. Definitely an excellent choice.\n\n**Counter Culture | Slow Motion (LATAM) | SW**\n\nThe bag's self-description is fairly accurate—it tastes of cocoa and molasses. But it also tastes of something the bag does not state: Swiss Water Processing. It's fine, for a coffee-flavored tea.\n\n-------------------------\n\nAlright, that's the list! If you have any recommendations for more great decaf to try, let me know! I probably won't get around to a part 3 for quite some time as I'm travelling atm, but when I'm back to my equiptment I'll try what ya'll suggest.\n\nSpeaking of, I'm currently in Taipei and loving the incredible coffee here (even the coffee *chains* here have incredible, 3rd wave-style coffee). I'm headed to Hong Kong next month and Qufu, China the month after (visa willing!). If anyone has recommendations for great coffee in any of those places, please let me know! 謝謝!",
        "created_utc": 1676506168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Troubleshooting",
        "author": "daniiel_805",
        "url": "https://www.reddit.com/r/Coffee/comments/113cr90/troubleshooting/",
        "text": "Hello, I have a Dual Boiler Breville. But I’m having issues with the extraction. Sometimes the machine will just stop after a couple of seconds of extraction (both for single shot and double). I’m not sure why it’s doing this. Could it be something I’m doing wrong, or something in the machine?",
        "created_utc": 1676506110,
        "upvote_ratio": 1.0
    },
    {
        "title": "Buying an Espresso machine was a horrible decision..",
        "author": "valandinz",
        "url": "https://www.reddit.com/r/Coffee/comments/113cav8/buying_an_espresso_machine_was_a_horrible_decision/",
        "text": "..because coffee at restaurants tastes like garbage now.\n\n———\n\nSo I’ve had a Dolce Gusto for years and after that I upgraded to a fully automatic Philips, which was really mediocre.\n\nI wanted to try something better so I ordered a Sage (Breville) Barista Express a month ago, which by all means, is still an entry level espresso machine. \n\nI got myself some single origin medium roast specialty beans and set the machine up after hours of watching barista videos. \n\nNow I’m addicted to testing out different styles of coffee, am already dreaming of owning a Profitec and coffee at restaurants taste horrible. Am I part of a cult now?",
        "created_utc": 1676504907,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi! I have an issue with my Breville Oracle Touch. There's a leak on the steam boiler. Would anyone know how to fix this?",
        "author": "CompetitiveJob5832",
        "url": "https://v.redd.it/5met1hq1bhia1",
        "text": "",
        "created_utc": 1676504010,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee Shop Survey",
        "author": "Any-Corgi-5565",
        "url": "https://www.reddit.com/r/Coffee/comments/113an2z/coffee_shop_survey/",
        "text": "[removed]",
        "created_utc": 1676500552,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hell yea brother",
        "author": "Rosslikefromfriends",
        "url": "https://i.redd.it/9ysyg2v5xgia1.jpg",
        "text": "",
        "created_utc": 1676499300,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is it called Americano when it's the least American item on the menu?",
        "author": "dansepsykopat",
        "url": "https://www.reddit.com/r/Coffee/comments/1137tx0/why_is_it_called_americano_when_its_the_least/",
        "text": "I found it very odd when I was a new barista. But now I've just accepted that it doesn't really makes sense. Eh.",
        "created_utc": 1676493313,
        "upvote_ratio": 1.0
    },
    {
        "title": "K4 grinder not grinding",
        "author": "garlicbreeder",
        "url": "https://www.reddit.com/r/Coffee/comments/1137jn5/k4_grinder_not_grinding/",
        "text": "Hi team,\n\nI just received a k4 grinder. I got beans for the first time, turned the setting all the way clockwise as per instructions and then set it on 30 clicks to start, put 18g in, started turning the handle and... Nothing. No resistance at all, it looks like the beans don't get inside the burrs. \n\nFirst time using it so I'm a bit lost.\n\nAny help here would be very much appreciated",
        "created_utc": 1676492546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Burrs on the Eureka mignon specialita",
        "author": "Zt4cy",
        "url": "https://www.reddit.com/r/Coffee/comments/1137088/burrs_on_the_eureka_mignon_specialita/",
        "text": "Is it worth to replace the original burrs the grinder came with to improve espresso shots ? If yea with which?",
        "created_utc": 1676491189,
        "upvote_ratio": 1.0
    },
    {
        "title": "Machine that can make coffee (preferably grinds beans), provides hot water and heats up milk",
        "author": "Masi80",
        "url": "https://www.reddit.com/r/Coffee/comments/1136yql/machine_that_can_make_coffee_preferably_grinds/",
        "text": "[removed]",
        "created_utc": 1676491082,
        "upvote_ratio": 1.0
    },
    {
        "title": "زراعة فيلوديندرون المجيد؛ 3 متطلبات للعناية بالنبات - فهرس",
        "author": "SeparateElk1567",
        "url": "https://agricultural.faharas.net/philodendron-gloriosum-cultivation/",
        "text": "",
        "created_utc": 1676491052,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which coffee machine should I choose?",
        "author": "thecaptain90",
        "url": "https://www.reddit.com/r/Coffee/comments/1136rvu/which_coffee_machine_should_i_choose/",
        "text": "Hello! I'm thinking between 2 types of coffee machines, but I can't decide which one to buy. Does anyone have personal experience with the following models? I'm also interested in pros and cons!\r  \n\r  \nPhilips series 3200 lattego\n\nor\r  \n\r  \nDe'Longhi Magnifica Evo ECAM 290.81.TB\r  \n\r  \nCan you help me choose? Thanks!!! :)",
        "created_utc": 1676490567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Housemate burnt moka",
        "author": "Royal-Discount7129",
        "url": "https://www.reddit.com/r/Coffee/comments/1136qno/housemate_burnt_moka/",
        "text": "My stupid housemate left my moka pot on very low heat on an induction plate for around 8 hours. I came home now and inside the bottom part it is completely black, and of course all moisture was gone so the small coffee residue in the top part was black. I disassembled it and put all parts in a bowl with boiling water and some baking soda. It is a stainless steel Bialetti one. \n\nDoes someone have any other tips for cleaning it? Could it be a health hazard and I should just get a new one? \n\nThanks a lot!",
        "created_utc": 1676490476,
        "upvote_ratio": 1.0
    },
    {
        "title": "You Found Coffee All Hearts Restored",
        "author": "SpiritualWindo",
        "url": "https://i.redd.it/et9cq7imjeia1.jpg",
        "text": "",
        "created_utc": 1676488587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starbucks Reserve coffee beans worth trying?",
        "author": "tsuid1",
        "url": "https://www.reddit.com/r/Coffee/comments/1134zj6/starbucks_reserve_coffee_beans_worth_trying/",
        "text": "Have alittle bit left in a Starbucks gift card I rarely use. I’m in NYC and I remembered the Reserve Roastery is here. I’m looking for something light and fruity.\n\nI know it’s Starbucks but would you recommend their reserve beans?",
        "created_utc": 1676485920,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you tried any of these?",
        "author": "Coffeecode21",
        "url": "https://coffeecode.co.uk/cat-poop-coffee/",
        "text": "",
        "created_utc": 1676484446,
        "upvote_ratio": 1.0
    },
    {
        "title": "Flavor pairing",
        "author": "MrReadyArmada",
        "url": "https://www.reddit.com/r/Coffee/comments/1134c43/flavor_pairing/",
        "text": "I was at a wine tasting and the sommelier paired a sour wine with some really tart snacks. It made the wine seem really sweet, so I tried this at home but with an anaerobic Ethiopian that is really juicy and tart. It made the coffee sweet like candy! You really have to try this at home. Take a piece of lemon or something else that is really sour and then take a sip of a coffee!",
        "created_utc": 1676484297,
        "upvote_ratio": 1.0
    },
    {
        "title": "Opinions on creamer",
        "author": "ijustbehere24",
        "url": "https://www.reddit.com/r/Coffee/comments/1133dtp/opinions_on_creamer/",
        "text": "With so many different brands and options out there, what is the best or most popular (specifically caramel flavor) creamer? What something good with caramel flavor!",
        "created_utc": 1676482020,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else do this? My kid said am living in 2323 lol",
        "author": "ALTER_oner",
        "url": "https://i.redd.it/eobn88fbgfia1.jpg",
        "text": "Add the creamer into the pot and let the brew mix it.",
        "created_utc": 1676481529,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much caffeine is there in a cup of coffee?",
        "author": "Coffeecode21",
        "url": "https://coffeecode.co.uk/how-much-caffeine-in-coffee",
        "text": "",
        "created_utc": 1676480417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Difference between Cuisinart DCC-3400 PerfecTemp and DCC-3400P1",
        "author": "bgux",
        "url": "https://www.reddit.com/r/Coffee/comments/1131ocf/difference_between_cuisinart_dcc3400_perfectemp/",
        "text": "I need to replace our broken coffee maker ASAP and can get the DCC-3400 PerfecTemp locally today at Macy's or the DCC-3400P1 in four days from Amazon... same price. Is there a difference between the two coffee makers? They look exactly the same.",
        "created_utc": 1676477778,
        "upvote_ratio": 1.0
    },
    {
        "title": "You can't get a Niche (US model) in the UK?",
        "author": "Yoyomaster123",
        "url": "https://www.reddit.com/r/Coffee/comments/1131n18/you_cant_get_a_niche_us_model_in_the_uk/",
        "text": "I'm visiting London soon and I wanted to buy a Niche US model to try to save some money (VAT). It didn't let me send it to the hotel so I contacted Niche and they only ship US model to USA (?). Why would they do that considering?",
        "created_utc": 1676477679,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to buy 1zpresso X-pro",
        "author": "whitestone0",
        "url": "https://www.reddit.com/r/Coffee/comments/1131iu1/where_to_buy_1zpresso_xpro/",
        "text": "Anyone know where to find a X-pro in the US? \n\nI found one on a coffee website for $250 but that's $110 over MSRP. I also found listings on AliExpress but I'm very wary of using them, buying cheap stuff is one thing, but idk if I can trust them for expensive equipment. Here's the cheapest listing right now (it was MSRP of $145 yesterday, $161 today.)\n\nhttps://m.aliexpress.us/item/3256803798368524.html?gatewayAdapt=glo2usa4itemAdapt&amp;_randl_shipto=US",
        "created_utc": 1676477359,
        "upvote_ratio": 1.0
    },
    {
        "title": "tom and jerry Tom's suicide the creepypasta",
        "author": "Unlikely-Coffee-3077",
        "url": "https://www.reddit.com/r/u_Unlikely-Coffee-3077/comments/11315f5/tom_and_jerry_toms_suicide_the_creepypasta/",
        "text": "so i ever heard of future Nick Jr show called tom and jerry \n\nif it is not tom and jerry was a show on Nick Jr that premiered on 1940 \n\none day i went to my big w i was always on DVD i have 6 volumes of DVD in total \n\ni was looking at DVDs i found a DVD all DVD cover is gone \n\na home video disc but i was wrong bottom of the disc it said TOM AND JERRY RARE LOST EPISODE i was look like this \n\nso i went home at big w i put DVD in DVD player the DVD starts with in 20 seconds of black screen then showed the DVD warning screen it then the menu came \n\nthe menu got 3 options \n\n1 play all \n\n2 bonus features \n\n3 set up \n\nshe clicked play all a DVD disc error and clicked ok but i was wrong then it shows old Nickelodeon logo instead of the orange splat it was 2010-2020 \n\nit starts with the tom and jerry the rare DVD bonus features menu it contains games photos and videos i was wrong the episode starts with the theme song which was mgm old lion roar \n\ningredients on the bucket to hold the ingredients \n\ni think i saw it was something it said 666 on it \n\nthey stirs the ingredients and breaks the chemical x bucket when the narrator was talking to chemical x \n\nit was chemical s that s the letter was satan before logo shows up \n\ni saw really was it with poachers beat up female eyes were gone it was just red circle with blood \n\ni was freak it out and guess what it cut to a red \n\nthe title card played Tom's suicide \n\nthen when the title card continues the names just say like did before \n\nepisode starts with flying cars traffic area we see narrator talking to between cat vs mouse \n\nwhen Jerry talking to the Tom i clicked the DVD menu the battery are dead i put new batterie s on TV remote and i clicked retry the movie and watch the episode \n\nthat onlyb about 3 rats when Jerry hides from fridge at Tom \n\nthen to be science teacher it was been in graduated but Tom didn't caare outside the house she drops boat toy on drawer and put it in the boat toy with drawer \n\nbut Tom didn't believe Jerry about to get goes away then he puts Tom to go outside with the rain then it was really violent movie i ever seen \n\nwe see Tom eyes turn red she said in demonic voice ENOUGH then screen cut to black in 10 seconds i could hear some static in the background she throws away Jerry to the ground and \n\nshe would kill the pests then she said you're rodents going to the die in next in 1 minute we see Tom kill the mouses including blocks removal bags card boards and mouse traps \n\ni was like this i had to watching in 1 minute she lots of damage flying cars for traffic in the pest control i was so happy with this \n\nthen i heard a rodent trap shot then he something it says Tom will never saved today it cut to the the end there was no credits it cut back to DVD menu \n\nthis is a 2018 i was watching Tom and Jerry i was doing this with disc i was already watch it just like did it before i was able to destroys the disc i was upload the video on YouTube \n\nthey got lots of comments and replies for this video",
        "created_utc": 1676476389,
        "upvote_ratio": 1.0
    },
    {
        "title": "Upgrade my Oracle?",
        "author": "LordInquisitorEisen",
        "url": "https://www.reddit.com/r/Coffee/comments/1130qhx/upgrade_my_oracle/",
        "text": "So, after a lot of discussion and soul searching about what I want my next steps on my espresso ‘journey’ to be, I’m in the process of ordering a new grinder. For reference, my current setup is:\n- Machine: Sage (Breville) Oracle\n- Grinder: did have the Rancilio Rocky, but this has just died the other day, so using the Oracle grinder at the moment. Going to buy a DC83 once available in March / April\n- Basket: stock\n- WDT: home made with a cork and acupuncture needles\n- Tamper: Motta Bubinga\n\nI’m considering whether I want to upgrade my machine as well as the grinder, or if there are any ways to mod it. So, my question: is it worth upgrading the Oracle to something different, and if so, what machines would people advise looking at?\n\nI’m somewhat flexible on budget, but wouldn’t want to go higher than £5k without an exceptionally good reason to do so.\n\n(Cross-posted from r/espresso in case anyone outside that specific community has some ideas!)",
        "created_utc": 1676475260,
        "upvote_ratio": 1.0
    },
    {
        "title": "Direct Trade Coffee: What Is It And Why Does It Concern You?",
        "author": "Homegrounds",
        "url": "https://www.homegrounds.co/direct-trade-coffee/",
        "text": "",
        "created_utc": 1676474236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can’t get decent timed shots.",
        "author": "Philqt",
        "url": "https://www.reddit.com/r/Coffee/comments/113052o/cant_get_decent_timed_shots/",
        "text": "Hey guys,\n\nI recently upgraded my Dedica 685 with Rancilio Steamer to a used and nodded Gaggia classic with PID and 9 bar Spring. \nI’m rocking the J-Max as grinder. \n\nMy puck prep is weighing 18g, grind, in the basket (vst 18g and IMS Comp. 16/18g) and then using the wdt tool from Normcore(the big needle distributor you can turn). While it’s still on the basket I knock once on the pad. \nAfter I use the Normcore wedge distributor and turn it some times. \nFor the tamper I use the Normcore force tamper with the 30lbs spring. \n\nThat’s my puck prep. \nWith this setup I almost never get channeling and the espresso flow almost instantly from the middle in one stream. \nSo far, so good. \nBut the times are very off and unstable. \nLike with one grind setting I’ll get 36 out in about 26 seconds and one click finer it gets up to 40 or 50 seconds. \nWhen I use the same grind settings I’ll get sometimes differences of about 10 secs…\nAt the moment I‘m using a middle roast or perhaps middle-light. \n\nAny tips?\n\nGreetings.",
        "created_utc": 1676473660,
        "upvote_ratio": 1.0
    },
    {
        "title": "Part of the experience of drinking coffee in the middle of the day is listening to good music in the background So I made a playlist for myself with the music I like to listen to in the background How do you like to drink your coffee?",
        "author": "ElikoBass",
        "url": "https://open.spotify.com/playlist/4jX2w0qrLpjb3Yfy8463kc?si=73b89bfb72b64a0c",
        "text": "",
        "created_utc": 1676473656,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using coffee fines?",
        "author": "b3c88",
        "url": "https://www.reddit.com/r/Coffee/comments/11303rv/using_coffee_fines/",
        "text": "Ive recently jumped down the coffee rabbit hole. My grinder is the DBM8 which is producing a good amount of fines. I experimented with sifting the coffee grounds to eliminated some of the fines. Its worked well and i can get a great cup of coffee,only draw back is 15-20% of the coffee is being lost as fines. I have been bagging up the fines of my expensive coffees wondering if there is a good use for them? I was thinking of maybe making a hacked cappuccino or latte in a french press but not sure if the fines are too small to use in the FP. any ideas? I wondered if say a 1:3 ratio in the FP to produce a strong coffee and then rinse the FP to froth some milk. I am not sure if the fines are going to over extract in the FP. If anyone has any experience sifting fines and what they do with them as they accumulate let me know!",
        "created_utc": 1676473562,
        "upvote_ratio": 1.0
    },
    {
        "title": "different sizes in V60-02 ??",
        "author": "Artemis_Rules",
        "url": "https://www.reddit.com/gallery/112zii8",
        "text": "",
        "created_utc": 1676471977,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cant seem to get Ethiopian coffee with pour over and its driving me NUTS",
        "author": "The_Coffee_PA",
        "url": "https://www.reddit.com/r/Coffee/comments/112z30o/cant_seem_to_get_ethiopian_coffee_with_pour_over/",
        "text": "I have recently purchased an Ethiopian natural coffee, searching high and low for those florals, that acidity, that tang and fruitiness in the coffee. however, whenever I seem to brew, I always end up clogging the filter, and getting 4-5 minute brews that didnt taste very good. I then proceeded to grind coarser and coarser and got the drawdown to an acceptable time frame, but the brews were hollow, bland, and again.. not good.\n\nI did some research and then read around in a few places that paradoxically, you should try grinding finer, which I do now, and slightly change up my technique. the resulting brews are MUCH better, but still isnt where I want it to be. for reference, my gear is as follows:\n\n\\- V60 with hario tabbed filters\n\n\\- Fellow EKG brewing at 204 degrees\n\n\\- 1Zpresso Plus (originally grinding at around 6, then 8, now im grinding down to 4.9/5 ish) || I was originally using James' Hoffman v60 recipe, but I think the agitation caused massive fines migration which clogged the filter.\n\nprocess im using now: I am taking 18g coffee, at around at 5 setting on the K plus (I know it varies with each grinder), make a bit of a divot in the bed, bloom to 50/55g. 45sec bloom, then a hard, heavy middle pour with zero agitation to 200g. let the coffee drawdown a bit to 1:30sec, then do a circular pour to 300g again, with zero agitation. || is this technique somewhat acceptable? or am I just doing this whole thing wrong haha.\n\nIm so tired of wasting coffee ive spent good money on. I want to be able to buy a nice bag of coffee, have a cup or 2 to perfectly dial it in, then have 20 cups of amazing, floral, citrussy/acidic coffee that I can enjoy every morning. it makes me feel like my expensive ass purchases aren't worth it because im not even making coffee I enjoyed.\n\nof note, I did purchase the onyx advent calendar and basically used a 5.5 grind setting on the K plus, and used Hoffmans V60 recipe for each coffee and produced really tasty coffee, the best being the final day with the gesha they gave. So I know im capable of making good coffee, I just want to be consistent with it and its driving me bonkers.",
        "created_utc": 1676470808,
        "upvote_ratio": 1.0
    },
    {
        "title": "OXO OR MOCCAMASTER? ✌🏻 ❤️☕️",
        "author": "RyKayKay",
        "url": "https://www.reddit.com/r/Coffee/comments/112yfbm/oxo_or_moccamaster/",
        "text": "Can’t decide between the two…any first hand experience with these guys out there? \n\nMy French press is a bit much for my daily routine. Looking to simplify life with one of these coffee drippers. Tough to find good reviews that aren’t compensated in some fashion. Would love some first-hand experiences and recommendations.  Care to share?✌🏻 ❤️ ☕️",
        "created_utc": 1676468996,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to improve my coffee technique?",
        "author": "Aspected1337",
        "url": "https://www.reddit.com/r/Coffee/comments/112xezx/how_to_improve_my_coffee_technique/",
        "text": "I've been pouring coffee for a year now using the V60 (with hario paper filter), ode grinder and fresh beans. I usually make medium roast with option 4 on the grindsize which is relatively coarse but not too coarse. I grind using the James Hoffman technique mostly but I feel like I still need to have milk in my cup for it to taste good. I have had times when I could drink it black and genuinely enjoy it to the extent where adding milk would worsen its taste, and that's my goal, but I feel like I'm not making any progress towards that goal.\n\n&amp;#x200B;\n\nWhat would you do in my position?",
        "created_utc": 1676465930,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Aeropress] Is grinding coarser and steeping longer the safest way to a great cup?",
        "author": "ImUntilted",
        "url": "https://www.reddit.com/r/Coffee/comments/112xdb3/aeropress_is_grinding_coarser_and_steeping_longer/",
        "text": "My Aeropress recipe used to be pretty much what James Hoffmann showed in his series: Grind pretty fine (in terms of medium); couple of clicks finer than a 1-cup V60 is what I'd usually do. Steep for about 2 mins, swirl, wait 30sec, press. Pretty tasty.\n\nI've read here and there (e.g. Jonathan Gagné) that steeping for much longer can lead to really good results.\nNow I was wondering if it makes sense to grind coarser for such a recipe than for a \"standard\" recipe. Because 4 minutes plus steep the coffee is already pretty nicely extracted (as it would be in a French Press) and then grinding finely for the press doesn't really make sense or does it? I'd guess it only makes channeling more likely.\n\nDo you agree? Does it make sense to grind coarsely (like a normal medium filter grind or so) for a long-steep method?\n\nThanks",
        "created_utc": 1676465764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Simply Good Coffee - Olson",
        "author": "sammm59",
        "url": "https://www.reddit.com/r/Coffee/comments/112wzq5/simply_good_coffee_olson/",
        "text": "Anyone have experience with this coffee maker?  I've been looking at the Moccamaster's, but having a hard time justifying $300+.   I'm open to other suggestions as well.  TIA!\n\n[https://simplygoodcoffee.com/products/the-olson](https://simplygoodcoffee.com/products/the-olson)",
        "created_utc": 1676464466,
        "upvote_ratio": 1.0
    },
    {
        "title": "Baratza Encore Is A Trash Coffee Grinder.",
        "author": "hurtkitty123",
        "url": "https://www.reddit.com/r/Coffee/comments/112wmyh/baratza_encore_is_a_trash_coffee_grinder/",
        "text": "I bought the baratza encore in November 2022. It’s been fine, I mean all it has to do if grind coffee. But it’s already not working, it takes ten minutes to grind 60 grams of coffee, and shakes. All it’s done is sit on my counter, and grind coffee. And the peace of shit already is garbage. Anyway don’t buy it.",
        "created_utc": 1676463251,
        "upvote_ratio": 1.0
    },
    {
        "title": "Better to grind at home or get specific pre-ground?",
        "author": "ConnectionFew5402",
        "url": "https://www.reddit.com/r/Coffee/comments/112wjo2/better_to_grind_at_home_or_get_specific_preground/",
        "text": "Apologies if this is a noob-ish question. \n\nI get my coffee beans from an independent roaster in the UK. They offer their beans whole, or pre-grounded to your specific method (eg Aeropress, v60, filter, etc) which I know is just essentially grind size. \n\nI use an Aeropress, and always get the Aeropress grind, but have heard the flavour is always better from whole/freshly ground. \n\nAm I better off getting whole bean and grinding very roughly and probably inaccurately myself using a spice grinder, or keep the pre-ground? For context, each 250g bag will last me about 4-5 months open in the cupboard, as I don’t drink coffee every day. I’m not into coffee enough to probably justify a specific grinder, but I do enjoy a quality cup. Thanks a lot!",
        "created_utc": 1676462930,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do so many people think coffee is a deadly drug?",
        "author": "GaurdsGuards",
        "url": "https://www.reddit.com/r/Coffee/comments/112vxz5/why_do_so_many_people_think_coffee_is_a_deadly/",
        "text": "I saw some stuff on YouTube from some popular YouTubers that explains the psychological and physiological effects of coffee, and the comments are full of anecdotal evidence-spewing people that say that stopping coffee for them is like the best thing to ever happen, stopped their anxiety disorder, sleeping disorder, etc. \n\nDo people just metabolize caffeine that differently or is there a different factor in play? Like perhaps, those people who said stopping coffee has improved their quality of life used to drink sugary coffee, energy drink style things and stopping them is stopping their sugar intake, but they thought it was stopping the caffeine that made their life better?\n\nI always feel like coffee in general is a very misunderstood thing.",
        "created_utc": 1676460711,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can a make an Americano with a moka pot?",
        "author": "Silent_Buyer",
        "url": "https://www.reddit.com/r/Coffee/comments/112vn4p/how_can_a_make_an_americano_with_a_moka_pot/",
        "text": "What size is needed?",
        "created_utc": 1676459543,
        "upvote_ratio": 1.0
    },
    {
        "title": "Water...should you always use the best there is?",
        "author": "ricking08",
        "url": "https://www.reddit.com/r/Coffee/comments/112vhxt/watershould_you_always_use_the_best_there_is/",
        "text": "As a roaster one goes through a proces of finding the best roasting profile for the coffee on hand. One uses certain parameters, roasts the coffee and then brews it to experience the result. If it's not good, one tweaks the roasting profile a little, adjusting the parameters again etc until one eventually hits that sweetspot.\n\nThe testing of the roast is done by cupping/brewing the roasted coffee...and that is done with water. The water the roaster uses sets the standard for the flavour/aromatics of the coffee and, depending on the roaster, this could range from tapwater to mineral water to artificially modified water. \n\nSee it as an artist trying to paint an apple (coffee) to match his image of said apple. The artist uses Paint of brand A (water) and keeps changing his pencil (roasting parameter) to tweak the strokes to create a better painting of said apple. Finally he did it, the colour scheme is exactly how HE envisioned the apple should look like on the canvas. This is the best result.\n\nNow his fans want to make the best version of the apple painting and everybody tells the fans to use the best paint (water)out there. They do and all of the fans are enthousiastic about the result...after all their used the best paint and thus the result is automatically optimal. But would the painting be the exact same version of the original? Would that best paint give the same result as the (perhaps lesser quality) paint the artist used? \n\nThe fact is that the Roasters tweak their coffee according to what tastes best while using THEIR water and not the 'best' water per se.\nRoasters don't always use water like Third Wave Water (or even mineral water) to test the result of the roast.\n\nInstead of focussing on getting one's hands on the best water out there to get the best results out of the coffee, perhaps one should contact the roaster instead and ask what water they used to set the optimal result of their roast? Wouldn't this give the best result? After all, the beans have been roasted to meet that result using that water and not a different kind of water.\n\nI'm looking forward to what this sub thinks about this post. Don't get all agitated, this is just my 'brain, shhht, I want to sleep' thoughts written in a post.",
        "created_utc": 1676459000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fight me",
        "author": "ContributionNo1600",
        "url": "https://i.redd.it/lapl5qrsgdia1.jpg",
        "text": "",
        "created_utc": 1676457477,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would you react if somebody (unironically) said “That’s a great tea!” after tasting your speciality coffee cup?",
        "author": "Lexidus",
        "url": "https://www.reddit.com/r/Coffee/comments/112u5lr/how_would_you_react_if_somebody_unironically_said/",
        "text": "**Little background info:** the tea-like taste in coffee is commonly associated with under-extraction. Both an over-extracted and an under-extracted cup is generally not what we aim for when trying to get the best-tasting cup of coffee.",
        "created_utc": 1676453651,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is medium roast coffee good for Siphon(vacuum pot)?",
        "author": "Fluffy_Gur8714",
        "url": "https://www.reddit.com/r/Coffee/comments/112twpo/is_medium_roast_coffee_good_for_siphonvacuum_pot/",
        "text": "",
        "created_utc": 1676452622,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD/Anxiety being a barista?",
        "author": "BattyBrainz",
        "url": "https://www.reddit.com/r/Coffee/comments/112to9t/adhdanxiety_being_a_barista/",
        "text": "I'm really getting into coffee more and want to try a weekend job at this coffee place to get a feel of being a barista. I'm just worried how poor I'll do having adhd/anxiety unemedicated \nI would like some advice. \n\n\n( no its not star$$, an actual coffee shop )",
        "created_utc": 1676451637,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best grocery store decaf coffee for French press?",
        "author": "Itadepeeza1",
        "url": "https://www.reddit.com/r/Coffee/comments/112tmne/best_grocery_store_decaf_coffee_for_french_press/",
        "text": "I’m very new to the coffee world so please forgive my ignorance about coffee. Can’t go to coffee shops since they’re really far. Only way I can try coffee is from grocery stores or 7/11 and I would prefer to make my own at home. What is everyone’s favorite decaf coffee they get at grocery stores? If possible that can be used with a French press since you need a type grind? for it. If you’re wondering why decaf, I already get my caffeine from a different source and sometimes I crave a nice cup of warm joe in a cold night. Something I’m looking for in a coffee is naturally sweet, chocolatey flavor. Thank you",
        "created_utc": 1676451471,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best coffee roaster in Singapore",
        "author": "gerard14ph",
        "url": "https://www.reddit.com/r/Coffee/comments/112tihf/best_coffee_roaster_in_singapore/",
        "text": "",
        "created_utc": 1676450966,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Coffee Beans in the World",
        "author": "Antique-Avocado-2313",
        "url": "https://www.reddit.com/r/Coffee/comments/112sdx2/best_coffee_beans_in_the_world/",
        "text": "Curious about the [best coffee beans in the world](https://luxtionary.com/lifestyle/the-best-coffees-in-the-world/)? Check out our article where we look into the matter and give you all the details. The best coffees are the kinds that are rare and difficult to find.",
        "created_utc": 1676446334,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this instant coffee expired? Found in my parents house - brand Nescafé - seems to have little white hairs or cobwebs in it",
        "author": "PomegranateSure1628",
        "url": "https://www.reddit.com/gallery/112s1v0",
        "text": "",
        "created_utc": 1676445004,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ll be attending and volunteering at Specialty Coffee Expo in Portland. 4/21-4/23. So stoked!",
        "author": "ItsssYaBoiiiShawdyy",
        "url": "https://www.reddit.com/r/Coffee/comments/112qr9n/ill_be_attending_and_volunteering_at_specialty/",
        "text": "The Specialty Coffee Expo is approaching in April and I have decided I’m going to pull the trigger this year and volunteer for the event. I couldn’t believe the ways in which you could get involved AND get a free expo badge!\n\nThe coolest things is if you work 3 four shifts (SCA members only) or 4 four shifts (for non members) during the event week, you get a free 3-day pass to the whole expo. \n\nYou can volunteer to work the stage at the US barista, brewing, and roasting championships, work the workshops, works as a barista (req experience), work lectures, the competition hall, and more. \n\nJust fyi to anyone who might be interested. \n\n[All the info you need](https://www.coffeeexpo.org/)\n\nSo, so excited.",
        "created_utc": 1676440088,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can a Ninja blender be used as a coffee grinder?",
        "author": "coffeefoodnetwork",
        "url": "https://www.reddit.com/r/Coffee/comments/112qlue/can_a_ninja_blender_be_used_as_a_coffee_grinder/",
        "text": "[removed]",
        "created_utc": 1676439546,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Hate Lavender Flavor Coffee",
        "author": "sweeteasweetie",
        "url": "https://www.reddit.com/r/Coffee/comments/112qkb8/i_hate_lavender_flavor_coffee/",
        "text": "[removed]",
        "created_utc": 1676439371,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quick survey about Caffeine usage in colleges. The more responses, the better.",
        "author": "Brave-Razzmatazz8029",
        "url": "https://docs.google.com/forms/d/e/1FAIpQLScBmjeSwRVm-FOqp2-029yNhAdZH8PBmt11Vfoc78vZf6v_6A/viewform",
        "text": "",
        "created_utc": 1676438561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Had a French press given to me and I have no clue about it use or what kind of coffee to buy. Any help appreciated",
        "author": "Rdg1961",
        "url": "https://www.reddit.com/r/Coffee/comments/112phqo/had_a_french_press_given_to_me_and_i_have_no_clue/",
        "text": "",
        "created_utc": 1676435572,
        "upvote_ratio": 1.0
    },
    {
        "title": "my brother recently went to Amsterdam, brought me back the good stuff",
        "author": "EliMinivan",
        "url": "https://i.redd.it/jchgqojlibia1.jpg",
        "text": "",
        "created_utc": 1676433869,
        "upvote_ratio": 1.0
    },
    {
        "title": "[QUESTION] I've been playing around with instant decaf coffee, but the recommendations seem .. y'know .. pretty Nestlé-y. I can do better.",
        "author": "ur_canadian_brudda",
        "url": "https://www.reddit.com/r/Coffee/comments/112oc6y/question_ive_been_playing_around_with_instant/",
        "text": "**tl;dr** A medium roast, good quality freeze dried bean is preferred.  \n\n---\n\nOK so I usually use Amazon to find the product I like from a supplier in Canada, then go to that supplier directly and buy from them.  By the time shipping rolls from the mom and pop shop its a net-nothing on price, and this way I don't have to support Amazon.\n\nI'm having a tougher time figuring out what kind of instant decaf to try, so I thought I might ask here.  Both my wife and I like an evening cuppa now and again, but drink so little at night that its not worth having a pound of beans.  A medium roast, good quality freeze dried bean is preferred.  She prefers low-acid and lighter coffees, I prefer mine with some more body.  Y'know, so medium is a good compromise.",
        "created_utc": 1676431737,
        "upvote_ratio": 1.0
    },
    {
        "title": "My trip to Hawaii has gotten more expensive than I thought it would...",
        "author": "JSquidy",
        "url": "https://i.redd.it/ygfheyzxbbia1.jpg",
        "text": "",
        "created_utc": 1676431631,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Chemex brews take 7-8 minutes and I feel like my coffee is over extracted. Is this too long?",
        "author": "Toubaboliviano",
        "url": "https://www.reddit.com/r/Coffee/comments/112nnhj/my_chemex_brews_take_78_minutes_and_i_feel_like/",
        "text": "Brew Details:\n\nFiltered Water 95 C\n\nLight Roast usually single Origin\n\nOde V2 grind settings from 6-11 all seem to take the same amount of time?\n\nBrown Paper Chemex Filters",
        "created_utc": 1676429507,
        "upvote_ratio": 1.0
    },
    {
        "title": "French language coffee guides/content",
        "author": "nuage_de_pluie",
        "url": "https://www.reddit.com/r/Coffee/comments/112kess/french_language_coffee_guidescontent/",
        "text": "I am a fellow weird coffee person, and I'm consuming all sorts of content on brewing and theory. Mostly videos/blogs from the usual suspects mentioned frequently on this sub. I am also trying to brush up on my french, and I figured what better way to do it then to consume some coffee content, in french. My only problem is I find it difficult to find similar third wave/specialty content that is actually in french. I end up finding more content on french press techniques than anything else.   \n\n\nSo if anyone has a favorite channel/blog to recommend in french that would be much appreciated!",
        "created_utc": 1676419889,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dark grease found in center",
        "author": "Jrhernz",
        "url": "https://i.redd.it/iklptajn2aia1.jpg",
        "text": "So I decided to clean my burrs today. In my hand is the back of the dial and in the center a black ring that makes contact the auger key. \n\nThis back part had some coffee dust and I used the cleaning brush to get it off. I brushed the black ring not knowing it is covered in grease(?) and spread it across back. \nI didn’t think much of it and continued went ahead and actually brushed the burrs. \n\n I wouldn’t say it was “a lot” and when I ran the brush against my hand there was no grease left on my skin but, should I be worried in regards to having cleaned the actual burrs with it? Would it affect the taste of coffee? Is it toxic? 🤣\n\nAnyway, I know I’m probably overthinking it but thought I’d share anyway.",
        "created_utc": 1676416402,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone knows where to buy parts for Timemore C3 Pro? I need the plastic part on the handle or handle itself. I'm residing in the Czech Republic but can be anywhere in EU",
        "author": "eyyubalizada",
        "url": "https://i.redd.it/2avgenrb1aia1.jpg",
        "text": "",
        "created_utc": 1676415953,
        "upvote_ratio": 1.0
    },
    {
        "title": "French press with or without plunge",
        "author": "AlexAnderSon112",
        "url": "https://www.reddit.com/r/Coffee/comments/112ivyt/french_press_with_or_without_plunge/",
        "text": "Recently got a French press with a fixed plunger filter meaning you can’t push it down, and it stays in place near the top of the lid . Are there any pros or cons to this compared to a regular French press?\n\nAnd info is appreciated.",
        "created_utc": 1676415835,
        "upvote_ratio": 1.0
    },
    {
        "title": "The way my workmate makes coffee",
        "author": "EatDirtAndDieTrash",
        "url": "https://i.redd.it/mrem0jjju9ia1.jpg",
        "text": "",
        "created_utc": 1676413670,
        "upvote_ratio": 1.0
    },
    {
        "title": "Excitement, Anticipation, Panic. First time using moka pot, tasted horrible. Second try was delicious!",
        "author": "hinkelpinkel",
        "url": "https://v.redd.it/70p0u5oeb8ia1",
        "text": "",
        "created_utc": 1676413132,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why?",
        "author": "Mammoth_You8982",
        "url": "https://www.reddit.com/gallery/112euy9",
        "text": "",
        "created_utc": 1676405456,
        "upvote_ratio": 1.0
    },
    {
        "title": "My fab this one!!!!",
        "author": "Ok8372",
        "url": "https://i.redd.it/lexfe8gcn7ia1.png",
        "text": "",
        "created_utc": 1676405045,
        "upvote_ratio": 1.0
    },
    {
        "title": "A cheat sheet I made for the Testu-Kasuya 4:6 pour over method after buying the signature cone from Hario. Overall brew time should be around 3 mins - adjust grind size for this (this means pretty course ground. Think French press). Water usually ~204-207F. Hope this is helpful!",
        "author": "Minamato",
        "url": "https://i.redd.it/wryy02f729ia1.jpg",
        "text": "",
        "created_utc": 1676404141,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coffee poster",
        "author": "Adventurous_Trai",
        "url": "https://i.redd.it/euvqupxz77ia1.png",
        "text": "",
        "created_utc": 1676399888,
        "upvote_ratio": 1.0
    },
    {
        "title": "Varia Hand Grinder Settings",
        "author": "Environmental_Two548",
        "url": "https://www.reddit.com/r/Coffee/comments/112c7b5/varia_hand_grinder_settings/",
        "text": "Hey guys! So I have the Varia hand grinder, and I was wondering if someone has a map or scale between the Varia hand grinder and any popular grinder. I like to try out different recipes, but I don't think I'm nailing the grind because the identifiers for grind size are usually written as \"medium\" or \"fine\" or in terms of common hand grinders. The varia isn't common, and I was wondering if anybody here uses it and can help me with understanding how the grind works on this. Thank you!",
        "created_utc": 1676398789,
        "upvote_ratio": 1.0
    },
    {
        "title": "I cleaned the catch cup. Happy Valentine’s Day gift to my lovely wife 🥰",
        "author": "juliuschme",
        "url": "https://i.imgur.com/yxDP2NV.jpg",
        "text": "",
        "created_utc": 1676397811,
        "upvote_ratio": 1.0
    },
    {
        "title": "I drank a lot of coffee and i hate it.",
        "author": "Potential_Motor7610",
        "url": "https://www.reddit.com/r/Coffee/comments/112bjkn/i_drank_a_lot_of_coffee_and_i_hate_it/",
        "text": "I usually dont drink coffee because i know it makes me extremely anxious. Today, i found a place which provided free coffee and coffee being my favourite despite the fact that i cannot drink it, i went over and drank some. It only maybe around 2 shots of espresso but i feel extremely anxious and scared. It would help if you could provide tips on how to get rid of this anxiousness because im already on anti-anxiety meds for an anxiety disorder and i dont want to feel crap.",
        "created_utc": 1676397163,
        "upvote_ratio": 1.0
    },
    {
        "title": "Filter options for clever that increase body",
        "author": "Gavmister",
        "url": "https://www.reddit.com/r/Coffee/comments/112b7se/filter_options_for_clever_that_increase_body/",
        "text": "Hey everyone,\n\n&amp;#x200B;\n\nAlmost done with my stock clever filters (large size, so i thik it's a 4). Are there any filters that might be a drop thinner and maybe promote a little more body? Could be totally unrealistic as any paper filter will thin it out, but if there are good options that might let a little bit of the oils through, that would be cool. \n\n&amp;#x200B;\n\nThanks!",
        "created_utc": 1676396321,
        "upvote_ratio": 1.0
    },
    {
        "title": "espresso and foamed milk easier on the tum than other methods?",
        "author": "SmittyFjordmanjensen",
        "url": "https://www.reddit.com/r/Coffee/comments/112b0or/espresso_and_foamed_milk_easier_on_the_tum_than/",
        "text": "I have problems with reflux but also love coffee. I've tried many methods and varieties at home. Pourovers, aeropress, moka pot, even cold brew. (I do not have an espresso machine.) Nothing I've tried seems to be tolerable, even when adding milk, frothed or unfrothed. Yet, I can go to a shop and get a cap or latte and experience almost no problems. Is it because the volume of coffee is low? or is espresso naturally lower caf or lower acid? either in the typical beans used or the process? I've had lattes at places that use a washed variety for their espresso and it tastes fruity, I'd assume it's higher in acid but usually doesn't bother me either.\n\nAny thoughts?",
        "created_utc": 1676395825,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jellyfish Collagen Coffee Creamer",
        "author": "allisonbrenner",
        "url": "https://www.reddit.com/r/Coffee/comments/112augt/jellyfish_collagen_coffee_creamer/",
        "text": "[removed]",
        "created_utc": 1676395383,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some questions from a total novice",
        "author": "alexlegenderydude",
        "url": "https://www.reddit.com/r/Coffee/comments/112aqvv/some_questions_from_a_total_novice/",
        "text": "So long and short of things\n\nI (16 so I really don’t know what I’m doing)  recently decided to get into coffee and by that I mean actual coffee ( I like the taste and also it helps me wake up in the morning and focus on my classes)\n\nI got both Ethiopian and Colombian coffee beans(sellers recommendation for best overall taste and feel) and I got really intimidated\n\nI currently don’t own a grinder ( plan on getting one soon ) \nAnd the place where I bought the beans from offers to grind them for you free of charge so I’m thinking of getting them ground and I use a french press in the mornings \n\nSo my questions :\n\nWhat is the ratio of water to grounds that’s best for the french press ? \n\nDoes the type of water make a difference? ( filtered or not )\n\nHow hot should the water be ? \n\nHow long should I wait before the coffee is done ? \n\nDoes a chemex really make that much of a difference? \n\nIs the way you pour the water in the grounds important?",
        "created_utc": 1676395128,
        "upvote_ratio": 1.0
    },
    {
        "title": "Make your own half caff?",
        "author": "DayTripper-27",
        "url": "https://www.reddit.com/r/Coffee/comments/112a8dd/make_your_own_half_caff/",
        "text": "Yes. Sacrilege. I know. However, I’ve been experimenting and I find that reducing the caffeine makes a huge difference in my overall energy levels. \n\nTend to use aero press vs almost anything else. Anyone else experiment with this. \n\n41/m/US",
        "created_utc": 1676393858,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sacrilegious question: What's the best instant decaf on the market?",
        "author": "TheGhostOfJaySherman",
        "url": "https://www.reddit.com/r/Coffee/comments/1129635/sacrilegious_question_whats_the_best_instant/",
        "text": "I know, I know... I'm asking about instant AND decaf. My problem is that:\n\n(1) I love the flavor of coffee\n\n(2) I often want an afternoon cup without the added caffeine\n\n(3) I don't drink enough to justify buying fresh\n\n(4) I also want it FAST\n\n&amp;#x200B;\n\nFeel free to roast me in the comments for even asking this",
        "created_utc": 1676391155,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fellow Opus review",
        "author": "chriswain123",
        "url": "https://www.reddit.com/r/Coffee/comments/11284yl/fellow_opus_review/",
        "text": "Lance Hedrick has a review out of the Opus https://youtu.be/PXThYLEQcq8",
        "created_utc": 1676388600,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trick for iced coffee in the morning?",
        "author": "drowninglinguists",
        "url": "https://www.reddit.com/r/Coffee/comments/1127wh1/trick_for_iced_coffee_in_the_morning/",
        "text": "I make my iced coffee in the morning using a 3-cup moka pot, the trouble is it's inconvenient and cuts into my time in the morning. I have to stick the coffee in the freezer to cool down as rapidly as possible, which takes around 30 mins. I'm not willing to pour hot espresso over ice--it ruins the flavor. Since I'm not willing to get up earlier, do you guys think it's a viable idea to brew the espresso ahead of time and keep it in the fridge? Assuming it is, can I then have a pitcher of the brewed coffee that will always remain cold? How long before it would 'go bad', or not taste as fresh? Or what other possible downsides could there be to this?\n\nFor example, if I brewed 4 days worth of coffee on Sunday and cooled it all in this pitcher to drink for the week, I would simply have to measure the coffee content per day and be good to go, right?",
        "created_utc": 1676387995,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kalita wave filter bubbling and clogging",
        "author": "2Bmusic",
        "url": "https://www.reddit.com/r/Coffee/comments/1127gpl/kalita_wave_filter_bubbling_and_clogging/",
        "text": "Idk if anyone else has had this problem because I can't find anything on the matter here.\n\nI have a stainless steel kalita and it have worked perfectly up until recently this week. \nSo when I wet my filter, bubbles start to form at the bottom of the brewer and makes the filter move so that water aggressively splashes out on the sides of the brewer. So now this also affects the brewing process and the bed agitates more than before. Today I also had problems with the brew completely stopping (I'm thinking because of the bubbles) and then suddenly starting to drip normally again after like 2 minutes into the brew.\nI've had no problems with this before so I'm confused why this has started all the sudden, something wrong with the paper filters??\n\nIs there anyone who've had similar problems? If so how did you solve them? Thanks!",
        "created_utc": 1676386906,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kalita wave filter bubbling and clogging",
        "author": "2Bmusic",
        "url": "https://www.reddit.com/r/Coffee/comments/1127gnm/kalita_wave_filter_bubbling_and_clogging/",
        "text": "Idk if anyone else has had this problem because I can't find anything on the matter here.\n\nI have a stainless steel kalita and it have worked perfectly up until recently this week. \nSo when I wet my filter, bubbles start to form at the bottom of the brewer and makes the filter move so that water aggressively splashes out on the sides of the brewer. So now this also affects the brewing process and the bed agitates more than before. Today I also had problems with the brew completely stopping (I'm thinking because of the bubbles) and then suddenly starting to drip normally again after like 2 minutes into the brew.\nI've had no problems with this before so I'm confused why this has started all the sudden, something wrong with the paper filters??\n\nIs there anyone who've had similar problems? If so how did you solve them? Thanks!",
        "created_utc": 1676386903,
        "upvote_ratio": 1.0
    },
    {
        "title": "little hard to see but \"medium\" roast my boss did friday oiling up since monday?",
        "author": "Gutsy_Moose267",
        "url": "https://i.redd.it/mharezxpm7ia1.jpg",
        "text": "",
        "created_utc": 1676386826,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need a coffee machine/ method for a small yacht",
        "author": "EthanColeK",
        "url": "https://www.reddit.com/r/Coffee/comments/11262t2/need_a_coffee_machine_method_for_a_small_yacht/",
        "text": "So basically my dad turned 50 and got himself a small boat. In his boat he has a small table with an 120v outlet.\n\nSince he knows I am a coffee nerd he asked me to get him a good machine to make coffee on the boat on the afternoons however I am struggling to give a recommendation. Non of my machines would be work (Gaggia Classic , Gevi 4 in 1 , Sage Precision Brewer  ) \n\nI was thinking of giving him a super small pour over but it has to be easy to prep on a moving boat. Maybe cuppamoka or I also saw the makita coffeemaker.\n\nAnd also a wannabe espresso machine . So a nespresso or a Wacaco or something like that (I know is not real espresso).\n\nWhat 2 recommendations would you give?",
        "created_utc": 1676383292,
        "upvote_ratio": 1.0
    },
    {
        "title": "How To Make Cold Foam Like Starbucks or Dunkin At Home",
        "author": "MillerEmma90",
        "url": "https://alwaysful.com/how-to-make-cold-foam/",
        "text": "",
        "created_utc": 1676382512,
        "upvote_ratio": 1.0
    },
    {
        "title": "Test post to see if I'm banned",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1676378640,
        "upvote_ratio": 1.0
    },
    {
        "title": "This Week in Coffee",
        "author": "withwavelets",
        "url": "https://www.reddit.com/r/Coffee/comments/1124i35/this_week_in_coffee/",
        "text": "[removed]",
        "created_utc": 1676378616,
        "upvote_ratio": 1.0
    },
    {
        "title": "This Week in Coffee",
        "author": "withwavelets",
        "url": "https://www.reddit.com/r/Coffee/comments/1124ewd/this_week_in_coffee/",
        "text": "[removed]",
        "created_utc": 1676378333,
        "upvote_ratio": 1.0
    },
    {
        "title": "My next grinder after the Kingrinder K6",
        "author": "Paviaguy",
        "url": "https://www.reddit.com/r/Coffee/comments/1124ccz/my_next_grinder_after_the_kingrinder_k6/",
        "text": "Hey all, after some time with the KINGrinder K6, a 48mm conical hand grinder that is supposed to mimic the 1zpresso line, I'm looking forward to upgrading. I drink mainly pour-overs, Moka pot, and Aeropress, and in the future (let's say 1-2 years from now) I plan on getting into the espresso world. \n\nCurrently, I'm debating whether I should simply upgrade to 1zpresso K-Ultra or something else.   \nThe K-Ultra does offer some life-quality upgrades like the handle and the travel case and the magnetic catch cup, but I wonder whether or not I'll feel any difference in the cup in terms of taste, considering they have a similar burr geometry.   \nLance Hedrick did a comparison between the K6 and K-max and said he could feel it, but I don't know if my palate is that developed. \n\nOr perhaps I should save up more money and get an electrical flat-burr grinder like the DF64 or something similar?   \nAlthough I heard that out of the box, there are some issues with that grinder.  \nI'm open to any other recommendations as well.   \nThank you and I hope you're having a great coffee day.",
        "created_utc": 1676378115,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reusable Pour Over?",
        "author": "sideshow_brett",
        "url": "https://www.reddit.com/r/Coffee/comments/11246dq/reusable_pour_over/",
        "text": "Hi there, just wondered if anyone has a recommendation for a good pour over with a metal filter? Paper is great, but I’m not keen on all of the waste, I have a Bodum with a mesh filter and it’s trash. Any help is appreciated! ☕️",
        "created_utc": 1676377599,
        "upvote_ratio": 1.0
    }
]