[
    {
        "title": "I would like to hear your suggestions. Finding the shortest path when there are multiple nodes with the distance between them is predefined",
        "author": "nikeshhv",
        "url": "https://www.reddit.com/r/compsci/comments/10oanz8/i_would_like_to_hear_your_suggestions_finding_the/",
        "text": "[removed]",
        "created_utc": 1675007186,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you know sys Module in Python?",
        "author": "Any-Willingness2683",
        "url": "https://www.reddit.com/r/compsci/comments/10o52qv/do_you_know_sys_module_in_python/",
        "text": "[removed]\n\n[View Poll](https://www.reddit.com/poll/10o52qv)",
        "created_utc": 1674989581,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone please explain. How will an electron microscope gain access to encrypted data?",
        "author": "Curious_Speech_5984",
        "url": "https://i.redd.it/tolz95l2uxea1.jpg",
        "text": "",
        "created_utc": 1674978688,
        "upvote_ratio": 1.0
    },
    {
        "title": "course study order",
        "author": "WarmToiletSeat0",
        "url": "https://www.reddit.com/r/compsci/comments/10nqy92/course_study_order/",
        "text": "Hello, I'm in my second year of cs and am currently planning out what courses\nI should be taking in the next three semesters.\nAll electives and programming courses were kinda easy to put in order, but now I'm stuck not knowing in what order I should be taking these three classes:\n-Computer arch and org\n-Operating systems\n-Compilers principles and techniques\n\nany advice would be of great help and thanks in advance",
        "created_utc": 1674943559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help organizing course study order",
        "author": "WarmToiletSeat0",
        "url": "https://www.reddit.com/r/compsci/comments/10nqxf5/need_help_organizing_course_study_order/",
        "text": "[removed]",
        "created_utc": 1674943498,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Cheat Sheet to Machine Learning Algorithms: Types, Applications, and Examples",
        "author": "Historical-Pen9653",
        "url": "https://medium.com/p/2992e295ee64",
        "text": "",
        "created_utc": 1674930683,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking Feedback: How to Improve My Cheat Sheet on Data Structures for Beginners in Computer Science",
        "author": "Historical-Pen9653",
        "url": "https://www.reddit.com/r/compsci/comments/10nlsrl/seeking_feedback_how_to_improve_my_cheat_sheet_on/",
        "text": "Hey everyone, I'm creating a cheat sheet for beginners in computer science that provides an overview of various data structures. The goal of this cheat sheet is to help beginners understand the different types of algorithms, their applications, and examples of how they are used. I would greatly appreciate any feedback on what else I can add to the cheat sheet to make it more useful for beginners. Please let me know your thoughts!\n\n[https://medium.com/p/5f0576b3150c](https://medium.com/p/5f0576b3150c)",
        "created_utc": 1674930375,
        "upvote_ratio": 1.0
    },
    {
        "title": "What he tries to do this time?",
        "author": "samdarielmaximustr",
        "url": "https://i.redd.it/a2nzp1x3stea1.jpg",
        "text": "",
        "created_utc": 1674929609,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any great beginner friendly python book recommendations?",
        "author": "Goinawolxo",
        "url": "https://www.reddit.com/r/compsci/comments/10njp7c/any_great_beginner_friendly_python_book/",
        "text": "[removed]",
        "created_utc": 1674924987,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't fear the spin lock",
        "author": "webbersmak",
        "url": "https://www.reddit.com/r/compsci/comments/10njcpe/dont_fear_the_spin_lock/",
        "text": "It's a common exercise in programming to synchronize access to data between threads. A simple mutex or other critical section tool will do the job. But sometimes, performance matters.\n\nThe problem with mutex's, or regular locks in high level languages, is that the waiting thread may be put to sleep since it cannot access the resource it wants.  And this behavior is usually desirable - except when it isn't.\n\nThere is a time cost associated with putting the waiting thread(s) to sleep and waking them when the resource is ready.\n\nA simple heuristic can be used to determine whether you should try to upgrade regular wait locks to spin locks. A spin lock is where the thread actively tries to access the shared resource and doesn't go to sleep.\n\n(h): if the shared resource is guaranteed to be locked for a sufficiently short period of time.\n\nWhile working in [Orvina](https://github.com/webbersmak/Orvina), performance increased dramatically with a careful selection of locks to upgrade to spin locks - and the effort was less trouble than what was expected.\n\nThere are likely many programs out in the wild that would experience real world benefits with more diligence in the choice of locking mechanism implemented. It would be quite the feat if compilers could deduce or suggest a specific lock type and insert the correct one. Perhaps that's one improvement AI will contribute to.",
        "created_utc": 1674924101,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips on how to study for Human-Computer interaction?",
        "author": "TekTekNa",
        "url": "https://www.reddit.com/r/compsci/comments/10nibj4/tips_on_how_to_study_for_humancomputer_interaction/",
        "text": "I personally find this course boring and not fun in any way but I got to do what I gotta do. Is there any better way of studying for this without having to read a big thick boring book? I am supposed to learn pretty much all the words concerning this topic and also about the design concepts etc for the exam. Reading the book is not working as I am losing interest faster than Usain Bolt runs his 100m.\n\n&amp;#x200B;\n\nI know there is no way of learning without actually learning but is there a YouTube channel you guys recommend, a summarized version the concepts or words with their definitions etc. Anything you guys think off hell yall can even recommend a book too tbh.",
        "created_utc": 1674921483,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who is happiest man in the world",
        "author": "Frosty-Drawer-3247",
        "url": "https://infolionthought.blogspot.com/2022/08/who-is-happiest-man-in-world.html",
        "text": "",
        "created_utc": 1674918887,
        "upvote_ratio": 1.0
    },
    {
        "title": "can we print without including stdio.h in gcc compiler? The code i tried is below does worked it online compiler but not offilne using gcc . *Accordiing to the book i was following just for printf and scanf we dont need to include stdio.h",
        "author": "niladrihati",
        "url": "https://www.reddit.com/r/compsci/comments/10ngc0p/can_we_print_without_including_stdioh_in_gcc/",
        "text": "///Progeam ADDITION \n\n///Written by EBG\n\nmain()\n\n{\n\n\tint number;\n\n\tfloat amount;\n\n\t\n\n\tnumber=100;\n\n\tamount=30.75+75.35;\n\n\tprintf(\"%d\\\\n\",number);\n\n\tprintf(\"%5.2f\",amount);\n\n}",
        "created_utc": 1674916120,
        "upvote_ratio": 1.0
    },
    {
        "title": "Work as Hard as You Can, Your Efforts will Be Forgotten...",
        "author": "N00DLES_3481",
        "url": "https://www.reddit.com/r/compsci/comments/10nezhe/work_as_hard_as_you_can_your_efforts_will_be/",
        "text": "[removed]",
        "created_utc": 1674912199,
        "upvote_ratio": 1.0
    },
    {
        "title": "1400+ Ai tools directory for researchers, developers, data scientists.",
        "author": "Subash_C_Mahato",
        "url": "https://www.aitoolhunt.com/",
        "text": "",
        "created_utc": 1674906855,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why have assignment helpers is become necessary for students academic needs?",
        "author": "bestassignmentx",
        "url": "https://www.reddit.com/r/compsci/comments/10nades/why_have_assignment_helpers_is_become_necessary/",
        "text": "[removed]",
        "created_utc": 1674895295,
        "upvote_ratio": 1.0
    },
    {
        "title": "Real world applications",
        "author": "Unhappy_Version7565",
        "url": "https://www.reddit.com/r/compsci/comments/10n8b3d/real_world_applications/",
        "text": "[removed]",
        "created_utc": 1674887559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Real world applications of AI",
        "author": "Unhappy_Version7565",
        "url": "https://www.reddit.com/r/compsci/comments/10n8a2i/real_world_applications_of_ai/",
        "text": "[removed]",
        "created_utc": 1674887458,
        "upvote_ratio": 1.0
    },
    {
        "title": "Diagram layout engines: Minimizing hierarchical edge crossings",
        "author": "terrastruct",
        "url": "https://terrastruct.com/blog/post/diagram-layout-engines-crossing-minimization/",
        "text": "",
        "created_utc": 1674878720,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does working as an IT Support Technician Count as Work Experience?",
        "author": "Master_Rock_6739",
        "url": "https://www.reddit.com/r/compsci/comments/10n2b20/does_working_as_an_it_support_technician_count_as/",
        "text": "[removed]",
        "created_utc": 1674869115,
        "upvote_ratio": 1.0
    },
    {
        "title": "The ChatGPT Effect: How advanced AI changes us. We are forced to search for assumptions (instead of raw information) and ask questions more than find answers for innovation, creativity, and progress because ChatGPT readily offers answers.",
        "author": "Iaskquesti0ns",
        "url": "https://cognitiontoday.com/the-chatgpt-effect-how-advanced-ai-changes-us/",
        "text": "",
        "created_utc": 1674852171,
        "upvote_ratio": 1.0
    },
    {
        "title": "COMP1010",
        "author": "Intelligent_Bit_498",
        "url": "https://www.reddit.com/r/compsci/comments/10mp99f/comp1010/",
        "text": "Can anyone help me with comp1010 distance learning. I failed in my first attempt and now I don’t want to fail again. Please any help is needed, in tutoring or anything. We can negotiate the prices and I’m ready to pay any amount you want",
        "created_utc": 1674837402,
        "upvote_ratio": 1.0
    },
    {
        "title": "What he tries to do this time?",
        "author": "samdarielmaximustr",
        "url": "https://i.redd.it/00piur160mea1.jpg",
        "text": "",
        "created_utc": 1674835464,
        "upvote_ratio": 1.0
    },
    {
        "title": "First year CS student, how much knowledge should I have...?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1674835259,
        "upvote_ratio": 1.0
    },
    {
        "title": "We released a Kaggle competition to train a text-based geolocation model 🌎📍",
        "author": "yachay_ai",
        "url": "https://www.reddit.com/r/compsci/comments/10mm5if/we_released_a_kaggle_competition_to_train_a/",
        "text": "The Kaggle competition includes a dataset of 500k annotated texts from around the world\n\n&amp;#x200B;\n\nYou can check out the Kaggle competition: [https://www.kaggle.com/competitions/text-based-geolocation/](https://www.kaggle.com/competitions/text-based-geolocation/)\n\nAlso, our Github is here: [https://github.com/1712n/yachay-public/tree/master/conf\\_geotagging\\_model](https://github.com/1712n/yachay-public/tree/master/conf_geotagging_model)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6l0tw51mflea1.png?width=957&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=da55db7e9abd692d0626359219462b2d3f2a453f",
        "created_utc": 1674829685,
        "upvote_ratio": 1.0
    },
    {
        "title": "⭕ What People Are Missing About Microsoft’s $10B Investment In OpenAI",
        "author": "LesleyFair",
        "url": "https://www.reddit.com/r/compsci/comments/10mhywn/what_people_are_missing_about_microsofts_10b/",
        "text": "&amp;#x200B;\n\n[Sam Altman Might Have Just Pulled Off The Coup Of The Decade](https://preview.redd.it/0342er6xekea1.png?width=720&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=73fa906b60db37b0c0779bc290f4e31346f98f9f)\n\nMicrosoft is investing $10B into OpenAI!\n\nThere is lots of frustration in the community about OpenAI not being all that open anymore. They appear to abandon their ethos of developing AI for everyone, [free](https://openai.com/blog/introducing-openai/) of economic pressures.\n\nThe fear is that OpenAI’s models are going to become fancy MS Office plugins. Gone would be the days of open research and innovation.\n\nHowever, the specifics of the deal tell a different story.\n\nTo understand what is going on, we need to peek behind the curtain of the tough business of machine learning. We will find that Sam Altman might have just orchestrated the coup of the decade!\n\nTo appreciate better why there is some three-dimensional chess going on, let’s first look at Sam Altman’s backstory.\n\n*Let’s go!*\n\n# A Stellar Rise\n\nBack in 2005, Sam Altman founded [Loopt](https://en.wikipedia.org/wiki/Loopt) and was part of the first-ever YC batch. He raised a total of $30M in funding, but the company failed to gain traction. Seven years into the business Loopt was basically dead in the water and had to be shut down.\n\nInstead of caving, he managed to sell his startup for $[43M](https://golden.com/wiki/Sam_Altman-J5GKK5) to the finTech company [Green Dot](https://www.greendot.com/). Investors got their money back and he personally made $5M from the sale.\n\nBy YC standards, this was a pretty unimpressive outcome.\n\nHowever, people took note that the fire between his ears was burning hotter than that of most people. So hot in fact that Paul Graham included him in his 2009 [essay](http://www.paulgraham.com/5founders.html?viewfullsite=1) about the five founders who influenced him the most.\n\nHe listed young Sam Altman next to Steve Jobs, Larry &amp; Sergey from Google, and Paul Buchheit (creator of GMail and AdSense). He went on to describe him as a strategic mastermind whose sheer force of will was going to get him whatever he wanted.\n\nAnd Sam Altman played his hand well!\n\nHe parleyed his new connections into raising $21M from Peter Thiel and others to start investing. Within four years he 10x-ed the money \\[2\\]. In addition, Paul Graham made him his successor as president of YC in 2014.\n\nWithin one decade of selling his first startup for $5M, he grew his net worth to a mind-bending $250M and rose to the circle of the most influential people in Silicon Valley.\n\nToday, he is the CEO of OpenAI — one of the most exciting and impactful organizations in all of tech.\n\nHowever, OpenAI — the rocket ship of AI innovation — is in dire straights.\n\n# OpenAI is Bleeding Cash\n\nBack in 2015, OpenAI was kickstarted with $1B in donations from famous donors such as Elon Musk.\n\nThat money is long gone.\n\nIn 2022 OpenAI is projecting a revenue of $36M. At the same time, they spent roughly $544M. Hence the company has lost &gt;$500M over the last year alone.\n\nThis is probably not an outlier year. OpenAI is headquartered in San Francisco and has a stable of 375 employees of mostly machine learning rockstars. Hence, salaries alone probably come out to be roughly $200M p.a.\n\nIn addition to high salaries their compute costs are stupendous. Considering it cost them $4.6M to train GPT3 once, it is likely that their cloud bill is in a very healthy nine-figure range as well \\[4\\].\n\nSo, where does this leave them today?\n\nBefore the Microsoft investment of $10B, OpenAI had received a total of $4B over its lifetime. With $4B in funding, a burn rate of $0.5B, and eight years of company history it doesn’t take a genius to figure out that they are running low on cash.\n\nIt would be reasonable to think: OpenAI is sitting on ChatGPT and other great models. Can’t they just lease them and make a killing?\n\nYes and no. OpenAI is projecting a revenue of $1B for 2024. However, it is unlikely that they could pull this off without significantly increasing their costs as well.\n\n*Here are some reasons why!*\n\n# The Tough Business Of Machine Learning\n\nMachine learning companies are distinct from regular software companies. On the outside they look and feel similar: people are creating products using code, but on the inside things can be very different.\n\nTo start off, machine learning companies are usually way less profitable. Their gross margins land in the 50%-60% range, much lower than those of SaaS businesses, which can be as high as 80% \\[7\\].\n\nOn the one hand, the massive compute requirements and thorny data management problems drive up costs.\n\nOn the other hand, the work itself can sometimes resemble consulting more than it resembles software engineering. Everyone who has worked in the field knows that training models requires deep domain knowledge and loads of manual work on data.\n\nTo illustrate the latter point, imagine the unspeakable complexity of performing content moderation on ChatGPT’s outputs. If OpenAI scales the usage of GPT in production, they will need large teams of moderators to filter and label hate speech, slurs, tutorials on killing people, you name it.\n\n*Alright, alright, alright! Machine learning is hard.*\n\n*OpenAI already has ChatGPT working. That’s gotta be worth something?*\n\n# Foundation Models Might Become Commodities:\n\nIn order to monetize GPT or any of their other models, OpenAI can go two different routes.\n\nFirst, they could pick one or more verticals and sell directly to consumers. They could for example become the ultimate copywriting tool and blow [Jasper](https://app.convertkit.com/campaigns/10748016/jasper.ai) or [copy.ai](https://app.convertkit.com/campaigns/10748016/copy.ai) out of the water.\n\nThis is not going to happen. Reasons for it include:\n\n1. To support their mission of building competitive foundational AI tools, and their huge(!) burn rate, they would need to capture one or more very large verticals.\n2. They fundamentally need to re-brand themselves and diverge from their original mission. This would likely scare most of the talent away.\n3. They would need to build out sales and marketing teams. Such a step would fundamentally change their culture and would inevitably dilute their focus on research.\n\nThe second option OpenAI has is to keep doing what they are doing and monetize access to their models via API. Introducing a [pro version](https://www.searchenginejournal.com/openai-chatgpt-professional/476244/) of ChatGPT is a step in this direction.\n\nThis approach has its own challenges. Models like GPT do have a defensible moat. They are just large transformer models trained on very large open-source datasets.\n\nAs an example, last week Andrej Karpathy released a [video](https://www.youtube.com/watch?v=kCc8FmEb1nY) of him coding up a version of GPT in an afternoon. Nothing could stop e.g. Google, StabilityAI, or HuggingFace from open-sourcing their own GPT.\n\nAs a result GPT inference would become a common good. This would melt OpenAI’s profits down to a tiny bit of nothing.\n\nIn this scenario, they would also have a very hard time leveraging their branding to generate returns. Since companies that integrate with OpenAI’s API control the interface to the customer, they would likely end up capturing all of the value.\n\nAn argument can be made that this is a general problem of foundation models. Their high fixed costs and lack of differentiation could end up making them akin to the [steel industry](https://www.thediff.co/archive/is-the-business-of-ai-more-like-steel-or-vba/).\n\nTo sum it up:\n\n* They don’t have a way to sustainably monetize their models.\n* They do not want and probably should not build up internal sales and marketing teams to capture verticals\n* They need a lot of money to keep funding their research without getting bogged down by details of specific product development\n\n*So, what should they do?*\n\n# The Microsoft Deal\n\nOpenAI and Microsoft [announced](https://blogs.microsoft.com/blog/2023/01/23/microsoftandopenaiextendpartnership/) the extension of their partnership with a $10B investment, on Monday.\n\nAt this point, Microsoft will have invested a total of $13B in OpenAI. Moreover, new VCs are in on the deal by buying up shares of employees that want to take some chips off the table.\n\nHowever, the astounding size is not the only extraordinary thing about this deal.\n\nFirst off, the ownership will be split across three groups. Microsoft will hold 49%, VCs another 49%, and the OpenAI foundation will control the remaining 2% of shares.\n\nIf OpenAI starts making money, the profits are distributed differently across four stages:\n\n1. First, early investors (probably Khosla Ventures and Reid Hoffman’s foundation) get their money back with interest.\n2. After that Microsoft is entitled to 75% of profits until the $13B of funding is repaid\n3. When the initial funding is repaid, Microsoft and the remaining VCs each get 49% of profits. This continues until another $92B and $150B are paid out to Microsoft and the VCs, respectively.\n4. Once the aforementioned money is paid to investors, 100% of shares return to the foundation, which regains total control over the company. \\[3\\]\n\n# What This Means\n\nThis is absolutely crazy!\n\nOpenAI managed to solve all of its problems at once. They raised a boatload of money and have access to all the compute they need.\n\nOn top of that, they solved their distribution problem. They now have access to Microsoft’s sales teams and their models will be integrated into MS Office products.\n\nMicrosoft also benefits heavily. They can play at the forefront AI, brush up their tools, and have OpenAI as an exclusive partner to further compete in a [bitter cloud war](https://www.projectpro.io/article/aws-vs-azure-who-is-the-big-winner-in-the-cloud-war/401) against AWS.\n\nThe synergies do not stop there.\n\nOpenAI as well as GitHub (aubsidiary of Microsoft) e. g. will likely benefit heavily from the partnership as they continue to develop[ GitHub Copilot](https://github.com/features/copilot).\n\nThe deal creates a beautiful win-win situation, but that is not even the best part.\n\nSam Altman and his team at OpenAI essentially managed to place a giant hedge. If OpenAI does not manage to create anything meaningful or we enter a new AI winter, Microsoft will have paid for the party.\n\nHowever, if OpenAI creates something in the direction of AGI — whatever that looks like — the value of it will likely be huge.\n\nIn that case, OpenAI will quickly repay the dept to Microsoft and the foundation will control 100% of whatever was created.\n\n*Wow!*\n\nWhether you agree with the path OpenAI has chosen or would have preferred them to stay donation-based, you have to give it to them.\n\n*This deal is an absolute power move!*\n\nI look forward to the future. Such exciting times to be alive!\n\nAs always, I really enjoyed making this for you and I sincerely hope you found it useful!\n\n*Thank you for reading!*\n\nWould you like to receive an article such as this one straight to your inbox every Thursday? Consider signing up for **The Decoding** ⭕.\n\nI send out a thoughtful newsletter about ML research and the data economy once a week. No Spam. No Nonsense. [Click here to sign up!](https://thedecoding.net/)\n\n**References:**\n\n\\[1\\] [https://golden.com/wiki/Sam\\_Altman-J5GKK5](https://golden.com/wiki/Sam_Altman-J5GKK5)​\n\n\\[2\\] [https://www.newyorker.com/magazine/2016/10/10/sam-altmans-manifest-destiny](https://www.newyorker.com/magazine/2016/10/10/sam-altmans-manifest-destiny)​\n\n\\[3\\] [Article in Fortune magazine ](https://fortune.com/2023/01/11/structure-openai-investment-microsoft/?verification_code=DOVCVS8LIFQZOB&amp;_ptid=%7Bkpdx%7DAAAA13NXUgHygQoKY2ZRajJmTTN6ahIQbGQ2NWZsMnMyd3loeGtvehoMRVhGQlkxN1QzMFZDIiUxODA3cnJvMGMwLTAwMDAzMWVsMzhrZzIxc2M4YjB0bmZ0Zmc0KhhzaG93T2ZmZXJXRDFSRzY0WjdXRTkxMDkwAToMT1RVVzUzRkE5UlA2Qg1PVFZLVlpGUkVaTVlNUhJ2LYIA8DIzZW55eGJhajZsWiYyYTAxOmMyMzo2NDE4OjkxMDA6NjBiYjo1NWYyOmUyMTU6NjMyZmIDZG1jaOPAtZ4GcBl4DA)​\n\n\\[4\\] [https://arxiv.org/abs/2104.04473](https://arxiv.org/abs/2104.04473) Megatron NLG\n\n\\[5\\] [https://www.crunchbase.com/organization/openai/company\\_financials](https://www.crunchbase.com/organization/openai/company_financials)​\n\n\\[6\\] Elon Musk donation [https://www.inverse.com/article/52701-openai-documents-elon-musk-donation-a-i-research](https://www.inverse.com/article/52701-openai-documents-elon-musk-donation-a-i-research)​\n\n\\[7\\] [https://a16z.com/2020/02/16/the-new-business-of-ai-and-how-its-different-from-traditional-software-2/](https://a16z.com/2020/02/16/the-new-business-of-ai-and-how-its-different-from-traditional-software-2/)",
        "created_utc": 1674816406,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going into my first year of CS this fall: looking for a new laptop!",
        "author": "kilawnaa",
        "url": "https://www.reddit.com/r/compsci/comments/10md0hw/going_into_my_first_year_of_cs_this_fall_looking/",
        "text": "[removed]",
        "created_utc": 1674796810,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a zip tree, and how does it work?",
        "author": "pncnmnp",
        "url": "https://stackoverflow.com/questions/61944198/what-is-a-zip-tree-and-how-does-it-work",
        "text": "",
        "created_utc": 1674789572,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you guys please give me some help with this. Thank you:)",
        "author": "FlashyDoor4606",
        "url": "https://i.redd.it/g4mjewae1iea1.jpg",
        "text": "",
        "created_utc": 1674787447,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alternative to SMTP server",
        "author": "synnin_",
        "url": "https://www.reddit.com/r/compsci/comments/10m6zyd/alternative_to_smtp_server/",
        "text": "Apologies if this isn't the right place for this but I need some advice. (Also sorry for formatting, on mobile)\n\nI have some code running on one machine and would like to automatically send the results of this to another somewhere else.\n\nMy first thought was email, giving me an excuse to try setting up an SMTP server.\n\nI have no idea how many better options I'm missing here so any suggestions or tips would be appreciated.",
        "created_utc": 1674778649,
        "upvote_ratio": 1.0
    },
    {
        "title": "PhD Data Analytics Topic - skill development",
        "author": "Meteora_10010101",
        "url": "https://www.reddit.com/r/compsci/comments/10m0xsq/phd_data_analytics_topic_skill_development/",
        "text": "[removed]",
        "created_utc": 1674763218,
        "upvote_ratio": 1.0
    },
    {
        "title": "Assist with Storage Migration from DDN Gridscaler GPFS+WOS to VAST",
        "author": "DelilahMaloney",
        "url": "https://www.reddit.com/r/compsci/comments/10lvk5n/assist_with_storage_migration_from_ddn_gridscaler/",
        "text": "[removed]",
        "created_utc": 1674749815,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Are Programming Languages Invent?",
        "author": "ARFASOFTECH",
        "url": "https://www.arfasoftech.com/blog/How-Are-Programming-Languages-Invent?",
        "text": "",
        "created_utc": 1674745191,
        "upvote_ratio": 1.0
    },
    {
        "title": "What he tries to do this time?",
        "author": "samdarielmaximustr",
        "url": "https://i.redd.it/qmzgkj5rydea1.jpg",
        "text": "",
        "created_utc": 1674738133,
        "upvote_ratio": 1.0
    },
    {
        "title": "AI agent plays Chrome Dino",
        "author": "Simple-Sorbet8064",
        "url": "https://i.redd.it/7aovo6fwudea1.gif",
        "text": "",
        "created_utc": 1674736834,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Coder's Evolution: Charting My Journey as A First time Coder",
        "author": "yash_60066",
        "url": "https://yash60066.hashnode.dev/a-coders-evolution-charting-my-journey-as-a-first-time-coder",
        "text": "",
        "created_utc": 1674713179,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why writing an MBA assignment is so difficult for students?",
        "author": "bestassignmentx",
        "url": "https://www.reddit.com/r/compsci/comments/10kwk20/why_writing_an_mba_assignment_is_so_difficult_for/",
        "text": "[removed]",
        "created_utc": 1674646247,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bought one of the classics",
        "author": "TargetSuch315",
        "url": "https://i.redd.it/d3wy4bu976ea1.jpg",
        "text": "",
        "created_utc": 1674644136,
        "upvote_ratio": 1.0
    },
    {
        "title": "What he tries to do this time?",
        "author": "samdarielmaximustr",
        "url": "https://i.redd.it/z8je93r4r5ea1.jpg",
        "text": "",
        "created_utc": 1674638715,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it worthwhile studying Computer Science - Computer Systems?",
        "author": "MoFlavour",
        "url": "https://www.reddit.com/r/compsci/comments/10kqw6x/is_it_worthwhile_studying_computer_science/",
        "text": "Studying Bsc Comp Sci - Computer Systems?\n\nHi everyone! I'm starting my Bsc computer Science degree this year, and I could study Comp Sci (Bsc Comp Sci - Computer Systems), but I'm not sure how relevant/helpful it would be to my career. \n\nThe stream of course has all the compulsory programming modules, but also a lot of applied mathematics, engineering mathematics(2nd year), physics modules.\n\nIt also has 4 Electrical Engineering modules, Systems and Signals (which have the following content):\n\n 1. \"Sinusoidal steady-state analysis; phasors; sinusoidal power and energy concepts; transient and phasor analysis of second-order  RLC circuits; instantaneous and average power; ideal operational amplifiers; two-port parameters.\"\n\n2.  The Laplace transform and its application to dynamic circuits; impulse and step response; convolution; transfer functions; Bode  plots; basic passive filters; basic active filters; Fourier series and its application to circuits; Fourier transform and its applications  to circuits; filters. \n\nAnd two Computer Systems modules: \n\n 1. Boolean algebra; combinational and sequential circuit analysis and design; state machines; central processing unit; assembler  language programming. \n\n2.  Microprocessor programming; basic microprocessor architecture; bus, memory and input-output systems.  \n\n&amp;#x200B;\n\nDo you guys think learning these modules would open more doors for me in job searching, in comparision to taking other electives like Operations Research or doing more pure mathematics instead? I'm not very familiar to the content of Computer Systems and Systems and Signals modules, so I'm not sure how it would impact any job that I get.\n\nAny advice would be really appreciated.",
        "created_utc": 1674623784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there an approximation algorithm for time bounded Kolmogorov complexity?",
        "author": "Virtual-Finish-1819",
        "url": "https://www.reddit.com/r/compsci/comments/10kqmlh/is_there_an_approximation_algorithm_for_time/",
        "text": "Time bounded Kolmogorov complexity is known to be NP-complete. But is there a polynomial time approximation algorithm that at least approximates it to a polynomial factor?",
        "created_utc": 1674622887,
        "upvote_ratio": 1.0
    },
    {
        "title": "i asked a compsci major out for coffee... what should i do next?",
        "author": "caffeinatedthinker",
        "url": "https://www.reddit.com/r/compsci/comments/10kqjh4/i_asked_a_compsci_major_out_for_coffee_what/",
        "text": "[removed]",
        "created_utc": 1674622634,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which has a higher time complexity: n^(sqrt(n)) or (n!) ?",
        "author": "BeyondSouthern4295",
        "url": "https://www.reddit.com/r/compsci/comments/10knsl1/which_has_a_higher_time_complexity_nsqrtn_or_n/",
        "text": "",
        "created_utc": 1674614142,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics or economics as a secondary course?",
        "author": "Diamond-Pamnther",
        "url": "https://www.reddit.com/r/compsci/comments/10kjts4/physics_or_economics_as_a_secondary_course/",
        "text": "[removed]",
        "created_utc": 1674603149,
        "upvote_ratio": 1.0
    },
    {
        "title": "Compiling/optimization question",
        "author": "The-Absentee",
        "url": "https://www.reddit.com/r/compsci/comments/10kh9m6/compilingoptimization_question/",
        "text": "Hi!\n\nIf I am compiling the same source code on two computers (system A and B) having different hardware (x86_64 processors still) but on the same OS having same packages (compilers and libraries), using same compiler flags and so forth, would the result of the compilation be any different?\n\nIf i then I decide to transfer the binary compiled on system A to the system B (or the other way), would it be \"less optimal\" or any different to run it from there (and why so)?\n\nThanks!",
        "created_utc": 1674596827,
        "upvote_ratio": 1.0
    },
    {
        "title": "KHyperLogLog",
        "author": "pncnmnp",
        "url": "https://pncnmnp.github.io/blogs/khyperloglog.html",
        "text": "",
        "created_utc": 1674596457,
        "upvote_ratio": 1.0
    },
    {
        "title": "[video] TLS 1.3 Explained",
        "author": "lucian-12",
        "url": "https://youtu.be/THxIyHz191A",
        "text": "",
        "created_utc": 1674585888,
        "upvote_ratio": 1.0
    },
    {
        "title": "I run a fully automated YouTube channel on my Raspberry Pi",
        "author": "amirdol7",
        "url": "https://medium.com/@amir-tech/i-run-a-fully-automated-youtube-channel-on-my-raspberry-pi-cf23ad79d8a7",
        "text": "",
        "created_utc": 1674579065,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any machines that are powerful than Turing machines or has violated the Church-Turing hypothesis?",
        "author": "Competitive_Fudge_96",
        "url": "https://www.reddit.com/r/compsci/comments/10k9ucv/are_there_any_machines_that_are_powerful_than/",
        "text": "Basically the title.",
        "created_utc": 1674578849,
        "upvote_ratio": 1.0
    },
    {
        "title": "VPN Connecting to a certain networks.",
        "author": "Realistic-Lychee1941",
        "url": "https://www.reddit.com/r/compsci/comments/10k772g/vpn_connecting_to_a_certain_networks/",
        "text": "Is it possible to use VPN  to connect to a network (school, work etc.) to use software that uses floating license on that network?",
        "created_utc": 1674571882,
        "upvote_ratio": 1.0
    },
    {
        "title": "What design related PG degree I can do after Bsc Comp Sci?",
        "author": "orion_x_",
        "url": "https://www.reddit.com/r/compsci/comments/10k4vd8/what_design_related_pg_degree_i_can_do_after_bsc/",
        "text": "Hi. I'm at my final year Bsc Computer Science and I'm weak in technical side like programming but I've good creative mind like designing so what are the options available for me to take Post Graduate degree related to Design field after completing Bsc Comp Sci. If there's not any options then would you suggest me what are the available course suitable for me.",
        "created_utc": 1674565072,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts and",
        "author": "shadowfate1",
        "url": "https://www.reddit.com/r/compsci/comments/10jsynz/thoughts_and/",
        "text": "",
        "created_utc": 1674521931,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saw this notification twice, checked settings and they both say different things. What do i trust?",
        "author": "Goliath-Grower",
        "url": "https://www.reddit.com/gallery/10jn1fd",
        "text": "",
        "created_utc": 1674506863,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Are You Guys ????",
        "author": "Rare-Draft4467",
        "url": "https://www.reddit.com/r/compsci/comments/10jk8rm/how_are_you_guys/",
        "text": "",
        "created_utc": 1674500114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asked Dall-E to make the most realistic image. Here is the result. With what logic it could possibly make this picture? A picture of a golden sphere.",
        "author": "pandamin-",
        "url": "https://i.redd.it/4xs9nlze8uda1.jpg",
        "text": "",
        "created_utc": 1674499355,
        "upvote_ratio": 1.0
    },
    {
        "title": "#lamo",
        "author": "Rare-Draft4467",
        "url": "https://www.reddit.com/r/compsci/comments/10jfwko/lamo/",
        "text": "",
        "created_utc": 1674489684,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Drop everything and focus entirely on AI\" says StabilityAI CEO",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1674488966,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Neural Nets Underperform Tree-Based Models on Tabular Data",
        "author": "Personal-Trainer-541",
        "url": "https://www.reddit.com/r/compsci/comments/10jf8wy/why_neural_nets_underperform_treebased_models_on/",
        "text": "Hi guys,\n\nI have made a video on YouTube [here](https://youtu.be/e62CBva4TYc) where I discuss about why deep neural networks fail to beat tree-based models on tabular datasets.\n\nI hope it may be of use to some of you out there. As always, feedback is more than welcomed! :)",
        "created_utc": 1674488058,
        "upvote_ratio": 1.0
    },
    {
        "title": "What went wrong here? I'm trying to learn the CORDIC algorithm for SIN and COS. I got the correct value for COS, but SIN is way off",
        "author": "AnimusFoxx",
        "url": "https://i.imgur.com/Ljayw1X.jpg",
        "text": "",
        "created_utc": 1674475882,
        "upvote_ratio": 1.0
    },
    {
        "title": "A steal for $10, I’m overjoyed",
        "author": "GroundbreakingPop596",
        "url": "https://i.redd.it/ht5oj94kxrda1.jpg",
        "text": "",
        "created_utc": 1674471372,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inspired by self assembling robot swarms, i made a simple implementation of Area Covering Particle Swarm",
        "author": "photon_cruncher",
        "url": "https://youtu.be/cQqxLHP3em0",
        "text": "",
        "created_utc": 1674466679,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to benchmark a programming language",
        "author": "thepoluboy",
        "url": "https://www.reddit.com/r/compsci/comments/10j3xod/how_to_benchmark_a_programming_language/",
        "text": "I am working on building a programming language. The interpreter is written in Go.\n\nIs there a way to benchmark programs written in that language vs the same program written in other programming language. For example a fibonacci program written in that language vs a fibonacci program written in Python",
        "created_utc": 1674448675,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on low-cost camera solutions",
        "author": "zacky2004",
        "url": "https://www.reddit.com/r/compsci/comments/10j01zo/advice_on_lowcost_camera_solutions/",
        "text": "[removed]",
        "created_utc": 1674436787,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to learn programming from scratch in a interesting way so that i can make foundation strong ? Any suggestions",
        "author": "dubeyt4",
        "url": "https://www.reddit.com/r/compsci/comments/10ixrf5/how_to_learn_programming_from_scratch_in_a/",
        "text": "",
        "created_utc": 1674430357,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do y’all think Universities will handle cheating with AI like this? I remember wanting to bash my head in trying to learn Scheme in my functional programming course.",
        "author": "notenoughbooze",
        "url": "https://v.redd.it/olohzld45pda1",
        "text": "",
        "created_utc": 1674419591,
        "upvote_ratio": 1.0
    },
    {
        "title": "Graduating with a software engineering degree in a month. What to do now?",
        "author": "Ambitious_Credit_591",
        "url": "https://www.reddit.com/r/compsci/comments/10iscjx/graduating_with_a_software_engineering_degree_in/",
        "text": "Graduating with a software engineering degree in a month. Got no internship experience due to depression, life problems and so, self-sabotage. Now trying to build myself up but got financial problems, where I have to work in order to pay my bills and house rent. Been battling with financial issues my whole life and got no time to live like my ages. (23)\n\nIs it possible for me to get a software dev job in a few months? if yes, how.. someone please share an insight. I feel so lost and dumb in life, where everything started to seem so abstract. At this point I just need a serious advice. Thank you.",
        "created_utc": 1674416881,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made a scalable version of Tetris, it has a comforting late 2000s flash game vibe.",
        "author": "Earthly-Humus",
        "url": "https://github.com/frozennuts/Scaleable-Tetris",
        "text": "",
        "created_utc": 1674416222,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tutorial: Setting up CI/CD Pipeline for a React app using Travis CI",
        "author": "indian_dev",
        "url": "https://codingchronicles.adityakarad.com/ci-cd-for-react-project-using-travis-ci",
        "text": "",
        "created_utc": 1674410654,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Make Games. Now I Want To Learn Making AI",
        "author": "Material-Capital5933",
        "url": "https://www.reddit.com/r/compsci/comments/10in08m/i_make_games_now_i_want_to_learn_making_ai/",
        "text": "Hi. I've been making games in Unity with C# for almost a year, so I have some experience in programming. My favorite part of making games is making AI, so I'm considering going that route. \n\nI have some questions though:\n\n1)How much time would you say it'd take for me to start working? Take into consideration that I'm planning to get a part-time job. \n\n2)Do you think I can learn while working? \n\n3)How much harder is it to make AI than it is to make games? \n\n4)How much math goes into it? \n\n5)I live in a small country where there's not many programming (especially AI) related jobs. How difficult will it be to find remote jobs?\n\n6)How hard is it to get a job in AI programming?\n\nIf anyone has answers to any of these questions, please help.",
        "created_utc": 1674403523,
        "upvote_ratio": 1.0
    },
    {
        "title": "मैं तो दे दी बालम बहरे नूँ | Sant Rampal Ji Satsang | SATLOK ASHRAM",
        "author": "ConstructionNo4722",
        "url": "https://youtu.be/vLSTLILkq1w",
        "text": "",
        "created_utc": 1674401912,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adamu: Music composition using artificial inteligence",
        "author": "GloWondub",
        "url": "https://www.reddit.com/r/compsci/comments/10ijutm/adamu_music_composition_using_artificial/",
        "text": "My friend who has just finished his neuroscience Phd is trying to launch an app to help everyone compose music using AI, he is making a crowdfunding on wemakeit to fund it.\n\nHe is not on reddit, so I suggested that I could share it in relevant subreddit, so here it is !\n\nhttps://wemakeit.com/projects/adamu-be-your-own-composer?locale=en\n\nAdamu uses a form of AI which allows it to learn from existing human knowledge of music and musical theory and apply those frameworks to new compositions. Where it might take you years of training to understand the intricacies of how to successfully compose music, with Adamu, it’s as simple as a couple of clicks.\n\nWhile there are a couple of automated applications on the market, they tend to be more passive. Adamu is dynamic – it allows users the chance to co-create music alongside AI and produce a playable score at the end. With Adamu, professionals and amateurs alike can create unique musical scores for a range of different instruments and across different styles. The AI training works with the user to predict the best combination of notes and rhythms, ensuring your new composition always sounds the way it should.\n\nThe application has many potential uses – from original scores for concerts and videos to teaching music composition. You can even use Adamu to discover how different composers might have played your favorite tune!\n\nI already used Adamu to complete Beethoven’s unfinished 10th symphony (in one day!). What could be next?\n\nhttps://adamu.tech/\n\nIf you have any questions, I will make sure to forward them to him but getting responses back may take some time.",
        "created_utc": 1674394670,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best laptop for a comp-sci student?",
        "author": "Ollie757",
        "url": "https://www.reddit.com/r/compsci/comments/10ii330/best_laptop_for_a_compsci_student/",
        "text": "[removed]",
        "created_utc": 1674388699,
        "upvote_ratio": 1.0
    },
    {
        "title": "I will pay someone to help me with my programming 1 class. Midterm is coming up soon and I am still confused on the basics. HELP WANTED!!! The language is java that we are using.",
        "author": "No_Season4944",
        "url": "https://www.reddit.com/r/compsci/comments/10icbtu/i_will_pay_someone_to_help_me_with_my_programming/",
        "text": "",
        "created_utc": 1674366421,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the complexity of logspace bounded kolmogorov complexity?",
        "author": "Royal_Instance_7172",
        "url": "https://www.reddit.com/r/compsci/comments/10iaai0/what_is_the_complexity_of_logspace_bounded/",
        "text": "Given a bit string s and an integer n, is there a Turing machine of size at most n that outputs s in at most |s| space? It is known that this problem is PSPACE-complete and its time variant is NP-complete. Is there any information available about the logspace bounded Kolmogorov complexity of this problem?",
        "created_utc": 1674359534,
        "upvote_ratio": 1.0
    },
    {
        "title": "@dorbus/flexboard: React component library for re-sizable sidebars",
        "author": "DredditorS",
        "url": "https://github.com/dorbus/flexboard",
        "text": "",
        "created_utc": 1674325687,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on what program to build?",
        "author": "buffoonballs",
        "url": "https://www.reddit.com/r/compsci/comments/10ho608/advice_on_what_program_to_build/",
        "text": "Hello! I’m currently a CS bachelor student and would like to start preparing for my bachelors thesis program soon. The requirements for my “thesis” is to create a program with minimum 3000 lines of code, along with its documentation in at least 30 pages. \n\nAs this may be overwhelming to many students like me, I’m ready to take on the challenge, but would like to ask for advice on what types of programs are fit for a bachelors thesis, i’m a beginner programmer and plan on building myself a personal website portfolio using HTML/CSS/JS but that is just a personal project, nothing near a thesis, but would these skills maybe help in a specific program that i could build? \n\nTLDR- I would appreciate advice on what types of ‘3000 lines of code’ program i could build for my bachelors thesis. A program that will in the future help me in job opportunities and also improve my coding skills. :)",
        "created_utc": 1674296452,
        "upvote_ratio": 1.0
    },
    {
        "title": "Outdoor IT Jobs?",
        "author": "WarrenGhost",
        "url": "https://www.reddit.com/r/compsci/comments/10h7zbi/outdoor_it_jobs/",
        "text": "Hi everyone.\nSo I am a 25 year old computer science major currently living in Utah. I graduate college in 3 months and have been working as a software engineer part time for the past six years. The work was fine but the subject matter (SaaS) and sitting at a desk 40 hours a week has offically drained me. I love being outside and find it really fulfilling. I'm also really passionate about environmental conservation and the work the US Forest Service and BLM do. The only problem is I am about to graduate and not looking to spend an additional 4 years pivoting my education.\nSo I am trying to combine my love of the outdoors with technology. I enjoy working with technology but not at the cost of sitting in a chair for the rest of my life. However I am having trouble finding a job that fits that description. I have a little experience volunteering for the US Forest Service but that's all. I am open to most jobs but I would like to live somewhere with plenty of hiking around.\nIf anybody has any ideas for me I would be very interested. Thanks!",
        "created_utc": 1674248359,
        "upvote_ratio": 1.0
    },
    {
        "title": "PDF or Physical Books?",
        "author": "Fit-Translator-5817",
        "url": "https://www.reddit.com/r/compsci/comments/10h7je0/pdf_or_physical_books/",
        "text": "Art of Computer Programming, The, Volumes 1-4B are over $300 right now. \n\n&amp;#x200B;\n\nHow frequently does volume 1-3 update? If update happen often, I should probably buy the cheaper PDF.",
        "created_utc": 1674247213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does nVidia Deepstream provide any information on how far from the camera an object is out of the box?",
        "author": "lonelypenguin20",
        "url": "https://www.reddit.com/r/compsci/comments/10h29qd/does_nvidia_deepstream_provide_any_information_on/",
        "text": "Maybe I'm dumb but I cannot find any info on how to get 3d coordinates out of an object. I've only found how to get the bounding box, which describes where the object is on the frame, but I need the depth, too.",
        "created_utc": 1674234520,
        "upvote_ratio": 1.0
    },
    {
        "title": "[HELP] Writing context-free grammar for assignment statement with boolean/arithmetic expression",
        "author": "yuriuseu",
        "url": "https://www.reddit.com/r/compsci/comments/10gzy5g/help_writing_contextfree_grammar_for_assignment/",
        "text": "I'm just a hobbyist with very little knowledge in grammar writing in general. I wrote this custom grammar and would like to know if the syntax is correct before writing the actual parser for it.\n\nThe syntax I want to achieve is just a single variable assignment statement that accept an expression like binary operation with arithmetic or boolean operation, as well as, unary operation with positive/negative operand or with leading `!` (NOT) boolean operator:\n\n```\nstatement  = assignment\nassignment = variable '=' expression\nexpression = (group|unary|binary|constant)\ngroup      = '(' expression ')'\nunary      = ('!'|'+'|'-') (constant|variable|group)\nbinary     = (boolean|arithmetic)\nboolean    = expression (('=='|'!='|'&lt;'|'&lt;='|'&gt;='|'&gt;'|'&amp;&amp;'|'||') expression)+\narithmetic = term (('+'|'-') term)+\nterm       = factor (('*'|'/') factor)+\nfactor     = (constant|variable|expression)\nconstant   = [1-9][0-9]*\nvariable   = [a-z]+\n````",
        "created_utc": 1674228964,
        "upvote_ratio": 1.0
    },
    {
        "title": "Infinite Tetris is Turing-complete",
        "author": "zeroone",
        "url": "https://meatfighter.com/tetromino-computer/",
        "text": "",
        "created_utc": 1674225987,
        "upvote_ratio": 1.0
    },
    {
        "title": "What math should I take if i want to major in comp sci? !fast reply’s please!",
        "author": "roroklol",
        "url": "https://www.reddit.com/r/compsci/comments/10gyp66/what_math_should_i_take_if_i_want_to_major_in/",
        "text": "[removed]",
        "created_utc": 1674225881,
        "upvote_ratio": 1.0
    },
    {
        "title": "How To Prepare For A Layoff ?",
        "author": "seeking_facts",
        "url": "https://dev.to/onlydevs_/how-to-prepare-for-a-layoff--ijo",
        "text": "",
        "created_utc": 1674208608,
        "upvote_ratio": 1.0
    },
    {
        "title": "Introduction to software development and programming in Bangla",
        "author": "emanu2021",
        "url": "https://www.youtube.com/watch?v=k-fwF1yDtzY&amp;list=PLPZa8T7fnidMXxh-ANm0rlyl5eNR_zt9U&amp;index=4",
        "text": "",
        "created_utc": 1674191656,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help with ER diagrams (I am a begginer)",
        "author": "IshakM8",
        "url": "https://www.reddit.com/r/compsci/comments/10ghdy0/i_need_help_with_er_diagrams_i_am_a_begginer/",
        "text": "[removed]",
        "created_utc": 1674172539,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paid UX Research Study",
        "author": "WereAllMad",
        "url": "https://www.reddit.com/r/compsci/comments/10gceb9/paid_ux_research_study/",
        "text": "[removed]",
        "created_utc": 1674160387,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bio-Inspired Optical flow",
        "author": "s_arme",
        "url": "https://levelup.gitconnected.com/bio-inspired-optical-flow-a236a4cac8f8",
        "text": "",
        "created_utc": 1674150688,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switching Careers",
        "author": "DasEdud",
        "url": "https://www.reddit.com/r/compsci/comments/10g5sqg/switching_careers/",
        "text": "So, been failing my accounting course by inches every time I give exams. I've always had an interest in automation and A.I. not necessarily with developing programs and being a programmer for companies and being the back or front end and stuff. But I do like the idea of automating and writing few lines of code that would automate some accounts work and provide value to businesses. I am however stuck between choosing from Information Systems and Computer Science. I've researched a little bit and I saw people saying that CS would be much better than IS. Is that the case?\n\nTL/DR: failing accounts, don't feel like giving exams, switching to something that actually interests me, should that be IS or CS?",
        "created_utc": 1674145147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chronological list of Resources to Learn Data Science from Complete Beginner to Advanced Level",
        "author": "glum-platimium",
        "url": "https://www.codelivly.com/resources-to-learn-data-science-from-complete-beginner-to-advanced-level/",
        "text": "",
        "created_utc": 1674141067,
        "upvote_ratio": 1.0
    },
    {
        "title": "CHM releases Apple Lisa sources today!",
        "author": "GardenHill",
        "url": "https://www.reddit.com/gallery/10g354z",
        "text": "",
        "created_utc": 1674138714,
        "upvote_ratio": 1.0
    },
    {
        "title": "GPT-4 Will Be 500x Smaller Than People Think - Here Is Why",
        "author": "LesleyFair",
        "url": "https://www.reddit.com/r/compsci/comments/10fw0vm/gpt4_will_be_500x_smaller_than_people_think_here/",
        "text": "&amp;#x200B;\n\n[Number Of Parameters GPT-3 vs. GPT-4](https://preview.redd.it/00taoi7kgyca1.png?width=575&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=7c8ba138c086778ce0559e585927a0624a8c584f)\n\nThe rumor mill is buzzing around the release of GPT-4.\n\nPeople are predicting the model will have 100 trillion parameters. That’s a *trillion* with a “t”.\n\nThe often-used graphic above makes GPT-3 look like a cute little breadcrumb that is about to have a live-ending encounter with a bowling ball.\n\nSure, OpenAI’s new brainchild will certainly be mind-bending and language models have been getting bigger — fast!\n\nBut this time might be different and it makes for a good opportunity to look at the research on scaling large language models (LLMs).\n\n*Let’s go!*\n\nTraining 100 Trillion Parameters\n\nThe creation of GPT-3 was a marvelous feat of engineering. The training was done on 1024 GPUs, took 34 days, and cost $4.6M in compute alone \\[1\\].\n\nTraining a 100T parameter model on the same data, using 10000 GPUs, would take 53 Years. To avoid overfitting such a huge model the dataset would also need to be much(!) larger.\n\nSo, where is this rumor coming from?\n\nThe Source Of The Rumor:\n\nIt turns out OpenAI itself might be the source of it.\n\nIn August 2021 the CEO of Cerebras told [wired](https://www.wired.com/story/cerebras-chip-cluster-neural-networks-ai/): “From talking to OpenAI, GPT-4 will be about 100 trillion parameters”.\n\nA the time, that was most likely what they believed, but that was in 2021. So, basically forever ago when machine learning research is concerned.\n\nThings have changed a lot since then!\n\nTo understand what happened we first need to look at how people decide the number of parameters in a model.\n\nDeciding The Number Of Parameters:\n\nThe enormous hunger for resources typically makes it feasible to train an LLM only once.\n\nIn practice, the available compute budget (how much money will be spent, available GPUs, etc.) is known in advance. Before the training is started, researchers need to accurately predict which hyperparameters will result in the best model.\n\n*But there’s a catch!*\n\nMost research on neural networks is empirical. People typically run hundreds or even thousands of training experiments until they find a good model with the right hyperparameters.\n\nWith LLMs we cannot do that. Training 200 GPT-3 models would set you back roughly a billion dollars. Not even the deep-pocketed tech giants can spend this sort of money.\n\nTherefore, researchers need to work with what they have. Either they investigate the few big models that have been trained or they train smaller models in the hope of learning something about how to scale the big ones.\n\nThis process can very noisy and the community’s understanding has evolved a lot over the last few years.\n\nWhat People Used To Think About Scaling LLMs\n\nIn 2020, a team of researchers from OpenAI released a [paper](https://arxiv.org/pdf/2001.08361.pdf) called: “Scaling Laws For Neural Language Models”.\n\nThey observed a predictable decrease in training loss when increasing the model size over multiple orders of magnitude.\n\nSo far so good. But they made two other observations, which resulted in the model size ballooning rapidly.\n\n1. To scale models optimally the parameters should scale quicker than the dataset size. To be exact, their analysis showed when increasing the model size 8x the dataset only needs to be increased 5x.\n2. Full model convergence is not compute-efficient. Given a fixed compute budget it is better to train large models shorter than to use a smaller model and train it longer.\n\nHence, it seemed as if the way to improve performance was to scale models faster than the dataset size \\[2\\].\n\nAnd that is what people did. The models got larger and larger with GPT-3 (175B), [Gopher](https://arxiv.org/pdf/2112.11446.pdf) (280B), [Megatron-Turing NLG](https://arxiv.org/pdf/2201.11990) (530B) just to name a few.\n\nBut the bigger models failed to deliver on the promise.\n\n*Read on to learn why!*\n\nWhat We know About Scaling Models Today\n\nIt turns out you need to scale training sets and models in equal proportions. So, every time the model size doubles, the number of training tokens should double as well.\n\nThis was published in DeepMind’s 2022 [paper](https://arxiv.org/pdf/2203.15556.pdf): “Training Compute-Optimal Large Language Models”\n\nThe researchers fitted over 400 language models ranging from 70M to over 16B parameters. To assess the impact of dataset size they also varied the number of training tokens from 5B-500B tokens.\n\nThe findings allowed them to estimate that a compute-optimal version of GPT-3 (175B) should be trained on roughly 3.7T tokens. That is more than 10x the data that the original model was trained on.\n\nTo verify their results they trained a fairly small model on vastly more data. Their model, called Chinchilla, has 70B parameters and is trained on 1.4T tokens. Hence it is 2.5x smaller than GPT-3 but trained on almost 5x the data.\n\nChinchilla outperforms GPT-3 and other much larger models by a fair margin \\[3\\].\n\nThis was a great breakthrough!  \nThe model is not just better, but its smaller size makes inference cheaper and finetuning easier.\n\n*So What Will Happen?*\n\nWhat GPT-4 Might Look Like:\n\nTo properly fit a model with 100T parameters, open OpenAI needs a dataset of roughly 700T tokens. Given 1M GPUs and using the calculus from above, it would still take roughly 2650 years to train the model \\[1\\].\n\nSo, here is what GPT-4 could look like:\n\n* Similar size to GPT-3, but trained optimally on 10x more data\n* ​[Multi-modal](https://thealgorithmicbridge.substack.com/p/gpt-4-rumors-from-silicon-valley) outputting text, images, and sound\n* Output conditioned on document chunks from a memory bank that the model has access to during prediction \\[4\\]\n* Doubled context size allows longer predictions before the model starts going off the rails​\n\nRegardless of the exact design, it will be a solid step forward. However, it will not be the 100T token human-brain-like AGI that people make it out to be.\n\nWhatever it will look like, I am sure it will be amazing and we can all be excited about the release.\n\nSuch exciting times to be alive!\n\nAs always, I really enjoyed making this for you and I sincerely hope you found it useful!\n\nWould you like to receive an article such as this one straight to your inbox every Thursday? Consider signing up for **The Decoding** ⭕.\n\nI send out a thoughtful newsletter about ML research and the data economy once a week. No Spam. No Nonsense. [Click here to sign up!](https://thedecoding.net/)\n\n**References:**\n\n\\[1\\] D. Narayanan, M. Shoeybi, J. Casper , P. LeGresley, M. Patwary, V. Korthikanti, D. Vainbrand, P. Kashinkunti, J. Bernauer, B. Catanzaro, A. Phanishayee , M. Zaharia, [Efficient Large-Scale Language Model Training on GPU Clusters Using Megatron-LM](https://arxiv.org/abs/2104.04473) (2021), SC21\n\n\\[2\\] J. Kaplan, S. McCandlish, T. Henighan, T. B. Brown, B. Chess, R. Child,… &amp; D. Amodei, [Scaling laws for neural language model](https://arxiv.org/abs/2001.08361)s (2020), arxiv preprint\n\n\\[3\\] J. Hoffmann, S. Borgeaud, A. Mensch, E. Buchatskaya, T. Cai, E. Rutherford, D. Casas, L. Hendricks, J. Welbl, A. Clark, T. Hennigan, [Training Compute-Optimal Large Language Models](https://arxiv.org/abs/2203.15556) (2022). *arXiv preprint arXiv:2203.15556*.\n\n\\[4\\] S. Borgeaud, A. Mensch, J. Hoffmann, T. Cai, E. Rutherford, K. Millican, G. Driessche, J. Lespiau, B. Damoc, A. Clark, D. Casas, [Improving lan](https://arxiv.org/abs/2112.04426)\n\n[guage models by retrieving from trillions of tokens](https://arxiv.org/abs/2112.04426) (2021). *arXiv preprint arXiv:2112.04426*.Vancouver",
        "created_utc": 1674114819,
        "upvote_ratio": 1.0
    },
    {
        "title": "🚀 How to manage the open data in your project",
        "author": "ryo_ma",
        "url": "https://dev.to/ryoma/how-to-manage-the-open-data-in-your-project-2g4b",
        "text": "",
        "created_utc": 1674111082,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to manage the open data",
        "author": "ryo_ma",
        "url": "https://dev.to/ryoma/how-to-manage-the-open-data-in-your-project-2g4b",
        "text": "",
        "created_utc": 1674110612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a masters degree in software engineering enough for me to get a job as a software engineer? (I have a bachelor in business)",
        "author": "Parking-Age-6974",
        "url": "https://www.reddit.com/r/compsci/comments/10fkds2/is_a_masters_degree_in_software_engineering/",
        "text": "",
        "created_utc": 1674080861,
        "upvote_ratio": 1.0
    },
    {
        "title": "Catalog of algorithms?",
        "author": "ExpressMap",
        "url": "https://www.reddit.com/r/compsci/comments/10fjckh/catalog_of_algorithms/",
        "text": "There are so many algorithms in the world. Does anyone know if there is a comprehensive catalog anywhere?\n\nI would love to be able to browse known algorithms by category, for example, to find the common, de-facto algorithms for that category (e.g. sorting, search, sync, etc.), but also the more obscure algorithms, too.\n\nIdeally, each entry would have an explanation, known performance characteristics, history, etc.\n\nNIST’s [“Dictionary of Algorithms and Data Structures”](http://nist.gov/dads/) is the closest I’ve found so far, but was hoping for more categories and deeper coverage of each entry.",
        "created_utc": 1674078468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally, a Fast Algorithm for Shortest Paths on Negative Graphs",
        "author": "amichail",
        "url": "https://www.quantamagazine.org/finally-a-fast-algorithm-for-shortest-paths-on-negative-graphs-20230118/",
        "text": "",
        "created_utc": 1674073833,
        "upvote_ratio": 1.0
    },
    {
        "title": "Abstraction in object-Oriented-programming: Deep Dive(C++)",
        "author": "CreepyDifference8930",
        "url": "https://binaryguru01.blogspot.com/2023/01/abstraction-in-object-oriented.html",
        "text": "",
        "created_utc": 1674063628,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the best universities that offer software engineering masters degrees. (On campus preferred)",
        "author": "Parking-Age-6974",
        "url": "https://www.reddit.com/r/compsci/comments/10f9pnl/what_are_the_best_universities_that_offer/",
        "text": "I feel like i should also add that I’m a business bachelor (will that be an obstacle?)",
        "created_utc": 1674054739,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nepal plane crash: what happened and what we know so far",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1674053522,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best platform to host my webscraping backend?",
        "author": "Least_Camp7071",
        "url": "https://www.reddit.com/r/compsci/comments/10f2hn0/best_platform_to_host_my_webscraping_backend/",
        "text": "[removed]",
        "created_utc": 1674031509,
        "upvote_ratio": 1.0
    }
]