[
    {
        "title": "Found out my cousin has an Onlyfans account and I love her sexy body.",
        "author": "BananaInABottle",
        "url": "https://www.reddit.com/r/confession/comments/1189wo4/found_out_my_cousin_has_an_onlyfans_account_and_i/",
        "text": "[removed]",
        "created_utc": 1676998741,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im not transphobic, but I don’t want to feel forced to remember different pronouns for each person",
        "author": "Remarkable_Trick1063",
        "url": "https://www.reddit.com/r/confession/comments/1189wne/im_not_transphobic_but_i_dont_want_to_feel_forced/",
        "text": "[removed]",
        "created_utc": 1676998740,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I the bad guy for texting my bf back while he was grounded?",
        "author": "ali_bama3",
        "url": "https://www.reddit.com/r/confession/comments/1189ja8/am_i_the_bad_guy_for_texting_my_bf_back_while_he/",
        "text": "[removed]",
        "created_utc": 1676998211,
        "upvote_ratio": 1.0
    },
    {
        "title": "I my liver okay I have had sucide attempts and I'm worried",
        "author": "Even-Scientist-1248",
        "url": "https://www.reddit.com/r/confession/comments/1189hsl/i_my_liver_okay_i_have_had_sucide_attempts_and_im/",
        "text": "I have attempted sucide three times using paracetamol the first time was 16 the second 24 and the third 30 I'm not sure If my liver is okay this happened in September November and January in that order. I also wanted to say to people who are wanting to die this way it is one of the most painful experiences I have ever gone through I regret it so much everytime I do it your stomach is 50 times as bad as period cramps and your throwing up out your mouth and nose. So is my liver okay?\nPs. Haven't been to the hospital except from the first time when I took the 16.",
        "created_utc": 1676998156,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't understand the USA parenting mentality....",
        "author": "gcftardis",
        "url": "https://www.reddit.com/r/confession/comments/1187h10/i_dont_understand_the_usa_parenting_mentality/",
        "text": "[removed]",
        "created_utc": 1676995394,
        "upvote_ratio": 1.0
    },
    {
        "title": "I really like this guy(37m) I’m 33F I feel like a teen",
        "author": "Friendly_Elk_4888",
        "url": "https://www.reddit.com/r/confession/comments/11877jx/i_really_like_this_guy37m_im_33f_i_feel_like_a/",
        "text": "[removed]",
        "created_utc": 1676995012,
        "upvote_ratio": 1.0
    },
    {
        "title": "I worry about what life is going to look after my parents are gone",
        "author": "foragesforfun",
        "url": "https://www.reddit.com/r/confession/comments/118740b/i_worry_about_what_life_is_going_to_look_after_my/",
        "text": "My life is okay right now. I get to have a roof over my head, warm meals and people I'm lucky enough to call friends. \nThat sounds bearable no? \nExcept for the times when I'm miserable which is pretty much all the time. I didn't choose from the normal job pool my friends did so while I love them and am glad that they pick up my calls... I think at some point they won't care enough to. \nI know I won't get to share my life with anyone. I am obese, neurodivergent and vehemently against that kind of companionship... not that anyone would want to have that with me. As it turns out, I'm too soft for most worldly affairs and not soft enough to deserve love. \nSo I'll basically end up alone and that isn't a scary thought. I made my peace with it many years ago. I also made my peace with the fact that when my lovely friends that i love with everything I have do get married and jave kids, I might be too bitter to stay in touch. Or maybe they'll be too busy to. \nMore than anything I worry about the time when my parents and grandparents are no longer alive because then I would truly have no one to call my own. I kind of wish I wasn't this fucked up. \nI'll always have a roof over my head and some form of employment but I think the misery is just starting. \nMaybe all the misery will keep me company. Or maybe it'll abandon me like everything else is bound to. \nI guess only time will tell.",
        "created_utc": 1676994882,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm Lonely and depressed and it's driving me insane!",
        "author": "PackageOpening4616",
        "url": "https://www.reddit.com/r/confession/comments/1186uz6/im_lonely_and_depressed_and_its_driving_me_insane/",
        "text": "[removed]",
        "created_utc": 1676994541,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (18M) am cripplingly lonely. I think there must be something wrong with me.",
        "author": "-tropical-t",
        "url": "https://www.reddit.com/r/confession/comments/1186ef2/i_18m_am_cripplingly_lonely_i_think_there_must_be/",
        "text": "[removed]",
        "created_utc": 1676993900,
        "upvote_ratio": 1.0
    },
    {
        "title": "I often fart silently in front of strangers at public spaces",
        "author": "Prestigious_Bed_9526",
        "url": "https://www.reddit.com/r/confession/comments/1186a0v/i_often_fart_silently_in_front_of_strangers_at/",
        "text": "[removed]",
        "created_utc": 1676993720,
        "upvote_ratio": 1.0
    },
    {
        "title": "20[F4M]I,am very horny, looking for a sex partner add my snap: [ saraaliyha ]",
        "author": "kitty_23f",
        "url": "https://www.reddit.com/r/confession/comments/118673l/20f4miam_very_horny_looking_for_a_sex_partner_add/",
        "text": "[removed]",
        "created_utc": 1676993629,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sometimes I pee in a trash can at my bfs house and he still doesn’t know",
        "author": "Iswearimnotbad",
        "url": "https://www.reddit.com/r/confession/comments/118664g/sometimes_i_pee_in_a_trash_can_at_my_bfs_house/",
        "text": "[removed]",
        "created_utc": 1676993582,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m moving out in 7 months and I haven’t told anyone",
        "author": "chocotripcookies",
        "url": "https://www.reddit.com/r/confession/comments/11864xp/im_moving_out_in_7_months_and_i_havent_told_anyone/",
        "text": "I can’t take living at home anymore. I can’t take the mess. On my days off I wake up with anxiety as I have to go around the house and see the mess they’ve left for me (Anxiety because if I don’t clean it, nobody will and i’ll get screamed at by my mum). On the days when I have Uni, I prolong going home by going to a Starbucks or going on a walk just so I can enjoy myself a little bit at least. You would think living with older siblings between the ages of 24-29 would mean the house would be clean, as they’re no longer children right? Wrong.\n\nI clean up after them every day. I got so sick of cleaning only to see the place messy again the next day so I decided to stop cleaning last week just to see how far they’ll go. \n\nThe bathroom bin is currently overflowing, as in, there’s tissues, water bottles, cans, on the ground around the bin. There’s urine stains next to the toilet. Our bathroom shelf is covered in empty toilet rolls (the cardboard part) as there’s no bin to put them into. The kitchen bin has maggots inside due to the banana peels and chicken inside. Every bowl and pot/pan in the house is dirty and because I haven’t washed them, they’ve been sitting for days. All our biscuits have gone stale as one of my brothers broke the biscuit jar and hasn’t replaced it since. Yesterday I grabbed the toilet tissue and felt poo on my fingers. Yes, someones poo was in the toilet roll. This is what set me off.\n\nThere’s so much more to say but i’ll leave it at that. I tried to move out last year but my mum stopped me because she knew the house would look insane if I left. This time i’m not listening to anything she has to say, I need this time away for my own mental sanity.\n\nI’m a university student so my job and student loans will support me. As I type this i’m looking into student accommodation. After my course ends I do not plan to return home unless my brothers have already moved out. I can’t wait to leave.",
        "created_utc": 1676993500,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Not that siriius) How am I passing Russian? (And why do we need long titles?)",
        "author": "IamTheStormthtis",
        "url": "https://www.reddit.com/r/confession/comments/1185w0r/not_that_siriius_how_am_i_passing_russian_and_why/",
        "text": "[removed]",
        "created_utc": 1676992856,
        "upvote_ratio": 1.0
    },
    {
        "title": "I broke up with my ex (20) for someone new on my birthday",
        "author": "Joddy-Jainach080617",
        "url": "https://www.reddit.com/r/confession/comments/1185vz6/i_broke_up_with_my_ex_20_for_someone_new_on_my/",
        "text": "[removed]",
        "created_utc": 1676992853,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recording drinking games goes wrong and I am the only one that remembers.",
        "author": "innocentgames1",
        "url": "https://www.reddit.com/r/confession/comments/1185cr3/recording_drinking_games_goes_wrong_and_i_am_the/",
        "text": "[removed]",
        "created_utc": 1676991493,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I [27F] trust the most common views that are expressed online, on Reddit and on this subreddit. Or should I trust the views of the people in my life? [33F] [62F] [56M]",
        "author": "marketappointment",
        "url": "https://www.reddit.com/r/confession/comments/1184zw4/should_i_27f_trust_the_most_common_views_that_are/",
        "text": "[removed]",
        "created_utc": 1676990511,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my psychologist [38F] being naive or am I [27F] the one who is?",
        "author": "marketappointment",
        "url": "https://www.reddit.com/r/confession/comments/1184yen/is_my_psychologist_38f_being_naive_or_am_i_27f/",
        "text": "[removed]",
        "created_utc": 1676990402,
        "upvote_ratio": 1.0
    },
    {
        "title": "Heather J. Nelson from Pearl City, Oahu (Heather J. Nelson from Pearl City, Oahu)",
        "author": "SecretLove808",
        "url": "https://www.reddit.com/r/confession/comments/1184oa8/heather_j_nelson_from_pearl_city_oahu_heather_j/",
        "text": "[removed]",
        "created_utc": 1676989629,
        "upvote_ratio": 1.0
    },
    {
        "title": "I peed myself on a deployment and I hating everything",
        "author": "noisername858",
        "url": "https://www.reddit.com/r/confession/comments/1184ahz/i_peed_myself_on_a_deployment_and_i_hating/",
        "text": "[removed]",
        "created_utc": 1676988577,
        "upvote_ratio": 1.0
    },
    {
        "title": "I must confess My second Instagram identity from freshman year of high school",
        "author": "BadCharacter7242",
        "url": "https://www.reddit.com/r/confession/comments/11845cq/i_must_confess_my_second_instagram_identity_from/",
        "text": "[removed]",
        "created_utc": 1676988172,
        "upvote_ratio": 1.0
    },
    {
        "title": "I might be lesbian, I think. I don't know how to even approach this.",
        "author": "PiduwinButUnhinged",
        "url": "https://www.reddit.com/r/confession/comments/1183w2k/i_might_be_lesbian_i_think_i_dont_know_how_to/",
        "text": "[removed]",
        "created_utc": 1676987440,
        "upvote_ratio": 1.0
    },
    {
        "title": "my mom told me something and then we both started crying",
        "author": "cherriesinmymilk",
        "url": "https://www.reddit.com/r/confession/comments/1183u7c/my_mom_told_me_something_and_then_we_both_started/",
        "text": "[removed]",
        "created_utc": 1676987290,
        "upvote_ratio": 1.0
    },
    {
        "title": "I forged signatures and created false research samples at my job; I'm terrified of what will happen if someone finds out",
        "author": "xixi_anon",
        "url": "https://www.reddit.com/r/confession/comments/1183kv3/i_forged_signatures_and_created_false_research/",
        "text": "[removed]",
        "created_utc": 1676986520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Update to my other post \"Twisted\" Just want to say when I looked back at my post I felt sick to my stomach.",
        "author": "Cucumberchicken",
        "url": "https://www.reddit.com/r/confession/comments/1183i1b/update_to_my_other_post_twisted_just_want_to_say/",
        "text": "[removed]",
        "created_utc": 1676986303,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found a wallet and kept the cash. Finders keepers.",
        "author": "Brownz_fan",
        "url": "https://www.reddit.com/r/confession/comments/11833qh/i_found_a_wallet_and_kept_the_cash_finders_keepers/",
        "text": "[removed]",
        "created_utc": 1676985131,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being married and still have a huge crush... how do you deal with it?",
        "author": "MikeAndBike",
        "url": "https://www.reddit.com/r/confession/comments/1182y57/being_married_and_still_have_a_huge_crush_how_do/",
        "text": "[removed]",
        "created_utc": 1676984644,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (20s f ) Don’t like my older sister anymore. I don’t know how to remedy this",
        "author": "Lost-Draft-",
        "url": "https://www.reddit.com/r/confession/comments/1182qjo/i_20s_f_dont_like_my_older_sister_anymore_i_dont/",
        "text": "[removed]",
        "created_utc": 1676983982,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate my dad and I don’t know if i’ll ever forgive him or love him again",
        "author": "0wl1ion",
        "url": "https://www.reddit.com/r/confession/comments/1181y1f/i_hate_my_dad_and_i_dont_know_if_ill_ever_forgive/",
        "text": "[removed]",
        "created_utc": 1676981305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I feel bad or concerned about this situation?",
        "author": "KsinJner",
        "url": "https://www.reddit.com/r/confession/comments/1181t1m/should_i_feel_bad_or_concerned_about_this/",
        "text": "[removed]",
        "created_utc": 1676980840,
        "upvote_ratio": 1.0
    },
    {
        "title": "I dont understand why I'm here anymore. I dont understand",
        "author": "Willing_Atmosphere51",
        "url": "https://www.reddit.com/r/confession/comments/1181lna/i_dont_understand_why_im_here_anymore_i_dont/",
        "text": "As I walk this path of life alone I continue to cry out to those that say they love me. It's then felt for a brief moment but then that feeling of being alone is back again.. I suffer in silence. Forced to  living a life i didn't ask to be born in. To broke to enjoy the life I didnt ask to be born in. Death isn't an option(I've tried and no longer have the balls to anymore) but you might as well say I'm dead because I'm not living. Days pass as I'm frozen in time. Stuck in an constant loop. The only way to end it I'd to find the hole. My main issue if financial but I cant seem to forec my self to want or work hard to change my predicament because I don't care to be here anymore. No one understands me and I don't understand why people wanna live so bad. Im a lost soul that be yearning for someone to hear me cry for over a decade. I'm in so much misery I wish it was a way my life could just change over night.",
        "created_utc": 1676980104,
        "upvote_ratio": 1.0
    },
    {
        "title": "I stole something at my 6th grade school fair a few years back",
        "author": "0wlhouser",
        "url": "https://www.reddit.com/r/confession/comments/1180m94/i_stole_something_at_my_6th_grade_school_fair_a/",
        "text": "The guilt haunts me still. So I was in line with my money and actually bought a few things on the table they were selling stuff (mainly kid toys yknow), then I saw I was like twenty cents short and got sad, went to another table to find more things. There was a huge crowd of students and I had gripped the thing I wanted to buy but I tried to push myself through the crowd to the people selling the stuff so I could, then the bell rang I got nervous and shoved my stolen item in the bag.\n\n&amp;#x200B;\n\nIt was a three-dollar squishy unicorn.\n\nI feel bad and I've had fear of them finding out for years I know its not that serious but I do feel guilty.",
        "created_utc": 1676976506,
        "upvote_ratio": 1.0
    },
    {
        "title": "My mom finally gave up on me, I think I deserve it",
        "author": "riphertoshredz",
        "url": "https://www.reddit.com/r/confession/comments/1180j4v/my_mom_finally_gave_up_on_me_i_think_i_deserve_it/",
        "text": "[removed]",
        "created_utc": 1676976171,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (25m) hate my roommate (25m) because he has turned into a know it all asshole who has regressed to a “popular in high-school mentality”",
        "author": "Additional-Double890",
        "url": "https://www.reddit.com/r/confession/comments/11805v5/i_25m_hate_my_roommate_25m_because_he_has_turned/",
        "text": "[removed]",
        "created_utc": 1676974703,
        "upvote_ratio": 1.0
    },
    {
        "title": "I stole scratch n sniff stickers for months in kindergarten",
        "author": "Smucklez",
        "url": "https://www.reddit.com/r/confession/comments/118018e/i_stole_scratch_n_sniff_stickers_for_months_in/",
        "text": "    My brief stint into criminal activity occurred while still in single digits. In my school there were three bus calls, depending on how close you lived to the school. I lived in the country in a rural community so I was on the third bus call. That means that all of my classmates were dismissed before me and one other kid.  My teacher, Mrs. Henry,  would ask the two of us to please help the janitor by picking up little bits of paper from the carpet. \n    One day while crawling on hands and knees tidying the floor I looked up and noticed that on the back of the classroom story easel was sheet after sheet of scratch n sniff stickers. These were the most coveted prize at Bingo on Fridays. At this point in my life I had only owned three scratch n sniff stickers. I had one of a bunch of grapes and one of a pickle that I had previously won at Bingo, as well as a heavily scratched, second hand but still faintly scented bubble gum sticker that my cool older neighbor had given me. So yeah, scratch n sniff stickers were a big deal to me back then.\n     While crouched under the easel I saw the other kid with his back turned to me across the classroom and Mrs. Henry was standing in the doorway talking to another teacher. I wanted a sticker soooooo badly. My heart started pounding in my chest as I locked my eyes onto my teacher to be sure she didn't see me. Like a viper I darted my hand up and blindly snatched a sticker. Without risking a glance I stuck it to the back of my hand and pulled it up into the sleeve of my jacket. I didn't dare look at my loot for fear I would be caught red-handed. On the bus ride home I finally worked up the nerve to peek and Behold! It was a cotton candy!!! It smelled sooooo good. I couldn't have picked a better one had I legitimately won it at Bingo. After that I was hooked. I got so bold that I stole stickers weekly, sometimes more.\n    I never got outright caught but my mom became suspicious when I came home with a cowboy boot sticker on a Monday. It wasn't anything I would have ever picked and somehow she knew it. I wasn't into cowboys or boots and it didn't even smell good. It stunk like wet dog. I was pretty quick on my deceitful little feet and lied that I had gotten it to give my older brother as a prank. It worked! She believed me... but I was spooked, too spooked to continue on the path of delinquency I had chosen. I loved those stickers but the guilt was always there, and the fear of getting caught became too much after such a close call. From then on the only scratch n sniff stickers I came home with were won honestly on Bingo Fridays. \n      Sorry Mrs. Henry.",
        "created_utc": 1676974210,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel bad for watching cow gifs, I could not think of anything else but cuteness and food, it clouded my mind to love them and eat them.",
        "author": "Filipino-Asker",
        "url": "https://www.reddit.com/r/confession/comments/117zlyc/i_feel_bad_for_watching_cow_gifs_i_could_not/",
        "text": "[removed]",
        "created_utc": 1676972598,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am psychologically destroying my MIL and loving every second of it",
        "author": "Alternative-Mine-446",
        "url": "https://www.reddit.com/r/confession/comments/117z2ki/i_am_psychologically_destroying_my_mil_and_loving/",
        "text": "[removed]",
        "created_utc": 1676970446,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have kept a girl's photo without her permission.",
        "author": "JohnElliotDwBethune",
        "url": "https://www.reddit.com/r/confession/comments/117xy5e/i_have_kept_a_girls_photo_without_her_permission/",
        "text": "I am in Class 11 and I have a crush in on one of my classmates. I have screenshot of her whatsapp DP which she removed, and I kept it in my google photos locked folder. I don't have courage to confront her. I just look at her photo sometimes and it warms my heart. Is it ethically wrong to have a girl's photo without her permission?",
        "created_utc": 1676966127,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is truly it. I’m never coming back. This is my last night home. Ever.",
        "author": "Tezzy67",
        "url": "https://www.reddit.com/r/confession/comments/117x2kh/this_is_truly_it_im_never_coming_back_this_is_my/",
        "text": "[removed]",
        "created_utc": 1676962803,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wish my disabled siblings were dead and I don't care.",
        "author": "ebonywilliams0901",
        "url": "https://www.reddit.com/r/confession/comments/117woxl/i_wish_my_disabled_siblings_were_dead_and_i_dont/",
        "text": "[removed]",
        "created_utc": 1676961355,
        "upvote_ratio": 1.0
    },
    {
        "title": "It was the first year of anniversary yesterday of my son being the States problem.That day was the best day in my life.",
        "author": "sociokid",
        "url": "https://www.reddit.com/r/confession/comments/117w8u5/it_was_the_first_year_of_anniversary_yesterday_of/",
        "text": "[removed]",
        "created_utc": 1676959801,
        "upvote_ratio": 1.0
    },
    {
        "title": "I 13female feel like im growing up and getting older way too fast",
        "author": "Beneficial-Cause-163",
        "url": "https://www.reddit.com/r/confession/comments/117vvt6/i_13female_feel_like_im_growing_up_and_getting/",
        "text": "[removed]",
        "created_utc": 1676958588,
        "upvote_ratio": 1.0
    },
    {
        "title": "is a hand palm tickle inappropriate? here is my question",
        "author": "iamlight45245",
        "url": "https://www.reddit.com/r/confession/comments/117vs1g/is_a_hand_palm_tickle_inappropriate_here_is_my/",
        "text": "[removed]",
        "created_utc": 1676958229,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wish I was a girl. But I do t think I. An do anything about it",
        "author": "Princess-pinkypants",
        "url": "https://www.reddit.com/r/confession/comments/117vfg2/i_wish_i_was_a_girl_but_i_do_t_think_i_an_do/",
        "text": "[removed]",
        "created_utc": 1676957029,
        "upvote_ratio": 1.0
    },
    {
        "title": "The good news is that I may or may not have cancer",
        "author": "isthisfoolcrazyorami",
        "url": "https://www.reddit.com/r/confession/comments/117vb1k/the_good_news_is_that_i_may_or_may_not_have_cancer/",
        "text": "I recently found out I may or may not have cervical cancer. The few people that know about my ultrasound results are scared, acting weird around me. The thing is, I’m not scared at all. To be honest I look at it as a way out of a life I feel trapped in. I can leave and not feel guilty. Spend the rest of my remaining time with my kids, and plan my time accordingly. The only reason I would want to stay is for them, but selfishly I want to die. At least rn i do, and I’ve felt like this for two weeks. Idk if anyone else in my position has ever had those thoughts or been brave enough to talk about it. Not that I’m being brave hiding behind an anonymous account talking to strangers. \nOn the other hand I may not have it and I just realized how unhappy I really am.",
        "created_utc": 1676956636,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just wish I could have a few moments to breathe and be young",
        "author": "idontknowfam1234",
        "url": "https://www.reddit.com/r/confession/comments/117v5b2/i_just_wish_i_could_have_a_few_moments_to_breathe/",
        "text": "[removed]",
        "created_utc": 1676956130,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve thought my youngest sibling is not fully related to me and my brother and we talked about it a lot as teens.",
        "author": "DocumentDelicious177",
        "url": "https://www.reddit.com/r/confession/comments/117v458/ive_thought_my_youngest_sibling_is_not_fully/",
        "text": "[removed]",
        "created_utc": 1676956022,
        "upvote_ratio": 1.0
    },
    {
        "title": "I used to constantly threaten to brutally murder my parents when I was a kid.",
        "author": "Menace_17",
        "url": "https://www.reddit.com/r/confession/comments/117upk9/i_used_to_constantly_threaten_to_brutally_murder/",
        "text": "[removed]",
        "created_utc": 1676954758,
        "upvote_ratio": 1.0
    },
    {
        "title": "I used to jerk off while my single mom played with herself in her Room. I'd stand outside her door. God id still give anything to fuck mommy. I may need her corpse after she dies 😉",
        "author": "wewuzkingsnsheeyit",
        "url": "https://www.reddit.com/r/confession/comments/117u3yq/i_used_to_jerk_off_while_my_single_mom_played/",
        "text": "[removed]",
        "created_utc": 1676952898,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a crush on my teacher and I don’t know what to do",
        "author": "Buringdawn",
        "url": "https://www.reddit.com/r/confession/comments/117u3ex/i_have_a_crush_on_my_teacher_and_i_dont_know_what/",
        "text": "[removed]",
        "created_utc": 1676952846,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend’s parents assumed I was pregnant because of my stomach",
        "author": "Rare_Parking6285",
        "url": "https://www.reddit.com/r/confession/comments/117tsrt/my_boyfriends_parents_assumed_i_was_pregnant/",
        "text": "[removed]",
        "created_utc": 1676951967,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ungrateful Adult children. I have 2 adult children, M27 &amp; F24. I am going through a financial divorce with their mother.",
        "author": "sterney65",
        "url": "https://www.reddit.com/r/confession/comments/117tk3x/ungrateful_adult_children_i_have_2_adult_children/",
        "text": "[removed]",
        "created_utc": 1676951229,
        "upvote_ratio": 1.0
    },
    {
        "title": "Needed to get some stuff off my chest, I only want an ear",
        "author": "Nevermore361",
        "url": "https://www.reddit.com/r/confession/comments/117thd6/needed_to_get_some_stuff_off_my_chest_i_only_want/",
        "text": "[removed]",
        "created_utc": 1676950995,
        "upvote_ratio": 1.0
    },
    {
        "title": "I used to constantly threaten to brutally murder my parents when I was a kid. (REMORSE)",
        "author": "Menace_17",
        "url": "https://www.reddit.com/r/confession/comments/117tgxa/i_used_to_constantly_threaten_to_brutally_murder/",
        "text": "[removed]",
        "created_utc": 1676950956,
        "upvote_ratio": 1.0
    },
    {
        "title": "I cheat on my wife with an underage white girl next door",
        "author": "wewuzkingsnsheeyit",
        "url": "https://www.reddit.com/r/confession/comments/117tc93/i_cheat_on_my_wife_with_an_underage_white_girl/",
        "text": "[removed]",
        "created_utc": 1676950555,
        "upvote_ratio": 1.0
    },
    {
        "title": "As an Asian, I've said the n-word. ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ",
        "author": "lilieflowr",
        "url": "https://www.reddit.com/r/confession/comments/117t9vh/as_an_asian_ive_said_the_nword_ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ/",
        "text": "[removed]",
        "created_utc": 1676950357,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am willing to work.Is there any work I can do today?",
        "author": "Existing-Camel6821",
        "url": "https://www.reddit.com/r/confession/comments/117t1y1/i_am_willing_to_workis_there_any_work_i_can_do/",
        "text": "[removed]",
        "created_utc": 1676949691,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I the asshole for asking for help from my roommate.",
        "author": "SaltParticular2894",
        "url": "https://www.reddit.com/r/confession/comments/117sy63/am_i_the_asshole_for_asking_for_help_from_my/",
        "text": "[removed]",
        "created_utc": 1676949379,
        "upvote_ratio": 1.0
    },
    {
        "title": "I lost my cool on a girl that gaslit me after she asked if I was talking to other people without even meeting her In person",
        "author": "CardiologistTrick583",
        "url": "https://www.reddit.com/r/confession/comments/117svj7/i_lost_my_cool_on_a_girl_that_gaslit_me_after_she/",
        "text": "Alright so I matched with this girl on a dating app and we started talking I remember her bio said that she \"hates all men and to prove her wrong\" me being the kind and genuine person I am I thought I could at least talk with her and at the very least help her realize that there are a lot of men that exist in the world that are very sweet, sensitive and respectful. As I continued to talk to her she kept taking these little digs at me saying that she's not \"into these types of guys\" when I have that attribute but I would just sarcastically roll with the punches and try to at least provide some humor relief from the slight disrespect and show that I have confidence in myself regardless of her negative comments and jabs. Which lead to stating that \"I was probably talking to a bunch of girls\" and so being the honest guy that I am I said that I am as I have a tendency to get attached a little too quick and so it helps me from getting my feelings hurt when dating turns out to be unsuccessful especially since I have adhd and any type of \"failure\" in my head is a little more tough then for most people. She then called me gross and proceeded to tell me to leave and etc. Now I will agree that I probably should've just blocked her and continued on with my evening but I decided to stick up for myself. Asking her how that could be gross and that I'm just being healthy etc. She continued to insult me calling me immature,  disrespectful, and that I had no good qualities and a bunch of other things. So then in a moment of anger at being called heinous things by a venomous woman I lashed out and said that she needs to get control of her ego and that the world doesn't revolve around her especially for someone that doesn't even know her. And that if she didn't her life wouldn't amount to much. (It was brutal I know) I literally immediately regretted typing and sending those things and felt like I had became Andrew tate and it had me appalled at myself. I may have taken things a bit to far but overall I'm proud for standing up for myself especially since I have anxiety, depression, ptsd, and adhd. either way I feel bad for going so extreme in my \"constructive criticism\" and I hope that the girl can eventually get whatever in life that she needs in the future. I'll probably be posted on her private story somewhere looking highly disrespectful as I was. But there's always 2 sides to every story. I'm also not saying that I was in the right but even the nicest people can only tolerate so much sometimes.",
        "created_utc": 1676949165,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is hanging out with ex who is now a good friend wrong?",
        "author": "Hungry-Eye-01",
        "url": "https://www.reddit.com/r/confession/comments/117stpw/is_hanging_out_with_ex_who_is_now_a_good_friend/",
        "text": "[removed]",
        "created_utc": 1676949026,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please Join My Advice Group - Love to Have You Join and be Part of Things",
        "author": "kayaker51",
        "url": "/r/join/comments/117sr3e/please_join_my_advice_group_love_to_have_you/",
        "text": "",
        "created_utc": 1676948884,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m dealing with this loooove affair ..and I need advice",
        "author": "SweetStabbyGirl",
        "url": "https://www.reddit.com/r/confession/comments/117srdh/im_dealing_with_this_loooove_affair_and_i_need/",
        "text": "[removed]",
        "created_utc": 1676948837,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I just post here or do I need karma jahsksnkwjabsb",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1676948402,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Social Project Dedicated to a friendship I destroyed.",
        "author": "Throwawaydunkey1045",
        "url": "https://www.reddit.com/r/confession/comments/117s3sl/a_social_project_dedicated_to_a_friendship_i/",
        "text": "[removed]",
        "created_utc": 1676946913,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was ordered to switch to a smaller cubicle with a coworker who just started",
        "author": "Jessicamoraf",
        "url": "https://www.reddit.com/r/confession/comments/117s2mr/i_was_ordered_to_switch_to_a_smaller_cubicle_with/",
        "text": "I have been ordered to switch cubicles with another employee who just started working at the office. She’s older than me and physically bigger too, her cubicle is smaller than mine ( I worked in that cubicle before for an entire year until I was finally assigned a bigger one) Now that she’s fully hired she complained about her workspace been too small for her and instead of at least asking me, their solution was to order me to switch with her starting next week, they also relocated me and want me to start at a different location of the same doctor’s office starting 2 weeks from now, I accepted to relocate but they still want me to switch with her just for one week, I didn’t feel comfortable with that cause I’m leaving in 2 weeks anyways so she can have my place once I relocate… And my manager emailed me back saying that she doesn’t understand what the big deal is if it’s only for a week (It doesn’t feel right specially because that new lady and I don’t have a good relation, she complaints about her place being small and their solution is to give it back to me) please let me know what I can do and if I should talk to HR about it.",
        "created_utc": 1676946819,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want nuclear war to break out and wipe us all out.",
        "author": "Lrdofthewstlnd",
        "url": "https://www.reddit.com/r/confession/comments/117rpf1/i_want_nuclear_war_to_break_out_and_wipe_us_all/",
        "text": "[removed]",
        "created_utc": 1676945750,
        "upvote_ratio": 1.0
    },
    {
        "title": "Had an epiphany about a missed dating social queue in high school",
        "author": "missbecca96",
        "url": "https://www.reddit.com/r/confession/comments/117ri8s/had_an_epiphany_about_a_missed_dating_social/",
        "text": "[removed]",
        "created_utc": 1676945169,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've never been so embarrassed in my entire life..",
        "author": "ThrowawayTime28891",
        "url": "https://www.reddit.com/r/confession/comments/117rfwp/ive_never_been_so_embarrassed_in_my_entire_life/",
        "text": "[removed]",
        "created_utc": 1676944975,
        "upvote_ratio": 1.0
    },
    {
        "title": "this is how my sister left us. so yayyyyyyyyyyyyyyyyy",
        "author": "KokichisUltimateSimp",
        "url": "https://www.reddit.com/r/confession/comments/117rcyv/this_is_how_my_sister_left_us_so/",
        "text": "so currently I'm graduating college, but when I was around the age of 12 me and my sister were getting ready for a recital. we got in a huge argument, and I tried to go back to my room, but she grabbed my shoulder. we were by the stairs, but I didn't realize it until it was too late. I pushed her, but when I called out for her she didn't respond. my friend was there for a sleepover, and she saw the entire thing go [down.like](https://down.like) the stupid 12 year olds we were, we didn't call an ambulance. we hung her on a tree outside.",
        "created_utc": 1676944753,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am going to end myself because I always screw things up",
        "author": "Plus_College499",
        "url": "https://www.reddit.com/r/confession/comments/117rc9f/i_am_going_to_end_myself_because_i_always_screw/",
        "text": "[removed]",
        "created_utc": 1676944693,
        "upvote_ratio": 1.0
    },
    {
        "title": "age gap relationship and I'm struggling he's 45 and I'm 23",
        "author": "Aquarius2499",
        "url": "https://www.reddit.com/r/confession/comments/117r7s5/age_gap_relationship_and_im_struggling_hes_45_and/",
        "text": "[removed]",
        "created_utc": 1676944324,
        "upvote_ratio": 1.0
    },
    {
        "title": "i hate pregnant women and i dont know why and its serious.",
        "author": "Throwaway50CAL",
        "url": "https://www.reddit.com/r/confession/comments/117r5i3/i_hate_pregnant_women_and_i_dont_know_why_and_its/",
        "text": "[removed]",
        "created_utc": 1676944144,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I might be into pain, the absurdly excruciating sadistic stuff",
        "author": "UserNameTaken714",
        "url": "https://www.reddit.com/r/confession/comments/117r071/i_think_i_might_be_into_pain_the_absurdly/",
        "text": "[removed]",
        "created_utc": 1676943716,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm a fraud living a double life online to satisfy all my social circles.",
        "author": "throwawaydumbquestn",
        "url": "https://www.reddit.com/r/confession/comments/117qp3c/im_a_fraud_living_a_double_life_online_to_satisfy/",
        "text": "[removed]",
        "created_utc": 1676942834,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a girlfriend, a mistress, and am trying to get with a new girl from my building.",
        "author": "Informal-Can-6963",
        "url": "https://www.reddit.com/r/confession/comments/117ql53/i_have_a_girlfriend_a_mistress_and_am_trying_to/",
        "text": "[removed]",
        "created_utc": 1676942517,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm not sure if this is the right place to put it, but I abandoned my friend group.",
        "author": "theguythatthrowsaway",
        "url": "https://www.reddit.com/r/confession/comments/117putc/im_not_sure_if_this_is_the_right_place_to_put_it/",
        "text": "Throwaway, because my main account is being followed by a couple of them, and I'm not sure what their usernames are\n\nAlso, I'm sorry for formatting. I'm on mobile.\n\nTo give a little backstory, I've been with everyone in this friendgroup for the greater of 3 years, but some of them I've known for up to 8 years. We've been a pretty tight-knit group of people, and we're an online friend group. There was never a time where none of us had talked for a bit, and although we had our ups and downs, we were basically inseparable.\n\nUntil earlier today, that is.\n\nSince I've known this group I've always been a bit of an asshole. I'd always make jokes that had someone be the butt-end of it, and although we'd laugh it off, sometimes I'd take it too far, and I was never sorry. I struggle with various mental health issues, so usually when I took it too far, and someone got (understandably) upset, I never really apologized, and usually, it even felt good to put someone down emotionally. That's when I started realized this had been going on for far too long. I never really felt happy unless I was deliberately putting someone down, being loud, or just generally not acting nice to the people that really cared about me. They don't deserve me treating them like this, and it kind of began to just sink in.\n\nI was an asshole, and I didn't want to be. This realization came in about a year ago, and all of us talked about it on multiple occasions. I said I'd make a change, and although I was changing myself for the better, my attitude towards my friends never really changed. I was still an asshole, and to me, it was still fun to irritate, upset, and all around be an annoyance to them. So I made the final decision.\n\nI discussed it with a few of those friends today who I could trust with deeper things, like thoughts and emotions, all that jazz. I brought it up that I was an asshole to one of them earlier, and another one said that I just need to go apologize to the friend I hurt and that I'm overthinking everything. We ended up half-arguing about it, mostly because I'm stubborn, and it ended on the note that this friend saw me changing for the better, and asked if it was really worth throwing away this friend group I had built up because I overthought things, according to them.\n\nI did think about it, and I made my choice. I weighed my options and outcomes with this, and realized that, although I'd probably have to find another group of friends to talk to, it's for the better if I'm not constantly berating them and putting them down emotionally because I wanted a laugh that day. So I finally made the decision to block all of my friends on any platforms they could contact me on and leave every chat room they were in. I am entirely set on going no-contact with any of them just because I do not want to hurt them. \n\nI'm mostly here to ask: Did I make the right call from an outside perspective?",
        "created_utc": 1676940482,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to break up with my boyfriend because all I do is hurt him",
        "author": "akatsee",
        "url": "https://www.reddit.com/r/confession/comments/117por4/i_want_to_break_up_with_my_boyfriend_because_all/",
        "text": "[removed]",
        "created_utc": 1676940007,
        "upvote_ratio": 1.0
    },
    {
        "title": "I enjoy the little things, and when I get a double yolk I feel like I win the lottery",
        "author": "starskynnnhutch",
        "url": "https://www.reddit.com/r/confession/comments/117pbkk/i_enjoy_the_little_things_and_when_i_get_a_double/",
        "text": "[removed]",
        "created_utc": 1676938983,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made him my boyfriend 4 days after I met him then broke up 10 days later",
        "author": "Confused_teen_007",
        "url": "https://www.reddit.com/r/confession/comments/117ou6s/i_made_him_my_boyfriend_4_days_after_i_met_him/",
        "text": "[removed]",
        "created_utc": 1676937709,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Unexpected Champion: When a Stone Cold Tee Emerged from a Dirty Laundry Hamper",
        "author": "MajorChip-Hazard",
        "url": "https://www.reddit.com/r/confession/comments/117oryo/the_unexpected_champion_when_a_stone_cold_tee/",
        "text": "So, one wild night, I found myself in a situation that still haunts me to this day. I had a few too many beers and ended up mistaking the laundry hamper for a toilet. I know, I know, it sounds crazy, but it really happened.\n\nThe next morning, I woke up with a throbbing headache and an uneasy feeling in my stomach. That's when the memories started to flood back, and I realized what I had done. In my drunken state, I had pooped in the hamper, right on top of my roommate's favorite Stone Cold Steve Austin WWE shirt.\n\nNow, if you know anything about wrestling, you know that Stone Cold is one tough SOB. But even he couldn't handle what I left behind. It was a Stone Cold Stunner that he never saw coming.\n\nThe worst part? My roommate, who we'll call Joe, ended up wearing that shirt the very next day. I couldn't believe it. There was my poop, hanging out with the Rattlesnake himself, and Joe was none the wiser.\n\nTo this day, I still can't believe I did it. And to top it off, I can't even do a proper Stone Cold impression. But I guess that's just the way the cookie crumbles. Or should I say, the way the poop crumbles?\n\nSo, there you have it, folks. The cautionary tale of what can happen when you mix too many beers, a laundry hamper, and a WWE shirt. Keep your wits about you, and always remember to check before you drop.",
        "created_utc": 1676937558,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm a recovering alcoholic having flashbacks to my time in hospital",
        "author": "justhisguy94",
        "url": "https://www.reddit.com/r/confession/comments/117or6u/im_a_recovering_alcoholic_having_flashbacks_to_my/",
        "text": "I was hospitalised last year. Having flashbacks right now to the whole thing.\n\nYoung people reading this; have a few drinks but keep a lid on it. Life isn't Mad Men. Irl you end up meditated up to your ass next to a bulimic and a 90 year old begging for morphine. \n\nChrist. Never again. \n\nFuck. Dudes, it was grim. It was really fucking grim.",
        "created_utc": 1676937498,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my psychologist [38F] being naive or am I [27F] the one who is?",
        "author": "comewrongconclusion",
        "url": "https://www.reddit.com/r/confession/comments/117oqqm/is_my_psychologist_38f_being_naive_or_am_i_27f/",
        "text": "[removed]",
        "created_utc": 1676937463,
        "upvote_ratio": 1.0
    }
]