[
    {
        "title": "Im attracted to a teenage student at the school I work at",
        "author": "316_pm",
        "url": "https://www.reddit.com/r/confession/comments/111nm57/im_attracted_to_a_teenage_student_at_the_school_i/",
        "text": "[removed]",
        "created_utc": 1676331238,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made my daughter quit her job because she came home past midnight",
        "author": "missthrowaway888",
        "url": "https://www.reddit.com/r/confession/comments/111mv3e/i_made_my_daughter_quit_her_job_because_she_came/",
        "text": "[removed]",
        "created_utc": 1676329323,
        "upvote_ratio": 1.0
    },
    {
        "title": "I like to put my dogs paws in my mouth. It is BLISS",
        "author": "carson024",
        "url": "https://www.reddit.com/r/confession/comments/111mmnt/i_like_to_put_my_dogs_paws_in_my_mouth_it_is_bliss/",
        "text": "[removed]",
        "created_utc": 1676328742,
        "upvote_ratio": 1.0
    },
    {
        "title": "I deserve everything that's happening to me right now.",
        "author": "drowninginternally",
        "url": "https://www.reddit.com/r/confession/comments/111mkhn/i_deserve_everything_thats_happening_to_me_right/",
        "text": "I got sick and had chronic nausea, so I got fired.\nI was low on money, so i had been stealing $20 or $50 here and there from my mom's purse. This was since before i got fired, but continued after i lost my job, and I would still ask her for money while i searched for jobs. She did end up finding out just a few weeks ago.\nMy car broke down in the middle of the street and I had to pay $1200 to get it fixed. The same day my car broke down, this cute girl i had been talking to, that had been trying to LURE me to a HOTEL, who i had been sending nudes to, got fed up i wouldn't send anymore nudes. She called me a loser, and sent a picture of one of the ugliest motherfuckers i have seen and revealed himself to be a catfish.\nMy catalytic converter was stolen on Thursday.\nI deserve all of it.\nOn top of all of this, for the last 6 months I had sleeping with a former co-worker of mine who was in a relationship for 8 years and admitted to me they weren't having sex. I really liked him, so i stepped in tempted him and we had a horrible, tumultuous situation ship for 6 months where I wanted to be with this man and I bent over backwards to prove to him we should be together and again and again, he wouldn't do shit for me. He would prove to me why he \"doesn't deserve me\", why we can't be together. There were times he would want to end it, but i would convince him to stay, and there were times i was trying to end it and he would convince me to stay. Every reason he could come up with as to why he couldn't leave her and why i wouldn't ever be his first choice, but he would never outright say that. \nI called my uncle and he said whether you are a good or bad person, life will happen. Bad things will happen whether you are good or bad. That i was in survival mode and that's why I was stealing. Because of trauma reasons, and old patterns that's why we put ourselves in shitty romantic situations. People who have trauma tend to blame themselves when life goes bad. And i believe him. All the other people in my life say I'm a good person, no i don't deserve these things. But also I'm at this point i can't even feel bad for myself because I've brought this all upon myself. I do the same things and expect different results. I'm grateful for the things i do have. I have wonderful family, they understand, forgive me and they're there for me. A lot. But I'm so sick of myself and need to change. I'm trying to stop wanting to be suicidal. I want to change not because of how I feel like I'm being punished, but because I'm legitimately tired of the way my life is and feeling this way. I've been suicidal my entire life, I've had depression all my life, horrible romantic situations majority of the time. I've just been creating more of that because that's what I know, and i just want to change. I want to be a good sister, daughter, aunt and friend to those who love me. I want to be able to give THEM money or resources when they need it. I want to show them they didn't support me and put up with me for nothing, that i really did get better and i want to keep it that way. Where do I even begin.",
        "created_utc": 1676328597,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm going to manipulate someone for their money. I know I'm the asshole.",
        "author": "BLTpussinator",
        "url": "https://www.reddit.com/r/confession/comments/111meyh/im_going_to_manipulate_someone_for_their_money_i/",
        "text": "[removed]",
        "created_utc": 1676328213,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got my niece pregnant by ruining her contraception",
        "author": "Limp_Explanation5288",
        "url": "https://www.reddit.com/r/confession/comments/111mabg/i_got_my_niece_pregnant_by_ruining_her/",
        "text": "[removed]",
        "created_utc": 1676327894,
        "upvote_ratio": 1.0
    },
    {
        "title": "This guy makes me feel like I’m going crazy or horribly oblivious.",
        "author": "brieezie",
        "url": "https://www.reddit.com/r/confession/comments/111lyi6/this_guy_makes_me_feel_like_im_going_crazy_or/",
        "text": "[removed]",
        "created_utc": 1676327107,
        "upvote_ratio": 1.0
    },
    {
        "title": "i love my disabled daughter but i am getting tired of taking care of her",
        "author": "Dear-Position2723",
        "url": "https://www.reddit.com/r/confession/comments/111ljwt/i_love_my_disabled_daughter_but_i_am_getting/",
        "text": "[removed]",
        "created_utc": 1676326121,
        "upvote_ratio": 1.0
    },
    {
        "title": "a few years ago I made a fake account to prank my ex",
        "author": "DevilszCrew",
        "url": "https://www.reddit.com/r/confession/comments/111ld3u/a_few_years_ago_i_made_a_fake_account_to_prank_my/",
        "text": "[removed]",
        "created_utc": 1676325671,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dr. Phil Anatomy of a \"False Confession\" February 13, 2023 (Full Episode) 1080p",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1676324983,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel sympathy for the man who hid a camera in my bathroom",
        "author": "fishybuggy",
        "url": "https://www.reddit.com/r/confession/comments/111kn3w/i_feel_sympathy_for_the_man_who_hid_a_camera_in/",
        "text": "[removed]",
        "created_utc": 1676323944,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not sure what to make of this dream from last night",
        "author": "Krristinaa",
        "url": "https://www.reddit.com/r/confession/comments/111k8so/not_sure_what_to_make_of_this_dream_from_last/",
        "text": "[removed]",
        "created_utc": 1676322980,
        "upvote_ratio": 1.0
    },
    {
        "title": "sometimes i tell people i’m dyslexic instead of admitting i made a spelling mistake",
        "author": "sussymary",
        "url": "https://www.reddit.com/r/confession/comments/111jz7s/sometimes_i_tell_people_im_dyslexic_instead_of/",
        "text": "i’ve missed almost 3 years of high school due to my CFS so i’m dumb as fuck and make a lot of grammatical errors.",
        "created_utc": 1676322328,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've never told anyone this, but after he raped me for over two hours I went down on him",
        "author": "New_Initiative_3939",
        "url": "https://www.reddit.com/r/confession/comments/111jdzo/ive_never_told_anyone_this_but_after_he_raped_me/",
        "text": "[removed]",
        "created_utc": 1676320884,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I’m obsessed with my Ex and frankly, I’m at a loss on what to do",
        "author": "PuzzleAtem",
        "url": "https://www.reddit.com/r/confession/comments/111j6hf/i_think_im_obsessed_with_my_ex_and_frankly_im_at/",
        "text": "[removed]",
        "created_utc": 1676320380,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m jealous of East Asian features and I feel guilty about it",
        "author": "GarfieldGauntlet",
        "url": "https://www.reddit.com/r/confession/comments/111j4ie/im_jealous_of_east_asian_features_and_i_feel/",
        "text": "[removed]",
        "created_utc": 1676320251,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m extremely jealous of East Asian features and I feel bad about it",
        "author": "GarfieldGauntlet",
        "url": "https://www.reddit.com/r/confession/comments/111j39f/im_extremely_jealous_of_east_asian_features_and_i/",
        "text": "[removed]",
        "created_utc": 1676320174,
        "upvote_ratio": 1.0
    },
    {
        "title": "i have a crush on my brother's best friend and i don't know what to do",
        "author": "UrLocalfrient",
        "url": "https://www.reddit.com/r/confession/comments/111j0yj/i_have_a_crush_on_my_brothers_best_friend_and_i/",
        "text": "[removed]",
        "created_utc": 1676320005,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like my mother is ashamed of me (especially when I'm around people).",
        "author": "Important-Shift8933",
        "url": "https://www.reddit.com/r/confession/comments/111isx8/i_feel_like_my_mother_is_ashamed_of_me_especially/",
        "text": "I've noticed recently that she disapproves about a lot of things about me. She'll never say it, she loves me too much to admit it.\n\nBut I notice how she looks frustrated when I interact with people in a affectionate way (I've always been a really affectionate person towards people who I know, and know is okay with it). For example today I gave one of my ex colleagues a big hug because I hadn't seen her in some time and in the corner of my eye I saw how she shielded her face. She was  embarrassed by me. Another thing that she is ashamed of me for is my bf. ( he's been the most supportive, gentle, understanding and patient person who has ever loved me) She openly disapproves it in front of everyone except me. I'm also probably a high functioning autistic, and I don't read social atmospheres the best. And everytime I don't get something 100% correct with a social interaction, she looks so disappointed in me.\n\nMe and my mother always had a good relationship but the last few months just feel like she is just ashamed of me... And it bothers me, a lot.\nJust needed to get it if my chest. \n\nSorry for the spelling and confusing grammar and structuring. I'm tired and dyslexic.",
        "created_utc": 1676319423,
        "upvote_ratio": 1.0
    },
    {
        "title": "I had threesome with my uncles mistakenly and still regrets it.",
        "author": "Alysia7321",
        "url": "https://www.reddit.com/r/confession/comments/111hzdp/i_had_threesome_with_my_uncles_mistakenly_and/",
        "text": "Sorry for my english as it is not my first language.I just wanted to share this as i have a lot of guilt in my heart.It happened 4 years ago and I am still feeling guilty. I am 23(F), when I was 19 I came back completely wet in rain as I forgot my umbrella to Uni. While coming home, I got to know that my twin uncles were making a surprise. Both of my parents are working parents and used to come home late. My father told me to greet them and let them have lunch at my home. When I reached home, both of them were already standing at my house door. I welcomed them and told them to have a sit. \n              I headed towards the washing machine near the bathroom but forgot to close the door. I removed my shirt to put it in the machine and suddenly I felt a cold hand grabbing my waist and turned me towards his direction. \n             He then started kissing my belly like a crazy and put his tongue inside my navel. It kept on going for 5 mins and then his brother came in and pushed him away. My navel was completely filled with saliva and idk why it turned me on. \n             As he was getting scolded by his brother, I dropped my skirt and removed by bra. Both of them looked extremely shocked. I told them to follow me up to the bedroom and I laid down on the bed and closed my eyes. One of them started eating me down there  and the other one directly came to my face. At first, he was reluctant and then he opened his pants and shoved his thing inside my mouth. After 1 hour, my body was completely filled with sticky stuffs. For some time, it felt great but as time passed by, I started loosing out respect for myself and my body. Even after 4 years, I still can't get out of it.",
        "created_utc": 1676317381,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made my gf feel worse about herself and i dont know what to do",
        "author": "Fearlessbalss",
        "url": "https://www.reddit.com/r/confession/comments/111hhey/i_made_my_gf_feel_worse_about_herself_and_i_dont/",
        "text": "[removed]",
        "created_utc": 1676316125,
        "upvote_ratio": 1.0
    },
    {
        "title": "I tend to get involved fast with women with mental disorders",
        "author": "ShiftKind9322",
        "url": "https://www.reddit.com/r/confession/comments/111h2bs/i_tend_to_get_involved_fast_with_women_with/",
        "text": "I have had a number of relationships/situationships with women that have mental illnesses. From anxiety disorders, manic bi polar, BPD (current one), I’ve come across it. I’m starting to realize it’s reflecting myself as you “are what you attract.” I’ve had recurring mental health issues myself since I was young but never sought much help. Does it come from my upbringing? Maybe. Having an ill parent with substance abuse problems throughout my life didn’t help. This is more just venting to be honest as I’ve never really told people this. Do you believe I get involved these type of women cause it’s just a reflection of myself?",
        "created_utc": 1676315097,
        "upvote_ratio": 1.0
    },
    {
        "title": "Checking my boyfriends Google activity I've been looking at it constantly for months now. It's become an obsession. I've spent more time on his account then mine. I just want to know if he's cheating!! Everything is pointing to it. I just can't prove it!",
        "author": "carmencarma69",
        "url": "https://www.reddit.com/r/confession/comments/111gpfb/checking_my_boyfriends_google_activity_ive_been/",
        "text": "[removed]",
        "created_utc": 1676314221,
        "upvote_ratio": 1.0
    },
    {
        "title": "I really messed up this time now my actions may get me in a little trouble",
        "author": "tberes1111",
        "url": "https://www.reddit.com/r/confession/comments/111gh0o/i_really_messed_up_this_time_now_my_actions_may/",
        "text": "I work as a baggage handler at a airport and was caught looking through the suitcase that belonged to a very attractive lady. I did see her and followed her bag so I could peek inside. She was alerted about what happened and when she checked her things she said some of her underwear was missing. They had me searched but did not find any of her belongings on me. I lost my job and fear I may be in more trouble. What should I do?",
        "created_utc": 1676313654,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm in love with my best friend and questioning my whole relationship right now",
        "author": "Emotional-Garlic-884",
        "url": "https://www.reddit.com/r/confession/comments/111ggxe/im_in_love_with_my_best_friend_and_questioning_my/",
        "text": "[removed]",
        "created_utc": 1676313647,
        "upvote_ratio": 1.0
    },
    {
        "title": "My first boyfriend was 35 and I was 8. I miss him.",
        "author": "DelicatelyTooBanana",
        "url": "https://www.reddit.com/r/confession/comments/111gf22/my_first_boyfriend_was_35_and_i_was_8_i_miss_him/",
        "text": "[removed]",
        "created_utc": 1676313523,
        "upvote_ratio": 1.0
    },
    {
        "title": "I used my college's lipstick on my dickhead and asshole.",
        "author": "JustNotMi",
        "url": "https://www.reddit.com/r/confession/comments/111g089/i_used_my_colleges_lipstick_on_my_dickhead_and/",
        "text": "[removed]",
        "created_utc": 1676312498,
        "upvote_ratio": 1.0
    },
    {
        "title": "Been cheating on my significant other with a married man twice my age",
        "author": "Suitable_Ad_4250",
        "url": "https://www.reddit.com/r/confession/comments/111fczq/been_cheating_on_my_significant_other_with_a/",
        "text": "[removed]",
        "created_utc": 1676310908,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just accidentally drank my own piss, because I'm an alcoholic.",
        "author": "throwawa294748",
        "url": "https://www.reddit.com/r/confession/comments/111f874/i_just_accidentally_drank_my_own_piss_because_im/",
        "text": "[removed]",
        "created_utc": 1676310569,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel guilty because I have been using AI to do my work.",
        "author": "pepperheadz",
        "url": "https://www.reddit.com/r/confession/comments/111elfv/i_feel_guilty_because_i_have_been_using_ai_to_do/",
        "text": "[removed]",
        "created_utc": 1676308955,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel guilty because I have been using AI to do my work.",
        "author": "pepperheadz",
        "url": "https://www.reddit.com/r/confession/comments/111eiut/i_feel_guilty_because_i_have_been_using_ai_to_do/",
        "text": "[removed]",
        "created_utc": 1676308774,
        "upvote_ratio": 1.0
    },
    {
        "title": "I cheated my wife. Do I deserve a second chance? I committed a sin out of anger and emotional breakdown. And now I’m repenting",
        "author": "Electronic-Mud-43",
        "url": "https://www.reddit.com/r/confession/comments/111ecww/i_cheated_my_wife_do_i_deserve_a_second_chance_i/",
        "text": "[removed]",
        "created_utc": 1676308365,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I went overboard, I had made love to this guys girlfriend as revenge….",
        "author": "Wrong-Spot-705",
        "url": "https://www.reddit.com/r/confession/comments/111e9ms/i_think_i_went_overboard_i_had_made_love_to_this/",
        "text": "[removed]",
        "created_utc": 1676308131,
        "upvote_ratio": 1.0
    },
    {
        "title": "I tricked kids in my elementary school by changing the rules of Pokémon, stealing hundreds of cards.",
        "author": "Personal-One-5438",
        "url": "https://www.reddit.com/r/confession/comments/111dwvy/i_tricked_kids_in_my_elementary_school_by/",
        "text": "I was a loner. Severe ADHD made me pretty unlikable and kids either picked on me or ignored me. But, my ADHD gave me super human hyper focus for things that interested me. Cue the release of the Pokémon Trading Card Game. \n\nI was the first of my classmates to learn to play. I played with adults in the mall at Wizards of the Coast. They taught me how to play, build decks, and even threw me cards they didn’t need. Got pretty good for a 9 year old. \n\nA little about the game. In the beginning you place 6 “prize cards” down on each side. You pull one of your prize cards after you defeat one the opponent’s Pokémon. First one to pull all six wins. \n\nThe con: By rewording the rules of the game, I convinced everyone in my grade that instead of pulling your own prize cards, you pull your opponent’s cards. \n\nPoor kids never saw it coming. I ANNIHILATED them. The very best anyone could do was take one of my prize cards while I would take all six of theirs. It was bad. \n\nTo make matters worse, the rich kids would pack their decks with powerful holograms thinking that the more power in their decks the better. I accumulated hundreds on hundreds of rare cards (worth thousands today if I still had them)\n\nThis went on for a good three months before one of the kids I had just stole a charizard (a 50 buck card in those days) from told the principal on me. I was forced to give the card back and Pokémon cards were banned at the school. Forced to play outside of school with people that didn’t go to our school, people got PISSED when they found out the real rules of the game. I played dumb. And told people who came asking for their cards back that I lost them all in a tournament. \n\nShitty thing about ADHD, things that become hardcore passions overnight are dropped just as fast. I put all my cards in a box and forgot about them. \n\nIn high school an elementary school kid on my block got super into Pokémon. He didn’t have money for cards so I gave him my entire collection. \n\nI try not to think about it. But if he held onto to those cards he would be sitting on literally thousands of dollars of stolen goods today. \n\nHow like life.",
        "created_utc": 1676307253,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel guilty because I have been using AI to do my work.",
        "author": "pepperheadz",
        "url": "https://www.reddit.com/r/confession/comments/111ds73/i_feel_guilty_because_i_have_been_using_ai_to_do/",
        "text": "[removed]",
        "created_utc": 1676306931,
        "upvote_ratio": 1.0
    },
    {
        "title": "I punched my girlfriend when I was angry and in a bad mood.",
        "author": "1Hundrxd_",
        "url": "https://www.reddit.com/r/confession/comments/111dbpf/i_punched_my_girlfriend_when_i_was_angry_and_in_a/",
        "text": "[removed]",
        "created_utc": 1676305796,
        "upvote_ratio": 1.0
    },
    {
        "title": "I once scanned a dress in Tesco's and put it through as a Potato at the self service.",
        "author": "itsinmybrain",
        "url": "https://www.reddit.com/r/confession/comments/111d5o6/i_once_scanned_a_dress_in_tescos_and_put_it/",
        "text": "No security tags. £0.42",
        "created_utc": 1676305387,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I’m developing an ED, and I’m taking my bf with me",
        "author": "Historical-Ad9330",
        "url": "https://www.reddit.com/r/confession/comments/111cyyj/i_think_im_developing_an_ed_and_im_taking_my_bf/",
        "text": "[removed]",
        "created_utc": 1676304924,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got ahead by foreclosing on poor families and evicting them",
        "author": "bifewova234",
        "url": "https://www.reddit.com/r/confession/comments/111cw5h/i_got_ahead_by_foreclosing_on_poor_families_and/",
        "text": "[removed]",
        "created_utc": 1676304724,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can’t focus on anything that doesn’t interest me",
        "author": "Imaginary-Redditor",
        "url": "https://www.reddit.com/r/confession/comments/111cd8j/i_cant_focus_on_anything_that_doesnt_interest_me/",
        "text": "No matter how hard I try to, if something doesn’t interest me then I can’t focus on it\n\nI don’t take in any information, I look for distractions, I yawn and feel mentally exhausted just trying to focus on it",
        "created_utc": 1676303450,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate doing my girlfriends favorite thing, and I am actively counting down the seconds until it’s over",
        "author": "Spiritual-Extent-771",
        "url": "https://www.reddit.com/r/confession/comments/111cbir/i_hate_doing_my_girlfriends_favorite_thing_and_i/",
        "text": "[removed]",
        "created_utc": 1676303336,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two Friends Have Learned That Slow Learner Is Not A Problem From A Turtle",
        "author": "lifestorykids",
        "url": "https://www.reddit.com/r/confession/comments/111c8jc/two_friends_have_learned_that_slow_learner_is_not/",
        "text": "[removed]",
        "created_utc": 1676303126,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m supposed to be in jail for this, this isn’t okay",
        "author": "Imareezy",
        "url": "https://www.reddit.com/r/confession/comments/111c36g/im_supposed_to_be_in_jail_for_this_this_isnt_okay/",
        "text": "So when i was in 4th grade there was this girl that use to bully me alot! She would slam my ass and drag me around the playground. One day i she asked me if i wanted to play at her house i said yes, she HAD a dog name Parker. We were playing T or D in her bedroom and i choose D she told me to go outside and scream aT the dog (Parker) her dog bite me and i was furious. When she said that she had to go to the toilet i grabbed a needle and stabbed Parker with it, i hid her dog at the play ground and till this day the dog hasn’t been found 🤪",
        "created_utc": 1676302743,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m supposed to be in jail for this, this isn’t okay",
        "author": "Imareezy",
        "url": "https://www.reddit.com/r/confession/comments/111c33i/im_supposed_to_be_in_jail_for_this_this_isnt_okay/",
        "text": "So when i was in 4th grade there was this girl that use to bully me alot! She would slam my ass and drag me around the playground. One day i she asked me if i wanted to play at her house i said yes, she HAD a dog name Parker. We were playing T or D in her bedroom and i choose D she told me to go outside and scream aT the dog (Parker) her dog bite me and i was furious. When she said that she had to go to the toilet i grabbed a needle and stabbed Parker with it, i hid her dog at the play ground and till this day the dog hasn’t been found 🤪",
        "created_utc": 1676302736,
        "upvote_ratio": 1.0
    },
    {
        "title": "I sold a bass guitar my mom bought me for 100$ and i deeply regret it.",
        "author": "cheeseandope",
        "url": "https://www.reddit.com/r/confession/comments/111bu4g/i_sold_a_bass_guitar_my_mom_bought_me_for_100_and/",
        "text": "[removed]",
        "created_utc": 1676302093,
        "upvote_ratio": 1.0
    },
    {
        "title": "my favorite thing to do as a teenager was tossing leaves",
        "author": "Bobert_Ze_Bozo",
        "url": "https://www.reddit.com/r/confession/comments/111bctb/my_favorite_thing_to_do_as_a_teenager_was_tossing/",
        "text": "[removed]",
        "created_utc": 1676300874,
        "upvote_ratio": 1.0
    },
    {
        "title": "Es normal que a tu pareja algo que consideras importante en su relación?",
        "author": "BananaBicht",
        "url": "https://www.reddit.com/r/confession/comments/111ab2b/es_normal_que_a_tu_pareja_algo_que_consideras/",
        "text": "[removed]",
        "created_utc": 1676299152,
        "upvote_ratio": 1.0
    },
    {
        "title": "I almost lied and it would’ve cost me my job but at least I didn’t tell a big lie.",
        "author": "InternationalYam8150",
        "url": "https://www.reddit.com/r/confession/comments/111a4eq/i_almost_lied_and_it_wouldve_cost_me_my_job_but/",
        "text": "[removed]",
        "created_utc": 1676298947,
        "upvote_ratio": 1.0
    },
    {
        "title": "i peed on a couch when i was a kid and blamed my cat",
        "author": "Acceptable_Seat_1047",
        "url": "https://www.reddit.com/r/confession/comments/1119dey/i_peed_on_a_couch_when_i_was_a_kid_and_blamed_my/",
        "text": "[removed]",
        "created_utc": 1676298110,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am slowly getting disgusted by my boyfriend and his masculinity evaporated in my eyes",
        "author": "emptycrypticvoid",
        "url": "https://www.reddit.com/r/confession/comments/11197jm/i_am_slowly_getting_disgusted_by_my_boyfriend_and/",
        "text": "[removed]",
        "created_utc": 1676297661,
        "upvote_ratio": 1.0
    },
    {
        "title": "list of reasons presented out of context for comment",
        "author": "throwaway45832698",
        "url": "https://www.reddit.com/r/confession/comments/1118uah/list_of_reasons_presented_out_of_context_for/",
        "text": "[removed]",
        "created_utc": 1676296675,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm scared to admit that I like girls, because men might fetishize me.",
        "author": "vvermillion",
        "url": "https://www.reddit.com/r/confession/comments/1118gwm/im_scared_to_admit_that_i_like_girls_because_men/",
        "text": "[removed]",
        "created_utc": 1676295586,
        "upvote_ratio": 1.0
    },
    {
        "title": "I scammed thousands of dollars out of my abusive foster dad",
        "author": "Abject-Currency8210",
        "url": "https://www.reddit.com/r/confession/comments/1118eyw/i_scammed_thousands_of_dollars_out_of_my_abusive/",
        "text": "[removed]",
        "created_utc": 1676295423,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found a video of my boyfriend raping someone and I don’t know what to do",
        "author": "Elegant_Doughnut_379",
        "url": "https://www.reddit.com/r/confession/comments/1118eol/i_found_a_video_of_my_boyfriend_raping_someone/",
        "text": "[removed]",
        "created_utc": 1676295398,
        "upvote_ratio": 1.0
    },
    {
        "title": "completely cut out a friend over text conversation",
        "author": "sayso7777",
        "url": "https://www.reddit.com/r/confession/comments/1118bzy/completely_cut_out_a_friend_over_text_conversation/",
        "text": "So I'm a 15 year old girl and my friend is also 15-year-old girls and we are going to call Audrey. I've been trying to make plans with Audrey for like past 3 or 4 months and they have the other guys sent me or told me no and for the whole friend group. From making fun of my autism to making plans in front of me even though I asked to join in just straight up telling me no. I'm sick and tired of it. So I'm going to  avoid them. I been  doing this for 5 days now.  The text conversation was me trying to make plans with one of them and then I'm using the excuse that they're in robotics and too busy to do to do anything with me but the funny thing is they will go to parties with other people other than me. I'm probably immature in this.",
        "created_utc": 1676295179,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't forget about him at all I still love him but I ruined everything or did i",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1676292941,
        "upvote_ratio": 1.0
    },
    {
        "title": "I stole from target and got caught what comes next?",
        "author": "TechnicalFun7414",
        "url": "https://www.reddit.com/r/confession/comments/1117jhg/i_stole_from_target_and_got_caught_what_comes_next/",
        "text": "[removed]",
        "created_utc": 1676292838,
        "upvote_ratio": 1.0
    },
    {
        "title": "I will never forget about u about us fuck I still love u",
        "author": "ooooooooookjsm",
        "url": "https://www.reddit.com/r/confession/comments/1117ia3/i_will_never_forget_about_u_about_us_fuck_i_still/",
        "text": "[removed]",
        "created_utc": 1676292728,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I convince I love my fiance I'm attracted to him.",
        "author": "somebodymadeup_1",
        "url": "https://www.reddit.com/r/confession/comments/11172m0/how_can_i_convince_i_love_my_fiance_im_attracted/",
        "text": "[removed]",
        "created_utc": 1676291325,
        "upvote_ratio": 1.0
    },
    {
        "title": "I [M32] have been struggling with myself psychologically lately",
        "author": "Dano1yet",
        "url": "https://www.reddit.com/r/confession/comments/1116u6h/i_m32_have_been_struggling_with_myself/",
        "text": "[removed]",
        "created_utc": 1676290516,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend made me look bad for being sad over my sister death",
        "author": "ThisisntIt012",
        "url": "https://www.reddit.com/r/confession/comments/1116a04/my_friend_made_me_look_bad_for_being_sad_over_my/",
        "text": "[removed]",
        "created_utc": 1676288529,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve always had temptations whenever i am around a cat",
        "author": "RegrettableJimmy",
        "url": "https://www.reddit.com/r/confession/comments/1115wxa/ive_always_had_temptations_whenever_i_am_around_a/",
        "text": "[removed]",
        "created_utc": 1676287147,
        "upvote_ratio": 1.0
    },
    {
        "title": "I really want to end things with my fiancé and to be wife",
        "author": "Dry_Investment_6730",
        "url": "https://www.reddit.com/r/confession/comments/1115vxk/i_really_want_to_end_things_with_my_fiancé_and_to/",
        "text": "[removed]",
        "created_utc": 1676287042,
        "upvote_ratio": 1.0
    },
    {
        "title": "*need advice* I found something and don't know how to react or what I should do",
        "author": "Lex1_Smith",
        "url": "https://www.reddit.com/r/confession/comments/1115v90/need_advice_i_found_something_and_dont_know_how/",
        "text": "[removed]",
        "created_utc": 1676286967,
        "upvote_ratio": 1.0
    },
    {
        "title": "I stole my friends synthetic THC he bought on the dark web and in the process of throwing it away I had to threaten a homeless man to leave me alone because he wanted whatever it was",
        "author": "TapatioinmyD-Hole",
        "url": "https://www.reddit.com/r/confession/comments/1115k0f/i_stole_my_friends_synthetic_thc_he_bought_on_the/",
        "text": "[removed]",
        "created_utc": 1676285788,
        "upvote_ratio": 1.0
    },
    {
        "title": "I 25(m) pranked a girl in high school which led to her crying",
        "author": "atticusbatticus",
        "url": "https://www.reddit.com/r/confession/comments/1115ed1/i_25m_pranked_a_girl_in_high_school_which_led_to/",
        "text": "[removed]",
        "created_utc": 1676285127,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m shaking, my life could be ruined and I don’t know what to do.",
        "author": "Adorable_Bike_2522",
        "url": "https://www.reddit.com/r/confession/comments/11151mo/im_shaking_my_life_could_be_ruined_and_i_dont/",
        "text": "[removed]",
        "created_utc": 1676283728,
        "upvote_ratio": 1.0
    },
    {
        "title": "where i live sus balls sus sus sus nsusnsususususususussusususususuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuussssssssssssssssssssssssssssssssssssssssssssssssssss",
        "author": "Particular_Look317",
        "url": "https://www.reddit.com/r/confession/comments/1114y5k/where_i_live_sus_balls_sus_sus_sus/",
        "text": "[removed]",
        "created_utc": 1676283363,
        "upvote_ratio": 1.0
    },
    {
        "title": "I stole benzos from my boss who is an RN and I did a bunch of drugs in my basement room while being a live in",
        "author": "-MxAxNxGxO-",
        "url": "https://www.reddit.com/r/confession/comments/1114w5s/i_stole_benzos_from_my_boss_who_is_an_rn_and_i/",
        "text": "[removed]",
        "created_utc": 1676283157,
        "upvote_ratio": 1.0
    },
    {
        "title": "[M 20] i lost finally my virginity and feel grossed out",
        "author": "Electrical-Number934",
        "url": "https://www.reddit.com/r/confession/comments/11149zb/m_20_i_lost_finally_my_virginity_and_feel_grossed/",
        "text": "[removed]",
        "created_utc": 1676280725,
        "upvote_ratio": 1.0
    },
    {
        "title": "Start fresh, fresh job, fresh, start, quit and/or leave all else behind",
        "author": "UsefulTransition861",
        "url": "https://www.reddit.com/r/confession/comments/1113xcn/start_fresh_fresh_job_fresh_start_quit_andor/",
        "text": "I felt the need to start fresh. Leave your home you created, move elsewhere.Quit your job. Start fresh, to me that means fresh from every angle. If you feel like you’re leaving baggage behind, is it wrong? \n\nA fresh start isn’t a fresh start unless it’s acutely fresh?!",
        "created_utc": 1676279307,
        "upvote_ratio": 1.0
    },
    {
        "title": "i let some terrible people run free and i feel guilty",
        "author": "Final_Blueberry9009",
        "url": "https://www.reddit.com/r/confession/comments/1113rq9/i_let_some_terrible_people_run_free_and_i_feel/",
        "text": "[removed]",
        "created_utc": 1676278679,
        "upvote_ratio": 1.0
    },
    {
        "title": "Illegally Dumped Trash into a Restaurant's Dumpster While on a Date",
        "author": "Loose-Chocolate9704",
        "url": "https://www.reddit.com/r/confession/comments/1113pxg/illegally_dumped_trash_into_a_restaurants/",
        "text": "[removed]",
        "created_utc": 1676278471,
        "upvote_ratio": 1.0
    },
    {
        "title": "I took all of the audio message the girl i was dating sent me, merged them and created a 30 minutes long audio that i listen to when I am anxious",
        "author": "Worthless1557",
        "url": "https://www.reddit.com/r/confession/comments/1113ppa/i_took_all_of_the_audio_message_the_girl_i_was/",
        "text": "[removed]",
        "created_utc": 1676278445,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am in love with my best friend and I feel guilty.",
        "author": "NoIndependent6107",
        "url": "https://www.reddit.com/r/confession/comments/11133qx/i_am_in_love_with_my_best_friend_and_i_feel_guilty/",
        "text": "[removed]",
        "created_utc": 1676276040,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scared to go to nail salons, pretty silly confession I admit",
        "author": "Infinitas69",
        "url": "https://www.reddit.com/r/confession/comments/1112yy2/scared_to_go_to_nail_salons_pretty_silly/",
        "text": "[removed]",
        "created_utc": 1676275514,
        "upvote_ratio": 1.0
    },
    {
        "title": "my mum caught me hooking up but didn't mention it to anyone else",
        "author": "butwhy_tho1305",
        "url": "https://www.reddit.com/r/confession/comments/1112lod/my_mum_caught_me_hooking_up_but_didnt_mention_it/",
        "text": "this was way back in 2021 when COVID was at it's peak. many people from my apartments sadly passed away and one of them happened to be a close family friend. \n\nwe mourned the loss but a few weeks after his son (my long time crush) started snapping me constantly . he would replay me snaps and give out sweet compliments. it seemed odd to me cause we didn't really talk much before.\n\nthis sudden attention sent my brain in a whirl and i somehow agreed to hookup with him for fun. i was delighted that he was my first kiss. but i also noticed that he didn't quite like me the way i liked him.\n\nwe met and had fun and left like it was very normal. there was little to o communication between us except dirty talk. sometimes i used to sneak out in the middle of the night to meet him on my roof. \n\nthat's when one day my mother followed me and saw everything. she didn't interfere and went back to sleep. she kept hinting me in all the mom ways possible. i was oblivious cause i was drunk in lust.\n\na few days later when my father left for a business trip my mother sat me down and asked me what was up with me and him. i tried to lie obviously but she told me she'd seen us and then said a shiton of things about him.\n\ni began crying and she told me that i wasn't to leave my home for a while now. i cried so much that i feel asleep that afternoon. then my mum took my phone while i was sleeping and went through my private snaps and messages.\n\nwhen i got up i saw her crying over my head as if someone was dead. she coaxed me to tell her every litle thing about him and my relationship. she called me names because she saw a video of me and my friends cursing.\n\nthe night was the longest one in my life where i had to tell her everything that i wanted to be a secret for a while. she kept repeating that she'd lost her sweet innocent baby. although she promised to keep this from my father who is way more dramatic than her.\n\nthe night still weighs on my chest like a burden. i had to cut all ties with the one person i had liked for the longest and also give up my phone for a few days. i couldn't tell anyone about this till now. i hope this provides some sort of relief now.",
        "created_utc": 1676274064,
        "upvote_ratio": 1.0
    },
    {
        "title": "I(28F) started messing around with a coworker(30) who has a girlfriend. I recently got divorced and I’m bored.",
        "author": "FlimsyOriginal8937",
        "url": "https://www.reddit.com/r/confession/comments/111222o/i28f_started_messing_around_with_a_coworker30_who/",
        "text": "[removed]",
        "created_utc": 1676271929,
        "upvote_ratio": 1.0
    },
    {
        "title": "[M 20] i finally lost my virginity and feel disgusted and uneasy",
        "author": "Electrical-Number934",
        "url": "https://www.reddit.com/r/confession/comments/11120vt/m_20_i_finally_lost_my_virginity_and_feel/",
        "text": "[removed]",
        "created_utc": 1676271798,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im underage and have been shoplifting alcohol for a few months",
        "author": "throwaway09028645",
        "url": "https://www.reddit.com/r/confession/comments/1111z02/im_underage_and_have_been_shoplifting_alcohol_for/",
        "text": "\nI feel so horribly guilty every time I shoplift, but I almost can't stop myself from doing it when I don't have some distraction or other crutch when I'm not doing well. I can't talk to anyone about this, because of the stigma in general with underage drinking, and shoplifting. It's not like I'm doing this with friends, I just drink alone in my room while watching YouTube, or doing honework.\nI hate the taste of alcohol too, it makes me gag, but I plug my nose and chug what I can, because I just want to be drunk. I generally can go through a twelve pack in a day or two, and there's been times at bad points in my life a few months ago that I've stolen more than one box of beer a week. My medication makes the effects of alcohol more intense, so I've been able to satiate myself with just beers, for anyone curious, haha. I live in a decent area, and so I'm sure there's less security, and I generally tend to pretend to \"check out\" at the in store Starbucks that can be accessed without going through the registers. \n\n(I'm aware I have undiagnosed issues, and a lot of the time, I can only feel less stressed or anxious if I'm drunk or high. I try to vape weed (d8), but generally am unable to because of my location and age.)\n\nI don't know how to stop myself. I want to. This is dangerous, I'm sure (I unfortunately can't find it in myself to care much, right now), but the main issue I'm facing is that I feel so awful and guilty, but it's not like it's a conscience, because that would have stopped me. I guess I'm posting to see if I am a bad person for being unable to stand up to my impulses, or not. Thank you for your time, whoever reads this.",
        "created_utc": 1676271612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wife is the only cause of my depression. Cannot find any other reason. My depression is getting worse and I don't know how to get out of this. Words of encourage or wisdom?",
        "author": "tryingtofindjoyagain",
        "url": "https://www.reddit.com/r/confession/comments/1111xtu/wife_is_the_only_cause_of_my_depression_cannot/",
        "text": "[removed]",
        "created_utc": 1676271497,
        "upvote_ratio": 1.0
    },
    {
        "title": "I reported a DoorDasher while working at a restaurant",
        "author": "TheGuiltyMan1414",
        "url": "https://www.reddit.com/r/confession/comments/1111644/i_reported_a_doordasher_while_working_at_a/",
        "text": "Last year, I worked at this restaurant and handled to-go orders. We work with DoorDash and one day, I was behind the bar and the other bartender working for the night told me that a DoorDasher was here and that he was in a red hat. I grabbed the order, spotted the guy in the red hat, and asked him if he was here to pick up an order. He seemed caught off-guard but said yes and as he left, he told me 'that's racial profiling' and apparently it's a stereotype for black people to work for DoorDash (never heard of this) and left. I was furious because I couldn't say anything.\n\nFor added context, that same year, I had a lady accuse me of giving me 'racial undertones' to her and complained to management about me. I thankfully didn't get in any trouble because management knew it was BS but I was powerless in that situation and am still bitter about it to this day. And when this happened, I decided I wasn't gonna take this anymore.\n\nSo I stepped out behind work, called DoorDash themselves, reported that DoorDasher over the phone, and told them all the details. They said they would take care of it. I have no idea what happened after the fact. Maybe nothing for all I know. But, I felt a little proud of myself because this was a rare instance where I stood up for myself and took control (interpret that how you will) of a situation.\n\nNowadays, I wonder if I overreacted. I mean, I'll probably never see that guy ever again and there could be a possibility that he got fired. Again, I don't know and to be honest, I didn't think he should get fired, just given a stern warning and an explanation of what really happened. But I take solace in knowing that I didn't stand idly and let myself get treated like garbage.",
        "created_utc": 1676268597,
        "upvote_ratio": 1.0
    },
    {
        "title": "I reported a DoorDasher for accusing me of 'racially profiling' him",
        "author": "TheGuiltyMan1414",
        "url": "https://www.reddit.com/r/confession/comments/11115qe/i_reported_a_doordasher_for_accusing_me_of/",
        "text": "[removed]",
        "created_utc": 1676268557,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it bad that I love rating cocks?,Feel free to share to rate",
        "author": "slimlatino77",
        "url": "https://www.reddit.com/r/confession/comments/111133w/is_it_bad_that_i_love_rating_cocksfeel_free_to/",
        "text": "[removed]",
        "created_utc": 1676268282,
        "upvote_ratio": 1.0
    }
]