[
    {
        "title": "I don't like my brother's family because his wife &amp; daughters are autistic and a little too silly/weird for me",
        "author": "TaquitosLoquitos",
        "url": "https://www.reddit.com/r/confession/comments/11rs4aw/i_dont_like_my_brothers_family_because_his_wife/",
        "text": "[removed]",
        "created_utc": 1678875082,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't tell my friends how bad my anxiety really gets",
        "author": "Derptonbauhurp",
        "url": "https://www.reddit.com/r/confession/comments/11rs333/i_dont_tell_my_friends_how_bad_my_anxiety_really/",
        "text": "[removed]",
        "created_utc": 1678874973,
        "upvote_ratio": 1.0
    },
    {
        "title": "I know am attractive and I resent people who think I should pretend I don’t know",
        "author": "fairyfernn",
        "url": "https://www.reddit.com/r/confession/comments/11rs0jh/i_know_am_attractive_and_i_resent_people_who/",
        "text": "[removed]",
        "created_utc": 1678874736,
        "upvote_ratio": 1.0
    },
    {
        "title": "i feel that my life is not like it suppose to be..",
        "author": "Lisamwowwow193838",
        "url": "https://www.reddit.com/r/confession/comments/11rryut/i_feel_that_my_life_is_not_like_it_suppose_to_be/",
        "text": "[removed]",
        "created_utc": 1678874580,
        "upvote_ratio": 1.0
    },
    {
        "title": "I slept with my best friends boyfriend and I need to tell her",
        "author": "throwaway196277",
        "url": "https://www.reddit.com/r/confession/comments/11rrb14/i_slept_with_my_best_friends_boyfriend_and_i_need/",
        "text": "[removed]",
        "created_utc": 1678872356,
        "upvote_ratio": 1.0
    },
    {
        "title": "i dated a minor for 3 month when i was 19 and the decision haunts me to this day",
        "author": "New_Food8381",
        "url": "https://www.reddit.com/r/confession/comments/11rr8g9/i_dated_a_minor_for_3_month_when_i_was_19_and_the/",
        "text": "[removed]",
        "created_utc": 1678872110,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve been F*ing my cousin’s best friend behind his back.",
        "author": "the_second_slipper_",
        "url": "https://www.reddit.com/r/confession/comments/11rr4wa/ive_been_fing_my_cousins_best_friend_behind_his/",
        "text": "[removed]",
        "created_utc": 1678871776,
        "upvote_ratio": 1.0
    },
    {
        "title": "No one I know would ever imagine the little slut i've become",
        "author": "69sexifun69",
        "url": "https://www.reddit.com/r/confession/comments/11rqxou/no_one_i_know_would_ever_imagine_the_little_slut/",
        "text": "I discovered reddit and it was innocent enough at 1st. I don't have a ton of sexual experience.. I didn't know about a lot of things.. I started posting pictures and realized that I enjoyed showing off.. and that I liked a lot of kinky things that I never would have imagined. I realized that i think i jave a daddy kink. Older men make me so horny. I discovered toys and naughty lingerie and how much they added to sexual experiences. I Made an Amazon wish list at the suggestion of a redditor and he sent me some panties. I've never been so turned on by receiving a package in the mail. I immediately had to put the panties on and play with myself in them. The compulsion to be naughty and slutty a thank you it's so dirty but hot. I Never would have imagined how much being a bought slut turns me on. Anytime I think about it my pussy leaks. It's something about my being used as a transaction. I guess being a whore gets me off. I also live with my extremely religious parents who would FREAK if they knew any of this. Since I just finished high-school they still support me. Since they won't buy me naughty things I'll earn them. 😈😊",
        "created_utc": 1678871111,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mi ex dijo que quería estar solo después de haber tenido \"sex\"",
        "author": "Kanelita11",
        "url": "https://www.reddit.com/r/confession/comments/11rqosa/mi_ex_dijo_que_quería_estar_solo_después_de_haber/",
        "text": "[removed]",
        "created_utc": 1678870296,
        "upvote_ratio": 1.0
    },
    {
        "title": "Llegué de Perú a estudiar Argentina, creen que es buen opción?",
        "author": "Kanelita11",
        "url": "https://www.reddit.com/r/confession/comments/11rqkf2/llegué_de_perú_a_estudiar_argentina_creen_que_es/",
        "text": "[removed]",
        "created_utc": 1678869868,
        "upvote_ratio": 1.0
    },
    {
        "title": "Raped by teacher at age 17 and I think he is stalking me (help)",
        "author": "Specialist-Net-5204",
        "url": "https://www.reddit.com/r/confession/comments/11rqh2v/raped_by_teacher_at_age_17_and_i_think_he_is/",
        "text": "[removed]",
        "created_utc": 1678869538,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate my SIL. My brother got married and his wife is the worst.",
        "author": "Significant-Speech74",
        "url": "https://www.reddit.com/r/confession/comments/11rp8cs/i_hate_my_sil_my_brother_got_married_and_his_wife/",
        "text": "[removed]",
        "created_utc": 1678865235,
        "upvote_ratio": 1.0
    },
    {
        "title": "I cannot stand my dad’s voice and everyday I wish him dead",
        "author": "Barbgigie",
        "url": "https://www.reddit.com/r/confession/comments/11roorv/i_cannot_stand_my_dads_voice_and_everyday_i_wish/",
        "text": "[removed]",
        "created_utc": 1678863347,
        "upvote_ratio": 1.0
    },
    {
        "title": "When I was a kid I use to cut the tips of the white plastic forks.",
        "author": "Bluntforcetruth94",
        "url": "https://www.reddit.com/r/confession/comments/11romn1/when_i_was_a_kid_i_use_to_cut_the_tips_of_the/",
        "text": "I use to cut the tips of the plastic forks off and throw them into the ground and watch my drug addicted abusive father pick through the dust pile for crack cocaine he thought he had lost so that i could watch him smoke plastic forks tips and I do not regret it..",
        "created_utc": 1678863137,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im always so fucking annoyed and irritated at everything anyone does.",
        "author": "WhatTheFxckAmIDoingx",
        "url": "https://www.reddit.com/r/confession/comments/11rogrd/im_always_so_fucking_annoyed_and_irritated_at/",
        "text": "I dont literally mean everybody but when it comes to the way people act i cant fucking stand it and everybody makes me cringe. I keep to myself most of the time and try to avoid any sort of in person social situation as much as possible. Recently i’ve been getting super annoyed at almost everything people do online. I mostly get annoyed at people making videos of them doing simple things like cooking or singing along to a song. Its like whenever i watch those videos it seems like a copy and paste of the last. I just wish people could be more original and then maybe it wouldn’t be such a problem for me. I know I am definitely the asshole in this situation. I want to learn how to not be so judgmental and hateful but it’s really really hard",
        "created_utc": 1678862562,
        "upvote_ratio": 1.0
    },
    {
        "title": "In love with my straight best friend for four years",
        "author": "aries5796",
        "url": "https://www.reddit.com/r/confession/comments/11ro1jm/in_love_with_my_straight_best_friend_for_four/",
        "text": "[removed]",
        "created_utc": 1678861152,
        "upvote_ratio": 1.0
    },
    {
        "title": "I nearly died a few days ago and it’s made me feel like somethings wrong with me.",
        "author": "notoneforlies",
        "url": "https://www.reddit.com/r/confession/comments/11rnt8h/i_nearly_died_a_few_days_ago_and_its_made_me_feel/",
        "text": "[removed]",
        "created_utc": 1678860388,
        "upvote_ratio": 1.0
    },
    {
        "title": "Debating giving up custody of my child.. before you judge. Please read the entire post.",
        "author": "aikomomma",
        "url": "/user/aikomomma/comments/11rmrm9/debating_giving_up_custody_of_my_child_before_you/",
        "text": "",
        "created_utc": 1678856876,
        "upvote_ratio": 1.0
    },
    {
        "title": "This guy has been liking all my IG stories and trying to talk to me. So when I did respond, I just word vomited and he finally unfollowed me.",
        "author": "CuteFruitandPumpkin",
        "url": "https://www.reddit.com/r/confession/comments/11rmad7/this_guy_has_been_liking_all_my_ig_stories_and/",
        "text": "[removed]",
        "created_utc": 1678855312,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was SA as a teenager and I just need to get it off my chest.",
        "author": "Junior-External-7815",
        "url": "https://www.reddit.com/r/confession/comments/11rm10b/i_was_sa_as_a_teenager_and_i_just_need_to_get_it/",
        "text": "When I was 16 years old, I went to a party with some friends that I thought I could trust. There with this guy that I felt him staring at me the whole time, so my gut told me to keep my eyes on him. There was a bon fire so I decided to go outside with everyone in the hopes I’d get away from him. I was drinking and they were passing around a joint, I decided to take a hit and realized he was a person away from me. Later on to realize I’d regret it. Not even moments after taking the hit I felt weird. It wasn’t a normal high feeling. I decided to make my way to the bathroom and I was staggering. I smoked plenty before and never felt that way. I knew someone laced the joint. I made it to the bathroom and that same guy from earlier put his foot in the doorway and asked if I needed company and I said no thanks. He said we’ll your messed up you don’t know what you want. I tried to close the door and he kept insisting and I said no and finally was able to close the door. I was so scared I felt my heart coming out of my chest. I started calling as many people as I could to see if someone would come for me. I was down the street from my house but I was in no shape to get myself out of there. No one answered and girls kept knocking on the door. I waited for a while which felt like forever for someone to call me back…. but nobody did. Eventually I had enough girls telling me to hurry I decided to leave and try to make my way to the door. The same guy from earlier grabbed me and covered my mouth and dragged me in a room. I felt so helpless because I had no control over my body. Someone girl I knew saw him grab me and she laughed while I begged her to help me…  he took me in the room and took complete advantage of me. I begged him to stop, I cried and tried to scream but he covered my mouth. He said stop acting like this I know you want it. I tried to scratch his eyes and he just hit me and ripped my shirt. I felt so helpless.. after it was all over he left me there and took my underwear from me. I was so ashamed to leave the room, the same girl I asked for help was still there. She watched me walk out of the room full of tears.. she didn’t even bother to ask me if I  was okay when it was clear that i wasn't. \nThat same girl decided to spread rumors about it with that guy and say I gave it up to him… little did they know, I was still a virgin …. 😔 \nI missed school for a whole week after i found out about the rumors. on top of all of that, he had the nerve to go up to me that following Monday and tell me how good i was… what a sick bastard. \n\nWhat hurts until this day is my own friend I tried to call her (at the time)and tell her what happened.. she didn’t believe me. \nI may have healed from this pain, but for my own friend to not believe me? I thought i would at least have her by my side to help me through this. But nope, I faced it all alone.",
        "created_utc": 1678854515,
        "upvote_ratio": 1.0
    },
    {
        "title": "It was me. I was the one who farted in the elevator right before you go on.",
        "author": "Fluffy_Primary8879",
        "url": "https://www.reddit.com/r/confession/comments/11rlmd0/it_was_me_i_was_the_one_who_farted_in_the/",
        "text": "[removed]",
        "created_utc": 1678853286,
        "upvote_ratio": 1.0
    },
    {
        "title": "I screwed up over a year ago by drinking and driving.",
        "author": "Lap_Killa",
        "url": "https://www.reddit.com/r/confession/comments/11rl9mo/i_screwed_up_over_a_year_ago_by_drinking_and/",
        "text": "Now I don't defend the the action and still believe it was the stupidest thing I've ever done that costed me everything. But hear me out first. I've been driving truck during covid and making those hot runs delivering loads to USA and Canada daily. I went from truck to my house every time. I had to have food delivered to my house all the time. Payed extra for delivery simply because I had extra USA dollars and got told at the store \"we don't accept the currency and you better leave now\". At one point I snapped and started drinking. I just couldn't take it anymore. I've been surrounded by people demanding aggressively what I have in my trailer while delivering to stores and distribution centers. Yea that was the thanks I got for driving up to 20 hours a day and nearly passing out just to make sure people get their stuff. We'll I had some drinks and had an accident at the end. No one was hurt in the accident except my record. Well tomorrow is my court. Our court system lied to me and told me a year ago \"call this number and prepare your defence\" turned out to be \"call the other number and ask for a completely deferential court room\". I won't be surprised that my court systems comes up with a different excuse for dragging this out just do they can make more money.",
        "created_utc": 1678852273,
        "upvote_ratio": 1.0
    },
    {
        "title": "I laugh at wrong moments and always get away with it.",
        "author": "waffle_gorl",
        "url": "https://www.reddit.com/r/confession/comments/11rl5a4/i_laugh_at_wrong_moments_and_always_get_away_with/",
        "text": "One time in my 6th grade art class, my crush was absent. His friend sat across from me and he said \"[name]'s grandpa died today. That's why he's absent.\" and I accidentally chuckled on accident. Then another kid said \"Why would you laugh about that.\" and at the moment i knew i fucked up. So i was like \" I didn't mean to! i promise. Dont tell him.\" and his friend said \" I am going to tell him.\" \nThe next day I was terrified (Art was my first period) and my crush came back to school. At first, they didn't say anything. I assumed they forgot. And i thought i was free. Then, his friend said, \" [my name] sais something about your grandfather.\" and with the most terrifying look , my crush said \"What did you say about my grandfather?\" and i went straight to the bathroom and i almost threw up. Later that day at lunch, i got called to the teacher and she was like \"I heard you laughed about [crush]'s grandpa dying.\" \nand i said with a straight face \" i only laughed because i wasn't expecting that. and its was also like a nervous laugh.\" she only understood because her daughter does the same thing. I apologised and we are okay peers now. turns out that i am great at lying and i can lie easily without getting caught.",
        "created_utc": 1678851931,
        "upvote_ratio": 1.0
    },
    {
        "title": "i can't stand up for myself not even in an argument",
        "author": "streetman101",
        "url": "https://www.reddit.com/r/confession/comments/11rkxto/i_cant_stand_up_for_myself_not_even_in_an_argument/",
        "text": "[removed]",
        "created_utc": 1678851349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can’t find myself at 24 , hard times in work and personal life",
        "author": "Comfortable_Two2458",
        "url": "https://www.reddit.com/r/confession/comments/11rknix/cant_find_myself_at_24_hard_times_in_work_and/",
        "text": "[removed]",
        "created_utc": 1678850555,
        "upvote_ratio": 1.0
    },
    {
        "title": "i think i’m starting a relationship with a married man",
        "author": "twinkkcowboy",
        "url": "https://www.reddit.com/r/confession/comments/11rjr4f/i_think_im_starting_a_relationship_with_a_married/",
        "text": "[removed]",
        "created_utc": 1678848191,
        "upvote_ratio": 1.0
    },
    {
        "title": "my friend was in bed with the guy i’m talking to what do i do now?",
        "author": "angiie_l3",
        "url": "https://www.reddit.com/r/confession/comments/11rjj5b/my_friend_was_in_bed_with_the_guy_im_talking_to/",
        "text": "[removed]",
        "created_utc": 1678847636,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I banned now? I have made post and forgot to clarify some things which I thick made mods remove it",
        "author": "eikcndbsg",
        "url": "https://www.reddit.com/r/confession/comments/11rj9pz/am_i_banned_now_i_have_made_post_and_forgot_to/",
        "text": "[removed]",
        "created_utc": 1678847009,
        "upvote_ratio": 1.0
    },
    {
        "title": "I keep lying to everyone I know, I am NOT happy at all.",
        "author": "iyellowguy",
        "url": "https://www.reddit.com/r/confession/comments/11rj9d0/i_keep_lying_to_everyone_i_know_i_am_not_happy_at/",
        "text": "[removed]",
        "created_utc": 1678846984,
        "upvote_ratio": 1.0
    },
    {
        "title": "While I should be hearing our child’s first heart beat..",
        "author": "broken_96",
        "url": "https://www.reddit.com/r/confession/comments/11rj4j5/while_i_should_be_hearing_our_childs_first_heart/",
        "text": "[removed]",
        "created_utc": 1678846661,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't want an important or powerful job. I just want to exist and do stuff",
        "author": "conscilescent",
        "url": "https://www.reddit.com/r/confession/comments/11rj24z/i_dont_want_an_important_or_powerful_job_i_just/",
        "text": "[removed]",
        "created_utc": 1678846506,
        "upvote_ratio": 1.0
    },
    {
        "title": "I watched girl have sex with dog and I really don’t know",
        "author": "Due-Life188",
        "url": "https://www.reddit.com/r/confession/comments/11riwv2/i_watched_girl_have_sex_with_dog_and_i_really/",
        "text": "[removed]",
        "created_utc": 1678846174,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my psychologist [38F] being naive or am I [27F] the one who is?",
        "author": "halfofthemoney",
        "url": "https://www.reddit.com/r/confession/comments/11rirrm/is_my_psychologist_38f_being_naive_or_am_i_27f/",
        "text": "[removed]",
        "created_utc": 1678845844,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I [27F] experiencing gaslighting by her [38F] or am I just incredibly misinformed?",
        "author": "halfofthemoney",
        "url": "https://www.reddit.com/r/confession/comments/11rirhe/am_i_27f_experiencing_gaslighting_by_her_38f_or/",
        "text": "[removed]",
        "created_utc": 1678845825,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I [27F] trust the most common views that are expressed online, on Reddit and on this subreddit. Or should I trust the views of the people in my life? [33F] [62F] [56M]",
        "author": "halfofthemoney",
        "url": "https://www.reddit.com/r/confession/comments/11rir3b/should_i_27f_trust_the_most_common_views_that_are/",
        "text": "[removed]",
        "created_utc": 1678845800,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've struggled with depression for years but don't know how to break it to my parents.",
        "author": "Honest_throwaway00",
        "url": "https://www.reddit.com/r/confession/comments/11riqjd/ive_struggled_with_depression_for_years_but_dont/",
        "text": "[removed]",
        "created_utc": 1678845765,
        "upvote_ratio": 1.0
    },
    {
        "title": "Drunken wedding night on a country club golf course.",
        "author": "wolfey200",
        "url": "https://www.reddit.com/r/confession/comments/11rimuk/drunken_wedding_night_on_a_country_club_golf/",
        "text": "[removed]",
        "created_utc": 1678845549,
        "upvote_ratio": 1.0
    },
    {
        "title": "I viewed illegal sexual material at 17 and was almost killed for it. My guilt and shame still cripples me to this day.",
        "author": "Jolly-Pension-910",
        "url": "https://www.reddit.com/r/confession/comments/11ri92w/i_viewed_illegal_sexual_material_at_17_and_was/",
        "text": "[removed]",
        "created_utc": 1678844671,
        "upvote_ratio": 1.0
    },
    {
        "title": "I regretted what I have done, I realize how important they are now.",
        "author": "hotgirl_charmie",
        "url": "https://www.reddit.com/r/confession/comments/11ri82i/i_regretted_what_i_have_done_i_realize_how/",
        "text": "I used to swat bees in my yard with a bat when I was a little kid. I sincerely apologize to every bee I have hurt. I cherish bees.  \n\n\nThey are one of the most important species in our planet. If there are no bees, there will be no humans.",
        "created_utc": 1678844604,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Am I the asshole” for getting mad and hitting my dog?",
        "author": "SictyTen",
        "url": "https://www.reddit.com/r/confession/comments/11rhysh/am_i_the_asshole_for_getting_mad_and_hitting_my/",
        "text": "[removed]",
        "created_utc": 1678844006,
        "upvote_ratio": 1.0
    },
    {
        "title": "You have a mean sense of humor and I respect you less because of it",
        "author": "ThrowRAdiscarddamage",
        "url": "https://www.reddit.com/r/confession/comments/11rhhdp/you_have_a_mean_sense_of_humor_and_i_respect_you/",
        "text": "[removed]",
        "created_utc": 1678842957,
        "upvote_ratio": 1.0
    },
    {
        "title": "I...pretended to be someone (online) who got r-worded.. I had MAJOR mental issues at the time. I have needed this off my chest for so long. Tell me- Would you forgive me?",
        "author": "DannyDaBunny",
        "url": "https://www.reddit.com/r/confession/comments/11rhay3/ipretended_to_be_someone_online_who_got_rworded_i/",
        "text": "[removed]",
        "created_utc": 1678842567,
        "upvote_ratio": 0.99
    },
    {
        "title": "Hello why the hell can I not post anything does it contain some banned words of something I do not understand",
        "author": "mzlapqowks",
        "url": "https://www.reddit.com/r/confession/comments/11rh5v8/hello_why_the_hell_can_i_not_post_anything_does/",
        "text": "[removed]",
        "created_utc": 1678842270,
        "upvote_ratio": 1.0
    },
    {
        "title": "I...pretended to be someone who got @b^$3D.. I was younger and had MAJOR mental issues at the time. I have needed this off my chest for so long. Tell me- Would you forgive me?",
        "author": "DannyDaBunny",
        "url": "https://www.reddit.com/r/confession/comments/11rh5dr/ipretended_to_be_someone_who_got_b3d_i_was/",
        "text": "[removed]",
        "created_utc": 1678842241,
        "upvote_ratio": 1.0
    },
    {
        "title": "I...pretended to be someone who got abused.. I was around 12 years old and had MAJOR mental issues at the time. I have needed this off my chest for so long. Tell me- Would you forgive me?",
        "author": "DannyDaBunny",
        "url": "https://www.reddit.com/r/confession/comments/11rgxet/ipretended_to_be_someone_who_got_abused_i_was/",
        "text": "[removed]",
        "created_utc": 1678841807,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there anybody out there that might understand? I need help. Erase the scribble. Forget the memory. I was never here.",
        "author": "katacane",
        "url": "https://www.reddit.com/r/confession/comments/11rgw2d/is_there_anybody_out_there_that_might_understand/",
        "text": "[removed]",
        "created_utc": 1678841733,
        "upvote_ratio": 1.0
    },
    {
        "title": "I religiously pee in the sink to save water and money",
        "author": "bestbobafettyet",
        "url": "https://www.reddit.com/r/confession/comments/11rgoxj/i_religiously_pee_in_the_sink_to_save_water_and/",
        "text": "[removed]",
        "created_utc": 1678841331,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doc told me I have an s4 gallop can someone explain with that means?",
        "author": "Material_Math_7829",
        "url": "https://www.reddit.com/r/confession/comments/11rgmqr/doc_told_me_i_have_an_s4_gallop_can_someone/",
        "text": "[removed]",
        "created_utc": 1678841207,
        "upvote_ratio": 1.0
    },
    {
        "title": "I came to the realization that I will never be happy and now it makes me feel worse.",
        "author": "Neither-Energy-9250",
        "url": "https://www.reddit.com/r/confession/comments/11rgh20/i_came_to_the_realization_that_i_will_never_be/",
        "text": "[removed]",
        "created_utc": 1678840897,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saw someone from an old class today at my little brothers karate class. i feel like a horrible person",
        "author": "filmnerd0",
        "url": "https://www.reddit.com/r/confession/comments/11rga2n/saw_someone_from_an_old_class_today_at_my_little/",
        "text": "[removed]",
        "created_utc": 1678840518,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do I do about my iPad that I got fixed. Dude gave it back and finessed me. :/",
        "author": "Ruined-Universe",
        "url": "https://www.reddit.com/r/confession/comments/11rg8vn/what_do_i_do_about_my_ipad_that_i_got_fixed_dude/",
        "text": "So for back story I bought an iPad 8th gen and Apple Pencil from this lady bc she wanted to get her kid a phone. Screen was demolished. I didn’t mind because I’ve never had one before.. ( I do digital art and it’s hard to do on an iPhone 11) so I found a shop in the next city and take it to him. First he told me it would be done in two days I said alright give him the tablet two days past and I text him.. nothing. Radio silence. I give it another day. Call him up a few times told him I was in town. Finally show up at his place of work and he finally calls back (because he can see I wasn’t bullsh*tying on his cameras) and says it’ll be four more days. I usually don’t give people the time of day with things but I just needed a cheap and good fix! His reviews were great(assuming now they were all friends) and I go get the tablet wait 30 minutes in his “office” and get the tablet. It’s a rose gold with a white screen tablet(if you know Apple you know.) I looked at the screen in horror. It was a black screen. He turns it on it works. So I pay him and leave. Took a closer inspection when I leave( my dumbass shouldn’t have left) and find out the LCD is still broken behind a brand new screen. So the places that didn’t work before. Guess what. Still no longer work. What do I do?!?",
        "created_utc": 1678840457,
        "upvote_ratio": 1.0
    },
    {
        "title": "My son is a lunatic but we can't ever tell him upfront",
        "author": "OneStopRedditor",
        "url": "https://www.reddit.com/r/confession/comments/11rfvaw/my_son_is_a_lunatic_but_we_cant_ever_tell_him/",
        "text": "My son is in his early twenties. We knew growing up that some things were strange about him.\n\nTwo years ago I found about he was using the drug coke in his bedroom there was a bad and smell and noises he has always been bad with personal hygiene.\n\nWe listened out and did a drone scope of his window one day and he was snorting large amounts of the stuff and masturbating relentlessly. He was talking to himself which is also a thing we have noticed but he does not do it out loud in public or around people the strange thing is he can act almost normal in such a situation. There is other weird stuff like we will hear his headphones on full volume and look at the same music videos over and over again or he will watch the same things on repeat.\n\nHe has always been a shy boy he knows we found out about the coke and we did something that made him realise this can not happen around his family or in the house he does it in. \n\nI feel like a terrible mother but honestly everything about him screams lunatic but I do love him and so does his family we have never told him or discussed it with him he just thinks that we knew was doing coke one day on his bedroom. He knows that we know we have had to deny it and basically gaslight him but the alternative would crush him.\n\nHe is the complete opposite of violence he has never hit or hurt someone and he does not like shouting or conflict. He does not at all seem like a danger to the public but at first I did until spending so much time later with him.\n\nI wish I knew what he was suffering with and how to help him.",
        "created_utc": 1678839744,
        "upvote_ratio": 1.0
    },
    {
        "title": "My son is a lunatic but we can't we can't ever tell him the truth..",
        "author": "OneStopRedditor",
        "url": "https://www.reddit.com/r/confession/comments/11rfu7p/my_son_is_a_lunatic_but_we_cant_we_cant_ever_tell/",
        "text": "My son is in his early twenties. We knew growing up that some things were strange about him.\n\nTwo years ago I found about he was using the drug coke in his bedroom there was a bad and smell and noises he has always been bad with personal hygiene.\n\nWe listened out and did a drone scope of his window one day and he was snorting large amounts of the stuff and masturbating relentlessly. He was talking to himself which is also a thing we have noticed but he does not do it out loud in public or around people the strange thing is he can act almost normal in such a situation. There is other weird stuff like we will hear his headphones on full volume and look at the same music videos over and over again or he will watch the same things on repeat.\n\nHe has always been a shy boy he knows we found out about the coke and we did something that made him realise this can not happen around his family or in the house he does it in. \n\nI feel like a terrible mother but honestly everything about him screams lunatic but I do love him and so does his family we have never told him or discussed it with him he just thinks that we knew was doing coke one day on his bedroom. He knows that we know we have had to deny it and basically gaslight him but the alternative would crush him.\n\nHe is the complete opposite of violence he has never hit or hurt someone and he does not like shouting or conflict. He does not at all seem like a danger to the public but at first I did until spending so much time later with him.\n\nI wish I knew what he was suffering with and how to help him.",
        "created_utc": 1678839690,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something bad may have happened to my friend and I don’t know what to do or think.",
        "author": "Dry_Concentrate_8807",
        "url": "https://www.reddit.com/r/confession/comments/11rfapd/something_bad_may_have_happened_to_my_friend_and/",
        "text": "[removed]",
        "created_utc": 1678837389,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just possibly broke my own toe to get off of gym class",
        "author": "catpack4",
        "url": "https://www.reddit.com/r/confession/comments/11rf8gg/just_possibly_broke_my_own_toe_to_get_off_of_gym/",
        "text": "[removed]",
        "created_utc": 1678835723,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to make money fast and easy and not reveal your identity?",
        "author": "girlwithask1234",
        "url": "https://www.reddit.com/r/confession/comments/11rf850/how_to_make_money_fast_and_easy_and_not_reveal/",
        "text": "[removed]",
        "created_utc": 1678835448,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to make money fast and easy and not reveal your identity?",
        "author": "girlwithask1234",
        "url": "https://www.reddit.com/r/confession/comments/11rf849/how_to_make_money_fast_and_easy_and_not_reveal/",
        "text": "[removed]",
        "created_utc": 1678835436,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should I do if I’m being kicked out of a trio I made?",
        "author": "xmimi7",
        "url": "https://www.reddit.com/r/confession/comments/11rf7d3/what_should_i_do_if_im_being_kicked_out_of_a_trio/",
        "text": "[removed]",
        "created_utc": 1678834849,
        "upvote_ratio": 1.0
    },
    {
        "title": "24f I'm seeking to have my holes filled tight and more available to link and I'm pretty to open to new stuff",
        "author": "Anita_2003",
        "url": "https://www.reddit.com/r/confession/comments/11rf41w/24f_im_seeking_to_have_my_holes_filled_tight_and/",
        "text": "[removed]",
        "created_utc": 1678820501,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm in denial of a possible SA that has happened to me.",
        "author": "No-Contribution8844",
        "url": "https://www.reddit.com/r/confession/comments/11rf09f/im_in_denial_of_a_possible_sa_that_has_happened/",
        "text": "TW for SA \n\nI don't really know if I fully want to post this, I just feel like I want to get it off my chest with out making my loved ones think I'm paranoid about this.\n\nWhen I was younger(7) had an uncle, who might have been 17-19 (I never really knew his age I just new he was either ending highschool or staring uni). I never felt comfortable meeting with him, I expressed this to my mother several times but I guess she must have thought I was being rude. I think I should mention why I might have come across as 'rude' for not feeling comfortable with him, it was because he is on the autism spectrum and was deaf (he had hearing aids and could participate in conversations). I never really saw that as a problem but it was more so knowing he would always stare at me weirdly. I always had a gut feeling to stay clear of him. Which of course failed as I was forced to meet him several times.\n\nThere was a family gathering and I wasn't feeling well at the time and stayed in the guest room to rest. Unfortunately, he decided to accompany me. Now I was young, when given with the simple instructions, 'Rest and don't go anywhere else, this isn't our house.\". I'm going to follow that. So even though I want to avoid him at all cost I remember trying to ignore it to the best of my abilities and not be 'rude' and play with him. His 'games' he made up along the way involved constantly making sure I sat close to him, maintaining physical contact and touching me. I ran to the otherside of the room which then started a back and forth chase where he would come after me and pin me to the bed and I'd try to get away from him again. \n\nMy memory becomes hazy at this point I'm not sure what happened or if anything happened but I remember standing near my mom in the dinning room refusing to go back and crying every time my uncle tried taking me back to the room.\n\nAt the end of the day when everyone was saying their goodbyes, infont of everyone grabbed me and kissing me on my lips and giggled. And to this day I am still kinda mad about it cause ever one just stared in shocked and did nothing. My own parents didn't do anything. There was no anger or fights just uneasiness. \n\nI didn't think much of it afterwards. In fact I only remembered it last year, I brought it up to my parents and they rubbed it off again and I forgot about it again thinking maybe I might have been overdramatic. \n\nI am now 18, around the age he was. And every now and then I remember it and I get so mad and feel a sense of hopelessness yet for some reason I am still in denial. I'm not sure why but a part of me feels like I'm being overdramatic.   \n\n\nI talked about it briefly recently about this to my partner and they said it was definitely SA. Then why do I feel guilty, why am I in denial. I hope sharing this might get some pressure off my chest since its been eating me for days.",
        "created_utc": 1678820288,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m a 22 college dropout and managed to save up 10k in my bank today.",
        "author": "c0wluvr",
        "url": "https://www.reddit.com/r/confession/comments/11relav/im_a_22_college_dropout_and_managed_to_save_up/",
        "text": "I grew up in a lower class family (parents divorced). I never thought about money and spent it crazily. Being 22 and a college dropout - I managed to save 10k in 7 months.  I just deposited the last of the money to make it an even 10k.\n\nI don’t know who to tell, bc I don’t want to come off as cocky or braggy. I just never thought this could be attainable until I started budgeting and applying myself.\n\nMy next goal is 30k by the end of the year. \n\nIf anybody can tell me what to save up for or invest in - please help me out!\n\nNot interested in buying a house - I’m 22 and I also don’t want to settle in a house ever.",
        "created_utc": 1678819402,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am never working at tesco again not after that night",
        "author": "Horrorstories87",
        "url": "https://www.reddit.com/r/confession/comments/11refwu/i_am_never_working_at_tesco_again_not_after_that/",
        "text": "[removed]",
        "created_utc": 1678819076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spent 30 minutes in the bathroom because I was bored at work and wasted time. No one noticed. What’s the longest you spent without someone noticing. It was 8.5 hour shift",
        "author": "Iovebatman",
        "url": "https://www.reddit.com/r/confession/comments/11rdpc8/spent_30_minutes_in_the_bathroom_because_i_was/",
        "text": "Anyone else do this? Or longer?",
        "created_utc": 1678817464,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nancy Thomas 💖 retail therapy 💖 SCAM, unprofessional",
        "author": "alandisv",
        "url": "https://www.reddit.com/r/confession/comments/11rdopg/nancy_thomas_retail_therapy_scam_unprofessional/",
        "text": "Ordered a hand bag from this group. When dealing with Nancy Thomas I was given over 5 shipping dates, one being the day I ordered. After a month I was refused a refund and blocked. Still nothing. I’ve heard of people having okay experiences with this woman. Mine was not. Buyer beware.",
        "created_utc": 1678817428,
        "upvote_ratio": 1.0
    },
    {
        "title": "Abnormal jealousy without any cause is slowly killing my relationships",
        "author": "Ok-Inevitable-2773",
        "url": "https://www.reddit.com/r/confession/comments/11rdml3/abnormal_jealousy_without_any_cause_is_slowly/",
        "text": "[removed]",
        "created_utc": 1678817301,
        "upvote_ratio": 1.0
    },
    {
        "title": "My life has fell apart in just months. I thought I was in a good place but was so wrong.",
        "author": "idawdwhtml",
        "url": "https://www.reddit.com/r/confession/comments/11rcpz3/my_life_has_fell_apart_in_just_months_i_thought_i/",
        "text": "[removed]",
        "created_utc": 1678815352,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do we have an obligation to love our family? How to let go of guilt for nor being strong enough when it was needed?",
        "author": "National_Product4683",
        "url": "https://www.reddit.com/r/confession/comments/11rcoj2/do_we_have_an_obligation_to_love_our_family_how/",
        "text": "[removed]",
        "created_utc": 1678815271,
        "upvote_ratio": 1.0
    },
    {
        "title": "I mix tabs and spaces in my code before I post it on github",
        "author": "drugged_programmer",
        "url": "https://www.reddit.com/r/confession/comments/11rc29q/i_mix_tabs_and_spaces_in_my_code_before_i_post_it/",
        "text": "I started doing this to prevent script kiddies but now I'm treating this as a challenge, using hex encoded empty spaces, made a script that will random turn all tabs into spaces and tabs while keeping a legit indent. I do sometimes wonder why I don't feel bad for this, I feel evil. Pure evil.",
        "created_utc": 1678813918,
        "upvote_ratio": 1.0
    },
    {
        "title": "Addiction from a Neglected Soul. posted from a throwaway.",
        "author": "-Guilty-Soul-",
        "url": "https://www.reddit.com/r/confession/comments/11rbz2y/addiction_from_a_neglected_soul_posted_from_a/",
        "text": "[removed]",
        "created_utc": 1678813731,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t like my body because I’m fat but I can’t help but keep eating.",
        "author": "Beneficial-Branch311",
        "url": "https://www.reddit.com/r/confession/comments/11rbmoe/i_dont_like_my_body_because_im_fat_but_i_cant/",
        "text": "[removed]",
        "created_utc": 1678812994,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend triggered something that I completely forgot.",
        "author": "DieLeiden",
        "url": "https://www.reddit.com/r/confession/comments/11rb9i6/my_boyfriend_triggered_something_that_i/",
        "text": "[removed]",
        "created_utc": 1678812204,
        "upvote_ratio": 1.0
    },
    {
        "title": "I get panic attacks in bed a few nights a week before I fall asleep",
        "author": "msolu10",
        "url": "https://www.reddit.com/r/confession/comments/11rb4hi/i_get_panic_attacks_in_bed_a_few_nights_a_week/",
        "text": "For the last few months, when I get in bed to fall asleep, I have thoughts I am embarrassed of that cause me to have a few minutes of panic before falling asleep. I’m a 25 year old guy and I live alone, and have never been in a romantic relationship. I have a lot of friends, but we are all male and don’t really do much in terms of speaking about how we feel, or hugging each other. It’s hard for me to admit but I think I may be a bit touch deprived, and usually before I fall asleep sometimes I will think about being held to help relax me. Lately though, sometimes I will think about how I don’t really have anyone in my life who can hold me, and it makes me breathe hard for a few minutes. The fact that this happens to me makes me feel week as a man, and I’m not sure how to explain this or talk about this with anyone.",
        "created_utc": 1678811894,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I selfish if I don't want to share what's important to me...",
        "author": "Charlottewannatalk",
        "url": "https://www.reddit.com/r/confession/comments/11rb06z/am_i_selfish_if_i_dont_want_to_share_whats/",
        "text": "[removed]",
        "created_utc": 1678811621,
        "upvote_ratio": 1.0
    },
    {
        "title": "i confessed my own feelings to my crush but his responds to it doesn't make it clear if he likes me?",
        "author": "Impossible_Check_317",
        "url": "https://www.reddit.com/r/confession/comments/11raref/i_confessed_my_own_feelings_to_my_crush_but_his/",
        "text": "[removed]",
        "created_utc": 1678811088,
        "upvote_ratio": 1.0
    },
    {
        "title": "love How I love this media platform. you get to post your feelings without being judged, uf you end up being judges, they don't know who you are😇",
        "author": "Dazzling-Muscle1831",
        "url": "https://www.reddit.com/r/confession/comments/11rakml/love_how_i_love_this_media_platform_you_get_to/",
        "text": "[removed]",
        "created_utc": 1678810687,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need some advice about how to deal with my mental health",
        "author": "eK_Veen",
        "url": "https://www.reddit.com/r/confession/comments/11raiop/i_need_some_advice_about_how_to_deal_with_my/",
        "text": "[removed]",
        "created_utc": 1678810573,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good jealousy. Dear God, I am insanely jealous (in a good way) of all my friends that are balling hard right now. I feel a tear rolling down my cheek. I want that! I deserve that too!!",
        "author": "Dazzling-Muscle1831",
        "url": "https://www.reddit.com/r/confession/comments/11rafpu/good_jealousy_dear_god_i_am_insanely_jealous_in_a/",
        "text": "[removed]",
        "created_utc": 1678810400,
        "upvote_ratio": 1.0
    },
    {
        "title": "i break every single thing i touch and its annoying",
        "author": "JustKops",
        "url": "https://www.reddit.com/r/confession/comments/11rac60/i_break_every_single_thing_i_touch_and_its/",
        "text": "[removed]",
        "created_utc": 1678810191,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found a casino voucher on the floor worth $1,100 and I kept it.",
        "author": "Fairmount_Throwaway",
        "url": "https://www.reddit.com/r/confession/comments/11r9yee/i_found_a_casino_voucher_on_the_floor_worth_1100/",
        "text": "[removed]",
        "created_utc": 1678809380,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think that homosexuality or being gay is okay or wrong?",
        "author": "3u3hjeh3he",
        "url": "https://www.reddit.com/r/confession/comments/11r9yag/do_you_think_that_homosexuality_or_being_gay_is/",
        "text": "[removed]",
        "created_utc": 1678809373,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my psychologist [38F] being naive or am I [27F] the one who is?",
        "author": "suncoldinwinter",
        "url": "https://www.reddit.com/r/confession/comments/11r9rd8/is_my_psychologist_38f_being_naive_or_am_i_27f/",
        "text": "[removed]",
        "created_utc": 1678808961,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I [27F] experiencing gaslighting by her [38F] or am I just incredibly misinformed?",
        "author": "suncoldinwinter",
        "url": "https://www.reddit.com/r/confession/comments/11r9ps1/am_i_27f_experiencing_gaslighting_by_her_38f_or/",
        "text": "[removed]",
        "created_utc": 1678808857,
        "upvote_ratio": 1.0
    },
    {
        "title": "As a Canadian, 'd give everything to be American. I wish I born in America.",
        "author": "Dragon_GWP2",
        "url": "https://www.reddit.com/r/confession/comments/11r9pbd/as_a_canadian_d_give_everything_to_be_american_i/",
        "text": "[removed]",
        "created_utc": 1678808828,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I [27F] trust the most common views that are expressed online, on Reddit and on this subreddit. Or should I trust the views of the people in my life? [33F] [62F] [56M]",
        "author": "suncoldinwinter",
        "url": "https://www.reddit.com/r/confession/comments/11r9ohn/should_i_27f_trust_the_most_common_views_that_are/",
        "text": "[removed]",
        "created_utc": 1678808778,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (F 14 ) raped my little sister (F 10) *TW (rape, sexual assault, lying, cursing)",
        "author": "plsdontjudgeme08",
        "url": "https://www.reddit.com/r/confession/comments/11r9hdm/i_f_14_raped_my_little_sister_f_10_tw_rape_sexual/",
        "text": "[removed]",
        "created_utc": 1678808352,
        "upvote_ratio": 1.0
    }
]