[
    {
        "title": "I was a homophobic pos who severely bullied the boy I was secretly hooking up with .",
        "author": "Sweaty_Injury_3552",
        "url": "https://www.reddit.com/r/confession/comments/11d4wy8/i_was_a_homophobic_pos_who_severely_bullied_the/",
        "text": "[removed]",
        "created_utc": 1677479715,
        "upvote_ratio": 1.0
    },
    {
        "title": "I didn't tell anyone that I tore a pair of jeans in the dressing room.",
        "author": "SluttyCora09",
        "url": "https://www.reddit.com/r/confession/comments/11d4uas/i_didnt_tell_anyone_that_i_tore_a_pair_of_jeans/",
        "text": "[removed]",
        "created_utc": 1677479449,
        "upvote_ratio": 1.0
    },
    {
        "title": "I killed a man in front of his wife and child after he assaulted my niece.",
        "author": "CodFishStrangler7",
        "url": "https://www.reddit.com/r/confession/comments/11d4tkd/i_killed_a_man_in_front_of_his_wife_and_child/",
        "text": "[removed]",
        "created_utc": 1677479385,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think my husband, a diagnosed \"psychopath,\" is kinder and more caring than anyone else I've ever met.",
        "author": "BrittaniaSky",
        "url": "https://www.reddit.com/r/confession/comments/11d4fby/i_think_my_husband_a_diagnosed_psychopath_is/",
        "text": "[removed]",
        "created_utc": 1677477952,
        "upvote_ratio": 1.0
    },
    {
        "title": "I stole $100 from a coworker’s purse at work to buy drugs",
        "author": "murphyvroomvroomc",
        "url": "https://www.reddit.com/r/confession/comments/11d43ut/i_stole_100_from_a_coworkers_purse_at_work_to_buy/",
        "text": "Title ^^\nShe asked me if I went through her bag. I freaked out and lied and said no. She has no proof technically, she just said she saw me near it. \nAbout 15 minutes after I get home from work, I get this group message from the lead server at work (going to copy &amp; paste since images aren’t allowed): \n\nHi everyone.\nEffective immediately I advise you all to use the lockers near the break area to hold your personal belongings while on your shift instead of leaving them in the server break area. A reminder to all as well that NO ONE should be going through anyone's personal item regardless of where they are placed. If it is NOT yours then you don't need to be around or go into it. If issues continue to persist we will be removing that area for break taking and everyone will have to use the employee break room instead. \n\nFuck I’m so fucked I wish I could put it back it’s not worth it. Should I quit? Fuck and yes I know I’m a shit person and I deserve to have been caught",
        "created_utc": 1677476857,
        "upvote_ratio": 1.0
    },
    {
        "title": "I often visit the USA but only for the Human Zoo Experience",
        "author": "RaisonGardons",
        "url": "https://www.reddit.com/r/confession/comments/11d41zx/i_often_visit_the_usa_but_only_for_the_human_zoo/",
        "text": "Yes, i am fascinated by a lot of americans who destroy their body with trash food. I go to Walmart and follow the obese people around and look at what they buy. I look at their face and think of them as human trash. I go to Waffle House just to observe the low IQ people and so on. I go to fast food restaurant and look at human whales eating. While i observe them i wonder what decisions led to that kind of self destruction. It's really like going to the Zoo and looking at freak creatures. I enjoy it in a weird way. Am i the only one ?",
        "created_utc": 1677476685,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate my parents for my existence and my disease which has ruined everything",
        "author": "New-Discount-5193",
        "url": "https://www.reddit.com/r/confession/comments/11d3yhs/i_hate_my_parents_for_my_existence_and_my_disease/",
        "text": "[removed]",
        "created_utc": 1677476343,
        "upvote_ratio": 1.0
    },
    {
        "title": "I caused my father to be fired from his job of 15 years.",
        "author": "Far_Replacement4092",
        "url": "https://www.reddit.com/r/confession/comments/11d3v5m/i_caused_my_father_to_be_fired_from_his_job_of_15/",
        "text": "This was about 4 years ago, but not a day goes by where I don't feel guilty about it. My father has since found a new stable job, but, it sucked for a while there. \n\nMy father used to work at this local church, on Sundays he would lead the band, playing piano and singing, and every other day he would work the office. He did that for a long time, it was one of the two, three ish jobs he worked.\n\nI came out as a lesbian four years ago, and as soon as word got around, my father was released from his position. Now, they said in the paperwork that his reason for being let go was \"improper behavior\", however when he asked for clarification, they couldn't provide anything. We knew it could've been a possibility, as a year before that an elderly lesbian couple who has worshiped there their whole lives were turned away for marrying there, they never did go to service again. But it cut ties with a lot of my friends, my fathers colleagues, and it lost him his job. \n\nI knew it would cost my family a very important flow of income and I still went and told people. I feel like if I just didn't say anything, then it all would've been fine. We're a family of five, and at the time my father worked three, then two, jobs, and my mother worked three jobs and was a student. We had debt and bills and mortgage to pay and I still went and put it on the line for what. So my family didn't have to worry about me crushing on my brother's friends?\n\nI know it's not the most juicy confession ever, but, I see us struggle at times and I just know that it's my fault. And it sucks and it hurts and even still years later, I feel horrible.",
        "created_utc": 1677476009,
        "upvote_ratio": 1.0
    },
    {
        "title": "Turning 24 soon and I am a fuck up. I just want peace",
        "author": "avocadogrape199",
        "url": "https://www.reddit.com/r/confession/comments/11d3kyx/turning_24_soon_and_i_am_a_fuck_up_i_just_want/",
        "text": "[removed]",
        "created_utc": 1677475058,
        "upvote_ratio": 0.99
    },
    {
        "title": "What should I do? (I just came out and need to know if I should give up on this GIRLLLLLLL!)",
        "author": "valentinebl",
        "url": "https://www.reddit.com/r/confession/comments/11d3k7c/what_should_i_do_i_just_came_out_and_need_to_know/",
        "text": "[removed]",
        "created_utc": 1677474988,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (M29) still get small levels of schadenfreude when certain people I went to high school with have shitty lives..",
        "author": "Material-Stick3500",
        "url": "https://www.reddit.com/r/confession/comments/11d3cdc/i_m29_still_get_small_levels_of_schadenfreude/",
        "text": "[removed]",
        "created_utc": 1677474271,
        "upvote_ratio": 1.0
    },
    {
        "title": "During high school, I had a pistol in my backpack during an exam.",
        "author": "throwaway18156992",
        "url": "https://www.reddit.com/r/confession/comments/11d3bon/during_high_school_i_had_a_pistol_in_my_backpack/",
        "text": "[removed]",
        "created_utc": 1677474210,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (16m) unintentionally brought a gun to my school.",
        "author": "throwaway18156992",
        "url": "https://www.reddit.com/r/confession/comments/11d36n1/i_16m_unintentionally_brought_a_gun_to_my_school/",
        "text": "[removed]",
        "created_utc": 1677473796,
        "upvote_ratio": 1.0
    },
    {
        "title": "I refuse to be roommates with a fat person. (Respectfully)",
        "author": "Ok-Librarian90",
        "url": "https://www.reddit.com/r/confession/comments/11d34u2/i_refuse_to_be_roommates_with_a_fat_person/",
        "text": "[removed]",
        "created_utc": 1677473621,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im a young boy and i have already given up on life.",
        "author": "User1837294",
        "url": "https://www.reddit.com/r/confession/comments/11d2gfb/im_a_young_boy_and_i_have_already_given_up_on_life/",
        "text": "   I'm a boy under 18 and I don't see the point in living. I have no plan for the future, I'm bad at school and I don't have the skills to be successful. So why would stick around for some awful life, of depression and worry, when I could end it all right now. I feel like the point of life isn't to work, mabye have kids and die.\n   I think when I turn 18 if things aren't better I'm going to end it. I don't want to have to live seeing everyone I know have great lives and be successful while I'm homeless. \n   I have people that care about me which is the worst part, how can end it all knowing people I know will be sad about it. I just wish there was a way where I could have never existed. Like I said I have nothing going for me I'm bad at school I'm not smart in general, in fact I'm actually pretty stupid when it comes to common sense and I upset almost everyone I know, I'm lazy, I'm slightly over weight and I just don't really want to live the life I know I will have. \n   I have a girlfriend who I have told none of this to, shes helped me a lot and I'm grateful but I think I'm beyond repair. If anyone actually See's this let me know if there's any reason I should see my life through. So is there just something wrong with me?",
        "created_utc": 1677471463,
        "upvote_ratio": 1.0
    },
    {
        "title": "I almost killed my sister's rapist after he had the nerve to act sad.",
        "author": "Jim_Bob_from_nowhere",
        "url": "https://www.reddit.com/r/confession/comments/11d2ek0/i_almost_killed_my_sisters_rapist_after_he_had/",
        "text": "[removed]",
        "created_utc": 1677471307,
        "upvote_ratio": 1.0
    },
    {
        "title": "Prostitute Doctor in Colombo and Inuvil Jaffna Sri Lanka",
        "author": "sex_malini",
        "url": "https://www.reddit.com/r/confession/comments/11d19p8/prostitute_doctor_in_colombo_and_inuvil_jaffna/",
        "text": "[removed]",
        "created_utc": 1677467878,
        "upvote_ratio": 1.0
    },
    {
        "title": "i’m so excited to turn 18 and cut contact/move away from my family",
        "author": "005grace",
        "url": "https://www.reddit.com/r/confession/comments/11d17x2/im_so_excited_to_turn_18_and_cut_contactmove_away/",
        "text": "[removed]",
        "created_utc": 1677467732,
        "upvote_ratio": 1.0
    },
    {
        "title": "17m, fighting my abusive father then fighting cancer and losing both",
        "author": "BeautifulPresence464",
        "url": "https://www.reddit.com/r/confession/comments/11d1623/17m_fighting_my_abusive_father_then_fighting/",
        "text": "[removed]",
        "created_utc": 1677467576,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im beginning to think I have a masturbation addiction",
        "author": "92egsedan",
        "url": "https://www.reddit.com/r/confession/comments/11d13gv/im_beginning_to_think_i_have_a_masturbation/",
        "text": "[removed]",
        "created_utc": 1677467364,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m running out of the country and would do anything to make it happen",
        "author": "ripleyrainyday",
        "url": "https://www.reddit.com/r/confession/comments/11d10sq/im_running_out_of_the_country_and_would_do/",
        "text": "I don’t like giving someone an internal suffer, and this someone is my mother. though she always treated me as a dumb kid, degraded me, and demanded a call or a text whenever i’m out somewhere. I’ve no confidence now, plus a stutter issue because of her ways of parenting. I got molested when i was 9-10 in front of her while she did nothing. though i don’t hate her, i rather benefited from her with many things. I’ve neutral feelings, i don’t hate anyone. \n\nmy father is dead and ever since his side of the family been blatant with their hate towards my mother, they’ve always hated her, hence why they’re nagging her now with how much of a failure her children are becoming and that she doesn’t know how to properly take care of us on her own. this has a huge weight on her because she cares too much about what people might think of her. and she have told me many times about her wishes to die, everytime someone from inside the family calls her and tell her what they’ve been saying about her, she just scream at me “oh why don’t you just stab me” \n\nI’m 22 and recently dropped out of college, i’ve to do my military service since its mandatory but i don’t want to, i’ve no well to be sent to a war. I rather leave, i’ve learned english and in the process to learn german. but once again there’s my mother, who would be in a great grieve with me leaving and with the shit talk that would come flooding from my father’s side of the family. therefore i’m doing god’s work, i’m giving her her wish\n\nshe’s an old sick woman, takes a lot of medicine, she might forget some or she might take a lot in one day, it happens. she’s prescribed with two pill a day of Concor. but i add one more mid day deluted with her bitter tea. it will take time but it will happen. I would then be able to leave with no guilt or worries. knowing that I’ve left no internal suffer. I might find opportunities and find my happiness. I know how it sounds, but i deserve to be happy. I won’t live treated like a dumb person like i don’t know how to take care of myself like i’m a failure and no good to anyone. i deserve to be happy ans loved. i deserve to have the life i choose",
        "created_utc": 1677467130,
        "upvote_ratio": 1.0
    },
    {
        "title": "I did “things” when I was younger, if you know exactly what I mean.",
        "author": "Meee22here",
        "url": "https://www.reddit.com/r/confession/comments/11d0zbq/i_did_things_when_i_was_younger_if_you_know/",
        "text": "For a bit of background, I was a teen at the time and loved a pretty normal life. Starting to get to the peak of puberty as a boy, naturally you can get pretty horny.\nWhen I was a teen, I started “experimenting”, if you know what I mean. While most men start from the front, I went for my as*. It started with small things like q-tips, and progressed to me eventually being able to fit my entire hand in there. I then started playing around with lubricant like lotions, and somehow I went deeper. My parents figured out what I was doing eventually, and they tried to stop me, but at that point I couldn’t. I began a stage of depression where that was my go-to stress reliever,  and would lock myself in my room for hours at a time. I have tried to stop, but I can’t now. Reddit, I need your advice. What should I do?",
        "created_utc": 1677467002,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I have BPD and it’s caused me to destroy relationships",
        "author": "Pppppandah36",
        "url": "https://www.reddit.com/r/confession/comments/11d0r2x/i_think_i_have_bpd_and_its_caused_me_to_destroy/",
        "text": "[removed]",
        "created_utc": 1677466310,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate my brother and I’m done feeling guilty about it.",
        "author": "New-Panda8528",
        "url": "https://www.reddit.com/r/confession/comments/11d05te/i_hate_my_brother_and_im_done_feeling_guilty/",
        "text": "[removed]",
        "created_utc": 1677464552,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (25F) keep fantasizing about my married neighbour (40+) while I’m in a long term relationship ?",
        "author": "ThrowRA235487",
        "url": "https://www.reddit.com/r/confession/comments/11d05cv/i_25f_keep_fantasizing_about_my_married_neighbour/",
        "text": "[removed]",
        "created_utc": 1677464514,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am still in love with my childhood best friend. But I'm married and have children.",
        "author": "Spiritual_Plum_9318",
        "url": "https://www.reddit.com/r/confession/comments/11cz5cm/i_am_still_in_love_with_my_childhood_best_friend/",
        "text": "[removed]",
        "created_utc": 1677461641,
        "upvote_ratio": 1.0
    },
    {
        "title": "I love hairless armpits aaaaaaaaaaassasaaaaaaaaaaaa",
        "author": "ilovearmpits927",
        "url": "https://www.reddit.com/r/confession/comments/11cyru5/i_love_hairless_armpits/",
        "text": "[removed]",
        "created_utc": 1677460573,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've wanted to kill somebody since I was a kid I wanna feel the rush",
        "author": "Lonely-Disk2298",
        "url": "https://www.reddit.com/r/confession/comments/11cyl26/ive_wanted_to_kill_somebody_since_i_was_a_kid_i/",
        "text": "[removed]",
        "created_utc": 1677460037,
        "upvote_ratio": 1.0
    },
    {
        "title": "I almost electrocuted my little brother..on purpose.",
        "author": "Fabulous-Country8777",
        "url": "https://www.reddit.com/r/confession/comments/11cyem1/i_almost_electrocuted_my_little_brotheron_purpose/",
        "text": "[removed]",
        "created_utc": 1677459571,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Emailed the Medical Schools a Damning video of my Friend",
        "author": "NoTimeForCucks",
        "url": "https://www.reddit.com/r/confession/comments/11cya7k/i_emailed_the_medical_schools_a_damning_video_of/",
        "text": "My best friend has been very good to me over the years. He has always done favors for me, helped me move, tried to help me pick up girls at the bars and clubs (never worked), taught me how to work out, and helped me with my school so I wouldn't drop out.\n\nHowever, I had to do this, I had to get back at him for something unforgivable he did.\n\nHe flexxed his hot girlfriend\n\nI'm in my 20s and I never kissed a girl before. I go to the club but they won't talk to me, it drove me crazy. And to see this beautiful girl making out with my friend made me cry inside. Why couldn't that be me? It was obvious. I'm obese and homely and he's tall and fit and has a good face. It made me very upset and I took my anger out on him. I hated the fact that he didn't care about my feelings and would kiss her when I was around even though it was obvious it made me jealous and upset.\n\nI went behind his back and emailed all the medical schools a damning clip I had when he was drunk. They all rejected him. He is crushed, devastated, but he will have something I never do, a beautiful girlfriend. I don't even have that.",
        "created_utc": 1677459214,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Emailed Medical Schools a Damning Video of my Best Friend",
        "author": "NoTimeForCucks",
        "url": "https://www.reddit.com/r/confession/comments/11cy9sf/i_emailed_medical_schools_a_damning_video_of_my/",
        "text": "My best friend has been very good to me over the years. He has always done favors for me, helped me move, tried to help me pick up girls at the bars and clubs (never worked), taught me how to work out, and helped me with my school so I wouldn't drop out.\n\nHowever, I had to do this, I had to get back at him for something unforgivable he did.\n\nHe flexxed his hot girlfriend\n\nI'm in my 20s and I never kissed a girl before. I go to the club but they won't talk to me, it drove me crazy. And to see this beautiful girl making out with my friend made me cry inside. Why couldn't that be me? It was obvious. I'm obese and homely and he's tall and fit and has a good face. It made me very upset and I took my anger out on him. I hated the fact that he didn't care about my feelings and would kiss her when I was around even though it was obvious it made me jealous and upset.\n\nI went behind his back and emailed all the medical schools clip I had when he was drunk. They all rejected him. He is crushed, devastated, but he will have something I never do, a beautiful girlfriend. I don't even have that.",
        "created_utc": 1677459182,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Emailed my all the Medical Schools a Racist Clip of my Best Friend so He Wouldn't Get In",
        "author": "NoTimeForCucks",
        "url": "https://www.reddit.com/r/confession/comments/11cy91h/i_emailed_my_all_the_medical_schools_a_racist/",
        "text": "[removed]",
        "created_utc": 1677459123,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got revenge on my Ex after she cheated on me and we divorced",
        "author": "CountryNo2803",
        "url": "https://www.reddit.com/r/confession/comments/11cy2w8/got_revenge_on_my_ex_after_she_cheated_on_me_and/",
        "text": "[removed]",
        "created_utc": 1677458644,
        "upvote_ratio": 1.0
    },
    {
        "title": "Old book suggestions about society or spiritual enlightenment.",
        "author": "mrsdoodad",
        "url": "https://www.reddit.com/r/confession/comments/11cy1xd/old_book_suggestions_about_society_or_spiritual/",
        "text": "I am getting back into reading and realized some of the books i was supposed to read for my college courses were actually good. Looking for suggestions on more books.",
        "created_utc": 1677458570,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need advice on what I should do Im lost and confused and want to run away",
        "author": "whynotmetf",
        "url": "https://www.reddit.com/r/confession/comments/11cxyqv/i_need_advice_on_what_i_should_do_im_lost_and/",
        "text": "[removed]",
        "created_utc": 1677458326,
        "upvote_ratio": 1.0
    },
    {
        "title": "TEMU NOT TO GOOD TO B TRUE...ITS REALLY REALLY GREAT",
        "author": "leeleetiff",
        "url": "https://www.reddit.com/r/confession/comments/11cxo0f/temu_not_to_good_to_b_trueits_really_really_great/",
        "text": "[removed]",
        "created_utc": 1677457502,
        "upvote_ratio": 1.0
    },
    {
        "title": "TEMU is awesome at prices and they tell you what you are getting ❤️",
        "author": "leeleetiff",
        "url": "https://www.reddit.com/r/confession/comments/11cxl4k/temu_is_awesome_at_prices_and_they_tell_you_what/",
        "text": "https://www.temu.com/m/fL3KcXkGXo40Z",
        "created_utc": 1677457282,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I [27F] trust the most common views that are expressed online, on Reddit and on this subreddit. Or should I trust the views of the people in my life? [33F] [62F] [56M]",
        "author": "nervousinthere",
        "url": "https://www.reddit.com/r/confession/comments/11cx1oy/should_i_27f_trust_the_most_common_views_that_are/",
        "text": "[removed]",
        "created_utc": 1677455921,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I [27F] experiencing gaslighting by her [38F] or am I just incredibly misinformed?",
        "author": "nervousinthere",
        "url": "https://www.reddit.com/r/confession/comments/11cx15n/am_i_27f_experiencing_gaslighting_by_her_38f_or/",
        "text": "[removed]",
        "created_utc": 1677455881,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have stolen over 800 dollars in merchandise from Sephora",
        "author": "Additional-Leek-6203",
        "url": "https://www.reddit.com/r/confession/comments/11cwvxe/i_have_stolen_over_800_dollars_in_merchandise/",
        "text": "I haven’t said a word to anyone about this but i cant stop thinking about it. A year ago I started stealing from stores, it would just be a lip gloss or 1 or 2 things at a time. But in the past 3 months its gotten really bad and in just that time I have racked up about 840 dollars worth  of stuff just from Sephora alone but I would say I have another 200 dollars worth of stuff from ulta and target. The thing is it is the same sephora I go to EVERY TIME. I don’t understand how I haven’t been caught. every time I shoplift I always feel a little guilty but I always get over it super quick because the rush and feeling of success whenever I get away with it overpowers that feeling. I just made my biggest haul from Sephora recently with about 300 dollars worth of makeup.I just walked out of there and nothing happened. I am scared they are building a case on me. After this last time I have decided I will stop since im going to be 18 soon. If they do have evidence of my theft can they still prosecute me if I go into that Sephora again? Or if I go to any other Sephora location?",
        "created_utc": 1677455501,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am male and was 28 at the time this started. I had a sex addiction. Had sex with an 18 year old who was disabled had MS fell in love changed my life around with said Girl. Who randomly left one day after 18 months Never to speak to me again. Should I feel regret/shame?",
        "author": "BodybuilderChris2023",
        "url": "https://www.reddit.com/r/confession/comments/11cwjxj/i_am_male_and_was_28_at_the_time_this_started_i/",
        "text": "[removed]",
        "created_utc": 1677454691,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am male and was 28 at the time this started. I had a sex addiction. Had sex with an 18 year old who was disabled had MS fell in love changed my life around with said Girl. Who randomly left one day after 18 months Never to speak to me again. Should I feel regret/shame? am I an asshole?",
        "author": "BodybuilderChris2023",
        "url": "https://www.reddit.com/r/confession/comments/11cwehn/i_am_male_and_was_28_at_the_time_this_started_i/",
        "text": "[removed]",
        "created_utc": 1677454339,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I the only one? 30F and have never had my firsts.",
        "author": "its_nicho",
        "url": "https://www.reddit.com/r/confession/comments/11cwcpu/am_i_the_only_one_30f_and_have_never_had_my_firsts/",
        "text": "[removed]",
        "created_utc": 1677454227,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am male and was 28 at the time this started. I had a sex addiction. Had sex with an 18 year old who was disabled had MS fell in love changed my life around with said Girl. Who randomly left one day after 18 months Never to speak to me again. Should I feel regret/shame?",
        "author": "BodybuilderChris2023",
        "url": "https://www.reddit.com/r/confession/comments/11cwbqv/i_am_male_and_was_28_at_the_time_this_started_i/",
        "text": "[removed]",
        "created_utc": 1677454168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accidently slept with my bff's brother on accident",
        "author": "Ambitious_Touch3023",
        "url": "https://www.reddit.com/r/confession/comments/11cwbdi/accidently_slept_with_my_bffs_brother_on_accident/",
        "text": "[removed]",
        "created_utc": 1677454144,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am embarrassed of my older sister she burdens my rep.",
        "author": "National-Analysis-52",
        "url": "https://www.reddit.com/r/confession/comments/11cw778/i_am_embarrassed_of_my_older_sister_she_burdens/",
        "text": "[removed]",
        "created_utc": 1677453856,
        "upvote_ratio": 1.0
    },
    {
        "title": "I accidentally killed my lady-friend with this big-ass cock of mine and I don't know what to do",
        "author": "Ok-Performance3362",
        "url": "https://www.reddit.com/r/confession/comments/11cw116/i_accidentally_killed_my_ladyfriend_with_this/",
        "text": "[removed]",
        "created_utc": 1677453447,
        "upvote_ratio": 1.0
    },
    {
        "title": "I accidentally killed my lady-friend with this big-ass cock of mine and I don't know what to do",
        "author": "Ok-Performance3362",
        "url": "https://www.reddit.com/r/confession/comments/11cvvu4/i_accidentally_killed_my_ladyfriend_with_this/",
        "text": "[removed]",
        "created_utc": 1677453093,
        "upvote_ratio": 1.0
    },
    {
        "title": "No one knows i suck on my thumb and i cant stop…..",
        "author": "sweetestpuppy",
        "url": "https://www.reddit.com/r/confession/comments/11cvvrf/no_one_knows_i_suck_on_my_thumb_and_i_cant_stop/",
        "text": "[removed]",
        "created_utc": 1677453087,
        "upvote_ratio": 1.0
    },
    {
        "title": "I accidentally hit my dog in the face with a chew toy, and now he’s terrified of that toy and doesn’t like to play anymore",
        "author": "DatBoi_BP",
        "url": "https://www.reddit.com/r/confession/comments/11cvrfn/i_accidentally_hit_my_dog_in_the_face_with_a_chew/",
        "text": "[removed]",
        "created_utc": 1677452786,
        "upvote_ratio": 1.0
    },
    {
        "title": "This happened when I was 6 or 7 I don’t remember why and how I did it though.",
        "author": "ComplaintNo8646",
        "url": "https://www.reddit.com/r/confession/comments/11cvlz4/this_happened_when_i_was_6_or_7_i_dont_remember/",
        "text": "I use to collect hot wheels and had many of the tracks. I specifically remember having an orange one with blue sides of the tracks and it had a motor in the middle to speed the cars up and to a 6 year old it was like magic. Anyway i remember taking pee pee down the track to see if it would go down the ramp and complete the loop, it turns out my 6 year old brain didn’t think through the entire process of this happening as my bodily fluids went down the ramp and into the motor. The motor kept running and as they where to little wheels they where slashing my juice everywhere in my room. My first thought was to run to the bathroom and soak all of the wizzle up with toilet paper so I ran to the opposite room, picked up as much rolls as I could and was headed right back to my room. I wiped and wiped for what seemed like hours to the point where all the waz had soaked into my bed, onto my walls and surprisingly on the ceiling to be honest I was kind of impressed. After I dried my room up (to the best of my ability) it absolutely rank of butterkiss popcorn and off fudge cake. So my next little mission was to grab some sort of nice smelling products to clear what only god can describe as an absolute sespit. I immediately went to my mothers room and picked up the fist perfume I could find and sprayed the absolute wham out of it in my room. I didn’t realise at the time but what I picked up was a bottle of channel which I found out to be a gift from my grandma from Philadelphia (We lived down under at the time) so we hadn’t seen her in a while. I return what was a pretty full bottle back to her room which was now pretty much empty. I thought nothing of it at the time until about 4 hours later when my mum went in her room to discover the empty bottle of perfume. It took her about 5 seconds to project her voice around the whole house which later turned into an interrogation scene between my two sisters and my brother. She slacked on me and my brother being the “suspects” as he was the eldest and I was the youngest so she ripped on the other two. Turns out I’d get off Scott free and my sisters got the blame as the pair “wouldn’t own up” I go back upstairs to my now florescent smelling room and felt like a free man. I later broke my track up and boxed it away for eternity. Which is now in my parents attic as far as I know.",
        "created_utc": 1677452428,
        "upvote_ratio": 1.0
    },
    {
        "title": "As a casino employee, gamblers absolutely disgust me",
        "author": "ativanbaby",
        "url": "https://www.reddit.com/r/confession/comments/11cvl7u/as_a_casino_employee_gamblers_absolutely_disgust/",
        "text": "[removed]",
        "created_utc": 1677452380,
        "upvote_ratio": 1.0
    },
    {
        "title": "People think I am jacked but it is not true at all",
        "author": "Saltyliz4rd",
        "url": "https://www.reddit.com/r/confession/comments/11cvk2c/people_think_i_am_jacked_but_it_is_not_true_at_all/",
        "text": "I'm a guy and when people see me in a shirt they usually think that I go to the gym very often and that I have defined pectoral muscles. \nThe truth is that I actually have just the right amount of gynecomastia, so that it has a great aesthetic effect but you couldn't tell I have it.\nEven the two girls I've been with so far admitted to me that this is what attracted them to me the most",
        "created_utc": 1677452303,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hooked up with a guy who has been dating a girl for 6 months.",
        "author": "lifeofsarahh",
        "url": "https://www.reddit.com/r/confession/comments/11cuwvs/i_hooked_up_with_a_guy_who_has_been_dating_a_girl/",
        "text": "[removed]",
        "created_utc": 1677450753,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (F21) had a fling with my married coworker (M37)",
        "author": "ThrowRAyellowsky10",
        "url": "https://www.reddit.com/r/confession/comments/11cutxh/i_f21_had_a_fling_with_my_married_coworker_m37/",
        "text": "[removed]",
        "created_utc": 1677450570,
        "upvote_ratio": 1.0
    },
    {
        "title": "When I was 6 or 7…………………………………………………………………………………………",
        "author": "ComplaintNo8646",
        "url": "https://www.reddit.com/r/confession/comments/11cul1l/when_i_was_6_or_7/",
        "text": "\nI use to collect hot wheels and had many of the tracks. I specifically remember having an orange one with blue sides of the tracks and it had a motor in the middle to speed the cars up and to a 6 year old it was like magic. Anyway i remember taking pee pee down the track to see if it would go down the ramp and complete the loop, it turns out my 6 year old brain didn’t think through the entire process of this happening as my bodily fluids went down the ramp and into the motor. The motor kept running and as they where to little wheels they where slashing my juice everywhere in my room. My first thought was to run to the bathroom and soak all of the wizzle up with toilet paper so I ran to the opposite room, picked up as much rolls as I could and was headed right back to my room. I wiped and wiped for what seemed like hours to the point where all the waz had soaked into my bed, onto my walls and surprisingly on the ceiling to be honest I was kind of impressed. After I dried my room up (to the best of my ability) it absolutely rank of butterkiss popcorn and off fudge cake. So my next little mission was to grab some sort of nice smelling products to clear what only god can describe as an absolute sespit. I immediately went to my mothers room and picked up the fist perfume I could find and sprayed the absolute wham out of it in my room. I didn’t realise at the time but what I picked up was a bottle of channel which I found out to be a gift from my grandma from Philadelphia (We lived down under at the time) so we hadn’t seen her in a while. I return what was a pretty full bottle back to her room which was now pretty much empty. I thought nothing of it at the time until about 4 hours later when my mum went in her room to discover the empty bottle of perfume. It took her about 5 seconds to project her voice around the whole house which later turned into an interrogation scene between my two sisters and my brother. She slacked on me and my brother being the “suspects” as he was the eldest and I was the youngest so she ripped on the other two. Turns out I’d get off Scott free and my sisters got the blame as the pair “wouldn’t own up” I go back upstairs to my now florescent smelling room and felt like a free man. I later broke my track up and boxed it away for eternity. Which is now in my parents attic as far as I know.",
        "created_utc": 1677449990,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quiero abrir un only fans pero no estoy segura. ¿Que opinan?",
        "author": "rooyerutti",
        "url": "https://www.reddit.com/r/confession/comments/11cu8dy/quiero_abrir_un_only_fans_pero_no_estoy_segura/",
        "text": "[removed]",
        "created_utc": 1677449153,
        "upvote_ratio": 1.0
    },
    {
        "title": "Social interaction for me (35m) is too much these days.",
        "author": "itstoobrightout",
        "url": "https://www.reddit.com/r/confession/comments/11cu77t/social_interaction_for_me_35m_is_too_much_these/",
        "text": "I don't know when the branch snapped on this one, but I've lost all desire, energy, or interest in being sociable. This past week was a work milestone for me and the boss had a small 'congrats' gathering with staff from the main office and my team. The entire time I was miserable and wished they'd go back to their work at their own office.\n\nWe do engagement feedback every 2 years and get asked if we have a work best friend. I've done this 5 times now and every time is a no. Our director once told me to set up a presentation as if I was explaining it to friends at a backyard get-together. The joke is on him, I don't have non-work friends to get together with, and I haven't since high school.\n\nI am married, and Im a decent husband though I do have my faults. We have kids and I'm a damned good father, I just can't seem to muster the energy to care about people who aren't family. I do align to be more realistic, or occasionally pessimistic, but I'm far from being a miserable asshole.\n\nAre any other 30-something dudes in the same boat? Is this normal?",
        "created_utc": 1677449076,
        "upvote_ratio": 1.0
    },
    {
        "title": "I tricked a B-list celeb into becoming cool friends with me.",
        "author": "Whereforeartthoufam",
        "url": "https://www.reddit.com/r/confession/comments/11cu3ve/i_tricked_a_blist_celeb_into_becoming_cool/",
        "text": "I suppose it's not the worst thing but it is disingenuous.  I was infatuated with the lead singer of a group back in the early 90s. I used to fall asleep to his CD. My bedroom walls were covered with posters of him.  I always kept up with him even after the group disbanded.  He kept performing as a solo artist and I tried so hard to see him perform live but life never allowed me to make it.\n\nShortly after Myspace was replaced by FB, I seen on his music page that he was performing in NYC when I just so happened to be there.  I was desperate to see him live, so I jumped in his FB inbox with a story I pulled out of my ass. I started it with hey I'm going to be in town, we shld meetup again. Completely expecting to be ignored, or a response by some random admin, I was floored when he responded.  \n\nWe went back and forth, I made up a stupid story about what we did after a concert.  He believed it all, laughing his ass off at what 'we' did. Him 'yea that sounds like me.'  He felt bad for not remembering me and we exchanged numbers. Wanted to make it up to me. His prior concert dates got messed up, so the performance never even happened.   But we have kept in touch ever since.  \n\nThroughout the years our convos have evolved from flirty, sexting to deep convos about life to actually just really cool friends. He's married now, just had another kid but we mostly just comment on each others social media. I do feel guilt sometimes and my three friends I told still can't believe it. But he turned out to be a really decent dude.",
        "created_utc": 1677448862,
        "upvote_ratio": 1.0
    },
    {
        "title": "When I was 6 or 7…………………………………………………………………………………………",
        "author": "ComplaintNo8646",
        "url": "https://www.reddit.com/r/confession/comments/11cstyw/when_i_was_6_or_7/",
        "text": "I use to collect hot wheels and have many of the tracks. I specifically remember having an orange one with blue sides of the tracks and it had a motor in the middle to speed the cars up and to a 6 year old it was like magic. Anyway i remember taking pee pee down the track to see if it would go down the ramp and complete the loop, it turns out my 6 year old brain didn’t think through the entire process of this happening as my bodily fluids went down the ramp and into the motor. The motor kept running and as they where to little wheels they where slashing my juice everywhere in my room. My first thought was to run to the bathroom and soak all of the wizzle up with toilet paper so I ran to the opposite room, picked up as much rolls as I could and was headed right back to my room. I wiped and wiped for what seemed like hours to the point where all the waz had soaked into my bed, onto my walls and surprisingly on the ceiling to be honest I was kind of impressed. After I dried my room up (to the best of my ability) it absolutely rank of butterkiss popcorn and off fudge cake. So my next little mission was to grab some sort of nice smelling products to clear what only god can describe as an absolute sespit. I immediately went to my mothers room and picked up the fist perfume I could find and sprayed the absolute wham out of it in my room. I didn’t realise at the time but what I picked up was a bottle of channel which I found out to be a gift from my grandma from Philadelphia (We lived down under at the time) so we hadn’t seen her in a while. I return what was a pretty full bottle back to her room which was now pretty much empty. I thought nothing of it at the time until about 4 hours later when my mum went in her room to discover the empty bottle of perfume. It took her about 5 seconds to project her voice around the whole house which later turned into an interrogation scene between my two sisters and my brother. She slacked on me and my brother being the “suspects” as he was the eldest and I was the youngest so she ripped on the other two. Turns out I’d get off Scott free and my sisters got the blame as the pair “wouldn’t own up” I go back upstairs to my now florescent smelling room and felt like a free man. I later broke my track up and boxed it away for eternity. Which is now in my parents attic as far as I know.",
        "created_utc": 1677445880,
        "upvote_ratio": 1.0
    },
    {
        "title": "I know me and my girlfriend aren't going to last but, is that bad to think?",
        "author": "milkisgoodbutgross",
        "url": "https://www.reddit.com/r/confession/comments/11csr0a/i_know_me_and_my_girlfriend_arent_going_to_last/",
        "text": "[removed]",
        "created_utc": 1677445692,
        "upvote_ratio": 1.0
    },
    {
        "title": "I remember the day I made the biggest mistake of my life but i can't say that i regret it.",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677445675,
        "upvote_ratio": 1.0
    },
    {
        "title": "I remember the day I made the biggest mistake of my life but i can't say that i regret it.",
        "author": "xnm073",
        "url": "https://www.reddit.com/r/confession/comments/11cspi2/i_remember_the_day_i_made_the_biggest_mistake_of/",
        "text": "[removed]",
        "created_utc": 1677445596,
        "upvote_ratio": 1.0
    },
    {
        "title": "these are incidents from my sister kink which happened in my childhood",
        "author": "DifficultyWorking509",
        "url": "https://www.reddit.com/r/confession/comments/11csois/these_are_incidents_from_my_sister_kink_which/",
        "text": "[removed]",
        "created_utc": 1677445535,
        "upvote_ratio": 1.0
    },
    {
        "title": "I remember the day I made the biggest mistake of my life but i can't say that i regret it.",
        "author": "xnm073",
        "url": "https://www.reddit.com/r/confession/comments/11csoih/i_remember_the_day_i_made_the_biggest_mistake_of/",
        "text": "[removed]",
        "created_utc": 1677445535,
        "upvote_ratio": 1.0
    },
    {
        "title": "These are some of the incidents , which i have created [not for any good]",
        "author": "DifficultyWorking509",
        "url": "https://www.reddit.com/r/confession/comments/11cslc9/these_are_some_of_the_incidents_which_i_have/",
        "text": "[removed]",
        "created_utc": 1677445337,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm the dumbest person in the world. I say this broke, alone, without friends (trustworthy ones) for thousands of miles, after allowing myself to be used by freeloaders and robbed by thieves. wtf is wrong with me?",
        "author": "Particular-Most4472",
        "url": "https://www.reddit.com/r/confession/comments/11csid4/im_the_dumbest_person_in_the_world_i_say_this/",
        "text": "[removed]",
        "created_utc": 1677445163,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where did my feelings go after confessing my love to my best friend?",
        "author": "frognipples318",
        "url": "https://www.reddit.com/r/confession/comments/11csck1/where_did_my_feelings_go_after_confessing_my_love/",
        "text": "[removed]",
        "created_utc": 1677444776,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thanks to her I don't trust any of my friends anymore",
        "author": "snekbitch666",
        "url": "https://www.reddit.com/r/confession/comments/11csa8d/thanks_to_her_i_dont_trust_any_of_my_friends/",
        "text": "My mom is overly protective and even though I'm an adult now she's used my friends to keep tabs on me. She'll tell them I'm unstable and that she's worried about my mental health, thinks I'm schizophrenia and asks them to tell her about everything that happens when they hang out with me. I only just found out about this shit. Apparently they exchanged numbers behind my back and every time we chill at a bar, hang out on the weekends or do anything they tell her every detail including that I often vented to them about her. This got me in a whole pile if shit. Now I don't trust any of my friends. I'm even worried she'll turn my partner against me.",
        "created_utc": 1677444630,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the mist embarissing thing you have ever done",
        "author": "Sausageass717171727",
        "url": "https://www.reddit.com/r/confession/comments/11cs7xi/what_is_the_mist_embarissing_thing_you_have_ever/",
        "text": "[removed]",
        "created_utc": 1677444488,
        "upvote_ratio": 1.0
    },
    {
        "title": "hello i know that this is extremely random but im looning for someone that has been convicted of arsome i would love to ask you some questions!",
        "author": "meamHanna",
        "url": "https://www.reddit.com/r/confession/comments/11crtwc/hello_i_know_that_this_is_extremely_random_but_im/",
        "text": "[removed]",
        "created_utc": 1677443601,
        "upvote_ratio": 1.0
    },
    {
        "title": "My relationship feels like it’s reaching the end, but we will not allow it.",
        "author": "OkPanic922",
        "url": "https://www.reddit.com/r/confession/comments/11crrgu/my_relationship_feels_like_its_reaching_the_end/",
        "text": "[removed]",
        "created_utc": 1677443451,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m a teacher whose friendly banter/joke went very wrong.",
        "author": "dumbteach",
        "url": "https://www.reddit.com/r/confession/comments/11crjgd/im_a_teacher_whose_friendly_banterjoke_went_very/",
        "text": "In my class on Friday before getting class started I was talking with my kids like I usually do and one student said hey you look like miss. Dumbteach today with your braids in your hair about a girl. We didn’t really look alike and one of my other kids replied sarcastically “oh yeah you two look like twins today”. This continued on with a couple other kids going on to say that we looked just alike, before a student I’ll call John says “oh yeah miss. Dumbteach we look like twins today.” So on and so forth about how much we defiantly look alike until John said “I even put my bronzer on today.”\nI replied without a beat “ oh wow I hadn’t realized I’d gotten that tan waking my dog everyday.”\nBronzer is a makeup product that gives you a tan-ish look. \nThis doesn’t seem horrible until I tell you that the student is a person of color and instantly those who hadn’t been listening to our conversation got big eyed. I froze I know how racist it sounded and I am adamant in my class about not perpetuating racism and making sure everyone is welcomed, but here I was making an insensitive comment. I feel awful and I instantly apologized and pulled the student after class to apologize again and say how sorry I am about the way it came off. I know how awful this was of me and if you have any criticism or advice on what to do past the apology I made I’d be appreciative.",
        "created_utc": 1677442908,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cosas que nos pasó de pequeños que a día de hoy nos hielan la sangre",
        "author": "Kiatt_meu",
        "url": "https://www.reddit.com/r/confession/comments/11cregn/cosas_que_nos_pasó_de_pequeños_que_a_día_de_hoy/",
        "text": "Gente de Reddit ¿Que les ha pasado de pequeños que hoy en día los aterra? Empiezo yo, de pequeña no me gustaba levantarme de noche por que sentía que me iban a jalar las patas pero una noche  que me dió mucha sed me levanté para ir a la cocina, y cuando quería volver a mi habitación ví la figura de un hombre, alto en el pasillo estaba parado viéndome, no pude ver su rostro pero no quise volver a mi habitación y me quedé en la cocina hasta la mañana. A día de hoy ya nos mudamos de esa casa y no me lo he vuelto a encontrar",
        "created_utc": 1677442587,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am so jealous of my sister and I think everything will be different now",
        "author": "Infinite-Room7096",
        "url": "https://www.reddit.com/r/confession/comments/11cqxo6/i_am_so_jealous_of_my_sister_and_i_think/",
        "text": "[removed]",
        "created_utc": 1677441480,
        "upvote_ratio": 1.0
    },
    {
        "title": "not directly a confession but wanted to tell someone that today i cried for the first time after months and felt physical pain due to a heartbreak for the first time",
        "author": "throwaway718843k",
        "url": "https://www.reddit.com/r/confession/comments/11cq318/not_directly_a_confession_but_wanted_to_tell/",
        "text": "[removed]",
        "created_utc": 1677439430,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Hate them. I can't bear it anymore. I hate them.. I hate myself.",
        "author": "IfYouFUCKMe",
        "url": "https://www.reddit.com/r/confession/comments/11cpmyq/i_hate_them_i_cant_bear_it_anymore_i_hate_them_i/",
        "text": "[removed]",
        "created_utc": 1677438367,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frustrated to the max hope someone can enlighten me",
        "author": "fedupmillard",
        "url": "https://www.reddit.com/r/confession/comments/11cpbrf/frustrated_to_the_max_hope_someone_can_enlighten/",
        "text": "[removed]",
        "created_utc": 1677437628,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im an alcoholic and threw up at work and lied to coworkers saying I was pregnant. Now everyone wants to know baby names....how far along I am....",
        "author": "Upset_Cherry_5239",
        "url": "https://www.reddit.com/r/confession/comments/11coy1b/im_an_alcoholic_and_threw_up_at_work_and_lied_to/",
        "text": "[removed]",
        "created_utc": 1677436708,
        "upvote_ratio": 1.0
    },
    {
        "title": "Havent seen my father for 8 years due to my being kidnapped",
        "author": "iPhoneIvan",
        "url": "https://www.reddit.com/r/confession/comments/11col2w/havent_seen_my_father_for_8_years_due_to_my_being/",
        "text": "I’ve got a question that is really bothering me, I’ll ask it at the end. \n\n\n\nLong story short, my mother is russian and up until i was 7 we used to go to russia to see her parents. When i was seven, we didn’t return. \n\n\nMy dad who has money started many courts. My mother has done everything so i wouldnt see him, and if she now goes to the country im originally from, she’ll go to prison. I talked with my dad secretly for years (until i was 11) and he started new courts where he would play audios where i was telling him how my mother abused me. Three times my mother made me an emotional hell after attending the court and listening to that, and then i stopped talking to my dad because i felt betrayed. \n\n\nWhen i was 11 my mother agreed to leave me with him for two months on summer holidays and it was the best. But then, when I returned to russia, i got the third and last emotional hell for having said shit about my mother (she heard it in the audios in the court). Since then i didnt talk to my father. Im 15 now. And i texted him happy birthday two months ago and since then we chat and talk. Secretly from my mother. \n\nMy dad has a plan in which i have to cooperate a lot if i want to live with him and leave russia. \n\nSo, since i was 7 we have met only once, and since i was 11 i havent talked with my dad and its been four years and a half, but we’ve been talking for two months now. I have always called my dad by his name (maybe due to lack of affection?) If i do go with with him, will he love me? Is there a slight chance that no? A sliiiight chance? Please be honest what you think.",
        "created_utc": 1677435837,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am so sick and tired of being the shortest person in the room",
        "author": "Any_Return_3107",
        "url": "https://www.reddit.com/r/confession/comments/11cnwqi/i_am_so_sick_and_tired_of_being_the_shortest/",
        "text": "[removed]",
        "created_utc": 1677434256,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a TBI and I useChat GPI to help me write emails for work",
        "author": "easterween",
        "url": "https://www.reddit.com/r/confession/comments/11cnq1r/i_have_a_tbi_and_i_usechat_gpi_to_help_me_write/",
        "text": "[removed]",
        "created_utc": 1677433850,
        "upvote_ratio": 1.0
    },
    {
        "title": "i have not ate in four days and my stomach is killing me",
        "author": "Mugiwaranobooya",
        "url": "https://www.reddit.com/r/confession/comments/11cneyc/i_have_not_ate_in_four_days_and_my_stomach_is/",
        "text": "[removed]",
        "created_utc": 1677433194,
        "upvote_ratio": 1.0
    },
    {
        "title": "i have not ate in four days and i my stomach is killing me.",
        "author": "Mugiwaranobooya",
        "url": "https://www.reddit.com/r/confession/comments/11cn7sq/i_have_not_ate_in_four_days_and_i_my_stomach_is/",
        "text": "[removed]",
        "created_utc": 1677432775,
        "upvote_ratio": 1.0
    }
]