[
    {
        "title": "i dont think you can heal from borderline personality disorder",
        "author": "ThrowRAsussybaka",
        "url": "https://www.reddit.com/r/confession/comments/11dq90x/i_dont_think_you_can_heal_from_borderline/",
        "text": "I have bpd.\n\nFor people who don't know, bpd is a mental illness which causes quick mood swings, bad thoughts and mostly, unstable relationships. \n\nI have been in therapy for almost three years. I have friends and meaningful relationships. Everyone thinks i made progresses, but I havent. I try to seem happy and confident but its just an act I wish people saw through. Doubts are eating me inside.\n\ni always question everything. Every interaction i have is made of paper, ready to be blown away. I feel like im walking on eggshells, I feel like no one wants me. I feel unlovable.\n\nI am nice to people because i wish people were nice with me. I hold them and comfort them, talk to them for hours, because i know the despair of being alone. I wish someone was there to hold me too.\n\nI know i have friends who somewhat care about me. But i dont feel loved. I dont think i can be loved. The void inside of me cannot be filled, even when i fill the one inside other people. I am completely and utterly alone. There's no medicine that can fix that.\n\nI think I will feel like this forever. In my head i will always be alone.",
        "created_utc": 1677540213,
        "upvote_ratio": 1.0
    },
    {
        "title": "I cheated, got caught and got away with it. I go home tomorrow to see her",
        "author": "salguod83",
        "url": "https://www.reddit.com/r/confession/comments/11dq18e/i_cheated_got_caught_and_got_away_with_it_i_go/",
        "text": "[removed]",
        "created_utc": 1677539662,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just found out I've been using kazoo's backwards all these years",
        "author": "marble-time",
        "url": "https://www.reddit.com/r/confession/comments/11dq024/just_found_out_ive_been_using_kazoos_backwards/",
        "text": "[removed]",
        "created_utc": 1677539580,
        "upvote_ratio": 1.0
    },
    {
        "title": "What I couldn’t find a partner if I divorced because I’m so ugly?",
        "author": "TurbulentAnomalies",
        "url": "https://www.reddit.com/r/confession/comments/11dp2ov/what_i_couldnt_find_a_partner_if_i_divorced/",
        "text": "[removed]",
        "created_utc": 1677537294,
        "upvote_ratio": 1.0
    },
    {
        "title": "I(F) shoved my situationship(M) and I feel terrible about it",
        "author": "ponderingonwhatsnew",
        "url": "https://www.reddit.com/r/confession/comments/11dotfh/if_shoved_my_situationshipm_and_i_feel_terrible/",
        "text": "[removed]",
        "created_utc": 1677536659,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think my gf is trying to baby trap me. Idk what to do",
        "author": "throwRA__tyler",
        "url": "https://www.reddit.com/r/confession/comments/11doqp4/i_think_my_gf_is_trying_to_baby_trap_me_idk_what/",
        "text": "[removed]",
        "created_utc": 1677536462,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m killing myself tonight and I wanted to tell someone why.",
        "author": "WeddingOk7531",
        "url": "https://www.reddit.com/r/confession/comments/11dopst/im_killing_myself_tonight_and_i_wanted_to_tell/",
        "text": "[removed]",
        "created_utc": 1677536406,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm unable to feel anything for anyone and it's painful",
        "author": "Loose_Surround_8865",
        "url": "https://www.reddit.com/r/confession/comments/11donnn/im_unable_to_feel_anything_for_anyone_and_its/",
        "text": "[removed]",
        "created_utc": 1677536255,
        "upvote_ratio": 1.0
    },
    {
        "title": "I write this as a last desperation that someone.. anyone will hear me",
        "author": "BOOboUraisin23",
        "url": "https://www.reddit.com/r/confession/comments/11do282/i_write_this_as_a_last_desperation_that_someone/",
        "text": "All my life I have been ignored, when I was younger I tried to speak up by being obnoxious so they wouldn’t ignore me but I just got in trouble, no one ever taught me how to communicate or be happy, everyone told me I was rude and stupid. Deep down it was hurting me until I just stopped. I stopped being friendly, I stopped making noise, I stopped trying to be heard. Soon after I got tired of being walked all over and interrupted. Every bit of attention was savored, I developed mental issues (bipolar, social anxiety mainly (diagnosed)) I was in therapy but even my therapist didn’t listen, she said I wasn’t “very severe” and basically used me to get paid to have a friend. I don’t think I’ve ever had a real friend. Just because my family is comfortable everyone assumes I’m fine and have a perfect life, it made me feel like my issues weren’t valid. Everyone just assumes I’m lying or crazy because my mother was. If someone, anyone wants to hear my story it would make me feel needed and maybe save my life. I don’t want to kill myself. But I’m losing hope and just want to be heard.",
        "created_utc": 1677534818,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm in love with my best friend, and it's really tough",
        "author": "Apprehensive_Sink159",
        "url": "https://www.reddit.com/r/confession/comments/11dntgy/im_in_love_with_my_best_friend_and_its_really/",
        "text": "[removed]",
        "created_utc": 1677534223,
        "upvote_ratio": 1.0
    },
    {
        "title": "i seem to ruin everything i touch with my insecurities.",
        "author": "AnonymousAnt1234",
        "url": "https://www.reddit.com/r/confession/comments/11dns83/i_seem_to_ruin_everything_i_touch_with_my/",
        "text": "[removed]",
        "created_utc": 1677534136,
        "upvote_ratio": 1.0
    },
    {
        "title": "how am i supposed to deal with my first heartbreak",
        "author": "StringNext9831",
        "url": "https://www.reddit.com/r/confession/comments/11dnjet/how_am_i_supposed_to_deal_with_my_first_heartbreak/",
        "text": "so im 17, i was dating this guys for 6 months (we were never official) and i know that doesn’t seem like a long time but it does when he’s the only thing i ever think about. he’s the first guy i ever trusted with my body. i told him everything. he was the first guy i had a deeper connection with but last night he facetimed me at 12 in a girls dorm and i was confused and hung up and i asked who she was, he told me she was just a friend who was feeling sad and wanted him to come over ( but at midnight? and why would she want HIM. MY MAN.) but then he just texted me and said i deserve better than him and he wishes he would have wanted a relationship with me rather than just to “get” with me and he things we should be friends. i cried for hours about it and got an hour of sleep last night. it hurts so bad because he was perfect and never did anything wrong. of course the first boy i trusted with my body had to say he only wanted to get with me. i just don’t understand. he introduced me to his family, i hug his grandparents, i went to church with them and one random night he decided to end it all. my eyes and head have been throbbing all day and i’m so hurt i don’t know how i’m going to be able to move on from him. i genuinely love him and care so much about him. i just don’t know what to do. :(((",
        "created_utc": 1677533533,
        "upvote_ratio": 1.0
    },
    {
        "title": "I cried in a meeting with my boss. I feel like such an idiot.",
        "author": "chrisandthemums",
        "url": "https://www.reddit.com/r/confession/comments/11dn46h/i_cried_in_a_meeting_with_my_boss_i_feel_like/",
        "text": "[removed]",
        "created_utc": 1677532536,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like I am trapped and there’s no way for me to escape.",
        "author": "mcumoviesrelite",
        "url": "https://www.reddit.com/r/confession/comments/11dn09f/i_feel_like_i_am_trapped_and_theres_no_way_for_me/",
        "text": "[removed]",
        "created_utc": 1677532279,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found a revealing picture of my female friend and jacked off to it.",
        "author": "throwaway83927292",
        "url": "https://www.reddit.com/r/confession/comments/11dmv1y/i_found_a_revealing_picture_of_my_female_friend/",
        "text": "[removed]",
        "created_utc": 1677531935,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found a revealing picture of my female friend and jacked off to it.",
        "author": "throwaway83927292",
        "url": "https://www.reddit.com/r/confession/comments/11dmtxs/i_found_a_revealing_picture_of_my_female_friend/",
        "text": "[removed]",
        "created_utc": 1677531863,
        "upvote_ratio": 1.0
    },
    {
        "title": "I secretly loved being in a toxic relationship where I was emotionally degraded.",
        "author": "Sweaty_cheeze",
        "url": "https://www.reddit.com/r/confession/comments/11dmsb8/i_secretly_loved_being_in_a_toxic_relationship/",
        "text": "[removed]",
        "created_utc": 1677531753,
        "upvote_ratio": 1.0
    },
    {
        "title": "im ok i just need to vent im just in a pickle about my mental health",
        "author": "TandemG00",
        "url": "https://www.reddit.com/r/confession/comments/11dmrbu/im_ok_i_just_need_to_vent_im_just_in_a_pickle/",
        "text": "I 22 m is on the verge of a mental breakdown daily. I want to cry and disappear, i want to scream but i physically can't. It feels like whenever i try its never good enough for anyone for anything. It feels like im a burden to everyone around me. All i want to to is sleep and never wake up. Im frustrated and constantly stressed. These migraines are a constant pain in my ass to the point where i black out almost every night. I cant concentrate or have a moment of peace in my mind. Its so busy.",
        "created_utc": 1677531689,
        "upvote_ratio": 1.0
    },
    {
        "title": "Everyone says porn is bad for you, and I agree it is. But I also do not really care because of the pleasure I get when I watch it. Sometimes I hire babysitters to take care of my kids just so I can drive to a parking lot and get off to porn for a few hours.",
        "author": "SpiritOk8304",
        "url": "https://www.reddit.com/r/confession/comments/11dlsal/everyone_says_porn_is_bad_for_you_and_i_agree_it/",
        "text": "[removed]",
        "created_utc": 1677529371,
        "upvote_ratio": 1.0
    },
    {
        "title": "i feel like i dont need friends and only have aquaintances. here",
        "author": "Vast_Bar_935",
        "url": "https://www.reddit.com/r/confession/comments/11dlq10/i_feel_like_i_dont_need_friends_and_only_have/",
        "text": "[removed]",
        "created_utc": 1677529216,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hit my husband across the head with a frying pan",
        "author": "quesoflavouredcheese",
        "url": "https://www.reddit.com/r/confession/comments/11dln0t/i_hit_my_husband_across_the_head_with_a_frying_pan/",
        "text": "[removed]",
        "created_utc": 1677529018,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think my boyfriend is secretly gay. I love him so much tho.",
        "author": "throwRA_78butterfly",
        "url": "https://www.reddit.com/r/confession/comments/11dktdp/i_think_my_boyfriend_is_secretly_gay_i_love_him/",
        "text": "[removed]",
        "created_utc": 1677527028,
        "upvote_ratio": 1.0
    },
    {
        "title": "I cheated and never told him and I don’t think I have it in me to",
        "author": "pun_chali",
        "url": "https://www.reddit.com/r/confession/comments/11dk2bm/i_cheated_and_never_told_him_and_i_dont_think_i/",
        "text": "[removed]",
        "created_utc": 1677525214,
        "upvote_ratio": 1.0
    },
    {
        "title": "One of our workers is trying to sell our product under the table to our customer",
        "author": "Brilliant_Ad2607",
        "url": "https://www.reddit.com/r/confession/comments/11dk1of/one_of_our_workers_is_trying_to_sell_our_product/",
        "text": "The thing is that my brother is owner of a glass company, and one of their workers try to sell glass to one of our customers for a cheap price, but the thing that the worker was going to sell is our product under the table. If someone have an idea to what to do to the worker help us please.",
        "created_utc": 1677525175,
        "upvote_ratio": 1.0
    },
    {
        "title": "I stamped another kids sack when I was a kid and it popped",
        "author": "SackPopperThrowaway",
        "url": "https://www.reddit.com/r/confession/comments/11djofx/i_stamped_another_kids_sack_when_i_was_a_kid_and/",
        "text": "I was booted, it was a brutal stomp, I did enough damage that one ball had to be removed, thankfully the other remains and his sack was repaired",
        "created_utc": 1677524313,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t really have a good title name but I would like some feedback.",
        "author": "jellyfishinc",
        "url": "https://www.reddit.com/r/confession/comments/11djd90/i_dont_really_have_a_good_title_name_but_i_would/",
        "text": "[removed]",
        "created_utc": 1677523550,
        "upvote_ratio": 1.0
    },
    {
        "title": "my 17m yo coworker told me he had a sleepover with his manager",
        "author": "idkthrowaway238",
        "url": "https://www.reddit.com/r/confession/comments/11dj3x8/my_17m_yo_coworker_told_me_he_had_a_sleepover/",
        "text": "my 17m year old coworker told me he had a sleepover with one of my managers who is 23f. should i tell another one of my managers about this? I know if he found out i told he would be upset with me because ofc he's happy about it but i just think it's so gross and she should be fired. should i say something or stay out of it?",
        "created_utc": 1677522924,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you know anyone who the sound of their voice is just nails on a chalkboard when you hear the speak?",
        "author": "No_Statistician_6101",
        "url": "https://www.reddit.com/r/confession/comments/11dinjm/do_you_know_anyone_who_the_sound_of_their_voice/",
        "text": "[removed]",
        "created_utc": 1677521849,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have been pretending to be a student to reap the financial benefits until I start work full time",
        "author": "BlackwingLair44",
        "url": "https://www.reddit.com/r/confession/comments/11dimgi/i_have_been_pretending_to_be_a_student_to_reap/",
        "text": "This isn't something I planned to happen but everything seemed to fall into place in a comfortable lie I could keep up. I started studying microeconomics at college after serving in the Navy for 7 years, only to drop out after 2 of the 4 years. The course wasn't for me and the plan was always to go into working full-time as an alternative. Thing is, I never officially dropped out, I just stopped handing in work and showing up after my grades dropped, and for a long time I wasn't contacted by the college asking questions, so I just carried on as it was. I do not live at home, and so it only made sense for me to stay living in the student house I had already signed the contract for with four other student housemates. It isn't like my parents will be receiving any paperwork since I have declared myself emancipated on my university profile as well as my funding applications. My girlfriend also attends the same college and so I'm still close to her living here. The jobs I am currently applying for all request proof of being a student, which I still have in my student ID and with access student email address. \n\nThis is where it gets slightly shady, though. As the oldest living in the student house I am renting, the responsibility naturally fell on me to take charge of our household bills and finances. At the beginning of the year I signed us up for separate electricity and gas services to keep the costs as low as possible, and had the other students start sending their split of the money into my account every month. Things started off fine but I soon realised that between looking for a job full time and the student loan eventually stopping, I'd be stuck for money. I have a healthy savings account from my military service but I'm not about to start draining it. Instead, I photoshopped one of the monthly bill emails to look as though our price was gradually increasing, and asked all 4 of my housemates for more money, keeping the excess as a reserve. Since I am the only one officially on the accounts, I am the only one who has access to the real bill amount anyway, and with the \"proof\" I send them each month of the price increases, they are none the wiser. Truthfully in other circumstances I would feel guilty for this but I don't get on with my housemates, specifically one or two of them that are messy and entitled. My girlfriend isn't aware of this yet, as far as she is aware I have just started taking my classes online. I plan to tell her when the time is right.",
        "created_utc": 1677521778,
        "upvote_ratio": 1.0
    },
    {
        "title": "I leaked information about questions in a mock exam",
        "author": "totallynotdistracted",
        "url": "https://www.reddit.com/r/confession/comments/11dim1p/i_leaked_information_about_questions_in_a_mock/",
        "text": "For context:\n\n1.  I do more subjects than most people do (four instead of three), so I do extra exams. \n2. Due to the combinations and popularity of subjects, there can be multiple classes with varying numbers of people (for this subject \\~20 and \\~5)\n3. It's halfway through the exam week and I'm stressed about the two exams I have that day (Maths and Chemistry - my two least favourite subjects). And it's first thing in the morning.\n4. We were not given much/if any info about the exams beforehand\n\nSo I was minding my own business when another student asks me what exams I have already done. I tell her the truth, and she asks how they were, I say that I think it went alright but some questions in one of the papers threw me off a little (it was about content that I wasn't expecting to be in that paper). \n\nI barely know this girl, I think she does P.E. but I'm not sure what else she does, because apart from my friends and those in my classes, I do not know what others are doing.\n\nI tell her the topics for the two longest answer questions on the paper (6 marks each). I then realise that she probably does the subject that I'm doing and she's going to sit the paper that morning.\n\nNaturally, the information spreads a little (without my name in the mix) and I don't think much of it until after the exams.\n\nI regret that I gave a handful of students an unfair advantage, I really do. I probably would have gone to a teacher if they hadn't said that if a student cheats in anyway that they'd send an email home, suspend the student. \n\nSo I kept my mouth shut and have gone about life.\n\nBut I just need to admit that I gave an unfair advantage, even if it is to strangers that I don't know. This is the first - and last - time that I will ever do this.\n\nThe exams count for nothing except giving the student ideas as to how they are doing.",
        "created_utc": 1677521748,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hated my golden child step sister and now she is dying. My Mom remarried to this guy and suddenly I was one of a lot of kids. Step Dad was a complete jerk to me. She was younger and had a health condition and so everyone catered to her even in little things. She became very spoiled and a brat.",
        "author": "Apprehensive_Fox_47",
        "url": "https://www.reddit.com/r/confession/comments/11dij56/i_hated_my_golden_child_step_sister_and_now_she/",
        "text": "[removed]",
        "created_utc": 1677521563,
        "upvote_ratio": 1.0
    },
    {
        "title": "I snooped on my partners IG and saw something that's made me mad. What should I do.",
        "author": "SabrinasOutros",
        "url": "https://www.reddit.com/r/confession/comments/11di8wx/i_snooped_on_my_partners_ig_and_saw_something/",
        "text": "[removed]",
        "created_utc": 1677520905,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am a 25 year old female zoophile that's never acted on it",
        "author": "ThatOneChest",
        "url": "https://www.reddit.com/r/confession/comments/11dhqrg/i_am_a_25_year_old_female_zoophile_thats_never/",
        "text": "[removed]",
        "created_utc": 1677519652,
        "upvote_ratio": 1.0
    },
    {
        "title": "cuanto tiempo tengo que espersr volver a españa despues de estar mas de 90 dias",
        "author": "tori19999",
        "url": "https://www.reddit.com/r/confession/comments/11dhdht/cuanto_tiempo_tengo_que_espersr_volver_a_españa/",
        "text": "Hola yo estuve en españa 90 dias mas dos semanas solo de retraso cuando pase por migraciones ellos me dijeron que ya no podia volver pero no pague multa ni nada, no me dijeron cuanto tiempo no podia volver yo por temas economicos no pude volver a mi pais de origen y tuve que esperar dos semanas a que mi pareja me ayudara a pagar los tickets quisiera saber si cuanto tiempo debo esperar para volver en el caso que solo quiera hacer escala y tambien donde puedo ver mi estatus migratorio de españa porque de mi pais solo me sale que ingrese pero no dice nada mas si algun abogado de tema de exteriores me podria asesorar porfavor gracias.",
        "created_utc": 1677518757,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crush on Best friend, husband doesn't know. it's becoming an issue for me",
        "author": "ambercoops",
        "url": "https://www.reddit.com/r/confession/comments/11dh2th/crush_on_best_friend_husband_doesnt_know_its/",
        "text": "[removed]",
        "created_utc": 1677518039,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pissed in college roommate’s cup. Don’t shower when people need to go to class and get ready.",
        "author": "ScaredHelpPleass",
        "url": "https://www.reddit.com/r/confession/comments/11dgyvf/pissed_in_college_roommates_cup_dont_shower_when/",
        "text": "[removed]",
        "created_utc": 1677517767,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have an obsession for my teacher )sports coach to be. exact)",
        "author": "TrainingDirt7562",
        "url": "https://www.reddit.com/r/confession/comments/11dg43s/i_have_an_obsession_for_my_teacher_sports_coach/",
        "text": "[removed]",
        "created_utc": 1677515676,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have this obsession for my teacher (sports coach)",
        "author": "TrainingDirt7562",
        "url": "https://www.reddit.com/r/confession/comments/11dg3cb/i_have_this_obsession_for_my_teacher_sports_coach/",
        "text": "[removed]",
        "created_utc": 1677515621,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was grinning and grimacing at little kids in a spa with my friend.",
        "author": "cyboorgg",
        "url": "https://www.reddit.com/r/confession/comments/11dfiij/i_was_grinning_and_grimacing_at_little_kids_in_a/",
        "text": "Idk if i should feel guilty or not. Few of the kids looked over their shoulders as they ran away scared lol",
        "created_utc": 1677514139,
        "upvote_ratio": 1.0
    },
    {
        "title": "26F - I sleep with my boss at work and my husband has no idea",
        "author": "wifelysecret",
        "url": "https://www.reddit.com/r/confession/comments/11df891/26f_i_sleep_with_my_boss_at_work_and_my_husband/",
        "text": "[removed]",
        "created_utc": 1677513447,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend gets a lot of pleasure when girls cut themselves for him.",
        "author": "gagpsois",
        "url": "https://www.reddit.com/r/confession/comments/11df7my/my_friend_gets_a_lot_of_pleasure_when_girls_cut/",
        "text": "[removed]",
        "created_utc": 1677513406,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like I am a cannibal and I want to taste my own.",
        "author": "Ok-Improvement165",
        "url": "https://www.reddit.com/r/confession/comments/11deulo/i_feel_like_i_am_a_cannibal_and_i_want_to_taste/",
        "text": "[removed]",
        "created_utc": 1677512495,
        "upvote_ratio": 1.0
    },
    {
        "title": "i lied about my gender to my online friends (sort of)",
        "author": "Sea_Confusion_4303",
        "url": "https://www.reddit.com/r/confession/comments/11deenw/i_lied_about_my_gender_to_my_online_friends_sort/",
        "text": "[removed]",
        "created_utc": 1677511359,
        "upvote_ratio": 1.0
    },
    {
        "title": "i’m a teenager and i don’t think i know who i am, and i don’t know if thinking like that is just me being a hormonal teenager.",
        "author": "disappointingfool",
        "url": "https://www.reddit.com/r/confession/comments/11ddysm/im_a_teenager_and_i_dont_think_i_know_who_i_am/",
        "text": "[removed]",
        "created_utc": 1677510223,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me and my childhood friend burned a house down as children",
        "author": "CataLory",
        "url": "https://www.reddit.com/r/confession/comments/11ddnma/me_and_my_childhood_friend_burned_a_house_down_as/",
        "text": "[removed]",
        "created_utc": 1677509445,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am an attention whore I am a bad person I love attention .",
        "author": "Difficult-Ruin-7366",
        "url": "https://www.reddit.com/r/confession/comments/11dd6li/i_am_an_attention_whore_i_am_a_bad_person_i_love/",
        "text": "[removed]",
        "created_utc": 1677508191,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a secret hot wife fetish. Do I tell my wife?",
        "author": "2curious4mygood",
        "url": "https://www.reddit.com/r/confession/comments/11dd2q6/i_have_a_secret_hot_wife_fetish_do_i_tell_my_wife/",
        "text": "[removed]",
        "created_utc": 1677507899,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who should love more? The man or woman. Is it better for a man to love his woman more than she love him? We are know at least one’s love would suppress the other.",
        "author": "yo_escribo",
        "url": "https://www.reddit.com/r/confession/comments/11dcgty/who_should_love_more_the_man_or_woman_is_it/",
        "text": "[removed]",
        "created_utc": 1677506277,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m an objectively terrible worker. Here are my wrongdoings.",
        "author": "SelfDestructive123",
        "url": "https://www.reddit.com/r/confession/comments/11dcdk2/im_an_objectively_terrible_worker_here_are_my/",
        "text": "Throwaway account.\n\nI’m a UI Designer and I’ve been working in this field for 18 years.  I’ve been really arrogant, sometimes lazy, disengaged, sometimes entitled.   I will say that I am a bit talented, but my poor attitude outweighs my talent at times.  I’m also extroverted which can rub people the wrong way.\n\n**First job.** When I first started my career in the early 2000’s I felt I knew better than everyone else and would get territorial about my work.  I remember snapping at a co-worker once because I took on project that he initially handled (without anyone telling me).  When he wanted to work on it again after he got back from vacation I got angry with him because I felt the project was no longer his.  I got chewed out by my boss afterwards.\n\n**Second job** My second job out of college was really boring, working in IT for an insurance company.   My boss liked me at first, but because I was bored with the work I just browsed the web a lot and didn’t work very hard.  I could tell he kind of regretted hiring me.   I would try to build a couple complex components and then would get frustrated by the coding and we would have a software engineer figure out the coding for me which angered everyone.  I’d apologize but I could tell they didn’t care.   I remember getting a “does not meet expectations” grade in my last year before quitting.\n\n**Third job.**  Long hours, bad pay.  I didn’t do too much wrong here other than take kind of long to get things done on a few projects.  \n\n**Fourth job.**  I became disrespectful to my boss because I didn’t think he was a very good manager.   He’d do passive aggressive stuff to me and I would do passive aggressive stuff back to him.  I lost my cool a couple of times at a co-worker who was difficult to work with and once stormed out of a meeting because I was about to snap.  I layed into this co-worker later on in a meeting because she cost us 5-weeks of work.  She reported me to my boss and I got reprimanded for it and later received a “does not meet expectations” grade for the second time in my career.   This job made me so angry at times that I would stay and work from home at least 3-4 days a week even when the company policy is just 2 days per week.   I was eventually let go and given a severance package when we lost an account.  \n\n**Fifth job.**  Contract job.  They switched my job title on me when I arrived at the job which really angered me.  Once they did that, I shut down mentally.  I half assed everything and the worked bored me to tears.  I had a terrible project manager who was kind of unhinged and just didn’t like me.   I missed a meeting once that I didn’t see on my calendar and she reported me.   I was let go 3 months into my 6 month contract.   When I was notified I was let go by a director in the company, I kind of laughed at him and basically told him “peace out”. \n\n**Sixth job.**  I did great! Got promoted.\n\n**Seventh job.**  My dream job.  I’ve had a hard time accepting criticism.  I’m worried about blowing a fuse and snapping on people.  I can tell some of my workers kind of disrespect my work at times and I’ve had to just accept it and shut my mouth.  \n\nI’m worried about my behavior at times and I’m thinking about getting counseling to control my emotions.",
        "created_utc": 1677506015,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I [27F] experiencing gaslighting by her [38F] or am I just incredibly misinformed?",
        "author": "askforinvented",
        "url": "https://www.reddit.com/r/confession/comments/11dbmmf/am_i_27f_experiencing_gaslighting_by_her_38f_or/",
        "text": "[removed]",
        "created_utc": 1677503840,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my psychologist [38F] being naive or am I [27F] the one who is?",
        "author": "askforinvented",
        "url": "https://www.reddit.com/r/confession/comments/11dblfl/is_my_psychologist_38f_being_naive_or_am_i_27f/",
        "text": "[removed]",
        "created_utc": 1677503737,
        "upvote_ratio": 1.0
    },
    {
        "title": "I stamped another kid's balls when I was 10 and they popped",
        "author": "Palace43",
        "url": "https://www.reddit.com/r/confession/comments/11db9po/i_stamped_another_kids_balls_when_i_was_10_and/",
        "text": "[removed]",
        "created_utc": 1677502775,
        "upvote_ratio": 1.0
    },
    {
        "title": "I stamped another kids balls when I was 10 and they popped",
        "author": "SackPopperThrowaway",
        "url": "https://www.reddit.com/r/confession/comments/11db4qt/i_stamped_another_kids_balls_when_i_was_10_and/",
        "text": "[removed]",
        "created_utc": 1677502321,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was a terrible person with one of the best friends I ever had and the guilt is killing me.",
        "author": "diegunsk",
        "url": "https://www.reddit.com/r/confession/comments/11db045/i_was_a_terrible_person_with_one_of_the_best/",
        "text": "[removed]",
        "created_utc": 1677501920,
        "upvote_ratio": 1.0
    },
    {
        "title": "gang stalked in Mexican village cuz cartel wants me dead",
        "author": "lostandsouless69",
        "url": "https://www.reddit.com/r/confession/comments/11dau2g/gang_stalked_in_mexican_village_cuz_cartel_wants/",
        "text": "[removed]",
        "created_utc": 1677501376,
        "upvote_ratio": 1.0
    },
    {
        "title": "I cheated my grades to get passed on my senior high school",
        "author": "kristikra",
        "url": "https://www.reddit.com/r/confession/comments/11dat5c/i_cheated_my_grades_to_get_passed_on_my_senior/",
        "text": "[removed]",
        "created_utc": 1677501301,
        "upvote_ratio": 1.0
    },
    {
        "title": "When I was 10 I stamped another kids balls and they popped",
        "author": "SackPopperThrowaway",
        "url": "https://www.reddit.com/r/confession/comments/11daqqr/when_i_was_10_i_stamped_another_kids_balls_and/",
        "text": "[removed]",
        "created_utc": 1677501087,
        "upvote_ratio": 1.0
    },
    {
        "title": "[F24] I'd like to express my heartfelt apology to my teacher for what I did.",
        "author": "kristikra",
        "url": "https://www.reddit.com/r/confession/comments/11dapjt/f24_id_like_to_express_my_heartfelt_apology_to_my/",
        "text": "[removed]",
        "created_utc": 1677500996,
        "upvote_ratio": 1.0
    },
    {
        "title": "I took advantage of a passed out girl and I still struggle with myself",
        "author": "PawSacrifice",
        "url": "https://www.reddit.com/r/confession/comments/11daohu/i_took_advantage_of_a_passed_out_girl_and_i_still/",
        "text": "About five years ago, I lived in a shared apartment with a girl I knew from school. We were no friends but occasionally in contact, also sexually two times before moving together. Our relationship in the apartment was not healthy at all. We avoided each other a lot and we were often angry with each other, due to expectations that could not be fulfilled or due to obvious misbehavior.\n\nOne evening, she told me that she could not sleep well alone and asked me if I could sleep in her bed. I was really horny at that time and had the hots for her so I agreed. The same evening, we were having drinks - she had way more than me and I took some Kratom. We decorated our apartment and talked a lot. This was actually pretty exhausting for me but especially at this time, I was a person that endured a situation instead of solving it. When it was really late and the sun almost started rising up, she decided that we go to bed. In there, I wanted to check if she is up for something but realized that she passed out. I felt belied so at least I tried to pleasure myself but this had almost no effect. Then there was this mix of anger, lust and indifference that moved me towards that situation where I penetrated her. I did not cum inside her so she would not notice. And she didnt.\n\nOne year later, I moved out without collecting my deposit. I somehow came along with me but never solved this topic.\n\nLast year, my guilt was triggered by a podcast about rape . In the next weeks, it became so strong that I could not focus on anything and my head started hurting. So I decided to tell that girl what I did. This may was the most difficult thing in my life. I arranged a meeting for claryfiing something \"serious\". I told her that I abused her this night and that I am extremely sorry. I also offered her to go to prison but she declined. She was grateful that I told her and encouraged me to go to therapy.\n\nThe next months were much better but soon I again felt really shitty so I started therapy some weeks ago. It was really redeeming to have someone third to talk through this topic. Today, my guilt is still my daily companion and I am exploring options to get along with myself.",
        "created_utc": 1677500900,
        "upvote_ratio": 1.0
    },
    {
        "title": "I slept with and have feelings for my bestfriends girlfriend",
        "author": "Consistent-Rate-9037",
        "url": "https://www.reddit.com/r/confession/comments/11da6bu/i_slept_with_and_have_feelings_for_my_bestfriends/",
        "text": "[removed]",
        "created_utc": 1677499255,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've manipulated all my online friends into thinking my life is worse than it actually is.",
        "author": "brden166",
        "url": "https://www.reddit.com/r/confession/comments/11d9z1v/ive_manipulated_all_my_online_friends_into/",
        "text": "[removed]",
        "created_utc": 1677498558,
        "upvote_ratio": 1.0
    },
    {
        "title": "I will report My teacher for being in relationship with my friend",
        "author": "WillingnessFrosty132",
        "url": "https://www.reddit.com/r/confession/comments/11d9gfp/i_will_report_my_teacher_for_being_in/",
        "text": "[removed]",
        "created_utc": 1677496722,
        "upvote_ratio": 1.0
    },
    {
        "title": "My celebrity crush saw my dm (I guess) but didn’t accept my dm request bc I was out of line",
        "author": "938040",
        "url": "https://www.reddit.com/r/confession/comments/11d91lq/my_celebrity_crush_saw_my_dm_i_guess_but_didnt/",
        "text": "[removed]",
        "created_utc": 1677495266,
        "upvote_ratio": 1.0
    },
    {
        "title": "I HATE TRANSGENDERS AHHHHHHHHHHHHHHHHHHHHHHHHHH I HATE THEM SO MUCH",
        "author": "Trans_is_Pedo",
        "url": "https://www.reddit.com/r/confession/comments/11d90lw/i_hate_transgenders_ahhhhhhhhhhhhhhhhhhhhhhhhhh_i/",
        "text": "[removed]",
        "created_utc": 1677495160,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've been faking a fear of strawberries for 11 years",
        "author": "TapBarrel",
        "url": "https://www.reddit.com/r/confession/comments/11d8m9p/ive_been_faking_a_fear_of_strawberries_for_11/",
        "text": "[removed]",
        "created_utc": 1677493696,
        "upvote_ratio": 1.0
    },
    {
        "title": "We are not always in control of our thoughts. I know it now more than ever.",
        "author": "throwawaylosttotime",
        "url": "https://www.reddit.com/r/confession/comments/11d8hxj/we_are_not_always_in_control_of_our_thoughts_i/",
        "text": "[removed]",
        "created_utc": 1677493239,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’d rather jerk off to my wife’s nudes than actually having sex with her for some reason",
        "author": "Loadsofbooks",
        "url": "https://www.reddit.com/r/confession/comments/11d89b1/id_rather_jerk_off_to_my_wifes_nudes_than/",
        "text": "[removed]",
        "created_utc": 1677492344,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (17M) knowingly dated my friend's (18M) ex and the truck of guilt suddenly hit me",
        "author": "According-Sale9535",
        "url": "https://www.reddit.com/r/confession/comments/11d83rt/i_17m_knowingly_dated_my_friends_18m_ex_and_the/",
        "text": "[removed]",
        "created_utc": 1677491807,
        "upvote_ratio": 1.0
    },
    {
        "title": "My wife wants a divorce and I think I’m losing it.",
        "author": "michellee2x",
        "url": "https://www.reddit.com/r/confession/comments/11d7zqv/my_wife_wants_a_divorce_and_i_think_im_losing_it/",
        "text": "[removed]",
        "created_utc": 1677491393,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can’t stop stealing from my job, but i also don’t feel bad either.",
        "author": "plutosaplanetiswear",
        "url": "https://www.reddit.com/r/confession/comments/11d7w7p/i_cant_stop_stealing_from_my_job_but_i_also_dont/",
        "text": "[removed]",
        "created_utc": 1677491013,
        "upvote_ratio": 1.0
    },
    {
        "title": "i have social anxiety and it makes it difficult to use they/them and other pronouns",
        "author": "Melodic_Persimmon204",
        "url": "https://www.reddit.com/r/confession/comments/11d7t61/i_have_social_anxiety_and_it_makes_it_difficult/",
        "text": "[removed]",
        "created_utc": 1677490690,
        "upvote_ratio": 1.0
    },
    {
        "title": "When I was 16 I stole a pair of thong panties from my girlfriends mother. just because she was hot.",
        "author": "Bright-Treacle-6333",
        "url": "https://www.reddit.com/r/confession/comments/11d7rk6/when_i_was_16_i_stole_a_pair_of_thong_panties/",
        "text": "[removed]",
        "created_utc": 1677490515,
        "upvote_ratio": 1.0
    },
    {
        "title": "i have to bury my neighbors pet. I feel desensitized",
        "author": "Safe-Raspberry-343",
        "url": "https://www.reddit.com/r/confession/comments/11d7ih6/i_have_to_bury_my_neighbors_pet_i_feel/",
        "text": "[removed]",
        "created_utc": 1677489560,
        "upvote_ratio": 1.0
    },
    {
        "title": "New dog that I know isn't right for my family/ what should I do?",
        "author": "Ill_Concentrate_5818",
        "url": "https://www.reddit.com/r/confession/comments/11d7b83/new_dog_that_i_know_isnt_right_for_my_family_what/",
        "text": "[removed]",
        "created_utc": 1677488786,
        "upvote_ratio": 1.0
    },
    {
        "title": "I should have asked her, but I didn't. I hate myself for what I did.",
        "author": "medusa4e",
        "url": "https://www.reddit.com/r/confession/comments/11d79os/i_should_have_asked_her_but_i_didnt_i_hate_myself/",
        "text": "[removed]",
        "created_utc": 1677488621,
        "upvote_ratio": 1.0
    },
    {
        "title": "Married 7 years and I keep thinking about cheating!",
        "author": "themindhunterkk",
        "url": "https://www.reddit.com/r/confession/comments/11d6usi/married_7_years_and_i_keep_thinking_about_cheating/",
        "text": "[removed]",
        "created_utc": 1677487013,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got in a really stupid fight with my best friend, feeling dumb.",
        "author": "Miserable-Survey-191",
        "url": "https://www.reddit.com/r/confession/comments/11d6qnk/got_in_a_really_stupid_fight_with_my_best_friend/",
        "text": "[removed]",
        "created_utc": 1677486572,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm 21 and I'm attracted to older men (like men in 30s and 40s)",
        "author": "IslandGirl_0327",
        "url": "https://www.reddit.com/r/confession/comments/11d6hze/im_21_and_im_attracted_to_older_men_like_men_in/",
        "text": "[removed]",
        "created_utc": 1677485643,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I have a massive crush on my friends crush..",
        "author": "No_Act_2391",
        "url": "https://www.reddit.com/r/confession/comments/11d609n/i_think_i_have_a_massive_crush_on_my_friends_crush/",
        "text": "[removed]",
        "created_utc": 1677483793,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me and my friend killed a goldfish for fun and I don't feel bad",
        "author": "Ballones123",
        "url": "https://www.reddit.com/r/confession/comments/11d5yn5/me_and_my_friend_killed_a_goldfish_for_fun_and_i/",
        "text": "[removed]",
        "created_utc": 1677483618,
        "upvote_ratio": 1.0
    },
    {
        "title": "I secretly have a massive crush on my friends crush.",
        "author": "No_Act_2391",
        "url": "https://www.reddit.com/r/confession/comments/11d5xz2/i_secretly_have_a_massive_crush_on_my_friends/",
        "text": "[removed]",
        "created_utc": 1677483547,
        "upvote_ratio": 1.0
    },
    {
        "title": "When two toxic people end up together this is what happen.",
        "author": "beauty4ashes627",
        "url": "https://www.reddit.com/r/confession/comments/11d5x48/when_two_toxic_people_end_up_together_this_is/",
        "text": "After a painful breakup, I was determined to find the one I will have a fling with to get my ex out of my system. I was extremely conservative so I couldn't just hook up with anyone. Until I met this much younger guy who ended up to be my soon to stbxh. He seemed a bit off like he couldn't carry a meaningful conversation but I didn't care at the time cause my mission was to get over the ex. Fast forward our relationship became toxic due to his compulsive lying and my abusive nature. I swore I was going to be different after my ex however lying is my trigger. When I say lying as in he lied about everything even as far as lying that his grandma died just to see if I cared. He also would separate people in his life from each other. He was a different level liar. He got a tattoo of my name cause I asked him to and his mom found out so she had it laser and only for him to have it redone so I won't find out he got it lasered. Or even his work he would lie about it and when I would ask take a pic to prove he would go all the way to the place he said he was working and take a picture and sent it to me. It drove me nuts and I was already dealing with my own mental illness then this guy just made me worst. So fast forward more his abusive controlling rich folks kicked him out cause he keeps lying about me and he joined the military and we decided to marry cause it made sense at the time. I was so happy that time cause his family were evil people and put me thru hell so finally they were out of the picture I figure my stbxh would change for the better. I was wrong! Nothing change and he would have kik and what'sapp account under different name and would lie even when I show proof would deny it was him in the photo. Or make up dumb excuse it was his friend who went in the middle of night to take a photo of him inside his room in the school barracks. He would lie about females at work and he always look at girls. He didn't appreciate that I was patient with him having problems with getting a hard on and he had to take pills for it and then he was 3 inches but I didn't care. Made me feel like I was never enough or pretty enough. So at this point I had enough and he was providing for me and him so couldn't divorce him plus my folks kept pushing me to stay, I decided I'll just cheat back to be able to stay in the marriage. I did and I felt no remorse cause he was never remorseful for anything. He would only cry if he is hurt but never for anyone except his parents that he missed so much. Lying continue and I was done. Wanted divorce drag his narcissistic ass to court 3x but he kept begging and making me feel bad. Stupid me stayed. I decided to built the bridge back between him and his family. I reached out on his behalf and same time I figure we could use financial help. They reconciled cause of me but once things got better with them they wanted him to divorce me. He changed on me and being back to being their slave. I cheated again with a much younger guy to hurt him but I never told him cause he never tell me anything nor admit to anything even with proof. Few months later We got pregnant he didn't seem happy and we fought and he put in my head he would take the baby since I don't work. I decided to abort it he didn't comfort me. and to make up for it he just got a vasectomy and a Tattoo of my sonogram. Now after almost 9yrs together 6 yrs marriage and he got a good job and got his degree he blind sided me and wanted divorce me. I beg him not and he played me only to do it again on Christmas last year. He misled deceived me and tricked me to get me out of our place and just filed.  Now here I am reaping my wrongdoing and while he is enjoying life with his new girl. I do feel it's unfair cause he never paid any consequences for the things he did to me. He abandon me when I got the news I have an autoimmune disorder and when our fur baby got sick too. Completely went NC got a lawyer and No closure no nothing and all cause I texted his dad he lied. But I know for a fact he left me for another female too. This taught me a hard lesson and it brought me closer to God. I have forgiven him and I hope he can forgive me too.",
        "created_utc": 1677483451,
        "upvote_ratio": 1.0
    },
    {
        "title": "i hate having one way feelings, especially because i’m gay m(16)",
        "author": "Key_Acanthisitta5076",
        "url": "https://www.reddit.com/r/confession/comments/11d5e8i/i_hate_having_one_way_feelings_especially_because/",
        "text": "[removed]",
        "created_utc": 1677481469,
        "upvote_ratio": 1.0
    }
]