[
    {
        "title": "I’m (22 M) talking to a high schooler and idk what to do",
        "author": "imgoneandimfinished",
        "url": "https://www.reddit.com/r/confession/comments/118pyyu/im_22_m_talking_to_a_high_schooler_and_idk_what/",
        "text": "[removed]",
        "created_utc": 1677043754,
        "upvote_ratio": 1.0
    },
    {
        "title": "I steal toilet paper from work because I can't afford it",
        "author": "RoxxiBella",
        "url": "https://www.reddit.com/r/confession/comments/118pdyu/i_steal_toilet_paper_from_work_because_i_cant/",
        "text": "[removed]",
        "created_utc": 1677041821,
        "upvote_ratio": 1.0
    },
    {
        "title": "I ruined a soulmate potential relationship (19m) and I deeply regret it",
        "author": "hhghbbv345",
        "url": "https://www.reddit.com/r/confession/comments/118p9tu/i_ruined_a_soulmate_potential_relationship_19m/",
        "text": "[removed]",
        "created_utc": 1677041442,
        "upvote_ratio": 1.0
    },
    {
        "title": "I dream of getting a girl pregnant then eating the baby after it's born",
        "author": "misterfister4275",
        "url": "https://www.reddit.com/r/confession/comments/118of54/i_dream_of_getting_a_girl_pregnant_then_eating/",
        "text": "[removed]",
        "created_utc": 1677038744,
        "upvote_ratio": 1.0
    },
    {
        "title": "I used to constantly threaten to brutally murder my parents when I was a kid.",
        "author": "Menace_17",
        "url": "https://www.reddit.com/r/confession/comments/118odds/i_used_to_constantly_threaten_to_brutally_murder/",
        "text": "[removed]",
        "created_utc": 1677038592,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm deceiving my friends about who I really am and living a double life",
        "author": "throwawaydumbquestn",
        "url": "https://www.reddit.com/r/confession/comments/118o5to/im_deceiving_my_friends_about_who_i_really_am_and/",
        "text": "Context: I have two separate groups of friends. Group A and group B\n\nGroup B has been playing a certain wizard game a lot lately and they really love it (they're mostly all big book fans way back). So far I've just watched them play and it has looked really fun. More and more I find I can't contribute to our conversations as they are centered around this new game and I feel more and more left out.  \n\nI've avoided purchasing the game because I have mixed feelings over the current controversies surrounding it and I know that most members of group A would be very critical of me purchasing or playing the game. On top of all that I stream on Twitch and worry about alienating my audience. \n\nBecause of all this I have created a second online account in order to purchase and play the game so that I can involve myself in discussions with group B, scratch the itch of playing the game that I've watched them play, and avoid criticism while doing so.\n\n  I feel like I'm a huge fraud to both my community and Group A just so I can feel more involved with group B.",
        "created_utc": 1677037964,
        "upvote_ratio": 1.0
    },
    {
        "title": "Genuine question. Just looking for point of view from others",
        "author": "Savings_Goose8884",
        "url": "https://www.reddit.com/r/confession/comments/118o56n/genuine_question_just_looking_for_point_of_view/",
        "text": "[removed]",
        "created_utc": 1677037908,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why me? Why do really bad things seem to happen to me? I want to die but I just can’t.",
        "author": "480-886-1695",
        "url": "https://www.reddit.com/r/confession/comments/118nwe4/why_me_why_do_really_bad_things_seem_to_happen_to/",
        "text": "[removed]",
        "created_utc": 1677037130,
        "upvote_ratio": 1.0
    },
    {
        "title": "my grandma used to abuse my mom and our family hates her.",
        "author": "confetticannonu",
        "url": "https://www.reddit.com/r/confession/comments/118nt6u/my_grandma_used_to_abuse_my_mom_and_our_family/",
        "text": "[removed]",
        "created_utc": 1677036856,
        "upvote_ratio": 1.0
    },
    {
        "title": "i accidently killed someone a very long time ago..",
        "author": "guiltymind2",
        "url": "https://www.reddit.com/r/confession/comments/118nswv/i_accidently_killed_someone_a_very_long_time_ago/",
        "text": "[removed]",
        "created_utc": 1677036832,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have fantasies about beating up my adult brother",
        "author": "Realistic_Lecture_17",
        "url": "https://www.reddit.com/r/confession/comments/118nqjw/i_have_fantasies_about_beating_up_my_adult_brother/",
        "text": "[removed]",
        "created_utc": 1677036641,
        "upvote_ratio": 1.0
    },
    {
        "title": "I had sex with your mother…………………………………………………………….",
        "author": "circular_bridge",
        "url": "https://www.reddit.com/r/confession/comments/118nnyj/i_had_sex_with_your_mother/",
        "text": "[removed]",
        "created_utc": 1677036426,
        "upvote_ratio": 1.0
    },
    {
        "title": "I accidently stole money for charity and purchased my first electric guitar with the money",
        "author": "Needleworker-Hungry",
        "url": "https://www.reddit.com/r/confession/comments/118njoq/i_accidently_stole_money_for_charity_and/",
        "text": "When I was in high school we had different houses (For context - similar to the houses in Harry Potter - I'm not sure if they have houses in the USA) and my house (Woodward) was doing a charity drive by selling chocolates. Each student was given a box of chocolates (Mine were Caramello Koalas - (Australias Best)) and we had to sell each chocolate for what I think was $2.50 AUD. I think there was bout 40 Caramella Koalas in the box, so the total would be $369 AUD if I sold all the chocolates. All the profits were supposed to go to a Charity, but as this was in 2010, I can't remember exactly what the charity was but I have a suspicion it was something related to cancer. \n\nAnyway, you were supposed to go out door knocking selling these chocolate, (similar to what the girl scouts did with their cookies), and that's exactly what I did. I lived in a pretty nice neighbourhood, so I was quick to sell all my chocolates. After eating some I made about $350 AUD in total and within the first week. The problem was, we had a time frame of about 2 months. \n\nI stored all the money in an envelope and put it in the top shelf of my locker - and that's where it was forgotten. I'm not sure why but I missed any reminder to bring in the profits from the chocolates (genuinely not intentially) I think it was during exams and I was head down bum up with my studies. \n\nMonths past, and it was the end of the year and we were doing locker clean outs. I was cleaning out, shelf by shelf from bottom to top. I got to the top shelf and the first thing that I grabbed was a weighted envelope. The envelope with all the money from the chocolate drive in it. Straight away, I panicked becuase I was shocked that I completely forgot to hand the money it. I was too scared to hand the money in as I thought I was going to be accused to stealing so I shoved it in my bag and took it home. \n\nFor a while prior, I was looking to purchase an electric guitar. One of my friends was selling a Fender Squire Stratocaster with an amp for $300 AUD dollars. I talked to him and just agreed to the price, but told told him to say that he sold it to me for $50 if any one asked - he agreed,  just so I could avoid any suspicion as to where I got $300, my parents included. So I got rid of the evidence with a guitar and amp that my friend sold me for '$50'. \n\nTo this day, I have a huge passion in music. I've got a degree in Music and now work in the non for profit sector. I'm happy to know that a lot of charities are bs but I know it doesn't excuse it, and, that there are some incredibly good charities including Cancer Council etc. I've done community work over the years as well to balance the karma, but that's up to fate now. \n\nTL:DR - I accidently stole money that was supposed to go to charity and purchased an electric guitar &amp; amp.",
        "created_utc": 1677036053,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hola !! Pregunta seria…. ¿Que se siente tener hermanos ?",
        "author": "Yarqueen11",
        "url": "https://www.reddit.com/r/confession/comments/118njcm/hola_pregunta_seria_que_se_siente_tener_hermanos/",
        "text": "[removed]",
        "created_utc": 1677036021,
        "upvote_ratio": 1.0
    },
    {
        "title": "I accidently killed someone a very long time ago, and it haunts me ever since.",
        "author": "guiltymind2",
        "url": "https://www.reddit.com/r/confession/comments/118ninm/i_accidently_killed_someone_a_very_long_time_ago/",
        "text": "[removed]",
        "created_utc": 1677035966,
        "upvote_ratio": 1.0
    },
    {
        "title": "I honestly hate who I am…so many poor decisions. I know I won’t change though.",
        "author": "Damn_sexy_4_me",
        "url": "https://www.reddit.com/r/confession/comments/118neua/i_honestly_hate_who_i_amso_many_poor_decisions_i/",
        "text": "[removed]",
        "created_utc": 1677035657,
        "upvote_ratio": 1.0
    },
    {
        "title": "I accidently killed someone a very long time ago..",
        "author": "guiltymind2",
        "url": "https://www.reddit.com/r/confession/comments/118na72/i_accidently_killed_someone_a_very_long_time_ago/",
        "text": "[removed]",
        "created_utc": 1677035277,
        "upvote_ratio": 1.0
    },
    {
        "title": "Met a guy that I like while i was on a date with other guy. Few days later matched with guy I like on tinder",
        "author": "Sad_Egg6",
        "url": "https://www.reddit.com/r/confession/comments/118n710/met_a_guy_that_i_like_while_i_was_on_a_date_with/",
        "text": "[removed]",
        "created_utc": 1677035017,
        "upvote_ratio": 1.0
    },
    {
        "title": "i accidently killed someone a very long time ago..",
        "author": "guiltymind2",
        "url": "https://www.reddit.com/r/confession/comments/118n6cq/i_accidently_killed_someone_a_very_long_time_ago/",
        "text": "[removed]",
        "created_utc": 1677034959,
        "upvote_ratio": 1.0
    },
    {
        "title": "I accidently killed someone a very long time ago..",
        "author": "guiltymind2",
        "url": "https://www.reddit.com/r/confession/comments/118n4x8/i_accidently_killed_someone_a_very_long_time_ago/",
        "text": "[removed]",
        "created_utc": 1677034849,
        "upvote_ratio": 1.0
    },
    {
        "title": "I accidently killed someone a very long time ago and it still haunts me to this day.",
        "author": "guiltymind2",
        "url": "https://www.reddit.com/r/confession/comments/118n2o9/i_accidently_killed_someone_a_very_long_time_ago/",
        "text": "[removed]",
        "created_utc": 1677034669,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m secretly judging my partner for one of his past relationships",
        "author": "throwaway4mywhoadie",
        "url": "https://www.reddit.com/r/confession/comments/118mcqz/im_secretly_judging_my_partner_for_one_of_his/",
        "text": "[removed]",
        "created_utc": 1677032540,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I [27F] come to terms with this about them [28M] without feeling inadequate and put off?",
        "author": "ThrowRAonenotif",
        "url": "https://www.reddit.com/r/confession/comments/118m852/how_do_i_27f_come_to_terms_with_this_about_them/",
        "text": "[removed]",
        "created_utc": 1677032174,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m not a good person and i don’t care that i’m not",
        "author": "IllNecessary6117",
        "url": "https://www.reddit.com/r/confession/comments/118ltrl/im_not_a_good_person_and_i_dont_care_that_im_not/",
        "text": "[removed]",
        "created_utc": 1677031058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I geek out over boys all the time ?????????",
        "author": "jelly03290380",
        "url": "https://www.reddit.com/r/confession/comments/118lnqs/why_do_i_geek_out_over_boys_all_the_time/",
        "text": "[removed]",
        "created_utc": 1677030565,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've been having homicidal thoughts for some time now",
        "author": "underdog430",
        "url": "https://www.reddit.com/r/confession/comments/118l7cg/ive_been_having_homicidal_thoughts_for_some_time/",
        "text": "[removed]",
        "created_utc": 1677029255,
        "upvote_ratio": 1.0
    },
    {
        "title": "I shat in the sink at work because we don’t have a toilet",
        "author": "Upstairsman156",
        "url": "https://www.reddit.com/r/confession/comments/118kwmp/i_shat_in_the_sink_at_work_because_we_dont_have_a/",
        "text": "[removed]",
        "created_utc": 1677028416,
        "upvote_ratio": 1.0
    },
    {
        "title": "One time in grade school, probably like 3rd grade, I got off the bus and stole this little preschool girls hood and stomped it in the mud.",
        "author": "MyMindIsAMuffler",
        "url": "https://www.reddit.com/r/confession/comments/118kpfo/one_time_in_grade_school_probably_like_3rd_grade/",
        "text": "[removed]",
        "created_utc": 1677027852,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a confession to make. I really don't have any motivation in posting other than being set-serving.",
        "author": "kayaker51",
        "url": "https://www.reddit.com/r/confession/comments/118kmxz/i_have_a_confession_to_make_i_really_dont_have/",
        "text": "[removed]",
        "created_utc": 1677027676,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mí mejor amigo no sabe que soy chico y que él me gusta",
        "author": "Nickarel",
        "url": "https://www.reddit.com/r/confession/comments/118kldf/mí_mejor_amigo_no_sabe_que_soy_chico_y_que_él_me/",
        "text": "No piensen mal de mí, todo empezó de la nada gracias a un juego, antes de conocerlo me habían hackeado la cuenta y al recuperarla, el Nick había sido cambiado al de una chica. \nNo sabía que hacer, ya que solo se podía cambiar una vez el nombre y esa persona misteriosa me quitó la posibilidad. Aún así, continué usando esa cuenta ya que había tenido mucho progreso como para borrarla y empezar de nuevo.\n\nEl caso es que un día me encontré con él en una partida, empezamos a charlar y todo, él era muy buen jugador por lo que terminamos haciéndonos amigos en el juego y más tarde, también en la vida real (va, virtual). Nosotros actualmente tenemos 21 años y yo 17. La situación se salió de control cuando me di cuenta que había pasado un año y no le había dicho que era un chico, y empezó la pandemia... Tuve muchos problemas a causa de eso y el también, y juntos nos apoyamos para sentirnos mejor, él se terminó convirtiendo en alguien más que vital en mí vida y yo creo que el se siente igual... Lo malo es que me enamoré, aún con la distancia solo me enamoré... Y él para no hacerme sentir mal me mintió diciendo que sintió lo mismo.\n\nMe enteré de que todo era mentira hace un mes, cuando él me dijo que conoció a una compañera de trabajo la cual le gustaba... No sabía cómo sentirme, sé que yo tengo un secreto también y que obviamente no íbamos a poder tener nada, es solo que de la nada me cayeron dos realidades a la cabeza y ahora solo siento muchas ganas de llorar.\n\nAdemás tengo un tumor en la cabeza y me queda un mes y nada... Eso me afectó mucho ya que me dan fuertes dolores de cabeza, cansancio y dolor físico, y los efectos irán empeorando con el tiempo. La única forma de salvarme será cuando me desmaye en la última semana, ya que según el doctor podrán hacerme una operación para salvarme temporalmente. \n\nNo sé, solo son muchas realidades de repente las cuales me están haciendo sentir para la mierda. Pero aún así, lo que más me importa es él, y no sé que hacer con lo que siento... \n\nDebería desaparecer de su vida? Debería morir? Decirle la verdad sé que acabará con nuestra relación y es lo último que quiero, que me recuerde de una manera en la que solo me mire con odio. Solo desearía poder pasar este mes lo más rápido posible... Quizás si muero sería lo mejor? Necesito ayuda la verdad...",
        "created_utc": 1677027565,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Have a Confession: I am Posting to Try to Get People to Join my New Group",
        "author": "kayaker51",
        "url": "https://www.reddit.com/r/confession/comments/118kkik/i_have_a_confession_i_am_posting_to_try_to_get/",
        "text": "[removed]",
        "created_utc": 1677027495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can’t stop thinking about someone other than my husband",
        "author": "throwaway_85789",
        "url": "https://www.reddit.com/r/confession/comments/118kkd7/cant_stop_thinking_about_someone_other_than_my/",
        "text": "[removed]",
        "created_utc": 1677027483,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've(19f) been sleeping with my cousin(19m) for the last couple days",
        "author": "throwaway22881199",
        "url": "https://www.reddit.com/r/confession/comments/118kk5q/ive19f_been_sleeping_with_my_cousin19m_for_the/",
        "text": "[removed]",
        "created_utc": 1677027465,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please, I need my friends to stop being such motherfuckers.",
        "author": "Responsible_Bug4310",
        "url": "https://www.reddit.com/r/confession/comments/118kegp/please_i_need_my_friends_to_stop_being_such/",
        "text": "Doesn't it happen to you that you are in a group of 2 or 3 friends? And that after those 2 or 3 friends one more person arrives? well, it just happened to me a few weeks ago, but I'm already getting tired,They always ignore me, they no longer have fun with me, and now they prefer the other and leave me aside!? It's not the same anymore, I need to separate from my group and look for others.",
        "created_utc": 1677027024,
        "upvote_ratio": 1.0
    },
    {
        "title": "I shat in the Sink at work because we dont really have a toilet",
        "author": "Upstairsman156",
        "url": "https://www.reddit.com/r/confession/comments/118kecw/i_shat_in_the_sink_at_work_because_we_dont_really/",
        "text": "[removed]",
        "created_utc": 1677027017,
        "upvote_ratio": 1.0
    },
    {
        "title": "i got the highest score in my class without doing the assignment",
        "author": "witheriteMoth",
        "url": "https://www.reddit.com/r/confession/comments/118jvrd/i_got_the_highest_score_in_my_class_without_doing/",
        "text": "In my last year of middleschool we all had to write a paper and present it. So we all picked our subjects and started our research. There were minor deadlines throughout the year to make sure everyone was on track, but like, they know i’m not great with deadlines because of my ADD so they weren’t too strict. They were mote like guidelines. Every once in a while i’d get the “hey, remember to hand in what you have written so far!” but nothing more.\nThey told us we would get approximately 60% of the points from the paper and 40% from the presentation. Now i researched my topic just as thoroughly as everyone else, and put in my effort to make the presentation look nice and be good and contain all the info, so i was sure i had that 40% in the pocket. Whenever my friends or teachers would ask me about the paper itself tho, I would give them a vague answer or change the subject.\nSo at the end of the year, the time comes where our papers get graded and everyone gets their points. In my friendgroup we often shared scores to make sure we all get grades fairly, so everyone shared their individual percentages and… I had the highest score…\nI feel kinda guilty, they put in all that hard work, like they actualy went for in, put in so much effort, their papers were 25-30 pages long, which is incredible, only to get like 64% or 53%, meanwhile i got compliments left, right and center, got a 92%, and i never told anyone…\n\n…I never wrote a single word of that paper.",
        "created_utc": 1677025589,
        "upvote_ratio": 1.0
    },
    {
        "title": "I broke his heart which broke mine. and now it's all gone. now all that's left to do is wait until I can fly free.",
        "author": "VivreVoyager",
        "url": "https://www.reddit.com/r/confession/comments/118jtgh/i_broke_his_heart_which_broke_mine_and_now_its/",
        "text": "I'm on automatic mode. Everyday. I just wake up and go through the motions. I don't feel anymore. Even though I'm the one that left him in a round about way. It feels like he left me. \n\nI'm just waiting for the time until I can leave and be free. Even if I'm alone, I can be free.",
        "created_utc": 1677025415,
        "upvote_ratio": 1.0
    },
    {
        "title": "When my alcohol problem was bad, I secretly bought vanilla/lemon extract and forced myself to drink them.",
        "author": "Upbeat_Pumpkin_6445",
        "url": "https://www.reddit.com/r/confession/comments/118jtbm/when_my_alcohol_problem_was_bad_i_secretly_bought/",
        "text": "[removed]",
        "created_utc": 1677025406,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im living out my life to its fullest because I plan on killing myself this year.",
        "author": "Black_Shabbat92",
        "url": "https://www.reddit.com/r/confession/comments/118jqgj/im_living_out_my_life_to_its_fullest_because_i/",
        "text": "[removed]",
        "created_utc": 1677025197,
        "upvote_ratio": 1.0
    },
    {
        "title": "When I tell my gf I want sex I don’t actually I just want to be near her",
        "author": "ThrowRAfiftytwo",
        "url": "https://www.reddit.com/r/confession/comments/118jq60/when_i_tell_my_gf_i_want_sex_i_dont_actually_i/",
        "text": "[removed]",
        "created_utc": 1677025174,
        "upvote_ratio": 1.0
    },
    {
        "title": "slut wife who here likes to swing or other things .. do yall feel guilty at all about it?? how often do yall do this and why?.. also how did yall get started",
        "author": "AlternativeVast4704",
        "url": "https://www.reddit.com/r/confession/comments/118jo01/slut_wife_who_here_likes_to_swing_or_other_things/",
        "text": "[removed]",
        "created_utc": 1677025015,
        "upvote_ratio": 1.0
    },
    {
        "title": "I secretly hate every single one of my friends and I don't know how much time I have until I just tell them",
        "author": "LeffyZ",
        "url": "https://www.reddit.com/r/confession/comments/118jmdd/i_secretly_hate_every_single_one_of_my_friends/",
        "text": "[removed]",
        "created_utc": 1677024897,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've(19f) been sharing a bed with my cousin(19m) for the last couple days and I like it",
        "author": "throwaway22881199",
        "url": "https://www.reddit.com/r/confession/comments/118jc2h/ive19f_been_sharing_a_bed_with_my_cousin19m_for/",
        "text": "[removed]",
        "created_utc": 1677024139,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it Justifiable for me to Want my Father to Die?",
        "author": "burn3racc0un7_",
        "url": "https://www.reddit.com/r/confession/comments/118j83d/is_it_justifiable_for_me_to_want_my_father_to_die/",
        "text": "[removed]",
        "created_utc": 1677023868,
        "upvote_ratio": 1.0
    },
    {
        "title": "I fell pregnant at seventeen,and never felt more lost and alone.",
        "author": "Losttmoose",
        "url": "https://www.reddit.com/r/confession/comments/118j7hm/i_fell_pregnant_at_seventeenand_never_felt_more/",
        "text": "[removed]",
        "created_utc": 1677023824,
        "upvote_ratio": 1.0
    },
    {
        "title": "I took this girl I met to my house, we went to watch a movie in my room. I stood up on my bed to do something like an idiot and the fan smacked me in the head. We still had a good time",
        "author": "Zestyclose-Ad5966",
        "url": "https://www.reddit.com/r/confession/comments/118j382/i_took_this_girl_i_met_to_my_house_we_went_to/",
        "text": "[removed]",
        "created_utc": 1677023508,
        "upvote_ratio": 1.0
    },
    {
        "title": "I purposely play dumb to call out the Medical Assistants at my job",
        "author": "ZalCrimez",
        "url": "https://www.reddit.com/r/confession/comments/118ip9d/i_purposely_play_dumb_to_call_out_the_medical/",
        "text": "As of two weeks ago the MA's decided that two people in Billing working on records is better than 10 MA's. I have been overworked and have broken down at work multiples times from the stress of taking without exaggeration call after call. I have legit gotten 5 calls in a row, no break then had maybe 5 minutes of wrap up time to pull records from 4 YEARS OR MORE TO GOVERNMENT FACILITIES. Me and my manager now do the job of 10 people. \n\nWhy is this relevant? Well the MA's started being passive aggresive and started sending documents back with no comments that HAVE BEEN THOROUGHLY SORTED TO WHO SHOULD GET THEM. Mostly X-Ray Films that I legit can't get. So I started asking my manager \"Hey was I supposed to do this?\" I know I sound stupid but the anger in her eyes shows that they shouldn't be doing that shit. They are now sending me their dirty laundry and making me do their faxes WHICH I HAVE BEEN TOLD NOT TO DO AND SCOLDED. So I played dumb again. \"Am I supposed to do the MA's work and voicemails?\" She seemed pretty much done with the bullshit and asked for the emails that were sent to me. So now I'm stressed but relieved something is being done about everything. I feel bad cause as a once was MA ik the shit they get. What they are doing is deliberately being dickheads tho.",
        "created_utc": 1677022454,
        "upvote_ratio": 1.0
    },
    {
        "title": "My dad is bipolar, I mourned for him although he is alive",
        "author": "SweetActual6082",
        "url": "https://www.reddit.com/r/confession/comments/118i4mf/my_dad_is_bipolar_i_mourned_for_him_although_he/",
        "text": "[removed]",
        "created_utc": 1677021002,
        "upvote_ratio": 1.0
    },
    {
        "title": "I purposely lit myself on fire. (Self harm warning perhaps)",
        "author": "Parking-Start-9934",
        "url": "https://www.reddit.com/r/confession/comments/118i3zj/i_purposely_lit_myself_on_fire_self_harm_warning/",
        "text": "[removed]",
        "created_utc": 1677020957,
        "upvote_ratio": 1.0
    },
    {
        "title": "My dad is bipolar, I mourned for him although he is alive",
        "author": "SweetActual6082",
        "url": "https://www.reddit.com/r/confession/comments/118i2i7/my_dad_is_bipolar_i_mourned_for_him_although_he/",
        "text": "[removed]",
        "created_utc": 1677020848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mitos y verdades sobre emigrar a los Estados Unidos, es verdad que las mujeres guardan el dinero en su vagina cuando pasan por la frontera?",
        "author": "Juanitor_2131",
        "url": "https://www.reddit.com/r/confession/comments/118hvn1/mitos_y_verdades_sobre_emigrar_a_los_estados/",
        "text": "[removed]",
        "created_utc": 1677020403,
        "upvote_ratio": 1.0
    },
    {
        "title": "My “friend” went on a trip alone (with his mom) basically lied to us",
        "author": "Designer_Cost3463",
        "url": "https://www.reddit.com/r/confession/comments/118hut9/my_friend_went_on_a_trip_alone_with_his_mom/",
        "text": "So my so called friend, went on a solo trip. That’s what he told us. He tries to act cool and everything but it’s low-key lame(high key). He said he was going for a self treat. Believed it. Next day i was scrolling through tiktok and came across his moms’ tiktok.😶GORL and he was in it, clearly on the destination he said he was headed to. \n\nI just found it really dizzgosting for the need to lie for something as simple as that. Considering that it’s not the first time he’s lied to us about similar situations before but we ignored it but the way he was acting all self entitled was provoking\n\nAnd when i told one of my friends about it who is also very close to the said friend, he was unwilling to listen and said it’s nonsense and makes me sound like the bad for trying to make the friend look bad🤥\n\n\nAM I THE  🐴🕳️",
        "created_utc": 1677020345,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever committed to a decision you know you don’t want?",
        "author": "Probsdidnthappen23",
        "url": "https://www.reddit.com/r/confession/comments/118htyz/have_you_ever_committed_to_a_decision_you_know/",
        "text": "[removed]",
        "created_utc": 1677020286,
        "upvote_ratio": 1.0
    },
    {
        "title": "I tried to make the people at my school’s math table laugh by showing them a drink that was clearly a bottle of pee.",
        "author": "SoftAlmond",
        "url": "https://www.reddit.com/r/confession/comments/118h48z/i_tried_to_make_the_people_at_my_schools_math/",
        "text": "[removed]",
        "created_utc": 1677018543,
        "upvote_ratio": 1.0
    },
    {
        "title": "I tried to make the people at my school’s math table laugh by showing them a drink that was clearly a bottle of pee.",
        "author": "SoftAlmond",
        "url": "https://www.reddit.com/r/confession/comments/118h2ka/i_tried_to_make_the_people_at_my_schools_math/",
        "text": "[removed]",
        "created_utc": 1677018434,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm pretty sure I groomed someone, or at best was a total creep, and I feel awful",
        "author": "Electronic_Sample666",
        "url": "https://www.reddit.com/r/confession/comments/118gnoy/im_pretty_sure_i_groomed_someone_or_at_best_was_a/",
        "text": "[removed]",
        "created_utc": 1677017442,
        "upvote_ratio": 1.0
    },
    {
        "title": "I play videos on my phone while driving. I kinda need to in order not to get bored.",
        "author": "IDislikeHomonyms",
        "url": "https://www.reddit.com/r/confession/comments/118gjkg/i_play_videos_on_my_phone_while_driving_i_kinda/",
        "text": "[removed]",
        "created_utc": 1677017170,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m personally seeking a submissive slave so tell me your name,age location and more about yourself if you are interested…?? Kindly text on this apps snap:goddess_jessy11 Kik :mistressjessica21. Hangout:goddessj283@gmail.com",
        "author": "RGoddess_Jesy5374",
        "url": "https://www.reddit.com/r/confession/comments/118gfd6/im_personally_seeking_a_submissive_slave_so_tell/",
        "text": "[removed]",
        "created_utc": 1677016889,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you/someone you know ever accidentally killed a pet as a child?",
        "author": "Paletyphoondestiny",
        "url": "https://www.reddit.com/r/confession/comments/118g8ld/have_yousomeone_you_know_ever_accidentally_killed/",
        "text": "[removed]",
        "created_utc": 1677016450,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I the only one who thought that when a couple gets married,",
        "author": "AAA6925",
        "url": "https://www.reddit.com/r/confession/comments/118g3as/am_i_the_only_one_who_thought_that_when_a_couple/",
        "text": "[removed]",
        "created_utc": 1677016090,
        "upvote_ratio": 1.0
    },
    {
        "title": "My stupid Drunken antics on Reddit after dark (yes I'm embarrassed)",
        "author": "Y0rk5qh1relad",
        "url": "https://www.reddit.com/r/confession/comments/118g2lc/my_stupid_drunken_antics_on_reddit_after_dark_yes/",
        "text": "[removed]",
        "created_utc": 1677016045,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm depressed because of my ill mannered friends I'm going to cut them off",
        "author": "throwaway88880766",
        "url": "https://www.reddit.com/r/confession/comments/118g1eu/im_depressed_because_of_my_ill_mannered_friends/",
        "text": "[removed]",
        "created_utc": 1677015961,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got tboned in a car accident a few hours after getting high, now I'm scared that I wont be able to trust myself again to drive and still have weed in my life",
        "author": "InternationalMaize51",
        "url": "https://www.reddit.com/r/confession/comments/118fpv3/got_tboned_in_a_car_accident_a_few_hours_after/",
        "text": "[removed]",
        "created_utc": 1677015209,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got tboned in a car accident a few hours after getting high, now I'm scared that I wont be able to trust myself again to drive and still have weed in my life",
        "author": "InternationalMaize51",
        "url": "https://www.reddit.com/r/confession/comments/118fo9m/got_tboned_in_a_car_accident_a_few_hours_after/",
        "text": "[removed]",
        "created_utc": 1677015100,
        "upvote_ratio": 1.0
    },
    {
        "title": "I stole my grandmas phone when I was younger and the guilt was horrific.",
        "author": "_Mud_Boi_",
        "url": "https://www.reddit.com/r/confession/comments/118ees9/i_stole_my_grandmas_phone_when_i_was_younger_and/",
        "text": "So I'm 15M at the current moment but when I was a kid I had real sticky hands, I never stole from anyone other than direct relatives (grandparents included) But when I saw something I wanted, I went for it. \n\nMy most absolute recent is when I was 12. My mother (33F currently) was never big on letting me have social media, but she just kept leaving openings which I jumped straight through. For instance, my grandma (68F) had two phones, one of which she let me use for my games. Up until a while before the grand theft, I had been using her phone for social media, Instagram, Tik Tok, etc. But when they found out, they were pissed. I could have been dying and needing to call 911 and they wouldn't let me touch that phone. But before they took it away my grandma had offered to give me the phone since she didn't use it anyways. After they took it, I knew exactly where that thing was.\n\nThe theft itself wasn't planned, or even thought of before the incident, I was sitting in my grandma's bedroom when I thought of it. I got up from my spot on her bed, and went over to the bathroom. I open the first drawer and BAM the phone's sitting there. I smuggled that thing all the way back to my house.\n\nPost theft I was real sneaky about it, only used Snapchat or Tik Tok when I knew everyone was asleep, only posting things like music or edits, never giving any indication it was me. But the guilt was too much, the stress of hiding the phone eating away at me. So when my mother was out of the house, I went into the woods by our home and I buried that phone like a corpse. As far as I'm aware, the phone is sitting underground by a fallen over tree. \n\nSure I've wanted to go back to the phone since but I haven't. \n\nMoral of the story, theft will give you horrible stress unless you're a psychopath to the point you can feel whatever you took watching you through every pile of dirt and wood between you.",
        "created_utc": 1677012012,
        "upvote_ratio": 1.0
    },
    {
        "title": "I like to talk to women on tinder and plan a date or meetup, and ghost/unmatch last minute.",
        "author": "WHammu2023",
        "url": "https://www.reddit.com/r/confession/comments/118eaff/i_like_to_talk_to_women_on_tinder_and_plan_a_date/",
        "text": "[removed]",
        "created_utc": 1677011638,
        "upvote_ratio": 1.0
    },
    {
        "title": "A school assignment made me realize how much my exfriends are unmanneredly",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677011113,
        "upvote_ratio": 1.0
    },
    {
        "title": "How I Fell In Love With The Class Hamster And How It Ended",
        "author": "TrulyFuse",
        "url": "https://www.reddit.com/r/confession/comments/118e2ds/how_i_fell_in_love_with_the_class_hamster_and_how/",
        "text": "[removed]",
        "created_utc": 1677011057,
        "upvote_ratio": 1.0
    },
    {
        "title": "I failed a lot of modules but my parents doesn’t know",
        "author": "Trying-to-get-life97",
        "url": "https://www.reddit.com/r/confession/comments/118e25f/i_failed_a_lot_of_modules_but_my_parents_doesnt/",
        "text": "[removed]",
        "created_utc": 1677011041,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have said “prawn” as “porn” so so so many times....it’s embarrassing",
        "author": "Due_Winner_2026",
        "url": "https://www.reddit.com/r/confession/comments/118e07q/i_have_said_prawn_as_porn_so_so_so_many_timesits/",
        "text": "[removed]",
        "created_utc": 1677010911,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve shared naked photos of my wife without her permission",
        "author": "Additional-Low9228",
        "url": "https://www.reddit.com/r/confession/comments/118dewg/ive_shared_naked_photos_of_my_wife_without_her/",
        "text": "[removed]",
        "created_utc": 1677009173,
        "upvote_ratio": 1.0
    },
    {
        "title": "Today, for the first time since I was nineteen, I cut myself.",
        "author": "thelovelyANON",
        "url": "https://www.reddit.com/r/confession/comments/118dcxv/today_for_the_first_time_since_i_was_nineteen_i/",
        "text": "[removed]",
        "created_utc": 1677008955,
        "upvote_ratio": 1.0
    },
    {
        "title": "I accidentally killed my hamster and I feel horrendous",
        "author": "justanotherfroaway",
        "url": "https://www.reddit.com/r/confession/comments/118ckkq/i_accidentally_killed_my_hamster_and_i_feel/",
        "text": "[removed]",
        "created_utc": 1677004626,
        "upvote_ratio": 1.0
    },
    {
        "title": "He has feelings for me and i don’t know what to do about it.",
        "author": "epicgameralexp",
        "url": "https://www.reddit.com/r/confession/comments/118cba3/he_has_feelings_for_me_and_i_dont_know_what_to_do/",
        "text": "[removed]",
        "created_utc": 1677003998,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wrongly accused and permanently embarrassed by prior job",
        "author": "Ambitious_Pen7404",
        "url": "https://www.reddit.com/r/confession/comments/118bgba/wrongly_accused_and_permanently_embarrassed_by/",
        "text": "[removed]",
        "created_utc": 1677001920,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I might have manipulated my friend and I don't know what to do",
        "author": "Nicotine_nico",
        "url": "https://www.reddit.com/r/confession/comments/118b01c/i_think_i_might_have_manipulated_my_friend_and_i/",
        "text": "[removed]",
        "created_utc": 1677000791,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel guilty from self harming myself by putting out a cigarette on my leg",
        "author": "Consistent_Impact543",
        "url": "https://www.reddit.com/r/confession/comments/118abl7/i_feel_guilty_from_self_harming_myself_by_putting/",
        "text": "[removed]",
        "created_utc": 1676999428,
        "upvote_ratio": 1.0
    },
    {
        "title": "I ruined my life by breaking up my household during a mental breakdown",
        "author": "i-suck-at-poetry",
        "url": "https://www.reddit.com/r/confession/comments/118a9ee/i_ruined_my_life_by_breaking_up_my_household/",
        "text": "[removed]",
        "created_utc": 1676999320,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (23M) am racist so I sleep with as many black women as possible",
        "author": "twconf",
        "url": "https://www.reddit.com/r/confession/comments/118a39i/i_23m_am_racist_so_i_sleep_with_as_many_black/",
        "text": "[removed]",
        "created_utc": 1676999014,
        "upvote_ratio": 1.0
    }
]