[
    {
        "title": "Building portfolio from real company projects vs from courses",
        "author": "crappy_dude01",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11afsc0/building_portfolio_from_real_company_projects_vs/",
        "text": "How is everyone putting together their portfolio (for early-level roles)--are your projects mainly from courses and personal interests?\n\nI'm thinking that working on projects from industry might look better on a resume, even if they are non paid, since they would more closely reflect real-world experience.\n\nThe goal is to become more competitive after doing online + bootcamp learning for entry SWE roles. I have some connections to industry so I may be able to source projects for experience.",
        "created_utc": 1677204823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it a bad idea to lie to your company about your location?",
        "author": "aiaiaaiiiii",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11afr7o/is_it_a_bad_idea_to_lie_to_your_company_about/",
        "text": "Ive been working at my full time job for over a year now and this week we received an email saying the company will make it mandatory for everyone to go in to the office. I’m considering telling them I will be moving to a nearby city so that I won’t have to go to the office. Is this a bad idea? What could go wrong? I never receive any mail or anything from the company, but just in case, I’ll give them a friend’s address so that even if they do it’s nbd. Is there anything I should be worried about?\n\nI’ll start looking for jobs, but it’s a tough market out there &amp; as a junior I don’t have very high hopes of getting a good offer. So I wanna stay here at least until I find the next job.",
        "created_utc": 1677204724,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confusion about career choice, I hate when I cannot focus on one thing. Please help",
        "author": "WarEfficient6980",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11afdmi/confusion_about_career_choice_i_hate_when_i/",
        "text": "[removed]",
        "created_utc": 1677203646,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I qualify for staff level position?",
        "author": "DueEntrepreneur3113",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11afair/do_i_qualify_for_staff_level_position/",
        "text": "I have 2 bachelors in CS + IT. Master in CS. PhD in Software Engineering all from top 100 universities in the major and 8 years of full stack software engineering experience all in the U.S. technology companies. Do I qualify for staff level positions in technology companies? \n\nWhat kind of knowledge / skills I will need for such roles?",
        "created_utc": 1677203392,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone left their job to start a company?",
        "author": "IamTheKingofCats",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11aeu4k/has_anyone_left_their_job_to_start_a_company/",
        "text": "I've had the idea in my head for awhile of starting a company and building my own products, but I've never really been sure where to start. I just wanted to float some questions out there to see if anyone has some experience with a startup venture.  \n\n\nQuestions:  \nAt what point did you leave your job to do your own work full-time (i.e. did you leave with an idea or did you leave with a functioning product)?  \nDid you go at it alone, or did you have partners?  \nHow did you go about acquiring capital to fund your work until you were able to sustain yourself?  \nHow much did you have in savings before you started your company?  \nHow long did your company last?  \nDo you regret it?",
        "created_utc": 1677202080,
        "upvote_ratio": 1.0
    },
    {
        "title": "Product Management Explained for Dummies",
        "author": "Smart-Reputation-397",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11aept8/product_management_explained_for_dummies/",
        "text": "[removed]",
        "created_utc": 1677201743,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help needed to prep for new grad program",
        "author": "hifiveprettyflyguy",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11aeotj/help_needed_to_prep_for_new_grad_program/",
        "text": "[removed]",
        "created_utc": 1677201667,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to figure out what's next.",
        "author": "cache0x24",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11aen3m/trying_to_figure_out_whats_next/",
        "text": "[removed]",
        "created_utc": 1677201541,
        "upvote_ratio": 1.0
    },
    {
        "title": "Banks like Chase/Capital One or some non-fang tech company like Oracle/Adobe",
        "author": "slipperysloppancakes",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11aembq/banks_like_chasecapital_one_or_some_nonfang_tech/",
        "text": "What would you prefer and why for the software engineering role?",
        "created_utc": 1677201482,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shady Offer Process",
        "author": "bryangators",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11aeg11/shady_offer_process/",
        "text": "I was offered an ok entry level salary by a large company. I countered with 10k higher understanding that it would probably not work out but it was worth a shot. The company then attempted to get me to meet in the middle but says it’s only a soft offer process and everything is subject to approval from CIO. \n\nI thought about their counter and thought I was accepting when I only get a response several days later that they can only do the original amount they offered. I was upset but understood. I then mistakenly several days later told them I would accept this offer of the original amount they came at me with. \n\nThen several days later the company comes back and says they can only do 5k below what they originally soft offered me. I was upset and thought it could have been the specific person I was dealing with so I asked to speak with a manager and they said that they only do soft offers and the CIO has to approve everything. I have never heard of a process like this. How can they just blindly offer people an amount like this. The person I dealt with was an in house recruiter. \n\nI was super excited to work with this company because it was a team and tech stack I was really excited about and it was full remote. \n\nAfter this I don’t want to work for them anymore. They include their bonus in the salary number they offer but the bonus is not guaranteed. It makes you think that they would be very stingy about bonuses after they have you locked in.",
        "created_utc": 1677201009,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me escape Brazil",
        "author": "bic_canetinha",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ae2p8/help_me_escape_brazil/",
        "text": "Hello,   as the title emplies i'm from Brazil, so as usual pardon my english,  mostof the academic terminology cant really e translated but i'll try to  explain differences i know from foreign systems, I'll also add the name  in portuguese for any fellow brazilians to understand easyerly.\n\nI'm  currently studying computer science, but not in a colllege, I'll point  out i am currenlty 15 going on 16, and on my summer vacation from the  first year of high school to the second (in brazil there are only 3  years). I started learning programming in 2020 with some C#, than  studied python for most of the time till i got good with flask and SQL,  learned C, JS and some React. After that i had to choose where i would  go to high school, I live in a city with a great Federal University, in  it there are what we call tech schools, basicaly you take the normal 3  years of high school but with classes from a different subject (in my  case computer science but there is also mechanics and electronics),  after the first 2 years you must complete 200 hours of internship in a  company either durring the third year or after you are done.\n\nThing  is I studied programming for about 2,5 years before I started this  school, I was familiar wtih Data Structures and Algorithms, Databases,  API and had been studying leetcode for a while, so i blazed trough  everything code related. But i was aware of the enviroment i was put  into, so i started doing research with teachers and got into projects  which would grant me challenging programming, nice academic resume and i  would start to get paid with a some scholarship, about 450 brl a month  or some 90 Usd i think. Also discovered that i could get a paid  internship before finishing my second year that would not count for my  200 hours but would still be good in a resume plus some 300 brl.\n\nYou  probably get where i am going with this, i would love to skip college,  plus i dont know how brazilian degrees are valued in the industry, i  dont think working in brazil as a software engineer is worth it, i would  like to get out of here, prefferably remote jobs but moving would also  be great, college takes a lot of time plus i would deppend on my grades  in ENEM wich is the national high school exam that tests for all normal  high school subjects wich due to the nature of my school i am not as  well prepared.\n\nI need advice on  what to do from here, do i focus on my resume and try to get out with 18  years,and technical degree but not a college one, some teacher  recomendations and a dream, or do i hard study for ENEM and try to get a  degree from a good collage?\n\nJust  to add my school is CTISM and it is part of a collage called UFSM, tho  if i had to get a collage degree i would prefer UFRGS",
        "created_utc": 1677199954,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me escape Brazil",
        "author": "Plenty-Reward-5314",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ae0fy/help_me_escape_brazil/",
        "text": "[removed]",
        "created_utc": 1677199776,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do some people insist on writing cover letters if they're optional?",
        "author": "Seankala",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11adnqc/why_do_some_people_insist_on_writing_cover/",
        "text": "I feel like a lot of people treat it as some sort of \"showing your dedication to the company\" but wouldn't past experience and skills be much more relevant? I've personally never written a cover letter if it's optional, and if a company actually required a cover letter then I probably wouldn't even apply.\n\nI also hear a lot of hiring managers or recruiters say that \"a cover letter helps you stand out,\" but I've personally never saw anyone around me have a cover letter do that for them. So now I'm confused.\n\nDo cover letters actually help?",
        "created_utc": 1677198776,
        "upvote_ratio": 1.0
    },
    {
        "title": "Comm w stakeholders",
        "author": "Pitiful-Round5612",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11addad/comm_w_stakeholders/",
        "text": "[removed]",
        "created_utc": 1677197991,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have salaries gone down recently for new positions?",
        "author": "CS_throwaway_DE",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11acub7/have_salaries_gone_down_recently_for_new_positions/",
        "text": "In 2020 I was hired with 0 YoE for 89k TC.\n\nIn 2022 I was hired with \\~2 YoE for 130k TC.\n\nNow I was laid off and am struggling to find jobs willing to pay even 100k, let alone what I think I am worth in the market.. \\~110k. Most jobs I am finding for my experience (2.5) want to pay 80-90k. I feel like that is exploitative and not competitive with the market of last year... and these low rates are AFTER the 10-11% inflation of last year, so they're even worse than they look.\n\nAre my expectations too high/unrealistic?? What is a fair rate in a MCoL area?",
        "created_utc": 1677196610,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have salaries for new positions gone down recently?",
        "author": "CS_throwaway_DE",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11acrkv/have_salaries_for_new_positions_gone_down_recently/",
        "text": "Here is my employment history:\n\nIn 2020 I was hired as a Data Engineer with 0 years of experience for 84k base with 5k bonus\n\n|Year|Base|Bonus|Total|\n|:-|:-|:-|\n|2020|84k|5k|89k|\n|2022|118k|12k|130k|\n\nRight now I am struggling to find any jobs willing to pay even 100k for my years of experience (2.5). I keep getting told that my salary expectations are unrealistic/too high. Am I going crazy??",
        "created_utc": 1677196403,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you think linguistics &amp; CS major?",
        "author": "chickgame",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11acits/how_do_you_think_linguistics_cs_major/",
        "text": "[removed]",
        "created_utc": 1677195746,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you think Linguistics&amp;CS major?",
        "author": "chickgame",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11acigd/how_do_you_think_linguisticscs_major/",
        "text": "[removed]",
        "created_utc": 1677195715,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having an intervuer who may have a thick accent",
        "author": "cprogrammingcgrades",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11acgoj/having_an_intervuer_who_may_have_a_thick_accent/",
        "text": "I dont want to sound racist (which i probably will), but what's your take on having an interviewer who may be hard to understand?\n\nI only have one shot at this job and I want to take whatever precautions I can. If there is miscommunication between us that would suck.",
        "created_utc": 1677195586,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having an interviewer who may have accent",
        "author": "cprogrammingcgrades",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11acfjk/having_an_interviewer_who_may_have_accent/",
        "text": "[removed]",
        "created_utc": 1677195501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choosing between a small service-based and a big product-based company as a junior dev",
        "author": "too-many-words",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11abswc/choosing_between_a_small_servicebased_and_a_big/",
        "text": "I've just started my career as a developer. I'll potentially have 2 offers from 2 different companies. With the smaller company, I'll be working on multiple small projects with different tech stacks. For the bigger one, I'll be working on 1 part of their product with a fixed stack. I think I'll have more things to add on my CV with the small company but a big company's name isn't so bad either. And the big company offers higher salary too. I'm very torn between them. What do you think would be the better option to start my career?",
        "created_utc": 1677193900,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to get back to home base?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677193664,
        "upvote_ratio": 1.0
    },
    {
        "title": "Senior Tech Consultant looking to transition to Engineering",
        "author": "Low-League-1264",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11abp6e/senior_tech_consultant_looking_to_transition_to/",
        "text": "Hey All,\n\nI’m currently a senior tech consultant at a mid size SaaS company and I’m trying to figure out a path to transition to engineering. \n\nI’m the only senior tech consultant at my company and by far the most experienced in our consulting practice. I’m usually working on full stack custom web apps for customers, mostly utilizing react/node/typescript and deploying to AWS or Azure. I’m also a product owner for a tool I built and that we sell to customers (has brought in ~1M in revenue in the 2 months since I released it). \n\nAll that being said, I know I’m clueless idiot compared to real developers and engineers. I find myself growing increasingly bored because there is nobody to challenge me or teach me or who knows more than me in this job. I watch “real” devs on youtube or twitch and it makes it painfully obvious how truly clueless I am in this profession. \n\nI also find myself caring less and less about building bespoke/basic full stack apps for customers where overall it’s just the blind leading the blind. \n\nWould love to hear some thoughts and perspectives on how to transition from the career I’m in to a more traditional software engineering position?\n\nWhen I look at job reqs I meet almost none of the length requirements typically because as a consultant I’ve never stayed in one stack or tech long enough to become an expert (TS is the longest rn at about 2 years). I’ve also never done a tech interview or learned data structures/algorithms because it was never needed for these jobs. I know how to code and  architect and build stuff, but I have almost none of the formal schooling or experience. \n\nWould love some perspectives or thoughts. Any and all help is very much appreciated!",
        "created_utc": 1677193638,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I get back to home base?",
        "author": "uno_reverse_please",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11abmgt/how_do_i_get_back_to_home_base/",
        "text": "[removed]",
        "created_utc": 1677193448,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need and want to make as much progress as possible in the next three years",
        "author": "Eldir8",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11abkoe/i_need_and_want_to_make_as_much_progress_as/",
        "text": "[removed]",
        "created_utc": 1677193322,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anxious of getting fired because I hardly have work to do",
        "author": "illjasmine",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11abdps/anxious_of_getting_fired_because_i_hardly_have/",
        "text": "[removed]",
        "created_utc": 1677192854,
        "upvote_ratio": 1.0
    },
    {
        "title": "Negative Feedback | Getting Work Done But No \"Chemistry\"",
        "author": "Artvandelay11434",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ab9wv/negative_feedback_getting_work_done_but_no/",
        "text": "Hey guys, I have been in the industry for quite a few years and with one company for about 6 years. But I was surprised a hear negative feedback from one of the clients. The feedback was although I get work done, I don't have any chemistry with the team, I am not asking questions and not proactive. I don't understand what does chemistry mean lol? \n\nI have to agree, I missed a couple of meetings since I lost track of time and I overslept for one. I apologized and never missed a meeting after. In terms of asking questions, for the work that was given, I ask pertinent questions and get it done. If I have bandwidth I ask for more work. I am not sure how else I can be more proactive here. \n\nI would greatly appreciate any input and suggestions. Many thanks!",
        "created_utc": 1677192596,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tech lead yelled at me, was this justified?",
        "author": "personluse",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11aazi8/tech_lead_yelled_at_me_was_this_justified/",
        "text": "About 2 weeks ago, the team members including me get a task for refactoring. I'm a junior dev (in the company for 6 months) and I do my best, put in some late hours, thought it would be worth it to learn stuff anyway. I had to go back and forth to get requirements to make sure I did everything right. I meet with some team members to see if what I had looked good. They made a few suggestions, I implemented those suggestions, I asked them again, they made a few more suggestions and I added them as well. By the end of it all, I was struggling with one clarification so I asked our tech lead. I couldn't get responses from anyone else the entire day since they are busy with their own stuff and we have offshore team members as well. I really have to push to meet with the team members most of the time. Anyways, tech lead says we can discuss it in the group code review tomorrow.  \n\nI show them everything I did, and the first thing he says was why is this not done, this was supposed to be simple. I told him that I needed clarifications on something and  that was what I was hoping to clarify today. He then told me that I had no other deliverables and I only had to focus on this so how were you able to fuck this up. I'm like what the fuck got into you? You were the one suggesting that we take it slow and we can discuss the refactoring assignments along the way. I finished the good majority of it the first few days, I just needed clarifications from other people on the team which took significantly longer to get responses from. He said that I need to focus on understanding the assignment more. I think, yeah bro, that's why Im here. I felt bad bothering my team members with some of the clarifications for implementing the refactoring so I never demanded that they had to meet with me or anything so it took a bit of time. \n\nOur tech lead is known to be a piece of shit and to have no filter, even in meetings with his manager and few managers above his manager, so I'd rather not bother him with his busy schedule anyway. I have no idea how he works here still or how there haven't been HR complaints against him.  But at the same time, I shouldn't have taken 2 weeks for this. No one should have to sit down with me to walk me through everything, so I'm a bit conflicted since he's not wrong really.",
        "created_utc": 1677191879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unsure / concerned of progress",
        "author": "Montez00",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11aavz6/unsure_concerned_of_progress/",
        "text": "I’m 6 months and some change into my first ever  job as Software Developer at a bank after graduating last Spring. I’d really say 5 because I spent the first month or so on Udemy, and then some time after looking at the codebase for various projects. However, I’ve gotten an overwhelming dose of imposter syndrome. I’ve been tasked to a project which has already been completed essentially by myself, of course with a lot of help from the senior dev here, as well as blocks from existing projects. I believe the project has come to the liking and requirements of those who tasked us with it. I also have worked on 2 smaller tasks which I completed successfully as well. Now currently, I’m tasked with creating a microservice for an already existing project using webhooks, serverless apps, and more. I feel like this is something that should’ve been completed long ago, and these things aren’t the most difficult to accomplish. Should I worry less about this? Especially considering what I already have done? This new task was given more like a “side mission”, as there have been talks about starting a new project soon. It’s just been overwhelming me a lot. Should this be something I should finish with ease considering the time I have spent here?",
        "created_utc": 1677191635,
        "upvote_ratio": 1.0
    },
    {
        "title": "Company pays for courses - Recommendations?",
        "author": "ThowEvery",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11aarb8/company_pays_for_courses_recommendations/",
        "text": "[removed]",
        "created_utc": 1677191327,
        "upvote_ratio": 1.0
    },
    {
        "title": "My school doesn’t require much math curriculum",
        "author": "imacfromthe321",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11aah1d/my_school_doesnt_require_much_math_curriculum/",
        "text": "So, I’m currently attending a small state school, about to graduate with my AA, after which I can move right into their software development bachelors. \n\nHowever, I’ve noticed that, past your 2 year, the bachelors program does not have math classes as part of the curriculum. I will be getting my AA with statistics as my highest level math class finished.\n\nWhat I’m curious about is whether this will be an issue for me when I staff working in the field? Or will I likely be learning the math side of things as I do my software development classes?",
        "created_utc": 1677190617,
        "upvote_ratio": 1.0
    },
    {
        "title": "Number of applicants to job postings seems very high suddenly",
        "author": "fromThe70s",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11aa651/number_of_applicants_to_job_postings_seems_very/",
        "text": "I am a lead and senior c++ developer looking for a new role. I've been browsing jobs on LinkedIn and noticed that most of the software engineering jobs have literally hundreds of applicants.  I don't recall that being the case 6 months ago.  Is this an industry trend - are there more applicants than jobs at this point?  Curious what others have seen or if any recruiters have any comments on the matter.",
        "created_utc": 1677189867,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal to hate your ‘customers’?",
        "author": "DaQueer_Jackson",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11aa5s2/is_it_normal_to_hate_your_customers/",
        "text": "[removed]",
        "created_utc": 1677189843,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to answer why I'm not going back to internship company (no return offer)?",
        "author": "PrototypicalPlantain",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a9xrw/how_to_answer_why_im_not_going_back_to_internship/",
        "text": "I worked at a company named after a long river in South America last summer and didn't get a return offer. I never had this problem before when I was applying to bigger companies, but for smaller companies I've been asked twice during phone screens why I am not going back, and what I didn't like about it.\n\nThe first time I was honest and gave a full recount of what I liked/how much I learned, but also explained why I didn't like it (office politics for my team and an every person for themselves mentality), the second time I diverted the question entirely and reframed it as to why I wanted to work for the company I'm interviewing for (it was a startup so I said how I wanted to experience working at a smaller company where you have a lot more ownership and breadth on what you can work on). Both times ended in rejection which was surprising for me because I haven't failed a phone screen since sophomore year.\n\nI was wondering how everyone would handle this question seeing that it's tripped me up twice. I am applying for new grad roles now btw",
        "created_utc": 1677189310,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to answer why I'm not going back to internship company (no return offer)?",
        "author": "totinking",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a9vyn/how_to_answer_why_im_not_going_back_to_internship/",
        "text": "[removed]",
        "created_utc": 1677189189,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it risky to work for a government contractor?",
        "author": "PuppyLand95",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a9oz2/is_it_risky_to_work_for_a_government_contractor/",
        "text": "I recently received a job offer from a government contractor. I currently work at a consulting company so it’s similar except the expectation is that we keep our jobs and pay while we are on the ‘bench’ (so when not currently allocated to any client for whatever reason). \n\nThis government contractor says their contracts generally last 4 years. What happens after the contract is up? I’m not familiar with this industry so I’m not sure how common it is to just get fired after the contract is up. Or is the contract renewed in most cases?",
        "created_utc": 1677188711,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recently graduated, previously \"worked\" 5 years in our family business, should I mention it?",
        "author": "42AnswerToEverything",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a9ga4/recently_graduated_previously_worked_5_years_in/",
        "text": " \n\nI've recently graduated, and have almost worked a year as a dev in two different companies.\n\nWhen I was finishing high school I started helping in the family business (we have a small school), I teached math &amp; physics to kids from 6th-9th grade, I also gave private tutoring. This wasn't a full time job nor a \"formal\" job, but got paid. Some years later I started to manage the social media, client contacts, basic accounting and did some simple A/B tests to improve our facebook ads performance. It was pretty simple stuff to be honest and worked less than 15 hours a week.\n\nIn total I \"worked\" there for 5 years.\n\nThis helped me to get my first job, but now that I'm getting more experience, should I still put that I \"worked\" for 5 years in a non CS related field before graduating? I'm concerned that recruiters could expect more \"senior\" experience from me after seeing 5 years of \"experience\" (I'm 24)",
        "created_utc": 1677188098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I put all my years working at my family business on my CV?",
        "author": "42AnswerToEverything",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a9c9j/should_i_put_all_my_years_working_at_my_family/",
        "text": "[removed]",
        "created_utc": 1677187824,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to answer why I'm not going back to Amazon (no return offer)?",
        "author": "totinking",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a9512/how_to_answer_why_im_not_going_back_to_amazon_no/",
        "text": "[removed]",
        "created_utc": 1677187314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Be IOS Developer or Backend Developer(Golang) in 2023?",
        "author": "Less_Camel_7252",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a8xzt/be_ios_developer_or_backend_developergolang_in/",
        "text": "[removed]",
        "created_utc": 1677186841,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accepting an offer at defense for lower pay new grad?",
        "author": "Artistic_Natural_190",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a8xua/accepting_an_offer_at_defense_for_lower_pay_new/",
        "text": "[removed]",
        "created_utc": 1677186830,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not sure what to do with my career. 5 years as a chemist, 2 years in applied math and now working as a consultant in Tech with AWS solutions arch cert..",
        "author": "dvlbrn89",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a8j8o/not_sure_what_to_do_with_my_career_5_years_as_a/",
        "text": "\nHey everyone, basically I’m at crossroads and I’m trying to talk out what I want to do. Currently I’m a consultant with the opportunity to work towards a job as a solutions architect (new company paid for the cert so I studied and passed- no real world experience yet) or a delivery engineer where I do almost no code or little code. I don’t much experience in Python or SQL. Before this I was a chemist at an oil and gas company and got a masters (old company paid for) in applied math with the hopes of going to a Data science role. Well, they ended up doing nothing with me so I left. Now I find myself unsure of where to progress. Tbh I’m not a big fan of coding, I’ve tried to some of it but it’s not very fun lol. Most of my work was using R and packages in R. I think this whole AWS route could be a good fit but I feel like I’m throwing away my experience as a chemist and my degree if I continue going down the solutions arch path so if I leave this job I’ll ironically be a “master” of nothing. Is there anything along the solutions arch/delivery engineer route that would actually benefit from having a science background or a statical math knowledge? Thanks!",
        "created_utc": 1677185859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not sure what to do with my career. 5 years as a chemist, w years in applied math and now working as a consultant in Tech with AWS solutions arch cert..",
        "author": "dvlbrn89",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a8gmx/not_sure_what_to_do_with_my_career_5_years_as_a/",
        "text": "\nHey everyone, basically I’m at crossroads and I’m trying to talk out what I want to do. Currently I’m a consultant with the opportunity to work towards a job as a solutions architect (new company paid for the cert so I studied and passed- no real world experience yet) or a delivery engineer where I do almost no code or little code. I don’t much experience in Python or SQL. Before this I was a chemist at an oil and gas company and got a masters (old company paid for) in applied math with the hopes of going to a Data science role. Well, they ended up doing nothing with me so I left. Now I find myself unsure of where to progress. Tbh I’m not a big fan of coding, I’ve tried to some of it but it’s not very fun lol. Most of my work was using R and packages in R. I think this whole AWS route could be a good fit but I feel like I’m throwing away my experience as a chemist and my degree if I continue going down the solutions arch path so if I leave this job I’ll ironically be a “master” of nothing. Is there anything along the solutions arch/delivery engineer route that would actually benefit from having a science background or a statical math knowledge? Thanks!",
        "created_utc": 1677185680,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not sure what to do with my career. MS in applied math, 5 years as a chemist and now working as a consultant in Tech with AWS solutions arch cert..",
        "author": "dvlbrn89",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a8dpd/not_sure_what_to_do_with_my_career_ms_in_applied/",
        "text": "[removed]",
        "created_utc": 1677185484,
        "upvote_ratio": 1.0
    },
    {
        "title": "CS New Grad: Worried about job market, does my current plan make sense?",
        "author": "Throwaway3543g59",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a8csm/cs_new_grad_worried_about_job_market_does_my/",
        "text": "Hello All,\n\nI'm a new CS graduate, and I just finished in December.  I'm currently in my late 20s and just trying to come up with a plan to take the job market and move forward.  I don't have an internship, and although I do have a project that I was satisfied enough to put on my resume, I don't feel like I'm prepared enough,  especially for this job market.  Currently, with the layoffs and the number of applicants applying for entry-level swe jobs, I feel like I need a plan to focus on to keep level headed. \n\nCurrently, I'm thinking of getting a part-time IT job for a few months and brushing up on the skills necessary to create competent projects with a mern stack. I have experience with Iat support but don't want to pigeonhole myself with only helpdesk jobs. I want to find an entry-level SWE job this year. I wasn't taught the MERN stack in my web development class, so I'm going to learn it using odin project and full stack open. I used odin project to study for my capstone class a few months ago, so now I'll just go back and finish it. \n\nHonestly, it's hard to make sense of what to do given the market and my skill set rn. I don't want to screw myself over and make the wrong move. Any feedback or advice would be appreciated because it feels a little overwhelming currently. \n\nThanks!",
        "created_utc": 1677185427,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I move to Java-world from JS-world to advance my career?",
        "author": "Minute_Green_2604",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a89f5/should_i_move_to_javaworld_from_jsworld_to/",
        "text": "[removed]",
        "created_utc": 1677185197,
        "upvote_ratio": 1.0
    },
    {
        "title": "Upcoming plans for Software Engineer endeavor -",
        "author": "Mcgurgs",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a7ye0/upcoming_plans_for_software_engineer_endeavor/",
        "text": " \n\nTLDR; Go to community college -&gt; coding boot camp -&gt; finish CS degree at 4-year university (24 y.o)\n\nHello everyone. I was looking for any feedback or advice for my plan for the upcoming months. I just got out of the military in July of 2022, and nothing IT related. I landed an IT job 4 days after I got home (tier 1 helpdesk), mainly for the experience and I needed a little extra income. It's been 7 months here, and I really like office work compared to manual labor. I find the ability to make much more money based on the knowledge fascinating in the IT field. I have been coding for a few months here, (last post, I posted a project if interested) I'm going through Python and common shit. I'm progressing nicely. Here is my plan for the next years to become a Software Developer:\n\nCommunity college for 2 years: out of state, get an associate in CS\n\nAfter completing my associate, I plan to do a coding bootcamp (14-18 weeks) with a military program called 'Vet-Tech'. - Fully paid\n\n4-year uni - After boot camp completion I'll go to Uni and I should be a coding madman by then. I hope to land nice Interns and an awesome gig once I complete this roadmap.\n\nAny advice on this plan? I'll be in Utah / a few hours away from San Diego, may relocate for Uni , may not. School and the coding boot camp are covered $ wise. I have income, and will not have to work. Shoot any advice/suggestions my way. ty",
        "created_utc": 1677184442,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please give me advice on what I should do with my life",
        "author": "lookinforadvice2020",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a7usp/please_give_me_advice_on_what_i_should_do_with_my/",
        "text": "I've questioned everything every step of the way, this isn't a resume review just looking for life advice, see the rest of my post here:  \n[https://docs.google.com/document/d/15TnFX8WkQ0msnUnncZ90hygHDwFo517XSiAgvzqDt8Q/edit?usp=sharing](https://docs.google.com/document/d/15TnFX8WkQ0msnUnncZ90hygHDwFo517XSiAgvzqDt8Q/edit?usp=sharing)\n\nAny advice appreciated",
        "created_utc": 1677184203,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should I do with my life? Adrenaline junkie looking for advice based on my resume and interests.",
        "author": "lookinforadvice2020",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a7qrd/what_should_i_do_with_my_life_adrenaline_junkie/",
        "text": "[removed]",
        "created_utc": 1677183916,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oracle vs. FA(A)NG Internship Offer",
        "author": "darthlaser5943",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a7prn/oracle_vs_faang_internship_offer/",
        "text": "[removed]",
        "created_utc": 1677183846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asking for for a raise at a startup after raising money?",
        "author": "gothamtengu",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a79ui/asking_for_for_a_raise_at_a_startup_after_raising/",
        "text": "[removed]",
        "created_utc": 1677182766,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will company rescind offer if I tell them that I need time?",
        "author": "DjFreshCut",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a753o/will_company_rescind_offer_if_i_tell_them_that_i/",
        "text": "[removed]",
        "created_utc": 1677182461,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m torn on whether I should change degrees or not",
        "author": "Suspicious-Run-4",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a70u3/im_torn_on_whether_i_should_change_degrees_or_not/",
        "text": "[removed]",
        "created_utc": 1677182175,
        "upvote_ratio": 1.0
    },
    {
        "title": "EU or US Masters in CS US Employer Preference (with US BS) for SWE/XR/Graphics roles?",
        "author": "danials0505",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a6etj/eu_or_us_masters_in_cs_us_employer_preference/",
        "text": "[removed]",
        "created_utc": 1677180668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does certificate from online platforms like Edex,Coursera ,udemy etc. matter?",
        "author": "Striking-Courage-182",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a6c1j/does_certificate_from_online_platforms_like/",
        "text": "So I am a student who is doing one of the courses from edex the courses content is free but for certificate I have to pay. So will it be worth it to play for these certificates.",
        "created_utc": 1677180480,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thinking on a change of company after 9 months on one.",
        "author": "Euriae",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a69y6/thinking_on_a_change_of_company_after_9_months_on/",
        "text": "But feeling like a mercenary.\n\nHi,\n\nI started as a salesforce developer two years ago gaining 14k. After a year moved to another one for 23k and now a company is offering me 35-40k doing the same.\n\nI am feeling like a mercenary, but having admin, dev1, 2 and app builder certification and winning 23k is a bit lacking. Also I have no news from my boss since 3 months ago (I am a consultant dev) so I am not sure if he’s going to raise my salary and if they do, how much.\n\nFor the company I am working to is ok and people are nice, except some of them that tries to make me be the guilty for their mistakes, sales people who wants their shitty problem solved and now, shouting at you, and after solving they are rhe nicest persons. Even some of them tries to call me while they ser I am on a meeting presenting lol not respectin that we use Jira for petitions. Also I have a lot of work. I am part of the developing team and also the one who communicates from my country to the rest of europe, so is a non-stop for this money I get.\n\nOn this new company I would win 15-17k more, but not sure how the enviroment will be (very important). Also the “he is a mercenary” or abandoning the team makes me feel a bit too bad for them. But a friend told me that everyone can be replaced, just decide your future. And yeah, is true, planning to have childs in 2-3 years with my gf and honestly more money would be great.\n\nThis looks like more like an off chest.",
        "created_utc": 1677180337,
        "upvote_ratio": 1.0
    },
    {
        "title": "Different email or same email for next program cycle?",
        "author": "BambooleanDev",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a67sn/different_email_or_same_email_for_next_program/",
        "text": "I recently applied and got rejected from JPM's ETSE program. I'm wondering if it matters whether I use the same email (which has a rejection on file in the job/careers portal) or a different email when applying for the next cohort date? \n\nI'm not talking about trying to bypass some cooldown period or apply to the same role multiple times with different emails (this is what I came across when trying to see if this question was already asked). The program is offered twice a year and if we didn't get in, we're encouraged to apply again for the next cohort as long as we still meet the requirements.\n\nIn general, I don't really think this should matter all that much, but I keep hearing mixed things from people I talk to so I figured I'd get Reddit's input.",
        "created_utc": 1677180183,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help. Transitioning from construction into Tech.",
        "author": "Eaton_Beaver_",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a62dt/help_transitioning_from_construction_into_tech/",
        "text": "I am currently in a boot camp right now. I am about 6 months in and recently fell behind to the point of no return. As much as I could probably catch up and barely hang on I would rather (maybe stupidly) pay again and sign up for the course again. I do not want to give up. I work 50-60 hours a week and have to put 20-30 into the boot camp. I am in the MIT xPRO full-stack MERN course and I do enjoy it.\n\nI'm here to get an idea of what YOU guys that are in the field would do if you could be in my shoes. I have the paid Codecademy courses and I have done the HTML, CSS, and Intro to JavaScript courses. I have started the course on React and advanced Javascript.\n\nThrough the course, I have learned a lot. I signed up for this course on my 30th birthday (in May), never before having opened a source code file. It has been a busy 8 months with a lot of learning but I am nowhere near where I need to be to enter a job in the industry.\n\nWhere I am now is I want to re-enroll. I have a bunch of notepads now. I just want to restart the learning and take more notes and get a better understanding of the fundamentals before drowning in all the noise.\n\nWhat would you do?",
        "created_utc": 1677179825,
        "upvote_ratio": 1.0
    },
    {
        "title": "New job misrepresented itself",
        "author": "iamremotenow",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a6269/new_job_misrepresented_itself/",
        "text": "When I interviewed for this company I clearly discussed about being on-call and having a work/life balance. They told me I would not need to be on call and that they respected your personal time.\n\nOf course, upon joining I find out time tracking is compulsory and 42 hrs/week are mandatory. Now, we are getting g pressure to work \"a couple\" of hours overtime. I was also told I need to be on call.\n\nI had an honest conversation about my feeling during the interview and I feel they purposely mislead me. I have only been here a few months. When told about overtime, and being on call, I voiced my concerns but the message is that I need to comply.\n\nWhat would you do?",
        "created_utc": 1677179810,
        "upvote_ratio": 1.0
    },
    {
        "title": "University job and project",
        "author": "JayaRobus",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a5uey/university_job_and_project/",
        "text": "I had no internships or tech job experiences the first two years of university because supporting myself through full time jobs was my main priority. Now as a junior soon to be senior I finally had time to apply to things, and I managed to land a part time, tech related job in the cyber security center for my university and I also managed to start working on a project, a team at my university are working on and plan to get funding for this summer.\n\nMy question is whether these two experiences will be enough to make my resume worthwhile post grad, because the contingency for the part time job is I stay at it for a year (because the job is not just tech related but program support related also). I also am unsure whether I’ll even get time to apply for other positions as well so this seems my best option but I am still kind of stressed because I feel like I fell short on internship experiences the past two years.\n\nFor additional context I also have many large projects I worked on in my free time while searching for tech internships so those will be on my resume as well post grad. I also believe I am a competent programmer/my leetcode skills are very above average.",
        "created_utc": 1677179270,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am interested in starting a career in IT, where should I begin?",
        "author": "cxpe15",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a5qtp/i_am_interested_in_starting_a_career_in_it_where/",
        "text": "Before I get barked at the read the FAQ, I did, and still have some curiosity in where to begin, as it all seems very daunting and technical to somebody with little to no experience.\n\nA commenter on another post recommended I buy the CompTIA All-In-One guide, and learn the book front to back to earn my A+ certification, and eventually land my first job in the field.\n\nIs there anything else I should be doing/learning as well? I have an interest in cyber security, and would like as many recommendations/suggestions as possible from experts in the field as possible. I'm aware the entry level field is rather saturated at the moment, but what field isn't these days?",
        "created_utc": 1677179040,
        "upvote_ratio": 1.0
    },
    {
        "title": "Machine Learning Internship Noob",
        "author": "Bartelo",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a5pn0/machine_learning_internship_noob/",
        "text": "My internship is extending me onto a machine learning project but I only really remember the tools not so much all of the math behind it all so I’m worried I’m not equipped for this. Should I I just run with it? Thanks!",
        "created_utc": 1677178957,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got my first raise is it good?",
        "author": "MysteriousFood6410",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a5oex/got_my_first_raise_is_it_good/",
        "text": "[removed]",
        "created_utc": 1677178885,
        "upvote_ratio": 1.0
    },
    {
        "title": "Masters in Computer Science or High Performance Computing",
        "author": "Constant_Net526",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a5fc0/masters_in_computer_science_or_high_performance/",
        "text": "[removed]",
        "created_utc": 1677178277,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does HackerRank exist??",
        "author": "smookyvett",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a5eyv/why_does_hackerrank_exist/",
        "text": "I have been thinking... all of us on here know that the hiring process is flawed. Nobody goes on the job and actually does LeetCode type questions. Why is this what we are tested on? Additionally, on the actual job it is quite common to use stackoverflow or to google answers. Why are we tested in a way that is nothing like the actual job we are trying to get? Wouldn't it make sense if HackerRank allowed people to use outside resources?",
        "created_utc": 1677178253,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thought I did well on the coding assessments but was told by my recruiter that I failed both",
        "author": "_she_her",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a5e3c/thought_i_did_well_on_the_coding_assessments_but/",
        "text": "A recruiter reached out to me on LinkedIn and sent my resume to a few quant trading firms. Two of them send me coding assessments after more than a month of waiting. Both coding assessments are hard than the ones I did at Big N, but I think I did well in them (I did enough LeetCode to know whether I used the optimal solution or not for each question). However, the recruiter still got back to me saying that I failed both of them.",
        "created_utc": 1677178195,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I hire someone to practice coding interviews?",
        "author": "Agitated_Ad_1108",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a5dnl/can_i_hire_someone_to_practice_coding_interviews/",
        "text": "[removed]",
        "created_utc": 1677178162,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me choose between giving 2 weeks notice OR wait for background check?",
        "author": "Outdoorsintherockies",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a4xh4/help_me_choose_between_giving_2_weeks_notice_or/",
        "text": "The company I just got hired onto is going through an acquisition and supposedly can't add any hires after March 13th. I got the offer and submitted background check / drug test yesterday. 2 weeks from tomorrow is March 10th. So if I was miraculously cleared today, I could do both. But that isn't likely, so which option is the least worst?\n\nMy current position has very low workload, easily covered by others. There will be minimal to none \"handoff\"",
        "created_utc": 1677177058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Programmer Analyst vs Software Engineer",
        "author": "heidhfgavsh",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a4uy8/programmer_analyst_vs_software_engineer/",
        "text": "[removed]",
        "created_utc": 1677176886,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get a job on tech industry without experience?",
        "author": "Other-Cartoonist6587",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a4rbt/how_to_get_a_job_on_tech_industry_without/",
        "text": "[removed]",
        "created_utc": 1677176637,
        "upvote_ratio": 1.0
    },
    {
        "title": "New Grad Looking for Resume Feedback",
        "author": "NiceCanadian1",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a4ona/new_grad_looking_for_resume_feedback/",
        "text": "[removed]",
        "created_utc": 1677176459,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are all employers stingy with software licenses?",
        "author": "Nabokov6472",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a4n6i/are_all_employers_stingy_with_software_licenses/",
        "text": "Just wanted to get some wider perspective on this. \n\nMy employer’s handling of software licenses for devs is incredibly frustrating. I could bitch about it for several paragraphs, but I don’t want to identify myself by stating specific instances/working practices. But in general we use the free edition of most software (sometimes breaching licensing terms where there is a clause about companies with X employees or revenue). \n\nIs this the same everywhere?",
        "created_utc": 1677176370,
        "upvote_ratio": 1.0
    },
    {
        "title": "Leaving Company After Less Than A Year",
        "author": "cs_thrownaway8",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a4e4z/leaving_company_after_less_than_a_year/",
        "text": "[removed]",
        "created_utc": 1677175766,
        "upvote_ratio": 1.0
    },
    {
        "title": "vapor options?",
        "author": "hALpMeR3dd1t",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a4cg4/vapor_options/",
        "text": "[removed]",
        "created_utc": 1677175655,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I become a better developer?",
        "author": "ilikepockets",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a4798/how_do_i_become_a_better_developer/",
        "text": "[removed]",
        "created_utc": 1677175314,
        "upvote_ratio": 1.0
    },
    {
        "title": "When will you feel like you’re now a Senior?",
        "author": "superfly_retro",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a43km/when_will_you_feel_like_youre_now_a_senior/",
        "text": "I mean being a Senior Engineer nowadays is more than just a title. It’s about Skill and Mentality and sometimes Leadership. I have 5 Years of Experience and had a Senior Position once, didn’t last long. But I wasn’t surprised, I mean I didn’t apply for a senior position and I told the company I have no experience with their Tech Stack but they still gave me the job and more pay than I asked for. \n\nEither way, I know I’m not a Senior Engineer and I’ve seen many developers with the Senior Title but they literally don’t know what they’re doing. \n\nI’m far from it and I know that being a Senior is more of a Stage like going Super Saiyan. So my question is, when do you feel like you’re a Senior and what can you do or is there anything you can do to achieve that stage?",
        "created_utc": 1677175092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else absolutely miserable in this field?",
        "author": "jaddler88",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a40rg/anyone_else_absolutely_miserable_in_this_field/",
        "text": "Hi all,\n\nI have seen a lot of posts with horror stories about coworkers and management, but I have had largely good experiences. My work places have been full of nice, chill people and expectations have been reasonable. I rarely clock over 40 hours a week and my company cultures have stressed work/life balance.\n\nThat said, I really despise my work. I have worked on backend archetecture, in full stack positions, and on a variety of applications, and I have hated all of it. Scrum, requirements meetings, and the actual development are just so draining, I feel like this career is sucking the life out of me. \n\nI currently work at a fortune 100 company and feel like I've \"made\" it, but absolutely cannot imagine spending the rest of my life doing this. I've worked at startups too and felt the same way. Has anyone else experienced this? Did you find a way to ignite your passion or be more content in your work?\n\nTLDR: Having trouble not hating this field, wondering if anyone else has conquered this problem.",
        "created_utc": 1677174910,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is GitHub (or GitHub Pages) a good option for showcasing you portfolio? How can it help in getting a job?",
        "author": "Notalabel_4566",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a3zka/is_github_or_github_pages_a_good_option_for/",
        "text": " I have seen many people having their developer portfolio as a repository on GitHub and hosted on GitHub Pages. I was thinking about doing the same. \n\n Is there any advantage of hosting my portfolio (and resume and other stuffs) on GitHub ?",
        "created_utc": 1677174829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I change teams because of one co-worker and how?",
        "author": "DisclosedForeclosure",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a3y1d/should_i_change_teams_because_of_one_coworker_and/",
        "text": "We're not working long enough but I can already tell almost everyone in my team is super laidback towards me except this person. Because how the team is arranged we have to closely work together every day but I can't stand it anymore. It's nothing crazy and we don't openly hate each other yet but I feel like it's a ticking time bomb.\n\nWithout going into details let's just say there are some work attitude and character differences (idk, maybe there is something wrong with me). In a nutshell, they are unreasonably hard working, stubborn and stiff. It's what I would call the opposite of being laidback. Disagreements regarding how the work should be done happen all the time and it's impossible to change their minds. Chances are that maybe I'm too touchy or misinterpeting it, since most of the communication happens remotely via text (written text can be often misinterpreted), but I get the vibe that the feeling is mutual. If it wasn't the case there would be at least some fraternity attempts from their side, but there are none, the relation is very official/stiff.\n\nAnyhow, it makes my otherwise stress-free work less enjoyable and I begin to think about changing my otherwise ok team.\n\nShould I just give up and ask for changing the team, and how would I go about it? Should I lie about the reason why I want to change? I don't know if the manager I'm going to talk with won't spill it, which could make me get a reputation of a person who is problematic to work with. Are there other issues to consider if I decide to change teams?",
        "created_utc": 1677174726,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I keep improving without a mentor?",
        "author": "43Gofres",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a3xfb/how_can_i_keep_improving_without_a_mentor/",
        "text": "I’m a mid-level React developer with no senior React developer above me. My code is often reviewed by people who don’t know React. I have mentors that are able to coach me on other things, but there isn’t a single Senior React Developer at the company. \n\nHow can I improve on my own?\n\nI feel like my progress is starting to stall and at times I’m getting away with sub-par code because there’s no one there to catch my mistakes.",
        "created_utc": 1677174685,
        "upvote_ratio": 1.0
    },
    {
        "title": "Google Summer of Code 2023 - Project, Proposals and Organizations Explained",
        "author": "thetech_learner",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a3oa5/google_summer_of_code_2023_project_proposals_and/",
        "text": "[removed]",
        "created_utc": 1677174081,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is better for future occupation: big role in small company or small role in big company?",
        "author": "Ok-Perception5454",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a36xx/what_is_better_for_future_occupation_big_role_in/",
        "text": "[removed]",
        "created_utc": 1677172905,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is living in SF worth an extra post-tax 30k per year?",
        "author": "Exact_Patient_2129",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a35eq/is_living_in_sf_worth_an_extra_posttax_30k_per/",
        "text": "[removed]",
        "created_utc": 1677172808,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I contact the company after 2 rounds?",
        "author": "pod32g",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a2zee/should_i_contact_the_company_after_2_rounds/",
        "text": "[removed]",
        "created_utc": 1677172409,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I contact the company after 2 rounds?",
        "author": "Yaeger42",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a2uc3/should_i_contact_the_company_after_2_rounds/",
        "text": "[removed]",
        "created_utc": 1677172066,
        "upvote_ratio": 1.0
    },
    {
        "title": "Test",
        "author": "EgyptianPhantoming",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a2s72/test/",
        "text": "[removed]",
        "created_utc": 1677171926,
        "upvote_ratio": 1.0
    },
    {
        "title": "Certifications to boost resume?",
        "author": "pinpadz",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a2r4j/certifications_to_boost_resume/",
        "text": "[removed]",
        "created_utc": 1677171855,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I get my next full stack role before I starve?",
        "author": "Accomplished-Try2549",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a2q0u/how_can_i_get_my_next_full_stack_role_before_i/",
        "text": "[removed]",
        "created_utc": 1677171784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is absolute non-existing documentation normal for large proprietary software/companies?",
        "author": "Viasien",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a2k21/is_absolute_nonexisting_documentation_normal_for/",
        "text": "I'm two months in this company and it is my first full time job after finishing my degree. The software I am working on is 40 years old, all written in C/Cpp and I am starting to get really sick of the non-existing documentation. All code, rarely some comments. They don't have core concepts described anywhere cause \"it might change in a few months\". My day to day workflow basically consists of constant debugging old code to understand how it works and stealing others valuable time.. When I submit my PR I get like two or three feedback loops because there's a function deep down the void that for some specific purpose.\n\nNo doxygen, no rough architecture graph (if there is any..). It all feels like a large component spaghetti mix with bad cohesion..\n\nI should note that this is the *only* negative thing about my job. I'm not going to leave any time soon but still.. it feels like they're shooting themselves in the foot. Is this normal in the world of large proprietary software companies?",
        "created_utc": 1677171404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any advice about getting a job would be appreciated before I literally starve",
        "author": "Accomplished-Try2549",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a2i29/any_advice_about_getting_a_job_would_be/",
        "text": "[removed]",
        "created_utc": 1677171278,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recent layoffs and looking to save my friends' jobs",
        "author": "spnine0",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a2cqj/recent_layoffs_and_looking_to_save_my_friends_jobs/",
        "text": "[removed]",
        "created_utc": 1677170920,
        "upvote_ratio": 1.0
    },
    {
        "title": "Job Tittle and Duties Changing - what are my options?",
        "author": "Dull_Detective_7671",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a28jz/job_tittle_and_duties_changing_what_are_my_options/",
        "text": "My company has restructured and my Job is being merged with another role that already exists. My pay and benefits stay the same, but I'll be stopping doing some work that I enjoy and taking on new sales duties which I am not interested in at all.\n\nI wasn't offered a choice in this, I was told. Can I ask to be retrenched? I don't want to quit and end up unable to get unemployment benefits or miss out on severance pay. Should I talk to a lawyer?",
        "created_utc": 1677170639,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which is the most relevant cloud computing certification for an MBA working in the IT Industry?",
        "author": "GoldBatter",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a268z/which_is_the_most_relevant_cloud_computing/",
        "text": "[removed]",
        "created_utc": 1677170490,
        "upvote_ratio": 1.0
    },
    {
        "title": "Job Change Advice -&gt; Full Stack Web and Mobile Dev to Game Dev",
        "author": "JmCole19",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a1h1u/job_change_advice_full_stack_web_and_mobile_dev/",
        "text": "As the title says, I’m looking for some advice on changing my field.\n\nI’ve been working as a Full Stack Dev for about 3.5 years now, I’ve worked on cross platform mobile apps, web apps, and backend development. I did a short stint with a game company and absolutely loved the work, my dream is to one day start my own indie game company. \n\nI want to transition back into the games industry but am not entirely sure where to start, I’ve been working on personal projects in Unity for about a year now (I’m decent with C#) and I’ve been looking for jobs that will allow me to learn and grow my experience, but I’m not sure where exactly I should be looking, I’ve mainly been looking on LinkedIn and Indeed and haven’t found much.\n\nI will say my search has been pretty passive as I love my current job and coworkers, but yesterday I found out that my company would be ending all WFH and I currently live about 2 hours from the office, and unfortunately I’m just not making enough to afford the gas (I’m very bummed about this, but it is what it is).\n\nAny and all advice would be greatly appreciated!",
        "created_utc": 1677168801,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self-curated curriculum vs. Turing College | Data Engineer in training",
        "author": "binchentso",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a13p8/selfcurated_curriculum_vs_turing_college_data/",
        "text": "Hey,\n\n I got might get a scholarship from [Turing College's Data Engineering course](https://www.turingcollege.com/data-engineering) \\- which comes with an obligation to accept a DE job from their partner companies. If no offer given within 1 month after finishing the course (around 8 months duration), you can apply to other companies as well. Fair, but though. I would need to accept a Data Engineering position with the pay levels they advertise (50k€), after graduation.\n\nWould you rather…\n\n* ...stick to [self-curated curriculum](https://binchentso.notion.site/My-learning-path-516014e8d523457cbb277c9e2f00e409) aligned with a DE mentor, using the slack time at my current role to work on portfolio projects?\n* ...or follow up with the Turing College course, for 6–8 months and afterward have the chance to land a job with their hiring partners?",
        "created_utc": 1677167917,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I interpreting this correctly?",
        "author": "slabzzz",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a11j2/am_i_interpreting_this_correctly/",
        "text": "Recently on an annual review(swe 10ye) I casually raised the idea of a raise or bonus as it had been discussed last time but was told by main HR(not my reviewing manager) raises would be evaluated on the annual, not the quarterly. The response I got was basically that we didn’t hit a certain sales number so there would be no compensation increases across the board. Keep in mind I’ve been under industry for a while and have been told I would eventually be brought up to rate. So my final interpretation is this: YOU will not be getting a raise because we are tying it to a metric outside of your direct control, hover others may have gotten raises or bonuses, just not you. It feels like since our round a only certain people have been seeing the benefits, imo. Am I interpreting that answer wrong? Is my compensation being tied to something out of my control?",
        "created_utc": 1677167766,
        "upvote_ratio": 1.0
    },
    {
        "title": "Non-trad contemplating a career switch. Am I on the right track?",
        "author": "angryears923",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a0h36/nontrad_contemplating_a_career_switch_am_i_on_the/",
        "text": "I have an unrelated B.A. degree and will be 29 soon, so I wouldn’t be a traditional student.  \n\nBeen using Codecademy (free version) to learn the basics. Afterwards, I’m considering The Odin Project, Free Code Camp, or both?  \n\nI assume it would look better if I had a B.S. in something tech related so thinking of WGU. The next session at WGU starts in June so I have time to get the basics down. People have suggested just getting a masters instead, but I’d be worried I’d be lost.   \n\nThen I know I need to show projects. I know GitHub is popular. Would school projects, like a capstone count too on a resume, or just projects done solo?\n\nWas thinking of front end developer, but open to anything and exploring my options. Heard front end is oversaturated.",
        "created_utc": 1677166319,
        "upvote_ratio": 1.0
    },
    {
        "title": "GTRI vs L3Harris",
        "author": "Wild-Writer-3211",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a0dxt/gtri_vs_l3harris/",
        "text": "Hello,\n\nI'm graduating in May from Georgia Tech and currently I have 2 job offers from these two companies, GTRI (81k) vs L3(91k). And I'm very unsure which one should I go with. I'm currently living Georgia and L3 would have me move to Melbourne, FL. Both are defense contract software engineering position.\n\nIf someone could offer me some insights to make a decision I'd greatly appreciate it. Thanks in advance.",
        "created_utc": 1677166098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Masters for devs with prior experience",
        "author": "libertaOfsa",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11a0609/masters_for_devs_with_prior_experience/",
        "text": "[removed]",
        "created_utc": 1677165535,
        "upvote_ratio": 1.0
    },
    {
        "title": "What source can I refer to understand how exactly machine learning models work. Not interested libraries like TensorFlow; I want to take a deeper look into the math behind it.",
        "author": "PestiferousOpinion",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/119zw5v/what_source_can_i_refer_to_understand_how_exactly/",
        "text": "Basically I want to fully understand the math / logic / optimizations / etc behind these models. Is there any source you could recommend?",
        "created_utc": 1677164832,
        "upvote_ratio": 1.0
    }
]