[
    {
        "title": "Advice on what internship to choose",
        "author": "Vanxsquad",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n6n35/advice_on_what_internship_to_choose/",
        "text": "I received an offer from FAST Enterprises as well as Lowe's for a SWE job. They both pay me $25/hr and will pay for housing as well so I'm not too worried about that part. What I am curious about though is working for either of the companies. Does anyone have any experience working at or with anyone from these companies or know anyone who has? They both will require me to relocate; Lowe's in Charlotte and I'm unsure as to where FAST will relocate me to. Fast mentioned to me on the phone that a decision will be made mid April as to where I will be moved to and that it will be somewhere within driving distance if I have a car so that means either Atlanta or Columbia. Ideally, my preference for living is Atlanta &gt; Charlotte &gt; Columbia\n\nPros for Fast: \n- Better housing\n- Better pay if I receive a FT offer (a friend was offered $95k base + 5k signing + 5k relocation with only 1 internship)\n\nCons for Fast:\n- Not sure about name recognition\n- Have to move every 2-3 if I receive a FT offer\n- More in-person than Lowe's\n- Might get Columbia\n\nPros for Lowes: \n- Better location than Columbia\n- Much nicer office\n- Possible WFH opportunities upon FT offer\n\nCons for Lowes:\n- During internship, I will be living in UNCC dorms with someone else in the same room. Definitely the biggest con for me so far.",
        "created_utc": 1678402314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career switching",
        "author": "msnynja",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n6ks9/career_switching/",
        "text": "Going back to school and trying to make a career switch from healthcare to tech, is there a easy way to get a position (any position) in the field right now without experience?",
        "created_utc": 1678402176,
        "upvote_ratio": 1.0
    },
    {
        "title": "No responses got me down",
        "author": "quas0nt",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n6j7z/no_responses_got_me_down/",
        "text": "[removed]",
        "created_utc": 1678402078,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does GUI design and programming outside of the web look like today?",
        "author": "psyberbird",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n6guo/what_does_gui_design_and_programming_outside_of/",
        "text": "I’m an undergrad student looking to explore and find what field of software development meshes best with me, and I’ve found that I really enjoy bringing UI/UX design documents to life and doing visual work with CSS and Javascript. I just am not quite sure if frontend dev is specifically the way to do it for me, and want to explore options outside of the web too. Are there positions for desktop application work that are analogous to frontend development? And also, for desktop environments too like macOS’s DE Aqua, or Android’s GUI, etc? Is everything a web app or otherwise an app built with a web tech stack and with a browser bundled into it these days?",
        "created_utc": 1678401930,
        "upvote_ratio": 1.0
    },
    {
        "title": "ULPT request - PO turns daily stand up into 1/2 hour+ long interrogations",
        "author": "choccysmeg",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n6g44/ulpt_request_po_turns_daily_stand_up_into_12_hour/",
        "text": "I'm past the point of reasonable discussion with this person so I need some more heavy handed tactics to stop this dickhead from wasting our time and destroying the team's morale.\n\nAny ideas?",
        "created_utc": 1678401889,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you cope with jobs asking you to be perfect?",
        "author": "Notalabel_4566",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n5nj7/how_do_you_cope_with_jobs_asking_you_to_be_perfect/",
        "text": " Hi, those are some requirements of a  company job offer on LinkedIn i found today\n\n&gt;If you like to work in a fast-paced environment and strive for quality and efficiency, then look below for more details.  \n&gt;  \n&gt;A track record of projects completed on time – you are a flawless executor, not a procrastinator\n\nThe rest of job offer is pretty much ,,you must be excellent with PHP and Node js and excellent with NoSQL and good managing servers and writing shell script and also efficient with Frontend and with cloud storage and great communicator on top of that YOU MUST WRITE PERFECT REUSABLE CODE FAST.\n\nFrom my experience even best developers are not FLAWLESS and their code is not FLAWLESS, and it does not mean they are lazy (lets be honest this is what they mean by procrastinator). Its just there is never 100% certainty in creating software. I always give it my best, sometimes I even stay long hours (I suppose I am still lazy by this company standards) but rarely it works first time, rarely it takes me as much as I predicted (ok in my current jobs non-technical manager estimates for me or forces me to accept short deadlines bestowed upon me but still sometimes even I think something should take shorter it did). Requiring average dev to deploy code right on time always is... delusional.\n\nHow do you guys cope with requirements like that. I apply out of desperation but beside being software dev (PHP) with 5 years of exp I do not check majority of these marks. I do not believe anyone except maybe top 5% developers (which this company most likely can't afford, you don't find them on Linkedin job offers section) would be able to be such one man army/orchestra.\n\nSo its probably one of the jobs you need to BS your way through. How do you guys cope and clean your conscience after this amount of fake BS that is needed to sell yourself to companies like these?",
        "created_utc": 1678400133,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Pramp Not Work For Anyone Else?",
        "author": "eatmyhatsir",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n5gm8/does_pramp_not_work_for_anyone_else/",
        "text": "[removed]",
        "created_utc": 1678399718,
        "upvote_ratio": 1.0
    },
    {
        "title": "Start your career the modern way. No experience or degree required.",
        "author": "Ayomidedavid",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n52re/start_your_career_the_modern_way_no_experience_or/",
        "text": "[removed]",
        "created_utc": 1678398867,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any similar experiences and tips on how to deal with being unemployed in this market?",
        "author": "Mike4driver",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n52fc/any_similar_experiences_and_tips_on_how_to_deal/",
        "text": "[removed]",
        "created_utc": 1678398847,
        "upvote_ratio": 1.0
    },
    {
        "title": "Really struggling with my career and new job, what could be a good path forward?",
        "author": "Competitive_Exchange",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n4kft/really_struggling_with_my_career_and_new_job_what/",
        "text": "[removed]",
        "created_utc": 1678397711,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would you consider reasonable pay for on-call work?",
        "author": "Content_Apricot_3468",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n4eob/what_would_you_consider_reasonable_pay_for_oncall/",
        "text": "My company is introducing on-call work soon. Luckily, it is going to be optional. I was a bit surprised at how much they are paying for this and was curious about experiences others have had. What have you been paid for on-call work and what do you consider reasonable?\n\nI’m not sure what the response time would need to be, but it would be a full week (24/7) on call. My base salary is between 80-85k and they have proposed $300 flat rate. No extra money or time off if you get called to work. Works out to $2.34 per hour before taxes.",
        "created_utc": 1678397360,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could I get into data entry or data analyst jobs with a Human Resources certificate?",
        "author": "Lovely5512",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n4bcb/could_i_get_into_data_entry_or_data_analyst_jobs/",
        "text": "[removed]",
        "created_utc": 1678397141,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have experience with the ABS Digital Aspire Program?",
        "author": "Particular_Crab813",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n41rz/does_anyone_have_experience_with_the_abs_digital/",
        "text": "[removed]",
        "created_utc": 1678396528,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for Advice",
        "author": "noahkallur",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n3pxm/looking_for_advice/",
        "text": "[removed]",
        "created_utc": 1678395803,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is software Engineering career has low demand or am I doing something wrong?",
        "author": "nightowlBMO",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n3nbv/is_software_engineering_career_has_low_demand_or/",
        "text": "[removed]",
        "created_utc": 1678395652,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does your team keep your compiled sites and source code in the same repository?",
        "author": "greasypeasy",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n3n4x/does_your_team_keep_your_compiled_sites_and/",
        "text": "In our repositories, we have an install folder and a source folder. Is this bad practice? My manager wants us to check in the dll’s every time we make changes. But we’ve ran into a few problems with this. I am just asking what other teams do as I am new.",
        "created_utc": 1678395641,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I blow the whistle on my big tech employer?",
        "author": "locomoco0",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n3bog/should_i_blow_the_whistle_on_my_big_tech_employer/",
        "text": "[removed]",
        "created_utc": 1678394894,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions about internships",
        "author": "neoninja2509",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n3bdf/questions_about_internships/",
        "text": "I’m currently a freshman and have a few questions. Thanks for any answers!\n\nHow do internships work? When I apply, do all internships have interviews or do some of them just look at your resume? What do they usually ask during interviews?\n\nIn our portfolio, what personal projects would look good on them? I heard that anything that shows you learned would be good, is this true?\n\nAlso during the internships themselves, what exactly do we do? Are we taught things if we don’t know or are we expected to know how to do everything assigned to us?",
        "created_utc": 1678394876,
        "upvote_ratio": 1.0
    },
    {
        "title": "First time doing 1099. Should I start my own LLC? Can client sue me if projects don't get done?",
        "author": "PGHPGHPGHPGHPGH",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n391h/first_time_doing_1099_should_i_start_my_own_llc/",
        "text": "Hi all. I work a W2 job and about to start a 1099 job. They have a product in mind for me to build and I have a good idea of how to do it. I'm wondering should I be billing them hourly/daily? I'd expect to spend 10-20 hours a week on this. \n\n&amp;#x200B;\n\nShould I start my own LLC to stay safer? I'm worried that if for some reason the project isn't done in a way they want it to be, they'll sue me for the money back. Does this happen? Just trying to familiarize myself as much as possible with the legal implications. Already well aware of tax differences, possible business deductions, etc.",
        "created_utc": 1678394720,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did I shoot myself in the foot by asking my boss’s boss this question?",
        "author": "canadian_Biscuit",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n2mp9/did_i_shoot_myself_in_the_foot_by_asking_my_bosss/",
        "text": "To provide a brief background of myself, I was hired as an entry-leveled software engineer slightly over a year ago, to work alongside several senior-leveled software engineers in a very small team.\n\nI had a meeting with my boss’s boss to discuss my yearly performance review and bonus. I was given a low performance rating and was told that my bonus would be lower than expected as a result. During the meeting, I was asked if my performance rating came as a surprise, or if I felt that the rating was justified. I clarified that my manger and I discussed areas that I need to improve on, however I asked if it would be possible to provide a list of metrics on expectations to ensure that I can meet and exceed those expectations (the rating system seems very abstract and subjective to me). I was told by my boss’s boss that the company typically doesn’t provide objective metrics for employees to meet and that the performance metrics are determined entirely by feedback (I never had a performance review in my career so this is entirely new to me). \n\nTo clarify on the feedback that I received, I was told by my manager that my PRs tend to take too long, I sometimes ask too many clarifying questions on certain stories, and that a few features that Ive I worked on in the last year were identified with bugs during testing. \n\nIm not sure if the question I asked was appropriate, or entirely unexpected for the conversation. I’m also not sure if I have enough context to ensure I exceed expectations.",
        "created_utc": 1678393297,
        "upvote_ratio": 1.0
    },
    {
        "title": "One year co-op vs single summer internship",
        "author": "kennpy",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n2lyo/one_year_coop_vs_single_summer_internship/",
        "text": "[removed]",
        "created_utc": 1678393252,
        "upvote_ratio": 1.0
    },
    {
        "title": "Business Analyst trying to enter a Software Dev role.",
        "author": "lockondoor",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n27v3/business_analyst_trying_to_enter_a_software_dev/",
        "text": "[removed]",
        "created_utc": 1678392359,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confused between Internship offers",
        "author": "ShadyAsh_17",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n1xv9/confused_between_internship_offers/",
        "text": "[removed]",
        "created_utc": 1678391720,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recent full stack bootcamp graduate feeling extremely disheartened.",
        "author": "Veggielovr2",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n1u80/recent_full_stack_bootcamp_graduate_feeling/",
        "text": "\n*** PLEASE, NO RUDE COMMENTS. ***\n\nI have been feeling incredibly discouraged lately after graduating from a full stack coding bootcamp December 2022. I have been actively applying for jobs, networking on LinkedIn, and attending hiring/networking events, but nothing seems to stick. I've been attempting to make the transition to software engineering for almost three years now. Since then, my brother passed away, a friend committed suicide, and I've isolated myself. Depression is not new to me and I've had major depressive disorder since I was 14. During the bootcamp, and even a month after graduating, I had so much hope and thought that this was finally my chance to change my life around and accomplish something that I've always wanted to do, but I'm losing hope.\n\nIf you have any advice, I'd sincerely appreciate it. 🙏 \n\n\n\nHere's my story for reference:\n\nGrowing up in a disadvantaged family and community, I was not exposed to the opportunities and resources that would have allowed me to pursue a career in tech earlier in my life. Amongst my childhood peers, I was the only one to obtain a college education, so I consider myself incredibly fortunate.\n\nDespite a poor education, I’ve always harbored fascination for STEM. To enrich my knowledge, I’ve been re-teaching myself math fundamentals in my spare time. I vividly remember ranting to my younger brother about how much I wanted to learn how to code and, although we had grown apart for years, he encouraged me to turn my dreams into reality. Unfortunately, my brother passed away a few months later. But, his words of encouragement reignited my passion and reaffirmed the potential I had to achieve my dreams. I have since remained adamant in my pursuit of finally becoming a software engineer.\n\nA year after graduating with a bachelor's in biochemistry, I started by taking an introductory computer science course at a community college and used that as evidence of my commitment to pursuing a career in software engineering. I was then accepted into a bridging master's program spring 2022, but quickly realized that the professors expected a strong computer science background. I was advised to drop the program and found myself feeling lost and defeated.\nIt wasn't until discovering Hackbright Academy's bootcamp that I felt a glimmer of hope again. The program rekindled my sense of hope, and I was excited to develop my skills alongside other like-minded individuals. \n\nThe bootcamp was sponsored by a large well-known company. For three years, they had a 100% success rate of converting every grad from the sponsored cohorts into full-time employees. Well, due to poor Q4 earnings, that was no longer a possibility and we were led to believe that we’d be hired on until two weeks before the end of the program when the bomb was dropped. It goes without saying that I felt crushed at this news. \n\nPrior, I thought that this program was FINALLY my shot at achieving something I’d been wanting to do for a long time, but didn’t quite know how to go about doing. Now, we’ve all just been left to the wolves with little support.\n\n\nTLDR: I graduated at December 2022 and have been actively applying for jobs, networking on LinkedIn, and attending hiring/networking events, but nothing seems to stick. Tips appreciated.",
        "created_utc": 1678391471,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help setting expectations for first promotion.",
        "author": "PostNutDecision",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n1pfa/need_help_setting_expectations_for_first_promotion/",
        "text": "Hey everyone!\n\n\nI’m a SWE I at a large retailer and have been at this role full time for about 10 months. I have 2.5 years previously at this company as a SWE intern and my engineering manager will take this into account for how quickly I will become a SWE II (or so he says at least).\n\n\nI’ve never had a real promotion before so I’m looking into the future a few months. I have a review with my manager at the end of this month and I’m hoping to plant the seed that I am looking for a promotion soon. I have been trying to do the responsibilities of a SWE II the past few months, mostly taking responsibility for new services we spin up and becoming the domain master of those services. \n\n\n\nHow else should I justify myself for wanting a promotion or will that even be a concern (maybe he will just assume I’m looking for one because of how long I’ve been here?) \n\n\nLastly, I want to set realistic expectations for the compensation increase going from SWE I to SWE II. I currently make 85k salary, 93k total (bonus is flat 10% of salary which tracks with your salary increases). Is it unrealistic to ask for 105k or even 110k salary. Can you even negotiate for a promotional raise? \n\n\nSorry for all of the question I am just quite new to the actual professional end of software and I have a lot to learn! Thanks!",
        "created_utc": 1678391140,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling hopeless about career after graduation",
        "author": "confusedthrowaway144",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n1hrd/feeling_hopeless_about_career_after_graduation/",
        "text": "(Sorry for the length of this post!) I have two main issues: getting a job now and thinking about my career in the future.\n\n\nI’m a CS senior, graduating in May. I have a ~3.75 GPA, go to a “good school”, and have had internships. I’ve sent out about 100 applications—most to random companies, definitely not FAANG—and I’ve gotten a few rounds into interviews at two companies. But when they send me coding assessments, I get stumped by at least one problem and get rejected. Like, many of these problems are harder than test questions in my Algorithms class. This is really disheartening especially when I thought I had a chance. \n\n\nIs the only solution to grind LeetCode? I’ve done about 3/4 of the Blind 75, but I don’t get how completing even hundreds of LeetCode problems can prepare me to answer *any* potential question I encounter in a test. I also feel like it’s kind of a waste of time to study LeetCode when it’s not very relevant to anything but job applications, but if that truly is the best solution and the only way to get a job, I’m willing to do it.\n\n\nI’m also wondering: if I can’t do these assessments based on what I’ve already learned and my previous practice, is CS actually the right career for me? Will working in this field just be an uphill battle? Plus, my internship this past summer made me dread entering the “working world”. All I did every day was make small code changes that no one would have probably noticed—and that I personally didn’t care about—in a giant pile of software. It was kind of like living the same depressing, boring day over and over again. Genuinely, if I had to spend decades at that company like many of my co-workers, I would probably k!ll myself. When thinking about jobs I *would* want, I feel like I would really enjoy working at an emergency department at a hospital because it’s higher-pressure and your work/success has real consequences, you’re doing different things every day &amp; meeting different people, you have opportunities to work with your hands, and the work must be done in a shorter timeframe/is more fast-paced (instead of working for months/years on the same project).\n\n\nOverall, does the experience I had apply to most CS jobs, and are there *any* that have some of the characteristics that I would want in a job? Did anyone go through the same thing and find a role they thought was more meaningful, either in CS or outside of it? Any help would be appreciated!",
        "created_utc": 1678390656,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm a 26 year old wastewater truck driver, planning on getting my bachelor's in CompSci this year. Looking for advice and stories from anyone in a similar situation",
        "author": "kanjobanjo17",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n1ffs/im_a_26_year_old_wastewater_truck_driver_planning/",
        "text": "When I graduated high school in 2015 I immediately went to college and dual majored in Environmental Science and Music Composition while working full time (my parents have no secondary education and make just enough money to scrape by). I immediately got burnt out and took a medical withdrawal for my mental health, thinking I'd take a short break to work and save enough money to go back to school. Instead over the last 7 years I've had 20+ different jobs, all had terrible pay and no work-life balance. I've never been fired or anything either, most of them were part-time jobs I'd just stack together. Now I work at a wastewater treatment plant and I really enjoy all the  SCADA, data organization, and asset management software aspects but the rest of my work is physically and mentally exhausting (and extremely dangerous) so I'm hoping to go back to school to get my bachelor's.  Being out of school for so long is also freaking me out a bit, but overall I'm actually excited.\n\nAny tips for school, life advice, or horror/success stories would be greatly appreciated!",
        "created_utc": 1678390505,
        "upvote_ratio": 1.0
    },
    {
        "title": "Transition from Software Engineer",
        "author": "Straight-Novel6726",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n1e1z/transition_from_software_engineer/",
        "text": "[removed]",
        "created_utc": 1678390417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Job threatened if I do not get certification.",
        "author": "elfleur",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n18vt/job_threatened_if_i_do_not_get_certification/",
        "text": "During a recent 1-1 my manager asked when I plan to get my AWS Solution Architect certification. I told him that I have no timeline to get it anytime soon and having asked my skip, he said it was not a mandatory thing to do. My boss said that he is making it a mandatory thing to do and that I cannot continue working on the team if I don’t comply.\n\nFor some context manager gave my team 4 weeks to get their certifications, but since I was on vacation I was given half the time and expected to get my own resources to study. I haven’t studied much since those two weeks (back in december) and I do want to pass the cert exam, but as I am devoting my own time to it I am taking my time. Is this threat something I should bring up to my skip or HR? I have never had an issue and not having this cert is not impacting my work on AWS. Looking for advice",
        "created_utc": 1678390097,
        "upvote_ratio": 1.0
    },
    {
        "title": "This time last year I was getting hit up by recruiters from big name companies now I've been reject by 100+ companies without even a single call. What am I missing?",
        "author": "just_a_silly_lil_guy",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n12lj/this_time_last_year_i_was_getting_hit_up_by/",
        "text": "[removed]",
        "created_utc": 1678389704,
        "upvote_ratio": 1.0
    },
    {
        "title": "I did nothing this sprint and I was out the last three days. What am I going to say tomorrow?",
        "author": "Ok_Bike2091",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n0uwv/i_did_nothing_this_sprint_and_i_was_out_the_last/",
        "text": "I've done legitimately nothing this sprint and I've been out the last three days to get some medical work done. Sprint ended Wednesday, I'm expecting to get flamed tomorrow because I'm pretty new and definitely left a bunch of work for my coworkers to pick up. I had to get some light surgery and some biopsies done. \n\nI'm also new to the company and didn't have a clue on how to complete my tasks within our code base and I've spent the last two weeks panicking and near tears every day because I'm worried about this diagnosis. This has been the craziest year of my life and even though work should be my #1 priority, I feel like I can't handle it all right now. \n\nIf you couldn't tell, I'm a junior. Bootcamp grad, lucked into a position. I already fight off imposter syndrome but what advice could you give to salvage a newbie coming in two weeks after being assigned a task and asking what the first step is?",
        "created_utc": 1678389222,
        "upvote_ratio": 1.0
    },
    {
        "title": "This time last year I was getting hit up by recruiters from Facebook and Amazon now I've been reject by 100+ companies without even a single call. What am I missing?",
        "author": "just_a_silly_lil_guy",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n0uw0/this_time_last_year_i_was_getting_hit_up_by/",
        "text": "[removed]",
        "created_utc": 1678389220,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switched jobs, feel dumb",
        "author": "Alone_Satisfaction_8",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n0qbn/switched_jobs_feel_dumb/",
        "text": "A year ago I switched from a happy job for more money. Now I’m struggling at this new job; management doesn’t give clear direction, under resourced.\n\nHave others switched jobs and had it go south? How do you overcome discouragement?\n\nNow I feel like this job is ruining my career and making me feel like I don’t know to do anything!",
        "created_utc": 1678388921,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am a recent full stack bootcamp grad and am feeling extremely disheartened and burnt out.",
        "author": "CholaPeroBonita",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n0o2i/i_am_a_recent_full_stack_bootcamp_grad_and_am/",
        "text": "[removed]",
        "created_utc": 1678388778,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am a recent bootcamp grad and am feeling extremely disheartened.",
        "author": "CholaPeroBonita",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n0ivg/i_am_a_recent_bootcamp_grad_and_am_feeling/",
        "text": "[removed]",
        "created_utc": 1678388456,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am a recent bootcamp grad and am feeling extremely disheartened.",
        "author": "CholaPeroBonita",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n0g9e/i_am_a_recent_bootcamp_grad_and_am_feeling/",
        "text": "[removed]",
        "created_utc": 1678388297,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know a University with a CS program similar to this?",
        "author": "Fickle-Living8372",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n01z3/does_anyone_know_a_university_with_a_cs_program/",
        "text": "[removed]",
        "created_utc": 1678387386,
        "upvote_ratio": 1.0
    },
    {
        "title": "For those of you working remote, are you forced to turn on your camera for meetings?",
        "author": "Celcius_87",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mzzvb/for_those_of_you_working_remote_are_you_forced_to/",
        "text": "Or not?\n\nWith me for example I don’t have to but I’m just curious to see what the norm is out there.",
        "created_utc": 1678387248,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Outsider) Are your IV processes supposed to be so grueling and intense?",
        "author": "ans97",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mzxxf/outsider_are_your_iv_processes_supposed_to_be_so/",
        "text": "For some reason interview is not allowed in the post title…not sure why but this post isn’t asking for recruiting advice?\n\nMy husband works as a cloud architect and he has been through countless interview processes the past year trying to find another job and frequently tells me of having to go through 4-5 interviews that are over an hour long, gets told how wonderful he is and these assholes (sorry) have the nerve to ghost him or he doesn’t get the job. I am a much lower level worker so in my field anything over maybe 3 interviews (including the phone screen) would be laughable. \n\nI think I have just spent so much time seeing this wonderful man put through so much and so anguished over this insanity that it makes me angry and wonder what perfect robot even ends up getting the job anyway. I know a lot of you make the big bucks (including him), so I don’t doubt that you need to know what you’re doing but he is not interviewing for a manager or a CEO so I personally find this kind of process absurd and insulting. Why put good candidates through this?\n\nThis is obviously casting a wide net since people of different job titles in this field probably have wildly different interview processes but from what I’ve seen the consensus is that it seems to be this way for a lot of people. How do you deal with it? Why is it this way, as an outsider who is truly flabbergasted.",
        "created_utc": 1678387123,
        "upvote_ratio": 1.0
    },
    {
        "title": "Non UK citizen without a degree? How hard would it be",
        "author": "mateus_gp_6",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mzopr/non_uk_citizen_without_a_degree_how_hard_would_it/",
        "text": "Hey, I am from Portugal and I currently 1 YOE in software engineering without a degree and I have 19 yo. The reality in Portugal is, take 1400 euros, give 33% to the government and pay 800 just for the rent.   \nWith that said I am looking forward to move to UK as soon as I get 1 and 1/2 or 2 YOE. After Brexit I know everything got more complicated for EU citizens.   \nHow hard would it be for me to get a job in UK, preferably in London with my conditions? Is it hard to get a visa? What would I have to do to get one? What other countries would fit my conditions without winning a miserable salary?   \nPS: I have an english certificate that proves that I have a B2 english level, but It seems that that certificate is not acceptable for the application so I would probably have to take an exam again.   \nThank you all in advance!",
        "created_utc": 1678386520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asking to be lead with 1.5 YOE",
        "author": "thirdbaptismsurvivor",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mzhiq/asking_to_be_lead_with_15_yoe/",
        "text": "[removed]",
        "created_utc": 1678386058,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your typical non-promo annual raise like?",
        "author": "bigchungus003",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mzejs/whats_your_typical_nonpromo_annual_raise_like/",
        "text": "is 5% normal?",
        "created_utc": 1678385875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Company B posting same job as current employer Company A, but with better pay/benefits",
        "author": "fordgoldfish",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mzdhe/company_b_posting_same_job_as_current_employer/",
        "text": " I work in tech at Company A. Company A is a subcontractor under Company B. Company B, put out a job posting to their employees, and Company A posted same job. The pay and benefits are better at Company B. I just met with my Company A boss and they want to keep me and see \"what they can do\" to retain me. Assuming my company A *can't* increase pay and benefits, I want to go with Company B. The only thing I would lose is my 6% 401K match I have been getting for the past 11 months, which would suck. What would you do? I'm trying to be as professional as possible and maintain positive relationships.",
        "created_utc": 1678385806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I quit?",
        "author": "cinnabams",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mz916/should_i_quit/",
        "text": "[removed]",
        "created_utc": 1678385518,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I quit or get fired?",
        "author": "tofutoku",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mz6sj/should_i_quit_or_get_fired/",
        "text": "[removed]",
        "created_utc": 1678385383,
        "upvote_ratio": 1.0
    },
    {
        "title": "Working at a small non-tech company (~20 people), poorly organized, unconventional tech stack. Is being here a poor choice for my career?",
        "author": "fs200vids",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mz0p8/working_at_a_small_nontech_company_20_people/",
        "text": "I've been anxious about a career decision and wanted to get some opinions.\n\nI graduated college in 2018. My first job was at a large, well-known, logistics company, starting in 2019. I became proficient in Angular, C#/.NET Core, got used to CI/CD, etc...we had hundreds of thousands of users. It was stressful, but felt important. Had a big team.\n\nFast forward to April 2022. I quit that job because of poor work-life balance. I started a new one that has, culture-wise, been mostly great. People are super nice, catered lunches happen all the time, practically zero stress, great flexibility to work in-office or remote.\n\nProblem is, the company is so disorganized. The company barely uses Slack and meetings rarely happen. I don't feel like I have actual deadlines. Typical performance reviews don't really happen. I'm one of two software developers. The SaaS platform I work on isn't our biggest revenue source at the moment. Non-tech employees don't seem to care much about the vision or future of the tech side of the company (aside from C-suite people), and most of them are hourly. Our platform is not nearly as widely used as my previous job, but I have the freedom and decision-making power to implement pretty much whatever we decide.\n\nRight now, I work with Elixir and React Native w/ a Postgres DB + deploying w/ CI/CD pipelines.\n\nMy ultimate question is, can I stay at a job like this for a while (a job that doesn't practice Agile standards, a job where I am not surrounded by a team of more experienced engineers to learn from) and still be marketable in the field? Is it impressive for other companies that I have been able to essentially manage IT and feature development to drive revenue for a company that does about ~20M a year? I stick to the conventions best I can - write tests, clean code, plan features out, model DB when necessary.\n\nIt just doesn't 'feel like a job' and I wonder if this is bad. Excuse me if I seem naive. I'm 27.\n\nI enjoy the stress-free aspect of it. I enjoy having the power to build greenfield projects. I just don't want to shoot myself in the foot. Thanks all.",
        "created_utc": 1678384992,
        "upvote_ratio": 1.0
    },
    {
        "title": "Small non-tech company (~20 people), poorly organized, unconventional tech stack. Is being here a poor choice for my career?",
        "author": "Dangerous-Notice1118",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11myx76/small_nontech_company_20_people_poorly_organized/",
        "text": "[removed]",
        "created_utc": 1678384792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Web developer vs more enterprisey software engineering",
        "author": "spreadlove5683",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11myuh7/web_developer_vs_more_enterprisey_software/",
        "text": "I'm wondering about the pros and cons and what the career path would look like doing something like node/react (perhaps in an enterprise setting) vs something like enterprise Java.  \n\n\nIs there generally more opportunity in one vs the other? Do you personally think one line of work is more enjoyable and/or easier",
        "created_utc": 1678384609,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting SWD jobs with a degree in graphic design",
        "author": "GretaGerwig",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mysm6/getting_swd_jobs_with_a_degree_in_graphic_design/",
        "text": "So I'm graduating soon with a BA in graphic design, but have been positioning myself to pursue a career in front end/ web development. Through what I've learned on my own + some projects I built, I was able to get a programming internship. My next goal is to get an internship more aligned with my desired career path as i figured it would look better on my resume.  I have been doing a lot of work perfecting my resume/ website/ projects and  have been seeing better results because of it, but have had trouble getting past initial phone interviews. So the question I wanted to ask is, whats the best way to sell myself to a recruiter as someone who is capable enough for the job, even with a degree in graphic design? I understand I'll forever be looked at differently vs. someone with a CS degree, but wanted to potentially hear from others with design degrees as well as others in general.",
        "created_utc": 1678384493,
        "upvote_ratio": 1.0
    },
    {
        "title": "Equity at startup and raise",
        "author": "Upper-Ad-4288",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11myn4q/equity_at_startup_and_raise/",
        "text": "[removed]",
        "created_utc": 1678384145,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Humor A Good Thing On Resumes?",
        "author": "No-Preparation-8104",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mylk4/is_humor_a_good_thing_on_resumes/",
        "text": "[removed]",
        "created_utc": 1678384039,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anybody ever had a Woven Technical Assessment?",
        "author": "Jay-Hubb4",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mygi3/anybody_ever_had_a_woven_technical_assessment/",
        "text": "[removed]",
        "created_utc": 1678383705,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it worth to pursue higher education in CS? Should I even go into this field? (living in Israel)",
        "author": "fluffymypillows",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mydis/is_it_worth_to_pursue_higher_education_in_cs/",
        "text": "I’ve been programming on a low (really low) level since I was about 13. Just simple apps or olympiad problems. I’ve always loved it for the creation aspect, and I guess I am alright at it. I am 19 now, recently emigrated to Israel and only have a hs education. I’m still a total novice in CS, exams in my original country require skills not related to programming, so with studying for that, dealing with depression, and then war in my country and emigration piling on top, I’ve not been studying or working in CS at all. \n\nNow I need to establish myself quickly, and I’m debating whether I should go into CS with all the recent layoffs, “AI will take your jobs!” scares and such. \n\nIf I do stick with programming, is education the best way to go forward? I am thinking of going to a university and majoring in CS, but i’ve heard a lot of people say it’s a waste of time. There’s also an option of going to college, which is shorter.\n\nBasically, this is a young newbie being unsure about the future and asking for advice. Thank you all in advance!",
        "created_utc": 1678383510,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for someone ambitious with their career but becoming a new parent",
        "author": "who_sleeps_anymore",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11myc9b/advice_for_someone_ambitious_with_their_career/",
        "text": "[removed]",
        "created_utc": 1678383428,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about internship application process on Ripplematch",
        "author": "Weather_Only",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11my95q/question_about_internship_application_process_on/",
        "text": "I just tried Ripplematch, submitted a few applications and almost the next day I got email saying I was selected to move forward with the companies, but then looking at the email, all of them ask me to “formally” submit applications on the regular hiring website of the companies.\n\nDoes this sound fishy? I submitted the application again on the website, I tried the contact information Ripplematch gave me, and asked if there are any next steps and did not get any reply for a week.\n\nWhat does this even mean? Did the company “actually” look at my resume and said it can move forward? I just felt like all Ripplematch does is pointing me back to the regular application and says Ripplematch thinks it’s a good fit.",
        "created_utc": 1678383230,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dealing with a manager who acknowledges but doesn't take action?",
        "author": "jaffaKnx",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11my6r5/dealing_with_a_manager_who_acknowledges_but/",
        "text": "How do you deal with managers who are not super \"active\" or responsive to your comments? On a few occasions, I've observed:  \n\n\n* They mentioned about initiating an internal session on how we could go about testing a specific feature. Never happened.\n* I mentioned to them to add me in of the recurring meetings. Acknowledged but didn't add themselves *until* I had to mention again the next day.\n* Our 1 to 1s meeting schedule expired. Requested to reschedule. Acknowledged but never rescheduled.\n\nThey do message back in time, to emails, actively partake in meetings but it's just I have been noticing whether it's just with me or that's their nature.\n\nI am on good terms with their manager but not sure if I should bring up about these issues and if so, how should I word them such that it doesn't sound bad?",
        "created_utc": 1678383072,
        "upvote_ratio": 1.0
    },
    {
        "title": "Consulting Firms (EY, Deloitte, pwc, KPMG)",
        "author": "Hart_24",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11my5qa/consulting_firms_ey_deloitte_pwc_kpmg/",
        "text": "Does anyone here have experience working with one of these firms as a consultant. I currently work as a data scientist and interviewed for one of them for a consulting job that promised a 20% salary hike.\n\nHow is the day to day like? Is WLB good for consultants? I know that it is rough for accountants there but can’t see to find much for “Tech Consultants”",
        "created_utc": 1678383012,
        "upvote_ratio": 1.0
    },
    {
        "title": "A recruiter said they'd send an assessment and it hasn't shown up yet",
        "author": "Highwayman",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11my4cf/a_recruiter_said_theyd_send_an_assessment_and_it/",
        "text": "How long should I wait to follow up on not receiving it? They said I'd be emailed. It's day 4 now when the interview was day one.",
        "created_utc": 1678382925,
        "upvote_ratio": 1.0
    },
    {
        "title": "Big four consulting firms (EY, PWC, KPMG And Deloitte)",
        "author": "Hart_24",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11my2es/big_four_consulting_firms_ey_pwc_kpmg_and_deloitte/",
        "text": "[removed]",
        "created_utc": 1678382800,
        "upvote_ratio": 1.0
    },
    {
        "title": "Medical professional looking into my future. Some questions.",
        "author": "redhedted",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11my1nu/medical_professional_looking_into_my_future_some/",
        "text": "I have no CS background, I work in the medical field and found myself become the \"super user\" of a few applications over the past few years. \n\nI've been involved in trouble shooting, ticket follow ups and basically a liaison to IT. \n\nI've been a part of multiple go lives over the past few years and have been learning everything on the fly with a few in services but I'm at a point now where I can comfortably and confidently say I can fill a role this company needs, regardless of how aware they are or not. \n\nI've learned a lot. Not only from the technical side but from the communication side between technical support and the floors, how to work with PMs and how to frame an issue in a way that aids in getting it resolved etc etc. \n\nMoving forward the need for a \"technical liaison\" is very apparent, and I basically am at a point where I might be able to pursue a slight and unexpected deviation/opportunity in my career path.\n\nI'll be meeting with upper management about what my role would be moving forward, my specific responsibilities, how I'll be implemented in  multi -facility company, possible new job title etc etc. \n\nThe balls in my court due to the aforementioned and a few other details I've left out, it's all about finding a right fit. \n\nPrior to this meeting I just wanted to see if anyone has any advice for an \"outsider\". \n\nThat's it, thanks.",
        "created_utc": 1678382751,
        "upvote_ratio": 1.0
    },
    {
        "title": "Culture fit... how to prep? What to expect?",
        "author": "Illustrious_Can_9150",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11my0oy/culture_fit_how_to_prep_what_to_expect/",
        "text": "This is my first time interviewing this many rounds, I've reached the final boss: the culture fit interview. (Its for a Software engineer 1 position.)\n\nAnyone have any tips on what to expect? How should I spend prep time?\n\nI'm planning to do a deeper dive into the company and its products, and then have my \"tell me about a time\" stories all lined up...",
        "created_utc": 1678382693,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choice of universities for CS PhD",
        "author": "Specialist_Ad4242",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mxvb9/choice_of_universities_for_cs_phd/",
        "text": "[removed]",
        "created_utc": 1678382346,
        "upvote_ratio": 1.0
    },
    {
        "title": "Informing company about other potential offers?",
        "author": "plantboy97",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mxu7h/informing_company_about_other_potential_offers/",
        "text": "Just looking for some advice here - I am a recent bootcamp grad in process with two companies for a software engineering role. I am in the final stage with company A (flying out to the west coast for a final in-person interview, where I anticipate an offer) and have three more interviews with company B (all technicals and 1 HR complete, these remaining interviews are about culture and fit).   \n\n\nMy question is would it be weird to inform company B that I anticipate an offer from company A and request if they could expedite their interview process (has been around 4 weeks already)? Or should I wait until I have the offer in hand from company A and request a week to decide, hoping that company B could complete the process in that time. I just don't want to have to accept company A's offer before I know the outcome from company B (which is a better role tbh).  \n\n\nAny insights appreciated!",
        "created_utc": 1678382275,
        "upvote_ratio": 1.0
    },
    {
        "title": "Negotiating 4 day workweek?",
        "author": "Lens_no_cap",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mxt2x/negotiating_4_day_workweek/",
        "text": "Has anyone got to the point where they were able to talk their employer into allowing a 4 day work week? Did you take a reduced salary for this?",
        "created_utc": 1678382202,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day to Day In Defense",
        "author": "coolpv",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mxs3m/day_to_day_in_defense/",
        "text": "[removed]",
        "created_utc": 1678382135,
        "upvote_ratio": 1.0
    },
    {
        "title": "Historically speaking, if a recession occurs - will tech get hit hard again?",
        "author": "badboyzpwns",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mxiem/historically_speaking_if_a_recession_occurs_will/",
        "text": "It looks like tech is the only market that is getting anhiliated right now meanwhile the economy as a whole has a low unemployment rate and high inflation.\n\n Based on history (like 2001 and 2008) if the economy worsens from now and we perhaps enter a recession, can tech be impacted a lot again - like seeing round 2 and 3 of layoffs from everyone? Hard to imagine  the market getting worse when things are already rough.",
        "created_utc": 1678381497,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need advice for my next move",
        "author": "Pikapikou",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mx57e/i_need_advice_for_my_next_move/",
        "text": "I have 7 years of experience, 5 of them are in backend dev. I job hopped every year or so (today I'm around 2 years) because I never felt I'm enough in coding. I think I'm extremely good at getting the high level, explaining components and processes, how things are related, design patterns, adding comments related to clean code in PRs, however i ALWAYS fail at building from scratch. I thought this is a gap that will be fixed throughout years of exp. I do think it's a vicious circle. In interviews, I fail those LC tests. I asked to be an architect and I've been told it's too early for you. Today I'm on PIP. I have anxiety and feel burnout. The fact that I switch jobs quite often closes doors and when I get a coding challenges, I'm not that good in it. Any advice? Do I need to switch for another role? Any position? Keep going? How can I get better in programming? I feel like shit being paid while I'm not happy and cannot be as productive as I want. Thanks!",
        "created_utc": 1678380655,
        "upvote_ratio": 1.0
    },
    {
        "title": "Engineering at Charlie Health, any red flags?",
        "author": "jenyeet",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mwyi9/engineering_at_charlie_health_any_red_flags/",
        "text": "Has anyone worked with or interviewed with Charlie Health as an engineer? \n\nI was contacted by a recruiter today and I'm cautiously interested since their mission seems a little more aligned with my personal passions than working in Big Tech™️, but I can't find any info online from other engineers about their experiences working with this company. I also can't find any salary ranges posted anywhere. I understand this company is pretty new, but I figured if they have a viable product there's gotta be some engineers that already work with them in some capacity that could give me more info (outside of what this recruiter is going to tell me). \n\nAlso, if anyone has worked with Charlie Health as a patient or some other kind of employment category, I'd love to hear about your experience too!  I've always shied away from start ups, but if this one is doing good mental healthcare work and treats their employees well, I'd really consider it. \n\nThanks!",
        "created_utc": 1678380211,
        "upvote_ratio": 1.0
    },
    {
        "title": "Data structures and algorithms",
        "author": "ladyforgravy",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mwoq4/data_structures_and_algorithms/",
        "text": "Howdy erryone. I’m looking to improve my understanding of data structures and algorithms. I’m a recent bootcamp grad but I am really struggling with problems on leetcode, hackerrank etc. I’ve been advised to just practice these challenges, but I’m hitting walls with not knowing where to begin oftentimes. What are some resources I could look into to deepen my knowledge? I’m looking for instruction and deeper explanation. Thank you for your help!",
        "created_utc": 1678379556,
        "upvote_ratio": 1.0
    },
    {
        "title": "How should I negotiate my equity for a co-founder position?",
        "author": "throwaway56ye644534",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mwn94/how_should_i_negotiate_my_equity_for_a_cofounder/",
        "text": "For the past few months I've been - on the side - working for free (I feel all my Seniors spitting on me for doing that. I know, I know)  for a pre-seed startup. **Incredibly** early days for the company.\n\nWe launched a MVP for investors which failed and now we're back to the drawing board where we start all over. However, we've now been offered an official offer letter before any formal work starts and the founder has only offered 3%-5% stake in the company. I'll be expected to act, breathe and walk like a co-founder. I won't be on the \"board\" (meaning executive decision will rest solely with the founder) and there's nothing really else there to my benefit besides that aforementioned equity.\n\nThe team consists of 3 people. Two developers (myself obviously included) and the non-technical founder. We've both been offered the same amount. \n\nNow, to bring you to the issue: there's no utter way I'm working for what amounts to pittance in my eyes. I completely don't mind killing myself in my free time for a company I feel I've got serious leverage over but working for free for an indeterminate period of time before getting anything doesn't sit right with me. Especially when that \"anything\" may not even end up being much (or anything at all). \n\nSo, while I do believe in the vision and product I'm definitely willing to walk away if I'm not able to negotiate something more satisfactory. Please help me decide how to do that or if perhaps there's something I'm not considering, whether the 3%-5% is actually a good amount or whatever. \n\nThank you in advance",
        "created_utc": 1678379460,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I find people for an enthusiastic development team for commercial development?",
        "author": "Pe1ler",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mwldd/how_do_i_find_people_for_an_enthusiastic/",
        "text": "[removed]",
        "created_utc": 1678379337,
        "upvote_ratio": 0.99
    },
    {
        "title": "I'm starting a new job as a Junior Software Dev and I'm looking for advice",
        "author": "myluckhasrunup",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mwhks/im_starting_a_new_job_as_a_junior_software_dev/",
        "text": "Mostly as the title says.\n\nThis is my second time getting a job as a Jr Software Dev, however, my first time didn't end well. I was fired from that position after a week and a half and was basically told I \"wasn't a good fit for the company.\" They provided no information on my actual work or performance but mentioned that I needed more guidance than they were willing to provide.\n\nRoughly three years later I have been given another chance as a Jr Dev and I am terrified that I'm going to mess it up and the past will repeat itself.\n\nI want to do everything I can to not mess this up and keep this job! I'm looking for advice and tips on what I should be doing as a new software dev to keep this position and prove I'm competent and willing to learn.",
        "created_utc": 1678379079,
        "upvote_ratio": 1.0
    },
    {
        "title": "Graduated in June 2022, still haven't landed an internship/job, feel pretty hopeless and need advice",
        "author": "iAsian9",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mwe6n/graduated_in_june_2022_still_havent_landed_an/",
        "text": "I graduated from UW in June 2022 with a B.S. in CS. I've been applying to jobs since around October 2021 and haven't gotten an offer yet. I've been applying to all kinds of companies of all sizes. I've applied to a little less than 400 jobs so far and have only had 11 companies who wanted to interview me. I made it to the final round before getting rejected by 5 of those, which included Google and Amazon. Since July 2022, I've only had 1 interview. I haven't been getting interviews since then.\n\nI think I'm definitely qualified for an entry-level SWE position, but every time I come close it never happens. For the interviews before the final round, I feel like I almost always do pretty well on them. For the final round on-site interview, sometimes my solution ends up not covering an edge case or two, and sometimes I come close to a solution but don't get it to work. In both cases, after the interview is over and I'm out of that environment, I can almost always manage to solve the problem perfectly. I think my technical skills could always improve, but I think they're strong enough for a job and on-par with others. I've done \\~300 LeetCode questions, had my resume reviewed many times, and I think I'm good at explaining my thought process in interviews. I look for jobs on LinkedIn and AngelList. Sometimes I cold email/message recruiters but never get a reply - I introduce myself, my interest in the company, and my qualifications that fit the job.\n\nI just feel so hopeless and tired nowadays. My friends always tell me to keep trying and not to give up, but I've heard it all so many times that it sounds so meaningless now. It feels so bad seeing all my friends getting all these FAANG jobs and being able to live their lives the way they want while I've been stuck at home applying to jobs for 1.5 years with nothing to show for it. I've felt pretty bad about my life for the past few years for a lot of reasons, and not being able to land a job to move on in life is one of them.\n\nDo you guys have any advice? Do I just need to keep applying to jobs in this numbers game? Should I keep trying to improve my technical skills? Is it my [resume](https://imgur.com/a/Vp4UYNZ) that I've attached that's the problem? Do I need to create more impressive projects? Should I create/add more in general? Should they each feature different skills and technologies? How come I haven't really been able to get any interviews since July? Should I cold email more often? Should I try to always get a referral? Any insight helps.\n\nThanks for your time, I appreciate it.",
        "created_utc": 1678378848,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you navigate a toxic workplace?",
        "author": "HeavySigh14",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mwby8/how_do_you_navigate_a_toxic_workplace/",
        "text": "I posted on here before, about how in my first week, A co-worker that found a new job in the company subtly warned me away from this job and to not stop looking for a better one.\n\nEveryone said “maybe he is jealous”, “ignore him he’s bitter”, etc. \n\nWell he was right. \n\nI’ve only been here 3 months but 1/2 of the team either quit/retired/transferred. \n\n - The deadline are super unrealistic. (How do I average 50 tickets daily but you get mad when you assign me 127 tickets and I can’t complete all of them).\n\n - my co-workers are high-key rude and act irritated when I ask any sort of questions. \n\n - I’ve had other IT jobs, but this is the 1st one where I literally don’t want to get out of bed in the morning and get anxious just thinking about work.\n\n - I was hired on as hybrid and the CEO is pushing for full-time in office now\n\nI want to quit so bad but:\n\n - the benefits and pay are great. \n\n - they’ll pay for my masters degree and if I leave within two years I have to pay it all back.\n\n - I had a hard time landing this role in the 1st place.\n\n - if I can last 1 year exactly, I can apply for other roles in the company and pray that it’s not as toxic as my current one.\n\nMy manager is heavily biased to the other team members (they’re Indian and I’m American) and I only see her for our weekly 5-minute chats. Which she bails out on most of the time.\n\nI found a very nice cybersecurity internship (technically in my last semester but school is online) that I would love to apply for, but I have a hard time justifying to myself switching from a permanent position when I have rent and bills to pay, to getting something temporary only for my happiness.\n\nThoughts? I need some advice.",
        "created_utc": 1678378707,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anxiety attack",
        "author": "Momo-cupcakes",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mwbho/anxiety_attack/",
        "text": "I cant work. I cant think. \nAll I want is to close my eyes and sleep, I feel so tired and stressed.\nI wonder if this field is for me, I have only been 6 months into this job and I already want to leave. \n\nI used to be excited about coding, but now I have reduced myself to copy paste from stackoverflow or asking my coworkers for help. \n\nMy brain feels foggy, I can see people around me being annoyed especially my boss. \n\nDo I really have hope? Is there someone here who left software to become something else?",
        "created_utc": 1678378674,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm starting a new job as a Junior Software Dev and I'm looking for advice",
        "author": "Sufficient_Base_2410",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mwace/im_starting_a_new_job_as_a_junior_software_dev/",
        "text": "[removed]",
        "created_utc": 1678378598,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I find people for an enthusiastic development team for commercial development?",
        "author": "Pe1ler",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mwa5m/how_do_i_find_people_for_an_enthusiastic/",
        "text": "[removed]",
        "created_utc": 1678378585,
        "upvote_ratio": 1.0
    },
    {
        "title": "What branch of software engineering has the most opportunities/jobs for internships?",
        "author": "bobby4357",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mw9qo/what_branch_of_software_engineering_has_the_most/",
        "text": "As the title states. \n\nI feel like I am being left behind when compared to my peers who are getting internships and I think my stack isn't benefiting me the most to broaden my chances.",
        "created_utc": 1678378556,
        "upvote_ratio": 1.0
    },
    {
        "title": "Network engineer internship",
        "author": "FearlessFisherman333",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mw8ot/network_engineer_internship/",
        "text": "It's possible I could get a network engineering internship this summer, but there are a couple problems. The first is that the company that's offering the internship is a Chinese real estate firm, but I'm not sure how employers will view a remote internship from a Chinese firm. The second is that this internship is really an IT internship and not a SWE internship, so would it not be relevant as work experience for any SWE jobs I apply to in the future.",
        "created_utc": 1678378487,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which Data Science Track would be more impressive for employers?",
        "author": "NoRefrigerator726",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mw5ce/which_data_science_track_would_be_more_impressive/",
        "text": "Lately I've been thinking a lot about which Data Science track to choose between. For context, I am already doing a Computer Science major. I'm almost done (as a sophomore) so I have quite a bit of time left and would like to declare DS as well.\n\nMy options are the statistics track, and the finance + economics track. I don't have any preference for either. I just want to choose the one that will benefit me the most in the long run. My professor told me that the math is better as math expertise is needed for a lot of financial institutions.\n\nAt first I was leaning towards finance and economics because I love trading options and investing, but I realized that the courses on this track won't necessarily be about options.\n\nDoes anyone have any thoughts.",
        "created_utc": 1678378259,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I still get apply to Amazon in March?",
        "author": "snowplums99",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mw4sp/should_i_still_get_apply_to_amazon_in_march/",
        "text": "[removed]",
        "created_utc": 1678378223,
        "upvote_ratio": 1.0
    },
    {
        "title": "Graduated in June 2022, still haven't landed an internship/job, feel pretty hopeless and need advice",
        "author": "joblessthrowaway9",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mw1uj/graduated_in_june_2022_still_havent_landed_an/",
        "text": "[removed]",
        "created_utc": 1678378038,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling stuck at Big Tech",
        "author": "doc_multimedia",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mvoa1/feeling_stuck_at_big_tech/",
        "text": "[removed]",
        "created_utc": 1678377178,
        "upvote_ratio": 1.0
    },
    {
        "title": "Web development specialization vs enterprisey engineering specialization?",
        "author": "spreadlove5683",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mvms9/web_development_specialization_vs_enterprisey/",
        "text": "Just wanting to know the pros and cons of specializing in something like Node.js, React, etc perhaps at a big company (enterprise?) setting vs something like being an enterprise Java developer.",
        "created_utc": 1678377072,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to transition from Junior Software Developer to Cloud Engineer/DevOps. But my work history is flaky. Any tips?",
        "author": "ProGaben",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mvlkf/i_want_to_transition_from_junior_software/",
        "text": "Basically, my work history is really spotty with a 1.5yr gap after college where I went into HD for over a year, then went back into programming at another place for 4 months, and then was at the last job for a year and there's been a 6 month gap. So basically if I'm an employer and I saw that, I'd be nervous because I'd think there's a very decent chance I'd leave right after they got me trained and they'd get little to no ROI. So I'm wanting to try and find a job I can stay at for 3-5 years, and I want it to get me closer to a Cloud Engineer/Devops position.\n\nI think I really struggle in a purely dev position due to ADHD and it being hard to maintain interest in programming 100% of the time for my technical work (and meetings but I hated meetings), but I still enjoy programming and think I'd rather have it be more scripting and fixing bugs that's preventing the code from deploying. My favorite part of dev was getting my code to deploy and I had a blast playing around with Docker and Kubernetes and I absolutely love being on a linux shell which made building docker images and hoping on the GCP's linux shell lots of fun. And from Helpdesk I enjoyed writing powershell and doing the AD/DS and Google Admin stuff, and I enjoyed the ticket format because they're short straightforward tasks and knowing that a user can't do their job and needs my help is very motivational for me to get that done asap. So that's why I was thinking something more along the lines of the Cloud or maybe DevOps.\n\nSo are there any suggestions for what I can do for my next job? I don't have the money or time right now to get certs, so if that's a barrier I need to find a job that will enable or encourage me to get those certs.",
        "created_utc": 1678376995,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to transition from Junior Software Developer to Cloud Engineer/DevOps. But my resume is flaky. Any tips?",
        "author": "ProGaben",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mvk76/i_want_to_transition_from_junior_software/",
        "text": "[removed]",
        "created_utc": 1678376900,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do I do if my mistake at work is presented to the whole team without my permission?",
        "author": "URappletea",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mveoa/what_do_i_do_if_my_mistake_at_work_is_presented/",
        "text": " I was working on a PR that came with some issues I didn’t know exist at first. One of the senior devs who reviews our team's code noticed that and decided it’s a “good” idea to show this at our team knowledge-sharing session. He didn't tell me he was gonna do it of course. Basically, he just showed everyone on the team what dumb mistakes I made, and what a waste of time my work was considering the fact that now I have to redo the whole thing.\n\nEven though I agree with what he said, this still makes me feel extremely uncomfortable. I don’t like my hard work being discussed and presented like that without my consent, especially when it’s to show how bad my work is. Am I being too sensitive? It just feels very insulting, and I feel like I really need to do something to respond here.",
        "created_utc": 1678376527,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is committing suggestions right on GitHub bad style?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1678375874,
        "upvote_ratio": 1.0
    },
    {
        "title": "Consulting firm wants me to change my skill set but I'm not sure what to change to",
        "author": "darcstar62",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mv2lb/consulting_firm_wants_me_to_change_my_skill_set/",
        "text": "I'm an older developer that's been doing software engineering for many years, mainly back-end Java. However, my current employer (I've been there 8 years and am pretty happy there) is seeing most of the Java work drying up and they're (luckily) wanting to retrain me. My manager has is pushing me towards either React (so I can be full-stack) or Node (since that's what most of the backend work is looking like now). I know this is a pretty open-ended question with no easy answer but since I have to make a decision by next week I was just looking for what things I should consider. \n\nIf it matters I'm in the SE US but we have clients all over the US. All work is remote.",
        "created_utc": 1678375708,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s my job title?",
        "author": "GrumpySh33p",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mv01c/whats_my_job_title/",
        "text": "I’ve been working for over 1.5 years in the role. This is my first job in the tech field. I get paid 98k. Here is a short list of my responsibilities:\n\n- bug and defect root cause analysis\n- triage bug and defect tickets made by nontechnical staff\n- fix bugs and defects when able to\n- work closely with QA team to ensure adequate testing — occasionally writing tests \n- one person role\n\n\nI write code, dig through the code base, but I only fix bugs and defects. It’s meant to be a temporary role at my company, and there is word of me moving over to the product engineering team. However, our company is having some hard times and we lost a lot of product managers, so it’s possible that this move will be delayed. \n\nMy current title doesn’t represent my role well. Management is happy to change my title to whatever makes sense, which I think will help me when it comes to applying to new roles. Currently it’s difficult to apply to anything but junior level roles, but I feel I’m significantly more skilled than a junior level… though I’m not sure I really qualify for mid level. \n\nI’m not going to name my job title. I’m just curious about what everything thinks would be a fitting one.",
        "created_utc": 1678375533,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resources to learn C# For a Beginner.",
        "author": "Dear_University_558",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11muuml/resources_to_learn_c_for_a_beginner/",
        "text": " Like the heading, I intend to try my hand on a backend language and my choice is C#, what materials - books, videos and websites will be helpful in my learning journey?",
        "created_utc": 1678375177,
        "upvote_ratio": 1.0
    },
    {
        "title": "Awkward Question",
        "author": "unreliable_noob",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mud0g/awkward_question/",
        "text": "After 40 years of working menial jobs, I decided to go to school and get a computer programming degree. Upon graduation, I landed my first job as an Associate SE working 100% remote making more money than I ever have before.\n\nBut here's where things get weird. I am the most junior person on my squad obviously, but it feels like I do more work than anyone else. It feels like more senior people are looking for reasons to call their stories blocked, while I'm knocking out 3-4 pull requests per sprint and when I find a block, if I know how, I simply unblock myself.\n\nThe question is it takes me on average about 8 hours per sprint (2 week period) to do all my work and then pull in additional PRs from the backlog. I barely do any work it feels like and make more money than any other job I've ever had, where they want every second of their 40 hours for that minimum wage and you better clock out if you are even going to scratch your balls.\n\nIs this normal or am I just lucky or what? I have asked every level of leadership if my work is adequate/how I can contribute more and they all say I'm doing phenomenal. Life has never been so easy, what am I missing???",
        "created_utc": 1678374009,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I underestimating myself?",
        "author": "ThePetiteOtaku",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mtw5r/am_i_underestimating_myself/",
        "text": "[removed]",
        "created_utc": 1678372827,
        "upvote_ratio": 1.0
    },
    {
        "title": "Applying for a job as a double major in Physics and Computer Science",
        "author": "Bigchungga985",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mt81e/applying_for_a_job_as_a_double_major_in_physics/",
        "text": "[removed]",
        "created_utc": 1678371147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career Advice for Young Widow - BA/BSA or Pivot",
        "author": "Relative_Ask6134",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mt7uq/career_advice_for_young_widow_babsa_or_pivot/",
        "text": "[removed]",
        "created_utc": 1678371135,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I considered a senior eng?",
        "author": "bghlions",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mt34r/am_i_considered_a_senior_eng/",
        "text": "[removed]",
        "created_utc": 1678370807,
        "upvote_ratio": 1.0
    },
    {
        "title": "A recruiter contact me for a job as a software designer, but I doubt have the necessary experience",
        "author": "IndependentPudding85",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mt2wo/a_recruiter_contact_me_for_a_job_as_a_software/",
        "text": "[removed]",
        "created_utc": 1678370791,
        "upvote_ratio": 1.0
    },
    {
        "title": "From Forms/WPF to React/Angular. Will I have to start from scratch?",
        "author": "xXguitarsenXx",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11mt234/from_formswpf_to_reactangular_will_i_have_to/",
        "text": "I'm looking for full-stack and I have 2 competing job offers:\n\n**Job 1:** Good frontend technologies, but LESS interesting backend\n\n* **Frontend:** React &amp; typescript\n* **Backend:** C# .net core &amp; Microsoft SQL server\n* **Additional skills:** Mobile app in React Native or Flutter\n\n**Job 2:** Bad frontend technologies, but a MORE interesting backend\n\n* **Frontend:** Forms, WPF &amp; 3d modeling (OpenGL/WebGL)  \n* **Backend:** C# .net core &amp; PostgreSQL\n* **Additional skills:** Microservices, Kubernetes, Docker, and Machine learning.\n\n&amp;#x200B;\n\nSo basically Job 1 has much more popular technologies for the frontend, while job 2 has much more popular additional skills for the backend (Microservices, Kubernetes, Docker, and Machine learning).\n\n&amp;#x200B;\n\n**My questions**\n\n1. Will I have to start from scratch if I take job 2 with Forms/WPF and later want to learn Angular/React? \n2. Which job would you choose and why?",
        "created_utc": 1678370734,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career Direction Advice for Young Widow - BA/BSA or Pivot",
        "author": "Relative_Ask6134",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11msunq/career_direction_advice_for_young_widow_babsa_or/",
        "text": "[removed]",
        "created_utc": 1678370232,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cobol/C/Oracle etc options in the market.",
        "author": "panguardian",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11msnag/cobolcoracle_etc_options_in_the_market/",
        "text": "I recently started work as a cobol programmer. My employer informed me verbally that the team is virtual. Now they are talking about working in the office. I am an hour's journey from the office.\n\nAs such, I am looking at my options for changing jobs. What are my prospects as a cobol programmer or a C/Oracle programmer. I am looking at WFH and contract/consultant positions.\n\nIn terms of future work, how marketable is cobol? Am I wasting my time learning it? Is it possible to get WFH contract positions?\n\nFor context, I'm a middle-aged Oracle/C programmer (10 years experience) returning to the market after a very long hiatus. I recently completed a diploma focusing on C#/Java/Oracle/SQL Server.",
        "created_utc": 1678369706,
        "upvote_ratio": 1.0
    }
]