[
    {
        "title": "What is a good starting industry salary usually?",
        "author": "rosey_demoness",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nqtqd/what_is_a_good_starting_industry_salary_usually/",
        "text": "Hey yall. I'm a senior in Comp Sci and will be graduating soon, and immediately going to grad school for an MBA in Business Analytics. I'll also have a year and a half of IT work experience by the time I graduate, as well as other previous non-IT related experience. I also will be working a really good internship this summer for a major banking company so I'll also have that experience. \n\nI was wondering what is usually an acceptable starting wage coming out of college for someone trying to enter into software engineering? I'm starting to look at what I might be wanting job wise, but Idk what an appropriate starting salary range usually would be. Do anyone have any advice or some insight about it?",
        "created_utc": 1678458899,
        "upvote_ratio": 1.0
    },
    {
        "title": "The weird leverage of AI in Business talks",
        "author": "IntrovertiraniKreten",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nqeev/the_weird_leverage_of_ai_in_business_talks/",
        "text": "Hi,\n\nI promise this is not an ChatGPT is eating our jobs, post.\n\nAI seems to be a useful tool for some of our problems, but it seems to be even more of a marketing and sales tool than a building/solving tool at it's core, so I always start very defensive in conversations about this topic.\n\nIt is a good topic to filter out the real professionals from the talkative-do-nothings imho, but I sometimes really get into interesting topics on behalf of AI from some coworkers that did freaky stuff during their master/phd programs. I had some schooling on the topic, but it didn't interest me at the time for personal reasons. It didn't really stick well, tbh.\n\nI didn't dive really deep in AI. I have seen some neural networks, done some weight calculations and didn't understand shit about them, so I dropped the topic completely after solving.\n\nI did use some object detection tools, and a bit of stuff with sounds, more as an observer than really actively working on it. It wasn't as fun as the topic(forensics) which we had to describe at this time.\n\nDid anyone reading this have some really good stories about working with AI that is not used as a sales-pitch? I am all for pragmatic work and like doing useable things with all the projects I am on, but I really think that the overuse of AI in CS-unrelated conversations is making the really interesting topic less attractive.\n\nPlease share some interesting pragmatic AI solutions you and your teams worked on. If nothing else, this might be an inspiration source for new grads.",
        "created_utc": 1678457813,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for (probably overthinking) first-year CS student",
        "author": "Cxly",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nqce2/advice_for_probably_overthinking_firstyear_cs/",
        "text": "I'm in my first year of compsci and I really want to get into software engineering when I graduate. I'm not struggling with my degree, but I want to build up a background now to try and stand out and get some experience, but I'm stuck on the best way to do it.\n\nI keep going through a cycle of starting a new thing, keeping with it for a few days up until I start going \"ah, well I'll learn it later in my degree anyway, so what's the point?\", then the next shiny new thing comes along and the cycle repeats anew.\n\nBecause of this, I'm decent with the syntax of like, 8 different languages, but couldn't identify or use a single library in them to save my life, outside of a few console apps and web scrapers. It's worrying me because it makes me feel pretty useless, honestly.\n\nI wanted to know: what is the #1 thing you would do with your time in my position?",
        "created_utc": 1678457672,
        "upvote_ratio": 1.0
    },
    {
        "title": "Job Dilemma: Stay at Consultancy Company or Take New Job Offer, Wait for MS. possible offer, and What Level Would I Join?",
        "author": "Western_Giraffe9517",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nq6kq/job_dilemma_stay_at_consultancy_company_or_take/",
        "text": "[removed]",
        "created_utc": 1678457254,
        "upvote_ratio": 1.0
    },
    {
        "title": "Job Dilemma: Stay at Consultancy Company or Take New Job Offer, Wait for Microsoft possible offer, and What Level Would I Join?",
        "author": "Western_Giraffe9517",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nq3z2/job_dilemma_stay_at_consultancy_company_or_take/",
        "text": "[removed]",
        "created_utc": 1678457074,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did I mess up my carrier after 20 years? Is it the job market? Not sure how to move forward.",
        "author": "RangerHere",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11npvc1/did_i_mess_up_my_carrier_after_20_years_is_it_the/",
        "text": "TLDR at the bottom.\n\nHello everyone,\n\nI have a feeling that I might have messed up my career after 20 years. From 2000 to 2020 I worked as an engineer doing C/C++/Linux development. I was quite good at it. From 2011 to 2020, I worked at one of the top 20 engineering companies in the world. Back in those days, I would get 10+ recruiters reach out to me a week on LinkedIn. \n\nIn 2020, my team got laid off. I decided to follow my friends footsteps who was making more money while traveling the world by doing freelance web development jobs. I had another close friend with 15 years of front end development experience join me. I learned Django and started doing back-end. He was doing front-end using React. \n\nSoon after I started my company, one of my parents got diagnosed with Dementia and the other one got diagnosed with Alzheimer and heart problems. I moved back to my country of birth to help them however I can. By mid 2022, I had only developed 3-4 sites for clients using Django and I had no front-end experience.\n\nMid 2022, an old coworker who knows my work ethics and the quality of my work reached out to me and asked me if I wanted to work with him once more in the company he was working at. I told him about my obligations towards my family and he assured me that I would not need to work more than 40 hours a week.  He was a manager at that company. I told my lack of coding in the last 2 years and he suggested that I should take the interview anyways. He was confident that I could breeze through the interview given my past experience. \n\nI was hired to do back-end rest API, pretty much basic CRUD. The problem is that, a month after I was hired my old coworker quit and we had a new manager. For some reason new manager decided that I would be a good match for infrastructure. I asked for a few days to think about this and do a little bit of research on infrastructure. I was told I should make the decision ASAP. I made the decision after 15 minutes of google search. \n\nI accepted the new role and started working in infrastructure. I spent the last 8 months doing infrastructure there. Last month we decided to separate ways because my responsibilities at the company required me to work around 50-60 hours a week, I was making mistakes with infrastructure, and if I was not confident something was not the right way to do it I delayed the project instead of doing something I did not understand.\n\nFor the last 3 weeks, I am trying to land new jobs and nobody is calling back. For C/C++/Linux development jobs I think I'm not receiving calls because I did not do any of these skills for the last 3 years.\nFor Django jobs, I think I'm not receiving any calls because I have only done 5-6 projects with Django.\nFor infrastructure jobs, I think I'm not receiving any calls because I only have 8 months of experience and no certificates.\n\nAt this point, I do not know what to do. Should I sharpen my C/C++/Linux skills and keep applying for those jobs? Should I sharpen my Django skills and keep applying for those jobs? Should I sharpen my infrastructure skills and keep applying for those jobs? I have no idea what to do next.\n\nTLDR: I did C/C++/Linux for 20 years. Then I did Python/Django on and off for 2 years with only 4 clients. Then I did 9 months infrastructure/Terraform/Docker/Kubernetes. Nobody is returning my applications on LinkedIn for the last 3 weeks. Is it my experience being all over the place in the last 3 years? Is it the job market? Which skill should I focus? I am in Eastern Europe one parent with dementia other with Alzheimer and hearth problem.",
        "created_utc": 1678456515,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did anyone else absolutely NOT struggle to switch jobs / break into tech / get a job in this market?",
        "author": "yeahdude78",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11npsi6/did_anyone_else_absolutely_not_struggle_to_switch/",
        "text": "This isn't to rub this in anyones face, or come off as bragging or anything like that. So I apologize if it does.\n\nI know the market isn't the best right now, but I had absolutely no issues finding a new job (2 YoE, bachelors in CS but just from a state university), grinded some LeetCode and System Design, had multiple interviews and offers.. felt exactly like it did last year / last few years.\n\nSo with that being said, is this just another case of this sub being an echo chamber (people who are happy with their career and find jobs are much less likely to post about it), or is the market really that bad and I just got lucky?\n\nDid anyone else absolutely NOT struggle to switch jobs / break into tech / get a job in this market?",
        "created_utc": 1678456326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did anyone else absolutely NOT struggle to switch jobs / break into tech / get a job?",
        "author": "yeahdude78",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11npohy/did_anyone_else_absolutely_not_struggle_to_switch/",
        "text": "This isn't to rub this in anyones face, or come off as bragging or anything like that. So I apologize if it does.\n\nI know the market isn't the best right now, but I had absolutely no issues finding a new job (2 YoE, bachelors in CS but just from a state university), grinded some LeetCode and System Design, had multiple interviews and offers.. felt exactly like it did last year / last few years.\n\nSo with that being said, is this just another case of this sub being an echo chamber (people who are happy with their career and find jobs are much less likely to post about it), or is the market really that bad and I just got lucky?\n\nDid anyone else absolutely NOT struggle to switch jobs / break into tech / get a job?",
        "created_utc": 1678456054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it worth trying to get more wfh flexibility from my manager?",
        "author": "myth979",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11npiss/is_it_worth_trying_to_get_more_wfh_flexibility/",
        "text": "My employer has really buckled down on the new hybrid model and it’s been burning me out. I otherwise like the company and coworkers, but the current environment doesn’t feel sustainable for me.\n\nWould it be a bad idea to bring this up to my manager to see if there’s any flexibility in the policy?",
        "created_utc": 1678455657,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it worth trying to get more wfh flexibility from my manager?",
        "author": "anon0917161",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11npat3/is_it_worth_trying_to_get_more_wfh_flexibility/",
        "text": "[removed]",
        "created_utc": 1678455102,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dev-10 assessment test",
        "author": "PlexyClass",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11np3au/dev10_assessment_test/",
        "text": "[removed]",
        "created_utc": 1678454561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is working 1-2 hours a day as a front end developer possible?",
        "author": "heygents",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nonml/is_working_12_hours_a_day_as_a_front_end/",
        "text": "I'm a senior web developer contractor having worked remotely and internationally for several years. Finding remote work, full-time or even \"standard\" part-time, is not an issue.\n\nHowever, I'm looking to work only 1-2 hours per day at the moment, which appears to be something most clients shy away from regardless of one's level of experience.\n\nIs this possible to achieve in the industry? If so, where to look for such an opportunity?",
        "created_utc": 1678453408,
        "upvote_ratio": 1.0
    },
    {
        "title": "A CS fresh grad in a third-world country, looking for advice!",
        "author": "EgyptianPhantoming",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nom4o/a_cs_fresh_grad_in_a_thirdworld_country_looking/",
        "text": "Hey. So I'm a fresh graduate currently living in a third-world country. We have very limited opportunities in this field so I was wondering if anyone knows how to actually land a remote job abroad. (Even if It's for $1000/month, still great money living here). \n\nI have no actual work experience. Done 2 internships. Took a cloud course on Udacity. Currently taking Meta's Backend Certificate on Coursera. Any ideas? Any personal advice?",
        "created_utc": 1678453306,
        "upvote_ratio": 1.0
    },
    {
        "title": "Broadening skills",
        "author": "Money-always-talking",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nojkk/broadening_skills/",
        "text": "\nI’m graduating in December and I see that a lot of companies ask for experience with things like Hadoop, Spark, Kubernetes, Jenkins, Spinnaker, or Docker or want experience with CI/CD. How can I practice these things or similar in personal projects?\n\nI have no problem with building software, back or front end, but when it comes to things like this that don’t really apply to my single person local personal projects i’m at a loss.\n\nShould I even be worried about this or is grinding algorithms for interviews where my focus should be right now?\n\nAny help or insight is appreciated.",
        "created_utc": 1678453141,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asking?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1678453126,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is working 1-2 hours a day as a front end developer possible?",
        "author": "webdevthrowaway325",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11noib2/is_working_12_hours_a_day_as_a_front_end/",
        "text": "[removed]",
        "created_utc": 1678453044,
        "upvote_ratio": 1.0
    },
    {
        "title": "Broadening skills",
        "author": "mycsburner",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nohog/broadening_skills/",
        "text": "[removed]",
        "created_utc": 1678453000,
        "upvote_ratio": 1.0
    },
    {
        "title": "DE Shaw OA dilemma.",
        "author": "heroesIV",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nodhj/de_shaw_oa_dilemma/",
        "text": "[removed]",
        "created_utc": 1678452691,
        "upvote_ratio": 1.0
    },
    {
        "title": "With the job market so bad, are some cities doing better than others?",
        "author": "level_126_programmer",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nod51/with_the_job_market_so_bad_are_some_cities_doing/",
        "text": "Since the bay area and Seattle are mostly tech companies, I imagine the job market there would be worst than other cities.\n\n\n\n\n\n\nI could imagine that other cities with a wider range of big industries doing better, like LA, NYC, and Boston.  Is this correct?",
        "created_utc": 1678452667,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much % increase should I negotiate for a salary increase for internal promotion?",
        "author": "Sad-Elderberry6897",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11no1vk/how_much_increase_should_i_negotiate_for_a_salary/",
        "text": "So I told my employer that I might be leaving my current job and the hiring manager agrees to give me an internal promotion to the next level. So the salary range for this position is 120-200 and one of my coworkers was given 155 and he negotiated to 180, he was a new hire with less prior experience than me, and my hiring manager always mentioned to me that \\[budget is not a concern\\] for our team with our prior 1 on 1s and he always complement sin 1 on 1s. So based on this, how much percent increase would you ask for? I wanted to ask for 210 but I think that is too much? (40%) Any manager/ppl who went through this process can you give some advice?",
        "created_utc": 1678451837,
        "upvote_ratio": 1.0
    },
    {
        "title": "How impressive would a social media app be?",
        "author": "AdministrativeDisk28",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nmg8j/how_impressive_would_a_social_media_app_be/",
        "text": "I’m currently a sophomore computer science student. I’ve been learning web development for about 1 year now through TheOdinProject. My question is how impressive to employers would a facebook clone be? I want to build one big project that will guarantee me a internship/job.\n\nIt would all be built from scratch(not following a tutorial).\n\nFeatures:\nFriends, friend requests, messaging with friends , wall posts with likes and dislikes, messaging strangers on a chatroom.\n\nFrontend: HTML, CSS, Js, react, Sass, and bootstrap.\n\nBackend: Nodejs, express, and mongodb.",
        "created_utc": 1678447292,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is SharePoint Development a good career path?",
        "author": "Hedgehog8964",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nmffh/is_sharepoint_development_a_good_career_path/",
        "text": "Curious.",
        "created_utc": 1678447227,
        "upvote_ratio": 1.0
    },
    {
        "title": "How fast was your hiring process?",
        "author": "spicybike2020",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nm4zj/how_fast_was_your_hiring_process/",
        "text": "I applied for a position at a large health insurance-based company. They recently did some big merges and the position I applied for is for a pharmacy based wholesale company. I applied, got an email to do an interview with the actual department heads(no screening call or anything). The two department managers said they thought I would be a great fit and the recruiter should reach out next week or so. I didn't have their emails since it was set up by the recruiter and again, just a first interview. THREE weeks go by and the recruiter gets back to me(mind you I did send a follow up email to her after my initial interview). We set up a time to talk and she explained this process is slightly backwards now due to the merge and the company I applied for still tries to operate as \"smaller\" where they need people and wang to get the ball rolling on hiring. She explained I'm on a short list for next round and it should only be one more round. She also went over pay structure. I followed up via email a few days after since she couldn't actually confirm interview times for next steps. THEN an \"interview scheduler\" reached out to me with two times. I respond saying the first option is better for me but I could also make the second time work, too. Emails back that they are going to do the second time and that I'll get a confirmation email today. It seems like this company thought having recruiters have multiple assistants was a good idea but this is a mess and really not making me want to work there. The recruiter said she believes there shouldn't be more than three interviews total for any role(initial phone call, one on one/two managers, panel interview) but REALLY? It takes TWO months to do that? BOTH calls they asked if I could start 2-3 weeks after an offer. UH SURE but maybe I'll take 2-3 weeks to confirm the offer?!! If you are in such a rush get this moving.",
        "created_utc": 1678446326,
        "upvote_ratio": 1.0
    },
    {
        "title": "market is really really rough",
        "author": "slaaneshStoic",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nlknn/market_is_really_really_rough/",
        "text": "Currently looking for a job.\n\nTwice aced a technical interview and a soft skills interview.\nJust to get the message.\nAt the first:you are a perfect fit but with the current economy we are looking for a more senior profile.\nAt the second: perfect fit but with the current economy we can't afford to hire a second junior profile.\n\nI have 2 years of experience but had to quit in December due to mental issues.\n(no use for doing anything about it, they gave me the choice be fired or quit had a depression) \n\nNow I'm looking and losing hope.\n\nJust wanted to share",
        "created_utc": 1678444511,
        "upvote_ratio": 1.0
    },
    {
        "title": "Distributed Systems or ML focus for overall job security and TC?",
        "author": "Joey_Laurent",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nl2b0/distributed_systems_or_ml_focus_for_overall_job/",
        "text": "[removed]",
        "created_utc": 1678442792,
        "upvote_ratio": 1.0
    },
    {
        "title": "the current market is so though",
        "author": "slaaneshStoic",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nkyft/the_current_market_is_so_though/",
        "text": "[removed]",
        "created_utc": 1678442446,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help - struggling with self-studying",
        "author": "-Alexiel-",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nkezo/help_struggling_with_selfstudying/",
        "text": "Hey guys, I am a software engineer with about 4 years of experience, I recently got my degree (B. Sc. Software Engineering) and now I want to build a solid foundation in CS, particularly mathematics and algorithms.\n\n(Before you ask - I didn't put enough effort into studying, while I was in uni and it has now caught up with me and I want to change that ASAP.)\n\nI have begun working through the free MIT course \"Mathematics for Computer Science\", but I find it really difficult to understand the concepts and I can't seem to solve the most basic problems at the very beginning of this course.\nI don't consider myself a smart person, which is why I am asking for guidance here - I am getting really discouraged and it's taking a toll on my mental health.\nShould I try and continue to study this course, failing all tests or maybe there's some better strategy that I can adopt?\nI find that I understand things better if I can see a visual interpretation or a direct application of the concept, which is something I am struggling to find since mathematics is pretty abstract. \nAre there courses that teach these concepts in a more visual way or maybe there are strategies to visualize these abstract concepts by oneself?\n\nI would really appreciate some help and advice.",
        "created_utc": 1678440653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hypothetically, if the whole software engineering or webdev or data analyst industry just disappears tomorrow, what would you guys do?",
        "author": "Notalabel_4566",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11njwbg/hypothetically_if_the_whole_software_engineering/",
        "text": " Just asking for fun. Which other career would you guys think of getting into.",
        "created_utc": 1678438889,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal to sometimes not have much to do in a new job?",
        "author": "Willfull_Waldo",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nj9mk/is_it_normal_to_sometimes_not_have_much_to_do_in/",
        "text": "[removed]",
        "created_utc": 1678436689,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal to sometimes not have a lot to do in a new job?",
        "author": "Willfull_Waldo",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nj8ja/is_it_normal_to_sometimes_not_have_a_lot_to_do_in/",
        "text": "[removed]",
        "created_utc": 1678436580,
        "upvote_ratio": 1.0
    },
    {
        "title": "How bad is the market right now for mid/senior level?",
        "author": "Kxdan",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nj5rz/how_bad_is_the_market_right_now_for_midsenior/",
        "text": "Just got laid off from a FAANG company, completely out of nowhere like many others.\n\nI’m job hunting, mid to senior level and I’m coming across some internal openings that seem a huge downgrade. Terrible WLB, regular on call, no remote, grunt level work type stuff. But they’d let me stay at the company (at a huge personal cost)\n\nOr I can take my severance and hunt elsewhere. I’m not desperate, but I don’t really know how bad the market is. For the others out there who have been laid off and are hunting, how desperate is it? Should I just take anything that’ll pay the same at this rate? \n\nAbout me:\n\nMy TC was around 200k. I have 5 years of FAANG experience on several different teams, several successful side projects and an award winning non profit I’ve run on the side. My resume is decent and I can communicate well.",
        "created_utc": 1678436313,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I continue to study",
        "author": "gleefulSwift",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11niw87/should_i_continue_to_study/",
        "text": "[removed]",
        "created_utc": 1678435417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daily Chat Thread - March 10, 2023",
        "author": "CSCQMods",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11niva8/daily_chat_thread_march_10_2023/",
        "text": "Please use this thread to chat, have casual discussions, and ask casual questions. Moderation will be light, but don't be a jerk.\n\nThis thread is posted **every day at midnight PST**. Previous Daily Chat Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Daily+Chat+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
        "created_utc": 1678435331,
        "upvote_ratio": 1.0
    },
    {
        "title": "[OFFICIAL] Monthly Self Promotion Thread for March, 2023",
        "author": "CSCQMods",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11niuhz/official_monthly_self_promotion_thread_for_march/",
        "text": "Please discuss any projects, websites, or services that you may have for helping out people with computer science careers.\n\nThis thread is posted **the first Sunday of every month**. Previous Monthly Self Promotion Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Monthly+Self+Promotion+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
        "created_utc": 1678435271,
        "upvote_ratio": 1.0
    },
    {
        "title": "DEAR PROFESSIONAL COMPUTER TOUCHERS -- FRIDAY RANT THREAD FOR March 10, 2023",
        "author": "CSCQMods",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nitsz/dear_professional_computer_touchers_friday_rant/",
        "text": "AND NOW FOR SOMETHING ENTIRELY DIFFERENT.\n        \nTHE BUILDS I LOVE, THE SCRIPTS I DROP, TO BE PART OF, THE APP, CAN'T STOP\n        \nTHIS IS THE RANT THREAD. IT IS FOR RANTS.\n\nCAPS LOCK ON, DOWNVOTES OFF, FEEL FREE TO BREAK RULE 2 IF SOMEONE LIKES SOMETHING THAT YOU DON'T BUT IF YOU POST SOME RACIST/HOMOPHOBIC/SEXIST BULLSHIT IT'LL BE GONE FASTER THAN A NEW MESSAGING APP AT GOOGLE.\n\n(RANTING BEGINS AT MIDNIGHT EVERY FRIDAY, BEST COAST TIME. PREVIOUS FRIDAY RANT THREADS CAN BE FOUND [HERE](https://www.reddit.com/r/cscareerquestions/search?q=Friday+Rant+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).)",
        "created_utc": 1678435214,
        "upvote_ratio": 1.0
    },
    {
        "title": "Team Guidelines and Interactions: “User Manuals”",
        "author": "talentindex",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nisyx/team_guidelines_and_interactions_user_manuals/",
        "text": "[removed]",
        "created_utc": 1678435141,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got accepted into a boot camp, but I'm still worried",
        "author": "ejvibes19",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11niksd/got_accepted_into_a_boot_camp_but_im_still_worried/",
        "text": "Hi everyone, just got accepted into a boot camp but I wanted to hear some opinions and advice on how I should proceed going forward.\n\nHere's some background info on my current situation: I've attended some college, but dropped out so I have NO degree at all. My resume as of now is just a couple of years of restaurant experience. I don't plan on attending the boot camp until later this year, maybe in July (mostly because of the job market from what I hear). Happy to provide more details if necessary.\n\nI guess what I'm worried about is that it seems like I probably won't be a desirable candidate for companies even after graduating from a boot camp specifically because of the lack of a college degree. So I am leaning towards pursuing a bachelor's at an online school like WGU as well (would be in CS). Which leads to some questions:\n\nShould I do one or the other? Or should I do both? Would it look bad on my resume to do both? What would you do if you were in my shoes?\n\nIt feels weird because it felt like a huge weight has been lifted off my shoulders after getting into the boot camp, but now I feel even more uncertain about the future. Any opinion would be greatly appreciated! Thanks in advance.",
        "created_utc": 1678434370,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long does it typically take for Revature to get back to you after submitting an application?",
        "author": "DepressedGarbage1337",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nigv2/how_long_does_it_typically_take_for_revature_to/",
        "text": "I sent in an application about a month ago and haven't heard anything since.",
        "created_utc": 1678434011,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would you quote for these sites?",
        "author": "daveywavey42",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nhy36/what_would_you_quote_for_these_sites/",
        "text": "[removed]",
        "created_utc": 1678432327,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I work for less compensation than my previous internship?",
        "author": "Cocaine_Is_Life",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nhp8m/should_i_work_for_less_compensation_than_my/",
        "text": "Hi, everyone, I am a flutter developer, based in Kolkata. \n\nLast year, September I got an offline intern position in a service based company where they were paying me X amount per month, I completed my 3 months internship then was looking for my next work. \n\nI applied at many companies but found that none of the companies were ready to pay me the same amount or more than my previous stipend. I am pretty decent at my job I can make beautiful UIs they are impressed by my work but won't pay.\n\nMost companies listed their compensation half or less than half of what I used to get. I am getting demotivated and am confused if I should or shouldn't devalue myself by joining a work with less compensation. \n\nIs my experience matters more than my stipend or my previous compensation values me more when I look for my next work?\n\nI am currently pursuing BCA and going to do MCA.",
        "created_utc": 1678431583,
        "upvote_ratio": 1.0
    },
    {
        "title": "Breaking Into CS",
        "author": "iAmWasabi",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nhfhq/breaking_into_cs/",
        "text": "[removed]",
        "created_utc": 1678430723,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else noticed recruiters are ghosting a lot more?",
        "author": "limadeltakilo",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nheat/anyone_else_noticed_recruiters_are_ghosting_a_lot/",
        "text": "I have started looking for a new position the past couple months and have reached out to around 20 recruiters most of them being people I have talked to in the past and only had 2 of them get back to me and even take a look at my resume. I don’t know if it’s because I don’t have the open for work banner on LinkedIn or if they are just flooded but it seems almost impossible to get a hold of anyone lately.\nMany of them will connect with me so I send them a message and 2 months will pass with no response. Some of the ones I have worked with before I have pinged multiple times but still won’t get any type of response. Anyone else run into this issue or know what the cause may be? \nI’ve added some pretty substantial experience to my resume since last time I looked for a job so I am genuinely confused.",
        "created_utc": 1678430625,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does “Swipe QA” intern mean?",
        "author": "Willy988",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nhaj7/what_does_swipe_qa_intern_mean/",
        "text": "I have an option to interview in this position at Match-Affinity, and other than the obvious QA = Quality Assurance, I’m a bit lost in my searches. What basically is expected of someone in this position? Not sure if this is the right subreddit so apologies in advance.",
        "created_utc": 1678430297,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did you ever not entirely finish an assessment?",
        "author": "z0mbiechris",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nhacr/did_you_ever_not_entirely_finish_an_assessment/",
        "text": "I want to know if there's anyone who did an assessment during their junior phase and wasn't quite able to get it 100% correct and still get a position from the employer?",
        "created_utc": 1678430280,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did any of you not entirely complete an assessment assignment but still got the job?",
        "author": "foosedev",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nh9sm/did_any_of_you_not_entirely_complete_an/",
        "text": "[removed]",
        "created_utc": 1678430230,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conflicted between new grad and internship offer",
        "author": "KirstieK",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nh4dz/conflicted_between_new_grad_and_internship_offer/",
        "text": "Hi reddit, I'm in an extremely privileged position to have received offers from two companies that I absolutely love. The problem is, I already accepted the first new grad offer months ago and recently received an internship offer that has an extremely high return offer. I know it is risky, but the company offering the internship is extremely well-regarded (FAANG level or above) and was willing to fly me overseas for the internship. I doubt that I would ever have such an opportunity again, and to be honest, being able to relocate would allow me to leave my unfavourable family situation behind. On the other hand, the first company is also quite good with an extremely nice culture and team. I am taking the internship for sure, but I am not sure if I should still hold on to the first offer in case my visa fails or I do not get a return offer. I would not like to put the first company through more hassle than I already have if possible. Any advice, especially from more experienced folks, would be really appreciated. Thank you!",
        "created_utc": 1678429784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conflicted between new grad and internship job offer",
        "author": "Ok-Platypus-8984",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nh30d/conflicted_between_new_grad_and_internship_job/",
        "text": "[removed]",
        "created_utc": 1678429669,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long do you think the job market will stay how it is currently?",
        "author": "in_dat_shurt",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ngygk/how_long_do_you_think_the_job_market_will_stay/",
        "text": "What’s everyone’s take?",
        "created_utc": 1678429296,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is self-learning coding much different from learning in university?",
        "author": "in_dat_shurt",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ngvim/is_selflearning_coding_much_different_from/",
        "text": "I wanted to know if anyone has any experience with being self taught and also learning coding in university, and how the two differ. I’ve been trying to self-teach myself coding but nothing really sticks. I can write basic for-loops and built a basic calculator but am lost when it comes to anything more complex than that.\n\nI ask this because I haven’t chosen a college major yet and like everyone else, I want to choose something that is lucrative but also that I enjoy and am at least not miserable doing.\n\nAny insight is very helpful :)",
        "created_utc": 1678429056,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accepted an Internship in early october but haven’t heard anything back since then, and workday still says “Candidacy is Progressing…”",
        "author": "Thefallenkraken",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ngpve/accepted_an_internship_in_early_october_but/",
        "text": "[removed]",
        "created_utc": 1678428579,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accepted an Internship in early october but haven’t heard anything back since then, and workday still says “Candidacy is Progressing…”",
        "author": "Thefallenkraken",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ngnsg/accepted_an_internship_in_early_october_but/",
        "text": "[removed]",
        "created_utc": 1678428412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day to Day in Maintenance Systems",
        "author": "coolpv",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ngj1x/day_to_day_in_maintenance_systems/",
        "text": "I accepted an offer with LM to work as a SWE for F35 Maintenance Systems (New Grad/Entry Level). Anyone here have/had this role or one similar and can give me some ideas on what the day to day will be for the role?",
        "created_utc": 1678428043,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I finish my MSCS ASAP, or spend the summer on projects?",
        "author": "krkrkra",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ngefe/should_i_finish_my_mscs_asap_or_spend_the_summer/",
        "text": "Hi all, I'm a career changer currently doing Georgia Tech's OMSCS. I have one class left, and the option of finishing either this summer or this fall. I'm currently searching for internships but not having much luck. If I do get one, I'll just focus on the internship this summer and finish my program in the fall. That's easy enough to figure out. \n\nMy question: if I don't get an internship, *should I skip the summer term and finish in the fall anyway*? Given that the job market isn't so hot and my resume seems not to be good enough to get me interviews, would it be better to spend the summer working on projects, contributing to OSS if possible, and grinding LC? That way I have the \"excuse\" for a work gap of still being in my program. \n\nIf I finish in the summer, then the clock starts sooner on the work gap and I won't have as much time to pad my resume and hopefully get more interviews. On the other hand, I wouldn't have to think about the program at all anymore and could start full-time employment immediately if offered. (My main worry about the work gap isn't financial; it's employers assuming that if I'm not employed I'm not worth employing.)\n\n**What do you all think: if I get no internship, should I finish in the summer ASAP or delay to the fall?**\n\nOther info that I don't think is directly relevant to the question, but affects my job search: U. S. citizen, one relevant short-term contract in 2021 (nothing in 2022), currently cannot relocate due to family.",
        "created_utc": 1678427661,
        "upvote_ratio": 1.0
    },
    {
        "title": "How important is profitability when choosing a startup to work at?",
        "author": "reallydarnconfused",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ng143/how_important_is_profitability_when_choosing_a/",
        "text": "Let's say you have two companies, both series A/B with one being profitable. If both offer similar base salaries + options and similar work life balance, would you choose the one that's profitable? Or is it not that important to think about?",
        "created_utc": 1678426544,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the recruiters' perspective?",
        "author": "Away_Day248",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nflcs/what_is_the_recruiters_perspective/",
        "text": "[removed]",
        "created_utc": 1678425238,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the recruiters' perspective?",
        "author": "Away_Day248",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nfkr3/what_is_the_recruiters_perspective/",
        "text": "[removed]",
        "created_utc": 1678425188,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips/advice for advancing in my career as a hotel management graduate who is currently working as a front end developer?",
        "author": "Kaneki_AlGhoul",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11newsy/any_tipsadvice_for_advancing_in_my_career_as_a/",
        "text": " \n\nHi everyone,\n\nI've been a long time lurker in this community and have actively kept track of any posts that may help me understand how I can continue working in tech and better roles in the future as someone who has a degree in Hotel management in India.\n\nSome Intro:  \n\n\nI graduated in 2018 with Bsc in HM and started working in 2019 as a GSA where i worked for 10 months until covid happened and layoffs happened. After that i had really no clue what to do except waiting for things to get better and hoping to get back into the field but for a year nothing changed.  \n\n\nThen in May 2021 my friend who works in tech told me to try CS50 introduction to computer science on Edx and I started learning more and more about the tech field, for 3-4 months I was just learning and researching topics and Set questions in CS50 until the Javascript section came up and i worked my way into learning everything about web development.   \n\n\nPicked up colt steele's course and just practiced the hell out of everything front end related as much as possible until april 2022. At that point i had a few projects in focused on ui design and JS fundamentals with no React on my portfolio. I applied for a few jobs around 10 and got 2 interviews out of which one hired me as an front end dev (small agency).  \n\n\nNow my major problem is in my country(india) its extremely hard to get a job in this field without a related degree and I researched a lot around this problem, I would need to get another degree preferably a Bachelors in Computer Applications but that would require 3 more years of my time. My current employer uses my lack of a degree in the field to pay me less than my colleagues and to top it all off I am the one doing all custom code projects in my company while others work on WordPress.  \n\n\n TLDR:  graduated in 2018 with a BSc in Hotel Management and worked as a GSA until getting laid off due to Covid in 2019.  Learnt about computer science through a friend and started studying web development. Practiced front-end development using Colt Steele's course and built up a portfolio with UI design and JavaScript projects. In April 2022, got hired by a small agency as a front-end developer and is now looking for advice on how to progress in the field without a relevant degree.",
        "created_utc": 1678423285,
        "upvote_ratio": 1.0
    },
    {
        "title": "How accurate are glassdoor and levels.fyi on salary ranges for mid-size enterprises?",
        "author": "_limitless_",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nelku/how_accurate_are_glassdoor_and_levelsfyi_on/",
        "text": "On background, there are probably 600 people here with roughly the same job as me. I'm a tech lead with \\~15 years of experience, but my day to day is basically \"write code. build things.\" I have no underlings, assign no budgets, and set no priorities for anyone.\n\nBut when I checked glassdoor and levelsfyi for salary ranges ahead of an upcoming performance review, I appear to be the... highest paid employee outside of Sales. I'm making twice what the other tech leads are submitting. That... doesn't leave much room to negotiate a raise.\n\nIs it an open secret that glassdoor et al are so completely wrong about salary ranges that they could be representing my role as paying half what it does, or am I just wildly overpaid already? How should I answer the objection, \"we can't pay you any more,\" if that comes up?",
        "created_utc": 1678422381,
        "upvote_ratio": 1.0
    },
    {
        "title": "Startup equity as raise",
        "author": "Japaniigga",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11negax/startup_equity_as_raise/",
        "text": "Equity at startup and raise\n\nDuring EOY review, boss told me I was one of the top performer in the team and was offered a 8% raise. However I’m asking for much more, since I know that some of my colleagues with less experience, who arrived later are payed close to 50% more. \n\nI made it clear that I wasn’t happy with the raise, and CEO proposed 400 shares which he said is equivalent to 40k (so close to the salary gap)\n\nI don’t know exactly how equity/share works, is it worthless until we go public or get acquired ?\nAny advice on how to politely decline equity and refocus negotiations on base ?\n\nTo give more context:\n- I plan to leave in the next few months (but market is tough)\n- company raised Serie B funding so nowhere near IPO \n- Finances are kept secret by executives so no way to know if we’ll get bought in a foreseeable future",
        "created_utc": 1678421962,
        "upvote_ratio": 1.0
    },
    {
        "title": "How has the job search been for juniors looking in 2023?",
        "author": "jlengine",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11neaal/how_has_the_job_search_been_for_juniors_looking/",
        "text": "Seems like most jobs are geared towards more senior roles, which makes sense with all the layoffs. I’ve been searching LinkedIn and filtering by 24 hours each day and noticed it’s gotten to the point where a lot of jobs I get shown don’t even have software engineer in the job title anymore.",
        "created_utc": 1678421478,
        "upvote_ratio": 1.0
    },
    {
        "title": "Information Technology minor",
        "author": "TheRealBianco",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ndz5o/information_technology_minor/",
        "text": "Hello! \n\nSo I am currently pursuing a Bachelors of Science in Business Administration - Management with a certificate in Global Supply Chain Management. I have been thinking on it recently, and was thinking of maybe adding an information technology minor to it. I realize that another piece of paper, etc etc. What I am worried about is I am already going into my junior year next semester, so I think I would either need to take two classes over the summer I would have been expected to graduate, or stay another semester. Now the question is, is it worth it? I see there are varying opinions online, but I don't want to add an extra course load if it won't do any good. Thanks!",
        "created_utc": 1678420649,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doubts about qualifications for working in companies like intel and nvidia as an engineer , can anyone in the field answer a few of my questions?",
        "author": "xdarkevolution",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ndnto/doubts_about_qualifications_for_working_in/",
        "text": " \n\nIm generally confused as to what exactly should i be studying to work in those companies,\n\nShould i be taking CSE and the taking masters in something more detail or like ECE or any other for my bacherlors?\n\nI'd generally like to work more on the hardware side may it be design or something else\n\nI'd also like to know what generally would be the pay and the scope in such fields rn.\n\nThank you for reading!",
        "created_utc": 1678419774,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which open-source project should I contribute to?",
        "author": "Jayjay_loves_Jesus",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ndfwa/which_opensource_project_should_i_contribute_to/",
        "text": "which of these will be fun to work on, use in-demand tech, and will most importantly look good on my resume?\n\n\\- CNAB\n\n\\- Dapr\n\n\\- Fast\n\n\\- FluentUI\n\n\\- Fluid Framework\n\n\\- GraphEngine\n\n\\- ONXRuntime\n\n\\- Open Service Mesh\n\nin case you ask, yes they all interest me.",
        "created_utc": 1678419167,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self taught advice/recommended roadmap",
        "author": "5sav1age9",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ndb9m/self_taught_advicerecommended_roadmap/",
        "text": "Hey everyone, I’m currently finishing up my third year of college as a non-cs or stem major as I realized too late that this is the route I want to take. I know it’s possible I can be self taught and given that I have about 1.5 years till I graduate and need to get a job, what do you think I should do till then to best learn how to program and be as best set up as possible to get a job in tech when I graduate? So far I’ve started learning python and front end development, so is this what I should focus on? Any other tips and advice is appreciated.",
        "created_utc": 1678418840,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self taught advice/recommended roadmap",
        "author": "ConstantCandid4169",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nd0qp/self_taught_advicerecommended_roadmap/",
        "text": "[removed]",
        "created_utc": 1678418060,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strategies to land machine learning career",
        "author": "PlasticElk3697",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ncoig/strategies_to_land_machine_learning_career/",
        "text": "[removed]",
        "created_utc": 1678417184,
        "upvote_ratio": 1.0
    },
    {
        "title": "Redirect to Machine Learning Career",
        "author": "PlasticElk3697",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ncmxc/redirect_to_machine_learning_career/",
        "text": "[removed]",
        "created_utc": 1678417065,
        "upvote_ratio": 1.0
    },
    {
        "title": "God, please, make the job market better. I absolutely can’t stand working at my current workplace.",
        "author": "Traditional_Break467",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nclsp/god_please_make_the_job_market_better_i/",
        "text": "2 YOE here at a big tech, with a Master’s degree. My new manager is driving the team into the ground. He assigns us some bogus projects that have absolutely zero impact, or utility. I don’t know if he is forcing me to quit myself or not, but I desperately want out. \n\nI have been applying like crazy to every SDE 1/2 posting I find online and nothing. I have been spamming recruiters on LinkedIn. Had some replies, but no interview process has been started for now. \n\nThe market is in shambles, and I can’t wait until it gets better.",
        "created_utc": 1678416981,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long should a PR take to review?",
        "author": "Nearby_Proposal_7317",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nc2a1/how_long_should_a_pr_take_to_review/",
        "text": "Curious for those that have been working in industry how long it takes to get feedback on your pull request?\n\nAt smaller companies with larger teams I was used to 1-3 days. Now at a large company on a small team it is more like 4-8 days which feels long but maybe I’m crazy?",
        "created_utc": 1678415562,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would you do?",
        "author": "This-Ad2907",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nbuvy/what_would_you_do/",
        "text": "[removed]",
        "created_utc": 1678415037,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was fired for performance from my first job a year ago, and I'm just getting back on my feet and applying for software jobs again. How should I address it in interviews?",
        "author": "screw_character_limi",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nbti6/i_was_fired_for_performance_from_my_first_job_a/",
        "text": "[removed]",
        "created_utc": 1678414939,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is researching at a top company like?",
        "author": "darkGrayAdventurer",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nbk2g/what_is_researching_at_a_top_company_like/",
        "text": "Ex. NLP research at Big N? \n\nJob security, pay, day in the life, etc.?",
        "created_utc": 1678414258,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you take an unpaid internship?",
        "author": "One-Pomegranate-6873",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nbe3g/would_you_take_an_unpaid_internship/",
        "text": "[removed]",
        "created_utc": 1678413841,
        "upvote_ratio": 1.0
    },
    {
        "title": "Concerns about my Apperance",
        "author": "LordHecGaming",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nbdwm/concerns_about_my_apperance/",
        "text": "[removed]",
        "created_utc": 1678413827,
        "upvote_ratio": 1.0
    },
    {
        "title": "Entry developer with 11 months of experience making 70k in California but going on long vacation in two months.",
        "author": "Good-Will-6242",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nau1z/entry_developer_with_11_months_of_experience/",
        "text": "[removed]",
        "created_utc": 1678412429,
        "upvote_ratio": 1.0
    },
    {
        "title": "[INTERN] QA Test Automation Engineer vs Software Engineer",
        "author": "-r0gue",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11nare9/intern_qa_test_automation_engineer_vs_software/",
        "text": "[removed]",
        "created_utc": 1678412245,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is using a whiteboard during a live coding test a bad idea?",
        "author": "PanzerPeach",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11naoes/is_using_a_whiteboard_during_a_live_coding_test_a/",
        "text": "A lot of DSA leetcode problems are way easier if I can sketch the problem out on a physical whiteboard. The problem is that during a virtual coding interview, the interviewer would just see me looking off screen with nothing to show on the IDE for a few minutes. Is this okay as long as I am explaining my thought process while drawing out the problem? Or should I come up with some other solution like mirroring my tablet to my computer and sharing my screen so the interviewer can see what I'm drawing?",
        "created_utc": 1678412036,
        "upvote_ratio": 1.0
    },
    {
        "title": "CS graduate struggling with ADHD",
        "author": "hydrothrowaway420",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11na76f/cs_graduate_struggling_with_adhd/",
        "text": "I'm a fourth year computer science student about to graduate and I've been struggling with ADHD all my life. I took medication (concerta, vyvanse) in grade school but have since got off it and its very hard to get rediagnosed as an adult but I'm trying. In the meanwhile, I need to get a full time job for when I graduate and I honestly don't know what to do. My resume looks pretty bad, I have a few school projects and an internship that I worked for a tiny local company. I'm trying to do leetcode, or find some projects to add to my resume but I feel like I'm drowning. I can't keep my focus up when I'm coding and I'm struggling to do one leetcode per day. As for the projects, getting through tutorials and videos to learn new skills takes me so long and I feel like I never make any real progress. It feels so fucking shitty when you spend hours everyday trying to learn new skills or practice leetcode and get almost nothing out of it. At this point I feel like my entire degree is a sham and I'm not actually good at any aspects of software Dev. Does anyone else struggle with adhd? How did you get over these humps?",
        "created_utc": 1678410812,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does it mean when a company says they are experiencing delays in providing an update",
        "author": "baki-b",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11na6m7/what_does_it_mean_when_a_company_says_they_are/",
        "text": "[removed]",
        "created_utc": 1678410773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Investing in junior devs...",
        "author": "IncomeGlittering319",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n9mx4/investing_in_junior_devs/",
        "text": "As a new SWE, there are so few entry level positions. I get that it is expensive and an investment for companies to take on junior devs. Of course it would be more ideal to capitalize on other companies ramping up devs and then hire them as mid/senior level engineers. But, with so few companies hiring jr devs right now, are companies not creating a silo that will make it really challenging to have competent mid-level devs in a few years time? \n\nFor those at companies with recent jr dev hires, do you feel like the quality is decreasing or your bar of expectations are increasing? Both? Sometimes I get the sense from posts that folks forgot they were once a new hire with little experience who needed the investment.",
        "created_utc": 1678409395,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need career advice; from startup founder to engineer",
        "author": "Own-Zookeepergame672",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n9hdt/need_career_advice_from_startup_founder_to/",
        "text": "[removed]",
        "created_utc": 1678409010,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would you call this, am I overvaluing it, and do (or why don't) any companies hire for it?",
        "author": "Space-Robot",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n9frs/what_would_you_call_this_am_i_overvaluing_it_and/",
        "text": " \n\nThere's a thing I'm trying to define. I can describe it with examples, or a lot of explanation, but I'm writing this post to see if it has a name. Some kind of handle I can use to research more about it or more easily discuss it.\n\nI've fallen into a role as a lead on a team wherein every other developer is an offshore contractor. Not ideal, I know, but that's not really what the post is about. These folks are intelligent, hardworking, and experienced, but there's a certain collection of skills and priorities that they lack that has been frustrating me to no end. It's like a laziness, but one that applies only to concerns of readability and maintainability.\n\nFor example, they might find that to resolve a story they can modify a function GetAllX so that it only gets certain X. Now it no longer gets ALL X, but they don't rename it. The function signature will be a lie to the next developer who reads it.\n\nThey won't refactor large, convoluted functions. Just keep adding little by little story by story until it becomes a monster.\n\nThey leave comments because I tell them to, but they don't seem to really \\*get\\* what makes a comment valuable or when/why a comment might be valuable.\n\nThey'll use multi-line ternary operators and large conditions you need a pen and paper to understand.\n\nI'm tempted to say \"maintainability\" or \"readability\" but those don't feel quite right. It's almost more like \"empathy\". The ability to put yourself in the shoes of the next guy who has to work with the code you're writing.\n\nIt wasn't trained in university and I seriously doubt it's trained in boot camps. No interview I've experienced seems to be searching for this, but it's the thing I most desperately want in a co-worker.",
        "created_utc": 1678408892,
        "upvote_ratio": 1.0
    },
    {
        "title": "[INTERN] QA Test Automation Engineer vs Software Engineer at Apple",
        "author": "-r0gue",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n932i/intern_qa_test_automation_engineer_vs_software/",
        "text": "[removed]",
        "created_utc": 1678408010,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much career progression can happen during layoffs/hiring freeze?",
        "author": "MrKren",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n8zfd/how_much_career_progression_can_happen_during/",
        "text": "I started my first job as a software engineer about 1.5 years ago and the company I work for (~1500 employees) just announced layoffs after a several month long hiring freeze. Our team and most of engineering has been told the we’re safe (for now) but I have some lingering questions about how this can affect career progression.\n\nWhilst I’m waiting for the dust to settle and get some more information from my manager I was curious to hear what peoples’ experiences were with trying to progress their careers at a company during layoffs/hiring freezes? Was it possible for you get promotions? How long did it take for career progression to resume to normal rates? Did a lot of people decide to jump ship and move instead of trying to progress internally? Can you leverage being on an important team (to the business) during these situations to get a promotion?\n\nTldr: what are your experiences with career progression during layoffs/hiring freezes?",
        "created_utc": 1678407752,
        "upvote_ratio": 1.0
    },
    {
        "title": "How difficult will it be to get a job with an associates degree from a technical school",
        "author": "nomaidenslmao",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n8y71/how_difficult_will_it_be_to_get_a_job_with_an/",
        "text": "[removed]",
        "created_utc": 1678407671,
        "upvote_ratio": 1.0
    },
    {
        "title": "Job Hop",
        "author": "pogey24",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n8xx6/job_hop/",
        "text": "How easy is it to job hop once you have experience? For reference, I'm a new grad headed to silicon valley this summer. I see posts talking about how people are worried about job hopping **too much**, which is funny since I barely landed my first role. Does it really get that much easier with some experience to get interviews?",
        "created_utc": 1678407653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think it is a right thing for me to resign?",
        "author": "rowgw",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n8qmu/do_you_think_it_is_a_right_thing_for_me_to_resign/",
        "text": "I have told my team lead I am going to tender in few months time, that means i will leave the ongoing project. I have not told my direct report in organization structure.\n\n\n\nThe reason is because I have very sucks colleague. I don't want to bring up the fact he is less experience than me, but i feel he likes to find something wrong in my code. Recently he asks judges the performance in one of my code, and even asks how i developed big feature (it is one of core feature).\n\n\n\nBut.. whenever i found a bug in his code, feedback to him privately/in group, either ignored or he replied he will check but never get rectified. In the end, sometimes I am the one who fixed it. Ultimately, sometimes he changes app's code that break things without informing others, only we discover later. Also, i did unit tests for his code.\n\n\n\nDo you think I am childish that I feel I want to tender? Or am i not resilient? Is it a common thing this to happen in CS career?\n\n\nSorry i can't find more suitable subreddit to write this, hope you guys can give your opinions what i should i do in my situation. Time is very hard in my country, it is hard to find good job that can match my salary, otherwise, i need to migrate back to my home country.",
        "created_utc": 1678407161,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got fired, not sure what to say to recruiters/potential new employers.",
        "author": "BootSplootTootin",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n8mn0/got_fired_not_sure_what_to_say_to/",
        "text": "[removed]",
        "created_utc": 1678406900,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I send a follow up call after already sending a follow up email?",
        "author": "Palpitation_Haunting",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n8e51/should_i_send_a_follow_up_call_after_already/",
        "text": "Hello!\n\n\n       At the end of my last interview they informed me they will contact me early next week on what’s the verdict. It’s been 1 week and I sent them a follow up email two days ago. Should I call them tomorrow to ask or just move on?",
        "created_utc": 1678406370,
        "upvote_ratio": 1.0
    },
    {
        "title": "RBC High School Internship OA - What To Expect?",
        "author": "DevTechJr",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n88ha/rbc_high_school_internship_oa_what_to_expect/",
        "text": "[removed]",
        "created_utc": 1678405988,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lost Math Major - Need Advice",
        "author": "BoatOrdinary",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n88cf/lost_math_major_need_advice/",
        "text": "[removed]",
        "created_utc": 1678405980,
        "upvote_ratio": 1.0
    },
    {
        "title": "GM doing VSP, an opportunity?",
        "author": "xYellowgoblin",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n883g/gm_doing_vsp_an_opportunity/",
        "text": "i have been with them for 7 years and underpaid as a software developer. before i got the email i was already considering to interview prep to bounce. How challenging is getting offers right now in IT companies?\n\nSeverance is very tempting\n\n• 1 month of pay for every year of service up to 12 months pay, paid as a lump\nsum.\n• Employees enrolled in the Company's group medical plan will receive an additional lump sum payment equivalent to their monthly cost to continue grou health benefits under COBRA, for every year of service up to 12 months.\n• Pro-rated teamGM at target for the 2023 performance year, paid as a lump sum.\n• Outplacement assistance, if requested, for 3 months.\n\n\n* i do have 23k loan in 401k that i used for my first house*\n\nIs this an opportunity or risk getting laid off later with less severance benefits?",
        "created_utc": 1678405963,
        "upvote_ratio": 1.0
    },
    {
        "title": "RBC High School Technical Assessment - What Can I Expect?",
        "author": "DevTechJr",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n87ix/rbc_high_school_technical_assessment_what_can_i/",
        "text": "[removed]",
        "created_utc": 1678405923,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it frowned upon to ask for more money than you originally asked for in the first talk?",
        "author": "velocifasor",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n85mz/is_it_frowned_upon_to_ask_for_more_money_than_you/",
        "text": "I started interviewing a couple weeks ago. When I got asked what was my expected compensation (I hate that question) I originally asked for a certain amount of money, a range at which I would be considering to switch companies.\n\nAs the interviewing process continued and I got to talk to other devs about responsibilities, etc. I ended up realizing that I should have asked for more money.\n\nI've had 6 interviews so far but we haven't talked about money since the first one, and I have the last one with the head of HR next week where I suppose they will be making me an offer.\n\nI'm expecting that what they will be offering me will be at the low range of what I originally asked. So I was thinking of being completely honest and telling them that the amount I gave them was the starting point, so to speak.\n\nI'm not talking about asking for 100% more. More like 10% - 15%.\n\nWould that be frowned upon? Is it ok to negotiate a better salary at this point or am I condemned by what I said in my first interview?",
        "created_utc": 1678405799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Freelance Software Engineering Questions Regarding Pricing...",
        "author": "LifeOfSpirit17",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n7yfl/freelance_software_engineering_questions/",
        "text": "Hi...\n\nI had a colleague tell me today that they could charge about 5k (USD) for a lite ticketing app, which would maybe take about 2 days to create. This got me really curious. Any SWEs here familiar with the freelancing game and know what this type of thing might cost?\n\nReally, I'm very curious how much even some other efforts like some basic data automation or say a light interface or dashboard might cost.\n\nTIA!",
        "created_utc": 1678405322,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I not cut out for software engineering?",
        "author": "31456",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n7shv/am_i_not_cut_out_for_software_engineering/",
        "text": "I'm working at an internship, and I think I'm underperforming. The company only employs like 5 people (only 1 developer), which is weird since it's a software company. It's also an unpaid internship. The problem is that I'm struggling to get things done, and I think my boss is starting to get pissed off with me. I'm working on new technologies, languages, and all of these design patterns. I feel hesitant to ask my boss questions since it's only one guy that does all of the programming.",
        "created_utc": 1678404931,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are SWEs at Microsoft (or any company for that matter) encouraged to use GitHub copilot or ChatGPT or are they banned/discouraged due to privacy/data concerns?",
        "author": "OctaviusPetrus",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n7ek5/are_swes_at_microsoft_or_any_company_for_that/",
        "text": "[removed]",
        "created_utc": 1678404045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do SWEs at Microsoft or other big tech companies use ChatGPT or GitHub copilot?",
        "author": "OctaviusPetrus",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n7c6x/do_swes_at_microsoft_or_other_big_tech_companies/",
        "text": "[removed]",
        "created_utc": 1678403896,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wanting to change company and get compensated for my experience",
        "author": "ContestOk5072",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n7bum/wanting_to_change_company_and_get_compensated_for/",
        "text": "[removed]",
        "created_utc": 1678403874,
        "upvote_ratio": 1.0
    },
    {
        "title": "Job Market got me down... What am I doing wrong?",
        "author": "DaethChanter",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11n6o5g/job_market_got_me_down_what_am_i_doing_wrong/",
        "text": " I'll be graduating in a month. I have two co-op experiences and feel like I have a strong understanding of programming. I have applied job after job without hearing back. Not just SWE or dev jobs but IT jobs too (I have 2 years of experience working in IT and use a different resume for that).\n\nI do custom cover letters and tweak my resume for each job to ensure that my resume gets past the keyword identifier.\n\nWhat do I need to improve? Is it just the current market? I feel like im qualified for entry-level positions but i'm not hearing anything back.\n\n[https://imgur.com/a/6sJEc95](https://imgur.com/a/6sJEc95)",
        "created_utc": 1678402383,
        "upvote_ratio": 1.0
    }
]