[
    {
        "title": "Contemplating switching from Frontend to Backend (aspiring web dev)",
        "author": "Yhcti",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112ggws/contemplating_switching_from_frontend_to_backend/",
        "text": "Hi all,\n\nI've been studying over a year, but it's been quite on and off, so I've only been able to average 5-7 hours a week studying due to work commitments (almost at a point where I can quite and work part time).\n\n&amp;#x200B;\n\nWhen I first wanted to be a web dev, I googled the fastest path, and it told me Frontend, great, I'll follow it. It's only after gaining knowledge and understanding it all (or as much as I can so far) that I realize this perhaps isn't actually the fastest path, at least perhaps not the fastest path for me.\n\n&amp;#x200B;\n\nI've been doing The Odin Project and I'm just about to start the Node/Express Backend section, so far it's felt pretty fine and I haven't hit any major hurdles yet. But one thing I am questioning to myself is how much I enjoy having to write html/css and \"design\", and honestly it's not a great deal. I am much comfier and more content writing the code behind the design (javascript, python, c# etc), which has recently got me thinking if perhaps Frontend isn't the best path for me, and if I should instead focus my attention on Backend.\n\n&amp;#x200B;\n\nMy issue... there really isn't much exposure for Backend web dev other than \"build APIs\", it can't just be that, there must be more, but I can't find much info on it other than very broad topics; And there's not much of a push for it to be picked up by new, self-taught devs, which has me questioning... why?\n\n&amp;#x200B;\n\nI have a mentor who is fantastic, and they're a huge advocate of C# and static typed languages, so much so that they genuinely think I'd have a much better career if I made the switch to C# and focused more on that (and if I wanted to, still, I could pick up Typescript for my Frontend).\n\n&amp;#x200B;\n\nI've rambled quite a bit here, so to TL:DR this entire thing:\n\nLearning Frontend, about to start TOP Backend section. Not really enjoying writing HTML/CSS, but enjoy writing JS/Python/C#. Questioning why there's not much hype for self-taught to go into Backend first, also questioning what Backend web devs do, outside of \"build APIS\".\n\n&amp;#x200B;\n\nThanks!",
        "created_utc": 1676409576,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bosch Preliminary Screen",
        "author": "Zero_to_Zeno",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112g9qp/bosch_preliminary_screen/",
        "text": "Has anyone received a text-based preliminary screen from Bosch? It’s a PDF with a series of open-ended questions, such as why I’m looking for a new position. Last time I got one of these from another company it was a scam and I’m not looking to waste my time (and good responses) again.",
        "created_utc": 1676409061,
        "upvote_ratio": 1.0
    },
    {
        "title": "smaller tech company internship vs bigger finance company internship",
        "author": "bansheei",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112fw7u/smaller_tech_company_internship_vs_bigger_finance/",
        "text": "[removed]",
        "created_utc": 1676408108,
        "upvote_ratio": 1.0
    },
    {
        "title": "Internship at smaller tech company vs bigger financial company?",
        "author": "bansheei",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112fv87/internship_at_smaller_tech_company_vs_bigger/",
        "text": "[removed]",
        "created_utc": 1676408039,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a fair notice period to give your employer?",
        "author": "iLoveWater2020",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112ftro/what_is_a_fair_notice_period_to_give_your_employer/",
        "text": "Long story short, I accepted a (really good) offer from a company I really like and will be leaving my current employer. I don’t want to burn bridges and my team was very nice and promoted my growth, so what would be a good notice period to give? \n\nI can choose my start date and can give either a 2 week notice or more. I will say I am nearing the end of a large project if that helps.",
        "created_utc": 1676407934,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommended wear for a internship career fair for a student?",
        "author": "n351320447",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112fp5a/recommended_wear_for_a_internship_career_fair_for/",
        "text": "What would you recommend a person wear for an internship career for if they are in pursuit of a software developer internship? I’m a male if that matters.",
        "created_utc": 1676407605,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career that involves programming but not building software?",
        "author": "RegsStandup",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112fmkd/career_that_involves_programming_but_not_building/",
        "text": "This is gonna be an oddball question, but hoping I can find some sort of answer. I think I've discovered that I like programming, but probably would not want a job creating software. \n\nI've done a lot of small projects that we're not really meant to be used for a wide audience, and was mainly done for my amusement, or just as a tool to get something done or answer a question. Couple of examples: I created a script to take all of my downloaded movies and move them into folders based on categories and renamed them by chopping off anything that wasn't part of the title, like if the name included year or format or resolution....another one I did was a super simple web scraper that grabbed some data off of redfin and output the results into a csv so I could see if there was any trend for rentals in a town I wanted to move to.\n\nI really enjoy working on these small projects that are meant to be used as a tool for answering a question or doing a process. The more I look into SWE as a career, the more I think I will become stressed or bored having to deal with a large application. Obviously I wouldn't know because Ive never worked as a SWE, but what I do know is I'm not a fan of dealing with JS frameworks.\n\nFrom what I've seen already online, it looks like SRE type roles might do something similar to what I've mentioned. Data Analysts also seem to use programming as mainly a tool to deal with ad hoc problems. However, both of those jobs either require a degree, which means I'd have to go back and finish schooling, or years of experience in related fields, so I'm wondering what else is out there before I start dedicating my time focusing on a path and realize I could've chosen a path better suited for me.",
        "created_utc": 1676407424,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a Bachelor's enough to work in ML/AI?",
        "author": "Jackwagon1130",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112fjbo/is_a_bachelors_enough_to_work_in_mlai/",
        "text": "I've read (both online and in job listings) that a lot of ML jobs require or strongly prefer a master's or a PhD, but is this a general guideline or a strict rule for everyone?  \n\n\nI'm currently a junior at berkeley double majoring in cs and applied math, and I've done one internship at a startup as an MLE, as well as a consulting project working on an ML system for a (slightly larger) startup. I'm probably going to be doing an SDE internship this summer, so no real possibility of an MLE return offer. I'm really interested in becoming an MLE full-time after I graduate, more on the implementation/MLOps side of things rather than on the research/DS side of things. Do i need to go to grad school to do this? Or will I be competitive for these jobs with just a bachelor's?",
        "created_utc": 1676407201,
        "upvote_ratio": 1.0
    },
    {
        "title": "Joining the Air Force to learn Cyber and earn some certifications, what order should I aim to learn them?",
        "author": "Guy_On_The_Moon",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112fakl/joining_the_air_force_to_learn_cyber_and_earn/",
        "text": "These are the Certifications I would like to work toward:\n\nCyber Certifications\n\nSec+\n\nGCIA\n\nGCFA\n\nGPEN\n\nKubernetes\n\nAWS\n\nAzure\n\nCISSP\n\nPCI\n\nGWAPT\n\nOSCP\n\nSans\n\nCCNP\n\nMicrosoft \n\n\nSec+ is mandatory, and I have about 3 years (1 year of the 4 year contract is training and tech school for the job) to earn and learn as much as I can. Any suggestions as to the order I should go about tackling these and any recommended resources would be highly appreciated. Thank you.",
        "created_utc": 1676406589,
        "upvote_ratio": 1.0
    },
    {
        "title": "does changing my graduation date (graduating a semester early) affect internship offers?",
        "author": "four_o_clock",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112f7ly/does_changing_my_graduation_date_graduating_a/",
        "text": "I have an internship lined up for the Summer of 2023. I realized very recently that I have to change my graduation date to Dec 2023 (as opposed to the initial May 2024 date) because I'll be done with my program early (and as an international I'm not allowed to stay extra semesters). \n\nThe school has gone ahead and changed my I-20 date without telling me, and now I need to submit my I-20 for CPT to the company I'll intern at. Will this cause an issue / would they go so far as to rescind my offer?",
        "created_utc": 1676406367,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good intermediary job before first developer job?",
        "author": "TinyStego",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112en0o/good_intermediary_job_before_first_developer_job/",
        "text": "Little background, only have a HS Diploma and have about 4 years with Desktop Support and 3 years of level II Helpdesk experience.\n\nI am deciding where to take my career at the moment and deciding between development and continuing with IT. I'm wondering what a good job is before getting a job in development.\n\nI want to get as far away from Helpdesk and quick, because the work is just dreadful. The only thing I like about the 3 Helpdesk roles I've had were whenever there was some downtime and I was able to do some studying. Other than that it's a nightmare.\n\nWhat I've thought of so far is Application Support, but when I search the job boards with that term it usually ends up being a position where you educate employees how to use some enterprise piece of software. I was wondering if a position exists which is basically like Helpdesk, but for developers. Appreciate any advice!",
        "created_utc": 1676404897,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m wildly discouraged and don’t know what to do",
        "author": "SuperSubwoofer",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112ec9n/im_wildly_discouraged_and_dont_know_what_to_do/",
        "text": "I’ve been working in dev roles since 2018, and I’m at my wits end trying to find a new role.\n\nI’ve been searching since last year and I don’t know what to change at this point.  I either hear nothing back or I interview and don’t get to the next step.\n\nMy current role was a contract to hire position, but since being a contractor in 2020 then hired in the spring of 2021, I’ve gotten exactly 1 raise and it was a whole 2%.  Financially I’m OK, but due to some other issues with my current place of employment, I’ve been searching.\n\nThis is kind of just a rant, but if anyone has tips for finding a new role, I’m all ears.  This is the most depressing job search I’ve ever experienced and I’m losing it.",
        "created_utc": 1676404153,
        "upvote_ratio": 1.0
    },
    {
        "title": "International Dec 23 grad -- when to start applying if I want to start in early 2024 at a big tech?",
        "author": "four_o_clock",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112e37v/international_dec_23_grad_when_to_start_applying/",
        "text": "As in the title, I'm due to graduate this coming December, and as an international, I'd really like to start a new grad position in Feb 2024 (or around that time) so that I don't \"waste\" my OPT.\n\nAt the same time, for \"stability\" or \"security\" (it's funny bc the big companies are doing the layoffs, but I still think it'd be slightly better to go to a big company in this climate), I'm hoping to be able to join bigger companies big tech or maybe even some hft firms (as swe). \n\nI wanted to start applying now, but I can't seem to find positions that don't ask for 2+ years of noninternship experiences.",
        "created_utc": 1676403511,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dec 2023 grad, international—when should I start applying for new grad starting in early 2024 (aiming for big companies)?",
        "author": "four_o_clock",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112e1mm/dec_2023_grad_internationalwhen_should_i_start/",
        "text": "[removed]",
        "created_utc": 1676403396,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me decide",
        "author": "ActiveDragonfly5598",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112dpb1/help_me_decide/",
        "text": "I currently have two intriguing offers, but don't know what to decide because I'm not sure what one of the titles would mean:\n\nCompany 1: Big tech company (not faang, one level lower)\n\ntitle: managed application services intern\n\npay: 30hr remote\n\nCompany 2: Security low F500\n\ntitle: software engineer intern\n\npay: 20hr onsite\n\nDont really care about pay or location, only resume value. So my question is, will the managed application services title be the same as software engineering title if I'm doing software engineering work? (thats what they said I would be doing in the interview)",
        "created_utc": 1676402512,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hiring remote Spanish interpreters",
        "author": "Ladailey",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112djf1/hiring_remote_spanish_interpreters/",
        "text": "[removed]",
        "created_utc": 1676402093,
        "upvote_ratio": 1.0
    },
    {
        "title": "Programming was my hobby, made it my job, now I can't find better hobbies",
        "author": "coldfeetbot",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112d7q1/programming_was_my_hobby_made_it_my_job_now_i/",
        "text": " \n\n**TL;DR Programming and computers were my hobby. I worked hard to be a software engineer, and make it a living. I did. I wanted to keep it as a hobby when I'm free but that would be unhealthy for my body and I fear burnout, so I choose not to. I struggle to find new hobbies or objectives. Have you ever felt this way? What would you do?**\n\nProgramming and tinkering with computers in general were things I used to do in my leisure time. For example I dreaded school with a passion and, when it was over, I was really looking forward to finally arriving to my cozy home and mess with the computer until it was dinner time. I enjoyed that time thoroughly. Similar story on weekends or holidays. It basically was the go-to hobby I had when I was alone and free, along with videogames.\n\nMy goal was to study hard and become a software engineer, then I would do what I enjoy for a living and get a good salary! I was very determined and focused on that.\n\nNowadays, I work professionally as a software developer. Been at it for 5 years. Work is very rewarding, can't complain at all - but it's work after all. There are deadlines, annoying tasks, agile, etc. On the other hand, I work fully remote so it's even more similar to that \"leisure time\" I'm talking about, just a downgraded version of a hobby that I do BEFORE the rest of my obligations.\n\n\"What's the problem with that?\", you might ask. Well, when I have free time after a day of work, I'm lost. On a typical work day, I spend the entire morning and part of the evening doing a downgraded version of my hobby. \"Well, why not continue doing it then?\" Often I would, but I choose not to. It's very sedentary. Spending too much time on the computer is unhealthy and takes a toll. If I abuse it I get eye fatigue, annoying muscular pain or tightness, muscle knots... Not to mention many more potential health concerns, and possibly burnout. So I try to stay away from it. This includes other sedentary hobbies like videogames. Also, even if I enjoy it, after a long day of work I sometimes wouldn't want to keep doing it.\n\nTo stay active I have tried different sports and workouts, but haven't found out how to enjoy them yet. I just do them for \"maintenance\" so my body can remain in shape and endure a desk job, but I can't call them a hobby.\n\nI have tried many other hobbies (music, reading, board games, art, learning languages...) but they are not as rewarding to me, they feel more like a chore.\n\nI probably sound like a basement dweller, but other than that I have a pretty normal life. I just got married, I have several good friends I go out with every other week, etc. Just... My goal was to become what I am now, and I can't figure out what to do next. Other objectives literally don't seem to interest me, I feel like a robot that accomplished its task and is now idling.\n\nHave you ever felt this way? What would you do? If you went this far, thanks for reading everything!",
        "created_utc": 1676401268,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on Deciding Between Job Offers",
        "author": "sivaramzadi",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112d3qo/advice_on_deciding_between_job_offers/",
        "text": "I’ve been looking to break into tech as a physics major since I graduated college in June 2022. After being unemployed since September, I finally received two offers on the same day this week and I’m having trouble picking between. At some level I feel like I’m dumb for even thinking about one of the offers but since I don’t know that much about tech I thought I’d let the rest of you call me an idiot if Im being one. I should mention that my goal for the future is going into ML engineering (and applying for a masters in ML) because I find it interesting and it pays better in comparison to software engineering from what I know, but I already said I could be an idiot so take it as you will. \n\nOne of my offers is an remote internship as an ML engineer with a smaller company based in the UK (I live in California, US). The internship pays $2.5k/month (~$15/hr so less than minimum wage in my area) for 2-3 months depending on the scope of my work with the potential to transition to a permanent member of the team. The company currently has no one specializing in ML engineering so I was told by the head of science that they “strongly” think there will be a need for a more permanent member but no guarantee. I was also told that at the end of my contract my pay can be reevaluated but to me that means “we will increase your pay by a dollar or two if you become permanent”. \n\nThe other offer I received was from a defense contractor in another US state (away from family/friends) which is a permanent software engineering position. I haven’t received an exact contract yet but from what I’ve seen on levels.fyi, the pay is in the 80-85k range. \n\nMy biggest hang ups are that with the ML role, I may have a better pay path, better job fulfillment (ethically and practically), and the work the company( and the work I would be doing) would make a much better story for when I apply for a masters in CS/ML but the pay absolutely sucks in comparison and I’m not guaranteed a job after the internship. From what I’m heard the defense position also has less internet access so I’m a little worried if I hit a wall in my software engineering knowledge, that I wouldn’t have much to rely on at work especially with a non-CS background.\n\nIf you’ve taken the time to read this I highly appreciate it but I’d even more appreciate some advice.",
        "created_utc": 1676401008,
        "upvote_ratio": 1.0
    },
    {
        "title": "Programming was my hobby, turned it into my job, then I no longer have better hobbies or new objectives",
        "author": "phuuuck_dude",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112d3o5/programming_was_my_hobby_turned_it_into_my_job/",
        "text": "[removed]",
        "created_utc": 1676401002,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not sure if swapping jobs is good for me now",
        "author": "iulian212",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112d3km/not_sure_if_swapping_jobs_is_good_for_me_now/",
        "text": "My experience in short is:  \n\n\n* Intern \\~3mo (did nothing )\n* Junior \\~ 3mo (benched)\n* Swapped companies to Junior position \\~ 5mo\n\nI am not sure how this will look if i swap jobs again because i am deep in discussions with another company.  \n\n\nThe thing is that at my current job i feel like i am not learning enough from my seniors. For example i had to explain at somepoint why \n\n    char* s = \"some string\";\n    some_func(std::move(std::string(s)));\n\ndoes not invalidate s.  \nIt also feels like the code is patched around to keep things working.  \nWe had to somehow get more info about some events being notified asynchronously and i came up with the stupid idea to use macros and after further investigating on how that would work i came up with  \n\n\n    #define notifyAsync(...) notifyAsyncImpl(__VA_ARGUMENTS__, __FILE__, __FUNC__, __LINE__)\n\nand i showed it to the senior in my team and explained that is bad/unstable since that basically does a search and replace on the entire codebase + the codebase of whoever uses the sdk and he still wants to use it.  \n\n\nBut at the same time i really like it because the workload is relatively small and i am very up and down with moods so there is really no presure if i despise coding one day. And despite all that my manager basically loves me and everyone in general seem really really happy with my work.  \n\n\nAt the same time all the work i did was send bugs back because they did not have logs, cherry pick some commits from one branch to another to port them on another version and i think i managed to get one good bug and analize it and asked the senior if my reasoning was good to which he agreed and sent it to another team for further analysis.  \n\n\nAnd all of that kinda scares me the workload, difficulty and my ability to do stuff in general might not be up to the actual standards of the industry (or at least what i think the standards are). The current project is in the automotive area and the new company has to do with networking and more low level stuff (which seem really spicy).  \n\n\nI am also worried about how this affects my growth in seniority and the fact that i might and up swapping jobs every 5mo because i don't feel things are right or something.  \n\n\nYeah this is a bit of a mess but any advice is welcomed",
        "created_utc": 1676400996,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the Probability of landing a R&amp;D job with a bachelors?",
        "author": "oh_my_gawd_",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112d0p8/what_is_the_probability_of_landing_a_rd_job_with/",
        "text": "[removed]",
        "created_utc": 1676400802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best courses on Pluralsight?",
        "author": "AnonymousUser4133",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112czb5/best_courses_on_pluralsight/",
        "text": "[removed]",
        "created_utc": 1676400706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on Deciding Between Job Offers",
        "author": "ravismcmaster",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112cuhb/advice_on_deciding_between_job_offers/",
        "text": "[removed]",
        "created_utc": 1676400380,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interviewing for unusual job -- no idea what to expect for salary. Can anyone give me a fair market value estimate?",
        "author": "Fragrant_Try2957",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112c6eq/interviewing_for_unusual_job_no_idea_what_to/",
        "text": "[removed]",
        "created_utc": 1676398729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stuck in the loop",
        "author": "fatzack123",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112c4ht/stuck_in_the_loop/",
        "text": "[removed]",
        "created_utc": 1676398594,
        "upvote_ratio": 1.0
    },
    {
        "title": "2d Arrays Explained, DSA Important Questions",
        "author": "thetech_learner",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112c2hv/2d_arrays_explained_dsa_important_questions/",
        "text": "[removed]",
        "created_utc": 1676398457,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meta 12 month contract.",
        "author": "fuegobanana",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112c1ug/meta_12_month_contract/",
        "text": "[removed]",
        "created_utc": 1676398411,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being pressured into accepting a job offering right away",
        "author": "moonflower360",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112c1g3/being_pressured_into_accepting_a_job_offering/",
        "text": "[removed]",
        "created_utc": 1676398383,
        "upvote_ratio": 1.0
    },
    {
        "title": "Atlassian SWE Intern pay",
        "author": "Primary_Lawyer2925",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112c0mz/atlassian_swe_intern_pay/",
        "text": "[removed]",
        "created_utc": 1676398324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it a red flag to not be asked a single technical question?",
        "author": "grambo37",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112br0i/is_it_a_red_flag_to_not_be_asked_a_single/",
        "text": "[removed]",
        "created_utc": 1676397667,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it a red flag to not be asked a single technical question?",
        "author": "grambo37",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112bo7t/is_it_a_red_flag_to_not_be_asked_a_single/",
        "text": "[removed]",
        "created_utc": 1676397497,
        "upvote_ratio": 1.0
    },
    {
        "title": "Walmart “cracking down” on remote work, closing offices and forcing workers to relocate.",
        "author": "justleave-mealone",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112b9am/walmart_cracking_down_on_remote_work_closing/",
        "text": "https://www.businessinsider.com/walmart-close-tech-hubs-force-workers-move-or-take-severance-2023-2?amp\n\n\nI still don’t fully understand the consensus as to why corporations are so bitterly against remote work. From\nThe article:\n\n&gt;\t\"The unique culture and values of Walmart are at the core of who we are – to our customers, members, associates and partners,\" Munroe said in an email. \"With this in mind, we've made the decision to focus our tech team's presence within select locations. We hope to relocate all affected associates.\"\n\nIt seems that they’re arguing it’s about focusing on culture and company values, but I’d imagine they’re closing tech hubs in HCOL to offset paying some of the high salaries.",
        "created_utc": 1676396424,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coworker that wants to control everything",
        "author": "ediffcee",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112b6jb/coworker_that_wants_to_control_everything/",
        "text": "[removed]",
        "created_utc": 1676396234,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reaching seniority and gaining experience as a job hopper vs. loyal employee",
        "author": "puritan_titan",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112b41t/reaching_seniority_and_gaining_experience_as_a/",
        "text": "\"You cannot be truly a senior, if you change jobs in every 2 years. You must stay at one place on one project to truly immerse yourself to the details and see your impact on the software on the long run. That's how you become a senior\"\nvs.\n\"You cannot be truly a senior, if you settle down with one project. You must change jobs frequently to get familiar with several kind of software, technology, people. You must broaden your mind and search for new things all the time, that's how you become a senior.\"\n\nI have encountered with this two opinion in the past and on the surface they seem to contradict each other. What's your POV? Do a job hopper and a loyal employee experiencing their profession differently?",
        "created_utc": 1676396053,
        "upvote_ratio": 1.0
    },
    {
        "title": "some career guidance plz",
        "author": "Makhann007",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112axn2/some_career_guidance_plz/",
        "text": "Hey guys I’ve I’m going to be applying for internships and new grad roles by next year.\n\nI have experience building projects in python and JS/node.\n\nI was hoping I could land a cloud internship and eventually get into cloud security but it seems these types of internships/jobs are limited for fresh people.\n\nWould I be smart to stay on the course of building projects in AWS to get a role like that\n\nOr am I better off trying to get into backend (my second choice) and after 2 years or so transitioning over to cloud.\n\nAppreciate it",
        "created_utc": 1676395615,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career Advice",
        "author": "ssjflexkage",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112adyx/career_advice/",
        "text": "[removed]",
        "created_utc": 1676394231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best college for a CS Degree?",
        "author": "csdegreehelpwanted",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1129p64/best_college_for_a_cs_degree/",
        "text": "[removed]",
        "created_utc": 1676392505,
        "upvote_ratio": 1.0
    },
    {
        "title": "Entry-level SE's: Don't be scared to move to odd/remote regions for your first job.",
        "author": "RootsInIron44",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1129p1y/entrylevel_ses_dont_be_scared_to_move_to/",
        "text": "Provocative title, but I'll explain the hook of it and try to argue the rationale against common counterarguments. \n\nSimply-put, a lot of non-technical companies will absolutely kill for entry-level talent that is willing to show up to an office in-person. This is especially true of companies that operate in remote regions: they often are more traditionally-minded and see remote work as a \"fad\". \n\nLook on LinkedIn at on-site jobs for remote regions like Indianapolis, Cleveland, Columbus, etc. Full-stack positions will have 3 applications sent in a week, when the company itself has a fine Glassdoor page and a decent starting salary. These companies are probably, for the most part, fine places to work at. You'll find just as much variety of experience in remote work, but 100x more competition.\n\nAny of you entry-level SE candidates are probably finding this to be a brutal job market, and it's not going to get easier for a while. However, this stage is the hardest part of your CS career. After you have a job for at least 6 months, you'll find that a lot of companies are **much more willing to hire you in the places you want to live in,** or even offer remote work. \n\nFor the record, I moved to Pittsburgh PA for that reason. I made my early career here, moved up quickly into good corporate environments, etc, because there was (and is) such a shortage of available tech talent. With 4+ years of intensive experience (2 of them remote), I can work in most countries; and at the 1-2 year mark I still had a wide pick of regions. For the record, I'm moving soon because this place is boring, but it was good to me and I think Pittsburgh is a great place to start your career. \n\nA lot of our families moved here from remote nations with economic crashes, crime, political strife, etc, to work the toughest and joyless jobs. My ancestors escaped martial law, civil wars, and poverty and put up with terrible stuff here for years. I really don't want to hear from anybody that they are unwilling to move to another state for cushy and decently-paid SE work, unless they have a loved one on their deathbed or some other pending legal/life-or-death reason to stay put. You can literally just move a year later.",
        "created_utc": 1676392497,
        "upvote_ratio": 1.0
    },
    {
        "title": "An analysis of the factors that matter for getting a Software Engineer job",
        "author": "xXguitarsenXx",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1129j6f/an_analysis_of_the_factors_that_matter_for/",
        "text": "I tried looking at the different stages of getting hired and what matters in each of them.\n\n## Phase 1: Discovery (Get discovered by the company)\n\n**3 ways to be discovered &amp; what to optimize for each way:**\n\n* Apply for the job (Optimize: Resume &amp; cover letter)\n* Employee referral (Optimize: Network of connections)\n* Outbound hiring (Optimize: Online presence)\n\n## Phase 2: Selection (Get selected for the interviews)\n\n**Things companies look at to see who they select for interviews:**\n\n* Resume\n* Reputation within network\n* Online presence (LinkedIn, Github, other social media profiles, googling the name of the person)\n* Online assessments (behavioral &amp; technical)\n\n## Phase 3: Interviews (Pass the interviews)\n\n**Types of interviews to pass:**\n\n* Screening calls\n* Behavioral interviews\n* Technical interviews\n\n**Passing the interview depends on these factors:**\n\n* Interview skills (Behavioral &amp; technical)\n* Luck (who interviews? Who are the other candidates? job market conditions?)\n\n## Phase 4: Doing the job (Keep the job)\n\n**Keeping the job depends on these things:**\n\n* Tech skills &amp; soft skills\n* Industry knowledge\n* Cultural fit\n\n## .\n\n.\n\n## _________________________________________________________________________\n\n**Based on this analysis these things matter:**\n\n**Skills:** Soft skills, technical skills &amp; industry knowledge\n\n**Reputation:** Network &amp; online presence\n\n**Job hunting skills:** Interview skills (behavioral &amp; technical. Online &amp; in-person) &amp; (Resume &amp; cover letters)\n\n**Other:** Cultural fit &amp; Luck\n\n&amp;#x200B;\n\nWhat do you think about this analysis?Is it correct?",
        "created_utc": 1676392091,
        "upvote_ratio": 1.0
    },
    {
        "title": "An analysis of the factors that matter for getting a Software Engineer job",
        "author": "pantyjob2",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1129fi7/an_analysis_of_the_factors_that_matter_for/",
        "text": "[removed]",
        "created_utc": 1676391829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for after maternity leave?",
        "author": "crosswalk_zebra",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11286jq/tips_for_after_maternity_leave/",
        "text": "I took a big maternity leave of about a year. I didn't practice anything as my mind wasn't with work and unfortunately our baby had health issues, which are now okay. \n\nHow did other working moms deal with getting back into things after a massive break? From our keeping-in-touch days I can tell a lot of the infrastructure will be very different and they are trying to put me on a more admin (aka dead-end) track than coding track so I might need to change jobs eventually.",
        "created_utc": 1676388703,
        "upvote_ratio": 1.0
    },
    {
        "title": "Charles Schwab N.E.R.D Program",
        "author": "Sea-Experience-7097",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1127xs3/charles_schwab_nerd_program/",
        "text": "[removed]",
        "created_utc": 1676388083,
        "upvote_ratio": 1.0
    },
    {
        "title": "Soc analyst!",
        "author": "DirectBuffalo7389",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1127upl/soc_analyst/",
        "text": "[removed]",
        "created_utc": 1676387865,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is an IT internship good for a future developer?",
        "author": "Father-Castroid",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1127k35/is_an_it_internship_good_for_a_future_developer/",
        "text": "I'm about to graduate soon(software engineering) and have started my job search, I had an it internship last summer that was a lot of bug fixing, some small features, etc. Would that internship not being a straight up developer internship be hurting my chances?",
        "created_utc": 1676387117,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've been laid off and now I'm not sure what to do",
        "author": "ImpostorSyndromeEng",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1127h0q/ive_been_laid_off_and_now_im_not_sure_what_to_do/",
        "text": "[removed]",
        "created_utc": 1676386925,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help with decision to go back to school",
        "author": "Potential_Lettuce",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1127ehd/need_help_with_decision_to_go_back_to_school/",
        "text": "Need help with possible decision to go back to school.\n\nTLDR:\nShould I attend this CS [program](https://online.merrimack.edu/masters-computer-science/software-engineering-curriculum/) while completing The Odín Project?\n\nFirst off, I know this is my decision and one like this should be made on my own. However, I would very appreciate input from people who may be more advanced than myself.\n\nI’m looking into this CS [program](https://online.merrimack.edu/masters-computer-science/software-engineering-curriculum/) at Merrimack College. If I were to start the program I would like to start this summer or fall. I’m also currently working my way through The Odin Project planning on going on to one of their full stack courses (still not 100% sure which I should do, Ruby on Tails or JavaScript)\n\nWould this degree + TOP + my current basic knowledge put me in a good spot?\n\nI want to make sure the program will give me good fitting but knowing so little of true CS concepts I don’t want to attend and miss out on important concepts.",
        "created_utc": 1676386778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to leave my job and start an Online Tech Business... Any business idea Suggestions/Discussions?",
        "author": "neonxed",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1127cnz/want_to_leave_my_job_and_start_an_online_tech/",
        "text": "[removed]",
        "created_utc": 1676386643,
        "upvote_ratio": 1.0
    },
    {
        "title": "Front end engineer help",
        "author": "AppearanceKlutzy774",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1127amd/front_end_engineer_help/",
        "text": "[removed]",
        "created_utc": 1676386495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it just me or does NYC entry salaries are dirt poor?",
        "author": "Dangerous_Cheeks",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1126tk7/is_it_just_me_or_does_nyc_entry_salaries_are_dirt/",
        "text": "Midwest salaries seem to have way higher range for some reason. Even upstate NY seems a tiny bit better. Is it because of the salary range law or does NYC not really a tech hub for entry level people?",
        "created_utc": 1676385273,
        "upvote_ratio": 1.0
    },
    {
        "title": "My current career has reignited my passion for a career in CS, but how long will I be taking a pay cut? (UK)",
        "author": "Confident-Silver-446",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11263ua/my_current_career_has_reignited_my_passion_for_a/",
        "text": "[removed]",
        "created_utc": 1676383368,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cold emailing can work for getting",
        "author": "fakeuser42p69696969",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11263g5/cold_emailing_can_work_for_getting/",
        "text": "[removed]",
        "created_utc": 1676383336,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does it make financial sense for me to switch my career? (UK)",
        "author": "Confident-Silver-446",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/112623j/does_it_make_financial_sense_for_me_to_switch_my/",
        "text": "[removed]",
        "created_utc": 1676383238,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any international students here want to share their success story?",
        "author": "ManWhoWantsToLearn",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1125uix/any_international_students_here_want_to_share/",
        "text": "I'm struggling to land interviews, have had 400+ applications and I would appreciate any tips and tricks.",
        "created_utc": 1676382678,
        "upvote_ratio": 1.0
    },
    {
        "title": "possibly being made redundant and looking for advice",
        "author": "6Joeking",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1125l7w/possibly_being_made_redundant_and_looking_for/",
        "text": "I'm in the uk, have 4 years experience as a full stack engineer, and have savings so not too stressed but looking for advice.\n\nJust had a meeting with my manager and he told me due to losing some big projects they need to cut costs and are thinking about redundancy. He said if I had any ideas to let him know and we're going to have another meeting tomorrow.\n\nBy any ideas I'm guessing he means reducing my pay which I'm not willing to accept, although perhaps reduced hours for reduced pay could be acceptable for a time. Is it time to update my cv and get job hunting? Or is there another solution I'm missing?",
        "created_utc": 1676381933,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stay positive after hiring freezes impacted job offers?",
        "author": "sollyv99",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1125h4h/how_to_stay_positive_after_hiring_freezes/",
        "text": "[removed]",
        "created_utc": 1676381597,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you handle folks refactoring your work?",
        "author": "SkinnyJoshPeck",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1124kc9/how_do_you_handle_folks_refactoring_your_work/",
        "text": "i’m a senior swe and every once in a blue moon i see someone do a PR on my work and it’s a fairly big refactor. That kinda stuff is normal and fine and i don’t get bothered. \n\nlately, my tech leads have been jumping in and out of a project i’m in charge of and WAY overstepping their scope of what they’re doing and redeveloping massive aspects of the infrastructure because it’s not how they want it. \n\ni push back and they won’t budge. it’s really, really frustrating because my philosophy is YAGNI and extreme programming, so I didn’t set things up to handle “maybe two people might work on this component at the same time” situations because *they won’t*. I was very proud of the work i had done; it was working smooth like butter and so easy to deploy and a tech lead literally came in and tore down the infrastructure i built just so we could rename some things and so they could test from local using the dev env and now it’s broken. i wrote the entire fucking suite so we didn’t have to rely on being connected to a service!!!!!\n\ni have yet to learn how to cope with people making stupid changes like “file names should be a_b not b_a because this custom parser i built that re-solves what you’ve already solved doesn’t work when the file is named the opposite of how you have it!” and “we need to change the entire stack in case someone wants to deploy their own” (literally zero reason to accommodate for that given the application purpose).\n\nhow do y’all handle conflict from unreasonable engineers?",
        "created_utc": 1676378809,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice required due to confusion about my future",
        "author": "Unique-Employee-9716",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1124dp1/advice_required_due_to_confusion_about_my_future/",
        "text": "[removed]",
        "created_utc": 1676378230,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oracle",
        "author": "DirectBuffalo7389",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11242ku/oracle/",
        "text": "[removed]",
        "created_utc": 1676377244,
        "upvote_ratio": 1.0
    },
    {
        "title": "Citadel team matching timeline",
        "author": "Horror-Medicine3321",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1123zpf/citadel_team_matching_timeline/",
        "text": "[removed]",
        "created_utc": 1676376983,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got offered a MUCH lower salary than what external recruiters promised and verified with the company, and salary is split like some kind of sales job",
        "author": "jamiekyn",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1123fxb/got_offered_a_much_lower_salary_than_what/",
        "text": "I’m a software engineer (not in the US), and I just finished the final interview with the HR and originally I was promised $80k per year by the external recruiters, and they even sent it many times over to the company, and during this final HR interview they offered about $42k for the base and $38k as KPI bonus (which I’m pretty sure I’m not gonna get) … \nSo from $80k to $42k like 50% lol.\n\n\nI have literally never seen software engineer salaries split like this; this seems like some sales/business development salary lmfao. \n\n\nI think I now know why they need external recruiters to fill their positions LOL. \n\n\nWhat I’m planning to do is just accept it and keep looking for jobs. Any thoughts? The external recruiters were all very nice throughout the entire process so I wanna make sure they get their commission",
        "created_utc": 1676375139,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got offered a MUCH lower salary than what external recruiters promised and verified with the company, and salary is split like some kind of sales job",
        "author": "jamiekyn",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1123fve/got_offered_a_much_lower_salary_than_what/",
        "text": "I’m a software engineer (not in the US), and I just finished the final interview with the HR and originally I was promised $80k per year by the external recruiters, and they even sent it many times over to the company, and during this final HR interview they offered about $42k for the base and $38k as KPI bonus (which I’m pretty sure I’m not gonna get) … \nSo from $80k to $42k like 50% lol.\n\n\nI have literally never seen software engineer salaries split like this; this seems like some sales/business development salary lmfao. \n\n\nI think I now know why they need external recruiters to fill their positions LOL. \n\n\nWhat I’m planning to do is just accept it and keep looking for jobs. Any thoughts? The external recruiters were all very nice throughout the entire process so I wanna make sure they get their commission",
        "created_utc": 1676375135,
        "upvote_ratio": 1.0
    },
    {
        "title": "career in BI using powerbi or survey programming, scripting. which is better?",
        "author": "Calm-Positive6138",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1122lzc/career_in_bi_using_powerbi_or_survey_programming/",
        "text": "[removed]",
        "created_utc": 1676372185,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please stop being rude to New grad",
        "author": "ReDdiToNlY7",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1122kcg/please_stop_being_rude_to_new_grad/",
        "text": "[removed]",
        "created_utc": 1676372020,
        "upvote_ratio": 1.0
    },
    {
        "title": "CS Bachelor's or Conversion Master's?",
        "author": "GiorgosKorn",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1120qxa/cs_bachelors_or_conversion_masters/",
        "text": "[removed]",
        "created_utc": 1676368978,
        "upvote_ratio": 1.0
    },
    {
        "title": "What salary shall I ask for if my present salary is 23 LPA?",
        "author": "tejasmikaelson",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1120fmd/what_salary_shall_i_ask_for_if_my_present_salary/",
        "text": "[removed]",
        "created_utc": 1676368600,
        "upvote_ratio": 1.0
    },
    {
        "title": "refer.me for referrals, worth it?",
        "author": "michberk",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111z4b0/referme_for_referrals_worth_it/",
        "text": "Hi everyone,\n\nI am a Spanish software developer with 3.5 years of experience who wants to relocate to another country (preferably the USA) to work in big tech companies. I know it's hard to get a position there, so I am wondering if having a referral would help.\n\nI discovered [refer.me](https://refer.me), a website where you can get referrals from people from different companies.\n\nHas anyone used that? How was the experience? \n\nI honestly don't know if it's worth it or not...",
        "created_utc": 1676366979,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I even try anymore?",
        "author": "littyveebs",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111y8gx/should_i_even_try_anymore/",
        "text": "Im a 20M undergraduate student. My first two years of university I studied CS. Sadly, due to mental health reasons, I failed many of my courses in my second year. Because of this, my university is not allowing me to pursue a bachelors degree in CS anymore and my GPA put me into academic probation. This forced me to declare a major in psychology (something im somewhat interested in but not passionate about). I find job and intern listings requiring a CS degree and a transcript for checking GPA. Combining layoffs and the mass saturation CS students, I feel extremely discouraged. Transferring universities would be hard with my GPA and my parents are very persistent on me getting a “university bachelors degree” than an associates degree at a local college. I work on my side projects (almost) daily to build a portfolio and regularly enter hackathons. I apply for many intern roles and jobs but i also feel like people see my degree and skip through my resume. As much as I love CS, am I chasing a future i might not get?",
        "created_utc": 1676365538,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best laptop for software development under 1k?",
        "author": "WokenSage",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111y7j4/best_laptop_for_software_development_under_1k/",
        "text": "[removed]",
        "created_utc": 1676365427,
        "upvote_ratio": 1.0
    },
    {
        "title": "How different is MLE vs SWE?",
        "author": "TheSwankyDanky",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111y6du/how_different_is_mle_vs_swe/",
        "text": "Current college student looking to go into MLE (yes with a masters, I’m going for one anyways for personal reasons), and I was wondering, besides the the obvious, if I decide MLE is not for me how hard is it to switch from MLE to SWE? Would I be locking myself to an MLE only career if I decide to go down the AI/ML route?",
        "created_utc": 1676365297,
        "upvote_ratio": 1.0
    },
    {
        "title": "community college bachelor's degree",
        "author": "loqueserasera01",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111x3gg/community_college_bachelors_degree/",
        "text": "Hey guys. I wanted to ask your opinion.\nI currently work as a medical lab technician at a hospital lab. I have an associates in med lab science.\nI'm enrolled in a bachelor's program in computer and information technology.\nhttps://catalog.southtexascollege.edu/baccalaureate-degrees/bat-computer-information-technologies/\nI'm hoping to transition into laboratory information systems or some kind of hospital IT.\nI'm curious on your thoughts on the degree or different career paths for this type of degree. \nTIA",
        "created_utc": 1676360822,
        "upvote_ratio": 1.0
    },
    {
        "title": "High School Senior Not Wanting CS",
        "author": "loopyquestuonair",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111x21t/high_school_senior_not_wanting_cs/",
        "text": "[removed]",
        "created_utc": 1676360667,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with not having much tasks to work upon?",
        "author": "Le_Minimalizier",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111wveq/how_to_deal_with_not_having_much_tasks_to_work/",
        "text": "I've joined a cloud based company last year, being a recent grad and it was quite good until December last year in terms of the learning experience gained through the tasks I was working with. I had a challenging project to work on and I was on my toes all the time to keep up with the deadlines. Since the start of this new year, I've been noticing that I'm able to complete most of my tasks quickly and I'm idle for most of the day. This is despite taking up new tasks apart from the regular project that I'm committed to. How do I deal with this? I've been learning some new technologies on the side during the free time but I feel guilty that I'm not committing my entire working hours to working on projects/work that help the team.",
        "created_utc": 1676359917,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with not having much tasks to work upon?",
        "author": "Important_Lie_7774",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111wtvd/how_to_deal_with_not_having_much_tasks_to_work/",
        "text": "[removed]",
        "created_utc": 1676359756,
        "upvote_ratio": 1.0
    },
    {
        "title": "Transition from dev to QA?",
        "author": "S0n_0f_Anarchy",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111wtrr/transition_from_dev_to_qa/",
        "text": "I have 2 YOE as a dev and Bachelors's, but those 2 YOE are all over the place which could be positive in some cases, it's mostly negative in this situation in IT market. I also have really good business logic, so I'm wondering if I should transition to QA. My main concern are benefits tbh. I know dev roles pay more, but is it THAT much more? Also, I can't really compete with this market knowledge wise cuz I've kinda shit the fan with changing so much tech stacks in 2 years (not that I wanted to). On the other hand, I think ( for some reason) that I would shine in QA cuz of these things that I've mentioned. I would ofc find some internship 1st, but I think my experience would really help me? Thoughts? Thanks",
        "created_utc": 1676359745,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unable to land jobs with so many applications, is it the market or myself?",
        "author": "ToroMora",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111wgmv/unable_to_land_jobs_with_so_many_applications_is/",
        "text": "Hi,\n\nJust like many other post, I have been attempting to apply on some many job on linkedin and had talked to recruiters reaching out from linkedin, but has not have any luck in landing actual interviews. Was just wondering if it is my lack of experience or is the current market is just very bad even at the non-faang level?\n\nHere is my paper, please take a look and let me know how you think. Thanks in advance.\n\n[https://imgur.com/a/GPIKSAn](https://imgur.com/a/GPIKSAn)",
        "created_utc": 1676358322,
        "upvote_ratio": 1.0
    },
    {
        "title": "Returning to the work force after a 1 year gap",
        "author": "Arc_Trail",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111vxy6/returning_to_the_work_force_after_a_1_year_gap/",
        "text": "I worked as a mobile dev for 3 years and needed to take off for a few things and ended up taking 1 year off. Now I'm hitting interviews and the biggest question that seems to leave them disappointed is \n\n\"How do you expect to catch up after 1 year off?\"\n\nI can tell them I've been studying the latest developments in mobile and refer to some of my work (portfolio and apps), but they always seem to switch to the be polite and get the interview over with mode. Any ideas what I could do to show people that I'm ready to start working again?",
        "created_utc": 1676356387,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can i work in technical software field with non computer based graduation certificate?",
        "author": "Same-Individual435",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111vwo1/can_i_work_in_technical_software_field_with_non/",
        "text": "[removed]",
        "created_utc": 1676356256,
        "upvote_ratio": 1.0
    },
    {
        "title": "A/I/R That Hispanics /Latinos get advice differently than other minorities?",
        "author": "Disney-Plus_baby",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111v3lr/air_that_hispanics_latinos_get_advice_differently/",
        "text": "[removed]",
        "created_utc": 1676353394,
        "upvote_ratio": 1.0
    },
    {
        "title": "Things to Learn for SWE",
        "author": "TheFatSack27",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111v0uk/things_to_learn_for_swe/",
        "text": "[removed]",
        "created_utc": 1676353132,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it better to work if a tech company or a non-tech company?",
        "author": "Ok-Entertainment-702",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111v0ko/is_it_better_to_work_if_a_tech_company_or_a/",
        "text": "What was the case before layoffs, and have they changed your mind? Do you have more flexibility with one or another, or better benefits?",
        "created_utc": 1676353108,
        "upvote_ratio": 1.0
    },
    {
        "title": "Id it bad that I asked my manager to approve my hours?",
        "author": "NewLegacySlayer",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111uxmx/id_it_bad_that_i_asked_my_manager_to_approve_my/",
        "text": "I started a new job recently that's contract to hire and at the first few months, I have to log my hours. the thing is my manager never really approves on time and it's usually a week late. I actually needed them to be approved on time because I have bills to pay so was getting anxious if he did it my the end of the week last friday and he didn't. I waited until end of Monday and then just ended up messaging him if he could just approve the hours. It takes about 2-3 days for it to get approved so that's going to be from when he approves it. I just don't if I should have asked him to approve it it's just I still have bills that I need to have paid and having to wait really long kind of sucks so I'm not sure what I did was right",
        "created_utc": 1676352829,
        "upvote_ratio": 1.0
    },
    {
        "title": "High school dropout needing advice after verbal offer turned into rejection",
        "author": "PrayzM",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111umvo/high_school_dropout_needing_advice_after_verbal/",
        "text": "Hi, I'm from Italy and just completed a boot camp recently, I've been surviving on unemployment benefits but it will soon expire. I did several interviews and one of them was going well, passed everything and sent my documents so I was just waiting for the written contract, but just got a call yesterday from the senior who's supposed to take me in his team and he told me that the company doesn't have anymore internship slots in Italy (this is a pretty big company, won't tell the name but I can tell you it's Canadian).\n\n\nSo now, I'm pretty much fucked because I declined other offers and stopped interviewing at all... I've been waiting for like 2 weeks for the written contract.\n\nI started reapplying right away.. But at this point I'm not sure how to proceed.\n\nI live alone and I'm 25 yo, my parents are divorced (I grew up with my grandparents so I can't even ask my parents for financial support because they live in different cities from mine, father has a new family and mother is a gambling addict) and I never finished high school because I went to work, should I just get a job to pay the bills and in the meantime get my diploma then try to go university for a degree or what?\n\nUnemployment benefits expire this month and to be honest I'm tired of working as a waiter..I've been doing these jobs since I was 15 and was hoping to finally get a decent career that gave me more opportunities in life.\n\nI really like computer science but I just got dealt a shitty hand by life...\n\nAny advice is appreciated.\n\nThanks.",
        "created_utc": 1676351805,
        "upvote_ratio": 1.0
    },
    {
        "title": "Amazon New Grad SDE or ADP New Grad SWE",
        "author": "wwqwe32",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111u1ki/amazon_new_grad_sde_or_adp_new_grad_swe/",
        "text": "[removed]",
        "created_utc": 1676349840,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I about to get fired as an intern?",
        "author": "name_is_too_long",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111topt/am_i_about_to_get_fired_as_an_intern/",
        "text": "I was hired as a summer intern and Ive continued working for the company part time during school. I completed some complicated tickets but I also didnt meet some deadlines and a lot of my tickets were sent back to me after QA review. Most of our team has been working on a platform redesign for about a month. When we started the redesign, a pretty well ranking dev and I worked on the main part of the application. The code ended up getting a little complicated and we had to modify a lot of other people’s code, but it worked well as a starting point. Unfortunately, there were a lot of issues with delivering it on time and there were a few weeks after we were done where it still had issues that we had to fix before we could show our progress to the rest of the company. After that debacle, I had to start working part time because of school. I completed tickets very slowly and didnt have time to learn the new build process so my tickets were often sent back from QA and they werent completed on time. The part of the application that I wrote was also replaced by a more well thought out module written by other members of the team.  \n\nMy boss is very tolerant of my mistakes and when we used to have 1 on 1s he’d always tell me im doing great. Ever since we started using the new tech stack, our team has begun to feel more “corporate” and less relaxed as we hire a bunch of new people. However, my boss has been increasingly short and passive aggressive to me and hes been asking for statuses on my tickets often(its a fully remote job). One time he even didnt submit my timesheets for a week and I had to tell him to submit them. He’s been most passive aggressive to me last week (used an exclamation mark in a dm in a bad way) so I know my reputation is only getting worse.\n\nI feel like my boss doesnt like me and is about to  fire me but I’m not sure since I’m still an intern, and I cost very little compared to a normal employee (under 30/hour). Is my manager just stressed out or am I about to get fired?",
        "created_utc": 1676348685,
        "upvote_ratio": 1.0
    },
    {
        "title": "which coding system should a beginner learn? I am looking into switching my career, just looking for some advice.",
        "author": "Future-Appropriate",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111tojj/which_coding_system_should_a_beginner_learn_i_am/",
        "text": "[removed]",
        "created_utc": 1676348670,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to transition from entrepreneurship to Product Management?",
        "author": "deinter2007",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111tmrw/how_to_transition_from_entrepreneurship_to/",
        "text": "[removed]",
        "created_utc": 1676348511,
        "upvote_ratio": 1.0
    },
    {
        "title": "CS Bachelor's or Conversion Master's?",
        "author": "GiorgosKorn",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111tl0m/cs_bachelors_or_conversion_masters/",
        "text": "[removed]",
        "created_utc": 1676348357,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone in this subreddit previously worked in the trades/labour? If so, was the transition into IT/CS worthwhile?",
        "author": "Mariners_",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111tbf4/has_anyone_in_this_subreddit_previously_worked_in/",
        "text": "How has your work-life changed? Do you enjoy the endless learning? How has your qualify of life improved/decreased?\n\nI come from a labour background and am currently studying for CS, but sometimes I romanticize trades for getting off work and it not following you home, ever. You kind of learn it once, and become a master overtime. Where Technology changes often and you have to study all the time or you lose value.\n\nAny advice is appreciated!",
        "created_utc": 1676347490,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moving from Canada to United States",
        "author": "Sad_Style_3452",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111tb5e/moving_from_canada_to_united_states/",
        "text": "[removed]",
        "created_utc": 1676347462,
        "upvote_ratio": 1.0
    },
    {
        "title": "Notivize is a good tool for mobile developers to use AI to write and deliver mobile push, SMS, and email messages.",
        "author": "eximpyro",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111t9s2/notivize_is_a_good_tool_for_mobile_developers_to/",
        "text": "&amp;#x200B;\n\nI wanted to share a platform that I recently discovered and I think it could be really helpful for many of you out there. It's called Notivize and it's a good tool for mobile developers to use AI to write and deliver mobile push, SMS, and email messages.\n\nOne of the things I love the most about Notivize is its AI writing tools that are trained specifically for mobile messaging channels. If you're like me and you sometimes struggle to come up with the right words to convey your message, their AI writing tools can help you write messages that are engaging and effective. I used it to write my last push notification and it was so helpful!\n\nAnother great feature of Notivize is its feed of messaging ideas. If you find yourself struggling with writer's block when it comes to messaging your app community, Notivize has a great library of daily content ideas to help you post frequently and keep your users engaged in your app.And finally, one of the things I love the most about Notivize is that it has an easy Firebase integration. With the click of a button, you can easily integrate your Firebase project with your Notivize account and start sending notifications almost immediately.",
        "created_utc": 1676347344,
        "upvote_ratio": 1.0
    },
    {
        "title": "I regret cheating throughout high school/college",
        "author": "Cheap-Community-8849",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111t8dk/i_regret_cheating_throughout_high_schoolcollege/",
        "text": "[removed]",
        "created_utc": 1676347226,
        "upvote_ratio": 1.0
    },
    {
        "title": "SWE Career Advice for an Extrovert",
        "author": "1amBulletproof",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111srvd/swe_career_advice_for_an_extrovert/",
        "text": "[removed]",
        "created_utc": 1676345792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Extroverted Software Engineering Career Help",
        "author": "1amBulletproof",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111spkq/extroverted_software_engineering_career_help/",
        "text": "[removed]",
        "created_utc": 1676345594,
        "upvote_ratio": 1.0
    },
    {
        "title": "Extroverted SWE -&gt; Management?",
        "author": "1amBulletproof",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111sn27/extroverted_swe_management/",
        "text": "[removed]",
        "created_utc": 1676345391,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got a HackerRank invite for a job application. Unsure of how it will be scored and how I should strategize",
        "author": "SignatureKrill",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111sjo6/got_a_hackerrank_invite_for_a_job_application/",
        "text": "The company I applied to just shared an invite to a HackerRank challenge. The invitation states that the test will include three questions, and I should pick two to attempt. The invite then says that if I choose to attempt the third question, this will be considered \"bonus points\".\n\nI haven't done many coding challenges for jobs before. I'm confident in my programming abilities, although I'm trying to strategize the best approach. I had a few questions that I was hoping some people could shed insight into:\n\n1. Do companies usually grade on speed for HackerRank? I know CodeSignal grades on speed. My invite says I get 60 minutes. Should I push for speed or play it slow (e.g., take more time to write custom test cases)?\n2. Does complexity (runtime) generally matter? I know CodeSignal often includes problems where your code will time out if it's too slow (like your code takes &gt;10 s when it should be &lt; 1 s). I also know the public HackerRank questions give people ranks based on runtime. However, getting high scores on those HackerRank leaderboards generally requires milking out milliseconds through arcane techniques, which don't matter for CodeSignal challenges. Overall, what should my attitude be towards runtime?\n3. Anybody got a clue what the deal is with these 2/3 questions required? I have no clue what my strategy should be here or how I should weigh \"bonus points\" relative to speed and runtime for the two questions I will definitely try to solve.\n\n**Would you recommend I just ask these questions to the recruiter?** I'm hoping reddit can provide me some general insight, but the answers to the above questions vary by company. Is asking the recruiter fine, so long as I'm not annoying? I'm not sure what I should even ask about this 2/3 \"bonus points\" thing, but I'm sure something can be crafted.\n\nI hope this doesn't come off as though I'm trying to game the system. I just want to know what is being tested, so I can best represent my coding ability.\n\nI will appreciate any comments.\n\nThank you",
        "created_utc": 1676345112,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Love My Job but the Pay has Stagnated",
        "author": "Chrithtoph",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111segp/i_love_my_job_but_the_pay_has_stagnated/",
        "text": "I'm working a software engineering job where last year I got an ~3% raise and this year I anticipate being promoted, but I heard from a coworker he only got like an 8-10% promotion bump. I enjoy the project, it's interesting, it's modern. I'm remote 4 days per week. I've received an offer from another company making 50%+ more, but it would be entirely in person, would require a minor move, and might be slightly more outdated, but nonetheless a pretty interesting project as well.\n\nIdeally I'd make similar pay (even 20% lower) at my current job and I'd stay, and tips or advice?",
        "created_utc": 1676344677,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm a Senior in college and I feel wildly unprepared.",
        "author": "ganzgpp1",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111s9k9/im_a_senior_in_college_and_i_feel_wildly/",
        "text": "Hey all! This is my first post here, but I've got a severe case of the worries. I'm a CS major in West Virginia, and I feel wildly unprepared for graduation.  \n\n\nI've got a 3.6 GPA, and am on my final semester in college (graduate in May) but I feel like I know next to nothing, although I've learned a LOT. I was granted an internship in the summer of my Junior year (my professor got me in extremely late) that I'm still working on, but won't complete for another year.  \n\n\nBecause of this, my resume feels extremely empty, and I'm worried I won't be able to get a job.  \n\n\nSo what I'm here to ask is- what do I need to know upon graduation? And if there are any CS majors from WV who are doing well (either in-state or out of state), what are your tips? What should I learn? Where should I apply? Most of our curriculum is in Java, although we have to take a class in Assembly as well, and I'm learning Networking as we speak.  \n\n\nPlease, help a graduating Senior relieve his stress ;-;",
        "created_utc": 1676344273,
        "upvote_ratio": 1.0
    },
    {
        "title": "How common are rescinded offers",
        "author": "ecl118",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111s2y6/how_common_are_rescinded_offers/",
        "text": "Just curious - with all the talk about meta and coinbase I was wondering how common it actually is when a company does layoffs for offers to be rescinded especially ones that start later like new grads. Is it usually done when a company is doing that terribly?",
        "created_utc": 1676343724,
        "upvote_ratio": 1.0
    },
    {
        "title": "Python for BackEnd Development",
        "author": "JR091",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111s1ra/python_for_backend_development/",
        "text": "So when python is used for backend development it's mostly focused on data analytics correct?",
        "created_utc": 1676343632,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the most to least technical recruitment needed in CS-related career?",
        "author": "Glad-Device-2586",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/111s02h/whats_the_most_to_least_technical_recruitment/",
        "text": "I'm only familiar with SWE since it requires a lot of LeetCode practice. Iwonder what recruitment process is like for the recruitment of data analyst/scientist, PM, and UI/UX designer.",
        "created_utc": 1676343511,
        "upvote_ratio": 1.0
    }
]