[
    {
        "title": "Can't pass any of these coding tests",
        "author": "kiljoy001",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11b1tr6/cant_pass_any_of_these_coding_tests/",
        "text": "How can I get better at these coding tests? I never seem to have enough time to finish them and find myself fumbling through them, having to fire up an ide (never seem to get an raw output on the test cases). FYI I can't even figure out the easy leetcode stuff and mostly have given up on that. Is there any hope for me or should I just go back to working in tech support?",
        "created_utc": 1677272135,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I take a remote/asynchronous job with a startup?",
        "author": "the_disputable_abw",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11b1tmw/should_i_take_a_remoteasynchronous_job_with_a/",
        "text": "[removed]",
        "created_utc": 1677272128,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you believe that software development will eventually become a true engineering discipline?",
        "author": "Apart-Plankton9951",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11b1knq/do_you_believe_that_software_development_will/",
        "text": "Where I’m from, accredited software engineering programs let you you become a licensed engineer in our order of engineers. The only reserved task is anything involving control systems and programming that you would need an engineer for (or an engineer to sign off the work of a non engineer). Although not explicitly mentioned in our laws, companies that hire developers for aerospace prefer software engineering grads over computer science.\n\nWith that being said, there are so many softwares that are important to the functioning of our society today, and frequently enough, we see some of these services break down, temporarily, but for enough time to make the headlines. \n\nIs there a need for a rigorous software engineering framework to be taught in academia and enforced by the law for software that will be used by the public, enterprises or government? \n\nIs this feasible and maintainable or will it receive backlash?",
        "created_utc": 1677271504,
        "upvote_ratio": 1.0
    },
    {
        "title": "...scam or not?",
        "author": "davlumbaz",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11b1kj3/scam_or_not/",
        "text": "Ayo. I just got a response from http://www.decanaria.com/web-scraper.html this spot, and they wanted me to build literally, a fully functional, scalable scraper, as a mini task. 2 weeks deadline. \n\nif, they accept it, and it is not a scam, I will go through:\n\n\nZoom chat with our Head of People (45 mins)\nTake home project (3 days to complete)\nZoom interview with one Sr Engineer - project &amp; technical interview (60 mins)\nZoom interview with one Sr Engineer - technical interview (45 mins)\nZoom interview with a Senior Partner - interview (30 mins)\nZoom interview with our Chief Product Officer (30 mins)\n\nis this a scam? should I just \"naaaah fuck it\", and continue to play Arkham Asylum? \n\nlike, I ask this, because back in the days where life was still fun, I data mined a fuckton of shit for my friends AI projects. and I wanna do the same again in a company, it was fun :'(",
        "created_utc": 1677271496,
        "upvote_ratio": 1.0
    },
    {
        "title": "For anyone working in tech, do you use R&amp;D/engineering/development when communicating with non-technical people either in email or in person.",
        "author": "youmade_medothis",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11b17op/for_anyone_working_in_tech_do_you_use/",
        "text": "See title. Specifically are R&amp;D and Engineering/Development interchangeable when talking in person or in email.",
        "created_utc": 1677270617,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dear programmers, how is it actually working as a programmer (of any kind!)",
        "author": "Explodous",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11b17j8/dear_programmers_how_is_it_actually_working_as_a/",
        "text": "As you can tell, I don't know how it is working as one. I am studying programming and nobody has said how it is working as a programmer at a company (or even freelance)  and I don't think they can answer since they've been teachers their entire careers (which is one way I guess)",
        "created_utc": 1677270607,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to become a Computer and Information Research Scientist?",
        "author": "Gamerfromnamek",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11b14ye/how_to_become_a_computer_and_information_research/",
        "text": "I'm a 20 year old college freshman getting an A.S. in CompSci. I plan on going to a university to complete a BS or Master's. I stumbled on a career called the Computer and Information Research Scientist and believe it perfectly aligns with my aptitudes and interests. The only problem is I don't know the specific path to become one nor do I know what the market for this career looks like as I suspect employers use different names for this job title. A lot of sources say to become a data scientist first but I keep hearing it's near impossible to find an entry-level job in DS.",
        "created_utc": 1677270417,
        "upvote_ratio": 1.0
    },
    {
        "title": "[RESEARCH] [HELP]",
        "author": "Internal_Yam_3665",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11b14sa/research_help/",
        "text": "[removed]",
        "created_utc": 1677270402,
        "upvote_ratio": 1.0
    },
    {
        "title": "I had two weeks to do a Codility test. Should I email the company now that I’ve done it or should I wait for their contact?",
        "author": "doozynoodle",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11b10js/i_had_two_weeks_to_do_a_codility_test_should_i/",
        "text": "Hello! \n\nSo I had an interview last week and I had until next Sunday to complete three coding tasks on Codility. I finally did it today and I’m not sure whether I should email the HR person I’ve been in contact with or if I should wait for them to say something. \n\nThis is my first interview, I’m a PhD student who may be (hopefully not though) losing her fellowship so I don’t have any experience with these things. \n\nWhat are your thoughts? Thank you!",
        "created_utc": 1677270101,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking advice to get better at my job",
        "author": "SecretTwilight",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11b0de9/seeking_advice_to_get_better_at_my_job/",
        "text": "Almost one year at my first job as full stack developer, and I just have one-on-one with my manager. He mentioned that my past sprint performances hasn't been meeting expectation and will not increase my salary. I do agree with him on not increasing my salary. I haven't been performing as nearly what I'm getting paid for, and I would like to get better at my job. He asked if there was any way that he can help me. I wasn't sure how I can get better. I code only python which I'm mediocre, especially when interacting with SOAP UI, API, and AWS API gateway. That's all my company uses, and eventually will use Linux to move some EC2 around. Love to know if there are my helpful resources out there. Thanks I'm advance.",
        "created_utc": 1677268496,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to negotiate for senior position?",
        "author": "fishymony",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11b0au6/how_to_negotiate_for_senior_position/",
        "text": "[removed]",
        "created_utc": 1677268309,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can i do an internship for a game developer position in Europe ?",
        "author": "Separate-Zucchini291",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11b09dp/where_can_i_do_an_internship_for_a_game_developer/",
        "text": "[removed]",
        "created_utc": 1677268210,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Information systems a viable degree? Especially when looking at the future opportunities?",
        "author": "greatyeets100",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11azub7/is_information_systems_a_viable_degree_especially/",
        "text": "[removed]",
        "created_utc": 1677267150,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like the company I work for has outgrown its management practices. What can I do to make the situation better?",
        "author": "PULLUP_KRWA",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11azq4n/i_feel_like_the_company_i_work_for_has_outgrown/",
        "text": "(This may be more of a business than a technology question and frankly a bit ranty, but I still really want some advice, especially from people who are more into the PM side of things)\n\nI am a line employee (i.e. I have no subordinates) in a technical role. I work for a product company with roughly 600 people working for it, and the number is expanding. The company is not strictly a unicorn (I guess because it was never a startup to begin with), but it has seen success, and is currently flush with cash. The growth is rapid, and new products/projects pop up a lot.\n\nThe issue is, after working here for a bit less than a year, I am starting to really see that our management is still mentally in the environment when the company was 30 people. We have Jira and Confluence and all the other tools, but frequently - our tasks come not in the form of Jira tickets, but in the form of Slack messages from VPs or AVPs saying \"hey. get this done pls. needed asap. end of this week max.\" Such tasks account for about half of our working time at least. Nobody knows who is working on what, it sometimes happens that several people/teams do the same thing, and planning is kind of impossible because who knows what falls onto us next.\n\nI can see some steps taken in the better direction - as the number of employees has grown so have other people been promoted into teamleads, and I can see higher ups slowly getting in the habit of coming to them instead of us directly, but this is a drop in the bucket. We also have recruited a few PMs, but it is clear that higher managers don't trust them - and why would they, if they know if they ask a manager, they will get a negotiation, and if they ask us directly, they will get action immediately. \n\nIs this a pathological situation? Does it get better as the company matures? And what can I, as an employee, do to rein in the chaos at least a bit?",
        "created_utc": 1677266859,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the general consensus regarding companies like Apex Systems?",
        "author": "NoKarmaHalp",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11azlkf/what_is_the_general_consensus_regarding_companies/",
        "text": "I didn't find much in this sub after searching, I was contacted by a recruiter for Apex Systems to schedule a phone call. I was curious, what is the general consensus for this company and short term contract to hire roles for a new grad? Is there anything to be aware of?",
        "created_utc": 1677266525,
        "upvote_ratio": 1.0
    },
    {
        "title": "Potential offer coming in for a technical consultant role and curious about what would come after",
        "author": "georgiaboy1993",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11azfqz/potential_offer_coming_in_for_a_technical/",
        "text": "I'm flairing this as new grad since this I'm entry level but a career changer. \n\nLittle background: I'm a career changer, started learning code 2 years ago, did a bootcamp (one of the better ones) last year and I have been job hunting for a couple months now with waxing and waning levels of phone screens and interviews. \n\nJust recently I've had 2 separate companies express state they did not think I had the experience for the roles I had applied for but thought my technical and nontechnical communication skills would be a good fit for a role that sounds more project manage-y than software development but both said there was an element of coding involved as well. \n\nI'm wondering if this is a decent first step into breaking into the software engineering field or possibly the product management side of things if I ended up enjoying that more. \n\nNew this experience so wanted to see if anyone here had any advice.",
        "created_utc": 1677266127,
        "upvote_ratio": 1.0
    },
    {
        "title": "People undermine me on optional meeting when not noticing I am there (happened at two jobs already)",
        "author": "StarlightNightsFey",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11azfoa/people_undermine_me_on_optional_meeting_when_not/",
        "text": "This is really unusual experience for me. I have 6yoe and I never had it happen before, now it happened twice in a span of a few months. I am generally calm and not a bold person, but usually liked and respected.\n\nOne manager from different team was clearly not suited for his role and he talked to everyone on meeting that he needs others to check my work contribution because he thinks I underdeliver (which was really weird as my evaluations were always great and my own managers were impressed). Noone stood up for me, two people laughed also not noticing me (it was bigger meeting) and I just said 'I am here', which made everyone uneasy, but clearly it looked like thing that happens when I am not on meeting. I just left company since they generally had tendency to promote blunt and manipulative people.\n\nNow I have work which I really liked so far and few months in same thing happen, just different context - colleague didn't notice I was there on meeting and laughed to everyone about my other meeting questions. Here at least noone joined and they clearly looked startled.\n\nMy closer colleagues all think it's jealousy and it will happen the more experience I have, that as a junior I wasn't a threat.\n\nDid it happen to anyone?",
        "created_utc": 1677266121,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bivium Group - Job Offer Scam?",
        "author": "monkeybutts28",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11azehq/bivium_group_job_offer_scam/",
        "text": "Hey there, wondering if anyone has had an interaction with The Bivium Group in Boston MA? \n\nI am currently working on the transition from Network Engineering to Software Development. I applied to a job posted by them on LinkedIn for a junior role a few weeks ago and have been working with a recruiter.\n\n I took an assessment and the recruiter just reached out telling me I got the position, starting at $80 an hour. I never talked to a hiring manager, I did all the talking/paperwork through the recruiter. That seems a little sketchy to me, and it also seems sketchy that they are paying so high for a junior position.  \n\nWhen I look them up I am not getting any dirt on them...but I'm also not finding anything promising either. They have a website, a LinkedIn with a very minimal amount of employees/posts, a Facebook with some empty reviews, a Glassdoor with no reviews. The street view of their address on Google maps seems to pull up a wall? I don't know. The whole thing is weird. But if a scam company was founded in 2002 you would think something negative would pop up by now. \n\n&amp;#x200B;\n\nThe full email can be found in text here with names redacted and the aforementioned links will be at the bottom of the post \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n **Hello,**  \n \n\n**After  reviewing your application and conducting due diligence, I'm pleased to  inform you that management has largely decided that you are qualified  to hold the position of Junior Software Engineer (on a REMOTE basis).**\n\n**Let  me congratulate you on behalf of the company on your success. The  Bivium Group is currently putting together a one-of-a-kind team.**\n\n**We  believe that your knowledge, skills, and experience would be an  excellent fit for our creative team and would contribute significantly  to the overall success of the company.**\n\n**Your daily duties will be outlined in an email, and you will be assigned a supervisor to assist you in completing them.**\n\n**You  can get your weekly pay via check, direct deposit, or wire transfer  starting at $80 per hour. Paid time off, a wellness program for  employees, and health, vision, and dental insurance are just a few of  the benefits available. After three months of employment with us, you  will be eligible for additional benefits.**\n\n**When  the five days of online training are completed, you will be emailed a  user ID, password, access to the corporate server, and a list of phone  numbers for each department you need to contact.**\n\n**The following information must be provided as soon as possible in order for HR to register you and complete your paperwork.**\n\n**Your full name and complete residential address**\n\n**Contact number:**\n\n**Your electronic mail address**\n\n**Simply submit the above-mentioned information immediately.**\n\n**After  you submit your information, you will receive a copy of the employment  agreement documentation (PDF), which includes the firm's laws and  regulations as well as any potential health benefits. You must read it,  sign it, and email it back to the email address you were given when you  first received it.**\n\n**Stay blessed.**\n\n&amp;#x200B;\n\n[http://www.biviumgroup.com/](http://www.biviumgroup.com/)\n\n[https://www.linkedin.com/company/the-bivium-group/](https://www.linkedin.com/company/the-bivium-group/) \n\n[https://www.facebook.com/biviumgroup](https://www.facebook.com/biviumgroup)\n\n[https://www.glassdoor.com/Reviews/The-Bivium-Group-Reviews-E5102816.htm](https://www.glassdoor.com/Reviews/The-Bivium-Group-Reviews-E5102816.htm)",
        "created_utc": 1677266042,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m gonna “laugh” when bird flu forces everyone to go remote again after companies try to bring everyone back in. Just sayin.",
        "author": "Impossible_Map_2355",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11azcpn/im_gonna_laugh_when_bird_flu_forces_everyone_to/",
        "text": "Remote work just seems more adaptable to whatever situation the world can throw at us. Forcing people back into an office is regressive and backward thinking.\n\nJust seems stupid, especially with xyz virus/pandemic always on the horizon.\n\nNo I won’t be laughing at people dying but when the next thing takes off I’m definitely gonna be like “ha, fuck you” to the decision makers.\n\nEnd shitpost",
        "created_utc": 1677265914,
        "upvote_ratio": 1.0
    },
    {
        "title": "Renege Military Contractor Company?",
        "author": "SquirrellyFacy",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11azb7k/renege_military_contractor_company/",
        "text": "Hello everyone, I am looking for some advice.\n\nI currently have an offer to join a Big N company as a SWE this upcoming summer but do not know if that offer will stand (either rescind, delay, etc.). Due to this concern and to protect myself, I starting looking for jobs and got an offer for a military contracting company that requires a security clearance. I want to accept this job with the intent to renege if the Big N offer reaches my start date. I wanted to ask everyone if this is ethical/legal given this military offer requires a security clearance that will have the approval process begin as soon as the offer is accepted. Has anyone ever reneged a military contracting company before? I am looking to protect myself in this job market so the idea of reneging a job offer is not my main concern. I am mostly looking to understand what consequences would occur given the offer is for a military contracting job.\n\nThanks everyone!",
        "created_utc": 1677265813,
        "upvote_ratio": 1.0
    },
    {
        "title": "Renege Military Contractor Company?",
        "author": "ThrowAway238956q98o",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11azb17/renege_military_contractor_company/",
        "text": "[removed]",
        "created_utc": 1677265801,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone with experience of taking a break from career?",
        "author": "neferpitou33",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11az7t8/anyone_with_experience_of_taking_a_break_from/",
        "text": "Hi everyone. I have 8 years of experience. I am a new mom and thinking of taking a break from my software career. A year or two at most.\n\nAnyone who has done so(successfully or unsuccessfully) I would like to hear your experience.\n\nHow did the the year gap affect you when you applied to new jobs, was it very tough to get call backs?\n\nIs it also harder (psychologically) to prepare for interviews and return after the break?",
        "created_utc": 1677265573,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will my CS degree be relevent if unused for a year?",
        "author": "No-Mood7971",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ayz97/will_my_cs_degree_be_relevent_if_unused_for_a_year/",
        "text": "[removed]",
        "created_utc": 1677264991,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you leave this industry if you got paid more somewhere else?",
        "author": "theeburneruc",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ayunh/would_you_leave_this_industry_if_you_got_paid/",
        "text": "I worked with someone in this industry. Over time, I could see him getting more and more depressed due to the nature and stress of the work. Then, he suddenly quit one day. I reached out to him to find out that he had found a job as a Trucker that was going to pay him at least as much as what he was making, and that the stress was far less.\n\n&amp;#x200B;\n\nWould you leave this field/industry, if you got a job that:\n\n* paid far more\n* the work was less stressful\n* the job was more secure against layoffs/recession\n* But, the work was more tedious and boring\n\n&amp;#x200B;\n\nI know that even if I got offered something like a security guard job for 300k/year, I wouldn't take it. Nothing more soul sucking than standing/sitting in the same place having nothing really to do, every work day for the rest of your life.",
        "created_utc": 1677264670,
        "upvote_ratio": 1.0
    },
    {
        "title": "Linkedin workshop",
        "author": "SpotKindly3309",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ayjsu/linkedin_workshop/",
        "text": "[removed]",
        "created_utc": 1677263920,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on graduating in May 2024 vs Jan 2025?",
        "author": "Fun-Orchid2911",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11axzjr/thoughts_on_graduating_in_may_2024_vs_jan_2025/",
        "text": "I am an international student studying MSCS at UFL. I have nearly 3 years of prior work experience in India(2.5 years at HPE as an intern and SDE, 6 months at Amazon as SDE). I have to make the this choice in a month's time. Graduating early seems tempting but it comes with a higher risk since I'll have to manage courses, part time and job search in my last semester and less time to prepare. If i chose to graduate in Jan 2025 I will have to spend more money while in college and start earning late but I will have less pressure on me in the last semester while i look for a full time job. I can also do 2 internships before I graduate but finding internships is as hard as getting a full time job if not harder. Considering the economic scenario for CS related jobs which move would be wiser?",
        "created_utc": 1677262519,
        "upvote_ratio": 1.0
    },
    {
        "title": "Company wants to stop me from partaking in any kind of professional work",
        "author": "designgirl001",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11axrr7/company_wants_to_stop_me_from_partaking_in_any/",
        "text": "I hear it's fairly common for companies to bar you from engaging in any \"professional services\" outside of what you do for them (in a full time engagement). Now, this company is in the tech industry and I would like to offer coaching services to university students. I'd also like to engage in hobbyist art, which is not money making at this point. Has anyone had any success in negotiating these clauses? The work I am thinking of will be unrelated to the companies line of business. I don't want to give this up, and take on the risk of them being my only source of income. The income I will generate from these additional endeavours will be minuscule compared to the salary - it's just a hobby at this point.",
        "created_utc": 1677261972,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coding Won’t Exist In 5 Years. This Is Why",
        "author": "gigachadhd",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11axkum/coding_wont_exist_in_5_years_this_is_why/",
        "text": " \n\n[https://javascript.plainenglish.io/coding-wont-exist-in-5-years-this-is-why-6da748ba676c](https://javascript.plainenglish.io/coding-wont-exist-in-5-years-this-is-why-6da748ba676c)\n\nWondering how everyone feels about articles like this? Seems alarmist but maybe probable?",
        "created_utc": 1677261500,
        "upvote_ratio": 1.0
    },
    {
        "title": "Start new job after background check for a different job",
        "author": "SnooCalculations7672",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11axaof/start_new_job_after_background_check_for_a/",
        "text": "[removed]",
        "created_utc": 1677260770,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I underpaid as a Product Owner? What should I be expecting in terms of pay?",
        "author": "NPC200",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ax785/am_i_underpaid_as_a_product_owner_what_should_i/",
        "text": "As the title says, I am looking to know how much a PO makes on average and what I should expect in terms of pay. I have some detail below. \n\nI am not the first in my family to graduate collage but I am the first to go into the CS field. Which happened mostly on accident. I got hired in the midst of Covid to be a Product Owner at a Fortune 100 company. I had very little experience in CS previously. Didn't even go to school for it. The only real experience I had was implementing a large new system at the bank I was previously at. I only got that because I was the last person still on site to help with testing/troubleshooting.\n\nThat said I interviewed well and was hired at $65,000/yr for what is essentially a remote position. I knew that I was paid less than the devs. I expected that as I was new to CS and our roles were very different so it didn't bother me. None of the other POs are located near me so it is hard to talk about what they might get paid or even gauge if they would be open to the conversation. Basically I have no benchmark for what I should be getting paid. When I looked it up on Glassdoor I was seeing $90-100k which seemed insane for me as I have no background in CS.\n\nPay had come up once before and my manager said something about raising mine but she was in the process of moving positions and there was talk of company wide raises so I didn't think much of it at the time. However, last week my new manager called me just past EOD. It was a thirty second call, maybe a minute, where he said he was aware that I am underpaid, he is looking to get it fixed, and to \"Hang in there.\" \n\nI am coming up on two years here. I have worked on multiple fairly high level projects. At least one of them made the news. Right now I make $67,000/yr living in a MCOL city. Am I underpaid that badly? What should I expect?",
        "created_utc": 1677260518,
        "upvote_ratio": 1.0
    },
    {
        "title": "Join new company after background check with different company",
        "author": "NoNetwork4822",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ax6a5/join_new_company_after_background_check_with/",
        "text": "[removed]",
        "created_utc": 1677260454,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please name a backend project that would impress any recruiter.",
        "author": "raulalexo99",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ax03p/please_name_a_backend_project_that_would_impress/",
        "text": "I am having a very hard time to get my foot in the door as a jr backend developer. Maybe my projects are too basic. Can you recommend one project that you strongly believe would help me get more interviews?",
        "created_utc": 1677260015,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switching domains",
        "author": "Objective-Candle-585",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11awnj1/switching_domains/",
        "text": "[removed]",
        "created_utc": 1677259172,
        "upvote_ratio": 1.0
    },
    {
        "title": "CS Lawyer transitioning to CS Management",
        "author": "Altruistic-Ask-5082",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11awf6g/cs_lawyer_transitioning_to_cs_management/",
        "text": "[removed]",
        "created_utc": 1677258599,
        "upvote_ratio": 1.0
    },
    {
        "title": "how much does college prestige matter for job prospects?",
        "author": "SubstantialIdea2045",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11awf0k/how_much_does_college_prestige_matter_for_job/",
        "text": "[removed]",
        "created_utc": 1677258588,
        "upvote_ratio": 1.0
    },
    {
        "title": "Full Stack or Frontend dev in CV?",
        "author": "Artistic_Sink_2022",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11avuil/full_stack_or_frontend_dev_in_cv/",
        "text": "[removed]",
        "created_utc": 1677257157,
        "upvote_ratio": 1.0
    },
    {
        "title": "What GPA should I put on resume and competitive?",
        "author": "Still-University-419",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11avpr7/what_gpa_should_i_put_on_resume_and_competitive/",
        "text": "[removed]",
        "created_utc": 1677256827,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interested in joining Formation.dev? Here's why you shouldn't.",
        "author": "Available_Bother_342",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11avgmp/interested_in_joining_formationdev_heres_why_you/",
        "text": "[removed]",
        "created_utc": 1677256192,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a roadmap for those who want to be a cs student at university and become an artificial intelligence engineer?",
        "author": "Forward_Comb5021",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11avbl4/is_there_a_roadmap_for_those_who_want_to_be_a_cs/",
        "text": "i want to become ai engineer as a cs student. What path should I follow?",
        "created_utc": 1677255823,
        "upvote_ratio": 1.0
    },
    {
        "title": "System Design + Software Architecture Books",
        "author": "josbahena",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11av9nx/system_design_software_architecture_books/",
        "text": "I am a mid level deliver aspiring to one day in the future become a software architect. \n\nWhat are some awesome books that blow your mind or helped you become the experience tech lead / manager / architect that you are today?\n\nI want further extended my design thinking. As I am juggling 2 startups and aws cert at the moment.",
        "created_utc": 1677255684,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help I am a middle class B.E computer science graduate and i can't find any job",
        "author": "Gggssww2323",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11av304/please_help_i_am_a_middle_class_be_computer/",
        "text": "[removed]",
        "created_utc": 1677255213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Those of you who work near or in an OS kernel (any OS: Linux, Windows, BSD, macOS/Darwin/XNU) - what’s the typical day to day job life? What’s it like? I’m considering a career shift. Help me figure out what to do with my life! 🤣",
        "author": "gplusplus314",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11av0mt/those_of_you_who_work_near_or_in_an_os_kernel_any/",
        "text": "[removed]",
        "created_utc": 1677255041,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to become a product manager in a tech company?",
        "author": "InternetRambo7",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11auit1/how_to_become_a_product_manager_in_a_tech_company/",
        "text": "[removed]",
        "created_utc": 1677253791,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to become a product manager in a tech company?",
        "author": "InternetRambo7",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11auhfn/how_to_become_a_product_manager_in_a_tech_company/",
        "text": "[removed]",
        "created_utc": 1677253689,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone actually use calculus?",
        "author": "DoubleT_TechGuy",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11au6fj/anyone_actually_use_calculus/",
        "text": "I had to take up to calc 3 and linear algebra for my cs degree. I've never used any of this in my career. I'm curious if any of you have? What does a non research cs job that requires calculus even look like?\n(Not that I regret learning it btw. I just notice I don't ever use it in my career.)",
        "created_utc": 1677252877,
        "upvote_ratio": 1.0
    },
    {
        "title": "Workshops/Classes for SWEs in NYC/Online?",
        "author": "africuhh",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11au6dc/workshopsclasses_for_swes_in_nyconline/",
        "text": "Anyone know where I can find live swe/electronics/etc classes?  I'm already working as a SWE and I have a CS degree, so I'm not interested in a bootcamp. I just want to branch out my current knowledge mainly for fun and work with new tools / build random shit. I would also like to meet and socialize with more engineers regularly but I'm also not necessarily looking to network.",
        "created_utc": 1677252872,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any suggestions for software development groups I can join where people actually interact?",
        "author": "JustDeadOnTheInside",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11au3uy/any_suggestions_for_software_development_groups_i/",
        "text": "I'm horribly isolated right now -- unemployed with no friends or professional network. I need to engage with others, preferably in a setting that's not just a message board. I live near the DC area, if that helps.",
        "created_utc": 1677252691,
        "upvote_ratio": 1.0
    },
    {
        "title": "How easy is it to get a job with Technologies you've never used before?",
        "author": "xXguitarsenXx",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11au1w3/how_easy_is_it_to_get_a_job_with_technologies/",
        "text": "**How easy is it to get a job with Technologies you've never used before in another job?**\n\nJob descriptions are often VERY specific... \n\nExample:\n\n* 4 years of experience with C# .net core\n* Entity framework\n* 2 years of experience with PostgreSQL\n\n&amp;#x200B;\n\nIf I get a job working with some technologies, how easy is it then to switch technologies later?\n\n* Is it easy to get a JAVA job if you've previously worked with C#?\n* Is it easy to get a C++ job if you've previously worked with PYTHON? (or the other way?)\n* Is it easy to get a Frontend job if you've only done backend? (Or the other way?)\n\n&amp;#x200B;\n\nHow easy is it to transition from one technology stack to another? Or from frontend to backend? \n\nMaybe it's necessary to make some personal projects using the technologies you haven't worked professionally with and put that on your resume because otherwise your resume will not be seen because of ATS (application tracking systems)?\n\nOr what else can be done if you want a job with some technologies you haven't worked with professionally?",
        "created_utc": 1677252553,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling with tool sets. What is the strategy to learn complex tools?",
        "author": "football_engineer",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11atyq6/struggling_with_tool_sets_what_is_the_strategy_to/",
        "text": "Hi!\n\nRecently switched jobs which is heavy on Docker, Kubernets, Nomad, Packer, Terraform, Vault, Traefik, CircleCI to name a few. Each of these tools is quite complicated on its own, and being thrust into an environment where all of them are used is overwhelming me a bit.\n\nDo any of you have tips on how to go about in such a situation? I am proficient at the coding part of the job, but clueless at these aspects. Luckily my manager understands and seems to be sympathetic, but I also want to make sure that I can contribute as soon as possible.",
        "created_utc": 1677252318,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dirty Tech Tricks Series: Expanding Scope to user story mid-sprint, without expanding points 😿",
        "author": "pantshirtshoes",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11atxdn/dirty_tech_tricks_series_expanding_scope_to_user/",
        "text": "[removed]",
        "created_utc": 1677252214,
        "upvote_ratio": 1.0
    },
    {
        "title": "Professional guidance/advice needed: I am at a crossroad in my career.",
        "author": "Vegetable_Advice_2",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11atqev/professional_guidanceadvice_needed_i_am_at_a/",
        "text": "[removed]",
        "created_utc": 1677251712,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal to be pressured finish work?",
        "author": "mr_deez92",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11atpum/is_it_normal_to_be_pressured_finish_work/",
        "text": "I work at JPMC. I have 4 YOE. Within my team I feel like we are always under a time crunch to finish work, no matter how fast we move the time crunch doesn’t let up.\n\nWriting/Architecting good software takes time, and management just wants to rush these things to production. But they don’t realize rushing will lead to missed specs and more bugs than if they were to take their time.\n\nAlso I think management has unrealistic estimates for how long things will take, they estimate things based on if things go perfect but nothing ever goes perfect the first time. Especially in a big company that has many workflows and processes to accomplish something. How can I push back on this ideology? \n\nI’m getting to the point where I just do what I can in 40-45 hrs and let the cards fall where they fall. I don’t mind working hard for a sprint but it seems every time our team works hard they want another level out of us. Is this normal? Or is this the early stage of burnout?",
        "created_utc": 1677251672,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jobs descriptions asking for \"x years of experience with C\\C++\"",
        "author": "UselessTM",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11atoo2/jobs_descriptions_asking_for_x_years_of/",
        "text": "[removed]",
        "created_utc": 1677251585,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this ghosting, or a financial institution just moving slowly?",
        "author": "TravellingBeard",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11atkdj/is_this_ghosting_or_a_financial_institution_just/",
        "text": "On Feb 13, I had the last two interviews of four for the IT department of a financial consulting company.  I don't want to give too much detail, but they have interesting problem solving questions in their interviews not related to IT (that part covered in first two interviews).  They told me it will be a few days to a week \"or so\".  I sent a thank you email to the recruiter coordinating all this a couple days after saying would be happy to provide any other info they may require.\n\nNow I'm wondering if I've been ghosted.  No response from the recruiter, no emails at all from anyone.  But the job board on their side still says in progress.  I'll be doing more job searches in the mean time, but curious if this is a slow process normally for financial institutions or not.  I've never had to wait this long since the last interview for a response.",
        "created_utc": 1677251265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Honest question. Why does this sub look down on defense companies?",
        "author": "PunisherNation",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11atk54/honest_question_why_does_this_sub_look_down_on/",
        "text": "People would rather go to a WITCH contractors!",
        "created_utc": 1677251248,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Degree for a Career in Cybersecurity or Digital Forensics",
        "author": "Selection_Icy",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11atk05/best_degree_for_a_career_in_cybersecurity_or/",
        "text": "[removed]",
        "created_utc": 1677251238,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm now your manager and I'm an idiot - what do you want from me?",
        "author": "skyboundmonarch",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11at8s9/im_now_your_manager_and_im_an_idiot_what_do_you/",
        "text": "Today has been an eventful morning.\n\nLong story short, I work for a globomegacorp as a manager running a combination sysadmin/help desk group.\n\nA manager of one of our dev teams was let go for \"*various reasons*\", and for the foreseeable future his team of six has been rolled up under me.\n\nI'm pushing right now for them to be moved under one of the other dev team managers because I'm going to be straight with you: I have no clue what this team actually does on a day-to-day basis and I write code at a hobbyist level *at best*. I just walked in the office this morning to a Teams meeting with six bright eyed and bushy tailed devs staring at me wondering, \"now what?\". I'd like to say I don't know why management moved them under me but I'm pretty its because we're in the same time zone and my company thinks \"all y'all computer people are the same\".\n\nInitially I was hoping this was something where I'd just sign timesheets and approve their PTO for a few weeks until a new person was hired, but after a subsequent meeting with management I've been told this is a \"permanent until the economy shakes out\" type move which is why I'm pushing hard for them to get under a better suited manager. If that doesn't work, they're under me for six months to a year.\n\nIf you were put in their boots - what do you want from me? How can I help? What can I do to make your life easier?\n\nOh and if you're one of my new team members and you happen to be reading this - uh... hi! I'm coming to ask this question of you in person in a few hours.",
        "created_utc": 1677250420,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think my new coworker lied on their",
        "author": "throwaway09234023322",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11asg89/i_think_my_new_coworker_lied_on_their/",
        "text": "So, we hired this person a month ago who claimed to have several years of experience using our tech stack. However, I've been helping them with things and I don't believe they have experience with any tech stack or a solid foundation in CS. Anyways, I went on their LinkedIn and saw a bunch of freelance work after a bootcamp, which I'm pretty sure if fake. Anyways, what would you do? I feel like I have to bring this up to my manager because they are just going to be a waste of the teams time and have no integrity to begin with.",
        "created_utc": 1677248283,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think my new coworker lied on their resume",
        "author": "throwaway09234023322",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11asf66/i_think_my_new_coworker_lied_on_their_resume/",
        "text": "[removed]",
        "created_utc": 1677248204,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many holidays do you get to have within a year?",
        "author": "Subject-Platform-104",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11arv1u/how_many_holidays_do_you_get_to_have_within_a_year/",
        "text": "[removed]",
        "created_utc": 1677246663,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do improve my ability to learn new things quickly in this field?",
        "author": "Kevadin",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11arpeu/how_do_improve_my_ability_to_learn_new_things/",
        "text": "Right now I'm still in undergrad and graduate Spring 2024. When I compare myself to my peers I feel that I'm too slow in learning new technologies, methods, languages and how they tie together to produce a final product. I'm afraid when/If I get an internship or first dev role I will not be pulling my weight as it will take me too long to learn new things.\n\nIf we take Git for example: for me to feel comfortable using Git I would have to read a few books and practice with it; this all takes  time. Others can just start using it and learn as they go.\n\nI understand this is a broad question, but how do I improve my ability to learn new things and how they tie together quickly? Are there any books I can read, problem solving exercises, etc?",
        "created_utc": 1677246210,
        "upvote_ratio": 1.0
    },
    {
        "title": "for anyone who has experience in data engineering, project management, or cybersecurity, which one have you enjoyed the most? I need help",
        "author": "InevitableTraining69",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11arikn/for_anyone_who_has_experience_in_data_engineering/",
        "text": "I'm about to be 2 years at my current company as a senior day to analyst, and I'm honestly really not enjoying it because of how bad leaders in the industry are at understanding data, or what goes into it. Boss thinks better data sources like BigQuery and Oracle are unreliable even though half the company uses it, So we use Excel exclusively with 500k rows and just send the same workbook back and forth. I spend most days working 7:00 a.m. to 7:00 p.m., incompetent leaders at my current job and my previous jobs. I'm not sure if I'm extremely unlucky, or if this is just how data analytics is but I'm pretty much just exhausted from it....\n\n\nSo my three options are Data engineering, project management, and cybersecurity. My company is a great company and has all three, it's just a matter of which one to go into. \n\n\n\nMy concerns for data engineering specifically are that while I do possess a lot of technical knowledge, and I can get things done if needed to, I suffer sometimes from being a non-technical person. In the past I've just consulted with the engineering team in order to get databases created in SQL or to have a query created or optimized. I feel like data engineering could be a good career, but a huge leap, and the possibility of drowning in how much there is to learn and being overwhelmed by it. Plus I don't know how bad bosses are or how stakeholder management is. \n\n\n\nCybersecurity seems extremely fun, and there are several cyber security one or two analysts, and then I could even become a cybersecurity project manager later on. I have a degree in information systems and I did take a Linux ethical hacking course, as well as a cybersecurity course. I thought it was awesome. But I don't know how far I could get into it because again, non-technical person so I don't know if I would even be able to advance to an engineer position in security. I also have some skill in Python, but I'm not really a fan of programming at all\n\n\nThen there's project management. I started my career as a project analyst, and I thought it was a blast. It was at an organization using waterfall instead of agile, which kind of sucked, But just getting to be involved in so many projects, change requests, the whole project management life cycle was awesome. The only thing I dislike is the work life balance can be extreme sometimes, and whenever there's extra work to be done, they say screw it, just throw it onto the project analyst. So I'm not sure how a senior project analyst would do, but I've seen senior project analyst positions, and project analyst lead positions lately. \n\n\nAny advice you might have about any of these industries that you have or have not worked on would be great",
        "created_utc": 1677245653,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think everyone knows by now that ChatGPT won't replace software engineers.. but do you think it will affect our day to day work (make us more productive, etc) ?",
        "author": "yeahdude78",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ardmx/i_think_everyone_knows_by_now_that_chatgpt_wont/",
        "text": "Title.  \n\n\nI think it's clear that software engineering isn't going anywhere, anytime soon.\n\nBut do you think the nature of these AI tools will change our day to day jobs? For example, maybe there will be no reason to specialize in an area if you're a web dev.. instead of being a backend web dev or frontend web dev, these tools will make us so productive that it wouldn't make sense to only focus on one area or the other, but instead become a generalist that has broader knowledge and can work on both parts productively.\n\nHow do you guys think these AI tools might change our day to day life as software engineers?",
        "created_utc": 1677245247,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the best place to look for CS jobs?",
        "author": "OperatorMira",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ar7e5/whats_the_best_place_to_look_for_cs_jobs/",
        "text": "I'm so tired of sending out dozens of applications out on indeed and LinkedIn and getting absolutely nothing in response. I just want someplace reliable where jobs have actual job postings that they care to respond to, even if it's to decline my resume. Anything is better than nothing.",
        "created_utc": 1677244730,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bad time for a major life change?",
        "author": "Zero_to_Zeno",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11aqjyw/bad_time_for_a_major_life_change/",
        "text": "I have a comfortable job that is tolerable and safe from layoffs. There’s a new position in LA interested in me. They’d pay for all relocation costs. I really want to go for it, but I’ve seen a few comments around that suggest this isn’t a great time to uproot everything. I’m young, never moved far from home, and never made this kind of decision, especially in a not-so-great market.\nWhat would it take to make you move across the country, from LCOL to HCOL, in this economic climate? Are there factors I may have not considered?",
        "created_utc": 1677242712,
        "upvote_ratio": 1.0
    },
    {
        "title": "UX/UI or Development?",
        "author": "flaviews_",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11aowc0/uxui_or_development/",
        "text": "[removed]",
        "created_utc": 1677236938,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the job market really that bad this year?",
        "author": "TenTenKW",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11aoh94/is_the_job_market_really_that_bad_this_year/",
        "text": "New grad here. I’ve heard a lot of news about how hard it is to get a job now, and how tech companies are firing and layoffing employees or are in a hiring freeze. I have no experience in the job market and would like to get some advices from someone in the industry. Is the situation really as bad as what news said? How new grads should try and get a job under this situation?",
        "created_utc": 1677235367,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does it hurt your potential to stay in one company too long?",
        "author": "Whisky-Toad",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ao6ef/does_it_hurt_your_potential_to_stay_in_one/",
        "text": "So say you are paid well, have a great work/life balance and still learn little bits, is it hurting your future potential by staying in that company for a few years? What if the developers around you arent very good and you cant really learn off of them?   \n\n\nCurrently 1.5 yoe as a front end dev and I'm the one explaining things to the \"seniors\" in the company, I can still learn things although I have to purposefully look them out and theres no development or training coming from the company no matter how much you ask, and im probably the only one doing any real integration testing which I had to learn myself. I keep getting turned down for bigger roles/companies for being the right person /attitude but not enough experience.  \n\n\nWould you hop just for a new challenge? Stick it out until you have a few more yoe to get a top job? Or just hop around to get different experience and development?",
        "created_utc": 1677234193,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do companies mean by \"regular\" level knowledge of a technology?",
        "author": "KoolGringo",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ao4y7/what_do_companies_mean_by_regular_level_knowledge/",
        "text": "[removed]",
        "created_utc": 1677234039,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting a tech job in SF Bay Area as a foreign national",
        "author": "dlam0002",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ao09f/getting_a_tech_job_in_sf_bay_area_as_a_foreign/",
        "text": "[removed]",
        "created_utc": 1677233522,
        "upvote_ratio": 1.0
    },
    {
        "title": "sent too many followup mails to manager",
        "author": "manoj2994",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11anye8/sent_too_many_followup_mails_to_manager/",
        "text": "Hi \n\nI have attended interview to get feedback sent many followup emails finaly i got respond from the tech team for further interview i have completed.now shall I mail the manager and thank them and apology for too many followup mails ?",
        "created_utc": 1677233319,
        "upvote_ratio": 1.0
    },
    {
        "title": "NEED ADVICE. College Student Here.",
        "author": "Rino_James",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11anoae/need_advice_college_student_here/",
        "text": "[removed]",
        "created_utc": 1677232260,
        "upvote_ratio": 1.0
    },
    {
        "title": "Deliverable expectations between Junior and Mid-level Developers?",
        "author": "asnewname",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ankya/deliverable_expectations_between_junior_and/",
        "text": "I've worked in an ever-changing corporate environment for the last 3 years. All the changes are causing Sr developers to quit left and right. I'm on my way out the door now myself.\n\nBut because most of my experience has been with this company. I'm worried about what level I'm at as a developer.\n\nI was promoted to a mid-level dev after my first year. I suspect it was more due to the Sr devs leaving than my actual skill level. What's really held me back is that each time some of the Sr devs left, we would have to break up and rebuild the teams and in that process, I was put on different applications with many different tech stacks. The apps use over 20 different technologies across the board.\n\nSo I have switched teams on average every 8 months since I've been there and I've had to learn mostly new technologies at the same time. Teams got smaller in the last two years when we only had two devs on the team.\n\nNone of the devs on any of these teams, including me, built the applications originally and many apps have not been maintained. Our entire last year has, for the most part, been fixing production bugs that have come up due to expiring tokens and other things that haven't been documented.\n\nCurrently, I'm on a team of two (me being considered mid-level on paper, my teammate being Jr level). My dev teammate and I have been getting so much heat for not being able to manage the production bugs and new development. So basically my confidence is shot. I don't even want to be considered mid-level at this place at this point.\n\nTo add, when we're getting these production bugs in and analyzing them, we're having to write our own technical user stories to repair/restore business logic as best we can. The company finally got an architect to step in because the business leaders were beginning to really bring down the hammer because we just haven't been able to keep up. But the architect is working across every team to try and come up with solutions and the apps are in such bad shape it's taking months. Somehow that's still coming down on us.\n\nI only had a year of experience at the place I worked before this one but it was much smaller.\n\nIs this normal? Should I expect something similar at my next job? What are the expectations you have as a developer on your teams? Are you mostly just writing code? are you analyzing production bugs and designing solutions? Are you writing user stories and presenting them to the business? How much time do you actually get to code and work with Sr devs to improve your coding skills? - I just want a more efficient way to improve my coding skills that don't seem so insurmountable.\n\nTIA - TLDR: burnout.",
        "created_utc": 1677231880,
        "upvote_ratio": 1.0
    },
    {
        "title": "New Grad with job offer delayed, should I look for alternatives?",
        "author": "finnishfad",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11an7ak/new_grad_with_job_offer_delayed_should_i_look_for/",
        "text": "Hello,\n\nI recently graduated this past december with a BS in Comp Sci. I had an internship last summer with Company X and received a return offer for May (I had chosen date as I was unsure if I would finish in Fall or Winter at the time).\n\nFast forward to 2 weeks ago Company X says that due to the state of things they have to push my start date back 3 months.\n\nI was fine with waiting ~4 months originally, an additional 3 months does not sound appealing. Plus it is not reassuring, and makes me worried it will be pushed back again or rescinded.\n\nI am currently working at my schools IT department, and could realistically continue working until June in order to avoid any large gaps in my resume. I have also been using my spare time for side projects as well.\n\nI would like to begin my career asap, but the compensation package at Company X is nothing to laugh at. If I look for other jobs it will be difficult to beat, if even possible.\n\nAnother factor is psychological, I find my current job to be quite boring. While side projects have assisted, I would like to reduce my time in my current position if possible.\n\nIn short my question is this, should I look for alternative employment opportunities? Or be patient and wait? Or is there some middle ground I am not seeing?",
        "created_utc": 1677230335,
        "upvote_ratio": 1.0
    },
    {
        "title": "what to do now that I am free till August 2023",
        "author": "Intelligent_Put8678",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11amk6d/what_to_do_now_that_i_am_free_till_august_2023/",
        "text": "[removed]",
        "created_utc": 1677227740,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daily Chat Thread - February 24, 2023",
        "author": "CSCQMods",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11am1jx/daily_chat_thread_february_24_2023/",
        "text": "Please use this thread to chat, have casual discussions, and ask casual questions. Moderation will be light, but don't be a jerk.\n\nThis thread is posted **every day at midnight PST**. Previous Daily Chat Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Daily+Chat+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
        "created_utc": 1677225728,
        "upvote_ratio": 1.0
    },
    {
        "title": "Microsoft Internships",
        "author": "Skjarl",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11am19a/microsoft_internships/",
        "text": "[removed]",
        "created_utc": 1677225703,
        "upvote_ratio": 1.0
    },
    {
        "title": "DEAR PROFESSIONAL COMPUTER TOUCHERS -- FRIDAY RANT THREAD FOR February 24, 2023",
        "author": "CSCQMods",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11am075/dear_professional_computer_touchers_friday_rant/",
        "text": "AND NOW FOR SOMETHING ENTIRELY DIFFERENT.\n        \nTHE BUILDS I LOVE, THE SCRIPTS I DROP, TO BE PART OF, THE APP, CAN'T STOP\n        \nTHIS IS THE RANT THREAD. IT IS FOR RANTS.\n\nCAPS LOCK ON, DOWNVOTES OFF, FEEL FREE TO BREAK RULE 2 IF SOMEONE LIKES SOMETHING THAT YOU DON'T BUT IF YOU POST SOME RACIST/HOMOPHOBIC/SEXIST BULLSHIT IT'LL BE GONE FASTER THAN A NEW MESSAGING APP AT GOOGLE.\n\n(RANTING BEGINS AT MIDNIGHT EVERY FRIDAY, BEST COAST TIME. PREVIOUS FRIDAY RANT THREADS CAN BE FOUND [HERE](https://www.reddit.com/r/cscareerquestions/search?q=Friday+Rant+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).)",
        "created_utc": 1677225613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Placements starting soon. At crossroads. What should I do?",
        "author": "RealHumanPerson36",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11alsvp/placements_starting_soon_at_crossroads_what/",
        "text": "So, my career has not started yet. It will soon. I am pre final year btech comp sci student. I don’t like solving dsa questions and even when I know the concepts I get confused and blank. I don’t want to be SDE I guess.\n\nI like web development and UI designing but I don’t think I have THE skills to get a job easily… my college is creating a panicky situation where we don’t have time and we have to do dsa on various platforms, study the core subjects, make projects and of course the university stuff. \n\nI am genuinely panicking as I don’t know what to do, how to move ahead. I feel stuck and every passing day it gets worse.\n\nPlease provide some advice.",
        "created_utc": 1677224803,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unethical comms structure",
        "author": "irealmaseg",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11aldba/unethical_comms_structure/",
        "text": "[removed]",
        "created_utc": 1677223158,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the “junior dev pushed to main” trope actually exist in the industry?",
        "author": "kingcammyg",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11akxtx/does_the_junior_dev_pushed_to_main_trope_actually/",
        "text": "In terms of software that is developed by a team of engineers, and the software actually has a solid customer base (because that’s when this would *really* matter) does anyone have an eyewitness account of this happening?\n\nIn my career so far I’ve only worked for two companies, and they’ve both upheld the basic standard of protecting the main branch from being pushed to directly. You can’t get your code into main without a PR and two approvals. It’s unfathomable that any team working on a product with a solid customer base is not protecting their main/production branch.\n\nI got curious about this because the only case where I imagine this is possible is at a company that only hires junior devs to create the product, never giving them any experienced dev as a tech lead to mentor them. Then later down the line, they hire more juniors and don’t know to protect the main branch due to the lack of mentorship.",
        "created_utc": 1677221511,
        "upvote_ratio": 1.0
    },
    {
        "title": "HRT Algo Dev-long term career options?",
        "author": "acaiplaya",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ajz9b/hrt_algo_devlong_term_career_options/",
        "text": "[removed]",
        "created_utc": 1677218079,
        "upvote_ratio": 1.0
    },
    {
        "title": "30 yo mlops engineer off-work for a year. Need advice to be competitive in the industry again",
        "author": "barelyawake_3am",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ajgeu/30_yo_mlops_engineer_offwork_for_a_year_need/",
        "text": "I am a 30yo Research engineer with computer vision background. Previously, I've worked on a startup and despite being there for 4 years, I did not manage to get to progress up the ladder as the startup grew to a decent number (not even as a senior engineer). Last year, I decided to leave the job to work on my fine artist portfolio full time as I've saved enough cash for it. Whilst it is going okay, I'm running out financially and in urgent need to return as an engineer.\n\nHowever, I'm not doing well with my job hunt so far. Most of the ideal ones that I thought suits my previous experience has left with no news. Sometimes I think I'm not good enough for senior positions, and not well-versed with leetcode for competitive entry levels. After working in a startup for so many years with many other non-coding tasks, getting back to leetcode problem solving is rough. I'll admit i'm not the best problem solver (probably mid), but I've always perform a lot of non-coding tasks well (resource management, exploration, ensure smooth deployment etc), but those aren't showing over my resume. It feels especially harder when I'm at 30 and currently unemployed, making things undesirable as compared to fresh grads or even layoffs employees from FAANG\n\nI'm wondering if any ML team lead can shed some light on what you look for in a candidate for someone you'd like in your team?\n\nSome questions:\n\n*Do you look for Model modification knowledge?\n\n*Cloud services familiarity and kubernetes management?\n\n*Does Kaggle helps?\n\nI would like to take this time to upskill myself and if there's anything i can do to make myself more employable. All are deeply welcomed. Thanks.",
        "created_utc": 1677216301,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does this seem to be a mid-level task?",
        "author": "Extension-Switch-767",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ajg44/does_this_seem_to_be_a_midlevel_task/",
        "text": "[removed]",
        "created_utc": 1677216268,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've been off work for a year and plan to come back as MLOps Engineer. I struggled with getting interviews. What can I do to make my portfolio more desireable?",
        "author": "barelyawake_3am",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ajfqi/ive_been_off_work_for_a_year_and_plan_to_come/",
        "text": "[removed]",
        "created_utc": 1677216230,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've been off work for a year and plan to come back as MLOps Engineer. I struggled with getting interviews. What can I do to make my portfolio more desireable?",
        "author": "barelyawake_3am",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11aje01/ive_been_off_work_for_a_year_and_plan_to_come/",
        "text": "[removed]",
        "created_utc": 1677216065,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've been off work for a year and plan to come back as MLOps Engineer. I struggled with getting interviews. What can I do to make my portfolio more desireable?",
        "author": "barelyawake_3am",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11aj4fb/ive_been_off_work_for_a_year_and_plan_to_come/",
        "text": "[removed]",
        "created_utc": 1677215175,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I the only one who can’t find a entry level SWE job ?",
        "author": "FewEducation9147",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11aio4j/am_i_the_only_one_who_cant_find_a_entry_level_swe/",
        "text": "[removed]",
        "created_utc": 1677213677,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I be gunning for big tech internship?",
        "author": "roninja2",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11aibrb/should_i_be_gunning_for_big_tech_internship/",
        "text": "Most of my friends are gunning for prestigious and lucrative internships which naturally made me wonder if I should be doing the same. Personally, I believe the biggest motivation in pursuing those kinds of internships are: increase earning potential and prestige. \n\nI don’t care about prestige but I do care about earning potential. I’m wondering if I am shooting myself in the leg by not putting effort into increasing earning potential at this stage in life. Currently I’m investing effort in other areas of life that are not necessarily career-focused.\n\nSo I just want to hear your thoughts on whether focusing on earning potential could be delayed.",
        "created_utc": 1677212548,
        "upvote_ratio": 1.0
    },
    {
        "title": "Holding off graduation",
        "author": "Spiritual-Rise-617",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ai44s/holding_off_graduation/",
        "text": "[removed]",
        "created_utc": 1677211861,
        "upvote_ratio": 1.0
    },
    {
        "title": "The salary talk for a position",
        "author": "CrunchyAl",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ahewk/the_salary_talk_for_a_position/",
        "text": "So, I have done 4 out of 5 of my interviews for a position I really want. I have yet to bring up salary and benefits for position since it's never a good thing to bring up early as I'm told. Is it something I should mention in my last interview on the last day, or do I have to wait for an offer to be made?\n\n Also, do I even get an offer at all during the interview, or is that something that happens after waiting days or weeks to hear back from? \n\nTo note, this is my first job interview(s) ever for a big named company, so this is all new to me.",
        "created_utc": 1677209682,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help: I’m a veteran and recent grad in Computer Science and I can’t find a job",
        "author": "TylerGatsby",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ah4rc/please_help_im_a_veteran_and_recent_grad_in/",
        "text": "After hundreds of applications no one is interested, I’ve only had 2 initial interviews but was ghosted afterwards.\n\nI’m wondering what I can do to have a career. Are there certifications that make my resume more competitive? How can I show that I am skilled in a programming language? Why are all entry level jobs requiring 4+ years of work experience?\n\nAny advice is welcome. I’m so desperate that I’m looking for unskilled labor so I don’t go homeless.",
        "created_utc": 1677208832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switch from Front End in failing crypto company to Solutions Engineer?",
        "author": "SlopDoggo",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ah1yf/switch_from_front_end_in_failing_crypto_company/",
        "text": "Hi this may be a stupid question and I've been reading through other people asking similar ones but I feel like maybe I'm not thinking right.\n\nI started my job last April at this NFT place. The moment I got hired I knew it was scammy and the product was stupid but I'm a drop out and I needed a job lol. They promised 80k salary after a 3 month contract, but the price of Ethereum crashed right around when I was supposed to get a salary. So they forced everyone to go part time and I've been looking for jobs on and off since June/July. I'm finally at a place where I feel like I've gained a lot of experience and have a good looking resume except the job market also went to shit. I've had a \\~3 HR screenings before changing my resume to the current form (I think I messed up one but the other two had weird stuff going on).  \n\nSince changing my resume I was able to land an initial interview which is on Monday for a Solutions Engineer position. The company looks great but around this sub people say it's hard to switch back to dev work. I'm rather desperate because my students loans are becoming an issue and I'm using a 0% credit card to buy food and apparently I'm barely hovering above the poverty line in LA. Also I work at a failing company with NFT cultists. I'd love to complain and complain but I'll keep it concise with a short example of my current company. The founder controls everything, he's a climate change and covid denier who started yelling at our semi-PM in stand up 3 weeks ago, then our PM quit an hour later and now his uncle is our PM (???) and he gives me tickets like \"when this transaction goes thru u have to refresh page\"\n\nI know that I haven't even gone to the interview but I'm stressing out over this and how to approach it on Monday. I'm not afraid to meet with customers but I'd like to stay a dev. Sorry if this isn't very clear / I'm rambling lol. I'm obviously going to put my all into the HR screening on Monday but I'm just not sure how to approach this when I'm desperate for a job but not really this one as it may hurt me later and I'm not unemployed yet.\n\nThanks so much in advance!! (and my anon resume if you want to see or can spare a sec :)!!! [https://imgur.com/a/tycHfS6](https://imgur.com/a/tycHfS6))\n\nTL:DR - I am desperate for a job above the poverty line, is it worth switching to Solutions Engineer if I'd like to continue my career as a Front End? Has anyone else been able to switch back? Any advice on this interview?",
        "created_utc": 1677208604,
        "upvote_ratio": 1.0
    },
    {
        "title": "Problem solving accountability server.",
        "author": "SwiftlyNarrow",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11agl9o/problem_solving_accountability_server/",
        "text": "Hello all! A quick introduction I am a SWE with 2+ YOE prepping for interviews at tech first companies. I’ve made a small community of like minded people who also have similar goals. Currently how it works is everyday at 8pm pst a bot will ping a channel and everyone posts what they worked on that day. \n\n[Discord](https://discord.gg/NkFx4G5VJA)",
        "created_utc": 1677207219,
        "upvote_ratio": 1.0
    },
    {
        "title": "SQL or JavaScript?",
        "author": "LondonChels1",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11agkzx/sql_or_javascript/",
        "text": "From zero experience, if I want a career in either software development or data engineering/analysis, what would be the easiest path to either one of those titles? \n\nIn other words, should I focus on studying SQL or JavaScript?",
        "created_utc": 1677207196,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do companies check if you have completed all your classes before you start working?",
        "author": "CSStudentCareer",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11agh3u/do_companies_check_if_you_have_completed_all_your/",
        "text": "I received an offer that is a new grad role. The recruiter told me they expect the employees in this role to be done with their bachelors. My start date is supposed to be around June - July, but this is when I will be completing one more class to complete my degree, and will be finished in mid to late august. \n\nThe workload for this class will be very light and I could easily handle it while working, but I’m wondering if most companies check if every single class has been completed / if you have your diploma?",
        "created_utc": 1677206870,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Need Advise] What should i pursue next ?",
        "author": "No_Paleontologist508",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11ag015/need_advise_what_should_i_pursue_next/",
        "text": "[removed]",
        "created_utc": 1677205455,
        "upvote_ratio": 1.0
    },
    {
        "title": "Triplebyte has fake companies, breaking bugs, and zero support",
        "author": "mike_bolt",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11afzhc/triplebyte_has_fake_companies_breaking_bugs_and/",
        "text": "Please do not use Triplebyte. There are fake companies on the site such as this one: [https://triplebyte.com/company/public/mydemocompany](https://triplebyte.com/company/public/mydemocompany)\n\nScreenshots:\n\n[https://imgur.com/a/DM3UFCU](https://imgur.com/a/DM3UFCU)  \n\n\nThey might change their data at any time so see the screenshots I attached for examples of these fake companies. Apparently there is no screening of companies whatsoever. Also, they apparently have zero support. I have emailed them - [support@triplebyte.com](mailto:support@triplebyte.com) \\- multiple times and received no response whatsoever in around a month. And there are other bugs too like getting stuck taking a quiz, having to retake a quiz that you already completed, being unable to update your status with a company, and more. I have let them know about all of these problems and they just don't give a shit. \n\nHave they always been like this? Does anyone else want to share their experience with Triplebyte? Are these issues happening to other people? And, most importantly, which site should we use instead of supporting these morons?",
        "created_utc": 1677205409,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on future career",
        "author": "FlightsCoach",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11afz3m/advice_on_future_career/",
        "text": "So I’m 15 and a sophomore in high school at the moment and I would preferably not want to go to college to save time and money. Is there a way I can get started to prepare myself for when I finish I can find a job/internship with a career in tech like software development or cybersecurity. Could I get certification and experience at my age?",
        "created_utc": 1677205377,
        "upvote_ratio": 1.0
    },
    {
        "title": "Associate’s + Certs",
        "author": "Euphoric_Frame2395",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11afu7x/associates_certs/",
        "text": "So most of the job postings I look at require a Bachelors or an Associates + experience. I know for entry level roles with a Bachelors a lot of people will use the degree as years of “experience”. I’m almost done with my Associates, and thought about getting my CompTIA A+, Network+, and CCNP certs. My question is, would I be able to use these certs as “experience” the same way people do with their bachelors degrees? \n\nFor reference I already work for a huge ISP, but as a field technician, so I do have some experience with networking from doing my job as well as the self progressions they offer that teach way more networking information than a field tech would ever use. Thank you!",
        "created_utc": 1677204984,
        "upvote_ratio": 1.0
    }
]