[
    {
        "title": "Advice For Re-Entering Software Engineering After 2 Years?",
        "author": "cs_career_q_throw",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/117dkox/advice_for_reentering_software_engineering_after/",
        "text": "[removed]",
        "created_utc": 1676912117,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does it hurt your career to take a role at a lesser known company when you are just getting started?",
        "author": "CardboardBoxPlot",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/117cf31/does_it_hurt_your_career_to_take_a_role_at_a/",
        "text": "I am soon to graduate with my masters degree, but also have a couple years of experience at a big company as a software engineer. This would technically be my second job in the industry, but I am looking to switch to a data science or machine learning role. So, I’m treating it as my first step.\n\nWould it hurt my potential career choices if I work somewhere that is relatively unknown for a year or two to get industry experience in this new role before applying to other places?",
        "created_utc": 1676910501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some questions about product and platform engineering",
        "author": "WHAT-IS-MMT",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/117c8c1/some_questions_about_product_and_platform/",
        "text": "[removed]",
        "created_utc": 1676910251,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suspicious Hiring",
        "author": "kcdea",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/117c5y8/suspicious_hiring/",
        "text": "I'm just looking for someone with more experience to let me know if this feels fishy.\n\nI'm a university senior graduating this spring and I have been applying for full time positions after I graduate. I got an email offering me an interview for the first time this weekend however the whole situation just feels off...\n\nFirst of all I did not apply to the company (I know recruiting exists but in the email they said it was in response to my application). They said the interview was on Monday (today), and asked me to send  my availability to a gmail that had the word s\\*x in it. This morning they emailed me a set of screening questions and said I had 90 minutes to fill it out. When I sent back my answers I was told that they would get back to me with the hiring board's decision within two hours and that I would immediately need to get on a call with someone from HR and complete my documentation as a new employee.\n\nAlso all the emails have had like kind of awkward wording, professional, but just using word choice that doesn't feel like it would come from someone who uses English day to day.\n\nThis all feels wrong to me but I don't have any experience with interviews to know if these are red flags or not.",
        "created_utc": 1676910161,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finance degree",
        "author": "Apprehensive_Farm914",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/117brpu/finance_degree/",
        "text": "*redirected from r/learnprogramming\n\nHi, I am just about to get my bachelor's degree in Finance, Business and Management (in the best finance college in my EU country). No, I am not dropping out of it three months before the end :D\n\nThe question is should I pursue my educational career towards some real CS degree, or should I stick to the courses (which I dedicate A LOT of my time) and go for Master degree in Finance field? Finance degree would be much easier, letting me focus on courses and first programming job. On the other hand CS degree might be more helpful in the future (while being a lot harder to finish) and yes, the college I am thinking about allows to start CS journey from Masters level if the candidate knows required basics (which I do).\n\nWhat would you do?",
        "created_utc": 1676909627,
        "upvote_ratio": 1.0
    },
    {
        "title": "i got a mail for associate software developer position from hr saying that they would like to discuss your past experiences and expectations for the future. What questions should I be expecting?",
        "author": "Notalabel_4566",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/117bczf/i_got_a_mail_for_associate_software_developer/",
        "text": "Title.",
        "created_utc": 1676909069,
        "upvote_ratio": 1.0
    },
    {
        "title": "i got a mail for associate software developer potion from hr saying that they would like to discuss your past experiences and expectations for the future. What questions should I be expecting?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1676909042,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switching from DS to SWE when you're already in big tech?",
        "author": "rankedMatchmaking96",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/117bbsg/switching_from_ds_to_swe_when_youre_already_in/",
        "text": "[removed]",
        "created_utc": 1676909025,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got a mail from hr regarding developer position. What question should I be expecting during our meeting?",
        "author": "Notalabel_4566",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/117b9qs/i_got_a_mail_from_hr_regarding_developer_position/",
        "text": " i got a mail for associate software developer potion from hr saying that \" I would like to extend an invitation to you for an online interview with me, where we discuss your past experiences and expectations for the future. \". What questions should I be expecting?",
        "created_utc": 1676908946,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to shift from support to development?",
        "author": "Icy-Depth5210",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/117alma/how_to_shift_from_support_to_development/",
        "text": "[removed]",
        "created_utc": 1676908029,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you get into the 10 week training program offered through Infosys? Went to their webpage and don't see any info on it. Looking to do it remotely",
        "author": "Gamemaster77",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/117ahaj/how_do_you_get_into_the_10_week_training_program/",
        "text": "[removed]",
        "created_utc": 1676907870,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tell me about your untraditional pivot to software as a woman.",
        "author": "Far_Entertainer30",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1179737/tell_me_about_your_untraditional_pivot_to/",
        "text": "[removed]",
        "created_utc": 1676906077,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any actual benefits to turning your camera on in meetings?",
        "author": "DaQueer_Jackson",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11790b7/are_there_any_actual_benefits_to_turning_your/",
        "text": "[removed]",
        "created_utc": 1676905790,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recent computer science grad looking for work related to my field or not.",
        "author": "trowaways6969",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/117900a/recent_computer_science_grad_looking_for_work/",
        "text": "[removed]",
        "created_utc": 1676905778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can i get into CS with an accounting degree?",
        "author": "Satx12",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1178t5k/can_i_get_into_cs_with_an_accounting_degree/",
        "text": "Im considering changing my career to CS. Would CS offer better compensation? I see people say how you can teach your self to code. Has anyone switched to the field? Is computer science a good career to get into? do tech companies higher accountants?",
        "created_utc": 1676905483,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choice between cs btech in the us and in my home country?",
        "author": "Technical-Rise-8290",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1178sql/choice_between_cs_btech_in_the_us_and_in_my_home/",
        "text": "as the title says i have a choice between a t30 us univeristy and an average indian university after which i could go do a masters in the us.Are there any real benefits to be doing cs ug in the us,my parents can bare the costs for now but i want to pay them back soon after graduating.",
        "created_utc": 1676905453,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can people from statistics or pure math backgrounds get into MLE?",
        "author": "AdFew4357",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1178jq8/how_can_people_from_statistics_or_pure_math/",
        "text": "I come from a bachelors in statistics. The immediate roles available to me are data analyst, where we work in sql and tableau most of the time to build dashboards. However, I want to try and pivot to Machine learning engineering, as I feel I could up skill a lot in such a role and learn new tools. However, the issue I’m faced with is that I don’t have a CS degree so it may be hard to know the concepts for the roles, or even to get interviews. I was wondering what some go to resources were for people to self learn the CS concepts needed for machine learning engineering? Also for any other stats backgrounds here, how did you guys pivot into SWE/ML?",
        "created_utc": 1676904830,
        "upvote_ratio": 1.0
    },
    {
        "title": "How common are year long unpaid internships in tech?",
        "author": "TheMaverick575",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1178cab/how_common_are_year_long_unpaid_internships_in/",
        "text": " \n\nHi, I’m an aspiring software developer from Asia in the early stages of my career. I decided not to go to college for a degree and self teach myself. Recently I got offered an unpaid internship opportunity as a web dev intern lasting a year! It didn’t sit right with me so I went along asking my peers for advice and to my surprise a lot of people here have accepted similar opportunities just to gain experience. Isn’t it morally incorrect to hire someone on an unpaid position for a year? Or is it normal? Should I avail this opportunity since I am still a beginner in my field? I don’t have financial constraints as my parents are supporting me until I land a full time job \n\nWhat are your thoughts on this?",
        "created_utc": 1676904261,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever had a business analyst who has never written a line of code that does this all the time? “ABC task should be easy and shouldn’t take more than 15 minutes.”",
        "author": "zenn103",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/117881r/have_you_ever_had_a_business_analyst_who_has/",
        "text": "[removed]",
        "created_utc": 1676903937,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got a mail from HR for cs job. What questions should I prepare upon?",
        "author": "Notalabel_4566",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11787xp/got_a_mail_from_hr_for_cs_job_what_questions/",
        "text": "Here is what he said \" I would like to extend an invitation to you for an online interview with me, where we discuss your past experiences and expectations for the future. \". What questions should I be expecting?",
        "created_utc": 1676903929,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I quit my job?",
        "author": "Magnet70",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11782z6/should_i_quit_my_job/",
        "text": "Hi everybody. I need your advice on my situation, please, as i need to decide quickly. \n\nI am in the 2nd month of my propation period as a network engineer in a multinational company. I want to relocate to another country. \n\nI applied for all kinds of jobs i found in that second country and received multiple interviews but for jobs that are irrelevant to my scope like cashier, waiter, data entry and customer support rep. \n\nTo your information, these jobs in that other country pays more than my current position as a network engineer. \n\nNow i have to decide:\n\nA- Quit my job and travel to that other country for 2 months. Trying to get any kind of job there while applying for networks jobs as well.\n\nB- Wait in my job and do not leave before i get accepted in any it related job. Knowing that, i will have to waut for mt notice period. This may make me miss opportunities.\n\nAppreciate your advise, please.",
        "created_utc": 1676903543,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are Junior Developers Most Damaging Misconceptions?",
        "author": "hottown",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1177mdf/what_are_junior_developers_most_damaging/",
        "text": "So I asked Senior Devs what Juniors typically get wrong (to their detriment) over at the r/webdev subreddit. The answers apply pretty broadly to those starting their career in programming -- or any career for that matter -- so my colleague and I decided to make a review video where we discussed the most common themes found in the replies: [https://youtu.be/eermNn9VhOA](https://youtu.be/eermNn9VhOA)  \n\n\nPerhaps you all find it useful as well! Also, please let us know what you think about the video, as this is our first time making such content and we want to improve :)",
        "created_utc": 1676902279,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I realistically get a job with an associate's degree?",
        "author": "Ok_Peanut5280",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1176r1o/can_i_realistically_get_a_job_with_an_associates/",
        "text": "Due to circumstances (mortgage, needing to care for another person, working as a teacher during the day) I'm not going to be able to complete a bachelor's degree. They are only offered during the day. I know that absolutely nobody is hiring boot camp people anymore. I have a program that I can learn from at a local community college, where I can get an associates in programming. I live in a tech hub. Will I be able to get a job with enough persistence? I'll graduate in a little over a year.",
        "created_utc": 1676899974,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need Professional Opinion and Advice from a CS Enthusiasts on the pricing of my SaaS Subscription Model",
        "author": "triangularorbit",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1176mex/i_need_professional_opinion_and_advice_from_a_cs/",
        "text": "[removed]",
        "created_utc": 1676899612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Remote work as a dual citizen",
        "author": "Virtual-Lack9709",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1175v3k/remote_work_as_a_dual_citizen/",
        "text": "[removed]",
        "created_utc": 1676897447,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hope to have some opinions",
        "author": "tangara888",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1175g56/hope_to_have_some_opinions/",
        "text": "Hi, I am seeking some advice.\n\nWhat happened was that I heard back from a company for a developer job.\n\nI was told to work on the assignment and then present to them later.\n\nIt is something I am not familiar with but nevertheless I tried to do it by doing a simulation on the requirements, since I need a job badly and I have been out of jobs for coming to half a year, still feeling burnt-out.\n\nNow, I discovered that the secret key given to me to access their site is wrong and so I wrote to them 3 days ago but still there is no reply.\n\nWill you stop here and concentrate on DSA coding practice instead ?",
        "created_utc": 1676896191,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do you learn new things or transfer to new it profession?",
        "author": "StandardWide7172",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11754cj/how_do_you_learn_new_things_or_transfer_to_new_it/",
        "text": "[removed]",
        "created_utc": 1676895181,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was FIRED after 2 months from my first job in a startup. Should I include it on my CV?",
        "author": "xXguitarsenXx",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1174sly/i_was_fired_after_2_months_from_my_first_job_in_a/",
        "text": "[removed]",
        "created_utc": 1676894133,
        "upvote_ratio": 1.0
    },
    {
        "title": "cs major",
        "author": "lunakingdom",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1174gx6/cs_major/",
        "text": "[removed]",
        "created_utc": 1676892981,
        "upvote_ratio": 1.0
    },
    {
        "title": "A question related to high school",
        "author": "Gamer-UVX",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/117482a/a_question_related_to_high_school/",
        "text": "[removed]",
        "created_utc": 1676892068,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have been fired after 2 months, they said I am not cut for this job",
        "author": "hattorihanzo14",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11742jf/have_been_fired_after_2_months_they_said_i_am_not/",
        "text": "I was hired as a junior developer after a 3 months bootcamp, after 2 months working they said I am not cut for this job. I was asking a lot of question, arriving earlier than others at the e office, leaving as the last one. What did I do wrong? Please help me to understand",
        "created_utc": 1676891503,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help. What do I need to do to fix my career.",
        "author": "Fuzzy-Device689",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11732rb/help_what_do_i_need_to_do_to_fix_my_career/",
        "text": " \n\nFirst, a summary of my career so far. I am from India, graduated with degree in computer engineering in 2017 with \\~7 CGPA.  \nMy first job was with a German MNC in Bangalore. I worked there for around 3 years. It is a big company, and as a fresher, I was given little to no work there during my 3 years. And the work I was given was trivial and menial tasks, so I didn't actually learn anything. Also, there was so much office politics in the workplace, that it had gotten extremely toxic for me, pushing me into depression.\n\nI left this job in frustration with no other job in hand, and started to blog online for a bit. Then COVID happened; long story short, I have worked for 2 startups in 2 different technology domains since then, doing menial/semi clerical tasks with both.\n\nCurrently I work as an 'Operations' Engineer. Which, when they hired me, they promised a DevOps types role, but it is mostly debugging from logs, etc. kind of work. The work culture here is not as toxic as before, but it is a boring job with nothing to learn at all.\n\nSo now, I have 5.5 years of experience. I do not know even 1 programming language well. I have half-assed knowledge of many things, but thats it, only surface level knowledge, no depth.  \nI am unable to switch jobs obviously, because at this level of experience one is supposed to kind of have expertise in some technology. I have given up applying to jobs now.\n\nDepression and addiction has made this worse than this has to be. I am unable to focus on literally anything at all. I tried to do AWS courses on Udemy, but it all seems so so boring to me I cannot focus even for a minute.\n\nI am actually more into teaching. I have always wanted to be a teacher, and that was my initial plan after college. But seeing the salary differences between IT employees and college professors, I chose the former, since I need the money. Also, we need a masters degree and ongoing PhD to be a professor in India, which is another investment of few years time.\n\nDue to my addiction, I was sadly able to save a very little amount of money. I feel horrible about myself and feel like I am losing myself everyday.\n\nEnough with the rant. I will formulate my questions properly now:\n\n1. If I decide I have to change jobs, how do I go about it? Certifications? Start new job as a fresher/junior SDE? Because the experience shown on my resume instantly tells hiring managers that I have switched too many technologies and don't have depth in any of them.\n2. Do I prepare for Masters degree, and start afresh as a professor? I know the money will be lesser, but I am quite sure I will love this job better. And maybe I can do side gigs as a freelancer on the side. Or is it too late for it now?\n3. Anything else you guys want to suggest me?",
        "created_utc": 1676887745,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daily Chat Thread - February 20, 2023",
        "author": "CSCQMods",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11716bb/daily_chat_thread_february_20_2023/",
        "text": "Please use this thread to chat, have casual discussions, and ask casual questions. Moderation will be light, but don't be a jerk.\n\nThis thread is posted **every day at midnight PST**. Previous Daily Chat Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Daily+Chat+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
        "created_utc": 1676880128,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interview Discussion - February 20, 2023",
        "author": "CSCQMods",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11714xt/interview_discussion_february_20_2023/",
        "text": "Please use this thread to have discussions about interviews, interviewing, and interview prep. Posts focusing solely on interviews created outside of this thread will probably be removed.\n        \nAbide by the rules, don't be a jerk.\n        \nThis thread is posted each **Monday and Thursday at midnight PST**. Previous Interview Discussion threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Interview+Discussion&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
        "created_utc": 1676880011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unable to get IOS version of app to build on company provided machine, manager keeps blaming me, what should I do?",
        "author": "Rrunner5671",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1170f07/unable_to_get_ios_version_of_app_to_build_on/",
        "text": "Some context I have 3 yoe in software development and was recently hired as a cross-platform mobile developer at this company a couple months ago.  Setting up my Android environment was shaky enough on its own and I didn't even have a mac until three weeks into the job which is necessary for ios development.  The ios version will not build and run successfully.  I've debugged through several hurdles and have been stuck for the past couple months.  Multiple team members have tried to help me to get it running but nothing they've tried has worked.  \n\nMy manager is getting increasingly frustrated and is taking it out on me saying things like \"we all got it running on our computers I don't understand why you can't\" and he keeps asking me what I'm going to do about it.  He keeps reminding me that I am supposed to be senior level and should be able to independently rectify this myself.  I have repeatedly googled the errors I'm getting and no solution has worked either.   I asked my manager if in his experience a developer is responsible for setting up their development environment and he said yes.  Since the app is cross-platform I have been able to do my development using android emulator and that has gone well as of late but I fear that the ios issue will keep coming up.  Has anyone else experienced something like this?  What steps should I take to protect myselft?",
        "created_utc": 1676877202,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dealing with a toxic boss after recently getting a visa?",
        "author": "wanderfflez",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/117080z/dealing_with_a_toxic_boss_after_recently_getting/",
        "text": "Hi everyone, I'm in a bit of a pickle right now and was looking for advice. I currently work for a company who I've worked with for quite some time remotely and recently was sponsored for a Visa in the EU. The issue is that 1 month in after my move, my boss has been getting more and more verbally abusive (this has gone for some time but worse now I'm here) so far as to telling me personally that he thinks I'm overpaid and wouldn't usually pay as much for someone so young (even though he offered to sponsor me).\n\nNow I feel like that was unneccessary to mention and I feel like discussions might get worse from here so thinking about starting to apply elsewhere.\n\nThankfully I have one upcoming interview for a field I'm more familiar with this comes from a tech recruiter who knows I'm not actively searching for a move. \n\ntl;dr: boss got more verbally abusive after giving me a visa and thinks he's overpaying me, considering a move and was offered one through a recruiter who thinks I'm casually looking. \n\nSo the question is: what do I say if a company asks why I'd like to move and especially if they ask why so early into my visa? Or if I even should consider a move?",
        "created_utc": 1676876475,
        "upvote_ratio": 1.0
    },
    {
        "title": "Companies that are hiring?",
        "author": "Tall_Chapter4148",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1170633/companies_that_are_hiring/",
        "text": "[removed]",
        "created_utc": 1676876288,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to get hired as software engineer before i graduate. is it possible in this market?",
        "author": "Iconclast1",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116zr2y/i_want_to_get_hired_as_software_engineer_before_i/",
        "text": "and if so, what are some good projects?",
        "created_utc": 1676874714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is there such a big difference between CS and actually working as a dev?",
        "author": "Adventurous_Hand_921",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116zpqq/why_is_there_such_a_big_difference_between_cs_and/",
        "text": "[removed]",
        "created_utc": 1676874584,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best way to find a teammate to make an web or mobile app for a side project?",
        "author": "serial0317",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116zj1v/best_way_to_find_a_teammate_to_make_an_web_or/",
        "text": "[removed]",
        "created_utc": 1676873879,
        "upvote_ratio": 1.0
    },
    {
        "title": "I finally got a software engineer position and I hate it. Has anyone else felt this way?",
        "author": "SpideyLee2",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116zg9b/i_finally_got_a_software_engineer_position_and_i/",
        "text": "I recently got a job as a Software Engineer at a multi-billion dollar company. I was excited initially, but my job title is a little misleading. I'm actually a software *integration* engineer, and I've honestly never been more dissatisfied with a job.\n\nI've only been in-office doing work for about 2 weeks, but my god, this is the most boring and unfulfilling work I've ever done. All I do is fix problems that other people cause on old ass systems that have so many problems.\n\nI feel like I was led on into a position people probably didn't want. This is my breakthrough into the field, but I don't feel like the work I'm doing is going to translate into anything other than software integration, which is not at all where I want my career to be headed. I want to write code and make things. I don't get to do either or those things in my current position.\n\nThe messed up thing is that I had to move halfway across the country for this position and so I'm somewhat stuck with the company for the next two years, since i got relocation free and a sign-on bonus, unless I want to pay all of that back, which would leave me penny-less.\n\nI have this existential dread everyday before going to sleep and every morning I have to wake up for work. My only hope is a followup meeting I have in about 2 weeks where I can discuss how the work is going. I imagine in two weeks time I'll dislike it as much as I do now, so if I can't get moved to a team that actually *does* something, I don't know what I'm gonna do.",
        "created_utc": 1676873601,
        "upvote_ratio": 1.0
    },
    {
        "title": "Part-time Remote Programming?",
        "author": "TaterBiscuit",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116yyma/parttime_remote_programming/",
        "text": "I am in my first year of school (and considering just doing a boot camp at this point).\n\nWhat're the odds of landing a part-time Remote job as a dev? I know most companies want full-time employees, but my lifestyle makes a 9-5 pretty impossible.\n\nI am unsure what I'd like to do (possibly full-stack web). I would also like to do game development as a hobby but maybe as a career down the line.",
        "created_utc": 1676871885,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do recruiting managers fully read resumes before contacting job seekers?",
        "author": "zerquet",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116ysvb/do_recruiting_managers_fully_read_resumes_before/",
        "text": "[removed]",
        "created_utc": 1676871302,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking to switch from hospitality to tech",
        "author": "NattashaSswamy",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116yn0g/looking_to_switch_from_hospitality_to_tech/",
        "text": "[removed]",
        "created_utc": 1676870731,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can a double major hurt you?",
        "author": "sailaza",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116yk8w/can_a_double_major_hurt_you/",
        "text": "I'm majoring in CS at the moment, but I've been considering adding English as my 2nd major for the longest time now. It's a field that's always interested me, and ironically I feel like it has decent overlap with CS when it comes to writing documentation, communicating, blogging about your code, etc.\n\nAre employers ever put off by people with 2 degrees? Mainly because it might make one look less dedicated to the field of programming alone. Moreover, I imagine employers might be worried that the candidate has other plans or might leave one day. Are these legitimate concerns or am I overthinking it? \n\nThanks.",
        "created_utc": 1676870469,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice regarding doing an additional AI major",
        "author": "Top_Equal_",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116y87s/advice_regarding_doing_an_additional_ai_major/",
        "text": "[removed]",
        "created_utc": 1676869321,
        "upvote_ratio": 1.0
    },
    {
        "title": "I forgot everything but now I got a new upcoming opportunity",
        "author": "CompetitiveMind282",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116y1v8/i_forgot_everything_but_now_i_got_a_new_upcoming/",
        "text": "I got a interview for a software testing position. But I forgot how to code, I have a general idea but the syntax etc. I’m from a coding bootcamp background. How screwed or worried should I be?",
        "created_utc": 1676868744,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can a double major put off employers?",
        "author": "lucyownz",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116xpij/can_a_double_major_put_off_employers/",
        "text": "[removed]",
        "created_utc": 1676867615,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your opinion on rotational programs?",
        "author": "Noobula__",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116wjsc/what_is_your_opinion_on_rotational_programs/",
        "text": "[removed]",
        "created_utc": 1676863784,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does one change the tech stack?",
        "author": "Fit_Butterscotch5463",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116w9q9/how_does_one_change_the_tech_stack/",
        "text": "[removed]",
        "created_utc": 1676862907,
        "upvote_ratio": 1.0
    },
    {
        "title": "Keep an accounting job or work in a tech job?",
        "author": "DraftPuzzleheaded677",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116w2uz/keep_an_accounting_job_or_work_in_a_tech_job/",
        "text": "Starting a masters in cs soon and gonna make a career switch. Just curious if I should stay working in accounting throughout my degree or get a job like at a help desk or something to start building experience in this new field from the bottom up?",
        "created_utc": 1676862305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a CS minor sufficient? Need advice",
        "author": "detectivera",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116vja3/is_a_cs_minor_sufficient_need_advice/",
        "text": "I’m currently a Comp Sci/Business (CSBA) Admin major at USC. I was talking to my brother who is a SWE and he said that courses like calculus 1,2,linear algebra, electrical engineering, and biology are not required for SWE roles. Calc 1,2 an EE class, and a semester of bio is required for CSBA major. Honestly the business classes are super easy and fun, but I LOVE coding and CS is becoming a growing passion of mine and I want to have a career in this but I don’t want to take those math and science courses (I used to be premed so super burnt out from that). I really just want to take it easy here at USC and do the courses I enjoy.\n\nSo I’m thinking of majoring in business and minoring CS, which has all the requirements for CS as a major but without the extra science classes. With the minor I can pursue a progressive degree(complete masters with  bachelors at the same time) in CS which covers analysis of algorithms and a few extra 500 level classes.\n\nAre these CS minor courses sufficient to be a SWE:\n\nCSCI 102L - Fundamentals of Computation (2)\nCSCI 103L - Introduction to Programming (4)\nCSCI 170 - Discrete Methods in Computer Science (4)\nCSCI 104L - Data Structures and Object Oriented Design (4)\nCSCI 201L - Principles of Software Development (4)\nor\nCSCI 270 - Introduction to Algorithms and Theory of Computing (4)\nCSCI 485 - File Database and Management (4)\nCSCI 350 - Introduction to Operating Systems (4)\nCSCI 356 - Introduction to Computer Systems (4).\n\nDo you HAVE to have a degree in CS to be a SWE or would this minor suffice. Also, starting this summer I definitely plan on doing Harvard CS50 and The Odin Project and commit to personal projects as well! Please lmk what you guys think I should do. CSBA or BA with CS minor?",
        "created_utc": 1676860640,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got dream job at 23, but don’t know what is next.",
        "author": "Dear-Fuel-2706",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116vif7/got_dream_job_at_23_but_dont_know_what_is_next/",
        "text": "[removed]",
        "created_utc": 1676860564,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to develop relationship with manager?",
        "author": "OriginalTruck1702",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116vgj0/how_to_develop_relationship_with_manager/",
        "text": "[removed]",
        "created_utc": 1676860404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever experienced a scenario when the onshore / in-house dev or team dont know what they were doing or was in the wrong and is just masking it with \"im onshore so im always right\" privilege",
        "author": "Wadix9000f",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116utaj/have_you_ever_experienced_a_scenario_when_the/",
        "text": "Title",
        "created_utc": 1676858471,
        "upvote_ratio": 1.0
    },
    {
        "title": "FREE Mock Coding Assessment",
        "author": "BallisticMango",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116ue3g/free_mock_coding_assessment/",
        "text": " Let's practice giving each other a LeetCode \"assessment\" (I'm not using the \"i\" word so this doesn't get removed by automod). I'm prepping for my Google \"assessments\" and could use the practice. Sign up with the link below.\n\n[https://calendly.com/sullivanja/mock-interview](https://calendly.com/sullivanja/mock-interview)",
        "created_utc": 1676857216,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long before I can change jobs after getting my first job?",
        "author": "DollyPartWithOn",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116ubbe/how_long_before_i_can_change_jobs_after_getting/",
        "text": "I'm nearly at the six month mark now at my first job. \n\n1) But it still feels like a dead end job. I don't want to work there any longer than I have to. \n\n2) I also want a WFH role.\n\nI've been applying for jobs for a month but no one is interested so far.",
        "created_utc": 1676856982,
        "upvote_ratio": 1.0
    },
    {
        "title": "What field within CS do you think will gain more traction and popularity/demand in the next few years?",
        "author": "smilingsunflora",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116t7y6/what_field_within_cs_do_you_think_will_gain_more/",
        "text": "I see a lot of people say lower level and low latency programming will be on the rise in the coming few years. With the onset of so many Chat AIs and that being the hot topic, people talk about how it's gonna change the entire field of CS but I believe it's just a tool that makes life easier for a lot of programmers specifically. Personally, I still see the ML/AI field booming but there has been an obvious substantial less demand for people with a strong math background and deep domain expertise to work on novel modeling methods than there was say a decade ago. I'm still a junior so I'm at a stage where I have varied interests, particularly in the field of Theory and ML (I'm talking Vision and a lot of math intensive sub-fields). I plan on concentrating in a field during masters and I would still like to explore fields such as computer architecture and low level programming but I just wanted to know what others think about what's gonna be the most in demand field in the near future.",
        "created_utc": 1676853971,
        "upvote_ratio": 1.0
    },
    {
        "title": "College Major Dilemma: Pure job or hobby too?",
        "author": "MrMrag",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116t451/college_major_dilemma_pure_job_or_hobby_too/",
        "text": "[removed]",
        "created_utc": 1676853696,
        "upvote_ratio": 1.0
    },
    {
        "title": "If I only take three math classes in high school, is it still possible for me to major in computer science?",
        "author": "RareSpring6939",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116t3sp/if_i_only_take_three_math_classes_in_high_school/",
        "text": "[removed]",
        "created_utc": 1676853672,
        "upvote_ratio": 1.0
    },
    {
        "title": "IT CS career advice - Need more coding experience",
        "author": "Jordan_Sound",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116syf2/it_cs_career_advice_need_more_coding_experience/",
        "text": "Hello there, I am a sophomore in college currently working as an IT Support Engineer at a non-profit. We mostly deal with Azure and Microsoft products. We manage Apple products as well. We are a team of 2. My boss comes directly from an IT background. No coding except for some powershell scripting. I am trying to practice coding more on a regular basis. I asked my employer if I could get into more coding projects. They told me \"maybe\" and I would have to find a use case, then pitch something. I feel like I have been focusing on IT more than I have on CS and coding in general. I have some experience in python, bash, java, and C, but I still feel like I lack skills for my CS degree. I haven't taken many CS classes yet. Mostly gen-eds. I was originally intrigued by cybersecurity, but now I am exploring cloud (specifically AWS). I love cloud so far. I feel like I haven't been exposed to all the different divisions of the tech world. I think the idea of becoming a full-stack dev is interesting as I can combine IT and coding. If you were me, what would you be doing? Any guidence is helpful. I don't know if I should switch back to an internship in a year focused on coding, or look for another full-time job in IT. I'm thankful for my job, but I feel like I'm **plateauing** when it comes to learning new things at my job. It just feels like I'm starting to do the same thing everyday. I don't think I will advance much there since there's only 1 other IT guy. I feel like I need another mentor to help. What are your thoughts?",
        "created_utc": 1676853274,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any good summer jobs for a student that will provide good experience other than internships?",
        "author": "-JustAPotato-",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116swsg/are_there_any_good_summer_jobs_for_a_student_that/",
        "text": "[removed]",
        "created_utc": 1676853154,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will having JUST a bachelors in CS eventually become a roadblock in the future?",
        "author": "afewquestion",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116soki/will_having_just_a_bachelors_in_cs_eventually/",
        "text": "I have no problem in learning and getting certificates if I need to, but let's assume that I only stick to my CS degree - eventually will the industry become so competitive and complex that JUST a bachelors in CS will not be enough? Or is on the job experience enough to keep cruising by, or maybe even getting big big promotions?\n\nWhat do you all think?\n\nThanks!!",
        "created_utc": 1676852559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the tech stack matter?",
        "author": "aym4ne",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116sh3s/does_the_tech_stack_matter/",
        "text": "Sorry if it's a naive question. I'm about to graduate and found my final internship in a company where they're using Python to make their services and APIs. It's very interesting to me and would like to work with them full time if they give me the chance.\n\nI'm wondering if working some years in a python tech stack would make it hard for me to find later a job in another stack (say Java, C#, etc.) ?",
        "created_utc": 1676852016,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I take a 30-50% paycut for a job that will improve my technical skills?",
        "author": "RLnaab",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116sgvf/should_i_take_a_3050_paycut_for_a_job_that_will/",
        "text": "30 years old. UK.\n\nI have a bachelors in CS.\n\n2 years total work experience: £50k. HTML + CSS job. No room for growth technically, no other programming languages etc. Within 3 years my salary will be £60k. I did get really lucky with this job.\n\nI'm interested in React/Node jobs. (I have been coding/creating projects in my personal time which is really tiring after work). And looking at job listings, all the realistic junior positions are £27k-£35k.\n\nDo I take a step back pay wise to get a technical job that will increase my skill set?",
        "created_utc": 1676851999,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asking for a location change after accepting an offer",
        "author": "lakesuccess",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116sff3/asking_for_a_location_change_after_accepting_an/",
        "text": "I am a college student, and I accepted an offer for a defense contractor after graduation. My start date is in mid June, could it be worth it to ask for a location change? Thanks!",
        "created_utc": 1676851892,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any one work in tiktok company",
        "author": "No-Oven-4040",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116sf7r/any_one_work_in_tiktok_company/",
        "text": "[removed]",
        "created_utc": 1676851875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switched careers, need advice pls",
        "author": "novicaneee",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116sbio/switched_careers_need_advice_pls/",
        "text": "Hi All!\n\nI’m currently in the process of finishing my second BS degree and wanted to start applying for internships and entry level roles.\n\nA little background info about me, I got my AS in CS but ended up switching to Business Management to get my first Bachelors. I graduated in 2019 and have been working as a Tech Recruiter (yes i know recruiter = boooo) since. Fast forward to today and I’m in my final semester to get my BSCS.\n\nMy question is should I leave my experience as a tech recruiter on my resume when applying for internships/entry level SWE roles? Or should I completely get rid of that work experience on my resume and only list any relevant course work and projects?",
        "created_utc": 1676851606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Current job has no technical growth, should I take a 30-50% paycut for a job that improves my skills?",
        "author": "Vomplete",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116sben/current_job_has_no_technical_growth_should_i_take/",
        "text": "[removed]",
        "created_utc": 1676851598,
        "upvote_ratio": 1.0
    },
    {
        "title": "Graduated (CS) in a foreign University in late 2019– career gap after my last internship until now. Need advice/insight on what's going on and what to do!",
        "author": "Valarent",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116rneg/graduated_cs_in_a_foreign_university_in_late_2019/",
        "text": "I'm gonna make this quick, but this is a swift overview of my background:\n\n* I've a Bachelor's in Computer Science with 3.34 GPA from a developing but major country in Asia– and the school was either first/second best in the country and the best private college for Computer Science. Graduated December 2019, moved back to the United States right after in February 2020.\n* I have 6 months of internship experience as a Software Engineer in a large pharmaceutical/healthcare company in said foreign country. No formal experience in the US.\n* Developed a travel recommendation app/algorithm using the KNN algorithm for my undergraduate research thesis, but I no longer have the source code since it's mostly a team project and confidential by my school policies.\n* I've had two paid freelance projects as a web developer way back in 2020– but both websites have been taken down for me to show any proof of it. Both projects based in the US.\n* Spent 6 months in China in a student exchange program (I'm not sure if this is relevant?)\n* Haven't done anything Computer Science/Tech related since my last project in mid-2020 to focus on my (at the time) growing side business.\n* Long story short pretty much done with that business for the moment and I've rekindled my interest in working in tech.\n\nAside from needing the general advice, these are my concerns/questions regarding getting a job in tech with a 3 year career gap, competing with fresh grads from 2021 and 2022. I've been out of touch with the corporate/office world for so long so I might sound very ignorant but that's why I turn here!\n\n* Do I look for internships or full time positions? As far as I've looked, most internships only hires fresh grads or last year students.\n* My future plan is to take a Master's Degree in Data Science whenever possible. So ideally I'd like my job related to Data somehow. Should I apply to mostly Data Engineer/Scientist entry positions, or do I take a general SWE/backend role and slowly transition into Data Science/ML-SWE?\n* Related to the question above, I'm thinking of building 2-3 good projects for my updated resume, but I'm not sure 'what kind'. Do I focus on making good Data Science/ML projects or just general SWE projects like your typical Netflix/Instagram clone?\n* Since I have little experience with DS/ML aside from my research project back in college, I'm planning to take [Kaggle's introductory course](https://www.kaggle.com/learn) and [mlcourse.ai](https://mlcourse.ai/book/index.html) afterwards, along with daily Leetcoding as my friend and most people suggested. Since this will take a significant amount of time I'm wondering if it's worth it to focus on this one specific route or just build generic apps and get my foot in the industry as a generic SWE?\n* When do I start applying? Do I start applying now with my (personally I feel) lacking resume? I'm more than happy to share my 'old' resume from 2021 through DMs!\n* If so, where to apply? I've applied a ton in LinkedIn but really I've got nothing. I've around 400 connections so it's not really a 'dead' profile– but I've reached out directly to recruiters with no luck, as they just referred me to the company website if they even responded. It's really difficult since most of my connections/friends in the field are in my graduation country, but I know basically no one in the US that works in tech.\n* Should I put non-CS related experience, like my side business and my current part-time job into the resume? Because frankly speaking I don't have that much experience in CS after graduating.\n* On interviews, what do I say about my 3 year career gap? Last time I've had a couple phone interviews they seem really strong on pushing on the fact that I have a gap. Should I be honest about the fact that I did lost interest in the field the past three years to pursue other things?\n\nAgain sorry if most of these questions are pretty stupid.. I don't have many friends in tech, especially in the US, so I don't know too many people to ask. I'm currently in Florida, so not really a city that has a lot of tech meetups and job fairs. I do know someone who works at FAANG but all he said to me was \"your resume is lacking\" and that's very vague. Until then he won't refer me in because frankly speaking I'm way under-qualified for the moment, which I understand 100%. I'm facing problems fresh graduates have while they look for the highly competitive entry-level positions but I've graduated 3 years ago which really puts me in a weird position.",
        "created_utc": 1676849886,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experience with non-compete clause",
        "author": "conchosteadfast",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116rmrg/experience_with_noncompete_clause/",
        "text": "Hi, I am currently working on a contract with a non-compete clause for 6 months after departure. Meaning I can not work for a competitor. I know this is not uncommon but obviously is shitty.  \n\n\nMy question to you - what has your experience been when quitting a place with such clause and how was it finding a new job, would anyone really know if I did go work in a competitor company?",
        "created_utc": 1676849840,
        "upvote_ratio": 1.0
    },
    {
        "title": "Graduated (CS) in a foreign University in late 2019– career gap after my last internship until now. Need advice/insight on what's going on and what to do!",
        "author": "delawarepatience",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116rjm1/graduated_cs_in_a_foreign_university_in_late_2019/",
        "text": "[removed]",
        "created_utc": 1676849620,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you gotten to the age where you are older than your manager?",
        "author": "Celcius_87",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116ri1i/have_you_gotten_to_the_age_where_you_are_older/",
        "text": "If so, did it take some time to get used to? or did you just view them as any other manager? Just curious to see the thoughts of those in this position.",
        "created_utc": 1676849512,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to determine my worth/asking price",
        "author": "dmillerw",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116rfnd/trying_to_determine_my_worthasking_price/",
        "text": "I currently work as an L2 support technician supporting brick and mortar stores for a large retailer. My job mainly consists of dealing with escalations/the odd questions, as well as supporting subcontractors doing installs at new stores and remodel locations. \n\nI was just informed last week that a team we work closely with is losing some people, and my skill set would fit better over there (I completely agree). However there currently isn't anyone to replace me at my current role either (where I'm kind of irreplaceable ATM) so for a unknown period of time, I'd be working both jobs.\n\nTo support this additional workload, I've been promised a promotion to a \"lead\" position, but the specifics on what this entails/pays haven't been revealed to me.\n\nI currently make mid 5 figures for salary, but I would expect something significant in terms of a raise with this move. \n\nI know this is super vague, but I'm curious if anyone might be able to provide some guidance on what I could except/ask for in terms of pay. Happy to try and answer more specific questions if necessary. \n\nFortunately I hold the bargaining power here, but I've never been put into this position before. I spent most of my adult life in retail, so working/playing the corporate games is still new to me.",
        "created_utc": 1676849352,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to determine my worth/asking price",
        "author": "Neverending_Serenity",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116rbu3/trying_to_determine_my_worthasking_price/",
        "text": "[removed]",
        "created_utc": 1676849083,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone created any exciting projects in the past 12 months?",
        "author": "jack_newman25",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116rbk5/has_anyone_created_any_exciting_projects_in_the/",
        "text": "[removed]",
        "created_utc": 1676849064,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to determine my worth/asking price",
        "author": "c00kies_cr3_m",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116r9f9/trying_to_determine_my_worthasking_price/",
        "text": "[removed]",
        "created_utc": 1676848916,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey guys! A couple of questions to see where your heads at",
        "author": "TheChalaK-",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116r5bd/hey_guys_a_couple_of_questions_to_see_where_your/",
        "text": "[removed]",
        "created_utc": 1676848644,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal to not have documentation on existing processes at work or use agile?",
        "author": "TrojanGiant10",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116r5a0/is_it_normal_to_not_have_documentation_on/",
        "text": "First SDE job. \n\nNon-tech industry and I'm in a junior role. We develop basic CRUD stuff and do in-house projects/enterprise/desktop apps etc. \n\nDuring my studies I learned that agile is important and everywhere now and it was also hammered into me to have everything documented for obvious reasons. \n\nWe don't have either. We just have 3 senior guys who have been at this company for 10-12+ years each who \"remember everything\" and then share the knowledge accordingly. \n\nThis can't be normal?",
        "created_utc": 1676848641,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't know how to \"talk code\"",
        "author": "WhatTimelineIsThis",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116r4yy/i_dont_know_how_to_talk_code/",
        "text": "[removed]",
        "created_utc": 1676848620,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is QA tester a “bad” career path compared to software dev?",
        "author": "Roblox_GM",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116r1gk/is_qa_tester_a_bad_career_path_compared_to/",
        "text": "About me: I’m a new grad from a top 5 CS school but I have a math degree and also I didn’t do internships cos I didn’t know what I wanted to do. After graduation, I was thinking about doing software cos I do know some coding (enough to do leetcode problems at least) but getting interviews hasn’t been going well, as expected. Anyways I’ve gotten 3 interviews for QA testing positions. If I was going to continue trying to get into software it’s not a bad idea either way to get experience in these jobs, but also I’ve been pondering if having a QA testing career would be all that bad. Is grinding hours of leetcode really worth it if I could just do QA testing? (Saying this b/c recruiters say I won’t be tested for coding skills). It’s not like I especially enjoy swe. Any insights, opinions appreciated. Thanks.",
        "created_utc": 1676848382,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it worth pursuing CS as a freshmen in high school?",
        "author": "ArcaneWarrior13",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116r00s/is_it_worth_pursuing_cs_as_a_freshmen_in_high/",
        "text": "I really love CS and would love to pursue it, however I know that the tech job market is a little shaky right now. Will this thing sort itself out in the future and should I still explore my passion. Thanks. Also please correct me if what I said is wrong. Also maybe of note that I have a few years of experience.",
        "created_utc": 1676848281,
        "upvote_ratio": 1.0
    },
    {
        "title": "NG: walmart global tech or a nyc fintech",
        "author": "mergeshorts",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116qxrd/ng_walmart_global_tech_or_a_nyc_fintech/",
        "text": "I'm deciding between two offers right now. One is with Walmart Global Tech and is based in Bentonville, Arkansas. The other is a fin-tech company in NYC (\\~80-100 employees). Walmart is offering an $85k base, $10k bonus, $10k stock, no remote option. The fintech TC is undecided yet since I'm waiting on the offer letter, but I have the option be fully remote. I'm expecting something competitive for NYC. \n\nI've interned part-time at this fin-tech in the past and I've enjoyed the work and the environment, however Walmart's tech stack seems a little bit more appealing to me--the engineer I spoke with mentioned a lot of kafka/hadoop, to me this implies at least interesting engineering questions at scale. At the fin-tech I'd be doing standard React/Next.js front-end development. I could see Kafka/big data is slightly more valuable to big tech companies in the long run versus front-end web dev, but I could be mistaken.\n\nI don't particularly mind re-locating to Arkansas for a couple years, most. I'm from NJ, and part of me wants to just get away. I've been in college in NYC for a few years and would not mind a slower pace of life. I'm most worried about Walmart's reputation in the engineering world, especially given their recent announcement to RTO.  I've seen some pretty negative sentiments circulating online about their engineering quality. \n\nThoughts/is there anything to consider that I'm missing? Thanks an advance for your input.",
        "created_utc": 1676848131,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there many felons/ex convicts who end up as programmers or software engineers or is that career more or less closed because they have a criminal record?",
        "author": "Emergency_Zebra_5972",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116qtv5/are_there_many_felonsex_convicts_who_end_up_as/",
        "text": "[removed]",
        "created_utc": 1676847860,
        "upvote_ratio": 1.0
    },
    {
        "title": "Making a Career Switch - Looking for Advice on Paths",
        "author": "Runah",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116qprm/making_a_career_switch_looking_for_advice_on_paths/",
        "text": "[removed]",
        "created_utc": 1676847606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Employee Surveillance",
        "author": "bigfafu45",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116qf90/employee_surveillance/",
        "text": "[removed]",
        "created_utc": 1676846870,
        "upvote_ratio": 1.0
    },
    {
        "title": "BOFA or Wells Fargo?",
        "author": "Federal-Ad3221",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116qdjd/bofa_or_wells_fargo/",
        "text": "[removed]",
        "created_utc": 1676846752,
        "upvote_ratio": 1.0
    },
    {
        "title": "BofA or Wells Fargo?",
        "author": "Federal-Ad3221",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116qcgm/bofa_or_wells_fargo/",
        "text": "[removed]",
        "created_utc": 1676846680,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is WFH early in my career a bad choice?",
        "author": "thebreadmanrises",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116qa1y/is_wfh_early_in_my_career_a_bad_choice/",
        "text": "I’ve been in a role I drive 50 minutes for. I’ve learnt a lot but really it’s from my own googling rather than colleague’s helping. I haven’t had code reviews or feedback in general since I started 8 months ago. I’m considering trying to find a WFH role but wondering if this would be a detriment as a junior dev?",
        "created_utc": 1676846513,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switching to community college, is it worth it?",
        "author": "Obvious_Word_6706",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116q899/switching_to_community_college_is_it_worth_it/",
        "text": "I quit my job to pursue a Comp Sci 4 year degree at a state university, but halfway into the first semester I am realizing I want a quicker path back into the workforce. \n\nThe $ cost of the degree does not matter, just the time that is killing me, and I am worried about passing the math requirements in the 4 year degree. \n\nWhat do you think of switching to a community college 2 year degree that is quicker and more focused?\n\nhttps://catalog.tulsacc.edu/preview_program.php?catoid=24&amp;poid=7190&amp;returnto=10584\n\nI expect the education to be on par with the state university, lots of funding here. \n\nMy goal is salary starting around $50k and above $70 within 3-5 years, and aiming at remote work. \n\nIs there anyone out there who completed a similar degree and is happy with it or do you regret not going all the way with Comp Sci?\n\nThanks!\n\nAlso, i am not interested in certificates or coding bootcamps.",
        "created_utc": 1676846394,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any advice on how to land more interviews as an International new grad?",
        "author": "Jay_gaglani",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116q6sk/any_advice_on_how_to_land_more_interviews_as_an/",
        "text": "[removed]",
        "created_utc": 1676846290,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for tips as an international student to land more interviews?",
        "author": "Jay_gaglani",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116q20d/looking_for_tips_as_an_international_student_to/",
        "text": "[removed]",
        "created_utc": 1676845962,
        "upvote_ratio": 1.0
    },
    {
        "title": "CS International grad, struggling to land interviews, looking for any tips before my visa expires?",
        "author": "Jay_gaglani",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116q0kp/cs_international_grad_struggling_to_land/",
        "text": "[removed]",
        "created_utc": 1676845872,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling to land interviews",
        "author": "Jay_gaglani",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116pw8a/struggling_to_land_interviews/",
        "text": "[removed]",
        "created_utc": 1676845582,
        "upvote_ratio": 1.0
    },
    {
        "title": "project is supposed to be open source, but remains closed. How can I accelerate this?",
        "author": "buyingshitformylab",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116pscf/project_is_supposed_to_be_open_source_but_remains/",
        "text": "[removed]",
        "created_utc": 1676845321,
        "upvote_ratio": 1.0
    },
    {
        "title": "I might have screwed up my discussion regarding my hike with my manager. Need advice",
        "author": "Nocturnal1401",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116ppvv/i_might_have_screwed_up_my_discussion_regarding/",
        "text": "Tldr available at the bottom \n\nI recently had a 1-1 with my manager. I initially pinged regarding something else related to my ticket (we don't have a tech lead so he reviews the changes). We went on call and he kinda popped up the hike question out of nowhere. I don't have prior experience with this so I probably didn't clear thoughts at the moment. \n\nAt the start of the year everyone got a mail how the management wants to invest financially only in the necessary parts of the buisness cause of recession. So this information kind of skewed my expectation and when asked regarding my hike I ended up saying 30-40%.\n\nBut now that I have some time to think about it, I have been handling tasks way over what I being compensated with in comparison to other mid-senior engineer. \n\nAlthough it has been a few days since this 1-1, should check with him again and see if anything can be done? I do have a good rapport with my manager in case that matters\n\n\nTldr: Had a 1-1 with manager, who asked about hike I ended up saying 30-40% increase is okay. After some deliberation I realised that is lower than what value I provide. Although few days have passed, should I check with him again if anything can be done?",
        "created_utc": 1676845158,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has IT field become more competitive in the last few years than real estate &amp; government jobs in world?",
        "author": "Notalabel_4566",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116plc7/has_it_field_become_more_competitive_in_the_last/",
        "text": " What is your opinion? Is it right time to switch to other business like real estate, PG, Hostel ownership, restaurants, Tea stall, Cigarette stall etc?",
        "created_utc": 1676844852,
        "upvote_ratio": 1.0
    },
    {
        "title": "When should staff engineers really be assigned to a team project and who should request them?",
        "author": "Bulbasaur2015",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116pisn/when_should_staff_engineers_really_be_assigned_to/",
        "text": "the scenario is that  the team is building a solution to a challenging problem in production\n\nthere are senior engineers on the team assigned to the task at hand, but they are struggling to find a solution within the timeframe  even though the service &amp; technology is not new\n\nif they are incompetent they can be replaced, then in which cases would a staff engineer be assigned to a team and who should be the one to ask them?  \n\n\nthanks",
        "created_utc": 1676844680,
        "upvote_ratio": 1.0
    },
    {
        "title": "About to start School for CS (Java, JS) and need laptop recommendations.",
        "author": "Sometimesiworry",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116pg7e/about_to_start_school_for_cs_java_js_and_need/",
        "text": "[removed]",
        "created_utc": 1676844512,
        "upvote_ratio": 1.0
    },
    {
        "title": "FTC has proposed banning non-compete agreements. PLEASE go comment in support of this for your own good.",
        "author": "anonproduct",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/116oo6o/ftc_has_proposed_banning_noncompete_agreements/",
        "text": "Short summary:\n\nThe FTC has proposed a rule to ban non-competes, and retroactively invalidate old ones.\n\nFor those not familiar, many tech companies outside of California force employees to sign horrible non-competes that prevent you from getting other jobs related to that. These are downright evil.\n\nWhy?\n\n1. They can be super broad, capturing massive industries or technologies\n\n2. They can include \"lists of competitors that we can add to at any time\"\n\n3. They apply to nearly everyone, not just those with sensitive information\n\n4. They are absolute bullshit. These contracts essentially would prevent you from working at companies with the exact skillset you grew.\n\nIf you were laid off right now, and couldn't get a new job because of this? How stuck would you be?\n\nPlease, please, please go make a public comment here before the FTC stops taking comments. Discuss how it restricts competition.\n\n[https://www.regulations.gov/document/FTC-2023-0007-0001](https://www.regulations.gov/document/FTC-2023-0007-0001)\n\nComment button is the blue button on the top left",
        "created_utc": 1676842556,
        "upvote_ratio": 1.0
    }
]