[
    {
        "title": "Can a bootcamp lead to career opportunities",
        "author": "sdleradm",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110jubz/can_a_bootcamp_lead_to_career_opportunities/",
        "text": "Im currently 23 years old and feel like its too late for a 4 year degree can i get a salaried position or worthwhile opportunity from a bootcamp",
        "created_utc": 1676219692,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm a CS university student but need help with learning practical programming",
        "author": "ZHMakhlouf",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110jicq/im_a_cs_university_student_but_need_help_with/",
        "text": " \n\ngood day to you all\n\nI'm a 2nd year uni student in a 5 year program , so far we have had 3 programming courses in 3 terms covering C++ basics and programming essentials , Java OOP , and then a course on file handling , multithreading, Java io , exception handling , little bit of Java swing , and also one data structure and algorithms course covering complexity , linked lists stacks queues, and an intro to dynamic programming and backtrack .\n\neven though I was pretty good with studying them and passed them all in theory , I don't seem to have any practical programming skills , as I tried yesterday to challenge myself and do a tic tac toe console project , but I just find it difficult to develop any code on my own and my instinct is always to copy and paste from a tutorial on youtube .\n\nI have some free time in the coming weeks and would like to be able to enter the freelancing programming field , in order to gain experience and also make some pocket money\n\nso I was wondering if I should do one of these free or cheap programming bootcamps, or I heard the Harvard cs50 is an essential? , I don't want any course to explain to me any basic theory because I am good at that and time is limited , i want to be able to have confidence in myself to do any project that I have in my mind , i know I should do my own projects but I don't feel I'm at that level yet where I can be independent , I would like to sharpen my axe for a bit before starting to hack at these trees (no puns intended ) .\n\nnote : I have a passion for the future of AI as that's the reason I'm studying CS in the first place, but we haven't taken any courses related to it yet , so maybe i should learn python and work with it? , also should I learn web development? , keep in my mind I don't plan on getting a junior developer spot , I want to be able to be confident in becoming a freelancer programmer so that any project presented to me I can get done as best as possible .",
        "created_utc": 1676218854,
        "upvote_ratio": 1.0
    },
    {
        "title": "Imposter syndrome with IT manager / tech lead role at startup - career advice?",
        "author": "uTheFrequency",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110jf00/imposter_syndrome_with_it_manager_tech_lead_role/",
        "text": "Currently working at a small scale startup where I lead a 6 person development team. \n\nI once started as being a developer in the team before getting offered to lead it with no prior experience in management. The CEO shared with me that he believed I was made for management and leadership instead of development and engineering.  \n\nI agree with him. Although I like developing, I truly love to lead a team, thinking of how to improve processes, laying out a vision of where we could go with a product and steps necessary to achieve all of that with the team.  And so far I’ve been told that I’m doing an excellent job. Having had 10% salary raises each year.  \n\nBut somehow I feel like an imposter, and that I wouldn’t be able to have this role at another company.   \n\nWe don’t really work agile or scrum to iteratively develop a product, the team doesn’t work with the hottest frontend frameworks and nor do we have any product owners or anything else resembling a “standard” company structure.  \n\nSometimes I’m looking at job posts for IT manager or team lead and feel like I don’t possess the skills necessary to work as one for another company.  \n\nNow I’m looking to improve my CV by getting some IT management certifications. But don’t know where to start.  \n\nHave you been in a similar spot or have any advice how to progress as an IT manager?",
        "created_utc": 1676218625,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm terrified I'm not prepared for the CS career world",
        "author": "jek_213",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110jey4/im_terrified_im_not_prepared_for_the_cs_career/",
        "text": " I’m graduating in May with a BS in CS, but I fear that I’m unemployable right now. I was thinking about graduating, taking at most a year to build my skills/work on personal projects/become generally employable, then look for a job. The thing is I have no idea if that’s feasible or just silly to even consider. I don’t really have anything to put on my resume other than my senior project and the basic knowledge of a few programming languages. As an end-goal I see myself working in game dev or data science. I like software engineering too but that field seems way too competitive for me anytime soon. As of right now I don’t think I have much to offer in any of those fields. Am I being too pessimistic? Are there opportunities in these fields that have a good amount of on-the-job learning? Are there fields that are more friendly to the inexperienced that I could look for while I work towards something I like? \n\nI’m not so concerned about finding a job I like, I know with time and effort I can make it happen. I’m just nervous about the time between graduating and that. I just want to be able to keep myself afloat financially while I look for a job that I’d see myself enjoying.",
        "created_utc": 1676218621,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is better for future occupation: big role in small company or small role in big company?",
        "author": "Ok-Perception5454",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110j8xj/what_is_better_for_future_occupation_big_role_in/",
        "text": "[removed]",
        "created_utc": 1676218195,
        "upvote_ratio": 1.0
    },
    {
        "title": "First job as junior developer: is this a good type of role to go for?",
        "author": "Imaginary_Local_5320",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110iu7h/first_job_as_junior_developer_is_this_a_good_type/",
        "text": "A company has offered me a position as a junior developer to re-architect the backend in terms of adding a database for the first time as well as re-designing and building out the dashboard. It's a working application as it is but is difficult to use due to it being built by many different ppl, mainly students, over the years.\n\nI have just finished an internship, don't have a computer science degree, and I would be the main developer on the team, so I would be the one building the database to include all of the data-stores currently in use like json files and so on. \n\nThey have made a decent offer (given my exp) that pays less than a junior developer rate but much more than an intern. At the same time, I will not have any senior developer to work with and consult with so that's what's getting me slightly worried. \n\nI'm absolutely up for the challenge but at the same time I don't want to set myself up for failure. Am I being naive in thinking this is going to be achievable by myself without a good senior dev there for support? The current team members are researchers but not programmers and I'd be working with them and the project manager (also not a programmer by profession). All very intelligent people but not experienced developers and with zero db experience.\n\nI'm feeling very 50-50 on this offer and would appreciate any feedback at all. It will be my first professional gig as a junior engineer rather than as an intern and I had imagined having seniors at least around like they were for the internship.",
        "created_utc": 1676217158,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am thinking of giving up on my CS career...",
        "author": "somethingsomthingIDC",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110imof/i_am_thinking_of_giving_up_on_my_cs_career/",
        "text": "I am 20 years old still in my second year of college but I am starting to realize that maybe CS isn't for me, don't get me wrong I REALLY love programming and I even do it in my free time as a hobby, but here I am strictly talking about a career in programming not just programming itself, so if I talk about getting more money its not because I am in it solely for the money, its because the only reason you get a career in something you like is to make money, otherwise its just a hobby, and I am starting to think a career in CS is not for me.\n\n&amp;#x200B;\n\nlets not go into details about my social life (if you care enough I posted about it you can just scroll through my post history I can't stop you.), but I am autistic, I don't like to say that I am because people link it to being dumb or slow, which isn't correct, I had a few bad experiences as a kid and with the way I was raised I ended up being a very closed of and introverted person and I don't have good social skills, actually not just lacking social skills, I am very socially inept, and afaik you need connections to get jobs but I can't have connections, I am really good at performing my tasks and understand exactly what I am being asked to do and I can do it exactly like I am asked to do, and even in college I got positive comments from some people I used to work with on a project about how fast I understood my part of the project and finished it but right after finishing we don't talk again and I got the idea that they don't want to befriend or continue talking to me outside of college work and I was okay with it I know that I am an awkward person and my brain is much different so someone who is a neurotypical person so I was understanding and this occurred in many project groups that I joined despite pretty much everyone I joined a group with ended up becoming friends or at least college acquaintances and they'd keep in touch, sorry wrote a lot here but I wanted to paint a good idea of how my personality is like if I was working in an office.\n\n&amp;#x200B;\n\nalso when I got into CS I was hoping I could immigrate to a decent country and get a job, (obviously immigration is hard and my expectation were low but I was trying to be hopeful please don't mention anything about how its impossible to get a sponsorship and that I wont ever be getting a work visa ever in my life and that its impossible that's not the point of this post) but that's not the issue, I posted it about something related to CS and having a degree from a 3rd world country and how will it affect my hiring chances assuming I already immigrated I got some people telling me that as an immigrant in the US or the west generally you'd always be looked at as someone who is welling to work for less, and that the market is already oversaturated in first world country and I should curb my expectations, and even when I never mentioned anything about immigration or sponsorships people told me that it would be nearly impossible despite not asking and stating that I know it is.\n\n&amp;#x200B;\n\nhonestly when I read this I was already working on a project and trying to improve my skills but after reading it I stopped for about two days now despite working everyday for hours the past few months I mean, if I'll always make less despite working harder, and if I will always suffer to get a job because of my shit social skills why even bother with a CS career? ever read about Matthew's effect? basically people with advantages will do better in life because of their advantages, and when you come from a sht country with sht education it doesn't matter how hard you work because you'll never be a match to a MIT graduate even if you just as smart and even more hard working, should I just pursue something else? should I legally change my name to not look as if I am an immigrant? (I am white and I can easily pass as a Caucasian and I even developed a mixture of a British and an American accent)",
        "created_utc": 1676216600,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any way to make cash while learning?",
        "author": "SneakySnk",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110idez/any_way_to_make_cash_while_learning/",
        "text": "So, I have been learning mostly java for about a year, I don't think its enough for a job (I need more practice and do some more personal projects), I'm currently working as an (outsorced) Sys Admin Jr but I don't make nearly enough cash to survive, As I'm currently getting payed a bit less than minimum monthly wage on my country. I'm not from the US. I have been trying upwork but with no success so far",
        "created_utc": 1676215916,
        "upvote_ratio": 1.0
    },
    {
        "title": "Big tech, startup or mid size company? Here is what I found out.",
        "author": "bartelemy",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110i8cu/big_tech_startup_or_mid_size_company_here_is_what/",
        "text": "Are mid size company was the sweet spot between big tech companies and startups? I posted [this meme](https://www.reddit.com/r/ProgrammerHumor/comments/10mjuun/wise_or_not/). Reviewing the comments, here are the key takeaways:\n\n&amp;#x200B;\n\n**STARTUPS**\n\n* At startups, you are underpaid and overworked. Code quality is often neglected. Deliveries are often rushed. Those who can manage the chaos get to work on interesting problems without the bureaucracy of bigger companies.\n\n**BIG TECH**\n\n* Big tech companies are full of bloat and bureaucracy. As a result, the pace of change is super slow. One redditor remarked there is often more legacy code to maintain. Also, there are less opportunities to contribute to product design. On the opposite, the ceiling for salaries is the highest.\n\n**MID SIZE**\n\n* Despite the plot of the meme, some redditors highlighted mid size companies also have layoffs. But, those layoffs are less documented. Contrary to startups, mid size companies are big enough to provide all the necessary resources and support to their employees. In contrast to big tech compagnies, mid size organizations are small enough to see the impact of your work.\n\n&amp;#x200B;\n\nP.S: [I wrote an entire article about this](https://the-assembler.com/2023/02/11/big-tech-startup-or-mid-size-company-here-is-what-i-found-out/)**.** It has the best comments from the meme post.  :)",
        "created_utc": 1676215557,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to discuss knowledge gaps in interviews without discounting my potential as a candidate?",
        "author": "Lukewill",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110hs36/how_to_discuss_knowledge_gaps_in_interviews/",
        "text": "[removed]",
        "created_utc": 1676214347,
        "upvote_ratio": 1.0
    },
    {
        "title": "Code reviews lack objectivity and productivity suffers",
        "author": "theweirdguest",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110h6ou/code_reviews_lack_objectivity_and_productivity/",
        "text": "This is a problem which affects my productivity on the job and frustrates me a lot as a junior developer.\n\nI get the impression that my tech lead reviews code based on who writes it or how he feels like on that day. Sometimes he does not comment anything, sometimes he is very picky even about variable names. \n\nAlso I have noticed people with more experience get away with many more inaccuracies which would have been corrected if I wrote them. I think he tries not to ruin the relationship with other engineers. but at the same time he encourages me to be very picky with them, which I don't think it's fair.\n\nStandards seem to be quite subjective, and once another lead reviews the code, I often have to make complete opposite changes in order to merge the code.   \nAlso leads seem to be way more flexible on their own code with respect to mine, and sometimes when they get a comment from others they just say they will modify the code in the future.  \nThis feels frustrating and honestly some days it seems like I'm not learning anything new but just to adhere to a bunch of different code styles. Also I'm half as productive and I fear that this could limit my growth.",
        "created_utc": 1676212742,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I apply for Power BI Developer positions?",
        "author": "Judessaa",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110h34e/should_i_apply_for_power_bi_developer_positions/",
        "text": "Hi there, \n\nAfter studying and working really hard I landed my first job as a Junior BI developer last October, hobing that I can get someday in the future from data analysis to data science and machine learning engineering.\n\nHowever, my current company isn’t helping me learn or add to my skills, there’s no BI team and no one with experience to guide me. I even feel like my technical skills were better before I joined here. \n\nI am doing my best to work and learn and I apply to various positions but most require more experience than what I have. \n\nI had a technical interview today and the interviewer told me that they need a BI developer with 4+ years of experience, and he offered to get me a technical interview as a Power BI developer instead. \n\nI don’t feel good about it as I enjoy the whole BI process of  integration and Analysis &amp; visualization. Power BI roles are only focused on visualization.\n\nI feel lost and can’t figure out what to do. I am not sure whether I an heading where I want to…\n\nYour advice is appreciated.",
        "created_utc": 1676212455,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im a data privacy lawyer and feel the need to learn much more about the tech I regulate. What should I start studying?",
        "author": "fredbogho",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110gm5n/im_a_data_privacy_lawyer_and_feel_the_need_to/",
        "text": "Hey guys, sorry if this is completely off topic. \n\nI have been working as a privacy lawyer both in law firms and as an in house lawyer. Data protection laws are blooming and theres a steady demand for lawyers in those areas.\n\nI feel I can do a good job. I know the laws well, I am a good communicator and I can negotiate. Those are the things required in my job description. However, I feel that us lawyers can help very little with the implementation of the legal requirements.\n\nI believe my work would be way more useful and valuable if I knew a bit more about technology. But there is just so much to learn that I dont even know where to begin. I thought something in the lines of programming, data governance or cybersecurity.\n\nI have been going through some heavy family stuff that require me to elevate my skills and earnings and I have the time to.study and improve myself.\n\nSorry if this is too long of a write up and thanks for reading me!\n\nPS: I dont need to know tech to litigate, I mostly advise companies in how to stay up to date with tech regulation",
        "created_utc": 1676211125,
        "upvote_ratio": 1.0
    },
    {
        "title": "exam question: does it negatively impact my chances to move to the next round the longer I wait to take it?",
        "author": "zeee93",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110gieb/exam_question_does_it_negatively_impact_my/",
        "text": "this question is regarding an interview coding exam. it didn't let me write interview in the title but this question is specific to that and not a school exam.\n\n&amp;#x200B;\n\nI recently applied for an emerging talent software engineer position at a banking company. I got an invitation to take a 2 question coding exam not too long afterwards. The due date for the exam was the 13th, however, upon logging in today (the 12th), I see they rescinded the invitation and when I go to the job listing page, it says \"This job is no longer available\" and my status is \" No longer under consideration\". Did I wait to long to take it? Did they receive enough qualified candidates that they felt there was no longer a need to see what the rest were capable of?\n\n&amp;#x200B;\n\nI feel like this may be a you live and you learn kind of scenario. I've been busy with work this past week and had another 17 question interview exam that I was also prepping for. \n\n&amp;#x200B;\n\nAny insight is greatly appreciated.",
        "created_utc": 1676210819,
        "upvote_ratio": 1.0
    },
    {
        "title": "Future of Block chain and Web3",
        "author": "thereveldune4",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110f7kc/future_of_block_chain_and_web3/",
        "text": "Is career as a web3 developer still promising?In which industries it may get implemented in future (not talking about crypto or nft)?",
        "created_utc": 1676206867,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should you do if the supervisor/manager is ignoring the salary review request?",
        "author": "hobbyoftakingphoto",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110f5ji/what_should_you_do_if_the_supervisormanager_is/",
        "text": "I was expecting a salary review in the last fiscal year. But I didn't get one. So, I had a talk with my supervisor (hr was not available that time) and he said he would talk with the manager. But I didn't get any response. I just felt awkward asking again. So, months pass by and now, it is my 2nd year completed in the company.\n But this time, I communicated with the HR through email  and also, informed the supervisor. HR also said the supervisor was informed and he would get back at me.  And now, ten days have passed by and there is no response.\nIsn't it disrespectful?\nWhat should I do? Should I just resign?",
        "created_utc": 1676206708,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you still think blockchain development is a good career choice?",
        "author": "SiriusWagner",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110f5is/do_you_still_think_blockchain_development_is_a/",
        "text": "[removed]",
        "created_utc": 1676206706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you still think blockchain development is a good career choice?",
        "author": "SiriusWagner",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110f4gm/do_you_still_think_blockchain_development_is_a/",
        "text": "[removed]",
        "created_utc": 1676206603,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I major in A.I or Data Science?",
        "author": "caramello26",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110ezld/should_i_major_in_ai_or_data_science/",
        "text": "[removed]",
        "created_utc": 1676206159,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone here work in the digital advertising space? How is your industry feeling about the end of the third-party cookie next year?",
        "author": "Cool_Hornet7452",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110ey02/anyone_here_work_in_the_digital_advertising_space/",
        "text": "[removed]",
        "created_utc": 1676206008,
        "upvote_ratio": 1.0
    },
    {
        "title": "19 , i am currently in second year of btech from india , which country should i focus for MS and ultimately job in that field ?",
        "author": "Easy_Self4207",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110ei7v/19_i_am_currently_in_second_year_of_btech_from/",
        "text": "[removed]",
        "created_utc": 1676204518,
        "upvote_ratio": 1.0
    },
    {
        "title": "Highest Salary with best WLB",
        "author": "closeenough543",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110eg9l/highest_salary_with_best_wlb/",
        "text": "[removed]",
        "created_utc": 1676204324,
        "upvote_ratio": 1.0
    },
    {
        "title": "MS Data Science (lower ranked) vs. MS Business Analytics (Higher ranked, UCs)",
        "author": "anotheraccount97",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110e7ly/ms_data_science_lower_ranked_vs_ms_business/",
        "text": "[removed]",
        "created_utc": 1676203497,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need to find an affordable Mechatronics programme in Los Angeles?",
        "author": "Ok-Relief-723",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110dp4r/i_need_to_find_an_affordable_mechatronics/",
        "text": "I am looking to study mechatronics because I thinks its the best of both worlds for someone who is passionate about programming and robotics. I started teaching myself programming when I was 15 and I did an internship(SWE) just after finishing high school last year. Now I am planning on going to college , more specifically my family planned on Pierce community college or glendale community college because both of those are close to where my sister lives and also because its the only ones we could PROBABLY afford. However, I did some researching and it did not seem like any of them had a mechatronics programme. Does anyone know how I can move on on this considering my situation.\n\nN.B: I don't live in the US, I live in Madagascar but hope on studying/working there next year.\n\n\\* Also pls don't even suggest to stay in Madagascar and study here because I could give you many reasons that would not be preferable.",
        "created_utc": 1676201565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Master's recommendations for a Software Dev with CS Degree?",
        "author": "SteamingBeer",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110cac4/masters_recommendations_for_a_software_dev_with/",
        "text": "[removed]",
        "created_utc": 1676196280,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for new software engineer",
        "author": "bodahm1122",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110b5wq/advice_for_new_software_engineer/",
        "text": "Any advices for new graduates students \nAny certificate I can go for?\nAny programming language I need to learn or focus on?",
        "created_utc": 1676191866,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to even get into a MSCS? Non STEM background, 2 YOE+ in tech but not as a developer.",
        "author": "who_is_disz",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110av1j/is_it_possible_to_even_get_into_a_mscs_non_stem/",
        "text": "[removed]",
        "created_utc": 1676190610,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to prepare for my first internship intervieew process?",
        "author": "naughtycoder007",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110aiqb/how_to_prepare_for_my_first_internship_intervieew/",
        "text": "[removed]",
        "created_utc": 1676189180,
        "upvote_ratio": 1.0
    },
    {
        "title": "I understand that I’ll have to use LinkedIn for future job opportunities, but how should I use it?",
        "author": "Special_Bluebird7399",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110ahwn/i_understand_that_ill_have_to_use_linkedin_for/",
        "text": "[removed]",
        "created_utc": 1676189087,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can work experience help get into a MSCS Program? Non Stem Background, 2+ YOE in tech but not as a developer.",
        "author": "who_is_disz",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110ah9c/can_work_experience_help_get_into_a_mscs_program/",
        "text": "[removed]",
        "created_utc": 1676189005,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daily Chat Thread - February 12, 2023",
        "author": "CSCQMods",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110agnh/daily_chat_thread_february_12_2023/",
        "text": "Please use this thread to chat, have casual discussions, and ask casual questions. Moderation will be light, but don't be a jerk.\n\nThis thread is posted **every day at midnight PST**. Previous Daily Chat Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Daily+Chat+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
        "created_utc": 1676188930,
        "upvote_ratio": 1.0
    },
    {
        "title": "Big N Discussion - February 12, 2023",
        "author": "CSCQMods",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110afct/big_n_discussion_february_12_2023/",
        "text": "Please use this thread to have discussions about the Big N and questions related to the Big N, such as which one offers the best doggy benefits, or how many companies are in the Big N *really*? Posts focusing solely on Big N created outside of this thread will probably be removed.\n\nThere is a top-level comment for each generally recognized Big N company; please post under the appropriate one. There's also an \"Other\" option for flexibility's sake, if you want to discuss a company here that you feel is sufficiently Big N-like (e.g. Uber, Airbnb, Dropbox, etc.).\n\nAbide by the rules, don't be a jerk.\n\nThis thread is posted each **Sunday and Wednesday at midnight PST**. Previous Big N Discussion threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Big+N+Discussion&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
        "created_utc": 1676188811,
        "upvote_ratio": 1.0
    },
    {
        "title": "SDE to AI, career pivot",
        "author": "hareesh_l",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1109koy/sde_to_ai_career_pivot/",
        "text": "[removed]",
        "created_utc": 1676185381,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some good strategies for managing product timelines?",
        "author": "misterwillard",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1109g1p/what_are_some_good_strategies_for_managing/",
        "text": "I read \"Waltzing With Bears: Managing Risk on Software Projects\" and I thought it was very good and interesting, but I don't usually see that level of rigor in project planning.  Do you have any preferred methods of managing uncertainty in timelines?",
        "created_utc": 1676184900,
        "upvote_ratio": 1.0
    },
    {
        "title": "I accidentally came across my senior engineer on an online video game, now he’s being distant at work.",
        "author": "KingMoosytheIII",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1108zxj/i_accidentally_came_across_my_senior_engineer_on/",
        "text": "I know this is a crazy situation, I still can’t believe it but it happened. Honestly, if I wasn’t terrified of getting fired during this market, I’d would find this situation funny hilarious.\n\nDuring stand ups, My senior engineer has a *very* distinct sound in his background. It’s  like a vacuum, but the pitch of the sound gets really low, then quickly becomes high-pitch. He was always a quiet, but very cheerful person with a thick Spanish accent. He also lives with his brother, who calls him by his nickname.\n\nLast Monday, I played COD late at night, and almost immediately, I heard somebody from the other team with that same vacuum pitch. They were winning and we started arguing, and that’s when he finally started talking. It was exact same accent, and at that point, I was willing to put money that it was my senior.\n\nNear the end of the game, both of us were completely trash talking each other (nothing hateful, just small banter, apparently he’s very competitive). It felt so out of character for him, and was actually very entertaining. As a joke, I called him out by his nickname, and he immediately goes quiet. I reached out to him after the game saying that it’s me, and he doesn’t respond at all. \n\nThe next day, his attitude is now cold. He’s very silent during our calls, and isn’t explaining things the way he used to in the past. I sent him a message during closing saying that I hoped I didn’t offend him during the game, and I actually really respect them. He claims he has no idea what I’m talking about, and just brushed me off. He remained dismissive the remainder of the week\n\nNow it’s the weekend and Im trying to catch up on work, but Im lost on how to proceed. I feel like he’s practically cutting me off. Im not sure what to do at this point. I even recorded the footage from the game, I heard it over again, and there was nothing offensive. He even started the trash talking. This feels so unreal, and I never thought something like this could happen.",
        "created_utc": 1676183195,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does it make sense for me to stay ?",
        "author": "happyttt",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1108rvw/does_it_make_sense_for_me_to_stay/",
        "text": "[removed]",
        "created_utc": 1676182377,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else a lot more cynical?",
        "author": "SuhDudeGoBlue",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11087bd/anyone_else_a_lot_more_cynical/",
        "text": "It’s amazing how many companies that had reached out to me over the past year to consider joining them, have now had layoffs.\n\nI’ve always known to take what recruiters and hiring managers say with a grain of salt, but now I just think anything they say about financial health and growth is meaningless.  I’m secure and mostly happy in my current role, thankfully (for now).  However, if I hop in the near future, my ask for $$$ has definitely skyrocketed, to account for this risk and not being able to trust companies.\n\n\nHow has all this impacted you?  Are you more cautious about job hopping?  Will companies need to wave more $$$ to help mitigate the apparent risk?",
        "created_utc": 1676180321,
        "upvote_ratio": 1.0
    },
    {
        "title": "How common is it for you to meet people who oversell their skills?",
        "author": "FunnyTman",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11078f5/how_common_is_it_for_you_to_meet_people_who/",
        "text": "For example: Passionate in software development with over 20 years of experience, knowledgable in most fields but mainly web development and shares his knowledge with others with a strong experience in programming (for example)\n\nBut they don't work in a reasonably reputable/well known company. Surely if you had the work experience and are really good at what you do you would have been well known and be working at a more reputable company. Is this common? I feel like these people just structure their sentences in a way to show that they do a lot but they actually don't. What do you guys think?",
        "created_utc": 1676176858,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does this industry lean towards asking technical questions on the spot than just giving you a multiple choice or open ended test?",
        "author": "cybernetics_engineer",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1106w6e/why_does_this_industry_lean_towards_asking/",
        "text": "I don’t understand why this industry requires that technical questions for hiring need to be asked in person in some sort of presentation where everyone watches you.\n\nIn other industry where I worked if I did come in, they just gave me a paper test with multiple choice and open ended questions.\n\nThe above is much harder as they are all actually open ended questions. In order to answer open ended questions successfully, you pretty much need memorization. But I have not met a single developer that memorizes things, we all got docs open, syntax references, etc. on the job.\n\nWhy do employers just like to grill you on the spot like this in a group setting most of the time. Why not paper test?",
        "created_utc": 1676175704,
        "upvote_ratio": 1.0
    },
    {
        "title": "For those of you who WFH, do you have a dedicated office for your work?",
        "author": "-5677-",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1106ub7/for_those_of_you_who_wfh_do_you_have_a_dedicated/",
        "text": "I've been working from home for all of my career, but I get distracted pretty easily.\n\nI was thinking of getting a dedicated space just for working, working from my personal PC kinda blurs the line between free time and work, and I notice that I just can't stop thinking about solutions to problems even after I've stopped working.\n\nWould it be worth it to get a space dedicated 100% to work?",
        "created_utc": 1676175528,
        "upvote_ratio": 1.0
    },
    {
        "title": "Duolingo for LC?",
        "author": "capitalsigma",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1106sz8/duolingo_for_lc/",
        "text": "With the industry as it is, I want to keep my interview skills a bit sharp. I'm back to doing a bit of LC in my spare time, but I'm looking for something I can fit in down time on my phone (waiting for the train, stuff like that) -- like Duolingo, something that's not a substitute for real focused practice, but that's easy to make a bit of progress on in bite-sized chunks. Maybe flashcards for CLRS, or something like that. \n\nDoes such a thing exist?",
        "created_utc": 1676175400,
        "upvote_ratio": 1.0
    },
    {
        "title": "Applied to 100+ SE/ML/DS jobs and so far made it to 0 interviews",
        "author": "Modruc",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1106pjq/applied_to_100_semlds_jobs_and_so_far_made_it_to/",
        "text": "[removed]",
        "created_utc": 1676175074,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would commissioning as an officer in the Air Force get me valuable experience as a software developer for when I transfer out into a civilian career?",
        "author": "Brickeber",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1106o39/would_commissioning_as_an_officer_in_the_air/",
        "text": "Just worried I’ll be leader and managing more than anything else as an officer. Would I actually gain some good knowledge/experience to make the transition easy?",
        "created_utc": 1676174940,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would commissioning as an officer in the Air Force get me valuable experience as a software developer when transferring back to a civilian job?",
        "author": "unknown_user824",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1106ji1/would_commissioning_as_an_officer_in_the_air/",
        "text": "[removed]",
        "created_utc": 1676174508,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your thoughts on starting out your career as a Salesforce Developer?",
        "author": "Gutterboyy",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1106haz/what_are_your_thoughts_on_starting_out_your/",
        "text": "Would you advise against this? I’ve heard some people say you’re not a “real” developer as a Salesforce Developer. Seems a little dramatic, but I do worry about focusing your career around one application.",
        "created_utc": 1676174328,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your ideal work/coding workspace setup?",
        "author": "RemoteEmployee666",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1105uod/what_is_your_ideal_workcoding_workspace_setup/",
        "text": "For me:\n\n-\tHerman Miller aeron\n-\tmechanical keyboard\n-\t34 inch ultra wide (half screen vscode, half browser)\n-\t27 inch portrait monitor (Slack or Discord)\n-\tMX3 mouse\n-\tGoogle mini - lofi all day\n\nHow about you guys?",
        "created_utc": 1676172225,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do people find career fairs?",
        "author": "Last-Alternative-252",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1105o66/how_do_people_find_career_fairs/",
        "text": "[removed]",
        "created_utc": 1676171634,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for Further Education",
        "author": "jjkbs",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1105j45/advice_for_further_education/",
        "text": "Hello CSCQ,\n\nSome context on my background :\n\nI am currently living in Canada and have been working as tech support + sysadmin for an NGO for almost 2 years now, graduated with a 2yr diploma in computer programming in 2021 as an International Student.  \n\nI recently got my permanent residency and now I want to get a bachelors degree hopefully in a discipline that links IT and Healthcare since I am interested in both. \n\nSo now I am wondering if there is a way I can get an online bachelors in tech that preferably aligns with my interests without me having to quit my current job. I am open to any suggestions or if anyone has experienced similar dilemma, what are the options.\n\n*TLDR: options for online bachelors in computer science, preferably something that links healthcare + IT which I can pursue while working* \n\nMuch thanks for any advice/suggestions and thank you for reading!",
        "created_utc": 1676171165,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone switched from Google to Bing?",
        "author": "throwaway09234023322",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1105hve/has_anyone_switched_from_google_to_bing/",
        "text": "[removed]",
        "created_utc": 1676171058,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the career path typically for SWE Consultants?",
        "author": "lyfe4lyfe4lyfe",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1103nu7/what_is_the_career_path_typically_for_swe/",
        "text": "Specifically at companies like Bain, McKinsey or even Accenture. For regular SWEs it is typically Principal Engineer or Management role. \n\n&amp;#x200B;\n\nBut for consulting companies is it becoming a Partner? Also how much does the work differ? Is it more PPT Decks and Business Analyst work or still regular SWE work.\n\n&amp;#x200B;\n\nThanks!",
        "created_utc": 1676165347,
        "upvote_ratio": 1.0
    },
    {
        "title": "is studying software engineering worth it in 2023 ?",
        "author": "CrystalWolf9",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1103n6b/is_studying_software_engineering_worth_it_in_2023/",
        "text": "[removed]",
        "created_utc": 1676165290,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wanted to become a software developer, but CPTSD got me",
        "author": "sallyarts",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1102a5b/i_wanted_to_become_a_software_developer_but_cptsd/",
        "text": "It was the fall of 2016 and I had just started my first semester of CS degree and I lost my memory, or that's what it felt like, and continues to feel like. I wasn't able to remember stuff, and unable to follow instructions, and it all ruined my grade horribly. I was a pretty good student all my life, and then this shit hit me like a brick. I failed several subjects multiple times, just because however hard I tried to learn, it just washed off my brain anyways. I socially isolated myself because of the shame of this all, and I was and am in deep psychological pain. I immediately seeked help when I noticed this abnormality, but the meetings with psychologists and psychiatrists only retraumatized me again and again.\n\nSomething has finally helped me a bit, I am able to do some self care with the help of IFS, a form of therapy. I am able to brush my teeth, make the bed, clear the room. I am trying to get a BIT better.\n\nI turned 25 in December, and programming wise, I had developed a skill in making Machine Learning projects because it fascinated me, and I have an okay knowledge the basics of Computer Science in the various abstractions. It was very hard and painful to study with a condition no one was helping me with even after multiple tries, but I did what I could because I was highly interested in it. Also, love game development, trying to make a 2D JRPG in a gaming framework with Java, it was like, if I do die with all this chronic psychological pain, I want to make at least one game before I do, it was my dream.\n\nI wish to know, is it too late to get into this field? I know, it is not, but the catastrophization that accompanies this condition just fucks me up. I want some hope, that this is not the end, even though I am rationally aware there is.",
        "created_utc": 1676161319,
        "upvote_ratio": 1.0
    },
    {
        "title": "Company requires super specific password requirements",
        "author": "2018-",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11021ej/company_requires_super_specific_password/",
        "text": "I’m no security expert but isn’t implementing super specific requirements the opposite of what you want to do? Like they require a password between a certain amount of characters. Let’s say between 13-15. I imagine just having a minimum with a higher maximum would eliminate that pool of possibilities. It’s just so annoying to have to make a new password every 6 months in that stupid range. End of rant",
        "created_utc": 1676160619,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would getting an AA from a community college help in regards to applying for jobs enough to be worth it?",
        "author": "Deganveran",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11020dq/would_getting_an_aa_from_a_community_college_help/",
        "text": "I have a degree and most of a masters in an unrelated field and wanted to get into programming. Going back for a full degree with a focus on doing full stack would be pretty difficult at the moment since I do work full time and already have student loans so I was considering getting an AA from a community college. I’m sure it will be great for my skills but would it earn me any more consideration when applying to jobs? Not super interested in FAANG, was thinking more defense, financial companies or companies who aren’t in tech but need programmers.",
        "created_utc": 1676160541,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does one get into AI and ML",
        "author": "CantFinishAnyth",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1101o19/how_does_one_get_into_ai_and_ml/",
        "text": "Im generally interested in the subject as a 2nd year CS student. Without taking a master's degree, what should I do to help get into AI and ML territory.  I am fairly ill informed but after watching and playing with tensorflow it sparked an interest I havent had since I got my first jeep.",
        "created_utc": 1676159592,
        "upvote_ratio": 1.0
    },
    {
        "title": "Attorney making switch to CS",
        "author": "butternutv2",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1101meu/attorney_making_switch_to_cs/",
        "text": "Are there any CS careers where I could utilize my JD? I am a licensed attorney in KY but looking to switch over to programming. \n\nIf yes, what languages are best to learn for any known types of work and attorney would be best suited for?",
        "created_utc": 1676159465,
        "upvote_ratio": 1.0
    },
    {
        "title": "Junior Dev with Little Hope",
        "author": "ajfpfmds",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1101808/junior_dev_with_little_hope/",
        "text": "[removed]",
        "created_utc": 1676158369,
        "upvote_ratio": 1.0
    },
    {
        "title": "Commuters, What's your go-to bag for carrying your laptop?",
        "author": "Chrome32",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/110128z/commuters_whats_your_goto_bag_for_carrying_your/",
        "text": "[removed]",
        "created_utc": 1676157942,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello guys. I completed my master’s degree and bachelor’s in aerospace engineering at some school and am currently getting an additional masters degree in computer science for personal reasons.",
        "author": "Jowkowski1999",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/11010u0/hello_guys_i_completed_my_masters_degree_and/",
        "text": "[removed]",
        "created_utc": 1676157833,
        "upvote_ratio": 1.0
    },
    {
        "title": "Information Systems And Security Intern",
        "author": "Ok-Listen523",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1100ss2/information_systems_and_security_intern/",
        "text": "[removed]",
        "created_utc": 1676157196,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self taught who happened to develop a web-app in my workplace, i like coding and making apps, i don't see time passing when i'm doing it, does the passion stay the same when it's \"officialy your job\"?",
        "author": "doing20thingsatatime",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1100rz2/self_taught_who_happened_to_develop_a_webapp_in/",
        "text": "I've always been this guy who likes doing things by passion, i never been good at school because if i'm ever forced into learning something... I just don't feel like learning it.  \n\nI'm wondering if this isn't the same thing with programming. I started with making scripts that automate processes at my workplace, then moved to something \"bigger\" by responding to one of our business needs with a CRUD app using Django and learning CSS and JS on the way. I enjoyed the road. It was so much fun. It was very challenging at times but felt so satisfying when things end up doing what i expect them to do. Programming is one of the few things in life i can obsess over and don't count time passing, i like the rush i get after making something beautiful or making a feature work like its supposed to work.  \n\nThis was like 20 to 40% of my daily job time. Does any of you guys self taught made a move from a non-dev field to becoming officially a developer, does the passion stay the same when you do it full time?",
        "created_utc": 1676157130,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal for people applying to internships to reach out to full-time SWEs at the company they are applying to?",
        "author": "gangstabunniez",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1100kzi/is_it_normal_for_people_applying_to_internships/",
        "text": "I am a full-time SWE at my company that was hired on as an intern and then accepted a full time offer after my internship ended. Today, someone reached out to me on LinkedIn about an internship our company was offering. They had asked me to help get them in contact with recruiting, so I got them the name of one of our recruiters so they could reach out to them on LinkedIn. \n\nIs this normal? I'm guessing they had applied to the position on our career site and hadn't gotten a response back yet, and wanted to get in contact with recruiting. It was a little weird for me, considering I don't work in recruiting our the department the internship they were applying for is. I gave them our recruiters contact info but am not sure if that was the right thing to do, and I've never messaged a recruiter out of the blue for a position I've applied for. Is that something people do? \n\nI know this is a dumb question but was just wondering if this is normal.",
        "created_utc": 1676156585,
        "upvote_ratio": 1.0
    },
    {
        "title": "Offer Rescinded Because of Background Check - Marijuana Distribution Charge",
        "author": "Prestigious_Big_720",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1100cat/offer_rescinded_because_of_background_check/",
        "text": "[removed]",
        "created_utc": 1676155913,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please teach me about this Big Tech company’s compensation",
        "author": "the_flys_fly",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zzyn1/please_teach_me_about_this_big_tech_companys/",
        "text": "NFLX.\n\nThe numbers on levels.fyi are absurdly high compared to other companies. For remote jobs, regardless of location, it’s up to $800k for up to 6 YOE and up to $1.5M for double-digit YOE. The averages appear to be over $500k. All of it seems to be cash as well-no stock.\n\nWhat’s the deal with this? Why are they significantly above market? It would seem that talent from other Big Tech companies could triple or even quadruple their compensation by jumping here.\n\nAlso, how would a candidate negotiate to get up to these absurdly high levels, considering their only leverage (in most scenarios) would be a $200k-$400k (assuming Big Tech) current salary or competing offer?",
        "created_utc": 1676154888,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the internet creating unrealistic expectations?",
        "author": "Dananddog",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zzx6r/is_the_internet_creating_unrealistic_expectations/",
        "text": "OK, I know, the answer to that is undoubtedly yes, but what I'm wondering is if a person with a small amount of coding experience can buckle down and learn enough online to get a job in data engineering in a few months? Or does that require a few years of programming experience to get there that fast? \n\nI know it would be an entry-level job, but I keep seeing salaries and know I'm plenty capable of learning at a reasonably fast pace. \n\nThanks!",
        "created_utc": 1676154778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please teach me about NFLX compensation",
        "author": "the_flys_fly",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zzw09/please_teach_me_about_nflx_compensation/",
        "text": "[removed]",
        "created_utc": 1676154692,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recruiter Didn't Respond to Location Transfer Request",
        "author": "See_u_in_therapy",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zz5ta/recruiter_didnt_respond_to_location_transfer/",
        "text": "Hey y'all, so I reached out to my recruiter about a few weeks ago asking if I could transfer locations from my original location to a new city (where most of our team is located) and she hasn't responded yet. Technically the onboarding process doesn't start until March or early April but I'm worried they'll fill out all the positions by then. Should I just send a follow up request and maybe ask my manager about it as well? I'm just worried about how to approach this because I don't want to be too pushy, but I'd really like to transfer locations.",
        "created_utc": 1676152791,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any Gameplan?",
        "author": "Iloveviolence",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zykb5/any_gameplan/",
        "text": "[removed]",
        "created_utc": 1676151205,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is mechatronics engineering a “valid” career?",
        "author": "iZack2000",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zyjyn/is_mechatronics_engineering_a_valid_career/",
        "text": "As the title says, I'm a soon to be Mechatronics Engineer this fall. I, however, loved the programming aspect of it (embedded, simulations and some data science). So I was wondering if it would be possible for me to get a job in the Programming Industry. I know C,C++, Python so maybe I should start learning languages like Javascript, Java and Databases right? I'm also thinking of pursuing a Masters Degree in Computer Science to, like, 'prove' my knowledge.",
        "created_utc": 1676151179,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help with game plan",
        "author": "Iloveviolence",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zyjhq/need_help_with_game_plan/",
        "text": "[removed]",
        "created_utc": 1676151141,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I tell how old a job posting is if it doesn't say?",
        "author": "mahomesISGARBAGE64",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zxt3b/how_can_i_tell_how_old_a_job_posting_is_if_it/",
        "text": "They have this challenge you have to do and I don't wanna bother doing it if the posting was released 4 months ago.",
        "created_utc": 1676149211,
        "upvote_ratio": 1.0
    },
    {
        "title": "Navigating quiet quitting and implications",
        "author": "randomuckid",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zxqh8/navigating_quiet_quitting_and_implications/",
        "text": "Hi guys, given the prevalence of quiet quitting in the industry now. I'd like to know if anyone has every went through the situation and how to get the most out of it, money, time and future career opportunity wise. Others do it for many reasons, but in my case, I am already burned out to the point that even fat paychecks means quite little to me atm (think high end payband for level and role on levels.fyi). \n\nOn the other hand, I've already invested enough empthay, time and effort to my org and company relatively and feeling being taken advantage off. On top of that, I've also seen casses where others taking advantage of our company by not doing anything for months to a year and then quit to other company successfully. Currently, I've come to a point that I realize I need to take my share since no one else is going to give it away and I want to make the most out of it.Anyone has advice on how to navigate this?\n\nSome implications I've currently listed are, from best to worst: \nbeing let go with severance, being kept as zombie employee but may definitely stand out as sore thumb, will miss promo this year and see others of the same levels getting promo this year (fair, but envious of their good projects), guilt because my manager does his best?!, being blacklisted by company (okaish), blacklisted by faang indirectly since managers here have are recycled from other faang and have connection to other faang managers (may prolong next job search if I want to target faang), and probably the worst case is I'll delay my career progression by probably 3+ years to next level if tech recession isn't recovering for at least for next few years. Or maybe no, the worst case could be if I stay and half-assing my work for next few years and wasted my life just like that.",
        "created_utc": 1676149024,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grad schemes",
        "author": "Ill_Championship9118",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zxkpm/grad_schemes/",
        "text": "Hey everyone. Doing a masters in CS (UK) right now and I’m on the job search. I was wondering if anyone knew of firms which did grad schemes which offered 6 month rotations (over 2 years) in different CS areas. For example, 6 months data science, 6 month data engineering, 6 month back end software engineering etc… \nSorry if the question is vague. I’ve heard about these schemes before but don’t know where to find them",
        "created_utc": 1676148600,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I apply for multiple locations for a STEP internship *please comment lol*",
        "author": "gracie_780",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zxalt/can_i_apply_for_multiple_locations_for_a_step/",
        "text": "[removed]",
        "created_utc": 1676147847,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can i use java in cloud native",
        "author": "Electronic_Sir_2206",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zx924/how_can_i_use_java_in_cloud_native/",
        "text": "[removed]",
        "created_utc": 1676147730,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a Bizops engineer and what doors can it open?",
        "author": "THE-SERBIAN-BADGER",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zx70l/what_is_a_bizops_engineer_and_what_doors_can_it/",
        "text": "[removed]",
        "created_utc": 1676147581,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fresh graduate from Computer Engineering. Got a job offer from a bank company that uses proprietary programming language. Good as career starter?",
        "author": "Master_Chan01",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zwyua/fresh_graduate_from_computer_engineering_got_a/",
        "text": "[removed]",
        "created_utc": 1676146992,
        "upvote_ratio": 1.0
    },
    {
        "title": "What were the most helpful chapters of Designing Data Intensive Applications for you?",
        "author": "austinicepocalypse",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zwoum/what_were_the_most_helpful_chapters_of_designing/",
        "text": "We are all aware of this magnificent book. Many details, and a lot to process. I want to know how people have benefited the most by reading this book?\n\nDid it make you better at researching technologies &amp; applying them to the system you are working on?  \nDid it simply improve your ability to grasp discussions in architectural/design meetings?\n\n  \nAlso, how did you read it? Did you go chapter by chapter and take notes? Did you read the chapter, and then do some browsing on the web to find interesting blog posts about the technologies discussed in the chapters?\n\n&amp;#x200B;\n\nCheers!",
        "created_utc": 1676146267,
        "upvote_ratio": 1.0
    },
    {
        "title": "Close way to get qualitative CS degree knowledge",
        "author": "Fuad666666",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zwmsp/close_way_to_get_qualitative_cs_degree_knowledge/",
        "text": "Which way, method, resources are the best to learn fundamentals of CS if I can not attent university leassons? Maybe there full resources, open curicullum, full video lectures from CS professor that will help me to self-teach Computer Science.Where should I start?\nSome people recommended to start with \"Open Source Society University\". What do you think?",
        "created_utc": 1676146120,
        "upvote_ratio": 1.0
    },
    {
        "title": "Working for a three-letter agency in an intel role, wanting to get into some sort of tech. What's my best/easiest route?",
        "author": "proglobalwarming",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zwdka/working_for_a_threeletter_agency_in_an_intel_role/",
        "text": "I am currently an analyst in the DC area. Late 20s making about $90k. I have zero experience in tech, but I'm tired of living in this area, want to move out west, want to work remote if possible, and want to double my salary. Almost none of that is possible in my current role. I could reasonably max out at $150k but that's years down the road and would require staying in the area.\n\n&amp;#x200B;\n\nWhat is my best path? Learn coding in my free time and simply switch career fields? Get some cyber sec certs and try and leverage the three-letter agency on my resume? Get as much cyber experience I can at my agency then use my clearance to jump to a contractor?\n\n&amp;#x200B;\n\nI've decided at this point in life that there's no work I'm ever going to love, so I might as well maximize my own comfort and pay.",
        "created_utc": 1676145472,
        "upvote_ratio": 1.0
    },
    {
        "title": "My SO has a question about CS careers",
        "author": "StableTable-l__l",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zw4v5/my_so_has_a_question_about_cs_careers/",
        "text": "[removed]",
        "created_utc": 1676144819,
        "upvote_ratio": 1.0
    },
    {
        "title": "New SAP B1 Consultant career advice",
        "author": "nerdyhooper",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zvjvp/new_sap_b1_consultant_career_advice/",
        "text": "[removed]",
        "created_utc": 1676143319,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to make use of my situation?",
        "author": "babyshark75",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zvhqz/how_to_make_use_of_my_situation/",
        "text": "I'm a CS sophomore. I have a part time job working for a non-tech/ non-coding local mechanic shop. My boss knows that i'm doing CS and looking for internships. Her husband had a side business building a point of service software. After he passed, that side business stopped. She was considering selling that business. Any recommendation on how to approach my boss for code projects? She mentioned i could do a project for her current business, we vaguely talked about his. I want to have a plan for next time when i sit down with her again.",
        "created_utc": 1676143173,
        "upvote_ratio": 1.0
    },
    {
        "title": "Degree Difference Question",
        "author": "Otherwise-Mammoth865",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zvdqh/degree_difference_question/",
        "text": "[removed]",
        "created_utc": 1676142892,
        "upvote_ratio": 1.0
    },
    {
        "title": "Embedded SW Opportunities",
        "author": "StizzyOne",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zv10q/embedded_sw_opportunities/",
        "text": "[removed]",
        "created_utc": 1676141995,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you deal with overachieving narcissistic type of people in this profession.",
        "author": "IndianSWE",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zuz1w/how_do_you_deal_with_overachieving_narcissistic/",
        "text": "Before you say, \"Ohh this happens in every profession...\"  \n1. It's a common stereotype that software engineers lack social skills. \n\n2. People with 3 to 5 years of experience can be making as much as a top lawyer, doctor, management consultant. This makes this profession extremely attractive to smart people. Not all smart people are humble. \n\n3. Being extremely competitive and sometimes even toxic is how some of these people managed to get into these high paying jobs. Behaving the way they behaved managed to get this this far in life, there is no reason these people stop behaving the way they do. \n\n&amp;#x200B;\n\nLet me give you an example of what I am talking about. I have a friend who I have known for 7.5 years now. Me and him took several classes together in a master's program. This guy has a 2000/1 million rank in the National engineering entrance exam. My rank was around 90K. This guy has amazing GRE scores &amp; GPA. People in the master's program used to treat him like a rockstar. I often wondered why he is my batchmate lol. Then we got into the same company. Worked there for 4.5 years. We often used to talk about salaries and stuff. Recently both of us left the company. I got a job for around 250K/yr. He got a job for 305K/yr. Yesterday I called him up and asked for a referral as I was not liking my current job. And this guy started giving me life advice. He was telling me that I don't know how interviews work at companies that pay a lot of money. That I am not prepared. I don't have a direction in life. I need to form a strategy for life. At one point I got fed up and I asked him if he will refer me or not? And he was like \"You are stupid, that's why you make so less money\". At that point I started laughing. He got so aggravated that he hung up the phone. Mind you, the difference between my salary and his salary is exactly 50K lol.  \n\n\nThis type of non-sense happens so many times at work too. I have colleagues who have degrees from CMU, Georgia-tech, UWaterloo. They will snap at me, talk all over me. Laugh when I suggest something in a meeting. I have been attending a lot of these women in tech conferences of late. I am  a guy by the way. Sometimes when I hear the experiences of women in tech, it feels so similar to my experiences too. How do you deal with this bullshit?",
        "created_utc": 1676141849,
        "upvote_ratio": 1.0
    },
    {
        "title": "Job offer within 24hrs?",
        "author": "Fit-Signature236",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zux38/job_offer_within_24hrs/",
        "text": "[removed]",
        "created_utc": 1676141707,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I on the right path?",
        "author": "Separate-Collar100",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zusgl/am_i_on_the_right_path/",
        "text": "[removed]",
        "created_utc": 1676141363,
        "upvote_ratio": 1.0
    },
    {
        "title": "At what point should I consider myself a senior? Recently laid off looking for guidance",
        "author": "Whatamianoob112",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zurxw/at_what_point_should_i_consider_myself_a_senior/",
        "text": "I have 4 years of experience in the industry, though, 2 years in a junior government position and 2 years in a mid-level support engineer position doing ETL pipelines, though almost purely in python and Java. \n\nI was laid off earlier this week and am unsure what I should be looking for. I'm not a junior- I don't think. I have strong foundations and an understanding of DevOps and some project management. My coupling and systems engineering skills could use work. \n\nI think this equates to roughly an L2 or L3 position but I don't have a lot of library specific skills. Most of my skillet is general and non-specialized. \n\nWhat should I be doing? I have 2 months to find a new position and I'm struggling to determine how to best focus my efforts.",
        "created_utc": 1676141324,
        "upvote_ratio": 1.0
    },
    {
        "title": "At what point should I consider myself a senior engineer?",
        "author": "ComprehensiveWord201",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zuqbr/at_what_point_should_i_consider_myself_a_senior/",
        "text": "[removed]",
        "created_utc": 1676141204,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lost and confused about whether I should choose DevOps of (legacy)Full Stack as a fresher",
        "author": "eBhardy",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zubrs/lost_and_confused_about_whether_i_should_choose/",
        "text": "[removed]",
        "created_utc": 1676140179,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lost and confused about whether I should choose DevOps of (legacy)Full Stack as a fresher.",
        "author": "eBhardy",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zu9pu/lost_and_confused_about_whether_i_should_choose/",
        "text": "[removed]",
        "created_utc": 1676140031,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lost and confused about whether I should choose DevOps of (legacy)Full Stack as a fresher. Need advice.",
        "author": "eBhardy",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zu85v/lost_and_confused_about_whether_i_should_choose/",
        "text": "[removed]",
        "created_utc": 1676139916,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lost and confused about whether I should choose DevOps or (legacy)FullStack a fresher",
        "author": "eBhardy",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10zu29p/lost_and_confused_about_whether_i_should_choose/",
        "text": "[removed]",
        "created_utc": 1676139503,
        "upvote_ratio": 1.0
    },
    {
        "title": "Disability and my CS Career",
        "author": "Advanced-Dot-5307",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10ztwyw/disability_and_my_cs_career/",
        "text": "[removed]",
        "created_utc": 1676139127,
        "upvote_ratio": 1.0
    },
    {
        "title": "Returning swe Intern For FTE still Asking Questions Normal?",
        "author": "ReflectionInner8028",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10ztseq/returning_swe_intern_for_fte_still_asking/",
        "text": "I’ve been a full time swe for 3 weeks from intern conversion and have new parts of pipeline to learn that I didn’t touch. during my internship. The first 1.5 weeks was waiting for access to technical stuff to trickle down. I’ve asked quite a few questions, mainly on documentation from external vendor stuff,  and new parts of the pipeline I haven’t touched before sometimes during work and on weekends (my team does work on weekends and even sends emails to each other and me on weekends) I ask questions sometimes on weekends in addition during meetings a senior engineer setups with the team, excluding the manager (presumably my manager doesn’t want to deal with bringing up former intern/new hire questions) because our build and tests take really long to run before seeing results. \n\n\nEven they say I’m making good progress I can’t help but feel they are secretly annoyed for being asked so many questions. I also overheard my boss chatting with another director saying I’m progressing but it would still take a while for me to become accustomed with all of our custom swe tools/pipelines. Also a senior swe who was assigned to mentor me by my boss and has mentored interns in the past has asked me and cc’d my boss to send a weekly calendar of what I have accomplished and when certain tasks will be finished. From day 1 similar to my intern, I was also given a tentative checklist of tasks/guidelines to focus on and I have been completing them but not super fast. Is this a red flag of me being under PIP even though I’m making progress or is the senior swe trying to show leadership qualities for promotion?",
        "created_utc": 1676138803,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can code, but I feel lost when it comes to building applications",
        "author": "tostitos6",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10ztri6/i_can_code_but_i_feel_lost_when_it_comes_to/",
        "text": "[removed]",
        "created_utc": 1676138735,
        "upvote_ratio": 1.0
    },
    {
        "title": "For those who work in blockchain/crypto/web3 companies - How much in token compensation do you get?",
        "author": "Ill_Air_9023",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10ztnwg/for_those_who_work_in_blockchaincryptoweb3/",
        "text": "[removed]",
        "created_utc": 1676138481,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone with experience taking an extended period of time off to level up?",
        "author": "jakebakerwastaken",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10ztg7s/anyone_with_experience_taking_an_extended_period/",
        "text": "I’m currently working as a software engineer with 1 year of experience.  I’m considering looking for a new job but I’ve found that my actual skill level is the barrier to entry for the work I’m interested in/have experience with (C++, embedded).  \n\nIdeally I’d like to take 6 months to work on projects and improve my skills now that I have the momentum and confidence to actually do something meaningful on my own.  Before my current job I really had no experience programming coming right out of school, and having learned c++ shortly after graduating.  Currently I even feel as though my ability to sit and work on a hard problem has increased greatly which again gives me confidence in my ability to create something worthwhile to improve my engineering ability. \n\nPerhaps this feeling of needing time to “level  up” comes from my lack of experience, has anyone taken this risk of leaving they’re current job to have the time to work on other skills?  \n\nTo be clear, I’m considering leaving my current job mainly due to the commute (2 hours each way).  I was hired at 1x in the office, and as my first job it was a no brainer.  It’s been increase to 3x and I’m unable to move closer to the job. \n\nTLDR; in a perfect world I want to leave my job to increase my skills to prepare me for another job.  Does anyone have experience in a similar situation in which they’ve taken the risk of leaving a job to work on themselves and get a better job?",
        "created_utc": 1676137937,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is LinkedIn Career Premium worth it?",
        "author": "cheeksthefifth",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/10ztbwe/is_linkedin_career_premium_worth_it/",
        "text": "I used the free trial back when I first started using LinkedIn, which I think was a mistake. I am getting a lot more views on my profile now.I enjoyed the ability to see who was viewing my profile. But not sure if there is anything else to justify the $40 per month price. \n\nI want to be seen by a lot of recruiters in hopes that I'll get more chances. I heard that it boosts your name in searches? But once again I cant wrap my head around $40 for those two features.\n\nWhat can I do to help my chances? Ive been reaching out to recruiters/workers from the companies but thats all.",
        "created_utc": 1676137620,
        "upvote_ratio": 1.0
    }
]