[
    {
        "title": "What is Artificial Intelligence",
        "author": "electronicsinside",
        "url": "https://youtu.be/_eISjSW-T1U",
        "text": "",
        "created_utc": 1526755168,
        "upvote_ratio": ""
    },
    {
        "title": "Which is better to study for short term summer course , with the hope of future foreign internship or a well paid job : Embedded systems or VLSI design using Cadence ?",
        "author": "Marsh_Chimer_Hue",
        "url": "https://www.reddit.com/r/ECE/comments/8kkpmo/which_is_better_to_study_for_short_term_summer/",
        "text": "",
        "created_utc": 1526729637,
        "upvote_ratio": ""
    },
    {
        "title": "Hobbyist CS Sophomore, knows steps for EE project but lacks fundamentals.",
        "author": "39452",
        "url": "https://www.reddit.com/r/ECE/comments/8kjr4w/hobbyist_cs_sophomore_knows_steps_for_ee_project/",
        "text": "I am a hobbyist in a couple communities that deal with PCB's and designing them, however all of my work is based off of guides and step by step instruction with little to know innovation on my behalf. Is there a course online or introductory guide to components, their intereaction, etc. \n\nThanks",
        "created_utc": 1526714199,
        "upvote_ratio": ""
    },
    {
        "title": "Electrical Engineering Technology",
        "author": "DivineRain",
        "url": "https://www.reddit.com/r/ECE/comments/8kiwe0/electrical_engineering_technology/",
        "text": "Hey guys. Short life story here. Got married at 19. Turning 20 this August. Wife due to give birth this October. Was going to join the Air Force but it seems I have many disqualifying factors. My local community college has a degree titled “Electrical/Electronics Engineering Technology”... I’m assuming this is the same thing as a regular electrical engineering technology degree. Any technologists here that I could PM or someone who graduated with an EET degree. It’s only an associate’s. The community college obviously doesn’t do bachelor’s degrees. Can I start a career there or would I need to commute to another college after that for a bachelor’s? The nearest one is a 40 minute drive and they have an “Electrical/Computer Engineering Technology” option. Could I start entry and go back later or see if an entry level position could be with a company that might pay for it? Idk...\n\nTL;DR - Current plan failed, looking to get AAS in electrical/electronics engineering technology. Would an associate’s be enough or do I need to get a bachelor’s. Technologists let me know if I can PM.\n\nThanks for your time! :)",
        "created_utc": 1526702745,
        "upvote_ratio": ""
    },
    {
        "title": "How can i avoid getting stuck in testing?",
        "author": "ligga4nife",
        "url": "https://www.reddit.com/r/ECE/comments/8kivlr/how_can_i_avoid_getting_stuck_in_testing/",
        "text": "Im going to be graduating soon and had two internships which basically were 99% testing and verification.  I am really afraid that my lack of design/r&amp;d experience is going to force me into a life of being a tester. Is there anyway i can avoid this?",
        "created_utc": 1526702465,
        "upvote_ratio": ""
    },
    {
        "title": "I posted I found a new job a couple weeks ago. I was just laid off for someone with more experience.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/8kh6by/i_posted_i_found_a_new_job_a_couple_weeks_ago_i/",
        "text": "[deleted]",
        "created_utc": 1526683757,
        "upvote_ratio": ""
    },
    {
        "title": "PCB traces as current-sense resistors",
        "author": "sstunt",
        "url": "https://www.reddit.com/r/ECE/comments/8kh2l2/pcb_traces_as_currentsense_resistors/",
        "text": "OK, I need a gut check.  Has anyone built a product that used PCB traces as a current sense resistor?  Did it work?  I need to measure up to 5A, and don't need a bunch of accuracy -- so avoiding having to source a 0.01-ohm resistor seems attractive.  Doing a bit of calibration, either with a twiddle-pot or cutting traces, would be acceptable.\n\nBoards would be whatever comes out of the OshPark process -- so, relatively uncontrolled, aside from being marketed as 1 ounce copper.\n\nTalk me out of it before I do something stupid!",
        "created_utc": 1526682737,
        "upvote_ratio": ""
    },
    {
        "title": "What are some embedded Electronics technology deployed in Space.",
        "author": "nukestar101",
        "url": "https://www.reddit.com/r/ECE/comments/8kf0jj/what_are_some_embedded_electronics_technology/",
        "text": " I wanted some help regarding my research topic in which i want to study Electronics deployed in Space ,what are the technology/challenges faced in that process and also field in which i can guide myself How are FPGAs used in space/exploration research programs ? ",
        "created_utc": 1526665174,
        "upvote_ratio": ""
    },
    {
        "title": "Best software to learn to manage/plan an electronics project?",
        "author": "Theis159",
        "url": "https://www.reddit.com/r/ECE/comments/8kc253/best_software_to_learn_to_manageplan_an/",
        "text": "Hello, as I'll be starting my first intership I want to start building a project management/planning that may be useful for the engineer's job.\n\nI always do a roadmap for my college projects where by using excel but I saw some enterprises ask for a MSProject background and I found the software kinda bad. Is it really the best software or there are any other option?",
        "created_utc": 1526638324,
        "upvote_ratio": ""
    },
    {
        "title": "Application of electronics in Medical services",
        "author": "Charles_wenike",
        "url": "https://youtu.be/q5CZBXivxcs",
        "text": "",
        "created_utc": 1526636018,
        "upvote_ratio": ""
    },
    {
        "title": "mcusim - simulator for MCU-based circuits (ANSI C, Lua, New BSD License)",
        "author": "dsalychev",
        "url": "https://www.reddit.com/r/ECE/comments/8kbsd7/mcusim_simulator_for_mcubased_circuits_ansi_c_lua/",
        "text": "Hi.\n\nI'm going to share this project I've been working on for almost a year and a half already with you not because it's already mature and ready for end users, but because it's a good moment to participate in any way, I guess. It contains about 15,000 lines of code at the moment. There are issue tracker and a wiki which I've just started and this is why it contains only one article about adding new model of AVR microcontroller.\n\nThe whole idea of the simulator is to substitute functional parts of a schematic \\(including MCU itself, external RAMs, displays, etc\\). Model of the microcontroller is built into mcusim and peripheral devices can be replaced by the Lua scripts loaded initially. Simulation itself is supposed to be as close as possible to the real hardware to avoid infamous simulators bugs \\(in addition to the hardware bugs\\).\n\nThere are two ways to use simulator. First one is to connect GDB to the remote target provided by the simulator and debug your firmware. Second one \\- run simulator in a \"firmware test\" mode which doesn't wait for GDB or any other external event and just perform a simulation. You may create a special Lua script in this mode to be loaded together with other peripheral devices and check any cases you want \\(track state of a pin, wait for expected signal, etc\\). mcusim is also able to trace many I/O registers \\(including separate bits\\) and save results in .VCD file.\n\nPersonally, I'm working on adding support for ATmega8A features \\(timers/counters simulation, TWI and so on\\). There is another microcontroller I'd want to be supported before 0.2.0 release: ATmega328/328P. This is how you can help.\n\nRepository: [https://github.com/dsalychev/mcusim](https://github.com/dsalychev/mcusim)\n\nIssue tracker and wiki: [https://trac.mcusim.org/](https://trac.mcusim.org/)\n\nWhat's going on there: [https://trac.mcusim.org/report/3](https://trac.mcusim.org/report/3)\n\nOpenHub info: [https://www.openhub.net/p/mcusim](https://www.openhub.net/p/mcusim)\n\n I'm really glad to be able to share something with community and ready to listen to any opinions.",
        "created_utc": 1526634671,
        "upvote_ratio": ""
    },
    {
        "title": "What type of projects are important/stand out on your resume for employers?",
        "author": "throwawaylifeat30",
        "url": "https://www.reddit.com/r/ECE/comments/8kbdis/what_type_of_projects_are_importantstand_out_on/",
        "text": "So, I'm an applied math and statistics major undergrad student however I really want to work at electrical engineering companies once I graduate.  I currently have about 3 semesters left (about 1 year and 6 months).  I am looking vigorously for projects around my campus (there are PLENTY).  This past semester, I participated in a solar tracker project (funded by Southern California Edison company ) as part of an academic club on a team of electrical engineering students.  Now, I'm wondering what type of projects I should engage in.  Also, my friend is an electrical engineering undergrad student who wants me to be on his team for his senior project.  Should do I do it or go for another team project in an academic club that's funded by a company?  My main priority is to put something on my resume that would attract employers. ",
        "created_utc": 1526628651,
        "upvote_ratio": ""
    },
    {
        "title": "Question about current sensing relay for a personal project.",
        "author": "Maxatron4000",
        "url": "https://www.reddit.com/r/ECE/comments/8kaysx/question_about_current_sensing_relay_for_a/",
        "text": "I'm trying to turn on a light when my stereo turns on; it's ~4mA when off/standby and &gt;500mA when on. \nI know I can do this with a current sensing relay but this project is already over budget which is why I haven't jumped on one of the $40-$120 relays I can easy find online. \nThe advantage of a current sensing relay is that you don't need access to the cable but in this case I could easily put something inline with the power cable. \nIs there another cheaper solution that I'm not thinking of?",
        "created_utc": 1526623350,
        "upvote_ratio": ""
    },
    {
        "title": ".step file from Altium to HFSS?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/8kaple/step_file_from_altium_to_hfss/",
        "text": "[deleted]",
        "created_utc": 1526620156,
        "upvote_ratio": ""
    },
    {
        "title": "Would an EE degree open doors to Computer Engineering jobs?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/8kaalf/would_an_ee_degree_open_doors_to_computer/",
        "text": "[deleted]",
        "created_utc": 1526615325,
        "upvote_ratio": ""
    },
    {
        "title": "Can't Measure Power Dissipation in LTSpice",
        "author": "AdventurousRead",
        "url": "https://www.reddit.com/r/ECE/comments/8ka5ix/cant_measure_power_dissipation_in_ltspice/",
        "text": "Hi all, sorry if this isn't the place for this post, but /r/LTSPICE looks dead.\n\nWhen I try to measure the power dissipation of a component with Alt+Left Click, the whole window resizes, and no measurement is taken. So far, Google hasn't helped, so I ask here.\n\nThanks a bunch.\n\nEdit: Fixed. It was caused by [AltDrag](https://stefansundin.github.io/altdrag/), and not LTSpice or Windows. My bad.",
        "created_utc": 1526613811,
        "upvote_ratio": ""
    },
    {
        "title": "TFT LCDs that communicate over I2C or SPI?",
        "author": "SuperConductiveRabbi",
        "url": "https://www.reddit.com/r/ECE/comments/8k9hl6/tft_lcds_that_communicate_over_i2c_or_spi/",
        "text": "I figured if I wanted to control any type of LCD I'd have to use a parallel interface or use a VGA controller. However, I've come across a few TFT LCDs like this one: https://www.buydisplay.com/default/7-inch-lcd-module-capacitive-touch-screen-panel-i2c-spi-serial\n\nThey claim to work over I2C and SPI. But how well do they work? What sort of data rates would be possible, and how do I determine what the maximum is? Would I use a DMA controller to dump RGB data into the screen's on-board memory? And if so, how would I deal with the vertical and horizontal refresh timing?",
        "created_utc": 1526606959,
        "upvote_ratio": ""
    },
    {
        "title": "How I got CMRR all wrong ...",
        "author": "throughdaylight",
        "url": "https://www.reddit.com/r/ECE/comments/8k9fjm/how_i_got_cmrr_all_wrong/",
        "text": "Dear thriving EE students,\n\nIf you are like me, you would have come across a page or a slide that makes you wonder and interpret the meaning of CMRR from something like [this](https://goo.gl/images/sBxmhi). It looks good on paper, but it isn’t quite intuitive.\n\nYou see, suppose that I want to probe my head’s follicles to be someone like a *wannabe miner* during California Gold Rush, only in this case I’ll connect (with a loop like probes to pick electromagnetic signals) my hair follicles with a 34 gauge I found at a surplus store. Suppose that I’ve a notion or a groundbreaking theory that if I can measure difference in *electrical activity* between the electromagnetic signals arising out of base of these two hair follicles, I can build a model that would build the next great polygraph tester ... okay enough of this.\n\nWhat I really want to do is to measure difference in the electromagnetic signals that’s being picked up by the loop-like probes (at the base of hair follicles) - say that a difference of 10 uV indicates that I’m telling the truth, while a difference of 20 uV says that I’m telling a lie. But wait - since I’ve these loop-like probes, I’m for sure gonna pick up stray signals - RF/microwave/cosmic (okay I know amplifier has finite bandwidth and it will reject ultra high frequency signals), but let’s say there is some stray signal picked up at lower frequency ... and that stray signal is common to both these loop-like probes. I know by now that circuits 101 instinct of yours would have realized that the stray signal common to both probes is the **common mode signal**, while the weird difference signal that I’m interested in analyzing on my scope display would be **differential signal**, if I were to hook up both these probes to an op-amp. Bear with me for just a while ...\n\nI dunno the order of magnitude of common mode signals - it could be 100 uV or 100 mV or even few Volts (yes, arbitrary noise generators can do that). And who said that the profile of this common mode signal is random fluctuations - it’s could also be a modulated signal picked up from HAM radio frequency ... anyways, I don’t think I would ever have control over the magnitude of common mode signal. Now a common mode gain of 10 or 20 dB means that if my common mode signal amplitude is 200 mV, at the out of op-amp based amplifier (designed to have a common mode gain of 20 dB) would **suppress** this common mode signal down to 20 mV. Now a common mode gain of 1000 or 60 dB means that with this same setup (except now I’m replacing it with an op-amp designer to have common mode gain of 60 dB), the common mode signal at the output would have amplitude of 200 uV. So far good?\n\nNow, suppose that I’ve this same op-amp designed to have a common mode gain of 60 dB (or 1000) and without worrying about how I got the op-amp to pump me a differential gain of 80 dB (or 10000), I’ll connect my brain loop-like probes to this amplifier. So I’ll have my 10 uV or 20 uV signal coming in and getting amplified to 10 V or 20 V (assume that the op-amp is powered by a +/- 35 V supply). Next, the common mode signals - the 200 mV common mode signal will be attenuated to ~ 200 uV. So, at the output, if you can visualize the magnitude of these signals, you’ll have 10 V or 20 V amplitude signals with 200 uV signal that’s noise at the output.\n\nSo what does it say about CMRR?\n\nCMRR = DifferentialGain / CommonModeGain\n\n~~i.e. CMRR = 80 dB / 60 dB~~\n\nLogarithmic quantities!\n\n~~i.e. CMRR = 80 dB - 60 dB~~\n\nBut wait! Common Mode **Gain** attenuates signal ...\n\n∴ CMRR = 80 dB - ( - 60 dB)\n\n∴ CMRR = 140 dB \n\ni.e. say if this amplifier had common mode signal in the order of **X** uV and differential signal also in the order of **X** uV, then the amplifier will suppress common mode signal by 1,000 times, while it will amplify the good differential signal by 10,000 times. \n\nCommon mode signal (noise - bad) = X / 1000\n\nDifferential signal (good) = X \\* 10000\n\nCMRR number basically tells you by how can good win over bad, assuming that both are twins. Obviously in real life the good signal can be 10 uV or 20 uV while the bad signal was in the order of 200 mV ... High CMRR can make SNR better, if that makes sense.",
        "created_utc": 1526606394,
        "upvote_ratio": ""
    },
    {
        "title": "Whats a good resource to learn how to do footprint design for PCB layouts?",
        "author": "localPlumbusImporter",
        "url": "https://www.reddit.com/r/ECE/comments/8k8e39/whats_a_good_resource_to_learn_how_to_do/",
        "text": "",
        "created_utc": 1526596481,
        "upvote_ratio": ""
    },
    {
        "title": "USB to RS232 Hub Recommendations",
        "author": "chriswhat1",
        "url": "https://www.reddit.com/r/ECE/comments/8k82tj/usb_to_rs232_hub_recommendations/",
        "text": "I'm looking for USB to RS-232 hub for connecting a computer to up to 16 different instruments via RS-232. I've found a couple of models from [StarTech](https://www.startech.com/Cards-Adapters/Serial-Cards-Adapters/16-port-usb-serial-hub~ICUSB23216FD) and [Moxa](https://www.moxa.com/product/UPort_1610-16.htm), but I'm not sure what the difference between the two are besides the Moxa model being pricier. Does anyone have experience with with these devices and have any recommendations?",
        "created_utc": 1526593800,
        "upvote_ratio": ""
    },
    {
        "title": "RF SDR dongles, any opinions?",
        "author": "spainguy",
        "url": "https://www.reddit.com/r/ECE/comments/8k7x7i/rf_sdr_dongles_any_opinions/",
        "text": "I'm thinking of getting something like https://www.rtl-sdr.com/buy-rtl-sdr-dvb-t-dongles/ for general workbench,RF sniffing, nothing specific,TTL,AVR sort of thing, anything better? What to look out for? I haven't got any RF gear at all",
        "created_utc": 1526592512,
        "upvote_ratio": ""
    },
    {
        "title": "ElectroBiological Systems",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/8k7rus/electrobiological_systems/",
        "text": "[deleted]",
        "created_utc": 1526591319,
        "upvote_ratio": ""
    },
    {
        "title": "Clock frequency?",
        "author": "bubbab315",
        "url": "https://www.reddit.com/r/ECE/comments/8k6hah/clock_frequency/",
        "text": "I've always heard how accurate your timing is is related to the frequency of your oscillator. What does this mean and how does the frequency relate to timing something. For instance if I used a 1khz clock to measure the zero time between impulses in a PWM signal.",
        "created_utc": 1526581249,
        "upvote_ratio": ""
    },
    {
        "title": "Weird site of mostly EE curated content, I think r/ece might enjoy",
        "author": "polalavik",
        "url": "https://www.5things.xyz/",
        "text": "",
        "created_utc": 1526540294,
        "upvote_ratio": ""
    },
    {
        "title": "What is HMI(Human Machine Interface)?",
        "author": "erriravino",
        "url": "https://www.quora.com/What-is-a-human-machine-interface",
        "text": "",
        "created_utc": 1526538669,
        "upvote_ratio": ""
    },
    {
        "title": "Why do we use a high gain amplifier to build a comparator circuit?",
        "author": "mixedberryshake",
        "url": "https://www.reddit.com/r/ECE/comments/8k1548/why_do_we_use_a_high_gain_amplifier_to_build_a/",
        "text": "Thanks in advance.",
        "created_utc": 1526528554,
        "upvote_ratio": ""
    },
    {
        "title": "How I got CMRR all wrong ...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/8k0hq1/how_i_got_cmrr_all_wrong/",
        "text": "[removed]",
        "created_utc": 1526522237,
        "upvote_ratio": ""
    },
    {
        "title": "In 1895 Hertha Ayrton (a, gasp, woman) found that arc-lamps have negative resistance! This led to the first resonant electrical circuit and the first radio frequency electrical circuit &amp; is even connected to the sinking of the Titanic! Check it out.",
        "author": "KathyLovesPhysics",
        "url": "https://youtu.be/hrmx_TKNvyc",
        "text": "",
        "created_utc": 1526520897,
        "upvote_ratio": ""
    },
    {
        "title": "Why is it called a \"register file\"?",
        "author": "guarayos",
        "url": "https://www.reddit.com/r/ECE/comments/8jziiq/why_is_it_called_a_register_file/",
        "text": "I guess what I'm asking for is the etymology. Is it a \"file\" in the sense of a file that most of us think of, that is, a collection of bytes grouped together and given a name by the filesystem? Or is the term file from something older?\n\nProbably a stupid question, I know, but it's been bugging me. ",
        "created_utc": 1526513162,
        "upvote_ratio": ""
    },
    {
        "title": "CS minor",
        "author": "ephone5",
        "url": "https://www.reddit.com/r/ECE/comments/8jzfjf/cs_minor/",
        "text": "Im considering doing a cs minor with my ee degree at my school. Is this going to be beneficial for me in the future? I will still be able to graduate in 4 years but i will end up taking a heavier course load each semester. I will be a sophomore next semester and i will be finished with the minor by senior year. The minor only requires 5 additional classes. How much CS is actually used in the industry?",
        "created_utc": 1526512416,
        "upvote_ratio": ""
    },
    {
        "title": "Op-amp design resources",
        "author": "3FiTA",
        "url": "https://www.reddit.com/r/ECE/comments/8jxhrp/opamp_design_resources/",
        "text": "Looking for good resources on design of op amps, from a discrete transistor perspective, for a personal project. Any help would be greatly appreciated! I’m not sure exactly what the differences would be between a discrete vs IC design strategy (besides things like carefully matched devices in a current mirror), but I’m looking for any info out there! Thanks. ",
        "created_utc": 1526496961,
        "upvote_ratio": ""
    },
    {
        "title": "Question about a PA S11",
        "author": "Theis159",
        "url": "https://www.reddit.com/r/ECE/comments/8jxg2y/question_about_a_pa_s11/",
        "text": "Hey guys, I've been assigned to work in a transceiver project and by the calculations we should've 1.3W in the output of the PA, but the previous test showed that we get only 0.6W.\n\n As I was reading the datasheet and the S11 seemed a little bit high. That's why I am trying to figure out what I should look for in a S11 of a PA, should it be high, low, if it's high what doest that mean, if it is low what does it mean, etc.\n\n A little note: I started my first RF intership this week, so that's why I don't know much about S11 (should be having classes about the suject next semester).",
        "created_utc": 1526496582,
        "upvote_ratio": ""
    },
    {
        "title": "Total EE noob. How do I set these fan connectors/terminals/headers up?",
        "author": "Aeonbreak",
        "url": "https://www.reddit.com/r/ECE/comments/8jx0rf/total_ee_noob_how_do_i_set_these_fan/",
        "text": "This is the first time I'm attempting something like this. I have a small server fan with wire ending that I need to hook up to the main board.\nI will buy a connector head (CONN HEADER PH TOP 2POS 2MM), a connector housing (CONN HOUSING PH 2POS 2MM WHITE) and the connector terminal (CONN TERMINAL 28-24AWG TIN).\n\nDo I need a special tool to crimp the wires to the terminal? Or that should be enough?\n\nSorry if this is wrong in any way.",
        "created_utc": 1526493405,
        "upvote_ratio": ""
    },
    {
        "title": "Drone stringing transmission lines",
        "author": "_PharmStudent",
        "url": "https://i.imgur.com/ZXtcxPS.gifv",
        "text": "",
        "created_utc": 1526489170,
        "upvote_ratio": ""
    },
    {
        "title": "Review of the Keysight DSO1102G relative to the Tektronix TBS 1202B-EDU",
        "author": "KasLew-2",
        "url": "https://kasembeddedprojects.blogspot.ca/2018/05/review-of-keysight-dso1102g-relative-to.html?utm_source=Reddit&amp;utm_medium=Link&amp;utm_term=ECE&amp;utm_campaign=Review",
        "text": "",
        "created_utc": 1526476526,
        "upvote_ratio": ""
    },
    {
        "title": "DIY Tiny 9V to 12v StepUp Converter (Question)",
        "author": "tom1tom11",
        "url": "https://www.reddit.com/r/ECE/comments/8jtcl3/diy_tiny_9v_to_12v_stepup_converter_question/",
        "text": "Hey guys,\n\ni found a great solution for my upcoming project.\n\nPolulu made a very tiny stepUp converter \\([https://www.pololu.com/product/2117/](https://www.pololu.com/product/2117/specs)\\) , but i want to include this on to my own PCB layout.\n\nHow did they made it? Which components did they used for?\n\nI would setup a 9V block battery and need a generated voltage of 12V. The max output power will be lower than 1A.\n\nPerhaps someone can help me to find the right parts or do a circuit?",
        "created_utc": 1526459823,
        "upvote_ratio": ""
    },
    {
        "title": "I built a Hardware Sega Genesis Video Game Music Player using real sound chips (FM Synth)",
        "author": "AidanHockey5",
        "url": "https://www.youtube.com/watch?v=WoAp2-gWaLM",
        "text": "",
        "created_utc": 1526438878,
        "upvote_ratio": ""
    },
    {
        "title": "PCB enclosure design questions",
        "author": "marscham",
        "url": "https://www.reddit.com/r/ECE/comments/8jrd37/pcb_enclosure_design_questions/",
        "text": "Hey everyone,\n\nI am working on a pcb enclosure design tool that would hopefully speed up the design of custom cases and enclosures for circuit boards/prototypes. The project isn’t yet ready to show off, but I am interested in talking to anyone who has experience with getting custom enclosures designed to see what would be most useful. So here are some questions I had for anyone interested in answering:\n\n- Have you designed or needed a custom case/enclosure designed in the past?\n- Was the enclosure custom or off the shelf? What kind did you end up going with? (extruded aluminum, hammond box, 3D-printed, laser-cut, injection molded, Altoids tin, etc.)\n- What components went into the enclosure? (single board, fan, panel mount buttons, etc.)\n- How long did it take to get the enclosure designed?\n- When in your project did you get the enclosure design done? (beginning of pcb design, concurrent with the pcb design, or afterwards)\n- How long for manufacturing?\n- What was the quantity you needed?\n- Any other thoughts on pcb enclosures and the process of getting them made?\n\nAny responses are appreciated, and feel free to message me if you are interested in becoming an alpha user in the near future.\n",
        "created_utc": 1526436879,
        "upvote_ratio": ""
    },
    {
        "title": "I'm taking EGN3211 - Engineering Analysis and Computation over 12 weeks this summer, what are the best video series online to learn C with no background in programming?",
        "author": "Babies4Dinner",
        "url": "https://www.reddit.com/r/ECE/comments/8jradv/im_taking_egn3211_engineering_analysis_and/",
        "text": "Title says it all. I'm an upcoming third year EE student taking this class and EEE3342 this summer. I have no experience programming, but would like to end the summer with an A and a foundation to get to C\\+\\+ by my senior year. I appreciate any help or advice ",
        "created_utc": 1526436216,
        "upvote_ratio": ""
    },
    {
        "title": "Difference between bit specific address and bit banded address",
        "author": "mixedberryshake",
        "url": "https://www.reddit.com/r/ECE/comments/8jqhu3/difference_between_bit_specific_address_and_bit/",
        "text": "Any help is much appreciated. Thanks!\n\n",
        "created_utc": 1526429455,
        "upvote_ratio": ""
    },
    {
        "title": "Question about Quadrature-PLL method for phase noise measurement: Specifically, what should I design the loop bandwidth to be?",
        "author": "NiCagesGapingAsshole",
        "url": "https://www.reddit.com/r/ECE/comments/8jpd6e/question_about_quadraturepll_method_for_phase/",
        "text": "Hi all,\n\nI've got a 10MHz signal source (PLL locked to 10Mhz crystal oscillator), and I'm trying to characterize the phase noise from offset frequencies of 1 or 10Hz to a few MHz (if that's even possible with a 10MHz source?)\n\nSome links to the measurement method are found below:\n\nhttps://www.keysight.com/upload/cmc_upload/All/PhaseNoise_webcast19Jul12.pdf\n\nhttp://www.repeater-builder.com/tech-info/pdfs/phase-noise-measurement.pdf\n\nMy question is this:\nWhat kind loop bandwidth should I design my external PLL for? From my research, I'm seeing that it should be lower than the lowest measurement offset frequency of interest, but this seems a little counterinuitive to me.\n\nDoesn't the PLL track the input reference phase (which would be my signal under test here) within the loop bandwidth and the VCO phase outside the loop bandwidth?\n\nAny help would be appreciated. Thanks!/\n\n",
        "created_utc": 1526419822,
        "upvote_ratio": ""
    },
    {
        "title": "Sampling .wav audio samples - Important considerations for sampling",
        "author": "jaffaKnx",
        "url": "https://www.reddit.com/r/ECE/comments/8jnkod/sampling_wav_audio_samples_important/",
        "text": "I have an audio file in .wav format, which I want to sample, pass the samples through a DAC \\(4821\\) and speaker. I am using arduino uno as a control unit, but I need some guidance as to how big/small the .wav file should be, as well as its sampling/bit rate without losing much of its precision when passed through a DAC. What are the main considerations when it comes to sampling? I know Nyquist states sampling should be done at twice the frequency of the sample. Does that mean I should be sampling at 88200 KHz?\n\nFollowing are the specs of the file:\n\n\\- 8.7 MB large\n\n\\-  Bit rate = 1411200 b/s\n\n\\- Sample rate =  44100\n\n\\- Bits/sample = 16",
        "created_utc": 1526406462,
        "upvote_ratio": ""
    },
    {
        "title": "Where to source USB Optical mouse ICs?",
        "author": "Allenmarshall1942",
        "url": "https://www.reddit.com/r/ECE/comments/8jn2im/where_to_source_usb_optical_mouse_ics/",
        "text": "I’ve been using ICs like the ADNS 2600 and 5000 for motion tracking and I now need a better place than eBay or AliExpress to source them since I wish to use them outside hobby use. \n\nDoes anyone know a legit place to get those ICs or similar? Haven’t been able to find something like them on DigiKey or Mouser. \n\nThanks! ",
        "created_utc": 1526402746,
        "upvote_ratio": ""
    },
    {
        "title": "Tying together system design data",
        "author": "RTA5",
        "url": "https://www.reddit.com/r/ECE/comments/8jl1d9/tying_together_system_design_data/",
        "text": "Hello everyone,\n\nI've been working on a tester specification and have increasingly been frustrated by the various files that I have to tie together to make a tester work.  I have to consider the schematic (net names, general functionality), worst case analysis (for nominal values and thresholds), hardware-software interface specification (software scaling), and a message format definition that defines the communication to the module.  All these files end up being dozens of spreadsheets, Altium files, and PDFs.\n\nDoes anyone know of a good system for tying together all of this design data?  I'm getting a little burned out on lookup tables and searching through tons of spreadsheets.\n\nThanks!",
        "created_utc": 1526385971,
        "upvote_ratio": ""
    },
    {
        "title": "FPGA question: outputting signal at falling edge?",
        "author": "slothpoked",
        "url": "https://www.reddit.com/r/ECE/comments/8jiq44/fpga_question_outputting_signal_at_falling_edge/",
        "text": "Why isn't it a common practice to produce an output for a module at falling_edge? Seems like it would make the receiver of this signal detect it at the next rising_edge, as oppose of suffering a cycle of delay. But the only thing that sort of uses this is DDR registers. Why is this so?\n",
        "created_utc": 1526357325,
        "upvote_ratio": ""
    },
    {
        "title": "Used the Buzzer Oscillator to Make a VLF/IB Metal Detector",
        "author": "doatho",
        "url": "http://youtu.be/9JMTUZMxHV0",
        "text": "",
        "created_utc": 1526340241,
        "upvote_ratio": ""
    },
    {
        "title": "I have to learn Microsoft Project 2016 in a week. Any tips?",
        "author": "SaysSimmon",
        "url": "https://www.reddit.com/r/ECE/comments/8jgbr7/i_have_to_learn_microsoft_project_2016_in_a_week/",
        "text": "So I got a response back from my co-op and they say I should also learn Microsoft Project 2016 by next week. I've never used it, but for those who have, what is a good resource to learn it?",
        "created_utc": 1526335480,
        "upvote_ratio": ""
    },
    {
        "title": "Check Out These Awesome Prototyping Boards",
        "author": "almn22",
        "url": "http://evolvedpcb.com/announcement",
        "text": "",
        "created_utc": 1526332627,
        "upvote_ratio": ""
    },
    {
        "title": "What is Electronics",
        "author": "chtef",
        "url": "https://www.embeddedrelated.com/showarticle/1165/what-is-electronics",
        "text": "",
        "created_utc": 1526324830,
        "upvote_ratio": ""
    },
    {
        "title": "I have 30 days till my Electronics II exam.It's my only exam that is left.I have very little knowledge regarding advanced electronic topics.Where do I start?",
        "author": "IamATechieNerd",
        "url": "https://www.reddit.com/r/ECE/comments/8jckj5/i_have_30_days_till_my_electronics_ii_examits_my/",
        "text": "So,I flunked my regular ENGG exam and I am taking it again.The topics include Diodes,BJT,MOSFET,JFET,amplifiers,Power Amplifiers and Op Amplifiers.I want to secure A on this exam.I know I can with full dedication.I am ready to give my everything to it.But I have no clue where to start.I didn't copy notes in lectures(something which I obviously regret).I know some basics like PN junction,what diodes are and stuffs.But from transistors I suck.\n\nNumericals are my weaknesses too.I can't figure out whole deal about currents and biasing.\n\nSo dear ECE professionals and fellow students,with all due respect,please recommend me something to get me going.It would really mean a lot.\n\nThanks :)",
        "created_utc": 1526307270,
        "upvote_ratio": ""
    },
    {
        "title": "Inspiring / interesting electronics videos",
        "author": "Legandosio",
        "url": "https://www.reddit.com/r/ECE/comments/8jc2m9/inspiring_interesting_electronics_videos/",
        "text": "Hi. I am a lecturer at University level, and I teach an Introduction to Electronics course. My subject is not in the major of the engineering students that I teach, but they must take it to broaden their background in electronics. We cover basic semiconductor electronics (diodes and BJTs) and op-amps. \n\nI try to make my classes as entertaining as possible so as to inspire them to see the value and enjoy the course although it is not necessarily their main interest. To do this, I usually show an electronics video halfway through the 50 min class. The content of the video is not tested in the exams, but merely a fun break. \n\nCould you comment a fun, entertaining and educative videos that could fall in this category? Preferably around 2-5 mins with a youtube / vimeo link? I will post a few that I found to get the the ball rolling :)\n\nHope you will enjoy these videos as much I am sure I will :)",
        "created_utc": 1526303177,
        "upvote_ratio": ""
    },
    {
        "title": "Worth double majoring in EE and CpE?",
        "author": "itanitarek10",
        "url": "https://www.reddit.com/r/ECE/comments/8j9z6s/worth_double_majoring_in_ee_and_cpe/",
        "text": "At my school EE and CpE are so closely related it's possible to get a degree in both without taking many more classes. Would it be worth the extra time (and I guess money) to get 2 bachelor's degrees that are closely related? Would it make me standout in a good way when it comes to job hunting?\n\nThanks",
        "created_utc": 1526276477,
        "upvote_ratio": ""
    },
    {
        "title": "Whats the logic behind RMS",
        "author": "mrgoldtech",
        "url": "https://www.reddit.com/r/ECE/comments/8j9wos/whats_the_logic_behind_rms/",
        "text": "I'm a high schooler who's wondering why we use RMS and not the average absolute value of a function when converting AC voltage into a DC equivalent. Average absolute value seems completely intuitive, but I don't fully understand why we don't use it. The obvious answer is that we can physically observe that a RMS AC is the best way to draw a relationship between AC and DC - but why? Is RMS only an approximation, or is it an explicit relationship that appears naturally between AC and DC. ",
        "created_utc": 1526275562,
        "upvote_ratio": ""
    },
    {
        "title": "Hands-on courses on embedded systems",
        "author": "jaffaKnx",
        "url": "https://www.reddit.com/r/ECE/comments/8j500n/handson_courses_on_embedded_systems/",
        "text": "Are there free (or fairly cheap yet worth it) courses on hands-on embedded systems (be it on STM32 cortex M4 boards, or arduino) that you would recommend? Need to undertake some interesting projects over the summer.\n\nBy far, I have found [Hands-on Embedded Systems](https://www.udemy.com/armcortex-adc/) and [Mastering Microcontroller with Embedded Driver Development](https://www.udemy.com/mastering-microcontroller-with-peripheral-driver-development/) to be my top choices. If you were to choose one of them, which one would you considering industry standards?",
        "created_utc": 1526229248,
        "upvote_ratio": ""
    },
    {
        "title": "Communication standards from 800MHz to 2.4GHz",
        "author": "Theis159",
        "url": "https://www.reddit.com/r/ECE/comments/8j3dry/communication_standards_from_800mhz_to_24ghz/",
        "text": "Hello, I'm currently working on a wideband receiver project and I was asked to bring up some of the communication's standards that we can find between 800MHz and 2.4GHz aswell as their's constraints, such as NF, minimum required gain from the front-end, BB frequencies (to project the mixer), etc. \n\nAnyone has a suggestion of an reference site/book/artcile where I could search this kinda of informations?",
        "created_utc": 1526213664,
        "upvote_ratio": ""
    },
    {
        "title": "Phase shift of compensated op-amp",
        "author": "lewson",
        "url": "https://www.reddit.com/r/ECE/comments/8j372d/phase_shift_of_compensated_opamp/",
        "text": "I have been struggling with this problem for a little while now and I would like some tips to guide me in the right direction. \n\nI am given a phase shift oscillator circuit that consists of an ideal inverting op-amp and an RC phase shift network. I can calculate the frequency of oscillation using the formula:\n\nfo=1/2*pi*RC*sqrt(6)\n\nThe question asks me to explain why the simulated circuit oscillates at a lower frequency when the ideal op-amp is replaced with a real model.\n\nWith the supporting material, I have the gain and phase response of the op-amp used.\n\nCurrently I understand the barkenhousen stability criterion. As this circuit is oscillating it must have an overall phase shift of 360 degrees. Of which 180 degrees is provided by the phase shift network and the other 180 provided by the op-amp. \n\nWhen the op-amp is replaced with a real model, the internal compensation of the op-amp creates additional phase shift within the op-amp. For oscillation to be continued the system will have to reduce frequency till the \"sweet spot\" is met.\n\nI am looking for a method of using the gain and phase response graph provided to calculate the additional phase shift in the compensated op-amp at the frequency of oscillation. \n\nAny support is greatly appreciated.\n",
        "created_utc": 1526210993,
        "upvote_ratio": ""
    },
    {
        "title": "Sophia :The humanoid robot",
        "author": "electronicsinside",
        "url": "https://youtu.be/RaziLZcrFS0",
        "text": "",
        "created_utc": 1526193794,
        "upvote_ratio": ""
    },
    {
        "title": "Help with a MOSFET problem? Details in comments.",
        "author": "[deleted]",
        "url": "https://i.redd.it/pum7zsdt6kx01.jpg",
        "text": "[deleted]",
        "created_utc": 1526189317,
        "upvote_ratio": ""
    },
    {
        "title": "When data storage started to be a need, were movie film rolls / spools ever used or considered for mass write-once storage, despite fundamental problems / downsides compared to magnetic tape?",
        "author": "herkato5",
        "url": "https://www.reddit.com/r/ECE/comments/8j0tjb/when_data_storage_started_to_be_a_need_were_movie/",
        "text": "\n\nIf every dot in a black and white movie film encodes a bit, one film roll can store gigabytes of data. It would be like cd-r or dvd+r in a spool of tape.\n\nNo need to have film frames, just a continuous tape that smoothly goes past a row of light emitters and then a row of sensors. The sensor row has to be 2 or 4 times denser than the light emitter row, to compensate for bad alignment.\n\nMagnetic tape can be written over and re-used and is much easier, but it degrades faster than film. It is well known that magnetic tape was used and ( less known that ) is still used for data storage ( LTO Ultrium tape ). Data storage film can have simpler chemistry than movie film.\n\nIf the tape is 16mm wide, there are 16000 microns / micrometers / µm on a row. Blu-ray has half micron dots. That is about the wavelength of light.\n\nSound of sound movies were stored optically in analog form on the side of the film. That is where the word \"soundtrack\" comes from.",
        "created_utc": 1526177359,
        "upvote_ratio": ""
    },
    {
        "title": "ASIMO ROBOT BY HONDA 2017",
        "author": "electronicsinside",
        "url": "https://youtu.be/IV0uJih6jBg",
        "text": "",
        "created_utc": 1526151657,
        "upvote_ratio": ""
    },
    {
        "title": "HDL VS PROGRAMMING LANGUAGES",
        "author": "rmustafacam",
        "url": "https://www.reddit.com/r/ECE/comments/8iy2k5/hdl_vs_programming_languages/",
        "text": "Hi everybody. I am a 3rd year electrical and electronics engineering student. I have a very hardacky confusing about the difference between HDL and PROGRAMMING LANGUAGES. I don't know the reason of using HDL. Actually I can say I don't understand it. I can program logical expressions in C or Java or other prg. LANGUAGES. Why on the earth do I need HDL. Please explain without confusing me more. Thanks.",
        "created_utc": 1526151028,
        "upvote_ratio": ""
    },
    {
        "title": "Here is a list of Best ECE books suggested by world-renowned ECE Professors from MIT, Stanford, Berekeley and more",
        "author": "TJ1",
        "url": "https://www.reddit.com/r/ECE/comments/8iwu6n/here_is_a_list_of_best_ece_books_suggested_by/",
        "text": "I think these are **very well known** **ECE professors**: [**http://www.doradolist.com/experts.html**](http://www.doradolist.com/experts.html) who have suggested best books in their field of expertise.\n\nPlease let me and others know who else is among top ECE professors.",
        "created_utc": 1526139929,
        "upvote_ratio": ""
    },
    {
        "title": "PIR SENSOR TUTORIAL - WITH OR WITHOUT ARDUINO",
        "author": "TheBlackDon",
        "url": "https://diyfactory007.blogspot.com.au/2018/04/pir-sensor-tutorial-with-or-without.html",
        "text": "",
        "created_utc": 1526111384,
        "upvote_ratio": ""
    },
    {
        "title": "DRIVING A RELAY WITH AN ARDUINO",
        "author": "TheBlackDon",
        "url": "https://diyfactory007.blogspot.com.au/2018/04/driving-relay-with-arduino.html",
        "text": "",
        "created_utc": 1526110787,
        "upvote_ratio": ""
    },
    {
        "title": "DIY - ARDUINO BASED CAR PARKING ASSISTANT",
        "author": "TheBlackDon",
        "url": "https://diyfactory007.blogspot.com.au/2018/04/diy-arduino-based-car-parking-assistant.html",
        "text": "",
        "created_utc": 1526109266,
        "upvote_ratio": ""
    },
    {
        "title": "DIY - SOLAR BATTERY CHARGER",
        "author": "TheBlackDon",
        "url": "https://diyfactory007.blogspot.com.au/2018/04/diy-solar-battery-charger-hi-everyone-i.html",
        "text": "",
        "created_utc": 1526108369,
        "upvote_ratio": ""
    },
    {
        "title": "Using an LDR Sensor with Arduino",
        "author": "TheBlackDon",
        "url": "https://diyfactory007.blogspot.com.au/2018/04/using-ldr-sensor-with-arduino.html",
        "text": "",
        "created_utc": 1526107764,
        "upvote_ratio": ""
    },
    {
        "title": "Circuits, really?",
        "author": "dualityofexistence",
        "url": "https://medium.com/@entopreston/faking-passion-or-hyperinflated-self-expectations-cb374c8cf201",
        "text": "",
        "created_utc": 1526095127,
        "upvote_ratio": ""
    },
    {
        "title": "Control Systems Senior Design Project Question",
        "author": "Drum1997",
        "url": "https://www.reddit.com/r/ECE/comments/8ison4/control_systems_senior_design_project_question/",
        "text": "Hi all - \nLooking for some help from people familiar with control systems. I want to do a senior project related to control systems but I am having trouble coming up with a proposal. I have access to an array of PLC controllers, generators, variable frequency drivers, and other components that make up a small scale model of a control system for a power generation station - previously used for deployment of typical cyberattacks and detailed monitoring of system operations. What can I do with this equipment? Any ideas?\n\nEdit: I also have software to program the PLCs, RSLogix to be exact.\n\nThanks for the help. ",
        "created_utc": 1526086727,
        "upvote_ratio": ""
    },
    {
        "title": "Graduating soon-ish and am dissatisfied with industry/want something more for myself",
        "author": "GhostMan240",
        "url": "https://www.reddit.com/r/ECE/comments/8is7hg/graduating_soonish_and_am_dissatisfied_with/",
        "text": "Hi r/ece,\n\nI'm a junior ece major and just finished my first co-op rotation. I learned a lot about working in a real office environment, dealing with co-workers, and meeting deadlines. However the experience has left me somewhat feeling somewhat empty. Like I did all this work to get into an engineering program, then grind through these college classes, and this is it... somewhat anti-climactic.\n\n Perhaps it is because I did not enjoy the internship as much as I would have liked. I wanted to do embedded systems/firmware development but ended up working in the testing department where on a good day I am updating firmware test scripts or soldering components that broke off old circuit boards back on, and bad days I am performing maintenance on old PCs or organizing materials. Definitely not ideal, but I am hoping a lot of it is just because I was a new intern. \n\nDespite this, I wonder even if I got my \"dream job\" I think that I would still want to learn and grow and advance in the field, and I worry that will not happen. I see some guys who have worked in this department in the same role for decades and think how unsatisfied that would make me. \n\nI'm now considering going to grad school and getting a PhD. I really enjoy learning new things in the field and working on personal projects, but the thought of going through all that school and work and being broke does not interest me much. However I figure if it means I can get a job where I will feel like my work is important it may be worth it? I am honestly feeling somewhat lost and could use some advice.  ",
        "created_utc": 1526081719,
        "upvote_ratio": ""
    },
    {
        "title": "Future of the VLSI market",
        "author": "arkoala",
        "url": "https://www.reddit.com/r/ECE/comments/8irsby/future_of_the_vlsi_market/",
        "text": "Unfortunately, it seems like the market has consolidated a lot - manufacturing has become so expensive that only the big fish can afford it. I find it unfortunate that VLSI startups are no longer viable, and if you want to do VLSI you are stuck with huge corporations.\n\nNot only that, but computers are getting so good that ASICs will essentially no longer be needed.\n\nOn the other hand, if Moore's law is at its last days, could it mean that manufacturing will eventually become cheaper?\n\nJust interested in your thoughts - obviously none of us can tell the future but speculation is fun :)",
        "created_utc": 1526077639,
        "upvote_ratio": ""
    },
    {
        "title": "Replaced batteries in an industrial vehicle remote, now it overcharges?",
        "author": "bbbbbenji",
        "url": "https://www.reddit.com/r/ECE/comments/8iq8qz/replaced_batteries_in_an_industrial_vehicle/",
        "text": "I came across an industrial remote for a large vehicle (tree cutter). The batteries where almost at their end of life. So I purchased replacement cells and swapped them out. However, now the device overcharges. It does not see that the cells are taking a charge, in fact, it thinks they are flat. The battery pack uses a `ds2436` which I swapped from the old pack. Unfortunately, I did disconnect the `ds2436` from the power source during the swap so maybe something is up with its memory now?\n\nI have read the [datasheet](https://pdfserv.maximintegrated.com/en/ds/DS2436.pdf) for the `ds2436`, and do not see any features that could be causing this. Although theoretically, it appears that it's possible, using one of the memory banks.\n\nI understand the manufacturer probably doesn't want people replacing batteries themselves, in favor of servicing the equipment at an official service center. So perhaps this has something to do with it.\n\nDoes anyone know what I can take a look at to get this working again?",
        "created_utc": 1526065006,
        "upvote_ratio": ""
    },
    {
        "title": "How To Become A PLC Programmer",
        "author": "PLCGurusNET",
        "url": "https://plcgurus.net/how-to-become-a-plc-programmer/",
        "text": "",
        "created_utc": 1526063171,
        "upvote_ratio": ""
    },
    {
        "title": "Running 1200 Amps through a 300 A motor...",
        "author": "Keysight_DanielB",
        "url": "https://youtu.be/Wc4g_f0YeI8",
        "text": "",
        "created_utc": 1526061398,
        "upvote_ratio": ""
    },
    {
        "title": "Awesome Boston Dynamics Robots",
        "author": "electronicsinside",
        "url": "https://youtu.be/GMdn5cQ3_lc",
        "text": "",
        "created_utc": 1526057310,
        "upvote_ratio": ""
    },
    {
        "title": "Series / Parallel Load Connections",
        "author": "SirBobIsTaken",
        "url": "https://www.reddit.com/r/ECE/comments/8ip5gd/series_parallel_load_connections/",
        "text": "I'm working on a beamformer design for audio frequencies. I have a bunch of 2W 4Ohm miniature speakers. I'm wiring them all up together into a speaker array which will be driven by an audio amplifier which is designed to output up to \\~3W at 8Ohm. I plan on doing a series/parallel connection of the 4Ohm speakers in order to get 8Ohms total impedance. I know that the speakers will have some variation in their actual impedance and so I'm wondering what is the best way to wire them up.\n\nI would like to have at least 8 speakers wired together and the power delivered to each speaker should be as close to the same as possible. Also, the phase needs to be the same. I seem to have the following options to get 8Ohms with 8 speakers:\n\n1. 4 series connections of 2 parallel speakers \\- \\(4||4\\) \\+ \\(4||4\\) \\+ \\(4||4\\) \\+ \\(4||4\\)\n2. 2 series connections of \\(2 parallel connections of 2 speakers in series\\) \\- \\(\\(4\\+4\\) || \\(4\\+4\\)\\) \\+ \\( \\(4\\+4\\)||\\(4\\+4\\)\\)\n3. 2 parallel connections of 4 speakers in series.\\- \\(4\\+4\\+4\\+4\\) || \\(4\\+4\\+4\\+4\\)\n\nIs there any reason why one of these configurations would be better than the others for this application? Also, is there any way to get 8Ohms w/ equal power for say 12 or 16 speakers?\n\nThanks!",
        "created_utc": 1526056594,
        "upvote_ratio": ""
    },
    {
        "title": "Help with Electrical Engineering Appeal Application",
        "author": "onesparkyboiiii",
        "url": "https://www.reddit.com/r/ECE/comments/8imack/help_with_electrical_engineering_appeal/",
        "text": "Hi all\n\nMade reddit to post this and hope I can get some help here.\n\nI applied for a Bachelor's in Engineering program in Electrical Engineering at my state university and was rejected.\n\nHowever, I did reach out to the enrolment services and they said they would be willing to give me a 2nd chance and requested I write a 500 word essay as to why I would be a good fit for the Electrical Engineering program.\n\nI have always had a passion for technology, especially hardware design, but other than that, I do not have much to describe why I would be a good fit. This is very cliche as well and I do want something that stands out and is unique. How can I talk about this passion and what else would be something they would want to hear that would help my application?\n\nBTW I have not done any personal projects myself or in high school as my school did not offer any classes related to Electrical Engineering or even tech really.\n\nTHANKS! :\\)",
        "created_utc": 1526028949,
        "upvote_ratio": ""
    },
    {
        "title": "BJT Pre Amplifier Circuit",
        "author": "Green__Panda",
        "url": "https://www.reddit.com/r/ECE/comments/8ilwwy/bjt_pre_amplifier_circuit/",
        "text": "We're running out of ways on getting the relationship of Ib2 in terms of Ib1 in this amplifier circuit. For us to solve the voltage gain, their relationship is needed. We've been deriving equations but we really can't get the exact relationship between the two. This is our major course output and this is due next week. Can you help us through? Any suggestions will be very much appreciated. Thank you. \n\nhttps://i.redd.it/b8jex21wg6x01.png",
        "created_utc": 1526023324,
        "upvote_ratio": ""
    },
    {
        "title": "AC Analysis of an Amplifier",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/8ikqn6/ac_analysis_of_an_amplifier/",
        "text": "[deleted]",
        "created_utc": 1526009092,
        "upvote_ratio": ""
    },
    {
        "title": "FET width's effect on LNA?",
        "author": "kolorlessk",
        "url": "https://www.reddit.com/r/ECE/comments/8ijyzh/fet_widths_effect_on_lna/",
        "text": "I've read a couple of papers talking about FET characteristics and their implications for low noise amplifiers. The papers talked about how increasing the width of the FET gate increases the transconductance, but how does that correlate to LNA performance?",
        "created_utc": 1526001419,
        "upvote_ratio": ""
    },
    {
        "title": "I soldered some legs to a capacitor. Will it still function properly?",
        "author": "JoseCFM",
        "url": "https://i.redd.it/24fr69gsj4x01.jpg",
        "text": "",
        "created_utc": 1525999946,
        "upvote_ratio": ""
    },
    {
        "title": "Low frequency voltage-controlled sine wave oscillator?",
        "author": "RFrobisher",
        "url": "https://www.reddit.com/r/ECE/comments/8ihlph/low_frequency_voltagecontrolled_sine_wave/",
        "text": "I'm looking for the above for a volume envelope curve for an analog synthesizer I'm working on. Any suggestions?",
        "created_utc": 1525980962,
        "upvote_ratio": ""
    },
    {
        "title": "Do software developers make money in this scenario?",
        "author": "NathanSuperStar",
        "url": "https://www.reddit.com/r/ECE/comments/8ifh6b/do_software_developers_make_money_in_this_scenario/",
        "text": "Lets say I made a drone. Now I want to sell it to my friendly neighbor. I get $100. \n\n  It doesn't feel right to sell my drone because the project is using Iibraries made by others.  I feel like an ass if I ripped money from a software developer.\n\nIt's like whoever makes the hardware is the one who gains the money for the hardware and the software ( but they didn't make the software).  I don't know about Atmel studio 7, but I learned embedded systems through Arduino.\n\nLet's say a software developer created multiple libraries(in Arduino, libraries are open-source so everyone one can access it for free), and wondered if anyone was using their library and making money off of it.  In that case, where's does that software developer get his paycheck?\n ",
        "created_utc": 1525963985,
        "upvote_ratio": ""
    },
    {
        "title": "HC-05 with STM32F10x",
        "author": "iWishForMoreTea",
        "url": "https://www.reddit.com/r/ECE/comments/8ie5z1/hc05_with_stm32f10x/",
        "text": "Hi,\n\nI want to transmit data from my android to the micro-controller, But I have trouble setting it up. What I am doing now is, I set up UART type communication via HAL libraries for the STM32, then I connect the HC-05 module to the UART RX and TX pins of the micro-controller. \n\nWhen trying to connect the android phone via a bluetooth serial application, it returns \"read failed, socket might be closed or timeout\". I think that makes sense as I don't configure the module itself in the code, but then I don't really know how to. \n\nIf anyone has done this before, I could you some help. If not, a starting place would be nice.\n\nThanks!  ",
        "created_utc": 1525951835,
        "upvote_ratio": ""
    },
    {
        "title": "IOT Project Ideas",
        "author": "Bombad2",
        "url": "https://www.reddit.com/r/ECE/comments/8ib9je/iot_project_ideas/",
        "text": "I’m a junior studying ECE and would like to hear any ideas on projects that any of you have done that can help solidify any knowledge of internet of things related material. I know how to code in C, have experience with RPis, and basic knowledge of arduino systems. ",
        "created_utc": 1525915984,
        "upvote_ratio": ""
    },
    {
        "title": "DAC 4821 - seems to be getting wrong analog output and help with code",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/8iakz1/dac_4821_seems_to_be_getting_wrong_analog_output/",
        "text": "[deleted]",
        "created_utc": 1525909609,
        "upvote_ratio": ""
    },
    {
        "title": "Help solving for output impedance of a bjt pre-amp",
        "author": "luigiiiiiv",
        "url": "https://www.reddit.com/r/ECE/comments/8i8n5h/help_solving_for_output_impedance_of_a_bjt_preamp/",
        "text": "This is an AC equivalent circuit of a pre-amplifier. I already derived the formula for input impedance (Zi) but I'm having trouble getting the formula for output impedance (Zo). I can't find a way to incorporate R3 into the formula. Also how do I derive the formula for Vi and Vo? I am really desperate. Please help me! https://i.stack.imgur.com/KKi85.png",
        "created_utc": 1525893486,
        "upvote_ratio": ""
    },
    {
        "title": "How do ASIC's work?",
        "author": "eddless321",
        "url": "https://www.reddit.com/r/ECE/comments/8i89as/how_do_asics_work/",
        "text": "First year EE student here, will be taking circuit analysis 1 next semester \\(first EE course at my college\\). What classes are required to understand \\(and potentially create\\) ASIC's? Microprocessors? Electronics? Computer Architecture? VLSI design? Digital Logic Design?",
        "created_utc": 1525890512,
        "upvote_ratio": ""
    },
    {
        "title": "What tools do you use for USB?",
        "author": "Tripger",
        "url": "https://www.reddit.com/r/ECE/comments/8i7ssr/what_tools_do_you_use_for_usb/",
        "text": "Currently I keep end up working with USB and am really short on good tools. Mostly need good software for verification of my USB devices, and to a certain extent reverse engineering other's devices in order to make drivers to use them. I've previously used USBPCAP through wireshark to read through things, but was hoping there was something more like the hclient example code from the windows driver kit. It provides feature desciptor get/set feature report etc. I just really feel like something has to be out there that does all this but doesnt require me to set up Visual Studio just to build an example program. Also any devices/ software/ methodologies that you guys use or have found useful for USB development would be greatly helpful. And for USB development I truly mean that in the broadest sense, CDC, audio, HID, USB-C, power delivery, USB_OTG, Battery Charging, Accessory Charge Adapter,  etc.",
        "created_utc": 1525886991,
        "upvote_ratio": ""
    },
    {
        "title": "STM32 interrupt not triggering unless it is running in the debugger (IAR i-jet)",
        "author": "deanel",
        "url": "https://www.reddit.com/r/ECE/comments/8i5jt6/stm32_interrupt_not_triggering_unless_it_is/",
        "text": "Hi /r/ece!\n\nI'm having a problem that I think is known as a \"Heisenbug\". Everytime I run my code in debug mode the interrupt fires correctly but when I test it without the debugger the code never enters the ISR. The reason I know the interrupt isn't firing is because I have a couple lines of code that toggles an unused pin (HAL_GPIO_WritePin...) that I capture on my scope so to see what parts of my code are being executed. I can see the toggle happening everywhere except in the interrupt handler. It is a multi threaded system (freeRTOS) with one of my threads only executing when it is instructed to from the ISR callback function using vTaskNotifyGiveFromISR(). \n\nThis is how I have my ISR implemented:\n\n    void EXTI15_10_IRQHandler(void)\n    {\n        if (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_11)!=0)\n        {\n          HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_11);\n        }\n        if (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_12)!=0)\n        {\n          HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_12);\n        }\n    }\n\n\nWhen I was debugging the issue I put my pin toggling code right at the beginning of the EXTI15_10_IRQHandler and the pin never toggled, which is how I found the issue.  Does anybody have an idea on how I can start figuring out this problem? What could the debugger be doing to make the interrupt fire that I don't have implemented? Are there any general \"rule of thumbs\" for handling an interrupt on the STM32 that I could be missing? Thanks in advance.",
        "created_utc": 1525868766,
        "upvote_ratio": ""
    },
    {
        "title": "Hardware Test Engineering Interview",
        "author": "allwa12345",
        "url": "https://www.reddit.com/r/ECE/comments/8i3bu2/hardware_test_engineering_interview/",
        "text": "Hey everyone, I have an interview coming up for a new grad hardware testing position in a week and was wondering if anyone had any tips on what things I should look into in regards to hardware testing and EE fundamentals. \n\nWhat testing qualifications would they (or you) be looking for or questions they may ask? bench tests, testing equipment, breakouts, etc.? Are there any good resources out there I could look into? I've had a few EE internships and one especially in testing. What are some testing techniques you've used or learned throughout your career?\n\nThanks.",
        "created_utc": 1525841286,
        "upvote_ratio": ""
    },
    {
        "title": "Calculation of output resistance",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/8i32sr/calculation_of_output_resistance/",
        "text": "[deleted]",
        "created_utc": 1525838501,
        "upvote_ratio": ""
    },
    {
        "title": "What programming language should I start learning this summer?",
        "author": "Andydovt",
        "url": "https://www.reddit.com/r/ECE/comments/8i0vqg/what_programming_language_should_i_start_learning/",
        "text": "I’m an ECE major, but I have no works or projects or skills that’s related to the field. I just finished my first year and got all the non major classes done. I’m planning to learn a programming language this summer to get a little head start. What should I start with? Or is there anything else I should start with? I’m definitely interested but I just need some guidance.",
        "created_utc": 1525818035,
        "upvote_ratio": ""
    },
    {
        "title": "I started my first job in Controls. What are the things I should know?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/8i0v6v/i_started_my_first_job_in_controls_what_are_the/",
        "text": "[deleted]",
        "created_utc": 1525817904,
        "upvote_ratio": ""
    },
    {
        "title": "I might be an Engineer but I can't Fix Stupid",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/8hzvt0/i_might_be_an_engineer_but_i_cant_fix_stupid/",
        "text": "[removed]",
        "created_utc": 1525810296,
        "upvote_ratio": ""
    },
    {
        "title": "Hobbyist here: I have a supercap bank and I'm wondering if this circuit looks right for both charging the bank and enabling an SCR trigger to dump current (also how to go about pulsing?)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/8hyhdc/hobbyist_here_i_have_a_supercap_bank_and_im/",
        "text": "[deleted]",
        "created_utc": 1525800056,
        "upvote_ratio": ""
    },
    {
        "title": "Analog IC Design Project Ideas",
        "author": "ignazwrobel",
        "url": "https://www.reddit.com/r/ECE/comments/8hy38f/analog_ic_design_project_ideas/",
        "text": "I am an EE student currently in the second year of my bachelor studies in Germany. I am taking a class this year where I am able to get some analog IC design experience. The great thing is that I can choose on my own which kind of circuit I want to design. Before making this decision, however, I would love to hear a few more ideas from experienced people. \n\nHere are some more infos:\n\n* All design and simulation will be done in Cadence Virtuoso\n* The project is only about schematic design and simulation, not about layouting\n* I will be doing this project together with a classmate and each of us will be able to put ~40 hours into this project\n* We both got less than 10 hours of experience with the Software\n* Completion of the project consists of a paper describing the design process (~12 pages) and a small presentation\n* Technology will be 90nm (gpdk090)\n\nHere are some ideas I already thought of:\n\n* Analog PID controller (not that much more effort in comparison to a basic OP, but somewhat more \"hands-on\" imo)\n* ADC/DAC\n* Buck- or Boost-converter\n\nDo you have any ideas that are doable by two undergraduates with limited experience and fit into the scope of the project?\nIf so, I would be glad to hear them. Thank you in advance!\n\nEDIT: Thank you for all of your comments, highly appreciated. After careful consideration I have decided to do an Opamp since it has a huge amount of applications and comes with a lot of things to learn. If there is still some time to spare at the end of the semester we might then build a regulator, amplifier or some kind of filter with it.",
        "created_utc": 1525797197,
        "upvote_ratio": ""
    },
    {
        "title": "Multisim Simulation: Degraded signal at sine wave generator output",
        "author": "OkDragonfruit5",
        "url": "https://www.reddit.com/r/ECE/comments/8hvy1d/multisim_simulation_degraded_signal_at_sine_wave/",
        "text": "I'm trying to put together a simple FM simulation (no need for real components) in NI Multisim [schematic](https://imgur.com/SLDma01). The output of the voltage controlled sine-wave generator seems to be affected by the triangle wave generated by the function generator when there is no obvious connection between the two. Any clues?",
        "created_utc": 1525779010,
        "upvote_ratio": ""
    },
    {
        "title": "Can you recreate a clean room like environment in a fume hood or small room?",
        "author": "Allenmarshall1942",
        "url": "https://www.reddit.com/r/ECE/comments/8hszdo/can_you_recreate_a_clean_room_like_environment_in/",
        "text": "I'm interested in doing some research in types of liquid particle counters for a project and need an environment to test them.\n\nI'd like to test liquid particle counters in the 100nm range. We have a small chemical lab, would there be a way to adequately test this? \n\nThank you. ",
        "created_utc": 1525744009,
        "upvote_ratio": ""
    },
    {
        "title": "Just made a parallel cap bank, curious about capacitor leakage (with data).",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/8hrt8p/just_made_a_parallel_cap_bank_curious_about/",
        "text": "[deleted]",
        "created_utc": 1525733837,
        "upvote_ratio": ""
    }
]