[
    {
        "title": "Hey do anyone one know any website, where I can learn Linux, embedded C and other things for free.",
        "author": "Mrs_Jackal",
        "url": "https://www.reddit.com/r/ECE/comments/777pq8/hey_do_anyone_one_know_any_website_where_i_can/",
        "text": "It’s a bit urgent for me to learn basics. I’m preparing for an interview. Please anyone help me. Thanks. ",
        "created_utc": 1508344015,
        "upvote_ratio": ""
    },
    {
        "title": "Cadence APS CPU usage",
        "author": "AllenDo",
        "url": "https://www.reddit.com/r/ECE/comments/774pm7/cadence_aps_cpu_usage/",
        "text": "Hi Friends,\n\nCan I please ask a question concerning simulation CPU cores usage. \n\nWhen I was using ADS on a Windows PC for simulation, the software will automatically use all the cores and the CPU usage is close to 95%. \n\nHowever, now I am using CADENCE IC 617 and MMSIM151 on a Linux machine with 10 cores CPU (20 threads). The simulation setup is like this:\n\nADE L --&gt; Setup --&gt; High-Performance Simulation Options. Then I click APS. choose Error Preset: DO not override; Use ++aps; Multi_Threading Manual #Threads: 20  (0-19)\n\n\n\nBut when I try to simulate, the CPU usage is about 40%. Though this is way better when I chose Spectre instead of APS to simulate(that's 5% CPU usage, due to only one thread is working.) \n\nCan anyone help me? How can I setup the software to use all the CPU power to speed up the simulation?\n\n\n\nThanks\n\nAllen.",
        "created_utc": 1508306488,
        "upvote_ratio": ""
    },
    {
        "title": "Hey guys, I made a video about helping people become Cost Estimators: \"Everything You Need to Know About Becoming a Cost Estimator\" -- Great for up and coming electrical/civil engineers who want to work in construction.",
        "author": "truthmarket",
        "url": "https://www.youtube.com/watch?v=ETay5fK1mV4&amp;t=1268s",
        "text": "",
        "created_utc": 1508296064,
        "upvote_ratio": ""
    },
    {
        "title": "Interview help for an internship",
        "author": "Persian_God",
        "url": "https://www.reddit.com/r/ECE/comments/772wvy/interview_help_for_an_internship/",
        "text": "Hello, I am a sophomore computer engineering major at a big state school. I went to my career fair about a month ago and I got one interview with a small software company based in my state. I recently heard back from them and I made it to second round interviews that will be conducted in about two weeks. I just wanted to know some good tips or what I should keep in mind during my second round interview. I am super excited and nervous at the same time. I did not expect it to make it this far as a sophomore and I do not want to mess up my one shot to get an internship this summer. Thank you for all the help in advance",
        "created_utc": 1508286300,
        "upvote_ratio": ""
    },
    {
        "title": "what exactly is the purpose of semiconductors &amp; transistors?",
        "author": "letsshow",
        "url": "https://www.reddit.com/r/ECE/comments/772vsb/what_exactly_is_the_purpose_of_semiconductors/",
        "text": "Modern life revolves around them so I thought it would be wise to get a sense of what they do..",
        "created_utc": 1508286020,
        "upvote_ratio": ""
    },
    {
        "title": "Theremin written in Python for Senior Project?",
        "author": "Sexy_Prime",
        "url": "https://www.reddit.com/r/ECE/comments/7721ly/theremin_written_in_python_for_senior_project/",
        "text": "Would this be a decent senior project ? Debating on whether to use capacitive sensing or using gesture recognition to control it.",
        "created_utc": 1508277863,
        "upvote_ratio": ""
    },
    {
        "title": "ECE B.tech/M.Tech IEEE Projects in Vijayawada",
        "author": "procorp1",
        "url": "http://www.procorpprojects.com/b-tech-m-tech-ieee-projects-in-vijayawada/",
        "text": "",
        "created_utc": 1508267964,
        "upvote_ratio": ""
    },
    {
        "title": "ECE B.tech/M.Tech IEEE Projects in Tirupati",
        "author": "procorp1",
        "url": "http://www.procorpprojects.com/b-tech-m-tech-ieee-projects-in-tirupati/",
        "text": "",
        "created_utc": 1508266963,
        "upvote_ratio": ""
    },
    {
        "title": "Final year IEEE projects in Hyderabad for ECE B.Tech &amp; M.Tech",
        "author": "procorp1",
        "url": "https://i.redd.it/alg6pb6asfsz.jpg",
        "text": "",
        "created_utc": 1508266212,
        "upvote_ratio": ""
    },
    {
        "title": "LTSpice for Mac. Has anyone here used it? Tips on Improving the experience?",
        "author": "UnDeaD_AmP",
        "url": "https://www.reddit.com/r/ECE/comments/7709tn/ltspice_for_mac_has_anyone_here_used_it_tips_on/",
        "text": "Hello, I'm a first year Computer Engineer. I'm trying to use LTSpice for Mac to setup a circuit and it just seems pretty bad compared to the Windows version. I have a Hackintosh at home with windows on it thankfully, but at school, I have a Macbook Pro, so using LTSpice really is quite confusing... Does anyone have any tips or any advice on how to improve the experience?",
        "created_utc": 1508262634,
        "upvote_ratio": ""
    },
    {
        "title": "What makes shitty speakers shitty?",
        "author": "planetcorndog",
        "url": "https://www.reddit.com/r/ECE/comments/7706f0/what_makes_shitty_speakers_shitty/",
        "text": "Is it the way they are built? The materials used? ",
        "created_utc": 1508261820,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone have a good resource for learning more about analog circuit design?",
        "author": "swervbit",
        "url": "https://www.reddit.com/r/ECE/comments/7705mn/anyone_have_a_good_resource_for_learning_more/",
        "text": "I'm an Electrical and Computer Engineering student, and while my university has done well to teach me about the different microelectronic devices (diodes, transistors, Op-Amps, etc.), they haven't really helped in teaching me how to put it all together. Do any of y'all know of any sources to get a better grasp on analog circuit design like a website, blog, or video series?",
        "created_utc": 1508261640,
        "upvote_ratio": ""
    },
    {
        "title": "DARPA’s New Infrared Smart Sensor Can Operate with “Near-Zero” Power Consumption",
        "author": "zacjack12",
        "url": "https://www.allaboutcircuits.com/news/darpa-plasmonic-infrared-smart-sensor-operate-near-zero-power-consumption/",
        "text": "",
        "created_utc": 1508260554,
        "upvote_ratio": ""
    },
    {
        "title": "Learn Surface Mount Soldering on a SMD Challenge PCB.",
        "author": "seanhodgins",
        "url": "https://youtu.be/uQjjcaN57y8",
        "text": "",
        "created_utc": 1508254064,
        "upvote_ratio": ""
    },
    {
        "title": "Is the C language dying out?",
        "author": "nice_remark",
        "url": "https://www.reddit.com/r/ECE/comments/76ykek/is_the_c_language_dying_out/",
        "text": "This question has arisen when doing research for school. As some background info, my work (grad school research) is trying to prevent software attacks targeting vulnerabilities in the C language using hardware modifications.\n\nThe more I read about the relevancy of C, the more I get concerned whether this topic is of particular interest going forward. At its inception, C was a ground-breaking language and has stood the test of time...so far. With more modern languages providing similar abilities, and are type-safe and flexible than C, does it still have a place in modern day computing?\n\nLegacy code is a big deal, and a focal point of my research, but are new products coming out that mainly deal with C? I understand that operating systems and embedded systems both rely on C, but is that going to still be the case in 10-15 years? I understand that nobody can predict the future, but putting all my chips in the security of C programs might be a bad idea going forward.\n\nLastly, I was going to posted this same question to /r/computerscience to get their take on it, but wanted to see what the ECE community had for thoughts on this question, as it relates to both ECE and CS disciplines.\n\nThank you.",
        "created_utc": 1508247263,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for some advice on which EE sub discipline to specialize in",
        "author": "trazz32",
        "url": "https://www.reddit.com/r/ECE/comments/76ujrn/looking_for_some_advice_on_which_ee_sub/",
        "text": "So a bit of background: I'm a 1st semester Junior at a top 5 EE school, and I've worked my ass off to get a very high GPA. So far, I've focused my coursework more on analog circuits, although I have also taken C programming and FPGA/SystemVerilog courses. I am currently in a power electronics class and was thinking of continuing with the power specialization and taking courses in controls, power system analysis, and electric machines. However, since I also really enjoyed my BJT/MOSFET/small signal analysis class, I am wondering if I should instead specialize in analog/digital circuits instead. My main concern with specializing in circuits is that I'm not sure it's very lucrative without going into IC design, which essentially requires a masters at the bare minimum. \n\nLast summer, I was an intern for a defense contractor, where I worked with power electronics at the board level. However, I had a lot of downtime and it was very slow-paced, as I've heard is the case with most defense contractors. I want to go into industry right after school, and I'm mostly concerned with making sure I enjoy my job, it pays well, and it's in a good location (I'm thinking west coast or chicago/some other big city).\n\nSo I have a few main questions:\n\n1. What's the better way to get into board level circuit design without my masters: more power courses or IC design courses? How lucrative is it?\n\n2. If I don't want to work for a utility company, should I even bother with taking a power system analysis course and continuing with the power specialty?\n\n3. If I do go the Analog IC design route, should I get my masters straight out of school since I could get the tuition waved because of my high GPA? Or should I work in applications for a few years and then have my company pay for my masters?\n\n4. For my next internship, I'm debating between a semiconductor company, where I would be working as a applications intern for their power supply chips and another defense contractor. Which do you think would be the better option?",
        "created_utc": 1508196601,
        "upvote_ratio": ""
    },
    {
        "title": "Finding total inductance while taking into consideration the mutual inductance.",
        "author": "OverlookingOwl",
        "url": "https://www.reddit.com/r/ECE/comments/76shk8/finding_total_inductance_while_taking_into/",
        "text": "Hello!\nSo like the title says, I would like to know how we could compute the equivalent inductance of two inductors considering there exists a mutual inductance between them. I searched through my book but couldn't find anything !\nThank you !",
        "created_utc": 1508178358,
        "upvote_ratio": ""
    },
    {
        "title": "What is the differente between the raspberry pi and the arduino?",
        "author": "_Brun",
        "url": "https://www.reddit.com/r/ECE/comments/76sese/what_is_the_differente_between_the_raspberry_pi/",
        "text": "Hey guys,\nI would like to get startet with one of these mini computers.\nDuring my school time I gained basic experience in Java and C++.\nAdditionally I worked with [Asuro](https://de.wikipedia.org/wiki/ASURO) (german page) robots.\nI always enjoyed working on projects with them but want to get into something new.\n\nAs a \"rookie\" I would like to know what the main difference between the two platforms is, which projects they can be used for, pro / cons and your general opinion about them.\n\nThanks for your help\n\n\"DISCLAIMER:\" Sorry for the bad English\n",
        "created_utc": 1508177731,
        "upvote_ratio": ""
    },
    {
        "title": "Direct TMDS HDMI decoding with a FPGA",
        "author": "adamt99",
        "url": "https://forums.xilinx.com/t5/Xcell-Daily-Blog/Adam-Taylor-s-MicroZed-Chronicles-Part-220-Using-the-AD8195-HDMI/ba-p/800933",
        "text": "",
        "created_utc": 1508176982,
        "upvote_ratio": ""
    },
    {
        "title": "How do I make the most out of a university career fair?",
        "author": "Benjo_",
        "url": "https://www.reddit.com/r/ECE/comments/76s01e/how_do_i_make_the_most_out_of_a_university_career/",
        "text": "Hey! I'm a 2nd year Computer Engineering student. There's a career fair at my university tomorrow, and I'm a little lost as to how I should prepare and what I should say/ask when meeting recruiters. Do any of you have advice on how to make the most of these career fairs?\n\nFor perspective, I'm mostly looking for a summer co-op/internship as a software developer or QA/testing engineer.",
        "created_utc": 1508174317,
        "upvote_ratio": ""
    },
    {
        "title": "Request: good control systems online courses",
        "author": "bpmsilva",
        "url": "https://www.reddit.com/r/ECE/comments/76ihiv/request_good_control_systems_online_courses/",
        "text": "",
        "created_utc": 1508067381,
        "upvote_ratio": ""
    },
    {
        "title": "FPGA verification internship interview",
        "author": "kennyyee",
        "url": "https://www.reddit.com/r/ECE/comments/76i9e2/fpga_verification_internship_interview/",
        "text": "I'm a 3rd year computer systems engineering student and am about to have an interview next week for an internship to do with evaluating new tools of FPGA verification. \n\nThis is my first real interview and I'm unsure of how to prepare for this interview. There's a written test and an interview.\n\n•Should I know about current verification tools/techniques before I go because I currently know nothing pretty much.\n\n•What categories of questions would they be likely to ask?\n\n•Would I be expected to memorize some VHDL syntax in written tests?\n\n•How much about their company should I know about?\n\n\nAny other advice would be very appreciated thank you!\n",
        "created_utc": 1508063405,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone explain why this resistor linearizes I-V curve of this diode-connected MOSFET?",
        "author": "bskilly",
        "url": "https://www.reddit.com/r/ECE/comments/76ezcg/can_someone_explain_why_this_resistor_linearizes/",
        "text": "I'm doing some experimentation in LTSpice in order to understand different MOSFET circuits. I'm currently looking at diode-connected MOSFETS. \n\nI hooked up a voltage source to a diode-connected MOSFET (no drain resistor) and stepped the voltage supply from 0 to 10. I got the exponential curve I was expecting. \n\nWhen I threw a drain resistor into the circuit though, the current curve got completely linearized: https://imgur.com/a/x5NWe\n\nI can't seem to figure out why. I tried writing down the drain current equation as: \n\nId = k(Vdd - Id*Rd - Vth)^2 \n\nWhere ive set k equal to 0.5*u*c*(W/L). I don't quite know how to interpret this equation since gate-to-source voltage is determined by the drain current. Anyone have any insight? ",
        "created_utc": 1508017476,
        "upvote_ratio": ""
    },
    {
        "title": "can a transistor converts dc to ac?",
        "author": "Engineer941",
        "url": "https://electronics2electrical.com/427/can-a-transistor-converts-dc-to-ac",
        "text": "",
        "created_utc": 1507977512,
        "upvote_ratio": ""
    },
    {
        "title": "In ᴏrder tᴏ αttrαct new custᴏmers tᴏ ᴏur stᴏre, we αre mαkÍng α greαt prᴏmᴏtÍᴏn. We αre gÍvÍng αwαy 100 Bluelans watches, (normαlly 60$) ᴏnly 4 tᴏdαy. All yᴏu have tᴏ dᴏ Ís leαve α hᴏnest revÍew.",
        "author": "firelizard11787",
        "url": "http://3y0urstyle.blogspot.com/2017/10/in-rder-t-ttrct-new-custmers-t-ur-stre.html",
        "text": "",
        "created_utc": 1507966107,
        "upvote_ratio": ""
    },
    {
        "title": "PCB Design: Ground planes vs star grounding",
        "author": "Sousanator",
        "url": "https://www.reddit.com/r/ECE/comments/769u60/pcb_design_ground_planes_vs_star_grounding/",
        "text": "My question has to do with the use of ground plane pours vs star grounding.\n\nStar grounding is used to ensure that each components ground reference is near the same potential, if I'm not mistaken. If we use large ground pours does this defeat the purpose of star grounding? \n\nI know in high speed digital design ground planes are essential for shielding, but in low-speed digital designs is it better to just star ground and etch away the left over copper?\n\nI read somewhere that you should always do large ground pours over the appropriate layers of your PCB. Does this count for a top layer where components are placed? Should you star ground instead?\n",
        "created_utc": 1507952033,
        "upvote_ratio": ""
    },
    {
        "title": "Feel like I know nothing...",
        "author": "bubbab315",
        "url": "https://www.reddit.com/r/ECE/comments/7698d4/feel_like_i_know_nothing/",
        "text": "So I'm a senior EE student and about to graduate. However, I'm constantly watching different ee YouTube channels and frequently feel like I didn't learn anything. I can analyze a circuit or whatever to find any value(voltage current etc etc) However, I ussually don't know what a circuit does, or why certain discrete parts are needed. Is this normal or am I behind in my field of study. Do most people graduating feel this way?",
        "created_utc": 1507944420,
        "upvote_ratio": ""
    },
    {
        "title": "Learning C with a Project Approach",
        "author": "Ridaros",
        "url": "https://www.reddit.com/r/ECE/comments/7686ss/learning_c_with_a_project_approach/",
        "text": "Does anybody have any recommendations on where I should learn C? \n\nI enjoy things like Udemy, but I'm yet to find a good C course on there.",
        "created_utc": 1507932965,
        "upvote_ratio": ""
    },
    {
        "title": "What are employers in the ECE looking for?",
        "author": "dbzoa",
        "url": "https://www.reddit.com/r/ECE/comments/766jrs/what_are_employers_in_the_ece_looking_for/",
        "text": "So I am going to college and I am trying to map out what exactly I want to do the four years that I am here. My plan was to get ahead and build a good GPA by doing Fall, Spring, and Summer terms the first 2 years. Then the summers of the last two years, I do internships. However, my friend and I got into an argument because he got a paid internship his freshman year at Lockheed Martin in New York. He is doing an internship with them every summer for three years (next summer will be his 2nd year). I told him that its not a good idea to do that because he is already behind in his school work and instead of graduating in 4 years he would graduate in 4 years and a semester or two. He said that it does not matter because employers don't care when you graduated or how long it took, they care more about experience. Considering this, I don't know if I should take the next summer to do internships or not. Anybody have any ideas what I should do and whats more important to employers? ",
        "created_utc": 1507917593,
        "upvote_ratio": ""
    },
    {
        "title": "Livebox Streaming Server for IPTV and Live video Streaming",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/765max/livebox_streaming_server_for_iptv_and_live_video/",
        "text": "[deleted]",
        "created_utc": 1507909377,
        "upvote_ratio": ""
    },
    {
        "title": "Building an embedded library from scratch",
        "author": "senorclean",
        "url": "https://www.reddit.com/r/ECE/comments/765462/building_an_embedded_library_from_scratch/",
        "text": "As the title implies, I'm interested in building an embedded library for an STM32F4 microcontroller from scratch. This is mainly just for my own knowledge and experience.\n\nI've written drivers, setup timers, DMA, etc for this device but I'm now at a point where I want to know an efficient way to organize all of this code. STM provides their own library but I've found it difficult to understand why certain design choices were made. In essence what I'm looking for is a book or a guide that outlines how to structure an embedded project and good embedded coding practices.\n\nAs an example, I would like to learn a more efficient way to manage errors. Should you use an enumerator for each peripheral's error codes? One enumerator for a chunk of devices? I can find different opinions of what to do online but I'd like to find a resource where someone outlines their reasoning for error checking, the level of modularity in their code, how to handle global variables, etc in one place. Does anyone know where I can find something like this?\n\nEDIT: To anyone also looking for the same thing as I am, the book \"Making Embedded Systems\" by Elecia White looks really great. There are quite a few chapters that aren't relevant to what I'm looking for but there's a lot of really good information.",
        "created_utc": 1507904727,
        "upvote_ratio": ""
    },
    {
        "title": "Amazing Techincal History : Computer Mouse",
        "author": "[deleted]",
        "url": "https://youtu.be/1pun4Jwbwmk",
        "text": "[deleted]",
        "created_utc": 1507879583,
        "upvote_ratio": ""
    },
    {
        "title": "Projected Job Market in 4 ~ years",
        "author": "vis1onary",
        "url": "https://www.reddit.com/r/ECE/comments/762rsa/projected_job_market_in_4_years/",
        "text": "Im actually in my first year of computer engineering in an ontario University. It is crazy how extremely competitive it is now. I knew how hard it would be going in, the class average on some midterms last year were in the 40s, whereas my class this year people are getting mostly 90s and 100s, it is quite unreal how much competition there is in my year and the amount of students in engineering now. It had a lot of us worried about the job market in the future, everyone will he so qualified. Just wanted some insight from those who have been in the industry, how does the job market look like right now for computer engineers? A lot of people say that I am fine because I am technically qualified to work as a software engineer or an electrical engineer, but many are saying most of the jobs left are in software. Was wondering how the market looks in the Toronto area as well as the New York City area.\n\nThanks!",
        "created_utc": 1507872909,
        "upvote_ratio": ""
    },
    {
        "title": "Criminal Defense Lawyer | New York Federal Criminal Attorney",
        "author": "ChantalNoongn88",
        "url": "https://criminal-defenselawyer.net/",
        "text": "",
        "created_utc": 1507854804,
        "upvote_ratio": ""
    },
    {
        "title": "Pad naming script in Autodesk Eagle?",
        "author": "Jdcampbell",
        "url": "https://www.reddit.com/r/ECE/comments/75zmco/pad_naming_script_in_autodesk_eagle/",
        "text": "Hey Guys! \n\nNew here and new to Eagle. I am working on a project and I need to name a bunch of pads on a 650 BGA with the same name but need to number them because you can't use the name name twice in Eagle (maybe I am doing this wrong so any advice is welcome). Essentially, in the middle of the BGA I have a bunch of ground pins that I would like to name sequentially \"VSS$1...VSS$2...\".\n\nAny tips on how I would go about doing that quickly rather than typing it in one pin at a time? The device I am recreating in Eagle is under an NDA so I can't really share the schematic.\n\n",
        "created_utc": 1507838795,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to Decipher which University Program is Better for Me",
        "author": "drowsell",
        "url": "https://www.reddit.com/r/ECE/comments/75zm0p/trying_to_decipher_which_university_program_is/",
        "text": "Hi ECE,\n\nI'm looking at attending one of two universities in my cities, and I have found that the programs are quite different, and I'm looking for second opinions about what you all think. I'm looking to get a degree in either Computer or Electrical Engineering, and both programs allow me to choose my major after year 1 is completed. From what I've heard is both of these schools are fairly good. The naming scheme is what seems to worry me most. Any opinions? Both schools have Co-op programs.\n\n--\nSchool 1 - University of British Columbia\nhttps://www.ece.ubc.ca/academic-programs/undergraduate/programs/computer-engineering-program\n\nAccredited Program in Computer Engineering\n\nAccredited Program in Electrical Engineering\n\nLonger commute (1 hour 15 minutes each way)\n\n--\nSchool 2 - Simon Fraser University\n\nhttps://www.sfu.ca/engineering/current-students/undergraduate-students/programs-and-requirements/computer-engineering/curriculum-revised.html\n\nAccredited Program in Engineering Science (Computer Engineering Option)\n\nAccredited Program in Engineering Science (Electronics Engineering Option)\n\nShorter Commute - (35 minutes each way)",
        "created_utc": 1507838712,
        "upvote_ratio": ""
    },
    {
        "title": "I think they are having some sorta design competition for power sequencing circuit design. Any collaborators?",
        "author": "nescit-cedere",
        "url": "https://efabless.com/knowledgebase/greenpak-learn-and-get-going-in-30-minutes/",
        "text": "",
        "created_utc": 1507821209,
        "upvote_ratio": ""
    },
    {
        "title": "Software to design a professional looking circuit diagrams for a thesis",
        "author": "pash1987",
        "url": "https://www.reddit.com/r/ECE/comments/75xio9/software_to_design_a_professional_looking_circuit/",
        "text": "Hi all!    \nI'm currently writing my PhD thesis and would like to insert some RLC type circuits as figures throughout my theoretical chapters. In the past I have used lumped element simulation tools (AWR microwave office, ADS, mulitisim etc) and taken screenshots, or custom pre-designed element symbols that drawn in MS Paint.  For my thesis though, I think this would come across as far too unprofessional looking.    \nAre there any good (and preferably free to use / browser based) software programs that can design professional looking electronic circuit diagrams you can recommend?",
        "created_utc": 1507820230,
        "upvote_ratio": ""
    },
    {
        "title": "Getting frustrated by visiting various websites and not getting answer to your query regarding learning a controller or interfacing controller to particular sensor or module?",
        "author": "[deleted]",
        "url": "http://www.electronicwings.com/",
        "text": "[deleted]",
        "created_utc": 1507806494,
        "upvote_ratio": ""
    },
    {
        "title": "Verilog Help:Counter With Enable",
        "author": "Scar9591",
        "url": "https://www.reddit.com/r/ECE/comments/75vz6x/verilog_helpcounter_with_enable/",
        "text": "Hi \n\nI am trying to solve this exercise with the following specs\nhttps://hdlbits.01xz.net/wiki/Countslow\n\nThis is my HDL description for the spec\nhttps://pastebin.com/sM1Nhzr9\n\nThe waveforms are matching however apparently the results are incorrect. What am I missing?",
        "created_utc": 1507802086,
        "upvote_ratio": ""
    },
    {
        "title": "Setting up USB with a STM32L053 MCU",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/75tx4a/setting_up_usb_with_a_stm32l053_mcu/",
        "text": "[deleted]",
        "created_utc": 1507773692,
        "upvote_ratio": ""
    },
    {
        "title": "why ujt acts as a relaxation oscillator",
        "author": "Engineer941",
        "url": "https://www.reddit.com/r/ECE/comments/75twy8/why_ujt_acts_as_a_relaxation_oscillator/",
        "text": "[removed]",
        "created_utc": 1507773644,
        "upvote_ratio": ""
    },
    {
        "title": "why ujt acts as a relaxation oscillator",
        "author": "EngineeringCommunity",
        "url": "https://electronics2electrical.com/1840/why-ujt-acts-as-a-relaxation-oscillator",
        "text": "",
        "created_utc": 1507773023,
        "upvote_ratio": ""
    },
    {
        "title": "Need help with some basic circuit analysis homework.",
        "author": "This4ChanHacker",
        "url": "https://www.reddit.com/r/ECE/comments/75sv5c/need_help_with_some_basic_circuit_analysis/",
        "text": "Hey guys, I need help solving this circuit for V1, and V2.\n\n(https://imgur.com/hFIfrNi)\n\nNow, I understand how to nodal analysis works, but the voltage source coming out of the second node is throwing me for a loop. My initial thought was to make a supernode, but i'm not sure how exactly to set that up, or if it would help. My professor did a shitty job explaining it. Could you just call V2 5 volts, and V1 -5 volts by inspection?\n\nIf anyone could help point me in the direction of where to start, id appreciate it. Thanks.\n\n",
        "created_utc": 1507762775,
        "upvote_ratio": ""
    },
    {
        "title": "Linear Programming Simplex Method question",
        "author": "Julez1234",
        "url": "https://www.reddit.com/r/ECE/comments/75sosw/linear_programming_simplex_method_question/",
        "text": "Hi,\n\nI'm trying to minimize the objective function\n\nf = 1200 + 15w + 20x + 25y + 23y subject to the constraints\n\nw &lt;= 300\n\nx &lt;= 150\n\nw + x + y + z = 700\n\n0.5w + 0.3x - 0.2y &lt;= 100\n\nw,x,y,z &gt;= 0\n\nHowever, I am having trouble setting up the initial tableau to get a basic feasible solution. What's throwing me off is the constant term in the objective function, the equality constraint w+x+y+z=700, and the fact that it is a minimization problem.\n\nWhen I put the coefficients of the objective function into the tableau, all the coefficients are positive, which means that it is already at the optimal solution (which doesn't make sense).\n\nIf someone can walk through the process of getting the initial tableau for this problem, I'd really appreciate it!\n",
        "created_utc": 1507761036,
        "upvote_ratio": ""
    },
    {
        "title": "Depression and pursuing an ECE degree?",
        "author": "reddorkfish",
        "url": "https://www.reddit.com/r/ECE/comments/75s8s3/depression_and_pursuing_an_ece_degree/",
        "text": "Hi,\n\nI am a sophomore studying Industrial Engineering at a top 5 engineering school, and I have been depressed for a very long time. I want to try and transfer to ECE at my university, but I do not know if it is a good idea with my health the way it is. \n\nI just realized I was depressed last year when I started college, but it took a huge toll on me and my academics as well. I've always been a great student, so seeing myself do so poorly in school just made me feel even worse. I finished out the year with a 2.5 GPA and a 1.7 technical GPA, which is so embarrassing for me to even type. I am taking this semester off to go to community college and just spend time with my family, but I will be returning to the university next semester. I hope to start on medication and find a therapist that I can go to regularly and get help.\n\nI know ECE can be hard, and I know I am interested in it, but to be honest, I don't know if I want to put that kind of pressure on myself. To be able to transfer, I will have to have at least a 3.8 GPA and I know that once I get in, classes will only continue to get harder. I know that with hard work, almost anything is possible, but with depression, that's not always possible. I want to get help and I want to be able to pursue this, but I am just feeling a little disillusioned now. I don't know if it is possible. \n\nDid any of you suffer from depression when pursuing your degree? How did you get past it and keep your grades up? What are some suggestions you have for managing an engineering workload with depression?\n\n",
        "created_utc": 1507756880,
        "upvote_ratio": ""
    },
    {
        "title": "Electrical Engineer. Graduated 5 months ago with no luck in getting full-time position.",
        "author": "Susy_La_Adelita",
        "url": "https://www.reddit.com/r/ECE/comments/75riqw/electrical_engineer_graduated_5_months_ago_with/",
        "text": "[Resume Link](https://imgur.com/a/CDRzG)\r\n\r\nElectrical Engineer. Graduated 5 months ago with no luck in getting full-time position. I'm trying to get a job as an Embedded or firmware engineer but I also am applying for software engineering positions since I studied both at school. I'm thinking I can't get through Application Tracking Software. I feel like I truly am a fast learner and hard worker but I can't get an interview to show all these. Created a website to showcase my talents but nothing yet. I put some comments on the resume image to ask a few more questions. Any help would be greatly appreciated! Thank you very much :)",
        "created_utc": 1507750538,
        "upvote_ratio": ""
    },
    {
        "title": "Next job ideas?",
        "author": "yucccayuccca",
        "url": "https://www.reddit.com/r/ECE/comments/75q8lo/next_job_ideas/",
        "text": "Hi there,\n\nI'm currently working in an HVAC maintenance intern position. I'm halfway through a 2 year program. The work we've done has inspired me to look into electrical engineering. I'm currently taking night classes and hoping to gather my credits until I'm ready to transfer to a 4 year university. \n\nI'm wondering what are suggested jobs I should look for if I leave the HVAC trade that would still keep me working with electrical components or that would continue to build my hands on experience. I'd rather do something that would help me instead of falling back to a customer service job or something that perhaps wouldn't be as helpful. Any suggestions? Thanks",
        "created_utc": 1507739565,
        "upvote_ratio": ""
    },
    {
        "title": "A vibration-driven logic gate could form the basis for the next generation of efficient, low-power computers.",
        "author": "Chipdoc",
        "url": "https://discovery.kaust.edu.sa/en/article/428/good%250avibrations-for-the-future-of-computing",
        "text": "",
        "created_utc": 1507727784,
        "upvote_ratio": ""
    },
    {
        "title": "Resume feedback? Graduating in December 2017 and looking for entry-level embedded engineering positions",
        "author": "ECEResumeAdvice",
        "url": "https://i.imgur.com/9M5jvcy.png",
        "text": "",
        "created_utc": 1507723572,
        "upvote_ratio": ""
    },
    {
        "title": "Need help with Keil uVision - how to edit files, and other questions",
        "author": "Ppk2128",
        "url": "https://www.reddit.com/r/ECE/comments/75mbfh/need_help_with_keil_uvision_how_to_edit_files_and/",
        "text": "Hello, I want to understand the process of creating a project for any microcontroller. I read some of the Keil uVision documentation on how to create a project, select componenets and startup file. But I'm having some trouble after that.\n\nI'm currently using STM32L476VGT6. I tried importing an LED software component to see how it works. The C file that was imported (STM32L476G-EVAL.c) uses the \"stm32l4xx.h\" header file, which contains macros to import the actual header (\"stm32l476xx.h\") for my board (the header contains the register definitions). However, I can't edit the \"stm32l4xx.h\" header file so it can't do this. I can't edit the C file either (STM32L476G-EVAL.c)\n\nHow can I edit these two files so I can edit them? Is this generally the way to go about programming other microcontrollers, importing software components and using the C files that come along with them? Also, how do you usually import just the register definition file so you can create other C files from scratch? Thanks. \n",
        "created_utc": 1507691031,
        "upvote_ratio": ""
    },
    {
        "title": "LOOKING FOR ECE3001 EXAMS (YANG CAO)",
        "author": "johneron96",
        "url": "https://www.reddit.com/r/ECE/comments/75ltax/looking_for_ece3001_exams_yang_cao/",
        "text": "",
        "created_utc": 1507685683,
        "upvote_ratio": ""
    },
    {
        "title": "Interview Assignment",
        "author": "GatlingTurtle",
        "url": "https://www.reddit.com/r/ECE/comments/75jsrb/interview_assignment/",
        "text": "Hey Guys,\n\nI am an Electrical Engineering Freshman at Cal Poly SLO taking a GE communications class this quarter.  We were given the assignment of interviewing a mentor figure in hopes of discussing the role communication plays in our field of study.  I am having some trouble finding engineers to interview (I have sent out many emails, but no responses).  \n\nWould any of you be available for a 30 minute videoconference interview discussing this role? \n\nI would really appreciate it!\n\nThanks!\n\n",
        "created_utc": 1507666387,
        "upvote_ratio": ""
    },
    {
        "title": "Some lab made years ago a micrometer scale electromechanical relay switch (that works similarly to a transistor). What came of it?",
        "author": "herkato5",
        "url": "https://www.reddit.com/r/ECE/comments/75j5rq/some_lab_made_years_ago_a_micrometer_scale/",
        "text": "\n\nCan't seem to find a link to it.\n\nIf it changes state rarely enough it is more energy efficient than a transistor with similar capacity. Maybe it would be good for switching pixels in a TV(  60hz ) ?\n\nIf something like that can be made in 10 nanometer scale, data storage could be one use.\n",
        "created_utc": 1507660931,
        "upvote_ratio": ""
    },
    {
        "title": "How to stop people from stealing your oscilloscope probes!",
        "author": "Keysight_DanielB",
        "url": "https://www.youtube.com/watch?v=BRhChyZs0vc",
        "text": "",
        "created_utc": 1507657114,
        "upvote_ratio": ""
    },
    {
        "title": "electrical engineering Q&amp;A",
        "author": "EngineeringCommunity",
        "url": "https://www.reddit.com/r/ECE/comments/75hzl4/electrical_engineering_qa/",
        "text": "[removed]",
        "created_utc": 1507651131,
        "upvote_ratio": ""
    },
    {
        "title": "Diode reverse recovery simulation. LTSpice",
        "author": "feras97",
        "url": "https://www.reddit.com/r/ECE/comments/75hy8e/diode_reverse_recovery_simulation_ltspice/",
        "text": "How can i add non ideal diode models to LTSpice in order to be able to simulate the reverse recovery of the diode !",
        "created_utc": 1507650795,
        "upvote_ratio": ""
    },
    {
        "title": "Design PCB project",
        "author": "funky16",
        "url": "https://www.reddit.com/r/ECE/comments/75fdjl/design_pcb_project/",
        "text": "Hello, I need to design a development board based on a MCU and in order to do that I need a tool to add the components and make the connections between them. \nAlso, I would like to simulate and see whether the circuit would work, I know that there are tools for this but only for the electrical circuits, Could you recommend me some good apps/tools to get this job done? I'm looking for something to use as a student because this is for my bachelor dissertation, I used Eagle for a couple of times but it seemed too crowded with functions.\n\nThanks. ",
        "created_utc": 1507618944,
        "upvote_ratio": ""
    },
    {
        "title": "How long is too long after graduating?",
        "author": "UhhhhKhakis",
        "url": "https://www.reddit.com/r/ECE/comments/75f9u6/how_long_is_too_long_after_graduating/",
        "text": "I graduated in ECE in May and I'm in a set area looking for a job.  I had a decent GPA and some internship experience.  I have had several interviews and an offer that I didn't think was a good fit but I am still looking.  How long is too long before employers start holding it against me that I haven't had an engineering job since graduating?",
        "created_utc": 1507617306,
        "upvote_ratio": ""
    },
    {
        "title": "ECE Contract job offer (CWF) at qualcomm. Compensation is low. What gives?",
        "author": "supersclr",
        "url": "https://www.reddit.com/r/ECE/comments/75eav1/ece_contract_job_offer_cwf_at_qualcomm/",
        "text": "As the title states, I've got a contract staff level position offer with Qualcomm as an electrical/computer engineering working on their mobile chips.  \n\nThe agency I am working with offered compensation of $50 dollars an hour which comes to about ~100K a year with no benefits. Glassdoor tells me a staff engineer at Qualcomm in the San Diego location makes ~130K base and a total compensation of 154K.  \n\nIs this salary discrepancy normal for contract positions? I thought the compensation was supposed to be higher than regular salary. How do they expect to attract and retain engineers at this rate? I kind of need a job at the moment though so any advice or insight would be helpful. My current take on the situation is that it is a terrible offer.",
        "created_utc": 1507604647,
        "upvote_ratio": ""
    },
    {
        "title": "Hey guys, I'm in need for some homework help",
        "author": "Brunswicker_Sloop",
        "url": "https://www.reddit.com/r/ECE/comments/75dpr5/hey_guys_im_in_need_for_some_homework_help/",
        "text": "So the question is, find v1,v2,v3,r1,r2,r3 given that v1+v2=80v and v2+v3=90v and that total resistance is 8k and that E(total voltage)=120v.\n\nIf someone could give me a tip or something to help me get v1/v2/v3 separate it would be greatly appreciated.\n\nIf you want some proof I tried then here's how I found current:\n\nI=V/R \nI=120/8000\nI=15mA\n\nthat's as far as I got.  \n",
        "created_utc": 1507598311,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to make a bodged 3d scanner - comments for details",
        "author": "brokkr-",
        "url": "http://suhastech.com/homemade-kinect-hack-usb-ac-power-adapter-connector-for-the-xbox-360/",
        "text": "",
        "created_utc": 1507590901,
        "upvote_ratio": ""
    },
    {
        "title": "Transfer function analysis help",
        "author": "eventhorizon51",
        "url": "https://www.reddit.com/r/ECE/comments/75cizi/transfer_function_analysis_help/",
        "text": "[This is the question](https://i.imgur.com/ZAnqp5J.png)\n\nWhich response should be used when trying to find the transfer function? I tried using the complete response (zero state plus zero input) when finding the transfer function but it seems like that would only be valid for v*_c_*(0^(-))=4V. In part b, when v*_c_*(0^(-)) is doubled to 8V, would the zero-input response also double to 8e^(-2t)u(t)V? How would that influence the transfer function, if at all? Any help would be appreciated.",
        "created_utc": 1507586157,
        "upvote_ratio": ""
    },
    {
        "title": "Cheapest surface mount chips. (Function irrelevant)",
        "author": "For_Fake",
        "url": "https://www.reddit.com/r/ECE/comments/75bdm0/cheapest_surface_mount_chips_function_irrelevant/",
        "text": "I'm looking to sharpen up my soldering skills by learning to hand solder surface mount parts and some fine pitched chips such as LFQPs. I'd like to keep my spending to a minimum here if possible.\n\nList the cheapest chips you know or any cheap suppliers.",
        "created_utc": 1507576171,
        "upvote_ratio": ""
    },
    {
        "title": "What happened to my multimeter?",
        "author": "Brunswicker_Sloop",
        "url": "https://www.reddit.com/r/ECE/comments/75bdjt/what_happened_to_my_multimeter/",
        "text": "So my mom bought me a multimeter online for college and I think it's busted. As soon as I put my nine volt battery into the thing it made a weird crackling sound for a second. I then put it to measure volts and the display shows nothing. I set it to all the other measurements and absolutely nothing shows up. The only way I can tell it's working and even on is by clicking the back light button on it. So does anyone know what happened to my display so this doesn't happen again to me?\n\nBtw, once I put my battery in I noticed it was set to measure Amps and not on zero, I forgot what quantity though. The leads were not in so I don't see how it could affect it.\n\nAlso, I checked the fuse and there is still a wire in the glass.",
        "created_utc": 1507576159,
        "upvote_ratio": ""
    },
    {
        "title": "Building PetaLinux for the MPSoC a tutorial",
        "author": "adamt99",
        "url": "https://forums.xilinx.com/t5/Xcell-Daily-Blog/Adam-Taylor-s-MicroZed-Chronicles-Part-219-UltraZed-Edition-How/ba-p/799417",
        "text": "",
        "created_utc": 1507575119,
        "upvote_ratio": ""
    },
    {
        "title": "EEs/CPEs in the context of military or defense companies?",
        "author": "yahskapar",
        "url": "https://www.reddit.com/r/ECE/comments/759nqv/eescpes_in_the_context_of_military_or_defense/",
        "text": "Just curious since I recently went to a career fair and, for some reason or another, spent a whole two hours talking to various recruiters who were from military divisions (air force and navy primarily) and spoke highly of prospects for EEs and CPEs with respect to the military. \n\nI have no doubt that the military is on the cutting edge of things of interest to them, as well as keen on discipline (which is good in my eyes), but I'm curious as to what you folks have had personally in terms of experience with being an EE or a CPE with any relation to the military (moving through to fund college, being commissioned as an officer, working for a defense company and not really being a part of the military per say, etc). I would argue I'm someone who needs the funding for college and also is a citizen who is somewhat interested in serving altogether, but I'm also very skeptical and have heard varying accounts of \"what is promised\" when it comes to enlisting while in college or after college itself. I'm also not entirely sure how hampering the commitment can be.\n\n",
        "created_utc": 1507561682,
        "upvote_ratio": ""
    },
    {
        "title": "looking for an RFIC/Analog design job in munich or allover germany.",
        "author": "3onda",
        "url": "https://www.reddit.com/r/ECE/comments/758q9a/looking_for_an_rficanalog_design_job_in_munich_or/",
        "text": "my experience does not exceed master's level + a failed attempt at a PhD.\nwould you still believe in me and give me a chance? \nif you wouldn't hire me then I understand, but would you care to share with me your thoughts on how I would improve myself and be able to get a job in that field competing with others who are my same age with double my experience if not more.\nsincerely a fed up person.\nI reached a point where I get 100 rejections per week.\nRegards",
        "created_utc": 1507552082,
        "upvote_ratio": ""
    },
    {
        "title": "Electrical and Electronics Engineering Questions and Answers",
        "author": "Engineer941",
        "url": "https://electronics2electrical.com/",
        "text": "",
        "created_utc": 1507537055,
        "upvote_ratio": ""
    },
    {
        "title": "Career choices for EE with little programming",
        "author": "Malamonga",
        "url": "https://www.reddit.com/r/ECE/comments/756y9g/career_choices_for_ee_with_little_programming/",
        "text": "So I'm currently in my 2nd year of EE. After a few C classes and SystemVerilog, I have to say I'm really bad at programming (and don't really enjoy it that much). I've been trying to learn more coding on my own and do more coding based projects, but progress has been slow. I know programming is basically half of EE, which worries me. What kind of career choices do you have if you want to do little programming (perhaps some scripting and Matlab here and there but not like writing 100s or 1000s lines of code).\n\n I was looking into analog design, DSP, and control  system/power electronics? analog design seems cool, although it seems like some positions require PhD? I think IC design I believe. I really enjoy circuits, but seeing positions requiring at least MS or PhD seems intimidating. I think the same is for Electromagnetics/RF stuff. DSP looks interesting but it seems like with a BS you're mostly going to be writing codes in C++. Not sure about MS. Power Electronics/controls also seem interesting but I don't really hear about them a lot. I definitely don't want to do PhD, but I'll definitely do a masters because I heard with an MS you get to do more enjoyable work.\n\nCan any current engineers offer some insights? Is there any hope for someone who's below average at programming to be in EE? I should say while I'm still actively trying to improve my programming skills, I have to be realistic and explore career options that are less programming intensive.",
        "created_utc": 1507525618,
        "upvote_ratio": ""
    },
    {
        "title": "ADA on a STM32?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/756463/ada_on_a_stm32/",
        "text": "[deleted]",
        "created_utc": 1507515319,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for someone to interview on CE",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/754wwq/looking_for_someone_to_interview_on_ce/",
        "text": "[deleted]",
        "created_utc": 1507501975,
        "upvote_ratio": ""
    },
    {
        "title": "Low Voltage BMS for FSAE EV Car",
        "author": "ItzGottaBeDaShoes",
        "url": "https://www.reddit.com/r/ECE/comments/754qd3/low_voltage_bms_for_fsae_ev_car/",
        "text": "I'm an EE on the electric formula car design team at my school. Our car has a low voltage system that operates with LiPo batteries in a 7s2p configuration (25.9V nominal). After trying to implement an older student designed battery management system we shorted a component on the PCB. We have yet to figure out the issue or why it happened but we are stuck deciding if we should look to buy a BMS off the shelf somewhere, if we should try to fabricate another board and test it, or if we should try to design our own BMS. The team is struggling to keep up with due dates to make it to competition as is. Does anyone have any advice? If we were to buy a BMS where should we look? If we were to design our own BMS what are some good resources? Thanks ",
        "created_utc": 1507500078,
        "upvote_ratio": ""
    },
    {
        "title": "What (if any) rules exist for when you can consider a compiler complete?",
        "author": "Myllokunmingia",
        "url": "https://www.reddit.com/r/ECE/comments/754jox/what_if_any_rules_exist_for_when_you_can_consider/",
        "text": "This might be a general question or perhaps a C compiler specific question. For more context I'm using avr-gcc for an Atmel chip.\n\nFor a bare minimum C program I don't need to include any libraries. So there is some implicit assumption that things like basic data types (primitives?), arithmetic operators, pointers, assignment operators, boolean operators, etc. are implemented. \n\nIt's obvious that something like declaring and defining an integer, and then adding 3 to it, and storing it back to that memory location that is:\n\n    int i = 5;\n    i = i + 3;\n\nwould be implemented. That just got me thinking, what guarantees are made to me that such things are indeed implemented? Does a compiler just say \"I follow the cXX standard\" and then I, as a programmer, can assume that the compiler will produce machine code with the desired behavior?\n\nAdditionally avr-libc implements things like &lt;stdlib.h&gt;. In order to say you implement that do you HAVE to implement every function in stdlib? Or is everything on a case-by-case basis?",
        "created_utc": 1507498149,
        "upvote_ratio": ""
    },
    {
        "title": "Best CSU for Computer Engineering or Sciences?",
        "author": "Gayffrey",
        "url": "https://www.reddit.com/r/ECE/comments/7542mr/best_csu_for_computer_engineering_or_sciences/",
        "text": "Leaning towards California State Polytechnic University, Pomona right now, but I need more options.",
        "created_utc": 1507493462,
        "upvote_ratio": ""
    },
    {
        "title": "EE grad wants a Cable Harness Design Engineering Job, please help",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/7533ds/ee_grad_wants_a_cable_harness_design_engineering/",
        "text": "I graduated as an EE in May and I took a \"Technical Writer/Editor\" job just to get into this company because I like it\n\nNow im starting to dislike the tech writer job for many reasons:\n\n- Far from home, Engineering at the same company would be closer\n\n- I studied engineering to be an engineer\n\n- We dont have much work now\n\n- Pay is not the greatest now\n\n...\n\nI will be applying for a \"Cable Harness Design Engineer\" job at the same company\n\nDoes anyone know some tips that will be helpful for me?\n\n\n**TLDR: EE grad wants a Cable Harness Design Engineering Job, please help :)** I know I'm qualified for this position\n\n\nThank you",
        "created_utc": 1507484058,
        "upvote_ratio": ""
    },
    {
        "title": "Minimal SOP vs Minimal POS",
        "author": "arjundupa",
        "url": "https://www.reddit.com/r/ECE/comments/7531n9/minimal_sop_vs_minimal_pos/",
        "text": "The minimal SOP for a function f(w,x,y,z) = w'x + xz + y'. The minimal POS for the same function is f(w,x,y,z) = (w' + y' + z)(x + y'). Expanding the minimal POS expression gives f(w,x,y,z) = w'x + xz + y'(w' + x + y' + z). This suggests that (w' + x + y' + z) always equals 1. Treating (w' + x + y' + z) as a POS maxterm points to a cell which contains a 0. Treating (w' + x + y' + z) as a SOP minterm points to a cell on the K-map which has a 1. Shouldn't (w' + x + y' + z) be treated as a POS since we started out in the POS form? Can we even expand the POS form in the way I did? Shouldn't the minimal POS and SOP produce equivalent mathematical functions?",
        "created_utc": 1507483602,
        "upvote_ratio": ""
    },
    {
        "title": "Getting an ASIC made cheap",
        "author": "mech_eng_lewis",
        "url": "https://www.reddit.com/r/ECE/comments/7517v1/getting_an_asic_made_cheap/",
        "text": "So I'm in my final year of EE and I'm doing a VLSI class using Tanner EDA. We're designing all the important logic like muxes, decode, priority encoder, logic gates etc on a 250nm process. I was just wondering if there could be a cheap way for a student to get a small IC made, say like 50mm^2 or something by reusing wafers. I had a look at Austrianmicrosystems but I couldn't find anything. \n\nI just think it'd be really cool to have.\n",
        "created_utc": 1507462687,
        "upvote_ratio": ""
    },
    {
        "title": "Electrical Engineer. Graduated 5 months ago with no luck in getting full-time position.",
        "author": "mushfiq_814",
        "url": "https://www.reddit.com/r/ECE/comments/74zwex/electrical_engineer_graduated_5_months_ago_with/",
        "text": "[removed]",
        "created_utc": 1507438900,
        "upvote_ratio": ""
    },
    {
        "title": "Washington Registered Agent",
        "author": "randiepanizzonm",
        "url": "https://washington.biz/registeredagent/",
        "text": "",
        "created_utc": 1507437683,
        "upvote_ratio": ""
    },
    {
        "title": "Help with Potential?",
        "author": "javeryizsavory",
        "url": "https://i.redd.it/54dn01zyrhqz.jpg",
        "text": "",
        "created_utc": 1507418638,
        "upvote_ratio": ""
    },
    {
        "title": "Possible technical interview questions for an internship within a telecommunications engineering company.",
        "author": "CharmedQuark",
        "url": "https://www.reddit.com/r/ECE/comments/74uexg/possible_technical_interview_questions_for_an/",
        "text": "I have an interview coming up next week with a smallish company that supplies telecommunications infrastructure: a small amount of fibre (1675km) and microwave radio communication network (35 hilltop facilities). \n\nPrimarily they are actually in the power transmission game, but have this as kind of a side business.\n\nFrom the website, they say they allow organisations to run WANs on their carrier grade comms network, for mission critical applications.\n\nThey also operate some data centres for collocation services for the government.\n\n3 people are interviewing me, the two engineers are the 'telecommunications customer engineering and delivery team leader' and the 'major project and network engineering lead'.\n\nThis is my first interview for a role!\n\nWould love some ideas about what technical questions they are likely to ask. So far I've revised some stuff on fibre, Ethernet and transmission lines. Should I focus more on the basics? It is only an internship position after all. Thanks!!",
        "created_utc": 1507376827,
        "upvote_ratio": ""
    },
    {
        "title": "Help request for large extension cable.",
        "author": "captain_wiggles_",
        "url": "https://www.reddit.com/r/ECE/comments/74s2nn/help_request_for_large_extension_cable/",
        "text": "I know a bit about circuits and what not, but not enough for this.\n\nI live in Bolivia and work for a charity. Tomorrow we are putting on an event in a park. ELFEC the national electricity company agreed to provide us a power point. Today they turned up (last minute, that's the Bolivian way) and rigged up something on a power pole. As far as I can tell it's a breaker (no idea rated to what, with screw terminals). Of course it's not grounded, that'd be sensible.\n\nI need to wire in an extension cord and run it 50m. I'm perfectly happy dealing with screw terminals and extension cables in general so no worries on that other than the doing up a few meters up a power poll.\n\nWhat I found out today at about 1900 is that we don't have a 50m extension cable. Never mind one that can safely support ~25A. I was told our sound guy was providing it. Turns out not (Bolivia).\n\nSo first thing in the morning I need to go to the market and buy 50m of cable and the socket bit. I plan on asking what cable guage they recommend for 25A but don't have much faith that they'll be correct (either they'll be over cautious so that I spent more, or they'll just assume something overly thin).\n\nWe'll be powering speakers, amps and what not. Not much else. What do I need to know?\n\nMy instinct is that you'll all tell me to run away very very fast. Which is my natural reaction too. Except if I do that, we have no power and our event (fund raising so we can stay open for the rest of the year) goes to shit. If I don't do it no one else will, and we're screwed. I know the most about electrics, so it makes sense that I do it. I'm pretty confident I won't kill myself, I know enough to be safe (I hope).\n\nThe best guess I found is that 10 guage cable is good for 30A up to ~30m at 3% voltage drop (I have no idea how to calculate voltage drop). So I expect we need one thicker.\n\nAny help would be appreciated.",
        "created_utc": 1507340106,
        "upvote_ratio": ""
    },
    {
        "title": "Back for Another Hint: Cyclic Prefix and Multipath Delays",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/74rsag/back_for_another_hint_cyclic_prefix_and_multipath/",
        "text": "[deleted]",
        "created_utc": 1507336658,
        "upvote_ratio": ""
    },
    {
        "title": "What does an electrical engineer do at mines?",
        "author": "Zrakk",
        "url": "https://www.reddit.com/r/ECE/comments/74rhee/what_does_an_electrical_engineer_do_at_mines/",
        "text": "For example at companies like BHP, Angloamerican, etc",
        "created_utc": 1507333216,
        "upvote_ratio": ""
    },
    {
        "title": "Thevenin HW Hint",
        "author": "zocalo08",
        "url": "https://www.reddit.com/r/ECE/comments/74remy/thevenin_hw_hint/",
        "text": "Trying to find Voc and RTH, but I can't figure out how to get Voc. I found Isc to be 0.05mA. Just need a hint please.\n\nhttps://imgur.com/a/iPVgv ",
        "created_utc": 1507332366,
        "upvote_ratio": ""
    },
    {
        "title": "Ok Google and Voice Recognition Question",
        "author": "ihatemendingwalls",
        "url": "https://www.reddit.com/r/ECE/comments/74lieb/ok_google_and_voice_recognition_question/",
        "text": "Hi, I'm looking for a good resource on how passive voice recognition in cell phones works. I'm an electrical engineering major and I was talking with friends today (who aren't) about voice recognition in phones and they seemed to take the fact the phones can detect the phrase \"Ok Google,\" for example, as proof that \"they\" are constantly listening to us. I think I remember there being a post in this subreddit awhile ago about voice recognition being configured in hardware, not software, which makes sense because constantly sampling a microphone would be too much of a power draw. I'm really just looking for a good introduction to how passive listening works, and how it can be specifically configured for Ok Google and other key words, I guess.\n\nApologies if this is the wrong subreddit for this kind of question and thanks",
        "created_utc": 1507265784,
        "upvote_ratio": ""
    },
    {
        "title": "Copenhagen Wheel review: a bike that makes you feel like a superhero",
        "author": "jms_nh",
        "url": "https://www.theverge.com/2017/10/1/16379278/copenhagen-wheel-connected-bike-review",
        "text": "",
        "created_utc": 1507257672,
        "upvote_ratio": ""
    },
    {
        "title": "Recommendations for transformer and generator design textbooks",
        "author": "LimaTengo",
        "url": "https://www.reddit.com/r/ECE/comments/74koui/recommendations_for_transformer_and_generator/",
        "text": "I'm looking for some quality books on transformer and / or generator design. My university doesn't really offer any targeted classes in this area and wanted to do some self study. Any recommendations for some good textbooks out there?",
        "created_utc": 1507255586,
        "upvote_ratio": ""
    },
    {
        "title": "mV to dBmV for sinusoidal",
        "author": "sumdumquestion",
        "url": "https://www.reddit.com/r/ECE/comments/74k4po/mv_to_dbmv_for_sinusoidal/",
        "text": "Sorry all, but this is surprising hard to google.\n\nIs the 'Y' value below...\n\n 20*log(Y/1mV) = XdBmV \n\n...amplitude, peak to peak or rms?\n\nSpecifically if I have a 50mV amplitude sinusoid, is 'Y' 50(amplitude), 100 (pk to pk) or 35.35mV (rms)",
        "created_utc": 1507249293,
        "upvote_ratio": ""
    },
    {
        "title": "Online Classes",
        "author": "n1elkyfan",
        "url": "https://www.reddit.com/r/ECE/comments/74jwjg/online_classes/",
        "text": "Are there any online classes or schools that have evening classes for getting a Bachelor's degree in Electrical Engineering?",
        "created_utc": 1507246830,
        "upvote_ratio": ""
    },
    {
        "title": "Cadence component display setup",
        "author": "AllenDo",
        "url": "https://www.reddit.com/r/ECE/comments/74jfkc/cadence_component_display_setup/",
        "text": "Hi All,\nI need some help with IC 617 component display setup. \nSo far, when I annotate DC operating point, it only displays id vgs vds etc. However, I am trying to add the mosfet working \"region\" in the component display.\n\nI can not find component display in Edit menu. Can anyone help me out?\n\nThanks",
        "created_utc": 1507241943,
        "upvote_ratio": ""
    },
    {
        "title": "Amazing Techincal History : Dat Tape Drive",
        "author": "[deleted]",
        "url": "https://youtu.be/cg2fB-AysPQ",
        "text": "[deleted]",
        "created_utc": 1507233038,
        "upvote_ratio": ""
    },
    {
        "title": "Homework Hint: OFDM, How Many Subcarriers",
        "author": "Takachsin",
        "url": "https://www.reddit.com/r/ECE/comments/74hdj6/homework_hint_ofdm_how_many_subcarriers/",
        "text": "Hello, I am stumped on one of my homework problems. I'll list the problem and what I know and hopefully someone can nudge me in the right direction for whatever I'm missing. This one seems simple and I'm missing something obvious.\n\nQuestion:\n**For an 18Mbps LTE data stream with a symbol time of 66.67us, how many subcarriers are created?** \n\nIn my professors example, he calculates the number of subcarriers off the total bandwidth and the base frequency (f_b).\n\nHere I have my data rate, R = 18 Mbps and my symbol time, T_s = 66.67 us/symbol.\n\nIf I take 1/T_s, I get 15 KHz (symbols/sec), am I right in doing that? If so, I believe that would be my base frequency f_b.\n\nThat leads me to my next part of being stumped, I don't know how to take the R and f_b and transform it into the number of subcarriers. What am I missing? Any hints?\n",
        "created_utc": 1507223361,
        "upvote_ratio": ""
    },
    {
        "title": "Microcontroller ADC that can sample analog video?",
        "author": "tommytwothousand",
        "url": "https://www.reddit.com/r/ECE/comments/74gxng/microcontroller_adc_that_can_sample_analog_video/",
        "text": "Just to warn you, I'm an extreme beginner here and may not know what I'm talking about.\n\nI've got a project I'm working on in which I need to digitize composite video (yellow RCA jack common with old game systems and DVD players).\n\nTo start, I want to set up is something to sample the analog voltage from the cable and dump it as a CSV on an SD card or something. After that I can play around with the data in Matlab or python or something. I realize how hand-wavy this all sounds...\n\nI was looking at the STM Nucleo boards and noticed they have a ADC and can do 36 MHz sampling. As far as I can tell, that's a bit low for composite video but should still give me something to work with and do math on. I like this option because those boards are cheap and useful for a lot of other projects as this will only be a rough test setup.\n\nAre there any other cheap MC boards that have a good ADC onboard?",
        "created_utc": 1507219485,
        "upvote_ratio": ""
    },
    {
        "title": "Smart Force Sensing Footpad - HELP",
        "author": "Jumbo_Banana_Peels",
        "url": "https://www.reddit.com/r/ECE/comments/74gqbp/smart_force_sensing_footpad_help/",
        "text": "Hey everyone, I'm having some trouble finding small sized force/pressure sensors for a footpad on a robot. Essentially I am trying to build a footpad that will sense magnitude of ground reaction forces by designing an array of force sensors on the bottom of the foot. The goal is to make the robot self-balancing. The only problem I'm having with the force sensors is that they're way too big to fit a lot of them on the bottom of the foot to allow for a high resolution of force data. \n\nSome ideas from myself/colleagues have been to use barometric sensors with piezoresistive material or an embedded air pocket membrane to measure the force because those chips will be small enough to fit a bunch on the bottom of the foot. \n\nI would prefer to just find normal force sensors that are small enough to fit on the foot, but if I can't I'm open to any ideas y'all may have for force sensing technology! Thanks for the help from one fellow engineer to another. \n\nHere are some force sensors I found that would be great for the job but are just way too big for the scope of the project.\n[ATI F/T Sensors]\n(http://www.ati-ia.com/products/ft/ft_ModelListing.aspx)",
        "created_utc": 1507217650,
        "upvote_ratio": ""
    },
    {
        "title": "EE vs CE for control systems",
        "author": "GUYSPLEASE",
        "url": "https://www.reddit.com/r/ECE/comments/74gjkm/ee_vs_ce_for_control_systems/",
        "text": "At my university both are combined into one program, ECE, with the following differences in courses in later years: EE's will do EM waves, electronic properties of materials, electronic devices, power etc, while CE's will focus on operating systems, digital hardware, compilers, databases etc. My question is, which is better for someone interested in control theory? How do I choose?",
        "created_utc": 1507215976,
        "upvote_ratio": ""
    },
    {
        "title": "Voltage across Current/Voltage Source? Help.",
        "author": "jabbar208",
        "url": "https://i.redd.it/dm0rix8zrypz.jpg",
        "text": "",
        "created_utc": 1507188640,
        "upvote_ratio": ""
    },
    {
        "title": "confusion with convolution",
        "author": "SayonaraSunrise",
        "url": "https://www.reddit.com/r/ECE/comments/74d5nx/confusion_with_convolution/",
        "text": "Would anyone mind explaining why the convolution function involves taking an integral?  Like why do we need the area under the curve\n",
        "created_utc": 1507171096,
        "upvote_ratio": ""
    },
    {
        "title": "What makes a speaker good or bad?",
        "author": "WisconsinBadger414",
        "url": "https://www.reddit.com/r/ECE/comments/74cvc1/what_makes_a_speaker_good_or_bad/",
        "text": "If a speaker is a pretty simple device, a magnet and a cone, what aspects of it make a cheap speaker sound fuzzy vs. a more expensive speaker?",
        "created_utc": 1507167975,
        "upvote_ratio": ""
    }
]