[
    {
        "title": "Nervous about my interview tomorrow..",
        "author": "OhanaUchiha",
        "url": "https://www.reddit.com/r/ECE/comments/10uxdpu/nervous_about_my_interview_tomorrow/",
        "text": "I already posted here last week with some good responses, but now the nerves are kinda kicking in. At 12pm I have an hour long interview infront of 3 people for a hospital Electronic Service Technician position.\n\nAfter reviewing some of my material, it pretty much validated that I forgot 90% of what I was taught for my associates degree. I know for a fact if they ask me any technical questions (which I’m sure they will) I will have no fricken idea. This hospital is pretty world-renowned, but the job description is honestly pretty vague. It says that “I will need to maintain, repair, and calibrate fire alarms, security cameras, intercoms, cable TV, etc.. so maybe this job isn’t too hardcore, but fuck if I know. I’m pretty personable so there’s that, I’m also a quick learner, time-manageable, and determined, I mean I still work 40 hours a week while going to school for computer science full time. \n\nWe will see though, like I said it’s in relation to my associates degree which pays more than my current job. I graduate in a year but it would be nice getting some extra experience elsewhere under my belt!\n\nIf anyone could give me possible sample questions that would be great (:",
        "created_utc": 1675657192,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there publicly or sold schematic diagrams for google pixel phones",
        "author": "tumbwiza",
        "url": "https://www.reddit.com/r/ECE/comments/10uqnbd/are_there_publicly_or_sold_schematic_diagrams_for/",
        "text": "i have pixel 5a that seems to be shorted at one  flex connector on the board, cant repair it since i dont have a schematic diagram for that pixel 5a,  has any one came across any paid or free diagram of pixel 5a board schematic diagram?",
        "created_utc": 1675638791,
        "upvote_ratio": 1.0
    },
    {
        "title": "Final elective to take for Fall Senior year",
        "author": "Revolutionary_War749",
        "url": "https://www.reddit.com/r/ECE/comments/10ukt8g/final_elective_to_take_for_fall_senior_year/",
        "text": "So I am a EE major and I have been most interested in Signal Processing and FPGAs with the classes I have taken so far through my junior year and my internship this summer will be in the signal processing realm working on SDRs but with c++. I have already taken 2 classes in dsp ( continuous time systems and signals and am taking discrete time systems and signals right now. \n\nSo for the fall I am already planning on taking reconfigurable computing (FPGA class), computer systems and architecture, and Digital Signal and Image processing. \n\nMy last class I am unsure about and honestly can see pros and cons for both. I have narrowed my search down between Computer Networks, Stochastic processes, power electronics, and control systems. I could see benefits to taking each one and how it could help me with my goals. Which one would you take if you were in my shoes? The control systems class and the computer networks class have labs while the other two don’t. I don’t plan on getting my masters full time either after graduation if that makes a difference. Can I really go wrong here?\n\nThank you!!",
        "created_utc": 1675624740,
        "upvote_ratio": 1.0
    },
    {
        "title": "Remote Jobs for Europeans in US",
        "author": "simmaren23",
        "url": "https://www.reddit.com/r/ECE/comments/10uikdl/remote_jobs_for_europeans_in_us/",
        "text": "Hi all!\n\nI am searching for US based company that I can work for remotely from EU. Whenever I stumble across some of those, and the ad says remote, there is still some location included, which I guess means I still have to live in certain US state but can work from home. Do you know a good way to search for jobs that don't require that and where I can in fact stay in EU? \n\n\nThanks a lot!",
        "created_utc": 1675619422,
        "upvote_ratio": 1.0
    },
    {
        "title": "Taking control systems in final semester:- stupid idea?",
        "author": "NotADrooler",
        "url": "https://www.reddit.com/r/ECE/comments/10u9jui/taking_control_systems_in_final_semester_stupid/",
        "text": "Hey everyone, I'm in my final semester of electronics engineering and I've got relatively lesser classes this semester. I'm hoping to take something that can help me in my career. During my internship, I realized that I didn't take control theory systems and sucked in PID loops, frequency responses and all that jazz. It's a year 2 course but it wasn't required by my university to take up. I heard that it's not an easy course but EEE majors often take it. Is it worth it to do it? Or can I learn on the job in the future? Thanks!",
        "created_utc": 1675593026,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the significance of this delay between SDA and SCL. How do I create this delay? w/o MC;",
        "author": "dabamas",
        "url": "https://i.redd.it/aloydyx35daa1.jpg",
        "text": "",
        "created_utc": 1675579909,
        "upvote_ratio": 1.0
    },
    {
        "title": "The money or your peace?",
        "author": "mannaa_h",
        "url": "https://www.reddit.com/r/ECE/comments/10u2pn7/the_money_or_your_peace/",
        "text": "*The background to my story is that I’m 26 years old, I was in the right place and the right time with just the right experience level, EE studying his masters while working on in power generation.*\n\nMy boss is not an engineer.  My mentor is.  When I first began this position, I had my doubts if I really wanted to move to sales but I trusted my mentor who said you need to take this position because it’s a once in a lifetime opportunity.  I secured ~90k last year first year graduated with 18 months of internship experience on high profile projects.  I’m on track to make about 120-150k this year depending on how equipment lead times are doing. \n\nThe real reason I’m writing this post though is because my boss is starting to have it “out” for me more and more day after day.  I’m a foreigner so my name is hard so he continuously calls me by another name he made up.  Everybody I work with absolutely loves me but my boss consistently interacts with me as if I’m incompetent when realistically, he has no clue 95% what is going on.  So, should I let this go on and deal with it for the monies sake or should I walk away and start over again, essentially take a lower pay with peace of mind and heart?",
        "created_utc": 1675573273,
        "upvote_ratio": 1.0
    },
    {
        "title": "If anyone has experience in writing RTL for communication systems i want to ask a few questions",
        "author": "Sure_Weekend1313",
        "url": "https://www.reddit.com/r/ECE/comments/10twkqe/if_anyone_has_experience_in_writing_rtl_for/",
        "text": "",
        "created_utc": 1675558452,
        "upvote_ratio": 1.0
    },
    {
        "title": "Apple intern interview advice (wireless hw systems)",
        "author": "adamb0403",
        "url": "https://www.reddit.com/r/ECE/comments/10tep9v/apple_intern_interview_advice_wireless_hw_systems/",
        "text": "I've got a 30min interview with the hiring manager next week. Looking for advice on what technical knowledge I should have locked down, and in general what the process is like. Any other advice is more than welcome. Thanks",
        "created_utc": 1675511663,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Day for Oscilloscopes - News",
        "author": "jms_nh",
        "url": "https://www.sparkfun.com/news/5256",
        "text": "",
        "created_utc": 1675434474,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need Advice (Canadian High School Student)",
        "author": "Odd-Bed6918",
        "url": "https://www.reddit.com/r/ECE/comments/10sl480/need_advice_canadian_high_school_student/",
        "text": "\nAfter first semester, I'm probably going to be rejected from my top choice programs.\n\nFor context, I'm applying for engineering at uoft and waterloo. I'm worried about rejection as my average is a bit low. I'm trying my hardest but getting nowhere.\n\nThe main reason I want to get into either school is to eventually catapult myself into States (not necessarily FAANG). If I get rejected however, I feel like my chances are way lower at achieving this goal. I need some advice about a plan that I developed if I get rejected.\n\n1. Not worry, finish my degree at my backupschool and try to land an American job.\n\n\n\n2. Tryhard first year engineering somewhere else and get a 4.0gpa inorder to transfer into Uw or Uoft\n\n\n\n3. If idea #2 fails, then transfer into state college In the USA. Since I'm directly in the states that would increase my chance at landing an American job right?\n\n\nAll thoughts and opinions are welcome thanks.",
        "created_utc": 1675433122,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it acceptable accept an internship after you've already accepted &amp; done onboarding for another one?",
        "author": "adamb0403",
        "url": "/r/EngineeringStudents/comments/10sir8n/is_it_acceptable_accept_an_internship_after_youve/",
        "text": "",
        "created_utc": 1675425994,
        "upvote_ratio": 1.0
    },
    {
        "title": "Newsletter in Hardware Acceleration in Robotics #45",
        "author": "pablocarrera",
        "url": "https://www.reddit.com/r/ECE/comments/10sg00n/newsletter_in_hardware_acceleration_in_robotics_45/",
        "text": "[https://news.accelerationrobotics.com/hardware-acceleration-in-robotics-45/](https://news.accelerationrobotics.com/hardware-acceleration-in-robotics-45/)\n\nHardware acceleration in robotics news. ROS 2 HAWG - meeting #14, What slowdown? - December 2022 robotics investments reaches $1.14B, India and UAE need to form a strategic alliance over robotics, AMD and Intel reports fourth quarter and full year 2022 financial results",
        "created_utc": 1675415587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone recognise this one-wire signalling protocol? (Details in comment...)",
        "author": "Hjalfi",
        "url": "https://i.redd.it/aiivb37zzufa1.png",
        "text": "",
        "created_utc": 1675380235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books/Resources on audio file formats, specifically .wav formats.",
        "author": "_echo_gecko",
        "url": "https://www.reddit.com/r/ECE/comments/10rnsue/booksresources_on_audio_file_formats_specifically/",
        "text": "Im working on a project where I want to write .wav files to an SD card with an MCU. Im already succesuflly writing a data array to a csv file on the SD cars, and now need to write a driver to convert the data to a wav file. Are there any good resources/books on the wav file format.\n\n&amp;#x200B;\n\nThanks!",
        "created_utc": 1675337829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Modeling electric grid transmission lines",
        "author": "NumsgiI",
        "url": "https://www.reddit.com/r/ECE/comments/10rkf8s/modeling_electric_grid_transmission_lines/",
        "text": "I'm working on a simulation video game about electrical grids.  The idea is that players would place transmission lines and manage frequency/voltage control on the grid from various power generators.  Think something of the fidelity of Kerbal Space Program.\n\nI ultimately need to calculate an admittance matrix for the full grid and do some linear algebra on that to solve for power flow, which I feel pretty confident I can do, but to produce the admittance matrix in the first place I need to be able to model the impedance of each transmission line and I'm not sure how to do that.\n\nFrom the [EPRI Power System Dynamics Tutorial](https://www.epri.com/research/products/000000000001016042) I have formulas for calculating impedance from capacitance, inductance, and resistance, and I know generally where these quantities come from, but I don't know how to model them mathematically for transmission lines.  When try I googling for things I get a slew of different formulas for things like coaxial cables, or twin lines, instead of the arrangement you see in things like a dual 345kV transmission line.\n\nBecause this is for a game I don't need to be super accurate to real life.  I'm not interested in solving DEs or anything, just looking for some basic algebraic relationships.  I'd be happy to lift numbers from manufacturer spec sheets for hard coded line types, for instance, I just have no idea where to look for that sort of thing.",
        "created_utc": 1675324630,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I pursue this technician interview?",
        "author": "OhanaUchiha",
        "url": "https://www.reddit.com/r/ECE/comments/10r9cnj/should_i_pursue_this_technician_interview/",
        "text": "\nSo I graduated with an A.S. in Electronics &amp; Computer Engineering Technology in 2022, and now I’m pursuing a bachelors in Computer Science. I’ve been applying to 100’s of places to intern as a software developer, but as you may know the economy for that sector isn’t the best, thus the layoffs and hiring freezes. \n\nI started applying to Electronic Technician roles to just see if I would get any bites, and I was quite surprised by the responses. Right now I work only as an Electronics Assembler for $21 an hour, but a hospital wants an interview with me that ranges from $25-$40 an hour as a Electronics Service Technician. The only problem is, I forgot like %95 percent of the shit I taught in regards to circuits, using a the DMM and Oscilloscopes, etc.. \n\nI only remember what I was taught in Java, C, and Assembly because I was way more interested in it, however I feel as if I’d be stupid to not try out this interview for a better pay. I mean I know how to solder shit and I know basic electronic components like resisters, capacitors, transistors, etc.. I can also follow a schematic and blueprints, but idk the calculations at all.\n\nShould I just try the interview anyways or will I just embarrass myself for an hour?",
        "created_utc": 1675292975,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help finding a footprint for transformer",
        "author": "Khokap",
        "url": "https://www.reddit.com/r/ECE/comments/10r6pk5/need_help_finding_a_footprint_for_transformer/",
        "text": "Hello! I’m currently working on a project which consists of making a PCB for a AC/DC converter. I can’t find any transformer that would convert 220Vac to 12Vac (with center tap). I also need a footprint for that component. Where can I look for them? I’ve searched on big electronics online markets and snapeda… thanks!",
        "created_utc": 1675286822,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I pursue this technician interview?",
        "author": "OhanaUchiha",
        "url": "https://www.reddit.com/r/ECE/comments/10r5xzy/should_i_pursue_this_technician_interview/",
        "text": "So I graduated with an A.S. in Electronics &amp; Computer Engineering Technology in 2022, and now I’m pursuing a bachelors in Computer Science. I’ve been applying to 100’s of places to intern as a software developer, but as you may know the economy for that sector isn’t the best, thus the layoffs and hiring freezes. \n\nI started applying to Electronic Technician roles to just see if I would get any bites, and I was quite surprised by the responses. Right now I work only as an Electronics Assembler for $21 an hour, but a hospital wants an interview with me that ranges from $25-$40 an hour as a Electronics Service Technician. The only problem is, I forgot like %95 percent of the shit I taught in regards to circuits, using a the DMM and Oscilloscopes, etc.. \n\nI only remember what I was taught in Java, C, and Assembly because I was way more interested in it, however I feel as if I’d be stupid to not try out this interview for a better pay. I mean I know how to solder shit and I know basic electronic components like resisters, capacitors, transistors, etc.. I can also follow a schematic and blueprints, but idk the calculations at all.\n\nShould I just try the interview anyways or will I just embarrass myself for an hour?",
        "created_utc": 1675285071,
        "upvote_ratio": 1.0
    },
    {
        "title": "EEE projects knowledge gaps",
        "author": "swiTchPC",
        "url": "https://www.reddit.com/r/ECE/comments/10r4k91/eee_projects_knowledge_gaps/",
        "text": "Hi,\n\nSo I transferred onto the 2nd year of an Electronic and Computer Engineering degree from a 1st year of Physics due to shared theoretical content. However now in my 2nd year we have to undertake a team electrical engineering project creating an electric car which involves a lot of practical experience with circuit building, design and use of breadboards and complex practical skills. What would you guys say is the best way I can catch up on this experience on the others in my class which did this stuff last year? I was considering buying a breadboard and a few components to try stuff and get to grips with it but is that a good idea? If so what else is there? Thanks for any help you can give me.",
        "created_utc": 1675281915,
        "upvote_ratio": 1.0
    },
    {
        "title": "The /r/ECE Monthly Jobs Post!",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/ECE/comments/10qu5ne/the_rece_monthly_jobs_post/",
        "text": "# Rules For Individuals\n\n* **Don't** create top-level comments - those are for employers.\n* Feel free to reply to top-level comments with **on-topic** questions.\n* Reply to the top-level comment that starts with **individuals looking for work**.\n\n# Rules For Employers\n\n* The position must be related to electrical and computer engineering. \n* You must be hiring **directly**. No third-party recruiters.\n* **One** top-level comment per employer. If you have multiple job openings, that's great, but please consolidate their descriptions or mention them in replies to your own top-level comment.\n* **Don't** use URL shorteners. [reddiquette](https://www.reddit.com/wiki/reddiquette) forbids them because they're opaque to the spam filter.\n* Templates are awesome. Please use the following template. As the \"formatting help\" says, use two asterisks to **bold text**. Use empty lines to separate sections.\n* **Proofread** your comment after posting it, and edit any formatting mistakes.\n\n# Template\n\n**(copy and paste this into your comment using \"Markdown Mode\", and it will format properly when you post!)**\n\n\\*\\*Company:\\*\\* \\[Company name; also, use the \"formatting help\" to make it a link to your company's website, or a specific careers page if you have one.\\]\n\n\\*\\*Type:\\*\\* \\[Full time, part time, internship, contract, etc.\\]\n\n\\*\\*Description:\\*\\* \\[What does your company do, and what are you hiring electrical/computer engineers for? How much experience are you looking for, and what seniority levels are you hiring for? The more details you provide, the better.\\]\n\n\\*\\*Location:\\*\\* \\[Where's your office - or if you're hiring at multiple offices, list them. If your workplace language isn't English, please specify it.\\]\n\n\\*\\*Remote:\\*\\* \\[Do you offer the option of working remotely? If so, do you require employees to live in certain areas or time zones?\\]\n\n\\*\\*Visa Sponsorship:\\*\\* \\[Does your company sponsor visas?\\]\n\n\\*\\*Technologies:\\*\\* \\[Give a little more detail about the technologies and tasks you work on day-to-day.\\]\n\n\\*\\*Contact:\\*\\* \\[How do you want to be contacted? Email, reddit PM, telepathy, gravitational waves?\\]",
        "created_utc": 1675256408,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi new to this group. Trying to get info on how I can start repairing these types of boards Or get certify to repair them. Any info would be good. thanks.",
        "author": "br032091",
        "url": "https://i.redd.it/0s0nydqycjfa1.jpg",
        "text": "",
        "created_utc": 1675221287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bandgap Reference",
        "author": "SnooRobots3735",
        "url": "https://www.reddit.com/r/ECE/comments/10qelpz/bandgap_reference/",
        "text": "Hi all! I am studying for upcoming interviews for internships and trying to solve some legacy questions from previous failing ones. So I was asked about bandgap reference:\n\n* What would affect the performance of the bandgap reference, and how to improve its performance accordingly? \n* Are there any general design principles for bandgap references?\n\nCan anyone give me some hints or explanations on the problems? I just started my graduate study, still very green in analog design. Any thoughts would be appreciated!",
        "created_utc": 1675209277,
        "upvote_ratio": 1.0
    },
    {
        "title": "Project ideas for designing a digital system",
        "author": "Fats_Runyan2020",
        "url": "https://www.reddit.com/r/ECE/comments/10qbj8j/project_ideas_for_designing_a_digital_system/",
        "text": "I am a college student who is currently taking a digital logic design course. We are to design a digital system as our final project and I want some ideas thrown at me that would be fun, super cool, and challenging for me and my team to brainstorm and determine if we want to do that idea as our project. To help out I will copy and paste the project description and requirements.   \n\n\n**This project involves designing a digital system (also called special-purpose processors) that performs a meaningful  function. The project can take two forms: ✓ External Interface based: Here, a great deal of the project involves interfacing to peripherals on the Nexys-4 DDR (e.g.: VGA connector, temperature sensor, accelerometer), and/or other peripherals that will be connected to the Nexys\u00024 DDR (e.g.: ultrasonic rangefinders, LCDs). ✓ Architecture based: Here, the focus is on developing architectures tailored to a specific application (e.g.: image processing, computer arithmetic, signal processing, and communications). The external interfacing effort is minimal  and just enough to demonstrate the functioning of the system** \n\n **The Control and Datapath must be clearly identified in the Final Presentation. ▪ The team must include a testbench to verify the digital system (or the main portion). ▪ The system must include an external interface that demonstrates the functioning of your digital system**   \n\n\nFor the class I have a Nexys A7 Artix-7 FPGA Trainer board if that helps. Given in the document the professor gave to us is some project ideas, which I will also copy down, so please have ideas be different than the ideas i already listed. Thanks very much.   \n\n\n**1. Digital Alarm using a variety of sensors.**   \n**2. Digital Stopwatch/Timer with minutes, seconds, hundredths of seconds (or tenths of seconds, this can be an option).  Options: Start, Pause, Reset.**   \n**3. Reading/Writing data via serial interface (UART).**  \n**4. Banner on 7-segment displays.**  \n**5. Architecture for Matrix Multiplication (2x2 or 3x3) for unsigned/signed numbers.**   \n**6. Simple Calculator: Keypad/Keyboard and Display.**   \n**7. Sonar Sensor Control.**   \n**8. Traffic light controller.**   \n**9. BCD to Binary conversion architecture.**   \n**10. A simple game using an input interface (switches, push-buttons, etc) and a VGA screen as an output interface.**   \n**11. Design of a Small Microprocessor: Design the ALU, control unit, and instruction set. The User Interface is in charge of  loading instructions and displaying results.**   \n**12. LCD control with input data sent via an external interface (e.g.: UART).**   \n**13. Color control using an RGB LED with PWM: Use temperature sensors, accelerometers, and switches to finely control colors.**",
        "created_utc": 1675201639,
        "upvote_ratio": 1.0
    },
    {
        "title": "Project Ideas for Digital Logic Design",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1675200941,
        "upvote_ratio": 1.0
    },
    {
        "title": "SMBus with multiple batteries?",
        "author": "Tanky321",
        "url": "https://www.reddit.com/r/ECE/comments/10q90vu/smbus_with_multiple_batteries/",
        "text": "Hi all,\n\nWorking on a system for powering an embedded PC. We're using 2 batteries, which internally have 2 12V sections each. Each of those sections then has its own SMBus.\n\nI'm at a loss as to how to get data from all 4 battery SMBus into the PC. I believe each battery has the same address (0x0B). Normally, if this was a microcontroller I would use a mux. However I assume I would need some sort of custom firmware driver on the PC to implement a mux with the batteries?\n\nI have looked at the [LTC1760](https://www.analog.com/media/en/technical-documentation/data-sheets/1760fc.pdf) which is good for two SMBus batteries, but again, we're at 4 SMBus batteries...\n\nAny thoughts as to how I could accomplish this?",
        "created_utc": 1675195734,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know the name of this connector? It is meant to be connected to a strain gauge signal amplifier and a google search doesn't give me the exact item - the pins aren't protruding but the ones on google seem to be protruding out.",
        "author": "jithization",
        "url": "https://i.redd.it/mg5a8ahy7ffa1.png",
        "text": "",
        "created_utc": 1675189904,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to look for an internship?",
        "author": "Littleonesmind180",
        "url": "https://www.reddit.com/r/ECE/comments/10q5gjo/where_to_look_for_an_internship/",
        "text": "I’ve been trying to get an internship for the summer, but I’m at a lost of where to search. This year I’ve mostly used Handshake to find internships but after the fall semester a lot of internships been removed so it seems more difficult to find something I may be interested in trying. I’ve applied to 50-70 apps and only got 1 interview, so would it just be best to apply to anything and everything?  \n I know a common way to possibly find an internship is through professors, but I don’t feel I have an adequate relationship with them to really ask…",
        "created_utc": 1675187280,
        "upvote_ratio": 1.0
    },
    {
        "title": "new to multisim, need a bit of guidance",
        "author": "Scared_Will4882",
        "url": "https://www.reddit.com/r/ECE/comments/10q5aaw/new_to_multisim_need_a_bit_of_guidance/",
        "text": "I basically need to do a lab in multisim, im completely unfamiliar with the software and the prof has just thrown the program at us with videos that don't explain enough from 9 years ago :( \n\nI've researched a bit on my own, got a supply and resistor up and running. I'm not sure if theres a way for me to setup these nodes a, b, c , d and e, or if im supposed to just get a multimeter within the program and measure at those nodes directly.  im also not even sure if the current is running or if i've replicated the schematic perfectly. \n\n&amp;#x200B;\n\ntldr: new to multisim/circuit analysis, need some help or advice\n\nhttps://preview.redd.it/cks7v09h0ffa1.png?width=758&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=ea450298736818859c5b2412758c764c92f10555\n\nhttps://preview.redd.it/ris3ij3j0ffa1.png?width=499&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=9cc08935ab7051b9382eb71c451b4a9b82756851",
        "created_utc": 1675186865,
        "upvote_ratio": 1.0
    },
    {
        "title": "30A AC Soft Starter (Inrush Current Limiter) Circuit with Fail-Safe",
        "author": "MyVanitar",
        "url": "https://www.youtube.com/watch?v=_QyYtV-IEO8",
        "text": "",
        "created_utc": 1675178476,
        "upvote_ratio": 1.0
    },
    {
        "title": "AC Power Analysis",
        "author": "Spiritual-Address960",
        "url": "https://youtu.be/W6qBkWCAMQY",
        "text": "",
        "created_utc": 1675173135,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does a good BLE MCU with an integrated 16-bit ACD exist ?",
        "author": "TapinDeNoel",
        "url": "https://www.reddit.com/r/ECE/comments/10pvtbw/does_a_good_ble_mcu_with_an_integrated_16bit_acd/",
        "text": "Hi ! I'm looking for a microcontroler that can deal with bluetooth low energy and have a 16-bit ADC (For 4 hall sensors, output signal From 0 to 5V) \nNow i'm working with a NRF52832 and an 16-bit ADC, for a wearable device that need to be as small as possible... And that take so much space !\nSo, i'm looking for a good 2-in-1 solution but I'm not convinced about what I can find. STM32WB55CGU6TR is for now the best I've found but I'm not even sur having an integrated ADC is a really good thing. Does someone know things about that ? 😅 \nThank you !",
        "created_utc": 1675161320,
        "upvote_ratio": 1.0
    },
    {
        "title": "DIY Two-Wheeled Self-Balancing Robot Project. I have shared all project files &amp; documents as an open-source project on GitHub link given at comment. You may watch second episode on my channel.",
        "author": "limenitisreducta",
        "url": "https://www.youtube.com/watch?v=BpkBKpQU4LM",
        "text": "",
        "created_utc": 1675122460,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bidirectional level shifter with I2C.",
        "author": "tjdiaz98",
        "url": "https://www.reddit.com/r/ECE/comments/10phk84/bidirectional_level_shifter_with_i2c/",
        "text": "Hello! I'm working on a circuit that has I2C communication between two componentes. These components work with different voltages: 3.3V and 1.8V and both have an I2C bus. So, in order to make the communication possible between them, I wanted to use a Level Shifter as shown in the image. These is a typical Level Shifter, usually used with a BS138 MOSFET but I changed it because of the voltage levels that I have to shift. I considered a Mosfet with low parasitic capacitance so it would not slow down.  \n\nThe question that I have regarding these topology is if the pull-up resistors of the level shifter (R24 and R25) would work also as pull-up resistors of the I2C lines. I have seen the level shifter being used for SPI but not for I2C.\n\n&amp;#x200B;\n\n[Level shifter used. Also in SDA line.](https://preview.redd.it/8hphpyigl9fa1.png?width=883&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=b69656d71ffd2d77efe87ba8b6a5ccfabec76223)\n\nIn this [link](https://electronics.stackexchange.com/questions/367052/replace-bss138-with-ao3400a-in-level-shifter-circuit) there is an answer in a forum that explains how the level shifter works.",
        "created_utc": 1675121132,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to get NMOS schematics of common logic components",
        "author": "benipoo",
        "url": "https://www.reddit.com/r/ECE/comments/10pgolw/where_to_get_nmos_schematics_of_common_logic/",
        "text": "If I wanted to make a counter for counting 0 to 7, there exists a minimized NMOS schematic that will do this. Is there any source that has these types of minimized schematics?\n\nI don't want to do all the K-maps if I don't absolutely have to.",
        "created_utc": 1675118989,
        "upvote_ratio": 1.0
    },
    {
        "title": "good non profit organisations to do with electronics or electrics?",
        "author": "westbob21",
        "url": "https://www.reddit.com/r/ECE/comments/10pf9nf/good_non_profit_organisations_to_do_with/",
        "text": "hi, im an 19yo electronics student studdying in france looking for an internship for my second year of my bachelors degree, i was considering looking for a non profit organisation involved in electronics or electrics that wouldnt mind taking me in for 10 weeks somewhere that could really use an extra hand, i dont mind where it is, in fact travelling is perfect.\n\nBut getting to the point i was just wondering, seeing that the internet is flooded with all sorts, if anyone has any experience in this sort of thing and could give me a couple of tips or pointers, refences or even straight up offers if any ?\n\nIn any case thank you for your time. hope you all have a wonderful day :)",
        "created_utc": 1675115634,
        "upvote_ratio": 0.99
    },
    {
        "title": "Looking for help finding a specialized sensor.",
        "author": "1Certified1",
        "url": "https://www.reddit.com/r/ECE/comments/10pelzr/looking_for_help_finding_a_specialized_sensor/",
        "text": "For a project I'm looking to begin I've been searching for a infrared equivalent to a photo resistor which measures from 800 - 1800nm which the intensity of incoming light within those wavelengths can be read via a microcontroller. Any tips or advice on what I should be looking for would be greatly appreciated.",
        "created_utc": 1675114107,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Historical Engineer] Oliver Heaviside: The Self-taught Pioneer of Electromagnetism and Vector Calculus",
        "author": "allaboutcircuits",
        "url": "https://www.allaboutcircuits.com/news/oliver-heaviside-self-taught-pioneer-electromagnetism-vector-calculus/",
        "text": "",
        "created_utc": 1675099273,
        "upvote_ratio": 1.0
    },
    {
        "title": "In demand job for ECE",
        "author": "zelzky15",
        "url": "https://www.reddit.com/r/ECE/comments/10p6k0x/in_demand_job_for_ece/",
        "text": "Hi. I am a graduating Electronics Engineering student. I am now starting to attend webinars regarding to the field I want which is either in telecommunications or Network. I just want to know which is more in demand field between the 2? Thank you in advance.",
        "created_utc": 1675094857,
        "upvote_ratio": 1.0
    },
    {
        "title": "Listing a group project on my Resume",
        "author": "Visible-Tomato1892",
        "url": "https://www.reddit.com/r/ECE/comments/10p5mdi/listing_a_group_project_on_my_resume/",
        "text": "So I worked on a huge 3 month long project that involved about 6 members working in different departments. I was part of the firmware team, while there was also a hardware team that worked on PCB Design, MOSFETS etc. \nSo I came across a job opening that had requirements for both firmware skills in C as well as hardware skills.\nMy question is whether I should specifically mention on the resume that I worked only on the firmware and not mention about the PCB design stuff, cause the role seems to be more suited for someone with much more hardware skills.",
        "created_utc": 1675092579,
        "upvote_ratio": 1.0
    },
    {
        "title": "NCG Full-time Offer ADI and Renesas: How to choose for DV position?",
        "author": "UnderstandingFew7118",
        "url": "https://www.reddit.com/r/ECE/comments/10ojbag/ncg_fulltime_offer_adi_and_renesas_how_to_choose/",
        "text": "Hi,\n\nRecently, I got two NCG full-time offers for the DV position for their mixed signal products not the pure digital DV. Since the field is too small, I don't mention the details. But, in general which company has better career?\n\n&amp;#x200B;\n\nThanks.",
        "created_utc": 1675028006,
        "upvote_ratio": 1.0
    },
    {
        "title": "Understanding the MIPS Assembly Language Instruction",
        "author": "FitBill2006",
        "url": "https://www.reddit.com/r/ECE/comments/10oj6nn/understanding_the_mips_assembly_language/",
        "text": "I am trying to understand a MIPS assembly program and I wanted to confirm if I have understood the task correctly. Can someone please help me out with this?\n\nHere are the instructions I have received:\n\nThe task is to write a subroutine 'time2string' to convert the value stored at memory location pointed to by $a1 (in NBCD format) into a string representation. The string representation should be stored in memory location pointed to by $a0.\n\nThis is the code I have attempted so far:\n\n`time2string:`\n\n`# Extract NBCD-coded minutes/seconds from $a1.`\n\n`andi $t0, $a1, 0xF000 # $t0 = zeros concat with most significant`\n\n`sra $t0, $t0, 12 # NBCD-coded digit (tens of minutes)`\n\n`andi $t1, $a1, 0xF00 # $t1 = zeros contact with second most significant`\n\n`sra $t1, $t1, 8 # NBCD-coded digit (minutes)`\n\n`andi $t2, $a1, 0xF0 # t2 = zeros concat with second lest significant`\n\n`sra $t2, $t2, 4 # NBCD-coded digit (tens of seconds)`\n\n`andi $t3, $a1, 0xF # t3 = zeros concat with least significant`\n\n`# NBCD-coded digit (seconds)`\n\nHere is the rest of the code for context:\n\n`# timetemplate.asm`\n\n`# Written 2015 by F Lundevall`\n\n`# Copyright abandonded - this file is in the public domain.`\n\n`.macro PUSH (%reg)`\n\n`addi $sp,$sp,-4`\n\n`sw %reg,0($sp)`\n\n`.end_macro`\n\n`.macro POP (%reg)`\n\n`lw %reg,0($sp)`\n\n`addi $sp,$sp,4`\n\n`.end_macro`\n\n`.data`\n\n`.align 2`\n\n`mytime: .word 0x5957`\n\n`timstr: .ascii \"text more text lots of text\\0\"`\n\n`.text`\n\n`main:`\n\n`# print timstr`\n\n`la $a0,timstr`\n\n`li $v0,4`\n\n`syscall`\n\n`nop`\n\n`# wait a little`\n\n`li $a0,2`\n\n`jal delay`\n\n`nop`\n\n`# call tick`\n\n`la $a0,mytime`\n\n`jal tick`\n\n`nop`\n\n`# call your function time2string`\n\n`la $a0,timstr`\n\n`la $t0,mytime`\n\n`lw $a1,0($t0)`\n\n`jal time2string`\n\n`nop`\n\n`# print a newline`\n\n`li $a0,10`\n\n`li $v0,11`\n\n`syscall`\n\n`nop`\n\n`# go back and do it all again`\n\n`j main`\n\n`nop`\n\n`# tick: update time pointed to by $a0`\n\n`tick: lw $t0,0($a0) # get time`\n\n`addiu $t0,$t0,1 # increase`\n\n`andi $t1,$t0,0xf # check lowest digit`\n\n`sltiu $t2,$t1,0xa # if digit &lt; a, okay`\n\n`bnez $t2,tiend`\n\n`nop`\n\n`addiu $t0,$t0,0x6 # adjust lowest digit`\n\n`andi $t1,$t0,0xf0 # check next digit`\n\n`sltiu $t2,$t1,0x60 # if digit &lt; 6, okay`\n\n`bnez $t2,tiend`\n\n`nop`\n\n`addiu $t0,$t0,0xa0 # adjust digit`\n\n`andi $t1,$t0,0xf00 # check minute digit`\n\n`sltiu $t2,$t1,0xa00 # if digit &lt; a, okay`\n\n`bnez $t2,tiend`\n\n`nop`\n\n`addiu $t0,$t0,0x600 # adjust digit`\n\n`andi $t1,$t0,0xf000 # check last digit`\n\n`sltiu $t2,$t1,0x6000 # if digit &lt; 6, okay`\n\n`bnez $t2,tiend`\n\n`nop`\n\n`addiu $t0,$t0,0xa000 # adjust last digit`\n\n`tiend: sw $t0,0($a0) # save updated result`\n\n`jr $ra # return`\n\n`nop`\n\n`# you can write your code for subroutine \"hexasc\" below this line`\n\n`#`\n\n`hexasc:`\n\n`andi $v0,$a0,0xf # save only low 4 bits`\n\n`addi $v0,$v0,0x30 # turn into ASCII`\n\n`ble $v0,0x39,L2 # if it's &gt; ASCII '9'`\n\n`addi $v0,$v0,7 # add additional 7 for 'A'-'F'`\n\n`L2:`\n\n`jr $ra`\n\n`stop: j stop # stop after one run`\n\n`nop # delay slot filler (just in case)`\n\n`delay: jr $ra`\n\n`nop`\n\n`time2string:`\n\n`# Extract NBCD-coded minutes/seconds from $a1.`\n\n`andi $t0, $a1, 0xF000 # $t0 = zeros concat with most significant`\n\n`sra $t0, $t0, 12 # NBCD-coded digit (tens of minutes)`\n\n`andi $t1, $a1, 0xF00 # $t1 = zeros contact with second most significant`\n\n`sra $t1, $t1, 8 # NBCD-coded digit (minutes)`\n\n`andi $t2, $a1, 0xF0 # t2 = zeros concat with second lest significant`\n\n`sra $t2, $t2, 4 # NBCD-coded digit (tens of seconds)`\n\n`andi $t3, $a1, 0xF # t3 = zeros concat with least significant`\n\n`# NBCD-coded digit (seconds)`\n\n`# Save necessery overwritten constants.`\n\n`move $t4, $a0 # $t4 = memory address for time2string output`\n\n`move $t5, $ra # $t5 = return address to main`\n\n`# Convert NBCD-coded minutes/seconds to ASCII-coded digits.`\n\n`# Arrange ASCII-coded minutes/seconds into the above specified sequence of`\n\n`# characters in the area of memory pointed to by $t4 = $a0.`\n\n`move $a0, $t0 # a0 = NBCD-coded tens of minutes digit`\n\n`jal hexasc # $v0 = ASCII-coded tens of minutes digit`\n\n`nop`\n\n`sb $v0, 0($t4) # store 8 least significant bits of $v0 at mem[reg($t4)]`\n\n`move $a0, $t1 # $a0 = NBCD-coded minutes digit`\n\n`jal hexasc # $v0 = ASCII-coded minutes digit`\n\n`nop`\n\n`sb $v0, 1($t4) # store 8 least significant bits of $v0 at`\n\n`# mem[reg($t4 + sgnxt(1)]`\n\n`li $t6, 0x3A # $t6 = ASCII-code for colon`\n\n`sb $t6, 2($t4) # store 8 least significant bits of $t6 at`\n\n`# mem[reg($t4 + sgnxt(2)]`\n\n`move $a0, $t2 # $a0 = NBCD-coded tens of seconds digit`\n\n`jal hexasc # $v0 = ASCII-coded tens of seconds digit`\n\n`nop`\n\n`sb $v0, 3($t4) # store 8 least significant bits of $v0 at`\n\n`# mem[reg($t4 + sgnxt(2)]`\n\n`move $a0, $t3 # $a0 = NBCD-coded seconds digit`\n\n`jal hexasc # $v0 = ASCII-coded seconds digit`\n\n`nop`\n\n`sb $v0, 4($t4) # store 8 least significant bits of $v0 at`\n\n`# mem[reg($t4 + sgnxt(3)]`\n\n`li $t6, 0x00 # $t6 = ASCII-code for NUL`\n\n`sb $t6, 5($t4)`\n\n`jr $t5`\n\nI just wanted to confirm if my approach is correct and if there is anything I need to add or change. Thank you for your help.",
        "created_utc": 1675027709,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Re?)learning introductory level digital design",
        "author": "alwonn",
        "url": "https://www.reddit.com/r/ECE/comments/10o7i02/relearning_introductory_level_digital_design/",
        "text": "Hi everybody,\n\nI had some trouble in my personal life along a string of mental health issues, leading me to do poorly for my first year of academics. As a result, I took a break for a semester but I’m going back in a week to start my spring semester (I really needed this break and I am feeling much better, really excited!). I am unable to take any ECE courses this semester as the classes I need to take are only offered during fall semesters.\n\nAs of now, I’m aiming to go into computer architecture but my foundational knowledge is extremely lacking because I struggled really badly my first year and I feel as though I’ve barely retained any material. My course load is *very* light this semester, so I want to use the extra time I have to try and relearn introductory level digital design on my own. Any ideas where to start? I’m treating it as though I’m starting from fresh to make sure I really nail it down.\n\nI’m also thinking about doing a project alongside my self-teaching to further cement the material. Any ideas for something that I could do?",
        "created_utc": 1674998445,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am preparing my Into into Electrotechnics exam and this question is troubling me, I just can't figure out the equivalent resistance between A and B. It's one of the only examples where we don't have a solution anywhere, so if someone could help I would be thankful.",
        "author": "Sugomakafle",
        "url": "https://i.redd.it/3jn4lw4ezyea1.png",
        "text": "",
        "created_utc": 1674992594,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need Help.",
        "author": "ConfusedExplorer41",
        "url": "https://www.reddit.com/r/ECE/comments/10o1av3/need_help/",
        "text": "I want to develop a Project which has some of the following features. \nIt is installed on car dashboard,  which will act as an infotainment system, will control the wipers (via servo motors in prototype), can control headlights, can notify the driver when any vehicle is in front of it (via ultrasonic sensors in prototype), control a fan in car and similar such features.\nMy question is , I don't want to use Arduino.\nCan I prepare such an project using STM32, or ARM, or PIC , bare metal programming etc? I NEED GUIDANCE.  Thanks.",
        "created_utc": 1674974969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Arduino Nano Humidity Sensor Shield",
        "author": "TieGuy45",
        "url": "https://v.redd.it/2x8px06layea1",
        "text": "",
        "created_utc": 1674966997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it bad that I don't like coding?",
        "author": "LocalDumbPerson",
        "url": "https://www.reddit.com/r/ECE/comments/10nyb1i/is_it_bad_that_i_dont_like_coding/",
        "text": "Hi, I've been reading reddit for a bit and it seems that EE jobs tend to require a lot of coding for their work. I'm worried since I'm not really the best coder and I don't like doing it. Will this negatively impact me for jobs?",
        "created_utc": 1674964755,
        "upvote_ratio": 1.0
    },
    {
        "title": "First job questions EE",
        "author": "JustDinner1658",
        "url": "https://www.reddit.com/r/ECE/comments/10nxr9w/first_job_questions_ee/",
        "text": "Hi all,\n\nI’m graduating in May and recently got an offer for an EE position in Power Industry. My concern is that the technical skills I will be gaining from this job don’t seem to be transferrable to other industries. I don’t really want to get stuck in an industry early on in my career, especially I also have interest in DS (which I have a minor in). I also don’t want to restart with an entry level job in a few years if I stay in EE either. Have any of you guys been in the same boat? Am I overthinking?",
        "created_utc": 1674962972,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone help with part (a)?",
        "author": "MarkatosLogosTimis",
        "url": "https://www.reddit.com/r/ECE/comments/10nuk47/can_someone_help_with_part_a/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/e6ct134aqvea1.png?width=568&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=f6061dd77c0bc728f06fa2bd137540fb0650d382",
        "created_utc": 1674953248,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reason why metal contacts fabricated via lift-off electron-beam lithography turn out to be much wider than expected (200-250 nm vs 40-50 nm) when analyzed with AFM?",
        "author": "Mooorshum",
        "url": "https://www.reddit.com/r/ECE/comments/10nsq1i/reason_why_metal_contacts_fabricated_via_liftoff/",
        "text": " Hi everyone! I'm currently in the midst of my exams, and there is this problem from my nanotechnology course I am having some trouble finding any info on.\n\nWould be grateful if anyone here has ideas on why this could happen or could provide papers covering this topic. Cheers!",
        "created_utc": 1674948195,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made Hans Niemann’s chess device as a shoe insole! It uses an AVR-based microcontroller connected via Bluetooth to a chess engine",
        "author": "talking_mushrooms",
        "url": "https://www.reddit.com/gallery/10nrwsp",
        "text": "",
        "created_utc": 1674946070,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Programming skills valuable during hiring",
        "author": "amitxxxx",
        "url": "https://www.reddit.com/r/ECE/comments/10nghxz/is_programming_skills_valuable_during_hiring/",
        "text": "I'm an EEE student. I have decent programming skills in C and C++(I practice on codeforces). \nIs my programming profile going to have any value during recruitment process of an electronics company(sat TI or Intel etc)? Is there any demand for programming in electronic? I have done some embeddedd projects using Arduino and STM32. \nI'm asking if coding profile taken in isolation provide any value to a CV in electronics companies?",
        "created_utc": 1674916563,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for advice on beginner material (books, video classes)",
        "author": "Few-Chipmunk-5957",
        "url": "https://www.reddit.com/r/ECE/comments/10nc8tr/looking_for_advice_on_beginner_material_books/",
        "text": "I'm a mechanical aircraft mechanic by trade. I don't have any dealings with electrical but I've always found it fascinating. As I'm getting older (just turned 30) I want to go multi-skilled in both mechanical and electrical.\n\nI have a keen interest in computer electronics such as; repair and fault finding for systems.\n\nWhere would you guys recommend I start? I have very basic electronics knowledge from about 11 years ago so I'd like to start from the very beginning again.\n\nThank you.",
        "created_utc": 1674902489,
        "upvote_ratio": 1.0
    },
    {
        "title": "EE PhD interview advice",
        "author": "da42boi",
        "url": "https://www.reddit.com/r/ECE/comments/10mzy6b/ee_phd_interview_advice/",
        "text": "Hello everyone! I'm a final-year EE undergrad in India and have applied to a mix of PhD and Master's programs in the U.S. and Canada. I was recently invited to an interview with a professor at one of the programs that I applied to for a PhD (field: power electronics). He has asked me to prepare a 20-minute presentation on a topic of my choice, after which I will be asked a couple of technical questions. Does anyone have any idea what kind of questions I can expect? Will they be related to the presentation or my projects/experience (planning to base the presentation on one of them), or will they be random power electronics questions? Also, I'd be grateful if someone could give me a couple of sample technical questions from PhD interviews (from any field within EE, not limited to power electronics), just for me to get an idea of the difficulty level. Thanks in advance.",
        "created_utc": 1674863066,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why a synchronous generator can service during a bolted short circuit across its output terminals?",
        "author": "carlewis",
        "url": "https://www.reddit.com/r/ECE/comments/10mzwyb/why_a_synchronous_generator_can_service_during_a/",
        "text": "",
        "created_utc": 1674862983,
        "upvote_ratio": 1.0
    },
    {
        "title": "I command ChatGPT AI To Write Arduino Code in 2023 | ChatGPT absolutely DOMINATES Arduino coding",
        "author": "Electronics_is_Fun",
        "url": "https://youtu.be/imC8WV4E4N4",
        "text": "",
        "created_utc": 1674847300,
        "upvote_ratio": 1.0
    },
    {
        "title": "Creating a small map with \"landmarks\" using a drone and a jetson",
        "author": "turkishjedi21",
        "url": "https://www.reddit.com/r/ECE/comments/10mt5ai/creating_a_small_map_with_landmarks_using_a_drone/",
        "text": "I'm just looking for some next steps with a project I am working on. Its for a competition coming up in a couple months, as well as my second semester of capstone. \n\nWe are given a drone and not allowed to modify it in any way. It can be controlled by a ground robot that we build ourselves. Both vehicles are autonomous, and the robot needs to navigate to several boxes in a specific order. Boxes have a QR code on top designating which box they are (only the drone can see these due to their location), and a QR code on the inside designating what the next box is (only the robot can see these due to their location). Entrances to boxes are marked with red tape, and the 20'x30' area is marked with red tape as well.\n\nThe general approach is to first have the drone ascend, and take pictures of the play area, first locating the bounds of it and any boxes it can detect. Keep in mind the \"detection\" is done by the jetson on the robot, the drone simply sends video or pictures and takes commands from the jetson. \n\nNow, I'm at a point where I can stitch images together, and filter out everything that isn't a specific color across this stitched image. This is crucial for locating the colored boundary of the play area.\n\nThe most difficult part of the general play area surveying is the fact that the drone only has 1 front-facing camera (as opposed to one that looks at the ground), as well as mediocre camera quality. \n\nAn ideal product with surveying would be to have the drone navigate to the middle of the play area, slowly turning in a circle snapping photos, sending them to the robot to stitch together. Then, the robot would see the bounds of the play area, and generate a 3d model of the play area. The last part I don't think is feasible. A more realistic idea in my mind would be bounding the play area, and scanning  each QR code, mapping the general area of the box with that QR code (a 2d map). This way the robot has x,y coordinates of each box. This also brings up another challenge which is to navigate to each box during the surveying stage.\n\nI'm really just wondering what some good paths forward are. I do at some point need to get QR code detection working and the ability to generate some sort of map. The latter has a lot of parts to it, including box detection, box entrance detection, etc",
        "created_utc": 1674846604,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice navigating a job offer with my current employer",
        "author": "job_offer_throwaway_",
        "url": "https://www.reddit.com/r/ECE/comments/10mnozj/advice_navigating_a_job_offer_with_my_current/",
        "text": "I work for a large tech company, doing software engineering/data science/hardware development. I have worked for this company for around 8 years, and I enjoy my job and my coworkers. I am paid well for my region. I have other friends in the area who work in the same field, and recently I began to realize that, given my skill level/expertise, I could probably be making a better paycheck working for one of the other companies in the area.\n\nOne of my friends approached me with a referral to a local team that is hiring. I figured, I can always interview and see what the position and pay would be; I don’t have to take a new job if the fit isn’t good or if the pay isn’t enough. I interviewed with this second company, and I very much expect that I will be getting a generous job offer. \n\nSo, I am looking for help navigating this upcoming situation. I would be happy to work for the Company 2, but would also be happy to stay in my current position if my employer is willing to match/beat the offer. Can anyone provide some advice on the best way forward, both financially and to make sure I don’t burn bridges?\n\n1.\tIf I get an offer from Company 2, my plan is to take this offer to Company 1 (current employer) and see if they are able to counter/beat the offer.\n\n2.\tIf given a counter, I would then go back to Company 2, and ask for “their best offer”. I am not sure, but I don’t want to keep going back and forth indefinitely, as I fear this could ostracize my current employer. If Company 2 can’t increase the offer to beat my current employer, then it ends here.\n\n3.\tIf I do get a better offer, I can go back to my current employer one final time, and ask if they can beat my second job offer. If they can, then I can stay where I am. If not, then I can take a new position at Company 2.\n\nI have a lot of anxiety, as my current employer, Company 1, is the only “real” job I’ve ever had, straight out of college. I don’t want to burn bridges with my current employer or my team, so I am hoping to get any advice on how to best move forward. Even nitty gritty details; how do I approach my manager, should I have the offer in hand, how much time should I give them to counter, etc.",
        "created_utc": 1674833595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting fired or paranoid?",
        "author": "Bassoonegg",
        "url": "https://www.reddit.com/r/ECE/comments/10mmi4z/getting_fired_or_paranoid/",
        "text": "Hey Reddit! \n\nLooking for advice about being worried I might get fired. To preface this: I live with BPD, so experiencing anxiety and being a bit paranoid / overthinking is pretty common for me.\n\n I work as an Educator at a school and work with Kinders to about grades 3-6, no degree or anything but very qualified, however I still have a lot to learn and am in University. I struggle a lot when it comes to being strict and putting my foot down, but I always try. Its like I just don’t know how to because Im worried about overstepping.\nI’ve always been told Im too nice and struggle with being firm but Im trying and just dont know how to do it properly. \n\nAnyways, this job is amazing. My best friend is my boss, my other close friend is a coworker of mine, and its really close to my home. But I can’t shake the feeling that Im going to get fired. \n\nWhen I had to take time off to escape an abusive situation they were so supportive, when I had cancer they were supportive and when I was struggling too much to get to work, I left for 2 years and then they just recently welcomed me back when I asked to return. I appreciate my job so much and do not want to let them down because they have been amazing to me.\n\nWithin this though, I also bus to work. And the bussing in my city is horrendous. Busses dont show up half the time, and it makes me late for work more often than not. So I’ve arrived late a lot. However they’ve always been understanding. Anyways,\n\nLong story short I worked with Kinders, and then my boss switched me after a month or two, to an older class because she said she thinks itll be a better fit. I expressed myself a lot that I physically couldnt do it so my partner said they were actually just trying to support me. But Idk. \n\nUsually I start at 2:30, but on the schedule when they changed it , it said 2:45 so I aimed for that time. When I arrived however they said I was actually still supposed to arrive at 2:30 and I felt really bad. My boss didn’t seem mad or anything but just tense. Im trying not to personalize it because shes running an entire \nprogram, but its hard. \n\nI also called in yesterday because there was really awful weather and I didnt feel safe taking the bus. But I offered to come in for extra hours today to make it up. \n\nI think its all in my head, but I really depend on this job to live and am just so scared Im going to get fired. Any advice or tips? I also know this message is a bit chaotic so I hope it made sense.\n\nThanks everyone!",
        "created_utc": 1674830618,
        "upvote_ratio": 1.0
    },
    {
        "title": "Newsletter in Hardware Acceleration in Robotics #44",
        "author": "pablocarrera",
        "url": "https://www.reddit.com/r/ECE/comments/10miwil/newsletter_in_hardware_acceleration_in_robotics_44/",
        "text": "[https://news.accelerationrobotics.com/hardware-acceleration-in-robotics-44/](https://news.accelerationrobotics.com/hardware-acceleration-in-robotics-44/)\n\n  \nHardware acceleration in robotics news. ROS developers meet-up organised by acceleration robotics, China unveils new plan for wider robot use from manufacturing to agriculture, as population shrinks, AMD powers DENSO's next-gen automotive lidar systems",
        "created_utc": 1674819959,
        "upvote_ratio": 1.0
    },
    {
        "title": "Behaviour of a BJT configuration when VCE=0",
        "author": "Designer-Driver1290",
        "url": "https://i.redd.it/0fe0bt3w3mea1.jpg",
        "text": "I don't know what to name this configuration, maybe \"pointless configuration\", the transistor here is in saturation because BE and BC junctions are both forward biased but here VCE=0 and the transistor appears to behave in a manner most similar to the two diodes model, what I want to know is why most of the current goes through the collector and just a tiny bit goes through the emitter? why not in half, is it because of the doping or something else?",
        "created_utc": 1674818706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Digital IC Design -&gt; Embedded Software",
        "author": "embedded_curious",
        "url": "https://www.reddit.com/r/ECE/comments/10m1f90/digital_ic_design_embedded_software/",
        "text": "2020 B.S. CmpE grad\n\nHave \\~2 years doing Digital IC design for a very large company in SF Bay Area (I did SystemVerilog test benches, CDC, lint, designing new Verilog modules, etc.). Quit in 2021 due to having a major depressive episode caused mostly by external factors but also by not really enjoying the work/stress. \n\nSpent the last 1.5 years tutoring math/CS for high schoolers, but now I'm feeling much better and want to get back into an ECE-related job. I was thinking embedded software, since I really liked my microcontrollers class at University. I took an OS class at University, and have some university experience with C++/embedded C/Python, but no industry experience there.\n\nMy question is how big of a red flag you think my resume gap/lack of industry experience with embedded software would be if I'm trying to break into that field. Would my experience count for anything, or should I consider going back to grad school and get my MS in ECE?",
        "created_utc": 1674764434,
        "upvote_ratio": 1.0
    },
    {
        "title": "Engineering interview without technical questions?",
        "author": "turkishjedi21",
        "url": "https://www.reddit.com/r/ECE/comments/10lzdnk/engineering_interview_without_technical_questions/",
        "text": "Just talked to someone I know about how interviews have been going with them, and they actually already accepted a job (EE). They said that they had two rounds of interviews, and all of it was behavioral with no technical questions.\n\nThis was odd to hear, since all of my interviews (computer engineering) had technical questions. Like there was maybe 2 behavioral questions average per interview out of the 16or so I did before I accepted an offer. Like, it was a very small part.\n\nWas my experience not the norm? Maybe for EE jobs they just don't do technical interviews? Maybe it was company specific?",
        "created_utc": 1674759357,
        "upvote_ratio": 1.0
    },
    {
        "title": "final year project in uni",
        "author": "hafedh99",
        "url": "https://www.reddit.com/r/ECE/comments/10lzcks/final_year_project_in_uni/",
        "text": " i am an embedded systems student in university,this is my last year to get my diploma and i have to do a project(over 4 months to complete), can anyone please help me with  an example on the type of projects i can do over this period of time.",
        "created_utc": 1674759290,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I go about finding the minimum number of NAND /NOR gates for a given boolean expression",
        "author": "EulerMathGod",
        "url": "https://www.reddit.com/r/ECE/comments/10ltcjp/how_do_i_go_about_finding_the_minimum_number_of/",
        "text": "https://imgur.com/a/YMuTPvf\n\nHow do i solve questions like these ? In general ,how do i go about finding the minimum number of NAND/NOR gates to construct a boolean expression ?",
        "created_utc": 1674744168,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does CDR lock for a pattern of all 1s or 0s?",
        "author": "holaholacrayola",
        "url": "https://www.reddit.com/r/ECE/comments/10ls9pe/how_does_cdr_lock_for_a_pattern_of_all_1s_or_0s/",
        "text": "Reading up on SerDes and there are PRBS generators/checkers where one pattern is all 1s or 0s.\n\nI know that 8b/10b (at lower PCIe gens) and scrambling+128b/130b (up to PCIe 5) and scrambling+1b/1b (up to PCIe 6) is done to help with the transition density.\n\nBut I see that scrambling and encoding is done at the path before the PRBS blocks.\n\nSo how does CDR lock for all 0s/1s without any scrambling/encoding?",
        "created_utc": 1674741124,
        "upvote_ratio": 1.0
    },
    {
        "title": "DIY Police Flasher Lights for RC Car | Police flasher lights for car | VIP Flasher Lights",
        "author": "Electronics_is_Fun",
        "url": "https://www.reddit.com/r/ECE/comments/10lm4y4/diy_police_flasher_lights_for_rc_car_police/",
        "text": "[removed]",
        "created_utc": 1674717068,
        "upvote_ratio": 1.0
    },
    {
        "title": "Search for a battery management IC for a Lithium Nickel Cobalt Oxide battery",
        "author": "Xazch_",
        "url": "https://www.reddit.com/r/ECE/comments/10l6aft/search_for_a_battery_management_ic_for_a_lithium/",
        "text": "I'm planning on using an RJD3032ST1 battery for a system design I'm designing, i like it due to its size-to-capacity characteristics. my question is can i use a li-on BMS for this type of battery to charge via USB I'm planning on using a MCP73832T-5ACI/OT.\n\nMy knowledge area isn't in circuit design and have been researching everything about this.",
        "created_utc": 1674672644,
        "upvote_ratio": 1.0
    },
    {
        "title": "IEEE Membershi &amp; Insurance Discounts",
        "author": "OneMillionSnakes",
        "url": "https://www.reddit.com/r/ECE/comments/10l2lef/ieee_membershi_insurance_discounts/",
        "text": "I was an IEEE member as a student, but after I realized I was basically paying a company to keep closing off research papers from me I decided to quit after a few years of working. I've since realized that one benefit of being an IEEE member is discounted insurance. Term life insurance I could see, but I'm curious has anyone used their health insurance? Their travel insurance? Their discount vision plan? \n\nMy company's new health insurance blows now. I was considering seeing if the health coverage I got from the IEEE could be better since engineers as a group are probably easier to insure than the average population.",
        "created_utc": 1674663804,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some of the highest paying jobs in Electronics Industry?",
        "author": "ConfusedExplorer41",
        "url": "https://www.reddit.com/r/ECE/comments/10kwelo/what_are_some_of_the_highest_paying_jobs_in/",
        "text": "",
        "created_utc": 1674645674,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crude Battery Level Indicator (Voltage based)",
        "author": "TieGuy45",
        "url": "https://v.redd.it/f9n3j91045ea1",
        "text": "",
        "created_utc": 1674612938,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are general pivots/paths I can take from here?",
        "author": "therealmunchies",
        "url": "https://www.reddit.com/r/ECE/comments/10kld75/what_are_general_pivotspaths_i_can_take_from_here/",
        "text": "Hello,\n\nBackground: BS Mech Eng. 1 yr as a Project Engineer in General Industry (Pumps) with focus on design, project management, and R&amp;D. Also launched an IT platform at the site performing pilots, providing feedback, and making improvements leading up to the launch (think Agile).\n\nI’ve recently joined the defense industry making microelectronics. Frok what I know we deal with wafer handling, packaging, pcb design,  and supply chain. When reading along, please consider the fact that I have the opportunity to explore everything with my given management. My only problem is I don’t know what questions to ask. I hope I can give enough information as I describe these details.\n\nI am very new to this field and was wondering what I could explore from here. \n\nI did like the design aspect of my last job, but that was mechanical engineering focused. Is this something I can pick up on the job?\n\nI also did a decent bit of VBA programming to automate some daily tasks, and learned some SQL on the job for our database.\n\nIs there anything in demand I should build up to? Do I absorb everything and go with the flow? \n\nIf it’s a simple “just keep learning”, I am completely okay with that. Any advice is appreciated!",
        "created_utc": 1674607215,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice for sensor type",
        "author": "Puzzleheaded-Post-22",
        "url": "https://www.reddit.com/r/ECE/comments/10khazg/need_advice_for_sensor_type/",
        "text": "I’m currently working on my Senior Project and my project consist of a microcontroller and a sensor that can measure the change that happens on the surface (i.e the change of skin swelling) \nI’ve found that flex sensors work great for this type of measurement, but I need more options that are more accurate.",
        "created_utc": 1674596924,
        "upvote_ratio": 1.0
    },
    {
        "title": "Computer Engineering vs CS",
        "author": "avocado352",
        "url": "https://www.reddit.com/r/ECE/comments/10kgumk/computer_engineering_vs_cs/",
        "text": "I need some help deciding between these two majors. I started off as an Aerospace Engineer but recently I’ve found that I really enjoy coding and want to switch majors. However, I still want to have the possibility of working in the space industry with avionics, rovers, etc. I also want to have the possibility of working at big tech companies, which is obviously possible from either of these two majors. I’m considering Computer Engineering because most of the CS things I’m interested in are based on hardware (robotics, avionics, maybe some AI/ML and computer vision), and I’m not really interested in web/app development. From my research, I’ve also found basically no downside with a degree in Computer Engineering vs CS because it seems like CpEs can get software jobs just as easily as CS grads can. Any advice on what to do?",
        "created_utc": 1674595821,
        "upvote_ratio": 1.0
    },
    {
        "title": "Transition from ASIC to FPGA design?",
        "author": "OddAssumption",
        "url": "https://www.reddit.com/r/ECE/comments/10k6v6u/transition_from_asic_to_fpga_design/",
        "text": "Have ~3 YOE of digital design in SoC. Is it relatively easy if I want to do fpga design?",
        "created_utc": 1674570944,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help diagnose 12v toy car charging",
        "author": "kikilucy26",
        "url": "https://www.reddit.com/gallery/10jroi0",
        "text": "I'm trying to fix my son's ride on toy car. It uses 12v battery. I used a multimeter with the voltage setting  to test the charger part on the car. With the charger plugged in, the multimeter doesn't display any voltage. Does this mean the charger is dead or am I testing the wrong part or doing the diagnostic wrong",
        "created_utc": 1674518335,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any ASIC companies which still hire for fully remote?",
        "author": "scrooooooooooge",
        "url": "https://www.reddit.com/r/ECE/comments/10jqwbx/are_there_any_asic_companies_which_still_hire_for/",
        "text": "I'm looking for a new design verification role, but I'm having trouble finding any which are still fully remote. I got grandfathered into fully remote at my current company and I'd love to keep that benefit at my next job.\n\nDoes anyone know of ASIC companies which still offer fully remote?",
        "created_utc": 1674516298,
        "upvote_ratio": 1.0
    },
    {
        "title": "Equivalent Resistance",
        "author": "Fr0steer",
        "url": "https://www.reddit.com/r/ECE/comments/10joagp/equivalent_resistance/",
        "text": "Hello, I've been analysing my two tasks in Simulink and tried to calculate the equivalent resistance manually, but didn't get the same answers. For first one the closest I was is 8.425 and the second one I didn't even start because I lost hope int the first one. If someone could explain it to me why the outcome values are such I would be more than extremely grateful. \n\n1.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/8p6nxkzz3vda1.jpg?width=1498&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=e65a756a229b65caa4897839cce8b1b77ee8a474\n\n2.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/noage1914vda1.jpg?width=1762&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=0510981b95695dd4ae005c25422555adb9dacebe",
        "created_utc": 1674509882,
        "upvote_ratio": 1.0
    },
    {
        "title": "AC and DC lines in the same wiring harness?",
        "author": "FastButterscotch6632",
        "url": "https://www.reddit.com/r/ECE/comments/10jkt1h/ac_and_dc_lines_in_the_same_wiring_harness/",
        "text": "What would be the dangers of running AC power lines (from a generator) and DC power lines (approx 120watts) in the same wiring harness?\n\nThe AC lines would be grouped together and shielded within the harness..\n\nWould the DC lines induce a DC offset on the AC lines, therefore making the AC power less efficient? Or would the AC lines induce noise onto the DC lines?\n\n(I wish I would've taken EMAG as a standalone class and wasn't taking three other classes simultaneously... Humpf...)",
        "created_utc": 1674501444,
        "upvote_ratio": 1.0
    },
    {
        "title": "Robots are deterministic machines. Meeting time deadlines in their computations (realtime) is the most important feature. CPUs are widely used in robotics however they hardly provide real-time while delivering high throughput.",
        "author": "pablocarrera",
        "url": "https://i.redd.it/o6fhlfoxxsda1.jpg",
        "text": "",
        "created_utc": 1674483629,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Self Balancing Robot PCB",
        "author": "jeet55",
        "url": "https://www.reddit.com/gallery/10jc4h3",
        "text": "",
        "created_utc": 1674479400,
        "upvote_ratio": 1.0
    },
    {
        "title": "Embedded project ideas for him?",
        "author": "atreyi_14",
        "url": "https://www.reddit.com/r/ECE/comments/10j8vht/embedded_project_ideas_for_him/",
        "text": "Hello!\n\nMy partner's birthday is in April and I thought of making an embedded project for him. \n\nHence I'm here to ask for help, if y'all can help me decide on something that I could make in-house :)\n\nHis interests: Football, UFC, Gyming (If anyone has any ideas for that)\n\nI can do PCB Designing, Soldering and **basic** **C coding**.  So I hope this gives an idea of my skillset before you suggest any project.\n\nThe project does not need to be surrounding his interests. Just something he can use. While I could make some LED heart thing or other countless cute relationship embedded projects, I'm not really into that. Hence refraining from that whole area. I'd like something general.\n\nMy random idea: Yes, it maybe absurd. Sorry.\n\n1. A Football Team Calendar: He likes Arsenal, and I thought of maybe making a display clock kind of a thing? That would show the next match for Arsenal.\n\nBut I'm reluctant on that since I'm a noob when it comes to IoT projects.\n\nAny help would be appreciated :)\n\nThank you.",
        "created_utc": 1674467635,
        "upvote_ratio": 1.0
    },
    {
        "title": "External SDRAM for audio effects processor",
        "author": "Chance-Selection1263",
        "url": "https://www.reddit.com/r/ECE/comments/10j43ac/external_sdram_for_audio_effects_processor/",
        "text": " \n\nHi,\n\nI am a beginner in embedded audio and I am trying to figure out if I need an external SDRAM or not. My current project is a stereo audio effects processor. As the name suggests, I would like for this unit to apply distortion, 3 band EQ and delay effects to an audio signal ( mainly used on guitar). The input is stereo, so processing should be done on 2 channels. I am using an STM32H7 microcontroller as a DSP with 128 KB of flash memory and 1 MB of RAM with a clock speed of 480 MHz. There is no audio playback or recording involved. The data will be sampled with a 24 bit audio codec at 48 KHz.  \nIt seems to me that the microcontroller already has enough RAM and processing speed, so my initial thoughts are that I do not need external RAM, but I am not 100% sure. For example, assuming a 2 second delay effect, that would require (24 bits x 48 kHz x 2 seconds x 2 channels)/8= 576 kB of memory + distortion ( which does not cost  much memory if I'm not mistaken +3 second order FIR filters for the 3 band EQ, I think the internal RAM is sufficient, but I am not 100% sure.\n\nI do plan on using a 128 Mbit quad SPI flash memory to compensate for the internal 128 KB.\n\n Thank you for your help.",
        "created_utc": 1674449173,
        "upvote_ratio": 1.0
    },
    {
        "title": "EE vs ME",
        "author": "Dismal-Passenger8412",
        "url": "https://www.reddit.com/r/ECE/comments/10j0xd2/ee_vs_me/",
        "text": "Hey Guys,\n\nI'm trying to decide my major once and for all before tomorrow (Mech E and EE). I know this has been asked a million times, and I've scoured the internet, spoke to professors, and some industry professionals trying to find an answer. However, I'm just being torn apart because I enjoy enough aspects of both that it's a dead heat, and I can't choose Mechantronics E as it isn't offered at my university. Essentially, I really enjoy the following topics: robotics, computer programming, computer engineering, avionics, propulsion, engine design, and avionics. Side note: I want to explore product management and finance for fun at some point.\n\nI've taken enough classes in both that I might be graduating in five years instead of four, so graduating on time (four years) is not a concern for this decision. However, taking these classes has also not helped me decide which one to choose. The problem is that a lot of these topics go hand in hand with each major. I would say I'm a little bit below average at math, but I made it this far so I'm not going to worry about. If you were in my shoes, what major would be the best pick given my interests?",
        "created_utc": 1674439379,
        "upvote_ratio": 1.0
    },
    {
        "title": "EE vs ME",
        "author": "throatshitta",
        "url": "https://www.reddit.com/r/ECE/comments/10j0urw/ee_vs_me/",
        "text": "Hey Guys,\n\nI'm trying to decide my major once and for all before tomorrow (Mech E and EE). I know this has been asked a million times, and I've scoured the internet, spoke to professors, and some industry professionals trying to find an answer. However, I'm just being torn apart because I enjoy enough aspects of both that it's a dead heat, and I can't choose Mechantronics E as it isn't offered at my university. Essentially, I really enjoy the following topics: robotics, computer programming, computer engineering, avionics, propulsion, engine design, and avionics. Side note: I want to explore product management and finance for fun at some point.\n\nI've taken enough classes in both that I might be graduating in five years instead of four, so graduating on time (four years) is not a concern for this decision. However, taking these classes has also not helped me decide which one to choose. The problem is that a lot of these topics go hand in hand with each major. I would say I'm a little bit below average at math, but I made it this far so I'm not going to worry about. If you were in my shoes, what major would be the best pick given my interests?",
        "created_utc": 1674439192,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need to receive video feed from drone and send to Jetson - Device suggestions",
        "author": "turkishjedi21",
        "url": "https://www.reddit.com/r/ECE/comments/10inmqn/need_to_receive_video_feed_from_drone_and_send_to/",
        "text": "So the current setup my team has is Tello drone -&gt; ESP8266 -&gt; Arduino -&gt; Jetson nano.\n\nYesterday I realized that the arduino really only supports storage in the form of an SD card. This is not fast enough to send images to the Jetson without a solid delay (this setup is part of a timed competition).\n\nUpon further examination, I also realized that getting even a picture to an ESP8266 itself will be impossible as well due to device limitations. The board the team bought (I joined late, so i  had no input on the architecture of the system) doesn't have any storage on it. In addition, I can't find any boards that use an ESP that also have storage.\n\nSo now I'm wondering what device should I use to connect to the drone? I need something that has WiFi capabilities and enough storage to handle at least a couple frames of 5MP images (the current plan is to take a couple images of a \"play area\" and send them to the jetson for processing).\n\nI first imagined connecting the ESP to the Jetson would work, but sending the data to the jetson would be limited by a UART connection (115200 baud max for the ESP device) and again, the ESP device doesn't have any sort of buffer to hold a frame before it is sent.\n\nThanks for any help",
        "created_utc": 1674405083,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looks like something like this could work: Technology for a cuttable monitor (LINK)",
        "author": "kiteret",
        "url": "https://www.reddit.com/r/IntegratedCircuits/comments/10c501n/looks_like_something_like_this_could_work/",
        "text": "",
        "created_utc": 1674398928,
        "upvote_ratio": 1.0
    },
    {
        "title": "Analog Dialogue (Dec 2021): Step-by-Step Noise Analysis Guide for Your Signal Chain",
        "author": "jms_nh",
        "url": "https://www.analog.com/en/analog-dialogue/articles/step-by-step-noise-analysis-guide-for-your-signal-chain.html",
        "text": "",
        "created_utc": 1674398836,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some basics on BJTs",
        "author": "Morten_Nibe",
        "url": "https://youtu.be/pWEvI6I17LE",
        "text": "",
        "created_utc": 1674393901,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to dump firmware from a PCB with an MCU and FPGA and make sure all data is extracted successfully?",
        "author": "-Halvening-",
        "url": "https://www.reddit.com/r/ECE/comments/10iiwsh/how_to_dump_firmware_from_a_pcb_with_an_mcu_and/",
        "text": "  \n\nI have an old PCB that is no longer manufactured. I'd like to get the  firmware out of it, but it looks like it has an MCU on it and an Altera  Cyclone FPGA first generation. I'm still learning how the PCB is  constructed and I'm a novice at extracting firmware (I'm so sad that I  didn't learn earlier to do this, because it looks so cool and is worth  knowing), but I suspect that there are two firmwares, if I may call them  that.\n\nThe one on the MCU runs and accepts requests from the machine's  keypad. It drives motors and also checks the status of various sensors  on the machine. In general, it performs all the functions of the  machine.\n\nThe PCB is connected to another PCB (the second PCB is not of my  interest, it is still in production. It is from a different  manufacturer) and it's communicating with it and here the FPGA seems to  be doing the work. Actually the FPGA receives signals from the second  PCB and I guess tells the MCU what to do - which motor to drive, status  of sensors, etc. I'm not sure why they use both - MCU and FPGA at all on  this PCB. Probably the MCU can't accept such requests from the second  PCB because it should do multiple things in parallel like move two  motors at the same time, check the status of multiple sensors at the  same time and the MCU can't do that.\n\nFortunately, the PCB has two open connections - a UART controller  that is built on the PCB with USB-B from the PCB and I can connect to it  with a simple USB-B to USB-A cable to the computer. On the other hand,  there is also a JTAG open connection. It appears to be connected to  flash memory on the PCB and FPGA. I verified this by looking at the PCB  paths. Both MCU and FPGA are also connected together. I have the basics  of dumping the firmware on the PCB, but I lack the knowledge of how I  can extract both firmwares (if there are two).\n\nI assume the MCU firmware is written in C and the FPGA firmware is  written in HDL. How can I be sure that when I try to extract the  information that I got all the data from all the FLASH and EEPROM on the  MCU and FPGA?\n\nI'm going to try to rebuild the exact same PCB and want to make sure  all the data is extracted, so I can later upload it to the new PCB and  still be able to do what it should do and communicate with the second  PCB effectively.",
        "created_utc": 1674391624,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hospital Patient Bed Critical Power Outlet Calculations",
        "author": "Christian-Foreman",
        "url": "https://www.reddit.com/r/ECE/comments/10igccr/hospital_patient_bed_critical_power_outlet/",
        "text": "I’m a foreman for an electrical company that is working on a hospital remodeling project. I took over the project and started to find some significant design issues. The first was that the \"Critical\" power branch section was overloaded and had loads that were not permitted to be on critical power. These loads had to be moved to the equipment branch. This, in-turn overloaded the equipment branch, but that’s another story. Now that the critical power branch seemed to be clear, or I thought, I started to locate the new critical panels and figure my home runs to each patient bed location. There were no panel schedules or even circuit numbers on the drawings, only a note stating the each patient bed was to get a dedicated double duplex 120 volt receptacle outlet. The critical panel is a 200 amp 3 phase double tub for a total of 84 - single pole circuits. I counted all the circuits required, according to the notes on the drawings, and we are well over the 84 circuits. I then wanted to know what the potential loads would be at the patient beds. My questions are:\n\nHow many volt-amps are we to deliver to each patient bed for these new critical receptacles?\n\nIs there any load diversity allowed?\n\nWhat are the restrictions regarding breakers serving these patient beds? More specifically - how much access does the hospital staff need to these breaker? Can they be in a electrical closet? Can it be on a different floor?\n\nI hope these questions are not below the caliber of questions typically asked. I have researched this and could not find it in the code book.\n\nThanks for any input.",
        "created_utc": 1674382122,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I know if IC design is for me?",
        "author": "austinite0",
        "url": "https://www.reddit.com/r/ECE/comments/10i0bgi/how_do_i_know_if_ic_design_is_for_me/",
        "text": "Hello everyone, \n\nI currently work as a systems analog engineer, but I've been considering a career change into IC design.  I've always been fascinated by the intricacies of integrated circuits.\n\nMy main motivator besides the interest in the field, is the salary change, but I understand that it comes with me getting a master's. I graduated with a B.S. in EE but unfortunately had no exposure to VLSI. It was an elective offered at odd semesters in my undergrad and could not get it to fit with my schedule. \n\nA master's will be a challenge for me since it is expensive. Additionally, I would need to stay with my current company for more time in order to avoid paying it back out of pocket. \n\nMy knowledge of IC design is limited, but I do remember my electronics courses covering transistor design were the ones that interested me the most. Unfortunately, I do not do much discrete design in my current job as there's almost always an IC for the application I am doing. \n\nIf I understand it correctly, IC design is basically focusing on designing a particular IC rather than a whole system.  So, my job would change from making hardware to a single IC and also become even more technical. EMC issues are an issue in hardware, but I would imagine they are even more intricate in IC design. \n\n I'm wondering if any of you out there have made a similar career change, and if so, can you share your experiences? Was it a good decision? Are there any specific challenges or rewards that come with working in IC design compared to other areas of electrical engineering, specifically board-level hardware design? \n\n&amp;#x200B;\n\n Any and all advice would be greatly appreciated. Thank you!",
        "created_utc": 1674331776,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need suggestions please",
        "author": "amugglediary",
        "url": "https://www.reddit.com/r/ECE/comments/10hvq74/need_suggestions_please/",
        "text": "So what open source tools can be taught/ will be useful for a beginner getting into ece ????",
        "created_utc": 1674320212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Joining Rivos Inc During These Times",
        "author": "ScumbagSpeed",
        "url": "https://www.reddit.com/r/ECE/comments/10htnzx/joining_rivos_inc_during_these_times/",
        "text": "Does anyone have thoughts or insights about Rivos? During economic times like these, I'm not sure about the risks of joining a start-up like Rivos.",
        "created_utc": 1674314766,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Do You Do, And What Do You Think Is The Hardest Specialty In ECE?",
        "author": "cndni",
        "url": "https://www.reddit.com/r/ECE/comments/10htmmb/what_do_you_do_and_what_do_you_think_is_the/",
        "text": "I'm a DSP guy, so naturally I think anything in the analog domain is super complex, especially in regards to IC Design. To this day I'm still not sure what a Bode plot is.",
        "created_utc": 1674314660,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books for DIGITAL IC",
        "author": "EntrancePale9771",
        "url": "https://www.reddit.com/r/ECE/comments/10homwj/books_for_digital_ic/",
        "text": "Please share some good books to practice numericals for Digital IC design except Books by Neil Weste and Rabaey.",
        "created_utc": 1674298288,
        "upvote_ratio": 1.0
    },
    {
        "title": "Other examples of applications of a priority arbiter apart from sharing system bus or memory?",
        "author": "ZipTieMaster",
        "url": "https://www.reddit.com/r/ECE/comments/10hnj3r/other_examples_of_applications_of_a_priority/",
        "text": "Hi all, i was wondering where else a priority arbiter is used in the real world apart from sharing system bus or memory. I tried googling but couldn't find any other examples.\n\nfor context, I'm working on a mini project which requires us to implement a priority arbiter on an FPGA (this fpga is also combined with a hard processor; an soc). I've completed this part, but now the following question to this is to suggest one application using the output from the arbiter and implement it.",
        "created_utc": 1674293933,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I Apply for PhD after 3 years of Undergrad?",
        "author": "stinky_anarchist_001",
        "url": "https://www.reddit.com/r/ECE/comments/10hn2zx/should_i_apply_for_phd_after_3_years_of_undergrad/",
        "text": "Context: Currently, I am a 2nd year EE major on pace to graduate with a B.S. by the end of my 3rd year of undergrad. I am currently maintaining a 3.96 GPA with several upper-division courses completed, and work in a channel coding research lab as well as participate in a few engineering clubs. I am interested in going down either an IC design or signals path, but I am still undecided.\n\nI am currently at a crossroads as to decide if I want to apply straight to PhD programs starting this summer, apply for master's, or work in industry for a few years. My faculty advisor gave some input, recommending that I try my hand at industry for a few years before getting my master's or PhD sponsored by corporate, but I feel (perhaps naively) really drawn to work in academia, and would at minimum like to pursue a master's right after my bachelor's to continue shoring up my skills. My school also has a beneficial program where I can pursue my masters starting in my 3rd year along with my bachelor's, such that I can graduate in the normal 4 years with both my B.S. and M.S. in EE. While this program is helpful in that I do not need to apply to get in, I have heard from others that it is beneficial to jump between institutions in order to broaden connections, especially if I were to pursue an academia-oriented career.\n\nThoughts on which path I should go down? I feel pressured to make a decision soon, so I can begin studying for GRE if I go down PhD/MS at new institution path right after 3 years of undergrad.",
        "created_utc": 1674292078,
        "upvote_ratio": 1.0
    },
    {
        "title": "Control System Project Idea",
        "author": "noinputideas",
        "url": "https://www.reddit.com/r/ECE/comments/10hfh8a/control_system_project_idea/",
        "text": "Looking for a project ideas for my control system class. I want to find projects relating to my interests of audio and or image signals.",
        "created_utc": 1674265363,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to tell if Polarizer or Anti-Glare film?",
        "author": "AstroSike",
        "url": "https://i.redd.it/c725iyo2acda1.jpg",
        "text": "",
        "created_utc": 1674263871,
        "upvote_ratio": 1.0
    }
]