[
    {
        "title": "Are there any good circuit simulation iPad apps?",
        "author": "BMANN2",
        "url": "https://www.reddit.com/r/ECE/comments/6yk4x6/are_there_any_good_circuit_simulation_ipad_apps/",
        "text": "Been doing some looking around, can't seem to find any.  Surprised thought this would be something there are hundreds of apps for.\n\nI am talking about apps that YOU make the circuit, not just select some preset one and put in some values and it calculates some stuff for you.",
        "created_utc": 1504748519,
        "upvote_ratio": ""
    },
    {
        "title": "In ᴏrder tᴏ αttrαct new custᴏmers tᴏ ᴏur stᴏre we αre mαkÍng α greαt prᴏmᴏtÍᴏn. We αre gÍvÍng αwαy 100 MechαnÍcαl Leαther Wαtches(normαlly 100$) ᴏnly tᴏdαy. All yᴏu have tᴏ dᴏ Ís leαve α hᴏnest revÍew αnd Pαy SHÍPPÍNG",
        "author": "domatja1",
        "url": "http://leatherwatchshop24.blogspot.com/2017/09/in-rder-t-ttrct-new-custmers-t-ur-stre.html",
        "text": "",
        "created_utc": 1504712364,
        "upvote_ratio": ""
    },
    {
        "title": "Introduction to Internet of Things(IoT) using Arduino",
        "author": "[deleted]",
        "url": "http://labb.in/s/ZYYA",
        "text": "[deleted]",
        "created_utc": 1504703996,
        "upvote_ratio": ""
    },
    {
        "title": "Automotive 3D Printing",
        "author": "mily_D",
        "url": "https://www.reddit.com/r/ECE/comments/6yf7ks/automotive_3d_printing/",
        "text": "[removed]",
        "created_utc": 1504699605,
        "upvote_ratio": ""
    },
    {
        "title": "what you think ? what is Real-Time Location Systems ?",
        "author": "mily_D",
        "url": "https://www.reddit.com/r/ECE/comments/6yf4os/what_you_think_what_is_realtime_location_systems/",
        "text": "[removed]",
        "created_utc": 1504698561,
        "upvote_ratio": ""
    },
    {
        "title": "What to Check if your VDMA based image processing pipeline has issues",
        "author": "adamt99",
        "url": "https://forums.xilinx.com/t5/Xcell-Daily-Blog/Adam-Taylor-s-MicroZed-Chronicles-Part-214-Addressing-VDMA/ba-p/791689",
        "text": "",
        "created_utc": 1504640338,
        "upvote_ratio": ""
    },
    {
        "title": "Amount of ozone generation with high voltage",
        "author": "Bozhe",
        "url": "https://www.reddit.com/r/ECE/comments/6ya2d5/amount_of_ozone_generation_with_high_voltage/",
        "text": "I have a test fixture generating 30 kV. When it is cranked up that high, you can smell the ozone. Someone asked me about safety effects. I can find info on how much ozone people can safely be around, but cannot figure out how much we are generating. Anyone have an idea? Two 1 meter x 1 meter plates, 1 meter separation, fed by a 1 kVA, 30 kV transformer. ",
        "created_utc": 1504637308,
        "upvote_ratio": ""
    },
    {
        "title": "a 25 micron Precision Ultrasonic Distance Measurement Sensor with Analog &amp; Digital Port",
        "author": "aligng",
        "url": "https://www.youtube.com/watch?v=q6yus6bXz4c",
        "text": "",
        "created_utc": 1504626165,
        "upvote_ratio": ""
    },
    {
        "title": "Using an NPN transistor as a switch.",
        "author": "riseNRG",
        "url": "https://youtu.be/n9BYzdLU2AA",
        "text": "",
        "created_utc": 1504612175,
        "upvote_ratio": ""
    },
    {
        "title": "Waveguide post -fabrication parameters",
        "author": "Dragstripriot",
        "url": "https://www.reddit.com/r/ECE/comments/6y7g6h/waveguide_post_fabrication_parameters/",
        "text": "Hi all, \nI am actually trying to figure out the parameters one need to see after fabricating a waveguide. To my knowledge and from the information I have found in papers, I have seen that you check refractive index, layer thickness, crystallinity and material composition. I wanted to know why you see this parameters and how they affect and also, if there are any other important parameters to check. Any link related to the question would be great. \nThanks :) ",
        "created_utc": 1504612097,
        "upvote_ratio": ""
    },
    {
        "title": "FE Electrical Exam",
        "author": "more_amps842",
        "url": "https://www.reddit.com/r/ECE/comments/6y5ea6/fe_electrical_exam/",
        "text": "I am studying for my FE electrical exam to be able to take it in about three months. I am looking to see if anyone has some websites or link or file containing practice problems to hep out. I am on a tight budget right now and hurting 120 bucks on two study books is going to slow me down. Anything would be greatly appreciated.",
        "created_utc": 1504582373,
        "upvote_ratio": ""
    },
    {
        "title": "A quick, probably stupid, question about resolution",
        "author": "ElectricJammer",
        "url": "https://www.reddit.com/r/ECE/comments/6xzfjp/a_quick_probably_stupid_question_about_resolution/",
        "text": "Hello, \n\nI was looking for a ADC converter for my raspberry pi, I saw the LTC2497 and found it was used in a PiHat [datasheet](http://alchemy-power.com/wp-content/uploads/2017/03/Pi-16ADC.pdf).\n\nNow is my issue with the little notation that the approx resolution of the setup would be 39 microvolts. How is this possible? They tell that the max input is from -2.5 to 2.5 volts. With 16 bits, and one being used as a sign I can only come up with a resolution about 153 microvolts. \n\nI calculated that by dividing 5 volts by (2^15) - 1.\n\nThe only thing I can come up with is that they used a different range, but I can't find out what range they used.\n\nThanks in advance,\n\nElectricJammer\n\nEDIT:\n\nI want to measure both positive and negative signals, that is, relative to my ground.",
        "created_utc": 1504518816,
        "upvote_ratio": ""
    },
    {
        "title": "Fundamentals of Electronics - Udemy",
        "author": "[deleted]",
        "url": "http://labb.in/s/ZYCU",
        "text": "[deleted]",
        "created_utc": 1504504094,
        "upvote_ratio": ""
    },
    {
        "title": "FreeRTOS scheduler preemption by ISR?",
        "author": "more_amps",
        "url": "https://www.reddit.com/r/ECE/comments/6xw7qm/freertos_scheduler_preemption_by_isr/",
        "text": ".. yay or nay? I am trying to implement my timing-critical drivers as a \"co-kernel\" by having them use hardware interrupts, but I want to exchange data with my tasks. I would highly prefer to set the interrupt priorities of some of the driver-related ISRs to be higher than that of the scheduler. How does this affect the nature of data exchange and other interaction with RTOS tasks? I would ideally like to be able to push data onto queues from the ISR using the \"fromISR\" functions in the FreeRTOS API. However, I was wondering if these assume anything about ISR preemption priority relative to that of the FreeRTOS scheduler tick (Systick in my case).",
        "created_utc": 1504477000,
        "upvote_ratio": ""
    },
    {
        "title": "[SystemVerilog] and UVM questions.",
        "author": "captain_wiggles_",
        "url": "https://www.reddit.com/r/ECE/comments/6xusbj/systemverilog_and_uvm_questions/",
        "text": "I have three questions.\n\n1) I posted this in r/fpga yesterday but got no replies, so I figured I'd try here. Is there any way to pass parameters to a module using the .* style syntax or the like. IE. If a parent module has a parameter WIDTH, and it instantiates a module that also uses the parameter WIDTH, can I pass this automatically. This would be very helpful if there were lots of parameters, going to lots of modules.\n\n2) I have a Register module which I'm about to write a UVM test for. The code is pretty simple.\n\n    module Register #(parameter WIDTH=32)\n                    (input wire clk,\n                     input wire load,\n                     input wire [WIDTH-1:0] in,\n                     output wire [WIDTH-1:0] out);\n\n        reg [WIDTH-1:0] r;\n\n        always_ff @(posedge clk) begin\n            if (load) begin\n                r &lt;= in;\n            end\n        end\n\n        assign out = r;\n\n    endmodule\n\nMy question is about writing the test code for this. How do you write tests that have clocks. I've written tests for combinational logic, where my driver updates the inputs to the DUT on the rising edge of a clock and the monitor reads the outputs on the falling edge. However not sure how to start with a DUT that has it's own clock. If I use the same clock for the DUT and the driver / monitor, then my driver sets load on the rising edge of the clock, but IIRC the driver's write and the DUTs always_ff @(posedge clk) blocks happen simultaneously, therefore my DUT doesn't detect the new values from the driver.\n\nSo do I want a clk that my driver and monitor use which is faster than the clock I pass into the DUT? If I do this then how is my scoreboard predictor meant to figure out the expected value, since it doesn't know if this sequence was written around a rising edge of the DUTs clk or not.\n\nI guess I could have my driver do something like:\n\n    @(negedge vif.clk);\n    seq_item_port.get_next_item(tx);\n\n    vif.in = tx.in;\n    vif.load = tx.load;\n\n    seq_item_port.item_done();\n\nand then my monitor sample on the falling edge. With an offset of one clk tick.\n\nAdditionally would you write tests to check the edge condition works correctly? IE. if you asserted and deasserted load without there being a rising edge of the clk tick in the middle. To test that the register value doesn't get updated incorrectly. I guess that would be done by creating a different driver?\n\nI know this is a very simple module to test, and it probably doesn't really require a test (or does it?). Those of you in this industry, what would you do?\n\nEdit: This is done using sequences right? We have a separate simulation clk to sync the driver and the monitor, and a dut clk. The dut clk is set as part of the sequence. Then the sequence passes multiple transactions to the driver. To be sure we test all the cases we add sequence bins to our coverage.\n\n3) How do you guys test modules that take parameters? IE. a mux that has input width and input count as parameters. Sure the code is simple and if it works with a 32 bit 8 way input it'll work with a 16 bit 16 way, but in general. If your using the generic module in a specific design, then you presumably test the used parameters. However if it's in a library and you want tests as part of the library to verify the module in all it's configurations. I could write separate tests and top level verification modules for each case I think is interesting, but that seems like a lot of duplication of code and effort, and it becomes impossible to test every case.\n\nThanks\n\n",
        "created_utc": 1504462607,
        "upvote_ratio": ""
    },
    {
        "title": "In ᴏrder tᴏ αttrαct new custᴏmers tᴏ ᴏur stᴏre we αre mαkÍng α greαt prᴏmᴏtÍᴏn. We αre gÍvÍng αwαy 100 MechαnÍcαl Leαther Wαtches(normαlly 100$) ᴏnly tᴏdαy. All yᴏu have tᴏ dᴏ Ís leαve α hᴏnest revÍew αnd Pαy SHÍPPÍNG",
        "author": "butmanquiz31691",
        "url": "http://w4tchez342day.blogspot.com/2017/09/in-rder-t-ttrct-new-custmers-t-ur-stre_3.html",
        "text": "",
        "created_utc": 1504458109,
        "upvote_ratio": ""
    },
    {
        "title": "Should I switch from physics to EE?",
        "author": "Zawaki",
        "url": "https://www.reddit.com/r/ECE/comments/6xu5rh/should_i_switch_from_physics_to_ee/",
        "text": "Undergraduate physics student here. After deciding that research isn't the path for me, I have started looking into the kind of R&amp;D companies that I might want to work for and (surprise surprise...) they tend to want engineers in favour of physicists since they can...you know...actually make stuff..........\nAnyway, it seems that electrical engineering might be the place to be; it seems very transferable and in demand just about everywhere.\nBUT, I would like to understand better the following things: \n\n-what kind of career prospects does EE give you i.e. what are the sorts of companies/projects that EE grads tend to go onto.\n\n-how closely related is EE to physics when actually used professionally e.g. at companies that make chips such as intel, would the chip research and design be done by EE's or physicists? (at first thought, it seems to me that physics should be better suited to this due to its fundamental treatment of semi-conductors, so please enlighten me!)\n\n-[very specific question so feel free to not answer] I have noticed that even the field of quantum computing seems to be littered with EE's everywhere! This came as a great surprise to me, so does anybody understand why this might be the case?\n\nIf you have made it to the end, thanks for reading!",
        "created_utc": 1504456632,
        "upvote_ratio": ""
    },
    {
        "title": "The battle of the authors (Boylestad vs. Floyd vs Malvino)",
        "author": "aeroncdino",
        "url": "https://www.reddit.com/r/ECE/comments/6xrfbg/the_battle_of_the_authors_boylestad_vs_floyd_vs/",
        "text": "Hello pips!\nCan you tell me the differences of the following authors in discussing electronics circuit theories and electronics communication system in their respective book?\nAnd also their strengths, edges among others.\n\nElecs Ckt: Boylestad vs. Floyd vs. Malvino\n\nCommunications: Tomasi vs. Frenzel Jr. vs. Blake\n\nThanks for the answers! ",
        "created_utc": 1504415827,
        "upvote_ratio": ""
    },
    {
        "title": "Help reading a datasheet?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6xq0ar/help_reading_a_datasheet/",
        "text": "[deleted]",
        "created_utc": 1504397923,
        "upvote_ratio": ""
    },
    {
        "title": "ESP-idf Help. Get wifi connection failure.",
        "author": "Xials",
        "url": "https://www.reddit.com/r/ECE/comments/6xpouc/espidf_help_get_wifi_connection_failure/",
        "text": "So apparently the esp32 subreddit is a joke. Google seems less than helpful as well. The Blufi example code is pre-compiled for some reason and all data exchanges are encrypted. Good job on that Espressif. How about showing how functions pass through in the example code, and encrypt code in an encryption example? Anyway, I could use some suggestions on why it returns 0? I'm definitely not much for embedded systems. I've paid some engineers at a firm about $20k so far to figure it out and they couldn't handle it so I am doing it myself. (I know that's bad) I have a BS in CS, but have done very little embedded without any real debuggers.",
        "created_utc": 1504394123,
        "upvote_ratio": ""
    },
    {
        "title": "Need some help fixing my stove",
        "author": "sakian",
        "url": "https://www.reddit.com/r/ECE/comments/6xorn8/need_some_help_fixing_my_stove/",
        "text": "About a week ago my wife was doing a bunch of baking when our LG stove (model LRE6321ST) stopped working and displayed a F9 error. Looked up the code and it means the stove is not heating. After checking, both the baking and broiling elements don't turn on but the cooktop and control panel are still fully functional.\n\nHad a repair guy come in and he said the main control board needs to be replaced. This would cost $300 for the part + $200 for the labour! I figured before dropping this much for the control board (I can replace it myself) I would check myself.\n\nChecked the usual culprits, both the baking and broiling elements seem fine, I get the 15-20 Ohm across them. Thermistor seems good with 700 Ohms at room temperature. Safety thermostat  and both fuses have continuity. Took both the main control board and the relay control board out and didn't see any signs of damage (no scorch marks, melting, or blown capacitors).\n\nMy main reason that I don't think it is the main control board is that I still hear the relays (on the relay board) switch when turning on the stove (both baking and broiling). Doesn't this mean that the main control board is sending the right signal to turn the relay on? Seems more likely that the relay board is blown. Does this make sense?\n\nI suppose I could check continuity of the relays when engaged, but this means they would need to be powered, and I don't want to test with the stove plugged in, would need to find another power source.\n\nAlso heard that this may mean that 240V isn't coming to the stove and the cooktop and controls still work at 120V. This make any sense?",
        "created_utc": 1504384279,
        "upvote_ratio": ""
    },
    {
        "title": "Help with choosing a release mechanism",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6xnr3z/help_with_choosing_a_release_mechanism/",
        "text": "[deleted]",
        "created_utc": 1504375722,
        "upvote_ratio": ""
    },
    {
        "title": "Leaving a team for more interesting work?",
        "author": "SoleSoulSeoul",
        "url": "https://www.reddit.com/r/ECE/comments/6xn2wi/leaving_a_team_for_more_interesting_work/",
        "text": "Hey /r/ECE \n\n\nI'm a CompE taking my senior design course at the moment. Basically, the course is structured such that you work in a team of up to 5 members, and you have the entire semester to build something that a senior in CompE/EE ought to be able to build. If you succeed, you pass, if not, you fail. Pretty standard and autonomous which I'm happy about.\n\n\nSo, I told a team that is building a web application that I would be working with them (React, Django, ECMAs). However, a robotics/AI vision project opened up that I'd be much more interested in, and would be much more beneficial on a resume for me as CompE than a web app would (C/C++ in an embedded space, VHDL, computer vision libraries).\n\nWould it be fair to leave my current team for a new, more interesting and relevant one? The class is only a week in, and no real work has started yet.\n\nOpinions?",
        "created_utc": 1504369974,
        "upvote_ratio": ""
    },
    {
        "title": "In ᴏrder tᴏ αttrαct new custᴏmers tᴏ ᴏur stᴏre we αre mαkÍng α greαt prᴏmᴏtÍᴏn. We αre gÍvÍng αwαy 100 MechαnÍcαl Leαther Wαtches(normαlly 100$) ᴏnly tᴏdαy. All yᴏu have tᴏ dᴏ Ís leαve α hᴏnest revÍew αnd Pαy SHÍPPÍNG",
        "author": "paypoo46441",
        "url": "http://0nlinsfr3324.blogspot.com/2017/09/in-rder-t-ttrct-new-custmers-t-ur-stre.html",
        "text": "",
        "created_utc": 1504360857,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to Find a Microelectronics Book",
        "author": "IvanBruski",
        "url": "https://www.reddit.com/r/ECE/comments/6xkqcj/trying_to_find_a_microelectronics_book/",
        "text": "Hello everyone,\nLast semester i was taking electronics 1 course and we had to buy the sendra/smith Microelectronics circuits international 6th edition. Now i am taking electronics 2 (microelectronics) and our instructor wants us to bring the same book but 7th edition.I know that both are the same but problem numbers differ. Can someone provide me a pdf of the book so i can stay on the same page with our instructor?\nThanks. ",
        "created_utc": 1504342415,
        "upvote_ratio": ""
    },
    {
        "title": "Schools that have tape outs as a part of their curriculum in Masters?",
        "author": "Scar9591",
        "url": "https://www.reddit.com/r/ECE/comments/6xkbe8/schools_that_have_tape_outs_as_a_part_of_their/",
        "text": "Hi all I am exploring options for a Masters degree, My interests are in SoC/FPGA Design/Validation/Verification. I have heard that some schools in Masters programs allow you to design and tapeout chips as a part of their masters program Could anyone help me find out which schools have such options and how do I find out whether schools have option or not.",
        "created_utc": 1504335382,
        "upvote_ratio": ""
    },
    {
        "title": "Electronics engineering app",
        "author": "Engineer941",
        "url": "https://play.google.com/store/apps/details?id=electronicselectrical.com.electronicsengineering",
        "text": "",
        "created_utc": 1504335107,
        "upvote_ratio": ""
    },
    {
        "title": "Resume Feedback? [Embedded Systems, Entry Level]",
        "author": "ggg842",
        "url": "https://ibb.co/ga9mzF",
        "text": "",
        "created_utc": 1504314968,
        "upvote_ratio": ""
    },
    {
        "title": "Resume Feedback? [Embedded Systems, Entry Level]",
        "author": "[deleted]",
        "url": "https://ibb.co/mf4fRv",
        "text": "[deleted]",
        "created_utc": 1504314222,
        "upvote_ratio": ""
    },
    {
        "title": "Resume Feedback? [Embedded Systems, Entry Level]",
        "author": "[deleted]",
        "url": "https://ibb.co/mf4fRv",
        "text": "[deleted]",
        "created_utc": 1504314163,
        "upvote_ratio": ""
    },
    {
        "title": "Hey ECE! I'm looking for a textbook or references for a class that has no textbook.",
        "author": "FrozenCalamity",
        "url": "https://www.reddit.com/r/ECE/comments/6xibty/hey_ece_im_looking_for_a_textbook_or_references/",
        "text": "The course description: \n&gt;Circuit Analysis and Synthesis using Laplace Transforms. Two port theory. Applications of circuit analysis and synthesis in analog electronics, power electronics, power systems, op-amp circuits.\n\nThere is a lot of people from my school that have said this course ENG 3315 Circuit Theory and Design is extremely hard because it does not have a textbook, and the teaching style from the professor is a hit-or-miss. I had a tough time finding videos from well known universities like MIT for videos relating to these subjects. Anyone have any recommendations to some textbooks/videos/free materials that cover some of these subjects? I do not mind referring to multiple textbooks.\n\nThanks!\n\n\n",
        "created_utc": 1504308606,
        "upvote_ratio": ""
    },
    {
        "title": "TIL that you don´t get an electrical shock when touching a live wire because of the \"conductive\" connection between the floor and your shoes, but because of the capacity that your body represents and the electric properties of capacitors in AC grids.",
        "author": "Cebl_Hg",
        "url": "https://www.reddit.com/r/ECE/comments/6xhsmv/til_that_you_dont_get_an_electrical_shock_when/",
        "text": "",
        "created_utc": 1504303121,
        "upvote_ratio": ""
    },
    {
        "title": "Memory Mapped Addresses",
        "author": "casuallywill",
        "url": "https://www.reddit.com/r/ECE/comments/6xg2p6/memory_mapped_addresses/",
        "text": "I am currently using the TM4C microcontroller and trying to grasp the concept of memory mapped addresses. \n\nAm I correct in saying that each address corresponds to a byte e.g. 0x4400 to 1 byte and 0x4401 points to the next byte?\n\nThis is what I thought until I saw the 32 bit register for the GPIO data where 0x4004 points to bit 0 and 0x4008 to bit 1. This seems to suggest each address points to a single bit rather than a byte.\n\nThis is really confusing me, any help would be greatly appreciated!",
        "created_utc": 1504287028,
        "upvote_ratio": ""
    },
    {
        "title": "Atmel Studio 7 Build Error",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6xfryj/atmel_studio_7_build_error/",
        "text": "[deleted]",
        "created_utc": 1504284405,
        "upvote_ratio": ""
    },
    {
        "title": "How do I avoid pigeonholing myself into a single field based on my experience?",
        "author": "Full_of_confusion",
        "url": "https://www.reddit.com/r/ECE/comments/6xeziy/how_do_i_avoid_pigeonholing_myself_into_a_single/",
        "text": "Hey all.\n\nMy question pretty much boils down to the title.\n\nI am a recent EE graduate and I have begun working at a power company as a distribution design engineer. While I don't dislike the job, it is not what I want to do for the rest of my life, nor a field that I have particular interest in. It seems there is very limited \"true engineering\" in the utility power industry until you are very high on the ladder. \n\nI am beginning my master's in EE focusing on communications and DSP, which I'm certainly more interested in, but even looking at jobs now for non-power related communication's companies, the requirements seem very daunting and almost out of my league. I have hardly any coding experience either, which is a major deficit to my resume I feel. \n\nWhile I'm sure the requirements are inflated and there's meant to be a learning curve, I feel like my experience now is very limited in scope and almost non-applicable to the fields I'd much prefer to work in. Has anyone else experienced something similar? How did you approach this issue? How can I best utilize my masters and current job experience to tweak my resume for communications/DSP jobs? ",
        "created_utc": 1504277245,
        "upvote_ratio": ""
    },
    {
        "title": "Tools for modeling Low Voltage Secondary Networks, normal and faulted conditions",
        "author": "EatATaco",
        "url": "https://www.reddit.com/r/ECE/comments/6xey8z/tools_for_modeling_low_voltage_secondary_networks/",
        "text": "Might not be quite the right place to ask (if anyone knows of a more appropriate or narrowly focused subreddit, please let me know), but I am seeking some software tools to help me model secondary networks under normal conditions, and when there are faults (Phase to Phase, Phase to Ground, Multiple Phase to Ground, etc ) on the primary/secondary.\n\nThanks for any help.",
        "created_utc": 1504276902,
        "upvote_ratio": ""
    },
    {
        "title": "Point-to-point converter? (HVDC)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6xefzz/pointtopoint_converter_hvdc/",
        "text": "[deleted]",
        "created_utc": 1504271756,
        "upvote_ratio": ""
    },
    {
        "title": "Standford's EE program not ABET accredited? Advice needed.",
        "author": "PenelopeTheSmuggler",
        "url": "https://www.reddit.com/r/ECE/comments/6xc6q9/standfords_ee_program_not_abet_accredited_advice/",
        "text": "Hi r/ECE,\n\nI am an electrical engineer and a high school senior I mentor has decided to major in EE. Hooray! She is looking at Stanford but found out that its EE program is not ABET accredited. Should she be worried? Would any employer turn her away with a degree from Stanford, whose EE program is ranked #2 in the world according to many lists? The likelihood of her going into a field where a PE is necessary is extremely low. Thanks for any insight you have!",
        "created_utc": 1504238920,
        "upvote_ratio": ""
    },
    {
        "title": "How does this test circuit allow us to measure the input voltage offset of the op-amp?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6x9rqx/how_does_this_test_circuit_allow_us_to_measure/",
        "text": "[deleted]",
        "created_utc": 1504213305,
        "upvote_ratio": ""
    },
    {
        "title": "Image processing a QR code?",
        "author": "yusuksong",
        "url": "https://www.reddit.com/r/ECE/comments/6x92jb/image_processing_a_qr_code/",
        "text": "My senior project involves a device with a camera that scans QR codes and processes the information from the code for other purposes. I believe we can use MATLAB for image processing, but I am not sure how I would go about this. Realistically how difficult would this be? Some references to any resources that can help dive into this would be super helpful. ",
        "created_utc": 1504207167,
        "upvote_ratio": ""
    },
    {
        "title": "How To Help Harvey Victims + Estimated Reconstruction Cost. Please Share!",
        "author": "Tecnotray",
        "url": "http://www.t-trayusa.com/blog/2017/8/28/houston-reconstruction-cost",
        "text": "",
        "created_utc": 1504206551,
        "upvote_ratio": ""
    },
    {
        "title": "DIY Motion-Activated Sink: How to Make an IR-Controlled Tap",
        "author": "zacjack12",
        "url": "https://diyhacking.com/diy-motion-activated-sink-make-ir-controlled-tap/",
        "text": "",
        "created_utc": 1504197489,
        "upvote_ratio": ""
    },
    {
        "title": "Semiconductor Device Fundamentals Pierret",
        "author": "Grosso_",
        "url": "https://www.reddit.com/r/ECE/comments/6x3a7m/semiconductor_device_fundamentals_pierret/",
        "text": "[removed]",
        "created_utc": 1504137249,
        "upvote_ratio": ""
    },
    {
        "title": "Atmel-ICE, Arduino R3, Atmel Studio and debugging.",
        "author": "the_e_user",
        "url": "https://www.reddit.com/r/ECE/comments/6x2e4t/atmelice_arduino_r3_atmel_studio_and_debugging/",
        "text": "Greetings!\n\nI hope you're all well. I am working on trying to get my Arduino Uno R3 to work with Atmel-ICE in Atmel Studio to debug. I followed the specific tutorial on getting everything setup. \n\nhttp://blog.solutions-cubed.com/debugging-arduino-sketches-with-atmel-studio-7/\n\nAlthough there was no success. I was able to open up a project, select ATMEL-ICE as my tool and change the interface to debugWire. After I started to enable the debugWire, received the alerts for fuses like in the tutorial. After, I wasn't able to get debugWire to enable, I would get this error: \n\nhttp://imgur.com/a/UWbuN\n\nI looked online about possible ways to correct this solution. Many of them suggest to simply disconnecting the both the board and debugger. I did this several times and decided it was not the solution. I saw other suggestions of disabling BOOTRST fuse prior to debugging, but I am not familiar with how to do this, because I am currently learning. I tried to find online how to do this, but was unsuccessful. If someone could show me how to disable BOOTRST fuse in Arduino that woudl be great. Now, that aside I wanted to know if anyone else had this same problem and other solutions that I could try to implement. I would appreciate any help I have been tearing my hair out because of this debugging stuff. Yes, I cut the trace on RESET EN.\n\nUPDATE:\n\nIt appears that the microcontroller isn't being read...I think because when I go to tools/device programming: Under \"Device Signature: not read\" is appearing. Also the error suggest that the Arduino is unable to enter ISP or DW.\n\n\n***LAST UPDATE- Figured it out, turns out that when I was using ATMEL-ICE to debug I didn't see that I plugged in the header into the correct port in the ICE. I had it on SAM not AVR. Doh!",
        "created_utc": 1504128530,
        "upvote_ratio": ""
    },
    {
        "title": "Seeking electrical engineers and electronics technicians based near Santa Clara",
        "author": "uliejay",
        "url": "https://www.reddit.com/r/ECE/comments/6x0o31/seeking_electrical_engineers_and_electronics/",
        "text": "Hello,\n\nI am conducting research for an electronic equipment distributor interested in learning more about their users. We are seeking electrical engineers, test engineers, or electronics technicians for a one hour-long interview at their office in Santa Clara. Participants will be compensated with a $50 Amazon gift card.\n\nPlease fill out this form if you are interested:\nhttps://goo.gl/forms/NKZwlGeY8RZBPdUi1\n",
        "created_utc": 1504113583,
        "upvote_ratio": ""
    },
    {
        "title": "Transformer Installation",
        "author": "cologol",
        "url": "http://www.linecad.com/transformer-installation/",
        "text": "",
        "created_utc": 1504110822,
        "upvote_ratio": ""
    },
    {
        "title": "Something different - what's your favorite non-standard piece of office gear?",
        "author": "asinger93",
        "url": "https://www.reddit.com/r/ECE/comments/6x09v1/something_different_whats_your_favorite/",
        "text": "Keyboard trays, personal mini fridge, ultra fine pens - what auxiliary gear helps you do your job the best? ",
        "created_utc": 1504110228,
        "upvote_ratio": ""
    },
    {
        "title": "Designing surge protection with PTC parts",
        "author": "kentaurus712",
        "url": "https://www.reddit.com/r/ECE/comments/6wyvbq/designing_surge_protection_with_ptc_parts/",
        "text": "I'm considering using 2 PTC parts in series with the live and neutral wires respectively in the input of a circuit, simmetrically placed to better distribute the heat (they are submitted to certain fault current driving the temperature of the PTC to 120°C for a while), but from experience one PTC warms more than another, for instance 110°C vs 60°C. Is there a way to avoid this and balance the temperature? Any idea where I can find literature concerning this? Thanks in advance. ",
        "created_utc": 1504096898,
        "upvote_ratio": ""
    },
    {
        "title": "What if your smartphone can drive your computer software through shortcuts ?",
        "author": "mathieupassenaud",
        "url": "http://www.mathieupassenaud.fr/my-smartphone-as-a-shortcut-helper/",
        "text": "",
        "created_utc": 1504095651,
        "upvote_ratio": ""
    },
    {
        "title": "Stationary that make Engineers purr - let me know yours!",
        "author": "KillmyElecPteacher",
        "url": "https://www.reddit.com/r/ECE/comments/6wyasm/stationary_that_make_engineers_purr_let_me_know/",
        "text": "I had a stroke of luck - my maths teacher quit during our last few months at college. The event has changed the way I will learn in the future. This is because it allowed me to meet a mysterious, reclusive and strange substitute teacher... Mr Moon. This man was one of those Engineers that are like unicorns. Very quiet and unsociable but with a touch of brilliance if you merely took the time to listen. \n\nWhilst forcing him to chat with me alone after class, he informed me that he studied NLP and was dyslexic. He said everyone has a touch of dyslexia, it's all about the environment in which you learn and work - little things that we do not realise will effect the way you assimilate data and behave in stressful situations. He only uses green pens, needs a big sheet of paper or whiteboard and writes in a specific layout. This is the way he personally likes to assimilate data. He hates lined paper and blue biros because it makes him feel claustrophobic. \n\nHe was trying to explain that everyone will have their own unique way of approaching / solving problems. The greatest way to liberate your work and narrow your focus is to choose the correct stationary that suits your unique style. \n\nThe stationary that makes me tick: \n\n* A good quality mechanical pencil \n\n* Sprial note**book** that is squared (5mm grid instead of lines) \n\n* A good quality, fluffy, fuck-off sexy eraser. \n* I don't like sharing stationary because fuck them.\n\nBecause engineering is a difficult subject, does anyone have any stationary recommendations for other engineers? \n\n* What is your stationary love? \n\n* Is there a particular style of paper you like? \n\n* A brand of notebooks? \n\n* Do imperial rulers tickle your fancy?\n\n* Sharp pencil sharpeners get you off?\n\nlet me know.\n\n",
        "created_utc": 1504089848,
        "upvote_ratio": ""
    },
    {
        "title": "Which books/field(s) of math(s) should i know to understand this paragraph? Im so triggered.",
        "author": "im_thinker",
        "url": "https://i.redd.it/hfcanyx9qriz.jpg",
        "text": "",
        "created_utc": 1504052409,
        "upvote_ratio": ""
    },
    {
        "title": "How to merge 2 LEF designs in Synopsys IC Compiler II?",
        "author": "LibertyState",
        "url": "https://www.reddit.com/r/ECE/comments/6wu29h/how_to_merge_2_lef_designs_in_synopsys_ic/",
        "text": "Hi, \nIm trying to merge 2 lefs together. after loading tech and stuff, im doing:\n\n    read_lef lef1.lef\n    read_lef lef2.lef\n    check_workspace\n    write_lef merged.lef\n\nbut the output lef has 2 separate macros in it. I want one top macro in the merged lef called like \"macro_merged\" with all the pins from both lefs in it.\nThanks",
        "created_utc": 1504038957,
        "upvote_ratio": ""
    },
    {
        "title": "Diy electric motor",
        "author": "da_volvo_man",
        "url": "https://www.reddit.com/r/ECE/comments/6wso4j/diy_electric_motor/",
        "text": "[removed]",
        "created_utc": 1504026818,
        "upvote_ratio": ""
    },
    {
        "title": "Can we use Conjugate Gradients method to maximize a function instead of minimizing?",
        "author": "Jurunas",
        "url": "https://www.reddit.com/r/ECE/comments/6wsdtf/can_we_use_conjugate_gradients_method_to_maximize/",
        "text": "So I am trying to [Conjugate Gradients method](http://www.cs.cmu.edu/%7Equake-papers/painless-conjugate-gradient.pdf) to find the vector x which maximizes a [function L(x): Rn -&gt; R1](http://i.imgur.com/e06YyeH.png).\n\nI tried to cheat the algorithm by changing the signal of the function, thinking it would minimize -L(x). But it showed to be immune to it because of the way it computes the alpha factor.\n\nI sincerely appreciate any help.",
        "created_utc": 1504024303,
        "upvote_ratio": ""
    },
    {
        "title": "how inductor blocks ac? - Engineering Community",
        "author": "electronics2electric",
        "url": "https://electronics2electrical.com/476/how-inductor-blocks-ac",
        "text": "",
        "created_utc": 1504024112,
        "upvote_ratio": ""
    },
    {
        "title": "Cleaning Things Up: Noisy Signals and Proper Practice",
        "author": "zacjack12",
        "url": "https://diyhacking.com/cleaning-things-up-noisy-signals-and-proper-practice/",
        "text": "",
        "created_utc": 1504023172,
        "upvote_ratio": ""
    },
    {
        "title": "System on a Chip",
        "author": "trollbob",
        "url": "http://i.imgur.com/H8c3BDz.jpg",
        "text": "",
        "created_utc": 1504022558,
        "upvote_ratio": ""
    },
    {
        "title": "Comparing ARM and Arduino Embedded Systems. Any suggestions for learning NXP Processor expert?",
        "author": "kraegarthegreat",
        "url": "http://www.babydonthertzme.ca/2017/08/embedded-systems-arm-or-arduino.html",
        "text": "",
        "created_utc": 1504017017,
        "upvote_ratio": ""
    },
    {
        "title": "Circuits bonehead here, need some help with homework problem",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6wp0qh/circuits_bonehead_here_need_some_help_with/",
        "text": "[deleted]",
        "created_utc": 1503981983,
        "upvote_ratio": ""
    },
    {
        "title": "Does Geometric Algebra have any applications in industry ECE?",
        "author": "RTA5",
        "url": "https://www.reddit.com/r/ECE/comments/6wnx2a/does_geometric_algebra_have_any_applications_in/",
        "text": "Hello everyone,\n\nI recently read/skimmed [this IEEE article](http://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=6876131) about applications of geometric algebra to EEs and was curious if any of you have concrete examples of Geometric Algebra being used in industry.\n\nI work in Automotive and this math is not at all useful for my day job.  I'm mostly curious if it is handy for anyone in computational electromagnetics or a similar math-heavy field.  I was not satisfied with the paper's applications being mostly new derivations of formulas.",
        "created_utc": 1503969171,
        "upvote_ratio": ""
    },
    {
        "title": "phone interview with senior hardware manager coming up. I'm missing certain experience: how can I prove I can make up those proficiencies?",
        "author": "ecethelp",
        "url": "https://www.reddit.com/r/ECE/comments/6wmpb6/phone_interview_with_senior_hardware_manager/",
        "text": "Intro: Hello ECE professionals, this is a throwaway account for private reasons. I appreciate any tips for a 2nd phone interview I have for a Hardware Position that I see myself working in. \n\nBackground:\nI have been working in the radio broadcast industry for 5+ years and I have a B.S. in Electronics &amp; Computer Engineering Technology. I have considered about changing industries lately and finally have the opportunity to secure an interview with a company I find a lot of interest in. My day-to-day electronic engineering is in a different industry than the one applying for but we cover a very large lateral amount of projects. I feel that my current experience is may not be applicable for the position I'm applying for. I have a grasp on the fundamentals of electrical engineering, drawn electronic schematics, procured parts, designed PCB project, familiar with scopes and can use test equipment. Looking to brush up on my C and can think like an engineer but since I don't have the related experience - how will I sell myself effectively?\n\nPosition responsibilities: analog mixed hardware design experience (a plus), design advanced audio electronics, digital filter design, soldering and component sorting, knowledge of consumer electronics audio connectivity standards, wireless systems, and protocols.\n\n\nAny comments is appreciated - I thank you!\n\n",
        "created_utc": 1503956953,
        "upvote_ratio": ""
    },
    {
        "title": "I found this sticky circuit inside the back cover of my cellphone. What is this for?",
        "author": "citizen6022140857",
        "url": "https://i.redd.it/e1wpkg2guiiz.jpg",
        "text": "",
        "created_utc": 1503944824,
        "upvote_ratio": ""
    },
    {
        "title": "MiniZed, FLIR Lepton &amp; 7 Inch touch display",
        "author": "adamt99",
        "url": "https://forums.xilinx.com/t5/Xcell-Daily-Blog/Adam-Taylor-s-MicroZed-Chronicles-Part-213-Driving-a-7-Inch/ba-p/789450",
        "text": "",
        "created_utc": 1503935074,
        "upvote_ratio": ""
    },
    {
        "title": "Upverter joins Altium",
        "author": "tabchas",
        "url": "https://blog.upverter.com/author/upverter/",
        "text": "",
        "created_utc": 1503930097,
        "upvote_ratio": ""
    },
    {
        "title": "PCB with no holes?",
        "author": "NastyButtler322",
        "url": "https://www.reddit.com/r/ECE/comments/6whd4q/pcb_with_no_holes/",
        "text": "I've been searching the web for boards that I can just drill holes into where I need them, not the pcb's that have a lot of holes everywhere. I have things that I want to get onto these boards, and I doubt the PCB holes would align with some of these components for different projects. One example is that I have Nixie Tubes. I know I can get a Nixie Tube base, but I would rather just get a bunch of boards for electronics since I have several kinds of Nixie Tubes, and several other kinds of components for completely unrelated projects.\n\nCan anyone tell me what these boards are called, or where I should look if they are called PCB's? Amazon only has the kind with holes everywhere.",
        "created_utc": 1503897314,
        "upvote_ratio": ""
    },
    {
        "title": "I have a graduate degree in Electrical Engineering and professional experience in programming. I feel lost.",
        "author": "TheGoodPlaceJanet",
        "url": "https://www.reddit.com/r/ECE/comments/6wgg0p/i_have_a_graduate_degree_in_electrical/",
        "text": "I really enjoyed my studies in EE, particularly since I was focusing on signal processing techniques.\n\nHowever the jobs I've had over the years have been programming jobs, and I severely lack software engineering fundamentals or computer science principles.\n\nAny tips? I would love to work on signal processing stuff again but I don't know any companies that do that type of work and are hiring. On paper my resume looks good, but I cannot find matches to skills in the job market.\n\nThat said I've never been unemployed but I just feel like my positions have all been dead-ends.\n\nAll your comments and feedbacks are welcome. Thank you!",
        "created_utc": 1503886387,
        "upvote_ratio": ""
    },
    {
        "title": "Controls or Digital Signal Processing",
        "author": "jeremyolar",
        "url": "https://www.reddit.com/r/ECE/comments/6wfyly/controls_or_digital_signal_processing/",
        "text": "Is currently an upcoming senior in college and is working to complete one of these concentrations! Is yet to take the senior level classes but can people give more insight into what they do? and how is the job prospects for each concentration? Any article which give a lot of details about this concentration would help !! Thanks",
        "created_utc": 1503880722,
        "upvote_ratio": ""
    },
    {
        "title": "Jobs4Days.com Search Engineering Jobs, get Hired!",
        "author": "Jobs4Days1",
        "url": "https://i.redd.it/cf3kx9gt8diz.png",
        "text": "",
        "created_utc": 1503877003,
        "upvote_ratio": ""
    },
    {
        "title": "Taking embedded system design course? Help me select a micro controller or processor.",
        "author": "akhroat",
        "url": "https://www.reddit.com/r/ECE/comments/6werbe/taking_embedded_system_design_course_help_me/",
        "text": "I'm a total noob to embedded system design and the course I'm taking requires me to develop a project. Now I'm more of an Electrical guy who likes renewable, inverter, solar etc so it would be my desire that an embedded project I do has an application in this field.\n\nThat being said, I haven't studied digital logic design and a friend of mine suggested that instead of FPGA, I should go the micro controller route because it can be programmed using C. Problem is I have no idea which controller to go for (or how much powerful controller do I need). I started looking into TM4C123 and TM4C1294 microcontrollers because I was able to find a book by Valvano that covers this. But honestly looking at TI catalog they seem to have better and advanced options available. I haven't even considered Arduino or RPI yet.\n\nSo guys I'm confused. Trying to do a lot of reading into things on my end and I wanted to check with you guys to see If you can point me in the right direction.\n\nThank you.",
        "created_utc": 1503867793,
        "upvote_ratio": ""
    },
    {
        "title": "We αre gÍvÍng 100 FRЁЁ MЁCHΑNÍCΑL wαtches (normαlly 100$) Ín Ёxchαnge of α honest revÍew when Ít comes! Αll you hαve to do Ís pαy shÍppÍng! LÍmÍted tÍme offer.",
        "author": "jackfrost111677",
        "url": "http://bvy0nl1n324st.blogspot.com/2017/08/we-re-giving-100-fr-mchnicl-wtches.html",
        "text": "",
        "created_utc": 1503857364,
        "upvote_ratio": ""
    },
    {
        "title": "We αre gÍvÍng 100 FRЁЁ MЁCHΑNÍCΑL wαtches (normαlly 100$) Ín Ёxchαnge of α honest revÍew when Ít comes! Αll you hαve to do Ís pαy shÍppÍng! LÍmÍted tÍme offer.",
        "author": "patatja96",
        "url": "http://b3stwatch3sshop.blogspot.com/2017/08/we-re-giving-100-fr-mchnicl-wtches.html",
        "text": "",
        "created_utc": 1503850313,
        "upvote_ratio": ""
    },
    {
        "title": "A made video of how I use python for web scraping.",
        "author": "riseNRG",
        "url": "https://www.youtube.com/watch?v=nou3NgY6_tg",
        "text": "",
        "created_utc": 1503839370,
        "upvote_ratio": ""
    },
    {
        "title": "Debugging Arduino! How much do you know?",
        "author": "the_e_user",
        "url": "https://www.reddit.com/r/ECE/comments/6w87vc/debugging_arduino_how_much_do_you_know/",
        "text": "Hello everyone! I hope you are well! I am getting started with Arduino programming and electronics in general. I am currently trying to debug and see packages that are being sent between two boards. I have been unable to successfully debug the boards and I need help. I have downloaded Visual Micro a plug in for Atmel Studio 7 that allows you to integrate Arduino code into the  AVR IDE. my understanding about debugging was that you could do this via USB-B cable (Printer cable), but that was overturned when I read around about debugging Arduinos and I am starting to think that I need an actual programmer like Atmel ICE, AVR Dragon, or Pocket Programmer by Sparkfun to debug in the manner I am seeking, is this correct? I have read tutorials where you have to disconnect the rest button and what not, but I don't exactly want to do that. If my hunch is correct can you mind explaining why you cannot upload via printer cable or an article that can? I am aware of the debugWire function but I am still trying to figure out how that works and what it's capabilities are (seeing data packets). In the meantime I thought I'd ask. Also, I know you could make an Arduino into an ISP programmer, but do it's capabilities include debugging or is that a inherent function to all types of programmers? Visual Micro, an AVR Studio plug in, offers a pro license with a USB feature to debug, but I'm not sure if this means the cable I am currently using. Also, I am planning to program more AVR chips in the future so I think it would make the pro license for Visual Micro obsolete in the long run. Thank you very much!!",
        "created_utc": 1503782649,
        "upvote_ratio": ""
    },
    {
        "title": "Which course to take ?",
        "author": "OverlookingOwl",
        "url": "https://www.reddit.com/r/ECE/comments/6w67ud/which_course_to_take/",
        "text": "I am a sophomore undergrad majoring in ECE. I have the choice between taking discrete structures this semester and elementary linear algebra the next or vice versa. Which should I take first in term of importance related to the major ?\nedit: discrete structures: Math 211.\n       elem lin alg : Math 218.\n[course description](https://www.aub.edu.lb/registrar/Documents/catalogue/undergraduate10-11/mathematics.pdf)",
        "created_utc": 1503762161,
        "upvote_ratio": ""
    },
    {
        "title": "What are the best websites or books to get started with PLC programming?",
        "author": "Dankmaster619",
        "url": "https://www.reddit.com/r/ECE/comments/6w66o5/what_are_the_best_websites_or_books_to_get/",
        "text": "",
        "created_utc": 1503761807,
        "upvote_ratio": ""
    },
    {
        "title": "a textbook of electrical technology volume 1 by theraja",
        "author": "MikkiTechBooks",
        "url": "http://www.techbooksyard.com/a-textbook-of-electrical-technology-volume-1-by-theraja/",
        "text": "",
        "created_utc": 1503757196,
        "upvote_ratio": ""
    },
    {
        "title": "Arduino Web Control: Step By Step Guide - Udemy",
        "author": "electronics_hobby",
        "url": "https://lm.facebook.com/l.php?u=https%3A%2F%2Fclick.linksynergy.com%2Flink%3Fid%3D0N9z%252AQVIOZY%26offerid%3D358574.1325612%26type%3D2%26murl%3Dhttps%253A%252F%252Fwww.udemy.com%252Farduino-web-control-step-by-step-guide%252F&amp;h=ATP5CdV0sCXwGV1hllrupnR5XWMNE7962Gg7C3hYGeg15CDVhUjSheALq3mc-PR-u4wN_vU_tNwJB76ojWITCDoV-0Wfp2lws6uA74Pv8YZWKbvtZGX86HfXphjfhP6uMbOsfbNNiXg&amp;enc=AZO6LocdfRSvBYuWCCcaNvW_Yx_y2CNEnVH1VwOOvewudBysVuhUpxd1Vma0aLkepyg8J26n1Oq3JzSkkl0Q0Y6rN2OQaAiuYO4vU2pb8SY_o3yDWhMo-ZDuM9WKgjW6QnDpg69foxo6MC0uRljXf39DYle1YFZv3IaMWzE-WUc5ISRVuM4pxKRu4FnqgP-epvk&amp;s=1",
        "text": "",
        "created_utc": 1503752307,
        "upvote_ratio": ""
    },
    {
        "title": "Tips for having foreign professors you can't understand well (got dealt a bad hand in ODE and Physics 2)?",
        "author": "Alphathrowawayname",
        "url": "https://www.reddit.com/r/ECE/comments/6w3lst/tips_for_having_foreign_professors_you_cant/",
        "text": "",
        "created_utc": 1503720768,
        "upvote_ratio": ""
    },
    {
        "title": "Books for DDR3 and DDR4 design and architecture",
        "author": "phtzer",
        "url": "https://www.reddit.com/r/ECE/comments/6w2lm6/books_for_ddr3_and_ddr4_design_and_architecture/",
        "text": "Hello,\n\nI have been trying to learn more about DDR coming from a SerDes background. I tried to jump into the specs and app-note about timing margins and designs. Right now I am trying to wrap my head around JESD79-4B. Has anyone who has gone through this have any detailed introduction to DDR? Preferably DDR3 and DDR4? \n\nI searched the subreddit and found: https://www.reddit.com/r/ECE/comments/10k27f/designing_with_ddr3_confused_scared_and/\n\nbut I still think no high-level -&gt; design resource was provided for beginners. \n\nAny help appreciated, I plan to rummage through app notes in the mean time. Thanks!",
        "created_utc": 1503708276,
        "upvote_ratio": ""
    },
    {
        "title": "EE books for a self teaching student",
        "author": "the_e_user",
        "url": "https://www.reddit.com/r/ECE/comments/6w1kgc/ee_books_for_a_self_teaching_student/",
        "text": "Hi everyone, I hope your day is well. I wanted to ask what are some books that help with understanding the basics for EE and circuit design. I am talking about books, videos, websites or anything that breaks concepts down very well. Another is how can I practice circuit design without always have a project to work on. For example in books I read what a capacitor does but they don't quite explain how \"storing charge\" will come in handy while designing a circuit. Thanks!",
        "created_utc": 1503697169,
        "upvote_ratio": ""
    },
    {
        "title": "Seeking career advice and feedback on a technical document describing off-grid systems.",
        "author": "LiveWithEarth",
        "url": "https://www.reddit.com/r/ECE/comments/6w13vs/seeking_career_advice_and_feedback_on_a_technical/",
        "text": "During my final year as a grad student, I got an idea for how to design renewable, off-grid (stand-alone) power systems and founded OffGrid. I developed an algorithm that estimates how much energy storage vs. how much solar power are required for off-grid systems. The result shows an inverse relationship between generation and storage. I was unable to secure funding to continue this organization, so I published the algorithm on GitHub and began job searching.\n\nI've been searching for months with no job offer yet. I think trying to start this organization might be \"off-putting\" to some hiring managers, so I decided to write a technical document describing my results for hiring managers. I plan to place this document on my Linkedin profile, and I might also attach it to job applications. Would this be a good idea? My objective is a career in the power or renewable energy industry, but I am applying for positions in other industries too.\n\nMay I please get some advice on my situation and feedback on my document? Here is a copy of the document: http://docdro.id/HWEHJnM\n\nHere is my resume: http://docdro.id/oK2u7UV\n\nThanks",
        "created_utc": 1503692717,
        "upvote_ratio": ""
    },
    {
        "title": "In order to attract new customers to our store we are making a great promotion. We are giving away 100 Mechanical Leather Watches only today. DONT MISS",
        "author": "te5611877",
        "url": "http://fr3ealwatch3s.blogspot.com/2017/08/in-order-to-attract-new-customers-to.html",
        "text": "",
        "created_utc": 1503690356,
        "upvote_ratio": ""
    },
    {
        "title": "What does IO Ring or Pad Ring team do in semiconductor companies?",
        "author": "LibertyState",
        "url": "https://www.reddit.com/r/ECE/comments/6w0k7m/what_does_io_ring_or_pad_ring_team_do_in/",
        "text": "Hi,\nFor example for a company that buys some small chips to integrate into their own graphic cards, they perform quality checking in this teams:\n-The front end team that checks it right when the company gets it then releases it to actual chip teams\n-An IO Ring or Pad Ring team\n-Tile team\n-System on chip team (that actually creates the company chips and uses the small chip they bought in it)\n\nThats from my understanding. What does IO/Pad ring team mean? and Tile team?\n\nThanks",
        "created_utc": 1503687529,
        "upvote_ratio": ""
    },
    {
        "title": "Information on Connecting STM32 to Bluegiga Module for Communication with API over Network",
        "author": "AnonyMowzz",
        "url": "https://www.reddit.com/r/ECE/comments/6w0a9a/information_on_connecting_stm32_to_bluegiga/",
        "text": "Resources? Anyone have any Pointers?",
        "created_utc": 1503685042,
        "upvote_ratio": ""
    },
    {
        "title": "Resources for learning C",
        "author": "ebUddye",
        "url": "https://www.reddit.com/r/ECE/comments/6vzxpz/resources_for_learning_c/",
        "text": "I am an entry level electrical engineer and I do not have much programming experience. I took a Java class in undergrad (class was about 4 years ago) and got very limited exposure to other programming. Most of my courses focused on hardware design.\n\nWhat are some good ways to learn C on my own? Are there any websites or tutorials that are recommended more than others? Lastly, what software will I need to download (I think I used eclipse for Java)?\n\nAny guidance would be appreciated, thanks!",
        "created_utc": 1503681883,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any modern software that can export data acquisitions into excel?",
        "author": "repost_from_9gag",
        "url": "https://www.reddit.com/r/ECE/comments/6vytgk/is_there_any_modern_software_that_can_export_data/",
        "text": "We have a station setup for testing some of our products. It uses an Iotech daqboard 1000. The problem is the computer is old, and starting to have problems. I am looking into ways to upgrade to a modern computer, but from what I can tell there really isn't any modern software that allows for complete control over the input to excel. The software we are using on that computer hasn't been supported since 2010. Is the only option just to install a version of excel on a modern computer, or does anyone happen to know of any modern software that can do this?",
        "created_utc": 1503671395,
        "upvote_ratio": ""
    },
    {
        "title": "Arduino Web Control: Step By Step Guide - Udemy",
        "author": "[deleted]",
        "url": "https://click.linksynergy.com/link?id=0N9z*QVIOZY&amp;offerid=358574.1325612&amp;type=2&amp;murl=https%3A%2F%2Fwww.udemy.com%2Farduino-web-control-step-by-step-guide%2F",
        "text": "[deleted]",
        "created_utc": 1503656422,
        "upvote_ratio": ""
    },
    {
        "title": "any good book on speakers,amplifiers,or sound phenomena itself?",
        "author": "amir_97",
        "url": "https://www.reddit.com/r/ECE/comments/6vxjxv/any_good_book_on_speakersamplifiersor_sound/",
        "text": "im looking for books for in depth understanding of these things with complete details,im acquainted with electronics and circuits and preliminary understanding of how those work.\nTnx",
        "created_utc": 1503656125,
        "upvote_ratio": ""
    },
    {
        "title": "Arduino Web Control: Step By Step Guide - Udemy",
        "author": "[deleted]",
        "url": "https://click.linksynergy.com/link?id=0N9z*QVIOZY&amp;offerid=358574.1325612&amp;type=2&amp;murl=https%3A%2F%2Fwww.udemy.com%2Farduino-web-control-step-by-step-guide%2F",
        "text": "[deleted]",
        "created_utc": 1503650375,
        "upvote_ratio": ""
    },
    {
        "title": "Arduino Web Control: Step By Step Guide - Udemy",
        "author": "[deleted]",
        "url": "https://click.linksynergy.com/link?id=0N9z*QVIOZY&amp;offerid=358574.1325612&amp;type=2&amp;murl=https%3A%2F%2Fwww.udemy.com%2Farduino-web-control-step-by-step-guide%2F",
        "text": "[deleted]",
        "created_utc": 1503649563,
        "upvote_ratio": ""
    },
    {
        "title": "Arduino Web Control: Step By Step Guide | Udemy Course",
        "author": "[deleted]",
        "url": "http://theurl.co/VVOIA",
        "text": "[deleted]",
        "created_utc": 1503648298,
        "upvote_ratio": ""
    },
    {
        "title": "Engineering Community - Android App",
        "author": "electronics2electric",
        "url": "https://play.google.com/store/apps/details?id=electronicselectrical.com.engineeringcommunity",
        "text": "",
        "created_utc": 1503634889,
        "upvote_ratio": ""
    },
    {
        "title": "Understanding PSRR+ and PSRR- in a classic 2 stage ota.",
        "author": "eeguy616",
        "url": "https://www.reddit.com/r/ECE/comments/6vuu3l/understanding_psrr_and_psrr_in_a_classic_2_stage/",
        "text": "I just wanted some help in understanding the concept of how ripples in both positive and negative power supplies appear at the output for a 2 stage opamp and how PSRR is simulated in general. \nhttp://imgur.com/a/RngwC\n\n1) I wanted to go through and give my explanation of why ripples at Vdd show up at the output in the above circuit. I wanted to know if am right or wrong in my understanding of this concept. \nSo ripples at Vdd cause change in the current flowing through \nM6 and M7. This in turn causes the Vgs of M6 to change in reaction to the change in current. So the gate of M6 is coupled to the supply voltage and reacts to changes there. At very high frequencies the compensation cap Cc becomes a short and the ripple at the gate shows up at the output. \nDoes this more or less describe what is going on here?\n\n2) How would one explain any sort of ripples in the negative supply source and how does that show up in the output?Any ripples at Vss affects the drain current and gate voltage of M7 and shows up at the output (at high frequencies) through Cgd? The author of the book I am reading ( Allen Holberg) has 2 scenarios where he examines PSRR-ve. One where Vbias is grounded and the second where it is connected to Vss. How would these affect the PSRR-?\n\n\n\n",
        "created_utc": 1503618378,
        "upvote_ratio": ""
    },
    {
        "title": "What should i do in order to get a job actually designing things like hardware or semiconductors?",
        "author": "someoneregular",
        "url": "https://www.reddit.com/r/ECE/comments/6vucfr/what_should_i_do_in_order_to_get_a_job_actually/",
        "text": "I heard how electrical engineering has a low job growth outlook and i don't really have that much of an interest in going into software development compared to designing circuits like in a microchip.",
        "created_utc": 1503613264,
        "upvote_ratio": ""
    },
    {
        "title": "Curing paralyzed people with a 200 megapixel bi-directional nerve fiber signal detector-activator array (also related to blindness treatment)",
        "author": "herkato5",
        "url": "https://www.reddit.com/r/ECE/comments/6vtz7u/curing_paralyzed_people_with_a_200_megapixel/",
        "text": "\n200 megapixels might sound extraordinarily big at first hearing, but compared to normal computing hardware like flash and DRAM chips, it is small. Even compared to cameras it is actually not that big. It does not push the limits of semiconductor manufacturing. It can be many times clumsier and fraction of complexity than current best. The reason why 200 megapixel cameras are rare has to do with light and photography. Plus, a camera usually has 3 color channels with 256 degrees of brightness expressed with 8 bits on each. This nerve fiber sensor would get bitmaps, not even grayscale.\n\nWhen fixing a spinal cord injury, in order to get a reading from 20 million nerve fibers that are exposed in a clean and flat cut, away from the injury break, a 200 megapixel detector array may be necessary. Ten pixels per fiber-end compensates for lack of ability to discern 1 micrometer wide individual fibers in surgery.\n\nIf the raw data from the detector were made to a bitmap video, it would resemble raindrops hitting a surface, but the blobs hitting same spots over and over. Signals on same spot would activate partially different sets of pixels at different times.\n\nMatching all the millions of severed nerve-end pairs in software for correct or close enough signal routing is a formidable challenge for software engineering. For every patient, it may take weeks, months or years to configure. The configuration process may be much faster if the output side activator array can also sense the nerve ends it is in contact with.\n\nNerve fibers have individual differences. Even if the chips could classify only 2 types of fibers or measure only 1 parameter that varies between fibers, it could mean that nerve ends on both sides of the break form patterns that can be matched in software. Even if the cross section has deformed and twisted, and even if classification of nerve ends is unreliable.\n\nMeasurement could be passive or it could be based on the same phenomenon that enables signal detection on the input side.\n\nThe activator / stimulator array could measure the effect it just caused on the nerve end by outputting energy to it. That measurement could enable classification.\n\nAdjacent pixels might measure force vectors of electric fields in different directions and on different energies.\n\nSurgeon has to cut the nerve bundle so cleanly and flatly that most fiber ends get contact with the surface of the detector chip.\n\nBest case scenario about the level of difficulty is that a surgeon has to slap the chip tightly on a cut surface made in 45 degree angle and let the software engineers worry about the rest. This seems most likely.\n\nWorst case scenario: Maybe the surgeon has to use a very special cutting / polishing device on the cut surface, that is about as complex as the chip itself, but with microscopic nanotech mechanical parts too. Maybe the chip itself needs millions of nanotech mechanical parts for some reason. Maybe the chip needs to be coated with individually 3D printed elevations up to 10 micrometers thick with 100 nanometer precision. Maybe it needs some pharmaceutical constantly injected next to the chip. Maybe the chip needs to have microscopic fluid channels for chemicals. Maybe those pipes need to be controlled individually for every nerve fiber. Maybe there needs to be genetically engineered stem cells for some reason... One scenario is that the chip will work without any of these, but the connection will degrade fast and new surgery would be needed every year or every month. Maybe only output chip is difficult. Just being able to get readings from the input side chip would be very useful.\n\nTo cure blindness, slap something like it on optic nerve and let software engineers worry about the rest. And they have lot to figure out. It probably would be like reverse-engineering a strange video codec. It would be a journey to undiscovered country. Whatever preprocessing happens on retina, has to be done in software instead. Also, get input from eye muscle nerves so that eye movements can be simulated or cameras pointed and focused.\n\nIt is like Cochlear implant on sight.\n\nOptic nerve fiber thickness may depend on how much signals it has transmitted in some time-period. That is why measurements of the optical fibers may offer clues on how to \"connect\" them in software.\n\nMapping input pixels to output pixels between input and output chips needs some high-end math on software. Just being able to pair 3 nerve fiber ends from both sides enables methods in software. Start with 2D affine transformations on the pixel coordinates:\n\nhttps://en.wikipedia.org/wiki/Affine_transformation\n\nCalculate some of the deformation, turning and moving of the nerve fiber bundle. There will be some extra complexity to that math, that is similar to trying to correct photos taken behind badly made uneven glass or reflections from moving water. Predictions from affine transformation matrices get more misaligned as distance from paired fiber ends grows. \n\nThis way only a tiny fraction of fibers need to be paired the hard way, patient trying to move particular muscle or feeling a pinch on particular point. The final stage of pairing may involve recognizing patterns in fiber differences.\n\nAlso, as a side note, despite it not being optimized for that, the very same chip could be used for some of the same purposes as a microscope. It might be better in some tasks. Put one drop of ( possibly pre-processed ) blood on it, let it dry, and maybe cancer cells can be recognized from their reaction to electric fields. Maybe analyze minerals or sand with it... \n\n",
        "created_utc": 1503609705,
        "upvote_ratio": ""
    },
    {
        "title": "Creating a Atari Punk Console, help identifying this bus",
        "author": "rGreenTrees",
        "url": "https://i.redd.it/awi7m9813rhz.png",
        "text": "",
        "created_utc": 1503608681,
        "upvote_ratio": ""
    },
    {
        "title": "Dear friends in order to promote our new online store and attract new customers we are giving 200 FREE watches! Choose your favorite from our free collection and just pay shipping!",
        "author": "patatja51",
        "url": "http://fr333cat3g0ry.blogspot.com/2017/08/dear-friend-in-order-topromote-our-new.html",
        "text": "",
        "created_utc": 1503599900,
        "upvote_ratio": ""
    },
    {
        "title": "How do you tailor your resume for each position?",
        "author": "PM_ME_YOUR_MOSFETS",
        "url": "https://www.reddit.com/r/ECE/comments/6vrtgd/how_do_you_tailor_your_resume_for_each_position/",
        "text": "Hi all,  \nI was wondering if and how do you guys tailor your resume to each job application. Do you switch the objective to be \"Seeking position in software/controls/power\" Depending on the job title or add the company name in there? Recent grad that just passed the F.E. and wanted to know if I should do this while applying.",
        "created_utc": 1503590530,
        "upvote_ratio": ""
    },
    {
        "title": "Wireless serial adapters supporting high-speed programmable baud rate (625000baud)?",
        "author": "jms_nh",
        "url": "https://www.reddit.com/r/ECE/comments/6vrrcj/wireless_serial_adapters_supporting_highspeed/",
        "text": "Does anyone have experience with a wireless serial adapter that can communicate reliably between an embedded device and a PC at programmable baud rates? (not just powers of 2 times 9600 baud = 115200, 230400, 460800, 921600, etc.)\n\nWe have a system running at 625000baud and I'm looking for a way to remove the wires (both for electrical isolation and to eliminate the need for a mechanical connection).\n\nFound [this vendor](http://www.usconverters.com/wireless-serial-adapters) but all their stuff seems to be standard baud rates only (+230400, 460800, 921600)",
        "created_utc": 1503590030,
        "upvote_ratio": ""
    },
    {
        "title": "Which is the best site for study electrical engineering?",
        "author": "EngineeringCommunity",
        "url": "https://www.reddit.com/r/ECE/comments/6vrb0m/which_is_the_best_site_for_study_electrical/",
        "text": "[removed]",
        "created_utc": 1503585915,
        "upvote_ratio": ""
    }
]