[
    {
        "title": "static branch prediction and the role of compiler",
        "author": "PainterGuy1995",
        "url": "https://www.reddit.com/r/ECE/comments/11hhcvu/static_branch_prediction_and_the_role_of_compiler/",
        "text": "Hi,\n\nI was reading about the static branch predictors. I came across two different sources which, in my humble view, have an indirectly conflicting point of views. \n\nI have two questions here and I'd really appreciate it if you could help me.\n\n# Question 1:\n\nSource #1 is saying that static prediction is done by the compiler (yellow highlight). On the other hand, Source #2 is emphasizing the role of actual microprocessors (check yellow highlight) when it comes to the static branch prediction. But toward the end Source #2 does point to the compiler time (in green highlight). So, where am I going wrong with it? Is Source #2 saying that static branch prediction is done by both the compiler and microprocessor in tandem?\n\n&amp;#x200B;\n\n# Question 2:\n\nI remember when I worked with the microcontroller, a compiler was used (which was a part of the IDE used). The compiler translated the higher level code, such as C++, into the machine code, then that machine code was burned onto the microcontroller ROM, and that was the end of compiler role. I'm not sure what I'm saying is entirely correct but, at least, it lets you know my level of understanding.\n\nMy question is about the programs which are run on a computer such as on Windows operating system. When an .exe program is installed on Windows OS, I click on the .exe file it opens up a setup window which consists mostly of a sequence of steps to facilitate the installation of that program. \n\n&amp;#x200B;\n\n&gt;Executable files contain binary machine code that has been compiled from source code. This low-level code instructs a computer's central processing unit on how to run a program. The processor interprets the machine code and tells the computer's hardware what to do.\n\nSource: [https://www.techtarget.com/whatis/definition/executable-file-exe-file](https://www.techtarget.com/whatis/definition/executable-file-exe-file)\n\nSo, it means that .exe is already a compiled code in binary. If it's already compiled, what kind of prediction it can does? Did the programmer/compiler/both inserted certain extra code (based on probability, general experience of programmer, or just 50/50 decisions, etc.) which helps with the prediction? \n\n&amp;#x200B;\n\n **Source #1:**\n\n[Processor Architecture From Dataflow to Superscalar and Beyond By Jurij Silc, Borut Robic, Theo Ungerer · 2012, page #133](https://preview.redd.it/44dqb50xjlla1.png?width=602&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=d7234545cd7d97bab3ca7c8c0dbbc4667c5efe48)\n\n&amp;#x200B;\n\n**Source #2:**\n\n[https:\\/\\/en.wikipedia.org\\/wiki\\/Branch\\_predictor#Static\\_branch\\_prediction](https://preview.redd.it/gt9b1x1dllla1.png?width=986&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=4174450591e07b906a342a1182dfd63ae0ec6e8c)",
        "created_utc": 1677883080,
        "upvote_ratio": 1.0
    },
    {
        "title": "I do not need specific answers. Im very confused by one aspect of my work.",
        "author": "reallynukeeverything",
        "url": "https://www.reddit.com/r/ECE/comments/11hfqvi/i_do_not_need_specific_answers_im_very_confused/",
        "text": "Intro: I am currently a 1st undergrad doing ECE currently working on AC Thevenin circuits.\n\nI have the equations from the lecure slides to figure out Inductance and Capacitance from Impedance.\n\nApparently, my answers are wrong according to one of my uni mates because I keep impedance in the equation instead of removing it which makes no sense as I can not find a reason to remove it.\n\nDoes Zt disappear when rearranging the equation?\n\nEquations in question:\n\nZt =  j * w * L\n\nAnd Zt = 1/jwC\n\nApparently to figure out L and C, during the rearranging of the eqn, Z is no longer present so the equations become:\n\nL = j * w\n\nAnd then Zt = 1/j * w\n\nW being 2nf\n\nThank you. Im utterly confused.",
        "created_utc": 1677879417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello. I need help with 2 equ",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677878915,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bjt Transconductance and small signal model explained visually",
        "author": "TheSiGuyEN",
        "url": "https://youtube.com/watch?v=Eb1GYdNmj0k&amp;feature=share",
        "text": "",
        "created_utc": 1677865194,
        "upvote_ratio": 1.0
    },
    {
        "title": "Designing intrinsically safe PCB",
        "author": "Bhangdu_Pigdu",
        "url": "https://www.reddit.com/r/ECE/comments/11h2bml/designing_intrinsically_safe_pcb/",
        "text": "I am new to PCB designing and I'm looking for  an example intrinsically safe PCB from which I can learn or take reference. Please share some sources with me.\n\nThank you so much",
        "created_utc": 1677854203,
        "upvote_ratio": 1.0
    },
    {
        "title": "Newsletter in Hardware Acceleration in Robotics #49",
        "author": "pablocarrera",
        "url": "https://www.reddit.com/r/ECE/comments/11gwd8r/newsletter_in_hardware_acceleration_in_robotics_49/",
        "text": "[https://news.accelerationrobotics.com/hardware-acceleration-in-robotics-49/](https://news.accelerationrobotics.com/hardware-acceleration-in-robotics-49/)  \nHardware acceleration in robotics news. ROS 2 HAWG - meeting #15, 600 for-profit companies using ROS and ROS 2, Acceleration Robotics is growing, January 2023 robotics investments total US $521 million, Biden’s chip war with China is an imperial struggle for high-tech supremacy",
        "created_utc": 1677835452,
        "upvote_ratio": 1.0
    },
    {
        "title": "ECE Medical Devices",
        "author": "superiorjock",
        "url": "https://www.reddit.com/r/ECE/comments/11gul6z/ece_medical_devices/",
        "text": "Hello, I’m currently majoring as an EE major and I’m considering going into my masters as an EE major specializing in medical devices and systems. If I was to go into this specific field in EE, what potential career opportunities are there for me? Like in EE, what should I be focusing on more if I’m pursuing medical devices? Is it optics, integrated circuits, etc just to name a few. What are the EE topics in this specific field of medical devices that I can work on? Secondly, what job titles should I be applying for since if I pursue a medical device masters, then I should definitely be going for a job that’s within a medical device company.",
        "created_utc": 1677828662,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feedback on LM386 - First Circuit",
        "author": "tobyz28",
        "url": "https://www.reddit.com/r/ECE/comments/11gtjs4/feedback_on_lm386_first_circuit/",
        "text": "Hello all just looking for some feedback on my first circuit using an LM386N. \n\nI have one Major question and fairly new at this so please correct me if I'm out to lunch on this:\n\nThe 470pF Cap appears to be shorted to ground. The comments for the article I used for this schematic mention it may be misplaced several times (with no definative answer/resolution). \n\nThe Authors reasoning:\n\n&gt; \"A 470 pF capacitor between the positive input signal and ground, which filters radio interference picked up by the audio input wires.\"\n\nShould C6 be removed from it's current location and placed between Pin 3 and Ground? Or am I misunderstanding it's purpose.\n\nThank you!\n\nhttps://preview.redd.it/ag8pcmtrwgla1.png?width=1051&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=41c20278a9ba9854115cf2f163b64baf47f147bd",
        "created_utc": 1677825017,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why am I taking Aerospace / Mechanical Courses",
        "author": "Odd_Intention_6859",
        "url": "https://www.reddit.com/r/ECE/comments/11gpstq/why_am_i_taking_aerospace_mechanical_courses/",
        "text": "I have been talking with my family and friends about how I think some of the required classes for my degree (EE junior) do not make much sense to me. I was hoping some of you could enlighten me on what I am missing. \n\n**Statics** \\- \" Studies the condition of equilibrium of rigid bodies under the action of forces. \"\n\n**Engineering Economy** \\- \" Economic comparisons of engineering alternatives considering the time value of money .\"\n\n**Chemistry**\n\n**Thermodynamics**\n\n**Engineering Innovation**\n\nTwo of these (chem &amp; thermo) I understand \"why\" but I feel like a lot of other courses could supplement these to better prime an EE student. I feel like it would make more sense to take quantum mechanics instead of statics. I read the ABET standards and it seems like some of these courses are not necessary for being an accredited degree. I would just like to know what some more experienced ECE individuals think of the courses! I have no mentors or friends that have been EE/CE to give an educated opinion.",
        "created_utc": 1677813677,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is the expected BER when using a rician fading channel and AWGN",
        "author": "ntrysii",
        "url": "https://www.reddit.com/r/ECE/comments/11g903r/what_is_the_expected_ber_when_using_a_rician/",
        "text": "Hi everyone, Hope you all doing well, I'm trying to simulate OFDM with 256-QAM, in awgn and rician channel using matlab.\n\nthe problem here is that when using AWGN alone, the BER falls into expected values when increasing \n\nthe Eb/N0, but when adding the riciain channel to the AWGN it doesn't change much unless (almost always = 0.5).\n\nis 0.5 BER is expected when having a fading channel ?",
        "created_utc": 1677779317,
        "upvote_ratio": 1.0
    },
    {
        "title": "600 for-profit companies using ROS and ROS 2",
        "author": "pablocarrera",
        "url": "https://www.reddit.com/r/ECE/comments/11g51z3/600_forprofit_companies_using_ros_and_ros_2/",
        "text": "[https://github.com/vmayoral/ros-robotics-companies](https://github.com/vmayoral/ros-robotics-companies)  \nA public list of companies that are known to use the Robot Operating System (ROS and ROS 2) or any of its related tools for development, to create products or to offer services. \n\nThere are also lists for companies known to use the ROS Navigation stack and ROS 2 Nav2 Framework and ROS Manipulation stack (MoveIt).",
        "created_utc": 1677769758,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fujitsu C Series Lifebook - Any pieces missing ? (More detail in comment)",
        "author": "Cyber_monkey7",
        "url": "https://www.reddit.com/gallery/11fzxtb",
        "text": "",
        "created_utc": 1677754666,
        "upvote_ratio": 1.0
    },
    {
        "title": "👉 35V-5A Adjustable Switching Power Supply",
        "author": "MyVanitar",
        "url": "https://www.reddit.com/r/ECE/comments/11fyvh4/35v5a_adjustable_switching_power_supply/",
        "text": " In this article/video, I introduce an adjustable 5A DC-to-DC converter circuit that uses an advanced chip,   made by Texas Instruments, which is TPS5450. It’s a high-frequency and efficient buck converter chip that provides tight voltage regulation. I   have followed several PCB design rules to ensure low noise, low EMI,  and high stability of the output voltage.\n\n***Please watch the video completely***, from the start to the end. I've disclosed the design, provided an article, and shared several PCB designing tricks with you😉\n\n\\\\I   designed this board using Altium Designer. The PCB has been Fabricated by PCBWay. if you have Altium, I can share the original PCB project with you using Altium 365.😊\n\n[https://www.youtube.com/watch?v=OzGibRvKLsE](https://www.youtube.com/watch?v=OzGibRvKLsE)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/jc44phnpsala1.jpg?width=2600&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=5937da4bf55d13ec1dd8988d719cf462ad5769c2",
        "created_utc": 1677750734,
        "upvote_ratio": 1.0
    },
    {
        "title": "Semiconductor internship question - can a testing/reliability internship help me get a product/chip design internship next year?",
        "author": "ChiralCenters",
        "url": "https://www.reddit.com/r/ECE/comments/11fyqs7/semiconductor_internship_question_can_a/",
        "text": "Sophomore ECE major here. I will be doing an internship at a semiconductor company this summer for a testing/reliability role, basically writing software tools for probe data testing. The internship description says that I will mainly be working with the reliability and process engineering teams, and it seems like a mostly software-heavy role despite being marketed to computer engineering majors.\n\nWhile I am certainly happy to gain any experience in the semiconductor industry, for future internships I would like to work at a role closer to the actual product design of chips. My question is, will the experience that I will get from this testing/reliability internship help meaningfully for acquiring product/chip design engineering internships next year, when I am a junior? I have no industry experience yet but it seems like the two internships have rather different job requirements.\n\nI understand that any experience, especially in the same sector, is better than no experience, but I guess I am a bit worried that I will be putting myself at a relative disadvantage for product design internships next year if I am simply content with nabbing this testing/reliability internship for this summer. Is this concern legitimate?\n\nThank you for your time!",
        "created_utc": 1677750261,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does ECE give you the knowledge to do electronics design as a hobby, and is it worth it over CS?",
        "author": "MrMrag",
        "url": "https://www.reddit.com/r/ECE/comments/11fulgr/does_ece_give_you_the_knowledge_to_do_electronics/",
        "text": "Hello everyone,\n\n&amp;#x200B;\n\nI'm sure I'm not the first person to ask this, but I wanted your input.\n\n&amp;#x200B;\n\nI'm in high school right now, but going to college next year.\n\nI was always thinking of going into Computer Science because I generally like automating things and building computer software + I want to work as a software engineer.\n\nWhat I really love doing, though, is tinkering with electronics, I played some with Raspberry Pi and such, and built a couple of projects purely by asking a lot on Reddit and copying parts of other projects, I knew nothing and still don't. \n\nI have some ideas for devices and robots I want to make. Right now, I'm trying to make a self-driving trash can, but I can't do so efficiently because I don't know what electronics can go together if one is 5V or 10V or something like that, straight up don't know how things work nor how to make the program for the robot. I only know python and java and don't know how to communicate with electronics/cameras. \n\nI want to learn how to do all this, but it's just a big hobby of mine.\n\n&amp;#x200B;\n\n**Would a computer engineering degree teach me how to do things like picking the right components for my projects and just with electronics prototyping and robotics?** Also, would it provide a good balance between just hardware/low level programming and more of the higher-level programming that is required to land a CS internship? Or would I be at a big disadvantage when stacking up against CS majors when looking for internships/jobs?",
        "created_utc": 1677736374,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the main differences between the hobbyist and the engineering approach to ECE design?",
        "author": "AggravatingBid7442",
        "url": "https://www.reddit.com/r/ECE/comments/11fts38/what_are_the_main_differences_between_the/",
        "text": "",
        "created_utc": 1677733919,
        "upvote_ratio": 1.0
    },
    {
        "title": "Circuit simulator Web API... Stupid idea? If it is, what other web APIs would be useful for ECE people?",
        "author": "GeorgeneKeck",
        "url": "https://www.reddit.com/r/ECE/comments/11fmzjd/circuit_simulator_web_api_stupid_idea_if_it_is/",
        "text": "Since I am having a lot of issues writing a lexer/parser for my circuit simulator and I have changed languages once already (from Rust to Nim) --- I was wondering, would a circuit simulator web API be useful to anyone in ECE?/ I'm not sre how, I just wanna make a simulator :( A web API will allow the engineer to use common HTTP endpoints + common data SerDe formats that such REST APIs accept. I wish this simulator to be for educational purposes only. It only supports transient and dc analysis. I suck at phasor algebra so no ac analysis &gt;\\_&lt;\n\nIf this is a stupid idea, then what other web apis are useful to you as an ECE?\n\nThanks.",
        "created_utc": 1677716110,
        "upvote_ratio": 1.0
    },
    {
        "title": "Buying a Luxury Home in Stirrup Key, Florida Keys, FL",
        "author": "madonnakaniswka",
        "url": "https://activerain.com/blogsview/5770636/buying-a-luxury-home-in-stirrup-key--florida-keys--fl?show_share=1",
        "text": "",
        "created_utc": 1677702552,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switching from Electrical engineering to Computer Engineering",
        "author": "Its_Ddeb",
        "url": "https://www.reddit.com/r/ECE/comments/11fg3pd/switching_from_electrical_engineering_to_computer/",
        "text": "I am writing a statement of purpose to apply for a master's in computer engineering. How can I leverage my background in electrical engineering with a specialization in power electronics to get into the computer engineering program specializing in VLSI or embedded systems? Does power electronics have any overlap/connection with these fields? I am seeking a way to utilize my strength and present a strong case for my admission.",
        "created_utc": 1677701155,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to self-learn ECE in a structured way?",
        "author": "poshan_",
        "url": "https://www.reddit.com/r/ECE/comments/11fcntf/how_to_selflearn_ece_in_a_structured_way/",
        "text": "I'm interested in learning electrical and computer engineering on my own, following the same structure as it is taught in universities since there is no such course available in my country. Although I have applied for computer science, I am passionate about circuitry and want to learn it independently. Is it possible to do so, and where should I start? I understand that lab work is a crucial component of the curriculum, but I think I can get access to some of the necessary equipment. I've searched on platforms such as Coursera and edX, but I haven't found anything that fits my needs. Can you suggest any resources or a structured approach to self-learning electrical and computer engineering?",
        "created_utc": 1677697231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Isolation in Voltage Measurement",
        "author": "tjdiaz98",
        "url": "https://www.reddit.com/r/ECE/comments/11f5o0u/isolation_in_voltage_measurement/",
        "text": "Hello!\n\nI wanted to use an IC (ACS37800 from Allegro) to measure current and voltage. I have this problem where in the datasheet it says that if this component where to be used in a system where the GND from the IC is isolated from the Neutral of the Input, two voltage dividers should be put. In the case where no isolation is required, only R1 and R2 are used. Why would this circuit keep the systems isolated if they are still electrically connected?\n\nhttps://preview.redd.it/jp6lsh4y45la1.png?width=565&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=b769138cdd5afbbe986b01a074e3496c1bd35241",
        "created_utc": 1677682195,
        "upvote_ratio": 1.0
    },
    {
        "title": "Analogue and digital signals: What do we measure?",
        "author": "kekimu",
        "url": "https://www.reddit.com/r/ECE/comments/11f5anf/analogue_and_digital_signals_what_do_we_measure/",
        "text": "I understand the differences between analogue and digital. I know that analogue signals are continuous and the voltage is proportional to some other kind of quantity (e.g. noise). \n\nWhat about other measurements aside voltage? If we had an analogue signal with time on the x-axis and voltage on the y-axis,  would we be interested in other things such as current and charge?\n\nFor digital signals, if we have a signal like [this:](https://www.google.com/url?sa=i&amp;url=https%3A%2F%2Fstudy.com%2Flearn%2Flesson%2Fanalog-vs-digital-devices-overview-differences-examples.html&amp;psig=AOvVaw2_8H7o_mhSUHSZTQmjidB-&amp;ust=1677767559528000&amp;source=images&amp;cd=vfe&amp;ved=0CA8QjRxqFwoTCPiMoq_5uv0CFQAAAAAdAAAAABAE)\n\nConsidering that there is only one voltage level, are we specifically interested in the time of signal arrival rather than the voltage itself?\n\nI don't have a great understanding of how electricity actually works which I need to work on.\n\nMany thanks",
        "created_utc": 1677681252,
        "upvote_ratio": 1.0
    },
    {
        "title": "The /r/ECE Monthly Jobs Post!",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/ECE/comments/11f36en/the_rece_monthly_jobs_post/",
        "text": "# Rules For Individuals\n\n* **Don't** create top-level comments - those are for employers.\n* Feel free to reply to top-level comments with **on-topic** questions.\n* Reply to the top-level comment that starts with **individuals looking for work**.\n\n# Rules For Employers\n\n* The position must be related to electrical and computer engineering. \n* You must be hiring **directly**. No third-party recruiters.\n* **One** top-level comment per employer. If you have multiple job openings, that's great, but please consolidate their descriptions or mention them in replies to your own top-level comment.\n* **Don't** use URL shorteners. [reddiquette](https://www.reddit.com/wiki/reddiquette) forbids them because they're opaque to the spam filter.\n* Templates are awesome. Please use the following template. As the \"formatting help\" says, use two asterisks to **bold text**. Use empty lines to separate sections.\n* **Proofread** your comment after posting it, and edit any formatting mistakes.\n\n# Template\n\n**(copy and paste this into your comment using \"Markdown Mode\", and it will format properly when you post!)**\n\n\\*\\*Company:\\*\\* \\[Company name; also, use the \"formatting help\" to make it a link to your company's website, or a specific careers page if you have one.\\]\n\n\\*\\*Type:\\*\\* \\[Full time, part time, internship, contract, etc.\\]\n\n\\*\\*Description:\\*\\* \\[What does your company do, and what are you hiring electrical/computer engineers for? How much experience are you looking for, and what seniority levels are you hiring for? The more details you provide, the better.\\]\n\n\\*\\*Location:\\*\\* \\[Where's your office - or if you're hiring at multiple offices, list them. If your workplace language isn't English, please specify it.\\]\n\n\\*\\*Remote:\\*\\* \\[Do you offer the option of working remotely? If so, do you require employees to live in certain areas or time zones?\\]\n\n\\*\\*Visa Sponsorship:\\*\\* \\[Does your company sponsor visas?\\]\n\n\\*\\*Technologies:\\*\\* \\[Give a little more detail about the technologies and tasks you work on day-to-day.\\]\n\n\\*\\*Contact:\\*\\* \\[How do you want to be contacted? Email, reddit PM, telepathy, gravitational waves?\\]",
        "created_utc": 1677675625,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much voltage is considered as normal/safe, which is measured between the body of the water pump and earth(in case of minor leakage happening)?(in 1 phase 240V motor)",
        "author": "studyhawk3_14",
        "url": "https://www.reddit.com/r/ECE/comments/11f135k/how_much_voltage_is_considered_as_normalsafe/",
        "text": "",
        "created_utc": 1677669123,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any device available, that can register and log leakage current, with data storage option?",
        "author": "studyhawk3_14",
        "url": "https://www.reddit.com/r/ECE/comments/11f12de/is_there_any_device_available_that_can_register/",
        "text": "",
        "created_utc": 1677669051,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any \"mid range\" alternatives to these cheap component testers? Maybe between $100-$2k?",
        "author": "SadSpecial8319",
        "url": "https://i.redd.it/o3k7togoc5la1.jpg",
        "text": "",
        "created_utc": 1677666846,
        "upvote_ratio": 0.94
    },
    {
        "title": "Check out this dope youtube video!",
        "author": "Effective-Tie-2847",
        "url": "https://www.reddit.com/r/ECE/comments/11etsck/check_out_this_dope_youtube_video/",
        "text": "[https://www.youtube.com/watch?v=-3\\_3zqe2LOA&amp;ab\\_channel=ElectronicsWorkshawp](https://www.youtube.com/watch?v=-3_3zqe2LOA&amp;ab_channel=ElectronicsWorkshawp)",
        "created_utc": 1677643742,
        "upvote_ratio": 0.14
    },
    {
        "title": "Degree choices for career in ECE and tech?",
        "author": "AquaticAnt",
        "url": "https://www.reddit.com/r/ECE/comments/11er6kw/degree_choices_for_career_in_ece_and_tech/",
        "text": "I’m deciding between an CS undergrad with hardware classes taken to then pursue a masters in Computer or Electrical Engineering , or pursuing an undergrad in EE with a masters in CS. Is there an clear advantage or disadvantage for either path?",
        "created_utc": 1677636434,
        "upvote_ratio": 0.91
    },
    {
        "title": "Ideas of thesis research title as an ece student",
        "author": "AdamAdamantite",
        "url": "https://www.reddit.com/r/ECE/comments/11e9cxr/ideas_of_thesis_research_title_as_an_ece_student/",
        "text": "We have some ideas for our proposal research titles but we are still looking for some ideas like a technology that needs some innovation. Please give us some of your ideas 😊",
        "created_utc": 1677595913,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just finished my electronic engineering master and I am conflicted about whether doing a second master in CS worth it?",
        "author": "beneaththeslope",
        "url": "https://www.reddit.com/r/ECE/comments/11e336o/i_just_finished_my_electronic_engineering_master/",
        "text": "",
        "created_utc": 1677581295,
        "upvote_ratio": 1.0
    },
    {
        "title": "OFDM modulation with 256-QAM using matlab produces a huge BER",
        "author": "ntrysii",
        "url": "https://www.reddit.com/r/ECE/comments/11e1xnr/ofdm_modulation_with_256qam_using_matlab_produces/",
        "text": "Hello everyone, Hope you all doing well. \n\nI have a project where I'm supposed to calculate the bit error rate while using OFDM modulation, I use matlab for the code but the BER is 0.3 and SNR 65 while having 200kbits I know it is supposed to be between 10\\^-6 and 10\\^-8, I tried adjusting the parameters but without any luck. \n\nhere is the code [https://pastebin.com/fuDxKFhD](https://pastebin.com/fuDxKFhD)\n\nthanks in advance.",
        "created_utc": 1677576906,
        "upvote_ratio": 1.0
    },
    {
        "title": "[College/Circuit Design] Completing a circuit for an eLC-3",
        "author": "Hour-Abroad2244",
        "url": "/r/HomeworkHelp/comments/11dvu7l/collegecircuit_design_completing_a_circuit_for_an/",
        "text": "",
        "created_utc": 1677558884,
        "upvote_ratio": 1.0
    },
    {
        "title": "CS undergraduate, should I do CE/EE in grad school?",
        "author": "Striking-Warning9533",
        "url": "https://www.reddit.com/r/ECE/comments/11duiat/cs_undergraduate_should_i_do_ceee_in_grad_school/",
        "text": "The reasons I want to move:\n- it's easier to get into a ECE program\n- There are way too much people doing CS and i think the job market will crash one day, also my ego kinda driven me that I want to be different\n- If I do ECE, I might able to be a real engineer and get the PEng title so I can do some real engineering work. I.e. there is another path for me\n\nWhat you guys think",
        "created_utc": 1677551677,
        "upvote_ratio": 1.0
    },
    {
        "title": "Candle Simulator Circuit PCB",
        "author": "TieGuy45",
        "url": "https://v.redd.it/5vsc2t6umvka1",
        "text": "",
        "created_utc": 1677549271,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to approach a three-phase power problem, Y to Y where the load is not balanced",
        "author": "Coolaj0303",
        "url": "https://www.reddit.com/r/ECE/comments/11drx3f/how_to_approach_a_threephase_power_problem_y_to_y/",
        "text": "I was confused about how to approach this problem and wondered if anyone could help. When I attempted to do it the first time, I made three loops equations and solved for the three currents, however, I got the wrong answer. I would usually use the single-phase method, where you split up the circuit into 3 single-phase equivalents, but I was pretty sure that cannot be done for unbalanced loads. By the way, this is from a circuits II course.",
        "created_utc": 1677544540,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a specific type of banana plug. Any help is appreciated.",
        "author": "eastenl",
        "url": "https://i.redd.it/qycpjeczzuka1.jpg",
        "text": "",
        "created_utc": 1677541440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electronics carrers",
        "author": "United_Dentist7846",
        "url": "https://www.reddit.com/r/ECE/comments/11doidj/electronics_carrers/",
        "text": "Hi, I'm portuguese, so excuse me my grammar and if this is not the right sub to make this post.\n\nBasically I'm studying Ece as most of you might be doind or already did, Im enjoyimg my class, but the ones that kept my eyes are circuit analysis and programming. \n\nBecause of circuit analysis and because electronics seems to be a real cool subject, I would like to try work as a Circuit Design Enginner.\n\nThe thing is that near where I live, there is only one companny with this job(Synopsys), the major jobs here are in software and I think thats because my country doesnt invest a lot in industry, only in turism.\n\nAs this being said, I know that working in embedded could be a good choise, but I would like to know what carrers are where I can design circuits. Is Analog Engineer the only way?\n\nHow hard is to find a job in this area in your country?\n\nThank you for your time, have a good week",
        "created_utc": 1677535889,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does 'issue' mean in the dual-issue processor?",
        "author": "PainterGuy1995",
        "url": "https://www.reddit.com/r/ECE/comments/11dn6p5/what_does_issue_mean_in_the_dualissue_processor/",
        "text": "Hi,\n\nI was reading a section in a textbook and it says that ARM A8 is a two-issue processor and Intel i7 is a four-issue processor which can do out-of-order execution.\n\nSince, I'm a beginner and have no clue of this \"issue\" thing. I googled it and found the following link which does try to summarize it in simple words, [https://stackoverflow.com/a/8015472/8910444](https://stackoverflow.com/a/8015472/8910444) .\n\nThe linked answer says, \"*Dual issue means that each clock cycle the processor can move two instructions from one stage of the pipeline to the next stage*\". \n\nA pipelined processor already has pipelined functional units, such as ALU, or multiple functional units, or both. \n\nQuestion: Would it be correct to say that a dual issue means that each clock cycle the processor can move two instructions from one stage, **same functional unit**, of the pipeline to the next stage? Otherwise, if it's not the same functional unit then calling it dual-issue doesn't make much sense, in my view, because even for a '*non-issue*' pipelined processor two instructions can always go through two separate functional units during the same clock cycle\n\nThanks for the help, in advance!",
        "created_utc": 1677532697,
        "upvote_ratio": 1.0
    },
    {
        "title": "Smith Chart with animation made by me",
        "author": "TheSiGuyEN",
        "url": "https://youtube.com/watch?v=J758TBuQGP8&amp;feature=share",
        "text": "",
        "created_utc": 1677532685,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my IoT device safe to leave running 24/7?",
        "author": "zealotben",
        "url": "https://www.reddit.com/gallery/11dl3df",
        "text": "",
        "created_utc": 1677527721,
        "upvote_ratio": 1.0
    },
    {
        "title": "I remembered something funny regarding electricity that you guys may as well...",
        "author": "GeorgeneKeck",
        "url": "https://www.reddit.com/r/ECE/comments/11dkaky/i_remembered_something_funny_regarding/",
        "text": "I was working on my circuit simulator the other day and reverently reading up material on electricity and electronics and conductivity and n and p-doping and sandwiching of semiconductors and I remembered this joke I heard on TV in my childhood that you may find funny. I don't know my sense of humor is that I find this hilarious.\n\nThere was this children's lark show when I was like 3 or 4, and there was this host whom IIRC was supposed to be some kind of engineer in his free time. Dis was my childhood, unlike other people who 'think' their childhood was during better times, my childhood was 'actually' during better times when almost nobody wanted to become a doctor or an engineer and everyone wanted to be an artist or a showman. Shit changed to 'everyone wants to be an engineer' to 'everyone wants to be a doctor' and trust me, if everyone in your country wants to be a doctor, your country is beyond hitting the wall of the close end of the alley. \n\nAnyways this person once brought a kid upstage, let's call him Jimbo, and asked him 'Jimbo, what would have happened if Thomas Edison did not invent the lightbulb?' and Jimbo lost his soul's virginity, he started spinning yards about how everything would be dark, not so much progress being made, no TV, no Nintendo or Atari, and so on and so forth. The dude turned to Jimbo and said 'The correct answer is \"someone else would have\"'.\n\nSometimes I wonder true innovation exists. It seems like an idea takes over several dozens of people at once, some act on it, some have the resources and the time to succeed, some who make it til the end and one who actually succeeds. The correct answer to  this question is nothing, the question is wrong, it should be 'How different the world would have been if a different person invented the lightbulb and paved the way for electricity infrastructure in urban areas'. I know there's some circlejerk to that regard so I'll shut up.\n\nI hope you enjoyed this tale.",
        "created_utc": 1677525761,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can we apply \"maximum power transfer theorem\" to PA &amp; LNA",
        "author": "Jasonbruz",
        "url": "https://www.reddit.com/r/ECE/comments/11dk94v/can_we_apply_maximum_power_transfer_theorem_to_pa/",
        "text": "Can we apply maximum power transfer theorem to power amplifier and low noise amplifier. Or they have some exceptions?\n\nI mean did we have by any chance, the maximum power transfer from PA to antenna when resistance of output amplifier \"included impedance match circuit\" not equal conjugate antenna resistance.?",
        "created_utc": 1677525661,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m completing my diploma for (college student) ECE, but my goal is to become a teacher. What is the fastest route? Some teachers have told me there is a motion that only takes one year. (Ontario, Toronto)",
        "author": "Sad_Advice9034",
        "url": "https://www.reddit.com/r/ECE/comments/11di9fu/im_completing_my_diploma_for_college_student_ece/",
        "text": "",
        "created_utc": 1677520937,
        "upvote_ratio": 1.0
    },
    {
        "title": "MIPS: Do you think this MIPS code fragment is correct representation?",
        "author": "PainterGuy1995",
        "url": "https://www.reddit.com/r/ECE/comments/11dgpah/mips_do_you_think_this_mips_code_fragment_is/",
        "text": "Hi,\n\nI was reading about the branch predictor and the code presented in the section shown below really confused me.\n\nIn the highlight, it says, \"*Here is the MIPS code that we would typically generate for this code fragment*\". I don't see how the \"if\" blocks code and the MIPS code are equivalent. Could you please help me with this?\n\nAlso, generally speaking, perhaps there is a type. I think DADDUI is the correct MIPS instruction. In the code below, they are writing DADDDIU.\n\n&amp;#x200B;\n\n![img](tmq5nvlvgrka1 \"Source: computer architecture a quantitative approach, 5th ed, Hennessy, pg 162\n  \")",
        "created_utc": 1677517152,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gameplan to become and expert in analog/RF IC",
        "author": "ImportantBlood4641",
        "url": "https://www.reddit.com/r/ECE/comments/11delkg/gameplan_to_become_and_expert_in_analogrf_ic/",
        "text": "Hi all,\n\nI am a third year PhD student working on analog/RFIC. I have access to Cadence and a variety of lab equipment.\n\nMy question is that, I want to become an expert in this field, as in a deep understanding of topologies, what affects them, what optimizes their noise, what optimizes their BW etc - not in a memorizing way, though, by being able to derive everything. In addition to a strong expertise in the theoretical aspects, as well as the nitty gritties of PCB design, EMI considerations etc.\n\nWhat would be a good gameplan for me to achieve this? I plan on allocating a few hours to this everyday as I don’t take any courses. For theory, I intend to read the Razavi books on Analog IC and RFIC. Read through all, solving examples and questions etc. Maybe his lecture videos on Youtube? How about the EMI, shielding type of more practical consideration things?\n\nPlease advice.\n\nBest.",
        "created_utc": 1677511855,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Realm of Confusion: Object Kinds in SystemVerilog",
        "author": "not_a_novel_account",
        "url": "https://blog.vito.nyc/posts/sv-types/",
        "text": "",
        "created_utc": 1677503165,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't like Computer Engineering and I'm very bad at it",
        "author": "Trooper_654",
        "url": "https://www.reddit.com/r/ECE/comments/11cyddm/i_dont_like_computer_engineering_and_im_very_bad/",
        "text": "I'm studying in a UC as a second year Computer Engineering Major and I realized how bad I am at Computer Engineering. I took my first Engineering course over the fall quarter (since I was trying to take CS but couldn't get into an intro course) and failed the course. I am close to getting dropped out of my major (I failed my last quarter as well, but for different reasons). Quite frankly, I just don't understand programming. It takes me twice as long to learn half the stuff other people in my class can. By the time I was grasping functions and strings, the class had gone to making simple games using graphics. I am more mathematically inclined, and quite good with calculus but I don't know what kind of jobs I can get with just math. I'm bad at applying it to other subjects, especially computer engineering. I am already behind on my college courses, especially after failing this course. I will only be able to take a computer engineering course next quarter. What other major options do I have, which would involve lots of Math and especially calculus? Or should I just continue with Computer Engineering and try to get good at it?",
        "created_utc": 1677459467,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the cost of the most expensive engineering project you’ve started? Did you have help funding it?",
        "author": "Leading-Fan-8904",
        "url": "https://www.reddit.com/r/ECE/comments/11cwlcf/what_was_the_cost_of_the_most_expensive/",
        "text": "Most engineers get their degree to work for other companies. \nHowever, some engineers come up with ideas for a personal project and they want to build it. If the engineer(s) isn’t working for someone who’s rich and willing to fund it, they have to figure out how to fund it themselves right? \n\nDepending on the scope and resources, funding it can be a challenge.\nIf that’s true, for those who’ve been in the same situation, I’d like to know the cost of your project and how it was funded. This could help me to get an idea of the different ways,(assuming there’s more than one way) to fund a personal project big or small.",
        "created_utc": 1677454791,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is an EE degree useful for non-EE careers?",
        "author": "MrC4meron",
        "url": "https://www.reddit.com/r/ECE/comments/11cvmli/is_an_ee_degree_useful_for_nonee_careers/",
        "text": "Weird question but basically I'm in 2nd year studying EE and finding the degree pretty interesting and doing fairly well at it.\n\nHowever, I'm exploring doing various other careers after I (hopefully) graduate such as in film and media industry, tech journalism, or starting a business.\n\nMy question is if it's still worth me continuing with the degree after this year if it's not necessarily what I want to do career wise? Or shall I stick with it, and hope it proves a handy qualification to have when looking for a job outside the industry?",
        "created_utc": 1677452465,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where do I find a silicon dummy-heater (WSCLP mosfet with temperature sensor)?",
        "author": "Emilie_Evens",
        "url": "https://www.reddit.com/r/ECE/comments/11coetr/where_do_i_find_a_silicon_dummyheater_wsclp/",
        "text": "Looking into building a dummy heater for thermal testing. Due to power density (50W/cm^2) I thought about using WCSP/bare die MOSFETs with an internal temperature sensor (junction temperature). The issue is I can't find those with integrated temperature sensors and all of them are tiny (3x1.5mm or smaller which is significantly smaller than the 5x5mm I am looking for).     \n     \nSo how do people actually build those high-power density dummy heater?",
        "created_utc": 1677435422,
        "upvote_ratio": 1.0
    },
    {
        "title": "MIPS: why is there \"#\" in front \"-8\" in DADDUI R1,R1,#-8",
        "author": "PainterGuy1995",
        "url": "https://www.reddit.com/r/ECE/comments/11cns83/mips_why_is_there_in_front_8_in_daddui_r1r18/",
        "text": "Hi,\n\nCould someone please let me know that in the MIPS code below, why there is \"#\" in front of \"-8\" for the instruction \"*DADDUI R1,R1,****#****-8*\"? Is it being used to denote a constant?\n\nI couldn't find any answer online other than that, perhaps, some assembler for MIPS use \"#\" to denote comments.\n\n    Loop: L.D F0,0(R1)    ;F0=array element\n    ADD.D F4,F0,F2    ;add scalar in F2\n    S.D F4,0(R1)     ;store result \n    DADDUI R1,R1,#-8      ;decrement pointer 8 bytes \n    BNE R1,R2,LOOP      ;branch R1!=R2",
        "created_utc": 1677433979,
        "upvote_ratio": 1.0
    },
    {
        "title": "Since GaAs has a wider bandgap than Si, shouldn't it take more energy to operate?",
        "author": "greenndreams",
        "url": "https://www.reddit.com/r/ECE/comments/11cjj75/since_gaas_has_a_wider_bandgap_than_si_shouldnt/",
        "text": "Just curious. I am aware that GaAs has a wider bandgap compared to Si, and also has a much faster electron mobility. But that got me thinking, if GaAs has a wider bandgap, wouldn't that make the device harder to run? Wouldn't it take more energy to have free charge in the first place?\n\nIt's especially confusing to me because I've recently heard that GaAs MESFETs apparently have an advantage over Si devices in that, their source/drain doping activations happen at a much *lower* temperature. If GaAs has a wider bandgap, shouldn't it take a higher annealing temperature to activate the source drain?",
        "created_utc": 1677424321,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to solve the error message in ltspice xvii could not open library file? the file extension is .sub",
        "author": "ysIrose",
        "url": "https://www.reddit.com/r/ECE/comments/11cis6m/how_to_solve_the_error_message_in_ltspice_xvii/",
        "text": "",
        "created_utc": 1677422331,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to refresh my physical verification knowledge?",
        "author": "delhorn",
        "url": "https://www.reddit.com/r/ECE/comments/11cif45/how_to_refresh_my_physical_verification_knowledge/",
        "text": "\nI got around 9 years of experience in physical design and I’ve done RTL2GDS just for the first 4 years of my career, physical verification was part of my job but only on IP level and not chip level. Now I’m working on cutting edge technologies for the previous 4.5 years on a complex designs but my job duties starts at RTL feedback through whole place &amp; route and ends at STA, no signoff physical verification.\nIf I’m planning to start interviews in multiple companies and I know that at least one interview will be just talking about DRCs checks and LVS.\n\nAny suggestions to how to revise the basics needed and how to prepare for that ? Specially for 9 years of experience the expectations are a bit high for such essential topic.\nThanks",
        "created_utc": 1677421448,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for good resources on circuits and electronics",
        "author": "ProgrammerMountain97",
        "url": "https://www.reddit.com/r/ECE/comments/11c90dg/looking_for_good_resources_on_circuits_and/",
        "text": "as the title suggests, I'm looking for good resources, preferably with good explanations, on circuits and electronics. I have recently found out that my foundations in circuits are a bit shaky, and there are huge gaps in my understanding of circuits and electronics, and I'm trying to fix that. If you know such resources, please share them!  \n\nalso as a side question, if you are given the chance to learn the topic from scratch, how would you approach it?",
        "created_utc": 1677399393,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for internship between my junior and senior year. How technical are the interviews?",
        "author": "naclownfiesta",
        "url": "https://www.reddit.com/r/ECE/comments/11c71g2/looking_for_internship_between_my_junior_and/",
        "text": "It seems like I'm getting a couple opportunities to interview. I have plenty of CS friends who tell me that their interviews general involve leetcode questions and other general coding questions. What is it like for EE internships? Is it just based on the position I applied to? Should I follow up and ask the recruiter what the interview will be like?",
        "created_utc": 1677391826,
        "upvote_ratio": 1.0
    },
    {
        "title": "what does it mean, \"memory protection exception caused by an instruction\"?",
        "author": "PainterGuy1995",
        "url": "https://www.reddit.com/r/ECE/comments/11c63cz/what_does_it_mean_memory_protection_exception/",
        "text": "Hi,\n\nI was reading about control dependences, the section is shown below, in the chapter about instruction parallelism.\n\n\\`**Question 1:**\\` In yellow highlight, it says, \"*Less obvious is the fact that if we ignore the control dependence and move the load instruction before the branch,* ***the load instruction may cause a memory protection exception.***\" What does it mean? Could you please help me? \n\nThe part in green highlight, \"*could not generate an exception (other than those from which the processor resumes the same process)*\", talks about this exception thing again.\n\n\\`**Question 2:**\\` **If the branch is taken, the DSUBU instruction will execute** and will be useless, but it will not affect the program results. \n\nIn Case 1, if branch is taken, DSUBU will not execute. In Case 2, DSUBU will execute regardless of if the branch is taken or not.\n\nSo, what are they saying? Could you please help me?\n\n  \n    \n **Case 1:**\n\n[Case 1: as shown in the text](https://preview.redd.it/plt4oj74ugka1.png?width=305&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=141c279e99fbcc43c5e871337950ea57d798f53b)\n\n&amp;#x200B;\n\n**Case 2:**\n\n*Processing img vgz0cj6nugka1...*\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n  \n  \n\n[Source:  computer architecture a quantitative approach, 5th ed, Hennessy, Patterson, pg 154-156](https://preview.redd.it/zl50hh30sgka1.png?width=702&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=d49e9341efd1d0c8f611b4c2e04076c25c1d9f22)",
        "created_utc": 1677388441,
        "upvote_ratio": 1.0
    },
    {
        "title": "meaning of \"load word at address 128 offset from register 3\"?",
        "author": "PainterGuy1995",
        "url": "https://www.reddit.com/r/ECE/comments/11c18xl/meaning_of_load_word_at_address_128_offset_from/",
        "text": "Hi,\n\nCould you please help me understand what the highlighted part means, \"*load word at address 128 offset from register 3 into register 2*\"?\n\nWhat is that offset thing in the given context?\n\nThanks for your time!\n\n  \n  \n\n[Source: Computer Organization and Architecture, 10th ed, pg. 560, William Stallings ](https://preview.redd.it/fmmstvtzlfka1.png?width=876&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=24f11d97f0c5aa3ffa4b8ae18dbee1832e4c052f)",
        "created_utc": 1677373373,
        "upvote_ratio": 1.0
    },
    {
        "title": "Smoke sensor not working properly",
        "author": "theeeesat4321",
        "url": "https://www.reddit.com/r/ECE/comments/11bw537/smoke_sensor_not_working_properly/",
        "text": "I'm trying to build this smoke detector circuit on a breadboard ([https://www.electronicshub.org/smoke-detector-circuit/#comment-2485458](https://www.electronicshub.org/smoke-detector-circuit/#comment-2485458)). I preheated the MQ2 sensor by connecting one of the H terminals to V+ and the other H terminal to ground for about 5 minutes. However, when I was building the entire circuit, for some reason the power supply to the LED goes out when I provide V+ to one of the H pins. When I remove the supply to one of the H pins, the LEDs are on. I'm not sure why this is happening. I can post pictures if that would be helpful. Thanks in advance!",
        "created_utc": 1677360181,
        "upvote_ratio": 1.0
    },
    {
        "title": "Contract ending in April, applying now, best to say that on resume",
        "author": "bookposting5",
        "url": "https://www.reddit.com/r/ECE/comments/11bgmic/contract_ending_in_april_applying_now_best_to_say/",
        "text": "My current employment contract is ending in April (yeah tech redundancies).\n\nFor the line on my CV with my current job, is it best to put the dates as \"Feb 2020 - April 2023\" or \"Feb 2020 - present\" ?\n\nBoth are true, and of course in an interview I would say that the contract is ending etc, just wondering if one makes a hiring manager looking at my resume more or less likely to offer me an interview than the other.",
        "created_utc": 1677316101,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career pathways",
        "author": "Andissace",
        "url": "https://www.reddit.com/r/ECE/comments/11bcqlx/career_pathways/",
        "text": "Hi all! I think I found the correct subreddit for a couple of questions I have. \n\nI always wondered what I'm gonna do when I grow up as a child because I didn't play with usual toys, but I played with random electric junk that my grandpa always got for me. This started from around when I was 5 and it continued until I was about 15, where I learned about computers/IT.\n\nComputers are great and I absolutely love them. Im currently studying JavaScript programming in my school, but deep down in my heart I always have loved \"physical\" stuff I can modify and create, and not digital. \n\nAnd I am now wondering, If I love tinkering with hardware stuff (primarily wanna create new cool stuff) what career path should I orientate myself into? Thanks!",
        "created_utc": 1677301913,
        "upvote_ratio": 1.0
    },
    {
        "title": "Check out this cool RGB LED dot matrix display working as a YouTube Subscriber Counter with added functionality controlled by an ESP32",
        "author": "Morten_Nibe",
        "url": "https://youtu.be/qf96raURVvs",
        "text": "",
        "created_utc": 1677290077,
        "upvote_ratio": 1.0
    },
    {
        "title": "How should I prepare for a Serdes interview?",
        "author": "MotherQuocer",
        "url": "https://www.reddit.com/r/ECE/comments/11b30jk/how_should_i_prepare_for_a_serdes_interview/",
        "text": "I’ve done design interviews for PMICs, but never Serdes and I’m not sure what to study. Is analog design for Serdes similar to RFIC? Should I expect to be asked about DSP concepts?",
        "created_utc": 1677275052,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone who works for or has interviewed with Anduril in Irvine/Costa Mesa, whatsoever the interview process like?",
        "author": "BrokeEngineerGuy",
        "url": "https://www.reddit.com/r/ECE/comments/11aw07f/anyone_who_works_for_or_has_interviewed_with/",
        "text": "Glassdoor has a few but trying to get more insight i guess.",
        "created_utc": 1677257557,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suggestion for thesis",
        "author": "Ok_Classic7695",
        "url": "https://www.reddit.com/r/ECE/comments/11atmo9/suggestion_for_thesis/",
        "text": "Hey guys, kinda struggling in looking for a thesis study to conduct. Do you guys have any suggestions for a good thesis to conduct focusing on agriculture?",
        "created_utc": 1677251436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know what this symbol is on Georg Ohm's grave stone?",
        "author": "DraculaJr2002",
        "url": "https://www.reddit.com/gallery/11at58b",
        "text": "",
        "created_utc": 1677250158,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm struggling to understand why current doesn't flow through the anmeter",
        "author": "TJ736",
        "url": "https://i.redd.it/8q8aj95yb5ka1.png",
        "text": "",
        "created_utc": 1677248742,
        "upvote_ratio": 1.0
    },
    {
        "title": "Understanding the Different Types of Sensors in IoT",
        "author": "biggelectronics",
        "url": "https://www.reddit.com/r/ECE/comments/11aqkxb/understanding_the_different_types_of_sensors_in/",
        "text": " Hey everyone,\n\nAs the Internet of Things (IoT) continues to grow, the demand for smart sensors has increased. These sensors are the foundation of IoT as they collect data from the surrounding environment, allowing devices to make informed decisions based on that data. However, with so many different types of sensors available, it can be difficult to understand which one to choose for a specific application. In this post, we'll be discussing some of the most commonly used sensors in IoT and their applications.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5q9vpx2cu4ka1.png?width=1920&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=8cfc47b9558c6786b450fd0153368a6a25dabd2b\n\n \n\nTemperature sensors: As the name suggests, these sensors measure the temperature of the surrounding environment. They are commonly used in smart homes, offices, and industries to control temperature and ensure the optimal environment for equipment and people.\n\nPressure sensors: Pressure sensors measure the pressure of a gas or liquid. They are widely used in the oil and gas industry to monitor and control pipelines, as well as in the automotive industry to measure tire pressure.\n\nHumidity sensors: These sensors measure the amount of moisture in the air. They are commonly used in agricultural applications to monitor the humidity of soil, as well as in homes to prevent the growth of mold and mildew.\n\nProximity sensors: Proximity sensors detect the presence of nearby objects without physical contact. They are commonly used in smart lighting systems, security systems, and automatic doors.\n\nAccelerometers: Accelerometers measure acceleration and motion. They are commonly used in wearable devices, smartphones, and other mobile devices to detect movement and orientation.\n\nLight sensors: Light sensors measure the amount of light in the surrounding environment. They are commonly used in smart lighting systems, security systems, and in outdoor applications such as streetlights.\n\nThese are just a few examples of the many [types of sensors available in IoT](https://robocraze.com/blogs/post/types-of-sensors-in-iot). It's important to choose the right sensor for your application to ensure the best possible results. What other types of sensors have you used in your IoT projects? Let's discuss in the comments below!",
        "created_utc": 1677242792,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Simple Guide to Choosing the Right Arduino Board for Your Project",
        "author": "biggelectronics",
        "url": "https://www.reddit.com/r/ECE/comments/11aq3s7/a_simple_guide_to_choosing_the_right_arduino/",
        "text": " Are you new to Arduino and wondering which board to choose for your project? With so many different options available, it can be overwhelming to decide which one is right for you. In this post, we'll go over some of the most popular Arduino boards and help you determine which one is the best fit for your needs. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/n8l3on2np4ka1.png?width=1920&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=e96f42a3d4c527f5ab16103534fa2707cccb7385\n\n \n\nArduino Uno: The Uno is the most popular and widely used Arduino board. It has 14 digital input/output pins, 6 analog inputs, and is compatible with a variety of shields, making it a great choice for beginners.\n\nArduino Nano: The Nano is a smaller version of the Uno, with similar capabilities. It is popular for projects where space is limited, such as wearables or small robots.\n\nArduino Mega: The Mega has more digital and analog pins than the Uno, making it a good choice for larger projects. It is also compatible with a wider range of shields.\n\nArduino Due: The Due is the most powerful Arduino board, with a 32-bit ARM processor and more memory than the other boards. It is a good choice for projects that require more processing power, such as 3D printers or advanced robotics.\n\nArduino Pro Mini: The Pro Mini is a smaller version of the Uno, but without a USB connection. It is often used for projects where size and power consumption are critical, such as in remote sensing applications.\n\nWhen [choosing an Arduino board](https://robocraze.com/blogs/post/which-arduino-board-to-buy), consider the following factors:\n\nNumber of digital and analog pins needed for your project\n\nCompatibility with shields or other components\n\nProcessing power required\n\nSize and power consumption limitations\n\nRemember, there is no one \"right\" Arduino board for every project. It's important to choose the one that best fits your specific needs",
        "created_utc": 1677241220,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Quick and Simple guide to Relay",
        "author": "biggelectronics",
        "url": "https://www.reddit.com/r/ECE/comments/11ap6j1/a_quick_and_simple_guide_to_relay/",
        "text": "Hey everyone,\n\nHave you ever wondered how your electronic devices communicate with each other and perform various functions seamlessly? Well, it's all thanks to relays – the unsung heroes of modern technology.\n\nRelays are electromechanical devices that act as switches and control the flow of electricity in a circuit. They are used in various applications such as telecommunication, automotive, aerospace, and industrial control systems. Without relays, the complex machinery that we use every day would not be able to function properly.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5wejernsf4ka1.png?width=1920&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=ff37616e07a04558c30c40191dcb982cde2604bf\n\nOne of the significant advantages of relays is their ability to switch high voltages and currents with a low power signal. They can also isolate the control circuit from the load circuit, ensuring that the control circuit remains safe from high voltages and currents.\n\n&amp;#x200B;\n\n[Relays](https://robocraze.com/blogs/post/what-is-relay-working-applications-types) come in different types, including electromechanical, solid-state, and reed relays. Each type has its own set of advantages and disadvantages, depending on the specific application requirements.\n\nIn summary, relays are crucial components in modern technology, and without them, many of the devices we rely on daily would not work as intended. So next time you use your phone, drive your car or turn on your home appliances, remember to thank the unsung heroes – the relays.\n\nDo you have any experience working with [relays](https://robocraze.com/blogs/post/what-is-relay-working-applications-types), or have any questions about their functions and applications? Let's discuss in the comments below!",
        "created_utc": 1677238011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Newsletter in Hardware Acceleration in Robotics #48",
        "author": "pablocarrera",
        "url": "https://www.reddit.com/r/ECE/comments/11an74u/newsletter_in_hardware_acceleration_in_robotics_48/",
        "text": "[https://news.accelerationrobotics.com/hardware-acceleration-in-robotics-48/](https://news.accelerationrobotics.com/hardware-acceleration-in-robotics-48/)  \nHardware acceleration in robotics news. RobotPerf, benchmarking interest for robots grows, PRESS RELEASE: Acceleration Robotics announces the 1st meeting of the Architectures and Processors Working Group (GTAP) of the AESEMI, How ChatGPT can control robots",
        "created_utc": 1677230318,
        "upvote_ratio": 1.0
    },
    {
        "title": "When reading the netlist, how do we know a component is Y or Z? i..e. what is the best approach for reading a netlist as fast as possible?",
        "author": "GeorgeneKeck",
        "url": "https://www.reddit.com/r/ECE/comments/11alhnn/when_reading_the_netlist_how_do_we_know_a/",
        "text": "So let's say we have netlist like this, ignore the syntax it's just meant to be demonstrative:\n\n    0\n    .independent voltage source\n    1\n    .resistor 22k\n    2\n    .current controlled voltage source\n    3\n    .resistor 20M\n    probe\n    \n\nResistor 22k here is clearly Z, or in impedance form, as its current is controlling the voltage of CCVS.   And the 20M resistor is in Y mode because it's admitting the current from IVS and CCVS through without affecting anyone.\n\nIf I am right so far read the rest. If not please tell me why I'm wrong.\n\nSo in case I'm right. With Modified Nodal Analysis we have two sets of stamps for most elements except maybe independent voltage sources which are always in  impedance mode.  One of these stamps is for Y, or group 1, and one of these stamps is for Z, or group 2.\n\nAm I right so far?\n\nOk so, my questions is, how do I determine if a resistor is in Z form, and needs to have the current in RHS of the equation system? Every book or lecture note I read keeps saying 'assemble the system as you keep reading the netlist'. But if I have not read the netlist fully how would I know it's in Z mode and not Y?\n\nI can roll out my own syntax for the netlist, which I intend to do because I wanna be bold and different and all that crap --- a syntax that allows for Z elements to be identified on-the-fly. But is there a better approach that I am unaware of?\n\nI apologize in advance if this is a very obvious question. I have searched Google a lot about this and I have read 3 books, Najm's, Odrogzki's and Pillage et al's. None talk about the parsing aspect of simulators in detail and that is where I am stuck the most.\n\n&amp;#x200B;\n\nThanks.",
        "created_utc": 1677223617,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the limits to a computer's serial COM port?",
        "author": "McMep",
        "url": "https://www.reddit.com/r/ECE/comments/11aktmf/what_are_the_limits_to_a_computers_serial_com_port/",
        "text": "I have been testing serial port speeds with a Nucleo 64 STM32F411RE that easily supports 6 Mbaud, however whenever I try and go above 2 Mbaud on talking to my computer it stops working. I'm using it for a project, and to not be bottlenecked by the USART communication it needs to be around 3 Mbaud. \n\nI can't find information on the serial port limits due to the chipset on my computer, but I am pretty sure its a software bottleneck. I've tried testing using different terminal applications (PuTTY, Teraterm, Platform IO serial monitor, and Arduino serial monitor) and with different computers and they all end up with the same limit. \n\nUltimately, I plan on using a serial library to talk to the port myself because I need to intercept what is typed into the terminal and build a packet out of it, but even then I don't know if the bottleneck will still be present and if the serial library even supports up to those speeds. I am familiar with [wjwwood serial](https://github.com/wjwwood/serial) but can't find any information in its limits. I see a few commits for 500 kbps support but I don't know if that's its limit. \n\nAny advice would be helpful",
        "created_utc": 1677221082,
        "upvote_ratio": 1.0
    },
    {
        "title": "Practical MOSFET question",
        "author": "olliethecat8",
        "url": "https://www.reddit.com/r/ECE/comments/11acm52/practical_mosfet_question/",
        "text": "Q: What is a normally-on MOSFET configuration for turning off source voltage in the presence of another?\n\nI.e.\nI have two plugs on my board, one of which will take in +12 V, the other +5 V. They are both wired to the same load. If the +12 V is present, I want to prevent connection/driving by the +5 V, i.e. disconnect it.\n\nTheoretical solution: I could theoretically use a p-channel depletion-mode MOSFET (if they exist, which (it seems they don't), by connecting the MOSFET between the +5 V and the load, with the +12 V on the gate.\n\nIs there a better (i.e. physically available) solution to this problem? Tangential solutions welcome!",
        "created_utc": 1677195994,
        "upvote_ratio": 1.0
    },
    {
        "title": "Easiest way to send data from an automated small scale railway gate to an app?",
        "author": "urmommyre",
        "url": "https://www.reddit.com/r/ECE/comments/119x8g4/easiest_way_to_send_data_from_an_automated_small/",
        "text": "We're building an automated railway gate for our university project. And we plan to transmit data on whether the gate is closed or not onto an app that we will develop. What is the easiest way to transmit this data from the motor to the app?",
        "created_utc": 1677157522,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm nervous about starting my new job....",
        "author": "OhanaUchiha",
        "url": "https://www.reddit.com/r/ECE/comments/119vkv3/im_nervous_about_starting_my_new_job/",
        "text": "Alright, I posted on here before about being nervous about the interview, and then posted again saying thanks for the advice and that I got the job, but now I am actually pretty nervous about starting the actual job. \n\nThe role is: *Electronics Service Technician* for a pretty well known hospital. During the interview, they asked some very generic technical questions such as \"What is a diode\", \"Describe Ohm's Law\", \"Explain the difference between resistors and series\", \"what is the difference between static and dynamic IP\". \n\nI answered those pretty well, and I have had a decent amount of experience testing / building circuits when I went to technical college. However, the last time I took any related classes was about two years now, in which I haven't even touched a DMM or an oscilloscope during those times either. Am I fucked or am I overthinking it? I'm going to call the guy who hired me on today to see what I can refresh on and what more in detail to expect, otherwise I'm truly nervous that I will gravely underperform.\n\nHe did make the job sound somewhat easy though. He said I test fire alarms monthly, which is essentially connecting a device to it and make sure it works, and I would be doing similar tests to intercoms, video cameras, etc..\n\nWhat would you guys suggest me to touch up on?",
        "created_utc": 1677152144,
        "upvote_ratio": 1.0
    },
    {
        "title": "SPDT switch for 48VDC, 25A",
        "author": "theadrium",
        "url": "https://www.reddit.com/r/ECE/comments/119t8rq/spdt_switch_for_48vdc_25a/",
        "text": "Hi,\n\nI'm having trouble finding a switch with the specs that I want. I have two sets of 48VDC batteries and a single charger, and I want to be able to use a switch to connect the charger to either set of batteries.   \nMy thought is to use a SPDT switch to direct the red wire of the charger as needed, and have the black wires share a common ground connection to the charger.\n\nThe charger claims to output 48VDC (though I imagine it is probably a bit higher since it is charging 48V batteries..?) at a 25A max current.\n\nI am finding a lot of switches for 15A/250VAC, 20A/125VAC but not seeing any that obviously match what I'm after. I'd appreciate some direction. Thanks.",
        "created_utc": 1677143256,
        "upvote_ratio": 1.0
    },
    {
        "title": "energy saved while executing the program at double speed",
        "author": "PainterGuy1995",
        "url": "https://www.reddit.com/r/ECE/comments/119puih/energy_saved_while_executing_the_program_at/",
        "text": "Hi,\n\nI was trying to understand *Part A* of the following problem. The purported solution is also provided at the bottom. \n\nI don't know how they are doing the solution to get 50%. Part B makes sense.\n\nCould you please help me?\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Source:  Computer Architecture: A Quantitative Approach 5th Edition, By John Hennessey &amp; David Patterson ](https://preview.redd.it/vgnel4ttkvja1.png?width=596&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=523c8537865fd1e070df897f83762854e746e603)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[purported solution to Part A of the problem above](https://preview.redd.it/qbtrr6nhlvja1.png?width=603&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=2f8e71c12f3e7a28ab23a011dbc0187c724fb399)",
        "created_utc": 1677131017,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good calculator for working with phasor",
        "author": "Tfloow",
        "url": "https://www.reddit.com/r/ECE/comments/119anfq/good_calculator_for_working_with_phasor/",
        "text": "Hello, \n\nToday in my electricity class, the teacher highly recommended getting a new calculator to help with the phasor exercises. I've been using that greenish fx-92B for 8 years now and I'm searching for the best entry-level price calculator to work with imaginary numbers.\n\nHave you guys any good suggestions for a convenient calculator that can handle imaginary numbers ?\n\nThank you for your time",
        "created_utc": 1677096481,
        "upvote_ratio": 1.0
    },
    {
        "title": "Texas Instruments - after interview",
        "author": "DecentWar3679",
        "url": "https://www.reddit.com/r/ECE/comments/119ajqn/texas_instruments_after_interview/",
        "text": "Anyone here who had an interview TI, how long did it take them to get back with you? I have an interview with them two weeks ago for an internship and my interviewer said HR should contact me within a week with either a yes or no, and I still haven’t heard back from them. I wanted to know how it usually is from others who had an interview with them.",
        "created_utc": 1677096339,
        "upvote_ratio": 1.0
    },
    {
        "title": "Implementing D-PPM on STM32",
        "author": "McMep",
        "url": "https://www.reddit.com/r/ECE/comments/1195mgk/implementing_dppm_on_stm32/",
        "text": "I am trying to implement a D-PPM scheme using arbitrary waveform generation much like what found in this [general purpose timer cookbook section 5](https://www.st.com/resource/en/application_note/an4776-generalpurpose-timer-cookbook-for-stm32-microcontrollers-stmicroelectronics.pdf) and having no luck. I am finding that the guide is a little outdated and not exactly a match for the LL libraries, but I tried my best to translate the configs over using some [other resources](https://community.st.com/s/question/0D53W00000joQSvSAM/tim-dma-burst-works-in-incorrect-sequence)\n\nI am using the Nucleo 64 STM32F411RE board with the following code using the arduino framework in PlatformIO on VSCode. I've tried using the STM32CubeIDE to configure everything and have it output HAL code, but I am somewhat new to the STM32 platform and don't know how to add the src buffer and expand on the code to meet my end goal. I've gone through multiple \"iterations\" of trying to get it to work. Apologies in advance for code formatting, it my first time posting code. Any advice would be greatly appreciated. \n\n    #include &lt;Arduino.h&gt;\n    #include &lt;HardwareSerial.h&gt;\n    #include &lt;HardwareTimer.h&gt;\n    #include &lt;stm32f4xx.h&gt;\n    #include &lt;stm32f411xe.h&gt;\n    \n    #include &lt;stm32f4xx_ll_utils.h&gt;\n    #include &lt;stm32f4xx_ll_tim.h&gt;\n    #include &lt;stm32f4xx_ll_dma.h&gt;\n    #include &lt;stm32f4xx_ll_gpio.h&gt;\n    #include &lt;stm32f4xx_ll_bus.h&gt;\n    #include &lt;stm32f4xx_ll_rcc.h&gt;\n    #include &lt;stm32f4xx_ll_system.h&gt;\n    \n    const unsigned long BAUD = 2'000'000;\n    HardwareSerial Serial1(USART2);\n    uint32_t src_buffer[9] = {4000,1,800, 10000,0,8500, 4000,2,200};\n    \n    void setup()\n    {\n        //PLL output frequency = (((HSI frequency / PLLM) * PLLN) / PLLP)\n        LL_UTILS_PLLInitTypeDef *PLL_init_struct = {0};\n        PLL_init_struct-&gt;PLLM = LL_RCC_PLLM_DIV_8;\n        PLL_init_struct-&gt;PLLN = 64U;\n        PLL_init_struct-&gt;PLLP = LL_RCC_PLLP_DIV_2;\n    \n        LL_UTILS_ClkInitTypeDef *clk_init_struct = {0};\n        clk_init_struct-&gt;AHBCLKDivider = 1U;\n        clk_init_struct-&gt;APB1CLKDivider = 2U;\n        clk_init_struct-&gt;APB2CLKDivider = 1U;\n    \n        LL_PLL_ConfigSystemClock_HSI(PLL_init_struct, clk_init_struct);\n    \n        Serial1.begin(BAUD);\n        while(!Serial1){}\n        LL_mDelay(500);\n        Serial1.print(\"System Clock: \"); \n        Serial1.print(SystemCoreClock);\n        Serial1.print(\" MHz\\n\");\n        LL_mDelay(500);\n    \n        LL_AHB1_GRP1_EnableClock(RCC_AHB1ENR_DMA2EN);\n        LL_DMA_ConfigTransfer(DMA2, LL_DMA_STREAM_1,DMA_MEMORY_TO_PERIPH |\n                                                    DMA_PINC_DISABLE | DMA_MINC_ENABLE |\n                                             DMA_PDATAALIGN_WORD | DMA_MDATAALIGN_WORD |\n                                                    DMA_CIRCULAR | DMA_PRIORITY_HIGH);\n        LL_DMA_ConfigAddresses(DMA2, LL_DMA_STREAM_1, (uint32_t) src_buffer, \n                                                      (uint32_t) TIM1-&gt;DMAR, \n                                                     LL_DMA_DIRECTION_MEMORY_TO_PERIPH);\n        LL_DMA_SetDataLength(DMA2, LL_DMA_STREAM_1,\n                             sizeof(src_buffer)/sizeof(uint32_t));\n        LL_DMA_EnableIT_TC(DMA2, LL_DMA_STREAM_1);\n        LL_DMA_EnableStream(DMA2, LL_DMA_STREAM_1);\n    \n        LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM1);\n        uint16_t timer_prescalar = (uint16_t) (SystemCoreClock / 32000000) - 1;\n        TIM1-&gt;ARR = 0xFFFF;\n        TIM1-&gt;PSC = timer_prescalar;\n        TIM1-&gt;CCR1 = 0xFFF;\n    \n        TIM1-&gt;CR1 &amp;= ~TIM_CR1_CKD;\n        TIM1-&gt;CR1 |= TIM_CLOCKDIVISION_DIV1;\n    \n        TIM1-&gt;CR1 &amp;= ~(TIM_CR1_DIR | TIM_CR1_CMS);\n        TIM1-&gt;CR1 |= TIM_COUNTERMODE_UP;\n    \n        TIM1-&gt;CCMR1 &amp;= ~TIM_CCMR1_OC1M;\n        TIM1-&gt;CCMR1 &amp;= ~TIM_CCMR1_CC1S;\n        TIM1-&gt;CCMR1 |= TIM_OCMODE_PWM1;\n        TIM1-&gt;CCMR1 |= TIM_CCMR1_OC1PE;\n    \n        TIM1-&gt;CR1 |= TIM_CR1_ARPE;\n        TIM1-&gt;DIER |= TIM_DMA_UPDATE; \n    \n        TIM1-&gt;DCR &amp;= ~TIM_DCR_DBA;  \n        TIM1-&gt;DCR &amp;= ~TIM_DCR_DBL;\n        TIM1-&gt;DCR = TIM_DMABase_ARR | TIM_DMABurstLength_3Transfers;\n    \n        LL_TIM_EnableDMAReq_UPDATE(TIM1);\n        LL_TIM_EnableIT_UPDATE(TIM1);\n    \n        NVIC_SetPriority(DMA2_Stream1_IRQn,    \n                     NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));\n        NVIC_EnableIRQ(DMA2_Stream1_IRQn);\n    \n        TIM1-&gt;EGR |= TIM_EGR_UG;\n        while((TIM1-&gt;EGR &amp; TIM_EGR_UG) == SET){}\n        TIM1-&gt;EGR |= TIM_EGR_UG;\n        TIM1-&gt;BDTR |= TIM_BDTR_MOE;\n        TIM1-&gt;CCER |= TIM_CCER_CC1E;\n        TIM1-&gt;CR1 |= TIM_CR1_CEN;\n    \n    \n        LL_GPIO_SetPinMode(GPIOA, LL_GPIO_PIN_8, LL_GPIO_MODE_ALTERNATE);\n        LL_GPIO_SetPinOutputType(GPIOA, LL_GPIO_PIN_8, LL_GPIO_OUTPUT_PUSHPULL);\n        LL_GPIO_SetPinSpeed(GPIOA, LL_GPIO_PIN_8, LL_GPIO_SPEED_FREQ_HIGH);\n        LL_GPIO_SetPinPull(GPIOA, LL_GPIO_PIN_8, LL_GPIO_PULL_UP);\n        LL_GPIO_SetAFPin_8_15(GPIOA, LL_GPIO_PIN_8, LL_GPIO_AF_6);\n    }\n    \n    void loop()\n    {\n    \n    }",
        "created_utc": 1677086912,
        "upvote_ratio": 1.0
    },
    {
        "title": "ECE PUP Graduates",
        "author": "Gior-no",
        "url": "https://www.reddit.com/r/ECE/comments/118yar6/ece_pup_graduates/",
        "text": "Is there anyone here a graduate of ECE in PUP? I am in need of your help since I have a requirement to interview ECE graduates. Please approach me if you are, it would be a really big help THANKYOUU",
        "created_utc": 1677071679,
        "upvote_ratio": 1.0
    },
    {
        "title": "What note taking software do you use?",
        "author": "agoss123b",
        "url": "https://www.reddit.com/r/ECE/comments/118gcqn/what_note_taking_software_do_you_use/",
        "text": "I've been using just libreoffice writer, but I'm having an issue on linux where it won't save all my notes.  I switched over to Joplin for the time being, but I'm curious what everyone uses? Preferably FOSS.  I'm wondering if there's an option that meshes better with code, symbols, hex, etc.  Any suggestions?",
        "created_utc": 1677016731,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible for a systems programmer who does not have a degree in electronics to find a sidegig in the field as a paid embedded programmer or circuit designer?",
        "author": "GeorgeneKeck",
        "url": "https://www.reddit.com/r/ECE/comments/1186ql4/is_it_possible_for_a_systems_programmer_who_does/",
        "text": "I am trying to write a circuit simulator and I'm about to return to it today. But I doubt that will give people the confidence that I know how stuff works. Being good at KVL and KCL does not make you master of circuitry. If you were once in my shoes please tell me what you did to make people hire you. I don't  exactly wish to design nuclear bomb timers mind you, just basic tatty stuff. I only studied CS for 3 semesters before I dropped out due to being extremely bipolar and not the transistor kind I just freaked out. Someone on this sub even told me to take Depakote, which I take, and that means my disease is still active. \n\nAnyways please share your experiences if you were once in my shoes. What did you do to dispel other people's disbelief in you etc.\n\n&amp;#x200B;\n\nThanks.",
        "created_utc": 1676994345,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hardware accelerated ROS 2 pipelines and towards the Robotic Processing Unit (RPU)",
        "author": "pablocarrera",
        "url": "https://news.accelerationrobotics.com/hardware-accelerated-ros2-pipelines/",
        "text": "",
        "created_utc": 1676991988,
        "upvote_ratio": 1.0
    },
    {
        "title": "Job Survey",
        "author": "zelzky15",
        "url": "https://www.reddit.com/r/ECE/comments/1183qng/job_survey/",
        "text": "Hi, Engineers! May I know where you do you work now? :)",
        "created_utc": 1676986998,
        "upvote_ratio": 1.0
    },
    {
        "title": "What made you guys choose Computer Engineering?",
        "author": "AlternativeNo5023",
        "url": "https://www.reddit.com/r/ECE/comments/1183ahw/what_made_you_guys_choose_computer_engineering/",
        "text": "Computer engineering majors why did you guys choose that major?",
        "created_utc": 1676985688,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please suggest best Agilent ADS tutorial. Specially for transmission line. Thanks.",
        "author": "febrezep",
        "url": "https://www.reddit.com/r/ECE/comments/117upoi/please_suggest_best_agilent_ads_tutorial/",
        "text": "",
        "created_utc": 1676954768,
        "upvote_ratio": 1.0
    },
    {
        "title": "IBM had DDR SDRAM in 1990 but Samsung introduced it in 1998?",
        "author": "PainterGuy1995",
        "url": "https://www.reddit.com/r/ECE/comments/117qn8e/ibm_had_ddr_sdram_in_1990_but_samsung_introduced/",
        "text": "Hi,\n\nI was reading Wikipedia page on DDR SDRAM: [https://en.wikipedia.org/wiki/DDR\\_SDRAM#History](https://en.wikipedia.org/wiki/DDR_SDRAM#History) . It says:\n\n[History of DDR SDRAM](https://preview.redd.it/70xn1i9l1gja1.png?width=636&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=a744a242e2844c8d078e3795773f9263db134596)\n\nWhy didn't IBM make its own commercial DDR SDRAM when it had it already working? Samsung introduced commercial DDR SDRAM in 1998 and IBM had it in 1990, did Samsung bought the concept how to make DDR SDRAM from IBM? Could you please guide me with this?",
        "created_utc": 1676942689,
        "upvote_ratio": 1.0
    },
    {
        "title": "Level of Python/C++ knowledge for DD/DV",
        "author": "bde21_",
        "url": "https://www.reddit.com/r/ECE/comments/117iyr1/level_of_pythonc_knowledge_for_dddv/",
        "text": "Hi, I am in the 3rd yr of my UG studies in electronics. I am interested in Digital Design and  Comp Arch but I also know that initially I might have to start off with a job in verification.\n\nI am well versed with Verilog and SV fundamentals (including OOPs). However I have seen that most job openings also require a 'good knowledge of python and C/C++'. I have a fair bit of command over C so what I wanted to know was:\n\n1. How much of C++ (including DS&amp;A) should I know. If it is difficult to quantify in words could you share some resources/courses/YT playlists?\n\n2. Same for python, I know the basics but I don't know what part of its functionality/libraries I should master. What does 'scripting' exactly entail? Again, if you could share some resources it would be great.\n\n3. Any other tools/frameworks I should get comfortable with ?\n\nPS: I know there are tons of resources available for C++ and python but I just wanted to know if there's anything which exactly correlates to their use in DD/DV.",
        "created_utc": 1676923435,
        "upvote_ratio": 1.0
    },
    {
        "title": "Level of Python/C++ knowledge",
        "author": "bde21_",
        "url": "https://www.reddit.com/r/ECE/comments/117iwr4/level_of_pythonc_knowledge/",
        "text": "",
        "created_utc": 1676923306,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone help with AM prelab hw?",
        "author": "Brianm135",
        "url": "https://i.redd.it/xs56eouqlfja1.png",
        "text": "",
        "created_utc": 1676919210,
        "upvote_ratio": 1.0
    },
    {
        "title": "any one knows how to generate this OFDM subcarriers plot using matlab",
        "author": "ntrysii",
        "url": "https://www.reddit.com/r/ECE/comments/117ac7n/any_one_knows_how_to_generate_this_ofdm/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/h3juiitw5dja1.png?width=696&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=92a225cd77ebc8f4b7281d9f017ef0b762fa5706",
        "created_utc": 1676907666,
        "upvote_ratio": 1.0
    },
    {
        "title": "To Protect Machine Learning IP, Model Watermarking Is on the Rise",
        "author": "allaboutcircuits",
        "url": "https://www.allaboutcircuits.com/news/protect-machine-learning-ip-model-watermarking-on-the-rise/",
        "text": "",
        "created_utc": 1676906229,
        "upvote_ratio": 1.0
    },
    {
        "title": "[INDIA] I got an offer for 9LPA for an embedded systems role. Should I choose this or keep looking for software roles that pay higher",
        "author": "punchirikuttan",
        "url": "https://www.reddit.com/r/ECE/comments/1178bus/india_i_got_an_offer_for_9lpa_for_an_embedded/",
        "text": "This was an on campus placement. There are software roles that pay better but I'm generally interested in embedded roles. Is this a good pay for a fresher in India in embedded systems? How is the growth in this field?",
        "created_utc": 1676904227,
        "upvote_ratio": 1.0
    },
    {
        "title": "RobotPerf, benchmarking interest for robots grows",
        "author": "pablocarrera",
        "url": "https://www.reddit.com/r/ECE/comments/1177b8y/robotperf_benchmarking_interest_for_robots_grows/",
        "text": "[https://news.accelerationrobotics.com/robotperf-subproject-grows-the-ros-2-hardware-acceleration-working-group/](https://news.accelerationrobotics.com/robotperf-subproject-grows-the-ros-2-hardware-acceleration-working-group/)  \nRobotPerf subproject grows the ROS 2 Hardware Acceleration Working Group. More meetings and more people participating in discussions around hardware acceleration and robot compute architectures.",
        "created_utc": 1676901454,
        "upvote_ratio": 1.0
    },
    {
        "title": "ELECTRONICS DESIGN TOPIC IDEA",
        "author": "peoplecallmeaga",
        "url": "https://www.reddit.com/r/ECE/comments/1176mrw/electronics_design_topic_idea/",
        "text": "any suggestions for my elecs design class topic idea that we can propose for toddlers or products for babies (2-7 yrs old)",
        "created_utc": 1676899640,
        "upvote_ratio": 1.0
    },
    {
        "title": "ROS 2 Humble in NVIDIA Jetson Nano with Yocto",
        "author": "pablocarrera",
        "url": "https://www.reddit.com/r/ECE/comments/1172od5/ros_2_humble_in_nvidia_jetson_nano_with_yocto/",
        "text": "[https://news.accelerationrobotics.com/ros-2-humble-in-nvidia-jetson-nano-with-yocto/](https://news.accelerationrobotics.com/ros-2-humble-in-nvidia-jetson-nano-with-yocto/)  \nROS 2 Humble is the latest LTS of the Robot Operating System (ROS), the de facto framework for robot application development. Yocto and ROS 2 allow you to build custom Linux-based production-grade operating systems for robots that obtain best performance for your use case. This article provides a walkthrough on how to build a Linux operating system with ROS 2 Humble for the NVIDIA Jetson Nano board and showcase our contribution to the ROS 2 community bringing ROS 2 Humble support for Yocto Honister release. Lastly, we show how to get better performance with ROS 2 Humble using ROBOTCORE hardware acceleration framework for ROS.",
        "created_utc": 1676886148,
        "upvote_ratio": 1.0
    },
    {
        "title": "Freaking out due to automation!",
        "author": "cmos_inverter",
        "url": "https://www.reddit.com/r/ECE/comments/116zbln/freaking_out_due_to_automation/",
        "text": "I am currently doing my final semester of my masters in EE and have a job in Digital VLSI domain at one of the top 3 companies . I love this domain and always wanted to be in this field and thus I pursued a masters and finally got my dream job. But all the news of digital VLSI getting automated by more and more advanced EDA tools is freaking me out. I plan to be in this field till my retirement, So around 35 years more. Chatgpt already can churn out verilog codes (which although may not be efficient and are buggy ) , but things will get worse in the coming years. What shouuld I do to secure my job? Is changing to Analog will be better as safer against automation? Or should I do a PhD in future?",
        "created_utc": 1676873150,
        "upvote_ratio": 1.0
    }
]