[
    {
        "title": "Interview topics for positions in the semiconductor industry?(Hardware)",
        "author": "ragkor",
        "url": "https://www.reddit.com/r/ECE/comments/7bvvo6/interview_topics_for_positions_in_the/",
        "text": "Obviously. there are multiple roles in these companies ranging from firmware/embedded software all the way to transistor level design.\nFor a hardware postion , what would be essential content to review?\n\nLet me start it off:\n1.Setup Hold Time\n2.What is a flip flop ?\n3. Adder circuits, multiplexers ,FIFO's\n...\n\n\n",
        "created_utc": 1510257606,
        "upvote_ratio": ""
    },
    {
        "title": "I have a signal that switches the ground on and off but keeps the positive on but I want to flip that and dont know how, its for a motorcycle tacheometer and my google foo is rusty could I get some help",
        "author": "nosliw_rm",
        "url": "https://www.reddit.com/r/ECE/comments/7br8jr/i_have_a_signal_that_switches_the_ground_on_and/",
        "text": "Im installing a new speedometer and rpm meter onto my kawasaki ninja 250 but have a slight problem, the wire for the tacheometer plugs into the ignition coils positive terminal but [this link](https://faq.ninja250.org/images/a/a7/Ninja_250_Start_%26_Ignition_Schematic.pdf) shows that the positive is always connected and the ground is what is switched on and off. the rpm meter is looking for a signal from the positive rail in relation to ground but the positive never changes so no rpm is read.\n\nI havnt worked with component level stuff for a while and was never very good as its just a hobby. I feel like things like a comparator or an opamp or just a transistor set up correctly would work but I have no idea how to set them up\n\nthe voltage is 12v and the rpm is up to 12k rpm so it sould only be seeing 3k pulses a minute because a 4 stroke engine only uses one of the 4 rotations to fire .  \nI have op amps and comparators and many different transistors laying around that im sure some of them are rated for 12v and those are really all i know and I barely know them but I can defiantly order stuff too, I just want to know my damn rpm lol\nany help is really appreciated",
        "created_utc": 1510204035,
        "upvote_ratio": ""
    },
    {
        "title": "Critique My Resume Please! (Freshman)",
        "author": "[deleted]",
        "url": "https://i.redd.it/ymnofflwbvwz.jpg",
        "text": "[deleted]",
        "created_utc": 1510197813,
        "upvote_ratio": ""
    },
    {
        "title": "Ultrafast magnetic reversal points the way toward speedy, low-power computer memory",
        "author": "Chipdoc",
        "url": "http://news.berkeley.edu/2017/11/03/ultrafast-magnetic-reversal-points-the-way-toward-speedy-low-power-computer-memory/",
        "text": "",
        "created_utc": 1510195506,
        "upvote_ratio": ""
    },
    {
        "title": "Please, I need help with some basic questions on AC electricity.",
        "author": "Smahmd",
        "url": "https://www.reddit.com/r/ECE/comments/7bpyc7/please_i_need_help_with_some_basic_questions_on/",
        "text": "**Question 1**\n\nSo i understand that the speed of the electrons (drift velocity) move extremely slowly but rather it is the signal they send that moves at the speed of light. \n\n What i do not understand is how this applies when dealing with AC electricity. Do the electrons physically move back and forth really slowly as well? I know they vibrate but i am focused on the speed at which they are moving back and forth.\n\n**a)** If i were to apply a frequency of 60HZ will the electrons move back and forth 60 times a second. If so then they must be moving really god damn fast and not at the drift velocity.\n\n**b)** And if they do then at what distance do the electrons decide to turn back and forth?\n\n**Question 2**\n\nThis is to do with the graph of Voltage/Current on AC electricity. Current is the flow of charge and in the graph of AC electricity it looks like a sine wave. Let's say you start at t=0 and observe the current. The current would increase up to a maximum meaning the flow of electrons at a given point is at it's max. But then the current decreases all the way till 0. This means that the electrons are slowing down up to a point were they are not moving at all. Afterwards they go in reverse and the cycle continues.\n\nWith this understanding, shouldn't we be seeing the lights in our house flicker that momentary second the current becomes 0 in the graph of our AC electricity.\n\nImage to help you understand what i mean:\nhttps://i.imgur.com/krGPQBo.png",
        "created_utc": 1510189844,
        "upvote_ratio": ""
    },
    {
        "title": "Qualcomm founders honored with IEEE Milestone Award",
        "author": "vsg7",
        "url": "https://www.reddit.com/r/ECE/comments/7bp3ok/qualcomm_founders_honored_with_ieee_milestone/",
        "text": "In the wake of Qualcomm being in the spotlight recently due to legal allegations and business acquisitions, I'd like to share that Qualcomm founders have been awarded with the IEEE Milestone for their CDMA and spread spectrum development that drives the mobile industry to what it is today.\n\nThis puts company founders Irwin Jacobs and Andrew Viterbi in the same rank as Thomas Edison, Alexander Graham Bell, James Clerk Maxwell, Nikola Tesla, and more.\n\nhttp://ethw.org/Milestones:List_of_IEEE_Milestones#1980-Present\n\nhttps://timesofsandiego.com/tech/2017/11/07/qualcomm-and-its-founders-recognized-for-historic-electronics-milestone/",
        "created_utc": 1510181483,
        "upvote_ratio": ""
    },
    {
        "title": "Do you love cars?? Well if yes, you must have this SPEEDOMETER watch, first 100(26 left) orders are FREEE in exchange of a honest review. Feel free to claim yours and just pay shiipping!",
        "author": "7gwethern1369",
        "url": "http://100chance4free.blogspot.com/2017/11/do-you-love-cars-well-if-yes-you-must.html",
        "text": "",
        "created_utc": 1510165813,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a High-Precision Low-Drift Crystal Oscillator",
        "author": "thewolfonlsd",
        "url": "https://www.reddit.com/r/ECE/comments/7bmyet/looking_for_a_highprecision_lowdrift_crystal/",
        "text": "I'm in the process of developing a wireless fencing (the sport) scoring system, and I require 2 packs to have a somewhat synchronized timer for about 5-minute intervals, and it needs to be low cost (the product is aimed toward budget school/club fencing). The solution I've come up with is having 2 counters run off of 2 different crystal oscillators, and the counters will be synchronized at the start of each match, matches last 5 minutes and I have a timing leeway of 150ms (aka the counters can drift 150ms away for each other). I'm just looking for a low-cost low-drift crystal oscillator that would work for this. (Also if you think my design is shit and suggestions would work too).",
        "created_utc": 1510163109,
        "upvote_ratio": ""
    },
    {
        "title": "Is pursuing a specialization in brain computer interfaces worth it during forth year?",
        "author": "AnasAtef",
        "url": "https://www.reddit.com/r/ECE/comments/7bmow4/is_pursuing_a_specialization_in_brain_computer/",
        "text": "I am a 4rth year Computer &amp; Communications Engineering student and was thinking to simulate a Brain Computer Interface (BCI) using either BCI2000 or BCILab.\n\nI of course have near 0 knowledge on neuroscience, I am having trouble reading these Research papers on the topic and have to start my final project by next semester.\n\nI have already started reading a few books and papers on the topic and wanted to ask you experienced professionals here.\n\nIs it worth it to continue studying BCIs and to try creating a simulation for the final project or should I stick by a project relating to my major.",
        "created_utc": 1510160886,
        "upvote_ratio": ""
    },
    {
        "title": "Design Contest and Giveaway giving away Thermal Imaging Goggles and more",
        "author": "zacjack12",
        "url": "https://www.allaboutcircuits.com/giveaways/win-thermal-imaging-goggles-at-the-makewithmaxim-design-contest-and-giveawa/",
        "text": "",
        "created_utc": 1510159763,
        "upvote_ratio": ""
    },
    {
        "title": "Longshot Cry for help on Haier hr7p196 MCU.",
        "author": "Xials",
        "url": "https://www.reddit.com/r/ECE/comments/7bm98j/longshot_cry_for_help_on_haier_hr7p196_mcu/",
        "text": "So I work with a company who is \"sold\" on doing business with this company overseas that ends up costing them more money than they think. Recently they rushed some hardware together and are shipping units on the water right now that have a bug in the firmware. They also apparently decided to swap from a microchip mcu to the haier hr7p196 series. Same programming header as the microchip board but we have no experience in flashing this chipset. Does anyone know where to get the firmware flashing tool? Will it work with a microchip ICD 3 or 4 programmer? ",
        "created_utc": 1510157112,
        "upvote_ratio": ""
    },
    {
        "title": "Amazing Techincal History : Dat Tape Drive",
        "author": "[deleted]",
        "url": "https://youtu.be/cg2fB-AysPQ",
        "text": "[deleted]",
        "created_utc": 1510145745,
        "upvote_ratio": ""
    },
    {
        "title": "Anybody have suggestions for performance improvement for NN in Matlab? (Object detection)",
        "author": "kraegarthegreat",
        "url": "http://www.babydonthertzme.ca/2017/11/color-vision-and-computers.html",
        "text": "",
        "created_utc": 1510145674,
        "upvote_ratio": ""
    },
    {
        "title": "Power Generation using Pump",
        "author": "IgneousFalcon",
        "url": "https://www.reddit.com/r/ECE/comments/7bgg3r/power_generation_using_pump/",
        "text": "Hello everyone. I am currently working a project where we are planning to use a pump to generate power. We currently have 11psi to work with and are looking at this pump. \n\nhttps://www.amazon.com/Mavel-Star-Submersible-Circulation-Waterproof/dp/B01I6G1F94\n\nWe were wondering, how much power would this pump generate if we spin the pump backwards. Thanks everyone.",
        "created_utc": 1510090505,
        "upvote_ratio": ""
    },
    {
        "title": "System for performing “tensor algebra” offers 100-fold speedups over previous software package",
        "author": "Chipdoc",
        "url": "http://news.mit.edu/2017/faster-big-data-analysis-tensor-algebra-1031",
        "text": "",
        "created_utc": 1510085754,
        "upvote_ratio": ""
    },
    {
        "title": "Looking to interview a few Electrical Engineers and Computer Engineers in industry",
        "author": "frozo124",
        "url": "https://www.reddit.com/r/ECE/comments/7bfnvo/looking_to_interview_a_few_electrical_engineers/",
        "text": "My name is Connor and I am a first-year Electrical Engineer and I need to interview a few Electrical Engineers and Computer Engineers in Industry for my Intro to EE class. I thought it might be a good idea to ask people here because there are so many friendly engineers on this subreddit to interview to get a glimpse of what it takes to be an Electrical and a Computer Engineer.\n\nThe Interview should take about 15 min. The Questions are all on things like who do you work for, how long have you worked for them, where did you go to college, did college prepare you for your job, what advice do you have for me being a first-year Electrical Engineer, etc...\n\nI need to do this interview by phone or skype or some way of talking to the engineer. So if you are interested in helping me out please comment here or private message me so we can hopefully do an interview sometime today or later this week.\n\nThank you so much if you allow me to interview you and I am so sorry if I put this on the wrong subreddit.",
        "created_utc": 1510083770,
        "upvote_ratio": ""
    },
    {
        "title": "Power Electronics vs. IC design",
        "author": "trazz32",
        "url": "https://www.reddit.com/r/ECE/comments/7bfdjy/power_electronics_vs_ic_design/",
        "text": "I'm currently a junior studying EE. I'm at the point where I'm starting to specialize, and I was debating between Circuits/IC design and Power as a focus area. I'm currently in a power electronics class (DC-DC, AC-DC converters etc.), and I'm really enjoying it. If I stuck with the power path, I'd take courses on electrical machines, control systems, and power systems. If I went more towards the circuits path, I would take courses on analog IC design, digital IC design, and more semiconductor physics classes. \n\nI believe working with hybrid-electric vehicles, green energy, or power electronics circuits would be very interesting in the Power field. I'm just concerned these kinds of positions don't pay as well, are less prestigious, and most of the board level positions are with defense contractors or are being outsourced. If I were to go the circuits route, I could work for a company like Intel, Qualcomm, or some other semiconductor company and design power IC's. However, I don't like that there's a big barrier to entry with a masters being a requirement for most design positions, and a Phd isn't uncommon. Would specializing in circuits suit me better for having a stable, interesting, and well-paying career working with designing power electronics, or should I just stick with the Power route and see where my future takes me?\n\nEDIT: I've had an internship in the defense industry, and didn't like the slow pace. I also don't want to work in the  Utilities industry. I'd love to work with consumer electronics or something a little more fast-paced. So if I was trying to get into that field, which would be the better path to take?",
        "created_utc": 1510081364,
        "upvote_ratio": ""
    },
    {
        "title": "Multiple independent servo control",
        "author": "MajorasMaskForever",
        "url": "https://www.reddit.com/r/ECE/comments/7besya/multiple_independent_servo_control/",
        "text": "I'm trying to find a way to independently control 4 servos from a Raspberry Pi Zero, but having some trouble finding solutions I like. I have an attitude controller running on the Zero (via an RTOS) which creates outputs for four servo angles. Our design constraints make the section for electronics (other than servos) barely fit a Zero length wise, but the equipment and resources we have makes us use through hole components. I would like a small IC that I can send a duty cycle to via SPI that then generates a PWM signal on that duty cycle at a freq I set at startup.\n\nFirst idea is using Adafruit's 16 port servo controller but it's really large. The Zero along with other sensors we have takes up a ton of space and sacrificing more is not ideal. It also uses I2C and I'd rather connect to an SPI bus I already have running around.\n\nI could offload the PWM duties to a uC. We have stuff to deal with PICs so if we had to go this route I'd prefer to use them over AVR. I thought about using a PIC that had 4 PWM channels but they're pretty large even for DIPs, or using a few smaller ones that have fewer. Either way brings a fair amount more of development to get those working.\n\nI've been looking at timer chips but I'm not entirely sure if those are going to do what I want. Seems those are used more for generating PWM signals from analog voltages through potentiometers (if I'm reading a 555 application diagram right) and I'd like to not have to run through a DAC first.\n\nAnother idea I had that *might* work is bit-banging the GPIO, however that will take a lot of context switches to change just a few registers and I would be concerned over execution time of the controller.\n\nAdmittedly I'm not super knowledgeable when it comes to this part of embedded systems so any advice and help would be great!\n\n\n",
        "created_utc": 1510076591,
        "upvote_ratio": ""
    },
    {
        "title": "Is this circuit in planar form? If not, can it be redrawn to be?",
        "author": "[deleted]",
        "url": "https://i.redd.it/4wov5vh74lwz.jpg",
        "text": "[deleted]",
        "created_utc": 1510074144,
        "upvote_ratio": ""
    },
    {
        "title": "Project I've made for those looking for jobs [Update]",
        "author": "despiteallevens",
        "url": "https://www.reddit.com/r/ECE/comments/7bdzgs/project_ive_made_for_those_looking_for_jobs_update/",
        "text": "Hey guys, I launched a project a while back that emailed daily job listings to you every morning. One of the most wanted feature was to be able to select multiple states and job positions and I've finally implemented it. Thanks to everybody that gave me feedback!\n\nThe URL is www.jobsend.io",
        "created_utc": 1510069503,
        "upvote_ratio": ""
    },
    {
        "title": "What makes a development kit good?",
        "author": "ohkneel",
        "url": "https://www.reddit.com/r/ECE/comments/7bdle0/what_makes_a_development_kit_good/",
        "text": "Hi guys, \n\nI'm an ECE student that's just started interning in a MCU company for 1 year, all my tasks to date have been embedded software development and I've always been able to learn about what I'm implementing as I go. \n\nHowever, my most recent task is to produce a document comparing rival development kits/devices to our own. As somebody who's only previous experience is with RPI and Arduino prior to this position, this task is a little daunting as I'm not yet sure what makes a \"great\" development kit. \n\nIn particular the sponsor for this project has asked me to compare: Flash Memory, Graphics Controller/2-D Engine and Security features of the devices which are up for comparison. \n \nSo the questions are: \n\n1) For the features above generally what specs are you looking at that would make you choose one device over the other? (i.e. resolution, memory endurance, must-have encryption algorithms etc.)\n\n2) In terms of user experience what makes are you looking for to support a development kit? (i.e. code generator, sample applications, IDE, customer support, etc. ) \n\nAs I am only a student I am at a bit of a loss as to what is invaluable to somebody who needs to develop an industry solution using an embedded MCU. \n\nI am hoping some seasoned embedded folks out there could provide some feedback on these features and the user experience of them.\n\nThanks in advance!\n\nedit: spelling",
        "created_utc": 1510065876,
        "upvote_ratio": ""
    },
    {
        "title": "What other degrees could help me get an EE job if I am already a dedicated hobbyist ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/7bco97/what_other_degrees_could_help_me_get_an_ee_job_if/",
        "text": "[deleted]",
        "created_utc": 1510055445,
        "upvote_ratio": ""
    },
    {
        "title": "Please, This is my 7th year",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/7bco1g/please_this_is_my_7th_year/",
        "text": "[deleted]",
        "created_utc": 1510055355,
        "upvote_ratio": ""
    },
    {
        "title": "Difference between inductor used in matlab simulation and practical implementation at high frequencies (250k)?",
        "author": "maq205075",
        "url": "https://www.reddit.com/r/ECE/comments/7bbsux/difference_between_inductor_used_in_matlab/",
        "text": "I have designed a sliding mode controller for a power converter at switching frequency of 250k. So far i have completed simulation in matlab and got pretty good results. Now i want to make a practical circuit and controller (want to submit my research in IEEE journal). \n\nI don't have too much experience of practically making circuits so i asked for a friend's help. He says that i need to take into account the reactance of my inductor and also its magnetizing inductance. So how much internal resistance should i assume for my inductor? Are there any other problems i should be aware of? ",
        "created_utc": 1510041702,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any independent jobs you can get as an EE aside from opening your own business ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/7bblsi/is_there_any_independent_jobs_you_can_get_as_an/",
        "text": "[deleted]",
        "created_utc": 1510038645,
        "upvote_ratio": ""
    },
    {
        "title": "For some products, mechanical engineers need to have faith in the abilities of software engineers ( re: transportation )",
        "author": "herkato5",
        "url": "https://www.reddit.com/r/ECE/comments/7bbjn1/for_some_products_mechanical_engineers_need_to/",
        "text": "\nExample of a technology that provides plenty of challenge for both kinds of engineering: \n\nTransportation device based on mechanical feet, that can carry 50 kilos of hiker's camping gear over difficult terrain. Clearly that can not work without fairly complicated software that regulates force on every electric actuator / motor. It needs about 6 axis for each feet. 2 feet would need 12 axis + possibly 2 actuators that move the center of mass on top of the feet. The forces need to be regulated maybe 10, maybe 30, maybe 100 times per second. Let's say it's about 100. If every axis can have it's force expressed with one byte, one \"signed char\", a number from -127 to +127, fed to the digital-to-analog converters, then there needs to be about one kilobyte per second datastream to keep the transportation device walking.\n\nMechanical engineers do not have a need to have any idea about how software engineers can make the on-board computer to compute that datastream based on some 3D scanning of terrain few meters ahead and information about axis angles.\n\nUnlike self-driving cars or drones, this technology does not have to be reliable. It does not necessarily matter much if the transportation device stumbles once per kilometer of walking, as long as someone is there to help it up. One person can lead a caravan of 10 walkers carrying 500 kilos of stuff. The 3d scanning, possibly based on stereoscopic computations with data from 2 \"cell phone cameras\", can be low quality; as low as someone gets with eyes when walking in a dark forest in moonlight.\n\nOther technology in it is nothing special: Lithium-ion batteries used in drones, electric motors used in drones, doors or boats, computer with a 4 core ARM processor with at most gigabyte of ram, some small Linux, freeBSD or openBSD, remote control based on wlan, bluetooth, near-infrared or a special handheld flashlight transmitting some data on visible light while providing illumination.\n\nMost of this could be said also about drones that fly like birds by flapping wings ( ornitophter ), but it is unclear whether such drones would give any efficiency advantage compared to helicopter drones.\n",
        "created_utc": 1510037777,
        "upvote_ratio": ""
    },
    {
        "title": "[Advice] Analog signal connection to Linux machine",
        "author": "MateoConLechuga",
        "url": "https://www.reddit.com/r/ECE/comments/7bbfhg/advice_analog_signal_connection_to_linux_machine/",
        "text": "Hello everyone,\nI am currently looking for advice and suggestions on the best configuration for the following design. I currently have a few EM sniffers that I would like to route through an amplifier and then through an ADC, with the end goal to be able to process the ADC output on a Linux machine. Based on some measurements the ADC should be able to sustain at least 100Msps with a 250 MHz input bandwidth at 14 bits or greater; potentially needing variable gain input since the input is between the 1 to 300millivolt range (This is after pre-amplification; but I imagine these will need to be amplified in order to provide the necessary reference voltages as well?). Anyway, from the ADC I believe it would be routed through a suitable FPGA and from there sent via USB to the Linux box. I have been looking around and I have seen the TI [ADS5562EVM](http://www.ti.com/tool/ads5562evm) paired with the [TSW1405EVM](http://www.ti.com/tool/TSW1405EVM), which doesn't quite meet my specs but may be enough. The price range appears to be a little hefty though, ideally I would like to be able to accomplish this task within a reasonable price &lt; $200. I am searching for the best method to simply get the analog signal to a Linux Machine, so I may not be going down the right path as well. Any help and/or time is much appreciated. Thanks.",
        "created_utc": 1510036134,
        "upvote_ratio": ""
    },
    {
        "title": "Accepted a hardware internship, thinking I may regret it",
        "author": "FairlyOddParents",
        "url": "https://www.reddit.com/r/ECE/comments/7bbchy/accepted_a_hardware_internship_thinking_i_may/",
        "text": "I am currently in third year and I just accepted a year long mixed signal internship (AMD) starting in May. However, really thinking about it I think I would like to ideally work in software. So my question is, do you think it's good experience anyway to work in a more hardware oriented role and transition to software after I graduate? Has anyone else done this? Thanks!",
        "created_utc": 1510034980,
        "upvote_ratio": ""
    },
    {
        "title": "Worldwide free shipping for PCB prototype",
        "author": "Jorge5011",
        "url": "http://www.allpcb.com/T2",
        "text": "",
        "created_utc": 1510026498,
        "upvote_ratio": ""
    },
    {
        "title": "Fixing the Ethernet board from a vintage Xerox Alto",
        "author": "mttd",
        "url": "http://www.righto.com/2017/11/fixing-ethernet-board-from-vintage.html",
        "text": "",
        "created_utc": 1510004538,
        "upvote_ratio": ""
    },
    {
        "title": "Mixing video streams in Zynq / Zynq MPSoC",
        "author": "adamt99",
        "url": "https://forums.xilinx.com/t5/Xcell-Daily-Blog/Adam-Taylor-s-MicroZed-Chronicles-Part-223-Video-Mixing-with-the/ba-p/806149",
        "text": "",
        "created_utc": 1509995127,
        "upvote_ratio": ""
    },
    {
        "title": "Connecting 2 separate macros (with their respective gds and netlist) by pin abbuttment. How to reflect that in the netlist?",
        "author": "LibertyState",
        "url": "https://www.reddit.com/r/ECE/comments/7b77gs/connecting_2_separate_macros_with_their/",
        "text": "I have 2 GDS, and 2 netlists. I merge the 2 layouts together and create an overlay, and i copy all the pins and their labels into the topcell overlay.\n\nLet's say macro 1 has multiple instances of pinx, and macro2 has multiplace instances of pinx as well, and 1 instance of piny.\n\nNow, all pins of the name pinx from both macros touch each other, and become connected. That leaves the 1 pin, piny, in macro2. This piny actually connects to one of the pinx in macro1 by design intent. So they touch each other in the GDSs.\n\nNow, how can i create a topcell netlist reflecting that connectivity? I only have the 2 standalone netlists.\nI tried the following:\n\n.SUBCKT merged_macro pinx piny\n\nXuMacro1 Macro1 $PINS pinx=pinx\n\nXuMacro2 Macro1 $PINS pinx=pinx piny=pinx\n\n.ENDS\n\nI also append the 2 standalone netlists into this file as well.\nand I run LVS on the new gds and the new netlist, but it still fails saying that Layout has net piny while source netlist has net pinx and net piny.\n\nThat is my intent, but how do i make LVS checker understand so?",
        "created_utc": 1509994113,
        "upvote_ratio": ""
    },
    {
        "title": "DLR Lab Builds on Future Robotic Space Capabilities with SUPVIS Justin Humanoid Robot",
        "author": "zacjack12",
        "url": "https://www.allaboutcircuits.com/news/dlr-lab-builds-on-future-robotic-space-capabilities-with-supvis-justin-huma/",
        "text": "",
        "created_utc": 1509993638,
        "upvote_ratio": ""
    },
    {
        "title": "Masters programs in bay area?",
        "author": "fathersonandlolly",
        "url": "https://www.reddit.com/r/ECE/comments/7b7562/masters_programs_in_bay_area/",
        "text": "I am relocating to the bay area in the next few months, and hoping to begin my masters education out there. Obviously the area is a hotbed for EEs, and I was hoping r/ece has experience with the schools in the area. So the questions I am looking to answer are:\n\n- Which schools offer a part-time MSEE program that can be completed in 3-4 years?\n\n- Are any schools particularly good for communications and signal processing? Any schools particularly deficient in this area?\n\n- Does anybody have any experiences, good or bad, to share about these schools?\n\nAssume I have limited knowledge of the big-name schools, and no knowledge of the smaller schools in the area. Any response is appreciated. ",
        "created_utc": 1509993532,
        "upvote_ratio": ""
    },
    {
        "title": "Ohm's law for Beginners",
        "author": "[deleted]",
        "url": "https://www.sweetwater.com/forums/",
        "text": "[deleted]",
        "created_utc": 1509993200,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any good (and preferably newer) books for beginners on microcontrollers that have a focus on robotics?",
        "author": "everyoneofudeserves0",
        "url": "https://www.reddit.com/r/ECE/comments/7b67gq/are_there_any_good_and_preferably_newer_books_for/",
        "text": "I've been following this book called \"The Robot Builder's Cookbook\". It is from 2007 but I like it. However the book is a bit at a higher level than I and it is a bit hard to follow.\n\nThe reason I like the book though is that it shows you how to work with microcontrollers and apply that to robotics. Most new books that are focused on robotics want you to use an arduino but I'd rather work with a microcontroller to have a better fundamental understanding of what I'm doing.\n\nI did find a book called [PIC Robotics](https://books.google.com/books?id=1U2KKP2Wi_kC&amp;printsec=frontcover&amp;dq=PIC+Robotics&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwiUpuWSoKrXAhUBUCYKHctKDacQ6AEIKDAA#v=onepage&amp;q=PIC%20Robotics&amp;f=false) but it is from 2003 and though I could probably learn something from it. It seems too dated as it expects me to install programs from a floppy and use serial ports to program the microcontroller's.\n\nWith that said does anyone know of any good books on how to work with microcontrollers and robotics or at least with a focus on working with robotics perhaps?",
        "created_utc": 1509985545,
        "upvote_ratio": ""
    },
    {
        "title": "I want to become a hardware engineer, but I need some advice on how to get there. Can any analog engineers, design verification engineers, product development electrical engineers, and hardware engineers help me figure this out?",
        "author": "feexamtips",
        "url": "https://www.reddit.com/r/ECE/comments/7b63hr/i_want_to_become_a_hardware_engineer_but_i_need/",
        "text": "Some Background: I graduated from an ABET accredited University in Electrical Engineering with a GPA between 3.0–3.3. My internship and fulltime opportunities that I took up are electrical engineering in power and buildings industries. I don’t find these industries particularly interesting, and want to make the switch to a more electronics based role.\n\nIdeal Plan:\n\n2017–2019: Obtain job in power engineering industry.\n\nThough I don't particularly enjoy this work, I would use this opportunity to save up money to get a masters degree. It’s a nice office job, and field work would be restricted to once or twice a month.\n\n2019–2021: Obtain master's degree in electronics engineering with thesis\n\nI have always wanted to try out the researcher life, so I would be a fulltime student. Since I did my bachelors degree in telecommunications and all my work experience is in power engineering, I am concerned that I will not get into a good engineering school to pursue electronics. My ideal school would be a large public university, like The University of Washington, The University of Texas, or The University of Oregon. Is this a reasonable concern?\n\n2021-Future: Obtain job as analog engineer, design verification engineer, product development electrical engineer, or hardware engineer.\n\nI want to work in innovation and find circuit analysis something that I miss. I enjoy working on devices and want the life of a hardware engineer.\n\nPlan Two:\n\n2017–2019: Obtain job as a Manufacturing Process Engineer in Semiconductor Industry\n\nProcess engineers work somewhat with electronics, definitely more so than a power engineer. This role is really the only role in the semiconductor industry that hiring managers are actually considering me for. Process engineers mostly work more on quality than design, and the only requirement is to have a technical bachelor's degree. The thing that draws me away from this opportunity is that process engineers work and have their offices on the manufacturing floor. This means no windows, a loud office environment, and a 10 hour shift, four days a week. I am drawn to this opportunity, since it might mean hiring managers would consider me for analog engineer, design verification engineer, product development electrical engineer, or hardware engineer positions in the semiconductor industry, after I gain this experience. Is this a reasonable assumption?\n\n2019-Future: Obtain job as analog engineer, design verification engineer, product development electrical engineer, or hardware engineer.\n\nPlan Three:\n\n2017–2019: Obtain job as a Manufacturing Process Engineer in Semiconductor Industry.\n\nThis opportunity might make me more competitive to get into one of my ideal universities for graduate school. Is this a reasonable assumption?\n\n2019–2021: Obtain master's degree in electronics engineering with thesis\n\nHaving a masters degree might make me more competitive in the electronics industry. Is this a reasonable assumption?\n\n2021-Future: Obtain job as analog engineer, design verification engineer, product development electrical engineer, or hardware engineer.\n\nOverall:\n\nI just want a normal 9–5 job doing something I am passionate about. I would so rather have a great office job as a power engineer, then move onto a great office job as a electronics engineer! However, I don’t know if taking a manufacturing job is my best bet to getting to the electronics engineering position.\n\nIf you are in the electronics industry, please let me know what you think! Thanks for listening!",
        "created_utc": 1509984554,
        "upvote_ratio": ""
    },
    {
        "title": "How to read/write isolation Diagrams for IEC60601-1",
        "author": "deltamac",
        "url": "https://www.reddit.com/r/ECE/comments/7b57gc/how_to_readwrite_isolation_diagrams_for_iec606011/",
        "text": "Hello community,\n\nI'm trying to write up a plan for designing a simple electronic system to comply with IEC60601-1. Annex J gives several examples of what isolation diagrams should look like, but I can't quite figure out how to interpret them.\n\nAs a starting point, see this figure from the standard \n\nhttps://imgur.com/a/ALAag\n\nDoes that mean that there are two individual secondary circuits within the enclosure? One (the black one) doesn't have to contact the patient and is ground referenced, and the other one (the white one) does contact the patient and is floating? What about the enclosure? Is it implied that it is Double Insulated?",
        "created_utc": 1509975929,
        "upvote_ratio": ""
    },
    {
        "title": "Android for Embedded Devices - 5 Reasons why Android is used in Embedded Devices",
        "author": "chtef",
        "url": "https://www.embeddedrelated.com/showarticle/1107.php",
        "text": "",
        "created_utc": 1509975302,
        "upvote_ratio": ""
    },
    {
        "title": "Applying for Senior IEEE membership",
        "author": "fintechnif",
        "url": "https://www.reddit.com/r/ECE/comments/7b545a/applying_for_senior_ieee_membership/",
        "text": "Has anyone applied for a senior membership at IEEE and been successful? Do you need to be an IEEE member for a certain time to get it? I have a masters with 3 publications and significant amount of work experience. Trying to evaluate my chances. ",
        "created_utc": 1509974872,
        "upvote_ratio": ""
    },
    {
        "title": "ENGINEER CHRISTMAS SweaTshirt",
        "author": "meredith244",
        "url": "https://imgur.com/a/2ngaV",
        "text": "",
        "created_utc": 1509950971,
        "upvote_ratio": ""
    },
    {
        "title": "A review of 21 different $1 microcontrollers and their ecosystems",
        "author": "funkathustra",
        "url": "https://jaycarlson.net/microcontrollers/",
        "text": "",
        "created_utc": 1509943730,
        "upvote_ratio": ""
    },
    {
        "title": "Research topic",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/7b1qnh/research_topic/",
        "text": "[deleted]",
        "created_utc": 1509929963,
        "upvote_ratio": ""
    },
    {
        "title": "I am electronics hobbyist, what sort o math should I focus on learning to understand most electronic text books ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/7b1isl/i_am_electronics_hobbyist_what_sort_o_math_should/",
        "text": "[deleted]",
        "created_utc": 1509927725,
        "upvote_ratio": ""
    },
    {
        "title": "What is normalized total traffic normalized against?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/7b0kep/what_is_normalized_total_traffic_normalized/",
        "text": "[deleted]",
        "created_utc": 1509918175,
        "upvote_ratio": ""
    },
    {
        "title": "Career versatility for an RF engineer.. Questions about options and clearances.",
        "author": "eethrowaway312",
        "url": "https://www.reddit.com/r/ECE/comments/7b0igu/career_versatility_for_an_rf_engineer_questions/",
        "text": "I used to work as a technician that had me in contact with radios, basic PLC controls, CCTV, and other technologies. It was a lot of swapping parts, and our position didn't exactly allow for a ton of creativity or flexibility beyond that. I returned to school (had a BS in an unrelated field), and am now looking at completing my master's degree with a specialization toward RF design.\n\nWhat concerns me is this. Looking at the job options, it seems that a huge amount of development in this field is related to defense/aerospace, which makes a lot of sense given the technologies they use. I am a little concerned about the prospect of getting a clearance to work in this field: I live in state where marijuana is legal, and while I've not used in the last year or so, I have many contacts who continue to do so. Reading through the clearance process, it seems I won't be out of the \"gray area\" for eligibility for at least another year or two, and that's if I make drastic changes in my life. Beyond this specific issue, I have some moral qualms regarding these lines of work: I guess I'd sleep better at night knowing I'd designed the next pacemaker or MRI or something sustaining life, rather than something furthering a global arms race. No judgement toward those who do, but I'm just not sure it's for me.\n\nWhat I'm wondering, is whether this RF degree is going to pigeonhole me into a very specific career path with few opportunities other than defense, and if so, what I can do to show a diverse skillset to employers?\n\nFor what it's worth, I'm not opposed to gaining a foothold in an industry from a similar place as I was before, a technician in a hands-on role, as opposed to a board- or code- level designer. The degree is nice to have, it's fulfilled a lifelong interest, but I was lucky enough to finish it at minimal expense, and it's a masters degree simply out of necessity: the university strongly pointed me in that direction rather than earning a second bachelors'. I just worry now that it's going to make me seem overqualified (and under-experienced) for the kinds of jobs I'd actually like to work in.\n\ntl;dr: Finishing a masters degree in RF engineering, but my actual interest spans a number of electronics roles. Is the job-market going to be too soft for this?",
        "created_utc": 1509917658,
        "upvote_ratio": ""
    },
    {
        "title": "Is worth going for a Physics degree if I am already a EE dedicated hobbyist.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/7avluf/is_worth_going_for_a_physics_degree_if_i_am/",
        "text": "[deleted]",
        "created_utc": 1509855882,
        "upvote_ratio": ""
    },
    {
        "title": "Question about Jukeboxes",
        "author": "zebramints",
        "url": "https://www.reddit.com/r/ECE/comments/7av8t5/question_about_jukeboxes/",
        "text": "I walked past a 50s style diner a few weeks ago that had those mini jukeboxes on the tables. Did those things actually exist when jukeboxes were in style, and if they did what kind of network would they have used?",
        "created_utc": 1509851108,
        "upvote_ratio": ""
    },
    {
        "title": "EE versions of Cracking the Coding Interview?",
        "author": "jlengine",
        "url": "https://www.reddit.com/r/ECE/comments/7auxsw/ee_versions_of_cracking_the_coding_interview/",
        "text": "I see these books a lot and I'm just wondering if there were strong books for Electrical Engineers. I understand that EE has a lot of different fields, so what I'm looking more for is a company/author that has a wide range of reputable books for specialized fields. ",
        "created_utc": 1509847345,
        "upvote_ratio": ""
    },
    {
        "title": "Need some help finding my place in the ECE job world. Looking for applications in AI and ML.",
        "author": "gandleforf",
        "url": "https://www.reddit.com/r/ECE/comments/7auvcs/need_some_help_finding_my_place_in_the_ece_job/",
        "text": "Hi everyone, I am a senior graduating from the University of Minnesota - Twin Cities in the spring and I feel like I'm not sure where I should be looking for a job or what types of applications I could work in.\n\nIn school I really enjoyed a lot of my AI and Machine Learning classes, algorithms courses, and a bit of OS courses. Naturally, as a CE, I am capable in embedded systems and controls but after going through an internship focused in that area, I found that it didn't really interest me.\nI am assuming that some robotics field may be beneficial for me or possibly something in High Performance Computing. But I'm not sure where to get started in finding the right job.\n\nHere is my current [transcript](https://drive.google.com/file/d/1H_KzF9lII23ijBSJxzBbLYo41DPxcVdG/view) (not the official one). My current GPA is 3.52, so its alright, but by no means perfect. And here is my [resume](https://drive.google.com/file/d/1GrJIl5ng8eSCNeo185ApNWkGG7ShfE2Z/view).",
        "created_utc": 1509846506,
        "upvote_ratio": ""
    },
    {
        "title": "How is prototyping carried out when using complex ICs that have no dev. kits?",
        "author": "sudodog",
        "url": "https://www.reddit.com/r/ECE/comments/7aspea/how_is_prototyping_carried_out_when_using_complex/",
        "text": "I'm aware that a large majority of ASICs/SoCs/FPGAs/SoMs/CPU/etc. ICs cannot simply be breadboarded or interfaced via some breakout adapter when prototyping. Some of these medium to high complexity devices have dev. kits available that allow that need to be met, in the context of the specific dev. kit's reference design, but I'm a bit clueless as to how designers develop for a device that has no dev. kit or reference design available. I realize one can produce their own board-level design using the device, have a prototype run manufactured, then rinse-and-repeat to iron out any kinks in the design; that sounds like a fairly ad-hoc, slow and costly process.\n\nTo people that have dealt with this issue before, I'm curious to know how you go about developing with non-prototype-friendly devices in a design? When I say \"non-prototype-friendly\", I mean that in both a physical (IC package, sensitive layout guidelines, physical constrictions, etc.) and development (how do you know the design works without being able to test it in front of you) sense.",
        "created_utc": 1509823515,
        "upvote_ratio": ""
    },
    {
        "title": "HI as a redditor fellow how just started an online store i thought it would be great to make a giveaway, so we are giving 100 pcs of these mechanical watches. Feel free to claim yours and just pay shipping.",
        "author": "bofo231017",
        "url": "http://livesporttv24xyz.blogspot.com/2017/11/hello-everyone-as-new-online-store-we.html",
        "text": "",
        "created_utc": 1509806539,
        "upvote_ratio": ""
    },
    {
        "title": "How is life as an ECE - regrets?",
        "author": "BlackCatandSalt",
        "url": "https://www.reddit.com/r/ECE/comments/7aqrkx/how_is_life_as_an_ece_regrets/",
        "text": "Hello ECE,\n\nI am an ECE student working for a year at a large semiconductor company between my 3rd and 4th year. I am doing well in my classes and find my internship interesting (although I am still trying to find my place in the industry - more interested in systems programming).\n\nMy parents, however, are openly disappointed in the fact that I am not pursuing medicine. They send me articles about wage caps and  job security and predict I will have to live at home (ect., ect.). They are also extremely off put by the idea of my working right after under-grad (say it is essentially like a HS degree).\n\nI don't have much of a rebuttal, because I don't know many working ECE's (outside professors). What has been your experience? What do you think of working right after undergrad? How are things going for you - ever regret not picking a different path?\n\nI hope this is the right subreddit - first time posting.\n\nThanks.",
        "created_utc": 1509803877,
        "upvote_ratio": ""
    },
    {
        "title": "Analyzing PMOS",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/7aq926/analyzing_pmos/",
        "text": "[deleted]",
        "created_utc": 1509796884,
        "upvote_ratio": ""
    },
    {
        "title": "خرید ویلا",
        "author": "siemenssimatic",
        "url": "http://www.banianmaskan.net/Villa.aspx?ID=%D9%81%D8%B1%D9%88%D8%B4_%D9%88%DB%8C%D9%84%D8%A7_%D8%A8%DB%8C%D9%86_%D8%AC%D9%86%DA%AF%D9%84_%D9%88_%D8%AF%D8%B1%DB%8C%D8%A7",
        "text": "",
        "created_utc": 1509782893,
        "upvote_ratio": ""
    },
    {
        "title": "Worldwide free shipping for pcb pototype",
        "author": "Saflins",
        "url": "http://www.allpcb.com/T2",
        "text": "",
        "created_utc": 1509771074,
        "upvote_ratio": ""
    },
    {
        "title": "Can rf/radar methods be used to determine the attitude of cubesats?",
        "author": "jubjub7",
        "url": "https://www.reddit.com/r/ECE/comments/7ao9dh/can_rfradar_methods_be_used_to_determine_the/",
        "text": "I've been doing reading into how cubesats can determine their attitude, and I've came across sun sensors, star trackers, solar panels on a frustum, earth albedo sensors, and gyros (for inertial measurements).  I'm wondering if there are ways to do this using RADAR, or some kind of RF transmitter.\n\nSay if the cubesat had some known antenna radiation pattern, are there ways that a base station could determine it's attitude?  \n\nOr if the cubesat had some known radar reflection, or had some special kind of reflector on it, could a radar system measure it's attitude?",
        "created_utc": 1509763815,
        "upvote_ratio": ""
    },
    {
        "title": "Broadcom may acquire Qualcomm amid existential legal battle with Apple",
        "author": "dynerthebard",
        "url": "https://www.theverge.com/2017/11/3/16604350/broadcom-qualcomm-acquisition-apple-legal-battle-100-billion",
        "text": "",
        "created_utc": 1509755688,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for resume help, ECE major applying for summer internships",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/7amwsq/looking_for_resume_help_ece_major_applying_for/",
        "text": "[deleted]",
        "created_utc": 1509748848,
        "upvote_ratio": ""
    },
    {
        "title": "Project to learn how to get off dev boards and use embedded microcontrollers on custom pcbs?",
        "author": "Taako_Magnusen",
        "url": "https://www.reddit.com/r/ECE/comments/7aml83/project_to_learn_how_to_get_off_dev_boards_and/",
        "text": "I want to learn how to take a chip off digikey and program it on my custom pcb. When i say programming i mean i want to learn about actually programming them with a programmer instead of just plugging my dev board into my computer and hitting build and upload from my IDE.  \n\nI think an arm piece (stm32?) would be a cool thing to learn. How do i learn about programming a blank embedded system so that i can incoporate just the chip and not a dev board in my projects? I want to learn about bootloaders both on the same chip and off-chip as well and how i can use them as a professional would.",
        "created_utc": 1509745598,
        "upvote_ratio": ""
    },
    {
        "title": "Question about solar panels",
        "author": "notMattHansen",
        "url": "https://www.reddit.com/r/ECE/comments/7ai0dn/question_about_solar_panels/",
        "text": "For a project in one of my classes, we're using [3\"x6\" solar panels](https://www.amazon.com/WHOLE-Solar-Cells-Factory-Tabbed/dp/B008A090L2) and we're trying to maximize the power output of it. Each cell has approximately identical voltage and current from when we measured it. However, I was wondering if it would be better to wire them in series, in parallel, or in both. I understand that in series the voltage is additive and current is constant and the opposite is true in parallel. I was thinking that because power = current * voltage that it would be best to have them wired in both parallel and series, but some of my classmates have expressed that they think series would have more power output. Can someone explain which one is better and why?\n\nSorry for somewhat messy post, I dont actually have too much of an idea of what this is because I havent taken any EE or similar classes.",
        "created_utc": 1509696263,
        "upvote_ratio": ""
    },
    {
        "title": "Question regarding fault impedance calculation for a single machine infinite bus",
        "author": "20j2015",
        "url": "https://www.reddit.com/r/ECE/comments/7aft61/question_regarding_fault_impedance_calculation/",
        "text": "For the following circuit, a three phase fault is applied at the generator bus (Generator is E), infinite bus is U.\nhttps://imgur.com/a/kCwwz\n\n\nHow is XII calculated?",
        "created_utc": 1509668205,
        "upvote_ratio": ""
    },
    {
        "title": "In a layout GDS, one pin is connected to another but have different names as they are in 2 different cells. How can I reflect that in the LVS netlist so that design is LVS clean?",
        "author": "LibertyState",
        "url": "https://www.reddit.com/r/ECE/comments/7acxp9/in_a_layout_gds_one_pin_is_connected_to_another/",
        "text": "So i have 2 macros with their own separate GDS and netlists. They are meant to be connected to each other by abbuttment (touching of the pins) across the boundaries. I do that by creating a topcell overlay in a new layout, and add the 2 layouts under this new topcell to get the merged GDS. Same with netlist, i append the 2 netlists into 1 file, and declare a new cell in the netlist that declares all the pin names for the entire merged design, as well as 2 subcells, with each separate design's pins declared as pinx=pinx piny=piny etc. \n\nSince in the layout, a pinx from first design is abutted to a piny from second design, in the netlist, i make some modification in the subcells i created earlier: for subcell 1 i say pinx=pinx, and in subcell 2, i say piny=pinx. LVS still fails.\n\nHow can i reflect the abbuttment of 2 different name pins in the layout in the merged netlist?",
        "created_utc": 1509642448,
        "upvote_ratio": ""
    },
    {
        "title": "Hey guys, a little while ago I posted this and got amazing feedback, wanted to post once more to help new people in the sub. I made a video interviewing an Electrical Estimator: \"Everything You Need to Know About Becoming a Cost Estimator\" -- It's been viewed over 800 times!",
        "author": "truthmarket",
        "url": "https://www.youtube.com/watch?v=ETay5fK1mV4",
        "text": "",
        "created_utc": 1509637941,
        "upvote_ratio": ""
    },
    {
        "title": "Undergrad Independent Study Question",
        "author": "rGreenTrees",
        "url": "https://www.reddit.com/r/ECE/comments/7acb30/undergrad_independent_study_question/",
        "text": "Hi, first of all, has anyone taken something similar to this and what was your experience like?\n\nSecond, what are some topics that I could research? I'm interested in GPUs, CPUs, basically anything that is involved in computing. I'm also open to other areas as well as I'm currently leading a solar car team at my university.",
        "created_utc": 1509636983,
        "upvote_ratio": ""
    },
    {
        "title": "Embedded programming - what is a bootloader and when do you need one?",
        "author": "chtef",
        "url": "https://www.embeddedrelated.com/thread/4393/what-is-a-bootloader-and-when-do-you-need-one",
        "text": "",
        "created_utc": 1509636337,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on high-volume through-hole wire soldering",
        "author": "NamasteHands",
        "url": "https://www.reddit.com/r/ECE/comments/7abhhx/thoughts_on_highvolume_throughhole_wire_soldering/",
        "text": "Im working on a product that, as of right now, will feature a through-hole soldered wire harness. There's a lot of concern regarding how the process of inserting+soldering this harness into the board scales with increasing volumes, so I am curious if anybody has experience with this type of fabrication.  \n\nOne possible avenue is a mechanism for 'pre-locating' the wires so they are fixed into the correct positions/pitch, making insertion into the board easier.  \n\nFor specifics, the harness has 4x 22AWG wires that connect into the board through a 2x2 hole array of pitch=2mm. 'high volume' in our case being 50,000 units/year.\n\nI'd welcome any insight or experience.",
        "created_utc": 1509629321,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think of this quick connect PCB header ?",
        "author": "flatmax",
        "url": "https://i.redd.it/29i4sm7khjvz.jpg",
        "text": "",
        "created_utc": 1509618595,
        "upvote_ratio": ""
    },
    {
        "title": "Virtual Oscilloscope help!",
        "author": "jabbar208",
        "url": "https://www.reddit.com/r/ECE/comments/7aajak/virtual_oscilloscope_help/",
        "text": "Please can you give me some link where can i use or download a virtual oscilloscope? For laboratory report purpose. Gonna check if my data is correct.",
        "created_utc": 1509617387,
        "upvote_ratio": ""
    },
    {
        "title": "Power Electronics or Embedded Programming?",
        "author": "WailinWaylon",
        "url": "https://www.reddit.com/r/ECE/comments/7a8ubb/power_electronics_or_embedded_programming/",
        "text": "For my final semester in my undergraduate degree, I am having a tough choice between taking a course covering power electronics with a focus on energy systems, or an embedded digital programming course in C. Which course would be more desirable for the workforce?",
        "created_utc": 1509592093,
        "upvote_ratio": ""
    },
    {
        "title": "What happens when the frequency is too high on the oscilloscope?",
        "author": "jlengine",
        "url": "https://www.reddit.com/r/ECE/comments/7a8sfc/what_happens_when_the_frequency_is_too_high_on/",
        "text": "I realize the shape becomes distorted, but what's physically happening within the oscilloscope?",
        "created_utc": 1509591531,
        "upvote_ratio": ""
    },
    {
        "title": "Anybody have experience as an SMTS or PMTS engineer position at AMD in Austin?",
        "author": "roundearththeory",
        "url": "https://www.reddit.com/r/ECE/comments/7a6f9b/anybody_have_experience_as_an_smts_or_pmts/",
        "text": "What would be the difference between the two in terms of years of experience and responsibilities?  \n\nI have an offer on the table and it will be either of the two levels. Iam trying to calibrate job responsibilities and expected compensation. Any input would be appreciated!",
        "created_utc": 1509568925,
        "upvote_ratio": ""
    },
    {
        "title": "Can you help me get in the right direction with a project?",
        "author": "DailyNate",
        "url": "https://www.reddit.com/r/ECE/comments/7a660l/can_you_help_me_get_in_the_right_direction_with_a/",
        "text": "Hey r/ECE, I am a mechanical engineering student who loves cars. \n\nRecently I have become fascinated with these tail lights and I want to recreate a pair of my own, some of these can be upwards of $1500-$1200 but I know I could make my own rendition of them for much cheaper. I am a pretty smart guy so I think I can make it happen but need a little help from some electrical guys.\n\nSo I think the way I would do these would to get an old pair of tail lights and then hollow them out and put in a series of LED's, all of this I think will be controlled by an arduino. \n\nI can solder and have taken the basic circuits class that all ME's at my university have to take so I have I would say a fairly basic understanding of wiring but I just need a little nudge in the right direction as far as attempting this. \n\nI own the kind of car that is in the first and second video for context. \n\nhttps://youtu.be/aG2IuuTFIAE?t=4m45s\nhttps://youtu.be/4loeviB9QQg?t=3m38s\nhttps://www.youtube.com/watch?v=CIpUmjSzAA8\n\nThanks!",
        "created_utc": 1509566570,
        "upvote_ratio": ""
    },
    {
        "title": "Revamping a computer organization class with new equipment",
        "author": "nice_remark",
        "url": "https://www.reddit.com/r/ECE/comments/7a55wf/revamping_a_computer_organization_class_with_new/",
        "text": "The course taught a my university uses the Motorola HCS12 as an architecture to teach undergraduates about assembly language and computer organization. This software necessary for programming requires Windows 7 is really outdate compared to the rest of the technology in other ECE labs. \n\nI asked the department if I could assist with trying to revamp the lab so we can get new technology and rid ourselves of the clunky HCS12. Does anyone recommend an architecture or device that be used in substitution for the course? The current professor suggested maybe using Raspberry Pis(?), as they can be programmed using ARM assembly, and offer a large range of I/O features for different labs (they are also fairly inexpensive). \n\nAny thoughts or suggestions? Thank you.\n\n",
        "created_utc": 1509557766,
        "upvote_ratio": ""
    },
    {
        "title": "Your moment of ECE Zen for the day: An amplifier is really just a special case of a power supply.",
        "author": "slappysq",
        "url": "https://www.reddit.com/r/ECE/comments/7a53ly/your_moment_of_ece_zen_for_the_day_an_amplifier/",
        "text": "",
        "created_utc": 1509557221,
        "upvote_ratio": ""
    },
    {
        "title": "Listing personal projects on resume",
        "author": "3FiTA",
        "url": "https://www.reddit.com/r/ECE/comments/7a51i2/listing_personal_projects_on_resume/",
        "text": "I have a small library of personal projects I’m working on (or have completed). They’re all documented on my personal website. Is it appropriate to list this on my resume? Say, a bullet point in a projects/experience section that briefly lists the projects and a link to the website. I don’t have a ton of formal professional experience and I’d like to showcase what I have done. For reference, I’m an MS EE student. ",
        "created_utc": 1509556731,
        "upvote_ratio": ""
    },
    {
        "title": "Resources for understanding silicon R,C, and analog switch behavior?",
        "author": "jms_nh",
        "url": "https://www.reddit.com/r/ECE/comments/7a4yca/resources_for_understanding_silicon_rc_and_analog/",
        "text": "Are there any good online resources for understanding silicon R and C behavior (primarily tolerance and tempco)? Also analog switch behavior, which I guess I assume is similar to, say, a 74HC4053, but perhaps not. I want to be better educated in discussions w/ analog designers where I work.",
        "created_utc": 1509555980,
        "upvote_ratio": ""
    },
    {
        "title": "Circuit Breaker Question",
        "author": "noatakzak",
        "url": "https://www.reddit.com/r/ECE/comments/7a3w3p/circuit_breaker_question/",
        "text": "I am designing a project to be plugged into the wall at our school. I would like to include a 3A breaker so if something happens and gets shorted out we don't take out half the building during our senior design expo lol. \n\nMy question is how do I make sure the breaker I choose is fast enough to trip before anything upstream? Given it's only 3A do I even need to worry about it? Also should I buy a 2 pole breaker as I do not know whether there is a floating neutral, preventing a neutral-ground fault?",
        "created_utc": 1509546357,
        "upvote_ratio": ""
    },
    {
        "title": "32.768kHz clock generation that doesn't take hundreds of milliseconds to start up.",
        "author": "eeng95",
        "url": "https://www.reddit.com/r/ECE/comments/7a1l6z/32768khz_clock_generation_that_doesnt_take/",
        "text": "I have an application where I need my oscillator to be up and stable within 10s of milliseconds, but am finding that off the shelf crystals don't come close to this requirement and most clock generation chips are more complicated than I need.\n\nIs there some chip type/family that I am missing? Some kind of 24MHz to 32.768kHz simple divider? \n\nI've even started at looking at building my own divide by N circuit, but that seems overly complicated and not reliable. \n\n",
        "created_utc": 1509512994,
        "upvote_ratio": ""
    },
    {
        "title": "Advice on the best way to get hired at Apple?",
        "author": "Lockheed1992",
        "url": "https://www.reddit.com/r/ECE/comments/7a1hd1/advice_on_the_best_way_to_get_hired_at_apple/",
        "text": "Hey guys.  So, quick background.  I'm an Electronics Engineer at Lockheed in Sunnyvale since I got my Bachelor's last June.  I'm finishing my Masters by March, and I want to get out of Lockheed, preferably at least out of the program I'm in.  I have my sights set on Apple, and I want to work with Electronics or PCB design, but aside from my senior capstone (4-Channel Linear Microphone Array for 2D Sound Localization) and 1.5 years at Lockheed working on an RF Electronics subsystem, I don't have much experience.  \n\nI've applied to a bunch of EE-related positions at Apple in South Bay, CA, most of which requiring 2, 3 or 5 years experience.  Pretty much nothing for entry level on their website.  If anyone would be willing to take a look at my resume, that would be awesome.  Any help or advice is greatly appreciated.\n",
        "created_utc": 1509511522,
        "upvote_ratio": ""
    },
    {
        "title": "question",
        "author": "anonymous12345678911",
        "url": "https://www.reddit.com/r/ECE/comments/79zwgv/question/",
        "text": "Hey guys, just wondering, whats the difference between an ECE major and an EE major?",
        "created_utc": 1509493749,
        "upvote_ratio": ""
    },
    {
        "title": "HAPPY HALLOWEEN, To celebrate this and attract new customers we are giving away 100 pcs of these amazing mechanical leather watches, for the price of 0$. Pay only shipping and get a new watch. We'd appreciate a honest review.",
        "author": "1dmellady1638",
        "url": "http://happyhalloween24x.blogspot.com/2017/10/happy-halloween-as-new-online-store-we.html",
        "text": "",
        "created_utc": 1509490639,
        "upvote_ratio": ""
    },
    {
        "title": "Need practice materials",
        "author": "lemonzap",
        "url": "https://www.reddit.com/r/ECE/comments/79z6j9/need_practice_materials/",
        "text": "Hello all, I am currently studying electrical engineering and pursuing a bachelors. I have a work study job where I get a lot of a free time at a computer and express permission to work on homework on the job. I am currently only taking general requirement classes this quarter otherwise I would just do EE homework. I'm looking for some material to practice EE while sitting here. I've found falstad.com/circuit and I think it would be fun to find some circuit design puzzles or challenges and work on solving them in that simulator. I can't really download anything on my work computer so that's out but I still want to find a good way to practice on the job. I would love some suggestions.",
        "created_utc": 1509486791,
        "upvote_ratio": ""
    },
    {
        "title": "In context of transistors and logic, what exactly is full swing?",
        "author": "wtf_is_going_on_now",
        "url": "https://www.reddit.com/r/ECE/comments/79yhee/in_context_of_transistors_and_logic_what_exactly/",
        "text": "Maybe a dumb question, but wanted to make sure.  Is this the complete swing in voltage that a transistor does to go from fully closed (no current goes through) to fully open (current allows to go through)?\n\nThere was some comment in some paper I was reading where some circuit would convert a \"single ended full swing \" to \"differential full swing\".  I understand the difference between single ended and differential pins, but unsure of full swing in this context.\n",
        "created_utc": 1509480697,
        "upvote_ratio": ""
    },
    {
        "title": "Question on USB",
        "author": "narwhalle",
        "url": "https://www.reddit.com/r/ECE/comments/79xziw/question_on_usb/",
        "text": "I have a device that communicates via USB only but I am restricted to use only RS232, RS422, CAN, and GPIO pins. Is it possible to convert USB to a different protocol such as RS232 or RS422? Thanks Again!\n\nedit: To clarify, I need a host-USB to UART because my device is USB and I have to connect it to a computer with only UART, I2C, CAN, GPIO, and SPI protocols.",
        "created_utc": 1509476504,
        "upvote_ratio": ""
    },
    {
        "title": "Screw you, Altium!",
        "author": "reason78",
        "url": "https://imgur.com/a/JXr1u",
        "text": "",
        "created_utc": 1509473018,
        "upvote_ratio": ""
    },
    {
        "title": "Best advice for landing an internship?",
        "author": "andy_j23",
        "url": "https://www.reddit.com/r/ECE/comments/79xg6y/best_advice_for_landing_an_internship/",
        "text": "Hey guys, what is some of the best advice you could give to Junior level undergrads when trying to find an internship in Electrical or Computer Engineering? Thanks",
        "created_utc": 1509471968,
        "upvote_ratio": ""
    },
    {
        "title": "My simple addition app keeps crashing when I click \"Add\"",
        "author": "i_hope_i_last",
        "url": "https://www.reddit.com/r/ECE/comments/79wso1/my_simple_addition_app_keeps_crashing_when_i/",
        "text": "I'm brand new to Java. Here's the link to my code:\nhttps://imgur.com/a/aS4VR\n\nWhat am I doing wrong?",
        "created_utc": 1509466424,
        "upvote_ratio": ""
    },
    {
        "title": "IEC 60853 - CYMCAP - load factor",
        "author": "phyxius90",
        "url": "https://www.reddit.com/r/ECE/comments/79uwh3/iec_60853_cymcap_load_factor/",
        "text": "Currently performing a study for a solar farm using CYMCAP. Solar farms have a typical bell curve load profile and I'm trying to get more out of the cables instead of just rating it for the peak load. I've hit a wall with understanding the load factor input within CYMCAP however. By definition the load factor is the ratio of the average loads over the peak load. For cyclic loading I'm using IEC-60853 solution method. Now when reviewing the transient solution solving for ampacity given time and temperature the multiplying factor does not correspond with the M factor in IEC. I setup the example problem in IEC section 7.1 in CYMCAP and the results are not the same. It's concerning me that I cannot replicate the results. Are you meant to input the loss-load factor instead? When I do this the results are a lot closer.\n\nAlso I noted that when the load factor is around 0.65 the multiplier is low and when the load factor is say 0.9 the multiplier is high. Shouldn't it be the other way around? Something is a miss here. Any ideas on what is going on?",
        "created_utc": 1509446611,
        "upvote_ratio": ""
    },
    {
        "title": "Watchdogs in the MPSoC Zynq",
        "author": "adamt99",
        "url": "https://forums.xilinx.com/t5/Xcell-Daily-Blog/Adam-Taylor-s-MicroZed-Chronicles-Part-222-UltraZed-Edition-Part/ba-p/804316",
        "text": "",
        "created_utc": 1509385550,
        "upvote_ratio": ""
    },
    {
        "title": "Any sources for ballistic transport?",
        "author": "HolyAty",
        "url": "https://www.reddit.com/r/ECE/comments/79p09n/any_sources_for_ballistic_transport/",
        "text": "I need to study ballistic transport for a term paper and could not really find any source for a dude who only knows that ballistic transport is when an electron leaves the device without scattering. All the sources I could find, assumes I know what it is and fundamentals, then adds some applications on top of it.",
        "created_utc": 1509382399,
        "upvote_ratio": ""
    },
    {
        "title": "Question of FPGA RAM",
        "author": "deltamac",
        "url": "https://www.reddit.com/r/ECE/comments/79nstg/question_of_fpga_ram/",
        "text": "Hello!\n\nI always have trouble trying to estimate the resources required by a microcontroller or FPGA. \n\nMy understanding of the internals of an FPGA is that there are finite slices, and those slices can be configured as several different useful building blocks. The FPGA is also spec'd to have so much RAM (some block, some distributed).\n\nIs block RAM hardwired? And is distributed RAM just slices that are used as lookup tables that behave like RAM?\n\nI guess my question is, if I used every bit of RAM available in the FPGA, does that mean there is nothing left for logic?",
        "created_utc": 1509371181,
        "upvote_ratio": ""
    },
    {
        "title": "How to get multiple arduino DAQ channels to send data to a PC with minimal cables?",
        "author": "thecolourorange",
        "url": "https://www.reddit.com/r/ECE/comments/79ndbw/how_to_get_multiple_arduino_daq_channels_to_send/",
        "text": "I'm an electrical engineering student currently on a work term looking for some help with a project.\n\nCurrently I am working on a data acquisition device attachment for an arduino. The arduino reads the data from an ADC and makes some adjustments to a DAC depending on the values it reads in. The data is then sent to a PC via USB. I am using PuTTY right now as the serial terminal. \n\nThe issue I am having is that my boss wants many many more measurement channels in the future. And I am not sure how I can do this. Is it possible for me to multiplex the serial data from multiple channels over a single USB cable?\n\nIf anyone has any advice on getting multiple microprocessors capable of transmitting data to a computer via a single USB that would be greatly appreciated. I also have some experience using raspberry pi if it's possible there could be a solution there.\n ",
        "created_utc": 1509366455,
        "upvote_ratio": ""
    },
    {
        "title": "Shoukd I skip Arduino and go straight into SMT32's?",
        "author": "Smahmd",
        "url": "https://www.reddit.com/r/ECE/comments/79n44a/shoukd_i_skip_arduino_and_go_straight_into_smt32s/",
        "text": "Hi so I'm an EE student and have never done any real projects. I want to start on a small project that can definitely be done with an Arduino or PI but I feel as though I should just jump into a non Arduino uC. I Say the SMT32's because I know there is a really good book on it by Geoffrey Brown. \n\nWhat do you guys think, is it wise to jump straight into the world of uC and if it is, is the SMT32 discovery board a good starting option?",
        "created_utc": 1509363260,
        "upvote_ratio": ""
    },
    {
        "title": "Amplifier problem?",
        "author": "PolakOfTheCentury",
        "url": "https://i.redd.it/5vt9i5ak6vuz.jpg",
        "text": "",
        "created_utc": 1509324306,
        "upvote_ratio": ""
    },
    {
        "title": "Engineering and job opportunities in cities vs suburbs.",
        "author": "muchadoaboutninjas",
        "url": "https://www.reddit.com/r/ECE/comments/79kb7v/engineering_and_job_opportunities_in_cities_vs/",
        "text": "My wife and I are from Houston. We recently relocated to a suburb/college town area so that my wife could attend medical school. I quit my job as a software engineer as part of the move and was planning on going back to school to finish my BSEE. I'd like to get into signal processing and embedded systems as I really enjoyed what I was exposed to in my old job and the job market seems fair if not good for those jobs.\n\nThe problem is that it seems like the vast majority of these high tech/electronic engineering job opportunities are in suburbs and I want to live in a city/urban area. My software engineering job had me traveling from the uptown area to a suburb everyday, and I spent one year in said suburb to escape the commute but I hated it. I don't want to commute and I don't want to live in the suburbs. I love engineering and want to continue my education/profession, but do not want to choose a profession that keeps me on the fringe of urban life until I retire. So give me the harsh truth, is there any hope of living and working in a city as an embedded/signals engineer?\n",
        "created_utc": 1509323265,
        "upvote_ratio": ""
    },
    {
        "title": "Engineering and living in the city",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/79k94w/engineering_and_living_in_the_city/",
        "text": "[deleted]",
        "created_utc": 1509322636,
        "upvote_ratio": ""
    },
    {
        "title": "Hello everyone, as a new online store, we are looking for new customers, so we are giving away 100 pcs of these amazing mechanical leather watches, for the price of 0$. Pay only shipping and get a new watch. We'd appreciate a honest review.",
        "author": "amalainter",
        "url": "http://watchez25.blogspot.com/2017/10/hello-everyone-as-new-online-store-we.html",
        "text": "",
        "created_utc": 1509315881,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone work at Xilinx here, looking for career levels/ladder for engineers?",
        "author": "eda2topnamejob",
        "url": "https://www.reddit.com/r/ECE/comments/79j8gp/anyone_work_at_xilinx_here_looking_for_career/",
        "text": "i'm currently considering a position at Xilinx but the career ladder/tier-levels for engineering position seem to be different than my previous experience, and it appears that i am not getting accurate info from the recruiter. For example, it's not clear how many different levels of principal or senior staff engineers (such as I, II etc.) at xilinx.\n\nCould someone who knows Tier/levels of different engineering/managing titles at Xilinx please post or message PM me?\n\nE.g. at Google it looks like this with Sr Fellow being the highest in technical ladder at L11.\n\nL3 : Software​ Engineer​ II\n\nL4 : Software​ Engineer​ III\n\nL5 : Senior Software​ Engineer\n\nL6 : Staff Software​ Engineer​\n\nL7 : Senior Staff Software​ Engineer​\n\nL8 : Principal Engineer​\n\nL9 : Distinguished Engineer​\n\nL10 : VP/Google Fellow\n\nL11 : Senior Google Fellow\n",
        "created_utc": 1509311981,
        "upvote_ratio": ""
    },
    {
        "title": "Need help deciding on final elective to take for ECE",
        "author": "siksniper1996",
        "url": "https://www.reddit.com/r/ECE/comments/79imgp/need_help_deciding_on_final_elective_to_take_for/",
        "text": "I'm about to pick classes for my final semester an school an am having trouble deciding between two electives that fit into my schedule. \n\nThe two classes are: TCP/IP, or DSP.\n\nElectives I've already taken are:\nControl Theory 1 and 2,\nCooperative Control Theory,\nC++ for embedded systems,\nReal-time operating systems\n\nWhich would be more beneficial to take. The professor teaching TCP/IP is an easy A, and the DSP professor goes super fast while teaching. Would it be worth it in the long run to take DSP over TCP/IP",
        "created_utc": 1509306171,
        "upvote_ratio": ""
    }
]