[
    {
        "title": "Crystal Drive Level?",
        "author": "reason78",
        "url": "https://www.reddit.com/r/ECE/comments/6ffjwc/crystal_drive_level/",
        "text": "I have created a simple two-port USB hub, using a common USB hub IC. Everything seems to work fine, but I am seeing spurious events where a downstream port is resetting and the device will not re-enumerate.  \n  \nGoing back through the IC datasheet, I found that the minimum drive level for the crystal is 600uW, and my device uses a crystal with a max drive level of 100uW.  \n  \nWhat kind of failures would you expect from a mismatched drive level for a crystal oscillator?  \n  \nWhat would be a good way to determine if this is related to the issues I am seeing?\n  \nEDIT: So it looks like  \n1) I may be slightly overdriving the crystal  \n2) My cap selection is wrong. What kind of effects would you expect from load caps which are too small? I accidentally used the CL of the crystal for my C1/C2 load caps. 12MHz/18pF crystal... so it probably needs ~30pF load caps, and I used 18pFs... :*(\n\n",
        "created_utc": 1496682706,
        "upvote_ratio": ""
    },
    {
        "title": "My 200th weekly Zynq blog - Zynq MPSoC PS, PL interface",
        "author": "adamt99",
        "url": "https://forums.xilinx.com/t5/Xcell-Daily-Blog/Adam-Taylor-s-MicroZed-Chronicles-Part-200-UltraZed-Edition-Part/ba-p/769618",
        "text": "",
        "created_utc": 1496681327,
        "upvote_ratio": ""
    },
    {
        "title": "How to make your own Satellite Internet communication card?",
        "author": "MajorSays",
        "url": "https://www.reddit.com/r/ECE/comments/6fcmhv/how_to_make_your_own_satellite_internet/",
        "text": "Hello awesome people of Reddit,\n\nI recently graduated from school and started a job at a startup based on cars. I have been assigned with the task of creating a \"Satellite Communications Card.\" I have no idea where to start and what to do. I have experience with PCB design and programming microcontrollers, but first I need to understand what I need and how I can accomplish this. I am really lost and would love for someone to give me advise on where to start. The PCB part is fine,and I can handle that, but first I need to create a working prototype,and then the PCB. I do not know how to create this working prototype or where to start. Any help is appreciated. I do not care how hard this is,or how long it takes. I am gonna put in the hours day and night and get it done, but I need guidance.\n\nI have until July 3rd to finish this work project. Any help is really appreciated. ",
        "created_utc": 1496645802,
        "upvote_ratio": ""
    },
    {
        "title": "History of Sizes of Hard Disk Drive - Tech",
        "author": "ManOfToys",
        "url": "https://youtu.be/W5-UP2sFm1k",
        "text": "",
        "created_utc": 1496634100,
        "upvote_ratio": ""
    },
    {
        "title": "The single worst attempt at making a PCB that I have ever seen",
        "author": "tocksin",
        "url": "http://imgur.com/gallery/i8MEXct",
        "text": "",
        "created_utc": 1496624501,
        "upvote_ratio": ""
    },
    {
        "title": "14 Wind Mills Lined up creating Amazing View, Nevada (Photo from 2013 Archive in Public Domain)",
        "author": "ielectricaleng",
        "url": "https://i.redd.it/rl2btqozlp1z.jpg",
        "text": "",
        "created_utc": 1496617386,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a way to test for continuity in a circuit with a multimeter that DOES NOT have a continuity function???",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6f8bli/is_there_a_way_to_test_for_continuity_in_a/",
        "text": "[deleted]",
        "created_utc": 1496594868,
        "upvote_ratio": ""
    },
    {
        "title": "About to enter college, looking for advice on electrical engineering.",
        "author": "Pharoh_Mina",
        "url": "https://www.reddit.com/r/ECE/comments/6f5ejt/about_to_enter_college_looking_for_advice_on/",
        "text": "I have two questions: 1) what is a good minor with electrical engineering? 2) What should I do during the next four years to have the best shot at landing a job and graduating? Any advice will be helpful, thank you!!\n\nEdit: What can I do over the summer to prepare?\n\nEdit2: Is cyber-security a good minor?",
        "created_utc": 1496547940,
        "upvote_ratio": ""
    },
    {
        "title": "Future of dc transmission: Get ready for a DC Future",
        "author": "ielectricaleng",
        "url": "http://www.tdworld.com/transmission/get-ready-dc-future",
        "text": "",
        "created_utc": 1496537839,
        "upvote_ratio": ""
    },
    {
        "title": "BM62 Bluetooth Module Won't Communicate",
        "author": "vcguitar",
        "url": "https://www.reddit.com/r/ECE/comments/6f4a88/bm62_bluetooth_module_wont_communicate/",
        "text": "Hi all....throwing a life vest on here and hoping anyone has any history with the Microchip BM62 Bluetooth module\n\nWe have been using it for our application for some time now but have been using a dev board and built our application around an ST micro communicating with an iPad via the BM62. Everything was working great until we spun our first board. The BM62 Powers up (we can pair with it) but won't ack or nack any UART communication with our micro. we can see the UART comm coming from our micro but the BM62 is radio silent.\n\nWe think there is an eeprom setting in the BM62 that we need to enable for it to start communicating via it's UART but we don't know how to modify the EEPROM of the module if we cant talk to it\n\nSo anyway...anyone out there run into any similar issues using this module and have any advice for where to start? TBH the datasheet for the BM62 has been less Than helpful with this problem.",
        "created_utc": 1496532962,
        "upvote_ratio": ""
    },
    {
        "title": "Startup salary expectations as a HW engineer?",
        "author": "hardwarethrowaway11",
        "url": "https://www.reddit.com/r/ECE/comments/6f42is/startup_salary_expectations_as_a_hw_engineer/",
        "text": "Hi,\n\nI'm about to receive an offer from a HW startup (they haven't sent me the official offer letter yet), and I don't know exactly how much to expect for a starting salary. I do expect that the salary should probably be less compared to if I went to a well-established company, but by how much? Are SW engineer salaries at startups a good point of reference?\n\nAbout me:\n\n*MS ECE graduate in May this year from a top-20 school (PhD dropout)\n\n*BS in ECE from the same top-20 school\n\n*Prior internships in HW validation, embedded systems at Big Hardware Companies\n\nAbout them:\n\n*Located in Silicon Valley\n\n*Roughly $10M series B funding\n\n*Less than 5 years old\n\n*No glassdoor page, unfortunately\n\nAny advice would be appreciated, thanks!",
        "created_utc": 1496530438,
        "upvote_ratio": ""
    },
    {
        "title": "PCB design that is free and very similar or cheaper than Altium",
        "author": "the_e_user",
        "url": "https://www.reddit.com/r/ECE/comments/6f3l5x/pcb_design_that_is_free_and_very_similar_or/",
        "text": "I wanted to know if that is an alternative type of PCB design that has a similar interface and design like Altium because the price is ridiculous",
        "created_utc": 1496524874,
        "upvote_ratio": ""
    },
    {
        "title": "Reasonable first FPGA project?",
        "author": "Myllokunmingia",
        "url": "https://www.reddit.com/r/ECE/comments/6f3bip/reasonable_first_fpga_project/",
        "text": "I'd like to learn Verilog and play with an FPGA and an opportunity to do so just came up. I'm looking for feedback on how feasible this would be as a small-medium scale personal project. \n\nA friend recently gave me two nice kinda old Sony 8Ω stand speakers. My TV only has a digital audio output. I'd like to use a small fpga to convert the signal. \n\n1. How feasible is this?\n\n2. Can anyone point me to a resource for or give advice on impedence matching for the 8Ω speakers? \n\n3. Any hardware suggestions are greatly appreciated. I can probably get an adapter for like $30-40 but I'm willing to spend a little more than that for a fun project and learning experience. Obviously I don't want to spend $300 on an fpga for this though. \n\nThanks all!\n\nEdit: Thanks for the responses. Sounds like the general consensus here is that it's a bit much for an introductory project or isn't really well suited to an FPGA. I've elected instead to buy an adapter and to start shopping around for hobbyist level FPGAs to begin another project. :)",
        "created_utc": 1496521727,
        "upvote_ratio": ""
    },
    {
        "title": "First internship, looking for some help learning Revit",
        "author": "DawsonHelms",
        "url": "https://www.reddit.com/r/ECE/comments/6f2q6q/first_internship_looking_for_some_help_learning/",
        "text": "So I landed my first internship this summer. I'll be going into my junior year in the fall. I'm working at a local firm that specializes in MEP work. The two primary program I'll be using are AutoCAD Design Master and Revit. \n\nI'm have used the Autodesk suite before so I'm familiar with how the programs are laid out and how they​operate. I did one of the guided tutorials on AutoCAD, and the help documentation is great, but for Revit I'm having trouble. \n\nDoes anyone have a good source to go to learn how to really do MEP work in Revit that isn't a paid class or subscription service? \n\nI have a short list of specific areas of struggle, but I left it at home, so I can post those in a bit if needed. ",
        "created_utc": 1496514883,
        "upvote_ratio": ""
    },
    {
        "title": "[Basic Circuitry] Is there a benefit to a higher/lower voltage power supply in the same circuit?",
        "author": "NorthboundFox",
        "url": "https://www.reddit.com/r/ECE/comments/6ey7jp/basic_circuitry_is_there_a_benefit_to_a/",
        "text": "Imagine 2 circuits: Just a battery, LED, and the appropriate resistor. In both circuits the LED is the same brightness, but in circuit A you have a 6v battery and in circuit B you have a 12v battery. \n\n**Does either circuit have any benefit over the other?** Does one last longer? Does the lower one just cost less to build and nothing else? Why would i want to use one over the other or does it not matter at all?",
        "created_utc": 1496448966,
        "upvote_ratio": ""
    },
    {
        "title": "I'm going into college and want to do semiconductors in the future, is there anything else I should focus on too.",
        "author": "someoneregular",
        "url": "https://www.reddit.com/r/ECE/comments/6exqse/im_going_into_college_and_want_to_do/",
        "text": "I heard about how quantum computing and light based computers can become a new thing, would i just learn it when it becomes normal or would i have to learn it in college or uni?\n",
        "created_utc": 1496443597,
        "upvote_ratio": ""
    },
    {
        "title": "Electrical Engineering, Computer Engineering, or Computer Science Engineering for AS?",
        "author": "inertial-observer",
        "url": "https://www.reddit.com/r/ECE/comments/6etbc4/electrical_engineering_computer_engineering_or/",
        "text": "I'm finishing up the first year of the pre-engineering program at my community college, and need to choose my AS major. I initially chose CS, but am wondering if one of the others would be a better choice since I plan to work after graduation rather than transfer to a university to complete a BS (because funding issues). \n\nMost of the classes are the same across the board for these majors, with two added for the EE which would mean I'd have to add a quarter to my program. \n\nWhich is going to be better for finding a career right out of school with only the AS?",
        "created_utc": 1496395440,
        "upvote_ratio": ""
    },
    {
        "title": "A programmable crosspoint switch for interfacing with a breadboard",
        "author": "[deleted]",
        "url": "https://hackaday.io/project/18755-the-metaboard",
        "text": "[deleted]",
        "created_utc": 1496388981,
        "upvote_ratio": ""
    },
    {
        "title": "How much IC engineers are needed to design an integrated circuit?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6erg2k/how_much_ic_engineers_are_needed_to_design_an/",
        "text": "[deleted]",
        "created_utc": 1496368027,
        "upvote_ratio": ""
    },
    {
        "title": "VHDL: Where is the latch in this code?",
        "author": "wefjao",
        "url": "https://www.reddit.com/r/ECE/comments/6emtqk/vhdl_where_is_the_latch_in_this_code/",
        "text": "Hi, /r/learnprogramming suggested I post here.\n\nI have a timer in VHDL, and when I try to synthesize I get, under the \"checking no_clock\" header, \"There are 32 register/latch pins with no clock driven by root clock pin:.../local_count_reg[X]/Q (HIGH)\" where X is 0-30. \n\nHere is the code. I don't see how there's a latch, but I think that's the problem. local_count is updated on rising edges of the clock, and count gets updated whenever local_count is.\n\n\n    library ieee; -- to use ieee.std_logic_1164 package\n    use ieee.std_logic_1164.all; -- to use std_ulogic and std_ulogic_vector types\n\n    entity timer is\n        generic(\n            freq:    positive range 1 to 1000 --;\n        );\n        port(\n            clk:      in  std_ulogic;\n            sresetn:  in  std_ulogic;\n            timer_rst: in std_ulogic;\n            count:    out natural --; range 0 to timeout - 1\n        );\n    end entity timer;\n\n    architecture arc of timer is\n        signal local_count: natural; -- range 0 to timeout - 1;\n    begin\n    process(clk)\n    \tvariable cnt1: natural range 0 to freq - 1;\n    begin\n    \n        --local_count &lt;= local_count;\n        if rising_edge(clk) then\n            if sresetn = '0' or timer_rst = '1'  then -- resets\n            \tlocal_count &lt;= 0;\n                cnt1 := freq - 1;\n            elsif cnt1 = 0 then\n                cnt1 := freq - 1;\n                local_count &lt;= local_count + 1;\n            else\n                cnt1 := cnt1 - 1;\n                local_count &lt;= local_count;\n            end if;\n        end if;\n    end process;\n\n    count &lt;= local_count;\n\n    end architecture arc;`\n",
        "created_utc": 1496324744,
        "upvote_ratio": ""
    },
    {
        "title": "Am I correctly visualizing the relationship between the time and frequency domain?",
        "author": "zebramints",
        "url": "http://imgur.com/a/8cn4K",
        "text": "",
        "created_utc": 1496307224,
        "upvote_ratio": ""
    },
    {
        "title": "[Discussion]Has anyone else found the Introduction to Quartus Prime/II (8 hour long video) to be boring as hell?",
        "author": "donbeleibmejuswatch",
        "url": "https://www.reddit.com/r/ECE/comments/6el95r/discussionhas_anyone_else_found_the_introduction/",
        "text": "Did you find it boring as fuck? Seriously the shorter videos combined with the pdf tutorials and Quartus Handbook was way faster for me to learn the tools and toolflow. I mean I remember not being able to finish that thing, it was so damn boring omfg. Anyone else think so?\n\nAlso what the fuck is with that pacing, jfc. 8 hours? I could have just worked with a toy design of my own creation and used literally every tool with an intro level of understanding in that time, without having to listen to that snoozefest. \n\nI wonder how the other side of the pond (xilinx) has it with Vivado.  ",
        "created_utc": 1496302842,
        "upvote_ratio": ""
    },
    {
        "title": "circuit that acts like an incandescent light bulb.",
        "author": "EngIntern",
        "url": "https://www.reddit.com/r/ECE/comments/6el5kz/circuit_that_acts_like_an_incandescent_light_bulb/",
        "text": "### Hi\n\n---\nI would love ideas on how I could make a circuit that acts like a small **i**ncandescent **l**ight **b**ulb (**ILB**) like [this one] (http://directshopping4u.com/WebRoot/Daily/Shops/eshop412004/4B58/2177/FCE1/F333/1E2E/C31A/5AE3/2131/12V_45W_BA20D.jpg) (directshopping4u.com). Something like 30V and 16W.\n\nI am going to try to change some ILB’s to LED lights, but the bulbs are being monitored as an ILB, so I need a circuit to simulate the LED’s as an ILB. I will make the new bulbs because of LED’s long lifespan, and I am aware that I will probably not be able to use much less power (if any), and instead will have to transfer the power to heat.\n\nI am still in the design phase of this project, so I won’t be too specific. *This is to not shoot down ideas before they are had.*\n\nI am looking to make a circuit for an LED light bulb, that acts like an ILB, this means:\n+ when the LED’s are supposed to emit light, and **are** emitting light, the circuit acts like a **working** ILB (Current flowing through some resistance). \n\n+ when the LED’s are supposed to emit light, but **are not** emitting light, the circuit acts like a **blown** ILB (Open circuit).\n\nI am currently only concentrating on the circuit for the ILB “simulation” and not the LED’s and the monitoring of the LED’s. The simulation circuit will have to act as specified, it will be powered by the approximately 30V that the light normally uses. It will sometimes be blinking (intervals of 1sec on and off), so there will be periods with no power. It will also sometimes be on for a long time, so a lot of power and heat that needs to be dissipated. \nThe monitoring only happens when there is power to the light. \n\nSome of the power will go to the LED’s and for some logic to check if the LED’s are emitting light, but most of the power will (unfortunately) probably have to be run through some element that will heat up, to put the energy somewhere. I can probably not get around this. In this project the interesting thing about the LED’s is their life span, so I will have to live with them wasting some power, as long as it isn’t more than what the ILB uses.\n\nI made a quick sketch on the idea [here]( http://imgur.com/UsDl4ak) (imgur.com). This mark-up has multiple problems (like the chip being hit with 30V when the switch is open) but it describes the idea.\n\nA quick note is that I am planning on using very reliable and high quality components, that should not break down too quickly.\n\n+ Anybody have ideas on what I should use to switch between the two states?\n\n+ Any pitfalls you can see, that I might run into?\n\n+ How I can make it reliable and durable?\n\n+ How I can ensure that the circuit never acts like a working light bulb when it is supposed to be a blown bulb?\n\n+ And literally any other thought about this, that springs to mind?\n\n---\n# Thank you.\n",
        "created_utc": 1496301208,
        "upvote_ratio": ""
    },
    {
        "title": "I made it guys!",
        "author": "GuitarGodGavin",
        "url": "https://www.reddit.com/r/ECE/comments/6ejg1q/i_made_it_guys/",
        "text": "I just recently graduated (computer engineer) and got a job at a very nice company. I didn't think I could do it, but somehow I pulled through. Long nights of studying and pulling all-nighters has finally paid off. \n\nHang in there guys, you got this too!\n\n\n:) ",
        "created_utc": 1496279693,
        "upvote_ratio": ""
    },
    {
        "title": "SDSoC platform for the 250 MSPS FMC 9467 and Zedboard",
        "author": "adamt99",
        "url": "https://forums.xilinx.com/t5/Xcell-Daily-Blog/Adam-Taylor-s-MicroZed-Chronicles-Part-199-The-AD9467-SDSOC/ba-p/768792",
        "text": "",
        "created_utc": 1496271079,
        "upvote_ratio": ""
    },
    {
        "title": "What's a good all in one screwdriver set that can open up almost any electronics? (X-post AskElectronics)",
        "author": "thxYukikaze",
        "url": "https://www.reddit.com/r/ECE/comments/6eilrx/whats_a_good_all_in_one_screwdriver_set_that_can/",
        "text": "So this might not really be an electronics question but as I was opening some electronics up for whatever reason, it always annoys me that I have to go get some/burrow screw drivers for those weird pentagram screw with a hole with a pin sticking out in the middle hole and things. It's really annoying every time I need to use one of those tiny garbage screw driver that comes with a fixing kit that breaks immediately and impossible to work with. I was wondering if you would know any good set that comes with most of the screw bits you'll ever need to open up electronics, thanks!!",
        "created_utc": 1496270759,
        "upvote_ratio": ""
    },
    {
        "title": "[Career Advice] Make the jump from electrical engineering to software development?",
        "author": "jrl5432",
        "url": "https://www.reddit.com/r/ECE/comments/6ei8w5/career_advice_make_the_jump_from_electrical/",
        "text": "Alright r/ECE, I've come to the classic problem of electrical - to switch to software or not. Right now I'm working as an electrical engineer in an industrial/manufacturing setting. I do most of the electronics work here (we are a small company) - from simulation, to design, prototyping, purchasing, testing and servicing. However, I've been offered a relatively lucrative job in software development; it would mean an almost 60% pay increase, but the work is pure software development. My question is this - would I be able to return to EE if I wanted to? This is the only job I've had and I'm worried that I wouldn't be able to come back once I've switched to software. Has anyone here been in a similar circumstance, or have advice on what the long-term career implications could be? Thanks in advance.\n\nTL;DR - EE switching to software for increased pay. Wondering if I would be forever stuck as a software dev or if I would be able to return to EE.",
        "created_utc": 1496267236,
        "upvote_ratio": ""
    },
    {
        "title": "Operating an IC with Decaying supply voltage",
        "author": "garylazereyes47",
        "url": "https://www.reddit.com/r/ECE/comments/6ei63s/operating_an_ic_with_decaying_supply_voltage/",
        "text": "I have a small question. I believe it should operate fine but say you are powering a comparator or op-amp with a decaying supply voltage.  As to say the source is a coin cell battery or another source that decays over time.  As long as the supply voltage stays within the operating range should it maintain stability?\n\nObviously for a comparator or op amp the output voltage swing would change but overall should the chip maintain its operation?",
        "created_utc": 1496266518,
        "upvote_ratio": ""
    },
    {
        "title": "Question about an example problem in textbook",
        "author": "eventhorizon51",
        "url": "https://www.reddit.com/r/ECE/comments/6egm63/question_about_an_example_problem_in_textbook/",
        "text": "[Here's an example from my text I don't quite get](http://i.imgur.com/XiIp9zL.jpg)\n\nIn particular, I don't see how the process for calculating V_BE works. V_CE and the resistances are easy enough as R_C is given and I_C can be calculated from beta and I_B.  Don't quite get how you calculate V_BE. I also don't get what \"exponential characteristic of D_B\" means. Can anyone explain how the problem works?\n\nFor reference, [here's the figure 6.5 the question refers to](http://i.imgur.com/s30yiLp.jpg)",
        "created_utc": 1496252738,
        "upvote_ratio": ""
    },
    {
        "title": "Am an electrical engineer... but jealous of electricians. What gives?",
        "author": "petitio_principii",
        "url": "https://www.reddit.com/r/ECE/comments/6efsyh/am_an_electrical_engineer_but_jealous_of/",
        "text": "I'm an EE with an advanced degree, good job, etc. Just bought a house and I feel like a fool having to call an electrician out. But sometimes an electrician's practical knowledge seems to surpass my advanced degree knowledge! It's frustrating and I want to remedy this. \n\nAny ideas? Anyone else ever felt that way?\n\n---\n\nEdit: I'm not jealous of the electrician job, just of the perceived practical knowledge!",
        "created_utc": 1496245582,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a better explanation of what firmware is?",
        "author": "NaesRemark",
        "url": "https://www.reddit.com/r/ECE/comments/6ef9r8/is_there_a_better_explanation_of_what_firmware_is/",
        "text": "I have trouble grasping the idea of what firmware actually is. It's embarrassing since I technically interned as a firmware engineer in the past. Hardware is easy to understand, as is software, but firmware is tricky to comprehend its usage. Common examples (from wikipedia) have things like TV remotes and traffic lights as applications which need firmware, but couldn't the same functionality be done using digital logic? Take the TV remote as an example, if I press a button, couldn't that trigger a specific logic signal which outputs the correct value of the button pressed?\n\nMaybe my question is silly, but any good resources which help to explain firmware better would be great. Thank you. ",
        "created_utc": 1496240599,
        "upvote_ratio": ""
    },
    {
        "title": "I start my placement on Monday. What should I take on my first day?",
        "author": "flegge",
        "url": "https://www.reddit.com/r/ECE/comments/6eeuer/i_start_my_placement_on_monday_what_should_i_take/",
        "text": "I'm starting my first placement on Monday (graduate level). What do you guys think is should take with me besides pen and paper? \n\nAlso any tips on how to make friends and fit in are appreciated. ",
        "created_utc": 1496236186,
        "upvote_ratio": ""
    },
    {
        "title": "Interpreted Verilog Benchmarks? Icarus vs Modelsim SE/PE? Fuck it, move to verilator?",
        "author": "donbeleibmejuswatch",
        "url": "https://www.reddit.com/r/ECE/comments/6eds7y/interpreted_verilog_benchmarks_icarus_vs_modelsim/",
        "text": "Has anyone compared to speed of icarus vs using the locked down/student edition version of Modelsim? I've been using Modelsim with Quartus for ages now, but I was wondering if it might be faster to use Icarus. Does anyone have any experience in the transition? Does the Icarus compiler benefit from multicore or overclocking? I'm using a few generations old Ivy Bridge - E six core at 3.8 ghz (not really that into OCing). Would there be marked improvements in Overclocking? Does core count even matter? Like would a single core high IPC system do better, like a modern skylake system vs my older IVYE? \n\nI'm pretty shit at doing decent design, so I just write some stupid tcl script and every moronic change I make is followed by up arrow + enter which just does the usual, save + compile + run testbench on optimized model + pull up the results or waves depending on what I have + pull up any flags from the design I'm monitoring. As you can imagine, it's slow as bananas after awhile since the same windows open and close and refresh. \n\nLike right now, I'm testing out adding this vector processing unit to this SoC I already have, so I'm running some egregiously shitty binary file consisting of some crap assembly I slopped together using an \"assembler\" I made in python (cough shitty parser cough) that's long as fuck to test out various scenarios. Naturally this takes a bonkers long amount of time between running the damn thing at whatever 1/10000th performance lock you get from Mentor since of course as a student I'm not coughing up the $4k for some shitty node locked non renewable 1 year license. Followed by Modelsim proceeding to shit its pants refreshing their half baked in Tkinter excuse of a gui they \"provide\". Maybe I should just go terminal this entire thing, but I like to imagine that in this century I don't have to work like I'm on some time shared mini terminal. Oops I dropped my punchcard, looks like I have to wait a few nights before whatever asshole is hogging the system to run his garbage fortran code lets me get in another turn. FFS Gui's have been around forever. \n\nOr should I just skip all this and make my testbenches outside of Verilog, so I can use verilator exclusively? Verilator seems fast as lightning apparently, but I've only run toy programs on it. \n\nI had similar questions about LTSpice and spice engines, but after reading it in the LT Spice IV book with Engleheart it seems like yeah spice totally does utilize compute resources which is pretty neato. ",
        "created_utc": 1496221833,
        "upvote_ratio": ""
    },
    {
        "title": "Advanced Electronic devices Vs 8086 microprocessor Vs virtual instrumentation, what should I select as the elective",
        "author": "gracefulbrainiac",
        "url": "https://www.reddit.com/r/ECE/comments/6ed5wt/advanced_electronic_devices_vs_8086/",
        "text": "I'm pursuing bachelor's in ECE. Can someone please give more details about the subjects mentioned above?",
        "created_utc": 1496211911,
        "upvote_ratio": ""
    },
    {
        "title": "Feasibility study of changing from LV to HV tariff considering a Pad-mounted substation.",
        "author": "Zrakk",
        "url": "https://www.reddit.com/r/ECE/comments/6ebvpp/feasibility_study_of_changing_from_lv_to_hv/",
        "text": "Hello everyone.\nI have to investigate this subject and in my native language there isn't as much information as it is in english so I was hoping if you could give me some \"keywords\" or concepts that are related to this topic in order to get a better understanding. \n\nThanks a lot!\n\n\nPS: This is NOT a homework request. I want to learn as much as I can but when I'm searching with my \"english electrical dictionary\" I just can't find what I want.",
        "created_utc": 1496195604,
        "upvote_ratio": ""
    },
    {
        "title": "Life and Career Advice (Cross-Posted in r/EngineeringStudents)",
        "author": "LuckyAsBeans",
        "url": "https://www.reddit.com/r/ECE/comments/6eagqk/life_and_career_advice_crossposted_in/",
        "text": "I'm not sure if there is a better section to go about this in. If there is, please let me know! \n\nSo last semester, the Spring of 2017, was supposed to be my last semester of my undergraduate studies in Electrical Engineering. Unfortunately I got in the way of myself... \n\nDepression hit me like a ton of bricks... I ended up not attending the majority of my classes or completely neglecting my responsibilities, assignments, quizzes, and exams. This resulted in me failing all 4 of my classes I was taking. I was able receive an incomplete grade from two of my professors, but the other two classes still ended up as 'F's. \n\nObviously, this has been a huge setback for me. It's an even bigger problem considering both of those classes are only offered during the Spring meaning it will be almost a full year before I can go back and get my degree. \n\nCurrently, I am living with my fiancée 14 hours away from where we attended school. She graduated a semester before me and received a full-time job in that city. So, my job options are even more limited. \n\nI am coming to Reddit for help because my school's counselor offered me no assistance with the questions I had. \n\nMy first question deals with engineering in general. I started out loving my choice to pursue a degree in Electrical Engineering, but during my junior and senior years I really soured on the idea. I realized the only aspects of Engineering I enjoyed (programming, automation, embedded systems, robotics) weren't really Electrical Engineering jobs. So, I decided to pick up some minors in Robotics and Computer Science my junior year. The further I got into those classes, though, I realized I was awful at programming and that I had a huge learning curve ahead of me. I did end up making my way through those classes, but the 'C's and 'D's I received really pulled my GPA down and made me feel like I wasn't cut out for those kind of jobs anyway. The place where my fiancée and I live offers very few jobs in the fields I am interested in, and the few that are available require high GPAs. It has always been my dream to work in sports industry,  and now I have also fallen in love with the craft beer industry. I also want to keep my options as open as possible as I am truly worried I may be miserable in an engineering job. So now I feel stuck. As to not ask an extremely general \"What should I do now?\" question, I will pose these questions. \n\n1.) Do you have any suggestions of how to go about a job search for what I am interested in? Is there good websites that will allow me to use keywords like programming, embedded, automation, robotics, etc. when searching for a job? Is there better words to use as keyword when doing a job search? Is there words I should look out for in job titles that would suggest they include a significant amount of one of the above keywords? \n2.) Is there any sort of Computer Engineering jobs in either the sports industry or the craft beer industry? If not, is there a way I can branch off from my degree and get my foot into one of those industries? What other sort of fields does an engineering degree translate well to?\n\nFinally, my resume isn't the greatest. I have only has 1 internship as a Software Engineer, my GPA is mediocre (around a 2.75), and I don't actually have a degree. So, since it will still be another year before I am able to finally finish my degree and another 6+ months before I can even go back to school... \n\n1.) Is it still possible to land an engineering job that would allow me to move up in the company once I receive my degree? Possibly an Engineering Technician job? \n2.) Should I look for companies offering internships in the area and let them know that I would be interested in full-time opportunities once I obtain my degree? \n3.) Are there other jobs that don't require a bachelors degree I should be on the look out for that would help me get my foot in the door of either the sports or craft beer industry? Something similar to my education background? \n4.) Is freelance programming a decent option to help myself make money while still building skills? Any websites to look into for that? What kind of freelancing would be best to help me build the appropriate skills for robotic/automation/embedded applications? ",
        "created_utc": 1496180805,
        "upvote_ratio": ""
    },
    {
        "title": "Where can I find a list of senior design project ideas in the field of computer engineering?",
        "author": "twintowersrubble",
        "url": "https://www.reddit.com/r/ECE/comments/6e9i1x/where_can_i_find_a_list_of_senior_design_project/",
        "text": "Thanks for your help",
        "created_utc": 1496171744,
        "upvote_ratio": ""
    },
    {
        "title": "250 MSPS with the Zynq and AD9467 FMC",
        "author": "adamt99",
        "url": "https://forums.xilinx.com/t5/Xcell-Daily-Blog/Adam-Taylor-s-MicroZed-Chronicles-Part-198-Building-the/ba-p/768456",
        "text": "",
        "created_utc": 1496171159,
        "upvote_ratio": ""
    },
    {
        "title": "A question from an mbed workshop I signed up for",
        "author": "cacklebolt",
        "url": "https://www.reddit.com/r/ECE/comments/6e8opi/a_question_from_an_mbed_workshop_i_signed_up_for/",
        "text": "My instructor was teaching me a basic blink program on the FRDM KL52Z board. \n\nWhile writing the breathe LED program after teaching us the concept of PWM, he put forth a question about how the delay time is decided.\n\nWe're incrementing the duty cycle value in a for loop, and using a delay of 100 ms after each iteration. What are the factors that could influence this delay time? What is the bottom limit on this delay time? \n\nPersonally, I think it is based on the clock time period and the LED turn-on time, whereby the delay needs to be sufficient enough for the LED to turn on and cross the junction barrier.",
        "created_utc": 1496164302,
        "upvote_ratio": ""
    },
    {
        "title": "How to use a Water Flow Sensor to send a message?",
        "author": "newexpat123",
        "url": "https://www.reddit.com/r/ECE/comments/6e52hf/how_to_use_a_water_flow_sensor_to_send_a_message/",
        "text": "Hey guys! I am working with the Water Flow Sensor FS300A and the Shield Sim900. I want that when the Water Flow measure reaches more than a 0 (when water passes) it sends a message. The problem is that I can connect both, but they cannot work together. I try connecting everything but only it can send the message if the message part is independent to the water flow sensor (and if it is before a water flow part). And if I change the code (without the message part), the thing can measure the water flow.\nPlease, help me! (Sorry for my English, It's my second language.)",
        "created_utc": 1496117229,
        "upvote_ratio": ""
    },
    {
        "title": "Any good chips for monitoring LED's?",
        "author": "EngIntern",
        "url": "https://www.reddit.com/r/ECE/comments/6e0qku/any_good_chips_for_monitoring_leds/",
        "text": "##Hi!\n\nDoes someone have experience with highly reliable chips, for monitoring if a bunch of LED's are on?\n\n###Thank you.",
        "created_utc": 1496070271,
        "upvote_ratio": ""
    },
    {
        "title": "What are the standards symbols for blueprint electrical projects?",
        "author": "gu21n",
        "url": "https://www.reddit.com/r/ECE/comments/6e0bib/what_are_the_standards_symbols_for_blueprint/",
        "text": "Hi everyone. Here in Brazil the ABNT 5444 (Low voltage electrical symbols standards:http://ftp.demec.ufpr.br/disciplinas/TM249/Material%20de%20aula/NBR_5444-1989_Simbolos_Graficos_para_Instalacoes_Prediais.pdf) was canceled. They said its too old, and the IEC60417 and IEC60617 standards are the most used ones nowadays. So my question is, what are the \"standards symbols\" most used today in america/europe? ",
        "created_utc": 1496065142,
        "upvote_ratio": ""
    },
    {
        "title": "Thevenin/Norton Equivalent",
        "author": "DerathOP",
        "url": "https://www.reddit.com/r/ECE/comments/6e0a15/theveninnorton_equivalent/",
        "text": "Could someone please explain step by step how to solve this example with the Thevenin and Norton Equivalent?\nhttp://imgur.com/a/Ia1bs",
        "created_utc": 1496064610,
        "upvote_ratio": ""
    },
    {
        "title": "Why STM32 IDEs are sooooo poor?",
        "author": "424778940",
        "url": "https://www.reddit.com/r/ECE/comments/6dyouo/why_stm32_ides_are_sooooo_poor/",
        "text": "I got my stm32 board recently, and become very exciting to try it.\n\nBut when I setting up development environment, it just make me sad.\n\n\nFor STM32 there is no official IDE, I have to chose between third party IDEs.\nHowever, they either asking for hundreds of dollars, or not fully works, or looks they are developed for windows 3.1, or just all of above.\n\n\nFew IDEs are based on eclipse, but all of them even not support my STM32F7 board from ST it's self. WTH???\n\n\nFor the MDK (Keil), yes, everything is works, but the GUI is just terrible, I don't mind it looks ugly but at least it should provide a theme feature or able to switch to darker color other than black and white.\nAfter half hour coding, I look to the wall and also be able to see my code there (AFK debug feature? lol).\nIn recent version they finally supported auto completion, but it just works some time.\n\n\nFor VS2017+VisualGDB, VS2017 is great but VisualGDB only can compile and download, when I lunch debug VS says fail to attach gdb.\n\n\nCurrently, I write Makefile manually and managed to make it work, but I don't thing this whole pain is the a** experience is reasonable in 2017.\n\n\nBefore, I was using Atmel AVRs with their Atmel Studio, everything just works without any issue and not extra configuration required.\n\nEven for Microchip PICs, the MPLAB-X only works sometime, but at least I can get the job done without make me blind and don't asking for hundreds of dollars.\n\nBTW, Is there a better solution available?",
        "created_utc": 1496038824,
        "upvote_ratio": ""
    },
    {
        "title": "About to start my first internship, looking for advice/what to expect",
        "author": "Belade",
        "url": "https://www.reddit.com/r/ECE/comments/6dww4x/about_to_start_my_first_internship_looking_for/",
        "text": "I just finished my third year of college, I've had about 3 semesters now of pretty dedicated coursework. I'm going to be interning in the systems protection group at a natural gas/electricity company. I'm wondering if you guys have any idea on what I should be expecting and/or any course material I should maybe review to be most prepared. ",
        "created_utc": 1496014123,
        "upvote_ratio": ""
    },
    {
        "title": "About to head to Rutgers to start my first year of college as an ECE major (Computer Engineering), what should I do over the summer to prepare myself?",
        "author": "Alushi99",
        "url": "https://www.reddit.com/r/ECE/comments/6dwkxm/about_to_head_to_rutgers_to_start_my_first_year/",
        "text": "By this I mean is there any material that I should definitely be looking over and what sort of things are best to be proficient at before heading into college for my freshman year. Thanks :)",
        "created_utc": 1496010315,
        "upvote_ratio": ""
    },
    {
        "title": "Whats maths are involved in EE ?",
        "author": "SmallRedMachine",
        "url": "https://www.reddit.com/r/ECE/comments/6dwgvl/whats_maths_are_involved_in_ee/",
        "text": "Hi, I'm a mature student going to Uni this year, I did an access course last year but couldn't start the uni after it so there has been like a year gap since then, now I have an A Level maths book in front of me for revision and I have forgotten a lot of things again and this book is like over 500 pages and honestly I just can't go through everything in the book again, might have done it five years ago but not now.\n\n\nNow what I want to do is to ignore the stuff that won't bother me in EE and just concentrate on what matters, I know there will be Trig, Differentiation and Calculus and I like them, what els is there that I need to work on ? \n\n\nFor clarification I do like maths but what's bothering me is the volume of informations that I have to take in and I just can't do that anymore, so I find the thought of working on some of the subjects a lot more appealing.",
        "created_utc": 1496008957,
        "upvote_ratio": ""
    },
    {
        "title": "My 4-bit electronic binary calculator using transistors and how I came about building it",
        "author": "oberhamsi",
        "url": "https://nekapuzer.at/4bit-adder/",
        "text": "",
        "created_utc": 1495965330,
        "upvote_ratio": ""
    },
    {
        "title": "AutoCAD",
        "author": "mahendhiranmahe770",
        "url": "https://youtu.be/SuAO4ukB5cE",
        "text": "",
        "created_utc": 1495943757,
        "upvote_ratio": ""
    },
    {
        "title": "Microprocessor Design for a Computer Engineer",
        "author": "MushinZero",
        "url": "https://www.reddit.com/r/ECE/comments/6dpup1/microprocessor_design_for_a_computer_engineer/",
        "text": "Hey guys, I am currently a Junior studying a degree in Computer Engineering. Currently I have a plan A in which I would like to go into the field of Microprocessor Design. My dream job when I graduate would be to work at Intel. I understand that this is a highly competitive field (and that I will more than likely need a Masters degree) so I am tempering my expectations but in the pursuit of my goal I would like to ask if you could help me make a list in what can I do as an Undergraduate to best prepare myself to go into that field?\n\nMy current thoughts are to focus on Verilog programming but I'd like to expand that and see what your opinions are. I am a competent C, Assembly, and Python programmer.\n\nMy plan B is Embedded System Design but I'd like to best prepare myself for plan A at the moment.\n\nThank you for your time.",
        "created_utc": 1495917194,
        "upvote_ratio": ""
    },
    {
        "title": "Jobs in sensor or semiconductor engineering as a computer engineer",
        "author": "ForTamriel",
        "url": "https://www.reddit.com/r/ECE/comments/6do0vw/jobs_in_sensor_or_semiconductor_engineering_as_a/",
        "text": "I am currently finishing up my first year as a computer engineer in college.  I am starting to think what jobs I find interesting and 2 of the big ones I can think of are engineering sensors or semiconductors.  What I am wondering is if there is still a job market in this fields and how to best get into them?  I get to do 5 co-ops so I'm hoping to use those to get into the field. \n\nIf those 2 fields are dead I should wondering what else I could get into.  I like the idea of creating a physical product that isn't software.  I dislike the idea of laying out house circuits or power systems though because I want to create some kind of unique product that fufills a purpose. ",
        "created_utc": 1495896047,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a computer engineer/hacker/programmer",
        "author": "ZetaXeABeta",
        "url": "https://www.reddit.com/r/ECE/comments/6dnulk/looking_for_a_computer_engineerhackerprogrammer/",
        "text": "Looking for someone who can develop robust pcbs, knows electronic components and can rapidly prototype.",
        "created_utc": 1495893857,
        "upvote_ratio": ""
    },
    {
        "title": "Which minor should I join in Electrical? Power, Electronics, Telecom or Computer?",
        "author": "ielectricaleng",
        "url": "https://www.reddit.com/r/ECE/comments/6dnbd0/which_minor_should_i_join_in_electrical_power/",
        "text": "",
        "created_utc": 1495886095,
        "upvote_ratio": ""
    },
    {
        "title": "Zynq MPSoC RPU OPerating modes, Performance or Lock Step",
        "author": "adamt99",
        "url": "https://forums.xilinx.com/t5/Xcell-Daily-Blog/Adam-Taylor-s-MicroZed-Chronicles-Part-197-UltraZed-Edition-Part/ba-p/767924",
        "text": "",
        "created_utc": 1495871697,
        "upvote_ratio": ""
    },
    {
        "title": "What's the future for the following fields of study?",
        "author": "DeadlyXyston",
        "url": "https://www.reddit.com/r/ECE/comments/6dlad4/whats_the_future_for_the_following_fields_of_study/",
        "text": "I know software engineering is currently big and a safe way to go but how are embedded systems/computer architecture and integrated circuits/electronics? (In terms of job market and job security, as well as what do engineers in these fields do on a day to day basis)",
        "created_utc": 1495851818,
        "upvote_ratio": ""
    },
    {
        "title": "Late start",
        "author": "schmoe222",
        "url": "https://www.reddit.com/r/ECE/comments/6dk8v8/late_start/",
        "text": "Hey everyone - so, as the title suggests, I'm looking to get into the ECE world a bit late. Basically, I've already got an AA and BM in Music, and I'm looking to transition. Big change, I know.\n\nFor a bit of background: this is not about the career prospects in music. I really like it, and, to be honest, I could certainly make a career out of it (I do soundtracks professionally and co-run a new music group around town). It's just that I spend the majority of my time programming, designing circuits, reading up on math and physics, and looking through ECE-related research papers. I've always been into this stuff, but I just assumed I'd do it for a hobby / to augment my music (through my own projects). Also, if it matters, I'm a very serious student. I graduated high school early and was top of my class both times in university.\n\nAs for why I'm switching now (and why I didn't transfer before I finished my BM): my dad was diagnosed with terminal brain cancer in 2015 and, as my parents' only son, I spent a lot of time taking care of him, spending time with him, and managing his medical appointments. It goes without saying that it took priority over anything related to myself. When he died last October, I decided to skip grad-school apps and focus on finishing up my degree. Now I've got a gap year to decide what comes next.\n\nAs I see it, I have a few options. I could:\n\n1) Apply to music tech programs like those at McGill, Carnegie Mellon, and Georgia Tech. This would combine most of the knowledge I have. Downside is they're looking for engineers who like music; not musicians who like engineering. It'd probably be difficult to get into one of these.\n\n2) Apply to late entry engineering programs (like LEAP at BU). The problem? I don't know many of these, and I've heard it's not all that great to have a M.S. in the subject if you don't already have a degree that's ABET accredited.\n\n3) Apply to M.S. programs in C.S. This seems like it'd be pretty doable for me (though, of course, I'd probably have to settle for a lower-tier school with my lack of a science-based bachelor's). I've heard that a M.S. in C.S. isn't all that helpful,  though, and that employers would much rather see a B.S.\n\n4) Do another bachelor's degree. Since I graduated from a conservatory (which only teaches music), I'd have to restart everything. I would only be able to justify this with a full ride, which I'd doubt I'd get in my situation (at least, in music, you're getting up there if you start a bachelor's at 22).\n\n5) Try to network and find a way into a low-level position at a company that's sympathetic to my situation. Again, since I went to a conservatory, I've only been exposed to other musicians. And I have no job experience in the area in addition to my lack of formal education. I'm not sure where I'd start with this, but I'd certainly be up for trying something.\n\nI'm rarely in contact with anyone who does this stuff, so advice would be greatly appreciated! School recommendations, degree recommendations, discouragement, encouragement, you name it.",
        "created_utc": 1495838966,
        "upvote_ratio": ""
    },
    {
        "title": "Strange exam question on Sliding Window efficiency.",
        "author": "qzomwxin",
        "url": "https://www.reddit.com/r/ECE/comments/6djrq1/strange_exam_question_on_sliding_window_efficiency/",
        "text": "So I just sat my Telecommunications exam (yay), but there was a strange question. \n\nDuplex link between A and B with following parameters:\n\n* Sliding Window, W = 12\n* Go-back-N\n\n* Distance, D = 100 km\n\n* Propagation velocity, V = 2\\*10^8 m/s\n\n* Frame size: 1000 bits\n\n* Datarate: 100 Mbps\n\nQuestion: Calculate the BER such that the efficiency is 50%.\n\nAnswer:\n\ntprop = D/V = 5\\*10^-4\n\ntframe = 1000/100\\*10^6 = 1\\*10^-5\n\na = tprop/tframe = 50\n\nerror free efficiency u = W/(2a + 1) as W&lt;2a+1\n\nu = 12/(2x50 + 1) = 0.1188\n\nThe above is for error free. The efficiency can't increase beyond that without changing other parameters can it?\n\nWith errors, divide u by N_r where N_r = (KP-P+1)/(1-P), which can never be less than one, hence, intuitively, u cannot get any higher than ~12%.\n\nI don't have the question but I saved the numbers to my calculator so I know they are correct. \n\nHave I gone wrong somewhere? Completely misunderstood something? ",
        "created_utc": 1495833662,
        "upvote_ratio": ""
    },
    {
        "title": "Simulink vs. Powersim vs. ???",
        "author": "Wrydogg",
        "url": "https://www.reddit.com/r/ECE/comments/6diwid/simulink_vs_powersim_vs/",
        "text": "Both Simulink and Psim have available a module/addon that allows one to build a model and then program that directly into a TI microcontroller (F2806x). Matlab/Simulink does it through their Embedded Coder addon while Psim does it through their Simcoder package. \n\nAre there other options than these two for programming the microcontroller with auto-generated code? These are quite expensive and I can't get Embedded Coder with a student license.\n\nThanks!",
        "created_utc": 1495824666,
        "upvote_ratio": ""
    },
    {
        "title": "Considering concentrating in communications for my EE degree. Would like to know more about the industry and its future",
        "author": "terminus1256",
        "url": "https://www.reddit.com/r/ECE/comments/6dhf9k/considering_concentrating_in_communications_for/",
        "text": "Hello All,\n\nI am a rising junior in ECE that is considering concentrating my degree in communications. I am interested in RF, communications hardware, and network design/techniques.\n\nTo that effect, I was fortunate to land an internship this summer at a large telecom company. I am currently working in a networking test lab; I am learning about the design of networks with switches, routers, fiber optics/copper transmission, OSI model and protocols, etc. The lab primarily is used for proof of concept/feasibility stuff for business the company is trying to win. For example, Apple recently had a contract out for networking services that the company bid on, and the test lab had to analyze the requirements and run simulations/construct automated tests to on their huge testbed to prove they could meet the design requirements.\n\nI am learning a lot and am very interested in it, leading me to consider communications as my concentration. However, I have a few concerns that are holding me up from the concentration.\n\nIt seems like the skillset of network engineering (design, testing, maintenance, etc.) does not really warrant an ECE degree. I am familiar with many people who work in networking that don't have degrees, getting certificates in CCNA/JNCIE and the like and breaking into the industry that way. Please note that I am not trying to denigrate this approach or those who take it! I just am really interested in attaining a career that really uses all of the skills I am learning.\n\nIt seems like ECE is overkill for working in networking, or for telecom networks in general (with the exception of hardware design/software)? Is it different for the core network engineering jobs, or is it the same? What value/positions would an ECE degree be a prerequisite/advantage for within the industry?\n\nI am also interested in how this career will be affected by software defined networking. Will the more hardware based jobs become obsolete?\n\nI hope my question makes sense. Thank you in advance for any insight or advice.",
        "created_utc": 1495810376,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to find the right transformer",
        "author": "Bozhe",
        "url": "https://www.reddit.com/r/ECE/comments/6dh6fb/trying_to_find_the_right_transformer/",
        "text": "I need 30 kV at 50 and 60 Hz. Very low amperage, maybe 10-30 mA. I have two neon sign transformers, but they max out at 15 kV. I am thinking of driving both of them with a center tapped transformer, so I've got the 30 kV between the outputs. The center tapped will get input from a variac to slowly ramp the voltage.  \n  \nTried it with two transformers we had here. One was a 1:1, and didn't work. At max output from the variac, didn't come close to 30 kV. Had another 4:1 that was at around 9 kV with 25% variac output, but then started buzzing pretty badly.   \n  \nI'm trying to find another center tapped transformer to use instead. I don't have experience speccing things like this, and am not willing to build it myself. ",
        "created_utc": 1495807854,
        "upvote_ratio": ""
    },
    {
        "title": "Best way to store metadata for image processing?",
        "author": "Jurunas",
        "url": "https://www.reddit.com/r/ECE/comments/6deh3j/best_way_to_store_metadata_for_image_processing/",
        "text": "So, I am trying to use the super-resolution algorithm in [this article](https://papers.nips.cc/paper/2315-bayesian-image-super-resolution.pdf) for a python project. Basically, this method can reconstruct a good image from a set of degraded ones (e.g. frames of a video from a surveillance camera).\n\nIn order to test the algorithm, I will need to generate several degraded images from a good one using the generative model. Basically it shifts, blurs, and rotate the image to given values.\n\nSo it would be useful to me to store some data with those images, such as rotation angle or shift. I will have to compare the stored values with the ones estimated in the restoration process itself.\n\nThe only requirement is that I need to store both image and metadata on disk. I am open to all kind of ideas.",
        "created_utc": 1495768794,
        "upvote_ratio": ""
    },
    {
        "title": "Measuring Floating LV transformer output Differentially",
        "author": "MrStratPants",
        "url": "https://www.reddit.com/r/ECE/comments/6ddyo8/measuring_floating_lv_transformer_output/",
        "text": "Hey guys, say a transformer secondary is floating, outputs roughly 2Vrms. I want to measure with a diff amp and make it single ended. \n\nI am reading conflicting info about doing this. Some papers I am reading are saying you can use a IN amp to measure differentially, but need DC bias return path resistors from the +/- inputs to the amplifier ground. \n\nSome are saying that the transformer secondary needs to be grounded to the measuring system and thing single ended measured.\n\nIn my scenario, I am tapping into an exising system, and so I want a high impedance input to measure this with. I figure the IN amp would work, but am worried the ~50k-100k bias resistors would alter the high impedance I am looking for. \n\nIs 100k considered high impedance  compared to the 300ohm transformer? Otherwise I was thinking to put two additional buffers on the transformer lines before the IN amp to preserve the high Z input, but am not sure if the buffers would then need dc bias resistors.\n\nAnyone have any advice or sources that might be beneficial to read up on?",
        "created_utc": 1495762446,
        "upvote_ratio": ""
    },
    {
        "title": "GaTech vs UW Madison for CE and CS",
        "author": "RottenCurry",
        "url": "https://www.reddit.com/r/ECE/comments/6dcy86/gatech_vs_uw_madison_for_ce_and_cs/",
        "text": "Sorry if this isn't a good place to ask, but I'm hoping I can get some answers. I'll be a sophomore undergrad at UW Madison in the fall and I have the option of transferring to GT for Computer Engineering. Every time I tell myself not to leave all the great stuff at Madison (friends, girlfriend, GPA, not to mention class credit that may not 100% transfer to GT), I start to think about how maybe going to GT would be the better option. Both are great engineering schools, with me thinking GT is more highly respected but I don't know how true that is. I assume getting a job at either school wouldn't differ so much with Madison being pretty great for Co-ops and internships. Any opinions on major differences between GT and Madison? Major benefits of going to GT? Any alumni from GT/Madison that can offer me any advice? I'm having a really hard time making a decision so any answers will help. Thanks!",
        "created_utc": 1495751031,
        "upvote_ratio": ""
    },
    {
        "title": "A Note Taking Web App for Engineers: snippets, links, todos and notes on steroids.",
        "author": "sandcrain",
        "url": "http://codeowl.io",
        "text": "",
        "created_utc": 1495739440,
        "upvote_ratio": ""
    },
    {
        "title": "PIC32 USB Host",
        "author": "Ridaros",
        "url": "https://www.reddit.com/r/ECE/comments/6d8mk4/pic32_usb_host/",
        "text": "Hi guys,\n\nI'm trying to achieve a barcode scanner to work with a PIC32 over USB. \n\nThe PIC also needs to facilitate a USB Mass Storage device as well. I've loaded the USB example code provides by Microchip, but it seems almost like it is written in object oriented, there are so many levels and files that it is rather difficult to understand.\n\nCan anyone recommend a starting point for a beginner Embedded Engineer to start?\n\nThanks",
        "created_utc": 1495705791,
        "upvote_ratio": ""
    },
    {
        "title": "Career/focus Question",
        "author": "yahskapar",
        "url": "https://www.reddit.com/r/ECE/comments/6d78o4/careerfocus_question/",
        "text": "I've recently been given the opportunity to do an internship at a very large, multinational power and robotics company, albeit more on the cyber security side of things and in the realm of networking (in relation to grid solutions). Although I may be way ahead of myself here, I've already begun thinking how I can really apply to this to my overall career goals (which were leaning towards firmware-level security). I find the job by itself very interesting, but want to plan to dig a bit deeper.\n\nDo you folks have any advice on what topics may be of particular interest to me, and that I may be blissfully unaware of at this point? I've taken a look at some courses offered at my university and some similar opportunities at other companies only to be met with, quite frankly, too much information to really digest (network security, autonomous systems security, various other courses that more or less deal with networking). Is digging into something like cyber security, security compliance, and things of that sort particularly useful for someone who eventually wants to have a taste of firmware engineering?\n\nThanks for any and all advice.\n\nEDIT: I should note that I'm aware of the existence of the search function and have used it already to find a bit more about firmware engineering in particular. I'm trying to get a better picture now of things like firmware security compliance, what firmware security might involve aside from smart programming, and so on.",
        "created_utc": 1495684156,
        "upvote_ratio": ""
    },
    {
        "title": "Trig Fourier Series Coefficients and scaling factors: I don't understand why this scaling factor is what it is.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6d6wum/trig_fourier_series_coefficients_and_scaling/",
        "text": "[deleted]",
        "created_utc": 1495680075,
        "upvote_ratio": ""
    },
    {
        "title": "How useful would this be for electronic circuit manufacturing and repair: Cytosurge FluidFM µ3Dprinter is world’s first sub-micron metal 3D printer",
        "author": "herkato5",
        "url": "http://diy3dprinting.blogspot.com/2017/05/cytosurge-fluidfm-3dprinter-is-worlds.html",
        "text": "",
        "created_utc": 1495669379,
        "upvote_ratio": ""
    },
    {
        "title": "Researchers develop transistors that can switch between two stable energy states",
        "author": "Chipdoc",
        "url": "https://news.illinois.edu/blog/view/6367/498047",
        "text": "",
        "created_utc": 1495653268,
        "upvote_ratio": ""
    },
    {
        "title": "So, someone told me that in a real-world scenario, current sources aren't actually real.",
        "author": "CompEStudent",
        "url": "https://www.reddit.com/r/ECE/comments/6d42di/so_someone_told_me_that_in_a_realworld_scenario/",
        "text": "Can someone tell me if this is true and maybe describe the theory behind it too?",
        "created_utc": 1495650938,
        "upvote_ratio": ""
    },
    {
        "title": "Cute love quotes",
        "author": "mahendhiranmahe770",
        "url": "https://youtu.be/jbxEIAsFsVg",
        "text": "",
        "created_utc": 1495645751,
        "upvote_ratio": ""
    },
    {
        "title": "Project Question: Driving a Quiet Motor / Linear Actuator",
        "author": "Bigelownage",
        "url": "https://www.reddit.com/r/ECE/comments/6d2a0y/project_question_driving_a_quiet_motor_linear/",
        "text": "Hi, I'm hoping this is the correct place to ask this.\n\nI'm trying to figure out how move a table back and forth with a quiet motor / linear actuator setup. I'd essentially like to have an actuator with an arm under the table that extends and retracts to shift the top of the table. \n\nI have drawn a [shitty MS paint picture](http://i.imgur.com/xiGSUcF.png) to show you guys what I mean. \n\nProblem is, this thing needs to operate quietly enough that it won't sound annoying in a quiet office or home room setting. Also, while I have experience with Arduino and some custom PCB design in EAGLE, I've never really worked with motors or actuators before. I found this [Arduino Motor Shield](https://www.adafruit.com/product/1438) seems like it'd be helpful, but I'm not sure if I'd have to custom build the actuator arm or if I can just pop a motor into something I can buy online. I'm thinking controlling with Arduino would be pretty easy, just hooking up the digital outputs to transistors that control the motor to go forwards or backwards. \n\nOr, if there's an easier way to move a table back and forth quietly, that'd be cool too.",
        "created_utc": 1495634222,
        "upvote_ratio": ""
    },
    {
        "title": "Urgent help for our graphic equalizer project",
        "author": "flickerbone",
        "url": "https://www.reddit.com/r/ECE/comments/6d1ow3/urgent_help_for_our_graphic_equalizer_project/",
        "text": "We're currently noobs taking basic electronics and we are to build a 5-band graphic equalizer for our amplifier. The schematic (including half-supply Vcc/2 circuit) and the components has been given. What capacitor voltage rating are we supposed to use,we're just using a 5V Vcc. Thanks for the help!\nhttp://www.ti.com/lit/an/slyt134/slyt134.pdf\n",
        "created_utc": 1495627440,
        "upvote_ratio": ""
    },
    {
        "title": "Wärtsilä is looking for a Chief Project Engineer, Electrical",
        "author": "AgnesMagnusson",
        "url": "https://www.reddit.com/r/ECE/comments/6d1e9p/wärtsilä_is_looking_for_a_chief_project_engineer/",
        "text": "[removed]",
        "created_utc": 1495623369,
        "upvote_ratio": ""
    },
    {
        "title": "Wärtsilä is hiring a Chief Project Engineer, Electrical",
        "author": "btbsilent",
        "url": "https://www.reddit.com/r/ECE/comments/6d1e2d/wärtsilä_is_hiring_a_chief_project_engineer/",
        "text": "[removed]",
        "created_utc": 1495623285,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone help me understand, what is \"network engineering\"?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6czl8t/can_someone_help_me_understand_what_is_network/",
        "text": "[deleted]",
        "created_utc": 1495595519,
        "upvote_ratio": ""
    },
    {
        "title": "mm wave Antenna for radar in space",
        "author": "kennyyee",
        "url": "https://www.reddit.com/r/ECE/comments/6cy36w/mm_wave_antenna_for_radar_in_space/",
        "text": "For my school project we are trying to make a radar in a cubesat that can detect mm sized space debris. We are trying to come up with a  rough estimate of how far the radar signal will travel using https://www.pasternack.com/t-calculator-radar-range.aspx this site. But we are unsure of the typical values of output power and minimum detectable signal. Does anyone have any idea of what roughly those values will be (just order of magnitude)? When we tried to calculate with equations from google it's always off by magnitudes",
        "created_utc": 1495578874,
        "upvote_ratio": ""
    },
    {
        "title": "Just discovered Sparkfun 3D viewer has \"Banana for scale\" option",
        "author": "hardwareweenie",
        "url": "http://imgur.com/a/7Nt4t",
        "text": "",
        "created_utc": 1495575041,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any open-source programs that can view Eagle files?",
        "author": "panicattackk",
        "url": "https://www.reddit.com/r/ECE/comments/6cu6a4/are_there_any_opensource_programs_that_can_view/",
        "text": "I received a file from a customer, but I can't get the free version of Eagle to run on my computer. Are there any open-source programs that I can use to view the schematic? I don't need to edit anything. \n\nedit: Thanks for the responses. I found a solution [here](http://3dbrdviewer.cytec.bg)",
        "created_utc": 1495540536,
        "upvote_ratio": ""
    },
    {
        "title": "BAE Systems is recruiting a Test Engineering Technician in Rochester, UK",
        "author": "AgnesMagnusson",
        "url": "https://express.candarine.com/campaign/url/forward/0202b387a633",
        "text": "",
        "created_utc": 1495475542,
        "upvote_ratio": ""
    },
    {
        "title": "Transfer source code to Microcontroller",
        "author": "RicoSuav",
        "url": "https://www.reddit.com/r/ECE/comments/6coom5/transfer_source_code_to_microcontroller/",
        "text": "Hi all, I'm not sure if this is for this community, if it's not then please, if you can, lead me to the correct area. \n\nHow can I transfer my completed Python code to a microcontroller? Is there any other coding I need to learn? I just completed a proof of concept for a IoT device and am wanting to move forward to production. I want to transfer the source code I used in the Arduino project to a micro controller; however, this is the extent of my knowledge. The code is written in Python and I intend to use the intel Curie mcu but open to use more user friendly devices. ",
        "created_utc": 1495474117,
        "upvote_ratio": ""
    },
    {
        "title": "SDSoC removing the need to be a HDL specialist to leverage the Zynq and Zynq MPSoC Logic",
        "author": "adamt99",
        "url": "https://forums.xilinx.com/t5/Xcell-Daily-Blog/Adam-Taylor-s-MicroZed-Chronicles-Part-196-SDSoC-and-Levels-of/ba-p/766970",
        "text": "",
        "created_utc": 1495472736,
        "upvote_ratio": ""
    },
    {
        "title": "Need good circuit software w/ Arduino support",
        "author": "Grespino",
        "url": "https://www.reddit.com/r/ECE/comments/6cnhli/need_good_circuit_software_w_arduino_support/",
        "text": "",
        "created_utc": 1495462523,
        "upvote_ratio": ""
    },
    {
        "title": "Help needed in sourcing motors for precise linear actuation",
        "author": "pash1987",
        "url": "https://www.reddit.com/r/ECE/comments/6cmdfv/help_needed_in_sourcing_motors_for_precise_linear/",
        "text": "I'm trying to find a miniature motor that can be controlled electronically to drive a screw in a linear motion.    \nI require the motor to be **housed within a cylindrical tube of inner diameter = 7mm, and depth = 15mm.** The screw needs to have a **linear motion range of at least 5mm** (not bound by the housing) and precise positional control (closed-loop).\n\nI have looked into a few motor types myself, and a [piezo motor](https://en.wikipedia.org/wiki/Piezoelectric_motor) appears to fit the bill for my project, although I'm open to any possible solutions. The problem I keep finding is that most commercial vendors that I have spoken to are only willing to sell in bulk (1'000+ units). Given that I am only prototyping, I cannot commit to bulk orders.\n\nSo I guess what my post is asking is 2 questions:  \n1) What type of motor/actuator would be best for my application?  \n2) Where can I buy some?",
        "created_utc": 1495447726,
        "upvote_ratio": ""
    },
    {
        "title": "2017 Salary Survey",
        "author": "2017EESurvey",
        "url": "https://www.reddit.com/r/ECE/comments/6cj93f/2017_salary_survey/",
        "text": "My girlfriend and I are fresh masters graduates in EE and are negotiating for our salaries and would like some feedback on what is a reasonable range.  I figured that this information would be helpful for everyone on this sub so I made a Google survey so that I can share this info afterwards.  It's a pretty short survey so if you have a minute we would really appreciate your help.  Thanks!\n\n[Survey](https://docs.google.com/forms/d/e/1FAIpQLSeIgQyUFIIMO11rVa-ur3upnM2KFRp9fI2Bv8qgWgs3-qxu9Q/viewform?usp=sf_link)\n\n[Results Spreadsheet](https://docs.google.com/spreadsheets/d/195ejLmf82-9s3xU8EXNiJ72OBEzVaCMXGynekZ_hu1I/edit?usp=sharing)",
        "created_utc": 1495403587,
        "upvote_ratio": ""
    },
    {
        "title": "Any interesting project ideas for these high quality DAC's? (AD569)",
        "author": "Sousanator",
        "url": "https://www.reddit.com/r/ECE/comments/6ciu2x/any_interesting_project_ideas_for_these_high/",
        "text": "Hey guys, I recently salvaged 4 [AD569](https://www.digikey.ca/product-detail/en/analog-devices-inc/AD569AD/AD569AD-ND/617615) DACs and was wondering if there are any cool projects that would require the type of precision they offer. On top of that, they seem to be pretty old DACs. As far as I know, precision cut resistor dividers work nicely no matter how old the technology is, but are DACs like these still worth having? I can't tell if the digikey list price of about $120 CAD a pop is because of the vintage or the quality. Any ideas or comments greatly appreciated!",
        "created_utc": 1495399042,
        "upvote_ratio": ""
    },
    {
        "title": "Embedded Related asked me a few questions at ESC Boston - here is the resultant video",
        "author": "adamt99",
        "url": "https://www.youtube.com/watch?v=TSwbZ-tzIXk",
        "text": "",
        "created_utc": 1495398972,
        "upvote_ratio": ""
    },
    {
        "title": "2 Stage Amplifier SPICE sim help",
        "author": "McGhoubs",
        "url": "https://www.reddit.com/r/ECE/comments/6cgsx4/2_stage_amplifier_spice_sim_help/",
        "text": "I'm working extra Spice problems out of my textbook (Fundamentals of Microelectronics, Razavi) to get better at it, and I'm currently stuck trying to determine if the answer I have is correct or not. I cannot find solutions or answers anywhere online, so I'm having to guess if my answer is correct and intuition with transistors is not my strong suit.\n\n[Here](http://imgur.com/a/uPiHO) is the SPICE prompt in question, and [here](http://imgur.com/a/imBg4) is the circuit I made using LTspice. According to my results I need about [924mV](http://imgur.com/a/K1Osj) to get the 900mV output, and the amplifier's frequency response has a bandwidth of [12ishGHz](http://imgur.com/a/vQb3Q), but never makes it above -2dB gain.\n\nFor the MOSFET parameters mentioned in the problem promt, \n VTH, CJO, CJSWO, MJSWO needed to be changed to VTO, CJ, CJSW, and MJSW in order to clear syntax errors.\n\nCan anybody tell me if there's something I'm doing that's absolutely wrong? Or is this mostly correct? I feel like a circuit like this shouldn't have a negative gain or a bandwidth as large as it is.",
        "created_utc": 1495377069,
        "upvote_ratio": ""
    },
    {
        "title": "DSP Engineers",
        "author": "sweptunderthecarpet",
        "url": "https://www.reddit.com/r/ECE/comments/6cc7k3/dsp_engineers/",
        "text": "I was wondering if there's any DSP engineers out there that could talk about their experiences. What's the current job market like? Typical work day? I'm entering my junior year in fall and I have to pick upper level electives now. Some focuses that I like are mixed signal circuit design, signals processing, physical electronics, and control systems. I'm still unsure of what I'd like to pursue. ",
        "created_utc": 1495308341,
        "upvote_ratio": ""
    },
    {
        "title": "Repairing an old Roland synthesizer - help diagnosing with schematic",
        "author": "barneyskywalker",
        "url": "https://www.reddit.com/r/ECE/comments/6cc7gb/repairing_an_old_roland_synthesizer_help/",
        "text": "Hello everyone.\n\nI have a vintage ca. 1978 Roland SH-2 synthesizer in need of repair. VCO 2 does not work, and when I probe the VCO 2 test point, I get a +15v reading, no wave form whatsoever. The working VCO 1 test point shows a pulse wave, so I assume that the same should be present for VCO 2.\n\n I replaced IC 21 (the infamous Fairchild UA726) with [a little retrofit kit](http://www.portabellabz.be/pa726.html) and that didn't work either.\n\nI am getting the same readings on the scope for the inputs of both oscillators, i.e. for IC 16 pins 2, 3 &amp; 1 of the working oscillator as IC 12 of the non-working oscillator; same goes for IC 17 2, 3 &amp; 1 of the working one as IC 12 pins 6, 5 &amp; 7 of the non-working one; also IC 17 pins 6, 5 &amp; 7 of the working one and IC 13 pins 6, 5 &amp; 7 of the non-working one. This led me to believe it was shortly after these ICs in VCO2's circuit, hence the replacement IC21.\n\n[Here is the service manual for the SH-2.](http://www.synfo.nl/servicemanuals/Roland/SH-2_SERVICE_NOTES.pdf)",
        "created_utc": 1495308313,
        "upvote_ratio": ""
    },
    {
        "title": "Best Job Security Industry in Engineering + Help Solving Dilemma",
        "author": "AndAvForfedre",
        "url": "https://www.reddit.com/r/ECE/comments/6cbz6m/best_job_security_industry_in_engineering_help/",
        "text": "First - which industry/field do you think has the best job security? How important is job security to you?\n\nSecond - I am currently working as an electrical engineer for a utility (transmission) company. I feel my job security is fairly high here, however I do not enjoy the work and I have almost zero passion here. I have a family with two young boys so I have remained here since I graduated about two years ago.\nNow there is a promising job offer as a hardware engineer with excellent pay and benefits, plus a good friend of mine works there. I know I would be much happier working in this field since I really enjoy circuit design, but the job is in automotive. The automotive industry has a history of layoffs when times get tough, which makes me hesitant to accept an offer. Should I take the job and pursue my own passion or should I remain working for the TSO where I have job security for the sake of my family?\n\nSide note - Ultimately I don't plan to stay in automotive and would like to take the skills I gain at this company to a different industry - perhaps aerospace or a company like Intel. Not sure if these industries are any more secure however.",
        "created_utc": 1495305817,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to get accepted into top EE or CSE masters programs after finishing ECE?",
        "author": "walkietalkie753",
        "url": "https://www.reddit.com/r/ECE/comments/6caxc2/is_it_possible_to_get_accepted_into_top_ee_or_cse/",
        "text": "As you can tell by my previous post I am  thinking I'm going to change from CSE to ECE.  However I definitely plan on getting a masters and I feel it would be the most beneficial to get one in either EE or CSE rather than ECE for the best job opportunities.  I am wondering if ECE's get weeded out over the CSE/EE's applying for their own masters program.  Does anyone have any sort of experience with this that could help me out? ",
        "created_utc": 1495294185,
        "upvote_ratio": ""
    },
    {
        "title": "12 Free Master’s in Electrical Engineering in Europe",
        "author": "markschumaker",
        "url": "https://www.reddit.com/r/ECE/comments/6c87ww/12_free_masters_in_electrical_engineering_in/",
        "text": "Hello guys, \nFor those who would like to earn a master's degree in an electrical engineering related field from one of the tuition free universities in Germany and Norway but don't know where to start, below is a link to 12 tuition-free master's degree programmes in Electrical Engineering in Norway and Germany. There are links that take you straight to application page of each programme. Hope you find it useful.\n\n https://hubpages.com/education/12-Free-Masters-in-Electrical-Engineering-in-Europe",
        "created_utc": 1495249725,
        "upvote_ratio": ""
    },
    {
        "title": "How to gain experience for hardware oriented positions?",
        "author": "PauLWaFFleZ",
        "url": "https://www.reddit.com/r/ECE/comments/6c6r6l/how_to_gain_experience_for_hardware_oriented/",
        "text": "So I've recently switched my major to Computer Engineering from Electrical Engineering. I made the switch when I realized that I'm more computer science oriented rather than being more into the physics and mathematics of how circuits work. What I'm looking to get into is computer architecture and microprocessor design. But I think what I'm most interested in is microarchitecture. \n\nI've got 40 hours so far, so I'm trying to look into getting internships and such. For CSE, it looks like the majority of those are a lot more software oriented. I go to school at UT of Arlington, and the internships they've advertised to us that are around our area seem to fit more into software than what I want to get into. Also, events like hackathons and etc are also more geared towards software, right? Now obviously I understand that I want to get into  will require some programming. This summer I'm going to try and practice w/ Python and Verilog while I'm taking another C programming class. But what I want to know from those with experience is how to get more exposure in our field. I already know that types of classes that you should try to take (Digital Logic, VLSI, Computer Architecture) but what else can be done to help yourself land an internship at a place like Intel, Nvidia, AMD, IBM or any the other companies that are big on processor/architecture design?",
        "created_utc": 1495231433,
        "upvote_ratio": ""
    },
    {
        "title": "Verilog Code help",
        "author": "Scar9591",
        "url": "https://www.reddit.com/r/ECE/comments/6c3ua5/verilog_code_help/",
        "text": "hey,\nThe last time I wrote working verilog code was a year and a half ago, so my skills have become rusty. But I need them in my new job, so I am refreshing them. I need help on debugging this piece of code. my aim is to have a single pulse generator. But I am running into issues with the testbench and the error messages do not make sense to me\nhttps://www.edaplayground.com/x/3fwP",
        "created_utc": 1495202858,
        "upvote_ratio": ""
    },
    {
        "title": "Artificial saltatory conduction?",
        "author": "ruittwo",
        "url": "https://www.reddit.com/r/ECE/comments/6c00vy/artificial_saltatory_conduction/",
        "text": "Myelinated Neurons use saltatory conduction - which is a lot faster than a simple current. Is there a similar artificial system for increasing the speed of a current?",
        "created_utc": 1495150644,
        "upvote_ratio": ""
    },
    {
        "title": "Moving from Arduino to Ti ecosystem",
        "author": "QuantumCondundrum",
        "url": "https://www.reddit.com/r/ECE/comments/6bzwg3/moving_from_arduino_to_ti_ecosystem/",
        "text": "I recently gained access to a Ti CC2640R2F Launchpad. I knew Code Composer Studio and the Ti ecosystem was going to be far more technical than the arduino framework I am used to, but after playing around with the launchpad, CCS, and the example projects I am feeling a bit in over my head. I was wondering if any of you could recommend resources or a process for moving between the two ecosystems.\n\n I am aware that Energia exists but I have not looked into it yet. I think this might be a starting point but my (extremely small) understanding of Energia makes me think that I cannot use the CC2640R2F with it. \n\nI also know that the CC2640R2F uses the RTOS which is not helping me ease my way into the new tools (yay for added complexity). I am looking to emulate some of the arduino functionality like pin changes, analog readings, using the I2C bus, printing to a terminal, etc. \n\nShould I get one of the more simple launch pads (MSPxxx etc) as a simpler ease into legitimate embedded projects?\n\nI have been programing Arduinos for a long time now and I would consider myself an \"expert\". I also have a EE/CompE background (currently a Junior in EE, minoring in embedded) if that helps you guys recomend resources. ",
        "created_utc": 1495149321,
        "upvote_ratio": ""
    },
    {
        "title": "Question about Microcontrollers",
        "author": "NaesRemark",
        "url": "https://www.reddit.com/r/ECE/comments/6bxz7d/question_about_microcontrollers/",
        "text": "In a microcontroller, how is the device programmed to handle the incoming assembly instructions? For instance an Arduino uses an Atmel microcontroller, but within that device is there some RTL coding done to program the processor? \n\n\nEDIT: I work with an Altera De0-Nano FPGA and implement an OpenRISC architecture. This allows me to write a program and run it on the device. I understand the compiling process which turns C into Assembly and then into machine language. Where I get confused is how a microcontroller (like the chip on an Arduino) performs this similar process if there is no FPGA or ASIC where the processor is implemented.",
        "created_utc": 1495131094,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone recommend a Matlab book / tutorial for EE's",
        "author": "kerrda",
        "url": "https://www.reddit.com/r/ECE/comments/6bwl2w/can_anyone_recommend_a_matlab_book_tutorial_for/",
        "text": "I'm transferring this fall as a junior, and from what I've heard you're kind of expected to know Matlab to do projects for classes. I'd like to spend the summer learning how to use Matlab from an EE side, mainly DSP. ",
        "created_utc": 1495118342,
        "upvote_ratio": ""
    },
    {
        "title": "Alternative Usage of UPS systems in Oil and Gas industry",
        "author": "Waltub",
        "url": "https://www.reddit.com/r/ECE/comments/6buanj/alternative_usage_of_ups_systems_in_oil_and_gas/",
        "text": "Hello, \n\nWe had a major project whete we elevated our substations and as a result, we ended up with three 30KVA UPS systems.  We want to utilize these systems in a different manner than their original functionality as the new UPS systems will not be compatible with these old systems.  I have suggested that we can use them as Battery Chargers.  But, are there any other alternative usagw than we can utilize for these old systems? \n\nThank you",
        "created_utc": 1495085861,
        "upvote_ratio": ""
    }
]