[
    {
        "title": "What are your 1-, 3-, and 5-year career goals? (And other questions about career growth)",
        "author": "DoNotFearKnowledge",
        "url": "https://www.reddit.com/r/ECE/comments/85foy1/what_are_your_1_3_and_5year_career_goals_and/",
        "text": "I have an annual performance review coming up in the near future, and it's got me thinking about my career progression and personal goals. I'm currently an Entry Level Electrical Engineer at a small company. I started at the company full time about a a year and 3 months ago, after graduating from college. I also completed an internship with the company before graduation. Since this is my first real performance review, I want to make sure that I am setting tangible, realistic goals and making the most out of this opportunity to discuss my performance and set goals with my boss. Any feedback is appreciated.\n\nA few questions:\n\n1. What are realistic expectations for career progression (in terms of title, responsibilities, and compensation) in these time frames?\n\n2. How has your career progressed in the last 3-5 years?\n\n3. What metrics do you use to evaluate your own successes and progress? (For those in upper management/leadership roles, what metrics do you use to evaluate others' successes and progress?)\n\n",
        "created_utc": 1521421066,
        "upvote_ratio": ""
    },
    {
        "title": "Revit for Electrical Engineers",
        "author": "Recyclebot",
        "url": "https://www.reddit.com/r/ECE/comments/85f5yl/revit_for_electrical_engineers/",
        "text": "Hey all \n\nI'm an EE student and i've decided I would love to be a part of an architecture firm, specifically any whose primary emphasis is sustainable design.  \n\nThe more I look through these companies, the more I notice they want a familiarity with Revit, something not offered in my curriculum.\n\nIf anyone has any tools/videos/websites for beginning and becoming competent with Revit specifically for EE's I would greatly appreciate being pointed in the right direction.\n\nAgain thanks for your time!",
        "created_utc": 1521415977,
        "upvote_ratio": ""
    },
    {
        "title": "LTSpice VII Floating Node?",
        "author": "InvocatioNDotA",
        "url": "https://www.reddit.com/r/ECE/comments/85ewi7/ltspice_vii_floating_node/",
        "text": "Hello all, I'm unable to find why LTSpice keeps saying that [this node](https://imgur.com/a/MsNL1) highlighted in yellow is floating, it clearly has a path to ground through Mosfet M23.  Any help or pointers is appreciated in advance.  Here's the [error log](https://imgur.com/a/Ncx3b)\n",
        "created_utc": 1521413536,
        "upvote_ratio": ""
    },
    {
        "title": "Future ECE student",
        "author": "GohanDGeo",
        "url": "https://www.reddit.com/r/ECE/comments/85eifj/future_ece_student/",
        "text": "Hello! I am currently in my last year in high-school and this June I will be taking my uni entrance exams. In Greece we make a list of university schools. So I am thinking of putting electrical engineering first. I want to be a programmer mainly but the technology in hardware is something that fascinates me and would love to learn more about/deal with in the future. My question is: is an ECE school a good choice for someone who wants to program more but also wishes to learn about tech? Thank you in advance",
        "created_utc": 1521410050,
        "upvote_ratio": ""
    },
    {
        "title": "Need assistance simulating resonant RLC circuit in LTSpice for EE Lab",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/85ebxs/need_assistance_simulating_resonant_rlc_circuit/",
        "text": "[deleted]",
        "created_utc": 1521408441,
        "upvote_ratio": ""
    },
    {
        "title": "Question regarding bus differential protection",
        "author": "strugglefordayz",
        "url": "https://www.reddit.com/r/ECE/comments/85chd8/question_regarding_bus_differential_protection/",
        "text": "Hi guys,\n\nQuestion regarding bus differential protection, specifically a high-impedance bus differential scheme.\n\nNormally, I've seen matching CT ratios used on all terminals of the bus zone in this scheme; however, sometimes we might have a different circuit breaker that has mismatched CT ratios. I know there are ways of getting around the issue of having mismatched CT ratios in a high impedance bus differential scheme, but one of the methods I've learned has me a little confused. A couple methods:\n\n1) using a thyrite resistor across the full winding of the highest ratio CT. This method makes sense, since we would be clamping the high voltages developed through the autotransformer effect on the full winding of the CT.\n\n2) Double-tapping the highest ratio CT, where we connect the full winding of the high ratio CT across the differential relay, and connect a matching tap of the high ratio CT to the other lower ratio CTs. This method has me a little confused, since I always felt that keeping matched CT ratios across a high-impedance differential relay was essential to correct operation.\n\nFor reference, I saw method 2 in an SEL paper. Here is a link to the paper, and the diagram that shows method 2 being used is figure 29, on page 17.\n\nhttps://cdn.selinc.com/assets/Literature/Publications/Technical%20Papers/6344_ConsiderationsUsing_KB_20160210_Web.pdf?v=20160902-074851\n\nIf anyone could assist me in conceptually understanding method 2, I would really appreciate it. Thanks!!",
        "created_utc": 1521392486,
        "upvote_ratio": ""
    },
    {
        "title": "How can you connect more than two circuit boards with riboon cables and IDC header connectors?",
        "author": "greenlion98",
        "url": "https://www.reddit.com/r/ECE/comments/85bzw0/how_can_you_connect_more_than_two_circuit_boards/",
        "text": "Ribbon*\n\nThe parts in question:\n\n[Ribbon Cable](https://www.amazon.com/dp/B019CV3EHS/ref=psdc_172544_t2_B00B2HZ89S)\n\n[IDC](https://www.amazon.com/dp/B019CV3EHS/ref=psdc_172544_t2_B00B2HZ89S)\n",
        "created_utc": 1521387995,
        "upvote_ratio": ""
    },
    {
        "title": "Is the voltage across a capacitor in phase with the sinusoidal AC voltage supplied to it?",
        "author": "guorty",
        "url": "https://www.reddit.com/r/ECE/comments/85bx1e/is_the_voltage_across_a_capacitor_in_phase_with/",
        "text": "I was told that when a capacitor is connected to a sinusoidal AC voltage (something like [this](https://www.electronics-tutorials.ws/accircuits/ac-capacitance.html)), the voltage across the capacitor would be out of phase with the sinusoidal voltage supplied to it. But everything that I've searched so far only says that current leads voltage in a capacitor, and nothing about the phase difference between the voltage source &amp; the capacitor. Shouldn't they be in phase? (I don't see how they would be out of phase)\n\n&amp;nbsp;\n\nAny help would be greatly appreciated!",
        "created_utc": 1521387209,
        "upvote_ratio": ""
    },
    {
        "title": "Electrical/electronic engineers, how much (and how often) of the linear algebra and calculus you learned in university do you use in your jobs?",
        "author": "ElectricalSundae",
        "url": "https://www.reddit.com/r/ECE/comments/85b7g2/electricalelectronic_engineers_how_much_and_how/",
        "text": "",
        "created_utc": 1521379692,
        "upvote_ratio": ""
    },
    {
        "title": "Currently a software engineer (HDL and SW projects). Dream is to serve in the military and/or work towards becoming an astronaut. Can I get advice on my options based on my experience?",
        "author": "spicyitallian",
        "url": "https://www.reddit.com/r/ECE/comments/857nir/currently_a_software_engineer_hdl_and_sw_projects/",
        "text": "25 year old software engineer for a big defense contractor. Degree in computer engineering. My dream has always been to serve, but utilize my degree at the same time. Long term dream is to be an astronaut. My experience so far is mostly FPGA Design using VHDL/Verilog, with occasional software related projects as well.\n\nI'd love to serve and still work on FPGAs (if there are any fields in the military that do so), but that isnt a must. I just want to be an engineer for the military in general. What are my options? \n\nLong term goal is to become an astronaut. I know this is a very difficult goal to achieve, but what are the recommended steps to becoming one. This goal also prioritizes FPGA design, but is not a must.\n\nTL:DR - I want to serve in the military and work towards becoming an astronaut while utilizing hardware and software skills.",
        "created_utc": 1521330170,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best way to learn verilog",
        "author": "veriloglearner",
        "url": "https://www.reddit.com/r/ECE/comments/8574pd/what_is_the_best_way_to_learn_verilog/",
        "text": "In one of my classes, we are using Xilinx ISE but unfortunately it's outdated and it's not compatible with windows 10. Other than trying to get it to work on my computer, are there other programs that I can use to practice coding in verilog?",
        "created_utc": 1521325067,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any way to look up discontinued parts?",
        "author": "KeyLimeCardinal",
        "url": "https://www.reddit.com/r/ECE/comments/856z3z/is_there_any_way_to_look_up_discontinued_parts/",
        "text": "I'm trying to do a repair on an older amplifier, and want to find out the specs for the power transistors it uses so I can replace them somewhat accurrately. Is there any way to find out more about it (D2059)? I haven't had much luck with Google",
        "created_utc": 1521323581,
        "upvote_ratio": ""
    },
    {
        "title": "Good (ARM) Microcontrollers for FS USB?",
        "author": "thepingas",
        "url": "https://www.reddit.com/r/ECE/comments/856q5w/good_arm_microcontrollers_for_fs_usb/",
        "text": "My observation is that the secret sauce is in the USB stack.\n\nAtmel (now Microchip) stuff seems pretty good, but they appear to lack any examples of isochronous endpoints, which put a damper on my attempts to implement an audio class device.\n\nSTM32 is a mixed bag. There seems to be a lot of information out there, but most of it conflicts. I've heard people on the EEVblog forums grumble about how the USB stack crumbles under load, dropping packets and crashing. Allegedly the professionals tend to just buy third party stacks.\n\nI've heard good things about the AVR32 stack (not ARM and rapidly dying) and I have actually used the AVR LUFA stack. The NXP stack is apparently a port of LUFA, but it seems like LPC parts are going away in favor the Kinetis (former Freescale) parts.\n\nWhat do you guys use?\n\n",
        "created_utc": 1521321159,
        "upvote_ratio": ""
    },
    {
        "title": "How to make simple metal detector using 555",
        "author": "anoop_mm",
        "url": "https://www.youtube.com/watch?v=qLuBw0xqxSs",
        "text": "",
        "created_utc": 1521313981,
        "upvote_ratio": ""
    },
    {
        "title": "What is the typical antenna gain of CignalTV satellite dish?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/852zop/what_is_the_typical_antenna_gain_of_cignaltv/",
        "text": "[deleted]",
        "created_utc": 1521283221,
        "upvote_ratio": ""
    },
    {
        "title": "In this EEVBlog video, at 1:00:14, Dave tells us about the patented cold solder joint technique for some spark gap. I don't get it, how does it work?",
        "author": "Fame_Fame",
        "url": "https://www.youtube.com/watch?v=RRgjgs3NnnE",
        "text": "",
        "created_utc": 1521281459,
        "upvote_ratio": ""
    },
    {
        "title": "cooling an ATX power supply",
        "author": "zebramints",
        "url": "https://www.reddit.com/r/ECE/comments/852khw/cooling_an_atx_power_supply/",
        "text": "I purchased [this](https://www.amazon.com/gp/product/B071D9WPCB/ref=oh_aui_detailpage_o02_s01?ie=UTF8&amp;psc=1) to make a cheap desktop power supply while I'm in school. I also got an IT guy on campus to generously donate an [ATX power supply](https://imgur.com/a/8UcfS) that had been sitting around.\n\nWhen I turn the power supply on there is something wrong with the fan and it makes a loud sound, like there is something in the fans way. I CAREFULLY opened the PSU up and there doesn't seem to be anything obstructing the fans movement.\n\nI'm wondering if the fan is required for correct operation. On my desktop the PSU's fan doesn't come on unless the load gets over a certain amount, and I'm assuming that functionality was in mind when it was designed.\n\nIf I'm never going to run anything more than two 12V 0.4A stepper motors at the same time could I get away with removing the fan, or would the risk be too great?",
        "created_utc": 1521276199,
        "upvote_ratio": ""
    },
    {
        "title": "Which degree would be more useful in the long run for someone who wants to develop complex and top quality software?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/851jvp/which_degree_would_be_more_useful_in_the_long_run/",
        "text": "[deleted]",
        "created_utc": 1521261264,
        "upvote_ratio": ""
    },
    {
        "title": "What is this connector? 32/34? pins, about 9mm in length",
        "author": "whingeypomme",
        "url": "https://www.reddit.com/r/ECE/comments/850ope/what_is_this_connector_3234_pins_about_9mm_in/",
        "text": "https://datasheetgadget.files.wordpress.com/2014/10/bb9900keypadwayssolution_zps4abd8d7f.jpg\n\nThe inverse is used on a blackberry keypad, and I want to find this receptor so I can knock together a breakout for the keypad. \n\nI'm thinking maybe a Molex slimstack 504622-3410, however I know that another of blackberry's keyboards uses a significantly smaller Hirose  BM14B(0.8)-24DS-0.4V(53) - https://www.digikey.com/product-detail/en/hirose-electric-co-ltd/BM14B-0.8-24DS-0.4V-53/H122178CT-ND/4552360?curr=GBP\n\nDoes anyone recognise it?",
        "created_utc": 1521251861,
        "upvote_ratio": ""
    },
    {
        "title": "How to change MOS process in LTSpice?",
        "author": "InvocatioNDotA",
        "url": "https://www.reddit.com/r/ECE/comments/850j5f/how_to_change_mos_process_in_ltspice/",
        "text": "Hey guys.  Anyone know how to change  [these MOS parameters](https://imgur.com/a/Wlf01) in LTSpice? Trying to change these values and can't find anything online that tells me what to do step by step.  Thanks for any help in advance.\n\nEdit: I also want to make it a 180nm process (L=0.18u)\n\n\n\n",
        "created_utc": 1521250187,
        "upvote_ratio": ""
    },
    {
        "title": "Internship follow up emails",
        "author": "MulligansTravel",
        "url": "https://www.reddit.com/r/ECE/comments/84yymh/internship_follow_up_emails/",
        "text": "I applied for a power internship (EE) and got a phone interview , but it wasnt a pussy hr one it was with engineers , they drilled me with tech questions. They said it will take some weeks to get an answer. My second follow up is like this : I am writing in regards to when or if you have have made a decision for the internship position I interviewed for on Febuary 5th on the phone. Just wanted to ask whether I'm still being considered for the position because I am very much interested in working at Power Engineers. Thank You\n\nMy Name\n\nI get an answer the next day like this : We have had slow movement getting offers out to intern candidates due to some internal restructuring. Many intern candidate positions have moved to Denver to fill positions there. As it looks we may not have a position in Orlando. However we are still hoping because we had yet another interview for the open position in Orlando just this week. Thank you for checking in.\n\nwhat does this mean , how and should i respond to this guy ?",
        "created_utc": 1521235494,
        "upvote_ratio": ""
    },
    {
        "title": "Help with USRP / Matlab toolbox",
        "author": "polalavik",
        "url": "https://www.reddit.com/r/ECE/comments/84yqg3/help_with_usrp_matlab_toolbox/",
        "text": "[looking for help with this question](https://www.reddit.com/r/DSP/comments/84yox3/anyone_have_experience_with_usrps/)",
        "created_utc": 1521233598,
        "upvote_ratio": ""
    },
    {
        "title": "Humble Book Bundle: DIY Electronics includes books like Learning Python with Raspberry Pi, Electronics For Dummies, and Complete Electronics Self-Teaching Guide with Projects and more (partner)",
        "author": "sarfona",
        "url": "https://twitter.com/JamesFonComputa/status/974339835396808705",
        "text": "",
        "created_utc": 1521230256,
        "upvote_ratio": ""
    },
    {
        "title": "Got a Grade C GPA. Are there any Microcontrollers/Embedded Systems Masters program in Europe that could accept me?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/84y7zn/got_a_grade_c_gpa_are_there_any/",
        "text": "[deleted]",
        "created_utc": 1521229498,
        "upvote_ratio": ""
    },
    {
        "title": "Intelligent Automation Inc",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/84xe03/intelligent_automation_inc/",
        "text": "[deleted]",
        "created_utc": 1521222969,
        "upvote_ratio": ""
    },
    {
        "title": "Wifi Kit 8 without Wifi",
        "author": "internetdrink",
        "url": "https://www.reddit.com/r/ECE/comments/84vbe8/wifi_kit_8_without_wifi/",
        "text": "noob here. I want to build a little temperature logger with display that I can take with me on camping trips.\nSo now I am looking for a development board with the following features:\n\n- Support for 1-Wire (DS18B20 temperature sensor)\n\n- Integrated LiPo charger\n\n- Some flash storage\n\n- OLED (optional)\n\n- Low Cost\n\nI found the Wifi Kit 8 board which has all the features I need. What I don't need is Wifi, so I am wondering if there is a board out there that fits my needs better.",
        "created_utc": 1521206037,
        "upvote_ratio": ""
    },
    {
        "title": "Help on a RS422 Switch",
        "author": "wirelessliquid",
        "url": "https://www.reddit.com/r/ECE/comments/84uwfj/help_on_a_rs422_switch/",
        "text": "Hi I'm new to Reddit and was wondering if anyone could help me on a project where I need to switch RS422 connections.\n\nI have 4 Masters and 1 device where the device can switch between the 4 masters at the push of a button. When a master has been disconnected from the device the RS422 data should return to that master. Does anyone have any ideas on what components I should use or any ideas on how to tackle this project? I was thinking to use arduinos, thoughts? ",
        "created_utc": 1521201886,
        "upvote_ratio": ""
    },
    {
        "title": "Getting started with STM32F401",
        "author": "jaffaKnx",
        "url": "https://www.reddit.com/r/ECE/comments/84si54/getting_started_with_stm32f401/",
        "text": "I have done embedded programming before but with boards like arduino and RPi. I haven't really used STM32 series before, but I do plan on doing some projects with it. Does anyone know what's the challenging part of programming STM32? How different is it from arduino? \n\nAny useful guides will be greatly appreciated",
        "created_utc": 1521170609,
        "upvote_ratio": ""
    },
    {
        "title": "ECE Patent Law",
        "author": "khdlee97",
        "url": "https://www.reddit.com/r/ECE/comments/84mram/ece_patent_law/",
        "text": "Does anyone have any experience in going into Patent Law after being an Electrical Engineer? What was the process like? Do you like it at all?\n\nThanks :)",
        "created_utc": 1521123324,
        "upvote_ratio": ""
    },
    {
        "title": "What keeps you inspired?",
        "author": "irishknight",
        "url": "https://www.reddit.com/r/ECE/comments/84lwyb/what_keeps_you_inspired/",
        "text": "Anything. It could be projects at home, projects at work, people, groups, etc. that fuel you to do ECE. I’ve been on leave at work for quite a while due to medical reasons and have found it tough to do ECE on my own volition. So I’m thinking about getting a raspi 3 just a fun way to keep my skills sharpened.",
        "created_utc": 1521115369,
        "upvote_ratio": ""
    },
    {
        "title": "Computer Engineer resume critique and help to find a job after being out of the industry for over 2 years",
        "author": "CannibalCheesecake",
        "url": "https://www.reddit.com/r/ECE/comments/84l12y/computer_engineer_resume_critique_and_help_to/",
        "text": "[Resume link](https://imgur.com/8AbLFuU)\n\nAfter being laid off twice in a row after college, I decided to take a break from engineering and help with my family business for a while. Fast forward 2.5 years, now that I'm trying to squeeze my way back into the industry, I'm not getting any responses to job applications with my resume. My dream job would be doing digital design or verification, but I'm a bit rusty since my first job.\n\nI'm not sure how to explain my gap in employment because most of my work at my family business was not too related to computer engineering, but I feel compelled to add it on my resume because of the long gap. Any advice or critique of my resume is appreciated.",
        "created_utc": 1521104012,
        "upvote_ratio": ""
    },
    {
        "title": "Computer Engineer resume critique and help to find a job after being out of the industry for over 2 years",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/84kzff/computer_engineer_resume_critique_and_help_to/",
        "text": "[deleted]",
        "created_utc": 1521103382,
        "upvote_ratio": ""
    },
    {
        "title": "Deciding on Internship Offer",
        "author": "ecejobthrowaway",
        "url": "https://www.reddit.com/r/ECE/comments/84js5h/deciding_on_internship_offer/",
        "text": "I'm a grad student in ECE with a focus in signal processing, image processing, and machine learning. I accepted a summer internship offer at a large tech company, not a FANG company, but definitely large enough that most people have heard of their products. The position pays $11k after taxes and living expenses and deals mostly with image processing and computer vision. \n\nI was recently offered a position at a different company (after I had already accepted the other offer) which pays almost $15k more than the position I accepted after taxes and living expenses. This position deals mostly with signal processing and circuits for transmitters. One problem with this position is that there is not a lot of room for career growth, or even continuation in full time employment for this company (for reasons that I can't disclose), while the first offer has the potential for a return offer for full-time employment after the internship.\n\nI am having a very tough time deciding what to do. On one hand, the extra money would be nice but it would mean reneging on the previous offer and on the other hand image processing and machine learning is something that has really interested me in school but is not something that I have done in a professional capacity before and the position has the potential to lead to a return offer.\n\nAny advice on this would be greatly appreciated!",
        "created_utc": 1521087423,
        "upvote_ratio": ""
    },
    {
        "title": "2V AM signal generation and recovery. Boosted to V_avg of 6V by CE transistor Amplifier",
        "author": "Ultimategamer32",
        "url": "https://www.youtube.com/watch?v=4-IRhPiHs-Q",
        "text": "",
        "created_utc": 1521081661,
        "upvote_ratio": ""
    },
    {
        "title": "The more you know",
        "author": "danio43us67",
        "url": "https://i.redd.it/otfgwxc9ltl01.jpg",
        "text": "",
        "created_utc": 1521072939,
        "upvote_ratio": ""
    },
    {
        "title": "For those who do logic design for computer chips, how good were your credentials?",
        "author": "PauLWaFFleZ",
        "url": "https://www.reddit.com/r/ECE/comments/84ib3d/for_those_who_do_logic_design_for_computer_chips/",
        "text": "I'm a JR in Computer Engineering right now. I'm hoping to specialize in things like computer architecture/microarchitecture. I also have a lot of interest in FPGA/ASIC design. I do plan on eventually going to get an MS as well. But for those who have these types of jobs, how good do you have to be? I know for a fact, because its said all the time, that the hardware side of things is a lot smaller than software, so its a harder thing to get into. I would just like to have a good idea of what the companies look for when deciding to give someone a job. My goal is to end up somewhere in Austin after I graduate, working somewhere that will help me go to UT so I can get my MS. Austin has almost all of the companies that design chips. So how good do you have to look to get that first job after getting a BS at a top company like NVIDIA, Intel, AMD, Qualcomm and etc.? And also I don't count on getting a design job with a BS, I've already seen a lot of people say it just takes time, experience, and at least an MS b4 you can even be considered for a job like that?",
        "created_utc": 1521072835,
        "upvote_ratio": ""
    },
    {
        "title": "signal integrity salary in Bay Area",
        "author": "yusuksong",
        "url": "https://www.reddit.com/r/ECE/comments/84hufm/signal_integrity_salary_in_bay_area/",
        "text": "So just got an offer in a signal integrity position for 65k. I just graduated with a BSEE and no internship experience. I see some people here with crazy starting salaries and am wondering if this is too low to get by in the area.",
        "created_utc": 1521068677,
        "upvote_ratio": ""
    },
    {
        "title": "Humble Book Bundle: DIY Electronics by Wiley (Partner)",
        "author": "808hunna",
        "url": "https://www.humblebundle.com/books/diy-electronics-books?partner=indiekings&amp;charity=110085",
        "text": "",
        "created_utc": 1521060257,
        "upvote_ratio": ""
    },
    {
        "title": "Is volunteering as a research assistant a thing after college?",
        "author": "cracklescousin1234",
        "url": "https://www.reddit.com/r/ECE/comments/84grww/is_volunteering_as_a_research_assistant_a_thing/",
        "text": "So, I graduated from college a few years ago and I have a job in the industry. I didn't really get into doing independent research projects or such while in school.\n\nI'd like to see what I missed out on. My job doesn't exactly have me working on cutting-edge stuff, and I'd like to see what sort of cool things are being done by researchers. I'd also like to do hands-on work in EE fields outside the scope of my job, rather than just read about them.\n\nThat being established, are university researchers generally open to taking on volunteer lab assistants from the outside? Is that even a thing?",
        "created_utc": 1521060192,
        "upvote_ratio": ""
    },
    {
        "title": "Offerte Giornaliere Amazon - Codici Sconti e Offerte a Tempo",
        "author": "gwendolynxxbiez",
        "url": "https://www.trovasconti.org/blog/offerte-di-amazon-giornaliere/",
        "text": "",
        "created_utc": 1521049386,
        "upvote_ratio": ""
    },
    {
        "title": "Calculating power loss in transmission line",
        "author": "EschersEnigma",
        "url": "https://www.reddit.com/r/ECE/comments/84e8xb/calculating_power_loss_in_transmission_line/",
        "text": "I'm working through Art of Electronics to fill some gaps in my education, and I came across this problem I'm not certain of:\n\n**New York City requires about 10^10 watts of electrical power, at 115 volts12 (this is plausible: 10 million people averaging 1 kilowatt each). A heavy power cable might be an inch in diameter. Let’s calculate what will happen if we try to supply the power through a cable 1 foot in diameter made of pure copper. Its resistance is 0.05μΩ (5×10^−8 ohms) per foot. Calculate (a) the power lost per foot from “I^2R losses,” and (b) the length of cable over which you will lose all 10^10 watts.**\n\n*My work:*\n\nWe know that 10^10 watts are being drawn through the wire, so based on P=IV =&gt; I=P/V, I can calculate the current through the wire as (10^10 )/115≈**87 MA.**\n\nIf power loss through a resistor is taken as P=I²R, then power loss through our 1 foot cable will be (87MA)²x0.05μΩ=**378 MW**.\n\nTherefore the entire 10^10 watts of supply power will be dissipated over (10^10 )/(378e6)≈**26½ ft**. \n\nIs this accurate? And if so how is it possible? Is there current limitation performed between transmission stations on the power grid?\n\nEDIT: Or, is it because looking at only one segment of the line is pointless because all of the discrete segments create a large series resistance? ",
        "created_utc": 1521041378,
        "upvote_ratio": ""
    },
    {
        "title": "MOSFET fail safety",
        "author": "swingking8",
        "url": "https://www.reddit.com/r/AskElectronics/comments/84e5vc/mosfet_fail_safety/",
        "text": "",
        "created_utc": 1521041327,
        "upvote_ratio": ""
    },
    {
        "title": "Controlling Servo Motor in Various Angle in proteus",
        "author": "[deleted]",
        "url": "http://www.pictutorial.net/2015/01/how-to-interface-servo-motor-with-pic.html&amp;sa=U&amp;ved=0ahUKEwi4_oX1jOzZAhVCJZQKHQZSCFoQFggFMAA&amp;client=internal-uds-cse&amp;cx=006525542899464981952:sezliky_rq0&amp;usg=AOvVaw0zWPBf3R8wlRw_0NEf4Wfl",
        "text": "[deleted]",
        "created_utc": 1521040457,
        "upvote_ratio": ""
    },
    {
        "title": "[AMA] I made a multiplayer puzzle game based on ECE concepts for Chromecast + In-App Promo Code Giveaway",
        "author": "e-regular-games",
        "url": "https://www.reddit.com/r/ECE/comments/84dll7/ama_i_made_a_multiplayer_puzzle_game_based_on_ece/",
        "text": "Hi r/ECE. Ever want to introduce friends/family to a very small piece of what you do? I made a game that tries to do just that.\n\n\nCircuits: A Board Game for Chromecast involves building circuits using logic gates to provide a green (high) signal to an input on the center tile. The game supports 4 players trying to solve the same puzzle simultaneously. The puzzle shows on the TV and each player uses their smartphone to position tiles. The game is free to download, but there are some in-app purchases which I'm giving away codes to below. ( http://circuits.e-regular-games.com )\n\n\nFeel free to ask me about the game. You can also ask me about myself. I graduted about 7 years ago with a Master's in ECE. Currently, I'm a part-time game developer who works full-time as a software engineer. I've published games/apps for Android and the Nintendo Wii U. I built a quad-copter using 3D printed parts and back in the day had a couple papers published about Bluetooth enabled shoes.\n\n\nYou're still reading, that means you probably want the free download code. I know I would. To get the code, ask a question and indicate which in-app item you want. You can pick one of the following: 1-2 player competitive (Hardcore) puzzle pack, 2 player cooperative (Easy) puzzle pack, 3 player cooperative (Easy) puzzle pack or the 4 player cooperative (Easy) puzzle pack.\n\n\nThanks, Ryan @ E-Regular Games\n\n\nps. If you give substantial feedback regarding the game, I'd be happy to give you a code (or an additional code).\n\nEdit: formatting",
        "created_utc": 1521036183,
        "upvote_ratio": ""
    },
    {
        "title": "Why is low resistance used in current shunts ?",
        "author": "Fame_Fame",
        "url": "https://www.reddit.com/r/ECE/comments/84brsq/why_is_low_resistance_used_in_current_shunts/",
        "text": "",
        "created_utc": 1521015645,
        "upvote_ratio": ""
    },
    {
        "title": "What is Power Factor - ELI5?",
        "author": "Fame_Fame",
        "url": "https://www.reddit.com/r/ECE/comments/84bo21/what_is_power_factor_eli5/",
        "text": "",
        "created_utc": 1521014232,
        "upvote_ratio": ""
    },
    {
        "title": "What are all the aspects of working as a researcher?",
        "author": "real_maxsash",
        "url": "https://www.reddit.com/r/ECE/comments/84bioo/what_are_all_the_aspects_of_working_as_a/",
        "text": "I am currently an ECE undergraduate who has developed a lot of interest in this field and would like to continue with a post graduation and quite possibly a doctorate.\n\nWhile others tend to point out that life of a researcher isn't the best and I have the potential to do much better (financially and otherwise). My father told me he is alright with whatever I decide, he wants me to REALLY think about it though. \n\nWhat everyone else considers would be the best is getting a class 'A' Government job(for social respect and security) or studying management (to be eleigible for better paying jobs). They say I live in a dream world and don't know the difficulties that I might face because my father is well off so I never had to face any of those issues.\n\nI still imagine getting into research would be the best. But I would appreciate it if you could tell me the 'reality' of it, so that atleast I can make an informed decision.\n\nI am from India.",
        "created_utc": 1521012064,
        "upvote_ratio": ""
    },
    {
        "title": "Why do people use Xbees over ESPs ?",
        "author": "Fame_Fame",
        "url": "https://www.reddit.com/r/ECE/comments/84atu3/why_do_people_use_xbees_over_esps/",
        "text": "",
        "created_utc": 1521003458,
        "upvote_ratio": ""
    },
    {
        "title": "I learned some PIC in school, and my first job is all Arduino. Advice for how to grow?",
        "author": "Windbag1980",
        "url": "https://www.reddit.com/r/ECE/comments/8492in/i_learned_some_pic_in_school_and_my_first_job_is/",
        "text": "The family business failed when I was in my thirties, leaving me without a career. I had something to prove, so I went to school for electronics engineering technology, which was plenty challenging enough at my age, and with two kids.\n\nMy first job has allowed me to take a bit of a rest and have some fun, which has been great, but I'm not growing like I should. I'm working for a team that has a whack of Arduino boards and Adafruit stuff that they bought (with grant money) to roll some custom sensors. \n\nIn school we built our own PIC18F development boards, and had programming labs in assembly and C. So I'm not afraid of actual embedded development, but I'm looking for recommendations for what I might learn next. \n\nI have a family life outside work, so I would prefer to be deliberate about my professional development. Thanks so much for any advice. ",
        "created_utc": 1520986417,
        "upvote_ratio": ""
    },
    {
        "title": "RC and RL circuits?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/847wp9/rc_and_rl_circuits/",
        "text": "[deleted]",
        "created_utc": 1520976882,
        "upvote_ratio": ""
    },
    {
        "title": "Asking out of curiosity",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/847ems/asking_out_of_curiosity/",
        "text": "[deleted]",
        "created_utc": 1520972720,
        "upvote_ratio": ""
    },
    {
        "title": "Minimum distance between parallel RF traces for 50GHz applications?",
        "author": "InvocatioNDotA",
        "url": "https://www.reddit.com/r/ECE/comments/846wjl/minimum_distance_between_parallel_rf_traces_for/",
        "text": "Hey guys.  Quick question, what would be the minimum distance for a 50GHz (max) application from one RF trace to the other?  Am unable to find decent answers/explanations online.  Any advice is appreciated.",
        "created_utc": 1520968837,
        "upvote_ratio": ""
    },
    {
        "title": "Project on solving \"Industrial Problems\"",
        "author": "Dremora_Lord",
        "url": "https://www.reddit.com/r/ECE/comments/846ntx/project_on_solving_industrial_problems/",
        "text": "So, I'm in my third year of ExTC (EnTC) Engg. And a prof. of mine talked about something along the lines of \"Getting industry related problems, and working on them to create a solution\". This could be our Final year project. He said we'd be working on FPGAs and that it would not be an easy task so it's not mandatory for all. And as I've heard from my seniors, core electronics placements are rare. Most of the campus placements are in IT sector, so this would be a good chance for me to start a career in embedded systems. \n\nMy questions are.. \n\n1. Is this common? If yes, how difficult are these things? \n2. Do companies really care? \n3. Is it a good start? \n4. Would it actually have any advantage over making an unoriginal project with Arduino/Pi? \n5. Should I pursue a career in Embedded systems? ",
        "created_utc": 1520967068,
        "upvote_ratio": ""
    },
    {
        "title": "Resume Critique for Sophmore Undergrad",
        "author": "CrownClown8",
        "url": "https://www.reddit.com/r/ECE/comments/84603r/resume_critique_for_sophmore_undergrad/",
        "text": "Hello everyone, need some help with my resume, I'm just applying for an internship in the summer. I heard conflicting views on keeping an objective or not, so I just decided I will change it depending on what type internship I am applying to.\n\nLink: [resume](https://imgur.com/a/VRYFo)",
        "created_utc": 1520962266,
        "upvote_ratio": ""
    },
    {
        "title": "Build a prototype of a wearable fitness device!",
        "author": "zacjack12",
        "url": "https://www.allaboutcircuits.com/projects/fitbyte-how-to-build-attiny85-powered-activity-tracker-wearable-prototype/",
        "text": "",
        "created_utc": 1520955857,
        "upvote_ratio": ""
    },
    {
        "title": "Been having a problem where if a raspi 0W flips a 12v relay, it resets. Any ideas?",
        "author": "Earl_of_Upvote",
        "url": "https://www.reddit.com/r/ECE/comments/8410nt/been_having_a_problem_where_if_a_raspi_0w_flips_a/",
        "text": "I am obviously very new to this whole electronics thing. \n\n\nSo a friend and I have a gardening project that we work on, and it is essentially a system that uses a raspberry pi to take a picture of some plants with a TTL camera, take a distance reading of a tank using a ultrasonic range finder, and turn on a pump to water the plants.\n'The unit' as it's called has power coming in from a solar charge controller, (12v 35AH battery and 100W panel included), and it also includes a small wifi hotspot to provide connectivity of the raspi to the webap interface we've built for it.\nThe pump, the camera, and the level sensor all go on a PCB, with the raspi, as well as a USB port strictly to charge the wifi hotspot.\n\nEverything works... kinda alright so far.  It's nice to have an automation solution for a remote greenhouse setup.  However, we've been having this problem when the raspi flips a relay to turn on the pump.  That for some reason resets the raspi. We suspect a power blink.\nWe have a kicad for the whole pcb design --&gt;  https://drive.google.com/file/d/1T1JnRET4r_lWY3u7aw8MYTEPQ4sg7WPS/view?usp=sharing\nSince then though we've fixed the small capacitor that was wired in series and we've wired that in parallel. We've also added some schottky diodes in series just to make sure there's no back-flow through the buck converter.\n\nWe think this may very much be related to what solar charge controller we actually use for this project-- but figured it'd be worth a reach-out to see if we made some newbie mistake that a more experienced person could point out for our PCB design.\n\nIf you have any helpful tips that would be great-- but if it seems like a more difficult problem to tease out, just holler at me if I'm up a creek and don't even know.",
        "created_utc": 1520910177,
        "upvote_ratio": ""
    },
    {
        "title": "Proud Being A Project Engineer",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/83zzxo/proud_being_a_project_engineer/",
        "text": "[removed]",
        "created_utc": 1520900608,
        "upvote_ratio": ""
    },
    {
        "title": "How can SipHash be sped up in hardware by using more area?",
        "author": "asssuber",
        "url": "https://www.reddit.com/r/ECE/comments/83ze2n/how_can_siphash_be_sped_up_in_hardware_by_using/",
        "text": "In [their paper](https://131002.net/siphash/siphash.pdf), the authors present the following possible hardware implementations:\n\n&gt; **Compact architecture** with a circuit for a half-SipRound only, that is,\ntwo 64-bit full adders, 128 xors, and two rotation selectors. For SipHash-*c*-*d* this corresponds a latency of *c*/4 cycles per byte plus 2*d* cycles for the\nﬁnalization.\n\nI can picture that in my head, no problem. \n\n&gt;  **High-speed architecture** with a circuit for *e* = max(*c*, *d*) rounds, that is,\n4*e* 64-bit full adders and 256*e* xors. For SipHash-*c*-*d* this corresponds to a\nlatency of 1/8 cycle per byte plus one cycle for ﬁnalization.\n\n&gt; Both architectures require 256 D-ﬂip-ﬂops to store the internal state, plus 64 for\nthe message blocks. For a technology with 8 gate-equivalents (GE) per full adder,\n3 per xor, and 7 per D-ﬂip-ﬂop, this is a total of approximately 3700 GE for the\ncompact architecture of SipHash-2-4, and 13500 GE for the high-speed architec-\nture. With the compact architecture a 20-byte message is hashed by SipHash-2-4\nin 20 cycles, against 4 cycles with the high-speed architecture. An architecture\nimplementing *c* = 2 rounds of SipHash-2-4 would take approximately 7900 GE\nto achieve a latency of 1/8 cycles per byte plus two cycles for ﬁnalization, thus\n5 cycles to process 20 bytes.\n\nThat means, one can do 4 iterations of SipRound in a single cycle using 4*4 = 16 64bit adders. I don't understand how all those adders can run in parallel, given that each add on v0 or v2 is dependent on the previous one in the same lane, and in all the state for the next round.\n\nIn my software programmer mind, I can only see how to use up to 2 adders to implement a SipRound in 2 cycles given free shifts/xors (that is basically true in hardware, and can be true in a few architectures for software).\n\nWhat is the trick?",
        "created_utc": 1520895349,
        "upvote_ratio": ""
    },
    {
        "title": "Which topic are you learning / working on for the time being ?",
        "author": "Fame_Fame",
        "url": "https://www.reddit.com/r/ECE/comments/83yex4/which_topic_are_you_learning_working_on_for_the/",
        "text": "",
        "created_utc": 1520887767,
        "upvote_ratio": ""
    },
    {
        "title": "pmp certificiation",
        "author": "moosemoose41",
        "url": "https://www.reddit.com/r/ECE/comments/83ydqj/pmp_certificiation/",
        "text": "Anyone here go after a project management professional (pmp) certification?  Debating if i should obtain it.  I think it may pair well with my ece degree.\n\nif you have obtained the cert, do you...\n-find the certification useful? Has it added value to you?\n-did you prepare for the exam via online course?\n-if you did online, which program did you use?",
        "created_utc": 1520887534,
        "upvote_ratio": ""
    },
    {
        "title": "Good courses to complement RF engineering?",
        "author": "larrehtehricemonster",
        "url": "https://www.reddit.com/r/ECE/comments/83xlcz/good_courses_to_complement_rf_engineering/",
        "text": "Junior EE student here. In my university, we only have two undergrad courses for RF: antenna systems and microwave circuits. I heard that taking DSP and communication courses are useful with RF, but I would like to learn why. I'm also planning on working for defense after graduation so I'm curious about what courses the RF engineers in this field would recommend to take. \n\nThanks!",
        "created_utc": 1520881853,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think it's ok to have some level of abstraction in electronics ?",
        "author": "Fame_Fame",
        "url": "https://www.reddit.com/r/ECE/comments/83xjdl/do_you_think_its_ok_to_have_some_level_of/",
        "text": "For instance, should I focus more on learning each and every detail I can or focus on building ?",
        "created_utc": 1520881449,
        "upvote_ratio": ""
    },
    {
        "title": "How to Interact with a Soft Processor on this FPGA Board",
        "author": "cracklescousin1234",
        "url": "https://www.reddit.com/r/ECE/comments/83x4dz/how_to_interact_with_a_soft_processor_on_this/",
        "text": "Hi y'all. Last week I made a [post](https://www.reddit.com/r/ECE/comments/82iq28/how_to_get_into/) detailing how lost I am in terms of how to pursue embedded hobby projects. I think I would like to start out by implementing a Xilinx Microblaze core on an FPGA and playing around with that. A user suggested an [Arty-A7](https://store.digilentinc.com/arty-a7-artix-7-fpga-development-board-for-makers-and-hobbyists/) board, but I think I can get better bang for the buck with the [S7](https://store.digilentinc.com/arty-s7-spartan-7-fpga-board-for-makers-and-hobbyists/), which has a fair bit more stuff on the chip for only 10 USD more.\n\nBut now how would I interact with that thing after loading a core onto it? If I wanted to load firmware onto the soft core, or do something to stream data to a console window on my desktop, how would I go about it? Would data be streamed through the micro-USB? Would I need to VHDL up an Ethernet controller and stick on a home-made jack if I wanted to stream data, for example, through my home network?\n\nDoes anyone have any thoughts on this? Is this the best board for doing this sort of thing? How tough is it to design an Ethernet controller anyway? Should I just go for a different board that already has Ethernet connectivity, or has an HDMI output for color media, or whatever else sort of peripheral that allows interaction with the outside world?",
        "created_utc": 1520878447,
        "upvote_ratio": ""
    },
    {
        "title": "Linear Feedback Shift Registers for the Uninitiated, Part XIII: System Identification",
        "author": "jms_nh",
        "url": "https://www.embeddedrelated.com/showarticle/1142.php",
        "text": "",
        "created_utc": 1520871712,
        "upvote_ratio": ""
    },
    {
        "title": "Could anyone let me know if I’m on the right track, please? I’m really not sure what I’m doing.",
        "author": "ac3inspac3",
        "url": "https://i.redd.it/iub2zh1h3cl01.jpg",
        "text": "",
        "created_utc": 1520861136,
        "upvote_ratio": ""
    },
    {
        "title": "Hardware engineers, how do you use software for version control, team collaboration and documentation?",
        "author": "lint_goblin",
        "url": "https://www.reddit.com/r/ECE/comments/83utdn/hardware_engineers_how_do_you_use_software_for/",
        "text": "I recently took over as the sole hardware engineer for a small / medium sized company. Unfortunately, there was no overlap with the previous engineer and all he left was 1.5-page README in a massive folder that encompassed 3 years of work.\n\nI want to do better. At our company’s disposal is a TFS with Git and Confluence. I am no stranger to Git, but how can I best pair it with Confluence? \n\nIs Confluence useful in hardware engineering? Apparently, it’s a software-industry standard, but it looks clunky and gross. I can see it being useful to track TO DO lists and changelogs between revisions, but how else can it be leveraged?\n\nI’d love to hear more on your experiences with software as an assist to hardware development.\n",
        "created_utc": 1520860060,
        "upvote_ratio": ""
    },
    {
        "title": "How can a single Arduino power up all these LEDs??(48 LEDs)",
        "author": "rupak3219",
        "url": "https://youtu.be/hqVpxCPFaQk",
        "text": "",
        "created_utc": 1520846670,
        "upvote_ratio": ""
    },
    {
        "title": "PCB Designers what do think of your job?",
        "author": "BSRosales",
        "url": "https://www.reddit.com/r/ECE/comments/83sijn/pcb_designers_what_do_think_of_your_job/",
        "text": "Hey guys,\nJust wanna know what PCB design engineers think of their work. Do you find it fun and challenging? Also what do see the job outlook for this specific job like in the future. \nThx! ",
        "created_utc": 1520830843,
        "upvote_ratio": ""
    },
    {
        "title": "Install power electronics app",
        "author": "mrzeeshan94",
        "url": "https://play.google.com/store/apps/details?id=electronicselectrical.com.powerelectronics",
        "text": "",
        "created_utc": 1520823402,
        "upvote_ratio": ""
    },
    {
        "title": "Proud Being A Project Engineer",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/83qip6/proud_being_a_project_engineer/",
        "text": "[removed]",
        "created_utc": 1520810341,
        "upvote_ratio": ""
    },
    {
        "title": "Opinion",
        "author": "pimpo1",
        "url": "https://www.reddit.com/r/ECE/comments/83pr2j/opinion/",
        "text": "Hi, I am high school graduate and I am struggling to chose between Computer Science- Computer engineering. Can someone tell me what they study specifically in a CPE major ? ( by telling what kind of side projects you worked on,  job positions etc)",
        "created_utc": 1520803475,
        "upvote_ratio": ""
    },
    {
        "title": "Electric Circuits PSpice Pre-lab Help",
        "author": "WeedWidaMacka",
        "url": "https://www.reddit.com/r/ECE/comments/83pac6/electric_circuits_pspice_prelab_help/",
        "text": "Hi all-\n\nI'm working on a pre-lab for my electric circuits course and I can't seem to get the output waveform in the transient analysis to look right. \n\n[Here is the pre-lab assignment sheet.] (https://imgur.com/a/QEFi9)\n\n[Here is my PSpice circuit.] (https://imgur.com/pR8sqOs)\n\n[Here is my transient analysis from the my PSpice circuit.] (https://imgur.com/a/ofoxW)\n\n[Here is what the transiet analysis waveforms are supposed to look like.] (https://imgur.com/a/6vM0o)\n\nIt looks like my input waveform is looking good, but my Vout has a weird spike in it. If anyone could help me figure out what I'm doing wrong that would be great. Is it the circuit? The analysis setup? I've been stuck on this for dayyss. If anyone could give me any insight, I would appreciate very much :) Thank you. ",
        "created_utc": 1520799399,
        "upvote_ratio": ""
    },
    {
        "title": "Current state of the IC Design industry in the US",
        "author": "Allenmarshall1942",
        "url": "https://www.reddit.com/r/ECE/comments/83p6v2/current_state_of_the_ic_design_industry_in_the_us/",
        "text": "Hi all, \n\nI noticed in the last week a couple of posts about IC Design in the US were met with comments about a changing industry. \n\nA lot of people here said that in the US a PhD is becoming a minimum requirement to do design, and people with an MS are really only able to get jobs doing validation. \n\nIs that the case? are jobs in IC design becoming more scarce due to this high level of qualification required? are there IC design jobs that are leaving the US to China or other countries with cheaper labor? \n\nIs it also true that its mainly the big companies that are doing IC design? I guess the constant consolidation is destroying the small firms doing IC design. \n\nPersonally I ask these questions because I'm planning in going back for my masters, and I had been considering doing microelectronics. I'm now thinking that I may be better off doing signals and communications and getting experience with FPGAs. ",
        "created_utc": 1520798583,
        "upvote_ratio": ""
    },
    {
        "title": "just got into pcb's, need a lil help",
        "author": "Variancee",
        "url": "https://www.reddit.com/r/ECE/comments/83p00e/just_got_into_pcbs_need_a_lil_help/",
        "text": "hey all, i just recently bought some pcb's and am not really understanding how to use them properly (https://www.amazon.ca/gp/product/B074X2GDH2/ref=oh_aui_detailpage_o00_s00?ie=UTF8&amp;psc=1) &lt;--- the ones i bought. I did a basic circuit like how I usually do them on a bread board, and it did not work on the pcb (just did an LED with a 300 ohm resistor). I appreciate all help, thanks!",
        "created_utc": 1520796947,
        "upvote_ratio": ""
    },
    {
        "title": "Why do we use 3.3V for certain ICs? Who came up with it ?",
        "author": "Fame_Fame",
        "url": "https://www.reddit.com/r/ECE/comments/83obqr/why_do_we_use_33v_for_certain_ics_who_came_up/",
        "text": "",
        "created_utc": 1520791143,
        "upvote_ratio": ""
    },
    {
        "title": "TOUCH ALARM.!",
        "author": "anoop_mm",
        "url": "https://m.youtube.com/watch?v=iALMV2UWIKI",
        "text": "",
        "created_utc": 1520791095,
        "upvote_ratio": ""
    },
    {
        "title": "Powering embedded systems",
        "author": "Teatimefor",
        "url": "https://www.reddit.com/r/ECE/comments/83nqgl/powering_embedded_systems/",
        "text": "Hey everyone, I appreciate all of the great responses I read in threads in this subreddit. I always learn a lot from the answers to everyone else's questions, so now I'm submitting my own question.\n\nI work in embedded software and I'm taking a power electronics class for a master's degree. For the class I'm looking into converter design for embedded systems, but I don't understand the overall power architecture of an embedded system, particularly battery powered ones.\n\nLet's say I have a battery powered embedded system with a processor, a sensor communicating over I2C, a few status LEDs, and a buzzer that gets triggered if an event is detected. I'm trying to figure out how a battery would supply all of these system components at once.\n\nWould the battery supply the processor directly, and then would the processor supply the power to the sensor, LEDs and buzzer? Or would the battery supply the processor, the sensor, the LEDs and the buzzer in parallel?\n\nOR is it going to be a mix between these? Where the battery supplies the processor and the processor supplies the sensor for example, and the LEDs and buzzer are supplied in parallel with the processor?\n\nAny insight to point me in the right direction would be greatly appreciated. This is really interesting to me and I'm looking forward to learning more.",
        "created_utc": 1520785840,
        "upvote_ratio": ""
    },
    {
        "title": "What is the difference between a microcontroller and a microprocessor?",
        "author": "[deleted]",
        "url": "https://electronics2electrical.com/4325/what-difference-between-microcontroller-microprocessor",
        "text": "[deleted]",
        "created_utc": 1520785691,
        "upvote_ratio": ""
    },
    {
        "title": "ELECTRONICS VS COMMUNICATIONS",
        "author": "papajulio",
        "url": "https://www.reddit.com/r/ECE/comments/83nlq5/electronics_vs_communications/",
        "text": "Every year ECE engineering graduates are confronted with this question: which path is better, the electronics field or the communication technology? Help the new graduates choose the right decision! Many thanks!",
        "created_utc": 1520784624,
        "upvote_ratio": ""
    },
    {
        "title": "Zephyr 1.11 released: Native Windows development, OpenThread, POSIX and more",
        "author": "introiboad",
        "url": "https://www.zephyrproject.org/let-the-party-begin-zephyr-os-1-11-is-here/",
        "text": "",
        "created_utc": 1520779244,
        "upvote_ratio": ""
    },
    {
        "title": "For your first internship, how good were your credentials?",
        "author": "PauLWaFFleZ",
        "url": "https://www.reddit.com/r/ECE/comments/83kj7u/for_your_first_internship_how_good_were_your/",
        "text": "So I'm about to apply en masse for internships, hoping to get something along the lines of chip design like in ASIC/FPGA or something that just has something to do with logic design. Going to apply EVERYWHERE. Now I've heard that the best way to get in is with a connection, but its still worth a shot. Gotta go fishing and see if somebody will bite, right? \n\nSo for the people here who are already working full-time, how good were your credentials when you found something? Here's how my resume looks\n\nhttps://i.imgur.com/auKXrD9.png\nhttps://i.imgur.com/5DJDRZi.png\n\nAlso, I'm not actively in any student organizations right now. Its Spring Break this week, I'm gonna try to get caught up with my classes then hit the reset button, and try to start having a more social life at school. I've heard that companies are always looking for this on resumes, but its hard when you're going to school full time, while you also have to work 30-35 hours a week at your job to keep insurance. Is that something thats gonna totally keep me out?\n\n",
        "created_utc": 1520741827,
        "upvote_ratio": ""
    },
    {
        "title": "Compilation of useful links in Control Theory",
        "author": "stellar_na",
        "url": "https://www.reddit.com/r/ControlTheory/comments/8398f4/compilation_of_useful_links/",
        "text": "",
        "created_utc": 1520713690,
        "upvote_ratio": ""
    },
    {
        "title": "How to design with fans (without studying all of Heat Transfer)",
        "author": "tomacorp1",
        "url": "https://www.tempoautomation.com/blog/pcb-thermal-design-tips-fans-for-cooling-electronics",
        "text": "",
        "created_utc": 1520705014,
        "upvote_ratio": ""
    },
    {
        "title": "In ○rder t○ αttrαct new cust○mers t○ ○ur st○re we αre mαkἱng α greαt pr○m○tἱ○n. We αre gἱvἱng αwαy 100 Mechαnἱcαl Leαther Wαtches (normαlly 100$) ○nly t○dαy. Αll y○u hαve t○ d○ ἱs leαve α h○nest revἱew αnd Pαy shἱppἱng",
        "author": "sirangrod997",
        "url": "http://a3gift4u.blogspot.com/2018/03/in-rder-t-ttrct-new-custmers-t-ur-stre.html",
        "text": "",
        "created_utc": 1520674290,
        "upvote_ratio": ""
    },
    {
        "title": "Is starting out as a tech such a bad thing long-term?",
        "author": "VollkiP",
        "url": "https://www.reddit.com/r/ECE/comments/83ay0q/is_starting_out_as_a_tech_such_a_bad_thing/",
        "text": "Recent EE grad here. I've been looking for a job for about 2 months and I recently got an offer for a tech job which I might be taking up. The company is good and likes to promote techs to higher positions and I do like engineering positions within the company. \n\nNow, the question is whether this will hurt me a lot in the long term. Short-term salary wise, yes, but will it in a long term, if I don't stay in the position for, say, more than 2 years? \n\nI'm planning on continuing my education through projects and open-source collaboration, both software and hardware and keeping up with tech skills and news. I also might be thinking of going full-on software in 5-10 years too. Also, of course, I will continue to network, which might've been my greatest weakness as a graduate.",
        "created_utc": 1520636095,
        "upvote_ratio": ""
    },
    {
        "title": "ECE program in 5 years instead of 4 ?",
        "author": "OverlookingOwl",
        "url": "https://www.reddit.com/r/ECE/comments/838qss/ece_program_in_5_years_instead_of_4/",
        "text": "Hello! \nI wanted to get some advice on whether or not I should extend my engineering program( Electrical and computer engineering ) from 4 to 5 years. Even though I am getting good grades(4.0), the workload is heavy and I feel that I am not benefiting as much from the course material as I should be. Any advice/ pros and cons of spreading the courses over 5 years instead of 4 ?\nThanks !",
        "created_utc": 1520618907,
        "upvote_ratio": ""
    },
    {
        "title": "How long is this likely to take to charge under reasonable illumination through a window?",
        "author": "Voyager87",
        "url": "http://s.aliexpress.com/IviYjqqE",
        "text": "",
        "created_utc": 1520607899,
        "upvote_ratio": ""
    },
    {
        "title": "Parse XML with a FPGA?",
        "author": "hartvile",
        "url": "https://www.reddit.com/r/ECE/comments/834yir/parse_xml_with_a_fpga/",
        "text": "Is it **possible** to program a FPGA to parse i.e. XML? If yes, what would performance be: worse/same/better than a CPU?\n\n*I understand normally you would do this with a CPU. So please don’t bother explaining that. I’m doing that already on day to day basis.  This is just me being curious  about FPGA...*",
        "created_utc": 1520580804,
        "upvote_ratio": ""
    },
    {
        "title": "8bit integer multiplication",
        "author": "udreamzx",
        "url": "https://www.reddit.com/r/ECE/comments/834rzw/8bit_integer_multiplication/",
        "text": "I have tried a few general techniques but I want to know how best to do 8bit integer multiplication consuming low power in verilog. ",
        "created_utc": 1520578478,
        "upvote_ratio": ""
    },
    {
        "title": "Solid state relay vs mosfet",
        "author": "Godsendviii",
        "url": "https://www.reddit.com/r/ECE/comments/833nas/solid_state_relay_vs_mosfet/",
        "text": "I’m looking into designing an ORing circuit. I usually see references using mosfets but can two solid state relay do the same ? What are the advantages/disadvantages? \n\n[ORing circuit](https://www.edn.com/design/analog/4368307/Use-op-amps-to-make-automatic-ORing-power-selector)",
        "created_utc": 1520565899,
        "upvote_ratio": ""
    },
    {
        "title": "Want to know how viable my long term plan is for after i graduate",
        "author": "person4466",
        "url": "https://www.reddit.com/r/ECE/comments/833n6b/want_to_know_how_viable_my_long_term_plan_is_for/",
        "text": "So this is going be kind of a long winded post about what I plan on doing and I want to know how viable it is. First off I am sophomore Computer Engineering major that plans on graduating in the fall of 2019 ( a semester early than most), and I will be graduating from a flag ship state school. As long as I get a job right after I graduate I plan on working for a couple of years, and then search around for a company that is willing to pay for my master (MBA) and then go into the managerial side of things for engineering. Is this a realistic goal? Thank you all in advance!",
        "created_utc": 1520565864,
        "upvote_ratio": ""
    },
    {
        "title": "Plot of a DSB/SC in the frequency domain?",
        "author": "HKSPaper",
        "url": "https://www.reddit.com/r/ECE/comments/83331y/plot_of_a_dsbsc_in_the_frequency_domain/",
        "text": "So basically I need to plot the frequency domain of a DSB/SC when a carrier component is added to the signal. We need the carrier power to be 50% of the total power in the 2 sidebands. \n\nSo I know that in a DSB/SC there is no carrier since its suppressed. I need to add a carrier signal so that when I plot the frequency domain I have the carrier and 2 sidebands and they should have the same amplitude (50% carrier power). I think I need to multiply my signal by cos(2pift) so it can shift up/down and the amplitude will change but I don't understand why. \n\nI'm trying to plot my theoretical results in matlab but when i multiply my signal by cos(2pift), I still only have the two sidebands and no carrier signal still. \n\nBasically Im just wondering what my plot should look like if the carrier power is 50% of the total power in the 2 sidebands. Should my carrier and sidebands have the same amplitude in the frequency domain?",
        "created_utc": 1520560473,
        "upvote_ratio": ""
    },
    {
        "title": "Critique my resume - embedded firmware",
        "author": "slopeeq",
        "url": "https://i.redd.it/l68mgbyr0nk01.png",
        "text": "",
        "created_utc": 1520557604,
        "upvote_ratio": ""
    },
    {
        "title": "Meaning of prohibit sign in circuit schematics?",
        "author": "zucciniknife",
        "url": "https://www.reddit.com/r/ECE/comments/831tw0/meaning_of_prohibit_sign_in_circuit_schematics/",
        "text": "[removed]",
        "created_utc": 1520549588,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any jobs in ECE that pay as much as the software jobs?",
        "author": "plasticbills",
        "url": "https://www.reddit.com/r/ECE/comments/831k6e/are_there_any_jobs_in_ece_that_pay_as_much_as_the/",
        "text": "I'm currently a sophmore majoring in EE. I like programming too, but the classes I'm in right now are really interesting to me. I know I shouldn't chase money, but I want to see if I can have my cake and eat it too.",
        "created_utc": 1520547574,
        "upvote_ratio": ""
    },
    {
        "title": "Can crystal oscillators get shorted internally?",
        "author": "crusaderblings2",
        "url": "https://www.reddit.com/r/ECE/comments/82ztpe/can_crystal_oscillators_get_shorted_internally/",
        "text": "I have a few boards where the leads on the crystal are shorted. Looking at it under a microscope, I don't see any solder bridges or problems with the board itself.\n\nHaven't been able to find anything online about this, but is it possible for crystals to fail and get shorted internally? Digikey part number is 300-8301-ND",
        "created_utc": 1520534403,
        "upvote_ratio": ""
    },
    {
        "title": "De-spreading FHSS XBee signals in MATLAB using a portion of the hopping pattern",
        "author": "engrstudent1",
        "url": "https://www.reddit.com/r/ECE/comments/82xnci/despreading_fhss_xbee_signals_in_matlab_using_a/",
        "text": "Hello, /r/ECE, I have a question regarding the de-spreading of a frequency-hopped signal in MATLAB.\n\nI'm working on a project involving capturing [XBee-PRO XSC S3B 900 MHz](https://www.digi.com/products/models/xbp9b-xcwt-001) transmissions with a NooElec software-defined radio dongle (RTL2832 + R820T).\n\nThese XBee devices use frequency-hopping spread spectrum (FHSS) in conjunction with Gaussian-FSK. They use about 64 hopping channels, each about 200 kHz wide and separated from adjacent channels' center frequencies by 400 kHz, in the 900 MHz ISM band. However, due to the bandwidth limitations on the SDR receiver, only 5-7 channels can be captured at a time. With a little effort, the hopping pattern can be reverse-engineered, as per this [page](http://xn--thibaud-dya.fr/phy_xbee_p1.html). My initial approach was taken from this link. Essentially what I did was [attach a filter bank to the output of the SDR source block, summed the output of the filter bank, and wrote the output to a binary file to be imported into MATLAB for analysis](https://i.imgur.com/18dRwhT.png). The filters were frequency-translating lowpass filters. The idea was that the filter bank would convert all of the incoming hopping channels to the same baseband center frequency, yielding a similar structure between signals. [FFT of incoming signal with frequency hopping vs. FFT of output of filter bank](https://i.imgur.com/eWlwRh6.png).\n\nHowever, the signal structure does not appear to be the same across transmissions. So, my question to you is: is there a better method of de-spreading an FHSS signal to get back to baseband such that the signal structure of the signal headers are the same? The end goal is to use these signals for statistical analysis/RF Fingerprinting.",
        "created_utc": 1520517496,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to find button caps / covers",
        "author": "whingeypomme",
        "url": "https://www.reddit.com/r/ECE/comments/82wo05/trying_to_find_button_caps_covers/",
        "text": "I'm trying to find some button covers / caps that would be the thing that the user actually pushes which in turn pushes the switch on the pcb! I've looked on ali for button covers and caps to not much avail.  Rather than have some custom made, I only want the bog-standard up/down/left/right and two elongated buttons covers. \n\nWhat's the magic phrase that I should be searching for?",
        "created_utc": 1520506553,
        "upvote_ratio": ""
    },
    {
        "title": "130 Years Since Tesla Invented Induction Motor",
        "author": "prismaticspace",
        "url": "https://www.youtube.com/watch?v=F4MSIZAdZHQ",
        "text": "",
        "created_utc": 1520502746,
        "upvote_ratio": ""
    },
    {
        "title": "Free Banana Pi M3 &amp; Raspberry Pi 3 &amp; Panasonic Grid EYE Module &amp; Consumables Kits Set for Engineers",
        "author": "[deleted]",
        "url": "http://bom.allchips.ai/activity.html",
        "text": "[deleted]",
        "created_utc": 1520493884,
        "upvote_ratio": ""
    }
]