[
    {
        "title": "Seeking the Truth about Voltage Transformers",
        "author": "GeeseInFlight",
        "url": "https://www.reddit.com/r/ECE/comments/6k63d5/seeking_the_truth_about_voltage_transformers/",
        "text": "While living in Japan I was told that American appliances required a step up transformer to transform from 100v to 120v.  Japan has two different frequencies(50 or 60Hz) depending on where you live, as our house was 100 v 60Hz, we were able to run a vitamix blender and a coffee grinder without a transformer.  We were told by others that they had done the same for 6 years without any damage to their appliances.  \n\nSome people say that it could damage appliances running at lower voltages, some people say that it will not damage the appliances but depending on the appliance you may need 120V to perform correctly.  \n\nI guess for the blender and coffee grinder it isn't such a big deal.  I read that 120V actually fluctuates so it's not an issue at all to run at 100v.  \n\nNow I am looking at buying an air compressor which is made for 120v 60hz (15A).   As it is a potentially dangerous tool I want to be sure that it is safe to run at 100v 60Hz.  \n\nMy other option is to get a transformer,  I have seen 100v to 120v 2000W 15 A transformers for sale.  As the air compressor should only require a peak 1800w I thought it would be enough.  \n\nAir compressor\n\n* Single Phase\n* 120 V AC \n* 60 Hz \n* 15 A\n* 3400/min RPM\n* 1.4kW\n* Duty Cycle S3 30%\n\nPotential Transformer  \n\n* Input 100V\n* Output 120V\n* Load Cap. 2000VA\n* Insula.Class A\n* Frequency 50/60Hz\n* Load CUR. 16.7A\n\nI have spoken with a few people about this but no one has a seemingly credible explanation for or against using a transformer.  I wonder if it will blow a fuse everytime I start the Air compressor.\n\nAny thoughts?",
        "created_utc": 1498711064,
        "upvote_ratio": ""
    },
    {
        "title": "Frequency Sweep Test Source in XILINX DDS IP COREv6.0",
        "author": "zacjack12",
        "url": "https://diyhacking.com/frequency-sweep-test-source-in-xilinx-dds-ip-corev6-0/",
        "text": "",
        "created_utc": 1498685026,
        "upvote_ratio": ""
    },
    {
        "title": "Applied Math Major to EE Masters?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6k3bot/applied_math_major_to_ee_masters/",
        "text": "[deleted]",
        "created_utc": 1498681319,
        "upvote_ratio": ""
    },
    {
        "title": "What advice would you give an engineer who wants to transition to the autonomous car tech sector?",
        "author": "petitio_principii",
        "url": "https://www.reddit.com/r/ECE/comments/6k35f8/what_advice_would_you_give_an_engineer_who_wants/",
        "text": "Let's say a person is an EE with an advanced degree and a couple years experience at a big engineering company. Let's say they want to get a job in a company that creates technology that is part of a driver-less car system. They have programming, EE, and design experience. They are interested in any/all aspect of the tech: solid state LiDAR, algorithms, computer vision, sensor networks, machine learning, etc.\n\n* What advice would you give that engineer to best prepare and execute such a transition? \n\n* How can they gain experience in the tech while working in a different sector? \n\n* How can they best prepare and gain knowledge to answer interview questions?\n\n\n---\n\n\nFound a great resource listing the different companies working on subsystems in this field: https://www.wired.com/2017/05/mapped-top-263-companies-racing-toward-autonomous-cars/\n\nThanks for the tips! They will be passed along.\n",
        "created_utc": 1498679815,
        "upvote_ratio": ""
    },
    {
        "title": "Where to start programming?",
        "author": "PancakeMafia",
        "url": "https://www.reddit.com/r/ECE/comments/6k354l/where_to_start_programming/",
        "text": "I'm an incoming freshman majoring in Electrical Engineering. After attending orientation, I feel like I'm at a disadvantage, having zero experience with coding or programing whatsoever. I want to test the waters out over the rest of summer.\n\nWhere should I start?\n\nWhat language do you think is best to learn first?",
        "created_utc": 1498679741,
        "upvote_ratio": ""
    },
    {
        "title": "What advice would you give someone who wants to move into the driverless car tech sector?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6k353e/what_advice_would_you_give_someone_who_wants_to/",
        "text": "[deleted]",
        "created_utc": 1498679734,
        "upvote_ratio": ""
    },
    {
        "title": "20 FREE watches 4 review left! Use this coupon code : 4REVIEW in checkout and get 100% discount of this amazing MECHANICAL LEATHER WATCH (normal price 100$)! All you have to do is leave a review and pay shipping!",
        "author": "Atletja20",
        "url": "http://4477sh0p33r.blogspot.com/2017/06/20-free-watches-4-review-left-use-this_27.html",
        "text": "",
        "created_utc": 1498671962,
        "upvote_ratio": ""
    },
    {
        "title": "Embedded Toolbox: Programmer's Calculator",
        "author": "chtef",
        "url": "https://www.embeddedrelated.com/showarticle/1061.php",
        "text": "",
        "created_utc": 1498667524,
        "upvote_ratio": ""
    },
    {
        "title": "USB Host Shield - Arduino Uno Issue",
        "author": "dev_of_the_future",
        "url": "https://www.reddit.com/r/ECE/comments/6k05cn/usb_host_shield_arduino_uno_issue/",
        "text": "Hi, I am a complete newbie and I have recently started getting into arduino development, being an android developer I wanted to communicate with the arduino uno via my android phone and hence I bought the USB shield form [Here!](http://www.amazon.in/REES52-Arduino-Compatible-Android-Support/dp/B071FYDQQ5?tag=googinhydr18418-21)\nAfter I connect the shield to uno and then connect my phone to the shield the phone does not even seem be be getting charged which makes me wonder if the shield is broken or is there something else that I need to do in order to get shield up and running\nnone of the Android ADK examples work either.\nPlease help me out with this issue.",
        "created_utc": 1498651816,
        "upvote_ratio": ""
    },
    {
        "title": "[Advice] Wireless Audio Design - WiFi / Bluetooth?",
        "author": "NobleBrutus",
        "url": "https://www.reddit.com/r/ECE/comments/6k003l/advice_wireless_audio_design_wifi_bluetooth/",
        "text": "I need to wirelessly stream high quality 24 bit audio on 2 channels of 192 kHz or 8 channels of 48 kHz along with I2C and SPI comms between two embedded devices of my design.\n\nMy impression is that Bluetooth could not handle this quality/bandwidth of Audio?\n\nHow could I approach designing for WiFi (I think I need udp to minimise latency)? I have read that it is lower level and requires more custom design than bluetooth - can you recommend any reading materials to get me started? \n\nI have been looking at getting two Bluegiga DKWF121s?\n\nThank you in advance.",
        "created_utc": 1498649985,
        "upvote_ratio": ""
    },
    {
        "title": "Speed Dependent Switch",
        "author": "AgentG91",
        "url": "https://www.reddit.com/r/ECE/comments/6jzf5k/speed_dependent_switch/",
        "text": "I am extremely out of my depth here, but I am doing everything I can to figure this out. I am a science teacher in Thailand and am preparing a science project with some of the other teachers here. We have settled on the idea of creating a working bicycle dynamo which will transform the voltage to effectively charge an appliance. As far as I am aware, the incoming voltage must be fixed going into a transformer unless you want to blow something.\n\nThe only way to get the get the voltage in the range that can be transformed would be to use some sort of speed dependent switch. I am really not sure if this is the best way to go about this, but if someone could inform me of how to apply one of these and how they work, maybe we could get this idea running (or biking?) and actually get it working.\n\nFor reference, I am a ceramic engineer with a very loose idea of electronics, but I am working with other teachers who have physics degrees, so they can put into practice what I tell them. Go easy on me &gt;_&lt;",
        "created_utc": 1498641130,
        "upvote_ratio": ""
    },
    {
        "title": "HP Recruitment 2017 for freshers",
        "author": "piyushamishra",
        "url": "http://www.onlyjobs.in/hp-recruitment-2017-18-fresher-batch/",
        "text": "",
        "created_utc": 1498637898,
        "upvote_ratio": ""
    },
    {
        "title": "Online Shopping | Mobiles,Footwear,Fashionware,Appliances,Furniture. All are available with low prices and fast deliveries.",
        "author": "locoshop",
        "url": "http://www.locoshop.in/mobiles-online",
        "text": "",
        "created_utc": 1498633175,
        "upvote_ratio": ""
    },
    {
        "title": "24 Verilog projects on fpga4student.com",
        "author": "fpga4studentblogspot",
        "url": "http://www.fpga4student.com/p/verilog-project.html",
        "text": "",
        "created_utc": 1498618828,
        "upvote_ratio": ""
    },
    {
        "title": "24 Verilog projects on fpga4student.com",
        "author": "loi09dt1",
        "url": "http://www.fpga4student.com/p/verilog-project.html",
        "text": "",
        "created_utc": 1498618365,
        "upvote_ratio": ""
    },
    {
        "title": "Alert system for seniors who want to stay active takes first place at 2nd annual Design Competition",
        "author": "JacobsSchool",
        "url": "http://jacobsschool.ucsd.edu/news/news_releases/release.sfe?id=2246",
        "text": "",
        "created_utc": 1498604527,
        "upvote_ratio": ""
    },
    {
        "title": "Using The Grid-Eye Sensor in IoT and Automation Applications, Does It Really Work ?",
        "author": "KasLew-2",
        "url": "http://kasembeddedprojects.blogspot.ca/2017/06/1-wire-grid-eye-sensor-warduino.html?utm_source=Reddit&amp;utm_medium=Link&amp;utm_term=ECE&amp;utm_campaign=Review",
        "text": "",
        "created_utc": 1498602457,
        "upvote_ratio": ""
    },
    {
        "title": "Seeking Analog Design Tutorials of Some Sort",
        "author": "MistrDarp",
        "url": "https://www.reddit.com/r/ECE/comments/6jvb1n/seeking_analog_design_tutorials_of_some_sort/",
        "text": "I'm considering AD as a possible career path and would like to learn more about it. I've been reading the Razavi MOS AD book, which is good for learning many of the building blocks, but I am looking for some sort of resource which goes through the design process possibly with a voiceover or annotation, or potentially goes through IC designs and explains their key parts, their functions, etc. As an example, in a previous Electronics course we went through the various gain stages of a standard OPAMP, I found that to be very informative, so I'm seeking a larger resource of that type of information.",
        "created_utc": 1498593455,
        "upvote_ratio": ""
    },
    {
        "title": "My end-goal is to get a co-op position as an RF engineer with apple at the end of my undergrad, advice on how to get there?",
        "author": "GUYSPLEASE",
        "url": "https://www.reddit.com/r/ECE/comments/6juk0n/my_endgoal_is_to_get_a_coop_position_as_an_rf/",
        "text": "Hi all. I go to a University with a very large co-op program and I will be alternating between 4 months of co-op and 4 months of University until the end of my degree (essentially). My goal is to get a position with Apple in RF for one of my last co-op positions. (I'v heard from others at my school that people have done this). I was hoping for advice on what I can do with my free time, and honestly, just in general, to help achieve this goal. Now about me:\n\nI just finished my first year in EE, currently on summer between first year and second year. I know very little programming--only a bit of C++. I know next to nothing about hardware. My marks for first year were decent, not amazing. We use a percentage scale instead of GPA where I have about  a 77% average so far.\n\nBasically I'm asking what sorts of projects could I do in my free time, or what kinds of skills should I be learning outside of class to supplement my knowledge, or really anything else like the kinds of marks I should be getting or positions I should go for in earlier co-ops. I mostly just want to start focusing more on improving myself and being more productive in a way that positively impacts my future career. \n\nThanks!",
        "created_utc": 1498587071,
        "upvote_ratio": ""
    },
    {
        "title": "[Hiring] metro train Recruitment 2017",
        "author": "piyushamishra",
        "url": "http://www.onlyjobs.in/gujarat-metro-rail-recruitment-2017-general-manager-deputy-general-manager/",
        "text": "",
        "created_utc": 1498584550,
        "upvote_ratio": ""
    },
    {
        "title": "What non-salary related things have you successfully got when counter offering on a job offer.",
        "author": "GenericHam",
        "url": "https://www.reddit.com/r/ECE/comments/6ju6q0/what_nonsalary_related_things_have_you/",
        "text": "I have come to find that some careers allow for a lot of freedom when discussing salary and benefits. For example someone I know (non-engineering field) haggled to be able to bring their dog with them to work everyday. This got me thinking that I might be missing out on opportunities to ask for things when counter offering a job offer. \n\nSo, what \"odd\" things have you asked for in a counter offer that were accepted. ",
        "created_utc": 1498583894,
        "upvote_ratio": ""
    },
    {
        "title": "Extend Eagle CAD Tool with ULPs: Writing Your First User Language Program",
        "author": "Droneboi",
        "url": "https://www.allaboutcircuits.com/technical-articles/extend-eagle-cad-tool-with-ulps-writing-your-first-user-language-progr/",
        "text": "",
        "created_utc": 1498581686,
        "upvote_ratio": ""
    },
    {
        "title": "Advice on getting my Masters Degree",
        "author": "plutos_moose",
        "url": "https://www.reddit.com/r/ECE/comments/6jt770/advice_on_getting_my_masters_degree/",
        "text": "I am graduating with a Bachelors degree in Computer Engineering next spring and then moving up to live in Pittsburgh PA. I was originally thinking of going straight into a Masters program at one of the colleges up there but I am worried about paying tuition as well as living in the city. I want to start working as soon as I am done with college but the advice I get from most everyone is that I should get my Masters first because it is hard to go back to school once you start working.  I was going through my options and have been considering looking for a place to work that will pay for me to get a higher education. Does anyone have experience doing this? Is this common or desirable to companies or do they not like to do this? Another option I've been looking at is starting work and getting an online Masters degree. Are these programs legit? And would they give me a chance to do some research? Any advice or insight anyone has will be much appreciated.",
        "created_utc": 1498575304,
        "upvote_ratio": ""
    },
    {
        "title": "Balancing a three phase load dynamically?",
        "author": "cookmesomeeggs",
        "url": "https://www.reddit.com/r/ECE/comments/6jstob/balancing_a_three_phase_load_dynamically/",
        "text": "Hi, I am busy building a demo system that will eventually be used in the monitoring of transformers, but it has been requested that, if a load is unbalanced, I should have a algorithms in place that balance the load. I am not too familiar with load balancing techniques, besides using sequence components, but even then after I have calculated the different components am sort of unsure on what to do. If you could please suggest some techniques that are commonly used to balance 3 phase loads or some reading i could do on the topic that would aid?   ",
        "created_utc": 1498571679,
        "upvote_ratio": ""
    },
    {
        "title": "I just graduated (BSEE). How can I start my career in RF design without any experience?",
        "author": "lossaquestions",
        "url": "https://www.reddit.com/r/ECE/comments/6jr5pn/i_just_graduated_bsee_how_can_i_start_my_career/",
        "text": "What are some good companies that take fresh college grads in Southern California?\n\nI can not find any RF design jobs that don't require at least a few years of industry experience or graduate degrees.\n\nPlease help!",
        "created_utc": 1498548662,
        "upvote_ratio": ""
    },
    {
        "title": "Using the firmware header with a jumper to set a boolean value.",
        "author": "Xials",
        "url": "https://www.reddit.com/r/ECE/comments/6jr3y2/using_the_firmware_header_with_a_jumper_to_set_a/",
        "text": "I am not ECE. I dabble but never have on a professional level. I have a situation where I am here in china looking for a quick solution to a hardware problem. Rather than having the board lay-out redone again, wondering if it would be possible to look for a jumper on the firmware programmer header to set that boolean value. Ideas would be great. :)",
        "created_utc": 1498547850,
        "upvote_ratio": ""
    },
    {
        "title": "My Parents always forget wether they closed the garage door properly , I want to have a device close it automatically through an app , how can I do this ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6jqiyp/my_parents_always_forget_wether_they_closed_the/",
        "text": "[deleted]",
        "created_utc": 1498539282,
        "upvote_ratio": ""
    },
    {
        "title": "[Career Advice] PhD or work placement?",
        "author": "CapsNotLocked",
        "url": "https://www.reddit.com/r/ECE/comments/6jq302/career_advice_phd_or_work_placement/",
        "text": "Hi. My first post on reddit, please be gentle. :)\n\n**&lt;background&gt;**\nI am M.S. Biomedical Engineering student (BSc Biomedical Science). Have a pretty good grasp of mathematics, physics, molecular cell biology and biochemistry. My graduation is in December, now I need to choose to go for a PhD or to get a job. Actually, I recently declined funded PhD offer in Synthetic Biology from one of the top UK universities. \n**&lt;/background&gt;**\n\nSince I embarked on my M.S. studies I became increasingly interested in embedded systems and computer engineering (circuits, low-level stuff, device engineering) and I would love to get a job in this field. I have to mention that I have a relevant experience in micro-manufacturing, microfluidics, optics and lasers. I would appreciate if you could guide me on possible entry vectors into this field with my background. Something like health technologies, etc. \n\nI have sent out my resume via Apple Jobs website for their Hardware Engineer position in the Health Technologies team, but I reckon I have ~0% chances of getting noticed. ",
        "created_utc": 1498533644,
        "upvote_ratio": ""
    },
    {
        "title": "What kind of bit error rates does NAND flash have without ECC?",
        "author": "son_goku17",
        "url": "https://www.reddit.com/r/ECE/comments/6jpsdd/what_kind_of_bit_error_rates_does_nand_flash_have/",
        "text": "I'm looking to use a NAND flash chip to store data.  I've written some code to bit-bang data into the flash interface, and I've been reading up on bad block management and ECC.  I understand that ECC is used to detect and correct a certain number of bits per page.  However I'm having trouble finding some specs on what kind of error rate I should expect without any ECC in the first place.\n\nIs this something that is specified per NAND IC?\n\n",
        "created_utc": 1498530267,
        "upvote_ratio": ""
    },
    {
        "title": "VHDL Project Benefit vs 'Jumping Ship'",
        "author": "Aarontpz",
        "url": "https://www.reddit.com/r/ECE/comments/6jpmc5/vhdl_project_benefit_vs_jumping_ship/",
        "text": "Hello,\nBasically I will be doing an involved project in VHDL for my internship, where I will take a component that needs to be integrated with a payload (satellite) and code, in VHDL, the controller for that component, the interface for that controller and the rest of the payload, and the (apparently very in-depth) test bench in order to prove the controller behaves like the datasheet specifies.\n\nMy interests in EE are primarily embedded systems / signal processing (robotics, ML, dsp). I'm wondering if this project will help / hurt my chances of getting a job more closer to my interests (namely robotics), or if it would be worth trying (and likely failing) to get a different project. My manager assures me this is the most 'complete' type of project, where I develop end to end and it will be used in the final product, and I'm inclined to believe him\n\nTl;dr would a involved VHDL project benefit somebody not necessarily looking to be a VHDL designer after college, but is interested in related fields?",
        "created_utc": 1498528379,
        "upvote_ratio": ""
    },
    {
        "title": "Why hardware manufacturers don't ship drivers on a [read-only] USB? • r/hardware",
        "author": "yuhong",
        "url": "https://www.reddit.com/r/hardware/comments/6ivqs1/why_hardware_manufacturers_dont_ship_drivers_on_a/",
        "text": "",
        "created_utc": 1498528225,
        "upvote_ratio": ""
    },
    {
        "title": "Gut check: Do any of you feel like too many engineering initiatives focus only on high-level programming and scripting, but but not other kinds of engineering, eg ECE?",
        "author": "bhavbhav",
        "url": "https://www.reddit.com/r/ECE/comments/6jp5n3/gut_check_do_any_of_you_feel_like_too_many/",
        "text": "I've been feeling this way and have anecdotal evidence but no real data to back it up, so I am wondering if I am just being unreasonable. \n\nI work for a largeish tech company. It bothers me that I don't see a lot of new blood the closer I get to firmware and hardware; many interns we get eventually tend to hop to app and UI teams as well.\n\nWould love to hear thoughts from you guys. Am I being salty for no reason?",
        "created_utc": 1498523279,
        "upvote_ratio": ""
    },
    {
        "title": "Zynq / Zynq MPSoC AXI Performance Monitoring optimize your HW / SW interface",
        "author": "adamt99",
        "url": "https://forums.xilinx.com/t5/Xcell-Daily-Blog/Adam-Taylors-MicroZed-Chronicles-Part-202-AXI-Performance/ba-p/774455",
        "text": "",
        "created_utc": 1498502059,
        "upvote_ratio": ""
    },
    {
        "title": "Question re: transmission power and GSM",
        "author": "shai-hulud_faire",
        "url": "https://www.reddit.com/r/ECE/comments/6jmyt4/question_re_transmission_power_and_gsm/",
        "text": "I had a project that used the Adafruit FONA 800, a GSM module that uses the Simcom SIM800 chip. I deployed several units of the project in various locations in Honduras. In one rural location, I had problems with a sensor during certain times of the day. What I ultimately determined was that it was failing most often during times of peak phone usage, specifically during siesta when a lot of people get on their phones while they wait for their schools and workplaces to reopen. When I changed the code so that the sensor readings were taken only when the FONA was off, the problem went away.\n\nI would like for someone with a deeper understanding of GSM than my own to validate or invalidate my hypothesis of the problem: that the local cell tower was indicating during peak periods that it was overloaded, and \"asked\" the SIM800 to seek another connection. The SIM800 boosted the power until if found another tower -- which it never did, since in this rural area it was not near another one. My circuit then did not have enough power to run the sensor, so I got bogus readings during these periods.\n\nI cannot find in readily-available literature anything that confirms that GSM towers do this kind of load distribution, but it would explain why identical units in other locations did not have the problem (they were located in different network contexts) and why shutting off the FONA during sensor readings fixed it.\n\nIf anyone has any expertise to share, I would appreciate it.",
        "created_utc": 1498501759,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone tell me what type of motor is this?",
        "author": "asemmatan",
        "url": "https://i.redd.it/xvrtb988e06z.jpg",
        "text": "",
        "created_utc": 1498491278,
        "upvote_ratio": ""
    },
    {
        "title": "Hi can u help me i finished Bachelor in communication engineering what are my paths now",
        "author": "smith8966",
        "url": "https://www.reddit.com/r/ECE/comments/6jk8gz/hi_can_u_help_me_i_finished_bachelor_in/",
        "text": "",
        "created_utc": 1498472405,
        "upvote_ratio": ""
    },
    {
        "title": "Computer engineer job hunt",
        "author": "twintowersrubble",
        "url": "https://www.reddit.com/r/ECE/comments/6jjt89/computer_engineer_job_hunt/",
        "text": "Hello everyone, I'm graduating in December and I wanted to know what kind of jobs I should apply to. I realized that even after practicing programming, that it's not really my passion. However, most of the jobs for a computer engineer are programming positions. Are there any alternatives for a computer engineer career?",
        "created_utc": 1498464800,
        "upvote_ratio": ""
    },
    {
        "title": "Getting Into Electronics Tinkering",
        "author": "jalaska007",
        "url": "https://www.reddit.com/r/ECE/comments/6jjk3d/getting_into_electronics_tinkering/",
        "text": "So I've finished my freshman year as an EE major, and I'm looking to start doing small electronics projects at home. What equipment, parts, and reference books would you recommend as essential or really nice to have?",
        "created_utc": 1498460345,
        "upvote_ratio": ""
    },
    {
        "title": "Pinterest for electrical and computer engineers",
        "author": "floridianfisher",
        "url": "Https://codemade.io",
        "text": "",
        "created_utc": 1498431841,
        "upvote_ratio": ""
    },
    {
        "title": "Just a possibility: could it make sense, for some tasks, to have a computer so simple that it can not run malware / code that deceives?",
        "author": "herkato5",
        "url": "https://www.reddit.com/r/ECE/comments/6jfgwg/just_a_possibility_could_it_make_sense_for_some/",
        "text": "Maybe this would make sense in something like some specific parts of control software for (autonomous) cars, drones and airplanes. Also in voting systems and some election related book keeping that is currently done with a laptop.\n\nThere could be a stand alone device or something that is put on a USB port. \n\nThe computer is meant to be less than turing complete, if that can be called a computer at all. How that could be done in a way that still allows to do various kinds of some useful computation and logging? For start, maybe have only fixed length loops and just +, no minus, no multiply, no divide... Driver for a file system format that can only append / push back data to SD-card, no erase, no overwrite...\n",
        "created_utc": 1498410969,
        "upvote_ratio": ""
    },
    {
        "title": "Interview Questions on Three phase Induction Motors",
        "author": "BabuBhaiyya",
        "url": "https://www.reddit.com/r/ECE/comments/6jfbgb/interview_questions_on_three_phase_induction/",
        "text": "[removed]",
        "created_utc": 1498409293,
        "upvote_ratio": ""
    },
    {
        "title": "A software interface for the breadboard. Configures your prototypes without wires or other components.",
        "author": "thepipman",
        "url": "https://hackaday.io/project/18755-the-metaboard",
        "text": "",
        "created_utc": 1498391069,
        "upvote_ratio": ""
    },
    {
        "title": "Associates or second Bachelor's in Electronics Engineering Technology?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6jc4k8/associates_or_second_bachelors_in_electronics/",
        "text": "[deleted]",
        "created_utc": 1498358788,
        "upvote_ratio": ""
    },
    {
        "title": "Help with NXP microcontroller and LPCopen for I2C",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6jbs8p/help_with_nxp_microcontroller_and_lpcopen_for_i2c/",
        "text": "[deleted]",
        "created_utc": 1498354052,
        "upvote_ratio": ""
    },
    {
        "title": "MacBook ECE help!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6jbnjh/macbook_ece_help/",
        "text": "[deleted]",
        "created_utc": 1498352256,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for resources and tips to find internship opportunity that can give me business learning experience",
        "author": "banana-nananana",
        "url": "https://www.reddit.com/r/ECE/comments/6jak93/looking_for_resources_and_tips_to_find_internship/",
        "text": "Hello all,\n\nI am going to be a senior in EE. I am looking for internship opportunities that can give me the learning experience of building a business within my major. Some people suggest focusing on small companies with a good boss so that I can learn a lot about building my own business. Some people say companies like Tesla doesn't give you the opportunity to learn and more of working hard. I'm still going apply to some big companies just to widen my chances of getting an internship, but I wanted to focus on companies where I can get to learn the passion.\n\nIf I'm looking into small companies for the internship, how can I look up for the opportunity since I assume they are small companies and they don't have the budget to market their career opportunity like other large companies? What are the tips you have in choosing which company that is good in providing the learning experience during the internship program?\n\nAny thought is appreciated here. Thank you.",
        "created_utc": 1498338796,
        "upvote_ratio": ""
    },
    {
        "title": "Fun jobs for a computer engineer?",
        "author": "twintowersrubble",
        "url": "https://www.reddit.com/r/ECE/comments/6ja1v9/fun_jobs_for_a_computer_engineer/",
        "text": "Anything that doesn't involve sitting at a desk from 9-5 coding all day.",
        "created_utc": 1498332979,
        "upvote_ratio": ""
    },
    {
        "title": "Switching 3kW (30V @ 100A) with microcontroller",
        "author": "FunkyHermit",
        "url": "https://www.reddit.com/r/ECE/comments/6j9y1l/switching_3kw_30v_100a_with_microcontroller/",
        "text": "I need to be able to switch on/off a 3kW load with a microcontroller (3.3V) with minimal power loss. I have thought about using a high power FET but then need to figure out how to get 20V to the gate to drive it. Any ideas? ",
        "created_utc": 1498331762,
        "upvote_ratio": ""
    },
    {
        "title": "20 FREE watches 4 review left! Use this coupon code : 4REVIEW in checkout and get 100% discount of this amazing MECHANICAL LEATHER WATCH (normal price 100$)! All you have to do is leave a review and pay shipping!",
        "author": "Atletja10",
        "url": "http://h44pysh00p.blogspot.com/2017/06/20-free-watches-4-review-left-use-this.html",
        "text": "",
        "created_utc": 1498328027,
        "upvote_ratio": ""
    },
    {
        "title": "Are computer engineers effective communicators?",
        "author": "JohnnyXDukey",
        "url": "https://www.reddit.com/r/ECE/comments/6j9i7z/are_computer_engineers_effective_communicators/",
        "text": "What I mean in this is, in general, do computer and hardware engineers write well in your workplace in terms of grammar, structure(including sentence and paragraph structure), cohesion, content, etc?",
        "created_utc": 1498326887,
        "upvote_ratio": ""
    },
    {
        "title": "Electrical engineers who work on embedded systems and FPGAs",
        "author": "Brute34",
        "url": "https://www.reddit.com/r/ECE/comments/6j8jl8/electrical_engineers_who_work_on_embedded_systems/",
        "text": "I am in my senior year and it is time to pick some elective classes. I already took one sequential logic class which had us program an FPGA using Verilog but it dealt with simple stuff like making a calculator, multiplexing display with up down counter, an ALU unit, etc. Now there is an elective called Digital System Design using VHDL which am planning on taking. I was wonder what people usually do who work on embedded systems and FPGAs. What is a typical job assignment you had or still have? I want to get a basic idea of what I might be dealing with in the future.",
        "created_utc": 1498316014,
        "upvote_ratio": ""
    },
    {
        "title": "Need help with stepper motor design.",
        "author": "NuclearMonky",
        "url": "https://www.reddit.com/r/ECE/comments/6j6js7/need_help_with_stepper_motor_design/",
        "text": "XPOST from /r/arduino\nI am currently working on a project that requires me to design a custom stepper motor. I want to build a stepper motor where the rotor (at least the majority of it) is made of a clear plexi-glass. The overall dimension of the product should not be more than 6\"x6\"x~1/2\"(LxWxH) The motor torque is not important as the rotor would be the only load driven by the motor. I do however require a fair amount of accuracy in the rotation of the rotor for this project. Just to get an idea of what I want to do: Imagine the numbers printed on the face of a clock, but no hands. The second hand is stamped onto the plexi-glass and I want to control rotation of the plexi-glass to tell the time. (Please correct me as required as I proceed to make assumptions and lay out my current design. I appreciate any and all help. I'm a mechanic and I kind of just learn this stuff as I go. This project has me way in over my head at the moment, but that's how I learn.)\n\nI am designing a hybrid stepper motor. I intend to use 1/4\" thick plexi-glass and drill 1/8\" holes near the outer edge of a 4\" diameter circle to install 1/8\" diameter 1/4\" long axially magnetized neodymium magnets (I could use square magnets; however, the installation in the plexiglass becomes slightly more difficult). I figured out that I can machine the front and back edges of the plexi-glass to leave a 1/16\" separator between the two 3/32\" wide end caps. Now I am to one of my design problems. What material do I make the end caps out of?\n\nOk. Hopefully someone is able to help me out with that question so that I can ask my next. How many teeth do I need on the rotor end caps to achieve the desired resolution (Think back to my description of a clock's second hand)? I understand how control the stator windings to half-step the motor. I also understand the principle of micro-stepping, but completely lost on actually controlling it.\n\nLast bit is all about the stator: How big should my coils be? I would also like to not have to go more than 4 poles, but could fit 8 poles into my size constraints I think (goes back to my question: how big should my coils be?)\n\nThanks in advance for any assistance you might be able to provide. Please let me know if there are other considerations I am not thinking about, or just a flat out way to achieve my goal with a simpler design. I am open to it all.",
        "created_utc": 1498282606,
        "upvote_ratio": ""
    },
    {
        "title": "Ideal OP-AMP: Having trouble understanding it conceptually",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6j514q/ideal_opamp_having_trouble_understanding_it/",
        "text": "[deleted]",
        "created_utc": 1498262436,
        "upvote_ratio": ""
    },
    {
        "title": "These electronics company marketing departments are getting really good these days",
        "author": "demstandardcells",
        "url": "https://www.reddit.com/r/ECE/comments/6j3w8s/these_electronics_company_marketing_departments/",
        "text": "[Case in point](http://imgur.com/a/oZbE1).\n\nMan look at that design, the one pager and everything. Phew, I thought I was being marketed for a new sports car or something. Nope, a fucking MSO. \n\nMight as well have said, \"our ADCs are grown from the purest Silicon, picked fresh off the fab line, with no GMO 100% organic lithography. No harsh chemicals, just the natural occurring additives of boron and phosphorus. You know with Tektronik your family will only be getting the finest of measurement ingredients. Trust your company with our company, makers of fine scopes and spectrum analyzers since 1200BCE\". \n\nSeriously is this a scope I'm looking at. Experience the new 5 series? Now with more ~~horsepower~~ sampling rate than ever before. Contact a certified dealer for attractive new rates, this offer does not apply outside of the US. \n\nwhat the heck. I recently saw the landing page for Xilinx. Man when did they rebrand sheesh, are you selling me FPGAs or handbags what the fuck is going here. \n\nAn friend at some IC firm told me yeah that's what happens when company's try to be more consumer facing or something. Case in point being intel's atrocity of a website, impossible to navigate if you're trying to find useful information, and not marketing hoo hah. \n\nEdit: [Tek's Source page for the ad](http://www.tek.com/experience5series?utm_source=google&amp;utm_medium=display&amp;utm_content=scopes-mainstream&amp;utm_campaign=5-series-npi&amp;gclid=CKOQhonn1NQCFUdrfgod7ocDLg)",
        "created_utc": 1498250284,
        "upvote_ratio": ""
    },
    {
        "title": "Resolving RFID coil antenna interference?",
        "author": "Hubbis",
        "url": "https://www.reddit.com/r/ECE/comments/6j3nue/resolving_rfid_coil_antenna_interference/",
        "text": "Disclaimers: This is not my field. I am not smart.\n\nHi all. Here's my issue. I'm basically trying to read an RFID tag as it travels down curved tube and through various gates. The gates are RFID coil antenna that fit around the tube. The orientation of the tube brings some of these antenna to within 5 inches of each other. My issue is that, while these antenna work individually, when others are introduced, they don't work as well. I suspect there's some sort of interference due to the proximity of the two antenna.\n\nI've played around with using aluminum foil as a shield, forming a wall between the two antenna, perpendicular to the tube. I've also tried to angle the antenna so they are as perpendicular as possible to each other. While this has helped (I get some reads instead of no reads), the fidelity is still not where I'd like it. \n\nDo you have any suggestions for how I can mitigate this interference? Is there no working around it when two gates are so close? \n\nThanks!",
        "created_utc": 1498247972,
        "upvote_ratio": ""
    },
    {
        "title": "Resources from someone who wants to learn the basics/fundamentals of ECE?",
        "author": "Kitten-Smuggler",
        "url": "https://www.reddit.com/r/ECE/comments/6j3crv/resources_from_someone_who_wants_to_learn_the/",
        "text": "Looking to expand my knowledge base, any useful resources for this subject would be greatly appreciated! ",
        "created_utc": 1498245028,
        "upvote_ratio": ""
    },
    {
        "title": "Sourcing a really long flex ribbon cable for Nintendo DS Lite? (project)",
        "author": "midmosh",
        "url": "https://www.reddit.com/r/ECE/comments/6j2zij/sourcing_a_really_long_flex_ribbon_cable_for/",
        "text": "Hi there, without going into too much detail about my project: I took a nintendo ds lite apart. Found out that the picture is given to the top screen through the ribbon cable (or words to that effect, I don't know all the technical terms yet.) anyway the ribbon cable is the connector for the video for the top screen. It's very flexible but not very long. I need to find a really long ribbon cable specifically for the nintendo ds lite. \n\nExample of a ribbon cable:\nhttp://www.ebay.co.uk/itm/ZedLabz-replacement-top-upper-LCD-screen-ribbon-flex-cable-for-Nintendo-DS-Lite/221054134527\n\nBut I need it to be much longer... like a meter long. Please let me know if that's possible/if you know of a way to do it. I'm not sure if ribbon cables are the same for everything or if they're all custom, so do please explain as much as possible so I can learn. :D",
        "created_utc": 1498241608,
        "upvote_ratio": ""
    },
    {
        "title": "Help with DC circuit",
        "author": "Rvenn_",
        "url": "https://www.reddit.com/r/ECE/comments/6j2d0d/help_with_dc_circuit/",
        "text": "I am supose to solve this circuit ( http://imgur.com/a/j8xCe ) to I0 using the mesh method, but I always get a diferent solution from the one that the exercise says (I0=1.64mA). I know how to make the equation for the top-left mesh, but I am confused about the bottom meshes sharing a current source. Could someone explain the right way to solve it?\nThanks in advance.",
        "created_utc": 1498235986,
        "upvote_ratio": ""
    },
    {
        "title": "I need a transformer that is no longer sold. What are my options?",
        "author": "A_Cunning_Plan",
        "url": "https://www.reddit.com/r/ECE/comments/6j1ma1/i_need_a_transformer_that_is_no_longer_sold_what/",
        "text": "I'm trying to get an old vt-101 back up and running with a shorted transformer.\n\nThe original part is nowhere to be found. Am I completely out of options?\n\nThe part number is 70-17148-00, but I can't find out the actual specifications from online documentation. Is there any way maybe to dissect the bad part to figure out the specs to find an alternative replacement part?",
        "created_utc": 1498229114,
        "upvote_ratio": ""
    },
    {
        "title": "4, 8 Ohm Transducer math/ohms law question",
        "author": "budders894",
        "url": "https://www.reddit.com/r/ECE/comments/6izqbr/4_8_ohm_transducer_mathohms_law_question/",
        "text": "Hello! I'd like to see if I could get some help with some electronics I'm working with. I understand basic electricity and am seeking out advice from more experienced people!\n\n**Project:**\nWire up 4 8 ohm/25w [tactile transducers](https://en.wikipedia.org/wiki/Tactile_transducer) to an Amplifier.\n\n[Circuit me and my friend came up with(note diagram states each transducer is 4 ohms when in reality they are 8 ohms each. my mistake-](https://i.gyazo.com/9637ad0ba96c236b0841b1617ee2468b.png)\n\n**Amplifier stats:** \nRMS Power Rating:\n4 ohms: 120 watts x 2 chan.\nMax power output: 600 watts\n2 ohms: 300 watts x 2 chan.\nBridged, 4 ohms: 600 watts x 1 chan.\n\n**My Goal(s):**\na. Wire a pair of transducers in parallel to get 2ch @ 4 ohms/120w for L/R for a Bass filled butt cheek shaking one of a kind gaming experience. (preferred method)\n \nOR\n\nb. If the amp decides it doesn't want me to be able to do a Low pass filter for the 2 channel setup I'd like to wire it up mono to the amp in the most efficient, safest, powerful way possible. \n\n**Problem:** Don't know how to do part B the best way.\n\nIf the whole L/R bass channel thing doesn't work then i have a few options - I do 4x8ohm in parallel which is 1 ohm (which is too low for this amp and probably unsafe *i think, correct me if i'm wrong*) Or 4x8ohm in series would be 32 ohms which i think would be way to hard for the amp to push. \n\n**Question:** How would I wire these 4, 8 ohm/25w transducers to get the most out of the amplifier? A combination of a parallel and series circuit? I had my electrician friend help me draw up [a circuit](https://i.gyazo.com/9637ad0ba96c236b0841b1617ee2468b.png) to help solve this. Does the way I have it wired up now reduce the two parallel transducers in this circuit's power by 50%? Are the two transducers in series going to be experiencing more of a load than the two in the middle ie. the parallel circuit within the circuit? \n\nI want advice on the circuit and to see if any one has any better ideas/input on the matter.\n\n**Note** - I labeled the diagram incorrectly. Each transducer is 8 ohms, not 4.",
        "created_utc": 1498203134,
        "upvote_ratio": ""
    },
    {
        "title": "Arduino, CC1101, Transmitting, Receiving",
        "author": "mildlycustard",
        "url": "https://www.reddit.com/r/ECE/comments/6izhnr/arduino_cc1101_transmitting_receiving/",
        "text": "I think this is going to be my last post before I throw out everything related to this project – I've been trying to get this working for almost a year now.\n\n\nFrom start to finish I'm trying to find guidance on capturing and replaying a remote signal (appears to be OOK, but what do I know) using a CC1101.\n\nI have a CC1101, a UART, an Arduino, a Pi and an RTL-SDR. Surely there's some combination of things I can do.\n\nThere seems to be an abundance online, but nothing yet has been clear enough – either wrong device, they've skipped over decoding the signal, or it's Arduino to Arduino stuff.\n\nMight just forget I ever tried soon... didn't think it'd be this hard...",
        "created_utc": 1498199390,
        "upvote_ratio": ""
    },
    {
        "title": "Update: If the Amount of Joules from Voltage and Current were equal and in two separate circuits, what would the interaction look like?",
        "author": "personofinterest12",
        "url": "https://www.reddit.com/r/ECE/comments/6izguw/update_if_the_amount_of_joules_from_voltage_and/",
        "text": "I asked this question before, now specifically I'm asking about if the amount of potential in both were equal.  I am not sure how to calculate it, joules maybe?\n\nAnyway I read lightning was an equalization between two high points of potential, so now I'm asking:\n\nIf the Power in Voltage = Power in Current \n\nAnd obviously there would be no flow in either circuit, because Voltage and Current can't flow without each other. \n\nAnd then you connected them, whether with a tube, anode cathode thing, or perhaps wireless transmission...\n\nWhat would the result look like? \n\nSo again.... Just so people don't misread.\n\n2 circuits are placed apart.  Neither current is conducting electricity due to the fact that each has isolated only voltage and current in each respectively.  The total amount of power or potential in both is exactly the same amount. \n\nWhen an interaction between the two occurs, similar to a transformer(but different), what will be the result? ",
        "created_utc": 1498199043,
        "upvote_ratio": ""
    },
    {
        "title": "Please, Help me identify this socket!",
        "author": "NodakTwoBravo",
        "url": "https://i.redd.it/8gxx02jl6b5z.jpg",
        "text": "",
        "created_utc": 1498186187,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any Open Source Standard Cell Characterization Tools (.lib creation). This a pretty dumb question",
        "author": "demstandardcells",
        "url": "https://www.reddit.com/r/ECE/comments/6ix1jh/are_there_any_open_source_standard_cell/",
        "text": "Does anyone know of a way to make a standard cell library, through open source software? It seems like all other parts of the flow can be open sourced, but I haven't seen anything for timing characterization.\n\nWhy? I wanted to try my hand at make a standard cell library with a few gates, more of a tutorial style exercise than anything. Obviously there's a ton of tutorials on doing that, but what I wanted to try was doing this with free tools. Yeah of course I could be in my universities lab and use SiliconSmart or NCX but I'm having trouble finding an open source equivalent. I can do the layout and the spice, plus parasitic extraction through LTSpice with Electric/Alliance/Magic, and P&amp;R tools while not nearly as good as commercial tools, do in fact exist. But yeah my google fu isn't doing swell, only thing I found was this [9 year old site](http://vlsitechnology.org/).\n\nI'm guessing if you're just learning with free tools you can either learn full custom, use an existing library like from OSU or NCSU, or fuck off. \n\n\nEdit: I will say I know jack shit about digital. Another reason I want to do this is because holy fuck layout blows ass for digital. And so does using the schools EDA server that has routine problems and outages an is slow as hell, virtualizing 8 cores for an entire class and grad students/independent projects. Rather do it at home. Theres the real sauce or I should say reason. Too many people on? Good luck using HSpice/Spectre. Trying to run LVS? So is everyone else. Even during the summer like jfc. \n\nI made a simple 8 bit alu + accumulator for our VLSI intro class project, and I already hated that enough because of layout. The only part I can say I barely enjoyed was doing some VCO layout as part of the DPLL we were provided, but that's because the voltage starved config was basically in design like a ring osc. I know people do 8 bit uP in their VLSI design courses and yeah hand layout is the best performance area power delay timing wise blah blah blah, but like could I not though...... At the most I wanted to take some cells I had designed and characterized, tweak them or try new logic families, going more skew tolerant or trying domino logic en masse for \"performance parts\" while the rest of the design is just autorouted. That'd be nice no lie. ",
        "created_utc": 1498170515,
        "upvote_ratio": ""
    },
    {
        "title": "Looking to build an electrical measuring tape. i.e A Measuring tape that knows how much of itself has been pulled off it spool. It seems like a rotary encoder is the best way to go for this. Any thoughts or alternate suggestions from you clever people?",
        "author": "nostril_hair",
        "url": "https://www.reddit.com/r/ECE/comments/6ix150/looking_to_build_an_electrical_measuring_tape_ie/",
        "text": "The title pretty much says it all. Wondering if a grey-code rotary encoder is the best way to track the winding/de-winding of a measuring tape. I can't imagine an optical solution would be any easier/cheaper.\n\nThanks in advance for your thoughts!",
        "created_utc": 1498170398,
        "upvote_ratio": ""
    },
    {
        "title": "Design Challenge: gyroscopic A/C Generator\\Motor",
        "author": "personofinterest12",
        "url": "https://www.reddit.com/r/ECE/comments/6iwzcq/design_challenge_gyroscopic_ac_generatormotor/",
        "text": "Hi all,\n\nI have a design challenge if anyone is willing to accept: \n\nRules are simple:  Design a Working Version of an AC Generator or Motor that functions in 3 Dimensions. Feel free to patent your design if it actually ends up working \n\nGood Luck",
        "created_utc": 1498169889,
        "upvote_ratio": ""
    },
    {
        "title": "Breaking the link between Q and Bandwidth",
        "author": "sleepingsquirrel",
        "url": "http://science.sciencemag.org/content/356/6344/1260",
        "text": "",
        "created_utc": 1498161369,
        "upvote_ratio": ""
    },
    {
        "title": "20 FREE watches 4 review left! Use this coupon code : 4REVIEW in checkout and get 100% discount of this amazing MECHANICAL LEATHER WATCH (normal price 100$)! All you have to do is leave a review and pay shipping!",
        "author": "Atletja6",
        "url": "http://dutysh0p33r.blogspot.com/2017/06/20-free-watches-4-review-left-use-this.html",
        "text": "",
        "created_utc": 1498148569,
        "upvote_ratio": ""
    },
    {
        "title": "USA independence day offer 2017 offer - 20% for magento extensions",
        "author": "kamkannan",
        "url": "https://www.reddit.com/r/ECE/comments/6it4da/usa_independence_day_offer_2017_offer_20_for/",
        "text": "[removed]",
        "created_utc": 1498134019,
        "upvote_ratio": ""
    },
    {
        "title": "Measuring Performance of a Design",
        "author": "arjundupa",
        "url": "https://www.reddit.com/r/ECE/comments/6iqhbp/measuring_performance_of_a_design/",
        "text": "\"The following expressions represent the carry out C from the addition of two 2-bit unsigned numbers, A = A1A0 and B = B1B0:\n\nC = A1B1 + (A1 + B1)A0B0      (Equation 3) \n\n= A1B1 + A1A0B0 + A0B1B0      (Equation 4) \n\nPerformance is inversely related to the delay necessary for a design to produce an output once its inputs are available.\n\nIf we count each function/gate as one delay (we call this time a gate delay), we get an estimate of the time needed to compute the function. Referring again to our example equations, we find that Equation (3) requires 3 gate delays, and Equation (4) requires 2 gate delays.\"\n\nI do not understand the last sentence -- how does Equation (3) require 3 gate delays, but Equation (4) require 2 gate delays?",
        "created_utc": 1498096749,
        "upvote_ratio": ""
    },
    {
        "title": "Calculating real and reactive power of a transmission line",
        "author": "20j2015",
        "url": "https://www.reddit.com/r/ECE/comments/6iqg37/calculating_real_and_reactive_power_of_a/",
        "text": "[removed]",
        "created_utc": 1498096350,
        "upvote_ratio": ""
    },
    {
        "title": "Want to learn VLSI by myself",
        "author": "Huntson",
        "url": "https://www.reddit.com/r/ECE/comments/6iq0hj/want_to_learn_vlsi_by_myself/",
        "text": "Hello fellow engineers, I wanted to know how I can teach myself VLSI. Unfortunately, my school does not offer a VLSI class but I really want to learn it. Do you guys have any advice? Any textbooks or websites I should refer to? I took a class on transistors so I don't know if I need to know some other stuff prior in learning VLSI. Thanks!",
        "created_utc": 1498091618,
        "upvote_ratio": ""
    },
    {
        "title": "Future of embedded systems?",
        "author": "Kloppite1",
        "url": "https://www.reddit.com/r/ECE/comments/6ipany/future_of_embedded_systems/",
        "text": "Im fairly new to the area working as a firmware engineer, and as well as the basics of learning ansi c, writing better code, getting better at debugging, I want to be able to look to the future and develop in areas that will be important in the future. \n\nSo my question to you guys is, what areas of embedded design do to see big changes and what kind of changes. For example the so called Internet of Things seems to be driving embedded development. RTOS and low power processors. So learning how to develop RTOS will be important as will as familiarity with communication interfaces such as Bluetooth and WiFi",
        "created_utc": 1498083936,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone willing to help a lost college student?",
        "author": "TheBAYA",
        "url": "https://www.reddit.com/r/ECE/comments/6iohbn/anyone_willing_to_help_a_lost_college_student/",
        "text": "Kind of a long post ahead, but any help would be greatly appreciated: I am a sophomore college student about to go into my third year of college. Firstly, I like ECE, but after finding this subreddit and going through a bunch of posts and reading about things like VLSI, signal theory, etc. (basically things I have almost never heard of), I have found that ECE is much more broad than the sort of \"build your own PC\" and \"make cool robots\" mentality that I first imagined. That being said, I still want to pursue ECE, but I don't really know where I'm headed besides \"I want to do stuff with computers one day\". I don't really know how to explain the question I have besides can someone help point me to realize what I want to do in my life, but any guidance would be immensely helpful.\n\n\nSecondly, I couldn't get an internship this summer, partially because I wasn't super proactive during the school year (regrettably) and partially because I don't have much experience. I have a part time job on campus at a simple IT help desk and my other jobs in the past have centered around tutoring very simple classes not very related to ECE. But next year, I want to go in full force and get an internship at one of my dream companies. I plan on joining one of the many engineering clubs on campus during this upcoming school year, but I'm not completely sure which one interests me the most because of the situation above. But in the mean time, I'm trying to take this summer to gain experience through application, working on personal projects and learning on my own through websites like Code Academy, Lynda (given by my school), W3Schools, and other free resources. Hopefully, I can showcase some of these projects on my resume to kind of balance the lack of related jobs I have. So far, I have created a simple website from scratch using HTML and CSS that I plan to link from my resume and use as my portfolio so I can go more in-depth about my projects. I've also started looking into iOS app development to make apps that I'm personally interested in using to help me out in my day-to-day life. I've learned a decent amount about the Arduino Uno from class and bought a Raspberry Pi 3 (which I have no experience with). I'm a beginner in MATLAB, Python, and AutoCAD and somewhat intermediate in C/C++. I guess my second question is are there any projects/coding languages/resources you guys recommend that could teach me a great deal about ECE? I'm looking for projects that won't hold my hand all the way through and that are somewhat practical (I don't want to waste my family's money on the materials for, say, Robotic Arm if I'll barely ever use it). I know that the answers to this question will vary according to my situation in the first paragraph. That being said, I'd still be open to ideas if you guys genuinely think a certain project will help me out in the long run. I know that this was probably a long read, but I appreciate any input. Thank you in advance!",
        "created_utc": 1498076236,
        "upvote_ratio": ""
    },
    {
        "title": "How much does one have to spend to have a reasonable soldering iron?",
        "author": "CompEStudent",
        "url": "https://www.reddit.com/r/ECE/comments/6imshu/how_much_does_one_have_to_spend_to_have_a/",
        "text": "I'm sure this has been asked a lot, but I'm in the market for a soldering iron. How much should one spend to have a somewhat decent one?",
        "created_utc": 1498061201,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for an AC Line Separator with European Power plug/socket.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6imhhz/looking_for_an_ac_line_separator_with_european/",
        "text": "[deleted]",
        "created_utc": 1498058439,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for an FPGA device (intermediate level)",
        "author": "NaesRemark",
        "url": "https://www.reddit.com/r/ECE/comments/6ilz63/looking_for_an_fpga_device_intermediate_level/",
        "text": "Hello, this past school school year I was using the Altera DE-0 Nano FPGA device to conduct some research. The device ran an OpenRISC Linux OS (Or1k Linux), and used the [Mor1kx](https://github.com/openrisc/mor1kx) processor HDL code. The problem was that it took an extremely long time to upload the bitstream to the device, which made hardware modifications tiresome and inefficient. Does anyone recommend a different FPGA board to conduct my research on? It can be more of an intermediate level board, as I feel confident in my abilities after using the beginner level board this past year. Any advice/help would be really great. Thank you!",
        "created_utc": 1498053499,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if I had a circuit with extremely high voltage, low current, and another circuit with extremely high current, low voltage, and the two somehow interacted?",
        "author": "personofinterest12",
        "url": "https://www.reddit.com/r/ECE/comments/6ikj6k/what_would_happen_if_i_had_a_circuit_with/",
        "text": "Just curious if it were similar to acids and bases interacting... ",
        "created_utc": 1498033975,
        "upvote_ratio": ""
    },
    {
        "title": "How to simulate 7 Segment Displays?",
        "author": "80percentWater",
        "url": "https://www.reddit.com/r/ECE/comments/6iiyys/how_to_simulate_7_segment_displays/",
        "text": "Hi! I am trying to build a digital clock. I identified the ICs which I need, but before buying the components I wanted to simulate the circuit and test if it is working or not. In school I use Multisim for simulations, but I have never tried simulating a 7-segment display. I wanted to know which software should I use to simulate such circuits. Any help would be appreciated.",
        "created_utc": 1498012854,
        "upvote_ratio": ""
    },
    {
        "title": "Getting an internship as a Computer Engineer",
        "author": "EcestudentQ",
        "url": "https://www.reddit.com/r/ECE/comments/6iivp1/getting_an_internship_as_a_computer_engineer/",
        "text": "I am getting my masters in computer engineering, my class focus will be in VLSI and hardware design and multiple classes in wireless network theory and signals. The only thing is I have basically no classes in the hardware side of things. I have taken tons of CS courses, many of which have been algorithms, time complexities, and tons of low level programming in C in OS, and have had 2 internships in Software Engineering/Development, but I really want to get an internship in Hardware/Signal Processing next summer. Also, I shouldn't say I have no hardware classes because I have a few like circuit analysis, an intro course on signals, and a class on transistors. I have used Matlab and am becoming more and more familiar with it as I am doing practice during my off time at my internship. From this subreddit I have found a few things to check out and am doing some intro to VDHL and Verilog and plan on continuing that this summer. My classes are all lined up and in a year from now I will know a hell of a lot more on Hardware design and Signal processing, but I am worried about getting a hardware internship next summer. Any tips for me would be greatly appreciated, recommendations, or even things I can review for interviews if there is a good source. Thanks!\n",
        "created_utc": 1498011894,
        "upvote_ratio": ""
    },
    {
        "title": "Getting an internship in hardware/design/singals as a CE.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6iitop/getting_an_internship_in_hardwaredesignsingals_as/",
        "text": "[deleted]",
        "created_utc": 1498011296,
        "upvote_ratio": ""
    },
    {
        "title": "Graduate project ideas",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6iilo1/graduate_project_ideas/",
        "text": "[deleted]",
        "created_utc": 1498008889,
        "upvote_ratio": ""
    },
    {
        "title": "Dear people who've experienced more,",
        "author": "turkie123",
        "url": "https://www.reddit.com/r/ECE/comments/6iiggi/dear_people_whove_experienced_more/",
        "text": "Throwaway for privacy's sake. I've learned a good bit from both this subreddit and a few other subreddits (mostly software-centric) over the past year and half or so. \n\nI'm here to solicit advice, mainly since I've become increasingly doubtful as of lately (almost to the point of mental illness) towards my academic/career choices. I'm someone who has pursued three full years of college so far, so think six semesters (seven included a \"summer semester\"). I've only successfully gone through with four of them (again, 4/7 if you included a summer semester). \n\nHere's the catch though. I'm not the run of the mill \"I've failed, I learned from my mistake\" and so on type. I never attempted those two (three given the summer inclusion) semesters fully. I withdrew from school during all two (three) of them, once due to poorly timed family reasons, and two others due to more or less poor planning and wishing to focus on a full-time internship/co-op instead. I'm somehow a senior by standing (perhaps due to transfer credits from AP classes in high school), but more or less a junior by knowledge. It makes me sad looking at that now and realizing how far behind I am in regards to some of my friends from high school.\n\nTo the point: am I actually cut out for ECE?\n\nI'm someone who is very interested in industry, and especially the semiconductor (I'll confess, I only ever worked with embedded systems at a semiconductor company rather than anything else) and computer networking side of things (two very different things for the most part, I understand). Both of the positions I worked so far were pretty respectable internships that, surprisingly, were not so critical of my academic gaps due to otherwise stellar academic performance. My parents, as well as my academic advisor, think otherwise though and feel that I may not really understand what is in store for me academically and may be stretching my undergraduate career too wide. I admit, I may not really understand what is in store for me academically at all.\n\nAnother, different line of question. For those of you who have had gaps in your basic academia itself (think bachelor's) or beyond, what was it like? Why did it happen? How did you jump back from realizing that you're so far behind, even if you also realize it's too late to quit and you actually do love at least some of the stuff involved, if not most of it?\n\nSorry for a bit of scatter brain, as well as the weird title, but I'm a bit on edge at the moment. Had a meeting with my academic advisor this morning and was more or less told, despite the specifics of my situation, that I may not be cut out for ECE and I should look into other majors. Maybe that's the truth, but I was a little taken aback by it considering how much I loved and understood classes that I did go to alongside the relevant internships that I found so much more interesting, albeit menial at times. Maybe I've been delusional all this time.",
        "created_utc": 1498007260,
        "upvote_ratio": ""
    },
    {
        "title": "A TLDR History of the PPC from 1990-Present?",
        "author": "PurdueME06",
        "url": "https://www.reddit.com/r/ECE/comments/6igzxd/a_tldr_history_of_the_ppc_from_1990present/",
        "text": "After years of not paying attention to architectures I've suddenly run into PPC again at work. I was wondering if there were any industry experts or historians out there that could help fill in the gaps.\n\nWhy does my [car's ECM](https://en.wikipedia.org/wiki/PowerPC_e200) share the same architecture as my first Mac and the Wii's CPU?\n\nWhat I know:\n\n- Years ago for Christmas I begged for a PowerMac G3 with a  PowerPC 750 family chip.  It was a Apple-Motorola-IBM developed RISC chip. Then came the G4 and G5 and Apple then moved to x86.\n- Along the way *AIM* disbanded.\n- Motorola spun off Freescale. Freescale got bought by NXP. NXP got bought by Qualcomm. They still make PPC chips for embedded applications. e200 for Automotive, e500 for routers/switches.\n- IBM still makes their own [PPC chips for Server](https://en.wikipedia.org/wiki/POWER9). Which Anandtech described as: \"[*the Tyrannosaurus Rex, the M1 Abrams of the processor world.*](http://www.anandtech.com/show/10435/assessing-ibms-power8-part-1)\"\n- And somewhere along the way Nintendo: ([Gekko - GameCube](https://en.wikipedia.org/wiki/Gekko_\\(microprocessor\\)), [Broadway - Wii](https://en.wikipedia.org/wiki/Broadway_\\(microprocessor\\)), &amp; \n [Expresso - WiiU](https://en.wikipedia.org/wiki/Espresso_\\(microprocessor\\))), Sony ([Cell - PS3](https://en.wikipedia.org/wiki/Cell_\\(microprocessor\\))) and Microsoft (Xenon - Xbox 360) all decided PPC would make a great game console CPU.\n\n\n",
        "created_utc": 1497992479,
        "upvote_ratio": ""
    },
    {
        "title": "Best way to find a job in Digital IC Design?",
        "author": "strugglefordayz",
        "url": "https://www.reddit.com/r/ECE/comments/6ifpe9/best_way_to_find_a_job_in_digital_ic_design/",
        "text": "I graduated with a BSEE in May 2016. Since then, I've been working at a utility for a year, but am really starting to dislike the job for a variety of reasons.\n\nIn college, I took a course in VLSI design, and really enjoyed it. I got to learn how to design layouts, learned about formal design verification, power, timing, and it all culminated in an end-of-semester design project that I think played a key role in helping me land a job at a large semiconductor company; however, due to unexpected family circumstances, I couldn't accept the offer and had to stay close to home (where there aren't too many IC design jobs).\n\nSince then, my situation has greatly improved, but now I find myself a year out of college with no relevant work experience save for my coursework (Semiconductor devices, CMOS VLSI design, Microfabrication, E&amp;M, Microprocessors, etc...)\n\nHow do I transition out of power systems/utilities and into IC design/VLSI? Through a masters? Or should I just continue applying and hope I land something?\n\nThanks for reading.",
        "created_utc": 1497981058,
        "upvote_ratio": ""
    },
    {
        "title": "Hardware Design Engineer Interview",
        "author": "fried_ass",
        "url": "https://www.reddit.com/r/ECE/comments/6iffrs/hardware_design_engineer_interview/",
        "text": "Hello! I know many similar threads pop up here all the time, but I have an interview later this week and would like some extra tips!\n\nThe position I am interviewing for is titled: Hardware Design Engineer.  I have already had the intial screening interview, and this next one will be technical.\n\nI recently graduated (BSEE) in December and am currently at a different company.\n\n**What kind of questions should I expect?**\n\nI know in general it is good to know:\n\n* Ohms\n* Filters\n* Op Amp configurations\n* Basic circuit analysis\n\nAny pointers? Anyone have a job with a similar title?\n\nThanks!",
        "created_utc": 1497978727,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to mount an FPGA on a UAV is easier said than done. Anybody have signal processing experience with Python?",
        "author": "kraegarthegreat",
        "url": "http://www.babydonthertzme.ca/2017/06/flying-high-uavs-fpgas-ubuntu.html",
        "text": "",
        "created_utc": 1497977598,
        "upvote_ratio": ""
    },
    {
        "title": "[US] Various things are shocking me in my garage. Is this because there is something wrong with the ground?",
        "author": "redcodefinal",
        "url": "https://www.reddit.com/r/ECE/comments/6ibpen/us_various_things_are_shocking_me_in_my_garage_is/",
        "text": "I have various things plugged into the AC outlets in my garage, computers, refrigerator, etc, which have chassis ground as well as earth ground. When I touch parts of the chassis I get shocked to a noticeable degree, it actually doesn't feel good at all. I noticed this effect on my garage doors as well. My theory is that something might be wrong with the earth ground and is feeding back into the chassis ground as a result. I've put a multimeter set to AC on various surfaces that shock me and it reads anywhere from 0.4V to 0.8V. Is there something I can do to fix this?",
        "created_utc": 1497931836,
        "upvote_ratio": ""
    },
    {
        "title": "Expression for reactive power in the dq0 reference frame",
        "author": "20j2015",
        "url": "https://www.reddit.com/r/ECE/comments/6ib5db/expression_for_reactive_power_in_the_dq0/",
        "text": "In most textbooks they just state it without proof as:\nVq*Id - Vd*Iq\n\nHow is this derived?",
        "created_utc": 1497924978,
        "upvote_ratio": ""
    },
    {
        "title": "Buying old(recycled)LCD panels pref. without backlight?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6iazer/buying_oldrecycledlcd_panels_pref_without/",
        "text": "[deleted]",
        "created_utc": 1497923094,
        "upvote_ratio": ""
    },
    {
        "title": "What's my life after college look like?",
        "author": "Kingofawesome13",
        "url": "https://www.reddit.com/r/ECE/comments/6iatco/whats_my_life_after_college_look_like/",
        "text": "In the fall I'll be going to college to major in Computer Engineering under the hardware aspect. I'm not exactly sure what I want to do but I leaning towards circuit/IC/SoC design or something similar. I currently live in Maine so I want to stay within New England after college. How likely is that? Would there be any opportunities in New England or am I going to have to move out west? Anyways, sorry, I'm just nervous about the future.",
        "created_utc": 1497921156,
        "upvote_ratio": ""
    },
    {
        "title": "Career advice for ECE grad student.",
        "author": "ece-engineer",
        "url": "https://www.reddit.com/r/ECE/comments/6i9393/career_advice_for_ece_grad_student/",
        "text": "Hi all!\n\nI'm a second year graduate student in Electrical Engineering from a top 20 grad school in VLSI and mixed signal design. My coursework includes VLSI design, Analog integrated circuits, ADC/DAC, microprocessor design and device physics. \n\nIn less than one year from now, I'd have to look for full time opportunities and unfortunately, I couldn't secure an internship during this summer. As a budding musician, I have spent a great deal of time in learning and designing my own guitar pedals which  helped me gain a strong foothold in the analog circuit domain / fundamentals of signal processing. Is this skill marketable to companies such as TI, NXP , Intel or Qualcomm? \n\nI've been told by many friends and other sources that it is really hard to get a full time job in analog engineering without prior work experience ( which I lack). Is this true? Or should I stick with the more conventional digital design jobs such as physical design, design verification?\n\nAny help in this matter is much appreciated.\n\nThanks",
        "created_utc": 1497903760,
        "upvote_ratio": ""
    },
    {
        "title": "Intel Discontinues Joule, Galileo, And Edison Product Lines",
        "author": "[deleted]",
        "url": "http://hackaday.com/2017/06/19/intel-discontinues-joule-galileo-and-edison-product-lines/",
        "text": "[deleted]",
        "created_utc": 1497898346,
        "upvote_ratio": ""
    },
    {
        "title": "Choosing the carrer path",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6i7dzj/choosing_the_carrer_path/",
        "text": "[deleted]",
        "created_utc": 1497888569,
        "upvote_ratio": ""
    },
    {
        "title": "Lunar/LEM Commications, from 1966, by RCA",
        "author": "spainguy",
        "url": "http://www.americanradiohistory.com/Archive-RCA-Engineer/1966-02-03.pdf",
        "text": "",
        "created_utc": 1497867638,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone give me a definitive guide to finding polarity of currents in a circuit?",
        "author": "Throw_away_7412",
        "url": "https://www.reddit.com/r/ECE/comments/6i54ti/can_someone_give_me_a_definitive_guide_to_finding/",
        "text": "I always get the polarity wrong whenever I have to assume a current through an element. ",
        "created_utc": 1497861000,
        "upvote_ratio": ""
    },
    {
        "title": "History of Sizes of Hard Disk Drive - Tech",
        "author": "ManOfToys",
        "url": "https://youtu.be/W5-UP2sFm1k",
        "text": "",
        "created_utc": 1497855752,
        "upvote_ratio": ""
    },
    {
        "title": "Software to implement Verilog/VHDL using only primitive gates?",
        "author": "AssholeBananas",
        "url": "https://www.reddit.com/r/ECE/comments/6i3x8g/software_to_implement_verilogvhdl_using_only/",
        "text": "I am looking for a piece of software where I can define a functionality using a hardware description language like Verilog then have that piece of software give me the the implemented design using only primitive logic gates (and, or, nand, etc.). However, the most popular software (vivado, quartus) seems to give the design in terms of LUTs. I understand this is done for design considerations, but my purposes are more academic. Perhaps I am missing a setting to alter how the design is translated? Is there a piece of software out there can translate high level operations such addition into a mapping of logic gates?",
        "created_utc": 1497842386,
        "upvote_ratio": ""
    },
    {
        "title": "NERC Report on 1200 MW Solar PV Interruption",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ECE/comments/6i3hy7/nerc_report_on_1200_mw_solar_pv_interruption/",
        "text": "[deleted]",
        "created_utc": 1497836974,
        "upvote_ratio": ""
    },
    {
        "title": "Ten Little Algorithms, Part 6: Green’s Theorem and Swept-Area Detection",
        "author": "jms_nh",
        "url": "https://www.embeddedrelated.com/showarticle/1058.php",
        "text": "",
        "created_utc": 1497818586,
        "upvote_ratio": ""
    }
]