[
    {
        "title": "Laundry dryer",
        "author": "nycgirl2112",
        "url": "https://www.reddit.com/r/Frugal/comments/10dkjaq/laundry_dryer/",
        "text": "Over the weekend my clothes dryer decided that it was done. It no longer makes heat, it only tumbles. I spoke to a friend of mine who is really handy and he said that the cost to repair is probably not worth it due to its age. \n\nI took some time to think about it and came to the conclusion that I’m going to try and live without one for awhile. I’m an apartment dweller so I cannot hang clothes outside. Any tips for drying sheets and towels? \n\nI was planning to just drape the sheets over a clothes rack and turn on a fan.",
        "created_utc": 1673889384,
        "upvote_ratio": 1.0
    },
    {
        "title": "What items are worth paying extra for?",
        "author": "SpookyTyme",
        "url": "https://www.reddit.com/r/Frugal/comments/10djs3a/what_items_are_worth_paying_extra_for/",
        "text": "What household items would you recommend spending more on? Which items are worth taking the cheaper variant? I’m in the process of moving out soon, and I’m wondering what items should I keep away from, even if they are cheaper? Looking to get the most bang for my buck but I don’t want it to be throwing money down the drain when there items worth spending a bit extra for.",
        "created_utc": 1673888294,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inkjet printers?",
        "author": "wcsib01",
        "url": "https://www.reddit.com/r/Frugal/comments/10dj6xc/inkjet_printers/",
        "text": "I’m tired of my f*ing ink-guzzling garbage printer. Any recommendations for an affordable, quality inkjet (black and white + color) with low long-term cost to use?",
        "created_utc": 1673887171,
        "upvote_ratio": 1.0
    },
    {
        "title": "[REVIEW] Tramontina ProLine Windsor Dinner Fork, Stainless Steel, 36 ct",
        "author": "thesunbeamslook",
        "url": "https://i.redd.it/9qdkjl9bt8ca1.png",
        "text": "",
        "created_utc": 1673886197,
        "upvote_ratio": 1.0
    },
    {
        "title": "Costco chicken tacos. Only used about 4 oz of the meat for 3 filling tacos.",
        "author": "Texas22",
        "url": "https://i.redd.it/4djw22lk2hca1.jpg",
        "text": "",
        "created_utc": 1673886034,
        "upvote_ratio": 1.0
    },
    {
        "title": "Die with Zero. Are most people are over-saving and under-living ?",
        "author": "holidayinthesum",
        "url": "https://www.reddit.com/r/Frugal/comments/10dhki5/die_with_zero_are_most_people_are_oversaving_and/",
        "text": "[removed]",
        "created_utc": 1673883399,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dental implant vs bridge",
        "author": "blackmetalwarlock",
        "url": "https://www.reddit.com/r/Frugal/comments/10dgvfi/dental_implant_vs_bridge/",
        "text": "I had my lower molar pulled, the second one, the one thats shittier to lose essentially, lol. I had already paid a lot of money getting it taken care of with root canals and such. But at this point I was sick of the tooth giving me issues and I told them to pull it. \n\nI’m just curious if anyone has ever gotten an implant, your experience and what the price looks like, if you had an option to do a payment plan, or even if you have a bridge and prefer it. I’ve seen a lot of people say they fall out, I don’t want to have to keep paying for this damn tooth lol.",
        "created_utc": 1673881707,
        "upvote_ratio": 1.0
    },
    {
        "title": "Iron vs Steamer for shirts",
        "author": "boredaf_boi",
        "url": "https://www.reddit.com/r/Frugal/comments/10dfmkj/iron_vs_steamer_for_shirts/",
        "text": "Which is frugal and better for formal shirts? Any product recommendations? \n\nWhich will work better and(or) last a long time?",
        "created_utc": 1673878580,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best cash back credit card??",
        "author": "HotPotato237",
        "url": "https://www.reddit.com/r/Frugal/comments/10dfgeo/best_cash_back_credit_card/",
        "text": "I use my cc like a debit card and pay in full every month and I am looking for the best cash back credit card. Mostly used at gas stations and grocery stores.  Currently I have the Costco card but I just quit there and want to switch cards.",
        "created_utc": 1673878133,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help",
        "author": "Financial_Pea_415",
        "url": "https://www.reddit.com/r/Frugal/comments/10df3r8/help/",
        "text": "How do I get cheap and safe international flights",
        "created_utc": 1673877212,
        "upvote_ratio": 1.0
    },
    {
        "title": "A very basic thing, but I will just about never buy hot drinks unless for a treat. The flask comes with me during travel (which is quite frequent)!",
        "author": "thelastofbill",
        "url": "https://i.redd.it/xrbcs6e7agca1.jpg",
        "text": "",
        "created_utc": 1673876501,
        "upvote_ratio": 1.0
    },
    {
        "title": "I will *never* buy a cup of tea. The flask comes with me during travel (coffee is the exception though)",
        "author": "thelastofbill",
        "url": "https://i.redd.it/pcqnvxop6gca1.jpg",
        "text": "",
        "created_utc": 1673875321,
        "upvote_ratio": 1.0
    },
    {
        "title": "I will *never* buy a cup of tea. The flask comes with me during travel (coffee is the exception, though)",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1673875236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal win: reusing candle leftovers",
        "author": "NastyGJ",
        "url": "https://i.redd.it/4tlgh0013fca1.jpg",
        "text": "",
        "created_utc": 1673861983,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Walmart's vision center offer payment plans?",
        "author": "jess32247",
        "url": "https://www.reddit.com/r/Frugal/comments/10d8l5y/does_walmarts_vision_center_offer_payment_plans/",
        "text": "Money is really tight right now and my husband desperately needs glasses. We don't have vision insurance right now but reading online it sounds like Walmart might not be the worse place to go for a cheap exam and glasses. I would call but they're closed today for the holiday. Anyone have any experience with this?",
        "created_utc": 1673855135,
        "upvote_ratio": 1.0
    },
    {
        "title": "Long-time lurker blah blah... Did you guys know about Hommus toast?",
        "author": "Arafel",
        "url": "https://www.reddit.com/r/Frugal/comments/10d7s7v/longtime_lurker_blah_blah_did_you_guys_know_about/",
        "text": "I've only just started spreading Hommus on toast, nothing else, just Hommus. It's so damn tasty!!! Like really good. How have I not know about Hommus toast? It's so good it should be a staple in every household in every country. It's cheap to but and even cheaper if you make it yourself. I'm addicted to the stuff, and it's good for you. Yum yum.",
        "created_utc": 1673852330,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's Time to Rethink Our Disposable Culture: The Urgent Need for Change",
        "author": "DiscoCandyTan",
        "url": "https://medium.com/@malka.goldfein/the-rise-of-a-disposable-culture-e989df82a814",
        "text": "",
        "created_utc": 1673850487,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a subreddit for those of us who are beyond frugal, aka: cheap?",
        "author": "Sweetnspicy77",
        "url": "https://www.reddit.com/r/Frugal/comments/10d61cb/is_there_a_subreddit_for_those_of_us_who_are/",
        "text": "(I know it’s not a good thing, but it is what it is?)",
        "created_utc": 1673846573,
        "upvote_ratio": 1.0
    },
    {
        "title": "how can I make this wall less boring with just paint?",
        "author": "jen_wexxx",
        "url": "https://i.redd.it/8gbh7rx6idca1.jpg",
        "text": "",
        "created_utc": 1673842859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need ideas on saving on internet bill",
        "author": "ahshiny",
        "url": "https://www.reddit.com/r/Frugal/comments/10d40hp/need_ideas_on_saving_on_internet_bill/",
        "text": "I live in an area that has little options for internet. On my side of town there is either Spectrum or Suddenlink... I currently have spectrum, and the bill has gone up each year. even trying to call for a discount or anything is utterly impossible.\n\nWhat are some options I have? I'm currently in the process of switching to Mint mobile, but could I get away with a different pay as you go plan and just use more data? I currently have Sprint, which is switching to T-Mobile.\n\nI stream shows and music, download books, play a couple of video games. I use a laptop for my second job daily and sometimes send numerous emails with attachments or need to be available for online training and such. I'm the only one in the household.\n\nAny insight would be helpful!",
        "created_utc": 1673840343,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is my grocery bill so high? Am I tracking it right?",
        "author": "mantra-seeker",
        "url": "https://www.reddit.com/r/Frugal/comments/10d3w2z/why_is_my_grocery_bill_so_high_am_i_tracking_it/",
        "text": "We are a 3 person family living in Nashville. I shop at Publix, ALDI’s, and Costco (occasionally a trip to Sprout’s, an organic grocery store). Our grocery bill average is $1100-$1200 each month. I do love to cook and try and buy high quality ingredients when I can, but do a lot of generics/off brands too. We do spend a LOT of money on coffee (close to $100 a month - I know, I know. I’m looking to change this). And I guess I include a lot of household items in that number, like if I buy laundry detergent with groceries at Costco I’m not going to separate those charges from one another. Side note, is that something I should do? For tracking’s sake? \n\nAnyways, I know Nashville is getting so expensive but I feel like this is just a lot for our household size. We do a lot of dairy products, milk and eggs mainly, which is all ridiculously priced right now. We don’t do a ton of meat but lots of fruit (I have a juicer I like to use).\n\nAre my numbers inflated too much because I’m including cleaning products/household items in the total? Is this something people keep separate to track? Any advice is welcome.",
        "created_utc": 1673839972,
        "upvote_ratio": 1.0
    },
    {
        "title": "Streamer vs Iron ?",
        "author": "linux_user_6967",
        "url": "https://www.reddit.com/r/Frugal/comments/10d3nvt/streamer_vs_iron/",
        "text": "I know this question have been asked a couple of times on reddit \n\nbut I don't have either for now and I need to buy one only (for both money and space efficiency)\n\nmost people seem to like streamer more but also most people with streamer mention that they had to use iron for some cases.\n\nI don't wear a lot of dress shirts but when I do I want them to look crisp, what is your suggestions ?",
        "created_utc": 1673839310,
        "upvote_ratio": 1.0
    },
    {
        "title": "Printed this to drain the cup back back into the jug of laundry detergent. Works like a charm!",
        "author": "dingledoink",
        "url": "https://i.imgur.com/bE3yHg3.jpg",
        "text": "",
        "created_utc": 1673838089,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is buying expensive boots actually frugal in the long run?",
        "author": "Spacey_fangirl",
        "url": "https://www.reddit.com/r/Frugal/comments/10d2tfy/is_buying_expensive_boots_actually_frugal_in_the/",
        "text": "My roommate and I are having a debate. We both consider ourselves to be frugal but we can have vastly different opinions on what being frugal looks like. I am currently saving up some money to get myself a nice pair of boots for everyday wear. I’ve done some research and I’m looking at paying around $300 for a pair that I can get re-soled and will hopefully last me close to the rest of my life. My roommate is telling me that this is a stupid move and frugal people should buy shoes that cost less than $100 because anything more is just extravagant/ unnecessary and not worth it. Neither of us have much money right now but I figure that I will save money in the long run, right? I’m still pretty young so I’m trying to figure out the best way to set myself up for a frugal future.",
        "created_utc": 1673836856,
        "upvote_ratio": 1.0
    },
    {
        "title": "has anyone noticed the price of lotion?...",
        "author": "2pacsnosering1",
        "url": "https://www.reddit.com/r/Frugal/comments/10d1ho4/has_anyone_noticed_the_price_of_lotion/",
        "text": "Gf and I just got back from Walmart. We live in upstate new York and it causes very dry skin. We went to restock lotion and have noticed prices have skyrocketed.....wondering everyone's frugal alternative to beating the chap of winter weather",
        "created_utc": 1673833109,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dear Frugal Reddit: What can I pack for lunch (as a student who has no access to a fridge) that's decently healthy and not full of expensive snacks?",
        "author": "RatteryTattery",
        "url": "https://www.reddit.com/r/Frugal/comments/10d15xg/dear_frugal_reddit_what_can_i_pack_for_lunch_as_a/",
        "text": "I need stuff that'll last in my lunchbox for eight hours. But I don't want to stuff my lunchbox with a bunch of crap that's not good for me or my wallet. .. But I also don't want to pack something that'll get soggy with an ice pack...",
        "created_utc": 1673832214,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aside from being frugal, how much do you spend comfortably on fun money.",
        "author": "Nomadatic818",
        "url": "https://www.reddit.com/r/Frugal/comments/10d0we6/aside_from_being_frugal_how_much_do_you_spend/",
        "text": "Just reviewing my budget and wondering what others have per month for fun money. 500? 1000? 2000?. I am almost debt free and its been years since I have extra money. But how much is a comfortable fun amount, while being frugal.",
        "created_utc": 1673831497,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got this Steelcase Series 1 for $60.",
        "author": "Dewybean",
        "url": "https://i.redd.it/3qk0bcvricca1.jpg",
        "text": "",
        "created_utc": 1673830946,
        "upvote_ratio": 1.0
    },
    {
        "title": "Canned air alternative",
        "author": "Airy_mtn",
        "url": "https://www.reddit.com/r/Frugal/comments/10d0ajw/canned_air_alternative/",
        "text": "Want to clean my PC but to buy canned air was $15.  I can buy a can with something in it like WD40 for $5.  Apart from bringing my air compressor into the house any ideas for a budget breath of fresh air for my PC.  Wood heat so it has some ash/dust to remove.",
        "created_utc": 1673829875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Buying high quality goods at discount stores or elsewhere",
        "author": "Aggressive_Elk_1780",
        "url": "https://www.reddit.com/r/Frugal/comments/10czstv/buying_high_quality_goods_at_discount_stores_or/",
        "text": "So I like to buy high quality things that last when it comes to backpacks and other daily use items. \nI’ve been scouring Facebook marketplace, Craigslist and places like TJ Maxx etc. \nI’ve been thinking to check out consignment stores, where else should I look to get a steal on high quality goods? Thanks!",
        "created_utc": 1673828590,
        "upvote_ratio": 1.0
    },
    {
        "title": "Foodie-Frugal Tenderloin",
        "author": "original_al",
        "url": "https://i.redd.it/f72zf7kq7cca1.jpg",
        "text": "",
        "created_utc": 1673827234,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dropped a box of butter crackers, now just crumbles. What can I do with these?",
        "author": "Ozymandias515",
        "url": "https://www.reddit.com/r/Frugal/comments/10cyo77/dropped_a_box_of_butter_crackers_now_just/",
        "text": "I pulled out a box of townhouse crackers from my pantry, only to discover all the box was most likely dropped by someone in my house and all the sleeves contain nothing but broken crackers. Any ideas on the best way to use these besides using them as a topping for a casserole?",
        "created_utc": 1673825753,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which is better for groceries: shopping weekly ads versus 'cheap' stores?",
        "author": "4jY6NcQ8vk",
        "url": "https://www.reddit.com/r/Frugal/comments/10cxyd3/which_is_better_for_groceries_shopping_weekly_ads/",
        "text": "Which is a better strategy? Reading the weekly ad's for the mid-tier grocery stores (think Safeway-owned stores, Kroger-owned stores) or just doing grocery shopping at Walmart, Aldi, etc., which don't really do weekly ads (ok, Aldi's does) but generally require less couponing.",
        "created_utc": 1673823980,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is tofu more economical than other meat sources?",
        "author": "temp225566",
        "url": "https://www.reddit.com/r/Frugal/comments/10cxxar/is_tofu_more_economical_than_other_meat_sources/",
        "text": "Anyone tried it?",
        "created_utc": 1673823911,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ice Shanty",
        "author": "Spearfish87",
        "url": "https://www.reddit.com/gallery/10cxllf",
        "text": "",
        "created_utc": 1673823139,
        "upvote_ratio": 1.0
    },
    {
        "title": "So, you want to try growing your own food?",
        "author": "tartymae",
        "url": "https://www.reddit.com/r/Frugal/comments/10cwxdj/so_you_want_to_try_growing_your_own_food/",
        "text": "One of the memes that makes regular rounds on r/gardening and r/MightyHarvest is about spending $250 dollars to grow a $0.25 cent vegetable.\n\nIf you want to garden effectively you have to know your soil, you have to know your climate, and you have to know pest control.  (Evil fekkin grub worms are THE worst!)\n\nFor example, I live in the US Desert Southwest and my ground is hard clay soil.  I'm never going to get good carrots, and almost all leafy greens are winter/spring crops where I live, because it's hot enough for them to start bolting (flowering and turn bitter) by early May.  I LOVE \"ground cherries\", but I can't grow them where I am, because by the time there is enough sunlight for them to thrive, it's about to be much MUCH too hot for them to live.\n\n**You are best if you start small with container gardening (growing in pots).**  This will give you an idea of the time and commitment that gardening needs without an outlay of $$$$ up front.  \n\nIf you aren't going to grow in pots, then try a small plot that gets decent sunlight, but not sun all day and loosen up the ground before planting.  (Look for signs of soil contamination as you do this -- you don't want to plant on the place where the builder dumped all their waste, or where grandpa dumped his used motor oil.)\n\nAnd, all of that said, here are 4 foods that, in my experience, are nearly impossible to kill, grow in bad soil, can take heat and neglect, and if you let them go to seed, they are \"enthusiastic volunteers\" meaning you plant once and eat them many times going forwards.\n\n1) Arugula (aka Rocket).  Is great in salads, can be cooked like turnip/mustard/collards, and can be made into pesto.  Bees love the flowers when they bolt.\n\n2) Purslane.  Is best eaten young, in a salad, sauteed, or mixed into a soup.  Is one of the most nutritious plants on earth.  There are versions that have been bred for gardening, but you may already have wild purslane in your yard.  (And if the sap of the plant you just picked in your yard is milky, it's Spurge, and poisonous.)\n\n3) Orach.  Does great in alkaline salty soils.  Use the leaves like you would use spinach, or grapeleaves.  Does not get bitter when bolted.  Will shoot up tall seed stalks that birds love to eat.  \n\n4) Garden Huckleberry/Chichiquilite.  A cousin of tomatoes.  The ripe purple berries are great in salads, in tomato sauces, on pizza, and if you add sugar and a pinch of baking soda, you can make pie.\n\nIf you want to know where to find these:  I have used Seed Saver's Exchange, Adaptive Seeds, and Native Seeds Search and been satisfied with their customer service.  You can also look for the heirloom seed seller in your area, and ask them what is hard to kill and grows well in your area.\n\nAnd, finally, we're pretty laid back in r/gardening and you can always ask for help and advice.",
        "created_utc": 1673821512,
        "upvote_ratio": 1.0
    },
    {
        "title": "Take advantage",
        "author": "crachelecash72",
        "url": "https://www.reddit.com/r/Frugal/comments/10cwrao/take_advantage/",
        "text": "This is the time of year to stock up on home canned legumes!",
        "created_utc": 1673821095,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saving on Garbage removal",
        "author": "hsmamato2",
        "url": "https://www.reddit.com/r/Frugal/comments/10cw07y/saving_on_garbage_removal/",
        "text": "This is one thing in my budget I can't seem to figure out! We live in a town where we have to pay a service,with those 2 giant cans to take the weekly garbage and recycling..... It costs about $37 a month, and we rarely even fill the can halfway!some weeks it's just a bit in the bottom, it feels so wasteful! Our local dump won't take household garbage (I wish they did b/c I'd rather pay by the pound and bring it down myself)   any ideas out there?",
        "created_utc": 1673819288,
        "upvote_ratio": 1.0
    },
    {
        "title": "and to top it, we made a bendable \"Purple\" plushie from Rainbow friends, from the left-over scraps",
        "author": "LittleMissEmmet",
        "url": "https://i.redd.it/hnt39b0rjbca1.jpg",
        "text": "",
        "created_utc": 1673819167,
        "upvote_ratio": 1.0
    },
    {
        "title": "3D printed drain for laundry detergent.",
        "author": "TracyF2",
        "url": "https://i.imgur.com/bE3yHg3.jpg",
        "text": "",
        "created_utc": 1673819118,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm 19 and I wasted so much money, it bothers me.",
        "author": "Soggy-Expression7895",
        "url": "https://www.reddit.com/r/Frugal/comments/10cvrbr/im_19_and_i_wasted_so_much_money_it_bothers_me/",
        "text": "[removed]",
        "created_utc": 1673818671,
        "upvote_ratio": 1.0
    },
    {
        "title": "Update: A couple weeks ago, I posted about a $9 cauliflower head. At the same market this week, they are now $1 each. No idea if this was a mistake on their part or what. I will be eating cauliflower again, yay.",
        "author": "TheSlothyGirl",
        "url": "https://www.reddit.com/r/Frugal/comments/10cvc3o/update_a_couple_weeks_ago_i_posted_about_a_9/",
        "text": "Original post: [https://www.reddit.com/r/Frugal/comments/zxxqz1/how\\_much\\_is\\_cauliflower\\_in\\_your\\_area\\_in\\_my\\_local/?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3](https://www.reddit.com/r/Frugal/comments/zxxqz1/how_much_is_cauliflower_in_your_area_in_my_local/?utm_source=share&amp;utm_medium=web2x&amp;context=3)",
        "created_utc": 1673817662,
        "upvote_ratio": 1.0
    },
    {
        "title": "What store/generic brands are hit or miss?",
        "author": "MaddenMike",
        "url": "https://www.reddit.com/r/Frugal/comments/10cv1jj/what_storegeneric_brands_are_hit_or_miss/",
        "text": "Another post about nacho dip gave me the idea for this post. Switching from a brand name to a store or generic and be hit or miss. What store brands have been hits for you (as good or better than the brand) and which were epic fails?\n\nFor me: Walmart Oreos: hit!, Walmart cheese in a squeeze can: hit, Aldi's cheese in a can: miss. Walmart peanut butter: hit.",
        "created_utc": 1673816978,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are you living a frugal life?",
        "author": "tzt1324",
        "url": "https://www.reddit.com/r/Frugal/comments/10ctypn/why_are_you_living_a_frugal_life/",
        "text": "Is it more a necessity or a lifestyle? Or both?",
        "created_utc": 1673814474,
        "upvote_ratio": 1.0
    },
    {
        "title": "Only 4 in 10 Americans can right now come up with $1000 for emergency",
        "author": "curiousminnd",
        "url": "https://www.makesaveandinvest.com/why-its-important-to-have-an-emergency-fund/",
        "text": "",
        "created_utc": 1673812457,
        "upvote_ratio": 1.0
    },
    {
        "title": "Maximize Amazon Gift Cards",
        "author": "FigureSevere8950",
        "url": "https://www.reddit.com/r/Frugal/comments/10crrvv/maximize_amazon_gift_cards/",
        "text": "I haven’t seen this shared anywhere but if you’re in the US and receive Amazon.com gift cards, you can use those to buy other Gift Cards sold on Amazon.\n\nIn 2022, I used Amazon gift cards to buy:\n\nGROCERY \n- Whole Foods\n- Instacart\n\nTRAVEL:\n- Delta\n- Amtrak\n- Southwest\n- Airbnb\n\nRESTAURANTS:\n- DoorDash\n- Grubhub\n \nThere are a ton of great options! Buying up gift cards for products/services I actually use helps my money go farther and keeps me from buying useless crap that will ultimately go to a landfill. \n\nEven if the stores listed aren’t the most frugal options, my stockpile of old Amazon gift cards has offset future grocery bills, helped me travel to a few cities on my bucket list and even saved me a few bucks upgrading my wardrobe.\n\nHope this helps!",
        "created_utc": 1673809264,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cheapest form of dishwasher detergent?",
        "author": "Careful_Interaction2",
        "url": "https://www.reddit.com/r/Frugal/comments/10cprtb/cheapest_form_of_dishwasher_detergent/",
        "text": "Which saves more money? Powder, liquid, or pods? I know with my washing machine I save with powder, but not sure if it’s the same for dishwashers!",
        "created_utc": 1673804533,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do i constantly remind myself to be frugal and not spend unnecessarily. I feel like sometimes I tell myself I’ll start but I find myself doing stupid things like Uber eats,door dash, etc",
        "author": "HumblyEgotistical",
        "url": "https://www.reddit.com/r/Frugal/comments/10con35/how_do_i_constantly_remind_myself_to_be_frugal/",
        "text": ".",
        "created_utc": 1673801824,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to handle critical family members who insist that you're being \"too frugal\" or \"cheap\"?",
        "author": "ir0nuckles",
        "url": "https://www.reddit.com/r/Frugal/comments/10coego/how_to_handle_critical_family_members_who_insist/",
        "text": "Basically the title. I have family members who are too up in my business, telling me that I \"deserve\" to spend more, get far too involved into my finances and telling me how I should be spending my money. How do I (politely or impolitely) tell them to leave me alone?\n\nPersonally I really like being frugal, even when I could \"afford\" to \"splurge\" on something. I simply do not find any value or comfort in spending money frivolously. Once in a while I do buy something that I technically could do without, like a nice kitchen item, but I make sure that that it will last me for years and it is something I really will get use out of. \n\nI have a lot of family that is more the typical American consumer, buying everything on a whim, no planning, filling their houses to the point of bursting with stuff, hundreds of kitchen appliances, electronics, etc. My inspiration is the minimalists in Japan who have only a few things, but make great use out of them, and still live great lives without clutter and needless financial strain from excess spending. \n\nIs there any point in trying to argue with anti-frugal people? How do you handle this?",
        "created_utc": 1673801227,
        "upvote_ratio": 1.0
    },
    {
        "title": "Watch the web page and check receipts…”frugal” win.",
        "author": "greyisgorgeous999",
        "url": "https://www.reddit.com/r/Frugal/comments/10cn2sf/watch_the_web_page_and_check_receiptsfrugal_win/",
        "text": "I looked online using Walgreens app for some wrist splints for sleeping (carpal tunnel from too much time on Reddit I’m sure! 😏). App showed $14.99 with two available for pickup at the Walgreens just around the corner. Since I was going to be out and about before the time they’d be ready, I decided to just “run in”. My spouse was with me and we were chatting so I didn’t notice the price on receipt until we got home. They’d charged $34.99 EACH! $20 more than online price. I went back a couple days later with splints and receipt, manager did give a refund, but told me that their app and web page is frequently cheaper than in store! The thing is, if it had been just a dollar or so more expensive I might not have noticed it. $40 difference I noticed!!!",
        "created_utc": 1673797993,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cost of using my baseboard heaters vs a 1500watt wall one. Which would be more economically smart? Keeping the smaller one running to keep a steady temp vs my 37500watt baseboards kicking on and off on and off.",
        "author": "fitnessnerdomniman",
        "url": "https://i.redd.it/rhhnbz0gs9ca1.jpg",
        "text": "",
        "created_utc": 1673797876,
        "upvote_ratio": 1.0
    },
    {
        "title": "Decaf Cold coffee drinks",
        "author": "cysgr8",
        "url": "https://www.reddit.com/r/Frugal/comments/10cmwfv/decaf_cold_coffee_drinks/",
        "text": "My partner buys a decaf iced coffee at work every day and it adds up. I make him one in the morning myself and he's fine with that, but they dont taste as good when made in the morning and saved till \\~3PM. I'd like to buy some sort of chilled ready made beverage but cant find a single one that is decaf. Though these are not ideal at $\\~1-2/drink its still cheaper than the $3-4 drink he buys today. Does anyone know of any decaf ready made coffees, or do you have any suggestions? Thanks in advance",
        "created_utc": 1673797537,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saving money tips!",
        "author": "vank210",
        "url": "https://www.reddit.com/r/Frugal/comments/10cmtmv/saving_money_tips/",
        "text": "[removed]",
        "created_utc": 1673797338,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fast Food Reward App Hacks",
        "author": "DadWasRapedManyTimes",
        "url": "https://www.reddit.com/r/Frugal/comments/10cm6os/fast_food_reward_app_hacks/",
        "text": "[removed]",
        "created_utc": 1673795655,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cost of food. USDA",
        "author": "Em_b_",
        "url": "https://www.reddit.com/r/Frugal/comments/10cl6ln/cost_of_food_usda/",
        "text": "These reports always publish a couple months behind, but……\n\n1-  how does your spending or budget match up?\n\n2- if under, what are your strategies?\n\n[uSDA cost of food](https://fns-prod.azureedge.us/sites/default/files/media/file/CostofFoodNov2022LowModLib.pdf)",
        "created_utc": 1673792909,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mens fragrance suggestions",
        "author": "Townsend7",
        "url": "https://www.reddit.com/r/Frugal/comments/10ckzgm/mens_fragrance_suggestions/",
        "text": "Any suggestions on something I can wear at work or for casual occasions to smell nice without breaking the bank?",
        "created_utc": 1673792346,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone have a good homemade laundry detergent recipe?",
        "author": "nikkishark",
        "url": "https://www.reddit.com/r/Frugal/comments/10ckp50/anyone_have_a_good_homemade_laundry_detergent/",
        "text": "My daughter has sensitive skin, so I need something unscented and I can't find any Fels Naptha that doesn't have fragrance, and every recipe I've come across calls for it.",
        "created_utc": 1673791532,
        "upvote_ratio": 1.0
    },
    {
        "title": "52$ at Trader Joe’s for what would probably be 80$ anywhere else",
        "author": "thrashgender",
        "url": "https://i.redd.it/snces2s359ca1.jpg",
        "text": "",
        "created_utc": 1673790027,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you keep gas cost low",
        "author": "Berserkgutx",
        "url": "https://www.reddit.com/r/Frugal/comments/10cjann/how_do_you_keep_gas_cost_low/",
        "text": "First time moving out. Got my first bill of almost 75 dollars. Which doesn't sound like a lot. But that month of December I was mostly away visiting family. So it's almost 100 dollars for an apartment that wasn't really running anything. I kept the heat low at 65, but stove and water wasn't being used for about 3/4 of the month. So if it's nearly 100 for not being there, I'm a bit worried about what I'm going to see when I get my next bill now that I've been fully using the stove, water, etc more actively \n\nWell tbf only 26.48 is gas charges. Rest are some bs AGL pass through charge, taxes, CS fee, but yeah",
        "created_utc": 1673787615,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much do you spend on groceries in a month?",
        "author": "dtgray12",
        "url": "https://www.reddit.com/r/Frugal/comments/10cj655/how_much_do_you_spend_on_groceries_in_a_month/",
        "text": "I've been trying to cut down on expenses and groceries is one of them. So far I spend around $200-$300 a month on the bare necessities. Some items I've tried to cheap out on but I ended up having to get a better brand cause of how bad the generic is.\n\nI usually get my groceries weekly at a spending around $50-$80. Not everything at once by I spread it out on based on current necessities. I've tried to apply for SNAPS but I was rejected even though I live paycheck to paycheck.\n\nMy usual list comprises of:\n\n&amp;#x200B;\n\n|*Item*|*How Often?*|*Price (rounded)*|\n|:-|:-|:-|\n|Bread|Bi-weekly|$1.5|\n|Hot Dog Buns|Weekly|$1|\n|Burger Buns|Weekly|$1|\n|Strawberries|Bi-weekly|$5|\n|Apples|Bi-weekly|$5|\n|Bananas|Weekly|$2|\n|Coffee (Starbucks brand)|Bi-weekly|$10|\n|Meat (chicken/pork/beef)|Weekly|$5-$10|\n|Lunch meet|Bi-weekly|$4|\n|Cheese Slices|Monthly|$3|\n|Hot Dogs|Weekly|$5|\n|Instant Noodles|Monthly|$5|\n|Cookies|Monthly|$4|\n|Condiments|Bi-monthly|$3|\n|Frozen Vegetables|Monthly|$5|\n|Drinks (Sodas/Juices)|Bi-weekly|$10|\n|Water|Monthly|$5|\n|Toilet Paper|Bi-monthly|$10|\n|Dish soap|Bi-monthly|$1|\n|Laundry detergent|Bi-monthly|$7|\n|Garbage bags|Bi-monthly|$5|\n|Dog Food|Bi-weekly|$15|\n|Yogurt|Monthly|$3|\n|Cereal|Monthly|$5|\n|Soap|Bi-monthly|$5|\n|Shaving cream|Bi-yearly |$4|\n|Razors|Quarterly|$4|\n|Milk|Monthly|$3|\n|Butter|Monthly|$1|\n|Cream Cheese|Bi-monthly|$2|\n|Rice/Noodles|Bi-monthly|$5|\n|Coffee Creamer|Bi-weekly|$5|\n|Medicine (Tylenol, Benedryl)|Annually|$10|",
        "created_utc": 1673787225,
        "upvote_ratio": 1.0
    },
    {
        "title": "$15/month unlimited data and voice plan",
        "author": "pawnmaster89",
        "url": "https://www.reddit.com/r/Frugal/comments/10choey/15month_unlimited_data_and_voice_plan/",
        "text": "Through Visible. Runs on Verizon’s network. No catch, no need for multiple lines to get the discount, unlimited everything. I’ve been really impressed with the service and the price. It goes up to $30/month after a year which is still a steal. I hope the mods don’t take this down because I’m not an advertiser and I have a well used and old Reddit account. I really just want to tell people about this.",
        "created_utc": 1673782465,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you save money on period products?",
        "author": "catkibble",
        "url": "https://www.reddit.com/r/Frugal/comments/10cgh9w/how_do_you_save_money_on_period_products/",
        "text": "content warning for talk of genitals- \n\ni 23F have a pretty heavy flow (i'm ok, been checked out by doctor) and my period lasts 4 days. I use those adult diapers meant for women after child birth for my flow and they cost $19 for a pack of 9. \n\nI've been recommended a diva cup but i'm unsure if that would work for me. The cheapest Diva cup available to me is $42 and i don't want to spend that much money on something that might not work for me.\n\nI have a weird disorder? condition? (been looked at but condition hasnt been named) where my vaginal opening is just way too small and can't really put anything up there so unless the diva cup and be folded into 1cm then i don't think it'll suit me. \n\nAre there any tips for saving money on periods? Or should i just accept my fate of being a women and deal with this? $19 every one and a half months effects me more than you know as i make minimum wage. \n\nI recently healed from a shopping addiction so my money saved from not spending it will help but id still rather not spend $19 on period diapers.\n\nAm i being a cheapskate or frugal with this? i don't want to be a cheapskate as cheapskates tend to let money rule their entire life.",
        "created_utc": 1673778200,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cheapest Way To Move (1000 Miles)",
        "author": "phosphor-feel",
        "url": "https://www.reddit.com/r/Frugal/comments/10cd6sj/cheapest_way_to_move_1000_miles/",
        "text": "Hey all, i'm making the move from Los Angeles to Portland soon, will be about 960 miles total distance. I have an old/used car that can't really make the drive, so my options are to either tow it, or ship it. I have about 2 cars (sedan) worth of stuff to bring.   \n\n\nSo far, i've checked some options. I heard, on average, shipping my old car is about $1 a mile up to 500 miles, then $0.75 up to 1000 miles. That would run me about $845. However This leaves an additional car load of stuff i need to bring.  \n\n\nI'm not even sure if this is allowed or possible, but could i rent a car (i seen an suv would be about $296 for the trip from LA to Portland), load it with the rest of my stuff, and drive up... i did a quick calculation and gas would be about $165. that brings me to about $1,310. This method would be: Ship car and drive rental with the rest of my stuff.  \n\n\nthe uhaul method would be a 10' truck, with the auto transport tow to load my car onto. Cheapest option for me runs $1500. Supposedly the uhaul gets 12 mpg, but im towing my car, so if it drops to say 9mpg, that'd leave me with $460 charges in gas!   \n\n\n**unless im mistaken: uhaul + tow method = roughly $1960.    Shipping my car + drive/load rental = $1310.**  \n\n\nAre my numbers off? Any advice or alternative methods I should explore? any help would be amazing.",
        "created_utc": 1673765814,
        "upvote_ratio": 1.0
    },
    {
        "title": "What in the hell is going on with eggs right now?",
        "author": "Shiney_Flights",
        "url": "https://www.reddit.com/r/Frugal/comments/10ccg4y/what_in_the_hell_is_going_on_with_eggs_right_now/",
        "text": "I just spent $4 on 12 eggs. I went to two different Krogers in the northern KY area, and the price was the same. $6 for 18, $20 for a 60 pack. That's a higher price per gram of protein than both locations were charging for ground beef 80/20 ($3/lb). 1lb of ground beef and a dozen eggs have about the same protein, about 70grams, but ground beef is easily 10X more expensive to produce. If these egg prices are right, the ground beef should be $40 per pound. Am I taking crazy pills or is Kroger price gouging eggs?",
        "created_utc": 1673763205,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just finished my 1-year-no-buy and this is what I did to survive it + what I learned:",
        "author": "already_night",
        "url": "https://www.reddit.com/r/Frugal/comments/10cc38f/i_just_finished_my_1yearnobuy_and_this_is_what_i/",
        "text": "Hi guys! I've been a lurker of this subreddit for about a year and I thought I'd share my story of how I managed to break free from my bad habits.\n\n\nConsumerism got the best of me and at the end of 2020 I suddenly woke up and realized how bad I let it all get. Spending all the money I made in my early and mid 20s on pretty much nothing but clothes, bags, shoes, makeup. Like... a lot. So much I had ran out of space for shoes and clothes and half weren't even worn because who has time for all those? I went from wanting to own every bag in every color and building a closet just for them (thanks crigy YT videos for the idea) to being overwhelmed and ashamed with how much I had. \n\n\nSo I said \"enough is enough\" and decided a detox was needed. Perhaps a whole lifestyle change. So I decided to make 2022 my no buy year. No new clothes. No shoes. No new bags. No new accessories. No new makeup, skincare, jewelry. You name it. \nSo what did I do for one whole year? \n\n\n- First, for an entire year I focused on selling most of the things I never wore or bought on an impulse. I must have sold 50% of everything I had. I couldn't stand the feeling of being suffocated by my own stuff anymore. \n\n\n- Learned to sew and repair rather than throw away and buy more. I fixed shoes with just some cheap plain glue made for shoes. \n\n\n- As I was running out of make up products, I started to just use the remaining ones trying new looks with just what I had on hand and trying to get creative with what I had rather than buy was so much fun. \n\n\n- Ran out completely of skincare products midway, so I just continued to use simple items like coconut oil as moisturizer, coffee and honey as scrub and that was a huge revelation for me! I don't think I'll ever buy skin care again except for sunscreen. \n\n\nThis year has completely changed the way I see certain things now. I'd definitely try this challenge again. \n\n\nWhat about you guys? Have you ever tried the 1y no buy? Would you give it a shot?",
        "created_utc": 1673762027,
        "upvote_ratio": 1.0
    },
    {
        "title": "Consider stocking up on fruits, vegetables (freeze and dehydrate for storage), other CA foods. Prices are about to rise",
        "author": "sexmountain",
        "url": "https://v.redd.it/acp3mq8jg6ca1",
        "text": "",
        "created_utc": 1673757561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switching to homemade pizza, our experience so far.",
        "author": "HoundDogAwhoo",
        "url": "https://www.reddit.com/r/Frugal/comments/10cakut/switching_to_homemade_pizza_our_experience_so_far/",
        "text": "[removed]",
        "created_utc": 1673757237,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made my own luxury cleanser. UltraBland is $33 for 3.5oz from Lush.. or about $10 for 14oz via this DIY!",
        "author": "dltx9",
        "url": "https://www.reddit.com/gallery/10c85kz",
        "text": "",
        "created_utc": 1673749954,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just found out my city's library card comes with unexpected benefits - free admission to the local zoo, museums, etc. Check and see if those are available to you.",
        "author": "AnticitizenPrime",
        "url": "https://www.reddit.com/r/Frugal/comments/10c834e/i_just_found_out_my_citys_library_card_comes_with/",
        "text": "Just found out today that my library card allows free admission to the zoo, local museums, etc. There's a bit of a process - you can't just show up with the library card in hand, otherwise it would just be like a season pass - you have to go online and pick a date and 'redeem' your free tickets, etc. I can see why, it would be problematic if everyone just showed up and flashed their library card to get in, so they bake a little bit of effort into the process. But hey, it's free and can make for some frugal dates or just entertaining ways to pass the time.",
        "created_utc": 1673749767,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made my own luxury cleanser. UltraBland is $33 for 3.5oz from Lush.. or about $10 for 14oz via this DIY!",
        "author": "dltx9",
        "url": "https://www.gigisadventures.net/diy-lush-ultrabland-facial-cleanser-lush-copycat-recipe/amp/",
        "text": "",
        "created_utc": 1673749286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tablets for the extended family",
        "author": "New-Difference9684",
        "url": "https://www.reddit.com/r/Frugal/comments/10c6rdr/tablets_for_the_extended_family/",
        "text": "My SO will be visiting her family. She has a rather large, extended family across several cities in the region she’s going to.  By comparison to her relatives, she and I are quite well off financially.  She want to give four of her nieces each a digital tablet.  \n\nAny recommendations on decent quality, lower priced digital tablets?  I would like to avoid spending $2k plus.",
        "created_utc": 1673746016,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rain checks-they are still a “thing”!!",
        "author": "Spectrachic311311",
        "url": "https://www.reddit.com/r/Frugal/comments/10c61d4/rain_checksthey_are_still_a_thing/",
        "text": "Our local Kroger had chicken breast on sale for $1.99/lb with a coupon. They were out of it so I went to the service desk and got a raincheck. Now I can go back next week and get my sale price chicken! Always ask for a rain check if the store is out of the coupon or sale price item!",
        "created_utc": 1673744046,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone ELI5 veggie storage and buying reasonable amounts of produce for a single person household?",
        "author": "sleepyhoagie",
        "url": "https://www.reddit.com/r/Frugal/comments/10c5o7e/can_someone_eli5_veggie_storage_and_buying/",
        "text": "I got some bagged salad mix (decidedly not frugal I know, but I’m a single person and can only eat but so much greens) and I feel like it was getting wilted even before I opened the box. \n\nAccidentally ruined a pot of food I was sautéing because I didn’t realize my garlic cloves were moldy (precut so also not frugal). \n\nI’ve got an open styrofoam container of broccoli florets that I don’t know if they’re still good or not. I tore open the Saran Wrap around them to get one serving a few nights ago and just… put ‘em back in the fridge like that. I wasn’t sure what else to do. \n\nAre there less expensive ways to get single servings of salad and fresh veggies for one person? How do I store what I buy to keep it fresh as long as possible?",
        "created_utc": 1673743043,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where do you find coupons for local grocery stores? Or easy way to compare stores?",
        "author": "Amun-Aion",
        "url": "https://www.reddit.com/r/Frugal/comments/10c5cac/where_do_you_find_coupons_for_local_grocery/",
        "text": "I live in a big city and mainly go to HEB since it's across the street from me, but I frequently see Aldi's mentioned in this sub, as well as people talking about saving tons of money with coupons.  I don't get the newspaper, and usually when I google for coupons I just get a bunch of very fake sounding websites. That said, I did find on HEB's website they have coupons for various items so I'll try and use those in the future.  Sometimes I see people talking about how they found a local grocer having a sale: do you go to every store (or every website I'm assuming would be easier) or is there a better way to find deals and compare prices between stores?",
        "created_utc": 1673742180,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aldi find: clearance stuffing for cheaper meatloaf",
        "author": "newheartwithin",
        "url": "https://i.redd.it/4mkdwjgn65ca1.jpg",
        "text": "",
        "created_utc": 1673742123,
        "upvote_ratio": 1.0
    },
    {
        "title": "If anyone likes iced tea hurry up before they raise the prices. Amazon has 48 one gallon tea bags on sale 45% off right now for some reason. Its 5 dollars so that works out to 10 cents a gallon almost. Max you can order is 5. It was already cheap at 10 bucks but im stocking up at 5",
        "author": "Butt_Fucking_Smurfs",
        "url": "https://www.reddit.com/r/Frugal/comments/10c4zo6/if_anyone_likes_iced_tea_hurry_up_before_they/",
        "text": "Normally I drink about 5 gallons of tea a day since I went sober. Amazon has had a sweet deal at $10 per unit of 48. And that's gallon sized bags. So it's around 20 cents a drink for me. Last night I went looking on the buy again page and was going to pick some up when I noticed it was now $5. That can't be right I said. I put the max allowed in my cart and went to pay and it went through. 48 gallons of iced tea, Lipton brand even, for 5 bucks. At 10 cents a gallon I'm going to have a few people I know buy the max and pay them so I don't have to buy any more in 2023.",
        "created_utc": 1673741271,
        "upvote_ratio": 1.0
    },
    {
        "title": "paid 25cents to go to the movies",
        "author": "etna1999",
        "url": "https://www.reddit.com/r/Frugal/comments/10c4xx6/paid_25cents_to_go_to_the_movies/",
        "text": "the other day while walking home from work, I found a $30 gift card to a cinema in my area. the pin on the back was scratched off so I figured it was already used but decided to check anyway. \n\nit still had the $30 on it and I had a few months till it expired. \n\ndecided to go see a movie today and it came to $30.25 (ticket + L popcorn) \n\nthank you random gift card ☺️🫶🏻",
        "created_utc": 1673741139,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone have any advice on how to budget lol",
        "author": "unreallydead",
        "url": "https://www.reddit.com/r/Frugal/comments/10c4tns/anyone_have_any_advice_on_how_to_budget_lol/",
        "text": "I have no idea how to budget. I'm 24. I think I should know some stuff by now. I am currently in an overdraft. I need help. Everyone else around me is in the same position",
        "created_utc": 1673740823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Store brand vs Commercially branded food",
        "author": "Bellebutton2",
        "url": "https://www.reddit.com/r/Frugal/comments/10c4qzt/store_brand_vs_commercially_branded_food/",
        "text": "What store brand food(s) do you find to be as good or better than commercial brands?",
        "created_utc": 1673740645,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free refrigeration with high performance cooler concept has been working. Powered only with daily cold pack change from the chest freezer or outdoors when the weather is cold enough. Outside placement during cool spring and fall weather was nearly effortless to support here in Canada.",
        "author": "OldCanary",
        "url": "https://i.redd.it/5d1e4vocg3ca1.jpg",
        "text": "",
        "created_utc": 1673740256,
        "upvote_ratio": 1.0
    },
    {
        "title": "What $9 can get u when using coupons @ the piggly wiggly in the New Orleans metro area (veggie &amp; pork meal for 3)",
        "author": "dontcrysenpai",
        "url": "https://i.redd.it/7eoe31nvz4ca1.jpg",
        "text": "",
        "created_utc": 1673739844,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else raised well off and now frugal?",
        "author": "mcr0414",
        "url": "https://www.reddit.com/r/Frugal/comments/10c3xsi/anyone_else_raised_well_off_and_now_frugal/",
        "text": "I have a hard time going back home. I just have never understood it. My parents always had money and I had really nice stuff growing up and def got a nice car for my 16th birthday and stuff. When  I turned 18 I moved across the country and had no support from my parents saying they didn’t support my decision. I really learned the value of a dollar. I am now and since then the cheapest person. I never shop. Cut my own hair, reuse multiple things. I make things last. Lots of dyi. I make good money and worked my ass off to get to that point. But now I hate going home. I hate seeing how my family just blows money when people are seriously struggling. I spend alot of my time doing charity work and giving back and it kills me seeing people care about stuff like a name brand. Can anyone relate? I just don’t know how to go about going home and not being so sad and upset with how others choose to spend their money. It’s actually really effecting my family relationships.",
        "created_utc": 1673738553,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal first time home buyers, any tips or things you wish you’d known?",
        "author": "IronMushroom2",
        "url": "https://www.reddit.com/r/Frugal/comments/10c1cnl/frugal_first_time_home_buyers_any_tips_or_things/",
        "text": "[removed]",
        "created_utc": 1673733438,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if you remove some of the oil from peanuts to make them more nutritious relative to how much you would eat of them",
        "author": "PaddiM8",
        "url": "https://www.reddit.com/r/Frugal/comments/10c12a3/what_if_you_remove_some_of_the_oil_from_peanuts/",
        "text": "Peanuts are cheap and contain a lot of protein. But they also contain a lot of fat. So, what if you extract some of the oil? Then you have peanut paste (or something) that you can use in cooking, and you can use more of it and get more nutrition since it's more balanced. Then, as a bonus, you also get some peanut oil.\n\nDoes it work like this? Has anyone tried? Extracting some of the oil doesn't seem too difficult.",
        "created_utc": 1673733023,
        "upvote_ratio": 1.0
    },
    {
        "title": "work commute questions",
        "author": "L3mmyKilmister",
        "url": "https://www.reddit.com/r/Frugal/comments/10bztps/work_commute_questions/",
        "text": "Not sure if this belongs on here.  Sorry.  But. . .is it worth it to drive to work 80 minutes a day--5 days/40 hours per week for $17.45/hr? \n\nThis is worded terribly.  My apologies but  my powers of editing aren't working today.  I'm feeling like it's not worth it but I want some opinions.  Please be kind.  Thanks guys!",
        "created_utc": 1673731221,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saving money fail today. My son wanted nachos and tacos this week. I usually get Tostitos cheese in jar but thought I’d get store brand. I didn’t realize this was cheddar flavored and not cheddar cheese. This tasted horrible with a bad after taste.",
        "author": "CruelTasteOfLust",
        "url": "https://i.redd.it/po5hb6mw84ca1.jpg",
        "text": "",
        "created_utc": 1673730773,
        "upvote_ratio": 1.0
    },
    {
        "title": "I do not like the protein powder I bought. any ideas how I can consume it?",
        "author": "corrie881",
        "url": "https://www.reddit.com/r/Frugal/comments/10byijn/i_do_not_like_the_protein_powder_i_bought_any/",
        "text": "As per title, I bought this vegan protein powder, but totally not liking the taste. I am not vegan, just lactose intolerant. I tried mixing with almond milk, mixing in some fruit, baking... but the taste is just 🤮. \n\nAny other ideas/ recipes I can make? I do not want to throw the whole pack. :(",
        "created_utc": 1673728207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can a single person currently eat on $30 a week?",
        "author": "ProfessionalLanky294",
        "url": "https://www.reddit.com/r/Frugal/comments/10by7uy/can_a_single_person_currently_eat_on_30_a_week/",
        "text": "Big 6 ft. tall male coworker says he spends only $30 a week in groceries. I cannot comprehend how that's possible. Is he bullshitting or is this really doable. How would one be even able to do this? Skipping meals? This is in a HCOL city by the way.",
        "created_utc": 1673727469,
        "upvote_ratio": 1.0
    },
    {
        "title": "remember my kiddo's mask-crestions of poppy playtime chars? Now it's Rainbow Friends - masks made out of cardboard, that counts as cool. \"Purple\" and \"Green\". Cardboard + cloth",
        "author": "LittleMissEmmet",
        "url": "https://i.redd.it/35lud7y5y3ca1.jpg",
        "text": "",
        "created_utc": 1673727160,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's a good way to get free money without a loan to frugal a discount on basic 1bd apartment furniture?",
        "author": "BluePearl2020",
        "url": "https://www.reddit.com/r/Frugal/comments/10by2zg/whats_a_good_way_to_get_free_money_without_a_loan/",
        "text": "I refuse to buy some things used. My Amazon and IKEA tab show it will set me back $1k but then I realized maybe there's card like Amazon's from a bank I could open and use the intro money to get discount without going the affirm route.  Amazon card has bad terms of balance isn't paid in full unlike my discover. Discover has no physical bank. So I'm looking into Chase but open to any ideas. \n\nI'd be buying bedding and sofa sleeper new and trying to discount the other items as much as possible used or new but cheap. \n\nMy idea Chase account or card. $100-500 \"free money\" $500-900 for my Amazon furniture delivery of several basic apartment outfitting so I don't feel broke. I'm prepaying rent and living on the rest until I find something better than ESL online/warehouse job.",
        "created_utc": 1673727117,
        "upvote_ratio": 1.0
    },
    {
        "title": "HOMESTEAD RESCUE - NOW CASTING",
        "author": "Evmcfadden",
        "url": "https://www.reddit.com/r/Frugal/comments/10by0cu/homestead_rescue_now_casting/",
        "text": "[removed]",
        "created_utc": 1673726940,
        "upvote_ratio": 1.0
    },
    {
        "title": "cleaning wood floor stains?",
        "author": "Inside-Ad-9118",
        "url": "https://i.redd.it/cu6yqvn6x3ca1.jpg",
        "text": "",
        "created_utc": 1673726832,
        "upvote_ratio": 1.0
    },
    {
        "title": "$6.99 Fee for Walmart Store Pickup Under $35 with Walmart Plus ???",
        "author": "jmsatl",
        "url": "https://www.reddit.com/r/Frugal/comments/10bxhnv/699_fee_for_walmart_store_pickup_under_35_with/",
        "text": "I have W+.  I pay $14.69 a month.  Granted its through Platinum so I get a credit but still.\n\nI placed an order for store pickup and they charged me $6.99 since order was under $35.  Thought it was supposed to be waived ???",
        "created_utc": 1673725677,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the current 2023 best price per calories in fast food",
        "author": "Freds_Premium",
        "url": "https://www.reddit.com/r/Frugal/comments/10bxhhf/what_is_the_current_2023_best_price_per_calories/",
        "text": "I have been going to Little Caesars and getting a pizza, breadsticks, and cheese sauce every Saturday. I cook my own meals the rest of the week. But it's been a nice treat to have a carryout pizza meal that lasts all day.  \n  \nRecently the prices there have gone up. I used to pay like $9.50 for all of it. Now it's like $12.50  \n  \nSo I ask, is there an alternative out there now days that has a better price per unit of food?  \n  \nMy Little Caesars meal (classic pep, bread sticks, and cheese sauce) is 3210 calories for $13.43. 239 calories per dollar.",
        "created_utc": 1673725664,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do water filters work/cheapest water filters that work?",
        "author": "RyudoUzaki",
        "url": "https://www.reddit.com/r/Frugal/comments/10bx7tq/do_water_filters_workcheapest_water_filters_that/",
        "text": "I've got some questionable water ([pic related](https://imgur.com/MMIFN53), it's an extreme amount of THM, more than 1,500 times any sort of normal amount) and I was wondering what my best options were. I was originally buying water bottles but between the plastics and the increase in price, a family member suggested a Brita tap filter - got it as a gift around Thanksgiving. Now, the filter's died (was a two pack at least) and I'm concerned it might be MORE expensive than the bottled stuff - a package of roughly 35 water bottles lasts me a month for $7, while the Brita filter died after little over a month and two cost $20. I also am questioning if a filter like Brita really helps remove the issues with my local water (see pic, though there's also been radiation concerns at times I've read in the news).\n\nMy questions are:\n\n1. Will a Brita or other tap filter definitely clean all the THM and possibly radiation?\n2. **Are there cheaper alternatives I can slot into my Brita, or if not, are there cheaper whole alternatives? (I'm not particularly handy with pipes or wrenches so I'd prefer something at the end of the faucet like what I have - though I'll learn if it's really better for my health significantly than the tap filter)**\n3. Is it safe to bathe in this sort of water? \n\nI know some of this is not really applicable to this sub's purpose but I genuinely can't find any proper sub to post into, there's an r/waterfilter I tried but I realized a little late it has nothing to do with the discussion of actual water filters. Please help me.",
        "created_utc": 1673724999,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for frugal recommendations for quality furniture.",
        "author": "socialphobic1",
        "url": "https://www.reddit.com/r/Frugal/comments/10bx2vn/looking_for_frugal_recommendations_for_quality/",
        "text": "Looking for recommendations for frugal but quality furniture. If you have any recommended furniture sources or brands, please let me know.",
        "created_utc": 1673724667,
        "upvote_ratio": 1.0
    },
    {
        "title": "fix detached couch spring, need metal bracket",
        "author": "eng33",
        "url": "https://www.reddit.com/gallery/10bwk0w",
        "text": "",
        "created_utc": 1673723390,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal tip: If you are going to use a headlight restorer kit, have another car on hand. There is enough material for two sets of headlights",
        "author": "Byzantium",
        "url": "https://www.reddit.com/r/Frugal/comments/10bvxur/frugal_tip_if_you_are_going_to_use_a_headlight/",
        "text": "I can't say for other brands, but the RainX kit that I got had plenty.",
        "created_utc": 1673721896,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bread is free",
        "author": "bitpandajon",
        "url": "https://www.reddit.com/r/Frugal/comments/10bv4gm/bread_is_free/",
        "text": "Go to your local thrift stores and food pantries and get all our free bread, please.",
        "created_utc": 1673719969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips to save money using empty freezer space?",
        "author": "Ruzhyo04",
        "url": "https://www.reddit.com/r/Frugal/comments/10bv1r5/any_tips_to_save_money_using_empty_freezer_space/",
        "text": "I was gifted a large well running chest freezer, after being stuck with tiny fridgetop freezers my whole life. I’m sure the electricity to run this won’t be cheap. Would appreciate your tips to use this freezer to *save* money!",
        "created_utc": 1673719794,
        "upvote_ratio": 1.0
    }
]