[
    {
        "title": "How much will shrinkwrapping windows help with this poorly insulated sunroom? And using a 1500 watt space heater with it in Toronto winters",
        "author": "onearsenewengerr",
        "url": "https://i.redd.it/fnmlekn91hna1.jpg",
        "text": "[removed]",
        "created_utc": 1678679921,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was about to order a pizza but made one instead",
        "author": "VapeDrinkWork",
        "url": "https://i.redd.it/b9e93h180hna1.jpg",
        "text": "",
        "created_utc": 1678679570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yogurt has become expensive in NZ, switching to powdered.",
        "author": "Afrodite_33",
        "url": "https://www.reddit.com/gallery/11pz1ts",
        "text": "",
        "created_utc": 1678678728,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t forget about shoe horns",
        "author": "Illwarthog",
        "url": "https://www.reddit.com/r/Frugal/comments/11pyx4v/dont_forget_about_shoe_horns/",
        "text": "Get a shoe horn folks. These little babies will save you hundreds on replacing shoes.",
        "created_utc": 1678678344,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal custom closets?",
        "author": "freeman687",
        "url": "https://www.reddit.com/r/Frugal/comments/11py7ai/frugal_custom_closets/",
        "text": "Is there a frugal alternative to custom closets from IKEA, California closets, etc? Looking to do new shelves and doors. Thanks!",
        "created_utc": 1678676339,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sprained leg 3 months ago, still in pain",
        "author": "EmeraldKD",
        "url": "https://www.reddit.com/r/Frugal/comments/11pxcjt/sprained_leg_3_months_ago_still_in_pain/",
        "text": "Hey! As the title says, 3 months ago I fell working out and sprained my midfoot. I went to the hospital, had an x ray and they told me it was probably a sprain and it would be fine after a week. \nIt took me around 3 weeks not to need any crutches, yet 3 months later I still have an some discomfort, which I think became worse last week that I fell down the stairs at uni (less dramatic than it sounds, I was just feverish lol). \nI haven’t gotten back to working out for other reasons, so I don’t think I’ve put more than needed pressure to my foot, yet even moving it slightly when sitting around, it causes discomfort. \nIt’s not like I can’t walk, jog and stuff. It’s just irritating and I feel like it’s sort of limiting my foot flexibility, if that makes any sense. \n\nCould it be something worse than a sprain? \nAny advice on what I should do? \n\n\nTLDR; Sprained my midfoot 3 months ago, then hurt my leg a week ago and it’s still causing irritation even when making the slightest movement. Could it be something worse than a sprain? Any advice on what I should do?",
        "created_utc": 1678673976,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question, do any of you ask older relatives if the have extras things before you buy them?",
        "author": "Ok_Boysenberry2713",
        "url": "https://www.reddit.com/r/Frugal/comments/11pxau9/question_do_any_of_you_ask_older_relatives_if_the/",
        "text": "My Dad was a \"quality hoarder\", not junk, but he had way too much nice stuff.  My mom and I are dispensing them to relatives rather than tossing them.  This would never work for everyone, but some of you could probably check about this.  We love seeing things reused by family.",
        "created_utc": 1678673847,
        "upvote_ratio": 1.0
    },
    {
        "title": "Plant safe frugal laundry soaps for grey water collection?",
        "author": "Avocadosandtomatoes",
        "url": "https://www.reddit.com/r/Frugal/comments/11puzj8/plant_safe_frugal_laundry_soaps_for_grey_water/",
        "text": "So I want to start collecting my water from my laundry once I realized how much water is being wasted. \n\nI just did a rinse cycle of towels and it almost filled up a 30 gallon drum. \n\nPerhaps it’s load dependent and if it’s off balanced. I did a regular load now and it used about 15 gallons. I’m going to do another load and see how much that uses.",
        "created_utc": 1678667661,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Make Homemade Energy Drinks and Save Money",
        "author": "aaaaaaaaaaaaaan",
        "url": "https://danielkliewer.com/how-to-make-homemade-energy-drinks-and-save-money/",
        "text": "",
        "created_utc": 1678665938,
        "upvote_ratio": 1.0
    },
    {
        "title": "Admirable, but not fabulous, grocery haul",
        "author": "BookAddict1918",
        "url": "https://i.redd.it/05y7vounvfna1.jpg",
        "text": "[removed]",
        "created_utc": 1678665933,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to make homemade energy drinks and save money",
        "author": "aaaaaaaaaaaaaan",
        "url": "https://danielkliewer.com/how-to-make-homemade-energy-drinks-and-save-money/",
        "text": "",
        "created_utc": 1678664961,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blenders: what's the difference between the $20, $100, and $500 options?",
        "author": "empathyboi",
        "url": "https://www.reddit.com/r/Frugal/comments/11ptp88/blenders_whats_the_difference_between_the_20_100/",
        "text": "I've owned a $20 Hamilton Beach blender for the past 5 years and have had no issues with it up until now. It's finally starting to slow down and have issues, so I'm looking into new blenders. \n\nAs far as I know, a blender's a blender. My $20 blender has always gotten the job done. It feels like the right/frugal choice.\n\nWhat exactly is the difference between this $20 blender and a Ninja blender that's quintuple the price? Then, what about the famous Vitamix that's quintuple the price of a Ninja?",
        "created_utc": 1678664302,
        "upvote_ratio": 1.0
    },
    {
        "title": "Laundry detergent &amp; cleaners?",
        "author": "onecouldsaythat",
        "url": "https://www.reddit.com/r/Frugal/comments/11ptne9/laundry_detergent_cleaners/",
        "text": "Looking for advice on all things laundry cleaners! \n\n1) What detergents do you find cost-effective *and* good for sensitive skin? I’ve used All free &amp; clear  - it’s cheaper than Tide and (I think) just as good! But I’m curious if there’s an even better value out there. Often bottom-tier generics don’t clean as well, or have irritating ingredients, but I’m curious to know what YOU consider the most cost effective detergent.\n\n2) Along with this, are there general household products you recommend? I’ve heard a splash of vinegar or baking soda helps whiten whites but I’d love to hear from people who actually use these!\n\nFWIW I’m frugal with clothing. Not necessarily in up front spending, but in how I maintain my clothes to get YEARS of use. I have my own style/avoid fast fashion trendiness, I buy the best quality I can, and I don’t use a dryer! …But with grocery inflation skyrocketing, who wouldn’t want to save on detergent/cleaning products?",
        "created_utc": 1678664169,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello guys, I found a new page that gives passive income and it is very new so that you can take advantage of it.",
        "author": "Low-Butterscotch4328",
        "url": "https://www.reddit.com/r/Frugal/comments/11ptlqm/hello_guys_i_found_a_new_page_that_gives_passive/",
        "text": "[removed]",
        "created_utc": 1678664059,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clothing, Home, and Dish cleaning at its absolute cheapest",
        "author": "InspectionSmooth1340",
        "url": "https://i.redd.it/wjq9p6duofna1.jpg",
        "text": "",
        "created_utc": 1678663636,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have scored a case of Leeks, any suggestions besides Potato-Leek soup?",
        "author": "Morrigane",
        "url": "https://www.reddit.com/r/Frugal/comments/11pteml/i_have_scored_a_case_of_leeks_any_suggestions/",
        "text": "Like the title says, I've given away a TON, and I'm getting ready to blanch and freeze a bunch.  Just looking for additional ideas.",
        "created_utc": 1678663569,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"On the way home\" expenses. Any ideas?",
        "author": "newlife_started",
        "url": "https://www.reddit.com/r/Frugal/comments/11pt73g/on_the_way_home_expenses_any_ideas/",
        "text": "Hiya. First and foremost, thank you frugal community for your awesome ideas - you guys are amazing. I'm learning so much reading this sub.\n\nHere's my problem: I hate my life right now, super lonely, broke, jobs suck, etc. So, on my way home, I'm stopping at X (Walmart, other grocery store, etc) and getting a little something. I'm aware of how poor I am, so it's usually something to eat. But even when it's just a $1.24 bag of Haribo bear candy, it adds up. I need to be TIGHT with my budget.\n\nThe fact that I'm always exhausted (sleep disorder, waiting for insurance stuff to happen) might be a contributing factor to increasing the sweet tooth problem.\n\nAny ideas welcome.",
        "created_utc": 1678663061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone in the house was getting wings to go from Chili’s and they were $13.85 for one order of eight wings. If you order it as a party platter of 16 it’s been $17 and then if you do it as 24 it’s only $25.",
        "author": "Icecreamedloud",
        "url": "https://i.redd.it/ge7acrldlfna1.jpg",
        "text": "",
        "created_utc": 1678662471,
        "upvote_ratio": 1.0
    },
    {
        "title": "does thread count of duvets matter?",
        "author": "chyyme",
        "url": "https://www.reddit.com/r/Frugal/comments/11psy70/does_thread_count_of_duvets_matter/",
        "text": "regarding their durability",
        "created_utc": 1678662453,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it nuts for me to pay a few hundred more a month for a one bedroom?",
        "author": "jotaroasted",
        "url": "https://www.reddit.com/r/Frugal/comments/11psuyj/is_it_nuts_for_me_to_pay_a_few_hundred_more_a/",
        "text": "I'm just finishing up my masters, and trying to secure housing for the future. In my area, there are a ton of rooms that go for $800 and below a month if you share with people, and a lot of one-bedrooms around $1100. \n\nIt's possible that I could find a shared apartment, but roommate searching is always such a pain in the ass and I've had really awful roommate experiences in the past. Along with that, I just like being alone. My income is looking like it'll be ~$70k, depending on how interviews go, so I know $1100/month would be fine. But a (shitty) ex of mine scoffed when I mentioned paying over $800 a month, and I can't shake the guilt that I'd be wasting money. Is it crazy of me to be okay with paying more?",
        "created_utc": 1678662238,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cheap wedding reception ideas?",
        "author": "willowthewize",
        "url": "https://www.reddit.com/r/Frugal/comments/11pst4g/cheap_wedding_reception_ideas/",
        "text": "Hello all! \n\nI’m about to book my wedding ceremony. I can accommodate up to 50 guests for pretty cheap at a beautiful venue. Now it’s time to do a reception. I live in MA and need something classy yet cheap. I’ve considered a state park, a nice pond, restaurant (guests paying for their own meals), museum gardens, you name it.\nI’ve thought about catering myself, or having a food truck cater. \n\nI feel like there’s nothing that really sparks joy in any of the options. I wanted to do a beach wedding but the ceremony will be in the mountains not anywhere near the beach. My fear of using a public park is that our good vibes will be interrupted by loud people. I can’t afford a venue that will offer privacy. If we have an outdoor wedding, I will need to rent a tent which adds a layer of stress and fear that if it rains, the wedding might get ruined. I’ve considered the whole “embrace the rain” aesthetic but tbh, I’m not one for messes or mud. \n\nThere will also be elderly  guests and I want to be thoughtful of their needs and accessibility. \n\nAny suggestions will be appreciated!!!",
        "created_utc": 1678662112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Came across this chair and sofa set at a flea market for $85 this weekend!",
        "author": "Rakerbutt",
        "url": "https://www.reddit.com/gallery/11ps1i0",
        "text": "",
        "created_utc": 1678660290,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you're thirsty and in need of a cold soda, DON'T go to Carl's Jr. They are now charging $3.76 plus tax for a medium Coke.",
        "author": "DaveshPatel93101",
        "url": "https://www.reddit.com/r/Frugal/comments/11pregt/if_youre_thirsty_and_in_need_of_a_cold_soda_dont/",
        "text": "This was yesterday's price in Fresno, CA. It may be less (or more) in your city.",
        "created_utc": 1678658805,
        "upvote_ratio": 1.0
    },
    {
        "title": "Buy new car or fix current car?",
        "author": "Xavierallen8",
        "url": "https://www.reddit.com/r/Frugal/comments/11pr1yb/buy_new_car_or_fix_current_car/",
        "text": "[removed]",
        "created_utc": 1678658002,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's left to buy?",
        "author": "qqererer",
        "url": "https://www.reddit.com/r/Frugal/comments/11pq3ze/whats_left_to_buy/",
        "text": "I'm reading the \"Be Careful on Amazon\" thread, and the recurring thought I have is \"If you're frugal, zero waste, buy it for life, DIY, visible mending... asides from food, transportation and the occasional item that wears out.  What are you continually buying, and why is it so critical about it that you can't just buy enough on a big shopping trip, and have enough of a stockpile until that next big shopping trip that necessitates you getting it in a week or less from amazon?\"\n\nOr what is that consumer item, be it clothes, or electronics, or whatever, that necessitates that you be constantly buying it?\n\nNot to say that I don't want to buy anything.  I do, but there's no actual requirement or need to actually buy it.  I can understand the want to upgrade hardware and electronics that can add utility to one's life, but I don't understand other things like clothes.\n\nI go crazy, just wanting to buy new socks, but they're black socks, and I already have lots of black socks that look nearly identical to the socks I already have.  I have a capsule wardrobe and laundry is super easy.  I have a set or two of clothes that I could wear, but I prefer to just have them sit in the drawer with new tags, because I get more utility out of having 'nice new clothes in the closet at the ready', vs wearing them and not having the 'joy' of them being new anymore (hedonic adaptation), and then buying another set of clothes to 'feel good' about.  This avoids the 'so many clothes, but no idea on what to wear', and the many other 'paradox of choice' problems.\n\nI just want to spend money and have new things, just for the sake of having new things, and not even wear them.  Same thing when it comes to 'to go coffee'.  I'm not even thirsty.  I just see everyone with a coffee cup, so I want one too simply just to be 'part of the tribe'. So I understand the \"drive\".  But in the end, no one really cares what I wear, or what/when I drink, so there's little point to buying anything 'new' unless I actually need it.\n\nWhich has me at the point where I've already bought everything I wanted or needed, and it's all quality, or exactly the level that I need that I don't need to buy anything better.  I literally have it all.  Even if I go to Best Buy and see the 84\" 4k TV, I shrug my shouders.  The content I watch is 720p youtube videos, and I don't find it interesting to watch 4k videos of fireworks or fishtanks.  To paraphrase r/headphones, \"I don't listen to headphones with music, I listen to music with headphones.  If the headphone is good enough to listen to my music, I don't need another headphone to listen to the same music 'better' or 'different.\"\n\nI'm not interested as most consumer goods seem to be in a post technological boom.  Even the latest innovation 'Airpods' have $14.99 versions available to the most low level of consumers.  It's incredible\n\nWhich is all to say, we literally can get everything we want, and even the lowest level of consumer goods can be very good if you just take a little effort in taking care of it.\n\nI've lost that 'drive'.  So if you still have that 'drive', what is it, and what are you buying, and how is that different from someone who isn't the r/frugal type?",
        "created_utc": 1678655786,
        "upvote_ratio": 1.0
    },
    {
        "title": "When making small amount of money, what do you do with the funds?",
        "author": "buddhistpine",
        "url": "https://www.reddit.com/r/Frugal/comments/11ppxhb/when_making_small_amount_of_money_what_do_you_do/",
        "text": "For example: selling something online, returning bottles, etc.",
        "created_utc": 1678655352,
        "upvote_ratio": 1.0
    },
    {
        "title": "Costco has 50qt. bags of organic garden soil with compost for under $8/bag.",
        "author": "slicktrickrick",
        "url": "/r/gardening/comments/11polql/costco_has_50qt_bags_of_organic_garden_soil_with/",
        "text": "",
        "created_utc": 1678652282,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grow food from home in a vertical farm?",
        "author": "GardenStack",
        "url": "https://www.reddit.com/r/Frugal/comments/11poe8z/grow_food_from_home_in_a_vertical_farm/",
        "text": "[removed]",
        "created_utc": 1678651730,
        "upvote_ratio": 1.0
    },
    {
        "title": "Food price inflation is at a historic high. Grow food from home in a vertical farm!",
        "author": "GardenStack",
        "url": "https://www.reddit.com/r/Frugal/comments/11pocrf/food_price_inflation_is_at_a_historic_high_grow/",
        "text": "[removed]",
        "created_utc": 1678651631,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you buy no-name-brand products on Amazon, be sure to check the inserts in the package, often you can get free stuff for reviews.",
        "author": "AtomikRadio",
        "url": "https://www.reddit.com/r/Frugal/comments/11pnyf1/if_you_buy_nonamebrand_products_on_amazon_be_sure/",
        "text": "I mostly see this with Chinese-manufactured electronics like my portable 15.6\" monitor, but I've seen it with other things from small artisan sellers and such as well. Often there will be a little card in the box with \"info\" from the manufacturer/seller. Sometimes it's just a \"thanks! please review!\", but often it's either a way to get a warranty extension and perhaps even free accessories in exchange for reviews.\n\nI've gotten free items including a pretty good quality padded sleeve for my portable monitor, spare braided cables for tablets, 20% off codes for future purchases of candles and bath bombs that I buy regularly, etc.\n\nAdditionally, I have never encountered an of these that require you to leave a *positive* review, so if you sincerely have issues with the product you can include that in the review and still get the free swag. (Though in my experience, if my review would be particularly negative I'm probably returning the item and don't want the swag anyway!) I've gotten the bonus items for 3 and 4 star reviews in which I gripe about product issues before without any pushback.\n\nThe portable monitor was the most recent item and it came with an okay-sleeve that served as an okay-kickstand. By sending them a screenshot of my review they allowed me to choose between a much nicer sleeve, backup cables, a slightly better kickstand,j or L-shaped cable adapters so you could have a nicer look out the side of the monitor. Saved me from spending another 15-20 bucks on a padded sleeve, and it's cut perfectly for this item as opposed to getting a random one from a different seller.",
        "created_utc": 1678650691,
        "upvote_ratio": 1.0
    },
    {
        "title": "From garage sales, thrifting, offer up and the dumpster, believe it or not… here’s the latest! I love decorating!",
        "author": "Tasselplants",
        "url": "https://www.reddit.com/gallery/11pnpl3",
        "text": "",
        "created_utc": 1678650113,
        "upvote_ratio": 1.0
    },
    {
        "title": "A 5 or 6 month vehicle solution?",
        "author": "RGrevz",
        "url": "https://www.reddit.com/r/Frugal/comments/11pnoy1/a_5_or_6_month_vehicle_solution/",
        "text": "I’m temporarily relocating to Southern California for 5 months. I need a car while I’m there for my family of 4. What do you recommend in terms of being the cheapest, but reliable option….\n\n1 - Use a subscription service like Kyte\n2 - Look for someone wanting to xfer there lease with 6 months left\n3 - Or buy a used reliable car, and then sell when I leave.\n\nAny advice would be appreciated!",
        "created_utc": 1678650069,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saving money on home internet and phone bills",
        "author": "Spartansteve09",
        "url": "https://www.reddit.com/r/Frugal/comments/11pnho6/saving_money_on_home_internet_and_phone_bills/",
        "text": "[removed]",
        "created_utc": 1678649588,
        "upvote_ratio": 1.0
    },
    {
        "title": "Closet Clear Out ALERT 🚨",
        "author": "Consistent_Ad1100",
        "url": "https://www.reddit.com/r/Frugal/comments/11pn4hz/closet_clear_out_alert/",
        "text": "[removed]",
        "created_utc": 1678648751,
        "upvote_ratio": 1.0
    },
    {
        "title": "Temu $50 referral code",
        "author": "AnySky561",
        "url": "https://temu.com/s/F5IxQMLwTagHB",
        "text": "",
        "created_utc": 1678648285,
        "upvote_ratio": 1.0
    },
    {
        "title": "Verizon bill down to just $14.59/month using ACP!!!",
        "author": "Spartansteve09",
        "url": "https://i.redd.it/dgoa9fg4cena1.jpg",
        "text": "",
        "created_utc": 1678647251,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free to You Food Bank Donations",
        "author": "obfuskitten",
        "url": "https://www.reddit.com/r/Frugal/comments/11plen9/free_to_you_food_bank_donations/",
        "text": "I just discovered this sub (via a BORU post about the 30 pounds of bananas), and something the OP mentioned about food banks made me realize some of you might appreciate a tip I discovered.  \n  \nMy parents' health insurance includes a benefit in which they each get $50 per quarter of free merchandise from CVS.  The available items are a subset of what you can get from the normal CVS website, and are pretty much just CVS brand items.  My parents get what they can use from them.  But they don't nearly use up their (combined) $100 budget each quarter.  \n  \nSo instead of just letting that benefit go to waste, they use up their balance on things like toothbrushes, hand sanitizer, and feminine hygiene supplies.  Then they donate those to their local food bank.  \n  \nObviously check with your local food bank first, but my understanding is that most are thrilled to get those kinds of non-food donations, as their client base needs that stuff too, and people don't think about it when making donations.  \n  \n(Other stuff that some foods banks are also thrilled to get that people don't think of are paper bags and cardboard boxes.  They need something to put the food/supplies into when distributing to their clients.)",
        "created_utc": 1678644800,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seafood, fruits, and vegetables",
        "author": "lostmyoldusername1",
        "url": "https://www.reddit.com/r/Frugal/comments/11pl8ix/seafood_fruits_and_vegetables/",
        "text": "[removed]",
        "created_utc": 1678644393,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thermostat advice?",
        "author": "ExpertJuice7620",
        "url": "https://www.reddit.com/r/Frugal/comments/11pkoms/thermostat_advice/",
        "text": "My apartment is very poorly insulated. Like I can feel cold air coming in from the doors and windows. I bought special curtains that said they’d help keep heat in, and with midwestern spring, I’ve been able to keep my thermostat completely off and just open up my doors/windows, keeping my apartment around 68-70. We’re entering another cold spell however, and to keep my pipes from freezing, I have the thermostat set to 63. I wanna try saving money, as my electric bills in winter were about 250$. \n\nIs there any way for me to decrease electric costs other than my thermostat? I unplug what appliances I can, and I’m planning on going home for spring break, but have to leave it on so my pipes don’t freeze and burst. Management says to keep it above 65 if you leave for more than 3 days, but they’re also the type to say that just for more money.",
        "created_utc": 1678643100,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ultimate Frugal Deodorant!",
        "author": "ilikeover9000turtles",
        "url": "https://www.reddit.com/r/Frugal/comments/11pkm47/ultimate_frugal_deodorant/",
        "text": "So normal deodorant just doesn't seem to work for me.  I get a few hours out of it before I need to re-apply it.  \n\nZinc Oxide is antimicrobial, it has proven to be the best solution, and it is readily available in oil based lotions and creams, diaper rash cream, sunblocks, and dandruff shampoo all use zinc. \n\nIt works better than any deodorant I've tried, but the oil has been off-putting for me. \n\nI ordered a pound of zinc oxide and a mineral makeup brush for cheap, and it works amazingly well and is drastically cheaper and more effective than normal deodorant. \n\nI go a full 24 hours and unable to detect any odor, whereas before I was having to re-apply deodorant at least 3 times per day at work.",
        "created_utc": 1678642936,
        "upvote_ratio": 1.0
    },
    {
        "title": "You know, sometimes you have to reign in your frugal thinking. I was in Colombia, hiking the STUNNING Valle de Cocora and many people skip the \"bosque palms\" section because you have to pay 10,000COP. What a TRAGEDY - my friends, 10,000COP is... $2!",
        "author": "thestinger8",
        "url": "https://www.reddit.com/gallery/11pjuhl",
        "text": "",
        "created_utc": 1678641146,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cheaper household chemicals and laundry detergents",
        "author": "erik530195",
        "url": "https://www.reddit.com/r/Frugal/comments/11pj143/cheaper_household_chemicals_and_laundry_detergents/",
        "text": "This may not work for everyone but is something to look into. I have a local chemical supplier that sells degreaser, soaps, laundry and dish detergent, pine sol knockoff, and lots more. They often sell to restaurants and businesses but are open to the public, your mileage may vary. \n\nFor example I get everything I listed above for $3/gal. They also have hand soap, coolant, and dishwasher pods from time to time as they get them cheaper in bulk. \n\nYou can Google industrial chemical suppliers in your area but another good way is to observe cleaning products used by local restaurants. Or ask a detailing shop.",
        "created_utc": 1678639276,
        "upvote_ratio": 1.0
    },
    {
        "title": "AWESOMETOOL HOW TO MAKE HOSE CLAMP /hose clamp toolhose clamp tool",
        "author": "megaone2",
        "url": "https://youtu.be/PqcDdhM0r5A",
        "text": "",
        "created_utc": 1678638616,
        "upvote_ratio": 1.0
    },
    {
        "title": "November 30th and this debt will be at 10,000 dollars",
        "author": "Fun_Pea3646",
        "url": "https://i.redd.it/z7l0mrr3mdna1.jpg",
        "text": "",
        "created_utc": 1678638501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any frugal ideas for reusing this?",
        "author": "pingpingmoe",
        "url": "https://i.imgur.com/DrrC6a1.jpg",
        "text": "",
        "created_utc": 1678637463,
        "upvote_ratio": 1.0
    },
    {
        "title": "fixed dishwasher by myself!",
        "author": "BellyButton214",
        "url": "https://www.reddit.com/r/Frugal/comments/11pha1a/fixed_dishwasher_by_myself/",
        "text": "Dishwasher would light up but not turn on. And after a couple of minutes light would go off. So hmmm what to do .. panic? Call repair company? No silly! Just Google the problem and voila there it is.  Computer reset. Open door.  Hit \"heavy and normal\" button 3 times alternatively.  Clean dishes are on deck!",
        "created_utc": 1678635044,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saving money on grocery bills",
        "author": "frugal33",
        "url": "https://www.reddit.com/r/Frugal/comments/11pgk71/saving_money_on_grocery_bills/",
        "text": "[removed]",
        "created_utc": 1678633284,
        "upvote_ratio": 0.99
    },
    {
        "title": "Addicted to ordering food (DoorDash, UberEats, etc)",
        "author": "gbcarie",
        "url": "https://www.reddit.com/r/Frugal/comments/11pf3xi/addicted_to_ordering_food_doordash_ubereats_etc/",
        "text": "I’m a recovering alcoholic, I’m currently 30 days clean. \n\nOne of my strategies going in was to eat a bunch of food when I wanted to drink. \n\nIt’s working, don’t get me wrong but holy shit is it expensive. Unhealthy and just not normal. \n\nHow do I get out of a cycle of ordering food? I want to save money, I want to have a savings account but I just can’t seem to stop ordering food.",
        "created_utc": 1678629345,
        "upvote_ratio": 1.0
    },
    {
        "title": "Herring in wine sauce from Aldi",
        "author": "rottweiler100",
        "url": "https://v.redd.it/3rwf6ib7d9na1",
        "text": "",
        "created_utc": 1678605093,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your walmart go-to items?",
        "author": "Spare-Relative7134",
        "url": "https://www.reddit.com/r/Frugal/comments/11p832e/what_are_your_walmart_goto_items/",
        "text": "For context, I’m a 20F and I live on my own. After all my bills have been paid, I have about $100 left to my name until my next check. I don’t want to spend more than $50 on groceries for two weeks. What do you recommend I buy/ add to my list? Note: I’m allergic to peanuts, I know peanut butter is a common frugal staple but unfortunately I can’t have it. Thanks in advance!",
        "created_utc": 1678604749,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to minimize car rental expenses as a \"wing it\" type traveler?",
        "author": "Ming-Tzu",
        "url": "https://www.reddit.com/r/Frugal/comments/11p7y6t/how_to_minimize_car_rental_expenses_as_a_wing_it/",
        "text": "How to minimize costs where my travel timeline is open AND desire to rent a car?\n\nHeaded to Asia this summer with one month solo. Hitting up Taiwan first and thinking to spend the whole month traveling the island vs splitting my time between Taiwan Hokkaido. Still doing research so need to figure out activities.\n\nI think I'm most definitely renting a car for part of my time in Taiwan, essentially when I'm ready to leave the Taipei area. But I'm sort of a \"wing it\" type of traveler that deciding on the timeframe for the car rental is proving rather difficult.\n\nI don't want to rent a car for the entire month and then realize two weeks is enough. In this scenario, I would eat two weeks worth of car rental fees and then have to rent another car in Hokkaido. Conversely, I don't want to rent a car for two weeks and realize I need more time, and have to pay the current price for the remaining two weeks (if this is even possible as I've never had a car rental past the initial agreed upon timeframe).\n\nAny tips or feedback appreciated!",
        "created_utc": 1678604293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cheapest place to live in that is also safe to someone who wants to move from the U.S.?",
        "author": "moonmoonofficial",
        "url": "https://www.reddit.com/r/Frugal/comments/11p5s0v/cheapest_place_to_live_in_that_is_also_safe_to/",
        "text": "I’ve been thinking a lot about the cost of living here in America and honestly the most frugal thing I can think of is to literally pack my bags and move somewhere else at this point. I don’t know exactly have the money now but when I do save up (about $10,000 starting), what countries would be considered safe (as I’m not have to worry about the males raping my partner if she goes off alone, not having to worry about walking around at night, etc;) and also have a better cost of living than the U.S.? Having a relaxed visa system is also a plus.",
        "created_utc": 1678597193,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pharmacy discount card was cheaper than my insurance. Saved $12",
        "author": "wman41",
        "url": "https://i.redd.it/quc6qwwd0ana1.jpg",
        "text": "",
        "created_utc": 1678594875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Options on Walmart brand",
        "author": "Icy-Ad-30",
        "url": "https://www.reddit.com/r/Frugal/comments/11p4vjm/options_on_walmart_brand/",
        "text": "[removed]",
        "created_utc": 1678594352,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to get best deals for home essentials?",
        "author": "questionablebluebees",
        "url": "https://www.reddit.com/r/Frugal/comments/11p4ow9/where_to_get_best_deals_for_home_essentials/",
        "text": "[removed]",
        "created_utc": 1678593793,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paid $12 dollars using this pharmacy discount card. Insurance wanted to charge me $25",
        "author": "wman41",
        "url": "https://i.redd.it/c85qui3jt9na1.jpg",
        "text": "",
        "created_utc": 1678592569,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pharmacy Discount Card",
        "author": "wman41",
        "url": "https://i.redd.it/l5dvvg25i9na1.jpg",
        "text": "",
        "created_utc": 1678588739,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roommates or Studio Apartment",
        "author": "RoxImGay",
        "url": "https://www.reddit.com/r/Frugal/comments/11p2w02/roommates_or_studio_apartment/",
        "text": "[removed]",
        "created_utc": 1678588594,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you decide when it’s time to cash in your aluminum cans and any other recyclables?",
        "author": "EevelBob",
        "url": "https://www.reddit.com/r/Frugal/comments/11p2dka/how_do_you_decide_when_its_time_to_cash_in_your/",
        "text": "For the last 2 1/2 years, I have diligently crushed 3-kitchen sized trash bags full of aluminum cans, about 25 lbs. or so. The problem is the pandemic shuttered my local recycler, and the next closest one is 20 miles away in a town I rarely visit or drive through, so I would likely have to make a special trip. Wondering if it’s worth the effort now, or if I should just keep crushing for a few more years. The space to store these crushed cans is not an issue.",
        "created_utc": 1678587172,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal win, first time mom expecting in july edition:)",
        "author": "tay_tot",
        "url": "https://www.reddit.com/r/Frugal/comments/11p1dek/frugal_win_first_time_mom_expecting_in_july/",
        "text": "Guys. I feel like I've been scoring the jackpot lately on Facebook marketplace.\nListen to this, I got a changing table for FREE that's brand new. A bassinet for 20$ practically brand new, stroller for 40$ used ONCE, muslin swaddles for $3 nearly new, 2 full trash bags of baby boy clothes for free, a baby swing for 10 also nearly new, god damn I'm on top of the world here.\n\nI don't have any family that aren't toxic as hell so I don't expect a babyshower tbh. Buying everything ourselves! This is great.",
        "created_utc": 1678584350,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kept this sola glass bottle for a while and thought maybe i'll need this for something in the future.",
        "author": "Which_Firefighter_27",
        "url": "https://i.redd.it/di7i1sfxy8na1.png",
        "text": "",
        "created_utc": 1678582286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Herring in wine sauce from Aldi. Cheaper and better than Vita.",
        "author": "rottweiler100",
        "url": "https://v.redd.it/u3oj0sqvf7na1",
        "text": "",
        "created_utc": 1678581780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Herring in wine sauce from Aldi. Cheaper and better than Vita.",
        "author": "rottweiler100",
        "url": "https://v.redd.it/uzcp7fvif7na1",
        "text": "",
        "created_utc": 1678581660,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal 101: make your own broth. There's nothing quite like turning food waste into liquid gold!",
        "author": "prettypistolgg",
        "url": "https://i.redd.it/5ih8mz31r8na1.jpg",
        "text": "",
        "created_utc": 1678579629,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free/Low Cost Online Art",
        "author": "jfqnd96",
        "url": "https://www.reddit.com/r/Frugal/comments/11oy9g2/freelow_cost_online_art/",
        "text": "Wondering if you guys know of any websites or places where I can find free use or low cost arc for the walls in my house. I have been to Home Goods and similar places, but the selection for $35 and higher is not great for me. I’m wondering if there are websites where you can find hi res art that’s printable, or any other places you might know of where I can go to find some. Any help would be great. Thank you!",
        "created_utc": 1678576370,
        "upvote_ratio": 1.0
    },
    {
        "title": "Be vigilant on Amazon",
        "author": "HackZoo",
        "url": "https://www.reddit.com/r/Frugal/comments/11oxrqm/be_vigilant_on_amazon/",
        "text": "I searched my favorite bar soap.  Amazon's Choice was 3 bars for eight dollars. I thought that was outrageous. \n\nClicked other options and found 32 bars for 25 dollars. Still Amazon Prime.  Granted I bought over ten times as much,  but Amazon's Choice was over 3 times as much.  And it's soap,  I'd rather buy once in bulk,  I'll use it. \n\nI'd be surprised if this hasn't already been brought up here but it's the first time I've experienced it.",
        "created_utc": 1678575226,
        "upvote_ratio": 1.0
    },
    {
        "title": "simple",
        "author": "cinema-01",
        "url": "https://i.redd.it/ovak8z6mb8na1.jpg",
        "text": "",
        "created_utc": 1678574439,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't afford to make the drive to my sister's funeral. I've cut out every single unnecessary thing. I work as much as I can. I'm so tired.",
        "author": "rainedrop87",
        "url": "https://www.reddit.com/r/Frugal/comments/11owr6k/i_cant_afford_to_make_the_drive_to_my_sisters/",
        "text": "This just. It sucks. I don't really have anyone I can borrow from. shit idk if I could even pay it back. I don't eat out. I don't have subscriptions. I walk as much as I can. I just. This sucks. I'm as frugal as I can possibly be and here we are.",
        "created_utc": 1678572765,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cheap food! “Diet for a small planet” $1.20 paperback on Amazon. “Recipes for a Small planet” $1.20 free download “ weight loss for a small Planet”",
        "author": "Melodic-Psychology62",
        "url": "https://www.reddit.com/r/Frugal/comments/11owom1/cheap_food_diet_for_a_small_planet_120_paperback/",
        "text": "I recommend all though as I lived in the times when “America was great” so we should go back to it. my mother cried the last few days of the month while we ate margarine noodles or no margarine noodles and she wasn’t hungry? My dad had served in WW2 in the pacific was shot through the leg with nerve damage. The government after 10 years denied his pension out of the blue as he was still receiving treatment from the Veterans hospital. So that was our income down $100. And that was food! \n  My own problem with two children age 6 and 7 no family aid going back to school as I was unemployable for any thing but domestic stuff. We were denied food assistance as we owned a ford pinto payment $57.00. California state was at that time buying outright ford pintos for welfare recipients but ours was a asset as we had payments for 3 years.    \nI sold my blood if I could keep my weight up to the required 110 lbs. but that required eating more? So weight loss is not been my problem. \nHowever the free download has great recipes so check it out or spend $1.20 for the book or get it from the library! It shows what food combined to make a complete protein.  Any other recommendations for making healthy food or personal non secret recipes? God that rant has lightened my soul! Don’t absorb the pain we endured.  Please!",
        "created_utc": 1678572602,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone gone down to one car and regretted it?",
        "author": "Tiny-Pineapple",
        "url": "https://www.reddit.com/r/Frugal/comments/11ovy97/has_anyone_gone_down_to_one_car_and_regretted_it/",
        "text": "[removed]",
        "created_utc": 1678570823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Phone Plan",
        "author": "Futureacct",
        "url": "https://www.reddit.com/r/Frugal/comments/11ovgtj/phone_plan/",
        "text": "I currently have a 5 gb data pre-paid monthly plan with Verizon for $25. I was wondering if you guys have any tips on cheaper phone plans. TIA",
        "created_utc": 1678569635,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spam musubi. One of my favorite frugal meals!",
        "author": "Accomplished_Alarm_1",
        "url": "https://i.redd.it/1twy799bw7na1.jpg",
        "text": "[removed]",
        "created_utc": 1678569294,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ways to reuse wax from my warmer?",
        "author": "2rugrats2",
        "url": "https://www.reddit.com/r/Frugal/comments/11ov553/ways_to_reuse_wax_from_my_warmer/",
        "text": "[removed]",
        "created_utc": 1678568845,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for THE pair of jeans",
        "author": "Bambinette",
        "url": "https://www.reddit.com/r/Frugal/comments/11ouuzz/looking_for_the_pair_of_jeans/",
        "text": "Hi fellow frugal friends!\n\nI am looking to buy a pair of jeans and I have some questions I could use a little help with :)\n\n1) if I want to own ONE pair of jeans, what should I be looking for ? Pale or dark jeans ?A pair of jeans with no holes make sens, but except that ?\n\n2) I can never truly like a pair of jeans for a long time. They always get stretched or something and they get too loose around my waist/but or they rip around my thighs. So this time I am thinking I want to splurge into a pair of jeans I will own and like for a long time. \n\n2 a) how to wash or take care of my jeans so they fits for a long time ?\n2 b) what brand do you recommend ?\n\nThank you so much ❤️",
        "created_utc": 1678568164,
        "upvote_ratio": 1.0
    },
    {
        "title": "$20 worth of produce from Flashfood/meijer",
        "author": "kermitlady",
        "url": "https://i.redd.it/jw2o2v07s7na1.jpg",
        "text": "",
        "created_utc": 1678567909,
        "upvote_ratio": 1.0
    },
    {
        "title": "A sort of free television system",
        "author": "Ok_Boysenberry2713",
        "url": "https://www.reddit.com/r/Frugal/comments/11oukms/a_sort_of_free_television_system/",
        "text": "[removed]",
        "created_utc": 1678567446,
        "upvote_ratio": 1.0
    },
    {
        "title": "La raptor",
        "author": "guejen9",
        "url": "https://www.reddit.com/gallery/11otdjn",
        "text": "",
        "created_utc": 1678564509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I buy a car in this market or not?",
        "author": "pvnptl123",
        "url": "https://www.reddit.com/r/Frugal/comments/11oszcn/should_i_buy_a_car_in_this_market_or_not/",
        "text": "I have a 2014 Hyundai Sonata at 190000, it has one major issue and I will probably need to replace the front axle, the engine doesn't have much damage and works fine, everything seems to work fine. I work from home most of the time, I go to the office once a week, but I love traveling so I am out somewhere every other weekend. I am confused if I should buy a car in the market or not (I live in US). Any advice helps.",
        "created_utc": 1678563513,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spending a little bit of money on food storage containers has saved me a fortune. I am very happy with these.",
        "author": "AskRepresentative678",
        "url": "https://www.reddit.com/r/Frugal/comments/11os9f6/spending_a_little_bit_of_money_on_food_storage/",
        "text": "[removed]",
        "created_utc": 1678561773,
        "upvote_ratio": 1.0
    },
    {
        "title": "I received a bunch of oranges and grapefruit from food bank, what can I do with them?",
        "author": "Thatcherinthery3",
        "url": "https://www.reddit.com/r/Frugal/comments/11or1s7/i_received_a_bunch_of_oranges_and_grapefruit_from/",
        "text": "I know the obvious answer is juice them, but I received 10 pounds of each. Even if I juiced them all, the juice would go bad before I finished them",
        "created_utc": 1678558871,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone feel bad about throwing things out?",
        "author": "Beth9795",
        "url": "https://www.reddit.com/r/Frugal/comments/11oqtic/anyone_feel_bad_about_throwing_things_out/",
        "text": "So I just had to toss a pair of jeans. They were my favorite jeans that I bought over a year ago and they developed a huge rip right by the bits and pieces. The hole was too big to patch up or sew, I couldn't make shorts out of them because of where the rip was, and I don't feel like giving jeans with a giant hole in them to charity would be entirely beneficial. So I had to toss. I know logically that this is the solution considering the facts but it still makes me feel bad. Anyone else feel like this?",
        "created_utc": 1678558316,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t know if this fits this sub, but I often crave the “struggle” meals I grew up on.",
        "author": "salted_sclera",
        "url": "https://www.reddit.com/r/Frugal/comments/11oqpt6/i_dont_know_if_this_fits_this_sub_but_i_often/",
        "text": "I like to eat good and healthy foods, but sometimes I crave box macaroni and cheese with ketchup and hot dogs, or hot dog soup, or just a can of chef Boyardee mini ravioli. My partner and I live with his parents, and when we first moved in, my partners mom made comments about the unhealthy/quick but cheap options that we had, and nothing about the veg and spices or meats that we had. We didn’t tell her it was my idea to purchase them, but they bring me happiness every now and then and I feel ridiculously embarrassed for wanting Kraft dinner and ketchup right now. They’re always in the living room, which is immediately across the kitchen with no walls to separate. Maybe it’s just time that we move out so I can spend my grocery money how I want to and eat what I want without feeling judged. They didn’t grow up poor but I did and that food reminds me of good times",
        "created_utc": 1678558067,
        "upvote_ratio": 1.0
    },
    {
        "title": "Streaming service advice",
        "author": "crapimlosing",
        "url": "https://www.reddit.com/r/Frugal/comments/11oqh52/streaming_service_advice/",
        "text": "Every time I google this question all I get are ads or articles that I’m sure are paid ads in disguise. Has anyone found a couple streaming services that have a wide variety of popular shows and movies to watch without having to belong to like 10 of them?",
        "created_utc": 1678557490,
        "upvote_ratio": 1.0
    },
    {
        "title": "does Harbor Freight no longer offer 20% off coupons?",
        "author": "bramletabercrombe",
        "url": "https://www.reddit.com/r/Frugal/comments/11opxdn/does_harbor_freight_no_longer_offer_20_off_coupons/",
        "text": "haven't bought anything from them in a while but I always used to be able to find a 20% off coupon online when I did. Has that offer been discontinued in recent years? Seems like they only offer 20% off on selected items when it used to be a blanket coupon for most items.",
        "created_utc": 1678556111,
        "upvote_ratio": 1.0
    },
    {
        "title": "Keep an eye out for tissue paper. When Easter rolls around, make your own easter basket grass.",
        "author": "Ajreil",
        "url": "https://i.imgur.com/TDSC626.jpg",
        "text": "",
        "created_utc": 1678555937,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is network marketing ?",
        "author": "Forbetterwallet",
        "url": "https://forbetterwallet.blogspot.com/2023/03/what-is-network-marketing.html",
        "text": "",
        "created_utc": 1678555268,
        "upvote_ratio": 1.0
    },
    {
        "title": "$15.40 worth of reduced produce. Such a win today. Each bag of potatoes was .99.",
        "author": "Ziiipz",
        "url": "https://i.redd.it/7nlyr6g4n6na1.jpg",
        "text": "",
        "created_utc": 1678554099,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fresh produce haul: $30.97 CAD - was this frugal?",
        "author": "Cautious-Ostrich7510",
        "url": "https://i.redd.it/apzlmxgnf6na1.jpg",
        "text": "",
        "created_utc": 1678551583,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need a place to love for a few months",
        "author": "demoncreator",
        "url": "https://www.reddit.com/r/Frugal/comments/11onq4d/need_a_place_to_love_for_a_few_months/",
        "text": "[removed]",
        "created_utc": 1678550559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suitcase lost a wheel on its first voyage, any hope for a fix?",
        "author": "KellyChingeli",
        "url": "https://i.redd.it/jk88usk176na1.jpg",
        "text": "[removed]",
        "created_utc": 1678548691,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Alibaba a good frugal alternative?",
        "author": "goldcat88",
        "url": "https://www.reddit.com/r/Frugal/comments/11om18k/is_alibaba_a_good_frugal_alternative/",
        "text": "Has anyone used Alibaba and had a good experience? Do you have any tips to make sure you get the real product and not a counterfeit? Thanks! \n\nI was specifically looking at a red LED light therapy mask. They're pretty expensive but almost half the price on Alibaba.",
        "created_utc": 1678546233,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cost/difficulty to restore broken legs on antique sofa? Professional furniture repair or diy?",
        "author": "Impossible_Demand_62",
        "url": "https://www.reddit.com/gallery/11ol1vr",
        "text": "",
        "created_utc": 1678543597,
        "upvote_ratio": 1.0
    },
    {
        "title": "cleaning question",
        "author": "Icy-Contribution6580",
        "url": "https://www.reddit.com/r/Frugal/comments/11ok7bx/cleaning_question/",
        "text": "I have some glass bottles I use for making kombucha. For some reason, one of the bottles I CANNOT seem to get the inside clean. I have a good bottle brush and I'm scrubbing it and soaking and it's the darndest thing that it still has some residue on it. It's not a lot but it's enough that I don't feel comfortable brewing kombucha in it. Any ideas?",
        "created_utc": 1678541286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do you think people are so reluctant to move where it's more affordable?",
        "author": "SameProfession254",
        "url": "https://www.reddit.com/r/Frugal/comments/11ojku7/why_do_you_think_people_are_so_reluctant_to_move/",
        "text": "I grew up on the coast and over the last 20 years housing prices skyrocketed. My wife and I would never be able to afford a home. We ended up moving 3 hours inland and bought 3x the house for 1/2 the price. Yeah its not NYC or Boston but we live like royalty comparatively.\n\nWhenever I visit back home I always hear people complain how they cant afford a home there and when I mention the price of real estate where I live there jaw drops. Then when you suggest that maybe they move all you get is the Pikachu face. I understand that your family built a life there but I built a much better life for my family by moving.  \n\nSo aside from the obvious costs of moving why are people so reluctant to move where the cost of living is much lower?",
        "created_utc": 1678539494,
        "upvote_ratio": 1.0
    },
    {
        "title": "Contractor tip for reducing energy consumption",
        "author": "krilleaters",
        "url": "https://i.redd.it/vzbeykwlw4na1.jpg",
        "text": "",
        "created_utc": 1678533087,
        "upvote_ratio": 1.0
    },
    {
        "title": "Facebook Marketplace",
        "author": "epicchungus57",
        "url": "https://www.reddit.com/r/Frugal/comments/11od392/facebook_marketplace/",
        "text": "[removed]",
        "created_utc": 1678517113,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does price of business class upgrade really go down as travel date gets closer?",
        "author": "l00t9",
        "url": "https://www.reddit.com/r/Frugal/comments/11od32t/does_price_of_business_class_upgrade_really_go/",
        "text": "\nI’m due to fly India to US in May and have booked my tickets via trip.com.\n\nSince I had a back fracture, I want to upgrade to business class.\n\nMy original ticket costed $634, but the price for the upgraded that trip.com quoted me is another $1400.\n\nI’m wondering if it’s possible to get it for cheaper.\n\nI read somewhere that the upgrade price goes down as travel date gets closer.. is that true?",
        "created_utc": 1678517101,
        "upvote_ratio": 1.0
    },
    {
        "title": "How could a family with small kids save money with a roof over our heads?",
        "author": "michgilgar",
        "url": "https://www.reddit.com/r/Frugal/comments/11oaf5v/how_could_a_family_with_small_kids_save_money/",
        "text": "I'm just trying to brainstorm here. We're trying to save to purchase a home. I have 3 kids and we're really sick of paying over $2k a month on rent and utilities. Unfortunately small apartments are not an option for us as the kids need space to roam. We're already saving a lot by cutting out fluff, we even homeschool free which saves some. Neither my wife nor I have family we can move in temporarily with. We looked into RVing but even that's gotten pricey too. Plus we can't get to minimalist so that social services doesn't come a knockin'. Heck we even tried to do a farm apprenticeship in exchange for room/board but they didn't want kids. I do like country living, and it's cheaper out there but I have to be driving distance to an airport because I fly out 4 days a month for work. Any ideas?",
        "created_utc": 1678508123,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lost my one and only car key. What options do I have that won’t break the bank?",
        "author": "wisekhalifa",
        "url": "https://www.reddit.com/r/Frugal/comments/11o9btc/lost_my_one_and_only_car_key_what_options_do_i/",
        "text": "[removed]",
        "created_utc": 1678504688,
        "upvote_ratio": 1.0
    },
    {
        "title": "Living off a sack of potatoes for a week?",
        "author": "blackcoffee92",
        "url": "https://www.reddit.com/r/Frugal/comments/11o8xxo/living_off_a_sack_of_potatoes_for_a_week/",
        "text": "I just paid my bills and have less than $10 left in my account. I am thinking of buying a bag of potatoes as my staple for groceries this week. Should I also buy a little meat or is there something else I can eat with the potatoes? I have spices and some butter at home. Im really not sure what to do in this situation. Please help with some ideas",
        "created_utc": 1678503542,
        "upvote_ratio": 1.0
    }
]