[
    {
        "title": "https://opensea.io/collection/untitled-collection-1710544087",
        "author": "Specific-Ad-5210",
        "url": "https://www.reddit.com/r/Frugal/comments/zw2v41/httpsopenseaiocollectionuntitledcollection17105440/",
        "text": "[removed]",
        "created_utc": 1672104441,
        "upvote_ratio": 1.0
    },
    {
        "title": "what ever happened to thrifty thursdays?",
        "author": "CareBearReborn",
        "url": "https://www.reddit.com/r/Frugal/comments/zw2a3p/what_ever_happened_to_thrifty_thursdays/",
        "text": "I miss it.",
        "created_utc": 1672102824,
        "upvote_ratio": 1.0
    },
    {
        "title": "Move to one of the cheapest places in the USA with decent savings?",
        "author": "kingjp2468",
        "url": "https://www.reddit.com/r/Frugal/comments/zw1sih/move_to_one_of_the_cheapest_places_in_the_usa/",
        "text": "Hello, I’m thinking about quitting my job and moving to a rural low cost of living area and just taking life easy for a bit. I’m single and want to just do something new and different. After looking through Zillow across the USA, there’s many small towns all across the Midwest and west that I can rent a 1 bedroom apartment or even tiny home for 500-600$ or even as low as 400$ a month. Say I’ve got 25kish in savings I can just lay low, enjoy a work free life for a while, maybe do small online side gig things for money. Has anyone here done this? Any tips for saving as much money as possible doing something like this? \nAppreciate any help. \nThanks",
        "created_utc": 1672101479,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for making a couch more comfortable? More info ic",
        "author": "mayorofverandi",
        "url": "https://i.redd.it/0qdmxmfs5c8a1.jpg",
        "text": "",
        "created_utc": 1672101313,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best place for BCAAs or other supplements?",
        "author": "CherylStoned",
        "url": "https://www.reddit.com/r/Frugal/comments/zw10vn/best_place_for_bcaas_or_other_supplements/",
        "text": "I will preface this with: yes, I know getting nutrients directly from food is the best option.",
        "created_utc": 1672099453,
        "upvote_ratio": 1.0
    },
    {
        "title": "Japanese Curry- A Winter Staple",
        "author": "Individual-Topic-555",
        "url": "https://www.reddit.com/r/Frugal/comments/zw0rnx/japanese_curry_a_winter_staple/",
        "text": "Hey everyone! \n\nIf you were hit with the winter storms like me, I'm sure you're in the same boat I am. Seasonal depression has finally kicked my butt and with the end of the holiday season, I'm ready to curl up and do nothing. \n\nIn the past, I've used this time to do nothing. That includes cooking. I usually find myself either creating unhealthy struggle meals or ordering out. Now that I'm actually 💫broke💫 I've found myself turning to one of my comfort foods that is quick, easy, and relatively healthy to make: Japanese Curry!\n\nTo do this, I find some golden curry (usually 3 dollars at Walmart, but there are even larger cheaper packs at your local Asian market) and fill a giant pot with canned or frozen veggies. My protein of choice is usually chickpea since I'm vegetarian, but if you use the flashfood app, you could find awesome half priced meat products near you to put into your pot! I usually go for a mix of peas, carrots, potatoes, corn, onion, and as noted chickpeas ❤️ after heating the veggies and boiling the water, I pop in the curry stock and call it a day. While that finishes up, I'll usually make a big serving of jasmine rice. It usually lasts me 4 or 5 dinners. \n\nUnrelated, but if you need to spruce up your rice, my partner loves the lemon ginger rice from Hello Fresh. It's one of the few recipes I still follow from them and ginger holds + freezes great (look it up online and the recipe will be there!)\n\nAnyways, I figured I'd share my little \"meal prep\" with others who really struggle this time of year. I hope no matter what, you're finding ways to take care of yourself and eating your veggies ❤️ have a great night, everyone!",
        "created_utc": 1672098797,
        "upvote_ratio": 1.0
    },
    {
        "title": "Savory Oatmeal?",
        "author": "Nopumpkinhere",
        "url": "https://www.reddit.com/r/Frugal/comments/zvx3mz/savory_oatmeal/",
        "text": "I’m trying to use up some of my pantry staples as they are about to expire.  I’ve got two big canisters of oatmeal I want to use up, but I am on sweets overload after the holidays so I’m looking for something savory.\n\nMy first thought is meatloaf, does anyone have any good recipes for oatmeal bread or healthy oat bars I can freeze for a while?  Any other thoughts on what to do with this much oatmeal?",
        "created_utc": 1672089284,
        "upvote_ratio": 1.0
    },
    {
        "title": "Library.",
        "author": "PlentyCommission166",
        "url": "https://www.reddit.com/r/Frugal/comments/zvwesy/library/",
        "text": "It can be difficult to break free from the advertising cycle of hearing about a book or TV show or movie on streaming or paid publishing services. \n\nI'm trying. I browsed the library app, found an author I really like, and I'm committed to reading a couple series by her that they have - not heavy books, just enough to make my brain have positive associations with the library app, the same little dopamine drip as with other reading apps. Going to train myself away from the \"buy a book\" thing and back to \"borrow a book\". \n\nThat's all. One small step at a time.",
        "created_utc": 1672087468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best boot shoelaces to buy",
        "author": "JoeB-123",
        "url": "https://www.reddit.com/r/Frugal/comments/zvtxgk/best_boot_shoelaces_to_buy/",
        "text": "What are the best 7 hole boot shoelaces to buy for a decent price that won’t break?",
        "created_utc": 1672080830,
        "upvote_ratio": 1.0
    },
    {
        "title": "Herbert Jones of the New Orleans Pelicans is One of Us!",
        "author": "barbecue_invader",
        "url": "https://www.cnbc.com/2022/12/01/why-pelicans-herbert-jones-only-wears-free-team-gear.html",
        "text": "",
        "created_utc": 1672079303,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bob’s Red Mill Closed Their Online Store",
        "author": "judyclimbs",
        "url": "https://www.reddit.com/r/Frugal/comments/zvt2nb/bobs_red_mill_closed_their_online_store/",
        "text": "Wow! I was just putting together my annual big order of food by the case at Bob’s Red Mill and I was so sad to see they’ve discontinued the online store. The case discounts and lower online prices in general were the only way I could ever hope to be able to enjoy their products. Now at grocery store prices? Forget it. \nI wrote them a “I’m very sad” email. Maybe if they get enough of those they’ll open the online store again.  Probably not but if you miss the store tell them. They have a contact tab on their site.",
        "created_utc": 1672078561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Made tallow; how do I separate the broth?",
        "author": "andyx1234",
        "url": "https://i.redd.it/egvkbvggmb8a1.jpg",
        "text": "First time making tallow, there were some hits of meat in the trimmings; any ideas on how to separate them now? Do I need to?",
        "created_utc": 1672076689,
        "upvote_ratio": 1.0
    },
    {
        "title": "Life is contradictory",
        "author": "swingingboyboy",
        "url": "https://www.reddit.com/r/Frugal/comments/zvsd07/life_is_contradictory/",
        "text": "I saw a YouTube video and found what it says quite true. It explores the contradiction man faces. Below are a few examples:\n\n1) if a container of water has been used to washed someone’s feet, will you wash your face in it? But people don’t mind sharing the same swimming pool with others which might have athletic foot or urinating or farting in it. \n\n2) pigs large intestine stores pigs’ fecal material but after washing and throwing in some seasoning, it will become a delicacy. But if pigs fecal materials is in contact with our bowls, we will not use it no matter how many times we have washed it.",
        "created_utc": 1672076685,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is anyone still using an iPhone 6?",
        "author": "Excellent_Spite2618",
        "url": "https://www.reddit.com/r/Frugal/comments/zvrllq/is_anyone_still_using_an_iphone_6/",
        "text": "Is anyone still using an iPhone 6 in 2022? \n\nI’m still using one and it’s still working fine in general, except some apps don’t support the iOS and the iOS is kinda back dated. I’m reluctant to let go of it because it’s still working. New phones are ridiculously expensive.",
        "created_utc": 1672074587,
        "upvote_ratio": 1.0
    },
    {
        "title": "My parents trick to never pay full price for an Xmas turkey",
        "author": "thedisasterof97",
        "url": "https://www.reddit.com/r/Frugal/comments/zvqwdo/my_parents_trick_to_never_pay_full_price_for_an/",
        "text": "[removed]",
        "created_utc": 1672072619,
        "upvote_ratio": 1.0
    },
    {
        "title": "A friendly reminder to hit those reduction isles today. Great haul for me",
        "author": "themightybof",
        "url": "https://i.redd.it/x8x3tqeh8b8a1.jpg",
        "text": "All for under £20",
        "created_utc": 1672071991,
        "upvote_ratio": 1.0
    },
    {
        "title": "How I feed two adults on $250 a month on average",
        "author": "tdpoo",
        "url": "https://www.reddit.com/r/Frugal/comments/zvqm0x/how_i_feed_two_adults_on_250_a_month_on_average/",
        "text": "This is a repost of something I wrote for another platform last week, I have 2 points to add:\n*I live in a very expensive rural resort area and have to leave the county to find affordable groceries. \n*I could care less about your opinion about how little meat I eat. \n\nEnjoy!\n\n***************\n\n\nI've been feeding 2 adults on an average of $250 a month. It is important to note that we barely eat any meat these days and I'm not recommending anyone do that. I also realize not everyone has time to cook or knows how to cook from scratch.\nBut if you are interested, this is how I do it.\n \nFor the most part I cook from scratch. I buy staples, in bulk if possible. Dry beans, rice, 25 lbs of flour and sugar at a time, pasta, oats, seasonings of all kinds, boullion, stuff like that. I have a pantry full of canned basics. I keep freezer bags full of a couple types of chopped meat, sometimes I throw a handful of ham or bacon into whatever I'm cooking. We don't buy much processed food except boxed macaroni and cheese because that stuff is good. \nI have chickens and a large garden. I save, freeze, preserve everything I can. \nWe do buy milk, cheese, bread and butter but not regularly. \nI feel like I'm leaving things out. We eat out about once a month.\n\nWe eat really well, have huge variety and never go without.",
        "created_utc": 1672071813,
        "upvote_ratio": 1.0
    },
    {
        "title": "i dont know how to make money",
        "author": "justalifewithathreat",
        "url": "https://www.reddit.com/r/Frugal/comments/zvpfc8/i_dont_know_how_to_make_money/",
        "text": "[removed]",
        "created_utc": 1672068436,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the best way to whiten teeth using Hydrogen Peroxide?",
        "author": "GiveTracerOrIThrow",
        "url": "https://www.reddit.com/r/Frugal/comments/zvpfbu/whats_the_best_way_to_whiten_teeth_using_hydrogen/",
        "text": "It seems there's a bunch of different ways but which method would you say is the best, safest and or more effective? I've heard baking soda+Peroxide paste is too abrasive, and it seems the most common methods are dipping a brush into it and brushing it in, swishing it, and dipping a cotton swab/Q-tip into it and dabbing some on your teeth. Which of these methods would you say is the most effective?",
        "created_utc": 1672068435,
        "upvote_ratio": 1.0
    },
    {
        "title": "Planning as a superpower for being frugal",
        "author": "pundurruksis",
        "url": "https://www.reddit.com/r/Frugal/comments/zvp5it/planning_as_a_superpower_for_being_frugal/",
        "text": "I think planning is the ultimate superpower for frugality. In my experience, the most useless purchases are made in a hurry. I don't really know why this is, but I tend to do things at the last minute. I do things at the last minute, both at work and in life, and it causes me a lot of stress. So at the end of this year, I am thinking about a habit or two that I can introduce into my life in the coming year. \n\nWhat I'm doing now:\n-I have a monthly budget and more or less manage to stick to it, and manage to save and invest about 10-15% of my income.\n-I have prepared a grocery list of products that I always have at home so that my husband and I don't have to order food when we are in a hurry. I buy them regularly and the number of spontaneous food orders has decreased significantly.\n-Sometimes I cook on a Sunday - I peel and chop the vegetables to eat the following week, so cooking is very quick and efficient.\n-I also started to keep an eye on discounts at the local pharmacy to get the best price on vitamin D and omega3.\n\nSomething I would like to do, but I am not getting it right now:\n-Making gifts in time. This year I bought Christmas presents on 24 December because I had a lot of last-minute work to do at mu day job. Some last-minute work lead to other and it's like a vicious circle. Ideally, I would like to make my own presents because I know how to sew, crochet and knit, but I have never done it in time to prepare a present.\n-I would like to make a little snack for a party I'm attending or organising myself, instead of buying snacks again at the last minute.\n-I would like to plan my work and leisure schedule so that I can work and relax properly and sometimes even socialise.\n\nDo you have any easy-to-implement planning tips? I have tried some productivity courses but they worked for maybe a month but after that I felt drained and robotic.\n\nFor context: 30F, I work full time and do a lot of voluntary work. I don't have children and I live in an apartment, not a house.\n\nP.S. Sorry for broken english",
        "created_utc": 1672067622,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using Old Toothbrush Heads To Clean Electronics: Works Great For AirPods!",
        "author": "PivotalPosture",
        "url": "https://i.redd.it/1hxjpka6oa8a1.jpg",
        "text": "",
        "created_utc": 1672065156,
        "upvote_ratio": 1.0
    },
    {
        "title": "$10 off LED Teeth Whitening Kit",
        "author": "reddit5326",
        "url": "https://www.reddit.com/r/Frugal/comments/zvf91f/10_off_led_teeth_whitening_kit/",
        "text": "So I already posted this kit I found on r/deals but I had to post it here too. I found this electronic teeth whitening kit on sale and it’s way cheaper than any of them on amazon. Check it out while it’s still up:\n\n[https://naturebringsbeauty.com/products/led-teeth-whitening-kit](https://naturebringsbeauty.com/products/led-teeth-whitening-kit)",
        "created_utc": 1672029887,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your 2023 goals?",
        "author": "Brilliant_Toe_3801",
        "url": "https://www.reddit.com/r/Frugal/comments/zvf4m6/what_are_your_2023_goals/",
        "text": "Mine are to:\n\n- make more food at home\n- start chickens\n- actually do my garden right \n\nI hope to save money too, but as a newly single woman and pet mom it’s gonna be fun. 😂",
        "created_utc": 1672029447,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moving truck policy is melting my brain. Am I going to be sued if I try to save on mileage?",
        "author": "Status_Ad_8784",
        "url": "https://www.reddit.com/r/Frugal/comments/zvf1f6/moving_truck_policy_is_melting_my_brain_am_i/",
        "text": "[removed]",
        "created_utc": 1672029123,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best places to buy Christmas item discounts after Christmas",
        "author": "pinback77",
        "url": "https://www.reddit.com/r/Frugal/comments/zvedrv/best_places_to_buy_christmas_item_discounts_after/",
        "text": "Any recommendations on where to go to get things like Christmas lights / decorations stores want to unload now that could be used for next year?",
        "created_utc": 1672026773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saving money on electric bill",
        "author": "miscstyx01",
        "url": "https://www.reddit.com/r/Frugal/comments/zve17r/saving_money_on_electric_bill/",
        "text": "Hi all, I am looking to see what ways you guys save money on energy bill while having a central air system. The apartment I’m living (SoCal) in has central air/heat and is the main reason why my summer bills have been so costly. My average monthly bill for this year was $242 and hoping I can lower it next year. Any recommendations for products/tips that can help with saving energy during times of extreme weather would be greatly appreciated.",
        "created_utc": 1672025542,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much does it cost in electricity to cook food at home?",
        "author": "funnyelbow",
        "url": "https://www.reddit.com/r/Frugal/comments/zvdzub/how_much_does_it_cost_in_electricity_to_cook_food/",
        "text": "I’m aware this will vary a lot per household. This summer, during the infamous heat wave, my electric bill was $40-50 LESS every month, compared to what it had been during winter! And I kept my thermostat at 70° all summer (it was 68-70° during winter)\n\nI had no idea that cooking at home would affect my electric bill that much. I came to this conclusion, when had I realized that I stopped cooking at the beginning of summer (disability issues) and ate mostly microwaveable foods, sandwiches, etc.\n\nDoes cooking really use that much electricity? I’m too lazy to look at all my appliances and do the math on how much electricity they use. Just wondering if anyone else has dived down this rabbithole.\n\nI guess I’ll know for sure if cooking was costing me that much, depending on how high this winter’s electric bills are. And if I’m right about it, then I want to figure out healthier meals that involve less electricity, lol.",
        "created_utc": 1672025413,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got colonge I didn’t want how can I figure out which store is from and get store credit without receipt ?",
        "author": "lostacoshermanos",
        "url": "https://www.reddit.com/r/Frugal/comments/zvdtr6/i_got_colonge_i_didnt_want_how_can_i_figure_out/",
        "text": "I obviously don’t want to tell the guy who gave it to me I hate Old Spice.",
        "created_utc": 1672024819,
        "upvote_ratio": 1.0
    },
    {
        "title": "pants crotch area",
        "author": "bai-",
        "url": "https://www.reddit.com/r/Frugal/comments/zv8d9o/pants_crotch_area/",
        "text": "Hey guys I have no experience with sewing.\n\nBut my crotch area on my wranglers cargo pants is starting to wear thin and I was wondering if there are places that repair it? Or if there's a good video on how to fix. \n\nThey're my work pants and expensive so I wanted to save a few bucks",
        "created_utc": 1672007386,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are tasty, healthy and frugal meals to freeze?",
        "author": "trv893",
        "url": "https://www.reddit.com/r/Frugal/comments/zv6rqw/what_are_tasty_healthy_and_frugal_meals_to_freeze/",
        "text": "I would like to cut down on time spent cooking by making large batches of food that can be frozen and that will still taste good after getting reheated. \n\nWould love suggestions of types of food (lasagna, stew..) or recipes that you know and love!\n\nThanks everyone!",
        "created_utc": 1672002623,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which is better between BJ's or Costco?",
        "author": "TonyFoyer",
        "url": "https://www.reddit.com/r/Frugal/comments/zv60o2/which_is_better_between_bjs_or_costco/",
        "text": "[removed]",
        "created_utc": 1672000346,
        "upvote_ratio": 1.0
    },
    {
        "title": "Costco - best purchases",
        "author": "bayla_honeybee",
        "url": "https://www.reddit.com/r/Frugal/comments/zv5tdm/costco_best_purchases/",
        "text": "We got a Costco membership for Christmas, but I’ve never shopped there before. What are the typical best purchases at Costco for saving $?",
        "created_utc": 1671999726,
        "upvote_ratio": 1.0
    },
    {
        "title": "Decided to pick up some new hobbies this year and made a bunch of presents for friends and family!",
        "author": "ws1173",
        "url": "https://www.reddit.com/gallery/zv5pvk",
        "text": "",
        "created_utc": 1671999434,
        "upvote_ratio": 1.0
    },
    {
        "title": "An Experiment in Cutting My Grocery Bill: Buying Produce Loose and Packaging It Myself",
        "author": "FetchingEels",
        "url": "https://www.reddit.com/r/Frugal/comments/zv5pu9/an_experiment_in_cutting_my_grocery_bill_buying/",
        "text": "Hey r/frugal,\n\nI recently conducted an experiment to see if I could cut my grocery bill by buying produce loose and packaging it myself. I've seen a lot of people recommend this trick as a way to save money, so I wanted to put it to the test and see if it really works.\n\nHere's what I found: buying produce loose and packaging it myself did indeed save me money. For example, I used to buy a bag of pre-cut carrots for $3.99. But when I started buying them loose and cutting them myself, I was able to get twice as many carrots for the same price. That's a savings of $3.99 every time I go to the grocery store!\n\nAnd it's not just carrots - I've found that this trick works for a lot of different types of produce. By buying loose and packaging it myself, I've been able to save anywhere from 20-50% on my grocery bill.\n\nNow, I know this might not work for everyone. Some people might not have the time or inclination to cut their own produce, and that's totally fine. But for those who are looking to save a little extra money on their grocery bill, this might be worth a try.\n\nThanks for reading, and happy shopping!",
        "created_utc": 1671999430,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have hope for my spending problem &amp; frugal rehab plan. 2023 is my no more Starbucks or Panera year. 100% DIY soups, sandwiches &amp; fancy coffee drinks!",
        "author": "TMJX42",
        "url": "https://i.redd.it/ng267wj3x48a1.jpg",
        "text": "",
        "created_utc": 1671995515,
        "upvote_ratio": 1.0
    },
    {
        "title": "I recently Graduated with my Bachelor's Degree, all without student loans!",
        "author": "mohawk_ADE",
        "url": "/r/selfimprovement/comments/zv3s2n/i_recently_graduated_with_my_bachelors_degree_all/",
        "text": "",
        "created_utc": 1671994965,
        "upvote_ratio": 1.0
    },
    {
        "title": "free $750 PayPal giveaway",
        "author": "Opening-Profession98",
        "url": "https://sites.google.com/view/paypal-giveway-website-2023/home",
        "text": "",
        "created_utc": 1671992347,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Christmas Hot Deals!] Get up to 80% Off on Windows 10, Windows 11, Office 2019, 2021 and more Use Coupon: XMAS22",
        "author": "MarilynBankse",
        "url": "https://mskeydeals.com/",
        "text": "",
        "created_utc": 1671989390,
        "upvote_ratio": 1.0
    },
    {
        "title": "paper mache gift cover out of scrap paper",
        "author": "axolotltail",
        "url": "https://i.redd.it/d51pnplfe48a1.jpg",
        "text": "",
        "created_utc": 1671989262,
        "upvote_ratio": 1.0
    },
    {
        "title": "Eating healthy doesn’t have to be expensive! Rather than $0.75 per oz for sprouts at my local grocery store, I’ve started to grow sprouts in mason jars for approximately $0.16 per oz and can get it down to $0.07 per oz if I buy seeds in bulk.",
        "author": "RelayFX",
        "url": "https://www.reddit.com/gallery/zv29i1",
        "text": "",
        "created_utc": 1671988914,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wrapping inspired by u/jiniopas",
        "author": "Engineer443",
        "url": "https://www.reddit.com/gallery/zv1die",
        "text": "",
        "created_utc": 1671986195,
        "upvote_ratio": 1.0
    },
    {
        "title": "Amazon Smart Plug 4.99 instead of 24.99",
        "author": "Hengeloul",
        "url": "http://rilitech.com",
        "text": "",
        "created_utc": 1671985424,
        "upvote_ratio": 1.0
    },
    {
        "title": "Amazon Smart Plug 4.99 instead of 24.99 with a code today",
        "author": "cydsoddiar",
        "url": "http://gruttech.com",
        "text": "",
        "created_utc": 1671984729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Building a cabinet for the kitchen",
        "author": "Distributor127",
        "url": "https://i.redd.it/gg1tx81we28a1.jpg",
        "text": "",
        "created_utc": 1671983208,
        "upvote_ratio": 1.0
    },
    {
        "title": "Couches: Room &amp; Board, EQ3, or West Elm?",
        "author": "anonymouspsy",
        "url": "https://www.reddit.com/r/Frugal/comments/zuzjj1/couches_room_board_eq3_or_west_elm/",
        "text": "[removed]",
        "created_utc": 1671980075,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for buying a used projector?",
        "author": "geozuf",
        "url": "https://www.reddit.com/r/Frugal/comments/zux7sx/tips_for_buying_a_used_projector/",
        "text": "Hey! I’d like to buy a used projector, but I don’t know what to keep in mind while I’m shopping. I’d like to buy something off eBay that’ll last and has good picture quality. What’s a good number of lamp hours for a used projector? Any other recommendations for things to look for?\n\nThanks!",
        "created_utc": 1671971216,
        "upvote_ratio": 1.0
    },
    {
        "title": "just dropped",
        "author": "jjjiiqie",
        "url": "https://www.grocafrica.com/download?link=TfEvlQ2VSILjXPB",
        "text": "",
        "created_utc": 1671964822,
        "upvote_ratio": 1.0
    },
    {
        "title": "Upcycling Old Cellphones",
        "author": "MyInnerCircle",
        "url": "https://www.reddit.com/r/Frugal/comments/zuuucr/upcycling_old_cellphones/",
        "text": "It dawned on me that I can use my old cellphones for their timer / alarm function alone, in airplane mode. As I keep several timers around the house, and needed more this is actually super useful! \n\nI have seen posts where people used old cellphones for their video camera function as well, as in dash or security cams. \n\nAny other uses (besides calculator lol) ?",
        "created_utc": 1671960635,
        "upvote_ratio": 1.0
    },
    {
        "title": "Making the new living room comfortable, with little money to spare?",
        "author": "Charming-Falcon-2012",
        "url": "https://www.reddit.com/r/Frugal/comments/zuske6/making_the_new_living_room_comfortable_with/",
        "text": "Hello all, so my landlord has decided to get rid of our current living room and convert it into a private bedroom for a new tenant. Instead, she has converted the conservatory into the living room space - she has insulated the roof for us, but that’s all she’s done for making it pleasant. There’s two windows and a cat flap in there that can’t be shut as they are broken - I’ve contacted her about it and hopefully it’ll be fixed soon, but it’s definitely not helping matters…\n\nI’m really struggling mentally, and not having a comfortable communal space to hang out in is making it much, much worse. I want to do whatever I can to make this new living room pleasant to live in - one of the main things at the moment is getting it warm. I assume investing in rugs might be a good idea - but is there anything else we can do to heat this up? \n\nAnd the other thing is personal touches and comfort items - it’s a hard floor conservatory which is not designed for comfort. I want to make it a nice place to hang out, sat on the floor, playing games like we used to. But I’m stumped for ideas that won’t break the bank- any advice is appreciated!",
        "created_utc": 1671950582,
        "upvote_ratio": 1.0
    },
    {
        "title": "Christmas gifts stolen",
        "author": "EngineerOutrageous51",
        "url": "https://www.reddit.com/r/Frugal/comments/zusexa/christmas_gifts_stolen/",
        "text": "5 days ago someone broke into my home. There are maintenance people installing the new fiber internet around the perimeter of our development (I truly believe it was then). I came home for lunch one day (on a gut instinct, I NEVER DO.) I walked in, saw all the lights on (I NEVER leave lights on). I saw all my kids wrapped gifts were stolen. I reached out to our rental insurance company. They are going to reimburse me for anything I have receipts for. However, it won't be in time for Christmas tomo morning. I sent  my boys to their dads tonight (they didn't want to go, they begged and pleaded to do xmas here). I don't have any gifts.. I'll do ANYTHING To get their preset set tonight and payback tomo. No QUESTIONS.",
        "created_utc": 1671949924,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question: Can I make money off the AT&amp;T trade-in",
        "author": "AwkwardGriffy",
        "url": "https://www.reddit.com/r/Frugal/comments/zuse7j/question_can_i_make_money_off_the_att_tradein/",
        "text": "I have some old phones (2-3 years), and AT&amp;T has a bunch of deals where you can trade in a phone and get $1000 towards a new one. What's to stop me from trading in an old phone and buying a new one for like $500 after or something after the discount and just turn around and sell it online for like $1000?\n\nAlternate option; I have insurance on my current phone, couldn't I send it in to get repaired (because it does have some damage) and sell my newly fixed phone and then trade in one of my old ones and just buy a new one with the $1000 credit and basically get a new phone for free?",
        "created_utc": 1671949842,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bleach stain on carpet: it’s better to repatch spot with new carpet or dye it?",
        "author": "Impeccabilis",
        "url": "https://www.reddit.com/r/Frugal/comments/zur95t/bleach_stain_on_carpet_its_better_to_repatch_spot/",
        "text": "First time ever that I end up with a stain on my carpet and Idk what to do. I do have carpet scrap downstairs left behind from when it was installed but I also wouldn’t mind dyeing the carpet IF possible. The problem is, the stain it’s bleach!",
        "created_utc": 1671945273,
        "upvote_ratio": 1.0
    },
    {
        "title": "Woke up cold in the main part of the house last night. Noticed a breeze.",
        "author": "LuckyMuckle",
        "url": "https://i.redd.it/33n44eqakz7a1.jpg",
        "text": "This actually works like a charm!",
        "created_utc": 1671930676,
        "upvote_ratio": 1.0
    },
    {
        "title": "Out of curiously what is your pay range and do you live comfortably? What's your age and how much do you have saved?",
        "author": "Ithinkimokay19xx",
        "url": "https://www.reddit.com/r/Frugal/comments/zunasa/out_of_curiously_what_is_your_pay_range_and_do/",
        "text": "How frugal are you truly living?",
        "created_utc": 1671930401,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aluminum foil used as wrapping paper. It's cheaper and looks cooler.",
        "author": "lovetoruin",
        "url": "https://i.redd.it/5gvcl7syzw7a1.jpg",
        "text": "",
        "created_utc": 1671929487,
        "upvote_ratio": 1.0
    },
    {
        "title": "DIY Christmas gift wrap",
        "author": "sarcofaguy",
        "url": "https://v.redd.it/7agkejomaz7a1",
        "text": "",
        "created_utc": 1671927525,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a southwest airlines gift card for sale. $145 for 80% cash app or PayPal",
        "author": "KiingRiick",
        "url": "https://www.reddit.com/r/Frugal/comments/zum54u/i_have_a_southwest_airlines_gift_card_for_sale/",
        "text": "[removed]",
        "created_utc": 1671926442,
        "upvote_ratio": 1.0
    },
    {
        "title": "upcycled shopping bags",
        "author": "Positive_Use_4834",
        "url": "https://i.redd.it/f985dlcgyy7a1.jpg",
        "text": "",
        "created_utc": 1671923330,
        "upvote_ratio": 1.0
    },
    {
        "title": "When is the best time to buy winter clothes?",
        "author": "SolutionLeading",
        "url": "https://www.reddit.com/r/Frugal/comments/zul69f/when_is_the_best_time_to_buy_winter_clothes/",
        "text": "I’m wanting to buy some women’s winter clothes (sweaters mainly) and I see a lot of Christmas sales right now, but I’m wondering if I should hold out until January or February for deeper discounts? When do you normally buy winter clothes on sale?",
        "created_utc": 1671923314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ideas for using up 3 pounds of ham?",
        "author": "ChronicAlienOGKush",
        "url": "https://www.reddit.com/r/Frugal/comments/zul4nw/ideas_for_using_up_3_pounds_of_ham/",
        "text": "Basically we have 3 or more pounds of ham left between two people and I need ideas on recipes that use ham to freeze or refrigerate so it doesn't go to waste. Ideas?",
        "created_utc": 1671923173,
        "upvote_ratio": 1.0
    },
    {
        "title": "Buy 'Big Kids' Winter boots instead of Women's boots",
        "author": "RikiKikiTaco",
        "url": "https://www.reddit.com/r/Frugal/comments/zul1ux/buy_big_kids_winter_boots_instead_of_womens_boots/",
        "text": "If you have a shoe size that is a Woman's 8/9 or smaller you can buy Big Kids winter boots and save.\n\nI'm a women's size 7.5 (24cm). I bought 2 pairs of Merrell Big Kids boots. I got hiking boots and snow boots both in a Big Kids size 7 directly from the Merrell website.\n\nI spent $70 including shipping for the 2 pairs. I would have spent over $100 for the hiking boots alone in my Women's size. Also the kids color choices are cuter.\n\nI will say that Merrell is true to size and I should have gotten a size 6 since I bought these on clearance and they aren't exchangeable. I'm going to buy thick socks.",
        "created_utc": 1671922933,
        "upvote_ratio": 1.0
    },
    {
        "title": "use last year's cards for package tags",
        "author": "MoonEagle3",
        "url": "https://i.redd.it/cgxzut8dry7a1.jpg",
        "text": "",
        "created_utc": 1671920948,
        "upvote_ratio": 1.0
    },
    {
        "title": "$15 vintage Electrolux vacuum still going strong",
        "author": "The12thparsec",
        "url": "https://i.redd.it/t8r32i7oby7a1.jpg",
        "text": "",
        "created_utc": 1671915668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fighting the urge not to spend?",
        "author": "Putrid_Acanthaceae",
        "url": "https://www.reddit.com/r/Frugal/comments/zuik03/fighting_the_urge_not_to_spend/",
        "text": "Does anyone struggle to enjoy spending money such as $5 on coffee or any kind of frivolous activity. \n\nI’ve had to get better at accepting experiences (in a city) will cost more then they should and anyway I can afford it. \n\nMost people I know think this is a totally weird concept and think nothing of buying overpriced food at a petrol station or whatever else",
        "created_utc": 1671915266,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you run out, or don’t have wrapping paper, you can use any newspaper or magazines you have laying around instead.",
        "author": "lordfukwad",
        "url": "https://i.redd.it/bssayo236y7a1.jpg",
        "text": "[removed]",
        "created_utc": 1671913793,
        "upvote_ratio": 1.0
    },
    {
        "title": "Halving my napkins times are tough. Quartering is extreme. That’s next. Happy holidays everyone",
        "author": "Steve53110",
        "url": "https://i.redd.it/du3f0nmk5y7a1.jpg",
        "text": "",
        "created_utc": 1671913629,
        "upvote_ratio": 1.0
    },
    {
        "title": "I had so much fun making these Cartoon gift wrapping! Inspired by the Borderlands videogame",
        "author": "jijiopas",
        "url": "https://i.redd.it/lgpe4sbs5w7a1.jpg",
        "text": "",
        "created_utc": 1671912992,
        "upvote_ratio": 1.0
    },
    {
        "title": "Upgrade unlocked!",
        "author": "darkner",
        "url": "https://imgur.com/a/0g5y1Yn",
        "text": "Got a cheap pocket mod with a new battery off of Next Door.  It was purple with flowers on it.  2 new and one leftover cans of paint later, Boom, spiderman bike for my son =)",
        "created_utc": 1671911578,
        "upvote_ratio": 1.0
    },
    {
        "title": "Present tag: cut a post it note in half",
        "author": "_kochino",
        "url": "https://i.redd.it/0yxdbjp5zx7a1.jpg",
        "text": "",
        "created_utc": 1671911468,
        "upvote_ratio": 1.0
    },
    {
        "title": "When do the turkeys go on sale?",
        "author": "qqererer",
        "url": "https://www.reddit.com/r/Frugal/comments/zug4yq/when_do_the_turkeys_go_on_sale/",
        "text": "Got the flyer for the $3/lb fresh turkey.  Christmas is tomorrow.\n\nTrying to time it to get the clearance 99c/lb price.  \n\nWhen do the markdowns start happening?  Boxing day?  A couple days after?  My last little test to show up on the 'best before' date was too late, so I'm trying to figure out how to time it better.",
        "created_utc": 1671908023,
        "upvote_ratio": 1.0
    },
    {
        "title": "DIY dollar Tree gifts. ice cream kis for the nieces and nephews. Christmas bowls ice cream scoop and homemade Carmel sauce. brother a bottle of cheery mead and a homemade wine bag. great niece bath finger paints and homemade boo boo bags ( ice packs covered in cloth) sister in law yarn bowl",
        "author": "DataGal2022",
        "url": "https://i.redd.it/00smyk07lx7a1.jpg",
        "text": "",
        "created_utc": 1671906764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Keep your heat in your house with a dollar's worth of masking tape",
        "author": "larvitar",
        "url": "https://imgur.com/o5x9gqr.jpg",
        "text": "",
        "created_utc": 1671906313,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling to get my parent to respect my budget for Christmas",
        "author": "Sharp_Platform_3530",
        "url": "https://www.reddit.com/r/Frugal/comments/zuerq1/struggling_to_get_my_parent_to_respect_my_budget/",
        "text": "Hello everyone ! I struggled to figure out where to post this in. I think this best place because my parent is spender and I’m saver.I had a clear and concise budget on what to spend on my parent and grandparent which was 100 each. Next year I’m cutting that in half or doing handmade gifts only. But my parent does not respect my budget what so over they requested 130 perfume bottle tried to man handle me to get it. I told them no I’m only giving 100 dollars. Tried to convince me and gas light me to get them 70 dollars flowers I didn’t do it. \n\nFurthermore, tried stick me with paying for half of a shipping bill that I didn’t know about beforehand. I told them I need to know about these extra cost because I assumed since it’s was the parent idea to send everything in a box. They will pay for it or they would let me know from the beginning so I could adjusted what I can spend on an actual gift but nope. On top of that they asked to borrow twenty dollars to put in said box then tried not give back to me. They were like ohhh well I paid shipping are you going to give me half on shipping. Luckily they sent me the twenty dollars ,but it’s not the money. It’s about the attempts to extort,gas light, and trying to focus me to pay for stuff on the back end which makes me feel unsafe. I’m saver and frugal because it’s empowering no surprises and allows me adjust my budget accordingly. Plus allows me to save for real emergency like I need a family law lawyer earlier this year without my vigorous budgeting I wouldn’t have been able too .Additionally, I need a car badly which what I’m saving for. No family or parent to help just me super unfortunate but getting there .The only issue is that they are spiteful now they are requesting I pay 60 dollars for adding me on there dental even though it’s was free before all this because I want boundaries regarding my spending and priorities. Also they pressured me to go half on a cake I didn’t even want. They ambushed me even though I tried to tell them no I don’t  want this cake why do I have go half. This has me wanting to cancel Christmas dinner now because for Thanksgiving dinner I was left paying the whole bill my parent cooked but between the crab,garlic noddles,and drink my parent paid for nothing when they were suppose to cover everything outside crab since that cost the most. \n\nNot to mention, my parent basically trying to say if I don’t buy them stuff I’m not showing appreciation for her. I’m like I can appreciate you and not buying you everything you want because your overspend all the time. I tried to say everything I said in the  forum in non judgemental reaffirming way non hostile but it triggered my parent anyway. I love the help I receive sometimes it’s convenient though my parent charges sometimes. For context, I have a toddler with ASD single parent live in HCOL in college part time job, this parent is the only help I get. Thank you for reading. Having boundaries is a huge part of being frugal when financial literacy is so low in USA.",
        "created_utc": 1671903985,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some tips. Hope this helps. 🍀 [feel free to copy + paste elsewhere]",
        "author": "iridescentrae",
        "url": "https://www.reddit.com/r/Frugal/comments/zue100/some_tips_hope_this_helps_feel_free_to_copy_paste/",
        "text": "[removed]",
        "created_utc": 1671901809,
        "upvote_ratio": 1.0
    },
    {
        "title": "PROOF! EARN UP TO 250$ FOR REGISTRATION!",
        "author": "Substantial-Trick728",
        "url": "https://www.reddit.com/r/Frugal/comments/zudkga/proof_earn_up_to_250_for_registration/",
        "text": "[removed]",
        "created_utc": 1671900450,
        "upvote_ratio": 1.0
    },
    {
        "title": "frugal way to store medicine?",
        "author": "inserthereandthere",
        "url": "https://www.reddit.com/r/Frugal/comments/zudh1c/frugal_way_to_store_medicine/",
        "text": "Hi, could anybody give me any frugal advice on storing medicine? one of my daily medicine needs to keep in between 68 f to 77 f. I normally turn off my heat at night which makes our room temperature drop to 50 F ish or lower(thx Elliott!!!) in the morning. is there any good way to store the medicine? \n\nI am trying to buy a cigar cooler (but somehow I don't see they have a temperature control function) \n\nFor medicine with temperature control function, normally they are for insulin, which does not suit my need. \n\nor just put my medicine at work?\n\n&amp;#x200B;\n\nAny advice will be appreciated!",
        "created_utc": 1671900152,
        "upvote_ratio": 1.0
    },
    {
        "title": "Most efficient way to heat",
        "author": "Suspicious-Abalone77",
        "url": "https://www.reddit.com/r/Frugal/comments/zudfmk/most_efficient_way_to_heat/",
        "text": "I am in MN in a 2 story house with a finished basement. When we got our high efficiency furnace a few years ago they told us we should have the fan on the furnace running at all times and that would keep the temperature consistent throughout the house. In the summer I close all the vents in the basement because it naturally stays cool down there but in the winter I open the vents with the logic of the heat will rise and help heat the 2 floors above it. Am I wasting energy by having the basement vents open? It is quite cold down there with them closed but we really don’t use the space. What is the most efficient way to go about heating this style of home?",
        "created_utc": 1671900030,
        "upvote_ratio": 1.0
    },
    {
        "title": "Optimizing Baseboard Heater Fins?",
        "author": "ShitOnRecruiters",
        "url": "https://www.reddit.com/r/Frugal/comments/zude8w/optimizing_baseboard_heater_fins/",
        "text": "I have copper pipes w/ fins in my apartment unit (very old and poorly insulated!).\n\n&amp;#x200B;\n\n1. **Cleaning.** I'm in the process of cleaning the fins and pipes.  I highly doubt they've ever been cleaned.  Can I anticipate a material impact on the efficiency of my system?  Suppose I have doubts that this kind of dust removal will materially help?\n2. **Adding radiator fins.**  Right now I have fins placed under windows, but large sections of pipe are uncovered.  (Also, the owner put in a electric heater since the heating isn't so great.)   Should I anticipate any material savings when adding new snap-on fins... I'm likely moving this year, and the fins are $60/two feet.  I'm doubting these will pay themselves off before I move.",
        "created_utc": 1671899910,
        "upvote_ratio": 1.0
    },
    {
        "title": "Slip Free Crocks",
        "author": "unabum",
        "url": "https://i.redd.it/enn7axmpxw7a1.jpg",
        "text": "",
        "created_utc": 1671898878,
        "upvote_ratio": 1.0
    },
    {
        "title": "$500 energy bill for Christmas - Saving on electricity",
        "author": "Livepoordierich",
        "url": "https://www.reddit.com/r/Frugal/comments/zuc2u0/500_energy_bill_for_christmas_saving_on/",
        "text": "We got an $500 energy bill for the month of December (20 Nov - 20 Dec 2022). Was truly Murphy's law, with cold weather and a broken heater which ran overtime. Exact reasons why it was so high are too long to get into right here but you can read about it in [this post](https://livepoordierich.com/index.php/2022/12/24/500-energy-bill-for-christmas/). \n\n**Energy saving options**  \nI was wondering how you can save some energy costs. Here is a list of measures to reduce your energy bill:\n\n*  Lowering the room temperature\n*  Wearing warm clothes.\n*  Off-peak hours\n*  Insulating your house \n*  Shorter showers \n*  Solar panels\n\n**Reccomendations by US department of energy**  \n[The US dept](https://www.energy.gov/energysaver/reducing-electricity-use-and-costs) of energy also has some great recommendations on saving power:\n\n* energy-efficient appliances and electronics \n* energy-efficient lighting \n* energy-efficient space heating and cooling \n* Electric water heating \n* Reducing your “always-on” appliances.  \n* Get rid of extra appliances you don’t need (extra refrigerators etc.) \n\n**Travel hacking / arbitrage**  \nYou can also save money on electricity by planning your time off / vacation in the winter. Some retirees I know have done this (planned a trip to Asia). \n\nDo you guys have more ideas for saving on electricity to add to the list?",
        "created_utc": 1671895841,
        "upvote_ratio": 1.0
    },
    {
        "title": "Least Painful Way to Replace 40+ Windows?",
        "author": "petethepianist",
        "url": "https://www.reddit.com/r/Frugal/comments/zuaxmy/least_painful_way_to_replace_40_windows/",
        "text": "After years of hard work and saving, my wife and I were able to move into our dream home, knowing some work would be needed here and there. We knew buying a Toll Brothers house would mean some builder's grade materials and cut corners but overall the house has been great. It's about 25 years old and is still mostly original (we replaced the roof earlier this year and know the heat/AC is coming soon).\n\nThe windows are probably the biggest issue we'll face, and I'm dreading needing to address them. They have some cosmetic issues (trapped gas causing a fogged look, etc), as well as some inefficiency with their seal. Is there anything we could consider to not end up with a $20k+ bill? We plan to stay in this house for the next 20-30 years.",
        "created_utc": 1671892213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Waterpik: Worth it?",
        "author": "PivotalPosture",
        "url": "https://www.reddit.com/r/Frugal/comments/zua5k0/waterpik_worth_it/",
        "text": "Oral hygiene is my top priority. Since I didn’t take care of my teeth for the first quarter of my life, I have periodontal disease. Luckily, I caught it before it became a major issue &amp; have done a complete 360. \n\nRecently, I’ve had issues where pepper gets stuck above where I can’t floss. I have dental\nInsurance &amp; removal is free, however, I usually have to take time off work or stress out.\n\nBeyond getting to those hard to reach places, are they worth getting? I don’t mind spending $50-70 if it will improve my oral health &amp; save me from super major gum problems. \n\nI brush and floss twice a day.",
        "created_utc": 1671889603,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learn how to make a 1000$ Per Month from YouTube , This is the Successful Unique Strategy To Run 7 YouTube channel At a Time.",
        "author": "Plenty-Cry0",
        "url": "https://docs.google.com/document/d/1spUbdXIJvY8Yn6cn7QXvUD9WfCXml8sd7bFHYs24rUc/edit?usp=drivesdk",
        "text": "",
        "created_utc": 1671880748,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is my natural gas cost so high?",
        "author": "ihatemyselfalot-lol",
        "url": "https://www.reddit.com/r/Frugal/comments/zu7ivo/why_is_my_natural_gas_cost_so_high/",
        "text": "The only thing that runs on natural gas in my house is the oven. I use it maybe once or twice a month. It is the very highest section of my power bill. This month to date I owe: $20 for natural gas, $14 for heat, $11 for wall plug ins, and $6 for laundry. \n\nIs natural gas expensive? What am I missing?",
        "created_utc": 1671879090,
        "upvote_ratio": 1.0
    },
    {
        "title": "Use hot water to heat room?",
        "author": "blodskjegg",
        "url": "https://www.reddit.com/r/Frugal/comments/zu749b/use_hot_water_to_heat_room/",
        "text": "I’m controlling my hot water tank so it heats during the cheapest electricity prices during the day.\n\nAnd I tought of an idea, If I will fill a bucket or two before I go to bed I would in theory pay the cheapest price possible to increase the room heat with the hot water?\n\nOr is that a so small amount of saved money that is not worth thinking about?",
        "created_utc": 1671877273,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saved $$$ using a steam shot instead of purchasing cleaners to clean (most) things!!!",
        "author": "misunderstoodlettuce",
        "url": "https://www.reddit.com/r/Frugal/comments/zu4ryp/saved_using_a_steam_shot_instead_of_purchasing/",
        "text": "[removed]",
        "created_utc": 1671867508,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there apps to track money you’ve saved?",
        "author": "Floofyland",
        "url": "https://www.reddit.com/r/Frugal/comments/zu3ngc/are_there_apps_to_track_money_youve_saved/",
        "text": "I’m too frugal for my own good. I very often go lengths to save money and think I’ll use that saved money to splurge and then not end up splurging. I feel so guilty every time I spend money especially if it could’ve been avoided, but it’s become unhealthy to where I’m never treating myself. To try to combat this, I’ve been manually documenting money that I saved to show myself that I have “free spending money”. I found out there’s an app for smokers called Quit Now that tracks how much $ they saved by not smoking. I’m not a smoker, so I wanted to know if there’s apps similar to this but for every day life.",
        "created_utc": 1671863134,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thermostat question",
        "author": "oltop",
        "url": "https://www.reddit.com/r/Frugal/comments/zu2769/thermostat_question/",
        "text": "Figure you guys will have the answer to this one.  Here's the scenario:\n\n30 degrees outside.  Person A keeps the thermostat at 60 for the day, Person B keeps it at 75.  Does Person B only pay slightly more due to the furnace needing to run longer initially to get to 75 degrees? Or does Person B pay a bunch more due to them having the heat at 75",
        "created_utc": 1671857965,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cheap car to drive back and forth to work, the drive there in back in total is 14miles at the most.",
        "author": "Pitiful-Ad-9080",
        "url": "https://www.reddit.com/r/Frugal/comments/zu1myi/cheap_car_to_drive_back_and_forth_to_work_the/",
        "text": "Will only use it for groceries and to go to work as a college student. Just taking a break from school and working full time.   Don’t need something expensive, $3000 possibly. Only using it until I’m done with school.\n\nPlan on getting internships and whatnot to make more money down the line. Atm I’m gonna join amazon for a bit or wfh if I can.",
        "created_utc": 1671856007,
        "upvote_ratio": 1.0
    },
    {
        "title": "Welded my mom a Dragonfly",
        "author": "ApollosWrath89",
        "url": "https://i.redd.it/xa4vwad36r7a1.jpg",
        "text": "",
        "created_utc": 1671847053,
        "upvote_ratio": 1.0
    },
    {
        "title": "Welded my mom a butterfly",
        "author": "ApollosWrath89",
        "url": "https://i.redd.it/sxyupkef5r7a1.jpg",
        "text": "",
        "created_utc": 1671846844,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I ask my workplace for desk/chair after renovations?",
        "author": "jungleebunglee",
        "url": "https://www.reddit.com/r/Frugal/comments/ztxhe7/can_i_ask_my_workplace_for_deskchair_after/",
        "text": "My workplace is getting renovated. They are getting rid of a lot of furniture, couches, desks, chairs, storage lockers, monitors, electronics etc. I wanted a good ergonomic chair and desk for my home bedroom. Is it okay to ask my office staff if I could get a desk/chair from them? I didn't want to sound cheap infront of people who respect me.",
        "created_utc": 1671842897,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: There are organizations you can contact that will make sure you don’t go homeless, or will get you out of homelessness, which can help you pay rent, utilities, and provide free food.",
        "author": "bluemoss_co",
        "url": "https://www.reddit.com/r/Frugal/comments/ztx149/lpt_there_are_organizations_you_can_contact_that/",
        "text": "[removed]",
        "created_utc": 1671841554,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lost one of my contact at home...help??",
        "author": "calcetines100",
        "url": "https://www.reddit.com/r/Frugal/comments/ztwlix/lost_one_of_my_contact_at_homehelp/",
        "text": "Hi all, \n\nso, a really stupid and possibly expensive tragedy happened an hour ago: one of my contact lens is just..gone. It was in my eyes, and then it fell off while I was busy doing something, and now, it's gone. I m trying to hard to find it to no avail. \n\nWorst comes, I may have to buy another pair of RGP lens. A few questions I have \n\n1) how to get prescription as cheapest as possible? My previous lens prescription is really old so I can't rely on them anymore. \n\n2) Is it useful to buy a vision insurance? \n\n3) Which website or stores offer the best deal on RGP (or Ortho-k) lenses? \n\nany help would be appreciated!",
        "created_utc": 1671840304,
        "upvote_ratio": 1.0
    },
    {
        "title": "This year I gave jams as gifts to my friends and families",
        "author": "BendaMatt88",
        "url": "https://www.reddit.com/r/Frugal/comments/ztw24k/this_year_i_gave_jams_as_gifts_to_my_friends_and/",
        "text": "For this year, I gave jams to my friends and families.  I made all sort of jams with fruits frozen from the last few months. \n\nI already given these gifts to my friends (before Christmas day) with a wish/request that the family have breakfast together on Christmas day.  I also made request for them not to return any gifts to me.\n\nWe are in a tough economic condition and from the past two years, I learnt that family and friends getting together for a meal meant more than any gifts on earth.\n\nMerry Christmas everyone.  \n\nIt is unconventional and may not work for some families traditions.",
        "created_utc": 1671838757,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else check the store's dumpsters after they've done their shopping?",
        "author": "Unknowing_One",
        "url": "https://www.reddit.com/r/Frugal/comments/ztw0ri/does_anyone_else_check_the_stores_dumpsters_after/",
        "text": "I find that no matter what store it is, Walmart, fast food, etc. They usually have edible / usable items thrown away.\n\nThis is in Midwestern USA, not fully sure about the laws regarding this, but it has been very useful to me and my situation.",
        "created_utc": 1671838644,
        "upvote_ratio": 1.0
    },
    {
        "title": "Christmas gift wrapping frugal win",
        "author": "Commercial_Claim3904",
        "url": "https://www.reddit.com/gallery/ztvvqo",
        "text": "",
        "created_utc": 1671838245,
        "upvote_ratio": 1.0
    }
]