[
    {
        "title": "Best Ground Coffee?",
        "author": "PersonalityMedical22",
        "url": "https://www.reddit.com/r/Frugal/comments/11rygth/best_ground_coffee/",
        "text": "[removed]",
        "created_utc": 1678891411,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mint Mobile has been purchased by T-Mobile",
        "author": "faceboobs701",
        "url": "https://www.reddit.com/r/Frugal/comments/11rya3z/mint_mobile_has_been_purchased_by_tmobile/",
        "text": "Anyone know of any comparable carriers? I'll be switching the instant they raise prices.",
        "created_utc": 1678891011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mint Mobile being bought by TMobile",
        "author": "Carolinastitcher",
        "url": "https://www.reddit.com/r/Frugal/comments/11rxvp0/mint_mobile_being_bought_by_tmobile/",
        "text": "I’ve been a Mint Mobile subscriber since 2019, and I just learned today that they are being bought by TMobile. I have had TMobile before and was not impressed by their customer service, both over the phone and in person. So, this news is….not the best. \n\nWhat other service providers offer cheap mobile service with unlimited data? I’m paid through December at $30/month, so I’d love to stay around that without going full prepaid like tracphone. \n\nI’m in the South Eastern US. \n\nThanks!",
        "created_utc": 1678890155,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need advice on saving money on food!",
        "author": "u-uxu-u",
        "url": "https://www.reddit.com/r/Frugal/comments/11rw35o/i_need_advice_on_saving_money_on_food/",
        "text": "[removed]",
        "created_utc": 1678886236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just share !!!",
        "author": "LivingOnTheCheap",
        "url": "https://www.reddit.com/r/Frugal/comments/11rvg89/just_share/",
        "text": "[removed]",
        "created_utc": 1678884680,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mascara challenges",
        "author": "hottmama121",
        "url": "https://www.reddit.com/r/Frugal/comments/11ruvve/mascara_challenges/",
        "text": "Does anyone have ideas on how I can extend the life of my mascara? I think it’s criminal that it’s designed to dry out so fast.",
        "created_utc": 1678883202,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do most reusable things save you money in the long run? What are some reusables that don’t actually save you money/actually cost more?",
        "author": "skeleton_flower",
        "url": "https://www.reddit.com/r/Frugal/comments/11roh14/do_most_reusable_things_save_you_money_in_the/",
        "text": "I think it’s easy to fall into the trap of always thinking the reusable version saves more money in the long run despite being pricier. I’ve been reflecting on some of my items recently. Will update again if I’ve anything useful to add! \n\nWhat’s your opinion?",
        "created_utc": 1678862589,
        "upvote_ratio": 1.0
    },
    {
        "title": "USDA Choice Sirloin Steaks Deal?",
        "author": "-Rasczak",
        "url": "https://www.reddit.com/r/Frugal/comments/11rnlq0/usda_choice_sirloin_steaks_deal/",
        "text": "I've seen some price per pound posts for meat before and I just wanted to see if I'm not crazy and this deal checks out and / or why supermarkets do it.\n\nBuy 1 get 2 free on USDA Choice Beef Sirloin. Now I can get a 3.5 Lb pack for $8/Lb then get 2 free. So 10.5 Lbs for $28 and some change bringing the price per pound to around $2.66 for the Sirloin steaks. Am I missing some kind of \"gotcha\" trick or did I just stumble upon a stupid good deal on these steaks? I don't know the normal price of Sirloins but $2.66 is cheaper than ground beef in my current location. \n\nShould I send it and get as much meat as they let me and vacuum freeze the extra?",
        "created_utc": 1678859702,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal Tip",
        "author": "Substantial-Award-20",
        "url": "https://www.reddit.com/r/Frugal/comments/11rnk26/frugal_tip/",
        "text": "I'm probably very late to this discussion, but I wanted to share a frugal tip I discovered that may help some people out. Get a membership to your local library! Mine was completely free, and as a member I get access to a lot of resources that, while I may never use, could be very helpful to people with children. Free access to the local public transportation, free tickets to the local zoo, free tools, musical instruments, and children's toys to borrow (exactly the same process as books) as well as the expected benefit of being able to use the internet and check out books. I am thankful to have access to many of these resources through my university, however this could of course be a great resource many people. Again, I may be the only person in this sub that doesn't know about this tip, but I hope it can help!",
        "created_utc": 1678859541,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bought a bag of chicken leg quarters and have since cut up the chicken into pieces. What dishes can I make with this?",
        "author": "tiktoksuckmyknob23",
        "url": "https://www.reddit.com/r/Frugal/comments/11rn4t0/bought_a_bag_of_chicken_leg_quarters_and_have/",
        "text": "Wanted to spend less on Doordash so much, so I went grocery shopping and bought stuff to cook, primarily potatoes and chicken leg quarters. The latter is what I'm focusing on in terms of what this post is about, but if y'all have any tips or even recipes to share, I'd be more than happy to read them.",
        "created_utc": 1678858094,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do people that live with parents rent free make it happen?",
        "author": "detroit_muslim_man_",
        "url": "https://www.reddit.com/r/Frugal/comments/11rmuiv/how_do_people_that_live_with_parents_rent_free/",
        "text": "Im 25, Usally will have to give at least 1k a month that goes toward utilities and such bills which I completely have no problems with whatsoever.\n\nI make close to 50k a year and it just amazes me how some people who are older make 6 figures and at the very least don't give 1k a month. \n\nNot that I'm mad that I give 1k a month because after all, my parents did raise me for 18+ years and ik it not cheap to raise kids.\n\nMy question, how r u guys able to get away with living rent free and not contributing to anything at all despite saving alot more?",
        "created_utc": 1678857116,
        "upvote_ratio": 1.0
    },
    {
        "title": "How I saved hundreds of dollars by adopting a frugal lifestyle",
        "author": "BurgerDonalds",
        "url": "https://www.reddit.com/r/Frugal/comments/11rmqcv/how_i_saved_hundreds_of_dollars_by_adopting_a/",
        "text": "[removed]",
        "created_utc": 1678856732,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much did turning off space heaters save you on your electric bill?",
        "author": "1jay_y",
        "url": "https://www.reddit.com/r/Frugal/comments/11rm2nq/how_much_did_turning_off_space_heaters_save_you/",
        "text": "Living Michigan in a 1 bedroom apartment. I turned off my living room heater and only turned on my bedroom heater. Currently use my PC to work from home + do broadcast production so it also acts a second heater on my room. I also unplugged the AC Unit in my apartment in the living room and somehow my electric bill went from $140 to $47 this month! Not sure if these changes are enough to warrant that much of a drop in my electric bill but maybe I'll call the electric company to get a new reading.",
        "created_utc": 1678854651,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you guys feel about knockoffs of luxury brands?",
        "author": "spitfire9107",
        "url": "https://www.reddit.com/r/Frugal/comments/11rlf9e/how_do_you_guys_feel_about_knockoffs_of_luxury/",
        "text": "I personally never buy them nor the luxury brand they are based on but how do you feel about buying or using them?",
        "created_utc": 1678852735,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your suggestions for disposable items?",
        "author": "CongruentInfluence",
        "url": "https://www.reddit.com/r/Frugal/comments/11rl7k7/what_are_your_suggestions_for_disposable_items/",
        "text": "I swear by Valeo 6000 series (avoid 9000 series) windshield wiper blades. I live in Wisconsin; they have great all-season performance and routinely last me two years before I notice them starting to degrade. They're absurdly cheap [I suggest rockauto as a source] and are by far the best value of any wiper blades I've ever used.\n\nI don't like disposable things in general, but sometimes it can't be avoided. In those cases I like to find brands that have superior longevity. I'm just curious about specific brand recommendations the Frugal community has in regards to such items that require periodic replacement.",
        "created_utc": 1678852109,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone help me find a cheaper version of this jacket? ($500 Renaissance Art Print Jacket)",
        "author": "EngineeringFetish",
        "url": "https://i.redd.it/kyuknrzdptna1.png",
        "text": "",
        "created_utc": 1678851374,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I making a mistake moving back in with my dad at 27?",
        "author": "CarshayD",
        "url": "https://www.reddit.com/r/Frugal/comments/11rk7ti/am_i_making_a_mistake_moving_back_in_with_my_dad/",
        "text": "I have lived indepently since 2019, I started out with $15 an hour with a $600 rent, no car payment or phone payment. It was feasible but I still was struggling on really being able to save money for a savings account. I was only taking home around $890 every two weeks after taxes. \n\nNow i'm at a $20 an hour job and rent is $897 a month, groceries are sky high, and yet i'm drowning? I feel like my rent isn't as high as most of the states. My rent, utilties, and internet eat up my paychecks. I've lived alone, haven't depended on anyone. Most of my friends are in dual income households with their partners or at least spent their early 20s living at home. I feel like the second I started making money it was never in a position where I could save any of it.\n\nI still have shit savings. My dad recently bought a townhouse and honestly i've had no problems living with him before. There will be some tough adjustments, especially since i'll be 2 hours away from friends...but I just need time to catch up. What's making me hesitate is that i'm much older now and doing it at 27 seems a little embarassing and makes me feel very behind. Thoughts?",
        "created_utc": 1678849379,
        "upvote_ratio": 1.0
    },
    {
        "title": "refill store not actually saving me any money… what gives?",
        "author": "31bravobitch",
        "url": "https://www.reddit.com/r/Frugal/comments/11rjheh/refill_store_not_actually_saving_me_any_money/",
        "text": "today i drove 35 minutes to the closest refillery to me. If you don’t know what a refillery is, they provide pumps in large products to refill your home containers with products instead of buying new bottles and creating more plastic waste each time. \nI am trying to be frugal as well as environmentally friendly with my purchases, and chose to refill my two hand soaps, dish soap, all purpose cleaner, body wash, and laundry detergent at a refill store. The total was $34 dollars, and out of curiosity i checked the prices of the original product i bought for these items back in November. The total came out to $35, and that is counting the bottles they came in, not just the product. How is this the more frugal and environmentally conscious option? In the end i paid more cause i used gas to drive an hour the whole trip. \nDoes anyone have suggestions that I can try for household products to save money and not be buying single use plastic every time i need soap?",
        "created_utc": 1678847520,
        "upvote_ratio": 1.0
    },
    {
        "title": "3/4 size fridge",
        "author": "cturtl808",
        "url": "https://www.reddit.com/r/Frugal/comments/11rj05n/34_size_fridge/",
        "text": "I live in an apartment and my fridge isn’t even a full size fridge. Thus, the freezer is smaller. I’m struggling to take advantage of sales because of a genuine lack of storage.\n\nI have thought about gett a separate little freezer but, when I look at options, I can’t tell which is truly the better option or if it’s worth the investment.\n\nIs there anyone in this sub that can offer some suggestions?",
        "created_utc": 1678846376,
        "upvote_ratio": 1.0
    },
    {
        "title": "*$300 Bonus*Become a Favor Runner in Your City!*",
        "author": "Brilliant-Battle2945",
        "url": "https://run.favordelivery.com/?referral_code=JACOC63RA3",
        "text": "",
        "created_utc": 1678846186,
        "upvote_ratio": 1.0
    },
    {
        "title": "T-bills through vanguard brokerage account",
        "author": "bmwjor",
        "url": "https://www.reddit.com/r/Frugal/comments/11rihuj/tbills_through_vanguard_brokerage_account/",
        "text": "[removed]",
        "created_utc": 1678845227,
        "upvote_ratio": 1.0
    },
    {
        "title": "Toilet Paper Math",
        "author": "massivecoiler",
        "url": "https://www.reddit.com/r/Frugal/comments/11ri043/toilet_paper_math/",
        "text": "Has anyone crunched the most sensible way to buy TP?  Manufacturer units of measurement are like \"Our rolls would hypothetically equal some other number of rolls if they were some random other size! 3 rolls = 473920 rolls!  1 ultra mega roll = 600 mini rolls!\" can we weigh the packages or something?",
        "created_utc": 1678844092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cheapest car insurance?/ budgeting for living",
        "author": "darkchococat",
        "url": "https://www.reddit.com/r/Frugal/comments/11rhf8w/cheapest_car_insurance_budgeting_for_living/",
        "text": "I'm about to get a good deal on a car and was wondering what the cheapest car insurance is. I looked into progressive but the plan was like $2000 a year which I googled again and looks like that's about average (not sure though cause I never owned a car). I need to budget in order to afford rent too which is probably going to be about $800- $900 excluding utilities and other expenses. I just feel like even with two jobs I still won't be able to cover rent (I'd only be paying 1/2) cause it's around $1600-$1800 a month in this area and couldn't find cheaper on craigslist. Relocation is a possibility however I'd lose my job and have to worry about when I will get another one or how fast I could get another one. Rent in another area nearby is $1300-$1600 which in my honest opinion is WAY more affordable and closer to the college I want to go to.",
        "created_utc": 1678842827,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for spending $230 on groceries at Walmart?",
        "author": "Silver_Snowflake9123",
        "url": "https://www.reddit.com/r/Frugal/comments/11rfsgo/advice_for_spending_230_on_groceries_at_walmart/",
        "text": "[removed]",
        "created_utc": 1678839601,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Costco Business Center run (not regular Costco)",
        "author": "doublestitch",
        "url": "https://i.redd.it/bkkfesb2esna1.png",
        "text": "",
        "created_utc": 1678836991,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to buy a CHEAP but good used laptop (Guide)",
        "author": "Method__Man",
        "url": "https://www.youtube.com/watch?v=gd-LipBJJcs",
        "text": "",
        "created_utc": 1678836421,
        "upvote_ratio": 1.0
    },
    {
        "title": "$20 total for the tables and lumber/shelf material (freebie twin bed I chopped up). Laundry station for 5!",
        "author": "UnScrapper",
        "url": "https://www.reddit.com/gallery/11rebty",
        "text": "",
        "created_utc": 1678818829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to start for recovering spenders?",
        "author": "captaintor",
        "url": "https://www.reddit.com/r/Frugal/comments/11rea6u/where_to_start_for_recovering_spenders/",
        "text": "**TL;DR:** What are the first things you'd recommend a family of 3 who are brand new to the frugal mindset? \n\nMy husband and I both lean towards being spenders, but in different ways. I spend small and often (takeout, new outfits for our baby, etc) while he spends big and rarely (new game system, new recliner). Because of this, we've never been great with money, but because we had a big cushion of disposable income as DINKs we were fine.\n\nThen I had my daughter and took 3 months unpaid maternity leave. Between our increased costs providing for our daughter, the credit card debt we took on during my unpaid leave, and the rising inflation we realized we needed to start taking our finances seriously, pay off our debt before it grows out of control, and start building our savings and emergency funds. We just don't know where to start.\n\nWhat are the most basic things you'd recommend? What are your best frugal hacks that don't take tons of extra labor/time?\n\nTIA!",
        "created_utc": 1678818730,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wanting to repair a sagging sofa",
        "author": "PrincessDab",
        "url": "https://www.reddit.com/r/Frugal/comments/11re5sk/wanting_to_repair_a_sagging_sofa/",
        "text": "I have a sofa that is in decent condition with the exception of a significant sag. Anyone have experience or ideas for inexpensive solutions?",
        "created_utc": 1678818471,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using the free envelopes that come with bank statements",
        "author": "FatherOften",
        "url": "https://www.reddit.com/r/Frugal/comments/11rduns/using_the_free_envelopes_that_come_with_bank/",
        "text": "Every month I receive my Wells Fargo business bank statements for checking, savings, and business credit cards.\n\nI got into the habit early on when starting the business to just reuse their blank envelopes they include. \n\nMy wife laughed at me in the beginning but now we've gotten used to it. They make great free envelopes to send invoices to more traditional customers that prefer a paper invoice. I'm not sure what it saves us but it saves us something and every little bit counts!",
        "created_utc": 1678817787,
        "upvote_ratio": 1.0
    },
    {
        "title": "Critiquing \"Frugal Lessons\" my parents taught me.",
        "author": "Morgaaaaaaaaaaaan",
        "url": "https://www.reddit.com/r/Frugal/comments/11rdar2/critiquing_frugal_lessons_my_parents_taught_me/",
        "text": "My parents tried to instill into my sister and I that \"if you need something done, find a way to do it yourself.\" Which on the surface is not bad advice, however they tend to over-apply this way of thinking. For example, do you need plumbing done? Are you bad at plumbing? Do it yourself!\n\nThe problem I remember from when I was younger was, while we saved money in the short-term, in the long run we lost money with this attitude. To use the plumbing example, my dad would do a poor job plumbing, the plumbing would leak, ruining the cabinet and eventually the floor. On top of the hours he spent, trying to figure out the problem. From the time and money waste they could've easily hired a professional for half the price. \n\nMy point is, while being able to DIY things is a good skill, understanding when you are truly out of your depth is key. There's no shame in paying a professional to make sure it is done right the first time. You will more than likely save time and money by hiring the professional instead of trying to scab together and maintain a headache for a decade.\n\nTL:DR- Understanding when you need professional help is a key part of being frugal, it saves you time and money to insure something is done right the first time .",
        "created_utc": 1678816600,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the UK economy indicating a mild recession?",
        "author": "Background_Hunter991",
        "url": "https://www.reddit.com/r/Frugal/comments/11rd5pj/is_the_uk_economy_indicating_a_mild_recession/",
        "text": "[removed]",
        "created_utc": 1678816286,
        "upvote_ratio": 1.0
    },
    {
        "title": "$20 laundry sorting area ($10 FBM tables, freebie twin bed lumber and misc garage hardware)",
        "author": "UnScrapper",
        "url": "https://www.reddit.com/gallery/11rcn9h",
        "text": "[removed]",
        "created_utc": 1678815192,
        "upvote_ratio": 1.0
    },
    {
        "title": "Excess of soft white bulbs",
        "author": "Hidden_Brain",
        "url": "https://www.reddit.com/r/Frugal/comments/11rcbme/excess_of_soft_white_bulbs/",
        "text": "[removed]",
        "created_utc": 1678814495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pumpkin butter and cream cheese sandwiches",
        "author": "shiggster214",
        "url": "https://www.reddit.com/r/Frugal/comments/11rbr3h/pumpkin_butter_and_cream_cheese_sandwiches/",
        "text": "Do it!",
        "created_utc": 1678813260,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gift link to article on zero waste cooking, mentioning a number of cookbooks on the subject",
        "author": "VapoursAndSpleen",
        "url": "https://www.nytimes.com/2023/03/14/dining/zero-waste-cooking.html?unlocked_article_code=6s9ABqnRJSBMOqcR39f5cea21GR4Ylsc8qLxp9_N6DVc5ATYBLfdBKpC5vawUtjBVJvQK2IfVM8bBhXNa1OHxbqOgJNqzPP5MplBZBb1iNPfqvhhfQon3FjPOWPWLDg3V94zXdmdl5ODk0YJ9MJSaNmlyyAQkG5tnwsTD1PuWa9MxGMJern3A9A0DsA8A9INHjdd7TEWgJ66B_hCrXEXJCkX_bYscDEJpciz35YaN2kXzI5pFJo7em30xOu_wh_bnDw7nd638MgI7UxscMp8zhGhRlQuDBSSbmNRSTaLp7JELAssLUiL5p4kz2n9fTMWm-F24v823BpVIa8t&amp;smid=url-share",
        "text": "",
        "created_utc": 1678812529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lower your phone bills with VoIP",
        "author": "TorKitchenHorror",
        "url": "/r/Textr/comments/11rb9gf/lower_your_phone_bills_with_voip/",
        "text": "",
        "created_utc": 1678812244,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Buy Nothing\" Sites",
        "author": "2thebeach",
        "url": "https://www.reddit.com/r/Frugal/comments/11rakiv/buy_nothing_sites/",
        "text": "Has anyone else's turned into an outpost for grifters?  I thought it was primarily a place to offer unneeded or unwanted items and find a match for them to keep them out of landfills, but lately ours is nothing but begging for stuff because (insert sob story here).  Not only things, but services, rides, gas money, etc.  I never liked the practice of having the requester of the item give a sentimental reason for wanting it and choosing the \"most deserving\" because I think it leads to just this type of Go Fund Me pulling of heartstrings.  Is it just where I live?",
        "created_utc": 1678810681,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I spend $400 on a dental Night Guard?",
        "author": "Charming_Love2522",
        "url": "https://www.reddit.com/r/Frugal/comments/11ra7yo/should_i_spend_400_on_a_dental_night_guard/",
        "text": "Alright, I need someone's opinion on it that has a similar mindset on me and this sub popped into my mind.\n\n\nHere are the facts: \n\nFirst off, I'm 25. My parents insurance is up in July, but I'm also moving states in 2-3 weeks. I've been trying to take advantage of all the coverage I have before I move. I went to the dentist last week and they suggested a night guard. I grind my teeth and clench my jaw pretty badly, to the point they can see the wear on my teeth(I can physically see it on my front teeth also).\n\nShe called today and said my insurance actually doesn't have night guard coverage, and it would be $422. \n\nThe new job I'm being offered has dental insurance. An idea that popped into my head: My family member actually works for the company Im being offered a job with, so I could possibly have her call the dentist and see if insurance covers night guards and how much it would be there.\n\nIve heaed countless times to take care of your teeth when you're younger and it'll save you a hell of a lot of money when you're older.\n\nI will give my family member a call today when they're off work, and give an update, but until then... thoughts? Is it worth spending $400 now to protect my teeth from more damage? I know they have some \"Do It Yourself\" on Amazon, should I go that route? \n\nAny opinions are helpful! Thanks.",
        "created_utc": 1678809937,
        "upvote_ratio": 1.0
    },
    {
        "title": "LEGAL ways to save music/media",
        "author": "NoFilterNoLimits",
        "url": "https://www.reddit.com/r/Frugal/comments/11ra2qw/legal_ways_to_save_musicmedia/",
        "text": "Two programs have saved me a small fortune in subscription costs, I wanted to pass the info along\n\nPlayOn let’s you record video from the internet and most streaming services to create a file you can legally keep - much like it was always legal to record a tv onto a VHS. \n\nAudFree is the same for music.  I use the Tidal version and from time to time I can activate both for a month, add what I want to my owned mp3 (or Flac!)  collection and then let the programs expire until I need something new.  It’s not legal to *share* that music, but recording it for personal use falls under the same legal protection of old school mixed tapes.",
        "created_utc": 1678809636,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free coolers!",
        "author": "lynivvinyl",
        "url": "https://www.reddit.com/r/Frugal/comments/11r9s1u/free_coolers/",
        "text": "https://i.redd.it/am9qv7wserna1.jpg",
        "created_utc": 1678809003,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help buying Myday Toric contact lenses",
        "author": "vincent365",
        "url": "https://www.reddit.com/r/Frugal/comments/11r9rr2/need_help_buying_myday_toric_contact_lenses/",
        "text": "I recently got fitted for contacts. However, the brands I was prescribed are very expensive. The cheapest I found them for was $570 for a year  at 1800contacts.  I can't use insurance because I already used it towards my eyeglasses. The optician quoted me $256 for a 90 day supply.\n\nWas wondering if there's a way to get them cheaper or that's simply how much they cost?",
        "created_utc": 1678808984,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being Frugal and Swimming pool at Home",
        "author": "BubblyGirllikeapearl",
        "url": "https://www.reddit.com/r/Frugal/comments/11r9hcy/being_frugal_and_swimming_pool_at_home/",
        "text": "[removed]",
        "created_utc": 1678808351,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free Gambling Money",
        "author": "FinishSignificant324",
        "url": "https://www.reddit.com/r/Frugal/comments/11r9fvd/free_gambling_money/",
        "text": "[removed]",
        "created_utc": 1678808254,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips on how to save money and budget?",
        "author": "princesscorgi2",
        "url": "https://www.reddit.com/r/Frugal/comments/11r8qqu/tips_on_how_to_save_money_and_budget/",
        "text": "Currently I'm a SAHM while my husband works full time. I have always had trouble saving money and sticking to a budget. When I worked my money was basically fun money and I was able to spend it on whatever I wanted. We also used it for vacations and eating out. Now that we are only on one income I want to be more strict with the money coming in but I have no idea where to even start. \n\nHow do I make a budget and actually stuck to it? Where do I start and what does this look like?",
        "created_utc": 1678806682,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to discuss being frugal and not being called a 'downer' or 'buzzkill' ?",
        "author": "SerLurkzAlot",
        "url": "https://www.reddit.com/r/Frugal/comments/11r8l55/how_to_discuss_being_frugal_and_not_being_called/",
        "text": "My partner and I are currently in great disagreement about a few things right now. One in particular is our son's birthday. She wants to have a family holiday and I don't think it's a good idea, right now.\n\nWe both have debts to pay off and if we're very careful, a huge chunk can be paid off by the end of the year. This debt in particular causes me great stress, because obviously things are much more expensive right now. She knows I feel stressed by it and hates discussing budgeting.\n\nBack to the holiday discussion; I have no problems going on holiday, but every time I try to be realistic, I get called a downer or a buzzkill. I know it's not fun to talk about budgeting, but the financial security of our family is more important than a couple of weeks abroad.\n\nIs there any advice anyone can give me on how to approach this and not seem like the fun police?",
        "created_utc": 1678806342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Home Depot offers 11% rebate similar to Menards.",
        "author": "Jimmie_Sprinkles",
        "url": "https://i.redd.it/uknokavwdrna1.jpg",
        "text": "",
        "created_utc": 1678805242,
        "upvote_ratio": 1.0
    },
    {
        "title": "A (moderately) frugal small wedding ideas",
        "author": "crazy_whippet",
        "url": "https://www.reddit.com/r/Frugal/comments/11r7bvv/a_moderately_frugal_small_wedding_ideas/",
        "text": "Hi all, I was proposed yesterday (woo-hoo). Me and my fiance do not want to spend a lot ,we are also not super social, but we cannot go completely minimalistic as I would like to accommodate his parents by having some sort of celebration. We would like to do it this summer, invite his parents and sister, 4-6 friends and us. I want it to be something memorable for us all without a huge waste of money. Could you please throw in some ideas for us? (We have countryside and small villages around, a biggish historic city is also close).  \nThanks!",
        "created_utc": 1678803478,
        "upvote_ratio": 1.0
    },
    {
        "title": "I dont have a light coat (only a puffer jacket and a jean jacket). What would be the most versatile option to wear both with skirts for work and more casually with jeans ?",
        "author": "MrsDarcy94000",
        "url": "https://www.reddit.com/gallery/11r2epu",
        "text": "",
        "created_utc": 1678789125,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips on how to repair pants",
        "author": "twiceasmice",
        "url": "https://i.redd.it/e8ouhmvjopna1.jpg",
        "text": "[removed]",
        "created_utc": 1678784608,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal hack",
        "author": "SoftIntroduction2862",
        "url": "https://www.reddit.com/r/Frugal/comments/11qyhnr/frugal_hack/",
        "text": "Something I started doing that you guys may like.\n\nA local grocer near me has bone-in chicken thighs for 88 cents a pound. I bought about 8lbs and threw them all in the Crock-Pot (no seasonings, but if you want some go to town). After 8-9 hours I took them out, shredded them, portioned them into baggies and into the freezer they went.\n\nNow when I want, I can grab a baggie and have a cheap protein for soups, tacos, sandwiches, stir-frys, salads, chicken salad etc. And you can easily rinse and reuse the baggies for the next chicken batch. I know not everyone can find the thighs for 88 cents a pound, but snag a sale on those or breasts and you're in business.",
        "created_utc": 1678774539,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made an AI-powered dating bot to schedule cheap dates for me",
        "author": "InnocentlyButterydfs",
        "url": "https://www.reddit.com/r/Frugal/comments/11qxhr4/i_made_an_aipowered_dating_bot_to_schedule_cheap/",
        "text": "Money isn't the only thing you can be frugal on. Got tired of spending so much time on all my dating apps just to scrape together a date or two a month. So as a passion project, I decided to build an AI-powered dating app bot that could do all the swiping and chatting for me to get numbers. Using dating apps I found that once I actually got a girls number and could call her, I could usually build enough rapport with my charisma to schedule a date.\n\nIt was important to me to make sure the bot only swiped right on girls that were actually my type. It was also crucial that when the bot chatted with my matches it sounded like me and used as few possible back and forths as possible to get the number. Once I got the number, I would call the girl, build rapport and schedule a date. This wasn't easy to build. The bot is designed to learn my preferences based on my previous matches, allowing it to understand my type of girl and engage in meaningful conversations that are tailored to my interests. This was built using a fine tuned version of GPT-3 trained on 5k conversations that got a girls number and MobileNet V3 for classifying my \"type\". \n\nThe results have been astounding. In the first month, the bot scheduled 13 dates for me, all of which were with girls who matched my preferences and had similar interests to mine. I no longer have to waste time swiping aimlessly or struggling to come up with conversation starters. What's important here is that when I call the girl, I explain to them that they were talking to a bot on the dating app. So far, every girl has laughed it off and been impressed that I could build such a thing. \n\nWe're living in the Cambrian explosion of AI, excited to see it improve our lives in more areas.",
        "created_utc": 1678771154,
        "upvote_ratio": 1.0
    },
    {
        "title": "PSA: Skullcandy Dime 2 earbuds are a good alternative to Airpods!",
        "author": "dontpanicitsorganik",
        "url": "https://www.reddit.com/r/Frugal/comments/11qw5l3/psa_skullcandy_dime_2_earbuds_are_a_good/",
        "text": "I recently bought a pair of Skullcandy's Dime 2 wireless earbuds for $26.99 USD. If you're looking for a cheaper alternative to Airpods, these are a good bet! They have built-in Tile capabilities and good sound quality. I took them for a freestyle session at my ice rink today and they even worked well in the cold. Wanted to let y'all know in case anyone's looking for good-value wireless earbuds\n\n&amp;#x200B;\n\nhttps://preview.redd.it/pjshjageqmna1.jpg?width=1497&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=1bd5d02f29c7e61ef358e560f36d1459d34f8816",
        "created_utc": 1678766910,
        "upvote_ratio": 1.0
    },
    {
        "title": "PSA: Skullcandy Dime 2 is a great alternative to Airpods!",
        "author": "dontpanicitsorganik",
        "url": "https://www.reddit.com/r/Frugal/comments/11qw3hg/psa_skullcandy_dime_2_is_a_great_alternative_to/",
        "text": "I recently bought a pair of Skullcandy's Dime 2 wireless earbuds for $26.99 USD. If you're looking for a cheaper alternative to Airpods, these are a good bet! They have built-in Tile capabilities and good sound quality. I took them for a freestyle session at my ice rink today and they even worked well in the cold. Wanted to let y'all know in case anyone's looking for a good value pair of wireless earbuds ☺️",
        "created_utc": 1678766735,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question: I’m an African American,I have a high top, I’m planning on cutting it to regrow the sides. Should I get a taper or a shape up?",
        "author": "Turbulent_Pianist842",
        "url": "https://www.reddit.com/r/Frugal/comments/11qvv21/question_im_an_african_americani_have_a_high_top/",
        "text": "[removed]",
        "created_utc": 1678766067,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's a cheap way to makeshift a punching bag?",
        "author": "imacatchyou",
        "url": "https://www.reddit.com/r/Frugal/comments/11qvbp5/whats_a_cheap_way_to_makeshift_a_punching_bag/",
        "text": "I have so much rage in my body that I need to get a legit punching bag. I have the gloves already.\n\nBeen out of work for 6 months and can't afford jack which is one half of the reason.\n\nPillows aren't good enough. I need something stiff at eye level that won't scream or punch back. Maybe if it punched back that would be a relief, but I need to inflict some damage. Thanks",
        "created_utc": 1678764497,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lowest local locket grocery store?",
        "author": "GrowingPinez",
        "url": "https://www.reddit.com/r/Frugal/comments/11quqb8/lowest_local_locket_grocery_store/",
        "text": "[removed]",
        "created_utc": 1678762821,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are some groceries you will only buy name brand?",
        "author": "al1ceinw0nderland",
        "url": "https://www.reddit.com/r/Frugal/comments/11qtwyj/what_are_some_groceries_you_will_only_buy_name/",
        "text": "Mine include :\nHidden valley ranch \nCinnamon toast crunch\nSriracha (you know the one) \nShampoo/conditioner\nThinking about adding Lays/similar to this list. Clancy's seasonings just don't hit. \n\nWhat about you? :-)",
        "created_utc": 1678760582,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am using high quality Aluminum wires to fix my broken reading glasses",
        "author": "okt127",
        "url": "https://imgur.com/a/9ETGBoh/",
        "text": "",
        "created_utc": 1678757632,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reduce waste in fridge by wrapping veggies in paper towels",
        "author": "peachesandcandy",
        "url": "https://www.reddit.com/r/Frugal/comments/11qqxux/reduce_waste_in_fridge_by_wrapping_veggies_in/",
        "text": "I accidentally figured this out a while ago when I purchased iceburg lettuce and I realized at home the bag was all full of holes so I threw out the bag and wrapped the lettuce in paper towels and then dropped it in a plastic container.  I forgot what was in that container since I could not see thru the paper.  That lettuce lasted 3 weeks until I noticed it and ate it.  I tried with many other veggies and other lettuces and it still works.  If you get a bag of lettuce just open the bag and put in a sheet of paper towel, clip the bag closed with a paper clip and store the bag with the paper towel always on the top. Some times I have to replace the paper towel if it takes too long to finish the veggie.  If you buy any veggies in a plastic container open it and place a sheet of towel across the top and close container.  The goal is to prevent condensation from the veggies that will gather on the top of the sealed container from dripping back down on the veggie and causing rot.  This gives you more time to eat the veggies and saves money.\n\nThis works for unprocessed veggies.  Anything chopped up is a different story and you should just finish that stuff quickly.\n\nExcept tomatoes, don't refrigerate those.  They taste better when left out anyway.",
        "created_utc": 1678753120,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much Pepsi do I need to cook half a lobster?",
        "author": "anuragchak",
        "url": "https://www.reddit.com/r/Frugal/comments/11qpg7i/how_much_pepsi_do_i_need_to_cook_half_a_lobster/",
        "text": "I've got two gallons of Pepsi in an old oil drum. I found the half lobster while digging through a trash can",
        "created_utc": 1678749617,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like this should be the sub icon",
        "author": "ineedalife12210",
        "url": "https://i.redd.it/ge6h21c7nmna1.jpg",
        "text": "",
        "created_utc": 1678747832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Managed to get $1500 worth of cat food from Petco/Petsmart clearance and Chewy for $550",
        "author": "zindius",
        "url": "https://i.redd.it/qzv9m1aymmna1.jpg",
        "text": "",
        "created_utc": 1678747749,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coupon Codes for Renting a Car",
        "author": "martymcfly9888",
        "url": "https://www.reddit.com/r/Frugal/comments/11qogy5/coupon_codes_for_renting_a_car/",
        "text": "Hi,\n\nI'm going on a trip from Canada to the US at the end of this month. I need to rent a SUV or Van. Does anyone have any coupon codes they can send me or a suggestion on how to cheapen this up a bit ? I'm not part of any large corporation that has access to any discounts. \n\nWe are going for 5 days,  and it's gonna cost me bw 500 - 600 bucks.",
        "created_utc": 1678747418,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sometimes I find treasure at Goodwill",
        "author": "CabbageShoez",
        "url": "https://www.reddit.com/gallery/11qnpvo",
        "text": "",
        "created_utc": 1678745781,
        "upvote_ratio": 1.0
    },
    {
        "title": "It is I, the one who bakes pies. This week, I had to get creative, as I can only make pies out of what I have on hand. This is a lemon pie and an orange pie",
        "author": "nvgirl36",
        "url": "https://www.reddit.com/gallery/11qn0is",
        "text": "",
        "created_utc": 1678744267,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal suggestions for new glasses",
        "author": "gnargnarmar",
        "url": "https://www.reddit.com/r/Frugal/comments/11qmuvx/frugal_suggestions_for_new_glasses/",
        "text": "Hello, looking for anyone who knows when major eyeglass retailers (lenscrafter, target optical etc) generally have sales? I have a complex prescription and my eye doctor recommended against warby parker and buying glasses online due to my astigmatism and high prescription but I need to invest in a new pair. I have had good luck with these places before but would like to go when there is a sale thanks!",
        "created_utc": 1678743929,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal polished cement",
        "author": "socalmikester",
        "url": "https://www.reddit.com/r/Frugal/comments/11qm9gn/frugal_polished_cement/",
        "text": "868 s/ft 2br/2ba, slab foundation, stripped, \"waxed\". Has anyone ever used Home Depot rental equipment to grind/polish to aggregate? Not expecting perfection, just value per dollar and learning something new.",
        "created_utc": 1678742670,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interviewing Music Makers | $20 Amazon Giftcard Compensation",
        "author": "Mars_San",
        "url": "https://www.reddit.com/r/Frugal/comments/11qlx9n/interviewing_music_makers_20_amazon_giftcard/",
        "text": "Hi r/Frugal. My name's Austin, I'm a former Audio Engineer now working for a music tech startup called [Arpeggi Labs](https://www.arpeggi.io/). I wanted to let you know about a study we are running that can earn you a little cash!\n\nMy company is doing research into how musicians perceive a product we are developing. My company will use the data from these interviews to try to solve problems faced by musicians such as ownership over their work, receiving credit and building a career as a musician.\n\n**We are conducting interviews and compensating each participant with a $20 Amazon giftcard.** We would love to interview you! You can reach me in the comments here, via my DM or on Discord at**Austin | Kits#1144 .**\n\nCan't wait to interview you!",
        "created_utc": 1678741943,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crossposting - lost 150 lbs, went from 2XL/XL to mediums. Is it possible to tailor some of the clothing I don’t wanna get rid of to a reasonable size? A lot of it is just discontinued/limited run musician and content creator merchandise that I love.",
        "author": "TchoupedNScrewed",
        "url": "/r/mensfashion/comments/11qk3mm/if_i_lost_150ish_and_have_leftover_xl2xl_clothing/",
        "text": "",
        "created_utc": 1678740029,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it frugaler to buy a Windows 11 compatible used computer?",
        "author": "torssk",
        "url": "https://www.reddit.com/r/Frugal/comments/11qkyfd/is_it_frugaler_to_buy_a_windows_11_compatible/",
        "text": "I need another computer for my household and was going to get a used computer, about $100-$200. Probably a laptop running Windows 10 and not sufficient for Windows 11. \n\nBut is it, long run (in terms of saving money, time, and hassle), better at this point to buy a more expensive computer that can run Windows 11?",
        "created_utc": 1678739860,
        "upvote_ratio": 1.0
    },
    {
        "title": "What have you taught yourself to save money? Example: how to change the oil on your car.",
        "author": "Futureacct",
        "url": "https://www.reddit.com/r/Frugal/comments/11qihxz/what_have_you_taught_yourself_to_save_money/",
        "text": "I’m trying to figure out what I can do to cut costs. Everything has gone up and I would like to become more handy.",
        "created_utc": 1678734589,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for recommendations of outdoorsy U.S. cities /towns / regions with affordable rent &amp; access to nature?",
        "author": "Ok-Abbreviations-899",
        "url": "https://www.reddit.com/r/Frugal/comments/11qh4nf/looking_for_recommendations_of_outdoorsy_us/",
        "text": "[removed]",
        "created_utc": 1678731550,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fiduciary vs Non-Fiduciary Accounts: Differences &amp; How They Impact The Investors’ Financial Decisions",
        "author": "Background_Hunter991",
        "url": "https://www.reddit.com/r/Frugal/comments/11qgx5j/fiduciary_vs_nonfiduciary_accounts_differences/",
        "text": "[removed]",
        "created_utc": 1678731058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meal plan for this week ~ $3.50 per serving",
        "author": "breakfast_haver",
        "url": "https://i.redd.it/26568qqb6lna1.jpg",
        "text": "",
        "created_utc": 1678730049,
        "upvote_ratio": 1.0
    },
    {
        "title": "Check out Flashfood",
        "author": "Kvmiller1",
        "url": "https://www.reddit.com/r/Frugal/comments/11qg4gr/check_out_flashfood/",
        "text": "So there is this app called Flashfood. It works with grocery stores and deeply discounts food that is near expiration or ugly produce. I've gotten a dozen free range eggs for $3 when around here they are closer to 6. I've gotten really high quality bacon for half off. If you are eating something soon or have freezer space, it can be pretty great. And if you know what sell by dates are less important (like hard cheese), it is even better. \n\nAround me (NE Ohio, USA) Giant Eagle, Meyer and Save a Lot participate. I have saved money and am glad that this food isn't just being thrown out.",
        "created_utc": 1678729212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking testimonials",
        "author": "Acceptable-Jump1240",
        "url": "https://www.reddit.com/r/Frugal/comments/11qg2s5/seeking_testimonials/",
        "text": "[removed]",
        "created_utc": 1678729105,
        "upvote_ratio": 1.0
    },
    {
        "title": "A chart of 150 side gigs for 2023",
        "author": "BlokeTweedEveryday",
        "url": "https://i.imgur.com/xaPcPmw.png",
        "text": "",
        "created_utc": 1678725342,
        "upvote_ratio": 1.0
    },
    {
        "title": "The perks of having a connection to a local egg farm. They sell eggs commercially, but the biggest ones don’t fit in their cartons and they sell me a dozen of them for $2! Most are double yolkers",
        "author": "Dandan419",
        "url": "https://i.redd.it/o3pb3qzwrkna1.jpg",
        "text": "",
        "created_utc": 1678725237,
        "upvote_ratio": 1.0
    },
    {
        "title": "$29 of groceries with single coupon.",
        "author": "bugger234",
        "url": "https://i.redd.it/uhslatphrkna1.jpg",
        "text": "",
        "created_utc": 1678725061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suguru to repair Anchor Hocking storage lids?",
        "author": "Elmosfriend",
        "url": "https://www.reddit.com/r/Frugal/comments/11qdcnq/suguru_to_repair_anchor_hocking_storage_lids/",
        "text": "Hi Frugalites! Has anyone tried using Suguru to repair tears in the plastic lids that accompany Anvhor Hocking and similar glass storage bowls?  We made the swap from plastic to glass when kiddo was born 5 years ago and the lids are starting to tear with imcreasing frequency. [Dishwasher is not friendly to semiflexible  plastics.]\n\nIf not Suguru, have you tried and approved another solution?\n\nThanks for any info or suggestions you have!",
        "created_utc": 1678722730,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for dyeing dyed hair? It’s been growing out for a couple months and I was thinking dyeing it to like a blue, is there anything I should know/keep in mind? What products do I need? It’s my first time dyeing my own hair",
        "author": "Defiant-Parfait-5948",
        "url": "https://www.reddit.com/gallery/11qco68",
        "text": "",
        "created_utc": 1678721122,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moving - loading/unloading",
        "author": "Mental_Bookkeeper658",
        "url": "https://www.reddit.com/r/Frugal/comments/11qcenu/moving_loadingunloading/",
        "text": "My friend is moving down to live with me in another month or two. She would be bringing down some furniture as I’m buying a new house and have none so it helps both of us for her to keep her stuff and just use it to help furnish the new place. \n\nAnyway, it’s from Albany NY to central VA. I think at the moment more than likely we will rent a Penske truck and car tow for it. The issue is actually moving the items in and out, loading and unloading. My friend has some neurological/back issues and can’t lift that much without feeling wiped out. Not sure if she has some friends that could help but we don’t want to be dependent on the schedule of someone else for a favor. What sites or services would you all suggest for help loading up a moving truck? Maybe taskrabbit?",
        "created_utc": 1678720510,
        "upvote_ratio": 1.0
    },
    {
        "title": "1-800-Contacts will price match",
        "author": "Ok_Yoghurt9945",
        "url": "https://www.reddit.com/r/Frugal/comments/11qbpls/1800contacts_will_price_match/",
        "text": "Just a friendly reminder to those who wear contacts, that 1-800 contacts will price match, and it is very easy and painless. I just logged into my account on the site, jumped into a chat with a CSR and sent her the website, brand, and how many boxes I wanted to buy from another site charging 15/box less. She price-matched it within five minutes and even placed the order for me. Went from 150+ some change to 127 for a 6 month supply with minimal effort needed. I used \"discount contact lenses\" to price match to btw. (*In order to qualify for a price match, the price on the site cannot have promo codes attached to it. It has to be the base cost that they price match to. I could've gotten them even cheaper with discount contact lenses but decided not to based on reviews of their poor shipping procedures)*\n\nKeep in mind you can't use promo codes in combination with price matching, so always check what your best option is. \n\n[https://contactsprice.com/](https://contactsprice.com/) will check across many sites to find you the best price, but many times requires a promo code to get the price down to the cheapest option. Again, I could've gotten my contacts about $10 total cheaper with \"glassesusa\" today, but decided to go with 1-800 since their customer service and the fact they already have my prescription on file, is worth the extra 10 in my opinion...But if you really need the extra pocket money, this could be your best option.",
        "created_utc": 1678718855,
        "upvote_ratio": 1.0
    },
    {
        "title": "Monthly Subscription Tracker",
        "author": "AllForSub",
        "url": "https://www.reddit.com/r/Frugal/comments/11qauwg/monthly_subscription_tracker/",
        "text": "[removed]",
        "created_utc": 1678716840,
        "upvote_ratio": 1.0
    },
    {
        "title": "Victoria Sponge Cake (Baked using Value Range Ingredients)",
        "author": "Wise-Apple93",
        "url": "https://i.redd.it/3y8wgx29wjna1.jpg",
        "text": "",
        "created_utc": 1678714555,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Good &amp; gather” whole bean coffee disappearing from my local Target shelf with no restock. Anyone else notice this or is it just my store?",
        "author": "CockercombeTuff",
        "url": "https://www.reddit.com/r/Frugal/comments/11q9rb9/good_gather_whole_bean_coffee_disappearing_from/",
        "text": "Maybe this is a random question, but r/Target appears to be just for employees. \n\nMy wife she’s I enjoy the store brand “Good &amp; Gather” whole bean coffee from Target. It’s a few dollars less or even half the price of the other brands on the shelf. Recently it just stopped being restocked. I asked an employee who seemed like a manager, but she wasn’t sure. \n\nNot the end of the world, but it would be a bummer. Just curious if anyone else gets this frugal coffee and has noticed it disappearing.",
        "created_utc": 1678714173,
        "upvote_ratio": 1.0
    },
    {
        "title": "Idea for saving water",
        "author": "Competitive-Claim750",
        "url": "https://www.reddit.com/r/Frugal/comments/11q8uz3/idea_for_saving_water/",
        "text": "[removed]",
        "created_utc": 1678711917,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stress Eating Taking a Toll on My Finances",
        "author": "A_Raj_2153",
        "url": "https://www.reddit.com/r/Frugal/comments/11q7lgu/stress_eating_taking_a_toll_on_my_finances/",
        "text": "[removed]",
        "created_utc": 1678708440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal lunch, snack or appetizer ideas for when you have people over?",
        "author": "CrazyGal2121",
        "url": "https://www.reddit.com/r/Frugal/comments/11q71jf/frugal_lunch_snack_or_appetizer_ideas_for_when/",
        "text": "We have 2 young kids and we don’t really like to leave the house too much due to nap schedules etc. However we enjoy socializing and I like to invite people over to hang. Usually at one time it’s only about 2 or 3 other people. However we try to do this about 2 times a month \n\nanyways in the summer it’s easier because we can all just sit in the backyard and bbq \n\nHowever what do you guys do when the weather isn’t ideal? I want to be able to give something everyone would enjoy rather than ordering out. Something tasty but not heavy. I do enjoy cooking",
        "created_utc": 1678706718,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recipes for big batch of tuna cans",
        "author": "Tired-Otter_83",
        "url": "https://www.reddit.com/r/Frugal/comments/11q5xtq/recipes_for_big_batch_of_tuna_cans/",
        "text": "[removed]",
        "created_utc": 1678702993,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone figured a way to get all of the product out of this type of bottle? The bag inside is almost like it’s vacuum sealed. It’s too stiff and the opening too small to scrape out the moisturizer.",
        "author": "MHmemoi",
        "url": "https://www.reddit.com/gallery/11q2vul",
        "text": "",
        "created_utc": 1678691673,
        "upvote_ratio": 1.0
    },
    {
        "title": "I like this frugal thing gonna try it out more definitely excited for tons of banana smoothies for less than a buck",
        "author": "Capabrah_SpecialistY",
        "url": "https://www.reddit.com/gallery/11q2gq1",
        "text": "",
        "created_utc": 1678690131,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I save money when I go out?",
        "author": "MrMeeeseeeks19",
        "url": "https://www.reddit.com/r/Frugal/comments/11q1fiv/how_can_i_save_money_when_i_go_out/",
        "text": "I go out to bars to hang out with my friends and meet other people. While there I like to have a few drinks. Any hacks on making this as cheap as possible?",
        "created_utc": 1678686392,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did it 3 times already it works boys probably going to patch it sometime tomorrow",
        "author": "AdministrativeOne355",
        "url": "https://i.redd.it/mt69vb2zghna1.jpg",
        "text": "",
        "created_utc": 1678685202,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to repurpose old scrubs?",
        "author": "Nadinafree",
        "url": "https://www.reddit.com/r/Frugal/comments/11q0f79/how_to_repurpose_old_scrubs/",
        "text": "I'm a former nurse who is transitioning into a new career and have no idea what to do with my abundance of scrubs! Both my scrub tops and bottoms are branded with the name/logo of where I used to work so I doubt they could be donated. Everyone at work has many, many sets of their own scrubs so I am at a loss as to what to do with mine? The fabric is a cotton and polyester blend. \n\nMy only idea so far was turning a few pieces into cleaning cloths but I don't need very many of those. I don't have a huge budget to spend on turning them into something else but I would love for them to still be useful and have a new life.",
        "created_utc": 1678682956,
        "upvote_ratio": 1.0
    },
    {
        "title": "12+hr car ride- recommended snacks?",
        "author": "ChibiVix3n",
        "url": "https://www.reddit.com/r/Frugal/comments/11q0dl0/12hr_car_ride_recommended_snacks/",
        "text": "[removed]",
        "created_utc": 1678682806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alternatives to Whole foods website and delivery",
        "author": "Alternative-Link-380",
        "url": "https://www.reddit.com/r/Frugal/comments/11q0amq/alternatives_to_whole_foods_website_and_delivery/",
        "text": "[removed]",
        "created_utc": 1678682539,
        "upvote_ratio": 1.0
    },
    {
        "title": "$2.49 at Goodwill",
        "author": "Crokinole_Crusader",
        "url": "https://i.redd.it/cfjktfb42hna1.png",
        "text": "[removed]",
        "created_utc": 1678680212,
        "upvote_ratio": 1.0
    }
]