[
    {
        "title": "How much is mint after the \"new customer\" offer?",
        "author": "LolitaLi-Chan",
        "url": "https://www.reddit.com/r/Frugal/comments/102knqv/how_much_is_mint_after_the_new_customer_offer/",
        "text": "Currently on T-Mobile and want to reduce my cellphone bill + add someone onto my phone plan. I see that it's roughly $15/mo for the first 3 months, if I'm understanding that correctly. Does it go up after that? \n\nAlso, I want to keep my current phone #, but upgrade to a newer phone (mine is from 2012). Is there a way to get an unlocked phone and transfer my current information to it?\n\n Sorry, I'm kinda new to phone plans and services",
        "created_utc": 1672782788,
        "upvote_ratio": 1.0
    },
    {
        "title": "My parents are still actively using this battery powered teledex to store addresses and phone numbers. They're now in their 80's.",
        "author": "chrisdancy",
        "url": "https://i.redd.it/qyaclmd02w9a1.gif",
        "text": "",
        "created_utc": 1672781729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Xmas stock 50% off in January so that's when our dogs get presents. Christmas isn't over here till the 6th of January anyway",
        "author": "weefawn",
        "url": "https://i.redd.it/6ad5384lqx9a1.jpg",
        "text": "",
        "created_utc": 1672780273,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a use for the subwoofer and satellite speakers after the soundbar of a Vizio 5.1 system dies?",
        "author": "Nyp17",
        "url": "https://www.reddit.com/r/Frugal/comments/102je9k/is_there_a_use_for_the_subwoofer_and_satellite/",
        "text": "https://imgur.com/a/eakIvw6\n\nMaybe there’s a way to use them as computer speakers?\n\nI now how can I get them to someone who has a functional bar and needs these? Craigslist?\n\nI don’t want this functional equipment to end up in a landfill when someone could use it.\n\nThanks for any suggestions.",
        "created_utc": 1672779899,
        "upvote_ratio": 1.0
    },
    {
        "title": "Distance Triathlete with 4000 caloric intake goal going under $300 in food bill. What do I cook???",
        "author": "hokiehenry42",
        "url": "https://www.reddit.com/r/Frugal/comments/102iwt5/distance_triathlete_with_4000_caloric_intake_goal/",
        "text": "Context… I have virtually no cooking experience but I’ve been experimenting and noticing cooking is way cheaper. I’ve been mostly doing the same dinner for weeks (mostly pasta or some version of chicken vegetables and rice). Im used to having the same food so it’s not a huge deal but im looking for ideas to develop my cooking skill (my gamer side is coming through 💀) but stuff I can meal prep and keep in the fridge for days would be great. Any meal of the day or snacks are greatly appreciated!!!",
        "created_utc": 1672778781,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bulk selling: Thredup vs. Swap.com vs. Thrift+ vs. Flyp vs. Others",
        "author": "futurememior",
        "url": "/r/BehindTheClosetDoor/comments/102ise9/bulk_selling_thredup_vs_swapcom_vs_thrift_vs_flyp/",
        "text": "",
        "created_utc": 1672778594,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tipping solution",
        "author": "atommcnugget",
        "url": "https://www.reddit.com/r/Frugal/comments/102i6q1/tipping_solution/",
        "text": "I grabbed a 50 stack of dollar bills from the bank to keep on me at all times for small tips like coffee and carry out food. The other day I picked up 2 pizzas and the tip menu popped up with 15% being the lowest (one click) option that was in my face. Clicked it, got home and realized I paid $7 for someone to hand me pizzas over the counter. I don’t want to not tip, so having singles on hand makes it simple. Plus the workers normally get to walk away with cash vs credit card tips where they have to wait.",
        "created_utc": 1672777046,
        "upvote_ratio": 1.0
    },
    {
        "title": "Artists: your solutions for portfolios/large paper storage?",
        "author": "emmybby",
        "url": "https://www.reddit.com/r/Frugal/comments/102hh4e/artists_your_solutions_for_portfolioslarge_paper/",
        "text": "I need a decent solution for moving large amounts of oversized art papers and previous artworks of all kinds and sizes. I have one hard case portfolio that I use for only the pieces I'm actively working on, one paper portfolio that's completely full of past artwork, and that's it. I can use sheets of cardboard and trash bags for some things, but not everything because some are still bigger than that.\n\nThe boxes that TVs or computer monitors come in would be great but I don't know where to find them reliably. If I were to go to a Best Buy and ask for any of their large, flat boxes, would they give them to me? Would they have any to give? How might I find boxes like this? Thanks!",
        "created_utc": 1672775348,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question for anyone with experience with the Affordable Connectivity Program (ACP) and Lifeline.",
        "author": "NewbianPrincess",
        "url": "https://www.reddit.com/r/Frugal/comments/102h3sc/question_for_anyone_with_experience_with_the/",
        "text": "I'm trying to help a disabled family member with the ACP/Lifeline credits, and I'm having trouble understanding how it works.\n\nDo they need to apply and get approved first, or do they need to sign up for a phone service, then, after they're service is active, apply for the credits and have them paid to the phone company?\n\nIf both are okay, I'm leaning toward helping them find the most affordable plan and phone possible, so that even if they get rejected at first and have to appeal (shouldn't happen, but that seems to come up with some of the other programs I've helped them with), they're at least paying as little as possible in the interim.\n\nAlso, how does the $100 device credit work? Do they just buy the laptop/tablet at any store and then apply for a $100 refund from the program? Are there any programs that help pay for a cell phone instead of a laptop or tablet?\n\nI'm embarrassed to ask for so much help, but I don't see the actual step-by-step mechanics addressed very well on the websites I've been on. My guess is it's there in black and white, and I'm just going snowblind from all the research I've been doing on this and other projects for them.\n\nI'm hoping someone who has been through the process successfully can help lend me a hand (and some sanity!). \n\nThank you so much!",
        "created_utc": 1672774452,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resources for doing your own taxes?",
        "author": "lostkarma4anonymity",
        "url": "https://www.reddit.com/r/Frugal/comments/102gw4i/resources_for_doing_your_own_taxes/",
        "text": "This year, in addition to my normal salary, I started a small business and earned some income through the business. I also paid a few people via 1099. \n\nWhat are the best resources for doing your own taxes? In the past, my father was a CPA and helped me  a ton but now he passed away. I learned a lot from him so I feel as though I have the capacity to do this myself. Not sure where to get started. I've kept receipts and spreadsheets so I feel organized, just need some help connecting the dots.",
        "created_utc": 1672773945,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unlock Financial Freedom Today: How To Make Quick Money Online In Under 24 Hours",
        "author": "tommyshlb99",
        "url": "https://www.reddit.com/r/Frugal/comments/102fxgv/unlock_financial_freedom_today_how_to_make_quick/",
        "text": "[removed]",
        "created_utc": 1672771685,
        "upvote_ratio": 1.0
    },
    {
        "title": "Haircuts",
        "author": "jor4288",
        "url": "https://www.reddit.com/r/Frugal/comments/102fwlo/haircuts/",
        "text": "Hello fellow frugalers!\n\nI need to get my luscious locks lopped. The local barbershops are about 25 bucks where I live. With tip It’s 30 bucks. \n\nI would like to save money, but I don’t want to look like a field science experiment either.\n\nIs anybody go to a barber / hairstylist school to get their haircut? \n\nAnybody cut their own hair? \n\nOr are the chain place is cheaper?",
        "created_utc": 1672771627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Financially responsible for myself at 17, thinking of moving to a different state",
        "author": "Dry_Walk7184",
        "url": "https://www.reddit.com/r/Frugal/comments/102fs6g/financially_responsible_for_myself_at_17_thinking/",
        "text": "[removed]",
        "created_utc": 1672771338,
        "upvote_ratio": 1.0
    },
    {
        "title": "so I know you guys are frugal but if you give me 10 cents I'll post updates on what your money evolves into plz share",
        "author": "edfaygo",
        "url": "http://paypal.me/edfaygo",
        "text": "",
        "created_utc": 1672771050,
        "upvote_ratio": 1.0
    },
    {
        "title": "flow chart for the win...",
        "author": "MrMister2U",
        "url": "https://i.redd.it/xj5m91depr9a1.jpg",
        "text": "",
        "created_utc": 1672769323,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using FedEx Office Instead of a Printer",
        "author": "froggysands",
        "url": "https://www.reddit.com/r/Frugal/comments/102etto/using_fedex_office_instead_of_a_printer/",
        "text": "My printer finally bit the dust. I thought about getting a new one, but they are so expensive and frustrating, and I use them less and less. So now I send the few things that need to be printed to the local FedEx Office. It's a little inconvenient, but way more cost effective than getting a new printer and dealing with ink.",
        "created_utc": 1672769146,
        "upvote_ratio": 1.0
    },
    {
        "title": "Heating an old house!",
        "author": "Kittylover11",
        "url": "https://www.reddit.com/r/Frugal/comments/102epx2/heating_an_old_house/",
        "text": "Hello!\n\nDue to a work opportunity for my husband, we’ve moved to the sierras for the year and are currently renting out a 2500 sqft 1850s farmhouse in snow conditions… this was the only rental available in the entire town. It has 2 propane stoves and an oil heater in the central part of the house. The windows are all single pane but have the secondary storm glass placed, which somewhat helps. We have no idea what to expect coming from the moderate climate of the Bay Area, from a very energy efficient home using central heat on natural gas, but from what we’ve read, we’re expecting a very large bill for propane and heating oil. We’ve been relying primarily on heating oil since landlord said it was more efficient. \n\nI’m wondering what the best option is for heating. Unfortunately, since I work from home and our toddler is home with a nanny, we need to heat pretty much all of the rooms. We’ve been keeping my office door closed and it’s SO COLD in here. We also have 2 Dyson heaters and a few heated blankets, but I’m not sure if it’s better to run the propane stove or the Dyson. The landlord did mention we are not to use electric heat (because the house has solar and he’ll be charging us $90 a month for electricity as “solar upkeep”, and we’d have to pay a true up at the end of the year, but he did say he’d be showing us the bill every month). \n\nTLDR: Is it better to heat the whole house via heating oil and propane stoves? Or should we close off rooms and heat via dyson heater when using them?",
        "created_utc": 1672768893,
        "upvote_ratio": 1.0
    },
    {
        "title": "******* FRAUD ALERT *********",
        "author": "Looking4Trouble2Day",
        "url": "https://www.reddit.com/r/Frugal/comments/102ebnv/fraud_alert/",
        "text": "[removed]",
        "created_utc": 1672767996,
        "upvote_ratio": 1.0
    },
    {
        "title": "All those patches = money saved! (Bicycle tube)",
        "author": "peezee13",
        "url": "https://i.redd.it/23o92iwjpw9a1.jpg",
        "text": "",
        "created_utc": 1672767832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Single folks: what does your monthly budget look like for groceries right now?",
        "author": "paulrudder",
        "url": "https://www.reddit.com/r/Frugal/comments/102dksa/single_folks_what_does_your_monthly_budget_look/",
        "text": "I'm just curious what other single people are spending / budgeting for these days. As a disclaimer, I'm a dude who's into bodybuilding so I probably do intake more calories than the average person and that probably makes it harder... but I'm definitely finding it tough to keep it under $500/month, which might seem absurd to some, but I'm averaging $100 per grocery store visit - and I really stick to fresh / whole foods for the most part and barely ever buy processed junk.\n\nEggs are definitely a killer at the moment (especially since I do try to buy cage free). I try to opt for store brand for everything else, but even a bag of frozen salmon is now almost $40 at Costco. I'm pescetarian so my main animal protein sources are dairy, eggs, and fish. I don't really buy much extravagant / expensive stuff and try to buy in bulk.\n\nProbably the biggest \"luxuries\" I buy on a regular basis are health foods like Ezekiel bread, but $6/loaf really isn't bad because it'll last me an entire week or more. It's the other smaller stuff that's killing me lately (e.g. eggs) because it just adds up so quickly.\n\nHow are you guys managing these days and what recommendations do you have for keeping grocery store trips to a minimum? I'd love to get my monthly grocery store bill to $300 but it just seems impossible right now.",
        "created_utc": 1672766220,
        "upvote_ratio": 1.0
    },
    {
        "title": "Turns out you can use dawn dish soap as laundry detergent in a pinch.",
        "author": "Puzzleheaded-War-113",
        "url": "https://www.reddit.com/r/Frugal/comments/102d793/turns_out_you_can_use_dawn_dish_soap_as_laundry/",
        "text": "Until my financial aid drops, I am broke. Like zero dollars and zero cents broke. So when I ran out of laundry detergent doing my kid's clothes last night, I thought I was screwed.  I went online to see what options I had for handwashing my work clothes and ended up finding this really cool wikihow. 1 teaspoon for small loads, 2 teaspoons for medium loads, and 3 teaspoons of dawn or Ajax dish soap will work in an emergency. \n\nThought y'all might want to know.",
        "created_utc": 1672765301,
        "upvote_ratio": 1.0
    },
    {
        "title": "AMERICA let me introduce you to squash",
        "author": "A_Forest_wolfy",
        "url": "https://i.redd.it/3nu8mhpcfw9a1.jpg",
        "text": "It's a liquid you put in water to give it flavour. I know you have some version of this, or you did 5 years ago, but I couldn't understand why it wasn't more wide spread in Washington state anyway. Does America have this?",
        "created_utc": 1672764408,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just a tip for us people who like creamer in our coffee, or whatever else you might use it for.",
        "author": "caitejane310",
        "url": "https://www.reddit.com/r/Frugal/comments/102a1xq/just_a_tip_for_us_people_who_like_creamer_in_our/",
        "text": "My husband went shopping yesterday, but they didn't have my creamer. I like the Dunkin' extra extra. Well, he missed about 3 cups of whole milk with about a quarter of a can of sweetened condensed milk, and that's definitely what we're gonna be doing from now on. I'm sure there's something that can be mixed with it if you like flavored creamer. I honestly feel dumb for not doing this sooner 😂",
        "created_utc": 1672757433,
        "upvote_ratio": 1.0
    },
    {
        "title": "favorite boxed or frozen dinners?",
        "author": "lwyant225",
        "url": "https://www.reddit.com/r/Frugal/comments/1029lkz/favorite_boxed_or_frozen_dinners/",
        "text": "I have a new puppy and am struggling to find the time to cook. Anyone have recommendations for good, quick, and cheap frozen dinners or boxed dinners? Ordering doordash to supplement cooking has not been good for my wallet",
        "created_utc": 1672756205,
        "upvote_ratio": 1.0
    },
    {
        "title": "Additional Freezer",
        "author": "swingingboyboy",
        "url": "https://www.reddit.com/r/Frugal/comments/1028o06/additional_freezer/",
        "text": "Hi all, I’m planning to get a additional freezer on top of my normal refrigerator (one top freezer compartment and one bottom chiller). Should I get chest freezer or upright freezer? What about the size?",
        "created_utc": 1672753622,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best reusable “Ziploc” type freezer bags?",
        "author": "allegedlydm",
        "url": "https://www.reddit.com/r/Frugal/comments/1026zd1/best_reusable_ziploc_type_freezer_bags/",
        "text": "Hi everyone! I’m new here and trying to balance my frugality and environmentalism, which as I’m sure you know often go together longterm but don’t always look like they do in the short term.\n\nMy wife and I are planting a massive garden this year (she was a farm apprentice last year) and I’ve learned to can, but we’re also being given a chest freezer (major frugal win!) and I was thinking about how much I hate the idea of using all those ziploc freezer bags that are single use plastic for our harvest. I have used and like Stasher brand bags but they’re pricy. Do any of you have another brand you’d recommend?",
        "created_utc": 1672749099,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Does Two &amp; Twenty Fees Model Work?",
        "author": "FinanceGeek20",
        "url": "https://www.reddit.com/r/Frugal/comments/1022ari/how_does_two_twenty_fees_model_work/",
        "text": "[removed]",
        "created_utc": 1672733648,
        "upvote_ratio": 1.0
    },
    {
        "title": "Discounted Subscriptions - Prime Video, Spotify, YouTube Premium, NBA League Pass",
        "author": "Discounted_Accounts",
        "url": "https://www.reddit.com/r/Frugal/comments/1022ad5/discounted_subscriptions_prime_video_spotify/",
        "text": "[removed]",
        "created_utc": 1672733612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cheap vs frugal on my trip to Amsterdam",
        "author": "Piestander",
        "url": "https://www.reddit.com/r/Frugal/comments/1022118/cheap_vs_frugal_on_my_trip_to_amsterdam/",
        "text": "Tacked a few days in Amsterdam to a trip I was already taking to London this week. When I booked the trip, we were running tight on our travel budget so I booked a less expensive hotel near the airport vs one right in the city center. I had researched travel options to make sure public transport was available and many sites said Ubers were inexpensive and plentiful. Normally. \n\nWe aligned our trip to celebrate NYE in Amsterdam and had no idea that the trains halted service early in the evening, driving Ubers to over $100 one way to get to the party we had tickets for.\n\nTrains for the rest of the time were active 24 hours so we both paid for 48 hour unlimited passes but in Amsterdam, they have several different lines that all require a different pass. \n\nFinally, the hotel we stayed at had a shuttle that took you to the train hub which was extremely convenient, however their new policy charged us for each use after 01/02. Had we stayed any longer, it would have been an extra $10 every time we took the shuttle. \n\nAll in all, a reminder to cough up the cash for convenience and location for hotels! It can make or break a vacation you’re already spending a lot of money for.",
        "created_utc": 1672732735,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stop buying new calendars if you've saved the old ones",
        "author": "hyestepper",
        "url": "https://i.redd.it/yucgst7h4s9a1.jpg",
        "text": "",
        "created_utc": 1672730342,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your experience with warranty for Apple products from Amazon Warehouse?",
        "author": "BnL_Nexus",
        "url": "https://www.reddit.com/r/Frugal/comments/1020pif/what_is_your_experience_with_warranty_for_apple/",
        "text": "Hi guys, I am looking for an iPad and Apple Watch. I have seen there are some good price from Amazon Warehouse, for example there are few options for an older model Apple Watch ($244 Good, $255 Very Good and $263 Like New). What is your experience with the Good and Very Good condition? How about warranty? For example, when buying Open Box from Best Buy, the staff told me their open box Apple \\[watch\\] should have the same manufacturer's warranty and I can use the receipt from Best Buy to process warranty through Apple. Is this true to Amazon Warehouse deals? Trying to get an iPad for me and Apple Watch for a friend who is training for a marathon!",
        "created_utc": 1672728212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bundaberg glass bottle as soap dispenser",
        "author": "bnelurker",
        "url": "https://i.redd.it/o5eu8y2o4t9a1.jpg",
        "text": "I thought to keep it as it is a nice looking glass and found it fitted with an old plastic soap dispenser 🙂any other idea how to upcycle this kind of bottles?",
        "created_utc": 1672724476,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are some good potato recipes for someone with stovetop and microwave but no oven",
        "author": "Pfacejones",
        "url": "https://www.reddit.com/r/Frugal/comments/101zj7h/what_are_some_good_potato_recipes_for_someone/",
        "text": "Thanks for any tips",
        "created_utc": 1672724439,
        "upvote_ratio": 1.0
    },
    {
        "title": "TEMU GIVEAWAY $50",
        "author": "McLaren720ss",
        "url": "https://www.reddit.com/r/Frugal/comments/101z2c7/temu_giveaway_50/",
        "text": "[removed]",
        "created_utc": 1672723012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any apps or websites that aggregate grocery stores for the best deals?",
        "author": "GTRacer1972",
        "url": "https://www.reddit.com/r/Frugal/comments/101wkl7/are_there_any_apps_or_websites_that_aggregate/",
        "text": "I'm curious if there's an easier way than checking each and every grocery store and retailer like Walmart weekly to see what's on sale, and where. It'd be so much easier if you could out in your grocery list and have an app or website tell you where to go for the lowest prices for each item.",
        "created_utc": 1672715800,
        "upvote_ratio": 1.0
    },
    {
        "title": "I use my reusable masks as napkins/towels when needing to clean small messes. I keep them in the dining table in this small basket for easy access! (I use surgical masks when I need to wear one)",
        "author": "WafflePeach",
        "url": "https://i.redd.it/2t0bwpct6s9a1.jpg",
        "text": "",
        "created_utc": 1672713091,
        "upvote_ratio": 1.0
    },
    {
        "title": "Potato Dishes",
        "author": "Acuff007",
        "url": "https://www.reddit.com/r/Frugal/comments/101vd2w/potato_dishes/",
        "text": "What are some of your favorite potato dishes/recipes?",
        "created_utc": 1672712434,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cooking Without a Kitchen Advice",
        "author": "Mangon09",
        "url": "https://www.reddit.com/r/Frugal/comments/101uptp/cooking_without_a_kitchen_advice/",
        "text": "Hello, I am currently renting from a place where I do not have access to a kitchen. This meant that I am mostly buying prepared foods and things I can just microwave since I do not have a stovetop, oven, etc.\n\nI was thinking of getting an airfryer but was wondering how effective those are at making different kinds of meals. Do you guys think it's worth it?",
        "created_utc": 1672710734,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jacks is better than Red Barron",
        "author": "Austinwoohooo",
        "url": "https://www.reddit.com/r/Frugal/comments/101sxe7/jacks_is_better_than_red_barron/",
        "text": "IMHO",
        "created_utc": 1672706067,
        "upvote_ratio": 1.0
    },
    {
        "title": "Back to basics: Biscuits &amp; Gravy for (4)",
        "author": "chunkysundae",
        "url": "https://www.reddit.com/r/Frugal/comments/101qxpe/back_to_basics_biscuits_gravy_for_4/",
        "text": "Hey r/Frugal, \n\nIn 2022, I committed to teaching myself how to cook (mostly) from scratch, and have found that it has really helped with grocery inflation. Biscuits &amp; Gravy may be a luxury for many, but I learned tonight that it is very quick, and with ingredients rounded up to \\~$1.25-$4.40 per serving assuming you have some stocked in your kitchen. \n\nSince I've been cooking at home, I had all-purpose flour, eggs, seasonings, and canned crema, because I don't buy milk. Depending on where you are shopping and located in the US and what you have on hand, the cost per serving will vary.  \n\n\n* Breakfast sausage: $3.99 1lb\n* All-purpose flour: $2.50\n* Milk: $2-$4 ($4 - gallon). Canned media crema also will work for this, $1.49 + 1 cup of water.\n* Eggs: Average $3.99\n* Canned biscuits $.98-$3.00 (I made mine; assuming you want to do this as fast as possible, buy  canned)\n* Salt &amp; pepper - you may not need this if the sausage is seasoned well and to your taste\n\nServes (4).\n\nMy big comfort food plate:\n\nhttps://preview.redd.it/ezahtkwdop9a1.jpg?width=2905&amp;format=pjpg&amp;auto=webp&amp;s=73b6495a46de4238ad7e474510f3ed1b5e3c6df3\n\nHigh cost per serving: $4.40 / My cost per serving: $1.25 (the sausage)  \nTime to prepare: \\~30-minutes (the biscuits are time consuming, will be 15-minutes with a can)\n\n[Recipe here.](https://www.allrecipes.com/recipe/216391/easy-sausage-gravy-and-biscuits/)",
        "created_utc": 1672701174,
        "upvote_ratio": 1.0
    },
    {
        "title": "have *all* the curtains cleaned?",
        "author": "next_level_mom",
        "url": "https://www.reddit.com/r/Frugal/comments/101qiue/have_all_the_curtains_cleaned/",
        "text": "I'm looking for a drapery cleaner because one of our curtains has gotten moldy from the condensation that builds up on the windows. (Double paned windows, too!) \n\nNone of the other curtains shows any signs of mold, but I'm wondering if it makes sense to have them all cleaned anyway while I'm at it. Or is there something reasonably simple I can do myself for the non-moldy ones? They're quite heavy material so I probably don't want to take them down myself.",
        "created_utc": 1672700196,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some basic things I should know in running a household just for myself?",
        "author": "NotTheZucc",
        "url": "https://www.reddit.com/r/Frugal/comments/101pvqh/what_are_some_basic_things_i_should_know_in/",
        "text": "I'm going to start living alone soon and I haven't done this before, so it would be great if people could guide me here on the basic stuff required",
        "created_utc": 1672698656,
        "upvote_ratio": 1.0
    },
    {
        "title": "Single line phone plans",
        "author": "hezz297",
        "url": "https://www.reddit.com/r/Frugal/comments/101prr7/single_line_phone_plans/",
        "text": "I’m a Verizon customer with a single line. My current phone plan is $80 excluding taxes and fees. I have an unlocked phone that I purchased outright from apple. I have been looking to reduce this cost. Does anyone have any recommendations for this? I would not like to be locked into a contract and will need some data. \n\nI am in Boston if this helps. \n\nThanks",
        "created_utc": 1672698394,
        "upvote_ratio": 1.0
    },
    {
        "title": "Home made pizzas for $3.50",
        "author": "heresanupdoot",
        "url": "https://www.reddit.com/gallery/101pdpv",
        "text": "Decided to try home made vs takeout pizza as I have been inspired by this sub.\n\n Total bill breakdown below.\n$.90 for pre mix pizza dough (just add water)\n$.50 for cheese. Combo of cheddar and mozzarella eas cheaper \n$.15 for half an onion \n$.50 for the sauce \n$1.35 for the pepperoni \n$.10 for the pesto\n\nSo much nicer to make and fun too - Kept the 3YO occupied.",
        "created_utc": 1672697465,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the best book you’ve read for free?",
        "author": "shipping_addict",
        "url": "https://www.reddit.com/r/Frugal/comments/101pcdr/whats_the_best_book_youve_read_for_free/",
        "text": "I’m hoping to get back into reading this year and was curious what books everyone has read from either their local library or through Libby. I know that titles vary from library/platform, but it’s worth a shot for me to get a few ideas. \n\nMy favorite book for example is a memoir called “The Glass Castle”. My aunt had given me a copy to borrow after one of her coworkers gave her a copy that they were done with. It’s a very interesting but sad memoir, highly recommend it!",
        "created_utc": 1672697380,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone found Spindrift for a good price?",
        "author": "altaccount72143243d",
        "url": "https://www.reddit.com/r/Frugal/comments/101ouz1/has_anyone_found_spindrift_for_a_good_price/",
        "text": "It’s so delicious but I cannot justify spending $6+ on 12 cans of sparkling water regularly. I never see it on sale.",
        "created_utc": 1672696271,
        "upvote_ratio": 1.0
    },
    {
        "title": "Holiday Hangovers: Family or friends criticizing the frugal choices you make in life?",
        "author": "DuvalSanitarium",
        "url": "https://www.reddit.com/r/Frugal/comments/101opyc/holiday_hangovers_family_or_friends_criticizing/",
        "text": "The holidays have been going pretty well outside of some family illnesses to deal with, but something happened at our NYD party that brought the holiday season to a weird end.\n\nWe were discussing their resolutions for the new year, one of the cousins announced that her resolution was to be more frugal and to save more money. This led to a discussion around cost savings measures, I threw out the example of me choosing to buy the [Pink Dove Deodorant](https://imgur.com/BgJoV8l) Spray instead of the [type](https://momblogsociety.com/new-dove-dry-spray-antiperspirant-men-women/) I normally purchase because I was able to get them at essentially $.50/ea vs ~$7\n\nSome members of the family were concerned that using personal hygiene products marketed to the opposite sex might open one up to being teased or bullied by their peers. Then the disagreement became heated, with some accusing others of being \"preachy\", others were poking fun at me for using \"womens\" deodorant and the really devise, while the Cousin eddie's of the family were just outright calling me a f****t.\n\nI'd estimate that while the majority of folks did agree that it's all just marketing, there were the \"cousin eddies\" of the family adamant that they'd go without or pay extra to not have to use \"womens\" deodorant.\n\nEveryone agrees this is absurd, right?",
        "created_utc": 1672695938,
        "upvote_ratio": 1.0
    },
    {
        "title": "Holiday Hangover: Catching flak/criticism about frugal choices in your life",
        "author": "DuvalSanitarium",
        "url": "https://www.reddit.com/r/Frugal/comments/101og71/holiday_hangover_catching_flakcriticism_about/",
        "text": "[removed]",
        "created_utc": 1672695302,
        "upvote_ratio": 1.0
    },
    {
        "title": "Holiday Hangover: Catching flak/criticism about frugal choices in your life",
        "author": "DuvalSanitarium",
        "url": "https://www.reddit.com/r/Frugal/comments/101oc1j/holiday_hangover_catching_flakcriticism_about/",
        "text": "[removed]",
        "created_utc": 1672695035,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found an old piece of wood behind in my garden when I first moved in. I cut it in half and let it dry in my shed for few months. Now they’re indoors to dry out more, sprayed with anti-bac. I also bought these brackets to hang them. I’ve needed shelves and free wood is free wood. Pretty happy!",
        "author": "Chanzillla",
        "url": "https://www.reddit.com/gallery/101o7b2",
        "text": "",
        "created_utc": 1672695033,
        "upvote_ratio": 1.0
    },
    {
        "title": "US hospitals now publish their prices for medical procedures on imaging, on average the US hospitals charge $1,187 in out-of-pocket cost. I've built a search engine &amp; an imaging network AffordableScan to offer MRIs directly to patients for $250, so patients can be frugal, see charges and save money",
        "author": "vlado86",
        "url": "https://i.redd.it/hfosaza36p9a1.png",
        "text": "",
        "created_utc": 1672694658,
        "upvote_ratio": 1.0
    },
    {
        "title": "bookshelf ideas?",
        "author": "SlamCityUsa",
        "url": "https://www.reddit.com/r/Frugal/comments/101nsbl/bookshelf_ideas/",
        "text": "As the text says any frugal ideas for a nice looking bookshelf?",
        "created_utc": 1672693778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal Hacks",
        "author": "_former_self",
        "url": "https://www.reddit.com/r/Frugal/comments/101naz5/frugal_hacks/",
        "text": "What are some go-to frugal life hacks?",
        "created_utc": 1672692665,
        "upvote_ratio": 1.0
    },
    {
        "title": "When I Moved in, Had Just a Bed Set and Desk Chair. Everything Was Free",
        "author": "Mikotokitty",
        "url": "https://www.reddit.com/gallery/101n6a5",
        "text": "",
        "created_utc": 1672692361,
        "upvote_ratio": 1.0
    },
    {
        "title": "Family of 6 going from 2 SUVs to a minivan and a motorcycle.",
        "author": "REHTONA_YRT",
        "url": "https://www.reddit.com/r/Frugal/comments/101mxe9/family_of_6_going_from_2_suvs_to_a_minivan_and_a/",
        "text": "Hello all. First post so if you feel I am not in the right place please let me know so I can delete it.   \n\n\nWe had 2 Lexus 4x4 SUVs and both work in education in Texas, so raising a family this big has been tough.   \n\n\nThe newer one was setup for going Offroad and had larger tires and had metal sliders and accessories that were pretty heavy.   \n\n\nFuel mileage was around 11.4MPG on average.  \n\n\nThe older one got around 14MPG.   \n\n\nThis past year has made me reevaluate expenses and our ability to navigate financial surprises.   \n\n\nMy wife got pregnant (unexpectedly as she was on BC) in 2021 and the last 4 months of her pregnancy in 2022 were on complete bedrest. We bought our first house just a few weeks before she had to be rushed to the ER for spiking blood pressure and being put on bed rest so our savings were wiped out between the down payment on the home as well as our medical expenses.  \n\n\nThankfully she and the baby are fine but we are a dual income household and couple that with rising inflation and fuel costs we were scrambling to make up for the hole in our finances.  \n\n\nAfter some agonizing we decided to trade in the newer Lexus and got my wife a used Honda Odyssey. Her new van gets twice the MPGs the Lexus did. She also commutes around 2,000 miles a month which makes the savings pretty significant. This has lead to anywhere between $250-$350/month in fuel savings depending on the price of fuel. It also has more room for the kids and groceries so she's happy about that as well.  \n\n\nI got a small displacement Honda dual sport that allows me to ride still Offroad as well as commute 1,200 miles a month. It gets between 55-70mpg so again thats a big chunk of money saved. In order to ride year round I didn't go all out buying thousands of dollars in riding gear. I got a pair of motorcycle boots on sale for $249 and a good helmet on sale for $300. Otherwise I spent $35 on a set of Frogg Toggs for rainy days and a set of heated grips for $80 that keep my hands toasty on mornings where temperatures may dip into the 30s.  \n\n\nWe are in the process of selling the older Lexus after letting it sit for 6 months while I rode the bike everyday and seeing if we could make it work, and outside of a little juggling here and there its worked very well for us.  \n\n\nSome family members and friends were pessimistic about our new arrangement, but they have seen us adapt and are much more supportive as time has gone on.  \n\n\nThis for me in particular was a really tough choice. I have been a very active member of local and online Toyota/Lexus groups so I have had to step away from a passion and social community to make it happen. But family comes first and I can always get another 4x4 down the road.",
        "created_utc": 1672691778,
        "upvote_ratio": 1.0
    },
    {
        "title": "My car just passed away",
        "author": "mfischer24",
        "url": "https://www.reddit.com/r/Frugal/comments/101mwy0/my_car_just_passed_away/",
        "text": "I received the call this morning. After 240,000 reliable miles, she unexpectedly passed away. \n\n2010 Volvo XC60 that still looks great but with apparently more issues than she’s worth. Mechanic recommends scrap yard. \n\nOptions?",
        "created_utc": 1672691749,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fixed it so I didn't have to replace it",
        "author": "This-Present4077",
        "url": "https://www.reddit.com/gallery/101mqie",
        "text": "",
        "created_utc": 1672691343,
        "upvote_ratio": 1.0
    },
    {
        "title": "US hospitals now publish their prices for medical procedures on imaging, on average the US hospitals charge $1,187 in out-of-pocket cost for an MRI. I've put together and in-depth guide on how to get an affordable imaging scan, as I myself was once billed $20K for my daughter's emergency CT scan 😱",
        "author": "vlado86",
        "url": "https://affordablescan.com/blog/mri-scan-cost-near-me",
        "text": "",
        "created_utc": 1672690935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips to help My partner and I eat what we have/only buy what’s needed.",
        "author": "fizzie511",
        "url": "https://www.reddit.com/r/Frugal/comments/101m8wz/tips_to_help_my_partner_and_i_eat_what_we/",
        "text": "This is an adhd/autistic household so we will still always need to have prepared meals like pizzas or burritos in the freezer. But we struggle with overbuying at the grocery store.\nI’m the main culprit of this TBH. I try lists, cooking and freezing but it usually ends up going wrong at some point.",
        "created_utc": 1672690179,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Most Beautiful Recycling Idea in the World with a Plastic Paint Bucket",
        "author": "stendrom",
        "url": "https://beserhurda.com/2022/12/31/the-most-beautiful-recycling-idea-in-the-world-with-a-plastic-paint-bucket/",
        "text": "",
        "created_utc": 1672688821,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pineapple ideas",
        "author": "drew793",
        "url": "https://www.reddit.com/r/Frugal/comments/101lmdf/pineapple_ideas/",
        "text": "I love pineapple so I buy them whole. I eat them raw, make smoothies, and cook them into certain meals. Despite my best effort I always seem to have pineapple that goes bad. Does anyone have any new recipes or ideas for what to do with fresh pineapple?",
        "created_utc": 1672688702,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which streaming services are the best?",
        "author": "hamandcheese49",
        "url": "https://www.reddit.com/r/Frugal/comments/101ll4t/which_streaming_services_are_the_best/",
        "text": "I have Dish but pay close to $175 a month. Which services should i switch to so i can save money?",
        "created_utc": 1672688620,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many of you forage for food?",
        "author": "A_Forest_wolfy",
        "url": "https://www.reddit.com/r/Frugal/comments/101lavg/how_many_of_you_forage_for_food/",
        "text": "I mean in the wilderness, mushrooms, herbs etc. If so, what are your tips?",
        "created_utc": 1672687953,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bumped car into wall. Go through insurance ($500 deductible) or fix privately for over $1k?",
        "author": "ToothPicker2",
        "url": "https://www.reddit.com/r/Frugal/comments/101l0lu/bumped_car_into_wall_go_through_insurance_500/",
        "text": "\n\n\n\n\n\n\nMy dad bumped his Honda Accord 2010’s left side into a wall last night while visiting me in Canada (which we just purchased second hand last year for around $8500). Here’s a pic: https://imgur.com/gallery/ENKCKp6\n\nHe’s travelling abroad until May starting today (while the car is parked in my building’s underground parking in Canada until he returns). The body shops here quoted around $1800-2k to fix the damage including replacing the door, but suggested going back to the US and having it fixed there in May at much cheaper prices.\n\nOur only dilemma is - \n\n1) should we file a claim and go through his US insurance company (progressive) - with a deductible of $500. If we do that, how much would the insurance premium go up by? He’s currently at $350/6 months and has only one not at fault accident on file from 2019 from GEICO’s database. \n\n2) or, just drive it back to US, shop around for a good price and get it fixed privately at a body shop here?\n\nWe intend to sell of the car in the next 1-2 years since we’ll be moving out.",
        "created_utc": 1672687294,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suggestions for how to reuse or repurpose old pillow cases?",
        "author": "AntisocialDogPerson",
        "url": "https://www.reddit.com/r/Frugal/comments/101kcd2/suggestions_for_how_to_reuse_or_repurpose_old/",
        "text": "I have a few sets of old pillow cases from sheets that are no longer a full set, and am wondering what ideas r/frugal has to reuse them instead of throwing them away or donating them. I live in a one-adult household with 2 dogs, if that's helpful.",
        "created_utc": 1672685687,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your best frugal priced and long lasting household products you’ve ever purchased?",
        "author": "Glad-Violinist631",
        "url": "https://www.reddit.com/r/Frugal/comments/101jtd1/whats_your_best_frugal_priced_and_long_lasting/",
        "text": "I can think of three-\n\nTarget Performance sheets have out performed ever pair of sheets I’ve ever had including linen sheets from RH, Egyptian cotton and bamboo.\n\nVictorinox Fibrox chefs knives-great deal compared to other knives, dishwasher safe, sharpens easily.  I’ve had mine for years.\n\nEnameled cast iron Dutch oven/cook wear-my grocery store (H-E-B) has a line of these that compare to Le Cruset, they stain a bit more than Le Cruset but with a coupon I scored a 8 qt Dutch oven that I use weekly for $30.  I’ve also found real Le Cruset at thrift stores that clean up very nice for very cheap.",
        "created_utc": 1672684385,
        "upvote_ratio": 1.0
    },
    {
        "title": "MRI scan costs 10x in the US vs Spain",
        "author": "vlado86",
        "url": "https://www.reddit.com/r/Frugal/comments/101jp4x/mri_scan_costs_10x_in_the_us_vs_spain/",
        "text": "US hospitals now publish their prices for medical procedures on imaging, on average the US hospitals charge $1,187 in out-of-pocket cost. I've built a search engine &amp; an imaging network to offer MRIs directly to patients for $250, so patients can be frugal, see potential charges and save money: [https://affordablescan.com](https://affordablescan.com)\n\nhttps://preview.redd.it/700a8pdlao9a1.png?width=1214&amp;format=png&amp;auto=webp&amp;s=e86a481f10ccc2caa1a7de464e6d624a7f7938f7",
        "created_utc": 1672684108,
        "upvote_ratio": 1.0
    },
    {
        "title": "$0 dryer handle repair. finally no more duct tape!",
        "author": "Klau5_Dieter",
        "url": "https://i.redd.it/76y7ueo3qp9a1.jpg",
        "text": "",
        "created_utc": 1672683256,
        "upvote_ratio": 1.0
    },
    {
        "title": "Random rice flavour",
        "author": "swingingboyboy",
        "url": "https://www.reddit.com/r/Frugal/comments/101j6jm/random_rice_flavour/",
        "text": "I don’t know if it’s an age thing or a me thing. I’m half way to my grave and find that I rather drink flavoured water than plain water. For example I will drink tea, coffee, almond milk but not water. Now this has spread to rice. Instead of the usual white rice, I will replace the water with chicken stock or red dates water or coconut milk or scallop stock or prawn stock. With the exception of coconut milk, the rest makes the rice taste amazing!!! It is also inexpensive. More importantly, you cannot buy such rice outside. \n\nDo you also explore replacing water with other liquids while cooking rice?",
        "created_utc": 1672682867,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you are going to toe the line between frugal and cheap at least be pleasant about it.",
        "author": "suzy9mm",
        "url": "https://www.reddit.com/r/Frugal/comments/101imkg/if_you_are_going_to_toe_the_line_between_frugal/",
        "text": "I will start by saying I've had to be ridiculous careful with my money when I was younger and remember how much it sucked. Like living in my car for weeks and only eating what was left on bussed plates at work broke. But I never made it anyone else's problem or acted an ass about it. So my tolerance is 0 for people who are assholes because they feel they deserve to be. \n\n\n\nThat being said, on to the story. I was at the store NYE picking up some things to enjoy with my boyfriend for the holiday and decided I'd like to tack on some crab legs. At the seafood counter was a woman already fighting with the employee at the case. He was apologizing stating that he has to serve the meat as it is and she was looking at him like he'd just slapped her in the face. My curiosity did get the better of me so I stood right behind her. They argued back and forth for a bit, her screaming she shouldn't have to pay by weight for parts she can't eat and him apologizing, stating policy and trying to just get her through the line now that three of us were standing there waiting. You guys... This bitch was trying to get him to remove the tails of the $11lb shrimp before weighing it. That might get you what, 2 extra shrimp? I was gobsmacked. I understand when you want something out of budget and are desperate to find a way to splurge but what the absolute fuck. Eventually a manager came out and stepped to the side with her while the poor guy just getting chewed on had to throw his game face back on and serve the rest of the customers. There was maybe a pound and a half of shrimp left and I seriously debated getting petty and just buying it to end the bullshit still raging next to me but decided against it. She was still bitching as I left the counter. People like that make their own lives harder and then take it out on others because they have a hard life. Just pisses me right off. \n\n\n\nTLDR/Moral of the story, pick your battles. Cut costs and corners where you can but not if it will negatively impact others. Checking if maybe you can have a discount on a dented can? Frugal win! Demanding the poor counter clerk de-tail 30 shrimp for you to save pennies? Cheap loser.",
        "created_utc": 1672681575,
        "upvote_ratio": 1.0
    },
    {
        "title": "Small frugal win",
        "author": "fridayimatwork",
        "url": "https://www.reddit.com/r/Frugal/comments/101htvv/small_frugal_win/",
        "text": "When I used to spend more I guess I amassed some bonus things, or retailers are trying to get me back. I had a Michaels voucher expiring today for $5. Since I work from home my uniform is leggings and a cheap unlogo tee that I can dress up for an important zoom with a scarf or necklace. So I used the $5 for a new 4.99 tee I’ll pick up near my work tomorrow.",
        "created_utc": 1672679669,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daily Life Food Supplements || Dietary Supplements",
        "author": "Daliy_Life",
        "url": "https://www.thedaliylife.com/2023/01/daily-life-food-supplements-dietary.html",
        "text": "",
        "created_utc": 1672679641,
        "upvote_ratio": 1.0
    },
    {
        "title": "I cleaned my very own loufa…for it will clean me for the rest of its life ❤️",
        "author": "BeardedZax",
        "url": "https://i.redd.it/f0y8ogxhnn9a1.jpg",
        "text": "",
        "created_utc": 1672677004,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grocery prices app?",
        "author": "slicktrickrick",
        "url": "https://www.reddit.com/r/Frugal/comments/101g29e/grocery_prices_app/",
        "text": "Hello, i live near multiple grocery stores. I’m interested in getting the best deal on staples like eggs, dairy, veggies, and meat. Is there any app that tracks prices among various grocery stores in a location? Kind of like GasBuddy?",
        "created_utc": 1672675284,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reusing cookie wraps to make cupcakes",
        "author": "ipse_dixit_",
        "url": "https://i.redd.it/gvlzpbmjso9a1.jpg",
        "text": "",
        "created_utc": 1672671970,
        "upvote_ratio": 1.0
    },
    {
        "title": "Homemade liquid laundry detergent is gloopy and gelatinous. Any way to fix this?",
        "author": "scifi-riot",
        "url": "https://www.reddit.com/r/Frugal/comments/101d7di/homemade_liquid_laundry_detergent_is_gloopy_and/",
        "text": "The recipe is cheap and the clothes are clean. Borax, washing soda, liquid Castile soap, and boiling water. It turns into this irregular gelatinous mess. The clothes are clean but it leaves behind gel clumps in the little detergent tray of my washing machine. Any tips?",
        "created_utc": 1672667846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Pet Insurance Companies of 2023 - SkyMagzines",
        "author": "KRNofficial",
        "url": "https://skymagzines.com/best-pet-insurance-companies-of-2023/",
        "text": "",
        "created_utc": 1672667541,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Online Stockbrokers of 2023 - SkyMagzines",
        "author": "KRNofficial",
        "url": "https://skymagzines.com/best-online-stockbrokers-of-2023/",
        "text": "",
        "created_utc": 1672667469,
        "upvote_ratio": 1.0
    },
    {
        "title": "The owl looks at you .. straight into the eyes..a Beauty it is !",
        "author": "Some_Actuator2661",
        "url": "https://i.redd.it/09nzenb7lm9a1.png",
        "text": "",
        "created_utc": 1672663368,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal renovation",
        "author": "Distributor127",
        "url": "https://i.redd.it/mqbtd3r5fm9a1.jpg",
        "text": "",
        "created_utc": 1672662137,
        "upvote_ratio": 1.0
    },
    {
        "title": "New lifestyle, I guess.",
        "author": "OG-Krompierre",
        "url": "https://www.reddit.com/r/Frugal/comments/101b4ks/new_lifestyle_i_guess/",
        "text": "My country just stepped into new currency, euro. With all the inflation and already bad state of things as it is (at least for blue-collar/majority of average working class), it's getting harder and harder to keep homes warm or eat better food without stepping into a \"savings fund\" (if it could be called that way)\n\nNow, while a lot of things are bad, I have to move to another flat too. 60% more expensive since prices went up significantly in last 3 years (since I moved in this one from where I have to go). The problem now is that this 60% price increase is almost my whole part of my savings cash if not THE whole part that I'm saving for whatever may be in the future.\n\nWe set our eyes on bigger appartment (prices are more less the same for everything, ranging from 400€ up to xxxx€) for 400€ where we would get an extra bedroom and a garden outside. Since my paycheck is the same, what would be some tips to save money? I'm already on saving mode but I guess I have to tighten the belt even more.\n\nThere are already plans to plant the garden in spring as soon as we can to get the most out of the harvest but for now, winter is comming and with EVERY appliance being electric (including heating) I'll go bankrupt. Does anyone have any advices/experiences with those homemade candle infrared (I guess) candle heaters?\n\nSorry for going all around the place.",
        "created_utc": 1672661460,
        "upvote_ratio": 1.0
    },
    {
        "title": "not sure if you got my email about the collaboration with my mantle",
        "author": "cgytreh",
        "url": "https://www.grocafrica.com/download?link=ShUXxiAOzsC5mlQ",
        "text": "",
        "created_utc": 1672656836,
        "upvote_ratio": 1.0
    },
    {
        "title": "shopping for the month with 70 dollars?",
        "author": "Curiousmeeower",
        "url": "https://www.reddit.com/r/Frugal/comments/1019tuh/shopping_for_the_month_with_70_dollars/",
        "text": "If you only had 70$, what are 5 food items you would be sure to buy to survive for a month?",
        "created_utc": 1672656790,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the longest you managed to keep a computer in use?",
        "author": "Tortoitoitoise",
        "url": "https://www.reddit.com/r/Frugal/comments/1019lnq/what_is_the_longest_you_managed_to_keep_a/",
        "text": "Yesterday I finally retired my 2010 PC. I'm actually a little bit sad about it, but it it's time had come. Too many freezes and crashes at random times, and not worth it anymore to fix it.  \nIt was a beast of a machine at the time I bought it, with a (for then) whopping 16 GB RAM and a 160 GB solid state drive.   \nI managed to keep it up and running for nearly 13 years without any real hardware upgrades. It did well and I'm thankful for it's solid service over the years.\n\nWhat is the longest you managed to keep a computer in use? Do you have a policy to keep a computer in use as long as possible?",
        "created_utc": 1672655941,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should I do with all these magazine scraps?",
        "author": "No_Shop1166",
        "url": "https://i.redd.it/gl5704ni7n9a1.jpg",
        "text": "I make lots of  collages and end up with jars of tiny scraps of newspaper and magazine cuttings. What can I do besides just throw them out?",
        "created_utc": 1672652797,
        "upvote_ratio": 1.0
    },
    {
        "title": "Went away for a couple days for NYE and forgot about these strawbs. Are they salvageable? Maybe if I freeze them and use for smoothies?",
        "author": "alcoholiccheerwine",
        "url": "https://i.redd.it/e6zmoipkxm9a1.jpg",
        "text": "Stored in the fridge, about a week old.",
        "created_utc": 1672649449,
        "upvote_ratio": 1.0
    },
    {
        "title": "You don't have to go out and spend $60 to get durable curtain rods, I built these for a $12 home depot run",
        "author": "ethanBawesome",
        "url": "https://www.reddit.com/gallery/1017bz3",
        "text": "",
        "created_utc": 1672647361,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cheapest way to ship tires?",
        "author": "mini-she",
        "url": "https://www.reddit.com/r/Frugal/comments/1014v87/cheapest_way_to_ship_tires/",
        "text": "Please let me know if I should post elsewhere. \n\nI am moving from the Northeast to the Midwest and I currently have snow tires on my car. I want to ship my normal tires to my new home since I'm pretty limited on space right now and will need to swap them back in the Spring. What's the best way to ship tires as cheaply as possible? Any advice would be appreciated!",
        "created_utc": 1672638881,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where do you put your savings? Do you invest?",
        "author": "The9ElevenDeniers",
        "url": "https://www.reddit.com/r/Frugal/comments/10118yu/where_do_you_put_your_savings_do_you_invest/",
        "text": "Hi,\n\nI found being frugal difficult until I had the goal of financial independence. I want to one day quit my job and do the work that I find most meaningful at that time. This might include picking up a new trade, going fishing with my kids, or spending time with my mom. \n\nDo any of you invest or have a goal of financial independence? What investments do you have.\n\nMy wife and I have 457's we put a lot of our income into those. I also am creating an LLC with a group of friends. In a year or 2 we plan on starting to invest in rental properties.",
        "created_utc": 1672627774,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips on moving frugally?",
        "author": "curiliousbetsy",
        "url": "https://www.reddit.com/r/Frugal/comments/10110hs/tips_on_moving_frugally/",
        "text": "I'm moving from Kansas to Michigan soon for work and I was wondering how I could move frugally. I have a relocation bonus but I want to put as much of it as possible toward student loans.\n\nI only have two sedans to work with, one being mine and the other being my helpers'c but I have bigger items that would barely make two cars not work. \n\nHere is what I've explored:\nuHaul, but the costs for that kind of mileage would add up and be really significant, not to mention paying gas for a not very efficient vehicle that will also have to tow one of the sedans.\n\nRenting a vehicle, but I run into similar issues with the distance adding up to the costs.\n\nMoving company, but that would be extremely expensive for the distance and I don't trust people to handle my stuff.\n\nWhat have the folks on this sub done to make moving cheaper? Borrowing someone's vehicle is out of the question because it's a one way trip. I've looked for small trailers that my car could tow (rated for 1000lbs which isn't much) but I haven't had luck and I'm not willing to trust an Amazon trailer.",
        "created_utc": 1672627086,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for frugal recipes + Souper Rice Recipe",
        "author": "Orange_Crane",
        "url": "https://www.reddit.com/r/Frugal/comments/100zj66/looking_for_frugal_recipes_souper_rice_recipe/",
        "text": "I’m looking to do more home cooking this year. My husband recommended this recipe from his childhood, and we made it tonight—it’s turned out well and is exactly what I’m looking for, so I’m sharing it in hopes that if you have any frugal, but tasty, recipes to please send them my way! Thank you!\n\nDouble Recipe:\n2 family sized cans of cream of chicken soup (1 low sodium, 1 low fat)\n5 cups milk (2 family sized cans amount)\n1 large box Minute rice (about 7 cups)\n3 stalks celery\n1/2 small bag baby carrots\nSalt and pepper to taste\n\nSingle Recipe:\n1 Family sized can of cream of chicken soup (1 low sodium; can add the salt if needed)\n2.5 cups milk (1 family-sized can)\n3.5 cups minute rice (half the large box)\n2 stalks celery, chopped 1/4 inch thick\n1/4 small bag baby carrots, chopped 1/4 inch thick\n\nHeat up the soup and the milk in a large pot covered, medium to medium-low, stirring occasionally. Once warm, add the veggies to start them cooking. Add pepper and a pinch of salt if desired. Once the celery and carrots have softened, make sure the pot is simmering, then add the rice. Stir well, cover, and turn off the heat. Go a little longer than the rice box says to ensure it is soft enough before fluffing.\n\nServe as a main or side. As a side, serve with a rotisserie chicken for more protein, and a veggie side to round out the meal.",
        "created_utc": 1672622904,
        "upvote_ratio": 1.0
    },
    {
        "title": "5 Key Factors to Success (And Tips for Measuring Success)",
        "author": "smartskill97",
        "url": "https://www.reddit.com/r/Frugal/comments/100zf2a/5_key_factors_to_success_and_tips_for_measuring/",
        "text": "[removed]",
        "created_utc": 1672622588,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sams club plus membership",
        "author": "Em_b_",
        "url": "https://www.reddit.com/r/Frugal/comments/100z8xd/sams_club_plus_membership/",
        "text": "When is the Sam’s Club Plus and MasterCard membership worth it? I’m wondering what the break even point is",
        "created_utc": 1672622126,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Frugal Strategy is to Share What You Have",
        "author": "termanatorx",
        "url": "https://www.reddit.com/r/Frugal/comments/100yrp7/best_frugal_strategy_is_to_share_what_you_have/",
        "text": "Thinking about this today as I make a borscht with beets and moose meat that were gifted to me..... \n\nLemons and eggs I got on sale in bulk....used to make jars of lemon curd that were given away at Christmas.\nIn return I received soups, homemade marshmallows, a jar of wild cranberry sauce, dog walking for a week, moose meat, and beets.\n\nWhat a beautiful way to amplify my frugal good luck, and to create community at the same time. \n\nGenerosity and Reciprocity - my frugal goals for 2023.\nHappy New Year everyone!",
        "created_utc": 1672620817,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using a chest freezer for root cellar",
        "author": "Icy-Cheesecake8828",
        "url": "https://www.reddit.com/r/Frugal/comments/100xssv/using_a_chest_freezer_for_root_cellar/",
        "text": "So, I can find hundreds of articles taking a non-functional freezer and burying it to make a root cellar, but I can't find anything on taking a functional freezer and using it as a root cellar.  \n\nA chest freezer is only about $300 new where I live.  A root cellar needs to be about 33-40 degrees with high humidity. It doesn't seem like it would be too hard to crank the temp up on a chest freezer and keep the temp about 38 with a bucket of water to the side to keep the humidity up.  \n\nWe are looking at growing potatoes this year as our first attempt to try to grow as much of our food as possible,  but live in the city in Texas and there just isn't a reasonable place in home or outside that won't end up 110 in August.   A one time cost of $300 and $30 a year to keep the temp correct feels like a reasonable expense in comparison to what we spend on veggies each year.  \n\nBut I feel like I'm missing something....",
        "created_utc": 1672618216,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shopping Spree",
        "author": "ORCoast19",
        "url": "https://www.reddit.com/r/Frugal/comments/100xod7/shopping_spree/",
        "text": "My credit card is giving me ~14% cash back on grocery spending from Jan to March on up to $2,400 in spend. I know food inflation is set to go up again in 2023, and I’m thinking of front loading my grocery purchases this year because of the nice cash back and the inflation situation. I have a large fridge and 1 freezer chest, may be getting another, and wondering…\n\n- What foods have you noticed inflating the fastest? \n- What would you recommend stocking up on? \n\nI already have ~50 lbs of flower, ~150 lbs of rice, and a ton of pasta and fruit cans just FYI. I think I might be becoming a hoarder but inflation and climate change have me a bit defensive.",
        "created_utc": 1672617894,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would a soda stream machine save me money?",
        "author": "Quetzalproetzal",
        "url": "https://www.reddit.com/r/Frugal/comments/100xo2o/would_a_soda_stream_machine_save_me_money/",
        "text": "I don't have many vices. Diet soda is the one I can't kick. I get 2 liters at Walmart when they are less than $2 but it still adds up. No, I can't do off brand diet soda.\n\n Would a soda stream machine be cheaper in the long run, and if so, does it taste good?",
        "created_utc": 1672617872,
        "upvote_ratio": 1.0
    }
]