[
    {
        "title": "How to cover this? Tried with washi tape and it didn't stick :(",
        "author": "Miserable-Lif3",
        "url": "https://i.redd.it/0doo3tw0joja1.jpg",
        "text": "",
        "created_utc": 1677027252,
        "upvote_ratio": 1.0
    },
    {
        "title": "Save your coins kids! Another year of change turned in",
        "author": "PukasScondor",
        "url": "https://i.redd.it/ciugbsloioja1.jpg",
        "text": "",
        "created_utc": 1677027134,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any way to fix these zipper pulls without replacing the entire zipper? They’re kids’ hoodies, so they need a zipper pull.",
        "author": "KetchupAndOldBay",
        "url": "https://i.redd.it/voufgyxqfoja1.jpg",
        "text": "",
        "created_utc": 1677026147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are all \"dollar\" stores pretty much the same?",
        "author": "weldonian",
        "url": "https://www.reddit.com/r/Frugal/comments/118k0ux/are_all_dollar_stores_pretty_much_the_same/",
        "text": "or do any have a better selection for the price?",
        "created_utc": 1677025985,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to cover this? Missing hinge cover... tried with washi tape but it didn't stick well :(",
        "author": "Miserable-Lif3",
        "url": "https://www.reddit.com/gallery/118jngy",
        "text": "",
        "created_utc": 1677024973,
        "upvote_ratio": 1.0
    },
    {
        "title": "F3 - Find new friends",
        "author": "galleguit0",
        "url": "https://f3.cool/_/bff?referral=OE9UMrv",
        "text": "",
        "created_utc": 1677024488,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I learn to do big DIY projects?",
        "author": "uselessfoster",
        "url": "https://www.reddit.com/r/Frugal/comments/118iwc3/how_can_i_learn_to_do_big_diy_projects/",
        "text": "My dad built my childhood home himself (with, like, licensed and qualified plumbers, electricians, etc. along the way) back in the 70s by just checking out the Time Life books from the library. He’s only medium handy by nature and an academic by training and the house, while it has its quirks, is solid. \n\nI want to put in a kitchenette in our basement so when our cousin moves down there for college they have their own space and I’m at a loss. (NB: yes, I’m aware of the zoning and building permit aspect of the project.)\n\nI can do minor DIY repair like changing a toilet flapper or putting in a ceiling fan, and I don't have any trade training. There’s already a bathroom and a sink down there. It needs us to expand the \"kitchen\" flooring and totally reconfigure the counters to accommodate a fridge and put in a range (but no oven because zoning laws). What can I actually DIM and what should I leave to a professional? How do I get the skills I need to do this halfway decent?",
        "created_utc": 1677022989,
        "upvote_ratio": 1.0
    },
    {
        "title": "Insanity",
        "author": "Gungatime",
        "url": "https://www.reddit.com/r/Frugal/comments/118iuyf/insanity/",
        "text": "[removed]",
        "created_utc": 1677022879,
        "upvote_ratio": 1.0
    },
    {
        "title": "https://tegram.me/QyP9r-dxe1A4MDI8",
        "author": "ProfessionalCrazy181",
        "url": "https://www.reddit.com/r/Frugal/comments/118irzt/httpstegrammeqyp9rdxe1a4mdi8/",
        "text": "[removed]",
        "created_utc": 1677022654,
        "upvote_ratio": 1.0
    },
    {
        "title": "DIY Freezer Meal - Meal Prep",
        "author": "Affectionate-Buy2539",
        "url": "https://www.reddit.com/r/Frugal/comments/118iics/diy_freezer_meal_meal_prep/",
        "text": "\n\nIn an effort to not order delivery when I don't have the bandwidth to cook, or when I need to go grocery shopping, I would like to meal prep some freezer meals.\n\nI'm inspired to do this because I recently tried Factor (meal delivery service) for just a week and I thought that some of the things I could easily prep on an afternoon (their stuffed bell pepper for example wasn't a \"stuffed\" pepper at all but more like a casserole situation, for example with all the components layered).\n\nI am looking for recommendations of how to store individually-portioned meals in the freezer without contributing to single use plastics/wrapper waste. Ideally, I'd like recommendations for containers that use space efficiently and nest well (and don't have bulky/oddly shaped lids).\n\nWhat are your favorite ways to store pre-portioned freezer items? (Also if you have any recipes/websites for individual freezer-meals, please feel free to share!)",
        "created_utc": 1677021956,
        "upvote_ratio": 1.0
    },
    {
        "title": "Food processor, not too big",
        "author": "blaze1234",
        "url": "https://www.reddit.com/r/Frugal/comments/118i029/food_processor_not_too_big/",
        "text": "Willing to buy on eBay but prefer new\n\nlowest price NO, best value YES\n\nin other words built to last, replacement parts, doesn't break in just a few years\n\nTiny kitchen, so compact design to store away but big enough for family meals",
        "created_utc": 1677020679,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cheaper streaming services with sports",
        "author": "runliftgrappleshoot",
        "url": "https://www.reddit.com/r/Frugal/comments/118gw6b/cheaper_streaming_services_with_sports/",
        "text": "A few months ago my wife and I killed cable and switched to Hulu live.  It’s saving us about $40 a month( we have to keep wifi unfortunately) but I would like to possibly find something even cheaper if it’s possible. \n\nProblem is that I’m a huge sports fan, specifically football and baseball. Are there any cheaper streaming services that offer these? We’re paying about $80 a month for the Hulu package.",
        "created_utc": 1677018015,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to make a DIY under desk laptop hanger like this?",
        "author": "Stardustones",
        "url": "https://i.redd.it/rk3126cxmnja1.jpg",
        "text": "",
        "created_utc": 1677016453,
        "upvote_ratio": 1.0
    },
    {
        "title": "Replacing My Cracked Phone Screen Myself",
        "author": "Responsible-Train982",
        "url": "https://www.reddit.com/r/Frugal/comments/118g7lm/replacing_my_cracked_phone_screen_myself/",
        "text": "[removed]",
        "created_utc": 1677016382,
        "upvote_ratio": 1.0
    },
    {
        "title": "How not to destroy my latest smartphone?",
        "author": "zzy32ds",
        "url": "https://www.reddit.com/r/Frugal/comments/118fxra/how_not_to_destroy_my_latest_smartphone/",
        "text": "I've killed several cheap smartphones in various ways: dropping, tripping, sweat. The cost of each phone is not a big deal but the wastefulness of money and time in replacing them (and reloading apps, etc.) is really galling me. Not frugal at all!\n\n I'm determined to make my latest replacement last at least 2-3 years.\n\nI bought a case for this one but it's very flimsy plastic, just on the back. It also has a screen protector that I haven't put on yet but that's just a very thin plastic shim as well. I have a feeling that if I were to trip and fall with these on, the phone would be destroyed again.\n\nMy plan for now is:\n\n- To only jog with a special jogging belt to hold the phone (not in my hands, as if I fall, the phone is hitting the ground hard; plus avoids sweat into phone)\n- In the warmer months, to always have it in the shade, never in direct sunlight so it doesn't overheat/kill the battery.\n- To very minimally handle it in the summer if my hands are sweaty (and to dry them off before touching it)\n\nAny other ideas for how to keep this one alive for the long haul?",
        "created_utc": 1677015718,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need a new bed, but I'm trying to save as much money as possible. What are my options?",
        "author": "Full-Advertising-785",
        "url": "https://www.reddit.com/r/Frugal/comments/118ftzf/need_a_new_bed_but_im_trying_to_save_as_much/",
        "text": "[removed]",
        "created_utc": 1677015471,
        "upvote_ratio": 1.0
    },
    {
        "title": "IF YOU DON'T KNOW ABOUT TEMU YOU'RE MISSING OUT",
        "author": "NewMoneyMarketing",
        "url": "https://www.reddit.com/r/Frugal/comments/118ekdn/if_you_dont_know_about_temu_youre_missing_out/",
        "text": "[removed]",
        "created_utc": 1677012378,
        "upvote_ratio": 1.0
    },
    {
        "title": "How should I store raw meats properly in the freezer for longer without ice-burn?",
        "author": "BlackNosedOwl",
        "url": "https://www.reddit.com/r/Frugal/comments/118dspe/how_should_i_store_raw_meats_properly_in_the/",
        "text": "I recently developed a new habit of storing stuff in the freezer.  I'm using ziplock freezer bags. Not sure if I should double bag it.  I'm about to buy more Tyson chicken breasts on the $2-a-pound sale (normally around $7 - I'm not going to resist that deal) and I hope to keep them frozen for half a year.  \n\nHow should I store the raw chicken and other meats in the freezer?",
        "created_utc": 1677010313,
        "upvote_ratio": 1.0
    },
    {
        "title": "The banana post was so popular, the studio greenlit a sequel. 170 pounds of tangerines",
        "author": "PurplePotamus",
        "url": "https://i.imgur.com/nTgRwu4.jpg",
        "text": "",
        "created_utc": 1677007172,
        "upvote_ratio": 0.93
    },
    {
        "title": "Save-On-Foods $1.49 sale",
        "author": "DisarmedOden683",
        "url": "https://i.redd.it/l3njo7ecomja1.jpg",
        "text": "",
        "created_utc": 1677004824,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are your favorite things to eat while being frugal",
        "author": "OkDeath",
        "url": "https://www.reddit.com/r/Frugal/comments/118bm3b/what_are_your_favorite_things_to_eat_while_being/",
        "text": "Wanted to know everyone favorite or guilty pleasure while living frugal",
        "created_utc": 1677002314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electricity- getting it all rewired",
        "author": "naturallia",
        "url": "https://www.reddit.com/r/Frugal/comments/118b6hg/electricity_getting_it_all_rewired/",
        "text": "My electric bills have been crazy high. I think I need to have my house completely rewired because my appliances keep frying. It'll be expensive. Is there a way to make it not as expensive? Or do I just have to suck it up and pay for it all? I live in a old house and I think the previous owner \"DIY\"ed the electric himself, screwing things up.    \n\n\nDoes electricians do enegry audits before getting to work to identify where all the power is going? Or do I need to hire someone separately to do the audit to identify that so I can point the electrician at where to get started?",
        "created_utc": 1677001238,
        "upvote_ratio": 1.0
    },
    {
        "title": "Surplus “humanitarian daily rations” as cheap packable meals?",
        "author": "jtfooog",
        "url": "https://www.reddit.com/r/Frugal/comments/118b33h/surplus_humanitarian_daily_rations_as_cheap/",
        "text": "I recently purchased a case of surplus FEMA rations on Amazon for $50. In the case there are 10 complete daily rations. Each ration contains 2 rice, vegetable, bean, or lentil based entrees (which are surprisingly flavorful and filling so far), cookies, snack bread, peanut butter, jelly, and other sides. average of 2,200 calories. So you’re basically paying 2.50 for a complete meal with decent variety, plus easy portability and shelf stability. Another added benefit is the complete lack of any prep time. \n\n\n\nHas anyone else ever considered this for taking to work, on trips, or just supplementing normal groceries? The food is surprisingly high quality and calorie dense. $50 for 20 meals of 0-prep, decent food seems like an extremely good deal for me.",
        "created_utc": 1677001005,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moving from SC to ATL, GA",
        "author": "SlayinSaiyan-1",
        "url": "https://www.reddit.com/r/Frugal/comments/118azfv/moving_from_sc_to_atl_ga/",
        "text": "I have posted this in a relocation sub but wanted to post here too if allowed. My company has asked me to potentially move to Atlanta to help develop a recently acquired company. I have been in my current position a little over a year and the president called me and said I was high on the list for people they thought of to help assimilate the new teammates and grow the business. I know nothing of atlanta outside of the terrible traffic. I’ve been there a handful of times for events over the weekend. Any advice? We’re currently renting but have been heavily house hunting in SC. Any tips or ideas honestly would be so appreciated.",
        "created_utc": 1677000752,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dehydrating Food",
        "author": "Pour_the_tea-mlr",
        "url": "https://www.reddit.com/r/Frugal/comments/118aot2/dehydrating_food/",
        "text": "[removed]",
        "created_utc": 1677000087,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any federal/state grants for low income households? Arkansas resident",
        "author": "Raenoke",
        "url": "https://www.reddit.com/r/Frugal/comments/118aklz/any_federalstate_grants_for_low_income_households/",
        "text": "Hi there, I'm a M21 in a household with my fiance. We have no children and I'm unemployed currently (currently enrolled in a CDL training school)\n\nAre there any grants that would be able to assist with living expenses, food, groceries, gas, etc? We don't make a lot of money and could use any help. Every time I Google information it's always these scam websites that show up, so I don't know what to trust. I do plan on enrolling in SNAP for food but I don't know what else to do.. of anyone has any information about charities, grants, assistance, anything, please let me know. You're free to DM if need be",
        "created_utc": 1676999871,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you find is the best way to cut your hair?",
        "author": "AaronBenne",
        "url": "https://www.reddit.com/r/Frugal/comments/1189sax/what_do_you_find_is_the_best_way_to_cut_your_hair/",
        "text": "I was using an electric trimmer but they are all set at a maximum of about 3 cm (a bit over an inch) and that gets a bit short on top.",
        "created_utc": 1676998567,
        "upvote_ratio": 1.0
    },
    {
        "title": "What things should I take advantage of while still low income?",
        "author": "MangoFool",
        "url": "/r/personalfinance/comments/1188puu/what_things_should_i_take_advantage_of_while/",
        "text": "",
        "created_utc": 1676997116,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saving money on subscriptions",
        "author": "EnaGrimm",
        "url": "https://www.reddit.com/r/Frugal/comments/1188duj/saving_money_on_subscriptions/",
        "text": " I’ve been rotating my subscriptions and free trials recently to see where I can save money. I’m especially into   learning resources, as there is no library or community college in my town. I like services like Masterclass, Coursera and Babbel, but they’ve gotten pretty pricey, and it’s hard to actually learn something when you’re constantly unsubscribing. Any suggestions?",
        "created_utc": 1676996622,
        "upvote_ratio": 1.0
    },
    {
        "title": "Let’s give back today. 💕",
        "author": "pixelartistjewelie",
        "url": "https://i.redd.it/yro770v9ylja1.jpg",
        "text": "",
        "created_utc": 1676996056,
        "upvote_ratio": 1.0
    },
    {
        "title": "UPDATE: 30 pounds of bananas",
        "author": "bethany_katherine",
        "url": "https://i.redd.it/n4cxhl2zmlja1.jpg",
        "text": "[removed]",
        "created_utc": 1676992257,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal BabyTips: Baby Knee Pads",
        "author": "CatWatt",
        "url": "https://www.reddit.com/r/Frugal/comments/1185nf6/frugal_babytips_baby_knee_pads/",
        "text": "To protect your crawling baby's tender knees, take a pair of adult's thick socks.\n\nCut off the foot part.\n\nFold up the raw edge of the ankle part.\n\nZig-zag stitch around.\n\nSlip over your baby's legs to protect their knees from crawling.\n\nIf your socks are not thick enough, use two socks each, one inside the other and stitched together.\n\nCan be used over bare knees - or over baby's clothing.",
        "created_utc": 1676992250,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moving out of my parent's house soon. Here is my budget for the next 12 months. Did I forget anything?",
        "author": "Learn_Social_Skills",
        "url": "https://www.reddit.com/r/Frugal/comments/1184uxe/moving_out_of_my_parents_house_soon_here_is_my/",
        "text": "[removed]",
        "created_utc": 1676990120,
        "upvote_ratio": 1.0
    },
    {
        "title": "YAY!!!!",
        "author": "RepresentativeOk8899",
        "url": "https://i.redd.it/olqzkb90glja1.jpg",
        "text": "",
        "created_utc": 1676989913,
        "upvote_ratio": 1.0
    },
    {
        "title": "Progresso Soup- Kroger- $1.17 ea",
        "author": "OoOoReillys",
        "url": "https://www.reddit.com/r/Frugal/comments/1184qgb/progresso_soup_kroger_117_ea/",
        "text": "I typically make my own soups to save money, but I like to have canned soup on hand for “those days”. Kroger has Progresso soups 3/$5 this week. They also have two digital coupons that expire in mid-March. One was for $1 off of 3 cans and the other was $2 off of 6 cans. So by combining the sale + coupons, I bought 6 cans for $7 total. \n\nJust sharing in case anyone else likes Progresso.",
        "created_utc": 1676989791,
        "upvote_ratio": 1.0
    },
    {
        "title": "Haircuts",
        "author": "selfmadebus",
        "url": "https://www.reddit.com/r/Frugal/comments/1183m5q/haircuts/",
        "text": "How many couples and parents cut their kids hair at home or cut their cut their husbands hair to save money?",
        "created_utc": 1676986627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone tried hydrogen peroxide in their washing machines, front end loaders, or dishwashers?",
        "author": "primopollack",
        "url": "https://www.reddit.com/r/Frugal/comments/118364w/has_anyone_tried_hydrogen_peroxide_in_their/",
        "text": "I’m scared! I saw a video that recommended it.",
        "created_utc": 1676985339,
        "upvote_ratio": 1.0
    },
    {
        "title": "DIY bath for birdies",
        "author": "DilapidatedDinosaur",
        "url": "https://v.redd.it/96sn6t1e5cja1",
        "text": "",
        "created_utc": 1676984771,
        "upvote_ratio": 1.0
    },
    {
        "title": "Imran Khan's Protective Bail Approved After Appearing in Lahore High Court",
        "author": "Ok-Method9478",
        "url": "https://politicalpointofviewpk.blogspot.com/2023/02/imran-khans-protective-bail-approved.html",
        "text": "",
        "created_utc": 1676977963,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips on how to easily make a new 'band' for my watch strap?",
        "author": "Sassorz",
        "url": "https://www.reddit.com/r/Frugal/comments/1180lz2/any_tips_on_how_to_easily_make_a_new_band_for_my/",
        "text": "The band that holds my watch strap in place frequently breaks. I wondered if there was a creative way to keep it in place without having to continuously buy new watch straps. Here's the [watch strap that needs a new band](https://i.imgur.com/Sumy72u.jpg).",
        "created_utc": 1676976476,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone here grow their own food?",
        "author": "tempo90909",
        "url": "https://www.reddit.com/r/Frugal/comments/117zbhn/anyone_here_grow_their_own_food/",
        "text": "Do you have a greenhouse?",
        "created_utc": 1676971465,
        "upvote_ratio": 1.0
    },
    {
        "title": "Teepee vs H2O",
        "author": "Ok-Word-8452",
        "url": "https://www.reddit.com/r/Frugal/comments/117z9m0/teepee_vs_h2o/",
        "text": "[removed]",
        "created_utc": 1676971254,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can this be fixed?(Theyre my favorite pair)",
        "author": "j0hn2097",
        "url": "https://www.reddit.com/gallery/117xluf",
        "text": "",
        "created_utc": 1676964786,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am being tempted to buy iPhone 14 Pro to replace my defective iPhone 7 Plus - what's your frugal advice?",
        "author": "aomorimemory",
        "url": "https://www.reddit.com/r/Frugal/comments/117w4h0/i_am_being_tempted_to_buy_iphone_14_pro_to/",
        "text": "* I am not someone who replace phone every now and then but now some parts of my phone is not functioning. LCD screen has been replaced 2 years ago and now it is defective again, I cannot type S and Z on it.\n* Android won't be an option as I sync notes and photos on my mac book. \n* I do not own any camera that's why I am aiming for a phone with nice camera. \n* I am contemplating as maybe I should wait for iPhone 15? and if I am not satisfied with iPhone 15's upgrade, maybe iPhone 14 pro will be cheaper once 15 has been released?\n* There is an option to apply for 0% installment for 36 months if I decided to buy iphone 14 pro\n\nWould like to get your frugal opinions...",
        "created_utc": 1676959384,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal podcast",
        "author": "El-guapos-pinatas",
        "url": "https://www.reddit.com/r/Frugal/comments/117v0a9/frugal_podcast/",
        "text": "[removed]",
        "created_utc": 1676955682,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shoes are killing my budget",
        "author": "16066888XX98",
        "url": "https://www.reddit.com/r/Frugal/comments/117uw0b/shoes_are_killing_my_budget/",
        "text": "I buy quality shoes, and not a lot of them. Generally, I always have one pair of the following in my closet:\n\n-Birkenstock Arizona Sandals\n-Hoka Running Shoes\n-Birkenstock Closed-toed Shoes\n-Winter Boots\n-Rothy Flats\n-Leather Oxfords\n\nThe Birkenstocks and Rothys have been lasting me about a year (each pair), but they look rough by the end of that year. The Hokas need to be replaced several times per year. The winter boots generally last 2-3 seasons and need resoling annually. The oxfords also need new heels and sometime re-dying annually (I've had the same veeeery expensive French oxfords for over a decade). \n\nI'm trying to buy good quality and I do take good care of them, but I'm still spending a lot of money every year. I would love to know people's thoughts on how to reduce costs!",
        "created_utc": 1676955329,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does TDLR mean?",
        "author": "mike_c1979",
        "url": "https://www.reddit.com/r/Frugal/comments/117utc4/what_does_tdlr_mean/",
        "text": "[removed]",
        "created_utc": 1676955085,
        "upvote_ratio": 1.0
    },
    {
        "title": "Easy swaps and habits",
        "author": "spoopybunbun",
        "url": "https://www.reddit.com/r/Frugal/comments/117uaas/easy_swaps_and_habits/",
        "text": "Hello! I wanted to share some ideas that have helped save money over the years \n\n1) don't shave in the shower. Instead, fill a bowl with water while you're still showering, turn the water off, THEN shave. \n\n2) Bleach is all you need. Follow the dilution instructions on the bottle and you have a multi-purpose cleaner and disemfectant.\n\n3) Oils! So many oils you already have lying around can be used for many things. Cooking, cuticle oil, lip oil, makeup remover, even for removing nail glue.\n\n4) Vaseline. Seriously. Dry heels? Vaseline. Chapped lips? Vaseline. Squeaky hinges? Vaseline. Skin slugging? Vaseline. If you want a new lip color, melt some Vaseline and nontoxic crayons together. \n\n5) Want fun eyeliner? Spray some setting spray on an eyeliner brush and dip into eyeshadow.\n\n6) If you have a conditioner you don't really like, use it as shaving cream.\n\n7) is your foundation \"empty?\" Throw some moisturizer in the bottle and shake it up. Boom, tinted moisturizer.\n\n8) save vegetable peels to boil later and make a stock. Same with ham and chicken bones.\n\nHope these helps!",
        "created_utc": 1676953429,
        "upvote_ratio": 1.0
    },
    {
        "title": "Expired canned goods",
        "author": "em_j18",
        "url": "https://www.reddit.com/gallery/117u5mt",
        "text": "",
        "created_utc": 1676953040,
        "upvote_ratio": 1.0
    },
    {
        "title": "How To Make Cast Iron Cookware Last Forever",
        "author": "Astronius-Maximus",
        "url": "https://www.reddit.com/r/Frugal/comments/117rddd/how_to_make_cast_iron_cookware_last_forever/",
        "text": "&amp;#x200B;\n\n[I see so many posts asking about restoring skillets and other similar items. Hopefully this little guide will help out. Note that this only applies to cast iron. If you have non-stick pans, replace them with cast iron.](https://preview.redd.it/dcunhtbp7gja1.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=4eb26bd0192384f3f4d40c89c8344f52ce13ae0d)",
        "created_utc": 1676944783,
        "upvote_ratio": 1.0
    },
    {
        "title": "Allergy Medicine?",
        "author": "loweshardware",
        "url": "https://www.reddit.com/r/Frugal/comments/117r8jb/allergy_medicine/",
        "text": "Where is the cheapest place to get generic allergy medicine in the US? Costco? Local pharmacy? It’s so expensive but the weather change is killing me",
        "created_utc": 1676944388,
        "upvote_ratio": 1.0
    },
    {
        "title": "The small DIY options with little impact on your day-to-day.",
        "author": "FlyingmonkeyV1",
        "url": "https://www.reddit.com/r/Frugal/comments/117qlgv/the_small_diy_options_with_little_impact_on_your/",
        "text": "[removed]",
        "created_utc": 1676942542,
        "upvote_ratio": 1.0
    },
    {
        "title": "meal plan?",
        "author": "nonconformist-geode",
        "url": "https://www.reddit.com/r/Frugal/comments/117qhsl/meal_plan/",
        "text": "[removed]",
        "created_utc": 1676942261,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the best and worst deals at Sam’s Club and Costco?",
        "author": "Frolfer96",
        "url": "https://www.reddit.com/r/Frugal/comments/117pjfl/what_are_the_best_and_worst_deals_at_sams_club/",
        "text": "[removed]",
        "created_utc": 1676939585,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need some advice on buying a car vs. renting one.",
        "author": "ukiyo_10",
        "url": "https://www.reddit.com/r/Frugal/comments/117o6m0/i_need_some_advice_on_buying_a_car_vs_renting_one/",
        "text": "As a student without a car, I'm excited to start a new white-collar job soon, and before I begin, I want to take a long road trip of around 3000 miles. Once I start my job, I don't anticipate needing a car often, except perhaps on weekends, as I plan to live downtown. Given that I'll be traveling with other people and a lot of luggage, I'll need a mid-size or compact SUV for my road trip.\n\nUnfortunately, the average parking rates for apartments in the area are approximately $250 a month. I have checked the rates for renting an SUV for about 20 days, and it would cost me around $1500-$2000 + gas + tax. However, considering the depreciation of putting 3000 miles on a new car, I wonder if it would be a better investment to finance a new mid-size/compact SUV with the money I would spend on a rental.\n\nTLDR: If I spend $2,000 on a rental, that money is essentially gone. But if I use it to finance a new car, it can go towards something I will own. However, there's a tradeoff to consider: adding miles to a new car can depreciate its value over time.",
        "created_utc": 1676935968,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to up the scratch-resistance of my Zenni glasses?",
        "author": "empathyboi",
        "url": "https://www.reddit.com/r/Frugal/comments/117o5fh/how_to_up_the_scratchresistance_of_my_zenni/",
        "text": "Hi all -- been an avid Zenni enthusiast for the past few years now. I'd say they're up there among my favorite frugal hacks.\n\nMy only real complaint is that they scratch fairly easily. \n\nThey don't seem to have any \"enhanced scratch resistance\" option and I've seen mixed reviews as to whether or not the oil-resistance also makes them more durable.\n\nAre there any solutions here? I'm trying not to just churn through glasses every 3 months as that'll kind of defeat the purpose of getting them.\n\nIs there some kind of effective \"scratch resistance spray\" I can buy separately or something?",
        "created_utc": 1676935888,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lunches that don't need to be refrigerated/ nuked?",
        "author": "BackNForth94",
        "url": "https://www.reddit.com/r/Frugal/comments/117o36p/lunches_that_dont_need_to_be_refrigerated_nuked/",
        "text": "My typical lunch is along the lines of quinoia and chicken, but I've recently started a tech job where I'll be out of the office most days and my lunch will be left in my van until I'm ready for it. What kinds of lunches do you suggest that won't spoil in this environment?",
        "created_utc": 1676935735,
        "upvote_ratio": 1.0
    },
    {
        "title": "Window Coverings",
        "author": "ClickAndClackTheTap",
        "url": "https://www.reddit.com/r/Frugal/comments/117nxuo/window_coverings/",
        "text": "Got an estimate from Costco for $11,000 and no room for negotiation. Home Depot came in at $4,500 and I got them down to $3,200 with some tweaking. \n\nI was looking around at Home Depot and saw that you can get them off the shelf and HD will cut down to size. But I’m not handy yet I do have someone who can install them. I just didn’t want it to get hecka expensive if they took a long time to install. \n\nI spent about $900 in all- bottom up/top down light filtering cellular shades (for Street level) and blackout cellular (for bedrooms and media room). I also decided to just do black out curtains with a rod on some windows that were unusual sizes. \n\nHandyman charged me $100 to install on 18 windows. \n\nI’m super happy with my savings!",
        "created_utc": 1676935360,
        "upvote_ratio": 1.0
    },
    {
        "title": "Off-brands: sometimes you win, sometimes you lose",
        "author": "jezebella47",
        "url": "https://www.reddit.com/r/Frugal/comments/117nbuw/offbrands_sometimes_you_win_sometimes_you_lose/",
        "text": "Best off-brand alternatives?  I'm particularly looking for a good alternative brand of litter genie refills.  \n\nMy offerings in exchange: \n\nOnly buy QTips if you need cotton swabs.  I will never buy another brand, the rest are terrible.  \n\nStore brand Crystal Light - I've tried Winn Dixie and Walmart.  Alllllmost as good, but not quite right.  A dollar less so I keep buying it anyway. \n\nAldi's version of Wheat Thins and Triscuits: yuck.  No.  Not worth the savings. \n\nAldi brie cheese: hell yes.",
        "created_utc": 1676933848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Instead of lunch meat, buy a whole spiral ham.",
        "author": "yungzanz",
        "url": "https://i.redd.it/uocnf7p7rgja1.jpg",
        "text": "[removed]",
        "created_utc": 1676933148,
        "upvote_ratio": 1.0
    },
    {
        "title": "F3 - Find new friends",
        "author": "ares-8254",
        "url": "https://f3.cool/_/bff?referral=gadTdmgg",
        "text": "",
        "created_utc": 1676933073,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the easiest things for a family to cut back on?",
        "author": "Twinsmamabnj",
        "url": "https://www.reddit.com/r/Frugal/comments/117mlnl/what_are_the_easiest_things_for_a_family_to_cut/",
        "text": "My daughter needs math tutoring really badly. Coming out of Covid and her starting junior high has made me realize she is about two or even three grade levels behind on math. It’s torture for both of us when I try to work with her and I’m also horrible at math myself. I can’t find any tutoring for less than $200/mo. I’ve checked chain places like Kumon and also independent tutors. I’m sure I can squeeze $200 out of my expenses somewhere but I don’t know where to start. I have other kids and we aren’t broke but there’s rarely a lot of fun money leftover each pay period.",
        "created_utc": 1676932107,
        "upvote_ratio": 1.0
    },
    {
        "title": "In a bind",
        "author": "j0rdan0h",
        "url": "https://www.reddit.com/r/Frugal/comments/117m6rn/in_a_bind/",
        "text": "My car broke down and finding a way to get groceries every week is a little exhausting. Any food delivery options worth it? I know instacart adds a bunch of fees.",
        "created_utc": 1676931110,
        "upvote_ratio": 1.0
    },
    {
        "title": "Living a Rich Life on a Budget",
        "author": "MrMeta3",
        "url": "https://www.reddit.com/r/Frugal/comments/117ltn9/living_a_rich_life_on_a_budget/",
        "text": "[removed]",
        "created_utc": 1676930236,
        "upvote_ratio": 1.0
    },
    {
        "title": "You can get many library cards from different areas without a limit on borrows for digital contents",
        "author": "BlackNosedOwl",
        "url": "https://www.reddit.com/r/Frugal/comments/117lpi3/you_can_get_many_library_cards_from_different/",
        "text": "[removed]",
        "created_utc": 1676929967,
        "upvote_ratio": 1.0
    },
    {
        "title": "About $20 homemade vs $25 in store",
        "author": "Angrygiraffe1786",
        "url": "https://i.redd.it/hkxnerfzggja1.png",
        "text": "",
        "created_utc": 1676929715,
        "upvote_ratio": 1.0
    },
    {
        "title": "Downloaded the Pilot/Flying J app and received all this for no cost while getting 5 cents back",
        "author": "HughJanus_",
        "url": "https://i.redd.it/tnz06cbyegja1.jpg",
        "text": "",
        "created_utc": 1676929027,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Queen size mattress should I buy?",
        "author": "kdrumz011",
        "url": "https://www.reddit.com/r/Frugal/comments/117kckl/what_queen_size_mattress_should_i_buy/",
        "text": "Looking for a queen size mattress. I don’t like too firm but I also don’t like to sink either; so probably want something in the middle.\n\nNot sure where to look. Should I stick to Amazon/Costco? Don’t have a budget but I don’t want to spend $2,000 either. Would love to spend $500 and get something that lasts me a good 4-5 years if possible.\n\nAlso don’t want a box spring as I know that matters for different types of mattresses.\n\nWhat should I buy?",
        "created_utc": 1676926770,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey all, this is pretty much my last resort..",
        "author": "New_Yard4706",
        "url": "https://www.reddit.com/r/Frugal/comments/117k9we/hey_all_this_is_pretty_much_my_last_resort/",
        "text": "Me and my wife are struggling, we both live in chronic constant pain and are drowning in debt because no one taught us how to deal with money. I have a hard time working because of my service connected disabilities and this is pretty much the end of the line for us. My truck is about to get repod and our electricity is about to be cut off. I don't want to listen to my wife cry and say she's given up anymore. listening to her lose hope, and wanting to end it all. she is my everything, and I don't care about anything other than making sure she is ok. please.. I hate asking for money but there's nothing else I could possibly do. we need to start saving and we want to do good with our money but everything goes to bills and ridiculously high interest rates on our credit cards and loans.\n\n\nif there is anyone at all who is in the position to help.. for her at least.. I was thinking about taking out life insurance and killing myself so she could at least start fresh..",
        "created_utc": 1676926581,
        "upvote_ratio": 1.0
    },
    {
        "title": "New Car Plans",
        "author": "Candid_Lie9249",
        "url": "https://www.reddit.com/r/Frugal/comments/117jy23/new_car_plans/",
        "text": "So we've decided to buy a new car after moving to a city that makes having one car very difficult (poor/no biking lanes, minimally obeyed traffic laws, terrible road conditions, winters). We are getting an SUV from a dealer since the prices for a recently used car are still ridiculous.\n\nFor those that have bought a new car recently from a dealership, what should we keep in mind when buying a car form a dealer? Is there any negotiating power at all when the wait is 6-12 months?",
        "created_utc": 1676925785,
        "upvote_ratio": 1.0
    },
    {
        "title": "If y'all haven't seen this already, it's Costco for the win! 🥳",
        "author": "Tickly1",
        "url": "https://i.redd.it/1xw923wv1gja1.jpg",
        "text": "",
        "created_utc": 1676924630,
        "upvote_ratio": 1.0
    },
    {
        "title": "iPod Mini dust cover",
        "author": "Danmanguy",
        "url": "https://www.reddit.com/r/Frugal/comments/117j67p/ipod_mini_dust_cover/",
        "text": "iPod mini is great, but the surface can be a dust trap. With the help of an exacto knife and scissors, it now comes standard with a dust cover, for when it is not in use.",
        "created_utc": 1676923924,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will be hiring movers for short distance move to 2nd story apartment w/o elevator. Would it be cheaper to buy a new couch before or after move?",
        "author": "justalilbug",
        "url": "https://www.reddit.com/r/Frugal/comments/117ihoj/will_be_hiring_movers_for_short_distance_move_to/",
        "text": "Background:\n- I currently living in an apartment building with a loading dock and elevator.\n\n- I’ll be moving to a 2nd story apartment above a residential house. The entry of the unit is at the top of a flight of stairs.\n\n- The new apartment is less than 5 miles from my current place, so it’s a short distance move.\n\n- I’ll be hiring professional movers to move all my big furniture.\n\n- I plan to buy a new couch that will fit the new space better and donate my current couch.\n\n- I’ve already taken pictures and exact measurements of the area where the couch will go.\n\n- I’ve built a digital floor plan with my current/potential furniture to scale to help design my layout.\n\n\nGiven that I will have to pay for movers or delivery either way, I can see three possible orders of events:\n\n1. Buy new couch now and have a friend help me move it into my current apartment/remove old couch for donation. Then have my new couch moved by the movers. \n\nPros: No additional expenses that I can see, and don’t have to arrange/pay for delivery later. Cons: Could potentially be stuck with couch that doesn’t work in the space like I pictured.\n\n2. Donate my old couch before the move and buy a new couch after I move into my new place, paying for delivery of the new couch. \n\nPros: save money on movers having one less piece of big furniture to move, would have a more accurate assessment of my space and needs. Cons: have to arrange for/pay for delivery and schedule time off work to be home for delivery. Could be without couch for a longer time if backordered or delayed delivery. Delivery service might not be willing/able to take up the stairs?\n\n3. Keep and move my current couch, and then buy a new couch after I move into my new place. \n\nPros: gives me more time and flexibility to consider my options for a new couch. Cons: Will being paying movers to move old couch, arranging/paying for delivery of new couch, and arrange/potentially pay for removal of old couch.\n\nI’ve never used professional movers or furniture delivery services before so would be grateful for input from people who have used those services. I’m hoping to find the right combination of frugality and practicality/simplicity. \n\nIn looking through other threads for advice I read a lot of horror stories about 3rd party delivery services. I would be willing to pay more to avoid complications from delivery people who DGAF.",
        "created_utc": 1676922322,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for very expensive dog food?",
        "author": "505motherofmastiffs",
        "url": "https://www.reddit.com/r/Frugal/comments/117hmnw/tips_for_very_expensive_dog_food/",
        "text": "Hello, new here. I have to buy a very expensive dog food ($100/30 lbs) for one of my dogs with a health condition. Anyone found anyway to get a specific brand for cheaper? I bought through rakuten but that only gave me back $1. Thanks!",
        "created_utc": 1676920324,
        "upvote_ratio": 1.0
    },
    {
        "title": "ISO - Best DIY Website",
        "author": "lostkarma4anonymity",
        "url": "https://www.reddit.com/r/Frugal/comments/117h6bw/iso_best_diy_website/",
        "text": "I've never had the time or the patience to learn how to create a professional website. I've been getting quotes for $5k-10k for professional services (white collar) websites. \n\nSoon I will have a ton of free time and I would like to see if making my own website is realistic. Like say I had 40-80 hours to learn and create a website, is it worth it? Any good step by step resources?\n\nDo I just bite the bullet and either skip the website or pay someone? \n\nI don't really have a budget for paying someone.",
        "created_utc": 1676919287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is anyone aware of any car finance companies that deal with low credit scores",
        "author": "Maleknour38",
        "url": "https://decembearduk.org/viewtopic.php?t=2248",
        "text": "",
        "created_utc": 1676917505,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bought 30 pounds of bananas for super cheap, what should I make?",
        "author": "bethany_katherine",
        "url": "https://i.redd.it/n34bkdeyafja1.jpg",
        "text": "",
        "created_utc": 1676915574,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rent a center recliner",
        "author": "weheartyume",
        "url": "https://www.reddit.com/r/Frugal/comments/117fhvi/rent_a_center_recliner/",
        "text": "Hello,\n\nIm having abdomimal surgery (c section) in 3 weeks and I'm looking to rent a power recliner for just 2 weeks after the surgery for sleeping. Im seeing so many reviews that say not to use the company Rent a Center, but most (if not all) of the reviews are from people who rented for much longer or were looking for a rent to own situation. \n\nAre there any cons to me renting for such a short time frame? Does anyone have experience doing this?",
        "created_utc": 1676915434,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are we being too frugal? Budget included",
        "author": "beaujolais99",
        "url": "https://www.reddit.com/r/Frugal/comments/117f7o5/are_we_being_too_frugal_budget_included/",
        "text": "We like to discuss finances with our friends &amp; family and they seem to think we're too aggressive and overly frugal when it comes to saving/investing. Would appreciate some input from other frugal folks.\n\nDINK couple in MCOL area - early 30's.  Child free. No debt aside from mortgage. We have $60k total in our emergency fund &amp; sinking funds.  Have $100k in our retirement accounts combined.  We've been tracking every expense for past two years so our budget is pretty accurate. \n\nMonthly net income after taxes, insurance, etc: $9260 (I max out my 401k and employer matches up to 6%, spouse only contributes up to employer's match)\n\nMortgage: $3100\n\nUtilities: $500\n\nGas: $120\n\nGroceries/eating out/household: $600\n\nPhone: $65\n\nSubscriptions: $35\n\nPet: $100\n\nCar insurance: $150\n\n= $4670\n\nLeftover after expenses: $4590. We put away $4500 to our IRA &amp; taxable brokerage. So about $100 left in savings give of take. \n\nWe invest about $85k into our retirement yearly and save about $7-8k a year to cover random expenses that come up during the year (HOA, car registration fees, car maintenance, haircuts, gifts).\n\nWe try to splurge with using credit card rewards and travel cheaply using miles from our travel CC. \n\nI will admit - this lifestyle can be difficult to maintain at times. We can't go out to bars every weekend with our friends but will go out hiking for free instead. We don't really buy any new clothes. We try to eat healthy but we will eat a lot of pasta because it's pretty cheap.  We've only been aggressively investing for the past year and hope to do this for the next 5-6 years so we can be work optional in the future. \n\nAre we being too frugal and missing out?",
        "created_utc": 1676914848,
        "upvote_ratio": 1.0
    },
    {
        "title": "My other half eats most of the food before I get to it?!",
        "author": "kt54g60",
        "url": "https://www.reddit.com/r/Frugal/comments/117f6r5/my_other_half_eats_most_of_the_food_before_i_get/",
        "text": "Okay so it is what it is: he eats a lot of the quick food items because he has a high metabolism or whatever. I’m probably exaggerating to some degree, but I need some advice on what I can buy that is cheap and ready to eat. Like if there is cereal, pop-tarts, ice cream, chips, etc in this house they are gone within a day or two. So I’m trying to think of what I can buy as a decoy because cereal is way too expensive. \n\nPlease note I’ve tried to get him to eat healthier, but I’m too busy to monitor him as he’s a grown ass adult (even though he eats like a child).",
        "created_utc": 1676914803,
        "upvote_ratio": 1.0
    },
    {
        "title": "Outdoor seating ideas besides chairs? I'd prefer not to spend much.",
        "author": "RaeyinOfFire",
        "url": "https://i.redd.it/dpx7awv06fja1.jpg",
        "text": "[removed]",
        "created_utc": 1676913919,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal recipes for people who hate to cook?",
        "author": "kourt-sized",
        "url": "https://www.reddit.com/r/Frugal/comments/117eh9f/frugal_recipes_for_people_who_hate_to_cook/",
        "text": "I’m recovering from a pretty intense depression and an eating disorder. To spare the details I’m a sleep often and not eat type of depression. \n\nMost of my battle in recovery is motivating myself to cook and to eat healthy. Right now I’m mostly just having eggs for breakfast, salad for lunch and almonds for snacks. \n\nI often catch myself throwing pizza rolls or French fries in the air fryer which I hate to do. \n\nAnyone have quick &amp; easy healthy recipes? I know that’s super specific but I could use some help!",
        "created_utc": 1676913489,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone ever tried this recipe for DIY dishwasher detergent and does it actually work?",
        "author": "existential_tourist1",
        "url": "https://www.reddit.com/r/Frugal/comments/117dwkk/has_anyone_ever_tried_this_recipe_for_diy/",
        "text": "[removed]",
        "created_utc": 1676912587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vacuum seal what?",
        "author": "sunnyflow2",
        "url": "https://www.reddit.com/r/Frugal/comments/117dvx9/vacuum_seal_what/",
        "text": "Are there any other ways you utilize your vacuum sealer besides with the vacuum bags?",
        "created_utc": 1676912558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I change my electricity plan/provider?",
        "author": "Fold_Substantial",
        "url": "https://www.reddit.com/r/Frugal/comments/117cxh8/should_i_change_my_electricity_planprovider/",
        "text": "I am trying to figure out the best option for my electricity. I live in Texas, bought a house recently, and am currently on a 60 month plan that charges $0.14 per kWh (was one of the best options at the time). Looking at other plans now, it appears that there are some more inexpensive options out there. There are several 12 month plans for $.118 per kWh and even some 3 month plans for $.095 kWh per month. There is no cancellation fee if I were to exit my current contract. Looks like most of the others do have a cancellation fee.\n\nFor context, we’ve averaged 400 kWh per month the past 4 months (since we moved in) and I imagine that will spike once we get into the summer months as we haven’t had to use our AC much. Our house was built in 2018.\n\nWhat is the best strategy when considering these options? Should I switch to save more now but risk higher prices in the future? Should I stick with my current contract so that if energy prices spike over the next few years, I’m locked in? What else am I not considering that I should be? I always receive such great insight from this sub so I’d love to know your thoughts. Thanks in advance.",
        "created_utc": 1676911201,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking Frugal Shoppers for Interview About Saving Money",
        "author": "muran123456",
        "url": "https://www.reddit.com/r/Frugal/comments/117ch0w/seeking_frugal_shoppers_for_interview_about/",
        "text": "[removed]",
        "created_utc": 1676910576,
        "upvote_ratio": 1.0
    },
    {
        "title": "GEVC “free trip”?",
        "author": "JazzlikeDot7142",
        "url": "https://www.reddit.com/r/Frugal/comments/117b9xp/gevc_free_trip/",
        "text": "i hear a lot of y’all talk about those time share people who harass you to buy one and as long as you listen to their pitch and let them fuss at you you get a free trip. has anyone had experience with GEVC?  \n\nso far the only reviews i can find are that their timeshare sucks. i don’t care about that, i just want to know if you actually get the free trip.  \n\nthey approached us inside the zoo the other day and we signed up for a presentation in exchange for a 2 day trip to hawaii or cancun (very different places i know). they said they’ll pay for our plane tickets and hotel. we had to put down a $50 deposit for the presentation (???) which will be refunded. yes, we have it in writing that we get the $50 refund and the trip. but some people in BBB reviews say their refund card didn’t work. so now i’m wondering if the trip will actually be honoured as well. \n\nyes i’m aware they will probably harass us into joining. yes i’m aware that we’ll probably have to go on vacation on a tuesday or something. but if it’s a paid 2 day vacation to hawaii then it’s a paid 2 day vacation to hawaii and i’ll listen to their bs. \n\nso. does anyone have experience getting the free trip with this company specifically?",
        "created_utc": 1676908953,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please ask your representatives to support this act",
        "author": "helpwitheating",
        "url": "https://i.redd.it/dhrh1ou5bqfa1.jpg",
        "text": "",
        "created_utc": 1676908816,
        "upvote_ratio": 1.0
    },
    {
        "title": "App recommendation for Price per Unit Tracking",
        "author": "GanksOP",
        "url": "https://www.reddit.com/r/Frugal/comments/1179i6v/app_recommendation_for_price_per_unit_tracking/",
        "text": "I'm tired of manually entering prices of items on Listonic every time I go to a grocery store to compare prices. I checked the most popular apps but it doesn't seem any of them are optimized for Price per unit Tracking. If anyone has any recommendations I'm all ears.\n\nAs for listonic I been using it cuz it's the most simple app that has multiple fields I can fill out to track different metrics. Also it lets me share lists with my gf so no matter who goes to buy stuff we are both on the same page.",
        "created_utc": 1676906506,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is anybody else confused as to why people purchase sponges over scouring pads for kitchen use?",
        "author": "vagina_spektor",
        "url": "https://www.reddit.com/r/Frugal/comments/1178arj/is_anybody_else_confused_as_to_why_people/",
        "text": "I’ve never understood buying sponges for the kitchen. In my experience they use just as much soap and deteriorated just as quickly as scouring pads. Also, even with the best habits, they usually start to smell long before they disintegrate. And of course they cost way more.\n\nI should mention that I live in a country where water is abundant and free and I could see how sponges could be marginally more water efficient.",
        "created_utc": 1676904141,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dog toys",
        "author": "FormedFecalIncident",
        "url": "https://www.reddit.com/r/Frugal/comments/11768ub/dog_toys/",
        "text": "If your dog loves stuffed animals get them at Goodwill or inexpensive thrift stores.  We have two Danes and they go through them like crazy.",
        "created_utc": 1676898549,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cheapest way to ship stuff across the country?",
        "author": "Thugluvdoc",
        "url": "https://www.reddit.com/r/Frugal/comments/1176344/cheapest_way_to_ship_stuff_across_the_country/",
        "text": "I have to move some things that were in storage during COVID. It’s high priced items (TV, mirror, kitchen stuff, clothes, etc) so I need to ship it. What’s the cheapest method to move/ship things from the mountain states to the east coast?",
        "created_utc": 1676898113,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m not sure if this is the right place to ask about recycling?",
        "author": "cashandcoins",
        "url": "https://www.reddit.com/r/Frugal/comments/1172ti6/im_not_sure_if_this_is_the_right_place_to_ask/",
        "text": "I have the small Coleman propane tanks. I have called around to the big box stores, the propane dealers and no one takes them. Any ideas? I tried reusing them but with limited success. Thank you for your time and help.",
        "created_utc": 1676886739,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to make leather boots fit tighter?",
        "author": "FunAgency",
        "url": "https://www.reddit.com/r/Frugal/comments/1171gnf/how_to_make_leather_boots_fit_tighter/",
        "text": "[removed]",
        "created_utc": 1676881256,
        "upvote_ratio": 1.0
    },
    {
        "title": "Welcome ALL, to, Geofrey Gekood Patreon Page.",
        "author": "GeofreyGekood",
        "url": "https://youtu.be/qWgbLAMzteg",
        "text": "",
        "created_utc": 1676877210,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I outsource long term personal scheduling tasks for as cheap/reliable as possible?",
        "author": "Zen_Flow",
        "url": "https://www.reddit.com/r/Frugal/comments/11700ty/how_can_i_outsource_long_term_personal_scheduling/",
        "text": "[removed]",
        "created_utc": 1676875723,
        "upvote_ratio": 1.0
    },
    {
        "title": "A month worth of meals vacuum sealed. About $60",
        "author": "AccidentallyRelevant",
        "url": "https://i.redd.it/e7fuissshaja1.jpg",
        "text": "",
        "created_utc": 1676875463,
        "upvote_ratio": 1.0
    },
    {
        "title": "A convenience service that actually is worth it?",
        "author": "Sweetnspicy77",
        "url": "https://www.reddit.com/r/Frugal/comments/116ypy6/a_convenience_service_that_actually_is_worth_it/",
        "text": "I know this is totally different for everyone, but just curious what yours is! Cleaning service? Grocery delivery?",
        "created_utc": 1676871018,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your suggestions for online banking?",
        "author": "clapclapsnort",
        "url": "https://www.reddit.com/r/Frugal/comments/116yp8d/what_are_your_suggestions_for_online_banking/",
        "text": "I owe money to my local bank. Then main thing I will miss is the physical locations of the bank branches if I go online. What are some pros and cons of online banking? Would it be worth it to save up and pay the bank back?",
        "created_utc": 1676870951,
        "upvote_ratio": 1.0
    }
]