[
    {
        "title": "Getting a second job to pay debt: Is this a good idea?",
        "author": "PivotalPosture",
        "url": "https://www.reddit.com/r/Frugal/comments/10kycbd/getting_a_second_job_to_pay_debt_is_this_a_good/",
        "text": "I am in massive debt. And based on my current plan, I will be debt free September of next year.\n\nI work a full time job with benefits, but I barely have $100 at the end of each month, even with being extremely frugal. If anything major happens, I’ll be right back into debt again. \n\nI’m thinking of getting a second job and working seven days a week, but no more than 8 hours a day, until I’m debt free. That way I can at least cover expenses that can come up &amp; still be in line to be debt free. \n\nWould a basic job like delivering pizzas help? I’ve tried the apps, but that’s never guaranteed &amp; the pay always comes to less than ideal. \n\nI drive a Toyota minivan with 200k miles, but it’s in good shape, full coverage insurance &amp; I do all my own maintenance.",
        "created_utc": 1674652436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Brioche Bun Ideas",
        "author": "sassmasterfresh",
        "url": "https://www.reddit.com/r/Frugal/comments/10ky0co/brioche_bun_ideas/",
        "text": "Hi! I have 6 brioche buns that I need to use. Looking for creative uses besides their intended use as a sandwich bun. Also, don’t want to freeze them as we aren’t big sandwich eaters at our house and really looking for a more creative use. Thanks!",
        "created_utc": 1674651407,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to find affordable iPhones? Some websites seem scam",
        "author": "Jpoolman25",
        "url": "https://www.reddit.com/r/Frugal/comments/10kwufz/where_to_find_affordable_iphones_some_websites/",
        "text": "\nI’m trying to get iPhone for my little bro, but I don’t have that budget to get a brand new one. I was thinking of getting used just for school purpose and playing at home maybe hopefully add a line too. But I can’t find any decent on eBay. I don’t know where to get iPhone",
        "created_utc": 1674647365,
        "upvote_ratio": 1.0
    },
    {
        "title": "Woman went on six dates a week to save on food: ‘I didn’t buy groceries for two years’",
        "author": "supercharged0709",
        "url": "https://www.nzherald.co.nz/lifestyle/woman-went-on-six-dates-a-week-to-save-on-food-i-didnt-buy-groceries-for-two-years/ARNZPF4VSNFKHHS43STBICKBMA/",
        "text": "",
        "created_utc": 1674645603,
        "upvote_ratio": 1.0
    },
    {
        "title": "Steal This Wiki is back! The site contains tons of articles on living freely and cheaply which before you could only access through web.archive.org",
        "author": "ZonkerStout",
        "url": "https://stealthiswiki.com/",
        "text": "",
        "created_utc": 1674634577,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using mobile internet instead of paying for home internet separately?",
        "author": "Yeri__LN",
        "url": "https://www.reddit.com/r/Frugal/comments/10ktpi8/using_mobile_internet_instead_of_paying_for_home/",
        "text": "Has anyone done this?\n\nI have unlimited calls plan and 3.5 GB of internet as of now, I need this for work, pay from my own pocket. Going to an unlimited Internet from that plan wouldn't cost me much more. And home internet plans often come bundaled with cable TV here, since Internet is a necessity nowadays but cable isn't they would bump up the Internet price so that they can tell you that for a few more dollars you can have cable as well. That of course doesn't even include any of the channels I might be interested in.\n\nI have occasionally made my phone a Hotspot in order to use it on my work computer (when there were connection problems). But it hasn't been for long. At home I rarely use my laptop but if I have to, I know this would definitely do the job short therm. However, what about smart TV? Watching YouTube on a large screen probably uses up a lot of internet, shouldn't be a problem if my plan is unlimited but what about my phone? Will it heat up too much or destroy its battery? I have no idea how this really works and I want to know how it went for someone who tried something similar for at least a couple of months rather than risk destroying my 2 and a half year old phone's battery.",
        "created_utc": 1674634385,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best discount store online?",
        "author": "goofgroot",
        "url": "https://www.reddit.com/r/Frugal/comments/10ktemq/what_is_the_best_discount_store_online/",
        "text": "Just wondering if there are some good legit discount stores online. Thank you in advance",
        "created_utc": 1674633152,
        "upvote_ratio": 1.0
    },
    {
        "title": "~2L of strong chicken broth extracted in an Instant Pot from the bones of a rotisserie chicken",
        "author": "yungzanz",
        "url": "https://i.redd.it/zspnjn2ak6ea1.jpg",
        "text": "",
        "created_utc": 1674630508,
        "upvote_ratio": 1.0
    },
    {
        "title": "Top 5 Side Hustles and Ways to Make Money Online in 2023",
        "author": "WalyWal",
        "url": "https://www.youtube.com/watch?v=QOSIVd02bNw",
        "text": "",
        "created_utc": 1674626145,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to get rid of an old electronic keyboard",
        "author": "Party-Banana-3",
        "url": "https://www.reddit.com/r/Frugal/comments/10kqs3e/trying_to_get_rid_of_an_old_electronic_keyboard/",
        "text": "[removed]",
        "created_utc": 1674623403,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this dragon fruit gone bad?",
        "author": "waterflood21",
        "url": "https://i.redd.it/m6hfwcqrw5ea1.jpg",
        "text": "",
        "created_utc": 1674622602,
        "upvote_ratio": 1.0
    },
    {
        "title": "Casio PX-150 for 350 HKD",
        "author": "Party-Banana-3",
        "url": "https://www.reddit.com/r/Frugal/comments/10kqdbi/casio_px150_for_350_hkd/",
        "text": "[removed]",
        "created_utc": 1674622062,
        "upvote_ratio": 1.0
    },
    {
        "title": "Casio PX-150 for 350HKD",
        "author": "Party-Banana-3",
        "url": "https://www.reddit.com/r/Frugal/comments/10kqbo7/casio_px150_for_350hkd/",
        "text": "[removed]",
        "created_utc": 1674621905,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pay off debt, or pay for car repairs?",
        "author": "Font_Snob",
        "url": "https://www.reddit.com/r/Frugal/comments/10kq9pt/pay_off_debt_or_pay_for_car_repairs/",
        "text": "Sort-of hypothetical situation. I have a loan with payments of almost $300 a month, and about an $8,000 balance. I also could put about that much into various repairs on our cars.\n\nAssuming a windfall of roughly that balance, what's the more frugal option: pay off the loan and use the $300/mo to chip at the car repairs, or keep making payments, but get the vehicles done all at once?\n\nPaying off the loan would save interest, but doing the car repairs saves on labor. I can't decide.",
        "created_utc": 1674621722,
        "upvote_ratio": 1.0
    },
    {
        "title": "some stars blooms only ag night when everyone is sleep,,,,, What comes 1st in your mind about this?",
        "author": "Previous-Ad294",
        "url": "https://www.reddit.com/r/Frugal/comments/10kplfl/some_stars_blooms_only_ag_night_when_everyone_is/",
        "text": "[removed]",
        "created_utc": 1674619541,
        "upvote_ratio": 1.0
    },
    {
        "title": "Check out your local library for unexpected frugal ideas. We are checking a 3D cake pan from the library to make/decorate a cake together as a Valentine’s Day date",
        "author": "_JosiahBartlet",
        "url": "https://www.reddit.com/r/Frugal/comments/10kouq1/check_out_your_local_library_for_unexpected/",
        "text": "We also did a fun after hours library ghost tour back around Halloween",
        "created_utc": 1674617282,
        "upvote_ratio": 1.0
    },
    {
        "title": "A change of pace",
        "author": "SirDuke740234",
        "url": "https://www.reddit.com/r/Frugal/comments/10kos1f/a_change_of_pace/",
        "text": "[removed]",
        "created_utc": 1674617054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you use expired toothpaste?",
        "author": "NettleLily",
        "url": "https://www.reddit.com/r/Frugal/comments/10knybm/would_you_use_expired_toothpaste/",
        "text": "If so, how expired? A month past? A year? Three years?",
        "created_utc": 1674614622,
        "upvote_ratio": 1.0
    },
    {
        "title": "Minimalism made me materialistic",
        "author": "GentleBrook",
        "url": "https://www.reddit.com/r/Frugal/comments/10knnj3/minimalism_made_me_materialistic/",
        "text": "I used to be incredibly frugal and still am in most ways. I got into minimalism a few years back because I was moving around a lot and honestly, not in a healthy partnership. The combination of these things have contributed to the habit of obsessing over my wardrobe in an attempt to perfect it. I am embarrassed by how materialistic I've become. I go to the thrift store very regularly and am searching eBay most days for the perfect items. I also regularly declutter my wardrobe and donate to the same stores I frequent. I am spending money needlessly but my main concern if the compulsion to shop and search. I understand the whole hedonistic treadmill thing and why I am doing it but how can I stop? I tried to do a No Buy year but that didn't last more than a couple months. I want to reestablish my frugal mindset without feeding my scarcity fears from childhood.",
        "created_utc": 1674613727,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kid friendly snacks",
        "author": "luvdustyallday",
        "url": "https://www.reddit.com/r/Frugal/comments/10knk46/kid_friendly_snacks/",
        "text": "What are some low cost snacks that kids really enjoy? Homemade rice krispy treats and stove popped popcorn are a couple good ones.",
        "created_utc": 1674613455,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just found $890 in unclaimed property through my state's Dept. of Financial Services!",
        "author": "p_taradactyl",
        "url": "https://www.reddit.com/r/Frugal/comments/10kn9dc/just_found_890_in_unclaimed_property_through_my/",
        "text": "[removed]",
        "created_utc": 1674612588,
        "upvote_ratio": 1.0
    },
    {
        "title": "$16.17 in Chicago including fresh salmon, produce and name-brand Cheezits",
        "author": "CaptainPibble",
        "url": "https://i.redd.it/xu8rnuu705ea1.jpg",
        "text": "",
        "created_utc": 1674611654,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm an idiot and dropped some bleach on to the carpet, would synthetic fabric dye fix it?",
        "author": "hawkerdragon",
        "url": "https://www.reddit.com/r/Frugal/comments/10kmrz8/im_an_idiot_and_dropped_some_bleach_on_to_the/",
        "text": "I've been looking into ways to get it fixed by professionals but it would cost so much more than I can afford, and I wouldn't like to leave it as it is since I'm renting (yes, I'm incredibly stupid) and would probably not only lose my deposit but be charged for it.\n\nWould something like Rit dyes for synthetic fabric work? It's a nylon carpet.",
        "created_utc": 1674611212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone have experience with this \"furniture\" or things like it? looking to furnish an apartment in the cheapest way possible without buying total junk",
        "author": "royalduck4488",
        "url": "https://smile.amazon.com/gp/product/B09GKSJ6PH/ref=ewc_pr_img_3?smid=A2308C1XY81Q5M&amp;th=1",
        "text": "",
        "created_utc": 1674610632,
        "upvote_ratio": 1.0
    },
    {
        "title": "My 8 year old down jacket had no loft in the back anymore due to my backpack crushing it, so I added more! Took me less than 10 minutes, $30, and it's nice and warm again.",
        "author": "CzarDestructo",
        "url": "https://www.reddit.com/gallery/10klpxh",
        "text": "",
        "created_utc": 1674608230,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ever buy a product in a weirdly high quality box? Add some spray paint and make a gift box",
        "author": "Ajreil",
        "url": "https://imgur.com/a/4TiMv2Z",
        "text": "",
        "created_utc": 1674606842,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGTP Recipe ideas.",
        "author": "mojoegojoe",
        "url": "https://www.reddit.com/r/Frugal/comments/10kkyik/chatgtp_recipe_ideas/",
        "text": "I've been using ChatGTP as a base for weekday meal recipes that include everything I want/have available for a while. It's been extremely stable for producing quality meals for the majority of people with step by step instructions and additional information reality available when needed. What would you want to see for the future of these resources, especially with regards to frugality and economic efficiency?",
        "created_utc": 1674606086,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thermostat help",
        "author": "mbt9000",
        "url": "https://www.reddit.com/r/Frugal/comments/10kksju/thermostat_help/",
        "text": "I have a Horstmann HRT2 Thermostat and in UK and rent,  however the thermostat clicks on at 25 -27 degrees, is there a way to change this so it clicks on at a lower temp?\n\nI just feel its too high for it to kick in basically and like it to click on around 18 degrees",
        "created_utc": 1674605645,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any SlickDealers here ever seen a ridiculous thread but didn’t have a place to share? Please check out r/SlickDealsDrama for the lighter side of frugal finds.",
        "author": "n3f3libata",
        "url": "https://www.reddit.com/r/SlickDealsDrama/",
        "text": "",
        "created_utc": 1674604534,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just found a new cheap cell phone plan by t-mobile. It is connect by t-mobile and offers unlimited talk&amp;messages plus 1GB data for $10. 3GB for $15. 6GB for $25. 12GB for $35. the internet is fast but when you have used it all it is gone (and not just slowed down) for that billing cycle.",
        "author": "Disastrous_Network46",
        "url": "https://www.reddit.com/r/Frugal/comments/10kjky3/i_just_found_a_new_cheap_cell_phone_plan_by/",
        "text": "I got the 3GB contract for $15 which is suitable for me. Before, I had an AT&amp;T plan for $60, I asked them if they have cheaper offers and they aost got offended because \"how dare me, those $60 are almost gifted\". Never again AT&amp;T. Btw, I am from Europe and for $10-20 you can get unlimited calls/messages and intermet in all EU.",
        "created_utc": 1674602511,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for getting cheaper car insurance?",
        "author": "B0B_RO55",
        "url": "https://www.reddit.com/r/Frugal/comments/10ki6jm/tips_for_getting_cheaper_car_insurance/",
        "text": "I am a 20 year old male with a clean driving record and I pay 300$ a month for a used 2014 Chevy equinox with 150k miles on it. I’ve compared most popular insurance companies and so far progressive has given me the cheapest coverage but 300$ a month is still so much and aside from rent it’s my biggest monthly expense (I only pay 200$ a month on a 36 month lease for the car)",
        "created_utc": 1674599033,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is gardening and canning worth it?",
        "author": "buddhistpine",
        "url": "https://www.reddit.com/r/Frugal/comments/10khwk8/is_gardening_and_canning_worth_it/",
        "text": "I am wondering if gardening and canning/preserving is worth it. One the one hand, I see the appeal to be more self-sufficient and have more control over how items are preserved but I wonder if it is financially worth it. I would need to invest in canning supplies, a dehydrator, etc in order to get started. I make about $70/hour and am some what in control of how many hours I work. Right now I am working 30-35 hours a week. Is it better to pick up more hours and just pay for these items, which seem pretty cheap individually or is canning/preserving worth in financially?",
        "created_utc": 1674598342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Valen-times and frugality",
        "author": "uselessfoster",
        "url": "https://www.reddit.com/r/Frugal/comments/10khub7/valentimes_and_frugality/",
        "text": "So I’ve been with my husband for like 10 years but I still have Valentine’s Day amnesia— I have no idea what our tradition is. \n\nI do know I’m not particular about *the exact day* of Valentines, so I’m going to propose to him (like the first time) that we celebrate the weekend after Valentines because all the candy and whatever will be on sale and not every single restaurant on earth will be booked. Off-peak Valentines. \n\nThe other thing we’re doing this year, that I’m psyched for, is making Valentines gingerbread houses with the kids. I got a ton of mini gingerbread house kits for bargain prices at IKEA and we’re going to decorate with conversation hearts, Twizzler pull and peel, etc. for a treat. \n\nBut I still need advice: aside from the obvious free activity, is there anything special we could do for the day that would be cheap or free? Any ideas for meaningful gifts? Poetry? Unwavering eye contact?",
        "created_utc": 1674598200,
        "upvote_ratio": 1.0
    },
    {
        "title": "USA Tax Season- how to file taxes cheap without a computer?",
        "author": "gobblintrotter",
        "url": "https://www.reddit.com/r/Frugal/comments/10khlsg/usa_tax_season_how_to_file_taxes_cheap_without_a/",
        "text": "Sorry if this is not allowed but I’m not buying a computer just for doing my taxes. For reference I have a pretty simple file (single, few investments, not a homeowner). I usually file through TurboTax online. Last year my laptop crapped out and I don’t find it necessary to buy a new one. So far it’s been fine. Any solutions/ suggestions? Cost and convenience are my two biggest concerns.",
        "created_utc": 1674597650,
        "upvote_ratio": 1.0
    },
    {
        "title": "I never finish my leftovers",
        "author": "kimpsnhoes",
        "url": "https://www.reddit.com/r/Frugal/comments/10kh548/i_never_finish_my_leftovers/",
        "text": "Hey all,\n\nI absolutely love to cook, and love tasting flavors when they are made fresh. However, I almost finish my leftovers as my dishes are rarely as appealing to me when I heat them up. This is a problem for me because it's wasteful, and also gets me to eat out too frequently while I'm trying to cook at home and save money.\n\nAn obvious fix is to simply cook smaller portions, which I will do. However, do y'all have recommendations for meals that make good leftovers that you look forward to eating? Or meals that you can easily make fresh when you want them? Thanks!\n\nEdit: Bonus points if vegetarian!",
        "created_utc": 1674596521,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help With Food For Family",
        "author": "MalcolmDrinksMilk",
        "url": "https://www.reddit.com/r/Frugal/comments/10kglq5/help_with_food_for_family/",
        "text": "Hello guys, my name is Malcolm I’m a college student, security guard worker and take care of my family (sisters and my mom) at home. My mother can’t work as much for disability reasons that I can explain if needed and I usually chip in every week to assist with the food/needs for the household. I just payed off a used car recently for better transportation and my paycheck was delayed because of a glitch in the system. Im wondering if someone can help this week with food or how to get some at least this is my final resort. If you cannot i still thank you for reading. I am currently doing Doordash on the side to get extra funds in but my time isn’t necessarily as open as I’d want it to be due to school. My local food pantry doesn’t open until Monday, I thought about that but wasn’t able to go due to not having someone to take my shift.",
        "created_utc": 1674595222,
        "upvote_ratio": 1.0
    },
    {
        "title": "Assistance Feeding/Providing For Family This Week",
        "author": "MalcolmDrinksMilk",
        "url": "https://www.reddit.com/r/Frugal/comments/10kg1p5/assistance_feedingproviding_for_family_this_week/",
        "text": "(i know I’m not supposed to post here but my account is too new for the appropriate threads and it’s my last resort) Hello guys, my name is Malcolm I’m a college student, security guard worker and take care of my family (sisters and my mom) at home. My mother can’t work as much for disability reasons that I can explain if needed and I usually chip in every week to assist with the food/needs for the household. I just payed off a used car recently for better transportation and my paycheck was delayed because of a glitch in the system. Im wondering if someone can help this week with any amount I’m not good at asking for specifics and this on it’s own is my final resort. I will be able to pay you back instantly by this Friday. If you cannot i still thank you for reading. I am currently doing Doordash on the side to get extra funds in but my time isn’t necessarily as open as I’d want it to be due to school.",
        "created_utc": 1674593886,
        "upvote_ratio": 1.0
    },
    {
        "title": "$10 premium meta haul at Trader Joes, 1 week from expiration sale!!!",
        "author": "CliffordAnth",
        "url": "https://i.redd.it/ietggmbsv1ea1.jpg",
        "text": "",
        "created_utc": 1674591875,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the lowest no data cell plan service",
        "author": "Kingdavid100",
        "url": "https://www.reddit.com/r/Frugal/comments/10kf686/what_is_the_lowest_no_data_cell_plan_service/",
        "text": "With all tax and fees included. I am looking to get my 80+ mom a cell phone and plan. Also I think she can use the most basic phone. Maybe old type Nokia or flip phone. Thank You",
        "created_utc": 1674591784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Purchase used dishwasher vs new Miele",
        "author": "ralphiequinn",
        "url": "https://www.reddit.com/r/Frugal/comments/10kej6d/purchase_used_dishwasher_vs_new_miele/",
        "text": "My dishwasher is 19 years old and still washes great. The problem is that it occasionally leaks water out of the bottom of the door. I have worked on it and it seems to have stopped leaking, but I worry about it causing a flood.\n\nI am considering buying a couple year old used Bosch 100 series for $160 that would probably work great for a long time.\n\nI am also considering buying a Miele that costs $1300 but is supposed to last 20 years.\n\nI own my place and if I move would keep it as a rental. My old dishwasher is a Hotpoint. I feel like if I buy quality it could save me a lot of time and headache, but Bosch is a good brand and could last a very long time as well.\n\nWhat do you guys think?",
        "created_utc": 1674590268,
        "upvote_ratio": 1.0
    },
    {
        "title": "vegetarian cyclist diet plan",
        "author": "Commercial_Peach1475",
        "url": "https://www.reddit.com/r/Frugal/comments/10ke627/vegetarian_cyclist_diet_plan/",
        "text": "[removed]",
        "created_utc": 1674589366,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've been doing what makes me happy for about two years now, I live close to the countryside and I feel more connected to myself when I'm painting or outdoors, I've also recently adopted a minimalist lifestyle :) Good morning",
        "author": "jessicamozzini",
        "url": "https://www.reddit.com/gallery/10kd6ka",
        "text": "",
        "created_utc": 1674586931,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not a big proponent of fast food but you can't beat this price to feed me for a day.",
        "author": "1st_Starving_African",
        "url": "https://i.imgur.com/2C7V7fO.jpg",
        "text": "",
        "created_utc": 1674586465,
        "upvote_ratio": 1.0
    },
    {
        "title": "Soup Kitchens and Food Pantries are the Frugal man’s dream",
        "author": "mazdamurder",
        "url": "https://www.reddit.com/r/Frugal/comments/10kc5p9/soup_kitchens_and_food_pantries_are_the_frugal/",
        "text": "I’m not a particularly frugal person but I like coming to this sub for some tips to save on odds and ends. I have been volunteering somewhat regularly at my local soup kitchen and it is a really good way of saving money and helping the community. I am not suggesting taking food that the needy need to be clear. There are many donations that soup kitchens don’t need or that people there can’t/don’t use. I get a lot of herbs from there because they get like 3 dozen packages of basil/mint/dill that they couldn’t possibly use before it becomes unusable. My soup kitchen can’t use unsliced bread so I can get free baguettes/loaves of unsliced bread. The best ones are ripe avocados that are perfect ripeness for guacamole but too ripe to sell in a grocery store. Same thing for mangoes. Also there are leftover meals that they would otherwise throw away that they will give to volunteers. I can’t recommend volunteering at pantries/soup kitchens enough",
        "created_utc": 1674584487,
        "upvote_ratio": 1.0
    },
    {
        "title": "Canceling or changing subscriptions",
        "author": "Dangerous-Mobile-587",
        "url": "https://www.reddit.com/r/Frugal/comments/10kbv60/canceling_or_changing_subscriptions/",
        "text": "I think SiriusXM has good policy on changing program choices and canceling membership.   What do you think?  Of streaming services who is beat and who is worse.  Also good time to review canceling those subscriptions or at least chance to lower cost programs.",
        "created_utc": 1674583797,
        "upvote_ratio": 1.0
    },
    {
        "title": "the intersection of r/frugal, r/povertyfinance,and r/crappydesign",
        "author": "ObedientToInstinct",
        "url": "https://i.redd.it/y3xzimkmo2ea1.jpg",
        "text": "",
        "created_utc": 1674583563,
        "upvote_ratio": 1.0
    },
    {
        "title": "Simple question for a handyman: bolt keeps falling out.",
        "author": "Kelekona",
        "url": "https://www.reddit.com/r/Frugal/comments/10kbg85/simple_question_for_a_handyman_bolt_keeps_falling/",
        "text": "Asking here because a lot of frugal people know handyman tricks.\n\nI'm using a rolling cart as a desk.  Sorry, I'm having trouble finding a picture that isn't a store or pinterest.  Kensington_Instructions_10624017.pdf  Part three pictured in step three.\n\nThe bolt that holds one of the swinging legs keeps rattling out as I roll it towards me because my chair doesn't roll.  I want to be able to disassemble this in case I have to move it with a car, so is there a glue that's weak enough to be broken when I go to unscrew it?  It takes an allen wrench.  I also have a bit of museum putty or some poster-tac.  I can't get inside of the leg to add a nut.",
        "created_utc": 1674582823,
        "upvote_ratio": 1.0
    },
    {
        "title": "With the way prices on pet supplies are increasing, I’ve had to find ways to save. I started cooking my own dog food. Its much healthier for my dog and only costs about 15&amp;-18$ a month.",
        "author": "bymyenemy",
        "url": "https://www.reddit.com/r/Frugal/comments/10kbftl/with_the_way_prices_on_pet_supplies_are/",
        "text": " Get either beef or chicken liver(~2lbs), either chicken feet or gizzards(~2lbs), ground Turkey, chicken, or Chuck(2lbs). Then frozen peas, carrots(~12oz), broccoli(~32oz), kale(~12oz) and steel cut old fashioned oatmeal(2cups). Then add some turmeric and ground flaxseed(~tablespoons each). I boil the meat until it’s cooked (30mins or so) then add the frozen veggies for a couple minutes. Then drain most of the water out and add the oatmeal. oatmeal, of flaxseed and of turmeric. This should fill up a big pot. Blend it throughly, especially if you used chicken feet. I use one of those long sticks with blades at the end that you can stick in the pot itself to blend everything. Then bag it into freezer bags in portions that last a few days each. Keep the bag you’re using in the fridge and the ones you’re not in the freezer. Cutting a hole in the bag and squeezing it out is easiest toward the end of the bag. Hope this helps someone. I’m open to advice and this recipe is open to liberties. Also included a pic of my pup.",
        "created_utc": 1674582796,
        "upvote_ratio": 1.0
    },
    {
        "title": "You can save money by subscribing directly from a provider, as opposed to going through a market a place Play or App Store.",
        "author": "Maynerd101",
        "url": "https://www.reddit.com/r/Frugal/comments/10kbbeh/you_can_save_money_by_subscribing_directly_from_a/",
        "text": "App Store and Play charge companies a premium to manage transactions through their marketplace. If you go directly to those companies, you can save on monthly or annual fees. Two great examples are Reddit and Audible. Both charge +$1 more a month if you subscribe through Play or App Sotre.",
        "created_utc": 1674582490,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to install a frugality attitude",
        "author": "TheKingeofTheVilla",
        "url": "https://www.reddit.com/r/Frugal/comments/10kb4ou/how_to_install_a_frugality_attitude/",
        "text": "So I’m pretty new to this frugality channel and would like to get some advice on how to shift my spending habits to be more frugal with my finances. I earn enough to save at least half my salary but always end up using more than I earn each month. And it’s mainly on takeaways and nights out with friends. My biggest challenge is my mindset, because I earn more than my friends I always feel pressure to pay for everything and this has caused me to get into some credit card debt (I can easily pay this off with one month’s worth of my salary but there’s always something that needs my money). I’ve tried to read every book on saving and I get into a good habit for a week or two until I flip over to the other side and spend recklessly again. My impulsive buying is the worst and I think this has mainly to do with my credit card. I’d appreciate any advice you guys have for me 🙏🏾",
        "created_utc": 1674582021,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I replace or wait on my tires? Outer tread is below Lincoln’s head but the rest is fine &amp; no metal is showing (vans eat tires, I’m used to that)",
        "author": "PivotalPosture",
        "url": "https://i.redd.it/cl1yt9ksg2ea1.jpg",
        "text": "",
        "created_utc": 1674580908,
        "upvote_ratio": 1.0
    },
    {
        "title": "win a paypal 750$ gift card",
        "author": "abdullah_miraj",
        "url": "https://www.reddit.com/r/Frugal/comments/10kah43/win_a_paypal_750_gift_card/",
        "text": "[removed]",
        "created_utc": 1674580439,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get Google AdSense approval instantly in | 2023 | Everything you need to know",
        "author": "umardigital",
        "url": "https://www.hausaarewa.com/2023/01/how-to-get-google-adsense-approval.html",
        "text": "",
        "created_utc": 1674580152,
        "upvote_ratio": 1.0
    },
    {
        "title": "win paypal gift card now",
        "author": "abdullah_miraj",
        "url": "https://i.redd.it/htgn8q54v0ea1.png",
        "text": "",
        "created_utc": 1674579586,
        "upvote_ratio": 1.0
    },
    {
        "title": "frugal hiking",
        "author": "Marcus_Aurelius13",
        "url": "https://www.reddit.com/r/Frugal/comments/10k9k42/frugal_hiking/",
        "text": "Going on a 4 - 6 mile hike in forest preserve temp is expected to be 26\ndegrees not water or snow will need something to substitute for hiking shoes long johns and thermal gloves ?",
        "created_utc": 1674578110,
        "upvote_ratio": 1.0
    },
    {
        "title": "Active and Fit Direct for real?",
        "author": "Dangerous-Mobile-587",
        "url": "https://www.reddit.com/r/Frugal/comments/10k8whj/active_and_fit_direct_for_real/",
        "text": "I have big questions. I thought using Active and Fit Direct would be a good affordable way to do Gym. 25 dollars a month.  Must enroll for two months initially.  Enrollment fee waived. So far so good. I enrolled. Paid my 50 dollars. And the invoice saids I paid for this month. And next month from Jan 23rd to Feb 23rd.   Seems like I only getting  one month. Not two months.  Seems like they playing games to me. Like all of these gym memberships.",
        "created_utc": 1674576421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Over the past couple of days my fridge freezer has packed in. I got rid of what I needed too, but I luckily had it quite full.",
        "author": "babybuttoneyes",
        "url": "https://www.reddit.com/r/Frugal/comments/10k8va7/over_the_past_couple_of_days_my_fridge_freezer/",
        "text": "Unfortunately though I have about 10 precooked meals in there, including a lasagne and done cooked chicken and vegetables. I also bought four bags of frozen vegetables previously. Such a waste! The precooked meals have started thawing, but not too much, the bought vegetables have defrosted. Is anything salvageable??  I’m gutted that I just filled the freezer. Argh!!",
        "created_utc": 1674576332,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for how to zipper?",
        "author": "MrsZ_CZ",
        "url": "https://i.redd.it/9pd0zfa532ea1.jpg",
        "text": "The handle of the zipper for my winter boots broke off. It's hard to grab, but otherwise works fine. Any suggestions of what I could put on the end of these nubs to make it easier to grab?",
        "created_utc": 1674576318,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cellular port in number deals",
        "author": "guy30000",
        "url": "https://www.reddit.com/r/Frugal/comments/10k80il/cellular_port_in_number_deals/",
        "text": "I know this situation wont happen to most. Some Cellular plan deals require you to port your number to them. This is fine unless you are opening a new line. I found a site that will sell you a number for the  purpose of porting the number out.  \n[https://www.numberbarn.com/](https://www.numberbarn.com/)  \n\n\nI took advantage of a deal on Mint where you get 6 months free for buying a phone and 6 months. I failed to read the fine print that you need to port in a number. I got a number for $7 as well as getting a bit of a selection to choose from.   \nI know I could have run the scam where I set up a new line for free with another carrier and ported the number out immediately thereby canceling it within the trial period but this was for more convenient.",
        "created_utc": 1674574066,
        "upvote_ratio": 1.0
    },
    {
        "title": "Prosciutto",
        "author": "Novasadog",
        "url": "https://www.reddit.com/r/Frugal/comments/10k7a6q/prosciutto/",
        "text": "Has anyone frozen prosciutto with any success?  My grocery store had a few pre-packaged prosciutto marked down to a buck a package,  and I love it, so I bought 4 packages.   I have a vacuum sealer and a deep freezer.   Any advice would be greatly appreciated!",
        "created_utc": 1674572124,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's everyone eating for dinner?",
        "author": "isitreallyserious",
        "url": "https://www.reddit.com/r/Frugal/comments/10k6ylq/whats_everyone_eating_for_dinner/",
        "text": "I'm always on the hunt for new ideas. Last night I had venison meatballs (one deer shot in Nov. processing cost $100, replaces beef almost entirely for 18 mo) with spaghetti squash and steamed veg. \n\nTonight I might eat eggs (from my chicks) and toast but prepare ham &amp; bean soup in the crock for tomorrow.",
        "created_utc": 1674571215,
        "upvote_ratio": 1.0
    },
    {
        "title": "58. Homeless. 5k/month job. No one will rent to me do I decided to live in my truck to save money.",
        "author": "Diligent_Walrus_1527",
        "url": "https://www.reddit.com/r/Frugal/comments/10k6wa7/58_homeless_5kmonth_job_no_one_will_rent_to_me_do/",
        "text": "Hi. I’ve been sleeping in my work truck for almost a year now. I live on east coast of Florida and work as my own boss and go door to door trimming trees. I make 100$ to 300$ per day but sometimes I don’t get jobs. Roughly 5k a month.\n\n&amp;#x200B;\n\nNow I know I could get Airbnb, but the prices are insane. The average for s 1b 1b house is 3k a month Then there’s hotel rooms. Anything below 125$ a night is going to be nasty.\n\n&amp;#x200B;\n\nThe only affordable homes is through yearly leases. Many 2k a month or 1.5k month I could afford but the realtors block me from getting in. They want applications, credit checks, background checks, and first last and security.\n\n&amp;#x200B;\n\nI’ve applied to about 8 or so until I realized they aren’t going to rent to me. The first last and security is a lot of money, but I decided I’d go through with it anyway. The application fees are 50$ each. They always say sorry we’ve picked someone else or tell me my credits below 500.\n\n&amp;#x200B;\n\nSo I’ve just been living in my truck for almost a year now. It’s not that bad. But I can understand why there is such a big homeless crisis in the USA now. Even if they somehow can get jobs there’s no way they can afford decent living quarters like you could in the past. People use to rent same day and let me move in on first months rent.\n\n&amp;#x200B;\n\nAnyway I’ve saved like 50k in the bank. I’m planning on buying a house soon.",
        "created_utc": 1674571034,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal shipping ideas?",
        "author": "Sarah_the_Geek",
        "url": "https://www.reddit.com/r/Frugal/comments/10k6ikz/frugal_shipping_ideas/",
        "text": "I have about 8-10 medium/large boxes and at least one large (3x4’) piece of art that I would like to ship across the country. What would be the most economical way to get them there if time isn’t a factor?",
        "created_utc": 1674569950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cheap and safe option as -sexual- lubricant",
        "author": "ziyakagac",
        "url": "https://www.reddit.com/r/Frugal/comments/10k5uxg/cheap_and_safe_option_as_sexual_lubricant/",
        "text": "Lubricants for sex costs money somewhere around $50-100 per liter. It may have extra viscosity, different odours and it may be taste better. \n\nOf course as a cheap and natural alternative you can use natural oils but they would stain, usually smells not good and would absolutely destroy most latex based condoms and probably temper the pH of vagina.   \n\n\nAs an alternative you can but ultrasound gel which costs around $5-10 per liter. Water based, OK for condoms, skin safe, odorless, tasteless, probably with good viscosity and since gynecologists use it for intravaginal USG,  Vagina safe. It is easy to obtain and usually can be found in small quantities.",
        "created_utc": 1674568047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is It True That Twinkies Don’t Expire?",
        "author": "Maxcactus",
        "url": "https://www.lifesavvy.com/159375/is-it-true-that-twinkies-dont-expire/",
        "text": "",
        "created_utc": 1674566025,
        "upvote_ratio": 1.0
    },
    {
        "title": "Top 10 Only in Ohio 💀💀💀",
        "author": "badworkforever",
        "url": "https://youtu.be/iiuMQ1nZqdA",
        "text": "",
        "created_utc": 1674565159,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pluralistic: Eggflation is just more price-gouging (23 Jan 2023)",
        "author": "Maxcactus",
        "url": "https://pluralistic.net/2023/01/23/cant-make-an-omelet/",
        "text": "",
        "created_utc": 1674564872,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unidays",
        "author": "payberr",
        "url": "/user/payberr/comments/10k1270/unidays/",
        "text": "",
        "created_utc": 1674550045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Made my own cat house.",
        "author": "sylphedes",
        "url": "https://i.redd.it/gco0yyb0qzda1.jpg",
        "text": "",
        "created_utc": 1674547687,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your Televisions Brightness set at? I had no idea I could save money while I watch Television. Thoughts?",
        "author": "Busy_B_Being_Me",
        "url": "https://moralfibres.co.uk/turn-down-tv-brightness-save-energy/",
        "text": "",
        "created_utc": 1674543086,
        "upvote_ratio": 1.0
    },
    {
        "title": "Depreciation Inside vs Outside MercBenz GLA 2022 250 4matic",
        "author": "NinktatNY",
        "url": "https://www.reddit.com/r/Frugal/comments/10jx45a/depreciation_inside_vs_outside_mercbenz_gla_2022/",
        "text": "\nMercBenz 2022 GLA 250 4matic Outside or inside parking worth it?\n\nWould saving $3600/year + tax by parking outside overnight instead of a garage outweigh the depreciation in your opinions? (Staten Island New York climate)\n\n—\nExtra Details:\n\nNew apartment I’m moving too has heated individual house style garages for rent but they’re a little bit of a walk from the apartment. $300/month\n\nCurrent one I’m leaving has an underground garage below the building (unheated and a little cold) $175/month\nElevator ride down and I’m at my car\n\nHappy with current parking but not an option at new place.\n\nreally don’t want to walk to the car but the next best option is street parking and I don’t want to cause unnecessary deprecation. \n\nYearly parking at new place with heated garage would be $3600 plus tax vs street parking outside for free.\n\nI know garage is always better - but does it matter that much if I plan to sell in a few years? Really hate the walk but don’t want to kill the car value. If it was 300 right downstairs I’d happily pay it but it’s not. It’s at least a minute and a half to 2 minute walk and when weathers bad that’s not exactly ideal. (Call me lazy I guess lol)",
        "created_utc": 1674534587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Titan vehicle Automobile Cable Tire Snow Chains Stock #1042 green storage bag",
        "author": "adviseanyone",
        "url": "https://www.ebay.com/itm/285108204824?mkcid=16&amp;mkevt=1&amp;mkrid=711-127632-2357-0&amp;ssspo=ee9HnTZcRae&amp;sssrc=2047675&amp;ssuid=ee9HnTZcRae&amp;widget_ver=artemis&amp;media=REDDIT",
        "text": "",
        "created_utc": 1674531936,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to circulate heat through your house when you have a fireplace or woodburning stove",
        "author": "Futureacct",
        "url": "https://www.reddit.com/r/Frugal/comments/10jw8ia/how_to_circulate_heat_through_your_house_when_you/",
        "text": "I just learned this today. I have a woodburning stove in my living room. The bedrooms don’t get any heat from it. So I turned on the fan to my heater/ac system (but the heat isn’t on) and it’s circulating the heat from the Wood stove room to the bedrooms.",
        "created_utc": 1674531702,
        "upvote_ratio": 1.0
    },
    {
        "title": "Use air cushion from shipping boxes to renew your flattened bean bag chair",
        "author": "Sad_Finish9031",
        "url": "https://www.reddit.com/r/Frugal/comments/10jw6wz/use_air_cushion_from_shipping_boxes_to_renew_your/",
        "text": "[removed]",
        "created_utc": 1674531561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Decided to stop by Ross on the way home from work (carhartt,under armor and chaps pants) $5!",
        "author": "ohsoErik",
        "url": "https://i.redd.it/zuw8usoqdyda1.jpg",
        "text": "",
        "created_utc": 1674531455,
        "upvote_ratio": 1.0
    },
    {
        "title": "I FORKING LOVE ALDI!",
        "author": "ilikeover9000turtles",
        "url": "https://www.reddit.com/r/Frugal/comments/10jvvbj/i_forking_love_aldi/",
        "text": "[removed]",
        "created_utc": 1674530558,
        "upvote_ratio": 1.0
    },
    {
        "title": "This chart shows the average retirement age in every state and the savings needed for a comfortable retirement.",
        "author": "AngelaLambert",
        "url": "https://i.imgur.com/a3JxWrF.png",
        "text": "",
        "created_utc": 1674528523,
        "upvote_ratio": 1.0
    },
    {
        "title": "You can use air cushions (from shipping boxes) to renew bean bag chairs that got flat",
        "author": "Sad_Finish9031",
        "url": "https://i.redd.it/d51ddaxa2yda1.jpg",
        "text": "",
        "created_utc": 1674527606,
        "upvote_ratio": 1.0
    },
    {
        "title": "I ate dinner for $1.20 at the CHEAPEST Restaurant! - (Mocoa, COLOMBIA)",
        "author": "thestinger8",
        "url": "https://youtube.com/watch?v=9kfSNGTLcQ0&amp;feature=share",
        "text": "",
        "created_utc": 1674525000,
        "upvote_ratio": 1.0
    },
    {
        "title": "I accidentally ate super expired corn tortillas. Do you eat food past expiration?",
        "author": "brookebunny",
        "url": "https://www.reddit.com/r/Frugal/comments/10jtqk9/i_accidentally_ate_super_expired_corn_tortillas/",
        "text": "Unknowingly just ate corn tortillas that expired in August. So like 6 months ago. They were store bought and stored alone in a drawer. I cut them up and threw them in the air fryer to make chips. No mold. Tasted completely normal. Not stale or anything. Noticed after the fact that the “best buy” date was august 14th. Anyone here eat stuff past expiration?",
        "created_utc": 1674524135,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paid $9k (12% interest loan) for a brand new Eco HVAC system to get higher bills?",
        "author": "stingerspure",
        "url": "https://www.reddit.com/r/Frugal/comments/10jtfl5/paid_9k_12_interest_loan_for_a_brand_new_eco_hvac/",
        "text": "Bought a house in late 2020, HVAC (furnace + outside AC unit) were 20ish years old. Talked to X company who is one of the big guys and they sold me a inside/outside unit that was $9k and the Home Depot loan is 12% interest. Eco energy system thingy to save me $ per month by using less energy and be more efficient and all that.\n\nI just got my highest energy bill, we're using a smidge less energy than this time last year, but we're paying more, not quite sure how that all work. What are your thoughts?\n\n&amp;#x200B;\n\nhttps://preview.redd.it/hkwv1osn7wda1.png?width=809&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=95384ff32e1273c66c0e42649994f9981c117997\n\nhttps://preview.redd.it/5qwzsyep7wda1.png?width=826&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=a1a4ee03586d474bccbe9afa8a01215b0d64bad6\n\nhttps://preview.redd.it/u2owym6q7wda1.png?width=816&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=3c9265f57556eb9a63d228507a95cdd480f3c859",
        "created_utc": 1674523235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shipping a car from Los Angeles to Portland (1000 miles)",
        "author": "phosphor-feel",
        "url": "https://www.reddit.com/r/Frugal/comments/10jsy3u/shipping_a_car_from_los_angeles_to_portland_1000/",
        "text": "Hey all, I'm wondering what companies would be reliable for shipping my sedan from Los Angeles to Portland? Also something that's in my budget.   \n\n\nI looked at UShip... Montway auto transport stood out to me price wise. Their reviews are a bit confusing though (bad and good?). A local oregon company offered me the same rate as Montway. This company was recommended by a family friend that never had a problem using their services. Been around for 20 years, but not much reputation/review in this local option though (small town company).   \n\n\nany recommendations on good and trust-worthy shipping companies would be amazing. I have 1-2 weeks to figure this out and get it shipped.",
        "created_utc": 1674521887,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t waste any of your chicken!",
        "author": "Onehundredyearsold",
        "url": "https://www.reddit.com/r/Frugal/comments/10js5uk/dont_waste_any_of_your_chicken/",
        "text": "Seems like a LOT of fat and skin is included when buying chicken. Don’t waste it! I cut it off and save it then render it down into schmaltz. Schmaltz is easy to make, has many uses and is delicious! You also get the bonus of gribenes. Crispy brown chicken cracklings. Schmaltz is better tasting than expensive cooking oils and you didn’t pay extra for your liquid gold. Don’t forget to save the bones in the freezer for stock.\n\nTo make schmaltz put 1 cup of water in about 3 pounds of fat and skin and slowly render until the water evaporates and skin begins to brown. Some people like to put onion with it. I like mine plain. When the skins are crispy pour oil through a sieve, let cool and store in refrigerator. For more detailed instructions it is easy to Google how to make schmaltz.",
        "created_utc": 1674519640,
        "upvote_ratio": 1.0
    },
    {
        "title": "AARP suggests that you eat second hand food",
        "author": "NoraaYat007",
        "url": "https://i.redd.it/3i3oxj8mdxda1.jpg",
        "text": "",
        "created_utc": 1674519309,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fixed income meal plan",
        "author": "Trick-Regret-493",
        "url": "https://www.reddit.com/r/Frugal/comments/10jrzwb/fixed_income_meal_plan/",
        "text": "I’m new here and also partially sighted on a fixed income. \n\nI’m looking for a meal plan that will let me have variety and high protein and vitamins. \n\nI love routines, so ideally I can eat the same thing on each day of the week.  \n\nI’m big big on convenience and hate spending more time cooking than eating. \n\nI have no food allergies and ideally can eat healthier than my canned soup regimen. \n\nThanks for the help!",
        "created_utc": 1674519182,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t waste any of the chicken you’re paying for.",
        "author": "Onehundredyearsold",
        "url": "https://www.reddit.com/r/Frugal/comments/10jru77/dont_waste_any_of_the_chicken_youre_paying_for/",
        "text": "Seems like a LOT of fat and skin is included when buying chicken. Don’t waste it! I cut it off and save it then render it down into schmaltz. [Schmaltz]( https://www.thespruceeats.com/rendered-chicken-fat-schmaltz-1327884 ) is easy to make, has many uses and is delicious! You also get the bonus of gribenes. Crispy brown chicken cracklings. Schmaltz is better tasting than expensive cooking oils and you didn’t pay extra for your liquid gold. Don’t forget to save the bones in the freezer for stock.",
        "created_utc": 1674518744,
        "upvote_ratio": 1.0
    },
    {
        "title": "what to sell?",
        "author": "Fragrant-Dirt-1597",
        "url": "https://www.reddit.com/r/Frugal/comments/10jrsa9/what_to_sell/",
        "text": "I'm looking to make some extra money! I have a babysitting poster floating around facebook &amp; I want to sell old clothes, shoes, etc. I'm trying to come up with other things I could sell, whether its (old but nice) stuff around the house, crafts, etc. All ideas are welcome! 🤗",
        "created_utc": 1674518594,
        "upvote_ratio": 1.0
    },
    {
        "title": "Expense sharing hack",
        "author": "michelledearxox",
        "url": "https://www.reddit.com/r/Frugal/comments/10jrb2t/expense_sharing_hack/",
        "text": "[removed]",
        "created_utc": 1674517344,
        "upvote_ratio": 1.0
    },
    {
        "title": "What could go wrong? Unlimited borrowing...",
        "author": "RealWSBChairman",
        "url": "https://i.redd.it/1whapsqvgvda1.png",
        "text": "",
        "created_utc": 1674514477,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is an alternative to living alone but within a community?",
        "author": "Diogeneselcinico42",
        "url": "https://www.reddit.com/r/Frugal/comments/10jq1g9/what_is_an_alternative_to_living_alone_but_within/",
        "text": "A 30-something European male. I would like to live alone in my own private room, but at the same time in a building with a dining room or common areas for socializing. That is to say, like a university residence, but for adults. Would it be a hostel for young people? What do you think?\n\nPreferably without spending a lot of money. Say ideas even if they are crazy...\n\nThank you in advance!",
        "created_utc": 1674514163,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ordering Contacts",
        "author": "mrhandbook",
        "url": "https://www.reddit.com/r/Frugal/comments/10jph31/ordering_contacts/",
        "text": "Has any one had any luck ordering Contacts without a prescription in the USA this year? So far the usual places will no longer ship to the US. \n\nI just moved and my state doesn't allow online eye exams and my prescription hasn't changed in 10 years. And I don't really want to pay yet another \"fitting fee\" when I already know what fits.\n\nThanks.",
        "created_utc": 1674512744,
        "upvote_ratio": 1.0
    },
    {
        "title": "And y’all thought $9 for cauliflower was outrageous",
        "author": "HigherThanEverest-",
        "url": "https://i.redd.it/frebf69jswda1.jpg",
        "text": "",
        "created_utc": 1674512219,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cheap savory breakfast/ lunch idea",
        "author": "plantluvrthrowaway",
        "url": "https://www.reddit.com/r/Frugal/comments/10jokpe/cheap_savory_breakfast_lunch_idea/",
        "text": "Make a bowl of grits, add a spoonful of miso paste, 1 tsp butter, top with green onion or kimchi and an egg if you’re fancy. Takes like 5 minutes to make and is cheap and filling.",
        "created_utc": 1674510582,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meal Plan Monday!",
        "author": "Old_Awareness8720",
        "url": "https://www.reddit.com/r/Frugal/comments/10jml8f/meal_plan_monday/",
        "text": "\nWhat's on your menu this week?",
        "created_utc": 1674505772,
        "upvote_ratio": 1.0
    },
    {
        "title": "Goodwill jackpot!",
        "author": "freedomtard",
        "url": "https://i.redd.it/bsm6b4782wda1.jpg",
        "text": "I guess this is just a brag because I'm STOKED about this find! I live in WA and it's always wet. I scored this essentially brand new jacket for $10 at my local goodwill, this thing probably retails for atleast $150 knowing the brand. \n\nWhat are your best finds?",
        "created_utc": 1674503369,
        "upvote_ratio": 1.0
    },
    {
        "title": "cleaning a Mattress with blood and food stains?",
        "author": "CareBearReborn",
        "url": "https://www.reddit.com/r/Frugal/comments/10jkpfu/cleaning_a_mattress_with_blood_and_food_stains/",
        "text": "I live lik3 a slob eating in my bed and I'm a woman who has heavy peroids...accidents happen...\nWhat's a frugal way to clean a mattress?",
        "created_utc": 1674501200,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sanitizing used furniture easily?",
        "author": "KpcAu",
        "url": "https://www.reddit.com/r/Frugal/comments/10jkjck/sanitizing_used_furniture_easily/",
        "text": "Hi. Sorry if this is not the right place for this post. I figure it's OK here because it's about reusing stuff. Let me know if there's a better place for it. \n\nI got a used piece of furniture. It's wood with fabric attached, no stuffing but the fabric covering it is sort of shaggy/long fibers. I am concerned about fleas or bedbugs. I have not seen any of them but I'm not 100% sure I would be able to.\n\nHow can I make sure it's free of these things? It has already gone thru freezing temps a few times outside in the driveway while I figure out what to do with it. If that's relevant to killing potential bugs.\n\nThanks.",
        "created_utc": 1674500792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cadbury misshapes — All fudge FML",
        "author": "AEJTOS",
        "url": "https://i.redd.it/u8jmra0itvda1.jpg",
        "text": "",
        "created_utc": 1674500437,
        "upvote_ratio": 1.0
    }
]