[
    {
        "title": "Mens Titanium Rings",
        "author": "Fluffy_Height363",
        "url": "https://www.reddit.com/r/Frugal/comments/10fd2fi/mens_titanium_rings/",
        "text": "Hey I want to get a titanium ring that is just a solid band. I am looking for reputable places to get rings that will hold their value and are not made poorly. I also do not want to spend much over $200 if possible. I am also new to jewelry so if there are no good companies that would be useful to know as well, Thanks!",
        "created_utc": 1674062708,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tools for Affiliate Marketing below. Escape the Matrix kings",
        "author": "Affiliates2023",
        "url": "https://linktr.ee/affiliates2023",
        "text": "",
        "created_utc": 1674061566,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal domain registration, email and basic hosting?",
        "author": "RosemaryBiscuit",
        "url": "https://www.reddit.com/r/Frugal/comments/10fbeqx/frugal_domain_registration_email_and_basic_hosting/",
        "text": "I've owned my own domain for 25 years and hosted first at a small local server. When they blew away their DNS trying to prepare for Y2K I moved to GoDaddy. Their business has changed a lot in the past 23 years, and now thay they want me to pay for email service, $24 this year but $75 to renew. \n\nI need a new *frugal* solution. \n\nEverywhere I look they have promos that are cheap now but expensive next year. \"Free\" services don't have all features. For example InfinityFree doesn't include email to \"mydomain.com\" but will sell it to you. Google Workspace wants $3/month per email address. What do my frugal friends here recommend?\n\nLooking for\n1) domain registration  (my last ten-year registration expires April)\n2) multiple email accounts using my domain name\n3) hosting for a simple one-page biography with links, nothing fancy or scripted. This could be a forward to a free blog.\n\nThanks!",
        "created_utc": 1674058844,
        "upvote_ratio": 1.0
    },
    {
        "title": "Community Updates &amp; Rule Changes",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/Frugal/comments/10fb7in/community_updates_rule_changes/",
        "text": "Hi everybody,\n\nThe mod team has been busy making some updates and changes to improve the content standards of the community and to help keep conversations on-topic. The purpose of this post is to help explain the rule changes we have recently implemented. If you have any questions or concerns, please comment below.\n\n# TLDR:\n\n· Modifications to the hauls and finds rule. Hauls and finds will now be allowed in the main feed on Fridays as part of Frugal Finds Fridays.\n\n· Modification to the commercial link rule; restricting fly-by shopping requests. “What is the best/cheapest product?”.\n\n· New political rule to help keep conversations civil and on-topic.\n\n&amp;#x200B;\n\n# So what’s new?\n\n# Hauls and Finds\n\nOur rule involving hauls and finds has been amended to allow hauls or finds to be included in the main feed if they can be easily replicated by readers or if they contain a widely beneficial tip/discussion point. This will help clarify some of the ambiguity we have previously experienced with this rule without limiting certain types of content which create meaningful discussion. For all other hauls and finds, they should either be reserved for the megathread or can be posted in the main feed on Fridays as part of a new program, Frugal Finds Friday.\n\n**Full rule text:**\n\n&gt;To post your haul or find outside the megathread or on a day other than Friday, the content or topic of your haul post must either provide a widely beneficial tip/discussion point or be easy for others to replicate. [r/Frugal](https://www.reddit.com/r/Frugal) is an international community that is made up of individuals coming from a wide range of lifestyles, geographic locations, and financial situations. Any hauls posted outside the megathread/Fridays should ideally be relevant to as many people as possible. Singular, one time individual hauls or finds should always be reserved for the megathread/FFF. Posts which should usually be reserved for the megathread include:  \n&gt;  \n&gt;\\- Grocery/food hauls  \n&gt;  \n&gt;\\- Thrift/coupon hauls  \n&gt;  \n&gt;\\- Roadside finds, salvaged goods, or other “one-off” hauls.  \n&gt;  \n&gt;\\- Deals limited to your local area\n\n&amp;#x200B;\n\n# Commercial Links\n\nThis rule has been slightly amended to also encompass certain types of low-quality and low effort posts we have observed which seek tips or shopping advice on a specific product to purchase. It is important to note that this change *will not* restrict posts seeking alternatives, DIY solutions, or other conversations which may be discussing a specific product but are still relevant. We are simply looking to avoid the “I need a product, give me a commercial link” posts.\n\n**Full rule text:**\n\n&gt;[r/Frugal](https://www.reddit.com/r/Frugal) is intended as a place for discourse or advice and attempts to be a commercial-free zone. Please refrain from:  \n&gt;  \n&gt;\\- Linking to commercial sites, defined as a site which sells products/services through a cart, subscription, or booking appointments/trips. Talking about a site or product is fine, just don't link to it.  \n&gt;  \n&gt;\\- Requesting product suggestions such as the \"cheapest\" or \"best\" product. Posts which generate meaningful discussion are fine but \"fly-by\" shopping requests will be removed.\n\n&amp;#x200B;\n\n# Political &amp; Social Issues\n\nSimply put, r/Frugal is meant as a positive, helpful, and inclusive community. However, we understand that political conversations can be necessary given that politics can have a significant impact on a Frugal lifestyle. While the full text of this rule may seem big and scary, it is ultimately broken down into two parts.\n\n1. Off-topic political content\n2. Hostile comments or attacks\n\n&amp;#x200B;\n\n**Section 1.**\n\nWe are not restricting any specific topic for discussion under this rule. However, please do not post any political content which would be considered off-topic in a given situation. For example, arguing about COVID-19 vaccines or the president’s latest hairstyle on a post about egg prices would be considered off-topic.\n\n**Section 2.**\n\nThis section is divided into three subsections. Please keep in mind that Rule 1 still applies to political content.\n\n1. Attacking, bashing, circle-jerking, or otherwise poop-talking any sort of political figure, opinion, political party, ideology, demographic, protected class, etc. r/Frugal is a diverse community and we are dedicated to keeping this space safe and inclusive. If your comment is disparaging or bashing any particular politician or group, there is a very high chance there are people in the community who fall under that identifying demographic (or support that specific politician). If your comment would be considered a personal attack when the describing noun is replaced with a username, it will be considered a violation and will be treated similar to how civility issues are treated under Rule 1. Please respect other opinions, even if you disagree with them. We ask that you keep political conversations centered on policy, not persons or politics.\n2. Blaming an issue on one of the groups mentioned above. This *does not* restrict meaningful conversation about policy, we are simply looking to avoid low-effort partisan circle-jerking. Similarly, broad generalizations would fall under this section of the rule. Examples of this section include comments such as “All of \\[insert political ideology\\] are bad” or “You can thank President AutoModerator for dinosaur juice prices”. You are welcome to discuss how a specific policy passed or supported by X politician made an impact on your frugal lifestyle, but tone and content matters. Something like “President AutoModerator caused dinosaur juice prices to skyrocket because they passed a law that required the dinosaurs to receive vacation time and the weekends off” would be considered substantial and tonally civil enough to be allowed.\n3. Finally, we ask that you refrain from promoting personal or political agendas in an unconstructive or intolerant manner. For example, a post such as “ew gross, no one should eat meat anyways, go vegan” would fall under this rule. A post like “Going vegan is better because tofu is a significantly cheaper source of protein over beef” is fine.\n\n**Full rule text:**\n\n&gt;While meaningful contributions to r/Frugal are encouraged, certain types of political posts are prohibited. Please do not post political content, debates or discussion which are off-topic or not relevant to frugality. Political contributions should be limited to focus on policy, not persons or politics. To keep conversations constructive, postings involving opinions, political affiliations, demographics, protected class, or ethos (character, status, authority) should either be limited to personal, relevant experiences in a given topic and/or tonally civil discussions which are on-topic. Such comments should focus on how the topic being discussed pertains to you, not how you perceive other people’s opinions or motives on the issue. Contributions which disparage or make broad generalizations about the demographics, motives, opinions, political affiliations, or perspectives of other people will be removed (even if not targeted directly towards another user). If a political conversation has reached this point, it is no longer about discussing frugality and is usually off-topic.  \n&gt;  \n&gt;Furthermore, all political contributions should be kept civil and compliant with Rules 1 and 11. Please refrain from:  \n&gt;  \n&gt;\\- Attacking or bashing political figures, parties, or ideologies. There are other subreddits to engage in these types of discussions. We want r/Frugal to remain a collaborative and constructive place for all.  \n&gt;  \n&gt;\\- Blaming a specific issue on one of these “classes”. This ties in with the point above. Meaningful, on-topic discussion of how a specific policy or decision has made an impact is fine, but please refrain from making broad generalizations or off-topic comments.  \n&gt;  \n&gt;\\- Attacking other users for their perspectives or opinions. Different people have different opinions. Discussion of relevant issues is fine, personal attacks are not.  \n&gt;  \n&gt;\\- Discussing, debating, or pushing social issues which are off-topic.  \n&gt;  \n&gt;\\- Promoting political or personal agendas unconstructively or intolerantly. Again, constructive criticism or suggestions are fine but incivility and gatekeeping is not.",
        "created_utc": 1674058368,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to choose a good used car",
        "author": "Sufficient_Union_779",
        "url": "https://www.reddit.com/r/Frugal/comments/10farwk/how_to_choose_a_good_used_car/",
        "text": "Hello! \nI’m in the process of buying my first car. I don’t want to take up any loans and have approx 8-10k to do so.\nSince I will be buying a used car I wanted your opinions on what are the indicators for a good used car  that will last me 5-10 years and one that won’t be in the mechanic shop every other week costing me more than the original price! \nThank you",
        "created_utc": 1674057366,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips on how to use paper that's been printed on on both sides?",
        "author": "Codaline11",
        "url": "https://www.reddit.com/r/Frugal/comments/10fan7z/any_tips_on_how_to_use_paper_thats_been_printed/",
        "text": "&amp;#x200B;\n\n[This is just from last year.](https://preview.redd.it/5x7m4tijptca1.jpg?width=1536&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=8c2f2489eb457be56542db3a061566aeeef5cf3b)",
        "created_utc": 1674057053,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have to print a lot for my studies and most of it goes to waste after my exams. I try to use it as wrapping paper, and the ones that I didn't print on both sides I use as scrap paper. But I still have so much left over. Any ideas what I can do with it? I really don't like paper waste.",
        "author": "Codaline11",
        "url": "https://www.reddit.com/r/Frugal/comments/10fakub/i_have_to_print_a_lot_for_my_studies_and_most_of/",
        "text": "[removed]",
        "created_utc": 1674056893,
        "upvote_ratio": 1.0
    },
    {
        "title": "Amazon saved for later price change notifications gone?",
        "author": "dildobagginss",
        "url": "https://www.reddit.com/r/Frugal/comments/10fajj1/amazon_saved_for_later_price_change_notifications/",
        "text": "Hi, I add a lot of stuff on Amazon to my \"Saved for Later\" cart, in case I want to buy it in the future, or use it to get the $25 free shipping minimum.  I used to get notifications of price changes at top of page when something changed in price.  Did this go away for everyone?",
        "created_utc": 1674056804,
        "upvote_ratio": 1.0
    },
    {
        "title": "New to the united states",
        "author": "suckmyluckagain",
        "url": "https://www.reddit.com/r/Frugal/comments/10factu/new_to_the_united_states/",
        "text": "I'm a student on a F1 visa and am living in Las Vegas. My rent and utilities should be around ~550. This sub pops around in my feed once in a while but now I think I really need advice on how to live by frugally. I don't have a car as well so please guide me.\n\nAdditional question: I've been getting this promo for hellofresh constantly here in reddit. 22 meals free. Like is that considered good and can I use that?",
        "created_utc": 1674056347,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best credit card to earn points that can be used for anything of my choice vs. just certain categories that I have to choose from?",
        "author": "Not2daydear",
        "url": "https://www.reddit.com/r/Frugal/comments/10f9wk7/best_credit_card_to_earn_points_that_can_be_used/",
        "text": "I am going to consolidate all of my payments that I make monthly onto auto pay directed to one credit card. What would be the best card that fulfills the needs posted in the title?",
        "created_utc": 1674055214,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you're going to college, look into other options",
        "author": "budgetwife",
        "url": "https://www.reddit.com/r/Frugal/comments/10f9sbi/if_youre_going_to_college_look_into_other_options/",
        "text": "I'm getting a BS in business admin at SNHU. I follow r/SNHU and the program Sophia was mentioned frequently. I saw it and thought maybe I'd look into it. I'm kicking myself wishing I would have sooner. I have 3 classes left that will transfer. I have a good chunk of my degree I could have taken and saved so much money. If you want to look into it, the website is Sophia.org. I'm not sure about any other schools. If this program doesn't work, maybe check to see if there's any talk of something similar in your school's reddit. I paid $300 for 4 months and I'll save about $3k including textbooks. I spent 2 hours on it last night I'm 25% done with my first course.",
        "created_utc": 1674054919,
        "upvote_ratio": 1.0
    },
    {
        "title": "At some point it gets entertaining seeing how long I can keep this going",
        "author": "BleetingGoatman",
        "url": "https://i.redd.it/grywhnmogtca1.jpg",
        "text": "",
        "created_utc": 1674054087,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal ways to stop escape of heat from sliding glass?",
        "author": "crispycrown",
        "url": "https://www.reddit.com/r/Frugal/comments/10f9fpl/frugal_ways_to_stop_escape_of_heat_from_sliding/",
        "text": "I have old sliding glass doors where you can feel the cold even getting close. Unfortunately replacement is too expensive right now. Does anyone have a good frugal recommendation on how I can mitigate heat loss on them?",
        "created_utc": 1674054071,
        "upvote_ratio": 1.0
    },
    {
        "title": "I know not everyone is able to do this, but me and some classmates have teamed up to split big costco items. All of us have little storage space but want the Costco savings so this has worked out great!",
        "author": "maki269",
        "url": "https://i.redd.it/q5qu5b9ttuca1.jpg",
        "text": "",
        "created_utc": 1674052582,
        "upvote_ratio": 1.0
    },
    {
        "title": "buying police impound auction car tips?",
        "author": "B0-Dh1",
        "url": "https://www.reddit.com/r/Frugal/comments/10f839l/buying_police_impound_auction_car_tips/",
        "text": "On a tight budget and need a car which can go all the way for maybe 3 years. Thinking of getting an police auction car but looking for tips.\n\nCar will be used mainly for a side hustle like uber eats max 15 hours a week otherwise I'll be using public transport and should be going back to school to become a heavy machinery mechanic.\n\nI know to look for KM and am expecting damaged goods but I just hope that she will make it for a while.\n\nThanks for any tips/advice.",
        "created_utc": 1674050465,
        "upvote_ratio": 1.0
    },
    {
        "title": "LEARN EVERYTHİNG FOR LİFE",
        "author": "Artistic_Tourist_441",
        "url": "https://nihat3442.blogspot.com/2023/01/tropism-and-nasti-movements-in-plants.html",
        "text": "",
        "created_utc": 1674048663,
        "upvote_ratio": 1.0
    },
    {
        "title": "$200 savings, which bank should I use?",
        "author": "Relevant_Detective21",
        "url": "https://www.reddit.com/r/Frugal/comments/10ezfxs/200_savings_which_bank_should_i_use/",
        "text": "Hi! I recently started a gofund me because I lost majority of my money to my mom (I got kicked out) and I managed to raise $210!! I’m looking for a bank in Virginia, USA that’s secure and has good interest rates without any complicated requirements. I have Apple Federal Credit Union which isn’t too bad but gofund me won’t allow me to use that bank. I also have a Cashapp debit card and a chime card but gofund me wont allow those either. This is honestly harder than I thought considering I’m 19 and have never owned a credit card. But I’d really appreciate any help!! Thank you!",
        "created_utc": 1674020627,
        "upvote_ratio": 1.0
    },
    {
        "title": "I especially like applesauce or banana pancakes!",
        "author": "mehtorite",
        "url": "https://i.redd.it/uolq2x4h0qca1.jpg",
        "text": "",
        "created_utc": 1674020552,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paypal 3.50% apr savings",
        "author": "unemployed222",
        "url": "https://www.reddit.com/r/Frugal/comments/10exrr3/paypal_350_apr_savings/",
        "text": "Anyone tried it yet? Any catch",
        "created_utc": 1674015550,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is him changing all these sus?",
        "author": "HumblyEgotistical",
        "url": "https://i.redd.it/mfbift9rqrca1.jpg",
        "text": "",
        "created_utc": 1674015256,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mail ordered food",
        "author": "killaclown",
        "url": "https://www.reddit.com/r/Frugal/comments/10ew1ce/mail_ordered_food/",
        "text": "My roommate and I are wanting to get the healthiest and least expensive \"mailed to you\" food.\n\n&amp;#x200B;\n\nHas this been posted in here before of reviews?",
        "created_utc": 1674010678,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rubber bands instead of bag clips?",
        "author": "gdubz_39",
        "url": "https://www.reddit.com/r/Frugal/comments/10ev56r/rubber_bands_instead_of_bag_clips/",
        "text": "Just a thought rather than something I’ve tried. Wouldn’t buying a bunch of rubber bands and keeping them to seal up bags be way cheaper than bag clips? Just thinking about it, the rubber bands will also last for life and they are way cheaper. Maybe something like this has been posted before but I just wanted some thoughts and possibly help out some people.",
        "created_utc": 1674008187,
        "upvote_ratio": 0.99
    },
    {
        "title": "My local butcher’s Facebook post. Grocery store Delmonico is usually 25 a lb. Good deals here right??",
        "author": "trickytreats",
        "url": "https://i.redd.it/vxb30ih34rca1.jpg",
        "text": "",
        "created_utc": 1674007612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cashback Website For Tracking Best Cashback Method?",
        "author": "TisforTony",
        "url": "https://www.reddit.com/r/Frugal/comments/10etm2j/cashback_website_for_tracking_best_cashback_method/",
        "text": "Hi Everyone,\n\nI could not see any good website that tracks the best available cash back offered for any particular vendor. Is there anything out there that does that?\n\nFor example, if I was going to order something off of Office Depot, perhaps a website would list the cashback rates offered by different credit cards/credit card companies or Rakuten, Paypal, etc ((like 7% through the Capital One portal vs 5% through Rakuten)  to compare which option is best to use.",
        "created_utc": 1674004139,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it stupid to buy a 2006 Toyota Corolla that has a good engine but broken windshield, not working radio and tires needing changing for 3k",
        "author": "HumblyEgotistical",
        "url": "https://www.reddit.com/r/Frugal/comments/10escnl/is_it_stupid_to_buy_a_2006_toyota_corolla_that/",
        "text": ".",
        "created_utc": 1674000943,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone here ever shoplift? Be honest",
        "author": "Carniboy",
        "url": "https://www.reddit.com/r/Frugal/comments/10es019/anyone_here_ever_shoplift_be_honest/",
        "text": "There are some moments that it just seems right, Like this $40 tequila, I was at wegmans I had 2 mineral eaters and tequila in my cart and I went over to the coffee bar,( you can pay for yours grocerys there with your coffee but not alchohol)(she explains this to me) I say okay then just ring up the waters and the coffee and ill go pay for the tequila at the other line.\n\nI just walked away, put the tequila in the bag with the waters and left, its a gift from god",
        "created_utc": 1674000085,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some larger purchases you’ve made to save money in the long run?",
        "author": "nothankyou928",
        "url": "https://www.reddit.com/r/Frugal/comments/10er4lj/what_are_some_larger_purchases_youve_made_to_save/",
        "text": "I’ve been looking for reusable and/or more frugal products and I’d love some ideas! \nFor example, I bought Swedish dish clothes and stopped buying paper towels. \nI recently ordered and am awaiting the arrival of my new safety razor so that I no longer purchase disposable gloves razors. I can get a 100 pack of blades for $10.",
        "created_utc": 1673997985,
        "upvote_ratio": 1.0
    },
    {
        "title": "20 year old male living on car with girlfriend what do we do where do we go we door dash to survive",
        "author": "MikeJackThrilla699",
        "url": "https://www.reddit.com/r/Frugal/comments/10eq8l5/20_year_old_male_living_on_car_with_girlfriend/",
        "text": "[removed]",
        "created_utc": 1673995840,
        "upvote_ratio": 1.0
    },
    {
        "title": "Maybe most people already do this, but this is for those who don’t. Put those butter wrappers to good use and grease your baking dishes with the butter left stuck to the wrapper. You might be surprised how little can go a long way.",
        "author": "katydidkat",
        "url": "https://i.redd.it/ud207vf94qca1.jpg",
        "text": "",
        "created_utc": 1673995566,
        "upvote_ratio": 1.0
    },
    {
        "title": "Upcycled Finish Dish Soap Pod Container ideas?",
        "author": "Suspicious_Plum_8032",
        "url": "https://i.redd.it/sl7b4gi12qca1.jpg",
        "text": "",
        "created_utc": 1673994817,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shopping dental services, wisdom tooth removal?",
        "author": "Annonymouse100",
        "url": "https://www.reddit.com/r/Frugal/comments/10epei5/shopping_dental_services_wisdom_tooth_removal/",
        "text": "Any tips on the best way to shop for dental care. I’ve been seeing the same dentist for 10 years, cash paying, and end up with $200-300 a year in total costs. He has been bugging me for a while about removing my wisdom teeth/third molars. One started to give me trouble and if I don’t do it this year I will need fillings in all 4 and more work in the one. He referred me to an oral surgeon (appointment pending.) \n\n&amp;#x200B;\n\nI have savings for this purpose, but I want to make sure I’m making the most informed decision. It is my understanding that I have to pay for each consult and assessment? How do you go about comparing costs for these services or at least assessing if the quote is reasonable? Any personal experience getting fully erupted (so easier to remove) wisdom teeth removed and the cost associated?",
        "created_utc": 1673993883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Forgot how amazing Pluto tv was",
        "author": "lolumadbr0",
        "url": "https://www.reddit.com/r/Frugal/comments/10eovp5/forgot_how_amazing_pluto_tv_was/",
        "text": "Whenever I'm bored &amp; can't find something to watch I love Pluto tv. Sometimes I'll find something on Tubi.\n\nRemember throughout this Recession there's FREE activities like this ❤️",
        "created_utc": 1673992691,
        "upvote_ratio": 1.0
    },
    {
        "title": "84% of some ham... apparently people refuse to eat this post-Xmas! (Shot with my free phone that was selling for $200)",
        "author": "candidatefromhell",
        "url": "https://i.redd.it/djortvwpaoca1.png",
        "text": "",
        "created_utc": 1673991665,
        "upvote_ratio": 1.0
    },
    {
        "title": "blue from Rainbow friends, made of endless cloth of an busted sheet, stuffed with the filling from old pillow.",
        "author": "LittleMissEmmet",
        "url": "https://www.reddit.com/gallery/10ento2",
        "text": "",
        "created_utc": 1673990247,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any way to travel from California to Louisiana cheaper or at least faster?",
        "author": "Happy-Knight",
        "url": "https://www.reddit.com/r/Frugal/comments/10enk3q/any_way_to_travel_from_california_to_louisiana/",
        "text": "I currently live in SoFlo , I have a long distance relationship, with my partner living in Louisiana. \nI am eventually moving out (unfortunately) to move to San Diego due to family reasons. \nIt’s disheartening to see the prices but even worse honestly is how there’s no non stop for SAN to MSY. I’ll basically pay almost a thousand a trip and be stuck in a plane all day when it would be only two hours just to visit LA from FL.\nAny remedies to this or suggestions ? I wouldn’t even care about the price of the travel was better honestly",
        "created_utc": 1673989632,
        "upvote_ratio": 1.0
    },
    {
        "title": "Drawing Boards",
        "author": "Daddy_Feelings",
        "url": "https://www.reddit.com/r/Frugal/comments/10en3ht/drawing_boards/",
        "text": " Hello! I'm hosting a community figure drawing class, and I want to have drawing boards available for people to use since I'm offering paper and drawing supplies. I need some suggestions of cheap/free options that would ideally last awhile that I can donate to the studio after.\n\nSo far my ideas are: masonite sheet cut to size and buying flooring samples from home depot.\n\nAnyone know of any stores that give away those big carpet sample boards with the handle hole for free or something similar?",
        "created_utc": 1673988581,
        "upvote_ratio": 1.0
    },
    {
        "title": "Drawing Boards",
        "author": "Daddy_Feelings",
        "url": "https://www.reddit.com/r/Frugal/comments/10emvja/drawing_boards/",
        "text": "Hello! I'm hosting a community figure drawing class, and I want to have drawing boards available for people to use since I'm offering paper and drawing supplies. I need some suggestions of cheap/free options that would ideally last awhile that I can donate to the studio after.\n\nSo far my ideas are: masonite sheet cut to size and buying/taking flooring samples from home depot.\n\nAnyone know of any stores that give away those big carpet sample boards with the handle hole for free or something similar?",
        "created_utc": 1673988066,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get over a yeast infection naturally?",
        "author": "greatdoctors",
        "url": "https://www.reddit.com/r/Frugal/comments/10em8tx/how_to_get_over_a_yeast_infection_naturally/",
        "text": "[removed]",
        "created_utc": 1673986601,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the best TWS earbuds for 30$ or under?",
        "author": "Soviet_Arthropod36",
        "url": "https://www.reddit.com/r/Frugal/comments/10elpj0/what_are_the_best_tws_earbuds_for_30_or_under/",
        "text": "I was thinking soundpeats but any suggestions are welcome. I’m open to nearly anything.",
        "created_utc": 1673985375,
        "upvote_ratio": 1.0
    },
    {
        "title": "twins",
        "author": "UselessHuman1",
        "url": "https://www.reddit.com/r/Frugal/comments/10elkwk/twins/",
        "text": "Hi, I'm new here. I'm currently 3 months pregnant with twins. We are getting most of our things for free (cribs, mattresses, car seat (from a car seat technician so I know they are still good), big items). We still need a changing station, clothes, bottles, baby food, etc. I plan on making baby food as much as possible so we don't have to buy it full price. What do you recommend?",
        "created_utc": 1673985072,
        "upvote_ratio": 1.0
    },
    {
        "title": "are video doorbells worth it for surveilannce cameras?",
        "author": "spitfire9107",
        "url": "https://www.reddit.com/r/Frugal/comments/10elbgi/are_video_doorbells_worth_it_for_surveilannce/",
        "text": "thikning of using them for surveillance cameras but I've heard ring has a subscription and eufy has none.  Any other good effective alternatives?",
        "created_utc": 1673984459,
        "upvote_ratio": 1.0
    },
    {
        "title": "Difficulty understanding acceptable grocery prices",
        "author": "Imanya9",
        "url": "https://www.reddit.com/r/Frugal/comments/10elaz7/difficulty_understanding_acceptable_grocery_prices/",
        "text": "[removed]",
        "created_utc": 1673984427,
        "upvote_ratio": 0.99
    },
    {
        "title": "What are your favorite affordable wintertime activities? Looking to amp up the fun in my relationship(s)!",
        "author": "Bonhoeffersmuse",
        "url": "https://www.reddit.com/r/Frugal/comments/10eky7z/what_are_your_favorite_affordable_wintertime/",
        "text": "I’m in a snow-less area of the country, but it does get cold. My (23f) boyfriend (26m) &amp; I enjoy outdoor activities like hiking and watching sunsets/sunrises. Looking to diversify our activities tho, and it seems there isn’t much to do aside from reading around a fire/watching movies/driving to scenic places. \n\nWhat are some fun activities you love to do with your friends/family, outside and in? We love to be active, and learn new things. Looking for timeless and unique ways to connect and have fun while on a budget.",
        "created_utc": 1673983619,
        "upvote_ratio": 1.0
    },
    {
        "title": "$4.99 Rottiserie Chicken - Still a great deal at warehouse clubs!",
        "author": "CAZelda",
        "url": "https://www.reddit.com/r/Frugal/comments/10ekojx/499_rottiserie_chicken_still_a_great_deal_at/",
        "text": "The $4.99 rotisserie chickens at discount warehouse clubs like Sam's and Costco still exist. They have definitely kept my weekly food expense down. I am currently a Sam's Club member and I try to buy 1 or 2 per week--I cook for myself and my adult son. As soon as I get the chickens home, I remove the meat and make chicken broth from the bones, carcass scraps, skin--adding onion, celery, carrots, salt, pepper, parsley flakes, etc. I set the deboned legs and thighs plus wings aside, usually for a BBQ chicken bake. I can get at least 4 meals for two per chicken - tacos and other Tex-Mex dishes, casseroles, pasta dishes, chicken salad, soups, or stews. The broth I store in cleaned pasta sauce jars and cool in the fridge. I also save the schmaltz aka chicken fat that collects at top of broth after cooling and use in matzoh balls or southern biscuit dumplings. I even have used the fat to make a delicious roux as a start to cream sauces, cream soups and for gumbo. I feel these chickens have helped me keep my meal expense low and quality high! I can't even buy small fryer chickens raw for less than $4.99!  I hope inflation doesn't cause the cost to go up. Many others have discovered this chicken deal, and there are now lines waiting for the next batch of chickens to be put out on the shelves. Let me know what you think and other recipe ideas.",
        "created_utc": 1673982990,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for reducing cost of car insurance?",
        "author": "DryChipNoSalsa",
        "url": "https://www.reddit.com/r/Frugal/comments/10eklyr/tips_for_reducing_cost_of_car_insurance/",
        "text": "24 y/o M, living in a city on the east coast. My annual insurance payment are so expensive despite having a perfect driving record. Any tips/tricks?",
        "created_utc": 1673982824,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m severely addicted to shopping and spending money and I need help.",
        "author": "Weenyhutjrdeluxe",
        "url": "https://www.reddit.com/r/Frugal/comments/10ekiba/im_severely_addicted_to_shopping_and_spending/",
        "text": "I came here looking for any advice on saving money and tips and tricks on how I can learn how to live below my means. \nFor context, I’m 20 years old, I have 2 jobs and I live at home. I pay for everything except rent (my phone bill, car insurance, gas,taxes, registration fees for my car, all my food since I’m on the go so much I eat out a lot but when I can I buy my own groceries).\n\nI’ve been working since I was 16 and I’ve always been making money but at the same time I have the absolute worst spending addiction of all time. The second I get paid, the first think is “how can I spend every cent of this paycheck in the most effective way for me.” (What’s the most I can get from this check?) Saving money doesn’t even register in my mind. I once blew through 4,000.00 In 3 days on things that I genuinely couldn’t remember. I’m only 20 and yet I’m over 3,000 in debt. I always somehow live paycheck to paycheck and I’m so sick of making good money but sabotaging myself into being broke and choosing between gas and eating dinner every other night.\nPlease help me. I’m so tired and I want to change while I’m young an have time to recover.",
        "created_utc": 1673982587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are you frugal?",
        "author": "LadySummersisle",
        "url": "https://www.reddit.com/r/Frugal/comments/10ej6pl/why_are_you_frugal/",
        "text": "I was curious to know what made folks decide to be frugal, and is the reason why you're still frugal the same now as it was when you first started? Is it a specific goal, worries about the economy, your outlook on life, or something else?\n\nI tend towards frugality because it's satisfying to save money and I like having financial security. I'm not as frugal as I could be--now that I have a job that pays me better, I was able to save up money for a trip (the first one in many years). I have been in situations where a car repair bill could throw my whole financial world into a tailspin, and I don't want to be there ever again.\n\nAdditionally, I am finding that the ways I used to spend money just aren't appealing to me any more. Yes, I like to have the occasional meal out but I really enjoy cooking at home and having friends over. \n\nHow about all of you?",
        "created_utc": 1673979458,
        "upvote_ratio": 1.0
    },
    {
        "title": "Last year the gas bill was almost $400 in December. This year it was $82.14. This is because I burnt free pallets in the wood stove all month. The local stores give free pallets away and I broke them down into free firewood",
        "author": "Sysion",
        "url": "https://i.redd.it/zz76ldtwpoca1.jpg",
        "text": "",
        "created_utc": 1673978628,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is inflation in grocery prices moderating?",
        "author": "NPE62",
        "url": "https://www.reddit.com/r/Frugal/comments/10eie3p/is_inflation_in_grocery_prices_moderating/",
        "text": "I don't want to jinx anything, but in my experience, grocery prices are moderating, and in some cases declining. I am in the St. Louis area, where the grocery trade is basically Wal-Mart, Aldi, and a couple of local chains.  I do most of my grocery shopping at Wal-Mart, probably about 60% of the total, and another 25% or so at Aldi.  At my local Wal-Mart, a lot of things that I usually buy have been put on fairly attractive sales. The same appears to be true at the local chains where I shop occasionally. \n\nThe biggest price mark-downs seem to be in fruits and vegetables. The retailers seem to be reluctant to mark down the prices on an indefinite basis, but they have been putting a lot of things on sale.  However, I have also noticed decreases in the \"regular\" prices of asparagus, mandarin oranges, broccoli, and cauliflower.  \n\nI don't know if any of this is typical in US grocery prices as whole, and prices are certainly not to pre-COVID levels (but,  see below). However, it is encouraging.\n\nInterestingly, the prices of red/yellow/orange bell peppers at my local Wal-Mart has not budged since before COVID--consistently at $1.38 apiece.",
        "created_utc": 1673977610,
        "upvote_ratio": 0.99
    },
    {
        "title": "Recipe ideas with 2% milk?",
        "author": "missprincesscarolyn",
        "url": "https://www.reddit.com/r/Frugal/comments/10eiczm/recipe_ideas_with_2_milk/",
        "text": "Ideally, dessert/baked goods, but open to anything really. \n\nWe get our groceries from Walmart and the Great Value option does not come in a smaller size than a quart (at least orderable online).\n\nWe use it to make mac and cheese or to bake cornbread with, but then have quite a bit hanging around. Last week, I was able to make rice pudding, but I’m currently out of ideas. Custard would be an obvious choice but sourcing eggs is a whole endeavor these days. \n\nI’m considering biscuits and gravy now, but that might be a bit involved for mid-week cooking. Thanks!!!",
        "created_utc": 1673977535,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do I pack for lunch to avoid eating out?",
        "author": "bananadangle",
        "url": "https://www.reddit.com/r/Frugal/comments/10ehz9j/what_do_i_pack_for_lunch_to_avoid_eating_out/",
        "text": "This feels stupid but I really struggle with packing a lunch for work. I have recently realized that a lot of my money is going to eating out. I am not great at meal prep and I don’t have a great grocery routine. What sort of things do you pack for lunch to help you stay in your budget?",
        "created_utc": 1673976627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meal delivery kits are so frugal...",
        "author": "qqererer",
        "url": "https://www.reddit.com/r/Frugal/comments/10eh6n3/meal_delivery_kits_are_so_frugal/",
        "text": "...if you know how to work the system.\n\nGot a mailer in the mail with those paper credit card thingies glued on to them.  That says \"We have lots of money\".\n\nThe mailer said \"Meals as cheap as $4.05\".  Regular meal plans after the special code are $9 or more.  To get the $4.05, you had to sign up for 20 meals/week.  We didn't want to do that.  So we thought we'd just go for the minimum and get the 4 meals for $4.50 (delivered).   We couldn't see what the meals were so we couldn't judge the value without giving credit card info. Then we started arguing about who's credit card we should use, and we both kind of noped out of it and I said \"They're rich, they have tons of money, screw them, we'll just wait and see what happens.\"\n\nAnd just as I predicted, less than 12 hours later, I got an email saying \"$2.99 per meal\".  Now who's to know if it's a lower quality tier of product, but $2.99 is a crummy, \"I'm still hungry\" pizza downtown.  So I signed up with my disposable email address, my disposable prepaid mastercard, and got the max 20 meals @ $2.99 for $60 delivered.  \n\nIt's coming on Saturday, but it will be interesting to see what I actually get. The meal plans are $9 each, but I'm expecting $2 worth of food.  I'll take the gamble.  At the very least, I can add more rice/pasta/potato.    I can't see why they would stiff me though.  They're trying to get me to sign up for $180 + deliverey for what I got for $60 total.  \n\nThat's not going to happen though.  Thanks Venture Capitalists.  I never got to experience the glory that was MoviePass, but now I'm going to take advantage of what I can when I see the opportunity to do so.",
        "created_utc": 1673974755,
        "upvote_ratio": 1.0
    },
    {
        "title": "$6,769.85 a can or their math sucks?",
        "author": "Chromebasketball",
        "url": "https://i.redd.it/ef6g5s6y5oca1.jpg",
        "text": "",
        "created_utc": 1673971915,
        "upvote_ratio": 1.0
    },
    {
        "title": "Make a difference for others like you!",
        "author": "ForeverStudent6",
        "url": "https://www.reddit.com/r/Frugal/comments/10efjxm/make_a_difference_for_others_like_you/",
        "text": " I am a grad student at the University of Utah, researching how financial principles are learned. I'm looking for people between 18-30 who would be willing to answer questions about how they learned to manage money. Here is more information about the study and a link to sign up. [https://fcs.utah.edu/research/egbstudy.php](https://fcs.utah.edu/research/egbstudy.php?fbclid=IwAR1Zvjr100MdPNVSDAOpx21fbuVnNnMSC-LLvE5PsWws_HRDclvNzovx1Xc)\n\nThank you for your consideration.",
        "created_utc": 1673970734,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did you want to upgrade to a newer car?",
        "author": "Sufficient_Phrase_85",
        "url": "https://www.reddit.com/r/Frugal/comments/10efhpk/did_you_want_to_upgrade_to_a_newer_car/",
        "text": "I bought a 2019 minivan in March, because we were about 6 days away from the arrival of our youngest - and we didn’t have a seat for him in our previous vehicle. Just had to take it to the dealer to get a second key, and they sent me a message that, “Most people prefer to drive a new car to maintaining an older model. Would you like to trade up to a new car and keep your payment the same?” \n\nBecause paying for another few years doesn’t matter as long as the payment is the same? Because they assume we have a car payment? Because a 4-5 year old car is “an older model”?! I drove a 1997 Explorer until 2017. And it was fine, and paid for. \n\nIs this really the norm, or are they just trying to sell a car? I’m kind of shocked.",
        "created_utc": 1673970585,
        "upvote_ratio": 1.0
    },
    {
        "title": "Headphone band is falling apart, but audio is fine. Any frugal tips to keep them going?",
        "author": "Lego_Hippo",
        "url": "https://i.redd.it/r2decrs71oca1.jpg",
        "text": "",
        "created_utc": 1673970323,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the cheapest way to get all my daily protein requirements",
        "author": "lovingmama98",
        "url": "https://www.reddit.com/r/Frugal/comments/10ef8za/what_is_the_cheapest_way_to_get_all_my_daily/",
        "text": "I’m so hungry :( I am getting maybe 20g a day…. If..",
        "created_utc": 1673969964,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal tip for buying new sneakers.",
        "author": "bluffbuster",
        "url": "https://www.reddit.com/r/Frugal/comments/10ee8yz/frugal_tip_for_buying_new_sneakers/",
        "text": "I shop mostly online. Black seems to have fallen out of style for running shoes and they are discounted quite a bit.",
        "created_utc": 1673967425,
        "upvote_ratio": 1.0
    },
    {
        "title": "What prescription eyeglass sites have you guys had good luck with?",
        "author": "paulrudder",
        "url": "https://www.reddit.com/r/Frugal/comments/10edgfu/what_prescription_eyeglass_sites_have_you_guys/",
        "text": "I need large frames (140mm+) and it seems like all the styles I like on Zenni tend to be medium length. I bought a pair a couple years ago that were 135mm and love how they look from the front but the stems aren’t long enough and hurt my ears when I wear them - I even tried adding extenders but no dice. Seems to just place pressure around my temples and on the back of my ears.\n\nI want some oval / round frames similar to these: https://imgur.com/a/Wq7A8rY\n\nAnyone have any suggestions?",
        "created_utc": 1673965348,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accepted being a groomsman, a year later being hit with costs I just can’t afford",
        "author": "SnipeAndCelly",
        "url": "https://www.reddit.com/r/Frugal/comments/10ec5cj/accepted_being_a_groomsman_a_year_later_being_hit/",
        "text": "Background: I’m a student with $1500 in my account. I only work in the summer. I feel bad when I have to spend $15 on lunch. \n\nMy friend asked me to be a groomsman in his wedding. I’ve only attended weddings as a guest before. I accepted, not really knowing what I was getting into. \n\nRecently I’ve been asked to go suit shipping with the rest of the groomsmen. The groom said the suit he’s looking at would be around $700 ballpark to buy, close to $500 to rent. Since I’ve heard this I’ve been kinda freaking out because I can not afford that. The other groomsman are all in to buy the suit since they are older than me and have full-time jobs. The bride is a very non-negotiable type and is already upset with bridesmaids for being cautious about costs. \n\nI told the groom I can not afford to buy a $700 suit, and I could only afford to rent if it’s significantly cheaper than that. I was thinking it would be $200 and even that’s a big hit to me but I was willing to take it. \n\nIt’s starting to feel like less of an honour and more of a really uncomfortable circumstance to be put into, and I’m not sure what to do",
        "created_utc": 1673961752,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I regret being frugal...",
        "author": "2thebeach",
        "url": "https://www.reddit.com/r/Frugal/comments/10ec45k/i_think_i_regret_being_frugal/",
        "text": "I've been frugal most of my life.  I resolved at 20 to become financially independent.  I owned my first house outright by age 30 and was paying down a second mortgage on a rental property.  I've made a life-long game of seeing how cheaply I could live and how much I could do without.  I saved my vacation time at work so I could be paid for it instead.  But now that I'm retired and getting older (63), not only am I finding that my money isn't making me happy -- pandemic shutdowns, runaway inflation, and the outrageous housing market in the last couple of years isn't helping -- but I regret not enjoying it more when I was younger.  Additionally, now that I'm old enough to look around at various retirement benefits, I'm realizing how much is offered for free to those with lower incomes and assets.  Of course, if you're VERY rich, you're good, but I'm somewhere in the middle: not rich enough to never worry about money again, but too \"rich\" to take advantage of the programs and perks.\n\nAnyone else?",
        "created_utc": 1673961651,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any go-to recipe with kidney beans?",
        "author": "ClaireVDB",
        "url": "https://www.reddit.com/r/Frugal/comments/10ebn6y/any_goto_recipe_with_kidney_beans/",
        "text": "I found a 3 kg bag of dry kidney beans on sale a few months ago and I haven’t been able to consume them much. \nI try to use them in soups/refried beans but I was wondering if you have any go-to recipes to share? I have tried to make burgers but they were so dry and unappetizing.",
        "created_utc": 1673960271,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are gym shaker bottles a waste of money? They always smell so bad",
        "author": "helpplspanicking",
        "url": "https://www.reddit.com/r/Frugal/comments/10eblfa/are_gym_shaker_bottles_a_waste_of_money_they/",
        "text": "I have been buying MyProtein blender bottles for several years now and I find that they always develop a somewhat rancid smell within a few weeks no matter how much I clean them. \n\nI always try to rinse them immediately even if I can’t use soap and water at that moment, but over a few weeks they smell BAD. If I use milk or protein powder, I wash with soap and water immediately. \n\nI currently have the steel one (with a plastic lid) and I’d be grateful for any tips on cleaning it and keeping it stench free",
        "created_utc": 1673960115,
        "upvote_ratio": 1.0
    },
    {
        "title": "Columbia Men’s Glennaker Lake Rain Jacket only $25",
        "author": "shehab-araiby",
        "url": "http://gruttech.com",
        "text": "",
        "created_utc": 1673959262,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my heating plan efficient 61 at night and 67 during the day?",
        "author": "peanutbuttrj72",
        "url": "https://www.reddit.com/r/Frugal/comments/10eaqoy/is_my_heating_plan_efficient_61_at_night_and_67/",
        "text": "I have force air oil heat and I’m trying to do my best to cut its cost. Wanted to see if my plan is efficient. I have a programmable thermostat.",
        "created_utc": 1673957407,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some general thoughts about a frugalist lifestyle and possible discussion",
        "author": "CharlesLitoris",
        "url": "https://www.reddit.com/r/Frugal/comments/10e95iu/some_general_thoughts_about_a_frugalist_lifestyle/",
        "text": " Hey fellow frugalists, when it comes to saving money, we often think of small tricks like cutting out daily coffee or opting for generic brands. But if you really want to save money long-term and make a significant impact on your finances, you have to dig deeper and address the big expenses in your life.\n\nOne of the biggest expenses for many people is housing. If you live in an expensive city, it may be worth considering moving to a cheaper area. Or, you could consider sharing your home with roommates to reduce costs. Giving up your personal car and opting for public transportation or carpooling can also save you a lot of money.\n\nAnother big expense is food. Instead of buying expensive groceries, focus on cooking your meals and purchasing seasonal produce that is cheaper. Avoiding processed foods and cooking in bulk to freeze for later can also help you reduce your expenses.\n\nFinally, you should reevaluate your expenses for entertainment and leisure. Instead of planning expensive movie outings or vacations, focus on free activities like walking, reading or having a game night with friends.\n\nThese are just a few examples of how you can reduce your big expenses to save money long-term. It takes time and effort to change your finances, but it's worth it in the long run. Share your success stories and tips here under this post so we can support and inspire each other. \n\nAnd remember, saving money is great, but remember not to be too stingy, because let's face it, nobody wants to be known as the person who counts the pennies while crossing a bridge!",
        "created_utc": 1673951822,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chicken Thigh Casserole for under £0.5 a portion.",
        "author": "DaVirus",
        "url": "https://i.redd.it/ytwzj1swemca1.jpg",
        "text": "2 packs of 250g vegetable medley:  £0.15 each (down from £1.49)\n600g chicken thighs: £1.30 (down from £5.60)\n400g canned tomatoes: £0.30\nSeasoning and water: £1(???)\n\nSlow cook for 10h.",
        "created_utc": 1673950720,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shrimp shell teabag, a flavor bomb for soup!",
        "author": "Ok_Till326",
        "url": "https://i.redd.it/qk8haonvdmca1.jpg",
        "text": "",
        "created_utc": 1673950369,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Costco worthwhile in Australia??",
        "author": "ImpossibleMix5109",
        "url": "https://www.reddit.com/r/Frugal/comments/10e7toe/is_costco_worthwhile_in_australia/",
        "text": "So I live in the country. Its about a $160 drive to get to my nearest Costco. I'd do groceries monthly, plus I need 4wd tyres. Is the drive gonna cost more than I'm likely to save bulk buying groceries?",
        "created_utc": 1673946889,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using 2 litre Yogurt Pots for Pot Plants (Taffy approves).",
        "author": "Ed__b3",
        "url": "https://www.reddit.com/gallery/10e5zd8",
        "text": "",
        "created_utc": 1673940079,
        "upvote_ratio": 1.0
    },
    {
        "title": "College meals",
        "author": "akatsee",
        "url": "https://www.reddit.com/r/Frugal/comments/10e4sch/college_meals/",
        "text": "I know for a fact I can’t survive off of ramen for 4 years, but I also know I can’t afford takeout. I’m allowed to have a rice cooker, microwave, and possibly an indoor grill (haven’t heard back about that one yet) I have basic cooking experience but haven’t bought my own ingredients since it’s usually just in the house. Any tips?",
        "created_utc": 1673935889,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dental Insurance questions",
        "author": "No-Difficulty-4662",
        "url": "https://www.reddit.com/r/Frugal/comments/10e4lxr/dental_insurance_questions/",
        "text": "Hello, reddit! I've few questions to ask about insurance policy I got(Delta Dental):\n\n1. My policy covers 3 cleanings per year at 100%, but I still got billed(25$, delta payed 37%, carrier billed insurance 86$). Is it covered at 100% or not? \n2. My insurance doesn't cover ortho. I want to get braces in next billing year and it is in September. If I switch to a carrier which has ortho coverage, because I had insurance in past 2 years, will I get immediate coverage(and opportunity to get braces)? \n\nThanks!",
        "created_utc": 1673935304,
        "upvote_ratio": 1.0
    },
    {
        "title": "Microwave popcorn bags are toxic, can I remove kernels from bag and pop it in a microwave-safe bowl?",
        "author": "luminuzz",
        "url": "https://www.reddit.com/r/Frugal/comments/10e33va/microwave_popcorn_bags_are_toxic_can_i_remove/",
        "text": "I have a large box of Costco microwave popcorn bags. I heard that heating popcorn in those bags create forever chemicals and other toxins. Do you think it’s safer to cook the kernels on the stovetop or in a bowl + plate in the microwave?",
        "created_utc": 1673930649,
        "upvote_ratio": 1.0
    },
    {
        "title": "Repairing plastic parts by melting steal wire into the plastic with electric current. Repaired part is \"stronger than the original part was\" according to Matthias Wandel, the video creator (great woodworking content - check out his channel!).",
        "author": "ChunkofWhat",
        "url": "https://www.youtube.com/watch?v=ziPutFi1BlI",
        "text": "",
        "created_utc": 1673929878,
        "upvote_ratio": 1.0
    },
    {
        "title": "Eating our money, and making changes... anyone else been there?",
        "author": "Desperate_Cable9177",
        "url": "https://www.reddit.com/r/Frugal/comments/10e03ph/eating_our_money_and_making_changes_anyone_else/",
        "text": "[removed]",
        "created_utc": 1673922055,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long will grated Parmigiano Reggiano cheese last when refrigerated in a sealed container?",
        "author": "Neon-Predator",
        "url": "https://www.reddit.com/r/Frugal/comments/10dzxa4/how_long_will_grated_parmigiano_reggiano_cheese/",
        "text": "My wife accidentally grated my entire $10 block of parm reg and I've never grated that much at one time without using it because it stays good longer as a block. Can any of you give me a frame of reference for how long it stays good for after being grated?",
        "created_utc": 1673921574,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have any advice on how to save money when buying pet medication?",
        "author": "grammar_fixer_2",
        "url": "https://www.reddit.com/r/Frugal/comments/10dyz43/does_anyone_have_any_advice_on_how_to_save_money/",
        "text": "Every dog needs to be on heart worm/flea/tick medication. Mine is on Simparica Trio. These medications need a prescription (which I find to be kind of silly). If I don’t buy it at the vet, they still add a fee to fill out the prescription. Does anyone have any tips on how I can not spend an arm and a leg on this medication? Thanks in advance!",
        "created_utc": 1673919061,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the Frugal brand equivalent of Vuori?",
        "author": "amholdcroft",
        "url": "https://www.reddit.com/r/Frugal/comments/10dyow1/whats_the_frugal_brand_equivalent_of_vuori/",
        "text": "I wouldn't ever spend $100 on a pair of sweatpants, but they sure are cute and soft. Any other brands to recommend for similar joggers?",
        "created_utc": 1673918294,
        "upvote_ratio": 1.0
    },
    {
        "title": "don't want to buy a new backpack!",
        "author": "Bonrew",
        "url": "https://www.reddit.com/gallery/10dy673",
        "text": "",
        "created_utc": 1673916928,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yall still shop at the family dollar?",
        "author": "MayGemini",
        "url": "https://www.reddit.com/r/Frugal/comments/10dxynn/yall_still_shop_at_the_family_dollar/",
        "text": "? Name brand only right??",
        "created_utc": 1673916350,
        "upvote_ratio": 1.0
    },
    {
        "title": "Target charging tax on CRV (California redemption value)",
        "author": "fltcpt",
        "url": "https://www.reddit.com/r/Frugal/comments/10dwown/target_charging_tax_on_crv_california_redemption/",
        "text": "I am in California, and when I buy cans of sodas, they charge a fee, called California redemption value (CRV), a recycle fee I suppose, per can. So I went to my local Target the other day, behold, they added the CRV value to the total when calculating tax. Comes out to about $0.70, not significant, but not insignificant either, it's more than cost of an entire can of soda itself. \n\nI complained the Target, they replied with some questions, but no follow up. First of, CRV is not taxable, that much is clear. So I am thinking about investigating whether Target is really paying that extra tax they charged me to the government or are they just swallowing up the extra money.\n\nAnybody has any idea where do I start?",
        "created_utc": 1673913120,
        "upvote_ratio": 1.0
    },
    {
        "title": "Time savers",
        "author": "OkFaithlessness6404",
        "url": "https://www.reddit.com/r/Frugal/comments/10dwd7o/time_savers/",
        "text": "What things do you guys do to save large amounts of time/energy?",
        "created_utc": 1673912327,
        "upvote_ratio": 1.0
    },
    {
        "title": "Repurposing leftover hardwood flooring.",
        "author": "Gechevarria",
        "url": "https://www.reddit.com/r/Frugal/comments/10dwcry/repurposing_leftover_hardwood_flooring/",
        "text": "Does anybody have any neat ideas on what to do with leftover hardwood flooring? I’ve got some really good looking dark bamboo flooring and I’d love to make something neat out of it. I was thinking perhaps a shoe rack? Anything else?",
        "created_utc": 1673912294,
        "upvote_ratio": 1.0
    },
    {
        "title": "Capitalize on timing of selling vehicle?",
        "author": "ALingerz",
        "url": "https://www.reddit.com/r/Frugal/comments/10dvztr/capitalize_on_timing_of_selling_vehicle/",
        "text": "A simple question to probably a complex answer: Are there some guidelines as to when it makes sense to sell a car for something newer/fewer miles because you will get more for it vs saving money by having something paid off and driving until you have a repair that will be more than the vehicle is worth?\n\nIf you have a vehicle that's paid off you are saving money but the longer you hold on to it the less you get back when you sell. If you do hold on to it you may eventually have to make repairs and at some point the repair might be more than the vehicles worth. Seems like a balancing act to me and looking for some input from other people's experiences.",
        "created_utc": 1673911429,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me settle/understand a fuel cost dispute on a road trip.",
        "author": "Hipsbrah",
        "url": "https://www.reddit.com/r/Frugal/comments/10dvpnh/help_me_settleunderstand_a_fuel_cost_dispute_on_a/",
        "text": "I went on a road trip with a buddy, and we are having different ideas as to how to split the costs of fuel. Heres how the fuelling up went.\n\n1. We took the tank from 1/4 to full to start the trip full, cost was $98.32 (I paid)\n2. Our next fuel stop we took the tank to full again, that cost $92. (He paid)\n3. The next stop we took it to full again that cost $87.02 (I paid).\n4. We then finished our trip and i dropped him off with the tank at 3/4. We agreed upon 30  divided by the two of us to make it full again, so 30 each (I paid and have not received this money yet). \n\nMy idea was to the take my costs, which is more, subtract his, and then split the rest. I am not the best at this stuff and am hoping someone can help solve this because these are some of the best money managers in the world.  Thank you.",
        "created_utc": 1673910753,
        "upvote_ratio": 1.0
    },
    {
        "title": "Return policies",
        "author": "wtfym3",
        "url": "https://www.reddit.com/r/Frugal/comments/10dvinq/return_policies/",
        "text": "So I know this is frugal and most people don’t think cheap when they think REI but hear me out. For a 30.00 lifetime membership anything you buy you can return within a year. That includes children’s clothing. We have bought our kids 1 jacket from there and returned it every season and exchanged it out for summer to winter and back again. It’s the long game especially with young ones but every penny counts.",
        "created_utc": 1673910317,
        "upvote_ratio": 1.0
    },
    {
        "title": "Buy now , Pay Later",
        "author": "skatebeat759",
        "url": "https://www.reddit.com/r/Frugal/comments/10dv00q/buy_now_pay_later/",
        "text": "Overall I think it is not effective (Just my opinion), curious as what others think for me to see what I am missing.\n\n1. Each item you buy seem to run your credit to register you for the buy now , pay later (Not a win)\n2. Yes you could buy an item and not pay interest between 3-12months depending on the company",
        "created_utc": 1673909117,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any recommendations for cookers and ingredients to buy from Walmart as a college student to cook foods like chicken, fish, beans, rice etc?",
        "author": "HumblyEgotistical",
        "url": "https://www.reddit.com/r/Frugal/comments/10dushb/any_recommendations_for_cookers_and_ingredients/",
        "text": "I’m a newbie at cooking etc and don’t want to have to eat like shit in school as I need to maintain muscle mass",
        "created_utc": 1673908631,
        "upvote_ratio": 1.0
    },
    {
        "title": "need a king size comfirter that will last!",
        "author": "EnvironmentalCard210",
        "url": "https://www.reddit.com/r/Frugal/comments/10drdet/need_a_king_size_comfirter_that_will_last/",
        "text": "Hello I need a king size comforter that will last me years to come. I was leaning towards buying something cotton and machine washable. I've looked at Walmart, target, tjmaxx, homegoods and bed bath and beyond but nothing has caught my eye. Anybody have any suggestions?",
        "created_utc": 1673902255,
        "upvote_ratio": 1.0
    },
    {
        "title": "Silly Used Car and Truck Prices FB Marketplace",
        "author": "SkywaySpeaks",
        "url": "https://www.reddit.com/r/Frugal/comments/10dqxv4/silly_used_car_and_truck_prices_fb_marketplace/",
        "text": "[removed]",
        "created_utc": 1673901540,
        "upvote_ratio": 1.0
    },
    {
        "title": "Make your own beef jerky",
        "author": "conspicuousconundrum",
        "url": "https://i.redd.it/edhyqmi99ica1.jpg",
        "text": "",
        "created_utc": 1673900388,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frugal find to my hoard of glass Oui cups as I was eating a snack.",
        "author": "Never-Nude6",
        "url": "https://i.redd.it/b22tsgsa1ica1.jpg",
        "text": "",
        "created_utc": 1673897713,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cheap easy \"prison hooch\" that actually tastes pretty good.",
        "author": "Byzantium",
        "url": "https://www.reddit.com/r/Frugal/comments/10dox4g/cheap_easy_prison_hooch_that_actually_tastes/",
        "text": "Beer prices have gone up a lot lately.\n\nHere is my recipe:\n\nFill a one gallon milk jug half full of hot water. Add 1-1/3 cups sugar. Shake until dissolved.\n\nAdd one can of frozen juice concentrate [I use apple or grape.] Make sure it is real juice as that has nutrients for the yeast.\n\nAdd one packet of Koolaid.\n\nFill with water to make the whole jug barely warm to the touch.\n\nAdd yeast culture*.\n\nShake again and place in a warm place. It will start bubbling in a few hours. Make sure the cap is loose, or it will explode.\n\nWhen bubbling stops [about 4 days] refrigerate and then enjoy.\n\nI have found that grape juice tends to foam when the fermentation is in its early \"enthusiastic\" phase, so you might want to put a plate under it to catch any foam that escapes so that you do not stain your countertop.\n\nI guestimate that it comes out around 8-9% ABV. Depending on the yeast strain, more sugar should make it stronger.\n\n*Yeast culture: I started mine with some organic cold pressed apple cider that someone gave me. I just let it ferment and then used some of the liquid as starter for subsequent batches. Or you can go to a brew store and purchase a packet of champagne yeast. When you want to start a new batch, take the old fermented hooch, shake it up, and add 4-6oz to a new jug of mix.\n\nThe culture can be recycled forever.\n\nMake SURE that the juice does not have preservatives such as sodium benzoate!\n\nQuestions are welcome",
        "created_utc": 1673897283,
        "upvote_ratio": 1.0
    },
    {
        "title": "Walkers Shortbread Cookies &amp; Dishwasing Gloves",
        "author": "5spd4wd",
        "url": "https://www.reddit.com/r/Frugal/comments/10dnspn/walkers_shortbread_cookies_dishwasing_gloves/",
        "text": "  Yesterday I was browsing the Big Lots site online for my local store, just seeing what was on sale and if there was anything I needed to stock up on.\n\nRan across a very favorite of mine, Walkers shortbread cookies, 6.2 oz, $1.07 a box. Normally a box of these costs at least $5.00 in a grocery store. I ordered of 4 boxes.\n\nAlso, a 2-pack of Mr. Clean reusable, flock-lined, natural latex gloves, which I use for washing dishes by hand and some other chores. $2.49.\n\nGrand total, with tax, $6.97. And curbside pickup.",
        "created_utc": 1673894774,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to Reach the Frugal Mods",
        "author": "5spd4wd",
        "url": "https://www.reddit.com/r/Frugal/comments/10dndy0/trying_to_reach_the_frugal_mods/",
        "text": "My post in Frugal was just taken down but I don't know why. When I click on the notification I get a pop-up \"Sorry, this content is no longer availmessage that says \"Sorry, this content is no longer available.\"\n\nHow do I know what I did wrong if there is no feedback at all and no way to connect the mods through that specific post?",
        "created_utc": 1673893907,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anybody use the Miles app and get anything from it?",
        "author": "geno111",
        "url": "https://www.reddit.com/r/Frugal/comments/10dn2kk/anybody_use_the_miles_app_and_get_anything_from_it/",
        "text": "I have the Miles app and a good many miles logged but most, if not all, of the offers I see are for promotions which you could probably get with a google search.  The gift cards are always \"sold out\" and Im not going to place a bid on something thats not a guarantee. \n\nHas anybody used this app to get actually get something?",
        "created_utc": 1673893282,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scored at Big Lots",
        "author": "5spd4wd",
        "url": "https://www.reddit.com/r/Frugal/comments/10dms23/scored_at_big_lots/",
        "text": "Yesterday I was browsing the Big Lots site online for my local store, just seeing what was on sale and if there was anything I neded to stock up on.\n\nRan across a very favorite of mine, Walkers shortbread cookies, 6.2 oz, $1.07. Normally a box of these costs at least $5.00 in a grocery store. I ordered of 4 boxes.\n\nAlso, a 2-pack of Mr. Clean reusable, flock-lined, natural latex gloves, which I use for washing dishes by hand and some other chores. $2,49.\n\nGrand total, with tax, $6.97. And curbside pickup.",
        "created_utc": 1673892767,
        "upvote_ratio": 1.0
    },
    {
        "title": "Left over craft paint",
        "author": "odd_variety6768",
        "url": "https://www.reddit.com/r/Frugal/comments/10dmrnh/left_over_craft_paint/",
        "text": "I do a little crafting and most of my acrylic paints are getting old/starting to deteriorate. I bought a new set today but I hate just throwing out the old ones. Any ideas what I can do with the old ones??",
        "created_utc": 1673892744,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are reusable ziploc bags worth it?",
        "author": "missprincesscarolyn",
        "url": "https://www.reddit.com/r/Frugal/comments/10dlkgf/are_reusable_ziploc_bags_worth_it/",
        "text": "We bought some reusable bags from Walmart recently and were pretty happy with them until we learned they weren’t dishwasher safe. I’m considering looking for ones that are. I frequently adopt a “my time costs money too” mentality so popping them in the dishwasher would make it easier for me to continue doing this.\n\nI haven’t seen a cost breakdown anywhere, but another consideration is the eco-friendly component, which does matter to us as a relatively eco-conscious house hold (no paper towels or paper napkins, reusable bags and produce bags, etc.) Thanks!",
        "created_utc": 1673890888,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have a handy solution for orphan socks? I've kept these around hoping their other half would turn up, but there's no hope for these guys.",
        "author": "lefthandsmoke3",
        "url": "https://i.redd.it/0hqv67a3ghca1.jpg",
        "text": "",
        "created_utc": 1673890578,
        "upvote_ratio": 1.0
    }
]