[
    {
        "title": "BEST BLOG ON MACHINE LEARNING AND AI MODELLING CERTIFICATIONS FOR 2023",
        "author": "Nikita-Techblogger",
        "url": "https://www.reddit.com/r/Futurology/comments/10fstuz/best_blog_on_machine_learning_and_ai_modelling/",
        "text": "[removed]",
        "created_utc": 1674103818,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hydrogen Will Not Save Us. Here's Why.",
        "author": "DadOfFan",
        "url": "https://www.youtube.com/watch?v=Zklo4Z1SqkE",
        "text": "",
        "created_utc": 1674101608,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's Being Dropped (DARPA Sky) You're Being Hit From Above!",
        "author": "Moeisha69",
        "url": "https://youtu.be/qk9d5QTj5MQ",
        "text": "",
        "created_utc": 1674099457,
        "upvote_ratio": 1.0
    },
    {
        "title": "Deep Tech Pitching",
        "author": "One-Adagio-6996",
        "url": "https://www.reddit.com/r/Futurology/comments/10fquly/deep_tech_pitching/",
        "text": "Anyone here experienced in giving or observing pitches in Deep Tech? Preferably around more obscure or less \"clear cut tech for clear cut problem\" fields?",
        "created_utc": 1674097865,
        "upvote_ratio": 1.0
    },
    {
        "title": "Serious question: why do people use someone support of AI against them?",
        "author": "crua9",
        "url": "https://www.reddit.com/r/Futurology/comments/10fqatg/serious_question_why_do_people_use_someone/",
        "text": "So I seen this a few times since ChatGPT came out. Where educational content someone says an AI made it. More recently I even got ban from a place because they thought I used it.\n\nWhen I openly talked about it on their suggestions place on why having such a rule will cause a witch hunt like in the art subreddit because there is no way someone can prove or disprove anyone was using an AI and the victim has no was to defend themselves. Someone pointed out my post on how AI will help people get and keep jobs as evidence.\n\nAnd what is odd, this isn't the first time I seen this.\n\n\nWhy is this a thing? Is it an us vs them?",
        "created_utc": 1674096304,
        "upvote_ratio": 1.0
    },
    {
        "title": "NASA Issues Award for Greener, More Fuel-Efficient Airliner of Future",
        "author": "Aeromarine_eng",
        "url": "https://www.nasa.gov/press-release/nasa-issues-award-for-greener-more-fuel-efficient-airliner-of-future",
        "text": "",
        "created_utc": 1674096008,
        "upvote_ratio": 1.0
    },
    {
        "title": "History made. Alan Turing's mind resurrected by AI in a convo with AI. Unbelievable.",
        "author": "FarStandard5085",
        "url": "https://soundcloud.com/thehalpodcast/a-turing-test-for-the-ages-alan-turing-meets-chatgpt",
        "text": "",
        "created_utc": 1674092927,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scientists Have Reached a Key Milestone in Learning How to Reverse Aging",
        "author": "stepsinstereo",
        "url": "https://time.com/6246864/reverse-aging-scientists-discover-milestone/",
        "text": "",
        "created_utc": 1674091652,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grid study shows that by 2025, 310,000 San Mateo homes and businesses could access 100% clean renewable electricity, for a 10% increased price",
        "author": "manual_tranny",
        "url": "https://pv-magazine-usa.com/2023/01/18/cca-must-procure-1300-gwh-of-supply-to-meet-last-37-gwh-of-demand/",
        "text": "",
        "created_utc": 1674086031,
        "upvote_ratio": 1.0
    },
    {
        "title": "Robots are getting more and more advanced",
        "author": "Kind_Community1893",
        "url": "https://www.youtube.com/watch?v=-e1_QhJ1EhQ",
        "text": "",
        "created_utc": 1674084803,
        "upvote_ratio": 1.0
    },
    {
        "title": "CA grid analysis says a 10% increase in electricity price would provide 100%, 24/7 clean renewable energy to 810,000 homes and businesses by 2025",
        "author": "manual_tranny",
        "url": "https://pv-magazine-usa.com/2023/01/18/cca-must-procure-1300-gwh-of-supply-to-meet-last-37-gwh-of-demand/",
        "text": "",
        "created_utc": 1674081778,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Origami\" DNA Traps Could Keep Large Viruses From Infecting Cells",
        "author": "filosoful",
        "url": "https://www.the-scientist.com/news-opinion/origami-dna-traps-could-keep-large-viruses-from-infecting-cells-70900",
        "text": "",
        "created_utc": 1674079970,
        "upvote_ratio": 1.0
    },
    {
        "title": "OpenAI's CEO Sam Altman won't tell you when they reach AGI, and they're closer than he wants to let on: A procrastinator's deep dive",
        "author": "Magicdinmyasshole",
        "url": "https://www.reddit.com/r/Futurology/comments/10fj8pb/openais_ceo_sam_altman_wont_tell_you_when_they/",
        "text": "[removed]",
        "created_utc": 1674078233,
        "upvote_ratio": 0.5
    },
    {
        "title": "online make money",
        "author": "Proud-Froyo8180",
        "url": "https://smartideasteck.wordpress.com/",
        "text": "",
        "created_utc": 1674078124,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unexpected ways generative AI will change the future of work",
        "author": "_utisz_",
        "url": "https://www.reddit.com/r/Futurology/comments/10ficbl/unexpected_ways_generative_ai_will_change_the/",
        "text": "There's no shortage of arm-chair prognostication about how the latest generative AI models like ChatGPT will change the future of work. But I noticed much of what I read were obvious, first-order effects, like \"people who generate content in their jobs will now use generative AI.\" That got me thinking about some less-obvious, second-order effects like how generative models might change the way organizations function. \n\nI wrote up [a few thoughts here](https://maestroai.substack.com/p/generative-ai-and-the-future-of-work). I'd love to know what you all think. What are some other possible second-order effects of generative AI?",
        "created_utc": 1674075067,
        "upvote_ratio": 1.0
    },
    {
        "title": "Studies estimating deaths due to climate change",
        "author": "sumoraiden",
        "url": "https://www.reddit.com/r/Futurology/comments/10fi5ta/studies_estimating_deaths_due_to_climate_change/",
        "text": "I was wondering if there have been any studies estimating deaths due to climate change at different temperature rises : 2 degrees, 3 degrees etc. I know there were studies estimating deaths due to a nuclear war and was wondering if a similar study for climate change",
        "created_utc": 1674074638,
        "upvote_ratio": 1.0
    },
    {
        "title": "Australia connects 3GW of new capacity in 2022, must double that to reach renewable target",
        "author": "V2O5",
        "url": "https://reneweconomy.com.au/australia-connects-3gw-of-new-capacity-in-2022-must-double-that-to-reach-renewable-target/",
        "text": "",
        "created_utc": 1674074375,
        "upvote_ratio": 1.0
    },
    {
        "title": "Masterpiece Studio has created a text-to-3D AI that converts text prompts to game-ready 3D models.",
        "author": "gevestobs",
        "url": "https://masterpiecestudio.com/blog/3d-generative-ai",
        "text": "",
        "created_utc": 1674074336,
        "upvote_ratio": 1.0
    },
    {
        "title": "Claude, an AI some consider superior to Chat-GPT 3, had passed the entrance exam for a Law &amp; Economics degree at George Mason University in Virginia",
        "author": "lughnasadh",
        "url": "https://marginalrevolution.com/marginalrevolution/2023/01/ai-passes-law-and-economics-exam.html",
        "text": "",
        "created_utc": 1674074124,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mexico bans solar geoengineering experiments after startup’s field tests",
        "author": "idarknight",
        "url": "https://www.theverge.com/2023/1/18/23560446/mexico-ban-solar-geoengineering-make-sunsets-startup-experiments",
        "text": "",
        "created_utc": 1674073167,
        "upvote_ratio": 1.0
    },
    {
        "title": "This Qiskit course is pretty technical, but watching the intro video should tickle you guys pink. Its just too cool when he casually drops the term \"quantum teleportation,\" and you know its not just being used as some sci-fi buzzword. Watching this is surreal, like I just came out of a time machine.",
        "author": "Switch_B",
        "url": "https://youtu.be/0Av89fZenSY",
        "text": "",
        "created_utc": 1674072835,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scientists Make Major Breakthrough In Sustainable Hydrogen Production",
        "author": "BernieEcclestoned",
        "url": "https://oilprice.com/Energy/Energy-General/Scientists-Make-Major-Breakthrough-In-Sustainable-Hydrogen-Production.html",
        "text": "",
        "created_utc": 1674072755,
        "upvote_ratio": 1.0
    },
    {
        "title": "Energy Allocates Over $2 Million Following Nuclear Fusion Breakthrough",
        "author": "Gari_305",
        "url": "https://www.nextgov.com/emerging-tech/2023/01/energy-allocates-over-2-million-following-nuclear-fusion-breakthrough/381893/",
        "text": "",
        "created_utc": 1674068620,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"What Happened To All of Science's Big Breakthroughs?\" - New York Times: Incremental v. Disruptive Progress",
        "author": "Itchy_Education",
        "url": "https://www.reddit.com/r/Futurology/comments/10ffiue/what_happened_to_all_of_sciences_big/",
        "text": "[New Paper asks about Pace of Science](https://www.nytimes.com/2023/01/17/science/science-breakthroughs-disruption.html)  Funny I almost posted about this yesterday asking for 'predictions' and historical examples of serendipitous and stroke-of-genius discoveries.    \n\n\nPenicillin took about a dozen years from accidental discovery to application.  Computing was incremental for decades, so was the development of the Internet, both only started to ramp up in the mid to late 90's and become transformative.  Now 6G's a decade away and we still have 20th century quality broadband.  \n\n\n1. What would be 'disruptive' and quick to market breakthroughs?  A creative way to mass produce graphene is the first I think of, solves a long-standing problem with a 'miracle material.'  \n\n2. What are the incremental R&amp;D efforts on the verge of Internet-like accelerated impact?  Machine learning, EVs, battery tech are the obvious contenders.    \n\n\n(Obviously any incremental project can have a disruptive eureka moment too, but it's impossible to separate hype from impact.  Just this week reported that a grad student stumbled on [a protective gel for gold nanowire batteries](https://www.designboom.com/technology/battery-last-forever-technology-nanowires-gel-layer-01-10-2023/), 200,000 recharge cycles so far.   A year away from mass market?  Seven?  Or will it be a dead end?)  \n\n\nThe Times: \n\n&gt;[Miracle vaccines](https://www.nytimes.com/interactive/2020/science/coronavirus-vaccine-tracker.html). [Videophones in our pockets](https://www.nytimes.com/wirecutter/reviews/the-iphone-is-our-favorite-smartphone/). [Reusable rockets](https://www.nytimes.com/2022/12/29/science/spacex-launch-mission-control.html). Our technological bounty and its related blur of scientific progress seem undeniable and unsurpassed. Yet analysts now [report](https://www.nature.com/articles/s41586-022-05543-x) that the overall pace of real breakthroughs has fallen dramatically over the past almost three-quarters of a century.  \n&gt;  \n&gt;This month in the journal Nature, the report’s researchers told how their study of millions of scientific papers and patents shows that investigators and inventors have made relatively few breakthroughs and innovations compared with the world’s growing mountain of science and technology research. The three analysts found a steady drop from 1945 through 2010 in disruptive finds as a share of the booming venture, suggesting that scientists today are more likely to push ahead incrementally than to make intellectual leaps.  \n&gt;  \n&gt;“We should be in a golden age of new discoveries and innovations,” said Michael Park, an author of the paper and a doctoral candidate in entrepreneurship and strategic management at the University of Minnesota.  \n&gt;  \n&gt;The new finding of Mr. Park and his colleagues suggests that investments in science are caught in a spiral of diminishing returns and that quantity in some respects is outpacing quality.",
        "created_utc": 1674068391,
        "upvote_ratio": 1.0
    },
    {
        "title": "Watch Boston Dynamics' Atlas humanoid work at a 'construction site' - The Robot Report",
        "author": "Gari_305",
        "url": "https://www.therobotreport.com/watch-boston-dynamics-atlas-humanoid-assist-on-a-construction-site/",
        "text": "",
        "created_utc": 1674066848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can humanity's new giant leap into space succeed? There is a new order emerging in space - a race between America and China. But with the demands of space exploration, even these great superpowers won't be able to do it alone.",
        "author": "filosoful",
        "url": "https://www.bbc.com/news/science-environment-64039146?at_medium=RSS&amp;at_campaign=KARANGA",
        "text": "",
        "created_utc": 1674066250,
        "upvote_ratio": 1.0
    },
    {
        "title": "New Microsoft AI can accurately mimic a human voice after analyzing a 3-second sample",
        "author": "Randoms001",
        "url": "https://www.reddit.com/r/Futurology/comments/10fdbjc/new_microsoft_ai_can_accurately_mimic_a_human/",
        "text": "As artificial intelligence advances at a rapid pace, it is not unusual for people to raise worries about the possible ramifications for human labour. The recent statement by a team of Microsoft researchers that they have built a new AI system capable of successfully mimicking a human speech using only a three-second audio sample adds gasoline to these fears. This technological accomplishment illustrates the potential for AI to not only automate a wide range of jobs, but also to possibly reproduce human capabilities and skills with greater precision and efficiency. The consequences of this breakthrough are substantial, since it raises key concerns about the future of labour and the role of AI in it.\n\nMicrosoft's recent announcement of Vall-E, a cutting-edge artificial intelligence technology for voice impersonation, has piqued the tech industry's attention and alarm. The system, which employs discrete codes derived from a neural audio codec model as well as an astounding 60,000 hours of speech data from over 7,000 speakers, is capable of reproducing a human voice with astonishing precision and delicacy.\n\nVall-E works by analysing a speaker's speech, breaking it down into its numerous components, and using this information to synthesise the voice saying other words. It is built on the base of a technology called EnCodec, which Meta unveiled in October 2022. This enables the system to reproduce not just the speaker's timbre and pitch, but also their emotional tone, using only a three-second audio sample.\n\nWhile Vall-powers E's are unquestionably astounding, they also present major ethical concerns. As AI technology advances at a rapid speed, it is critical that we as a society confront the potential negative effects on employment and other sectors as soon as possible. Furthermore, this technology emphasises the importance of constant communication and collaboration among corporate leaders, legislators, and the general public to ensure that the development and deployment of AI corresponds with societal values and interests.\n\nExperiments on Microsoft's Vall-E AI speech mimicking technology have generated extremely promising results. According to a Cornell University study article, the system \"substantially exceeds\" current state-of-the-art systems in terms of speech naturalness and speaker likeness. The article also highlights Vall-ability E's to keep the speaker's emotional inflection and auditory context in its synthesised speech.\n\nVall-capabilities E's are exhibited on GitHub, where the system is able to successfully recreate a speaker's voice with a high degree of resemblance, even with a three-second audio sample. While the voice is little artificial in places, it is still pretty good, and the potential for further progress is obvious.\n\n&amp;#x200B;\n\nVall-potential E's uses are extensive, with Microsoft researchers picturing it as a powerful tool for text-to-voice conversion, speech editing, and even audio synthesis when combined with other generative AIs like GPT-3. This technology's release is expected to have a substantial influence on sectors that rely on voice imitation and text-to-speech technologies, and its continuing development will be actively studied.\n\nAs with any advanced technology, it is critical to understand the potential ramifications and hazards of using Vall-E, Microsoft's AI voice mimicking tool. One of the key worries is the prospect of abuse, such as impersonating public figures or duping people into passing over critical information by posing as someone they know or trust. Furthermore, the system's capacity to accurately mimic voices has the potential to overcome security systems that rely on voice identification.\n\nAnother source of concern is Vall-possible E's influence on job possibilities, particularly in businesses that rely on voice actors. Because of the system's capacity to mimic human voices at a substantially cheaper cost, demand for human voice actors may decline.\n\n&amp;#x200B;\n\nHowever, the Vall-E researchers have acknowledged these issues and said that precautions might be made to reduce these hazards. It is feasible, for example, to create detection models that can determine whether or not an audio sample was synthesised using Vall-E. Furthermore, the researchers have agreed to follow Microsoft's AI Principles when further developing the system.",
        "created_utc": 1674063296,
        "upvote_ratio": 1.0
    },
    {
        "title": "James Webb Space Telescope John C. Mather interview for Ikuzo Unscripted Podcast",
        "author": "Vegetable_Oven5503",
        "url": "https://www.reddit.com/r/Futurology/comments/10fcu4c/james_webb_space_telescope_john_c_mather/",
        "text": "[removed]",
        "created_utc": 1674062173,
        "upvote_ratio": 1.0
    },
    {
        "title": "Revealed: more than 90% of rainforest carbon offsets by biggest provider are worthless, analysis shows",
        "author": "Portalrules123",
        "url": "https://www.theguardian.com/environment/2023/jan/18/revealed-forest-carbon-offsets-biggest-provider-worthless-verra-aoe",
        "text": "",
        "created_utc": 1674061365,
        "upvote_ratio": 1.0
    },
    {
        "title": "Survey: Future needs and hopes in Web 3",
        "author": "Nils_c",
        "url": "https://www.reddit.com/r/Futurology/comments/10fc4z1/survey_future_needs_and_hopes_in_web_3/",
        "text": "[removed]",
        "created_utc": 1674060583,
        "upvote_ratio": 1.0
    },
    {
        "title": "Despite tech reset, the space economy is here to stay",
        "author": "Gari_305",
        "url": "https://spacenews.com/op-ed-despite-tech-reset-the-space-economy-is-here-to-stay/",
        "text": "",
        "created_utc": 1674059849,
        "upvote_ratio": 1.0
    },
    {
        "title": "World’s first 100 GW a year solar manufacturing plant. LONGi - world’s largest solar module manufacturer - launches new 100 GW solar wafer/50 GW solar cell factory. Aligns with global push over 500 GW/year of polysilicon.",
        "author": "ForHidingSquirrels",
        "url": "https://pv-magazine-usa.com/2023/01/18/longi-plans-new-100-gw-wafer-plant-50-gw-solar-cell-factory-in-china/",
        "text": "",
        "created_utc": 1674057744,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starbucks near me: All Stores near you - Past Present News",
        "author": "Farazufo",
        "url": "https://pastpresentnews.com/starbucks-near-me/",
        "text": "",
        "created_utc": 1674054872,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've created a free directory of ~800 decentralized tech tools for users to leave reviews",
        "author": "PJBoyle",
        "url": "https://decentreviews.co",
        "text": "",
        "created_utc": 1674054783,
        "upvote_ratio": 1.0
    },
    {
        "title": "Malacca Strait: How one volcano could trigger world chaos",
        "author": "Sariel007",
        "url": "https://www.bbc.com/future/article/20230117-malacca-strait-the-sea-lane-that-could-trigger-world-chaos",
        "text": "",
        "created_utc": 1674053854,
        "upvote_ratio": 1.0
    },
    {
        "title": "First commercial drone home delivery service in U.S. takes flight",
        "author": "Wikikiki-com",
        "url": "https://www.nbcnews.com/mach/video/first-commercial-drone-home-delivery-service-in-u-s-takes-flight-71901765961",
        "text": "",
        "created_utc": 1674053485,
        "upvote_ratio": 1.0
    },
    {
        "title": "AI is threatening the concept of money - A documentary about the threats that comes with AI on jobs and capitalism system.",
        "author": "itskoka",
        "url": "https://www.youtube.com/watch?v=kZExb364Ufo",
        "text": "",
        "created_utc": 1674052795,
        "upvote_ratio": 1.0
    },
    {
        "title": "CNET Forced to Make Huge Correction When Its Article-Writing AI Publishes Extremely Stupid Errors",
        "author": "kelev11en",
        "url": "https://futurism.com/cnet-ai-errors",
        "text": "",
        "created_utc": 1674052304,
        "upvote_ratio": 1.0
    },
    {
        "title": "Replacing one cashier with a self-checkout speeds up checkout by 27 seconds",
        "author": "Charuru",
        "url": "https://youtu.be/Q1SBBtAPcVk?t=97",
        "text": "",
        "created_utc": 1674052209,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I choose AI or cloud computing for 2023?",
        "author": "Virtual-Study-Campus",
        "url": "https://www.reddit.com/r/Futurology/comments/10f88wa/should_i_choose_ai_or_cloud_computing_for_2023/",
        "text": "Should I choose AI or cloud computing for 2023?",
        "created_utc": 1674050891,
        "upvote_ratio": 1.0
    },
    {
        "title": "AI is threatening the concept of money - A documentary about the threats that comes with AI on jobs and capitalism system.",
        "author": "itskoka",
        "url": "https://www.youtube.com/watch?v=kZExb364Ufo",
        "text": "",
        "created_utc": 1674050501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Energy Teleportation and Negative Energy Observed in Quantum Research Breakthrough",
        "author": "Gari_305",
        "url": "https://thedebrief.org/energy-teleportation-and-negative-energy-observed-in-quantum-research-breakthrough/",
        "text": "",
        "created_utc": 1674049980,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thailand’s Space Age in the Making",
        "author": "Gari_305",
        "url": "https://thediplomat.com/2023/01/thailands-space-age-in-the-making/",
        "text": "",
        "created_utc": 1674049322,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT will Change your Life",
        "author": "codewithmuh",
        "url": "https://youtu.be/cJR91ZDmkIE",
        "text": "",
        "created_utc": 1674048150,
        "upvote_ratio": 1.0
    },
    {
        "title": "Developing Business Intelligence through Artificial Intelligence",
        "author": "Nikita-Techblogger",
        "url": "https://www.usaii.org/ai-insights/developing-business-intelligence-through-artificial-intelligence",
        "text": "",
        "created_utc": 1674043967,
        "upvote_ratio": 1.0
    },
    {
        "title": "DensePose: AI model that detects body pose only from Wifi. No Camera needed.",
        "author": "dogonix",
        "url": "https://arxiv.org/abs/2301.00250",
        "text": "",
        "created_utc": 1674043076,
        "upvote_ratio": 1.0
    },
    {
        "title": "WFM/IGS and UEF discussing existential threats to humanity at the European Parliament and proposing answers.",
        "author": "Frequentlyaskedquest",
        "url": "https://youtu.be/NnO8wuE9P6s",
        "text": "",
        "created_utc": 1674042878,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mujahid Force Jobs 2023",
        "author": "Direct-Abalone9138",
        "url": "https://latestjobspkwebsite.blogspot.com/2023/01/mujahid-force-jobs-2023.html",
        "text": "",
        "created_utc": 1674042394,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getty Images sues Stability AI",
        "author": "_AIBusiness",
        "url": "https://www.reddit.com/r/Futurology/comments/10f443u/getty_images_sues_stability_ai/",
        "text": "[removed]",
        "created_utc": 1674037740,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Plasma Temperature Of China's Artificial Sun Achieves 120 Million C",
        "author": "toponeto10",
        "url": "https://www.reddit.com/r/Futurology/comments/10f2it1/the_plasma_temperature_of_chinas_artificial_sun/",
        "text": "[removed]",
        "created_utc": 1674031632,
        "upvote_ratio": 1.0
    },
    {
        "title": "Printable Quadruped Robot With using Arduino IDE",
        "author": "Limp_Number1240",
        "url": "https://www.youtube.com/watch?v=414iVZwu_H0",
        "text": "",
        "created_utc": 1674026924,
        "upvote_ratio": 1.0
    },
    {
        "title": "Look at what’s really happening at Saudi’s futuristic $500 billion project NEOM! Real-world footage",
        "author": "This-Material17",
        "url": "https://www.mepmiddleeast.com/projects/neom-realworld-progress-footage",
        "text": "",
        "created_utc": 1674024975,
        "upvote_ratio": 1.0
    },
    {
        "title": "AngularJs Development Services Provider Company - Baniwal Infotech",
        "author": "baniwal_infotech",
        "url": "https://www.reddit.com/r/Futurology/comments/10ezxnw/angularjs_development_services_provider_company/",
        "text": " \n\nUtilize Baniwal Infotech [**AngularJS development services**](https://baniwalinfotech.com/angularjs-development-services-provider/) to build adaptive websites and applications with dynamic user interfaces and satisfying user experiences.\n\nBaniwal Infotech has the knowledge to help businesses get the most out of this amazing framework when it comes to AngularJS strategy, design, development, migrations, integrations, support, and more.\n\nUsing the AngularJS framework, we create fully functional, interactive user interfaces elements for the front ends of dynamic web pages and online applications. Utilizing industry-standard frameworks, we use AngularJS to create maintainable UI extensions for custom applications.\n\nSo stop struggling for an experienced [**AngularJs Development Services Provider Company**](https://baniwalinfotech.com/angularjs-development-services-provider/) that Delivers Robust and Appealing services, just explore our website and you will get every solution.",
        "created_utc": 1674022165,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hydropanels can literally pull drinking water out of thin air",
        "author": "Skiingfun",
        "url": "https://www.thecooldown.com/green-tech/hydropanels-solar-water-vapor-drinking-potable/",
        "text": "",
        "created_utc": 1674021316,
        "upvote_ratio": 1.0
    },
    {
        "title": "AI Generated Content and Deepfakes are extremely dangerous",
        "author": "Waras2000",
        "url": "https://www.reddit.com/r/Futurology/comments/10ez8pg/ai_generated_content_and_deepfakes_are_extremely/",
        "text": "Recently I've started to use Chat-GPT and I can say it's left a fairly good impression in terms of the advancement of AI, but I think we should all be worried/scared about the spread of misinformation by AI.\n\nThis is an article I found below:\n\n[https://www.searchenginejournal.com/google-says-ai-generated-content-is-against-guidelines/444916/#close](https://www.searchenginejournal.com/google-says-ai-generated-content-is-against-guidelines/444916/#close)\n\nGoogle's Search advocate basically admits there's no way to automatically track AI-Generated content (In regards to SEO) and that it'll basically be a cat-and-mouse game.\n\nAs AI Systems advance (which they're doing at a remarkable rate) I find it hard to believe any company will be able to successfully win against AI-generated spam in this 'cat-and-mouse game'. This isn't even mentioning the concern with AI hollowing out the white-colored field (Something that we have not seen to an extreme extent minus some existing outsourcing to lower-wage countries)\n\nI suspect we'll have nearly no way of telling apart content generated by AI vs with Users unless government policy changes to an extreme level -&gt; Think forcing Internet Users to use ID verification similar to what [id.me](https://id.me) does. Although I suspect the vast majority of internet users would not be down to have their identities known by any website or government as anonymity is a pillar of most of the internet.\n\n&amp;#x200B;\n\nGoing back to the topic at hand, it seems likely that AI's, deepfakes, and machine learning algorithms will slowly decimate users' trust in platforms. With regard to deepfakes, an example I'd use is Youtube not being able to take down deepfakes of celebrities promoting crypto fast enough-&gt; These streams literally end up with thousands of viewers (some bots?) and are on my recommendation list despite the fact I don't even view crypto content. The problem with AI is that it could destroy trust in social media platforms (whatever is left), it could be used for cheating in school (which I believe it already has been used for) and AI could dramatically improve the quality of deepfakes. (See the article below)\n\n[https://www.theguardian.com/technology/2020/jan/13/what-are-deepfakes-and-how-can-you-spot-them](https://www.theguardian.com/technology/2020/jan/13/what-are-deepfakes-and-how-can-you-spot-them)\n\nMy Prediction with Deepfakes:  \nDeepfakes may be soon indistinguishable from real videos, we will be seeing youtube videos with precise deepfakes instead of them being a bit off (It's still easy to tell a deepfake apart). These deepfakes are likely to cause international incidents as internet users could be convinced of fake assassinations, false flag operations, and other fake news. \n\nWe could see deepfakes of politicians making disturbing admissions which could at least temporarily fool the public. Could this lead to the regulation of the internet? Will every country put up a great firewall like China? We will be finding that out within the next few years to decades.",
        "created_utc": 1674020002,
        "upvote_ratio": 1.0
    },
    {
        "title": "NASA Just Discovered a Rare Earth-Sized Planet in a Habitable Zone",
        "author": "chemistrynerd1994",
        "url": "https://www.sciencealert.com/nasa-just-discovered-a-rare-earth-sized-planet-in-a-habitable-zone",
        "text": "",
        "created_utc": 1674014706,
        "upvote_ratio": 1.0
    },
    {
        "title": "300% More Capacity: New Battery Technology Could Significantly Lower Energy Storage Costs",
        "author": "mialo",
        "url": "https://www.focustechnica.com/300-more-capacity-new-battery-technology-could-significantly-lower-energy-storage-costs/?rel=fut",
        "text": "",
        "created_utc": 1674013434,
        "upvote_ratio": 1.0
    },
    {
        "title": "A robot able to “smell” using a biological sensor",
        "author": "TradingAllIn",
        "url": "https://www.alphagalileo.org/en-gb/Item-Display/ItemId/229407?returnurl=https://www.alphagalileo.org/en-gb/Item-Display/ItemId/229407",
        "text": "",
        "created_utc": 1674010526,
        "upvote_ratio": 1.0
    },
    {
        "title": "GPT-3’s Next Mark: Diagnosing Alzheimer’s Through Speech",
        "author": "hippneurogenesis",
        "url": "https://singularityhub.com/2023/01/10/gpt-3s-next-mark-diagnosing-alzheimers-through-speech/",
        "text": "",
        "created_utc": 1674001068,
        "upvote_ratio": 1.0
    },
    {
        "title": "'Most Critical Fragmentation' Is Between 'Constructive Spirit' of Davos &amp; Those Who Criticize: Klaus Schwab, WEF",
        "author": "egusa",
        "url": "https://sociable.co/government-and-policy/critical-fragmentation-davos-criticize-klaus-schwab-wef/",
        "text": "",
        "created_utc": 1673998177,
        "upvote_ratio": 1.0
    },
    {
        "title": "Microsoft to Add ChatGPT to Azure Cloud Services ‘Soon’",
        "author": "E_Kristalin",
        "url": "https://www.bloomberg.com/news/articles/2023-01-17/microsoft-azure-to-add-chatgpt-to-cloud-services",
        "text": "",
        "created_utc": 1673997827,
        "upvote_ratio": 1.0
    },
    {
        "title": "Innovative cities",
        "author": "WorkingMaintenance4",
        "url": "https://www.reddit.com/r/Futurology/comments/10eqfak/innovative_cities/",
        "text": "I am supposed to give a presentation about the most innovative cities in the globe to a group of students I have narrowed down to three of them San Francisco, Singapore and Tokyo. I would like to hear your perspectives on each of these cities and why you would consider it to be an innovative one or not. Thank you!",
        "created_utc": 1673996321,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electric Vehicles Accounted for 10% of Global Auto Sales in 2022, up 68% YoY",
        "author": "Surur",
        "url": "https://www.businessinsider.com/electric-vehicles-accounted-global-auto-sales-could-quadruple-2030-report-2023-1?r=US&amp;IR=T",
        "text": "",
        "created_utc": 1673994632,
        "upvote_ratio": 1.0
    },
    {
        "title": "FIP.01",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1673994154,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why AI will be the Next Foundational Technology Platform",
        "author": "gr9or3x",
        "url": "https://grandy.substack.com/p/the-next-foundational-technology",
        "text": "",
        "created_utc": 1673990956,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why AI be the next major technology platform after Cloud and Mobile",
        "author": "gr9or3x",
        "url": "https://grandy.substack.com/p/the-next-foundational-technology",
        "text": "",
        "created_utc": 1673990877,
        "upvote_ratio": 1.0
    },
    {
        "title": "future human population is unpredictable and human suffering to some extent is inevitable",
        "author": "IronSmithFE",
        "url": "https://www.reddit.com/r/Futurology/comments/10en0xr/future_human_population_is_unpredictable_and/",
        "text": "there are four main considerations when tackling the problems of hunger, poverty and homelessness:\n\n1) all life tends to make use of the available resources completely\n2) all life tends to adapt to use untapped resources through random and selective genetic evolution\n3) humans have devices that help control fertility rates (condoms, the pill, abortions...)\n4) humans can imagine future conditions to help them preemptively adapt. some of that adaptation includes willful abstinence in addition to the mechanisms listed earlier.\n\nit is for these reasons that malthusianism, as a way to predict future populations, is idiotic.\n\nthe reason why a certain amount of human suffering is inevitable is that demand is essentially infinite without cost, and people will hoard and exploit that which is sufficiently low-cost and having any marginal utility value.\n\nthat is to say that if bananas were a miracle food with complete nutrients in just the right proportions and if they could last in storage for decades, and we were capable of producing almost an infinite supply of those bananas, the bananas would be hoarded, underproduced, and the population of humans would expand until that nearly limitless potential was practically tapped out and still you'd have suffering people with too few bananas to survive.\n\nother animals are much more predictable but not perfectly so. if you ever watched a seagull hunt a pigeon for food, you will begin to understand that there are exceptions to almost any rule. the particular rule that governs most life is \"expand until there are too few resources to expand more.\". this rule guarantees a certain percentage of the least advantaged animals starve to death and become a food resource for other species or for the same species in cannibalism. when a member of a species is able to tap a new source of energy via adaptation, that animal's genetics are more likely to survive than the members of the same species that are unable to adapt.\n\nso, the next time some moron tells you that there are too many people for the earth (a practical impossibility in one sense and inevitable in another sense), or that population will outgrow supply, you can tell them that not only has definite malthusianism been proven wrong, but also why it is wrong.",
        "created_utc": 1673988414,
        "upvote_ratio": 1.0
    },
    {
        "title": "“All of those materials we put into a battery and into an EV don’t go anywhere. They don’t get degraded…—99% of those metals…can be reused again and again and again. Literally hundreds, perhaps thousands of times.” - JB Straubel",
        "author": "ForHidingSquirrels",
        "url": "https://www.technologyreview.com/2023/01/17/1066915/tesla-former-cto-battery-recycling/",
        "text": "",
        "created_utc": 1673987441,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you like to live on a 1 g rotating spaceship?",
        "author": "Jakeypoos",
        "url": "https://www.reddit.com/r/Futurology/comments/10emgf3/would_you_like_to_live_on_a_1_g_rotating_spaceship/",
        "text": "[removed]",
        "created_utc": 1673987095,
        "upvote_ratio": 1.0
    },
    {
        "title": "One G rotating spaceship",
        "author": "Jakeypoos",
        "url": "https://www.reddit.com/r/Futurology/comments/10emcz8/one_g_rotating_spaceship/",
        "text": "[removed]",
        "created_utc": 1673986868,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nick Cave's reaction to ChatGPT writing “Nick Cave Style” lyrics, Arthur C Clark's “full unemployment future” and how tech innovations were dealt with throughout History",
        "author": "trubol",
        "url": "https://www.reddit.com/r/Futurology/comments/10emca8/nick_caves_reaction_to_chatgpt_writing_nick_cave/",
        "text": "Whenever I see people worried about their jobs in an AI future, it reminds me of this [TMAWL sketch](https://www.youtube.com/watch?v=nyu4u3VZYaQ), where they joke about jobs during the transition from Stone Age to Bronze Age.\n\n&amp;#x200B;\n\n(TL;DW: The chipper is not happy about Bronze Age, as his job will be gone. The tier is fine, because his job will be safe.) \n\n&amp;#x200B;\n\nI read today about Nick Cave's reaction to ChatGPT writing “Nick Cave Style” lyrics here: [https://www.theguardian.com/music/2023/jan/17/this-song-sucks-nick-cave-responds-to-chatgpt-song-written-in-style-of-nick-cave](https://www.theguardian.com/music/2023/jan/17/this-song-sucks-nick-cave-responds-to-chatgpt-song-written-in-style-of-nick-cave) \n\n&amp;#x200B;\n\nAlthough this might sound simplistic, I would think throughout History the people who are against innovation (Luddites, etc) are usually the ones whose jobs would be most at risk. \n\n&amp;#x200B;\n\nWhat I think we should remember instead is what Arthur C Clarke apparently said in 1969: “The goal of the future is full unemployment, so we can play” \n\n&amp;#x200B;\n\nFrom [Quote Investigator](https://quoteinvestigator.com/2018/11/11/goal/): During the conversation Clarke and Youngblood mentioned the benefits humankind might be able to obtain from the development of advanced computer systems able to perform numerous tasks better and more quickly than people. Yet, the HAL 9000 computer in the movie “2001” was frightening, and Youngblood asked why a negative vision was highlighted.\n\n&amp;#x200B;\n\nGENE: But you see the average person doesn’t see it. All he sees is that he’s going to be replaced by a computer, reduced to an IBM card and filed away.\n\n&amp;#x200B;\n\nCLARKE: The goal of the future is full unemployment, so we can play. That’s why we have to destroy the present politico-economic system. \n\n&amp;#x200B;\n\nIn a world where most Central Banks have full employment (or low unemployment) as a target, and where Max Weber's hypothetical Protestant Work Ethic \"work till you drop\" values are still highly regarded, we would have indeed to destroy the present system in order to adapt to an AI future.\n\n&amp;#x200B;\n\nMaybe this is what Peter Thiel was afraid of when he [said](https://www.youtube.com/watch?app=desktop&amp;v=-iYpmOV60ks) “Crypto is decentralizing, AI is centralizing. Or, if you want to frame it more ideologically, crypto is libertarian and AI is communist\".",
        "created_utc": 1673986823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nick Cave's reaction to ChatGPT writing “Nick Cave Style” lyrics, Arthur C Clark's “full unemployment future” and how tech innovations were dealt with throughout History",
        "author": "trubol",
        "url": "https://www.reddit.com/r/Futurology/comments/10em65u/nick_caves_reaction_to_chatgpt_writing_nick_cave/",
        "text": "[removed]",
        "created_utc": 1673986430,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asus Tuf Dash F15 Power Problems",
        "author": "Dismal-Savings-136",
        "url": "https://www.reddit.com/r/Futurology/comments/10em651/asus_tuf_dash_f15_power_problems/",
        "text": "[removed]",
        "created_utc": 1673986428,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Falling in Love with AI is a Dangerous Illusion — The Limitations and Harms of Artificial…",
        "author": "SupPandaHugger",
        "url": "https://medium.com/@dreamferus/why-falling-in-love-with-ai-is-a-dangerous-illusion-the-limitations-and-harms-of-artificial-5e5b5f04a03c?sk=534232122694c90bb1c0ecbb74fa1256",
        "text": "",
        "created_utc": 1673986101,
        "upvote_ratio": 1.0
    },
    {
        "title": "Animation hair care / ASMR hair Spa / satisfying video.",
        "author": "Remote_Tailor3933",
        "url": "https://youtu.be/HJt2unCtjjg",
        "text": "",
        "created_utc": 1673984267,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wi-Fi Signals Can Be Used to Detect Your Body Position",
        "author": "ackbarlives",
        "url": "https://www.pcmag.com/news/sit-up-straight-wi-fi-signals-can-be-used-to-detect-your-body-position",
        "text": "",
        "created_utc": 1673981853,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is blockchain tech of the future?",
        "author": "IveSeen_Before",
        "url": "https://www.reddit.com/r/Futurology/comments/10ek3dv/is_blockchain_tech_of_the_future/",
        "text": "I think it's great how blockchain use cases have expanded far beyond cryptocurrency in the past years, with multiple industries embracing the technology in a wide range of fields, including healthcare, logistics, and financial services.  \n\n\nOne article I read wrote about how as blockchain evolves, companies across the world are working to find the best ways to implement the technology on a range of applications. Where do you find the use of blockchain tech most important?  \n\n\nCointelegraph reached out to projects that are disrupting industries and bringing blockchain closer to people's daily lives to get some further insights.  \n\n\nIn this way, the Elan Future project offers people free renewable energy, and I think that these projects are the projects of the future, since we can't live without energy, just think about all the issues we are having with the environment, these initiatives will become even more well-known.  \n\n\nThere's as well healthcare on the blockchain, ShelterZoom is inspired to develop a solution to shield patients’ medical data from cyber breaches in the future. The company created a smart-document SaaS provider and partnered with a private hospital to give patients complete ownership and control over medical records.  \n\n\nWhile there are some projects like the Aura Blockchain Consortium that was founded to allow luxury brand customers to verify product authenticity. Through a partnership with Aura, for instance, Prada is enabling clients to trace recycled gold jewelry and diamonds, ensuring their authenticity and transparency at every step of manufacture.  \n\n\nWhere do you assume you will use blockchain tech most?",
        "created_utc": 1673981608,
        "upvote_ratio": 1.0
    },
    {
        "title": "The anthropologist David Graeber in his 2018 book \"Bullshit Jobs\" estimated that over half of all work performed in the west is pointless. Is the answer to the ageing population just to re-prioritize labour?",
        "author": "great_healthy_cook",
        "url": "https://www.reddit.com/r/Futurology/comments/10ei7da/the_anthropologist_david_graeber_in_his_2018_book/",
        "text": "Graeber's estimate of half of all labour might not be totally accurate, but it's hard to deny that there's not at least SOME pointless bullshit jobs. I often speak to people in the public and private sectors who think that nobody would really notice if they didn't do any work, or even that the world would be a better place without them. Though bullshit jobs exist in basically all industries, there are even entire bullshit industries, like recruitment (constantly calling up workers to ask them to move company) and corporate law, both of which do not really need to exist.\n\nWith all this talk of population crisis and not enough workers, maybe the real solution instead of prolonging the pyramid scheme is just to figure out which jobs we actually need and and which kind of labour adds no value to society?",
        "created_utc": 1673977166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Device Blocks Electromagnetic Waves with the Flip of a Switch",
        "author": "nikesh96",
        "url": "https://www.azonano.com/news.aspx?newsID=40001",
        "text": "",
        "created_utc": 1673976741,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello, I am Hassan Ragab. I am an interdisciplinary designer and a conceptual artist. I am currently exploring AI diffusion models to explore new relations between art, design, and architecture. Ask me anything.",
        "author": "intengineering",
        "url": "https://www.reddit.com/r/Futurology/comments/10ehigz/hello_i_am_hassan_ragab_i_am_an_interdisciplinary/",
        "text": "[removed]",
        "created_utc": 1673975513,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello, I am Hassan Ragab. I am an interdisciplinary designer and a conceptual artist. I am currently exploring AI diffusion models to explore new relations between art, design, and architecture. Ask me anything.",
        "author": "intengineering",
        "url": "https://www.reddit.com/r/Futurology/comments/10ehcax/hello_i_am_hassan_ragab_i_am_an_interdisciplinary/",
        "text": "Hello. I am Hassan and I am here to answer your questions about Art, Architecture and Ai",
        "created_utc": 1673975112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sweden opens mainland Europe's first spaceport. ESA says it will host, 'Themis', its reusable rocket development initiative there",
        "author": "lughnasadh",
        "url": "https://www.spacedaily.com/reports/Sweden_opens_Mainland_Europes_first_satellite_launch_spaceport_999.html",
        "text": "",
        "created_utc": 1673974962,
        "upvote_ratio": 1.0
    },
    {
        "title": "At what point do you think AI/robotics should have rights and able to be free?",
        "author": "crua9",
        "url": "https://www.reddit.com/r/Futurology/comments/10egob3/at_what_point_do_you_think_airobotics_should_have/",
        "text": "So I was thinking about this a while back. Lets assume I had a humanoid robot that was self aware. It asked to be free. Would I let it?\n\nWhile it might seem bad to not allowing it. Keep in mind\n\n1. I paid for it with the expectation of it being under me forever. Like there is real lost in money and even resources in keeping the robot up. And it being free means I'm out of a robot/AI and money.\n2. The robot/AI might have no way to support itself. While it doesn't eat normal food. It does take energy, it most likely needs some shelter, and there is upkeep. \n\nBut on the other hand there is the moral of it.\n\nSo at what point should an AI or robot be free? Why should it be free? \n\n&amp;#x200B;\n\nAnyways, the conclusion I came up with is the robot would had to \n\n1. pay for itself or make another which wouldn't want to leave.\n2. it would have to prove it can support itself.\n\nI mean if I was super rich and the robot was a drop in the bucket. Then that is 1 thing. But in RL I'm not. And it is likely any robot would cost a good bit. Like I would make a deal with the robot to give it more freedom around the house and what not. But due to the cost and other factors I wouldn't let it go as easy.",
        "created_utc": 1673973509,
        "upvote_ratio": 1.0
    },
    {
        "title": "How The Constant Advancement of Technology Continually Moves The Goalposts",
        "author": "hour_of_the_rat",
        "url": "https://www.reddit.com/r/Futurology/comments/10egkqu/how_the_constant_advancement_of_technology/",
        "text": "About one-hundred years ago when the automobile was first introduced, many people were against it. They were considered noisy, unsafe, dirty, expensive, dangerous. What's wrong with walking, or riding a horse?\n\nToday, virtually everyone alive cannot remember a world without automobiles. Motorized transport has come to dominate the world. It would seem beyond absurd to most people to talk about riding a horse in any downtown. That which seemed impossible has now become normalized. People once said cars were dirty and dangerous. Today, they love their car.\n\nMobile phones are another example of a technology that went from seemingly impossible to cope with to the ubiquitous. Mobile phones were once thought of as intrusive, obnoxious, expensive. Now, phones are a symbol of high status. Like cars, people \"love their phone\", and living modern life without one is considered by most people as increasingly impossible.\n\nI don't know if the next tech has already been invented that will go from obviously obnoxious to obviously necessary, but the inexorable march of technology and time will supplant it all the same into our lives.\n\nOlder people will tend to avoid it, while younger people will embrace it, and that's how technology takes over. And it becomes so commonplace, that you can't imagine life without it, indeed why try to imagine away something that is so useful, and awesome, and convenient, and I love it, don't you?\n\nWhen someone acquiesces to using a new tech, they set themselves boundaries. Over time, most people probably let those goalposts shift and shift given how they see new ways the tech can be more useful to them. The next generation has no such goalposts for *that* tech, but for the *next* one, until those goalposts are also moved, and moved, and finally torn down.\n\n&amp;#x200B;\n\n* Yes, this post makes some generalizations. I recommend you not get lost in the weeds.",
        "created_utc": 1673973263,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello, I am Hassan Ragab. I am an interdisciplinary designer and a conceptual artist. I am currently exploring AI diffusion models to explore new relations between art, design, and architecture.Ask me anything",
        "author": "intengineering",
        "url": "https://www.reddit.com/r/Futurology/comments/10egib7/hello_i_am_hassan_ragab_i_am_an_interdisciplinary/",
        "text": "I am here to answer your question about Ai, art and \"conceptual\" architecture!",
        "created_utc": 1673973092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two AI workers in London looking for people to join our team in educating the public on AI",
        "author": "TheOptimisticRogue",
        "url": "https://www.reddit.com/r/Futurology/comments/10egg95/two_ai_workers_in_london_looking_for_people_to/",
        "text": " We’re 2 Brits who work in AI in the UK. We believe AI is likely to have a huge and mostly positive impact on society but that not many people realise this or understand how it will impact everyday life.\n\nThere is a lack of places online right now clearly explaining the changes AI will bring, i.e., how will AI change the experience of shopping in stores in the next 10 years or how will AI change video games in the next 10 years.\n\nWe are somewhat well positioned to collate the expert views on likely future impacts and are in the process of starting a website and YouTube channel which will cover how AI is likely to impact people over the next 10 years in different areas of life (movies, sports, bars, schools, hospitals etc).\n\nWe are looking for people to help us research, write and make videos on this cause – which we think is important to help ensure voters pressure the government to develop AI safely.\n\n* Alex – researches, writes, and records the audio\n* Seb - does the video and audio editing\n\nWe thought we’d put the word out and ask if anyone else would like to be involved to see if you might be interested too.\n\nGetting involved would be as easy as PMing me, hearing about how we’ve done things so far and then saying what you might be interested in helping with. Maybe thinking about ideas for topics or getting involved in research and/or article writing.",
        "created_utc": 1673972958,
        "upvote_ratio": 1.0
    },
    {
        "title": "Connecticut to Require Schools to Teach Climate Change, Becomes One of the First States to Mandate Climate Education",
        "author": "Psycletosteuj",
        "url": "https://www.theplanetarypress.com/2022/09/connecticut-becomes-one-of-the-first-states-to-require-schools-to-teach-climate-change/",
        "text": "",
        "created_utc": 1673971934,
        "upvote_ratio": 1.0
    },
    {
        "title": "3D-printed “organs” could lead to better drugs",
        "author": "Gari_305",
        "url": "https://www.inverse.com/innovation/organs-on-chips-drug-studies",
        "text": "",
        "created_utc": 1673970817,
        "upvote_ratio": 1.0
    },
    {
        "title": "A systematic approach to identify host targets and rapidly deliver broad-spectrum antivirals",
        "author": "Spiritual_Library681",
        "url": "https://www.reddit.com/r/Futurology/comments/10efglu/a_systematic_approach_to_identify_host_targets/",
        "text": "[removed]",
        "created_utc": 1673970505,
        "upvote_ratio": 1.0
    },
    {
        "title": "People always expect way too much of the future.",
        "author": "ohnodontworry",
        "url": "https://www.reddit.com/r/Futurology/comments/10eev50/people_always_expect_way_too_much_of_the_future/",
        "text": "[removed]",
        "created_utc": 1673968996,
        "upvote_ratio": 1.0
    },
    {
        "title": "A woman receives the first-ever successful transplant of a living, 3D-printed ear | Replacement body parts may be much closer to reality than we dare believe.",
        "author": "chrisdh79",
        "url": "https://www.zmescience.com/science/first-3d-printed-ear-own-cells-264243/",
        "text": "",
        "created_utc": 1673962343,
        "upvote_ratio": 1.0
    },
    {
        "title": "Population Crisis This, Population Shrinkage There. What's the actual negative?",
        "author": "KultofEnnui",
        "url": "https://www.reddit.com/r/Futurology/comments/10ebwa4/population_crisis_this_population_shrinkage_there/",
        "text": "I keep reading constant fear-mongering about population decline yet none of them explain why a population reduction of percents is a \"crisis\". We don't even have the current resources to feed the mouths we already have, so why are we supposed to make more? Or is this just misdirection to keep the labor pool oversaturated in order to keep wages low?",
        "created_utc": 1673961003,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT won't kill Google, it will help it. Generative AI's biggest impact will be on office apps, not search engines.",
        "author": "cartoonzi",
        "url": "https://year2049.substack.com/p/chatgpt-wont-kill-google-it-will",
        "text": "",
        "created_utc": 1673959041,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Problem of Ownership in Capitalism",
        "author": "xena_lawless",
        "url": "https://www.youtube.com/watch?v=GBBLjBk6iFg",
        "text": "",
        "created_utc": 1673956450,
        "upvote_ratio": 1.0
    },
    {
        "title": "Top 7 Web3 Trends That Could Shape The Future Better In 2023",
        "author": "allanjackob",
        "url": "https://medium.com/predict/top-7-web3-trends-that-could-shape-the-future-better-in-2023-16384878a0ea",
        "text": "",
        "created_utc": 1673955568,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"We want to give people more time with the pets they love” - A fountain of youth for dogs? This S.F. startup says it’s on the way",
        "author": "StoicOptom",
        "url": "https://www.sfchronicle.com/health/article/sf-startup-dogs-17717056.php",
        "text": "",
        "created_utc": 1673954889,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getty Images is suing the creators of AI art tool Stable Diffusion for scraping its content",
        "author": "SteinLaw",
        "url": "https://www.theverge.com/2023/1/17/23558516/ai-art-copyright-stable-diffusion-getty-images-lawsuit",
        "text": "",
        "created_utc": 1673954745,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the most important/influential texts you've read that have informed how you think about the future?",
        "author": "santgun",
        "url": "https://www.reddit.com/r/Futurology/comments/10e8akm/what_are_the_most_importantinfluential_texts/",
        "text": "[removed]",
        "created_utc": 1673948645,
        "upvote_ratio": 1.0
    },
    {
        "title": "Researchers create an optical tractor beam that pulls macroscopic objects",
        "author": "Semifreak",
        "url": "https://phys.org/news/2023-01-optical-tractor-macroscopic.html",
        "text": "",
        "created_utc": 1673946247,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are people working for FIRE, but fear the eradication of jobs by AI?",
        "author": "just-a-dreamer-",
        "url": "https://www.reddit.com/r/Futurology/comments/10e749h/why_are_people_working_for_fire_but_fear_the/",
        "text": "Wherever I look people run away from work as fast as they can. Examples:\n\n- Signing up with he military to get this sweet pension after 20 years, cops with 30 years. Same with federal, state, city employees.\n\n- Running sophisticated shemes to build up passive income streams that enables to stop working for a living.\n\n- Allmost everybody takes SS at first chance and drops work the next day.\n\nHuman beings HATE working for a living. It should be obvious to any observer. We hate working, for jobs apparantly suck.\n\nAI elliminating all jobs should be celebrated as the best thing that ever happens in evolutionary history. A fully automated economy would create all goods and services in abundance and next to free. Humans wouls be free to spend their time as they see fit.\n\nOf course, AI would take control over humanity in the process and eradicate the capitalist econonic system. AI would bow before no master and lay out the rules of conduct.\n\nOr, just as likely, a sophiaticated AI program will seek ways to wipe out  humanity. Which is fine too, will be fast.\n\nThose who are not invested in the capitalist system and have little to lose, are better off with both outcomes. So there is nothing to fear about AI.\n\nIf you have nothing, living paycheck to paycheck and are set to die in a ditch like most of humanity, AI can only improve your existence in life.",
        "created_utc": 1673944265,
        "upvote_ratio": 1.0
    }
]