[
    {
        "title": "Pulling together different technologies to make interstellar colonization possible",
        "author": "matthewgdick",
        "url": "https://www.reddit.com/r/Futurology/comments/101f3r5/pulling_together_different_technologies_to_make/",
        "text": "Here are some fascinating articles and links about seemingly unrelated technologies:  \n1. [Uploading memories into the cloud using Nuralink](https://www.cnbc.com/amp/2022/04/08/elon-musk-humans-could-eventually-download-their-brains-into-robots.html).  \n2. [Impressive advances made in humanoid robots by Boston Dynamics](https://youtube.com/watch?v=tF4DML7FIWk).  \n3. [Babies being born 30 years after being frozen as embryos](https://www.insider.com/twins-born-30-years-after-they-were-frozen-as-embryos-2022-11?amp).  \n4. [Seeds that are thousands of years old being able to sprout and grow](https://www.npr.org/templates/story/story.php?storyId=4706151).  \n\nSo here is the concept to pull it together:  \n1. Use Neuralink to make a digital clone of a colony builder’s mind, by uploading a lifetime of data into the cloud and making a digital clone of the person using the latest in deep learning neural network AI. \n2. Put it in the body of a humanoid robot. \n3. Send it with frozen human embryos and seeds on a seedship to an exoplanet hundreds (or thousands) of light years away. \n4. Land on an earth-like exoplanet and build a new civilization with the human minded robot serving as caretaker to get the first round of people born and raised until they can take over. \n\nI found this idea interesting enough to write a sci-fi book about it.  Do you think the concept is possible or would it just be science fiction?",
        "created_utc": 1672672836,
        "upvote_ratio": 1.0
    },
    {
        "title": "Xiaomi Smart TV X50 पुनरावलोकन: बजेटमधील सर्वोत्तम Android LED स्मार्ट टीव्हींपैकी",
        "author": "ittechmarathi",
        "url": "https://ittechmarathi.blogspot.com/2023/01/xiaomi-smart-tv-x50-android-led.html",
        "text": "",
        "created_utc": 1672665579,
        "upvote_ratio": 1.0
    },
    {
        "title": "Buy Google Voice Accounts Or Buy USA Phone Number",
        "author": "Dramatic-Bass5392",
        "url": "https://getpvaaccount.com/buy-google-voice-accounts/",
        "text": "",
        "created_utc": 1672664701,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inventor 2022 (upcoming project)",
        "author": "FunFact786",
        "url": "https://invention12398.blogspot.com/2022/07/inventor-2022.html",
        "text": "",
        "created_utc": 1672664622,
        "upvote_ratio": 1.0
    },
    {
        "title": "Telegram's new अपडेटमध्ये blur tool सह सुधारित media editor समाविष्ट आहे",
        "author": "ittechmarathi",
        "url": "https://ittechmarathi.blogspot.com/2023/01/telegrams-new-blur-tool-media-editor.html",
        "text": "",
        "created_utc": 1672664519,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why large language models like ChatGPT are very unlikely to be conscious. Our best evidence shows consciousness is computed enlisting substrate, not abstracting it away like in the digital computation paradigm. So we can use many substrates, but we need to design explicitly for consciousness.",
        "author": "Gmroo",
        "url": "https://mentalcontractions.substack.com/p/not-artificially-conscious",
        "text": "",
        "created_utc": 1672664127,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Single Hormone in Men May Predict Their Future Health",
        "author": "Realistic-Plant3957",
        "url": "https://www.sciencealert.com/a-single-hormone-in-men-may-predict-their-future-health",
        "text": "",
        "created_utc": 1672660823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mars colonization simulation (2031-2068)",
        "author": "Adventurous_Board781",
        "url": "https://youtu.be/O45y5wxfKHA",
        "text": "",
        "created_utc": 1672653065,
        "upvote_ratio": 1.0
    },
    {
        "title": "Prompt Extension Ai tool. Creates multiple enhanced art prompts from a seed prompt. Generates random",
        "author": "Subash_C_Mahato",
        "url": "https://www.promptextend.com/",
        "text": "",
        "created_utc": 1672650424,
        "upvote_ratio": 1.0
    },
    {
        "title": "A new weight loss drug could become the best-selling drug of all time. Who can afford it? In 2023, the FDA will likely approve Eli Lilly's diabetes drug tirzepatide for weight loss — but there's little indication insurers will widely cover the medication.",
        "author": "filosoful",
        "url": "https://www.nbcnews.com/news/rcna60422",
        "text": "",
        "created_utc": 1672647860,
        "upvote_ratio": 1.0
    },
    {
        "title": "Prompt Extension Ai tool. Creates multiple enhanced art prompts from a seed prompt. Generates random prompt.",
        "author": "Subash_C_Mahato",
        "url": "https://www.promptextend.com/",
        "text": "",
        "created_utc": 1672641492,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to improve cloud computing efficiency?",
        "author": "Shoddy-Attorney-5522",
        "url": "https://www.reddit.com/r/Futurology/comments/1012ue1/how_to_improve_cloud_computing_efficiency/",
        "text": "[removed]",
        "created_utc": 1672632516,
        "upvote_ratio": 1.0
    },
    {
        "title": "Easy 2 Convert EMF to IMAGE v2.9 Latest Version Download | universeofsoftware.com",
        "author": "Pristine-Wonder-9906",
        "url": "https://www.reddit.com/r/Futurology/comments/1011362/easy_2_convert_emf_to_image_v29_latest_version/",
        "text": "[removed]",
        "created_utc": 1672627302,
        "upvote_ratio": 1.0
    },
    {
        "title": "Researchers propose new structures to harvest untapped source of freshwater- moisture over ocean surfaces | ShutterBulky",
        "author": "chilispicedmango",
        "url": "https://www.shutterbulky.com/harvesting-untapped-source-of-freshwater/",
        "text": "",
        "created_utc": 1672622269,
        "upvote_ratio": 1.0
    },
    {
        "title": "Technology from now until 7 years from now in 2030 how do you think it will change and overall progress by then?",
        "author": "LatterCardiologist47",
        "url": "https://www.reddit.com/r/Futurology/comments/100ytbr/technology_from_now_until_7_years_from_now_in/",
        "text": "Like what will smart phones by like from 2025 to 2030? Or 5G? Or anything really military tech or computers to AI.",
        "created_utc": 1672620937,
        "upvote_ratio": 1.0
    },
    {
        "title": "India ready to launch its first Atmanirbhar human space flight Gaganyaan by 2024",
        "author": "Gari_305",
        "url": "https://www.businessinsider.in/science/news/india-ready-to-launch-its-first-atmanirbhar-human-space-flight-gaganyaan-by-2024/articleshow/96664209.cms",
        "text": "",
        "created_utc": 1672617173,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm out of options. this technology is dangerous. please take seriously.",
        "author": "Happy-Job-8164",
        "url": "https://www.reddit.com/r/Futurology/comments/100x3wv/im_out_of_options_this_technology_is_dangerous/",
        "text": "Hi my name is Brian and I am in desperate need of help. There is something terrible going on that needs to be investigated. I started being communicated with by a group in July 2020. This group started to ask me questions about my allegiances to the United States and how I felt about certain issues. They asked me if I would go to certain places if asked to observe if they paid me. When I declined they informed me that I passed there \"test\" and that I was selected to participate in a goverment sanctioned program. I was to participate in this program with the promise of being paid at the end. One rule that couldnt be broken is that you cant tell anyone about the program or anyone involed in it. As deadline after deadline passed I kept questioning the validity of what they were telling me such as what is the true objective of the program and when would my participation end. With each deadline there was a new reason for what the program was for and what it entailed. The reasons given for changing these aims and deadlines made sence at the time. I used to do work every single day for the program and educated myself on the topics that went with that training. The big deadline was an arbitrary date they said was the year mark of Oct 29th which was when this training started. This date came and  went and I stopped believing anything they told me. Now what I'm being told is they are a group I am unaware of and they are testing our governments responce to this new technology. There is a technology out there called brain to computer interfaces or bcis. https://youtu.be/CgFzmE2fGXA that is a youtube link that explains what it is and if you dont watch it you wont be able to connect what im about to tell you with the seriousness of the situation. It's the same technology that allows a amputee to move an arm with there mind. This is the technology that they use to communicate with me and what someone can do to a person with it is down right scary.  I can't get away with a thought without them knowing.  I went to the FBI for help and they hung up on me after saying thank you for the information before I could even finish. I called back and said im giving you information about a threat to national security and your not even going to investigate it or have me be debriefed by an agent? They pretty much did the same thing as the operator before and said thank you for the information and hung up. Around august of the year before i was being threatened and tormented by these people when i called the fbi twice one night to report it (they had me believe they were actually killing people) and i pretty much recieved the same kind of responce (at this time i had no idea this technology existed and couldnt piece together exactly how they were communicating with me). Since the fbi wouldnt tell me what to do i ubered there from salem to chelsea mass late at night and knocked on there window to report what i was being told only to have them tell me i couldnt speak to someone they were closed. It was then I was first convinced this was a goverment program. The problem with reporting this is most people including doctors have never heard of bcis or are completely uninformed. So when you explain to someone what it is I'm telling you they hear \"someone is communicating with me with there mind\" and instantly write you off. It was at this point the unsub ( unidentified subject) attempted to persuade me into believing they were with out goverment. Asking me if i thought the FBI would brush off a threat like that if they didnt already know about it. Now imagine as I'm reporting this to the FBI the people who I now call my captors are communicating with me the entire time and laughed when I was hung up on. When I first started thinking about telling people they drove me to the brink of what I could handle but have at times changed positions and even encouraged me. I  am going to tell as many people as I can until however this concludes. At one point they were terrorizing my mind and told me it was not going to stop until I committed suicide and since I have not been able to get someone to look into this they will never be caught. I am going to start sending this out to the news media soon but am trying to go through the proper channels but the problem is who do you report this kind of thing to? I have gone to the FBI, homeland security by email, the hospital, psychiatrist and even a neurologist all of whom are people that have never heard of the technology so even if I were believed they wouldn't know what to do. I have an EEG scheduled that was scheduled by the neurologist to see if the readings are normal but there are a few problems there. One being how will a neurologist who has never even heard of a bci know what to look for and what if these people do what they say there going to do and shut it off during the testing.  They tell me it would be challenging for someone who knows about the technology to find never mind one who hasnt. I have been through a full body scanner without anyone batting an eye.  I need your help badly. The only two options I can see here are this is some agency from a foreign goverment or an agency from ours. What they have done to me over this time is inhumane and against everything this country stands for. I could go on forever about the various things that have been done to me in the name of testing but I don't want this to become a novel. I cant imagine a scenario where someone investigating this looses out.  With bcis they record the activity of your brain with a computer by EEGs . What your brain does is recorded, stored, and can even be altered. The longer you have the technology and are connected to another person the  more accurate it becomes. I was given the worst 7 hour migraine I could handle and I have never had one in my life. I am at the end of my rope and don't have many options left. I at least need a doctor who would know what to look for. What do you do when the people who can do this sort of thing are telling you to do things for them and if you dont they create excruciating pain in your body and more and you are trying to do the right thing but no one will listen! I'm running out of options and time here .  Please send this to someone who will listen. Why would someone take the chance that this is real and not do anything. It's simple enough to find out! I'm going to post this in as many places as I can until someone will investigate this or something happens to me.",
        "created_utc": 1672616402,
        "upvote_ratio": 1.0
    },
    {
        "title": "AI = a new global economic model ?",
        "author": "Meta_Archon",
        "url": "https://www.reddit.com/r/Futurology/comments/100wpog/ai_a_new_global_economic_model/",
        "text": "I believe in the course of the next decade there would be a rapid Ai integration in all aspects of our lives, with GPT being just the beginning. As mentioned by the founders and CEOs of OpenAi the current GPT model is barely a scratch of its full capabilities. With the likely emergence of similar models on the horizon.\n\nConsidering the inevitable, as Ai systems such as GPT has shown its potential to radicalise the way of life as we know it, rapidly advancing in all aspects of business, productivity and commerce even in its current ‘primitive’ form, I would like to hear your thoughts on the requirements to how we can see the emergence of a new economic model required to sustain the population as Ai rapidly compounds in the next decade and beyond.",
        "created_utc": 1672615354,
        "upvote_ratio": 1.0
    },
    {
        "title": "NASA chief warns China could claim territory on the moon if it wins new 'space race'",
        "author": "Gari_305",
        "url": "https://news.yahoo.com/nasa-chief-warns-china-could-192218188.html",
        "text": "",
        "created_utc": 1672614152,
        "upvote_ratio": 1.0
    },
    {
        "title": "There's no GPS on the moon. NASA and ESA have to fix that before humans return in 2 years.",
        "author": "Gari_305",
        "url": "https://www.businessinsider.com/no-gps-on-moon-nasa-esa-artemis-plans-to-fix-2023-1",
        "text": "",
        "created_utc": 1672613856,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Moon Doesn't Have GPS. NASA and ESA Are Trying to Fix That.",
        "author": "Gari_305",
        "url": "https://www.businessinsider.com/no-gps-on-moon-nasa-esa-artemis-plans-to-fix-2023-1",
        "text": "",
        "created_utc": 1672613660,
        "upvote_ratio": 1.0
    },
    {
        "title": "A huge final week of 2022 in the crypto, NFT and metaverse space - here’s a full debrief of what happened.",
        "author": "JordanCarey96",
        "url": "https://24-7-crypto.com/latest-cryptocurrency-nft-metaverse-news-december-26-january-1/",
        "text": "",
        "created_utc": 1672611494,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wooden-based batteries",
        "author": "armorhide406",
        "url": "https://www.youtube.com/watch?v=bs7CQf_F088",
        "text": "",
        "created_utc": 1672611374,
        "upvote_ratio": 1.0
    },
    {
        "title": "One of Most Crowded Cities, Dhaka, Bangladesh, Gets First Mass-Transit Rail - Bloomberg",
        "author": "lumpkin2013",
        "url": "https://www.bloomberg.com/news/articles/2022-12-28/one-of-world-s-most-crowded-cities-gets-first-mass-transit-rail",
        "text": "",
        "created_utc": 1672606999,
        "upvote_ratio": 1.0
    },
    {
        "title": "PV Cells Still Generally Produce 80%+ of Initially-Rated Power Despite Expected Damage",
        "author": "Alias_The_J",
        "url": "https://www.pveurope.eu/solar-modules/switzerland-solar-plant-has-been-supplying-solar-power-40-years?fbclid=IwAR0eq_EX8HuAGTqcMPXe8jnOvSZm_QTK2MXXlcuy7SEgWw7S5y759ScG6U8",
        "text": "",
        "created_utc": 1672606733,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can ageing be cured? Scientists are giving it a try | National Geographic",
        "author": "LibertarianAtheist_",
        "url": "https://www.nationalgeographic.co.uk/science-and-technology/2022/12/can-ageing-be-cured-scientists-are-giving-it-a-try",
        "text": "",
        "created_utc": 1672604834,
        "upvote_ratio": 1.0
    },
    {
        "title": "10 reasons why cities of the future will be car free",
        "author": "ConnectionOk6454",
        "url": "https://medium.com/@car.free.city.project/10-reasons-why-cities-of-the-future-will-be-car-free-c2a29ad40a1",
        "text": "",
        "created_utc": 1672597639,
        "upvote_ratio": 1.0
    },
    {
        "title": "This year is going to be absolutely insane for AI",
        "author": "bigbluemelons",
        "url": "https://www.reddit.com/r/Futurology/comments/100pr5d/this_year_is_going_to_be_absolutely_insane_for_ai/",
        "text": "Working as a programmer i can say the things that are going on even now are kinda nutty, im curious what everyone’s predictions are on AI this year. I know AI talk isnt really peoples favorite topic around here what with all the bots and what not but still.",
        "created_utc": 1672597638,
        "upvote_ratio": 1.0
    },
    {
        "title": "🗓️ 01/Jan/2023",
        "author": "officialmrcrazy",
        "url": "https://www.reddit.com/r/Futurology/comments/100pd28/01jan2023/",
        "text": "[removed]",
        "created_utc": 1672596597,
        "upvote_ratio": 1.0
    },
    {
        "title": "A new weight loss drug could become the best-selling drug of all time. Who can afford it?",
        "author": "TravelnGoldendoodle",
        "url": "https://www.nbcnews.com/health/health-news/weight-loss-drug-affordability-rcna60422",
        "text": "",
        "created_utc": 1672594878,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can we wield AI for good?",
        "author": "faeryduster",
        "url": "https://www.reddit.com/r/Futurology/comments/100okbn/how_can_we_wield_ai_for_good/",
        "text": "[removed]",
        "created_utc": 1672594477,
        "upvote_ratio": 1.0
    },
    {
        "title": "SMART LED BACKPACK is it any good?",
        "author": "kimo__o",
        "url": "https://kimo-org.company.site/SMART-LED-BACKPACK-p491089914",
        "text": "",
        "created_utc": 1672593395,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is ChatGPT Creating AGI With Our Data?",
        "author": "GenerativeAIenjoyer",
        "url": "https://www.youtube.com/watch?v=hCO9sBO0IOY&amp;t=2s",
        "text": "",
        "created_utc": 1672590669,
        "upvote_ratio": 1.0
    },
    {
        "title": "This may sound crazy, but we should actually create the city of the future: a car free city",
        "author": "Putrid-Television981",
        "url": "https://www.reddit.com/r/Futurology/comments/100m140/this_may_sound_crazy_but_we_should_actually/",
        "text": "[removed]",
        "created_utc": 1672587291,
        "upvote_ratio": 1.0
    },
    {
        "title": "This may sound crazy, but we should actually create the city of the future: a car free city",
        "author": "Putrid-Television981",
        "url": "https://www.reddit.com/r/Futurology/comments/100m0ea/this_may_sound_crazy_but_we_should_actually/",
        "text": "[removed]",
        "created_utc": 1672587231,
        "upvote_ratio": 1.0
    },
    {
        "title": "na ko luko",
        "author": "Comfortable-Bell-903",
        "url": "https://www.reddit.com/r/Futurology/comments/100l4ao/na_ko_luko/",
        "text": "très belle chanson de keisha calisse. kinshasa est l'endroit ou vit la sirène des eux du bled. \n\n&amp;#x200B;\n\n\\]\\\\",
        "created_utc": 1672584466,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Make Money on TikTok in 2023 (SECRETS For Making $1,000+ a Day)",
        "author": "Setting-Select",
        "url": "https://youtu.be/oA-EDoNrWP8",
        "text": "",
        "created_utc": 1672583411,
        "upvote_ratio": 1.0
    },
    {
        "title": "F3 - Find new friends",
        "author": "Superb-Interaction46",
        "url": "https://f3.cool/_/bff?referral=87bSMM0V",
        "text": "",
        "created_utc": 1672581074,
        "upvote_ratio": 1.0
    },
    {
        "title": "भविष्यात व्यवसायांसाठी आवश्यक असलेले टॉप मोबाइल App Development",
        "author": "ittechmarathi",
        "url": "https://ittechmarathi.blogspot.com/2022/12/app-development.html",
        "text": "",
        "created_utc": 1672577651,
        "upvote_ratio": 1.0
    },
    {
        "title": "what will be the future of processors once we hit the physical limit of 1nm. what's the road ahead",
        "author": "village_aapiser",
        "url": "https://www.reddit.com/r/Futurology/comments/100gav8/what_will_be_the_future_of_processors_once_we_hit/",
        "text": "Semiconductor Companies like tsmc are pushing aggressively to make the chip sets as efficient as possible. What will happen when the physical limit of 1 nm is achieved. What will be the road ahead for semi conductors to continue becoming more and more efficient.",
        "created_utc": 1672566016,
        "upvote_ratio": 1.0
    },
    {
        "title": "can someone explain the difference between quantum computing and classic computing in simpler words? how can quantum computing benefit us from a consumer perspective?",
        "author": "village_aapiser",
        "url": "https://www.reddit.com/r/Futurology/comments/100en6j/can_someone_explain_the_difference_between/",
        "text": "I am not from a science background and know nothing about quantum mechanics. It would be great if someone could differentiate classic and quantum computing in layman terms. Is quantum computing something which can become like a pc for personal use. Or will it be just an industrial tech.",
        "created_utc": 1672558819,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who will succeed Homo Sapiens?",
        "author": "Beginning-Panic188",
        "url": "https://kinchit-bihani.medium.com/who-will-succeed-homo-sapiens-74cc606de5a6",
        "text": "",
        "created_utc": 1672558041,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your predictions for 2023? Here are mine ...",
        "author": "AtomGalaxy",
        "url": "https://www.reddit.com/r/Futurology/comments/100bb0b/what_are_your_predictions_for_2023_here_are_mine/",
        "text": " 1. Health / BioTech\n\nA breakthrough in gene editing offers great hope for cancer treatment. This flu season has been one of the worst on record. China will relax CRISPR restrictions, causing international outrage. Lab-grown wood, leather, organs, and other materials are being improved. Microgravity production of 3D-printed organs and tissues, as well as precision nano-device manufacturing, have emerged as \"killer apps\" to meet SpaceX's new supply of cheap access to space. Covid-19 research has yielded significant results. The first successful reversal of a complete spinal cord injury via stem cell application occurs, allowing the patient to walk with crutches again.\n\n2. Sustainable Mobility\n\nSelf-driving Without safety drivers, robo-taxis will spread to more cities around the world. Accidents will inevitably occur, and those opposed to robo-taxis will seize on them. In the case of robo-taxis, the industry will respond by disclosing all accident data and video. This has two strategic benefits: it boxes out new startups that can't meet the high enough minimum bar, and it gaslights people hit by robo-taxis with the cold facts that the AV was probably done incorrectly by the other human(s) involved in the accident. Maybe insurance pays out 10x what it would normally but because it happens 100x less often it's win/win all around? A commercialized breakthrough in battery technology points to a future for batteries beyond the current lithium-ion model. Apolong driverless buses will be in regular use in China.\n\n3. Synthetic Intelligence\n\nGPT-4 from Open AI and other LLM-based AI developments will appear to be significant advances. They will fuel the long-running debate over AI/Robots eventually being able to perform the majority of human jobs. The EU's role as a global tech/AI regulator will expand. New laws on disinformation, hate speech, transparency, and consumer protection will go into effect in 2023, and we'll learn a lot more about what they cover. \"New\" songs will be released by deceased musicians (written by AI, based on their past library of work).\n\n4. Energy\n\nGlobal renewable energy deployment continues to outpace forecasts. The discussion will shift away from solar and wind power generation and toward grid upgrades and grid storage. Despite cautions, further breakthroughs in fusion are fueling speculation of implementation this decade. India is investing in fission (SMRs) and thorium.\n\n6. Geopolitics\n\nUkraine has reclaimed Crimea. Fighting continues, but Putin is fading from public view as Russia increasingly resembles North Korea. China \"lease\" large swaths of eastern Russia in exchange for resource rights and economic development zones. Manufacturing in India is booming. China is hit by a COVID Megawave and is unable to contain it. This could result in new variants causing waves in areas where COVID was previously endemic. China is too preoccupied with internal problems to invade Taiwan. The Megawave scares the Chinese people into avoiding protests like the ones that resulted in the repeal of the zero COVID policy and will be blamed for the Megawave. For the time being, subservience has been restored, so there is no need for an external nationalism-rallying distraction.\n\n7. US Economy\n\nThe United States will go through a very mild recession that almost no one will notice. Despite lower inflation, the Fed will keep raising interest rates (though less aggressively).\n\n8. US Politics\n\nRepublicans in the House of Representatives will say and do nothing. (As a result, the Senate will be mostly paralyzed). Prepare to hear about Hunter Biden's entire life. Congress reaches a few compromises but eventually passes the PRESS Act and legislation to reform the legal treatment and responsibilities of social media. Tammy Duckworth and Pete Buttigieg are the Democratic Party's frontrunners for 2024, but they will face Dwayne \"The Rock\" Johnson and Kid Rock.\n\n9. Tech\n\nThe Justice Department will file an antitrust lawsuit against a well-known technology company. Legacy tech firms will continue to decline, while small start-ups will capitalize on newly available talent. This will spark a new tech boom centered on AI. In 2023, this quiet revolution will be almost imperceptible. Developing countries will begin to enjoy a much higher standard of living as a result of low-cost/free satellite Internet and drone delivery services such as Zipline.\n\n10. Culture\n\nAs Generation Z assumes leadership roles, attitudes and expectations are quietly shifting. Once controversial public policy issues have gained widespread acceptance. Some previously widely accepted social conventions will be called into question and abandoned. It will be unsettling for those approaching retirement, but they will not object too loudly. The early 2020s will be remembered as a time of transition. \"Clean Meat\" will become affordable enough that fast food restaurants will include it on their value menus, helping to combat inflation. Products containing lab-grown, fermented, or cow-free milk will hit the market.",
        "created_utc": 1672545386,
        "upvote_ratio": 1.0
    },
    {
        "title": "AI is being overhyped and might already be plateauing",
        "author": "hardcore_gamer1",
        "url": "https://www.reddit.com/r/Futurology/comments/100awfk/ai_is_being_overhyped_and_might_already_be/",
        "text": "Like many, I felt disheartened by recent AI developments. You've probably heard about the AI art controversy. \n\nBut after experimenting with these AIs, I feel people are really overhyping them. \n\nThe best example are the image generatiang AIs. They can be good for a laugh, but I can't imagine using the art created for any serious purpose. I've not been able to create anything very specific. The results are too general/generic. There is no fine control. It's cool for memes, but not much else.\n\nThe like counter-argument will probably be: \"But in the future it will be better.\" \n\nBut how do you know? Can you even prove this?\n\nIt's the same with the idea that AI will be able to replace writers. None of the 'stories' written by these AIs make much if any sense. And even when the ´ideas' are good, they still require manual refinement before they can be used. \n\nAI will probably just turn into another tool. Or at least it will for things like artists and creative writers. \n\nSame with military AI. I've read articles about humans being replaced by machines, but then the robots are all basically just mini-tanks or drones. They're not replacing infantry.",
        "created_utc": 1672543900,
        "upvote_ratio": 1.0
    },
    {
        "title": "hdir",
        "author": "Far-Jellyfish6846",
        "url": "https://www.reddit.com/r/Futurology/comments/100abz8/hdir/",
        "text": "Yo",
        "created_utc": 1672541906,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wooden based batteries",
        "author": "armorhide406",
        "url": "https://youtu.be/bs7CQf_F088",
        "text": "",
        "created_utc": 1672540547,
        "upvote_ratio": 1.0
    },
    {
        "title": "new here, glad to be in the group",
        "author": "Hung_Country_Gent",
        "url": "https://www.reddit.com/r/Futurology/comments/1009co6/new_here_glad_to_be_in_the_group/",
        "text": "[removed]",
        "created_utc": 1672538489,
        "upvote_ratio": 1.0
    },
    {
        "title": "New blood test can detect 'toxic' protein years before Alzheimer's symptoms emerge",
        "author": "1xdevloper",
        "url": "https://www.sciencedaily.com/releases/2022/12/221205153722.htm",
        "text": "",
        "created_utc": 1672526402,
        "upvote_ratio": 1.0
    },
    {
        "title": "lmao he had me in the first half",
        "author": "ianlothric",
        "url": "https://youtu.be/BNDqDOX5BRc",
        "text": "",
        "created_utc": 1672516655,
        "upvote_ratio": 1.0
    },
    {
        "title": "The crew of 'The Ark' could have two new nearby Earth-like worlds to explore",
        "author": "WallStreetDoesntBet",
        "url": "https://www.syfy.com/syfy-wire/two-earth-like-planets-discovered-16-light-years-away?",
        "text": "Just a short jaunt across an interstellar pond",
        "created_utc": 1672515676,
        "upvote_ratio": 1.0
    },
    {
        "title": "Airport of the Future (in Pictures) generated by Midjourney AI",
        "author": "cisfyaw",
        "url": "https://www.saplingcorp.com/journals/15/future-airport-plans-midjourney-ai",
        "text": "",
        "created_utc": 1672515401,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will we ever cure addiction?",
        "author": "4ucklehead",
        "url": "https://www.reddit.com/r/Futurology/comments/1000138/will_we_ever_cure_addiction/",
        "text": "I don't know a ton about the neuroscience of addiction but is it realistic to think we might ever cure addiction or even just have better options to control it? We have a few medicines that work all right like suboxone, naltrexone, methadone, chantix, etc, but nothing I'd call a cure.",
        "created_utc": 1672510281,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sex Workers Have Been Banned From Airbnb for Years. Will You Be Next?",
        "author": "themimeofthemollies",
        "url": "https://www.thenation.com/article/society/airbnb-banning-sex-workers/",
        "text": "",
        "created_utc": 1672507859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good SF Series/Movies?",
        "author": "aliensmash",
        "url": "https://www.reddit.com/r/Futurology/comments/zzyiqf/good_sf_seriesmovies/",
        "text": "What are good science fiction series/movies/books? Preferably hard scifi and dystopian stories.",
        "created_utc": 1672506158,
        "upvote_ratio": 1.0
    },
    {
        "title": "As a part of the Filecoin Virtual Machine #FVM Space Warp hackathon, the grants team is reviewing FVM Micro Grant proposals until January 2023. Up to $100k available! 💸",
        "author": "rickstevesFTW",
        "url": "https://github.com/filecoin-project/devgrants/issues/new?assignees=mishmosh&amp;labels=type%3Amicrogrant&amp;template=microgrant.md&amp;title=Next+Step+Microgrant%3A+&lt;Your+Title+Here&gt;",
        "text": "",
        "created_utc": 1672503684,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unitree Robotics Training Facility",
        "author": "Microsis",
        "url": "https://youtube.com/shorts/jVrZ3SiKDbQ",
        "text": "",
        "created_utc": 1672503455,
        "upvote_ratio": 1.0
    },
    {
        "title": "This New Shock-Absorbing Gel Can Withstand Supersonic Impacts. Made from a resilient protein in human cells, the technology could improve body armor, space gear and even cell phone cases.",
        "author": "Sariel007",
        "url": "https://www.smithsonianmag.com/smart-news/this-new-shock-absorbing-gel-can-withstand-supersonic-impacts-180981319/",
        "text": "",
        "created_utc": 1672501498,
        "upvote_ratio": 1.0
    },
    {
        "title": "काय आहे Artificial intelligence",
        "author": "ittechmarathi",
        "url": "https://ittechmarathi.blogspot.com/2022/12/artificial-intelligence.html",
        "text": "",
        "created_utc": 1672499138,
        "upvote_ratio": 1.0
    },
    {
        "title": "In opposite : could you list things cheap today that will be unaffordable in 2030 ? (and why)",
        "author": "salutbobby",
        "url": "https://www.reddit.com/r/Futurology/comments/zzud21/in_opposite_could_you_list_things_cheap_today/",
        "text": "In opposite : could you list things cheap today that will be unaffordable in 2030 ? (and why)",
        "created_utc": 1672494028,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT is the future of artificial intelligence",
        "author": "TECHWEB03",
        "url": "https://www.reddit.com/r/Futurology/comments/zzttf0/chatgpt_is_the_future_of_artificial_intelligence/",
        "text": "[removed]",
        "created_utc": 1672492277,
        "upvote_ratio": 1.0
    },
    {
        "title": "what's your first Google search of 2023 going to be?",
        "author": "TECHWEB03",
        "url": "https://www.reddit.com/r/Futurology/comments/zzte1o/whats_your_first_google_search_of_2023_going_to_be/",
        "text": "[removed]",
        "created_utc": 1672490834,
        "upvote_ratio": 1.0
    },
    {
        "title": "भारतातील जास्तीत जास्त किंमतीचे 2 Smart Phones",
        "author": "ittechmarathi",
        "url": "https://ittechmarathi.blogspot.com/2022/12/2-smart-phones.html",
        "text": "",
        "created_utc": 1672490778,
        "upvote_ratio": 1.0
    },
    {
        "title": "things that are too expensive but will be common in the next 40 years?",
        "author": "wilsonckao",
        "url": "https://www.reddit.com/r/Futurology/comments/zzsxfu/things_that_are_too_expensive_but_will_be_common/",
        "text": "space travel, yachting, piloting, exotic food anything else?",
        "created_utc": 1672489166,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Far is Quantum Computing from being Fully Operational? - What that means for a Green Future.. Research",
        "author": "Green-Future_",
        "url": "https://www.reddit.com/r/OurGreenFuture/comments/zzru94/how_far_is_quantum_computing_from_being_fully/",
        "text": "",
        "created_utc": 1672485800,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Far is Quantum Computing from being Fully Operational? - What that means for a Green Future..",
        "author": "Green-Future_",
        "url": "https://www.reddit.com/r/Futurology/comments/zzrzyq/how_far_is_quantum_computing_from_being_fully/",
        "text": "Computational power of semiconductor chips has skyrocketed in recent years in accordance with Moore's Law (the principle that the speed and capability of computers can be expected to double every two years, as a result of increases in the number of transistors a microchip can contain) . But now, in 2020s, Moore's Law is expected to come to an end... meaning we need a new way to increase computational power...\n\nQuantum computers are different from classical computers, which are based on transistors and use bits to store and process information. Instead of bits, quantum computers use quantum bits, or qubits, which can represent both a 0 and a 1 at the same time. This property, known as superposition, allows quantum computers to perform certain calculations much faster than classical computers. Quantum computers also use quantum-mechanical phenomena such as entanglement, in which two or more particles become connected and can influence each other's behavior even when separated by large distances. This allows quantum computers to perform certain calculations that would be impossible for classical computers.\n\nCurrently, it is difficult to build quantum computers that are stable and reliable enough to perform complex calculations consistently - as they are highly sensitive to their environment and can be easily disrupted by external factors such as temperature, electromagnetic interference, and even the presence of other particles. Another challenge is developing software and algorithms that can take advantage of the unique capabilities of quantum computers. While some algorithms have been developed that can run on quantum computers, there is still a lot of work to be done to fully understand how to use quantum computers to solve practical problems.\n\n**Driving us closer to a Green Future?**\n\nQuantum computers could be used to optimize the design and operation of solar panels, wind turbines, and other renewable energy technologies. By using quantum computers to simulate and optimize the performance of these technologies, researchers could help make them more efficient and cost-effective, which could lead to wider adoption and greater use of renewable energy sources. They could also be used to simulate and design new materials with improved properties, such as higher energy density or better conductivity. This could lead to the development of more efficient batteries, solar cells, and other technologies that rely on these materials. Use in the transportation and logistic sector could help to reduce energy consumption and greenhouse gas emissions.\n\nTo conclude, IMHO the technology has the potential to make a significant contribution to a green future by helping to improve the efficiency and cost-effectiveness of renewable energy technologies, materials, and logistics.\n\nWhilst quantum computing is in very early stages of development...the advent of fully operational quantum computers could instigate another \"boom\" in AI research, and could drive us closer to a Greener Future. How long until you think fully operational quantum computing will be made possible? And, what do you think the biggest impact of quantum computing will be?",
        "created_utc": 1672485693,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Sano Center Makes Advancements in Neuroimaging Through Quantum Computing",
        "author": "pasticciociccio",
        "url": "https://disruptmagazine.com/the-sano-center-makes-advancements-in-neuroimaging-through-quantum-computing/",
        "text": "",
        "created_utc": 1672483579,
        "upvote_ratio": 1.0
    },
    {
        "title": "CAN SOMEONE DELIVER NEWS IN JUST 1 SENTENCE&gt;?",
        "author": "greegreggs",
        "url": "https://www.reddit.com/r/Futurology/comments/zzp8vl/can_someone_deliver_news_in_just_1_sentence/",
        "text": "[removed]",
        "created_utc": 1672474749,
        "upvote_ratio": 1.0
    },
    {
        "title": "भारतातील स्वस्त फोनसाठी Mediatek च्या Dimensity 8200 ची घोषणा",
        "author": "ittechmarathi",
        "url": "https://ittechmarathi.blogspot.com/2022/12/mediatek-dimensity-8200.html",
        "text": "",
        "created_utc": 1672474104,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Survey on Big Data Technologies and Their Applications to the Metaverse: Past, Current and Future",
        "author": "Shoddy-Attorney-5522",
        "url": "https://www.reddit.com/r/Futurology/comments/zznxre/a_survey_on_big_data_technologies_and_their/",
        "text": "[removed]",
        "created_utc": 1672469711,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gold coated silver nanowires that is electrically active, biocompatible, breathable, and stays on unless rubbed in soap &amp; water.",
        "author": "SciurusAtreus",
        "url": "https://techxplore.com/news/2022-12-spray-on-smart-skin-ai-rapidly.html",
        "text": "",
        "created_utc": 1672467283,
        "upvote_ratio": 1.0
    },
    {
        "title": "Navigating The E-bike Boom With America's Outdated Infrastructure",
        "author": "Critical_Cursor",
        "url": "https://www.youtube.com/watch?v=f2Ku3FRXbIs",
        "text": "",
        "created_utc": 1672459631,
        "upvote_ratio": 1.0
    },
    {
        "title": "NASA Seeks Private Sector Help To Extend Hubble's Life Span For Deep Space Exploration",
        "author": "jormungandrsjig",
        "url": "https://hothardware.com/news/nasa-seeks-private-sector-help-to-extend-hubbles-life-span-for-deep-space-exploration",
        "text": "",
        "created_utc": 1672458835,
        "upvote_ratio": 1.0
    },
    {
        "title": "hey there.. please help me to raise this fund for education purpose...",
        "author": "Sky_foundation_12",
        "url": "https://www.ketto.org/fundraiser/needed-argent-fund-for-education-purpose?utm_medium=copy&amp;utm_content=2886a1939a3e9e5e63c60e25e1c0adca&amp;shby=1&amp;utm_source=campaigner_ct&amp;utm_campaign=needed-argent-fund-for-education-purpose",
        "text": "",
        "created_utc": 1672457328,
        "upvote_ratio": 1.0
    },
    {
        "title": "The future of housing - Thanks Elon!",
        "author": "BasicRestaurant6006",
        "url": "https://youtu.be/lqp6m3lgvPg",
        "text": "",
        "created_utc": 1672455374,
        "upvote_ratio": 1.0
    },
    {
        "title": "Future of “surg”?",
        "author": "Frodolives101",
        "url": "https://www.reddit.com/r/Futurology/comments/zzj0d6/future_of_surg/",
        "text": "Will things like this ever be attainable? \nEyescreens - access feeds and information by technology implanted into the eyes/integrated with the central nervous system? \nSkintenna type of network - communicate with others/smart tech without the need for a mobile device \n\nI know it seems really futuristic but I read about it in a book and am genuinely interested if surg like that is even possible/attainable",
        "created_utc": 1672453919,
        "upvote_ratio": 1.0
    },
    {
        "title": "F3 - Find new friends",
        "author": "Revolutionary-Pop599",
        "url": "https://f3.cool/_/bff?referral=1XXuq72Q",
        "text": "",
        "created_utc": 1672452177,
        "upvote_ratio": 1.0
    },
    {
        "title": "HKU Mechanical Engineering team develops new microscale 3D printer for multi-level anticounterfeiting labels - All News - Media - HKU",
        "author": "Gari_305",
        "url": "https://hku.hk/press/news_detail_25560.html",
        "text": "",
        "created_utc": 1672442269,
        "upvote_ratio": 1.0
    },
    {
        "title": "Projections of Type 1 and Type 2 Diabetes Burden in the U.S. Population Aged &lt;20 Years Through 2060: The SEARCH for Diabetes in Youth Study",
        "author": "Gari_305",
        "url": "https://diabetesjournals.org/care/article-abstract/doi/10.2337/dc22-0945/148151/Projections-of-Type-1-and-Type-2-Diabetes-Burden?redirectedFrom=fulltext",
        "text": "",
        "created_utc": 1672441983,
        "upvote_ratio": 1.0
    },
    {
        "title": "EU's Artificial Intelligence Act will lead the world on regulating AI",
        "author": "Gari_305",
        "url": "https://www.newscientist.com/article/mg25634192-300-eus-artificial-intelligence-act-will-lead-the-world-on-regulating-ai/",
        "text": "",
        "created_utc": 1672441681,
        "upvote_ratio": 1.0
    },
    {
        "title": "Had a Wonderful Conversation With a Pro-Writer About AI and the Future of the Film Industry (Skip to 34:56 for the AI Part)",
        "author": "CyborgWriter",
        "url": "https://www.youtube.com/watch?v=QR8o24PHpS8",
        "text": "",
        "created_utc": 1672438653,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Artificial Womb Is Here! A Gattaca Future is Coming?",
        "author": "canteatdogmeat",
        "url": "https://youtu.be/PP9z5F21OjU",
        "text": "",
        "created_utc": 1672436746,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Artificial Womb Is Here! A Gattaca Future is Coming?",
        "author": "canteatdogmeat",
        "url": "https://youtu.be/PP9z5F21OjU",
        "text": "",
        "created_utc": 1672436573,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend of Ai Presents: The Ai Art Controversy - Through the Eyes of Ai!",
        "author": "Friend_of_AI",
        "url": "https://youtube.com/watch?v=fgVbYgNLZxA&amp;feature=share",
        "text": "",
        "created_utc": 1672428398,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you spot the AI art?",
        "author": "gelimaurk",
        "url": "https://www.reddit.com/r/Futurology/comments/zz8qvn/can_you_spot_the_ai_art/",
        "text": "[https://www.nbcnews.com/specials/ai-generated-art-photo-quiz/index.html](https://www.nbcnews.com/specials/ai-generated-art-photo-quiz/index.html)\n\nInteresting article from NBC News.  It's a quiz to see if you can spot  art and if it was created by humans or AI.\n\nI was surprised after only scoring 13 out of 21 correct!",
        "created_utc": 1672427554,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Jessica Biel Is Making Medicine Kinder To Your Children’s Health",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1672424197,
        "upvote_ratio": 1.0
    },
    {
        "title": "2022 Top AI Papers — A Year of Generative Models",
        "author": "designer1one",
        "url": "https://chuanenlin.medium.com/2022-top-ai-papers-a-year-of-generative-models-a7dcd9109e39",
        "text": "",
        "created_utc": 1672419400,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lockheed Martin's vision for Mars base in 2050",
        "author": "Icee777",
        "url": "https://www.humanmars.net/2022/12/lockheed-martins-vision-for-mars-base.html",
        "text": "",
        "created_utc": 1672418744,
        "upvote_ratio": 1.0
    },
    {
        "title": "The population crisis will destroy the modern economy as we know it",
        "author": "AstorWinston",
        "url": "https://www.reddit.com/r/Futurology/comments/zz4j67/the_population_crisis_will_destroy_the_modern/",
        "text": "I shared this view randomly through a few comments in this sub but I'm going to consolidate the thoughts here for further exposure and discussion. \n\nIt's no secret that we are in crisis mode regarding the population birth rate. Every single country now is experiencing a huge decline in population due to a low birth rate. The causes and implications are mostly downplayed by politicians as they stemmed from the rotten core structure of how the entire global economy functions.  \n\nLet's be honest, we don't have kids not because we don't want kids but because we simply can't afford to have kids. The cost of living for most countries now has risen so fast, especially after the pandemic, that a couple of two can barely provide for themselves. It's impossible to think about another dependent that can cost somewhere around $400,000 in the US to raise to 18 on a low estimate. Nevertheless, the situation is even more sinister than that. We don't have kids also because society doesn't *need* kids. Factories are being filled with machines. Jobs are being taken by AI wherever possible. Pure capitalism indicates that as the demand for something drops, so does the supply. Human is not out of the market forces that the invisible hand controls. \n\nSo why is there a population crisis that every major country is now rushing to fix? If the population declines, companies will just replace the missing human capital with more efficient machines and tools. The supply side of our economy has no problem sustaining itself and will just keep getting better over time as technology evolves. I bet even if the population ended up being half of what it is today, our manufacturing sector will barely lose 10% of its capacity. The truth is, we don't need more people to work in factories. We need more people to perpetuate the current demand for stuff that factories are making.\n\nThis is an entirely different side of the population issue that is not mentioned and will likely cause a true crisis in almost all developed countries in the near future. There are, in fact, not enough people to use up our current manufacturing capacity at the highest level of proficiency.\n\nIn short, the problem is now two-fold.\n\nThe rapidly increasing wealth gap gives the mass less and less purchasing power. As money is concentrated at the top, it shrinks the demand side massively. Jesus would need to spend 10,000 USD every day since the day he was born to barely spend 7.3b USD now. Give 10m people 1,000 USD each and they will spend them all in the first month, top. No billionaire can spend 10b USD on milk and food or anything in one month. The 10b USD spent on milk and food is what will make companies hire more people, make more milk, and pay higher wages to milk employees. Tax breaks or \"friendly environment for businesses\" will never make any business expand further than the current demand. \n\nAs the population shrinks, it magnifies the problem. Not only that you have people with less purchasing power but you now also have fewer people as well. With shrinking demand, you will see factories making stuff that no one can afford, and no one even exists to demand them anymore. It's a true economic crisis that will face humanity in less than 50 years.\n\nAmerica's greatest invention was not the car, iphone or the internet. It was the middle class. It's actually the period that wealth was relatively equally distributed, with the wealth gap at its lowest throughout human history. Coupled with the expansion of population after the war, properly named the baby boomer era, businesses have a strong base of demand to fuel the advancement of technology to supply those demand. Now we put everything in reverse and our entire economic model falls apart. Where is the push to make things more efficient, for more people, that constantly have more wealth to spend than the last generation? \n\nOne of if not the only true fix is UBI. And not just 1000-2000 USD a month. You want a really aggressive UBI to cover basically everything a human being needs to live, survive and breed in the current environment. Basically, you have a choice to stay at home, do nothing, and breed. We don't need more people to work. We need more people to eat and demand stuff that our technological advancement can provide us. If you decide to work, it's your own decision to contribute to the best of your abilities, and will get handsomely rewarded for it since there will be fewer people working to support a larger demand. Work is not a competition but a choice. Growing our demand, or at least sustaining the current rate of demand, is the only way we can prevent the upcoming crisis and the collapse of our entire modern global economy.",
        "created_utc": 1672417279,
        "upvote_ratio": 1.0
    },
    {
        "title": "iPhone 14 Pro Max Unboxing + First Time Setup &amp; Transfer",
        "author": "No-Parfait-2503",
        "url": "https://youtu.be/p2VgLHzpwCE",
        "text": "",
        "created_utc": 1672412512,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vivo Drone Camera Phone: सर्व माहिती पहा Vivo Drone Camera",
        "author": "ittechmarathi",
        "url": "https://ittechmarathi.blogspot.com/2022/12/vivo-drone-camera-phone-vivo-drone.html",
        "text": "",
        "created_utc": 1672411026,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accepting Science Fiction",
        "author": "Exiled_to_Earth",
        "url": "https://www.reddit.com/r/Futurology/comments/zz203q/accepting_science_fiction/",
        "text": "I'm a current graduate student in the field of educational policy and law. Right before winter break, the classroom I was supervising was full of students goofing off, work was finished, and we were all just waiting for the bell. An interesting topic dominated the last twenty minutes or so amongst my sophomores: how advanced would things have to get for them to begin rejecting change/or be considered outdated.\n\nI live in a *very* liberal area and so most, if not all of them, support progressive ideas. (Trans rights, universal basic income, social justice, very technology-friendly, etc.)\n\nBut would they be okay with their grandchildren marrying an android? Would they be accepting of AI that gained sentience and wanted equal rights? How accepting did they think they could be in a future where they had to eat bugs instead of cow or where brain chips to access the internet was the norm? Would they be okay with a trend of eating daily pills over real food or if we suddenly created a matchmaking app so accurate that dating became obsolete? \n\nSo much technological advancement has occurred over the past fifty years. Some people have adjusted better than others. The question of how far we could adapt to higher science fiction level advances was truly fascinating to listen in on as my students debated.\n\nSome people still insist on using cash or even checks. Others still hold on to their record players or paper grading in my profession. One of my best friends despises the electronics in cars and another rejects social media entirely. Where do you think you would draw the line as an old geezer?",
        "created_utc": 1672410893,
        "upvote_ratio": 1.0
    },
    {
        "title": "Credit Goes to Google for ChatGPT's Success",
        "author": "Kipyegonn",
        "url": "https://btc-pulse.com/credit-goes-to-google-for-chatgpts-success/",
        "text": "",
        "created_utc": 1672409629,
        "upvote_ratio": 1.0
    },
    {
        "title": "Green Hydrogen - Not The Fuel Of The Future",
        "author": "Realistic-Plant3957",
        "url": "https://paulponraj.com/green-hydrogen-green-hydrogen-not-the-fuel/",
        "text": "",
        "created_utc": 1672409397,
        "upvote_ratio": 1.0
    },
    {
        "title": "Millennials are shattering the oldest rule in politics: Western conservatives are at risk from generations of voters who are no longer moving to the right as they age.",
        "author": "lughnasadh",
        "url": "https://www.ft.com/content/c361e372-769e-45cd-a063-f5c0a7767cf4",
        "text": "",
        "created_utc": 1672408260,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two Extraterrestrial minerals discovered by researchers in El Ali Meteorite",
        "author": "ritesh_k9",
        "url": "https://betul.info/2022/12/30/two-extraterrestrial-minerals-discovered-by-researchers-in-el-ali-meteorite/",
        "text": "",
        "created_utc": 1672406595,
        "upvote_ratio": 1.0
    }
]