[
    {
        "title": "[Mount&amp;Blade Warband] A simple bandit attack",
        "author": "VladHumperdink",
        "url": "http://www.reddit.com/r/gametales/comments/2a384l/mountblade_warband_a_simple_bandit_attack/",
        "text": "This tale starts off in the Kingdom of Calradia, a land filled with warring factions vying for control of the ultimate throne of Calradia, and the title of Emperor. My character's name is Kael Sevenwinds, Lord of Nelag Castle in the icy region once owned by my rival, King Yaroglek of the fearsome Vaegirs. From my castle I set out on dangerous raids on other rival Kingdom's fortresses and towns, soon adding the town of Khudan and the surrounding castles to my ever expanding kingdom. \n\nAlong my journey many men and women had fought and died for my cause, the Sevenwinds kingdom had it's fair share of martyrs ranging from all over the land, all united under a single banner. So every now and then I come to the villages and taverns and ask if anyone wishes to join my glorious army of conquerors. This time however would be different. \n\nI came across a small village on the outskirts of my kingdom, and I went to see if any volunteers would want to join up, I enter the village and I'm surprised to see no villagers, only bandits. I draw my sword and cleave away the first group of about 12 in no time at all, justice had been served. or had it? \n\nI hear more swords and axes being drawn and shouts of anger and hate cover me like a cloud of flies, it turn around and see not 20, 30... But *400* .\n\nAt this point I decide that instead of going alone into the village I should've really brought my army along, but they were too busy waiting for me to return, probably getting drunk and celebrating. I charge directly for the enemy ranks, blood spraying left and right as I carve a messy path through the horde of flesh and iron. \n\nFinally, I strike down the last bandit with my bastard sword, my shield was battered and broken, my health was dangerously low, but I had succeeded in my task. Afterward I returned to my army with fresh recruits, and a new resolve to continue my quest to become to Emperor of Calradia.\n\nThe legend of Kael Sevenwind never dies...\n\n",
        "created_utc": 1404771501,
        "upvote_ratio": ""
    },
    {
        "title": "[Civ V] The Great War",
        "author": "The_YoungWolf",
        "url": "http://www.reddit.com/r/gametales/comments/2a332p/civ_v_the_great_war/",
        "text": "I played a multiplayer game of Civilization V the other day which in the end resulted in one of the largest late-game wars I've ever participated in.\n\n[Bonus Early-Game Image While I Explain the Overall Situation](http://imgur.com/sgYRIVc)\n\nThis image is of how absurd AI Rome's second city settlement was. I couldn't fit Rome and Antium in the same shot despite being fully zoomed out. I ended up razing it early on because it poached a better spot I wanted for my fourth city.\n\nAnyways, this was a Standard Fractal map with 4 humans including myself - Japan (me), Shoshone (my neighbor), Venice (Wonder Whore), and England (isolated by himself on an island across the sea). AIs were Poland, Portugal, Maya, and Rome. The AIs acted incredulously stupidly, what with the original!Antium incident, Maya refusing to settle more than two cities until the late-game, Casimir being the biggest asshole to me for no reason (despite the Shoshone player *burning his third city down* and me doing nothing but trying to trade with him) and Poland and Portugal engaging in a thousand-year non-stop struggle (instigated by the Shoshone player). The latter was so bad that Poland at one point 500 years in managed to completely down Lisbon to no health, but apparently lacked direct-attack units and so couldn't take the city (it regained full health and lasted another 500 years).\n\nAnyways, I built up a large army and burned Antium early on. I didn't really use it much again except to take the city-state of Vilnius in the late Medieval Era - I didn't want to jeopardize my relationship with the Shoshone player (the best player of the four of us and a notorious warmonger and backstabber), and both Rome and Venice were too far away to be feasibly conquered despite being my neighbors. Nevertheless, I was tech, military, and score leader for about 80% of the game, only surpassed in the Industrial Era when it was discovered that neither myself or England had *any sources of coal whatsoever*. Venice and England went on the war path around that time (instigated my Rome sandwiching a random city across the war on England's islands in a tiny patch of open land between two of its core cities) and Venice conquered all of the Maya and Rome, leaving four humans and Poland remaining. The only sources of coal on the entire map were either controlled by the city-states or controlled by Venice after this, with the Shoshone player cozying up to the city-states and using theirs, successfully bluffing me out of conquering them. The other players, Venice in particular, proceeded to collaborate together to knock me out of being the leader, dominating the World Congress and banning Gems as a luxury (my only luxury which I had copies of and could trade). I threatened war over this, and this started my Cold War with Venice, who was making absurd amounts of money (~500gpt) and thus bought an enormous army to cover his border. While he had more troops, my army was modernized and I was Japan, with Bushido, so I had the edge.\n\nUltimately, the banning of gems was not as crippling as I had thought it would be - within 2 turns of me launching a hot war against Vencie for coal and spices, my social policy popped, and I managed to get the level-2 Autocracy tenet that allows for +2 happiness from military buildings. Also, during this time, I was Autocracy (with Poland, who still hated me for some reason), Shoshone and England were Order, and Venice was Freedom. Funny enough, Poland and I were the only ones without dissident problems.\n\nFinally, the war itself. Around the late Modern Era I had become content to sit on my empire and go back into builder mode, despite that Venice and the Shoshone had surpassed me completely in science rate. Shoshone player came to me and claimed Venice was teching to nukes and then planning to sneak attack me with them, urging my to join him in an attack. I had had my suspicions, but didn't care to go in simply because the Cold War had escalated to a three-way - Shoshone had built up an absurdly powerful defensive army, and any attempt by me or Venice to go at it conventionally would result in one of us getting raped by the Shoshone (By the way throughout all this England was entirely irrelevant, as he had *half* the science rate of everyone else and only maintained tech parity via stealing absurd amounts of tech with spies). By a stroke of fortune, the Venice player crashed and as we waited for him to return his AI managed to completely wreck his master plan - he had been holding off on finishing the Manhattan Project until teching to atomic bombs, then planned to finish it, buy a bunch on the same turn, and then nuke me. His AI screwed that up by finishing the Project, at which point I told Shoshone \"Let's Roll\" and after considerable debate, I managed to convince him to attack first to show his commitment (this was smart by me, as throughout the modern era Shoshone had been attempting to convince Venice or myself to start this war for his advantage). Thus, the Great War, began.\n\n[Order of Battle, Southeastern Front, Year One](http://imgur.com/BmNtqI8)\n\nIt was an absolute slog. I had underestimated how difficult it was to uproot Infantry and Machine Guns in fortresses. The Landships were my saving grace (I also had absolutely no Aluminum in my territory, but did have two large sources of Oil). It was also a hell of a bottleneck - the brown-green border at the top part of the shot is also the only place the Shoshone player bordered Venice, so he could not engage with his full force (there were also other reasons for this which I would learn later). There was a second front in the southwest around former Roman cities, but I had full advantage there as it was not fortified and defended by much fewer units.\n\n[Order of Battle, Southeastern Front, Year Two](http://imgur.com/V7gAoRz)\n\nAlready Venice's line was holding but showing cracks. My overwhelming artillery superiority, Landships, and the Shoshone air force were outclassing his army largely made up of infantry and machine guns. His right flank was quickly beginning to fold, and by the end of this turn I had cleaned up much of the southwestern front's units.\n\n[Order of Battle, Southeastern Front, Year Three](http://imgur.com/9nxarHB)\n\nAt this point Venice's front-line has completely collapsed with heavy casualties. He's pulled back almost all of his remaining forces to defend Venice. I've suffered heavy casualties among my infantry but I'm sure mine and the Shoshone's tanks (I popped Combined Arms with a Great Scientist) can ultimately break through his defenses.\n\n[Order of Battle, Southeastern Front, Year Five](http://imgur.com/s5VkATV)\n\nThe turn before, Shoshone backstabbed me, and then proceeded to wreck my troops on this front with his large air force. This completely crippled me and I knew there would be no way to win this war. Shoshone later said that at this point he was just bored (we had been playing for 10 hours straight) and wanted to do something dramatic, normally he would have just stuck with me to beat down Venice.\n\n[Order of Battle, Eastern Front, Year Five](http://imgur.com/Y05WMIs)\n\nThis chokepoint was the other major border between me and Shoshone. Heavily fortified in the past, I had left it with a skeleton force since the start of the Cold War. No side could really make progress, as Shoshone had absurd defensive bonuses but did not have many offensive units on this front. Nevertheless, by this point, I was completely crippled and would inevitably lose.\n\n[Final](http://imgur.com/7y5Bm5K)\n\nAt this point the game froze and refused to resynch, so we called it a night. Pictured is all that's left of my proud army, which could in no way stand up to that of the Shoshone (I had dropped about 60k in power since the start of the war and was now third in power behind Shoshone and Venice). The Shoshone Air Force simply slaughtered me in the southeast and that was it. It's hard to say who would have won between Shoshone and Venice, as on this very turn Venice had completed Fission and was about to buy tons of atomic bombs. In the straight-up fight Japan/Shoshone vs Venice, this would have been more interesting, as Venice still would have been able to get nukes but I highly, highly doubt he would've been able to stand up to the combined production of myself and Shoshone (his bombs wouldn't have been able to reach our core cities).\n\nAnyways, that was a pretty epic war. The only problem was that by this point in the game, any war would cause the game to desynch and resynch every turn, meaning 5 turns would stretch to an hour or so. Still it really shows that anyone can come back in this game provided you're large enough. Shoshone had no army most of the game and was terrified of me for a long time, but my lack of coal crippled me and he managed to get rolling in the Industrial Era.",
        "created_utc": 1404768692,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] Chapter 41: Part 2- Goodbye",
        "author": "Malphia",
        "url": "http://adventuresofthealmostheroes.blogspot.com/2014/01/day-115-part-2-start-of-healing-town-of.html?m=0",
        "text": "",
        "created_utc": 1404734891,
        "upvote_ratio": ""
    },
    {
        "title": "[Edge of the Empire] A Tale of Justice and Gand Aeronautics",
        "author": "Upsilon667",
        "url": "http://www.reddit.com/r/gametales/comments/2a0yp6/edge_of_the_empire_a_tale_of_justice_and_gand/",
        "text": "My EotE group has...non-consistent playership. Officially there are seven of us in the group, but we'll usually only have 4 or 5 show up at any time just because of scheduling issues. Our party consists of:\n\n* Wookiee Smuggler (Pilot)\n\n* Wookiee Hired Gun (Marauder)\n\n* Bothan Explorer (Trader)\n\n* Bothan Smuggler (Pilot)\n\n* Rodian Technician (Mechanic)\n\n* Twi'lek Bounty Hunter (Assassin) (Me)\n\n* Gand Technician (Outlaw)\n\nBut on to the story, told from my perspective.\n\nWe were sent by a Hutt to hunt down an assassin droid on the planet of Myrkyr, a planet whose forests have the inconvenient property of being filled with a metal which jams all electronic communication on the planet. As such, with the exception of a couple pointers from fellow outlaws in the spaceport, we were on our own hunting down this droid. Having an agility of 4 and thereby the best Gunnery capabilities, I took it upon myself to man the ventral cannon of our YT-1300 Light Freighter (in case we drew any ground fire, since our wookiees were also being hunted by bounty hunters) while our Bothan Pilot flew the ship. It was during this trip that I learned that our Bothan Pilot is not very good at flying ships, as our engine exploded and we crashed to the surface.\n\nYou can see how this would be a problem for me, sitting in the turret protruding from the bottom of the ship.\n\nWhile I myself lived, my *legs* fared spectacularly poorly. I was able to pull myself halfway out of the turret before we slammed into the ground, dragging my legs along under the full weight of the ship. Our GM went to great lengths assuring me that I was in a remarkable amount of pain.\n\nAfter fighting off some bounty hunters attracted by the crash, and spending a day or two recovering and repairing the ship, we limp back to the spaceport to get some support from the Hutt's contacts. We're informed that our ship repairs would be...pricey, but we figure we'd be able to pay it off if we went back and acquired the bounty hunters' ship (who we'd thoroughly dealt with, turns out vibroaxe-wielding Wookiees are very effective at close quarters, and also at chasing down fleeing, gibbering bounty hunters through the forest). After we made the Bothan pay the security deposit on the truck, which he agreed to since it was kind of his fault we had to be out there anyway, the Hutts lent us a landspeeder-truck so we can get out there to the hunters' ship. It should be noted that the whole time I'm berating the Bothan for his abominable piloting skills in between doses of painkillers. In hindsight, I almost feel bad for him, but hey, my legs were fairly important to me.\n\nUpon arriving at the ship, we sent our astromech to slice into the cockpit of the bounty hunters' ship while I provided sniper overwatch from atop the truck (sniping being my primary means of combat). Seeing some movement in the forest, I alert the rest of the party, the fighters taking cover with the more skill-oriented falling back to the ship interior. I continue scanning the forest, when a blast scores the truck next to me.\n\nI fire a couple shots back toward the source of the blaster, and am met with one in return--also boring a hole in the truck. Between returning fire and dodging blaster bolts, I quietly laughed as I watched the Bothan's security deposit disappear before my very eyes. Looking through the scope, I see that it's a droid firing on us. Alerting the Wookiees and not-my-favorite Bothan to this, they all charge toward the treeline to apprehend our quarry. The droid, appropriately shifting his priorities, opens fire on the charging party members, connecting with the Bothan's arm.\n\nIt is at this point in time that we begin to appreciate the fact that the droid is using a disruptor rifle, demonstrated by the fact that the Bothan's arm explodes, showering the ground with gore and one extremely distressed Bothan.\n\nContinuing to fight the droid between bouts of laughter at the Bothan's misfortune (out of character, I really had begun feeling bad for him), we managed to land a few hits before he begins to retreat. Not accepting this for an answer, I clumsily roll from atop the truck and into the cockpit, with the Gand riding shotgun. We gun it after the droid, when he begins running deeper into the woods. It is at this point that the Gand, who had been my primary care provider during my healing process, climbs onto the hood of the truck. We knew what must be done.\n\nI gun it toward the droid, slamming on the brakes before I kill us both à la Scout Trooper on Endor. The Gand arcs through the air with all the grace of a Rancor on glitterstim, but, despite the truly unsettling number of difficulty dice rolled by the GM, manages to stick the landing, right in front of the droid. Many high fives were had.\n\nHowever, seeing as he was precisely four feet tall and standing in the path of a trained assassin droid, he was bowled over and the droid escaped. But at least the Bothan was able to make amends for nearly grinding my legs out of existence, and will soon have a mighty fine bionic limb for his troubles.\n\nOnce we pay for the repairs on our ship, and that's going to take a *while.*",
        "created_utc": 1404711056,
        "upvote_ratio": ""
    },
    {
        "title": "[GTAV] My First Minutes in Los Santos",
        "author": "OldSoulClothes",
        "url": "http://www.reddit.com/r/gametales/comments/2a09f9/gtav_my_first_minutes_in_los_santos/",
        "text": "So I had just got a hold of GTA V just a few months after release, as you can imagine I am excited to get playing. \nThe first thing I do is head to GTA online, I make my character ending up with a classy but loose looking guy wearing a flat cap and some shades. The introduction sequence plays, I do the first compulsory mission and then I'm out, free, in the city of Los Santos. \n\nIt's dark out, sometime around 3 AM I head out to the nearest clothing store, buy a jacket and then head out to fall in love with a car. The car I chose, (read stole), was the Albany Buccaneer. I proceeded to drive around in the car not knowing what to do next, i drove like this until it was light. At some point  I had decided to follow the traffic laws and I was currently waiting at a stop light when I noticed to players in a car slowly driving towards me. Now, with it being my first time experiencing other players in the open I was cautious, and rightfully so they began shooting at me. I drove, I drove fast, I was not fast enough, on a turn they hit me and my beautiful car went flying into a wall, ruined. I did not have time to mourn the loss of my car's beauty as my pursuers had recovered from the collision and were turning their vehicle around to make an attempt at my life once again. I reacted quickly, I reversed my car, pulled a 180 handbrake turn and sped away, I didn't get far before I noticed they had caught up again. I made a turn into the LS canal hoping to lose them in there. They followed, the pursuit was tense, we were hurtling down the canal, to where I did not know but as long as it was away from them I did not care. We flew up multiple ramps, I was a ways ahead of them at this point but they knew where I was, I saw another ramp and stayed my course, I hit the ramp, it was a short one, I flew through the air, down, down and into a lake. \n\nI was ejected from my car. I swam underwater as my pursuers scanned the surface looking for me, I made my way to a small bit of land, pulled my pistol and turned to meet my pursuers gaze, one jumped in, the next pulled his pistol and began shooting at me, his shots missed, I returned fire, two in the chest one in the head, he was down. I turned to the second pursuer, still swimming towards me but panicking with the death of his buddy. I shot at him, missed I shot again, missed, one more shot, hit. My pursuer changed direction and began paddling away in desperation and fear. I would show no mercy, I aimed my weapon, I took my time and I fired three times. Three hits, it was over, the two lay dead and I stood triumphant. \nAt this I turned looked to the distance and made for the nearby road to find a new Buccaneer. ",
        "created_utc": 1404692200,
        "upvote_ratio": ""
    },
    {
        "title": "[Apocalypse World] Meat Piñata",
        "author": "youdontmeetinaninn",
        "url": "http://www.reddit.com/r/gametales/comments/29z8hi/apocalypse_world_meat_piñata/",
        "text": "Hello and welcome back to You Don't Meet In An Inn!\n\nThis week we continue our first extended series, Apocalypse World.\n\nIn episode 5 of the playthrough the explores an abandoned police precinct and have their first encounter with the dreaded Scooter Babies!\n\nYou can find the podcast on itunes [here](https://itunes.apple.com/us/podcast/you-dont-meet-in-an-inn/id882993415), on not-itunes [here](http://youdontmeetinaninn.libsyn.com/), and our [RSS](http://youdontmeetinaninn.libsyn.com/rss).\n\nYou can follow us on twitter at [Notaninn](https://twitter.com/Notaninn) or email us at YouDontMeetInAnInn@gmail.com\n\nWe hope you enjoy listening!",
        "created_utc": 1404666689,
        "upvote_ratio": ""
    },
    {
        "title": "[Democracy 3] Dr. Insano Goes to Washington",
        "author": "IronRule",
        "url": "http://imgur.com/a/nWZd4",
        "text": "",
        "created_utc": 1404527143,
        "upvote_ratio": ""
    },
    {
        "title": "[Dungeon World] \"Scariest monster ever\" (16 HP)",
        "author": "HistorsEye",
        "url": "http://www.reddit.com/r/gametales/comments/29tfyg/dungeon_world_scariest_monster_ever_16_hp/",
        "text": "So a forum member on apocalypse-world.com asks about monster strength:\n\n\"Also, lets take the Purple Worm. It's GINORMOUS but it has 20 HP and 2 Armor whereas the Elemental had like 27. What is to keep a few good swipes of sword from killing this giant beast?\" \"...why not make a Purple Worm have 250 HP? or even 2000HP?\"\n\nThis was the response:\n\n____\n\n\nAzato,\n\nWe've all played ages of video games and 'classic' RPGs (with the classic fantasy tropes) where we're taught that fighting the monster is a matter of just doing enough papercuts that it falls down while living long enough to do so (the WoW or Final Fantasy model).\n\nBut in Tolkien Smaug wasted a village, killed thousands, but was killed by a single arrow placed correctly in a missing scale.\n\nThink of these fights more in terms of literature and pacing instead of the classic 'they have X hp and we have to swing Y times with Q hits to drop it'.  The problem in this context is that there is no accounting for fiction, this is a mechanical solution (a simulation) of a sword doing consistent damage, and scaling monster HP to allow for the same tool (swing) to be applied to every problem (monster).\n\nI had this problem.  I did a quadruple take when I read that a DRAGON has 16 hit points (a level 1 ranger can do that on a max damage roll).  However let me describe a fight to you and maybe this will give you the 'inkling' of what's happening.\n\nSo the party needed a magic item, and they researched and found that a hero wielding said item was slain by a dragon.  They get some info from a different dragon's drake-in-human-form servant, and go and steal said item.  Remember, magic in this world doesn't mean 'magic' in the +'s sense, but this spear can pierce souls and is thus necessary to defeat a sorcerer king.  Ok, so we have a very angry dragon about to attack something.  16 hp again - ready?\n\nThe party is riding back into town ready for a nice hot bath, some resupplies (their rations were running low), and a re-focus on hunting down the sorcerer king.  The moon goes out for a second, they feel the wind shift, and then something lands on city hall with a massive crack.  They have a few seconds to blink before they see a serpentine head snake down and shred a guardsman in mail in a single hit (announce future badness, this is the 'messy' tag).  They kick up the speed and head towards town.  I plop down paper, and quickly draw some snaking streets, sketch out some boxy houses, plop down a big die to represent the dragon.  As they're about to walk in, I pick up a handful of red tokens, and describe the inhalation they feel from this far, and the words in dragon-speech, and basically drop a pile of red on town and explain it's on fire and how the flames themselves are being shaped and commanded by the dragon.\n\nTheir horses freak.  They manage to get off (a few taking some damage from a panicked horse running and one being hit by a branch).  They start advancing through this hellish landscape, where an inconsistent shadow would swoop down and split someone in half, and people burning to death beg for mercy and help while holding swaddled children turning to ash in their arms.\n\nThe group starts to help the townsfolk (this is not a magical node, so the wizard can't just ritual up some rain) when a building shatters with the landing of a 4-5 ton creature, and it opens up it's pipes, it's golden eyes burning and it's metal hide resonates with a roar (terrifying).\n\nTheir charges scatter, the PC's have to defy their own terror to attack the thing.  They do negligible damage (yay 4 armor) for those that DO anything, and realize that the only person who has a shot at killing this is the armor-penetrating wizard spells.  Unfortunately, so does the dragon.\n\nWhat ensues is horrific.  One fighter takes up defensive position, when the dragon strikes it doesn't just do 1d10+5 damage, it rips off his arm (messy remember?) and shreds mail like tissue paper.  It does breath weapon attacks that cause ALL of them to defy danger or burn.\n\nThe party breaks and runs.  The dragon laughs and settles to ash the village and eat any survivors.\n\nThe Dragon had 16 hit points.  The party did 9 to it before they left.  And when I said left, I mean they ran like rabbits into the night with few provisions, no easy means of recovering them, and no thoughts in their heads other than survival.\n\nThe moral of the story is it's not about the hitpoints.  In my 4e game the party had a dozen dragon kills under their belt.  The dragons were mechanically threatening, they were tricksy, they were tactical, but their claws and teeth didn't do damage, they did numbers.  After this session they explained that they had never been so scared of a monster.\n\nMake the fights epic.  Use the fiction.  Describe their skin curling black from fire.  The bones shattering from the unyielding stone grasp of the earth elemental.  Most fights clean up the fiction by saying you take 5 damage.  Make it stick, make it hard to heal, make them scarred and battle hardened having earned every mark, and every wound a story.\n\nYou don't need 2500 hp to make a fight scary or hard.\n____\n\nSource: http://apocalypse-world.com/forums/index.php?PHPSESSID=0fc85080c74708d62b7b7298b8d7ce5e&amp;topic=2693.msg16185#msg16185",
        "created_utc": 1404469482,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] Chapter 40: Part 1- Fear and Wonder",
        "author": "Malphia",
        "url": "http://adventuresofthealmostheroes.blogspot.com/2014/01/day-115-fear-and-indecision-with-small.html",
        "text": "",
        "created_utc": 1404451718,
        "upvote_ratio": ""
    },
    {
        "title": "[Pathfinder] Player Ragequits Before First Session",
        "author": "SavageWolf1977",
        "url": "http://www.reddit.com/r/gametales/comments/29pyry/pathfinder_player_ragequits_before_first_session/",
        "text": "Some internet friends and I have decided to play Pathfinder with myself as the dungeon master.  For those that don't know, Pathfinder is basically D&amp;D 3.5 with extensive house rules that streamline the game.  From the start we were finding out that we had vastly different experiences with roleplaying, from my background in strict rules enforcement (DMing for 25 years) to some players who were used to very lax rules.  In many ways our gaming experiences are from polar ends of the spectrum.  We are trying to find common ground but I just had this pulled on me.  We haven't even had our first session yet.\n\nPlayer 1 explains that when his druid reaches level 2 he will multi-class and take a level in Ranger.  He then said that he would use Wildshape to age a puppy pet that he wants with him from level 1 to an adult dog that would become his Ranger animal companion.  I told him Wildshape doesn't work like that and he said that he couldn't be in the campaign anymore because I was \"cramping his creativity\".  He then ragequit.  So I explained further once he calmed down:\n\n1) Wildshape is a level 4 druid ability.  He would be a level 1 Druid and would not have access to it.\n\n2) Wildshape is only used to change the Druid into an animal and back again.  It could not be used on a target, in this case the puppy.\n\n3) Wildshape cannot be used to magically age an animal into an adult, combat ready version of that animal.  Once again, it cannot be cast on a target.\n\nI spoke with him at length but he was upset that I wouldn't consider letting him use the spell in that way.  I told him that I would never let him use a spell that he doesn't have to do something that the spell doesn't do.  I told him that he was welcome to be \"creative\" all that he wants as long as it falls within the rules.  He tentatively started telling me a few minutes later about how his other DM lets him play how he wants; I told him we would be using the rules.\n\nDMing a game is supposed to be about creating a fun adventure to share with your friends.  It is supposed to be an enjoyable and  collaborative experience.  He wanted the acquisition of his animal companion to be special; I completely understand that.  I told him he could make it special within the rules.  I suggested that he could use Summon Nature's Ally 1 a few times to summon a dog then that dog could eventually stay with him when he gained an animal companion.  He hated the idea because it wasn't his idea.\n\nSo I'm either a rules nazi who is out to spoil his fun or I'm a referee unwilling to let a player change the rules to his benefit as he pleases.\n\n**TL;DR Player attempts to use a spell he doesn't have to do something the spell doesn't do on a target the spell can't target and then ragequits when I don't let him.**  \n\nBy the way, it may be hard to tell from this story but the average age in this group is about 35 years old.  Yup, we're adults.",
        "created_utc": 1404368586,
        "upvote_ratio": ""
    },
    {
        "title": "[Pathfinder] Exploding flying super squirrels",
        "author": "Condor114",
        "url": "http://www.reddit.com/r/gametales/comments/29pw72/pathfinder_exploding_flying_super_squirrels/",
        "text": "This is a tale about the familiar the world deserves, AND the one it needs.\nIm playing in a pathfinder/ebberon conversion game. One of my fellow players plays a goblin hedgewitch named Akrite (he prefers the term witch doctor). His familiar is a squirrel named Vene. You see normally familiars play a supporting role to the caster. Not Vene, he is the star of the show and Akrite is his sidekick. \nThanks to a bit of divine intervention (house ruling) Vene gained the ability to cast Healing Hexes as well as gained the the celestrial familiar archetype. However while he appears to be a choatic good creature, he is infact plotting the domination of the world, and he shall rule it with his furry fist. \nThis is the most ruthless squirrel ever seen. Thanks to being able to smite evil and use positive energy, he has a sizable kill count.(More so than his witch actually). \nVene has many exploits far and wide, Single handly saving the party multiple times, through much needed healing that no enemy expects. In return for this service he has rendered unto the party he asks for a simple penance. He stores all of this into a specially made handy haversack that he wears like a backpack. This penance recently saved the party during an adventure.\n\nThe party was trying to reach a magical time warping tardis mcguffin and after dispatching resistance, it was just in sight when we were jumped by Essence Reavers. For those of you who dont know, Essence Reavers eat anything magic. Ie perfect mage/magic item user killer. They can shoot back spells cast on them and have a tail attack that works like a powered up dispel magic. The best way to kill them is the old fashion way with non magical equipment. \nNow as the battle raged, vene being the hero he is swoops in attempting to aid another in combat. Sadly He took an attack of oppurtunity from the reavers tail and got struck, the DM rolled and vene got hit in the Handy Haver sack dispelling it temporarily. \nNow thing is when a Bag of holding or a Handy haversack is dispelled, all of its contents are spilled out... and Vene had a lot of things in there.\n\nThis included but were not limited too,\nVarious Healing potions,\nRestoration Potions,\nHealing scrolls,\n1032gold 1silver and 5 copper,\na couatl feather,\nA rust monster,\nAND,\n24 alchemical Fires...\n\nWelp, that essance reaver got far far more than he bargained for with that. He ended up being rocked with about 17d4+34 of alchemical explosion. This leveled the room, knocked Vene and the party soul knife really low. and almost pasted the Essence Reaver.\nThis evened the odds tremendously and allowed us to pull ahead in the ongoing fight.\n\nAlthough, after this is over we need to have a sit down talk with vene asking what he was planning to do with all of that alchemical fire...",
        "created_utc": 1404366208,
        "upvote_ratio": ""
    },
    {
        "title": "[D&amp;D Next] Along for the Ride",
        "author": "ZeronicX",
        "url": "http://www.reddit.com/r/gametales/comments/29nvmy/dd_next_along_for_the_ride/",
        "text": "The cell was dark,  its been three-no four days since I've seen the sunlight. The cell door itself was held together by rope, and i took weak to break them.the only other person was ajother human like me tied to a stretcher. And a small mist of aura in the middle of this room\n\n\n I've heard screaming all day, not unusual at this point but it got louder. Soon i heard the unmistakable sound of footsteps. More than usual this time, and each different. Soon i saw three figures approach the man on the stretcher. Him screaming and was knocked out from the figures not even doing so much. Then they poured water on him to wake up. And set him free. \n\n\nTwo of them turned to me, the third going to investigate the aura in the middle. They shined a torch near my cell and i saw their faces. One was a brown Minotaur with a red streak of paint down his face, the other a hafling. \n\n\n\"Who are you?!?\" The Minotaur yelled, i almost being knocked unconscious from his intimidating figure. \n\n\n\"Ed-Edwards Priest of...  Of Life\" i managed the splurt out. This was apparently enough for the hafling who immediately cut the ropes with his sword. They informed me of my gear in the next room over. \n\n\nStepping out of my cell i saw a man tying himself to a well. He was fully red with horns. Along with 3 other members,  2 elfs,  and another hafling.  No humans other than me and the newly released man. \n\n\nAfter gathering my gear i heard a commotion.  The man jumped through the portal  before emerging out of it and hitting one of the elfs,  he jumped back in. This time being considerably longer before he emerged out being held by a gargoyle. \n\n\n\nThe Gargoyle looked at each of us before moving his finger across his neck. After the incident i learned more about the group. But not about their mission. The other human was a rougeish man who was apparently a Admiral. I found another priest but he followed war instead of life or light. I would have to pray for him later to Apollo or The Consensus. \n\n\nThe Minotaur and the Demon held back to protect us if the Gargoyle came back. The rest of the party (and the two humans included)  moved to the next room.  The Admiral lockpicking the door and opening it in a swift motion. \n\n\nThe room was a lab.  Many breakers and potions spewed around and books splattered everywhere. And the bookshelves not organized.  I explored the room first with one of the elfs and a halfling.  And finding a body with his arm blown off. Another human. \n\n\nThe group explored the room finding many unmarked potions of various colors and books and journals that gave no helpful information. We did find a never ending book and one of the elfs pocketed it. \n\n\nThere were two more doors. One boarded on our end with a plank of wood. The other a royal looking door.  With red and gold paint. Choosing that door the Admiral opened the door with easy with his lock pick.  The Admiral going in followed by one of the elfs examined the dinning room. Candles lit and food ready but uneaten. The door closed on them and a large scittering sound echoed everywhere.  The candles were extinguished. The rest of the party began trying to kick in the door. The Admiral began to lock pick the door and with some time was able to open the door.  The two members being pulled in before the sounds got louder. \n\n\nClosing the door behind them.  We looked at the other one, the one that was boarded. The Admiral said the dinning room was a dead end and this was the only other door. \n\n\nWe each got ready and unbounded the door. The hafling that freed me ran in shining a torch around. \n\n\nWe found a swimming pool.  The hafling poked it with his sword and a Nymph slowly floated into the air until she was able to walk on water. \n\n\nThe hafling went blind,  the entire party  was stuck in the door way. Her beauty too much for me and blinded me. Knocking me down in the process. \n\n\nThe Minotaur ran into the lab room and looked at the Nymph.  Immediately charging her while we were in the way before being blinded by her beauty. \n\nThe next few moments were a blur. I heard \"GET OUT\"  along with \"GET DOWN\".  Then the firing of a crossbolt and the splash of water,  getting  helped up and being healed by the other cleric. The nymph was dead.  We all gathered our supplies snd hunker dowb and assessed the situation.  I taking a rest next to the dead body and examining it. ",
        "created_utc": 1404319902,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] Chapter 39: Peace or Betrayal?",
        "author": "Malphia",
        "url": "http://adventuresofthealmostheroes.blogspot.com/2014/01/day-114-peace-or-betrayal.html?m=0",
        "text": "",
        "created_utc": 1404315693,
        "upvote_ratio": ""
    },
    {
        "title": "Legacy Wars [xpost r/4chan]",
        "author": "Tars_Tarkas",
        "url": "http://imgur.com/a/Wx41Z#5",
        "text": "",
        "created_utc": 1404274291,
        "upvote_ratio": ""
    },
    {
        "title": "Battlefield 4: The Battle of the shipping container",
        "author": "Heylookabrony",
        "url": "http://www.reddit.com/r/gametales/comments/29kzji/battlefield_4_the_battle_of_the_shipping_container/",
        "text": "A few days ago, four friends and I were playing Squad Deathmatch in Battlefield 4. Halfway during a round on Seige of Shanghai, I saw one of those shipping crates with closeable doors on each side, got in, and closed both doors. I then said to my friends: \"Hey we should all go in this shipping crate I'm in and fight from there!\". Eventually we became trapped by the other three squads who would occasionally try to get in or throw grenades (mostly Incindeary). Eventually we had to escape, and I was the only surviver from the initial fleeing, all my friends were gunned down on the spot while I ran past yelling \"I'M FREE SUCKAS!\" Then was shot by a sniper after 30-45 seconds... We won a minute after that with 50 kills while another squad came close with 48 kills.\n\nSo yeah, Only In Battlefield.",
        "created_utc": 1404238879,
        "upvote_ratio": ""
    },
    {
        "title": "[Halo 2] Unlocking infinite ammo (/r/gaming cross post)",
        "author": "HistorsEye",
        "url": "http://www.reddit.com/r/gametales/comments/29k7ko/halo_2_unlocking_infinite_ammo_rgaming_cross_post/",
        "text": "The story is cut and pasted below, written by /u/luckybystander12.\n\nIf you enjoy it, here's a link to go and give the author an upvote: http://www.reddit.com/r/gaming/comments/29hhqp/playing_the_halo_games_on_legendary_these_guys/cil61z8\n\n____\n\n\nGather around folks and listen to my tale of dedication and despair. Of the time I beat Halo 2 campaign on legendary without firing a single bullet, plasma bolt, vehicle mounted weapon, or what have you. Nothing that fired a projectile of some sort. Only grenades, swords, melee, splatters, and the ultimate halo ninja moves you'd have ever seen.\n\nWhy would one take on such a task? Well you see it involves some miscommunication and stupidity in several parts. One day me and a friend I didn't know very well, who is now my best friend years later, told me about how if you beat halo 2 on legendary without firing a weapon you could unlock infinite ammo. I was skeptical but also thought it was plausible. They did add skulls which were pretty cool. So one day I went over to his house and sure enough he had infinite ammo when he played campaign. Right then and there I had a goal. And it began.\n\nFor two solid weeks, every spare moment of free time went into that goal. And it was by far the most challenging task I have ever accomplished. But boy did I learn the ins and outs of halo 2. First I learned that supposed ton of armor plating Master Chief wears on his power suit is nothing but paper once your shield was out. I learned to use and abuse my fellow marines and covenant comrades. I learned every silver elite pulled out a sword when you pissed them off by smacking them in the face. I learn to duck the punches and sidestep to assassinate. I learned those jackal snipers only miss once if they didn't hit the first time, so if you heard something I hope you have cover three feet away. I learned where every enemy and available grenade is located on the map. I learned where every checkpoint was and the convoluted way to manually trigger one yourself. I learned exactly how many plasma bolts, needles, carbine shots, rifle bullets, smg bullets, etc your shield and life can take before dropping dead. I learned those flood spores are the spawn of Satan when your shield was out. I learned to dodge the auto aimed near instashots. I learned to say fuck all you aliens bastards, I'm finding a way on top of the map and walking around you mofo's.\n\nI will say the first mission on that damned space station was the hardest level ever imaginable. Because you couldn't walk around the enemies. No. There were multiple rooms you had to exterminate every last hostile thing before you could move forward. Oh the horror.\n\nAnyway.... After much turmoil and dedicated I finally reached the end. I went face to face with that Grey ass monkey and his hammer. I used all that I learned and used every trick and trade I had. I snuck in hundreds of times with my sword to tickle his asshole. I stuck his hammer with every last sticky grenade on the map, and they'd bounce off his shield if you missed the hammer. It WAS the ultimate show down. And it was amazing.... I beat that monkey into the ground!!! (after I became his rag doll a couple dozen times of course.)\n\nThen I did it! I won! I accomplished my goal! But woe was me when nothing told me I unlocked anything. No infinite ammo was given to me when I started campaign again. The pit of despair was a dark one and loomed over me. Did I fail? Did I fire at some point on accident?\n\nThen something struck me. How did my friend achieve this task? I try to be humble and never be mean but... He was a noob. I played with MLG gamers and could beat them two days out of the week. This guy was a absolute noob compared to me. How could he have possibly accomplished it when I struggled so. He wasn't the kind of guy to lie and I saw for myself he had infinite ammo.\n\nNext day I approached him. This is how the conversation went.\n\nMe: So I did it. I finally beat campaign on legendary without firing any weapons.\n\nHim: Awesome! Did you get the infinite ammo?\n\nMe: No... I never got it.\n\nHim: Darn. That sucks. You sure you didn't fire any weapons?\n\nMe: Yep.\n\nHim: Oh.. I'm sorry dude.\n\nMe: Can I ask you a question?\n\nHim: Sure.\n\nMe: How did you do it? That was the hardest thing I've ever done.\n\nHim: I used grenades the entire time.\n\nMe: How? I knew where and used every grenade on the map. There weren't enough to kill everyone.\n\nHim: Oh. I had infinite grenades.\n\nMe: .... .... .... you had infinite grenades?\n\nHim: Yeah! My friend modded my disc to give it to me.\n\nMy mouth opened for a few seconds. Then I closed it. I lifted my finger and opened my mouth again. Only to close it. Then I closed my eyes. I opened my eyes and stared into his soul.\n\nMe: Did it ever occur to you he modded it so you had infinite EVERY THING and as a joke told you to beat legendary first without firing a single weapon in order to activate it?\n\nHe thought it over for moment then laughed like a jolly fat man in the merriment of merth. But not me. My heart only sank more for I was fooled by a fool and went through all that turmoil for nothing....\n\nBut I must say. Even though I never got my trophy, I was proud of what I accomplished. ",
        "created_utc": 1404221549,
        "upvote_ratio": ""
    },
    {
        "title": "ROUS: Family Feud and Toilet Bombardement",
        "author": "redscores",
        "url": "http://www.reddit.com/r/gametales/comments/29jt20/rous_family_feud_and_toilet_bombardement/",
        "text": "Hello, my name is redscores, first time poster and long time follower.\n\nLast sunday I played my usual Pathfinder with my group with a new player too, the new player wanted to watch first and join later.\n\nTo the heroes:\n\nDrokkar, Half Orc Druid: Yeah, he is a druid and he has a scorpion as a pet (at first he had a bear, a cave bear (bad ass variant), but he wanted a change of pace). He is usually pretty calm and cares deeply for nature.\n\nThe human rogue: Hates nobility, kinda greedy but is chaotic good in his alignment (kinda robin hood like). I will call him Sarolf. Him following as always his wolf, wolf, an old wolf that decided to follow him and who was in feud with the druid....\n\n\nOkay, the adventures are in a homebrew scenario (made by me) called Lands of Tharem.\n\nThe current scenario is: Hiline, a trading city has been taken over by undead, notable a lich and a dracolich. The heroes saw it, made a narrow escape and came to an other city, called Sprebluff, but Sprebluff had been infested already, the king of sprebluff decided that burning down Sprebluff was the only way to keep his citizens from becoming flesh eating monstrosities.\n\nBut the king told them to warn the biggest trading city in this world from this terror, Menyamen the Jewel of Negrestir.\n\nThis is where the tale begins, of two men, a druid and rogue who try to reach nobility in one of the most prestigious cities in Tharem.\n\n-------------------------------------------\n\nThey asked around in the city to find a way to the Pascha of Menyamen and were told that they could get a audience when they freed the merchants from the terror out of the canalisation of Menyamen.\n\nThey heard of giant creatures that attacked merchants and carawans.\n\nSo they decided to explore the canalisations, just to find out where all the poor people in the city are located.... the slums of Menyamen were located in the canalisation.\n\nA good bit further into these underground caverns, where no beggar wanders and no light is burning they found a waterfall of sewerwater, both had to do a swim check, of course Drokkar fails by a long shot, twice and gets sucked down the waterfall, the rogue avoids that fate and takes the right way next to the waterfall. (DC 10.... hard to fail at that)\n\nI will go first with Drokkars Fate and then with Sarolfs fate:\n\nDrokkar: Upon landing at the bottom of the waterfall in a sea of shit and dirt, he sees a rat swimming next to him, which suddenly starts to insult him and annoy him:\n\nRat Boy: \"You asshole, you nearly drowned me up there!\"\n\nDrokkar: \"You are quite unfriendly....\" *he picked up the mouse and held it by the tail*\n\nRat Boy: \"Let me down!\" *bites the Druid*\n\nDrokkar lets the rat go and the rat scurries away. After searching the area around the waterfall he hears a loud rustling and sees a swarm of rats with one extremely large rat as leader, the large rat has a iron crown on the head and rags around it's body.\n\nThe rat king: \"You! You tried to kill my son! Why did you try that?\"\n\n*The small rat from earlier was watching from the sewer hole entrance*\n\nHe tried to explain that he didnt do anything wrong and rolled GODDAMN natural 20 on diplomacy...\n\nThe rat king: \"Ah I see, Son? Did you do all this? Did you bite the poor man? I told you, if you wouldn't stop this shennigans and try to act more like your brothers....\"\n\nThe small rat: \"Yes father....\"\n\nThe rat king: \"Excuse my son, he has been a disappointement for many years now, all my other sons have begun doing jobs and made a name for themselves\" *he points to a rat with a mini-wrench, a rat with a bread and a mini white hat and many others*\n\nThe rat king: \"But he does nothing of that... dreaming of becoming the first rat wizard.... and always trying to swim up that waterfall... Do something for your bread!\"\n\nThe small rat: \"But father!\"\n\nDrokkar tries to calm the rat king and tries to get slowly away but makes a grave mistake.\n\nDrokkar: \"I am interested, did your son ever go to a psychologist?\"\n\nThe rat king: \"Of course! Thats why we have to leave the sewers sometimes!\"\n\nDrokkar: \"Ah I see, maybe I can help?\"\n\nThe rat king: \"Yes! You seem like a competent guy! Maybe you can help my son with his career!\"\n\nDrokkar tries to talk himself out of it, while the rogue appears from behind and is just baffled that his friend is helping giant rat and small rats to solve their \"FAMILY FEUD\". He shouts to Drokkar that he should run and burn them.\n\nThe rogue runs out of the sewer after that, and Drokkar just runs through the sewers until hes atop the waterfall and the player says \n\n\"I hurl a burning sphere to kill the rats.\"\n\nI ask the player: \"Really? I told you multiple times that methane gas is all around you.\"\n\nDrokkar's Player: \"Yes, I hurl the burning sphere.\"\n\nThen I describe how the methane gas causes a extreme explosion, burning everything in the sewers and visible shooting a living inferno out of the sewer entrance.\n\nThen I tell him \"Your body is incinerated, mutilated and torn apart through this explosion, and this explosion burned the ass of every citizen who sat on the toilet at this moment...\"\n\nThe whole group burst into laughing, even the new player.\n\nI tell them: \"Well, Drokkar you gotta roll up a new hero...\"\n\nThe new player instantly says: \"I want one, too\"\n\nThats how a serious session became..... ROUS Family Feud and Toilet Bombardement....\n\nMy original plan: Go into the sewers, don't get seperated and kill the rat king.\n\nNOTE: Next time I will tell of the exploits of the rogue while in the sewers seperated from the druid ;) you won't believe it.\n\n\n",
        "created_utc": 1404205960,
        "upvote_ratio": ""
    },
    {
        "title": "first session:twilight 2000",
        "author": "DrDoolittle01",
        "url": "http://www.reddit.com/r/gametales/comments/29iifz/first_sessiontwilight_2000/",
        "text": "so for fathers day I decided to get my dad twilight 2000. He talked about how much fun he had playing it as a kid, and ive been interested in table top gaming for a while. so for the first session we started as NATO troops, and we created two characters each. I made a German tank crewmen, mechanic, and gunsmith named Erwin, and Canadian/American ranger named Doug. My Dad made a Scotsman named... Scotty, who specialized as an interrogator, and an American named Jack, our doctor. we rolled a Humvee, a 2 1/2 ton truck/ and a 5 ton truck for our starting vehicles, and we started our campaign escaping from kalisz. we decided to avoid the towns for now and headed towards the forest area, driving at the edge of the forest. after several hours had passed, and finding no one but some refugees, we drove into the forest a little ways and made camp. after making our guard rotation up we rested, until scotty spotted a party. Doug was able to identify them as soviet troops, so we readied our weapons. they were walking alongside the forest dragging a wagon with them. they hadn't noticed us. so we decided to ambush them. they had 12 guys vs our 4, but we had two advantages. surprise, and grenade launchers. we waited until they were in close range of our snipers and grenade launchers, then we fired our weapons. within 5 seconds 9 were dead, 1 was wounded, and 2 unhurt. scotty yelled for them to surrender in Russian. 2 dropped their weapons and dived for the ground. one didn't. Doug dispatched him with a shot to the head. we bandaged one guy up, and interrogated them. we then took the supplies on the cart, a 100 kg of food, and left them tied up and blindfolded. if they were lucky a patrol would find them eventually. so we drove away to another forest, and decided to drive into the forest, so as to avoid detection. we made camp and once rested, sent Doug out to scout the nearby towns. the first town Wielun, had over a hundred wounded soviet troops. the second town Praszka, was occupied by soviet deserters who were now marauders. He met some refugees from the town, and they told us they could set up a meeting with some of the town leaders an hour after dark. we agreed, and at night fall we met them. they told us that there were 50 odd marauders, with a BTR and other vehicles in town. I offered our services in exchange for a medium still, the BTR, and first pick on any weapons the occupying force had. they agreed, and so 4 men would take on 50. And win",
        "created_utc": 1404168810,
        "upvote_ratio": ""
    },
    {
        "title": "[DND Next Playtest] \"You could throw me at the wall.\"",
        "author": "cats_for_upvotes",
        "url": "http://www.reddit.com/r/gametales/comments/29h3xr/dnd_next_playtest_you_could_throw_me_at_the_wall/",
        "text": "\"Are you sure you weren't getting mixed signals or something?\" I asked Seraphina.\n\nShe glowered back at me. \"Yes, Aldwyn. Look, he was thinking about hidden fucking passage behind a fucking illusion. It's not that hard.\"\n\nI turn to face her, considering for a moment if she might have read wrong. After a moment, I turn away, scrunching my nose in displeasure. I took the form of a weasel while we snuck through the king's castle, and hid in Seraphina's pocket rather than attempt (and fail) to sneak through myself. \"I'm just saying, if anyone would be able to see through the illusion, it would be me.\"\n\n\"How?\" Our (*ahem*) \"friend\" Anna, a cleric of the God of Madness, piped in, \"The power of *nature*?\" She scoffed. Though she, too, was stumped by the featureless wall, and chose instead to turn away and watch the entrance to the king's bedchamber silently. We had elected to wait out the day here and end the king in his sleep, rather than try to kill him in full view of the palace.\n\n\"I'm not the worst at it either.\" Valenthae would note quietly. She was milling about the bathroom, where Seraphina had seen, through the eyes of the king's unwitting wizard, the entrance of a passage. We had hoped to discover it and explore so we could know if this was an escape route, or else a bunker of sorts.\n\nI pondered the issue for a moment. \"I know,\" I began slowly, \"you could throw me at the wall.\" I was met with silence.\n\nVal was the first to break the silence. She did so with laughter, though was quickly silenced by the hand of an aggravated Anna. \"I'm sorry, what?\" Val was having trouble keeping her laughter contained. \"You know it d-......... Yeah. You know, yeah. Let's do that.\"\n\nOf course I understood. Perhaps I even expected it to happen. Still, I figured if I was going to break the illusion, it might as well be by soaring straight through it. Val offered to do the honors.\n\n\"Wait!\" I say too late, and discover that it does not, in fact, work like that.",
        "created_utc": 1404138816,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] Chapter 38: No Rekka, No Sangrail, No Hope",
        "author": "Malphia",
        "url": "http://adventuresofthealmostheroes.blogspot.com/2014/01/day-113-rehm-pt-4-no-sangrail-no-hope.html?m=0",
        "text": "",
        "created_utc": 1404138514,
        "upvote_ratio": ""
    },
    {
        "title": "Session 48 - Chatting with a God and a journey to Anforn Cavern in the northern tundra.",
        "author": "[deleted]",
        "url": "http://henderbeards.wikia.com/wiki/Session_48",
        "text": "",
        "created_utc": 1404116541,
        "upvote_ratio": ""
    },
    {
        "title": "[Apocalypse World] Did We Just Eat A Baby?",
        "author": "youdontmeetinaninn",
        "url": "http://www.reddit.com/r/gametales/comments/29egj6/apocalypse_world_did_we_just_eat_a_baby/",
        "text": "Hello and welcome back to You Don't Meet In An Inn!\n\nThis week we continue our first extended series, Apocalypse World.\n\nIn episode 4 of the playthrough the party heads North from the Pear Tree Gardens community and begin to discover just what is outside of their little home.\n\nYou can find the podcast on itunes [here](https://itunes.apple.com/us/podcast/you-dont-meet-in-an-inn/id882993415), on not-itunes [here](http://youdontmeetinaninn.libsyn.com/), and our [RSS](http://youdontmeetinaninn.libsyn.com/rss).\n\nYou can follow us on twitter at [Notaninn](https://twitter.com/Notaninn) or email us at YouDontMeetInAnInn@gmail.com\n\nWe hope you enjoy listening!",
        "created_utc": 1404059593,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] Chapter 37: Rehm pt. 3- Into the Underdark",
        "author": "Malphia",
        "url": "http://adventuresofthealmostheroes.blogspot.com/2014/01/day-113-rehm-pt-3-what-came-upon-heels.html?m=0",
        "text": "",
        "created_utc": 1403861791,
        "upvote_ratio": ""
    },
    {
        "title": "The finale of our recent Call of Cthulhu game was simply too good to not share with anyone.",
        "author": "Maoman1",
        "url": "http://www.reddit.com/r/gametales/comments/293z7w/the_finale_of_our_recent_call_of_cthulhu_game_was/",
        "text": "TL:DR at the bottom. I summarize events as best I can, but if you're bored, [here's the PDF for the scenario,](http://www.gwhome.f2s.com/rpg/haldon.pdf) if you want to read it.\n\nAlright, back story time: My character is (the intentionally silly named) Detective Octavio Twiddy, a police detective just out of the world war (it's a 1920 scenario). Three university students were found dead, mutilated and torn to pieces, their car similarly mutilated. No parts were bitten, eaten, or missing - they were simply torn apart and the bodies left there, seemingly by enormous animal claws.\n\nDet. Twiddy teams up with three other university students (Other PCs, my friends) who knew the victims and, through a ton of research and the usual terrifying encounters that nearly kill us multiple times, find out about multiple summoned monsters... twice by seeing them first hand. \n\nI was poisoned by a hidden needle on a small lockbox. The poison is nothing anyone had seen before and there is no known antidote. I would have died within a day or two, but I coincidentally threw up out of disgust at events later that day and noticed a black waxy substance in my vomit - and I suddenly felt a bit better. I spent the next few hours or so regularly filling my stomach, waiting 30-60 minutes, then vomiting, until the vomit comes out clear (or as clear as vomit can). \n\nI had a particularly close call which afterwards, the keeper had to actually stop the game just to explain exactly how fucking lucky I had been - which we later realized was just the beginning of my luck. I had to leave the students behind and explore a place alone, and upon arriving, I find an occult member who, after initially seeming to be dumb and timid, cast a withering spell on me (which causes a limb to very painfully shrivel up into ash). However, the caster had a 10% chance to backfire and it shrivels *his* arm instead. So the keeper rolled a d100... *and fucking rolled a 10.*\n\n....anyways. The only real lead we have is Lord Haldon, who went missing immediately after returning from his trip to london, at the exact same time that an abandoned castle known to have been used for rituals in the past suddenly had movement and light. We tried going to his manor, but his (very much an asshole) butler answers the door and insists Lord Haldon isn't in. We also learn of a plot to summon a monster far stronger than anything that was summoned so far on the night of the next full moon, which by the time we learned this, was two nights away.\n\n___________________________________________\n\nEnd of back story, beginning of finale.\n\nSo after we checked every place we could think of, we were just about to go to sleep for the night when we received an invite from Lord Haldon to join him in his home. We went back to the manor, but the butler insisted Lord Haldon was not in, and thus our invite must have been in error. We were just about to leave when Lord Haldon basically falls down the stairs in his rush to get to the door, shouting \"Jackson you old codger! Let them in, dammit!\" (or similar.) \n\nHe invites us in and we talk about recent events. He was worried he would be incriminated (after all, I was a police detective who had come asking for him the previous day), but we explained we had very little, if any evidence to actually point to him, we only came there to learn what we could. After explaining about the poison and the monsters, he invites us into his massive library, much larger than the university library we originally checked. The butler follows us in, but stands off to the side, near the wall. He offers us a drink, which two of the other players accept. We sit down to discuss things, Lord Haldon proposes a toast, and he and the two students take a drink. \n\nFrom that point, things happen very quickly. The two students who drank immediately begin gurgling and choking, almost instantly dying from what we later learn is a much more potent form of the poison I was pricked with earlier. Simultaneously, I, with my habits from the war, recognize the highly distinctive sounds of gun hammers clicking back into place - two of them. Lord Haldon fires on the third student, shooting him in the head at point blank range, and the Butler fires at me. The keeper says he kills me. \n\nWe reel for a moment, then I say \"WAIT! Let me roll for dodge!\" Normally, our keeper is strict with no dodging guns, since you can't really dodge a bullet, but he specifically pointed out I heard the click, and it's the butler shooting me, who is on the opposite side of the room. He says it's feasible that my war habits would cause me to jump to the side, possibly causing the butler to miss. I roll for dodge (at a level of 24)... and fucking beat it. \n\nDue to recent events, I have become extremely nervous and as such, have begun carrying my old WW1 gun in easy reach on my person. I ask the keeper: due to reflexed honed in the war, would it not make sense that I can whip that gun out and dodge to the side in one smooth movement, pulling my gun out and firing at nearly the same time that the Lord and Butler do. He thinks about it, then agrees, so I roll for handgun... and succeed. Boom, asshole butler is dead. \n\nThe Butler was behind Lord Haldon (and off to the side a little bit), while the student that Haldon had shot was to my side, so Haldon had to turn almost a full 90 degrees to aim at me, while I only had to twitch. I point this out to the keeper and say, theoretically, with a successful roll, I ought to be able to fire at him before he fires at me. He agrees and I roll... *and fucking succeed again.* Boom, Lord Haldon is dead too.\n\nBUT WAIT THERE'S MORE.\n\nI had just looked at the book entry for the first aid skill, and it says that if a player has died, but someone successfully rolls first aid on them immediately (before the dead player's next would-be turn), you can potentially bring them back, causing a \"near death experience,\" instead of actual death. I also have coincidental knowledge that vomiting removes the poison from your system, plus this poison was ingested, so it ought to be particularly effective. I point all this out and the keeper agrees, but says I only have enough time to save one of the two poisoned students UNLESS I roll *extremely* well. I have a first aid of 60, so I'm hoping for 6 or less (one tenth of my skill). I roll... and I pause...... and I lean back and say \"Somebody fucking look at that for me.\" \n\n**ONE**\n\nI seriously rolled a *fokkin* one (For those unfamiliar with CoC, you have to roll **under** your skill to succeed, so a one is a critical *success*, rather than failure). So I rolled *again* for the second student and rolled a 58, and manage save them both (obviously still some remnants of the poison in their body, but I get enough of it out that it goes from instantly deadly to the slow-but-manageable death that I would have received earlier but avoided)... unfortunately, no first aid-ing a gunshot between the eyes.\n\nWe later learn that the Lord Haldon, the Butler, and the guy who nearly shriveled me, but backfired, were the ONLY practitioners, and thus, the super-monster to be summoned on the full moon and destroy the world will no longer be summoned.\n\n_________________________________________________\n\nSO IN SUMMARY\n\nI *SINGLE HANDEDLY* RESULTED IN THE DEATH OF ALL THREE PRACTITIONERS, SAVED ^^all ^^but ^^one ^^of THE STUDENTS FROM THE BRINK OF DEATH, AND SAVED THE WORLD FROM DOOM BY HAND OF GIANT SUPER-MONSTER (probably Cthulhu himself). ",
        "created_utc": 1403744661,
        "upvote_ratio": ""
    },
    {
        "title": "[Skyrim] Blade and Shadow - Part 2",
        "author": "ewpierce",
        "url": "http://ewpierce.com/2014/06/skyrim-chronicles-blade-shadow-part-2/",
        "text": "",
        "created_utc": 1403742352,
        "upvote_ratio": ""
    },
    {
        "title": "A snapshot of my Lawful Neutral Witch2/Rogue1 human before he starts his seafaring adventure.",
        "author": "Chrifu",
        "url": "http://www.reddit.com/r/gametales/comments/2936qw/a_snapshot_of_my_lawful_neutral_witch2rogue1/",
        "text": "“Polliver’s always been a queer lad,” Monsieur Phantine spoke loudly in a crowded bar, a flagon of ale sloshing onto his not-so clean pants. “But he’s always kept my books straight! Sharp eye for numbers, that one.”\n\nPolliver stared calmly at his father through the tavern window. Despite the fact that he couldn’t hear what Monsieur Phantine was saying, he guessed accurately that a joke was being told at his expense. No matter. There was work to be done.\n\nShabby black slacks and jacket blended into the night as Polliver padded around the tavern’s corner, and into the empty street. He buttoned up against the cold, and looked around. His cold, piercing eyes spotted a gray, mottled cat silently approaching him. \n“Maxie,” Polliver whispered. He shook his head in an indication to follow, and began stalking through the shadows. He quickly arrived at his destination, a few blocks down. It was a single-level storefront. A heavy, dark green cloth overhang was rolled up over the top of the door, and the carts that usually displayed goods for sale were chained up next to it.\nPolliver listened intently at the door. Maxie rubbed up against his pant leg, and sat down promptly next to his foot. After a moment, Polliver began picking the store’s lock with a pick he had lifted from his father’s pocket. He and the cat quickly stole inside after a mere moments work.  He calmly made his way around the building, looking for a storage room that contained a certain item that, as of this morning, no longer belonged to his father. \nAfter swiftly picking another lock, this time on a discrete safe hidden away in the corner of a dusty storage room, Polliver was slipping an aged dragon’s tooth into his inner jacket pocket. He was turning to leave when he heard the striking of a match, and saw a candle be lit down the hallway outside of the storage room door.\n\nAs the heavy footfalls of the store owner came slowly down the hall, Polliver ran his hand across Maxie’s back, leaving the fur there standing on end. Maxie walked out into the hallway, baring teeth and hissing at the man. The store owner grunted in surprise.\n“Where did you come from, pussy?” He said, his voice shaking with trepidation. Polliver chose this moment to reveal himself to the man. Standing in front of him with arms raised, Polliver muttered, glaring: \n“Don’t cheat at cards. It’s… wrong.” Speaking in a dead language and moving his hands in an arcane manner, he flicked his fingers at the man, causing him to run screaming out into the night, clad only in his nightgown. \n\nThe stark, cold light of morning was streaming through Monsieur Phantine’s bedroom windows, when his son woke him from a drunken stupor.\n“What?” He growled, covering his eyes. “What is it?”\nPolliver stuttered. “The man across the street, Father…” He held up the aged dragon’s tooth. “He… returned it this morning. He… apologized.”\nMonsieur Phantine squinted at the tooth. What luck, that the scheming bastard across the street felt bad enough about taking from a poor man and his poor son. Peeking out out the window, he saw the store owner across the street stare at the Phantine house, then cross himself in protection before continuing to set up his stalls for the morning trade. Maxie jumped up onto the bed, purring. Monsieur Phantine sniffed, and swiftly lifted the cat with two fingers, tossing him at Polliver.\n“You know this street cat isn’t allowed in the house, boy.” Polliver nodded mutely. “Anyway,” Monsieur Phantine stood and began dressing himself. “It’s a good thing you woke me in time, because I’m shipping you off today.” He grabbed at his temple, the hang-over settling in. “I mean, you’re starting your new job today, boy.” Polliver’s face betrayed no emotions.\n“Go pack a bag. Hurry up.” Monsieur Phantine sat at his desk, swigging from a half-empty bottle of wine placed there. “You like ships, don’t you boy?” He yelled down the hall. “A very well dressed captain is graciously taking you on, room and board included!” He finished off the bottle, and felt his headache recede. After fingering his money pouch, he realized that he had probably spent at least half of Polliver’s stipend last night. No matter, he could make it last until next month. And another stipend each month, for as long as the boy survives at sea. He took one last look in the looking glass. And if the boy doesn’t survive, well then he would get a nice hefty bonus that month. \n“Let’s go, boy!” And with the slamming of the front door, father, son, and cat made their way to the docks.\n",
        "created_utc": 1403727410,
        "upvote_ratio": ""
    },
    {
        "title": "Doing All the Wrong Things for All the Right Reasons: Chapter 4",
        "author": "TheReginator",
        "url": "http://www.reddit.com/r/gametales/comments/291gt6/doing_all_the_wrong_things_for_all_the_right/",
        "text": "[Part 3](http://www.reddit.com/r/gametales/comments/288wf5/doing_all_the_wrong_things_for_all_the_right/)\n\nHey everyone, I’m back! Sorry this took so long.\n\nNow, I bet you guys thought that raping Geoffry to death was the worst thing my group could have possibly done. Well, guess again. Before Lankoris buried his body, they scalped him and stole his clothes so that the Jizzard could impersonate him.\n\nThe party continued north until they reached the southern gate of Jalsheim. Brodin was out front doing pushups.\n\nBrodin: “Oh, hello again, my elf friend. Are you feeling up to the challenge again?”\n\nLankoris: “In a sense. I brought a friend.”\n\nWhisky flexed his massive minotaur muscles.\n\nWhisky: “Bring on the squats.”\n\nBrodin: “Very well.”\n\nBrodin clapped his hands and a couple of guards appeared from behind a nearby building. They constructed the squat bar and rested it on Whisky’s shoulders. With a good strength roll, Whisky easily squatted the heavy load.\n\nBrodin: “Most impressive, my friend. You truly have the glutes for the sloots.”\n\nBrodin produced a piece of paper from a pocket in his shorts.\n\nBrodin: “Here is a merchant’s license. You may sell your wares in my city.”\n\nThe Jizzard took this opportunity to duck into an alley and disguise himself as Geoffry. With his scalp-wig and trousers, he looked just like him.\n\nJizzard: “How do I look.”\n\nMe: “Like a real asshole.”\n\nJizzard: “Sweet.”\n\nThe party ventured to the other side of town. As they got closer, they noticed a foul stench filling the air. A few blocks later, their worst fears were confirmed: the blubberfly had died. Its corpse, which was already full of hydrogen, had bloated up a considerable amount. The Knight of Retribution who had been tasked with guarding it just looked at them and shrugged.\n\nKnight: “...Yeah, nobody told me how to feed this thing.”\n\nJizzard: “I approach the knight. Hello, ser knight, I am here to collect my blubberfly.”\n\nKnight: “Do you have any form of documentation?”\n\nJizzard: “Did anyone tell you what the owner looked like?”\n\nKnight: “Well, my superior officer did describe him as kind of an asshole, and no offense, but you might fit the bill.”\n\nJizzard: “Yes, I certainly do.”\n\nWith a disguise and bluff check, the Jizzard succeeded in taking back the whale. The knight began walking back to Asgaron.\n\nLankoris: “That went well. Now, I’m going to start selling my wares.”\n\nWhisky: “You mean *my* wares. I have the merchant permit.”\n\nMe: “Either way guys, the deck is like thirty feet off the ground and there’s no docking tower or ladder.”\n\nJizzard: “Toss me.”\n\nMe: “Okay. Whisky, roll strength for the throw. Jizzard, roll acrobatics for the landing.”\n\nWhisky: “19. Sweet.”\n\nJizzard: “...2.”\n\nWhisky picked up the Jizzard and hurled him with all his might. It was a powerful throw, but the Jizzard was unable to correct himself in the air in order to stick the landing, and he smacked right into the side of the whale.\n\nThen, it popped.\n\nA massive explosion of dead-bloated-corpse gases and hydrogen sent the Jizzard flying backward and catapulted crates and wooden debris into the air. The town of Jalsheim experienced unusual precipitation of blubber, wood, and various goods.\n\nThe townspeople all came outside after the explosion to see what the hell had happened. Upon seeing a bunch of free stuff on the ground, they immediately began picking up as much stuff as they could, much like a very disturbing pinata.\n\nJizzard: “No! Hey, that’s my stuff! I try to intimidate the villagers to stop taking my stuff!”\n\n6.\n\nThe a few people cast a glance his direction to see what all the noise was about, then went back to scavenging.\n\nJizzard: “I try again.”\n\nMe: “There’s a -2 penalty to trying again.”\n\nJizzard: “I do it anyway.”\n\n8.\n\nRandom townsperson: “Wow, that guy sure is an asshole.”\n\nThe townsfolk stripped the area clean and took their free stuff into their houses.\n\nAmanduh: “Did we manage to save anything?”\n\nMe: “You find two unopened but slightly damaged crates near you.”\n\nJizzard: “I open the first one.”\n\nMe: “It’s full of fancy undergarments and things of that sort.”\n\nJizzard: “Like lingerie?”\n\nMe: “Yeah.”\n\nJizzard: “I take a lingerie.”\n\n\nWhisky: “I open the second one.”\n\nMe: “You find that it is full of hobbit pipe-weed. You can tell that it’s some really good shit.”\n\nEveryone grabbed a double handful of the pipe-weed.\n\nWhisky: “I take an apple out of my inventory, poke two holes into it, and begin to smoke it.”\n\nMe: “You become suitably high.”\n\nWhisky: “I pass it around.”\n\nMe: “As you pass it around, Brodin catches a whiff of the smoke and comes over.”\n\nBrodin: “Hey, can I have a hit of that?”\n\nWhisky gave Brodin the apple.\n\nBrodin: “Wow, that’s good stuff. I’ll pay you for the rest of that crate.”\n\nWhisky: “Deal.”\n\nGold was exchanged, and Brodin carried off the crate of pipe-weed, but not before getting really hungry and gnawing on a chunk of whale meat while muttering something about “gains”.\n\nWhisky: “Oh, I almost forgot why we came here in the first place. Hey Brodin, have you had any bodies go missing around here or anything?”\n\nBrodin: “Wha… no… Oh, wait, I remember hearing something like that had happened over in… uh… Bjorngard, I think it was. You might… want to check there.”\n\nLankoris: “Looks like that’s where we’re heading next.”",
        "created_utc": 1403682143,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] Chapter 36: Rehm pt. 2- Fall, the Prophesied",
        "author": "Malphia",
        "url": "http://adventuresofthealmostheroes.blogspot.com/2013/12/day-113-rehm-pt-2-fall-prophesied.html",
        "text": "",
        "created_utc": 1403667094,
        "upvote_ratio": ""
    },
    {
        "title": "Session 47 - The end of the Carnifex threat",
        "author": "[deleted]",
        "url": "http://henderbeards.wikia.com/wiki/Session_47",
        "text": "",
        "created_utc": 1403605924,
        "upvote_ratio": ""
    },
    {
        "title": "[D&amp;D 4e] Blitz DMing Part 1: The Island",
        "author": "mattwandcow",
        "url": "http://www.reddit.com/r/gametales/comments/28xjtr/dd_4e_blitz_dming_part_1_the_island/",
        "text": "My group is in a transitional phase. A lot of our experienced members moved away and we needed some fresh blood. Unfortunately, our fresh bloods had never really played any RPGs. Since we didn't want to interrupt our current story, Paul (DM) and I whipped up some pretty simple characters at our level and had the 2 join us. It worked okay, until I realized that once we'd level, **I** would have to level up and print out 5 character sheets. This, as you can imagine, was not a pleasant thought.\n\nAnd so Paul and I hatched a plan and it became known as blitz DMing. It was a way, in a sense, to grind the players for character making and DMing experience. Each week would have a new DM and for the first month or so, everyone had to have a new level 5 character. (More advanced rules for Paul and I: we had to play classes we'd never touched before. Very enlightening)\n\nThe first week started with Rob running. It was his first ever and, honestly, it wasn't bad. My first was a lot more epic in scope and therefore a lot more epic in failure. We started on a boat with some guy named Gilligan, which boded well. Needless to say, we were soon stranded on an island. We didn't know why we were on a boat in the first place, but there we were. there were 3 of us that week. Paul was playing an Elf invoker, Smite Dawnstorm (who turned out to be very fun to play and is in his roster of current characters) Jordan (freshblood #2) was playing an elf wizard Ahlondra(or something close. Jordan has this weird relationship with names) and I was playing a pixie sorcerer (with a charge build)\n\nWe wandered about the beach for a bit, making jokes about Lost and 3 hour tours. After a quick circumnavigation and a fishing trip (by the bigger folks!) we decided to stop putting it off and headed into the center of the island.\n\nWhile walking along a path, we came across a clearing, with a ring of.... metal folding chairs. 20 or so of them. Smite and I stopped as soon as we saw them. I even flew back into the trees to get further away from a magic circle of cold iron. Paul and I were absolutely convinced it was nefarious and kept pushing knowledge checks at it, to no avail.\n\nThen comes the elf mage, who decides it'd be a great idea to sit down on the chairs. And does so. And feels relaxation, and peace, and the desire to share this with others. And so he invites us to come sit down with him.\n\nIt was, at this point, that I slipped a note to Paul. \"ensorcelled. Watch him closely.\" He laughed and agreed to watch.\n\nOther stuff happened, that was a little vague. We ended up at this abandoned village where we decided to spend the night. Except I didn't trust the mage, so I conspired again and made a bargin with paul that I would watch the mage all night, if i could sleep on his hat while we were exploring. And so we did.\n\nEventually, we fought a thing and got off the island, shared some tips on how to make monsters and encounters, poked at the various characters to see how they would work (don't recommend the pixie sorc. play an essentials thief instead. Pixies are the perfect race for it) It was a good learning experience for all and was a fun night. \n\n(oh, brief FYI. Jordan wasn't really mind controlled or anything, not that we knew or suspected. The ring of chairs was supposed to be a beneficial effect, but only the mage got it. Paul and I never saw anything that would even make us suspect the 2 of any collusion, but it was VERY fun watching Jordan try and tell us why he wasn't enchanted and our flimsy counter arguments (\"That's exactly what you would say if you were enchanted to say that!\") Fun times)\n\n",
        "created_utc": 1403577998,
        "upvote_ratio": ""
    },
    {
        "title": "The Story of Billy [Animal Crossing]",
        "author": "Tuskinton",
        "url": "http://lparchive.org/Animal-Crossing/Update%201/",
        "text": "",
        "created_utc": 1403562113,
        "upvote_ratio": ""
    },
    {
        "title": "Half a Henderson [Pathfinder]",
        "author": "sorryjzargo",
        "url": "http://sorryjzargo.com/2014/06/23/3030-day-13-half-a-henderson/",
        "text": "",
        "created_utc": 1403499520,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] Chapter 35: My Hometown, Rehm pt. 1",
        "author": "Malphia",
        "url": "http://adventuresofthealmostheroes.blogspot.com/2013/12/day-113-rehm-pt-1_28.html",
        "text": "",
        "created_utc": 1403483832,
        "upvote_ratio": ""
    },
    {
        "title": "[Apocalypse World] Birds of a Feather",
        "author": "youdontmeetinaninn",
        "url": "http://www.reddit.com/r/gametales/comments/28rtfp/apocalypse_world_birds_of_a_feather/",
        "text": "Hello and welcome back to You Don't Meet In An Inn!\n\nThis week we continue our first extended series, Apocalypse World. An extended series is where we play a RP system for one to three sessions of real time, so expect up to TWELVE episodes of AW!\n\nIn episode 3 of the playthrough the party meets some more members of the Pear Tree Gardens community while they make their plans for the mission ahead.\n\nYou can find the podcast on itunes [here](https://itunes.apple.com/us/podcast/you-dont-meet-in-an-inn/id882993415), on not-itunes [here](http://youdontmeetinaninn.libsyn.com/), and our [RSS](http://youdontmeetinaninn.libsyn.com/rss).\n\nYou can follow us on twitter at [Notaninn](https://twitter.com/Notaninn) or email us at YouDontMeetInAnInn@gmail.com\n\nWe hope you enjoy listening!",
        "created_utc": 1403410580,
        "upvote_ratio": ""
    },
    {
        "title": "Glorious adventures of the Tar Bender and the clever Hummingbird",
        "author": "Pedophilipine",
        "url": "http://www.reddit.com/r/gametales/comments/28ptu9/glorious_adventures_of_the_tar_bender_and_the/",
        "text": "So, two friends and I have recently gotten into role-playing and as we have literally no experience, we just decided to start with some freeform campaigns where one of us is the dungeon master and the other two are playing through whatever he thought up. \n\nAnyways, my friend creates himself a character he calls \"Tar Bender\", who is capable of using tar to create an armor (and later even a weapon) for him, can cover enemies in tar and make it sticky or hard and, lastly, can set tar on fire. His stats looked like this:\n\nStrength(Fighting and general strength-based rolls): 1\nAgility(Travel speed, dodging, shooting with a bow etc.): 6\nSurvivability(Blocking and how often one needs to eat): 2\nPerception: 6\nWisdom/Knowledge(for spells and crafting things mainly): 10\n\nSo it was my turn to create a champion and I chose to go with a humanoid hummingbird who was good at improvising shit out of shit, a talent I called \"tinker\". And, because he was a hummingbird, the other traits I chose were \"flying\", giving me +2 agility, and \"Last Resort\", allowing me to use my stinger when I was low and in melee range, dealing massive damage but it could only be used once every few days.\nMy stats looked like this(don't worry, we'll get to the action right now):\nStrength: 1\nAgility: 6\nSurvivability: 10\nPerception: 2\nWisdom/Knowledge: 6\n\nSo, as you can see, we both chose to put very few points into Strength, which we would regret very soon. We started on a clearing, seeing a cave in the distance, some people who told us that the cave was dangereous and several ways going into the forest. Tar Bender used his ability to innovate a new spell once a day to try to make something that \"shoots a ball out of tar, if possible, exploding on impact\". Rolled quite high so there we go, he can now make exploding tar. Will prove to be very useful later on. \nI, being that clever tinker I am, search for sticks, leaves and stones on the ground and am successful. The dm says \"as you are in a forest, you have an unlimited supply of stuff like this as it is literally lying around everywhere. Nice. So off we go, ignoring the \"dangerous\" cave and heading west first, then turning south. Finally, we can see a huge minotaur guarding a treasure chest. Tar Bender uses Perception and notices that the guy has a key for the treasure hanging around his belt. As we don't even have armor, let alone weapons, our chances in open combat seemed to be not-so-glorious so we thought about ways to snatch the key and run off. i came up with the idea of creating a trap pit by digging a hole, filling it with tar and covering it with sticks and leaves.\nThis was going to be the first time we regretted not having put anything into strength. We rolled decently, but still were only able to dig deep enough for the minotaurs knees to be trapped. Whatever, had to be enough. We successfully disguised the hole and now only had to lure the beast into it. Tar Bender chose to use his exploding tar ball to annoy the minotaur so he would run towards us. But, he had to be a total asshole, rolling a natural 20, resulting in the minotaurs spontaneous, horrible death and a medium-sized rage fit by the hummingbird about how broken and gay mages are and how overpowered that shit was and how he was a dick by ruining the awesome plan.\nStill, we were both proud and happy about winning our first encounter, looted the chest for a healing potion and some silver and headed north, evetually exiting the forest and standing in front of a river with a bridge there to cross it.\nHummingbird: \"Is there any reed along the river?\"\nDM: \"Plenty of it.\"\nHummingbird: \"I want to harvest some reed and craft a primitive tomahawk out of a stick, a stone and the reed.\"\nDM(rolling): \"You manage to craft a very shitty tomahawk which makes you look like a retard but awards you +1 offense in combat.\"\n\nHappy and proud I continued using that new-found reed to try and craft me a piece of headwear. DM said it turned out useless but fancy-looking. I ask if I can atleast turn it into some kind of disguise by putting leaves on it. \"You manage to put leaves on it but it's still useless and headwear. You can use it as a basket though.\"\n\nAnd that, my friends, was the point from which on Tar Bender and me became the most broken team ever. I ask: \"Can i fill this basket with tar?\" \n\"Yes.\"\nAnd, as you surely remember, Tar Bender could set tar on fire, so we now had some kind of awesome, primitive bomb/molotow cocktail. And with reed growing everywhere, we soon had quite a lot of them. Because my strength was so low and throwing things was based on strength, I crafted myself a slingshot out of sticks and reed (which was obviously a shitty slingshot, but it did its job). I also managed to use a sharp stone to sharpen some sticks and create arrows (which, thanks to my awesome roll, weren't even \"lousy arrows\" or \"dysfunctional\" for once), but it took my two days and a lot of searching for a decent piece of woods, to craft an (obviously) shitty bow, giving me no benefits at all, besides the ability to shoot arrows.\n\nFinally, after a lot of failed duck hunting with me new slingshot and stones, some failed scouting attempts and Tar Bender innovating a new spell, allowing him to turn tar solid and soft, we crossed the bridge and on the other side was only a way deeper into the forest. In the east, along the river, we could see a town. But first, we followed the way and came to another clearing. \n\nBut this one was full of poisonous mist and the only thing we could see was a giant, perfectly round stone in the middle. We were getting more and more sick and didnt find anything else, so we chose to head for the town first, looking for some information about this place.\nOnce we arrived, the first place we paid a visit to was the local Inn. We were both hungry and could use some sleep. Tar Bender, being the dick he is, asks the barwoman: \"Can we eat and sleep for free here?\"\n\"Yeah, well, no.\"\n\"I wanna shoot her in the face with my exploding tar ball.\"\n\"She dies...\"\n\"Eat that, bitch!\"\n\"... but seven city guards immediately enter the Inn and attack Tar Bender.\"\n\nHummingbird, meanwhile, just sat on some chair and generally did nothing so the guards did not notice him. The guards were really strong (and Tar Bender, definitely, was not) and he just barely manages to survive the first round of attacks, so I choose to assist him by throwing one of my basket-bombs at the guards and Tar Bender makes it explode, killing all of the guards, but we take quite a bit of damage, too. \nThe DM informs us that we are in a small town and those were all the guards they had. Tar Bender makes all the other guests undress themselves, then kneel before him and finally sends them out. Seems like we own an Inn now, nice.\nSo we eat and drink up and go to bed, healing all of our wounds in the process. The next morning, I decide to put straw (which the beds were made of) into all of my tar bombs to make them burn longer and take some cloth with me on the way out. Tar Bender takes all the money the Inn owners had stored with him. \nThen, we enter the General Store. Inside is a girl who tells us that her father went to inspect the poisonous mist weeks ago but never returned. Also says we look strong and asks, if we can go take a look. I ask how we look strong as I am literally a human-sized hummingbird. She says she meant Tar Bender. Go on a rage fit.\nBuy myself a talisman giving +1 to Wisdom and Tar Bender buys a hunting knife which was totally useless but stupidly expensive.\nNext, we enter the tailor who offers scarfs that help against the mist. Tar Bender decides to set the whole place on fire and I try an Agility roll to snatch two of those scarfs before everything goes to shit. I succeed and we are now almost immune to the poison. The last shop in the town in the armor smith. He only has the materials to make us one good armor (we are talking about PLUS THREE in survivability here) but he wants to have money for it, which pisses Tar Bender off.\n\nHe wants to intimidate the guy but fails. I ask the DM: \"I do have unlimited stones, right?\"\n\"Umm... yes, why?\"\n\"I unload my unlimited stones inside the store.\"\n...\nThe smith cries: \"Okay, enough, you can have the armor, please, stop it!\"\nI take the armor, pick up my unlimited stones and we leave, now headed towards the mist again. When we arrive, the place stills smells like shit but at least we don't get sicke anymore. We have no idea what to do here, so I try to hit the round stone with my tomahawk. DM says, I fail. I literally failed hitting a giant stone with a stick. I think I'm definitely going to put some more points into strength next time. Tar Bender tries to innovate a spell that forms a weapon out of solid tar and kinda succeeds, as now he is able to create an axe out of tar that gives him +3 offense. Now its his turn to try and hit the stone and he succeeds!\n\nThe stone starts shaking and moving, then something huge rises from the earth. It turns out we hit the house of a gigantic snail with two muscly arms on each side of the body. Seems like we are fucked.\n\nWe thought that fire would be effective against a snail, so Tar Bender put tar on my arrows andset them on fire. I managed to hit some of arrows, dealing significant damage, but some just bounced off the house. Meanwhile, the snail kept charging at us (with 40 km/h the DM says) and hit us with her arms. So we are both kinda low at this point and the DM says that we cannot eat to restore HP while in a fight, so we have to find a new gameplan, and quick. I fling some baskets with tar onto the giant snail's face and when i succeed, Tar Bender makes the tar become solid, blinding the snail for the rest of the fight and making it unable to dodge attacks. So we both run around, avoiding its relentless, rage-fueled attacks as best as we can while covering the snail in tar until Tar Bender ignites all the tar at once, grilling the snail and awarding us our very first boss kill!",
        "created_utc": 1403353016,
        "upvote_ratio": ""
    },
    {
        "title": "{STWRPG} #1: Adamantium Operating Tables",
        "author": "Doomking_Grimlock",
        "url": "http://www.reddit.com/r/gametales/comments/28pj90/stwrpg_1_adamantium_operating_tables/",
        "text": "I had no idea how I was going to title this little tale. Nothing I could come up with accurately described what I wanted to portray. It took a lovely blunt and a few beers for my brain to finally spit out a title I liked, and this is what you got: Adamantium Operating Tables.\n\nThis story takes place about a year after Palpatine took the big plunge before that short stop at the ground floor. There were four of us, a decent sized party, and we were starting at level 1. There was Kalin Brood, a Rodian Scoundrel, T3-D66 (Ted as we liked to call him), an IG series Assassin Droid, Shao Khan, a Zabrakian \"Diplomat\" (Most lethal diplomat I've ever met), Hark Ono, a human Jedi, and my character: Garon Dex.\n\nWhen I created this character, I had a very specific persona in mind...specifically Slade Wilson. I was determined to make Garon Dex the most lethal non-cloned Mandalorian soldier I possibly could. To that end, I had armed him with a Longsword Style Cortosis-Weave Vibrosword, and a pair of heavy blaster pistols. He had a high intimidation score, a menacing glower, and would've killed a man as soon as looked at him if the payoff was worth it. He wore powered armor (Complete with helmet and Deathstroke paint job), and before we left for the mission, he coerced our employer to permit him to take an unsupervised walk through the armory of the New Republic military base we were starting at.\n\nMy oh my did Garon find some toys. He boarded the ship with three thermal detonators, a heavy blaster rifle, and a number of other slightly useful tools and devices that are really not worth mentioning.\n\nOn to the mission, the reason you're all here! The job was simple: Bothan Intelligence networks had found evidence of a top secret Imperial Base deep in Outer Rim space. The evidence was enough to demand further investigation, but due to more pressing matters, no dedicated Republic forces could be spared. The solution was to hire a small contingent of mercenaries and send them instead. We were those mercenaries.\n\nWe were given coordinates, a giant flying brick with cannons (AKA *The Starchaser*...but we called it The Brick), and sent along our way. It was a pretty straight forward mission: Go in, poke around, kill some stuff, and fly back...at least, that's what we THOUGHT it was going to be.\n\nWe found the planet without trouble. Our first tip off that this was bad news should have been that there wasn't a single Imperial Ship in orbit around the planet. Not one. We wrote it off, believing that if there were star ships there, someone might find out, and that would defeat the purpose of a secret base. Surely, we presumed, there were ground defenses that would activate when we got closer.\n\nWe were wrong again, there were no ground defenses. There was nothing. We landed on the damn coordinates, and all we found there were rocks, grass, dirt, and biting, stinging insects. All around us were dense jungles, thick with trees ranging from as thick around as Garon's wrist, to so large that the entire party could have joined hands and still not surrounded the trunk. We searched pretty well, when Ted got a bright idea: He reasoned that if there *were* Imperial Forces on the planet, then their communications would be broadcast on Imperial Networks, frequencies that were standard in Imperial Military Installations across the Galaxy.\n\nHe rolled to search for such broadcasts, landed high enough to succeed, and we set out in the direction he claimed the signals seemed to be originating from. This meant we had to go through the jungle, and since Hark and Garon were the only ones with cutting weapons, that mean they were on point. We spent three turns of nothing, Garon hacking away with his Vibrosword, Hark with his Lightsabers. Three turns, suddenly, out of no where, we hack our way RIGHT INTO THE ENEMY CAMP.\n\nThere are easily a dozen Storm Troopers surrounding an obvious entryway to an underground lab, they have ALL seen us, and they are all reaching for their weapons. Hark and Garon are taking an offensive stance, waiting for the chance to move. Ted's leveling his rifle at the most Commanding Officer looking trooper in the group, and we are just waiting for the call to roll initiatives.\n\nShao Khan steps forward, hands up, clearly taking the diplomatic approach. He starts talking, asking the troopers to stand down, that he is here by orders of whoever the Rebels were claiming was leading the fractured Empire at the moment, to inspect the security of the base. Now, I know the man behind the Zabrak pretty well IRC, and I know he likes to be pretty sneaky with his characters. I figured he was up to something, so Garon sheathed his sword and played along. While Khan explained away the details of the surprise visit, Garon began pacing, staring down the troopers in an obvious intimidation. I texted the DM IRL asking him to note that with each pace, Garon would be edging just a little bit closer to the nearest form of cover. He went along with it.\n\nThe Zabrak managed to talk the troopers into lowering their weapons while they tried to confirm their story with HQ. The moment the CO's back was turned, the Zabrak reached forward with one hand and activated the poor bastard's thermal detonator, then shoved him towards the nearest group of soldiers. The moment Garon saw him moving, I had Garon ducking behind cover and drawing out that lovely Heavy Blaster Rifle. The CO's Thermal Detonator blew big, killing four other troopers and wounding two more. Garon swung around from cover, grinning under that Yellow and Black Faceplate, and leveled his new toy.\n\nI wanna say he did some kind of bad ass Rambo thing, but he could only pull off two shots per round. I decided to make them count, targeting one of the wounded troopers. I rolled and hit with both shots, killing him. Shao Khan drew and fired on the last wounded one with his blaster pistol, and the Rodian finished him off. Ted was taking his time with a sniper rifle, using his turn to gain a more accurate shot next turn. Hark rushed the remaining six perfectly healthy storm troopers, ignoring everyone's request that he not do that thing.\n\nSee, at level one, he didn't have the proficiencies to wield both Lightsabers effectively. He missed both his attack rolls, one because of luck, the other because of the negatives, and landed himself right in the middle of a big mess of trouble.\n\nThe Troopers rally, and believe you me, they have NO reason to be holding back on us. Storm Troopers are crack shots under pressure. Garon took a hit immediately, but it wasn't a critical so I didn't sweat it. The Zabrak got lucky, a shot went wide and missed him. Ted hadn't engaged anyone, and Kalin was hiding, so they were in the clear. The other four Troopers decided they were going to fire on the Jedi, because yeah, why not?\n\nIn a fantastic display, Fate proved herself to be a complete and utter cunt. Two troopers missed, but the other two? Criticals. Hark went down like a bitch. He wasn't dead, but he wasn't going to be storming any castles for a bit. However, in order to attack him, the Troopers had exposed their flank to me. Ted takes his shot, crits, and drops the trooper. Kalin tries to shoot, fails his roll, and slinks back into hiding. Shao Khan runs for it, because he's just a little bit squishy. Garon drops his rifle, draws his Vibrosword from its back scabbard and charges to attack the nearest Trooper with the blade. I rolled high, critically injuring the Trooper with a powerful slash.\n\nThe Troopers were on me now, but I'm pretty smart when it comes to building fighters. Goran's got decent strength, but his Dex score was his best asset. In that first engagement, Garon would've been shot to shit. Instead, his high dex mod saved him. Ted had fully entered the fray now, taking a shot and wounding one of the three unhurt Troopers. Garon swung his vibrosword, cutting down Ted's most recent victim, and then with his free hand drew his heavy blaster pistol and gunned down the soldier he had wounded last turn.\n\nDeciding that this is the perfect opportunity for the faceless Terminator to show off his Intimidation, I decided to politely ask the Troopers to put down their weapons (Read: Garon, barely capable of keeping the thrill of a good fight from affecting his voice, said \"If you don't put those mother fucking weapons down, I will shove them so far up your ass that a well timed fart could have you belching plasma bolts!\")\n\nThat worked, surprisingly, and we were able to coerce the door access code from them fairly easily. Once we had what we needed, Garon broke both their necks. It felt appropriate to his character, and I stand by that decision. The party was less than comfortable with it, but didn't protest. Sla-er, I mean, Garon retrieved his Heavy Blaster Rifle, the party got Hark back on his feet, and we descended into hell.\n\nGaron never forgot what he saw in that lab. Sick, horrific experiments...mutant abominations, amalgamations of man and machine. It was a small facility, but we decided that we would try to locate the main servers and use Ted's internal hard drives (or whatever the Star Wars equivalent is) to download as much data as we could, then we were getting the fuck out of there.\n\nThis time, it took us three turns to screw up the plan, so I'd call that a success. We were walking through a corridor, having stealthily taken out the first few guards we met (Khan distracted them, Hark and I did the messy work), when we ran into a column of fifteen storm troopers heading top-side to find out why they'd dropped contact.\n\nThe firefight went from bad to worse very quickly. Close quarters, with closed doors on either side? Yeah, we were about to get hosed. Ted managed to open the doors to the rooms around us, giving us a little cover, but also splitting us up. I wound up in some kind of medical station, complete with a polished silver operating table and trays full of sharp pointies. Good rolls on my end allowed Garon to add another kill to his records, but wound up drawing the attention of most of the storm troopers. He fired from cover, while the party did their best to pull the enemies away from him, but Garon kept taking shots, kept getting pushed back.\n\nHe was down to about a quarter of his HP when things got downright grim. Knowing I was wounded, Ted tried to close the door to my room so I would have time to use the medkit I had brought. There were maybe seven guys left by this point, and four of them were pushing into the room. In an act of desperation, Garon primed and threw one of his thermal detonators...which was promptly kicked back into the room by one of the Troopers in the hall. Precisely as the door slammed shut, sealing Garon in a small room with four storm troopers and a primed-to-blow explosive.\n\nThe DM permitted me a reflex save, for all the good it would do Garon. I had to beg just for that, but he caved and I got my roll.\n\nI rolled the d20. The bomb went off, the troopers died, and the door to the room buckled outward from the explosion. Garon's party finished off the last of the troopers, then Hark cut the doors open. The room was a mess, gore and scorched fragments of armor plastering the floors and walls. The blast had slammed the operating table up against the far wall, and for a moment, the Party presumed Garon dead.\n\nI looked the DM in the eye and gave him my biggest smile as I revealed the natural twenty that destiny had graced me with.\n\nGaron Dex rose from behind the table, scorched and a little shell shocked, but unharmed. In the moments before the bomb had exploded, we decided, Garon Dex had taken a chance at survival and leaped over the operating table before flipping it on its side and hunkering down behind it for safety. Garon Dex had danced with the Reaper, and walked away unscathed. He looked at the carnage around him, lifted his face plate, and said \"What the fuck is this table made of? They need to make armor out of it.\"\n\nWe pushed on from there, still intent on securing the information we had come for. By now, there could be no doubt that they would be pulling the plug on the entire operation. We sent Kalin back to the ship, because he was too wounded to be of any use to us here, and continued to the Main Server. Once there, Goran, Khan, and Hark held off another assault of Troopers while Ted downloaded all the information he could from the server.\n\nOnce he was done, we fought clear of the attacking troopers and bolted for the exit. They were following us, and it soon became pretty clear that we weren't going to make it out alive unless someone made a stand. Fairly unhappy with his character, Ted's player volunteered the droid for the mission. Goran stayed with him while Khan and Hark fled for the exit.\n\nGoran and Ted held that hallway for five rounds against insurmountable odds. Goran flung both his thermal detonators as far down the hall as he could before finding cover to fire from. Ted had already found cover and was gunning down anyone still standing after the explosion.\n\nThings got ugly, we were pushed back  every now and again. Before long, Ted had lost an arm, and only one leg was functioning properly. He ejected his internal hard drive, pushed it into Goran's hand, and told him to go.\n\nThe Terminator tucked that hard drive under his arm like a football and ran with it. Ted was left behind, fighting to the end, but it was too little too late. Soon, a veritable army of troopers were after Goran. He dashed up the ramp to the exit, burst out into the clearing, and dove for the wide, open path that they'd cleared on their way in. He was booking it, fast as he could go as Blaster bolts whizzed past his head.\n\nHe broke the tree line...and the ship was gone. The Brick was gone. His party had abandoned him! Abandoned Ted! He kept running, not sure what he was going to do now, and the Storm Troopers flooded out of the trail after him. Before he could even add the traitors' names to his \"To Be Killed\" list, he heard the low rumble of the engines as a shadow swooped over his head.\n\nLaser batteries opened fire as the Brick lowered itself down and the rear hatch opened. Storm Troopers were firing on the ship, but the heavy weaponry on board kept them from getting too close. Khan was waiting on the ramp, arm out stretched to pull Goran aboard as he clambered up the steep incline.\n\nWith Goran and the data safely on board, we hauled ass out of there, intent on collecting our reward.",
        "created_utc": 1403337081,
        "upvote_ratio": ""
    },
    {
        "title": "{Pathfinder} Here there be Dragons!",
        "author": "Doomking_Grimlock",
        "url": "http://www.reddit.com/r/gametales/comments/28ob0x/pathfinder_here_there_be_dragons/",
        "text": "So this is a story I posted to a thread on /r/Pathfinder_RPG. Someone there enjoyed my story enough that he suggested I should post my story here so you fine folks could get a little enjoyment out of it.\n\nIn my experience, dragons can make an adventure incredible...or can slaughter everyone in the first round. It's all in the hands of the DM, he has to decide when your party is ready for the challenge that is a fully grown, very angry dragon. I was very fortunate, my first encounter with a dragon was very fun and had huge rewards! We didn't lose anyone, but the fight actually ended up being split between two game nights, because we were having so much trouble beating it.\nIn this adventure, I was playing a Neutral Good Ninja, specialized in the Kusari-Gama, used a wakizashi for close quarters combat and sneak attacks, and had poisoned shuriken. The party he was involved with were all level ten when this mission happened. We had a Chaotic Good Fighter, a Lawful Good Cleric, and a Chaotic Neutral Wizard. By then we were thoroughly established bad asses, so when we stumbled across a mission asking for experienced adventurers to aide a local order of Paladins who were having significant dragon troubles.\nApparently, the Paladins had an agreement with a Gold Dragon: In exchange for protecting the eggs of Gold, Silver, and Bronze dragons, the Paladins would be allowed to raise a small number of those dragons as mounts and allies. The Paladins had kept the eggs in a deep cave near a Volcanic fissure. One day, a powerful Red Dragon chose to make her home in the cave. Her cadre of followers (mostly orcs and hobgobs) were too good for the Paladins, and every time the Holy Knights managed to get close, the Red would attack them. As far as they know, she has yet to destroy all of the eggs.\n\nSo we agreed to help them, because that's what us Goody types do, and formed a plan to help the Paladins. The Knights would distract the Dragon's underlings, engaging them in battle, while my Party snuck into the cave, and killed the dragon.\n\nThe plan went awry almost immediately. We managed to make it to the dragon's main chamber, but the big lizard was nowhere to be found. We had no idea what was going on. The Wizard was casting detection spells, I was searching for signs of illusions or an indication as to where the dragon had gone. Little did we know that the Dragon enjoyed taking swims in lava. The Fighter was poking around trying to find the eggs, which brought him close to this massive pool of Lava. His back was turned to the pool. You know where this is going.\n\nAs the Dragon rears up out of the Lava, the Fighter managed to botch his spot check, while I slipped into the shadows and tried to keep my head down. The Cleric starts casting buff spells, the Wizard's hurling lightning, and the Dragon just EXPLODES out of the pool. It's throwing Lava everywhere (Yay for Reflex saves!), and the Fighter's finally getting his head in the game. He's got this Greatsword with Icy Burst, and he brings it swinging straight up into the dragon's mouth as she goes in to bite him. Redeeming himself with a natural twenty, the Sword gets jammed deep into the roof of the dragon's mouth, and she was PISSED.\n\nIt's going full fire breath now, the fighter's helpless. We were all pretty sure he was a cooked kobold, but I took a shot. I threw the chain of my Kusari-Gama and latched it around his ankle, yanking him out of the way of the fire blast. He was lucky enough to take his sword with him. Shit just snowballed from there.\nWe were lucky enough to be able to keep the big red bitch in the cave, but by the end of it the Cleric and Wizard were KO'd and bleeding out, the Fighter's ice sword had broken, and the dragon was in full on gloat mode.\n\nThe Ninja, with about a quarter of his life left, spidercrawls his way up a wall and on to the ceiling. His wakizashi was enchanted with Vorpal, and I was just praying for a twenty. The Ninja waited, while the Fighter goaded the Dragon into coming at him. The dragon lunged forward, the Ninja dropped, Wakizashi drawn and ready...a perfect sneak attack. Critical or not, it's gonna hurt. I rolled the dice...\n...and the room erupts. Critical hit now just one dice roll away, I confirmed the strike and CUT THAT MOTHERFUCKING RED BITCH'S HEAD OFF WITH A VORPAL STRIKE. The Ninja lands in a shower of draconic blood, sweeps the blade through the air and sheaths it gracefully, then bows to the severed head of his foe.\nWith the dragon dead, the Paladins were able to mop up the orcs and gobbos, and we got to loot the dragon horde! :D\nWe were also given our pick of dragon eggs, one each. I chose a silver egg, and when it hatched I named the adorable little bugger Anvari.\n\nShe was Ganosuke's companion for many, many adventures.",
        "created_utc": 1403299686,
        "upvote_ratio": ""
    },
    {
        "title": "[DayZ] Without negotiation, conflict erupts for no reason and many tragedies occur",
        "author": "Duckmeister",
        "url": "http://www.reddit.com/r/gametales/comments/28n8ru/dayz_without_negotiation_conflict_erupts_for_no/",
        "text": "This was days after the standalone first released.  For background, the endgame items of the first release were military fatigues, helmet, gas mask, and M4A1.  Every player that had survived long enough to get \"good gear\" had these items.  This means that all the endgame players looked nearly identical.\n\nI had found myself an actual teamspeak-using group of four people including myself, all with endgame gear.  We were currently walking into Zelenogorsk, the third-largest town in the game.  We were moving towards one of the most dangerous places in the game, Balota airfield, which was a few klicks south.\n\nOur group of four had dealt with many stray players, most of whom tried to kill us, so we were on edge as we approached the city.  Any sign of movement would immediately throw us into \"battlestations\", scrambling for cover and attempting to recon the exact position of the \"enemy\".\n\nWe are walking down main street from the north, when we see the sprinting silhouettes of at least seven or eight players scurrying from building to building at the complete opposite end of town (south).  A few of them had endgame gear.\n\nSeeing their aggressive movements, we knew they meant business, and we dove for the nearest hiding spot.  Despite their sprinting, I don't believe they saw us yet.  One groupmate and I ended up in a garage that had eye-level windows facing south, which we decided was the best observation we had to work with.\n\nI look into the other room of the garage to find my groupmate staring out the second set of windows.  I'm about to ask him a question when a few shots ring out.  We confirmed, no one from our group discharged their weapon.  Three more simultaneous reports of rifle fire break out, and I figure that a stray suicidal player decided to fire on the group from within the town.\n\nThose three guys cross the street to loot his body, and more shots ring out.  Again, it isn't us.  This time they don't see the shooter.  All of the sudden, my garage buddy shouts on teamspeak, \"I was running east to get around them and I ran into a guy doing the same thing\" followed by a long burst of gunfire.  \"I got him\", he says, as I look at the gasmask-wearing soldier standing next to me in the garage.\n\n\"You left the garage?  Who is this?  Who is this with me?  Where are the other two, did you move?\"  My group doesn't answer as they begin to fire on the group of three that just crossed the street.  Gunfire erupts throughout the town as bullets riddle the building next to my garage.  The man in the garage turns around as I turn on direct voice chat.\n\n\"Hello?  Are you on teamspeak?\"\n\n\"Yeah, we've been talking- wait, what?\"\n\nMy other two groupmates confirm on teamspeak they aren't in any garages.  I raise my weapon.  The gasmask soldier doesn't.\n\n\"Oh, oh no, oh no, no this isn't, oh no\"\n\nI start yelling \"I'M SORRY\" over and over into direct chat as I unload my entire magazine into him.\n\n-----\n\nThe group-on-group skirmish continues, but my story ends as more gasmask-wearing soldiers rush the garage I was firing from.  I randomly respawn ... in Balota.  A short run north would take me right back to my corpse.  I look around quickly to see if there's anything I could take to defend myself along the way, when I run into another freshly-spawned player.  We both shout friendly, which is almost unnecessary seeing as we have no weapons.  We start talking and he mentions having to get back to his group in Zelenogorsk.  It's the guy.\n\nTurns out the group he was with was an eight-person group that was dedicated to helping new players, and were attempting to follow a strict policy of \"do not fire until fired upon\".  The skirmish still raged in Zelenogorsk while each group's respective ambassador explained, less than 1500m away, their reasons for engaging in combat.\n\nA severe misunderstanding from both sides led to a fruitless massacre of endgame players who would've been friendly to each other in any other context.  None of this information that we relayed to our respective teamspeaks was enough to bring about a ceasefire, and the battle continued for another half hour until our last member bled out.",
        "created_utc": 1403276291,
        "upvote_ratio": ""
    },
    {
        "title": "[Just Cause 2] From Just Cause 2 Multiplayer With Love [x-post from /r/videogametales]",
        "author": "[deleted]",
        "url": "https://imgur.com/a/EPxNj",
        "text": "",
        "created_utc": 1403274536,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] Chapter 34: The Black Sheep",
        "author": "Malphia",
        "url": "http://www.reddit.com/r/gametales/comments/28l445/35_chapter_34_the_black_sheep/",
        "text": "[Chapter 34: The Black Sheep](http://adventuresofthealmostheroes.blogspot.com/2013/12/day-112-black-sheep.html)\n\nI'm posting this chapter differently to spare those of you who'd rather not read filler chapters. The link for the 'interesting' part of Araja's continued tale is posted above. Below are the other three chapters that lead up to chapter 34 for those interested.\n\n*[Chapter 31: One Year Older... And Wiser Too?](http://adventuresofthealmostheroes.blogspot.com/2013/12/day-96-happy-birthday.html)\n\n*[Chapter 32: Wild Creatures of the Night](http://adventuresofthealmostheroes.blogspot.com/2013/12/day-103-wild-creatures-of-night.html)\n\n*[Chapter 33: My Mithril Shirt](http://adventuresofthealmostheroes.blogspot.com/2013/12/day-107-my-mithril-shirt.html)\n\n",
        "created_utc": 1403212440,
        "upvote_ratio": ""
    },
    {
        "title": "[5] The Blazing Saddles technique (short tale from my first game)",
        "author": "Total-Tortilla",
        "url": "http://www.reddit.com/r/gametales/comments/28kxop/5_the_blazing_saddles_technique_short_tale_from/",
        "text": "First story incoming, so bear with me.\n\nI recently joined a D&amp;D group with a friend of mine who was also new. The group was friendly to newcomers, so we decided we'd build characters and join in their campaign. Our DM was hosting a beta build of the 5th edition and they were in the middle of a multi-party campaign through a series of connected dungeons. I rolled up a Bard (because I play the ukulele and figured it'd add to the fun for the party) and my friend was a Paladin, focusing on tanking. We all started at level 6 because of reasons, so I got a few spells together, mostly containing some interpersonal spells like Prestidigitation and Charm Person, hoping to be the team face of sorts.\n\nDidn't go well, as we started off in a dungeon.\n\nSo Paladinbro, our experienced party member (Ranger/Mage who I dubbed the \"Manger\"), and I were in a small forest within the vast dungeon, having been previously led there by someone who claimed to know the exit (according to the DM's backstory). Paladinbro casts a spell to detect Undead creatures nearby, revealing one. I opt to poke my head through the brush to see what it is. Turns out I'm not very sneaky, as we're detected immediately by a Wight and what appears to be a knight in a set of black armor. We roll for initiative and  get to fightin'.\n\nThe fight begins simply enough. I play a Call to Battle while Paladinbro takes the hits and Manger starts casting spells and firing arrows to fend them off. I take a stab with my rapier against the knight, dealing a bit of damage, before noticing there's no head inside of the helmet, as if it was moving on its own. I retreat before the armor can take a swing at me, as I wouldn't last long mono e mono. Paladinbro has taken a few hits due to the Wight attacking with two longswords at once. An acid arrow has dealt a bit of damage to the armor, but it's still kicking hard, and things are going poorly, until I finally look back at my spell list.\n\nHeat Metal.\n\nI cast it on one of the Wight's swords. It bloodies it pretty hard, and drops the blade due to a failed Con roll. The flaming blade hits the ground, catching the eye of Paladinbro. He's just above half-health at this rate, but he's also a wily son of a bitch. He snatches up the blade, being warned by the DM about taking the damage from the spell. He takes all of 6 damage, barely managing to bloody him, and attempts to bring the flaming blade upon the suit of armor.\n\nI wish I could tell you he rolled a natural 20, but it was high enough. He rolled for his attack, added my Call to Battle, and topped it off with a another few rolls from the effects of Heat Metal. The armor is about as resistant to his swing as hot butter, as it's cleaved clean in half before melting into the grass and solidifying at his feet. A Ray of Frost from the Manger manages to finish off the Wight, and we all take a short breather from our assault, proud of our very first victory.\n\nPaladinbro tells me I should keep the blade as a memento from our first successful fight, and we agree that we need to keep this tactic in mind for the future. Our unoriginal minds struggle to think of a proper name for it, until Paladinbro just blurts out \"Blazing Saddles\" with a laugh. We shake and agree that when all seems lost, the Blazing Saddles technique will ride again.\n\nI'm meeting with these guys every week, so I'll try to gather little stories whenever I can. Hope you enjoyed reading!",
        "created_utc": 1403208751,
        "upvote_ratio": ""
    },
    {
        "title": "[ASOIAF] How things ended up *very* differently (Part the first)",
        "author": "Diestormlie",
        "url": "http://www.reddit.com/r/gametales/comments/28jwpg/asoiaf_how_things_ended_up_very_differently_part/",
        "text": "'Twas in the aftermarth on the battle of the Trident that Jon Arryn gathered the party into his tent.\n\nHis agents varied: One Knight (Ser Argen, secretly the last of House Reyne), Two Noble Bastards: Darryn Waters, styling himself The Lord of Lychpoole, fine clothes hiding his horrifically scarred and burnt left arm, Braavosi blade hung at his hip. The only member of the party with a good persuade and deceive.\n\nAryla Stone, all round madwomen, *very* good with a bow.\n\nAnd one Wildling, sadly only with us via Skype.\n\nTheir tasks were simple:\n\n1) Find Rhaegar's squire, kill him, recover Rhaegar's sword, which he was holding and return it.\n\n2) *Return* a Maester (name sadly forgotten for this account) from Duskendale to Jon Arryn's camp (alive.)\n\n3) Head North, and hunt down kill Mors Uller and his merry band of guerrilla fighters (Dhornishmen all.)\n\n---\n\n*Task the First*\n\nOur Wildling tracked the squire (after a start from the Lord Karstark, head of the Camp's Outriders) to a small village. As Darryn found out chatting to the barkeep, said squire was employed in the kitchen.\n\nArlya then snuck into the kitchen, killed the abusive cook, failed to pull an Arnie style *come with me if you want to live* and, rearranged the body into a nearby dungheap while the squire ran away with the Wildling chasing. Then began to loot the room. (Why *yes* we did start with OD&amp;D!)\n\nSaid Barkeep heard the violent death of his employee. Darryn Waters ensured he joined him in the dungheap when he wondered out to investigate.\n\nSaid chase rather abruptly ended when the ground beneath the squire collapsed. The party jumped down after him. One tracking later, we follow him successfully... Out into an underground fighting pit. Ser Argen hasn't arrived yet. Darryn Waters backs off. The two women do not.\n\nTwo dead ringleaders later, they are both in the arena themselves, a single dagger between them. Arlya grabs the dagger, and throws it at the new ringleader (Rorge, the son of the previous ringleader.)\n\n*Four degrees of success later...*\n\nThe Knife takes Rorge's nose off. He also staggers and falls into the pit. He had been wearing a longsword.\n\nVery quickly he found himself without it, shortly after his head.\n\nLeft without her Longbow (which Darryn is now recovering) the following exchange occurs:\n\n**GM:** The four guard (armed with longswords also and wearing armour) draw their blades and approach the walls of the arena, readying themselves to jump in.\n\n**Arlya:** I throw the head at them.\n\n*Beat*\n\n**GM:** ...Roll Marksmanship\n\nSaid roll is many degrees success! And another man falls in the arena. He too loses his head.\n\nThen Darryn throws the bow in with them. Said guard soon die. Then he kills the Squire, having found him hiding in the (somewhat distracted) crowd.\n\nArlya keeps the head.\n\nThen Ser Argen walks in, in full plate, and intimidates. It's very effective, Crowd soon clears.\n\nRorge was using Rhaegar's sword as it turns out. Sword recovered, the party sneak runs back to the village, outpacing the hunting party sent after the double murderers.\n\nPlying some especially idiotic watchmen with some silver stags and an a drunken act, the horses are recovered, and the party swings their way back to the camp.\n\nA hundred Gold Dragons apiece, and a Valyrian Steel dagger for Darryn following this exchange:\n\n**Jon Arryn:** Who among you recovered it?\n\n**Arlya (Who had been the first to use it)** Well...\n\n**Darryn:** I roll persuade.\n\n---\n\nOnwards, to Duskendale!\n\n",
        "created_utc": 1403187586,
        "upvote_ratio": ""
    },
    {
        "title": "[Crysis] This dude knows how to play Crysis: \"I haven't killed anyone with a chicken yet, but I'm working on it.\" [x-post from r/gaming]",
        "author": "nchammer326",
        "url": "http://i.imgur.com/N8mZF.png",
        "text": "",
        "created_utc": 1403181953,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] Chapter 30: Triggers and Power",
        "author": "Malphia",
        "url": "http://adventuresofthealmostheroes.blogspot.com/2013/12/day-81-too-many-triggers-yet-great_16.html",
        "text": "",
        "created_utc": 1403059812,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] Chapter 29: Dad?",
        "author": "Malphia",
        "url": "http://adventuresofthealmostheroes.blogspot.com/2013/12/day-80-reunited-with-rain-party-and-my.html",
        "text": "",
        "created_utc": 1402888878,
        "upvote_ratio": ""
    },
    {
        "title": "Doing All the Wrong Things for All the Right Reasons: Chapter 3",
        "author": "TheReginator",
        "url": "http://www.reddit.com/r/gametales/comments/288wf5/doing_all_the_wrong_things_for_all_the_right/",
        "text": "[Link to chapter 2](http://www.reddit.com/r/gametales/comments/285u1h/doing_all_the_wrong_things_for_all_the_right/)\n\nBack with more. Here’s our second session.\n\nMe: “Okay, Lankoris, you are all alone on the Blubberfly. It is slowly drifting through the air.”\n\nLankoris: “I go to the controls and begin flying.”\n\nHe managed to pass a couple knowledge checks, and was able to fly the whale to the town of Jalsheim just north of Lake Asgaron. He was able to clumsily land it on the ground outside of town.\n\nMe: “You set the whale down on the ground outside the gates. Jalsheim is a modestly sized town. Aesthetically, it kinda looks like Whiterun from Skyrim, except not on a giant hill.”\n\nLankoris: “I’m going to start selling the goods on the whale so that I can get enough money to pay for everyone’s bail.”\n\nMe: “Solid plan. A large crowd has gathered around your landed whale to see what’s going on.”\n\nLankoris: “Hey, you guys want to buy some stuff?”\n\nTownsperson: “Sorry friend, but you have to get a merchant permit to sell goods in this town.”\n\nLankoris: “Where can I get one of those?”\n\nTownsperson: “Go talk to Brodin in the Iron Temple. It’s the big building in the middle of town.”\n\nLankoris navigated his way to the Iron Temple. It was a large hall made of stone. At the far end,  a man sat on a throne. He was very old, with a shaved head and a majestic beard that reached his chest. Despite his age, he was very muscular. He was shirtless, wearing just shorts and boots. He was flanked by several guards that carried quarterstaffs and very heavy-looking iron shields.\n\nLankoris: “Are you Brodin?”\n\nBrodin: “Aye. What do you need?”\n\nLankoris: “I need a merchant permit.”\n\nBrodin: “I see. In order to sell goods in my town, you must prove to be my equal in strength.”\n\nBrodin took a quarterstaff from one of his guards and rested it on his shoulders. Several others affixed their heavy shields to both ends. Brodin then squatted with form so excellent that Lankoris almost needed a will save to keep from mirin.\n\nBrodin handed the improvised barbell to Lankoris, who failed his strength check and was unable to stand back up after he bent his legs. Brodin’s guards lifted the weight off of him.\n\nBrodin: “I am sorry, but I cannot bestow you with a merchant permit. Come back when you are stronger.”\n\nLankoris shamefully walked out of the Iron Temple and returned to where he landed the whale. Among the crowd were three Knights of Retribution. One of the townsfolk pointed towards Lankoris and the knights walked over to him.\n\nGeneric Knight: “Did you really think you could get away that easily? Flying whales aren’t exactly hard to track.”\n\nLankoris: “Um… I don’t know what you’re talking about. That’s not mine.”\n\nGeneric Knight: “Unfortunately for you, we have very convincing testimony from just about everyone in this town that you landed here not too long ago. We can do this the easy way or the hard way.”\n\nLankoris submitted and returned to Asgaron with two of the knights. The third stayed behind to watch the whale.\n\nLankoris was thrown into the jail inside the Order of Retribution headquarters. The rest of the party was there, too.\n\nLankoris: “Hey guys. I tried to rescue you, but they got me.”\n\nWhisky: “Don’t worry about it. We can still break out. I’ll distract the guard. Hey guard!”\n\nThe jailer walked over. He was a large minotaur with dark fur. Wearing the plate armor of the Order of Retribution, he was pretty imposing.”\n\nWhisky: “I just remembered that you didn’t tell me that I have the right to remain silent! I have Miranda Rights!”\n\nJailer: “I don’t know what the fuck those are.”\n\nSeveral days passed. Eventually, Sgt. Adlar came into the prison.\n\nAdlar: “Come with me. The Grandmaster wants to see you.”\n\nThe party was escorted through some halls and up several flights of stairs until they reached the Grandmaster’s chamber. He was old, with gray hair down to his shoulders and a short gray beard. He had an eyepatch over his left eye, and a large scar reaching from his forehead to his cheek passed under it. He wore a red cloak over his plate, and his right shoulder armor was emblazoned with the Sword of Iomedae, the deity that all the Knights of Retribution followed. A massive warhammer was slung at his back.\n\nAdlar: “Grandmaster Ragnar. I have brought the prisoners.”\n\nRagnar: “Very good Sergeant. You are dismissed.”\n\nAdlar left the room.\n\nRagnar: “Now, I want you to explain what you were doing.”\n\nWhisky: “Well, we were killing rats on a guy’s whale, and we got a little carried away. He was kind of an asshole.”\n\nGeoffry popped his head in through the door.\n\nGeoffry: “No, you guys are the a-... Shit! I forgot to go get my Blubberfly!”\n\nGeoffry left. Ragnar chuckled.\n\nJizzard: “Fucking Geoffry.”\n\nRagnar: “You know, you four remind me of myself. I actually used to be an adventurer like you, until I-”\n\nJizzard: “Don’t say it.”\n\nRagnar: “Until I found the light of Iomedae. Anyway, I like you guys, so I’m going to give you a second chance. We have had reports of bodies being stolen from graveyards in the Abjod, and I can’t spare the men to start a full investigation into this. If you do this for us, the Order will forgive you of your crimes.”\n\nAmanduh: “Eh, I don’t really know if-”\n\nLankoris: “We accept your quest.\n\nRagnar smiled.\n\nRagnar: “Good, because if you didn’t, we would have had to cut off your hands. That’s the punishment for thievery. Come with me to the library.”\n\nThe party followed Grandmaster Ragnar until they reached the library. Inside, shelves of books stretched out almost impossibly far. A bald knight stood behind a desk.\n\nWhisky: “Who are you?”\n\nKnight: “You may call me the Librarian. I am the keeper of knowledge for the Order. Welcome, Grandmaster. What can I do for you?””\n\nRagnar: “These four need a map of the realm.”\n\nLibrarian: “Very well. Follow me to the Hall of Maps.”\n\nThe Librarian led the group to a room between a couple of shelves. Inside was a long hall, with metal cylindrical containers inserted into the walls. The librarian ran his fingers under the labels until he reached the one he needed. He removed the container from the wall and handed it to Lankoris.\n\nLibrarian: “This a very old map, but it’s all I can spare right now. You adventurers have a nasty habit of not returning these things.”\n\nThe group took the container and opened it. Inside was a rolled up piece of paper with a couple of strings tying it shut. I actually made it in real life, because props are fun.\n\nhttp://imgur.com/a/ZkvZH\n\nEveryone laughed their asses off.\n\nLankoris: “Oh… why, this isn’t a map at all! Excuse me, Librarian, this isn’t a map.”\n\nLibrarian: “I… I have no idea how that got there. I apologize.”\n\nThe Librarian picked up the “map” in his gauntleted fist. It burst into flames.\n\nRagnar: “It appears someone has stolen the map. Was anyone suspicious in here earlier?”\n\nLibrarian: “Actually, now that you mention it, one of my apprentices said he saw a halfling not too long ago who was muttering something about a whale.”\n\nJizzard: “FUCKING GEOFFRY!”\n\nLankoris: “Thanks for everything, Grandmaster. We know who took the map. We’ll go get it back.”\n\nContinued in the comments.",
        "created_utc": 1402884804,
        "upvote_ratio": ""
    },
    {
        "title": "The story of The General. As dictated by The General [Pathfinder]",
        "author": "TopHatDoctor",
        "url": "http://www.reddit.com/r/gametales/comments/288jgu/the_story_of_the_general_as_dictated_by_the/",
        "text": "Now in the game I'm running my brother is playing a strength character. You know the kind. Matter over mind, all brawn no brain. Well this is his story. \n\n\"General born long time-go. In house from scary-place. General Dad no there. General Mom beat General. General Mom have drinking problem. General Mom hit General with flask. General no like that. General EAT MOM!! General no use soy sauce. General eat mom!\n\nGeneral then go to mountains. General find Bald People. General want be monk. Bald people say General no be monk. General say \"General be monk or General eat Bald People!\" General be monk. \n\nBald People tell General punch trees. Say General know when come back. General punch many months and General know nothing! General hungry... General Eat Tree!!!\n\nAnd that how General be monk.\"\n\nSo yeah he's a meat head. ",
        "created_utc": 1402875063,
        "upvote_ratio": ""
    },
    {
        "title": "{D&amp;D Next] Session 45 - Conquering Naluun Tower and the Black Realm. Tonight I beat the piss out of my players.",
        "author": "[deleted]",
        "url": "http://henderbeards.wikia.com/wiki/Session_45",
        "text": "",
        "created_utc": 1402838720,
        "upvote_ratio": ""
    },
    {
        "title": "Session 45 - Conquering Naluun Tower and the Black Realm. Tonight I beat the piss out of my players.",
        "author": "[deleted]",
        "url": "http://henderbeards.wikia.com/wiki/Session_45",
        "text": "",
        "created_utc": 1402838601,
        "upvote_ratio": ""
    },
    {
        "title": "[Apocalypse World] Ep 2 of You Don't Meet In An Inn: Threats and Promises",
        "author": "youdontmeetinaninn",
        "url": "http://www.reddit.com/r/gametales/comments/286nbv/apocalypse_world_ep_2_of_you_dont_meet_in_an_inn/",
        "text": "Hello and welcome back to You Don't Meet In An Inn!\n\nThis week we continue our first extended series, Apocalypse World. An extended series is where we play a RP system for one to three sessions of real time, so expect up to TWELVE episodes of AW!\n\nIn episode 2 of the playthrough the party meets up with 2 of the major figures in the community and find out what they want. Then everyone makes promises and threats.\n\nYou can find the podcast on itunes [here](https://itunes.apple.com/us/podcast/you-dont-meet-in-an-inn/id882993415), on not-itunes [here](http://youdontmeetinaninn.libsyn.com/), and our [RSS](http://youdontmeetinaninn.libsyn.com/rss).\n\nYou can follow us on twitter at [Notaninn](https://twitter.com/Notaninn) or email us at YouDontMeetInAnInn@gmail.com\n\nWe hope you enjoy listening!",
        "created_utc": 1402810433,
        "upvote_ratio": ""
    },
    {
        "title": "[Mordheim] Crew of the Seaknife, Part 2: Our Lucky Day",
        "author": "PoliteViking",
        "url": "http://www.reddit.com/r/gametales/comments/285vpo/mordheim_crew_of_the_seaknife_part_2_our_lucky_day/",
        "text": "Mordheim is a tabletop skirmish battle game set in the ruined city of Mordheim, in the warhammer fantasy universe. These stories (5 of them, one for each skirmish my warband has been in) are recaps of their battles.)\nThis is the story of the crew of the Seaknife, and their excursion into the city for treasure and glory!\n\nLast scenario, the Crew of the Seaknife were ambushed by some pretty tough orcs, early in the morning. Now, with no way back to their ship and supplies, the remaining crew wander the streets looking for supplies and\na place to lay low. \n\nIt isn't long before they get that Mordheim inner city welcome. The sun is high in the sky when the first arrow plinks against the stone wall behind them. Looking toward the shooter, Loghaine tells his men to take cover! \n\nEileen catches sight of them first. \"Elves! In the building to the north!\"\n\nIt seemed that some elves had taken refuge in a tower in the center of a square. the south wall of the tower was crumbling and exposed. Behind the elves, Loghaine noted, were crates and  barrels. Maybe full of supplies...\n\n\"Move up, boys! Yer gonna take that tower, and fuck all who get in your way, savvy!?\" Loghaine shouted with confidence.\n\n\"Aye, Cap'n!\" The crew responded, drawing pistols and cutlasses. Taking count of his men, he had Yuri, Eileen, 5 crew, and one with the swivel gun.\n\n\"Get that swivel on 'em! keep the pressure up so we can move forward. Taking a look up at the elves, he counted 9. All unarmored. \n\nHis men slinked through the alleys toward the tower, carefully taking cover and avoiding arrows. Just as they burst into the square, they saw them. Another group of humans, all women, clad in heavy armor. The Sisters of Sigmar!\n\nThe Matriarch was going toe to toe with some elven warriors on the ground, flanked by a pair of twins with steel whips. \n\n\"What do we do? we need those supplies!\" Eileen whispered to Loghaine, \"We don't have the manpower to fight off both groups.\"\n\n\"I'd rather wait for them to kill each other.\" Yuri chimed in. A chuckle ran through the 4 pirates behind him. \n\nJust as they were contemplating what to do, the swivel gun went of with a huge BANG! One of the elves was thrown out of the tower's third story onto the ground. This caused everyone else to look their way. Crap.\n\nThe Matriarch barely noticed as she beat down the elves in front of her, before two arrows found their way into her shoulder. It didn't slow her much though. Several sisters began the ascent.\n\n\"We can't let them get the stuff up there,\" Loghaine said, drawing his pistols. \"Let's go, boys, LIGHT EM UP!\"\n\nHis exclamation was joined by another boom, and the sound of rubble being made.\n\nThe crew moved quickly into the tower while the elves were occupied by the Sisters. They climbed up the tower to find the Matriarch finishing off an elf as the rest descended the north side of the building. She was flanked by the twins.\n\n\"Who are you?\" She said with caution. \"We've never seen you in the city before.\"\n\nLoghaine put on his best smile. \"Name's cap'n Loghaine, and yer sittin' on our loot.\" \n\n\"Your 'loot'?\" She said condescendingly. \"These elves were hoarding several pieces of Wyrdstone, and we'll be taking their supplies to fight the heresies in this city.\"\n\nLoghaine sighed and aimed his pistols. His crew followed suit. \"We have you at a disadvantage here.\" He said. \"Just go, fight your heresies for another day.\"\n\nShe weighed the options. \"It's your lucky day, scum. But We'll be seeing you again. And when we do, you'll feel the wrath of Sigmar.\" With that, the trio left the tower and moved to follow the routed elves...\n\nIn game terms: King of the hill scenario, with elves guarding a horde of treasure. The Sisters did most of the fighting but routed when the pirates showed up. ",
        "created_utc": 1402786594,
        "upvote_ratio": ""
    },
    {
        "title": "Doing All the Wrong Things for All the Right Reasons: Chapter Two",
        "author": "TheReginator",
        "url": "http://www.reddit.com/r/gametales/comments/285u1h/doing_all_the_wrong_things_for_all_the_right/",
        "text": "[Part One](http://www.reddit.com/r/gametales/comments/283f52/doing_all_the_wrong_things_for_all_the_right/)\n\nHey again everybody! Here’s part two of our first session. Since there’s a lot of characters, I’m going to slightly alter the writing style to streamline the dialogue.\n\nLankoris: “I see something coming out of that big tower. They’re heading this way. Fast.”\n\nWhisky: “Shit, that’s right. Geoffry was getting the guards. Let’s kill all the rats. Then, maybe we can bluff our way past them by saying we removed the whale to prevent any from escaping.”\n\nAmanduh: “Sounds good. Jizzard, stay here and fly the whale. We’ll take care of the rats.”\n\nThe party entered the cargo bay and walked past the pile of rats that Lankoris had killed. Several more rats scurried out from underneath a stack of fallen crates. Everyone rolled initiative. Whisky went first.\n\nWhisky: “Okay, I’ll use my Stunning Fist ability. For the sake of role-playing, any time I use it, it will be a punch to the balls.”\n\nMe: “Sounds good. Roll attack.”\n\nWhisky critted the roll. I decided that I’m not going to make my players confirm crits, because a nat 20 is a fucking nat 20. Whisky rolled damage, and it was high enough to one-shot the rat.\n\nMe: “You pick up the rat by the scruff of its neck, and punch it in the nuts so hard that it explodes.”\n\nThe party easily dispatched the rest of the rats and moved up some stairs to the second floor of the cargo bay. More rats came out of hiding and attacked. Since they were in a narrow passage only five feet wide, the party had to think creatively to allow everyone to attack. Lankoris killed the last one by finessing an arrow through Amanduh’s legs.\n\nThe party climbed some more stairs to the third and final floor. This area was a little more open than the previous storage areas. At the far end, a crate full of alchemical reagents fell over, spilling some glowing green goo on the floor. A stray rat slurped some up, and immediately began convulsing. Suddenly, it bulged outward, becoming huge and mutated.\n\nMe: “You are now fighting the Badass Rat. Roll initiative!”\n\nLankoris fired off an arrow, but was unable to penetrate the rat’s thick hide. Whisky took a drink of alcohol and charged forward, fists swinging.\n\nLankoris: “Dude, you’re just gonna charge at that thing? It’s pretty powerful.”\n\nWhisky: “I must. I live by the code of my master, Fen Yung Shwei.”\n\nLankoris: “What does his code say about fighting giant rats?”\n\nWhisky: “The same thing as fighting anything else: ‘Don’t be a pussy.’”\n\nAfter a prolonged and epic fight (for level one characters), the party slew the Badass Rat.\n\nMe: “As the rat’s corpse slumps to the ground, you hear several loud thumps coming from the forward deck. Jizzard, three griffons land on the deck next to you. Riding upon each is a Knight of Retribution. They are wearing white enameled plate armor with gold trim. Two of them are wearing greathelms that hide their faces. The third has no helmet.”\n\nJizzard: “What does he look like?”\n\nMe: “He has a blond crew-cut and a square jaw. A huge greatsword is slung on his back. He dismounts his griffon and approaches you.”\n\nKnight: “I am Sergeant Adlar of the Order of Retribution. Under the authority of the Grandmaster, you are hereby under arrest for grand theft.. *-looks around-* whale.”\n \nJizzard: “Um… hello, Ser. I believe you are mistaken. I merely commandeered this fine animal to bring it away from the city so that we could safely exterminate the rat infestation aboard.”\n\nMe: “Roll bluff.”\n\nIt was somewhere around five total.\n\nSgt. Adlar: “Nice try. Unfortunately for you, we have a witness.”\n\nGeoffry hopped off the back of one of the griffons.\n\nGeoffry: “That’s him! That’s of the assholes who stole my Blubberfly!”\n\nJizzard: “Shit. Wait, I’m a halfling! I roll to Go Unnoticed.”\n\nMe: “He’s looking right at you.”\n\nJizzard: “I do it anyway.”\n\nHe rolled and attempted to hide underneath one of the coils of rope on the deck. Sgt. Adlar grabbed his foot and pulled him back out, tied his hands, and threw him on the back of his griffon.\n\nSgt. Adlar: “You two find the rest of them and arrest them. I’ll take this one and the witness back to the keep.”\n\nThe other two knights dismounted and entered the cargo bay.\n\nMe: “You three hear heavy footsteps enter the cargo bay. What do?”\n\nUnfortunately, Whisky’s player had to leave early.\n\nMe: “Damn. Okay, Whisky got too drunk after the victory over the rats and passes out on the floor what do the rest of you do?”\n\nAmanduh: “I go to the far end of the room and wait.”\n\nLankoris: “I take the crowbar I bought earlier and pop the top off of one of the crates in here.”\n\nMe: “You find that it is full of clothes.”\n\nLankoris: “I take all the clothes out and then climb into the crate, pulling the lid closed over me.”\n\nSoon after the lid slid shut, the Knights of Retribution reached the third floor. Lankoris succeeded a sneak check, and the knights walked past his crate to apprehend Amanduh.\n\nAmanduh: “I stare them down as they approach.”\n\nThe knights, somewhat surprised at Amanduh’s inaction, advanced, stepping over Whisky’s unconscious body.\n\nAmanduh: “Just as they get a little too close for comfort, I punch to wall behind me.”\n\nShe rolled 19 for strength.”\n\nMe: “Your powerful punch pops a loose board from the wall. It looks like you could probably squeeze through it.”\n\nAmanduh: “Sweet. I try to escape.”\n\nHer escape artist check was not high enough.\n\nMe: “You manage to squeeze about halfway through the gap, but your boobs get stuck.”\n\nAmanduh: “Shit. I punch one of the knights.”\n\nHer attack bounced off of his armor, and he punched her right back. It did a bit of damaged, but it also managed to push her out of the gap. She fell out the side and bounced off of the blubbery flesh of the whale, but managed to grab on to one of the cables connected to the whales fin. The knight whistled loudly, and his griffon flew from the deck and grabbed Amanduh’s arms in its talons.\n\nAmanduh: “I roll to intimidate the griffon. *-Rolls-* Shit.”\n\nMe: “You scream at the griffon. It screams back at you.”\n\nThe griffon took her back to the deck, where the two knights were dragging Whisky’s body. They threw him over the back of the other griffon like a sack of potatoes, mounted their respective mounts, and set off for the keep.\n\nOnce the coast was clear, Lankoris climbed out of the crate.\n\nEnd of first session.",
        "created_utc": 1402785227,
        "upvote_ratio": ""
    },
    {
        "title": "[Mordheim] The Crew of the Seaknife",
        "author": "PoliteViking",
        "url": "http://www.reddit.com/r/gametales/comments/285ssb/mordheim_the_crew_of_the_seaknife/",
        "text": "Mordheim is a tabletop skirmish battle game set in the ruined city of Mordheim, in the warhammer fantasy universe. These stories (5 of them, one for each skirmish my warband has been in) are recaps of their battles.)\n\nThis is the story of the crew of the Seaknife, and their excursion into the city for treasure and glory!\n\nCaptain Loghaine ordered the crew to drop anchor and set up camp on the docks. He knew the city was a dangerous place, but he was ready for her. He brought the nastiest, most cunning crew he could find. His longtime mates, Yuri (fond of the cat-o-nine-tails and shouting orders), and Eileen Vargas (pretty little thing, don't tell her that or she'll cut your arm off.), were gathering their supplies for tomorrows first raid into the city. Several men were busy unloading the swivel gun, which would always come in handy...\n\nThe night was uneventful, but at first light they heard the sound....\n\n\"WAAAAAAAAAGH!!!!!\" \n\nShit! Greenskins! The men were up and armed in an instant, and the swivel gun loaded and aimed as the band of orcs crested a pile of rubble. BOOM! The swivel gun caught one of the boy'z in the chest, blowing him to bits. The crew fired pistols but the volley was ineffective. The catian note the warboss, a big, surly bastard with a huge axe and armor made of what must have been rocks. The orcs barreled into camp and the melee began. Eileen was fending off a pair, aided by a couple of swabbies. Yuri tripped one with his whip as it charged.\n\nOne of the fool greenskins thought it would be smart to come at Loghaine himself. The orc's hammer swung through the air, leaving him exposed. In a deafening roar, Loghaine fired two shots from his pistols, bringing the thing down. \n\n\"Rally on me, you good fer nuttin' sods!\" Loghaine called to his men. They were being pushed back. Shit. \n\nEileen took the captian's side. \"What do we do, cap? I don't think we're winning.\" As she said it, another crew member crumpled under the warboss's axe.\n\nLoghaine Didn't feel like dying today. He ordered a retreat further into the city. He knew that he could come back and retake the dock and his ship if need be. But for now, He'd rather be alive and grounded than dead by some orc's hand.\n\nHe made brief eye contact with the warboss before putting two shots into him. It barely slowed the beast. \n\nIn Game Terms:Early morning ambush scenario. Orc Warband was more experienced and closed too quickly for us to bring the guns to bear. Luckily the swivel gun was saved and no heroes were wounded.",
        "created_utc": 1402784268,
        "upvote_ratio": ""
    },
    {
        "title": "Doing All the Wrong Things for All the Right Reasons: Chapter One",
        "author": "TheReginator",
        "url": "http://www.reddit.com/r/gametales/comments/283f52/doing_all_the_wrong_things_for_all_the_right/",
        "text": "I’ve been a player in several tabletop rpg groups, in both 4th Edition and Pathfinder. However, every group thus far has fizzled out and stopped meeting up. I decided that if I wanted to finally finish a campaign, I was going to have to organize it myself. So, I took up the mantle of Dungeon Master and got four of my friends (two of whom are veterans of the aforementioned failed campaigns) to see a Pathfinder campaign through to completion.\n\nFirst, allow me to describe our intrepid adventurers:\n\nWhisky: A minotaur Drunken Master who follows the code of his teacher.\n\nLankoris: An elf Ranger who generally tries to do the right thing.\n\nAmanduh: A human Fighter with quite literal bloodlust.\n\nThe Jizzard: A halfling Alchemist and self-proclaimed “Juice Wizard”.\n\nThe adventure began in the city of Asgaron, cosmopolitan city-state located on an island that sits in the center of a large lake right in the middle of the continent of Starfell. To the north, you could find the human kingdom of Abjod, a viking-esque society that gained vast amounts of wealth from its fleets of trading ships. In the Greatwood to the east lived a somewhat Greek race of elves who did elf stuff in the forest. The west and south were home to the dwarves of the Dwarven Empire, who mined for ore in their massive underground cities. Far to the west lay the Impassible Mountains, in which lived clans of Minotaurs that mostly kept to themselves. Asgaron was the heart of it all, a center of trade that was ruled by none of the empires and was governed by a group of Paladins called the Order of Retribution.\n\nAs all great adventures do, this one started in a tavern. Most everybody in the city was drinking and celebrating, for it was Trade Day, when the halflings from the continent of Tengalia far, far the north would fly down on their massive skywhales to sell their exotic goods.\n\nWhen the skywhales (sometimes affectionately referred to as “Blubberflies”) landed, the party went to go see what they had to offer. They walked out the southern gate of the city to the landing area, where large wooden docking towers had been constructed to allow the whales to land safely. It was a marvelous sight. As the group began checking out the wares of all the various merchants, a rather distraught-looking halfling named Geoffry ran up to them.\n\n“You must help me!” He cried, “Giant rats have boarded the cargo bay on my whale and have knawed at the ropes holding everything down! It’s a mess in there and there’s rats almost as big as I am running amok! If you kill them for me, I will reward you handsomely!”\n\nThe party agreed to help Geoffry and climbed the docking tower that led to his whale. They crossed the bridge onto the halfling-built ship. Basically, the whole thing looked like a giant upside-down boat strapped to the whale’s back with an open deck on the front where the flight controls were.\n\nSo far, everything had gone more or less according to plan. I was starting to get the hang of running a game. Then, Whisky spoke up.\n\n“What’s attaching the ship to the dock?”\n\n“Two thick mooring ropes are tied off to the docking tower,” I said.\n\n“I punch the ropes.”\n\n“Fine. Roll strength.”\n\nHe rolled the dice and I rolled my eyes. He rolled low, and only ended up punching the post was tied off to, bruising his knuckles.\n\nAmanduh took notice of what he was doing and decided to join him in his mission to liberate the whale. She approached the other rope and raised her axe. Geoffry, down on the ground, began to take notice of the group's actions.\n\n“Hey, what are you guys doing up there?” He asked.\n\nAmanduh rolled bluff. Success. “Nothing, just trying to find the bathroom.”\n\n“Well, there’s one inside the ship. You could probably find it if you cleared the rats out.”\n\nOnce Geoffry’s back was turned again, Amanduh and Whisky resumed trying to cut the ropes. Amanduh was able to slice through one of them, and Whisky punched the mooring post so hard it broke off at the base. The whale began slowly drifting away from the tower. This was where I had to put away all my notes for the session.\n\n“Wait, no!” Cried Geoffry, “You guys are assholes! I’m getting the guards!”\n\nAs Geoffry ran away to do just that, the Jizzard investigated the flight controls. As he was pretty familiar with halfling technology, he was able to figure out how they worked and was able to fly the whale away from Asgaron with ease.\n\nWhile all this was going on, poor Lankoris was in the cargo bay slaying rats with his bow. He was doing pretty good until the ship began lurching under his feet. He walked out on the deck to see Asgaron far away from them.\n\n“Dammit, guys,” he said, “We were supposed to help that guy. He was going to pay us. Now we’re criminals.”\n\n“Whatever,” said Amanduh, “What do your elf eyes see?”\n\nLankoris rolled perception and squinted into the distance. From the tall tower in the middle of the city, he could see several small shapes fly out from the top and start heading in the direction of the group and their stolen whale.\n\nTo be continued...",
        "created_utc": 1402703720,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] Chapter 28: A Giant of a Problem pt 2- Conversation With an Evil, a Corrupt, and a Demi God.",
        "author": "Malphia",
        "url": "http://adventuresofthealmostheroes.blogspot.com/2013/12/day-79-devastating-joy.html?m=0",
        "text": "",
        "created_utc": 1402637270,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] Solo Puzzle Dungeons Made with Psychology",
        "author": "theclaw9999",
        "url": "http://www.reddit.com/r/gametales/comments/27y933/35_solo_puzzle_dungeons_made_with_psychology/",
        "text": "In my DnD group, we cycled around a bit for who would DM. I ended up doing it most of the time, cause I'm really creative or some shit? I always tried to add something to the adventure that was interesting, unique, or would add flair to an otherwise generic scenario. One game, even now years later, is still talked about amongst my friends. It was dubbed thus: Solo Puzzle Dungeons...\n\nMY TEAM: 1. The pyromaniac sorcerer that solved everything with fire and screaming... lots of screaming 2. The overly dramatic rogue that if he couldn't find a way doing something excessively complicated he would RUN AWAAAAAYYYY... 3. The overly logical cleric, with a sword... that he used a lot... logically... 4. the exotic player that had to do some cray cray build of a monk 5. the wild card... his name is Chris... that's all there is to say about Chris\n\nThe game up to the fun part wasn't great, some random ass battles, some interactions with random shit... but they were heading to this castle in the middle of a huge forest at night, surrounded by a chasm with no bottom. The funny thing was every chance possible I made the rogue find the phrase **\"GREEN EYES WILL BE THE CAUSE OF YOUR DOOM.\"** It was written in trees, on a painting he just had to look behind, random npc's said it to him then ran away... but only the rogue ever found it...  I wanted it to fill his dreams, his waking thoughts... just remembering... green eyes... Eventually they got the castle, opened the doors and got knocked out... like magic or some shit... They were separated and forced to figure out a puzzle with no outside help...\n\n1. The Room with No Exit:\nThe pyromaniac awoke in a completely dark, circular room (illuminated with dark vision).  He walked around a bit and found a small hole he could crawl through that extended out about 60 feet, then went straight up about another 60 feet. Without question he went straight through til it went vertical. He used his non-fire magic to spider climb up that wall. *clink clink clink* When he ALMOST reached the top **POOF**, his magic was gone and he fell to the bottom, hard. He attempted this a couple times... okay a DOZEN more times... *cause if it hurt once, it certainly wouldn't hurt again?* He thought he was all clever and climbed back up to right before the magic stopped and opened up a portable hole. He sat inside, looked around a bit trying to come up with a clever scheme. Eventually, he made a make-shift grappling hook out of some rope and a large gauntlet, threw it above the anti-magic zone, and found himself in a very small box like room.  **NO exit**... He just kinda sat there for a few mins, blinking... (All my other players dying laughing)  He sulked his way back to the original room... He had exhausted all his options, since there was nothing to set on fire or yell at... He was completely out of ideas... after time, the rogue dropped a not so discrete suggestion... **I SEARCH THE ROOM** *LO AND BEHOLD, PRAISE CTHULHU-JESUS* he found a door hidden behind basically a tarp that said \"WALL.\" *Cause the bastard would never actually search anything. A good start.*\n\n2. Two Big Green Eyes:\nThe rogue awoke in a very long hallway that extended both in front and behind him further than he could see. Above him on the wall was carved, **\"GREEN EYES WILL BE THE CAUSE OF YOUR DOOM\"** ...A little startled, he got up and marked on the ground where he started. Then, he just picked a direction. *HOW GENERIC*. As he continued walking he started to hear low, distant, echoing breathing noises... From something very big... He slows down, listens, then continues. He keeps walking, and walking, only being able to see a small bit ahead of him. Then he sees them... **Two big green glowing eyes** staring back at him in the distance. **NOPE NOPE NOPE**, he turns around and just sprints the fuck out of there. He runs, and runs, and runs, until he trips... and falls hard... he looks around and sees he is back exactly where he started. He gets up, and continues walking in the opposite direction he started out at (same as the running away). He continues like this for awhile til he falls through a trap door. He looks around: right back where he started. He scratches his head a bit. **AH HA!** he then begins to search very every tiny piece of dust and stone around that area. *NOT THIS TIME* He found nothing, no piece of evidence, no tool, nothing but his mark in the floor where he started. He looked through his items to find something, ANYTHING to help him. *MMUUUAHAHAHAhaahahah* \"you hear the breathing get louder, like its coming closer\" (my other players, especially the pyro is just dying, he knows exactly what's up) He readies his bow and heads out. At least he'll go down fighting. He just runs toward the sounds and stops... Its those **BIG GREEN EYES** just staring at him in the distance. He looses and arrow **PFFFFffff** and nothing happens... he walks closer, ever closer, with the breathing getting louder and louder... and those eyes getting ever closer. He decides to just run into them, and grabs his rope. **RAAAAAAAAAaaaaaa WAM** and runs through the eyes and straight into a door. *No tricks, no skill, no fighting, all psychological... just the way I like it...*\n\n3. Where Logic has NO Place (my fav):\nThe cleric awoke in a small room, lit with torches, had shelves on the opposite wall with large pots below them, and a door behind him. **SEARCH THE ROOM** was everyone's favorite phrase now. He-found-some-shelves-2-large-pots-with-lids-a-door-and-some-dust... okay lots of dust, normal dust. He opened the door and it was a small hallway 10feet long with another door. As soon as he walked through the door it gently shut behind him. This freaked him out, and he messed with it for a bit. Tried to prop it open with his shoe, but the shoe just got pushed out of the way and shut same as always. He shrugged and opened up the other door. *HEHEHehehehe, fun time* He found himself in a very large, well lit square room. In its center was a small platform a waist height that held a large bowl, filled with water and one small goldfish. Behind the platform/fishbowl was 6 very large moose just kinda chillin. The moose mosey a bit here and there, not really doing anything, not being aggressive, not even acknowledging his presence. **Uhhh...** He makes his way back to the shelf room, looks around again, then heads back to the big room to find... 5 moose, the goldfish, and a trail of blood smeared all over the floor and part of the wall. **OH FUCK** He draws his sword and looks around. He finds nothing out of the ordinary. He slowly heads back to the other room.  (Everyone else was just staring at him like... you dense motherfucker...) He picks up one of the pots and puts it on the shelf. The shelf is too small, the pot falls, and breaks making a loud noise. He runs back to the big room to find the goldfish and now only 3 moose and LOTS of blood all over that side of the room. He looks around once more, \"WHERE ARE YOU?\" He hears laughing... echoing... he runs back to the first room, smashes the last pot (for fun I guess), then returns to the big room. This time the second door slams shut behind him, he turns around... The room is filled with blood falling from the ceiling, oozing down the walls, and pooled all over the floor... all that was left was the platform with the goldfish. He screams \"WHO ARE YOU?\" he hears a very deep voice, **\"I AM HERE MORTAL\"** he looks up, \"ARE YOU THE BLOOD?\" **\"...NO... I AM YOUR DOOM\"** The goldfish jumps out of the bowl on to the blood stained floor \"DO YOU NOW SEE? DO YOU NOW UNDERSTAND YOU ARE WITHOUT HOPE?\" (his face... priceless... everyone else struggling to keep their sides from splitting) He runs up to the goldfish, just staring at it... The goldfish jumps forward at his feet and opens his mouth. He jumps back, and takes a swing, it jumps out of the way. What ensued was actually a very exciting and frustrating battle where he just couldn't hit the damn thing, but if he had stayed in the same square as it for more than one round, it would have eaten him... FINALLY, a 20. With one large arch of his sword, the goldfish was cut in half... out popped a key that fit a lock under the fishbowl. *I find that even the smartest of people, can be equally as stupid if they are inflexible.*\n\nThe other two didn't go as well, but man were they crazy... if anyone is interested I'll post them in the comments. I hope you found the tales as interesting as we did, and thanks for reading my long post.\n\nEdit: EDIT: okay, like I said the other two stories weren't as great, but you can read it in the comments. If there is interest I might make future posts about my best creative ideas FOR THE WHOLE WORLD TO SEE.",
        "created_utc": 1402563956,
        "upvote_ratio": ""
    },
    {
        "title": "Solo Dungeons Made with Psychology [long]",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/gametales/comments/27y7ql/solo_dungeons_made_with_psychology_long/",
        "text": "In my DnD group, we cycled around a bit for who would DM. I ended up doing it most of the time, cause I'm really creative or some shit? I always tried to add something to the adventure that was interesting, unique, or would add flair to an otherwise generic scenario. One game, even now years later, is still talked about amongst my friends. It was dubbed thus: Solo Dungeons...\n\nMY TEAM: 1. The pyromaniac sorcerer that solved everything with fire and screaming... lots of screaming 2. The overly dramatic rogue that if he couldn't find a way doing something excessively complicated he would RUN AWAAAAAYYYY... 3. The overly logical cleric, with a sword... that he used a lot... logically... 4. the exotic player that had to do some cray cray build of a monk 5. the wild card... his name is Chris... that's all there is to say about Chris\n\nThe game up to the fun part wasn't great, some random ass battles, some interactions with random shit... but they were heading to this castle in the middle of a huge forest at night, surrounded by a chasm with no bottom. The funny thing was every chance possible I made the rogue find the phrase **\"GREEN EYES WILL BE THE CAUSE OF YOUR DOOM.\"** It was written in trees, on a painting he just had to look behind, random npc's said it to him then ran away... but only the rogue ever found it...  Eventually they got the castle, opened the doors and got knocked out... like magic or some shit... They were separated and forced to figure out a puzzle with no outside help...\n\n1. The Room with No Exit:\nThe pyromaniac awoke in a completely dark, circular room (he had dark vision).  He walked around a bit and found a small hole he could crawl through that extended out about 60 feet, then went straight up about another 60 feet. He used his non-fire magic to spider climb up that wall. When he ALMOST reached the top **POOF**, his magic was gone and he fell to the bottom. He attempted this a couple times... *cause if it hurt once, it certainly wouldn't hurt again?* He opened up a portable hole, and made a make-shift grappling hook, threw it above the anti-magic zone, and found himself in a very small box like room.  **NO exit**... He just kinda sat there for a few mins... (All my other players dying laughing)  He went back to the original room... and after some suggestions from the rogue... **SEARCHED THE ROOM** *LO AND BEHOLD* he found a door hidden behind basically a tarp that said \"WALL.\" *Cause the bastard would never actually search anything. A good start.*\n\n2. Two Big Green Eyes:\nThe rogue awoke in a very long hallway that extended both in front and behind him further than he could see. He marked on the ground where he started, and just picked a direction. *HOW GENERIC*. As he continued walking he started to hear low, distant, echoing breathing noises... From something very big... He slows down, listens, then continues. He keeps walking, and walking, only being able to see a small bit ahead of him. Then he sees them... **Two big green glowing eyes** staring back at him in the distance. **NOPE NOPE NOPE**, he turns around and just sprints the fuck out of there. He runs, and runs, and runs, until he trips... and falls hard... he looks around and sees he is back exactly where he started. He gets up, and continues walking in the opposite direction he started out at (same as the running away). He continues like this for awhile til he falls through a trap door. He looks around: right back where he started. He scratches his head a bit. **AH HA!** he then begins to search very every tiny piece of dust and stone around that area. *NOT THIS TIME* He found nothing, no piece of evidence, no tool, nothing but his mark in the floor where he started. He looked through his items to find something, ANYTHING to help him. *MMUUUAHAHAHAhaahahah* \"you hear the breathing get louder, like its coming closer\" (my other players, especially the pyro is just dying, he knows exactly what's up) He readies his bow and heads out. At least he'll go down fighting. He just runs toward the sounds and stops... Its those **BIG GREEN EYES** just staring at him in the distance. He looses and arrow **PFFFFffff** and nothing happens... he walks closer, ever closer, with the breathing getting louder and louder... and those eyes getting ever closer. He decides to just run into them, and grabs his rope. **RAAAAAAAAAaaaaaa WAM** and runs through the eyes and straight into a door. *No tricks, no skill, no fighting, all psychological... just the way I like it...*\n\n3. Where Logic has NO Place (my fav):\nThe cleric awoke in a small room, lit with torches, had shelves on the opposite wall with large pots below them, and a door behind him. **SEARCH THE ROOM** was everyone's favorite phrase now. He-found-some-shelves-2-large-pots-with-lids-a-door-and-some-dust... okay lots of dust, normal dust. He opened the door and it was a small hallway 10feet long with another door. As soon as he walked through the door it gently shut behind him. This freaked him out, and he messed with it for a bit. Tried to prop it open with his shoe, but the shoe just got pushed out of the way and shut same as always. He shrugged and opened up the other door. *HEHEHehehehe, fun time* He found himself in a very large, well lit square room. In its center was a small platform a waist height that held a large bowl, filled with water and one small goldfish. Behind the platform/fishbowl was 6 very large moose just kinda chillin. The moose mosey a bit here and there, not really doing anything, not being aggressive, not even acknowledging his presence. **Uhhh...** He makes his way back to the shelf room, looks around again, then heads back to the big room to find... 5 moose, the goldfish, and a trail of blood smeared all over the floor and part of the wall. **OH FUCK** He draws his sword and looks around. He finds nothing out of the ordinary. He slowly heads back to the other room.  (Everyone else was just staring at him like... you dense motherfucker...) He picks up one of the pots and puts it on the shelf. The shelf is too small, the pot falls, and breaks making a loud noise. He runs back to the big room to find the goldfish and now only 3 moose and LOTS of blood all over that side of the room. He looks around once more, \"WHERE ARE YOU?\" He hears laughing... echoing... he runs back to the first room, smashes the last pot (for fun I guess), then returns to the big room. This time the second door slams shut behind him, he turns around... The room is filled with blood falling from the ceiling, oozing down the walls, and pooled all over the floor... all that was left was the platform with the goldfish. He screams \"WHO ARE YOU?\" he hears a very deep voice, **\"I AM HERE MORTAL\"** he looks up, \"ARE YOU THE BLOOD?\" **\"...NO... I AM YOUR DOOM\"** The goldfish jumps out of the bowl on to the blood stained floor \"DO YOU NOW SEE? DO YOU NOW UNDERSTAND YOU ARE WITHOUT HOPE?\" (his face... priceless... everyone else struggling to keep their sides from splitting) He runs up to the goldfish, just staring at it... The goldfish jumps forward at his feet and opens his mouth. He jumps back, and takes a swing, it jumps out of the way. What ensued was actually a very exciting and frustrating battle where he just couldn't hit the damn thing, but if he had stayed in the same square as it for more than one round, it would have eaten him... FINALLY, a 20. With one large arch of his sword, the goldfish was cut in half... out popped a key that fit a lock under the fishbowl. *I find that even the smartest of people, can be equally as stupid if they are inflexible.*\n\nThe other two didn't go as well, but man were they crazy... if anyone is interested I'll post them in the comments. I hope you found the tales as interesting as we did, and thanks for reading my long post.\n\n**tl;dr: solo dungeons, hilarity, dipshits? oh my**",
        "created_utc": 1402562083,
        "upvote_ratio": ""
    },
    {
        "title": "[Skyrim] Blade and Shadow - Part 1",
        "author": "ewpierce",
        "url": "http://ewpierce.com/2014/06/skyrim-chronicles-blade-and-shadow-part-1/",
        "text": "",
        "created_utc": 1402538966,
        "upvote_ratio": ""
    },
    {
        "title": "Session 44 - Journey through pocket realms",
        "author": "[deleted]",
        "url": "http://henderbeards.wikia.com/wiki/Session_44",
        "text": "",
        "created_utc": 1402473685,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] Chapter 27: A Giant of a Problem pt. 1",
        "author": "Malphia",
        "url": "http://adventuresofthealmostheroes.blogspot.com/2013/12/day-79-giant-of-problem.html",
        "text": "",
        "created_utc": 1402465996,
        "upvote_ratio": ""
    },
    {
        "title": "Ranger With Split Personalities",
        "author": "BassMasterFunk",
        "url": "http://www.reddit.com/r/gametales/comments/27ownb/ranger_with_split_personalities/",
        "text": "So the other day my friends and I decided to have a spontaneous DnD game.  We all rolled up new characters at level 6 and had the DM start coming up with a story on the spot.  My character was an Elf Ranger named Launch.  Sort of like the Dragonball character.  Whenever I felt it necessary I would roll a d10 and decide whether I would begin to act chaotic evil or chaotic good (odds were evil and evens were good).\n\nUsing this method lead to some interesting stories which I would like to share with you.  I would like to let you know first that the character was aware of everything they had done while in either \"form\" as it was really by choice that the character did this.\n\nThe first interesting event occurred after our CN sorcerer obtained a wand that shot flames.  He told CE me that he wanted to try it out and I gestured to the people of the city around us. He replied that he would rather have probable cause when using it. Launch thought the proper response would be to yell \"Probable cause!\" and punch a random patron in the face. Now was the perfect time to roll, evens, I now was ready to stand by and not fight as CG me was pretty pacifistic. Lucky enough I only punched a drunk and no one really cared, that time we were lucky.\n\nThe second time however we were not as lucky.  We were in a goblin tavern trying to get information out of the barkeep.  I was CG so I was talking politely and making some headway, once again our CN sorcerer, decided that I had this under control and sat down and helped himself to another patrons beer. The bar keep shouts at him \"Hey! You have to pay for that!\"  The sorcerer replies \"No I don't that guy already did.\"  \"I don't care you aren't drinking for free\" and before those words left the barkeeps mouth I had already rolled, odds.  I shout at the barkeep \"He won't fucking pay for it if he doesn't  want to.\"  \"Oh yeah, what are you going to do about it!\"  I drew my twin short swords and leap into combat screaming \"I'll slit your fucking throat!\" Which turned out to be a bad idea as there were then 10 bugbear bodyguards on top of us. And to make things even worse after I killed one  I went back to CG.\n\nI'm sure I'll play this character more, he's just too much fun not too.  If you guys liked these stories I'll be sure to let you know when anymore arise.",
        "created_utc": 1402316844,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] Chapter 26: Adventures in the Ethereal Plains pt. 2- What a Nice Bunch of Drow",
        "author": "Malphia",
        "url": "http://adventuresofthealmostheroes.blogspot.com/2014/06/day-78-ethereal-plains-pt-2-what-nice.html",
        "text": "",
        "created_utc": 1402286569,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] Chapter 25: Adventures in the Ethereal Plains pt. 1",
        "author": "Malphia",
        "url": "http://adventuresofthealmostheroes.blogspot.com/2013/11/day-78-what-adventures-await-us-in.html",
        "text": "",
        "created_utc": 1402207637,
        "upvote_ratio": ""
    },
    {
        "title": "[Apocalypse World] Showdown at the Seamsters!",
        "author": "youdontmeetinaninn",
        "url": "http://www.reddit.com/r/gametales/comments/27lleo/apocalypse_world_showdown_at_the_seamsters/",
        "text": "Hello and welcome back to You Don't Meet In An Inn!\n\nThis week we begin our first extended series, Apocalypse World. An extended series is where we play a RP system for one to three sessions of real time, so expect up to TWELVE episodes of AW! In the first week of AW we'll be releasing our introduction to the game as well as the first episode of the play through. \n\nIf you're interested in how AW works or want to see character creation check out the intro episode. In it we discuss the main mechanic of the game, the stats, and go through the character creation process for Christine's Angel character.\n\nIf you want to skip right to the action then listen to Showdown at the Seamsters where the adventure gets started when a young man bursts into a PC's workplace/home with thugs hot on his trail. What's this all about? Will the PCs help? What's in it for them?\n\nYou can find the podcast on itunes [here](https://itunes.apple.com/us/podcast/you-dont-meet-in-an-inn/id882993415), on not-itunes [here](http://youdontmeetinaninn.libsyn.com/), and our [RSS](http://youdontmeetinaninn.libsyn.com/rss).\n\nYou can follow us on twitter at [Notaninn](https://twitter.com/Notaninn) or email us at YouDontMeetInAnInn@gmail.com\n\nWe hope you enjoy listening!",
        "created_utc": 1402203232,
        "upvote_ratio": ""
    },
    {
        "title": "[Demon: the fallen Owod] MOTHA FUCKIN MOUSE",
        "author": "Madocvalanor",
        "url": "http://www.reddit.com/r/gametales/comments/27jsky/demon_the_fallen_owod_motha_fuckin_mouse/",
        "text": "In Demon: the fallen, there are seven original houses of demons. My character is from the sixth house, the Rabisu. They were responsible for plant and animal life. My character, Kelerin, took the body of a mortal named Jack, who is a mobster. One of my lore abilities allow me to drink the blood of a certain animal and transform into said animal. A pretty damn effective ability for what I can do with it.\n\nNow, we were tasked by our handler to find out more about an earthbound in the area. It started out with a man showing up at the front door of our first house and suiciding on his front door. He called the cops, they showed up, took the corpse out of the apartment and at about that time, the handler showed up and gave us our task. So lets skip to last night... we had to get info on our suicider. Well, while everyone else was thinking, let's go to the shadow lands, my rabisu came up with a different plan...\n\nI head outside and call out to an animal... one that was the master of stealth and fitting into tight spaces... the ever humble field mouse. I caught it, brought it into my bastion, and drank a drop of its blood and voila! I was a mouse!\n\nWhat the DM didn't tell me was that.... I gain a derangement in my animal forms, and apparently this forms derangement was it was the MOTHA FUCKING KING OF MICE. For the next hour, I was sneaking around the police station while the whole time... \"Your scurrying about, saying yeah, I fuckin own this place! This shits mine!\" I had to resist the call of cheesethulu, find my way up into the forensics lab... thanks to my rat kin who decided to help the motha fuckin mouse king, and finally...\n\nI was hiding in the vents above, looking down on a woman who was running the lab. My derangement kicked in and I lept down onto the woman, squeeked my mightiest, dominating squeek, and marked my territory on her before being thrown off and watching her run out the room screaming to the bathroom! I ran my mousy ass off to the computer and got the name we needed... however... in the five minutes it took me to get the info, my nemisis returned with a vengeance! AND THUS BEGAN MY EPIC BOSS BATTLE! \n\nI owned this! She got nothin on Mouse King! I leapt at her and scrabbled up her leggings, only to be thrown across the room hard and landing hard against the wall again, this time taking a lethal damage! (By the way, mouse king, you only got to hit points in this form.) Oh shit! Panic mode! I dive behind a filing cabinet as she dived at me, moving to an eyewash station where I climbed up onto the piping! She dove again and I lept! She missed! Whoo! SQUEEK SQUEEK MOTHAFUCKA. I dive for the door escaping combat!\n\nAfterwards it took the group about an hour to stop laughing. We ended the night with my rabisu goin home and relaxing the best way he knows how, drinking from his personal still.",
        "created_utc": 1402151352,
        "upvote_ratio": ""
    },
    {
        "title": "Speed Runners (/r/Shadowrun x-post)",
        "author": "Valanthos",
        "url": "http://www.reddit.com/r/gametales/comments/27idgn/speed_runners_rshadowrun_xpost/",
        "text": "Hey Chummers,\n\nLet me weave you a tale of four very lucky street level runners who managed to pull of a job with no issues. Four loosely connected people were all out of a job and rent was coming up. Fortunately \"Ghost\" Donovan had an ex-Shadowrunner friend who knew someone in need of a job.\n\nKnowing he couldn't do it himself he called up the only three people he knew who would be equally down for a job. \"Gecko\" just out of college broke arse mage, his roomie who unbeknownst to him was a decent locksmith and all around sneak and the Sys Admin of a local catering biz.\n\n//I really should remember their names but they are just some peeps that I barely know.\n\nTell my lil' boy that I'm going to be out for the day to keep the tunes low and do his homework. If anyone tries to break in open a window put a couch against the door and hide in the bathroom. Hug him goodbye and am out the door.\n\nAnyways we rock up to the meet nasty arse nightclub, everyone shows except the SysAdmin who shows in the form a small overing drone. Dwarf bouncer is standing on a pile of bricks to bring him up to height. He's packing and whilst it isn't in the open that isn't no pea-shooter so it's obvious as drek. I start to just breeze right in before he stops me. After telling him I'm here for Mr. Johnson he lets me right on through.\n\nThere he is a short fat man with more wealth than taste in a terribly out of date suit with hair greasier than most mechanics. Next to him is the most pissed Ork I've seen this week, lots of Muscle and holding a sub right out in the open.\n\nI lay on it like a chill brother. Get the deets on the job and how much he wants it done for. Apparently a new dealer has shown up on his turf and he should be taught a lesson, with all of his stash ending up right in his possession, says he's willing to pay 10k Nuyen for the drugs and the lesson. He gives us the street he's been dealing on, license plate on his van and a mugshot of the perp.\n\nI casually ask him if there is any bonus in it for us if we make the lesson something the street will remember. Hesitantly he accepts if it's a decent lesson. I say, \"Null Sheen.\" He offers a further advance if we do our jobs faster than fastjack. Worried that we might not find him straight away I say, \"Cool cool cool, see you in a few days.\" And saunter out smooth as.\n\nI suggest to my new found compatriots that we walk on down the street to my good friend Sugarman local Drug Baron to see if he can tell us anything about the wheel and dealer. I quickly find that our friendly locksmith doesn't approve of my association.\n\nAnyway we walk in and there is Sugar Man and a few chilled out Trolls hangin' about. Deepweed thick in the air as they eat cereal and watch the same drekin' toons on the trid that my kid watches. I get into chatting about if he knows about the dude he says he really doesn't know too much as it's not his turf, but the guy must have only set up shop recently. Apparently the Baron on that turf is a bit of an arsehole but not enough of one that it's worth scrappin' over turf. Thank him and say I'll see him at the end of the month to top up on my stash.\n\nI ask our decker if he can get some access to the local street camera on the street to see if our friendly dealer is there. Nothing in sight, but with a bit of work he rewinds the cameras and the van is definitely on the street just in a blind spot in the corner.\n\nWe talk about how we are going to teach this guy and we settle on meeting him back at his apartment and getting him to \"OD\" on his own stuff. We ask our decker to try and lock onto the Vans GPS and go through it's history. Sure enough three main stops, the street corner in particular, Bargain Basement and a house a few blocks away from where we are. We ask him to set up his drone and alert us to when the dealer comes home.\n\nNot half way home our Decker says in the time that he logged out and back in after several minutes to remove any overwatch the Van was already in the Dealers driveway. So we went on straight there. The plan was I was to act as a 'interested client' who was upset that he hadn't wasn't there and I needed my fix. Meanwhile Locksmith and Gecko go around back and sneak in. Gecko then helps me encourage the dealer to sample some of his product until he overdoses.\n\nWe get there I introduce myself no hitch. Find out the drug he's selling is some good old fashion Soothe. Try to convince him to sample some of his product to prove it's not rat poison and promise to pay for what he samples. He hears something out back and I convince him he must just be really really wound up tight.\nStarts sampling his product as he does so invisible mage successfully forces him to keep going til he passes out. My glasses are recording the entire thing as it happens. I then find a funnel and use some water and the funnel to force more of the drug down his throat. We then search the place for his drugs and fill his van with it then go on driving to the Johnson.\n\nPark around back because you know what people like, not having a van full of drugs parked out front. It's basically a big sign saying \"Dead Trog Storage\". We are let in easy peasy. See the Johnson applying aggressive negotiations on a poor drek with a plank and nail. Keep composed and let his stooge know we're here.\n\nBreaks from the beating and our Locksmith identifies the guy as part of the O'Malley Syndicate. I explain the guy learned his lesson and show his death via AR projection for him to appreciate. He sends Mr. Tough Guy out back to check the goods. We discuss business and he grudgingly accepts we did a good job and in great speed. Bumps our pay up to 13,500 Nuyen and we can keep the van. I also shared with him some Kamikaze we found in the dealers private stash.\n\nOrk comes back in and orders one of the staff to go out back to fetch the money. And gets two more guys to go empty the van. We collect our fee and stroll out.\n\nI pass the feed from my glasses on to our Lady Locksmith to pass on to a friend in the O'Malleys. We get our Decker and Mage to fix up the van and pay our fixer a sweet 1k Nuyen. Everyone comes out tops.\n\nNaturally we didn't earn a contact as the Johnson was found having fallen down multiple flights of stairs despite living in a two storey apartment.\n\nGM was moderately upset with how smooth everything went. Called us greasey runners afterwards.",
        "created_utc": 1402096159,
        "upvote_ratio": ""
    },
    {
        "title": "[Pathfinder] How I got some of my perks...",
        "author": "mehog124",
        "url": "http://www.reddit.com/r/gametales/comments/27gk20/pathfinder_how_i_got_some_of_my_perks/",
        "text": "So our DM was trying his first campaign with us first time players.  He wanted it to be fun so when we were creating our characters, we got to choose nerfs and perks that were meant to be silly fun.  I was playing a whip-wielding Half-Elf Bard named Thornair; my nerfs/perks were a paralyzing fear of snakes and a gambling addiction.  But these are not the perks I want to tell you about...\n\nOne of our first missions was to find an Orc Chiefs daughter.  She had been kidnapped to seed discourse through the tribe.  Our group consisted of myself, a Half-Orc Barbarian, a Gnome Druid, and a Human Rogue.  We managed to find her and her assailant in a cabin far in the woods.  The Barbarian and I head inside to find the daughter, while the other two went about looking for clues to the assailants whereabouts and allegiances.  Now, our Half-Orc was dying to make love for...reasons, and as soon as he saw her, he started making diplomacy rolls to seduce her.  It took a lot of convincing, mead and a Nat. 20, but he succeeded and 18/20 sweet, sweet love to her.  Problem is, the DM forgot I was in the really small cabin.  Once they finish, I bring this fact, and everyone starts laughing.  DM asks for my character sheet and gives me the perk, \"The Things I've Seen...\" - I faint at the mention of \"Orc Sex.\"  The Half-Orc, of course, who always mention it.\n\nThe other perk I got was revenge on the Druid.  So first some more background; as I had mentioned, I had a huge fear of snakes.  In our first night at a home we earned, our Gnome was super paranoid and started casting random spells to protect his room.  One of them made some of his plants into snakes to protect himself.  Our Half-Orc, the Prankmaster general, tried to sneak into the room, but lacked all the skills needed.  As a Bard, I had all those skills and promised to help him for some gold pieces.  He hands them over, I get to work on lockpicking his door.  I totally succeed and am greeted by two plant snakes that move in to attack me.  I am paralyzed as the Barbarian laughs.  I now hated the Druid.\n\nSo my main weapon is a whip, and much further into our story, our Druid screwed over a mission which involved us trying to sail across a small expanse of the ocean.  The Druid insisted on becoming a water elemental, which he rolled low on becoming, which attracted angry merfolk and violent water elementals.  We had to abandon ship and try again later.  Once back on dry land, I take out my whip to smack the Druid for being an idiot.  I roll against AC and succeed.  He says in a mocking tone, \"Oh, may I have another, sir?\"  Without hesitation, I roll again and hit a Nat. 20, knocking him unconscious.  Laughter and approval from the rest of the group earns me another perk.  \"May I Have Another\" - On succeeding on landing an attack with a whip, I may roll again until I have failed to beat the AC.  Many fights were won with that perk.  All thanks to our incompetent Druid.\n\nAnd that is how I earned my silly perks.",
        "created_utc": 1402050496,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] The Saga of Kjellmir Bloodskull And The Paladin",
        "author": "[deleted]",
        "url": "http://i.imgur.com/UmdDBu3.png?1",
        "text": "",
        "created_utc": 1402022961,
        "upvote_ratio": ""
    },
    {
        "title": "[Pathfinder] Businesshobos",
        "author": "sorryjzargo",
        "url": "http://sorryjzargo.com/2014/06/05/3030-day-4-businesshobos/",
        "text": "",
        "created_utc": 1401944062,
        "upvote_ratio": ""
    },
    {
        "title": "[DayZ SA] \"You're not Bill..\"",
        "author": "Mr_E",
        "url": "http://www.reddit.com/r/gametales/comments/27c2fo/dayz_sa_youre_not_bill/",
        "text": "DayZ changes you. It makes you think about other people more than you would generally think about them because in DayZ, there are no ramifications. If I were to steal a can of beans from you, you wouldn't experience fear or anxiety, you'd call the police, or realistically, you'd shout after me some obscenities and then realize that a can of beans is 64 cents at the local food library and you'd go on with your day. I might become an anecdote you tell at dinner parties; \"Remember that asshole who took those beans? Oh ho ho, what an asshole.\"\nIn DayZ, beans mean the difference between life and death. Those beans mean another day of existence. They mean it might take another bullet to kill me when I'm fleeing for my life. They could mean keeping a friend from dying, or bartering for ammo. And beans are worth killing for when you're desperate enough. You might balk at this last bit, but I would murder you in a new york minute if it meant my survival in DayZ. I didn't always feel that way, to be honest, but now I do.\n\nI started playing the game alone because the friends I knew who played kept different hours, and the very first time I played in the original beta, I ran for 45 minutes, found them, and was promptly shot in the gut and told \"Welcome to DayZ.\" A lesson I, and you, if you play, should take to heart. Nobody in DayZ is your friend unless they're on TeamSpeak with you. Trust nobody.\n\nFor the first three days of the stand alone, I would play after work for an hour or so. I managed to locate some houses, found some gear, managed to get a gun and learn the ropes. I met my first survivor on the fourth day. I hid in a room when I saw him enter town, and watched him from a window as he picked through the buildings around me. He came into my building and I hid in a corner, hoping he wouldn't come upstairs. He did. He opened the door to the room and spotted me, and shouted \"Don't shoot! Friendly! Friendly!\"  I replied \"Friendly!\" and mimicked his dance, which included putting your hands up and leaning side to side. He stopped. I stopped. I opened my Mic and asked \"What's your name?\" And managed to get out \"What\" before he shot me in the face seven times with a .45 that I hadn't previously seen in his hands.\n\n\nOn another occasion I spent three hours lost in the woods, joking with this married couple and having a good time. On our way back to town, we happened across a military camp where I pulled out some fatigues and a .45 pistol and a holographic site. Not knowing the value of these things, I showed them off to the people I had been hanging out with. The husband shouted, \"Hey, don't point a gun at us!\" in a somewhat joking manner, and we had a chuckle, until he said more seriously, \"Don't point a gun at me, man!\"\n\n\"It's not loaded!\" I replied, and pulled the trigger a few times to demonstrate. \n\n\"WHAT THE FUCK DID YOU JUST TRY TO KILL ME?!\" He shouted, turning violent all of a sudden. His wife had asked him twice to \"Calm down\" and pleaded with him halfheartedly to chill out. He himself was laughing in between his feigned shouts of outrage, and for a few minutes I didn't really know if he was joking or putting on a show. I didn't speak, not because I was scared, but because I was unarmed. This whole charade quickly turned into him pulling out a machete and telling me to give over the gun. He cut me with the machete and I quickly realized he wasn't joking around anymore. His wife was giggling and saying \"Oh, just do it fast, I'm tired.\" as though we hadn't all just been having a good afternoon. He got a few good hits in as I ran off, right into a zombie that managed to break my leg. As I crawled away, they ran up on me giggling and watched the zombie beat me unconscious. I died shortly after.\n\nThis was how life continued in DayZ. I'd meet people, they would kill me. I got more selective about who I partied with, but often times I'd spend a few hours with them, find something 'rare' and then I'd be murdered unceremoniously. \n\nI became rather cold about how I played. I'd start to watch people. Follow them. Learned where people went, found gear spots by shadowing folks, and picking up their cast-offs or their leave-behinds. I stopped talking to people entirely. If spotted, I'd run. People even chased me claiming they were unarmed or friendly, but it didn't matter. Most of them would give up running, others would suddenly produce guns and shoot, some would just shout after me and think I was foreign. I got killed a few times, but I did my best not to kill people. On one occasion someone pointed a rifle at me from up the street and missed. I returned fire and hit him, and when he laid out on the ground I ran away. That was as close as I got to killing someone until finally I asked myself, \"Why?\"\n\nThe next night, I perched in a building and waited for people to enter the shitty town where I spent most of my time. People often went north to head to the air field, using the town as a meeting point. When they came back, sometimes in pairs and often not as a group, I'd hold them up for gear or just shoot at them from where I hid. The first person I killed was a woman (who's avatar was a big black man) and she called me a 'kike faggot' for my trouble. I shot her in the leg and she passed out. Woke up while I was rifling through her gear, and began to swear. I bludgeoned her to death with a crowbar.\n\nI gradually became more comfortable with killing people. I'd often wait for a group, pick one that had gear I liked, and gun them down from afar. The group would always scatter, occasionally waiting around and then trying to loot the body at which point I'd open fire again like I was playing \"Full Metal Jacket\" the video game. I quickly learned that this was the way to acquire gear and I had simply been doing it wrong the entire time. Granted, on occasion I'd still get murdered by someone I never saw, or I'd get out-gunned after my hiding spot was found, but I did transition into a predator instead of prey.\n\n\n**The real meat of the story however** and the reason I came to this subreddit is to tell you about the night I went down the rabbit hole and crossed the line from predator to campfire story.\n\n\nI had witnessed a group headed into my town. They milled about for a while and met up with a second group. I listened to them while I hid in a shed near the road where they were meeting. They had decided to split into two groups. One headed to the air field, one who was going to find a train station that they heard about. As I watched them go, I noticed that I resembled one of the members. We had the same backpack and the same jacket. They had all been wearing clown masks in an effort to identify each other easily. I happened to have one, put it on, and when I saw my now 'clone' run off to the airfield, I followed the other group. I learned my name was now \"Bill.\"\n\nBill was very quiet to begin with and so nobody had any kind of issue with me not saying anything over the mic. Most of their conversations were about school and other things and it became apparent these people all knew one another. They talked about ex boyfriends and how so-and-so wanted to sleep with this guy or she didn't like whatsherface. I listened to them all and lived a quiet thrill that they had no idea I was with them, or who I was, or that I didn't belong.\n\n\nAt some point, night fell and we found the train station. The group gathered in the one main building in a circle and began to eat (in game and in real life) and chat some more about their summers and what they planned on doing. I decided now was a good time to move things along and I pulled out a fireman's axe. Nobody said anything. I began to walk slowly into the room and swung the axe wildly in all directions. Everyone got a bit of a chuckle from this, and \"Bill\" was told to knock it off. I did. Sat down. Waited.\n\n\nEventually the group left the building and started following the train tracks to where they preferred to log out in an abandoned apartment building. It was during this hike that someone said, \"Shut up Bill that's not funny.\"\n\n\nMy heart stopped.\n\n\n\"What?\" asked one of the guys.\n\n\n\"Well,\" began 'sally' or whatever, \"Bill just texted me and said their group is back at the apartment building and they're waiting for us.\"\n\n\n\"Very funny.\" Came the response. \"Stop fucking with us, Bill.\"\n\n\nI killed him. He stopped walking and I quickly dispatched him with an axe to the back of the head. I walked forward and just as one of the others turned around, I killed her too, in a similar manner.\n\n\"Knock it off, Bill, that's not funny! What the fuck?\"\n\nI stop, pull the SKS from one of the bodies, load it, and I point it to the girl who got the text message and I shoot her, point blank, in her face. I put my cursor over the head of the last guy, who told me to knock it off and I pause. My adrenaline is a waterfall in my veins. My heart is pounding. The world has narrowed into a small hallway where there is only my open rifle sights and this guys face.\n\n\"You're not Bill..\" he says, quietly, putting it all together. \n\n\"You got me.\" I respond, my voice gruff, somewhat phlegmy, having not spoken in over three hours. Perfect.\n\nHe takes a second or two and then fear or realization finally set in and he takes off running. At first he's down the tracks and I fire after him missing once or twice. Then he bolts for the tree line and I follow with my gun until he hits the embankment and he slows to a crawl, turning left and right to find a less-steep part of the embankment. I see his avatar's head look in my direction just as I'm lining up the shot and this time it scores home and he goes prone. A second or two later, I see the message that he's died pop up on the bottom of my screen. My in-game name is Mr. E. When I went to log out, it was only myself and the 8 people on the server. The last chat message I saw happened to be the cherry on top of the entire charade. \n\n\"Who is Mr. E?\"",
        "created_utc": 1401923680,
        "upvote_ratio": ""
    },
    {
        "title": "Stolen from /r/4chan",
        "author": "[deleted]",
        "url": "http://i.imgur.com/MdWt9lz.png",
        "text": "",
        "created_utc": 1401876796,
        "upvote_ratio": ""
    },
    {
        "title": "Canyon Slaughter [Men Of War:AS 2] XPOST from r/storiesofwar",
        "author": "brrtmew",
        "url": "http://www.reddit.com/r/gametales/comments/2786fa/canyon_slaughter_men_of_waras_2_xpost_from/",
        "text": "In 1944 my American recon patrol ran into a Wehrmacht unit setting up defenses in a canyon pass. The Germans had already entrenched with sandbags and an MG42. I ordered a half track in to suppress and had what was left of the recon squad push forward to throw grenades.\n\nUnfortunately for my men, as we reached the enemy position Fritz pulled out a light tank with 20mm. The rounds cut through the engine block on the half track killing the crew instantly but somehow the .50 gun position survived.\n\nI had put myself into a very bad position by calling in a light M8 howitzer instead of waiting for allied tanks to get to my position. My recon squad was hugging the dirt but were being chewed up. I could not depress the M8 low enough to even try and damage the enemy. A squad of volkstrom with the 20mm in support pushed into the canyon gap and began to over run my position.\n\nFrustrated and desperate, I fired a howitzer round into the Canyon wall above the advancing enemy.\nAVALANCHE!\nCollapsing chunks of rock beat the top armor into the ammo popping the tank like a roman candle, flaming turret arching 20 ft in the air. The weak German infantry close by were crushed and burned.\n\nSomehow one of my recon platoon close to the canyon wall had managed to survive the enemy and my howitzer avalanche. He selflessly ran forward and mounted the .50 on the damaged half track. Just as my reinforcement squad came to the canyon entrance the brave man mounting the half track opened up on the left overs. We sandwiched the poor bastards and ripped them to pieces. The .50 then helped push into the enemy side of the pass until a short time later a sniper round punched through his chest.\n",
        "created_utc": 1401823606,
        "upvote_ratio": ""
    },
    {
        "title": "My first fight against FTL's final boss. The tale of the Flying Wreck. [crosspost /r/ftlgame]",
        "author": "Wiwiweb",
        "url": "http://imgur.com/a/UbU1W",
        "text": "",
        "created_utc": 1401795221,
        "upvote_ratio": ""
    },
    {
        "title": "MARIO'S A VILLAIN?! - Donkey Kong Jr. | Game Theory",
        "author": "johnnyzfox",
        "url": "http://www.youtube.com/attribution_link?a=EBZfN64o2oI&amp;u=%2Fwatch%3Fv%3DyidIg28qfh8%26feature%3Dshare",
        "text": "",
        "created_utc": 1401771652,
        "upvote_ratio": ""
    },
    {
        "title": "[D&amp;D 3.5] The Brief Saga of Johnny Whisper &amp; Mayor McCheese",
        "author": "[deleted]",
        "url": "http://imgur.com/a/2RKO3",
        "text": "",
        "created_utc": 1401771236,
        "upvote_ratio": ""
    },
    {
        "title": "[Star Wars RPG] Rebel spies play a game of reverse Time Crisis with a Dark Jedi's honor guard",
        "author": "ComputerSherpa",
        "url": "http://www.reddit.com/r/gametales/comments/275qfn/star_wars_rpg_rebel_spies_play_a_game_of_reverse/",
        "text": "At a convention in Arizona five years ago, I had a chance to play a Star Wars RPG I'd never tried before. A few other players and I played the part of Rebels infiltrating an Imperial outpost on a sabotage mission. We snuck aboard in a stolen shuttle and silenced the guards in the hangar with no-one the wiser, and proceeded to spend a couple of merry hours sneaking about the place creating surprises that would cause consternation upon their discovery.\n\nThe outpost was equipped with a large antispace turbolaser cannon designed to protect it from orbiting starships. As our scheduled game reached its halfway point, we accessed the control room for the turbolaser, quietly put down the guards, and then sabotaged the safeguards governing its movement until we could make the cannon point all the way down into the base it was supposed to protect. We aimed it at the outpost's central command hub and fired.\n\nThat set off the alarms pretty well. Our mission complete, we decided to make good our exit and beat feet for the hangar containing our shuttle. But as it turned out, someone had noticed our work and was waiting for us. We entered the hangar to find a Dark Jedi, lightsaber drawn, and his personal guard of a half-dozen stormtroopers. He made it quite clear that we had well and truly kicked the hornet's nest, and the Empire's retribution was at hand.\n\nThe stormtroopers started blasting away, led by one lucky soul manning a heavy repeating blaster. We dove for cover and began enthusiastically returning fire. That repeater was our biggest problem; it was a big stationary gun that put out a truly awesome amount of firepower every round. Its only settings were \"off\" and \"puree\", and anyone who found themselves under its sights was in for a world of hurt. Funny thing, though--for all its amazing firepower, it didn't provide the user much cover. *Our* cover was pretty good, and we were able to spread out, and every one of us Rebels was a dab hand with a blaster. So the moment the repeater focused on suppressing one of us, another one would pop out from behind cover, nail the gunner with a headshot, and then hide before the next stormtrooper into the gunner's seat was able to exact revenge.\n\nAfter the third time in a row this happened, the Dark Jedi in charge decided that his minions had failed him once again, and that if you wanted something done right, you had to do it yourself. He charges across the hangar floor and dives into us to open a can of galactic whoopass.\n\nAt this point we are getting thrashed. I'm playing a Scout or something with no Force sensitivity and no training in hand-to-hand combat; I have zero interest in getting into a melee with a Dark Jedi. So I scurry across the hangar floor as fast as my feet will take me, and the Jedi starts chewing up the rest of the party. But by now, half of the Jedi's honor guard is dead and the other half is completely uninterested in manning the repeater, having seen what happened to the last three guys who tried that. So I hop into the gunner's chair, spin up the heavy repeating blaster, and go to town on the Dark Jedi.\n\nThat was the end of the encounter. Turns out those scary red lightsabers are no good at all at deflecting the amazing firestorm of blasterfire that a heavy repeater can produce. That's how we bloodied the Empire's nose and escaped into hyperspace, our only regret being that we couldn't take that amazing gun with us.",
        "created_utc": 1401754689,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] Shoggy the Seldom Dog",
        "author": "Failer10",
        "url": "http://i.imgur.com/ipSj2CD.jpg",
        "text": "",
        "created_utc": 1401732002,
        "upvote_ratio": ""
    },
    {
        "title": "[Big Eyes Small Mouth] You Don't Meet In An Inn",
        "author": "youdontmeetinaninn",
        "url": "http://www.reddit.com/r/gametales/comments/272rzk/big_eyes_small_mouth_you_dont_meet_in_an_inn/",
        "text": "Hello, my group and I are producing a podcast titled You Don't Meet In An Inn where we play lesser known tabletop RPGs. The first series we've done is Big Eyes, Small Mouth third edition where everyone plays a character from pop culture (the party is Lumpy Space Princess, Aya, Mrs. Doubtfire, and Snake Pliskin). \n\nThe introductory episode is an overview of the system and my partner's and mine thoughts on the game. The actual play episodes start with BESM Playthrough Part 1. The BESM series is 4 episodes long including the introduction (though we're in the midst of uploading the last episode). We'll be doing more series in the future including Apocalypse World, Everyone Is John, and Fate.\n\nhttps://itunes.apple.com/us/podcast/you-dont-meet-in-an-inn/id882993415\n\nYou can find our twitter at https://twitter.com/Notaninn.\n\nEDIT: Since everyone is hating on itunes I will gladly share our [alternative link] (http://youdontmeetinaninn.libsyn.com/) but I also want to explain why itunes. I too am not a big fan of the program (used to use winamp, may the internet bless it and watch over it) but it's also a huge distribution network. The more downloads and positive ratings we get on itunes the more it will be advertised on there and the higher it will be on search results in the genre. So I totally understand the desire to avoid the program but if it is a possibility I would ask if you could please download from there.",
        "created_utc": 1401674729,
        "upvote_ratio": ""
    },
    {
        "title": "[Minecraft] The villager that destroyed my server.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/gametales/comments/26zpfv/minecraft_the_villager_that_destroyed_my_server/",
        "text": "This is not a piece of fanfiction, this is a true story.\n\n\nBack in 2012, I owned a Minecraft Factions server. It was a server of about 30-40 people (Can't remember the exact amount but I know it was in that area) that was split into three factions, the City faction (I owned this faction, we were stationed in the capitol in the desert), the Miner faction (They were also stationed in the desert, they had this underground city where they lived and mined in) and the Townie faction (These guys were stationed in a forest, they also owned a farm where we and the Miners got about 98% of our food because animals are very, very rare in the desert).\n\n\nOne day I log on the server, its pretty much World War 3, the Miners and Townies are fighting, they've already destroyed 1/2 the freaking server in less then 2 hours. I slap on the old Sherlock Holmes hat and investigate, I find out that the reason that they are fighting is that the Townie's crops have been allegedly stolen because they are all missing, the Miners are the prime suspect because of the lack of food underground. So I think \"Aha! The changelog!\" so I check the changelog to find this...\n\n\nA freaking villager got out of a NPC village, went inside the farm and started jumping all over the crops, the server reset ten minutes after so all the wheat, potatoes and carrots were lost.\n\n\nA freaking villager destroyed half of my server.\n\n\nA freaking villager destroyed our food supply.\n\n\nA freaking villager somehow got out of his village.\n\n\nTo this day the Miners and Townies are still fighting over whodunnit. ",
        "created_utc": 1401578476,
        "upvote_ratio": ""
    },
    {
        "title": "Gamma World Amusement Park - Cockroach Bruce Willis",
        "author": "RossTheRed",
        "url": "http://imgur.com/trNjFFA",
        "text": "",
        "created_utc": 1401489447,
        "upvote_ratio": ""
    },
    {
        "title": "[Warframe] But I have a Cutlass.",
        "author": "ShaxAjax",
        "url": "http://www.reddit.com/r/gametales/comments/26w008/warframe_but_i_have_a_cutlass/",
        "text": "Warframe is a popular grindy style shmup. You get a new character who does new cool things and kills hordes of enemies for more stuff to make new characters with new cool weapons.\n\nAnyway, very recently a weapon called Nami Solo came out, a reference to the fact that it's only one of the swords from the pair \"Nami &amp; Skyla\". It's a pretty sweet looking cutlass, and as a cutlass it is a Machete-class weapon. Machetes are generally not looked on well. They only have one weapon stance that can buff them, as opposed to every other melee weapon's two, and they are to a one slash focused weapons, no other type. Slash is arguably the worst damage type in the game, since it is primarily effective against the least powerful faction.\n\nThat least powerful faction? The Infested. Space Zombies that can punch through your shields like paper. They're really no slouches. Anyway, I pick up the shiny new ~~machete~~ cutlass and set to grinding to improve it. I quickly notice something. The one, only machete stance, \"Sundering Weave\" is basically a harvester on steroids. It's a slow, gently walking forward stance with wide, rending strikes. Infested come at you as a horde since they're melee only. They're weak to slash. This weapon is god mode against Infested.\n\nI start practicing. There's a new special combo for machetes called Flash Flood. This combo consists of two basic crowd clearing swipes, followed by a quick diagonal combo which is essentially \"screw this guy in particular\" followed by a decent sized slashing dash that immediately links into a ground pound that knocks down enemies. It's slow but DAMN effective.\n\nThere's an Infested Boss called Phorid. He's pretty infamous for being able to wreck your shit no matter what you are, because he's Phorid and rules don't apply to him. He's not SUPER dangerous, but generally speaking you're advised to keep out of melee range, and just shoot him down.\n\nNot. Today.\n\nI have a Cutlass.\n\nIt is decked out for channeling.\n\nChanneling burns essentially your mana to buff your melee attacks. Mana does not naturally regen, instead gained from drops, so you don't take spending it very lightly.\n\n I run ahead slashing through enemies using the slide attack \"Flowing River\". As the name implies, you go right through people slashing 'em up on the way. It is a fantastic way to get around. So needless to say I end up WAY ahead of my team. And there's Phorid. Just me, an underleveled warframe, and a Cutlass, and Phorid.\n\nFlowing River right into him. Immediately start channeling, perform the flash flood combo. Proceed to chew through his health like a fat kid with a corn on the cob.\n\nBut it's still Phorid. I go down. Going down in Warframe is like going down in Gears of War or similar, you have 20 seconds until you bleed out to either be revived or take petty vengeance on your foe. I have a shitty pistol equipped as my sidearm, the one you start the game with, that's how bad it is. How much damage did I do to Phorid, exactly?\n\nThat shitty pistol was enough to finish him.",
        "created_utc": 1401469679,
        "upvote_ratio": ""
    },
    {
        "title": "[Skyrim] The Adventure of the Stolen Skooma - Case Closed",
        "author": "ewpierce",
        "url": "http://ewpierce.com/2014/05/adventure-stolen-skooma-case-closed/",
        "text": "",
        "created_utc": 1401446742,
        "upvote_ratio": ""
    },
    {
        "title": "The Legend of Edgardo",
        "author": "ArchetypeBlue",
        "url": "http://i.imgur.com/dAVQVLL.png",
        "text": "",
        "created_utc": 1401442720,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] Chapter 24: The Aftermath of an Evil Temple",
        "author": "Malphia",
        "url": "http://adventuresofthealmostheroes.blogspot.com/2013/11/day-68-needed-relief.html",
        "text": "",
        "created_utc": 1401425860,
        "upvote_ratio": ""
    },
    {
        "title": "The Toxic Child (in which the face earns his only kill in the entire campaign to date) [shadowrun 4E]",
        "author": "Gygaxfan",
        "url": "http://www.reddit.com/r/gametales/comments/26o9qw/the_toxic_child_in_which_the_face_earns_his_only/",
        "text": "The Team:\n\n- Grins, Elven Face, can talk his way into and out of any situation\n\n- Quasi, Troll Street Samurai with a code of honor and a glorious neckbeard, can hurl a D20 through your skull\n\n- Breaker, heavily augmented Human Decker/Rigger. She also has a neckbeard\n\n- Stelio, Elven Shaman and Breakers fraternal twin, i don't know how\n\nThe team was settling down for a satisfying meal at an \"all you can eat\" buffet that allowed trolls when Grins commlink went off and Mr. Fixit popped up on his screen, talking before Grins could even begin to smile \n\n\"Oy chummers got a job for you needs to be done asafp. got another team on a run but they got pinned down and need an assist, pays 5k each for a successful rescue plus a percentage of their run payout. You in or out?\"\n\nThe group looked at each-other for a moment and Quasi despondently set his plate back down \"if this takes too long i'm charging for missed meals.\" The team piled into Grins Eurocar Westwind (he's the only person in the group with a car, and Quasi took up the entire back seat) and hauled hoop towards the coordinates Mr. Fixit had sent them. \n\nWhen they screeched to a halt in front of the building they had been told about in the trashy (even for the barrens) neighborhood they didn't hear the expected sounds of gunfire and screaming, in fact the block was ghostly quiet with the only sounds coming from the Eurocars engine and that of a dumptruck pulling up onto the freeway.\n\nThe team quickly piled out of the car and hustled into the building, barely pausing to check out the torn-to-drek ares citymaster out front. The building was empty, completely clean of any signs of metahuman presence. After a thorough search the team walked back out of the building, \"where the frag could they have gone?\" asked Quasi. and had Grins call Mr. Fixit to double check the address while Breaker looked over the citymaster. After a few minutes the team had learned only two things: they were in the right place and Breaker could fix the Citymaster if the team was willing to get it towed back to the house.\n\nAfter the tow-truck showed up and departed they got ready to leave when suddenly an aparition popped into existence and began swearing at everybody, \"you useless fragging bastards! why did it take you so long to get here? now because of you i'm fragging dead!\"\n\nThe ghost swore at them for a bit longer until Grins calmed it down and got the downlow on what had happened. a bit of back-and-forth later the group had agreed to finish the guys run (recovering a kidnapped woman) and had some leads to chase down by way of finding the dead deckers commlink.\n\nAfter a trip home to gear up and do some research (Breaker did all the research since everybody else was comparatively useless on the matrix) they headed out once again in the Westwind (fortunately soon they would have another automotive option because this was not the most comfortable way to travel) towards the offices of Discrete Removals (body reclamation).\n\nUpon arrival at the office they dealt with a polite receptionist, a creepy-like-he-owns-a-coat-make-of-human-skin maintenance man, and a freakishly pale man dressed in the height of 1840s fashion. They talked to Mr. Pale, who was the owner of the company, and he directed them to the ~~obvious deathtrap~~ basement where the most recent bodies would be stored.\n\nso the team went to the basement, killed some ghouls, got the commlink they were looking for, and making extra sure not to ask any questions left as quickly as was polite.\n\nnow that they had the commlink finding where the previous team had discovered the kidnapped woman was being held was childs play and they rolled out towards creepy abandoned hospital #2. Deciding that due to the fate of the last team stealth would be better than a brazen assault, they crept as stealthily as possible around through a side door and began searching the hospital remembering at all times the number one rule when in a creepy place like this: never go anywhere alone.\n\nafter a few minutes of searching Quasi, who was in the lead, saw a little girl standing in the middle of the hallway crying \"I can't find my mommy, will you help me?\" to which Quasi responded not with the logical killing of the obviously demonic evil child of satan, but rather by sheathing one of his throwing axes and picking her up with one arm so she could rest her head on his shoulder and a gentle reassurance that everything would be ok and he'd help her find her mom. (yay for fragging code of honor, stupid irrational need to protect children and other civilians)\n\nSo with ~~Demon~~ the child in tow the team progressed farther into the hospital until they came to a large room full of hospital beds with unconscious women on them, one of whom was the woman the team was getting paid to recover.\n\nbefore the team could finish unhooking her from the IV tubes a tiny shadow leapt out from cover and swung a powerful punch at Quasi, who turned his body to protect the little girl and got a pretty nasty bruise on his shoulder for the effort, to battle!\n\nQuasi rapidly drew and hurled weighted throwing axes at the miniscule form, which turned out to be an eight-year-old boy, and buried their blades deep in the childs flesh with no apparent effect.\n\nEverything after that happened with frightful speed, Quasi had his mind filled with thoughts of his dear friends gleefully slaughtering innocent children and laughing at him, Breaker popped a stim-patch on the principle, Quasi decided he would have to kill his friends before they became too corrupted, the principle woke up with a gasp and croaked \"geek the little girl\", Grins stepped forward and jammed the barrel of his gun against the little girls head before spreading her brain matter over a ten meter cone, Stelio hurled a bolt of energy at the little boy that microwaved his little head, Grins turned to the principle and asked \"wait why?\"\n\nso the battle was over, the two demonic children (a toxic shaman and toxic adept that were addicted to eating magically active peoples essence) had been slain, Quasi had gotten over his brief mental breakdown at seeing dead children, the group saved a bunch of kidnapped women (and got paid a tasty sum of nuyen), and Grins was known evermore as \"Grins, mighty slayer of seven-year-old girls\"\n\nTL;DR: kill children get money, also a new car.",
        "created_utc": 1401255574,
        "upvote_ratio": ""
    },
    {
        "title": "[Dragon's Lair] Slightly different to the usual stories here - a programmer recounts his childhood spent playing the laserdisc-based arcade game Dragon's Lair",
        "author": "HistorsEye",
        "url": "http://www.reddit.com/r/gametales/comments/26lllz/dragons_lair_slightly_different_to_the_usual/",
        "text": "The original blog post is here:\n\nhttp://stevenf.com/2014/05/21/arcade-story/\n\nThe story was linked from Metafilter, which contains one or two other reminiscences if anyone is interested:\n\nhttp://www.metafilter.com/139286/No-quarters-given\n",
        "created_utc": 1401193162,
        "upvote_ratio": ""
    },
    {
        "title": "[Pathfinder] A Sojourn of Misfits - The Clockwork Golem",
        "author": "wylfenrix",
        "url": "http://www.reddit.com/r/gametales/comments/26l8nl/pathfinder_a_sojourn_of_misfits_the_clockwork/",
        "text": "Although my PF group is on an indefinite hiatus right now, I stumbled upon this subreddit and felt the need to share one of my favorite stories from our travels together. We had 5 in our group: Kozak, a Jedi-like human biped (?); Grawnzyl, a frog-like creature with a giant pet scorpion; Phil, a rifle-wielding half-orc from an alternate and very British future; Kelcifex, a son of a bitch if I ever met one; and I, Chaneu, a dollish half-construct with a case of amnesia. Let's begin (and sorry for the length said no self-respecting RPGer ever)!\n\n---\n\nWe quietly moved down the darkened hallway. Kozak, using his enhanced vision, led the group deeper into the gloom. His feet barely seemed to touch the stone tiles as he crept silently, while my slippered feet softly *pitter-patter*ed, Grawnzyl's webbed toes *flip-flopp*ed, Phil's business loafer's *clip-clopp*ed, and Kelcifex's heavy boots *CLOMP-CLOMP*ed obliviously onward. Despite Kozak's best attempts at a stealthy approach, we surely announced our arrival to whoever -- whatever? -- waited within. Realizing this, I brought out my ioun torch to light the way for others in the group.\n\nAfter we scoured a few empty rooms (well, one wasn't completely empty -- it had a barrel of yellow powder that Kelcifex practically squealed over as it was a premium soap-making ingredient... who knows), we entered a larger torchlit chamber filled with tables, barrels, and other bar-like paraphernalia. Despite the excited chattering of my comrades, Kozak and I were suspicious... something just felt *off*.\n\n~ Perception checks all around.~ \n\nKozak and I score highest and are immediately alerted to something moving along the wall -- wait, no -- the wall *itself* is moving! I toss my ioun stone towards the anomaly and watch as the light from it casts a long shadow of some kind of camouflaged biped against the wall it's pressed against. Finding itself outnumbered and spotted, the creature jumps from the wall, wailing gibberish and writhing in discomfort. There's a strange brand on its chest and Kozak recognizes that it's a cultist of some Hellish deity; in particular, the one we've been fighting against for some time now. The cultist begins to hiss and gesture profanely towards us.\n\nWe all look to one another and laugh. Grawnzyl's horse-sized scorpion eagerly snaps its pincers and makes chittering noises. Phil quips, \"You asked for it, old chap!\" and it's time to roll initiative.\n\nTo fast-forward a bit, it turns out that Grawnzyl and his scorpion friend have been hunting these particular cultists for some time. After taking the lead and making easy work of this regretful individual, Grawnzyl removes the branded skin with a knife and stuffs it into his pack while the giant scorpion is still picking bones out of its mandibles.\n\nJust as we're about to relax and see if these ale barrels hold anything in store for us, Kozak and I's creepy-crawly senses are all a-tingle once more. Another Perception check ensues and it looks like all the commotion drew in even more suicidal cultists. A lot more. And, unfortunately, our initiative rolls fall really, really flat.\n\nWe fought through wave after wave of screaming cultist meat bags (much to the enjoyment of our behemoth scorpion who hadn't eaten in some time), until we were down to the last half-dozen or so. If we didn't know our newly-leveled-up attack and damage rolls before, we certainly did now. The majority of us weren't in great shape by this point -- robes were torn, armor dented and blood-smeared, toes had gotten stomped on... and that's when we heard it. \n\n**CLUMP** --*swoooh*-- **CLUMP** --*swoooh*--! The remaining cultists cocked their heads and, apparently recognizing the sound, began to grow excited. As it drew closer, they jumped in place and clenched their hands together in frenetic glee. With every dull **CLUMP**, the stones vibrated beneath our feet. Dust that had been packed in between the stones in the ceiling was shaken loose and drifted down around us. \n\nOn the opposite end of the room was a large arched doorway, leading into a blackness beyond. As my group and I slowly swiveled our heads to pinpoint where the sound was coming from, a huge silhouette filled the doorway and then entered the room with us. At first, none of us could figure out quite what it was, as it stood motionless while it surveyed the area. When it moved, we had a gut-wrenching realization as to what we were about to face and all of us looked up from the board at our DM, Nizuul.\n\n\"... YOU SET A *CLOCKWORK GOLEM* ON US?!\"; \"How could you!\"; \"YOU MOTHERF--!!\" we cried out, while he laughed mirthfully. Once he recovered, he replied, \"Alright, go ahead and re-roll your initiative and good luck.\"\n\nOnly two of us had a high enough initiative to beat the golem's (myself and another), and we still had the half-dozen crazed cultists to contend with. Needless to say, it wasn't pretty; a few rounds in and it looks like this might be the end of our travels together. Even the giant scorpion's carapace is cracked and seeping some kind of liquid. \n\nI was getting desperate, and my turn was up next. I knew my cross-bow didn't have a chance against this behemoth, so there had to be something else I could do. Did I have any abilities that'd benefit my teammates enough to take it down? I scoured my character sheets to no avail. And then I saw it. No, it couldn't work... could it? Well, there was only one way to find out.\n\n\"It's a clockwork golem right? So that means that someone must've built it, and that means that there's probably a panel on it for the repairs,\" I say aloud, trying to get some buy-in from our DM. He considers this, and nods, not sure yet where I'm going with it. \"Great, with that in mind, I'm sure whoever was so intelligent to build such a device -- it is a device right, a clockwork device?\" I ask innocently. Squinting a little now, our DM replies, \"Yes, I suppose it is... what are you up to, Chaneu?\"\n\nWith that last piece of the puzzle in mind, I take my action. I'm already behind the golem and I make a satisfactory Stealth roll and rush forward until I'm right at his backdoor -- which is also where the panel is located. I declare to everyone, \"I'm rolling to disable this device,\" and I can see Nizuul's face contort into surprise as the d20 falls from my hand, rattles onto the board and comes to a stop on 17. With my 6 mod and my trapfinding (+4), it comes out to a total of 27, which is barely enough to overcome the 25DC of the clockwork golem. \n\nEveryone's silent, most noticeably our hard-working DM who put this entire encounter together (we were about an hour into what's normally a 4 hour game). He begins to thumb through rulebooks to find out what the fuck just happened exactly, but it's clear that even if it's not totally kosher, he's gonna let it go because it is too amazing not to.\n\n\"The clockwork golem freezes --*KSHHZZZ*-- and shuts down. The cultists are also frozen (in horror), snap out of it, and flee, screaming, down the halls and out of sight,\" he narrates. \"And I hate you, Chaneu.\"\n\nWe all erupt into cheers, get some sweet loot + XP, exchange high fives all around, and tell our DM better luck next time.\n\n\n",
        "created_utc": 1401177136,
        "upvote_ratio": ""
    },
    {
        "title": "[EVE Online] An encounter that saved me and showed me something",
        "author": "bellino02",
        "url": "http://www.reddit.com/r/gametales/comments/26kuse/eve_online_an_encounter_that_saved_me_and_showed/",
        "text": "Now, I'm an EVE noob. So I find a miner who needs some defense incase of attacks or ganks. I just got a shiny new Corax with a decent fit, why not? So blah blah blah. We chat, he's nice. We decided to go attack some pirates for loot. \nI warp in first and fire off my missiles.  Unfortunately the pirates have a shit ton more. He doesn't warp in. Then he goes offline. I'm stuck here alone vs fuck know how many pirates. I keep firing. Maybe I can pull it off!\nThen I get up against two turrets. I'm scrambling to get my shields stable and my boosters can't keep them up. Bam. They hit my armor, already down to half armor. I keep firing but I'm almost out of missiles. \nThen another guy warps in. He destroys all the pirates and saves my life. I chat him a thanks, and we talk for a bit. He sees I'm a noob and gives me 10mil ISK, some tips, and all the loot from the pirates. I'm amazed. I had about 700 ISK after my Corax, so that was huge money. He warps out. \nI realized how lucky I was. Plus, I thought that was an interesting side to EVE. You always hear about the scams and wars but never about the guys like him who help the noobs struggling to stay afloat. \n\nJust thought that was a nice story. ",
        "created_utc": 1401163750,
        "upvote_ratio": ""
    },
    {
        "title": "[Pathfinder] Murder? In my town? It is more likely than you think...",
        "author": "Jolom",
        "url": "http://www.reddit.com/r/gametales/comments/26ef0y/pathfinder_murder_in_my_town_it_is_more_likely/",
        "text": "I did a murder mystery once. The party were all people who had stopped in a medium-sized town for the night, and upon waking discovered that one of the big shots in the town, Mr. Boding, had been murdered. Since the party were adventurers, the head guard hired the party to investigate around town.\n\nThe first clue they found was that one of the guards in the town, Sargent Pudding, used to serve with the murdered man in the King's army. When interviewed, Pudding told the story about how the Boding had saved his life and he was indebted to him. However, Boding was just about to open a brothel that would compete with the current brothel in the town, the Slippery Kobold, and would suggest that the party talks to the matron of the facility, Madam Peahen.\n\nPeahen, when interviewed, explained that she in fact was going into business with Boding, and that by working together they were going to turn the Slippery Kobold into a chain. The local priest, Reverend Pear, was rather upset about more sin in his town, so the party should go talk to him.\n\nWhen they party went and talked with him, Pear explained it could not have been him, as his god does not allow for the use of bladed weapons, and he then cast a spell to prove he was in his gods good favor. He then told the party that Rouge, one of the townsfolk from the outskirts of town, was an assassin in her youth, so she might have done it.\n\nWhen the party went to confront Rouge, she ran and managed to scramble up the town wall and into the forest, and so the party went and searched her house for clues. And found her torture basement. Turns out Rouge was also a serial killer!\n\nSo they part went to tell the guards, and discovered upon approaching the guard house a number of hobgoblins had snuck in and was about to attack the city. After defeating the hobgoblins, the party entered the guard house and found a few guards dead, with a message in blood addressed to them. The message said to meet the writer in the woods at midnight, and everything would be revealed. The party told the guard captain everything, and then set off for the meeting.\n\nWhen the party arrived, they discovered that their contact was the bartender, who had figured it out, and who had written the message in blood because he arrived after the Hobgoblins killed the guards, and had no other way to quickly leave a message. The killer wasn't Sargent Pudding, or Madam Peahen, or Reverend Pear, or Rouge. No, it was all 4! It turns out Boding had sacrificed Pudding's brother's unit in a batlle and Pudding had never forgiven the man; Boding had already signed the paperwork so that if something happened to him, all his business property became Peahen's, Pear was actually a bard and his \"holy symbol\" was an amulet of healing, and did hate Boding bringing in more sin, and Rouge was just a serial killer. (The party could have found these things out by asking one of the guards about Boding and Pudding, talking to one of the ladies-of-the-night about Peahen and Boding, and by talking to one of the church-goers about Pear. They discovered Rouge's schtick on their own).\n\nNext came the boss battle, against Pudding, Pear and Peahen. (Rouge had been caught by the guards in the woods.) It worked out great, as the party was 3 people and the boss fight was 3 opponents, all the same level. Pudding was a Fighter, Pear a Bard, and Peahen a Sorc. When all three had been defeated, the guard gave the party some gold, and dropped a plot hook about how the king had recently pulled back all the patrols recently for some reason.\n\nThis was a Pathfinder game, but i think it could work for just about any system.\n\nTL;DR: Murder mystery based off of Clue and Murder on the Orient Express.\n",
        "created_utc": 1400964764,
        "upvote_ratio": ""
    },
    {
        "title": "[Heroes Against Darkness] Bee of the Bird of the Moth -OR- They Might Be Giants: The Session",
        "author": "evilweirdo",
        "url": "http://www.reddit.com/r/gametales/comments/26cjgr/heroes_against_darkness_bee_of_the_bird_of_the/",
        "text": "Before you read this, you should probably give [this song](https://www.youtube.com/watch?v=yiyZmQhuM4w&amp;feature=kp) a listen. It's by They Might Be Giants, so it's a good one anyway.\n\nAnyway, I'm currently running a [Heroes Against Darkness](http://heroesagainstdarkness.blogspot.com/) game. We've had a slow couple of sessions, but we had some good fun today because of one ninja's contrariness.\n\nYou see, in the setting that I'm using, the dwarves are very superstitious folk. After taking care of a local fire elemental/drow problem, the PCs had some down time in the dwarven town of Lake Widdershins, by the lake of the same name. The lake is so named because local superstition holds that one must sail or walk counterclockwise (widdershins) around the lake, and never clockwise.\n\n*So, of course, a bunch of party members walked clockwise around the lake.*\n\nYep, our party's ninja (a rogue/mystic hybrid class in this case, in case you're wondering) gathered some party members and walked counterclockwise around Lake Widdershins. Just to mess with people, of course. A few people, such as our hospiter (at the local Church of the Goddess Wyrun or something), healer (getting rest to recover from the wisdom damage paid to make some scrolls), and canonate (who was just getting reintroduced, as the player had been away at college), stayed behind.\n\nAnyway, deciding that the superstitions had a reason behind them, I threw some signs of trouble in there. When they had gone one-quarter of the way around the lake, it started raining. At one-half, thunder started. At three-quarters, it hailed. You get the idea. Anyway, when they finally arrived back at the town, a giant beast rose out of the lake: the ancient Bee of the Bird of the Moth, a vast moth-bee thing with a bird's beak. Fortunately, some local dwarves arrived and sent it back beneath the waves by playing \"the anthem of the Bee of the Bird of the Moth.\" See the linked song at the top of this post, but instrumental.\n\nAnyway, having caused chaos and riots, the offending walkers were promptly banished from the town. The others remained. The returning canonate's knowledge allowed him to recall that the BBM (Bee of the Bird of the Moth) and its kind were eldritch horrors that had, along with giants and dragons, once terrorized the world before and during the wars that drove the Hordes (orcs, drow) out to the south. Lore had suggested that \"it might be giant,\" and it was. It was originally sealed under the lake by three bards named John, but that wasn't any good now, was it?\n\nAnyway, our resident lizardman hunter snuck back into town and took (he left behind the price and then some in gold, anyway) two waterbreathing potions, then went into the lake to investigate, enchanted with thermal vision by a spell as well. Armed guards had been posted around the lake to prevent any further BBM-summoning, but he got past. Anyway, following the trail of pollenish goop/gel in the water (which killed or strangely affected the behavior of local fish), he found a hole in the bottom of the lake (in the middle of a thermally-glowing [Elder Sign](http://fc01.deviantart.net/fs11/i/2006/193/9/9/Elder_Sign_2_by_Furr.png), of course!) The hole led to a vertical tunnel that went down into an underground cave. I say \"underground\" instead of \"underwater\" because the water cut off at the cave's roof, defying gravity.\n\nThe cave, which had large flowers on the walls (hence the pollen) and deposits of the hallucinogenic \"Yellow Dragon\" moss, contained a sickly green glow at the far end, which contained the BBM. When the PC approached, however, a beehive fell in front of him and a swarm of bees emerged. This happened a few more times, and suddenly a massive beehive dropped and started rolling at him, Indiana Jones-style. Outrunning the hive and swarms of bees, he managed to get back into the water and swim up and out. Behind him, the water filled with honeylike gel (filled with pollen and such). Oddly enough, the bees were able to follow him through it! With bees and terrible gel following him, he swam to the shore, barely outpacing the gel's expansion. After he got out of the water, the whole lake turned into the BBM's strange gel. It was basically a large lake honey-flavored, hallucinogenic gelatin lake filled with dead bees. Live bees swarmed out around the lake. Some PCs soon joined the guards in fighting them. Of course, someone said \"not the bees!\" I was legally obligated to put that line in.\n\nAnyway, the ninja (we're still debating over whether he's the worst or the most effective ninja ever at this point) proceeded to feed our other, more eccentric lizardman PC some of the gel. He had a vision of, as I described with a bad Scottish accent, \"a time when men fought fer their freehdom! When dragons and giants terrorized tha lahnd!\" Etc. Anyway, he saw stuff like what had happened during the aforementioned wars, when beings like the BBM had roamed freely and wreaked havoc.\n\nAfter recovering from the hallucinogenic (and poisonous- he took some damage) gel, he ran toward the town and obtained a boat from a fleeing dwarf (a woman sporting a beehive hairdo, no less). That's around when the session ended, but he apparently plans to go down and somehow deal with the Bee of the Bird of the Moth. I don't know if he wants to fight it, blow up the cave, or what, but it will definitely be interesting. I'll have to toss some protozoa, snakes, and horses in there next time, as they are enlisted in the forces of the Bee of the Bird of the Moth.\n\nAnyway, it was a load of nonsense, but it was very fun. It just goes to show that sometimes the best sessions are the improvised ones, even if the concept is as lame as one extended They Might Be Giants reference.\n\n**UPDATE: I forgot about this. They did fight the protozoa, snakes, and horses, and eventually took down the BBM. The hospiter got to make a hammer out of its beak. People lost interest in the campaign near the end, but this memory remains.**",
        "created_utc": 1400897864,
        "upvote_ratio": ""
    },
    {
        "title": "[Skyrim] The Adventure of the Stolen Skooma - Part 11",
        "author": "ewpierce",
        "url": "http://ewpierce.com/2014/05/adventure-stolen-skooma-part-11/",
        "text": "",
        "created_utc": 1400847927,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] Chapter 23: How Many Wishes Does it Take to Get to the Center of an Evil Temple?",
        "author": "Malphia",
        "url": "http://adventuresofthealmostheroes.blogspot.com/2013/11/day-67-3-wishes-later-hommlet-lays-in.html",
        "text": "",
        "created_utc": 1400740614,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] In which I realize that I've become \"that guy\".",
        "author": "LordHymengrinder",
        "url": "http://www.reddit.com/r/gametales/comments/263i3t/35_in_which_i_realize_that_ive_become_that_guy/",
        "text": "   It begins, as many of these stories do, with good intentions. I had a great idea for a character concept, and decided to flesh it out for a friend's campaign, being unsatisfied with my current character for legitimate reasons. (See post [here!](http://www.reddit.com/r/gametales/comments/1nhz9e/35_do_you_really/) for more details) \n\n   In a world with a magical-industrial revolution, I thought there would be boundless opportunities to develop an Artificer that was all about generating vast amounts of wealth and power for himself. What I wasn't informed of, however, was that most of the campaign would be taking place away from cities, leaving me without the resources required to construct the myriad magical devices which my character would use to attain wealth and power. Naturally I came up with an idea for a character that would mesh well with the party, add plot hooks for my friend the GM to capitalize on, and have the ability to grow and change as a character.. That was the idea anyway. \n\n   So this new character, Morgen Deschaines, (Props to anyone who can figure the reference) is a Cleric. He is not in service to a single god, but to a pantheon; the \"Pantheon of the Sun\". Through a 5 page Word document with a well flushed out and mechanically sound backstory, I introduce him as a watered down half vampire with a lust for redemption fueled by righteous self loathing and an insatiable need to do good. Working with my friend, we neuter the class down to workable levels, and I roll stats. I make my character.. and then game is discontinued for 7 months due to real life drama between some of the players, and general business/life things between the rest of us. \n\n   This last weekend we get together to continue the campaign, right where we left off 7 months prior; at a sprout of the Yggdrasil tree that holds the world together and gives everything life. Skinwalking spider servants of Lolth have corrupted the sprout, and we've been tasked with escorting a Dryad to the tree so that she can cleanse the evil from it. Anders, my previous character, had decided he wanted no truck with skin stealing, shape-changing, misandrist spider wizards, and tells the party that they're a bunch of hippies and that he isn't willing to die to save the forest and that you can't spend coin when you're dead. \n\n  The rest of the party continues back to the tree escorting the Dryad, and as some members scour the tree-houses, they come across the bound and gagged forms of Morgen, and his companion Sakala. (Myself and my girlfriend, respectively. Backstory for Sakala; she's a pacifist who only wields a greatshield and has Shield Mate, she casts Shield Other on the front line and tanks for days.) The players, being wary of shape-shifting spider skin thieves, have the Paladin (Cohen) search them and use Detect Evil. After we're untied and introductions are made, a sound comes from the Yggdrasil sprout. From the temple woven from the branches of the sprout comes a wailing noise, and a giant Lolth Spider Matron with sagging grandma tits (his description stolen verbatim) and grey skin crawls out and, lamenting the death of her murder-bent spider children, scuttles down the tree and begins assailing our position with spells. I'm not talking Magic Missile or Acid Arrow, she's hurling Lighting Bolts and using a special web attack to try to snare us. Cohen, attempting to shield the Dryad, catches a Lightning Bolt on the chin (Reflex Save: Natural 1) and eats dirt as he's knocked to the ground from the impact of the spell (Reflecting the Nat 1). \n\n   Meanwhile, Sakala and Morgen are frantically searching the treehouses for their gear, and manage to find it in a battered chest. Forgetting the armor we grab shields, in my case sword, and our holy symbols, and book it back (and down ladders) to the Dryad. We see that the Halfling Rogue (Ezra) has been plinking at the Spider, doing minimal damage, and that the Druid (Artemis) has summoned a Hipogriff which is doing its level best to divebomb the spider and drive it to the ground. We ask why Artemis hasn't cast any more spells at it, and she states point blank that she isn't willing to damage the tree to kill the spider, and that we'll have to deal with it this way. (Excellent roleplaying on her part.) \n\n   Eventually the Spider realizes that she isn't going to drive us or the Dryad off and that fighting us on the ground is pointless, so she retreats back into the temple behind a Wind Wall, and tells us that the Dryad will never be able to cleanse the tree as long as she lives. Sakala heals Cohen, and we return to the tree, don our armor, and return to the Dryad who is now attempting to cleanse the tree. Confirming that she can only take the ritual so far while the Spider Matron lives, we decide that we'll have to ascend to the temple and kill her. Ezra and Artemis agree to stay behind in order to protect the Dryad while Morgen, Sakala, Cohen, and Kajata (Eastern Flavored Swashbuckler. Uses a katana, shortspear, and blowgun. Also has a strong bond with his horse, Ashien.) jog to the other side of the tree where a staircase has been grown from the side of the tree. We ascend the staircase, and come to the entrance to the temple.\n\nAt this point, I tell my DM that I begin casting spells. \n\n\"Oh?\"\n\n\"I cast Divine Favor, Bull's Strength, and Bless Weapon.\"\n\nI would have cast Protection from Evil as well, but I used it in the previous combat to buff my atrocious reflex save against the god damned lightning. Unneeded, but hindsight etc. Sakala casts Bull Strength on herself, Bless on everyone, and Shield Other on me. \n\n   He sighs and tells us that it's very dark in the Temple, but that I can see a statue that appears woven from branches forming an avatar of Obad Hai, and a stirring movement (Spot check, darkvision) at the canopy of the temple. I call out to the Spider Matron, and she drops to the ground, standing up on 4 of her legs, and in 4 others, wielding goddamned scimitars. Yes, 4 handfeet wielding thrice damned scimitars. We roll initiative, i'm top of the round. I charge in two-handing my bastard sword, booming curses of the light at her, and swing declaring a power attack. My first attack roll of the game? Natural 20. \n\n\"Nice, roll to confirm.\"\n\n\"It's an automatic critical, man.\"\n\n\"How?\"\n\n\"Bless Weapon.\"\n\nBless Weapon aligns your weapon and gives it a +1 effect when considering damage reduction. It also makes all threats into critical hits vs evil creatures by default.  \n\nDid I mention that Morgen has a 20 strength due to an excellent roll and being a neutered Half Vampire?\n\nI calculate damage.\n\nRoll 6. +7 strength  to +10 from 2 handing my weapon, +3 from power attack, +1 from Mastercraft, +1 from Divine Favor. Times two. \n\n\"42 damage\"\n\nwut.jpg \n\n   He sighs and explains that I rush the spider, and anticipating my strike, she attempts to stab me. Her attempts fails, I sever her arm, and then follow through with a vicious strike to sever her leg. My fellows join combat, and I am Spider Splooged™ to the ground (Shitty reflex save as a cleric.) Combat continues another round, and I hit the spider again, this time for 20. Cohen attempts to Smite Evil and fails, his attack being parried by the Spider. Kajata attempts to no avail to stab the spider with his spear, and Sakala moves in between Cohen and I to grant us AC with her Tower Shield via Shield Mate. She attempts to bash the spider (DM gave his approval prior) and fails.\n\n   The spider's next turn comes and it's panicking, i've done 62 damage to it personally, and it's lost several limbs. She flees, provoking AoO, and we all whiff, much to our chagrin. She turns around, and, cursing us for making her resort to it, she forms a massive ball of fire in her hands and launches the most fabled spell in all of D&amp;D at us.\n\n\"Reflex saves!\" he cries, a terrible grin on his face. \n\n   Groans are heard around the table as we all fail, miserably, might I add. We all take 18 damage as the Fireball lands in the middle of us, scorching the wood and heavily wounding all of us. Then I remember. \n\n\"You cast Shield Other on me earlier, right?\" \n\n\"Yeah..\"\n\n   Sakala takes 27 damage and falls unconscious, so I naturally give up Delay Poison for a Cure Mod, which ends up healing 11. Cohen and Kajata follow the Spider, keeping her tied up in melee. Cohen takes a scimitar blow and falls to the ground near dead. Morgen stares horrified as the Spider lunges, attempting to bite Cohen as he falls, missing by a bare fraction of an inch. (She missed his AC by one, and it would have been a fatal blow.) Sakala drags herself to her feet, and tells Morgen to charge the Spider and kill it, that if I don't it'll kill both of us. I run in and attack, dealing heavy damage and spraying purple spider blood everywhere, dealing a near fatal blow. That's when we hear it in our heads, the voice of the Dryad. \n\n\"Go now, and leave the spider to me. Tend to your comrade while he still lives.\" \n\n   Her voice seemed to be coming from the tree itself. Morgen considered disobeying and finishing the Spider, but in the end, saving Cohen's life was the ultimate priority. Sakala rushed to him and expended her last spell of the day as a Cure Light to bring him to 0 (He was at -7), and Morgen does the same, returning Cohen's ability to walk. Half carried by Kajata and Sakala, Cohen returns to his feet and we all make it out of the temple and down the staircase. The Dryad ends up fusing with the tree, animating the massive branches, and crushing the spider to death. We reunite with Ezra and Artemis who tell us that the Dryad disappeared into the tree. \n\n   Flowers sprout, the sun moves out from behind a cloud, and we agree to call it a night. Kajata’s player was feeling rather ill, and we wanted to talk and hang out for a bit afterward.\n\nMy friend looks at me, and in a rare fit of eloquence remarks “Dude, what the fuck?”\n",
        "created_utc": 1400649652,
        "upvote_ratio": ""
    },
    {
        "title": "[3.5] Chapter 22: Isaac Has a VILE Theory!",
        "author": "Malphia",
        "url": "http://adventuresofthealmostheroes.blogspot.com/2013/11/day-66-isaac-has-vile-theory.html",
        "text": "",
        "created_utc": 1400563119,
        "upvote_ratio": ""
    },
    {
        "title": "[Pathfinder] What's your most fulfilling character story that you've played? Mine's Stunty The Rager",
        "author": "Multiprimed",
        "url": "http://www.reddit.com/r/gametales/comments/25xbsk/pathfinder_whats_your_most_fulfilling_character/",
        "text": "There are a lot of great character stories out there, so feel free to share them here. I always enjoy a great read. As for my own, let me tell you about one of my proudest characters, and how he has a special place in my heart: Stunty The Rager. I went a pretty different direction with the character, and it paid off amazingly by the end of the campaign as one of my most fulfilling characters I'd ever created. I've talked about him before, but I never said what happened to him on his adventures. It's a long story, but I hope you stick through it and enjoy it. And of course, share your own! :)\n\nNow, Stunty's real name was Fehron IronBludgeon, and he was a dwarf barbarian hellbent on great fame and fortune for his family name. Sadly, no one ever got to know his family name because his best friend, Del'Morian (aka \"Del\"), loved nothing more than to introduce him as \"Stunty The Dwarf\". It pissed Fehron off to no end. Stunty was a good guy, ableit brash and loud. He always looked to help people out, preferably by swinging his warhammer \"Cruncher\" and his blackiron cudgel \"Capper\". He loved nothing more than to see smiling faces and a good fight. Stunty had a troubled past, however, that left him haunted and and a somewhat broken man. In his younger years, an act of cowardice cost many lives because of Stunty (a story for another time). It left some scars that never fully healed, but it also filled him with a sense of duty. He made sure that he would never again be the coward that caused the deaths of those who were innocent. The damage had been done, though, and Stunty found himself hearing the voices of those who had died because of his weakness. The only way he could find to silence these voices was to kill those he deemed worthy as enemies, and he was compelled to collect their bones, adding them to a brutal totem that he always carried. He would never stop collecting, and it would be something he struggled with in his morality for his entire life.\n\nNow, many years after the incident, Stunty and Del had become friends and began to travel together. They had many adventures and were very close. They hopped between mercenary bands, searching for work and, in Stunty's case, the chance for some grand act of glory. One day, they were waiting in a tavern to sign up for a renowned mercenary group that would be passing through and recruiting. They would certainly join the mercenary group... but only after the town was completely destroyed by a military attack from a neighboring kingdom. The attack came swiftly and ruthlessly. Despite the best efforts of Del, Stunty, and their crew, the town was utterly destroyed and many innocent lives were lost. It turns out, this was no mere invasion, it was an extermination. The invading soldiers not only killed any militia, but any women and children they could find.\n\nIt was in these acts that Stunty found a new purpose. As he sifted through the rubble in the aftermath, he came across two bodies. A woman and a child lie in their destroyed home. She had been brutally cut down defending her child, and the soldiers had decapitated her before killing her child. This scene burned itself into Stunty's mind, and he would never forget it. He composed the bodies as best as he could, returning the head to the mother, and gave them a proper Dwarven funeral. He then took two stones from their home, and he kept them with him always. Searching the belongings, he determined the names of the two innocents, and he carved them onto the stones in Dwarven. One read \"Maria\", the other \"Jerik\". He then hunted down the leader of the military force that had caused all of this, and crushed his skull with his warhammer. Del watched his friend with worried eyes that night as he collected the bones of the captain and began carving the same Dwarven rune into them over and over again before adding the pieces to his totem: \"Screams Screams Screams Screams Screams\". \n\nStunty then began a long quest. He joined the war. He fought with the heroes of his time, and both he and Del did great things. They helped to destroy armies, win battles, and slay villains. It took them two years. The entire time, no matter how much gold they gathered, Stunty seemed to remain poor. After two years, the war was won, and Stunty and Del had returned as heroes who conquered generals and saved many lives. Stunty insisted that they visit the town of Camria after the war, and Del of course accompanied him. It was a thriving town, all built in the masterwork craftsmanship of the Dwarves. In the center, a beautiful fountain displayed two statues. A woman, holding her child close. The base showed the destruction of the town, and its rebuilding to what it was before, and then becoming greater so that no one would forget. No one ever knew the benefactor who had commissioned its reconstruction, but that wasn't necessary.\n\nThen came the end of Stunty's story. He had gained the audience of a great noble, one in line to become king. He had been hailed as a hero, and the noble was more than happy to have Stunty in his home in order to improve his image, which had suffered some during the war as he had tried his best to stay out of it and not publicly commit any forces. Stunty and the noble were strolling through the manor's gardens, enjoying the beautiful landscape and discussing the heroic battles of the war and the long and difficult road to recovery between the kingdoms. Then Stunty began to tell the noble a story...\n\n\"I once visited a town, back before all of this. It was a lovely place. Small. Out of the way. Nothing but farmlands. It was very peaceful. It was one of the first places to be attacked in the war. In fact, ya could say it was the powder keg that blew the whole thing wide open. I'll never forget what it was like. Early that mornin', children were playing in the fields and about the roads. Farmers tending their fields, and their wives tending the animals. It was like darkness fell all at once. Before anyone even knew what was happening, the soldiers were upon them. Their cries for mercy, or even explanation, were cut short by the swords. It was nothing but a slaughter. I found two bodies in that village. Two of them that will be with me until the day I die. It was  a woman and her little boy. They had killed them both, and I was not able to save them.\" Stunty sniffed loudly, and wiped some of the tears from his eyes at the memory. \n\n\"But you know what? I promised 'em somethin'. I was going to save their town, one way or another. An' I did. Did you know that town still stands today? It's been rebuilt, and it's greater than before. I did it all fer them. I know you probably haven't even heard of the town. Nobles are busy running entire countries after all, and it's hard to remember every small piece of it. Would you like to know their names though?\" The noble had been standing quietly for all of this, letting the old war-hero simply tell his tale, but as the Dwarf drew the two stones from his pocket, he bent down to look at the runes. \n\n\"I'm sorry, but I do not read Dwarven, Master Ironbludgeon. What do the runes say?\" At that, the noble felt a hand grip the back of his neck. With jaw shattering force, Stunty slammed both stones into the mouth of the noble, shattering many teeth, lodging the stones inside and releasing a stream of blood from the now struggling noble's mouth. But Stunty held firm, not releasing the head of the human, and holding his hand over the nobles mouth.\n\n\"They bear the names of Maria and Jerik, the human mother and the child that you slaughtered in your lust for power. The nameless innocents that you killed as you attempted to quietly usurp the throne by starting a war you were too cowardly to even show your face in. I promised them I would save their town. I also promised them that the man behind it would pay. Can you hear them, filth? Maria and Jerik are screaming for you. Dek Thruum!\"\n\nDek Thruum. The eyes of the noble widened in fear. It was a phrase he understood. It was also the command word for the runes of shatter stone inscribed upon the carved stones. The noble's life ended that moment in a blaze of fear.\n\nDek Thruum... a simple command... \"Now scream.\"",
        "created_utc": 1400484858,
        "upvote_ratio": ""
    },
    {
        "title": "[Skyrim] The Adventure of the Stolen Skooma - Part 10",
        "author": "ewpierce",
        "url": "http://ewpierce.com/2014/05/adventure-stolen-skooma-part-10/",
        "text": "",
        "created_utc": 1400322700,
        "upvote_ratio": ""
    },
    {
        "title": "When Adventurers retire: Qwee-Qway the orc",
        "author": "Maxzor13",
        "url": "http://www.reddit.com/r/gametales/comments/25mzcv/when_adventurers_retire_qweeqway_the_orc/",
        "text": "In my friend group, the most famous adventuring party has always been a goblin monk, half-giant fighter, and an orc barbarian. And while Qwee-Qway the orc wasn't very smart, he had aspirations. \n\nQwee-Qway opened a bar, 'The Drunken Bucket'. Unfortunately Qwee-Qway can only say his name, and cannot spell or read. The tavern was actually named 'The Dramken Byarket'. In addition, Qwee-Qway tried to write several books: Wai Dum Goblin Iz Stupd, and Giant Sqwuish Bug. ",
        "created_utc": 1400172741,
        "upvote_ratio": ""
    },
    {
        "title": "[X-Post /r/DND] My 3.5e E6 Game that recently came to a temporary end.",
        "author": "IndirectLemon",
        "url": "http://www.reddit.com/r/gametales/comments/25mtcj/xpost_rdnd_my_35e_e6_game_that_recently_came_to_a/",
        "text": "Right, so my players met this [Big, Bad, Evil Guy.](http://www.reddit.com/r/DnD/comments/22f1ax/success_bbeg_encounter_went_gloriously_or_how_i/)  \n  \nThey then proceeded to travel along, finding a [village on fire.](http://www.reddit.com/r/DnD/comments/22l76o/ideas_to_improve_my_encounter_village_on_fire/) During which they played firefighter and saved a fair few people from a burny death.  \nAlthough I have to say, the minotaur's tactic of \"There's 12 cultists in here, so I'm just going knock out the house's supporting wall.\" wasn't expected.  \n  \nThey then finally got to the [Cathedral](http://www.reddit.com/r/DnD/comments/2469r3/this_wednesday_my_pcs_face_death_or_glory_at_the/) and the minotaur lost his greathammer.  \n  \nThen they rolled initiative:  \n  \nSo the Cleric goes first, he dives out the protected carriage and stoneshape's the main door closed, no more door.  \nThe squadron of Paladins move forward... We have an Orc Paladin who didn't roll under 17 to hit, two-weapon fighting with 2 \"Choppas\", We have a Kobold Paladin breathing fire on cultists, we have the leader of the order with a relic weapon, and a few more who didn't stand out as much, Dwarf paladin who swore and swung her mace around, human female Paladin who helped bar the windows...  \n  \nThe PCs followed suit for the first round, killing about half of the cultists (level 1 human cultist with +5 to hit, 1d6+1+poison, 1hp) not very threatening but if you failed a few poison saves it was lights out. (1d4 con/no secondary).  \nThe Minotaur charged and killed the half giant cultist (after receiving an attack of opportunity due to reach), taking his club. Aha! Disarmed no longer!  \nThe PCs were confident, as they had just halved the threat. The Dragonborn Favoured Soul PC - Fortinbras decided to ride his horse through the church and interupt Dreggrot's Ritual. He was on the alter conducting something with five cultists.  \nFortinbras breathed dragonbreath on one of the involved cultists and then:  \n\"The cultist catches fire, but doesn't seem to react, instead he holds his dagger up high, stabs himself and explodes into viscera and mist. His remains seem to be swept up by a wind and begin to circle Dreggrot, the other cultists [get red on them](https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;cad=rja&amp;uact=8&amp;ved=0CCcQtwIwAA&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DT1GYsCMCLpo&amp;ei=6GxzU_eXFJKh7AbA_YH4BQ&amp;usg=AFQjCNFgL14d3aJZh91P89Qt_Jv-qfQbig&amp;bvm=bv.66699033,d.ZGU), as the mist passes them.  \nThen a troll bursts through the back-west door, and a hill giant through the back-east, each with a handful of minions (similar stats to cultists, although the troll's minions were goblinoid, with 2 attacks, poisoned claws, and the hill giants were deformed people, no poison, big clubs.)  \nThe Hill Giant was the toughest \"wave\" that could have spawned, rolling on tables etc... it was a CR 7 on it's own...and the party is fighting a lot of stuff... it was literally a 1% chance on a d100 and my first roll was 100.  \nThe party split to deal with the new threat, the Minotaur charges the Hill Giant and....fumbles. Again. AGAIN he confirms his fumble... 1/400 chance... then fails a reflex, so I describe the following:  \nYou swing at the Giant in the same moment he swings at you, your greatclubs collide and shatter, throwing you off balance; you are now flatfooted until your next turn and disarmed.  \nThey then proceed to duke it out... for once using fire on the troll and killing it quickly, the Hill Giant took more time, but it's attacks without the club aren't as devastating and the party does have reasonable access to healing (Cleric hiding behind minotaur).  \n  \nThey bested the two waves, and the party Warblade, Erien, decided to stand in the biggest window (the large stained glass one the hammer went out of) and basically ensure no one could climb through it. I let him roll an attack roll each round, and to be honest they were all high rolls so I counted him as \"blocking\" that entryway.  \nThe party blocked the two doors, which had the higher spawn rates.  \nA Werewolf and some men with \"bestial features\" climbed in another window. The party has no silver, so they kept with the kill-it-with-fire plan.  \nFortinbras had killed all the ritualists, who had all had enough time to become a big viscera and mist shield around Dreggrot. The shield had deflected spells and energy blasts (ranged maneuver? Desert Sun, like a hadouken...) with no signs of slowing...although the fire was cooking the remains...  Fortinbras thought this would be a solid time for a cavalry charge, riding his horse into the shield he gets a reflex save, which he passes and is thrown clear of the horse...as it gets sucked into the whirlwind of gore. Fortinbras weeps for his magebred mount, then realises it could've been him.  \nI think the dialogue went like this:  \n\"Holy shit was that instant kill?\"  \n\"No, it's huge damage and reflex for half.... unless you CHARGE into it... then it's instant kill\"  \n\"Ah... yeah... right, logical.\"  \n  \nThe Wizard that was with them from the mages school was trying to work out a dispel magic that could overpower a blood-magick-infused ritual incantation. He told the party this and had been at it from turn 3 I think? but PCs are impatient.  \nThey shout at the wizard for an estimate on how long it'd take, he told them it'd take as long as it takes, plus however long they wish to chat. They shut up.  \n  \nThe PCs were beginning to bar doors and use the church pews to block the windows. Which I allowed to basically say they were closing the spawn points of \"waves\"  \n  \nAn Ettin came through and starting wrecking face just around the time the werewolf died. Then when they got the Ettin to about halfway...  \n  \nDreggrot crashes out through the whirlwind of viscera, coating himself in it.... the rest collapses, coating the altar in gore. The bloodsoaked half-orc of death and disease's momentum carries him through the air as he collides with the Wizard with a sickening bone-breaking crunch, knee first, into the soft man's chest. The wizard is thrown back like a ragdoll, collapsing to the ground, he lifts an arm outstretched to Norril (the Cleric) and then you see hope drain from his eyes and he collapses completely, still.  \n  \nDreggrot has entered the initiative. Now Dreggrot has special rules, he has 3 phases, each phase has a third of his HP, overkill does not carry over. In Phase one Dreggrot is goal orientated, he wants to kill the noble lady. In Phase two, he is bloodlusted and wants to hurt his aggressors, he also acts twice in the initiative. In phase three, he gets serious and can basically use his manuevers at will without recharge.  \n  \nSo, Erien's turn is immediately after this and he decides to follow Dreggrot's example and flying leap him.... Erien is still manning the back wall, so he kicks off, sprints and leaps. He also has Battlejump so this counts as a charge and his damage is doubled. Erien does a lot of fucking damage.... we're now in Phase two.  \n  \nDreggrot returns the favour with a whirlwind attack of fists and punches as he is dogpiled. Which is exactly why my \"bosses\" have two initiatives and lots of mobility. He hits Asimov, the Swordsage and switches places with him, moving out of the clusterfuck and steps back, not allowing himself to be charged, but also not allowing himself to be full attacked.  \nThere is a back and forth between him and everyone else, which included a 30 damage diseased slap in the face to the minotaur when one of his maneuver's critted.  \nAsimov also recieved a strong mountain hammer and needed to be healed.  \nIn Phase 3, Creed (the other swordsage who had been doing AMAZING vs things weak to fire with his desert wind ability) rushes in and attacks, rolling a 1, with a 1 to confirm. I describe it as his Falchion being caught mid swing and Dreggrot ripping it out of his hands, as he stumbled forward Dreggrot headbutted him and knocked him unconcious for 1 minute. (1d6) due to the fact he rolled REALLY badly on the fumbled table...90+ I think.  \nPhase 3 was basically Dreggrot using two of his stronger maneuvers per turn and people didn't want to get close to the barrage of damage. Erien had a plan and decided to run at the Minotaur and catapult himself into Dreggrot for a battlejump. He rolled a 20 for the jump check and a 17 to hit, it was glorious, again, a fuckton of damage and Dreggrot finally died.  \nThe minotaur got a reflex save which he aced, if he failed the attack would have still worked, but the Minotaur would have been damaged as the warblade kicked him to launch himself.  \n  \nDreggrot dies, random dice are rolled, Asimov fails a fortitude save (much to his confusion) and everyone is happy that Dreggrot is dead.   \n  \nThe Seal on Torog's prison looked like a Blonde haired, Blue eyed, golden armoured knight, fighting a demon with not real form, more like a wave of evil. Behind the Knight (whom they identified as Sir Sertrous the Virtuous) were lots more people, all blonde haired, blue eyed. Then, The noblewoman, the descendant of Sir Sertrous performed her ritual, at the end of which, she stood up and walked forward, as if down steps, into the seal. When they checked the image once more, there was an additional person in the image, and they looked familiar.  \n  \nOutside the armies had fled, they had a scout so they knew when Dreggrot had died and they had failed... the surviving paladins came into the cathedral and everyone made camp and slept. Asimov passed a Will Save, much to his confusion.  \n  \nIn the Dreamheart however... Asimov stood alone in the Cathedral staring at an impossibly huge orc with white hands that dripped pus and maggots. Asimov realised he stood face to face with Yurtrus the white handed himself, God of Death and Disease.  \nHe offered Asimov a choice, take his champions place or be consumed by him. Asimov was a host for Dreggrot's disease form but Dreggrot was failing to overcome Asimov's will. This displeased Yurtrus, so he offered the powers of Dreggrot to Asimov.  \nAsimov refused and Dreggrot materialised in the Dream. It was quite an even match, a level 6 swordsage (stripped of special powers) vs a level 5 swordsage. Dreggrot won initiative, moved to Asimov and... killed him in a single blow. Dice that should've averaged a just over a third of his health came out to be almost all of it, then strength bonus finished the job.  \nI described the feeling of weightlessness to Asimov. And he succeeded on another will save. I described Yurtus's voice murmur to him as he floated through the dream \"you are a stubborn little soul, you are my stubborn little soul now.\"  \n  \nEveryone else was watching Asimov \"sleep\", as his body was asleep but it was also twisting and convulsing like an epileptic's nightmare. People tried to wake him but suddenly he started to scream, and with it his body imploded as it was dragged into the Grey Wastes of Hades.  \n  \nAsimov awoke, chained to a wall in the pitch black, he could tell by the putrid and stuffy air he was in a tiny cell.  \n  \nThat, is where we ended it, for now.",
        "created_utc": 1400169075,
        "upvote_ratio": ""
    },
    {
        "title": "Play nice, or else.",
        "author": "Powernade",
        "url": "http://www.reddit.com/r/gametales/comments/25mp5v/play_nice_or_else/",
        "text": "I've had some trouble with a couple of my group getting under each others skin. The tall and noble elf has been jeering at the halfling's height for far too long. So, when the overconfident elf decided to take the lead in last night's dungeon, he found himself caught in a cage trap. But, being sealed in the small room was the least of his worries, as the floor began rising into the ceiling, making his already diminutive accommodations smaller and smaller.\n\nHe quickly found himself begging our lockpicking halfling for help, which the little thief was only too happy to provide. After sliding out of the crushing trap by the skin of his back, the elf and the halfling are great friends, and the elf always checks for traps ahead of time. Now I just have to figure out how to get the fighter and ranger to quit bickering...",
        "created_utc": 1400166497,
        "upvote_ratio": ""
    }
]