[
    {
        "title": "\"Missed Connections\" A Vampire: The Masquerade Story (Re-Mastered Audio)",
        "author": "nlitherl",
        "url": "https://www.dailymotion.com/video/x8dz0mf",
        "text": "",
        "created_utc": 1667664162,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Grey Tower - Episode 19",
        "author": "TuskenTheOrc",
        "url": "https://youtu.be/m5RPLvcTI6U",
        "text": "",
        "created_utc": 1667654165,
        "upvote_ratio": 1.0
    },
    {
        "title": "5 Torches Deep Actual Play - Episode 30 - Set it on fire and run away",
        "author": "Maximum_Stable7715",
        "url": "https://www.reddit.com/r/gametales/comments/ylcpdt/5_torches_deep_actual_play_episode_30_set_it_on/",
        "text": "5 Torches Deep Actual Play is a series where we play through adventures using the Role Playing Game system called 5 Torches Deep. This is a Dungeons and Dragons lite ruleset that uses elements of 5e but focuses on an old school vibe where it concentrates on the dungeon delving and the value of your loot is your experience. \n\n&amp;#x200B;\n\nWe play for fun and this is kind of a recording of our Discord/Roll20 session.\n\n&amp;#x200B;\n\nWe have just released Episode 30:\n\n&amp;#x200B;\n\n5 Torches Deep Actual Play - Episode 30 - Set it on fire and run away\n\n&amp;#x200B;\n\nThose watching our videos may notice this episode sees the introduction of the 8-bit characters that has been in our artwork \n\n&amp;#x200B;\n\nMissing a session this one does not pick up from episode 29. The party have returned to the Hole in the Oak and defeated 'Jorg the Defiler' unfortunately losing Ilrune in the fight. \n\n&amp;#x200B;\n\nContent Warning - There is a return of the tree babies in this episode with some language that may cause distress.\n\n&amp;#x200B;\n\nEpisode 28 of our podcast has seen a sudden spike in downloads anybody know why this has happened, maybe it was featured somewhere that we don't know about, feel free to comment here, youtube, podbean, our Facebook group or email us at [5torchesdap@gmail.com](mailto:5torchesdap@gmail.com)\n\n&amp;#x200B;\n\nRecording can be found here: [https://www.podbean.com/ew/pb-n9ymq-12fe740](https://www.podbean.com/ew/pb-n9ymq-12fe740)\n\nYoutube version can be found here: [https://youtu.be/R0Ouk46\\_o3A](https://youtu.be/R0Ouk46_o3A)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nFor more information or to contact us please visit/join our group on Facebook to keep up to date with releases: [https://www.facebook.com/groups/973462380050335/](https://www.facebook.com/groups/973462380050335/)\n\nHope you enjoy!\n\n&amp;#x200B;\n\n\\#rpg #dnd #dnd5e #tabletop #ttrpg #OSR #OldSchoolRenaissance #actualplay #podcast #fivetorchesdeep",
        "created_utc": 1667504851,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gundrin aka Jimmy Jenkins broke his leg in the Lost Mines of Phandelver....good start!",
        "author": "bishaha",
        "url": "http://newradiomedia-recast.streamguys1.com/content/geektainment/20180928113316-PodquestersEp029.mp4",
        "text": "",
        "created_utc": 1538308066,
        "upvote_ratio": ""
    },
    {
        "title": "[D&amp;D 5E] Float like a bee, sting like a bee, is actually just a bee. Killed the entire party.",
        "author": "Teufel_Barde",
        "url": "https://www.reddit.com/r/gametales/comments/9jzylb/dd_5e_float_like_a_bee_sting_like_a_bee_is/",
        "text": "When you think TPK's, you usually think of one of two situations, either something grand, or pathetic, this is both. My current group and I wanted to start trying d&amp;d 5E again, since pathfinder was starting to get a bit stale but we still wanted classic fantasy adventuring.\n\n&amp;#x200B;\n\nA druid had been trying to destroy the local village, so they hired the group to go kick his ass. What they had not been told, was that the druid was an insect totem worshipper, and prayed to cthuloid elder things. This was made extra fun by the fact one of my players suffered from arachnophobia, and another HATED mosquitoes. The moment they got into the forest and had their first encounter against a bear sized beetle, they almost booked it out of there, and would have if not for the monk.\n\n&amp;#x200B;\n\nThey eventually got to the druids shack, had a bit of interaction with him, realized he was insane, and just rolled initiative after he mumbled something about the bees feel so great today in his backhive. It was a pretty standard druid boss fight for the most part, mainly wild animals acting as the hitpoint damage soakers while he pelted the party. The real fun didn't begin until after the fighter waded through the putrid ground that made up the difficult terrain to slap the crazy coot with his club, at which point the druid used a legandary action to transform himself into a swarm of bees, taking only half damage from the melee and would remain in that state until his next turn if he so chose.\n\n&amp;#x200B;\n\nThe fighter was in the worst place at the worst time, unable to deal much damage to the swarm while the rest of the party simply couldn't get to him to help, nor use range without fear of hitting him. The druid couldn't do much in his swarm state outside of sting people and move, so he did one of those every turn and renewed the effect whenever possible, effectively munching through the fighters considerable HP pool by the time the wizard said fuck it and tossed a fireball, which killed the fighter, and the swarm took half damage from a dex save.\n\n&amp;#x200B;\n\nThe monk ended up being the next target, except he was being accosted by some assassin vines, a fight he was losing as it had him grappled. At this point both the cleric and wizard tried to free him, but they all started to get grappled and stung by the bee swarm/assassin vine combo, with the wizard being too weak to escape the entangle spell cast by the vine, and the cleric was stuck either healing someone, or pathetically hacking at the vine to break his buddy free.\n\n&amp;#x200B;\n\nThe wizard and monk died pretty soon after they all got entangled, with the cleric, who was sporting a stupid amount of hitpoints, was only just able to get out and made a break for it, but couldn't outpace the bee cloud, which stung him to death. The funny thing was, the bee druid was only five hitpoints away from death, a single guiding bolt would have ended it.\n\nI didn't even stat the druid that high for this 6th level party, and in bee cloud form he was basically just hard to hit and did little damage, yet this, combined with assassin vines, two spider pigs and some sticky mud was enough to end them.",
        "created_utc": 1538250570,
        "upvote_ratio": ""
    },
    {
        "title": "That Guy has One Solution",
        "author": "Phizle",
        "url": "https://i.redd.it/57gpouc957p11.png",
        "text": "",
        "created_utc": 1538235235,
        "upvote_ratio": ""
    },
    {
        "title": "The Romantic Consequences of High Charisma",
        "author": "EccentricHeadwind",
        "url": "https://www.reddit.com/r/gametales/comments/9jv7o8/the_romantic_consequences_of_high_charisma/",
        "text": "On our last adventure, our party found itself in the southern expanses of our world's frontier, weeks beyond the borders of the central empire.  As we made our way through the wilds, we happened to stumble upon a village, home to several small families of freemen who had lived there for generations.  \n\n&amp;nbsp;\n\nAs the village was too small and isolated to support an inn, a few of the families offered to take us into their homes for the night.  Our resident elf sorcerer and kobold wizard decided to stay with an elderly couple; our half-fey bard leapt at the chance to visit the family with 14 children; and our dwarven cleric chose to camp outside in the nude as he always did.  \n\n&amp;nbsp;\n\nThe remaining two party members, an asherati monk and myself—a young human beguiler—elected to stay with the last family, which included a middle aged couple and their two older children (mid to late teens).  My character, being something of a smooth-talking information broker, decided to stay up late into the evening, chatting with the family and gathering information about the village itself.  \n\n&amp;nbsp;\n\nAs the conversation progressed, the DM paused for a moment, rolling a couple dice on the table before turning back to me.  \n\n&amp;nbsp;\n\n“Say, what was your character's charisma score again?”  \n\n&amp;nbsp;\n\n“16,” I replied.  \n\n&amp;nbsp;\n\nHe smiled.  \n\n&amp;nbsp;\n\n“As the night goes on, you notice the oldest daughter shifting closer as you talk, batting her eyes every so often.”  \n\n&amp;nbsp;\n\nCue a round of *ooooh*-ing around the table.  \n\n&amp;nbsp;\n\nI thought for a moment.  In-character, I had a background as a professional “entertainer,” so situations like this weren't exactly unfamiliar.  \n\n&amp;nbsp;\n\nI looked back at the DM.  \n\n&amp;nbsp;\n\n“How do the parents seem to react?  Do they notice?”  \n\n&amp;nbsp;\n\nThe DM nodded.  \n\n&amp;nbsp;\n\n“They notice, but they don't seem to mind it.  You get the feeling they see it as an opportunity for their daughter to marry out of the village into someplace better.”  \n\n&amp;nbsp;\n\nI nodded.  If that was the case, I might as well roll with it.  No harm in getting closer to my sources.  \n\n&amp;nbsp;\n\n“I'll allow it and throw a few smiles her way.”  \n\n&amp;nbsp;\n\nThe next morning, the party awoke, each of us taking breakfast with the families we had stayed with.  As we packed up to continue our journey, the daughter from the night before ran up to the side of my character's horse.  \n\n&amp;nbsp;\n\n“Take me with you!\" \n\n&amp;nbsp;\n\nI raised an eyebrow and glanced at the DM.  He just smiled back.  \n\n&amp;nbsp;\n\nAs things stood, the last few weeks of in-game travel had been perilous—despite trying to stay toward the back of the group, my own character had fallen unconscious in three of the last five sessions.  On top of that, given my character's typical M.O. and personality, pursuing any close relationships with informants would likely lead to...complications...further down the road.  \n\n&amp;nbsp;\n\nMy character turned back to the girl.  \n\n&amp;nbsp;\n\n“I'm afraid that might not be the best idea—we're heading into very dangerous territory.”  \n\n&amp;nbsp;\n\nThe girl shook her head.  \n\n&amp;nbsp;\n\n“I promise I won't be a burden!  I'll take care of myself and I can even cook and take care of the camp for you!”  \n\n&amp;nbsp;\n\nI shook my head, trying to look regretful.  \n\n&amp;nbsp;\n\n“I'm sure you're a capable young woman, but it would be wrong of me to put you in harm's way knowing what we're up against.”  \n\n&amp;nbsp;\n\nThe girl seemed to think for a moment, realizing she wouldn't be getting a “yes” right away.  \n\n&amp;nbsp;\n\n“Then...will you be returning to the village on your way back to the Empire?”  \n\n&amp;nbsp;\n\nIRL I raised an eyebrow at my DM, who just replied with another grin.  \n\n&amp;nbsp;\n\nIn-character, I sighed, trying to play things off delicately.  \n\n&amp;nbsp;\n\n“Well, to be honest, the state of affairs up north isn't much better.  Things are difficult at the moment—it might be best for you to stay with your family for the time being.”  \n\n&amp;nbsp;\n\nThe girl's shoulders fell, a look of disappointment on her face.  Not wanting to ruin my relationship with a potential informant, however, I stepped of my horse and took her hand.  \n\n&amp;nbsp;\n\n“...that said, who knows what the future may bring?  Perhaps our paths will cross again.  Until then, stay safe.”  \n\n&amp;nbsp;\n\nWith that, I kissed her hand.  Offering my most dashing smile as her face turned beet red, our party bid farewell to the villagers and continued down the road toward our destination.  \n\n&amp;nbsp;\n\nAnother week of travel passed.  We stumbled upon a few encounters, discovering a conclave of far realm body-snatchers and surviving a near-TPK that resulted from a misunderstanding with a silver dragon.  My character even died briefly—only surviving thanks to the bard and our DM's “first one's free” policy on character deaths.  \n\n&amp;nbsp;\n\nResolving the issue with the silver dragon, we managed to convince her to help us return home by seeing us as far north as she could.  With a bit of dragon magic, we appeared in the middle of the village we had passed through the week before—beaten, battered, but out of immediate danger at last.  \n\n&amp;nbsp;\n\nRemembering the girl we'd left behind, I made a point to mention how rough my character looked.  Sure enough, as the villagers stepped out of their homes, the girl came running up and began to tend to my wounds.  \n\n&amp;nbsp;\n\nAs the party began to discuss our next step, the bard (a female character) made an offhand comment about saving my character's life “yet again.”  To our surprise (and IRL laughter), this elicited a sharp glare from the girl, who shifted between us as she continued her work.  \n\n&amp;nbsp;\n\nOur group's exchange (and laughter) continued for a while longer before the bard began to convene a town meeting with the villagers present.  With a bit of prodding, she managed to convince them that moving north to the empire would be in their best interest.  \n\n&amp;nbsp;\n\nThe only issue was that of travel time; with the large number of children in the village, base walking speed would be reduced by two thirds.  (At this point, we had already been traveling for a month and a half.)  \n\n&amp;nbsp;\n\nThough the bard (in character) wished to escort the villagers directly, the rest of our party managed to convince her that the villagers ought to be able to handle the situation themselves.  That said, we decided to put out the offer to any able-bodied individuals who wished to come with us immediately, rather than waiting to travel *en masse*.  \n\n&amp;nbsp;\n\nTo little surprise on our part, the only one to speak up was the girl who, by this point, was hanging off my character's arm, fully intent on traveling north.  \n\n&amp;nbsp;\n\nAt this point, my character's attitude toward her had changed somewhat; he didn't mind the attention and her sheer determination had impressed him.  In their talks, she had also shown signs of magical aptitude—something the DM noted could possibly be developed down the line.  \n\n&amp;nbsp;\n\nThat in mind, to the IRL smirks and chuckles of the other players, I approached the girl's parents, asking how they would feel if we took their daughter with us.  \n\n&amp;nbsp;\n\nThough the mother nodded right away, the father replied with a stern look, asking if I'd promise to look after her.  I agreed, prompting a small nod from him as he motioned back to his daughter behind us.  \n\n&amp;nbsp;\n\n“You understand if anything happens to her, I'll be coming for you, right?”  \n\n&amp;nbsp;\n\nI nodded.  \n\n&amp;nbsp;\n\n“I wouldn't expect any less.”  \n\n&amp;nbsp;\n\nThe next few weeks of travel passed relatively quietly, my character and the girl spending a fair amount of time together as we made our way north.  This elicited a decent amount of ribbing from the other party members, the girl's somewhat sheltered upbringing resulting in a fair few bouts of stuttering blushes along the way:    \n\n&amp;nbsp;\n\n[While chatting with the bard]  \n\n&amp;nbsp;\n\n“You picked a good man for a husband.  Real keeper, that one.”  \n\n&amp;nbsp;\n\n“Oh!  B-but we're not married...[and more quietly]...yet.”  \n\n&amp;nbsp;\n\n[When the sorcerer was trading watches with us]  \n\n&amp;nbsp;\n\n“Okay, I'm coming out now.  You two hurry up and get your clothes on!”  \n\n&amp;nbsp;\n\n“But we're not even undressed!”  \n\n&amp;nbsp;\n\nFinally, after a month of travel (and another encounter or two) we arrived at the guild hall, imperial soil beneath us once again.  We immediately made for the tavern, looking to catch up with the events that had transpired during our absence.  \n\n&amp;nbsp;\n\nOr, at least, that was our *original* intent.  As we took our seats, half the party immediately began hammering drinks, rolling (and failing) half a dozen fort saves in quick succession.  Laughing, I had my character request a tankard as well, then turned to the DM, remembering that the girl was still among us.  \n\n&amp;nbsp;\n\n“Out of curiosity, how does she react to all of this?”  \n\n&amp;nbsp;\n\nThe DM just laughed.  \n\n&amp;nbsp;\n\n“A sheltered village girl sitting in a tavern with unlimited access to free alcohol?  She's already halfway through her second drink and *gone*.”  \n\n&amp;nbsp;\n\nHilarity ensued as the rp drinking session quickly spiraled into a full-on bender, laughter and low level spells flying across the bar.  By this point, the girl was practically sitting in my character's lap, all inhibitions tossed to the wayside.  Slurring their words, she and the bard began to bond in their drunkenness, the bard promising to put on “*the best bachelorette party ever*” as soon as the two of them sobered up.  \n\n&amp;nbsp;\n\nMy character—only a drink or two in—raised an eyebrow in surprise, watching the scene unfold in amusement.  Eventually the girl and the bard ran off, a retching noise sounding from the back of the room a few minutes later as the two of them rushed to the side of the empty golden sarcophagus some of the other guild members had left behind in our absence.  (We later found it was being kept on layaway for a certain all-powerful dry lich, but that's a story for later.)  \n\n&amp;nbsp;\n\nAs the two tended to each other's cleanup, my character decided to take the opportunity to ask the barkeep (and building manager) if he could spare another room for the girl in the guild's barracks.  The dwarf chuckled and replied with a nod, saying he'd be sure to set her up in an adjoining room.  \n\n&amp;nbsp;\n\nAt this point, it was already 4am IRL, so we ended things there, laughing about the session for a good ten minutes afterwards.  The player who runs the bard assured me that he'd be posting a “*best bachelorette party ever*” mission on the quest board for a future session.  Not to be one-upped, the sorcerer and wizard promised to arrange a corresponding “*best bachelor party ever*” quest immediately after that.  \n\n&amp;nbsp;\n\nWhile a beguiler with a potential love interest isn't what I initially had in mind for this particular character, I'm not lying when I say I'm excited to see where this all goes.",
        "created_utc": 1538213008,
        "upvote_ratio": ""
    },
    {
        "title": "Wizards only level 5 spell",
        "author": "PsycoticANUBIS",
        "url": "https://www.reddit.com/r/gametales/comments/9juxmq/wizards_only_level_5_spell/",
        "text": "  \n\nFinal session of my campaign I’m DMing. Party consists of a bard, cleric, ranger and wizard. Allowed party to level up mid game between last two sessions since they were so close. They reach level 9 and cleric, bard and wizard all get a level 5 spell slot. Wizard takes *Conjure Elementals.* BBEG and his party head down into tunnels to his super machine to make the world undead. PC’s party is trapped behind an invisible *Wall Of Force.* Wizard uses his new and only level 5 spell he will ever get in this game to summon an earth elemental. Gives the elemental his book that when opened pours an infinite amount of sea water until closed. Sends it under the wall of force with the book and tells it several things. Go to cavern (he meant the one with the machine in it), find the machine (Earth elemental doesn’t know what machine or even what a machine is, or where it is.), Flood the cavern so the litch can’t go inside and use the machine. \n\nFirst off Litches don’t need to breath, flooded room wont do anything to him. Second, explain that the elemental doesn’t know where machine is, or which underground cavern to go and flood. He tries to call the elemental back but it can’t hear him underground. Wizard has to sit there knowing he spent his only level 5 spell slot to get his elemental to take away his magical book. He never sees either one ever again. \n\nCan still see the look of that sudden sad realization on his face. ",
        "created_utc": 1538209174,
        "upvote_ratio": ""
    },
    {
        "title": "Dark Lord Lyons: The Ravisher of Women and Consort of Unholy Beasts",
        "author": "Splyth",
        "url": "https://www.reddit.com/r/gametales/comments/9jsqtc/dark_lord_lyons_the_ravisher_of_women_and_consort/",
        "text": "WARNING: Reign of Winter Spoilers!\nDespite the title nothing truly that bad happens. promise\n\n\n\nHello again traveler. I shall continue the saga of how the great and noble paladin become known as the scourge of the planes. click [here](https://www.reddit.com/r/gametales/comments/9dvonm/dark_lord_lyons_the_beginning/) for the beginning of this tale.\n\nWhen we last left our heroes they had seen Lyons behead a defenseless man. With the words \"A bargain I made, a bargain I will keep\"\n\nThe room was in shock. This \"righteous\" man had killed an innocent. Without trial and, seemingly, without remorse. Lyons tried to explain himself. But the villagers of Waldsby would not have it! \"He's was no savior!\" One cried. \"Another warlord methinks!\" shouted another. \n\nHe was exiled from Waldsby. The party, grudgingly, followed.\n\nThey made haste to White Throne, and Nazhena. But no man can long outrun rumors. Soon everyone they met knew of the False Paladin Lyons. \n\nLyons did his best to spare the lives of those who'd attack him. But that only made the problem worse. See the rest of the party had struck upon an idea. Traveling with a paladin was fine, but traveling with a tyrant was better. So every time Lyons let a vagabond live or a soul go. The rest of the party was casting illusions or whispering horrible tales in to the prisoner's ears before they were set free.\n\nBy the time they reached WhiteThrone, people were on the lookout for this new tyrant. Wanted posters bore his name and face. The rumors claimed 300 dead by his hand. \n\nThe party knew that to approach was suicide. However Lyons still had the Rempelt, a magic cloak which allowed him to pose as a Winter Wolf in human form. He donned it and his hair became like snow and his eyes a cold blue. And so they approached the town without incident.\n\nOr *almost* without incident. A guard stopped them. Another humanoid winter wolf. She beckoned Lyons aside. She was called Greta and she had taken a liking to this new tall and handsome Winter Wolf.\n\nShe invited him to dinner...alone...at her house. Lyons, fearing that angering her would expose their ruse, agreed.\n\nOnce the party heard of this they howled with laughter. They implored him go. They would continue the search for Baba Yaga and her dancing hut.\n\nLyons, having little choice in the matter, went. And things went far better and far far worse than he dared hope. He and Greta hit it off immediately then well... I assume you can guess. However afterwards Greta decided that he was her mate, and the two of them were to form a new pack.\n\nEven worse, by now the rumors had now been stoked to an even greater height by the party. Consort of unholy beasts, ravisher of women, and by now the death toll topped 400 with one orphanage burned for good measure.\n\nBut I fear this has gone on far too long already. I shall save it for another time.  ",
        "created_utc": 1538184870,
        "upvote_ratio": ""
    },
    {
        "title": "Curse of Strahd Adventure Log - The Immigrants - Part 7: Turmoil",
        "author": "mylonpruett",
        "url": "https://www.reddit.com/r/gametales/comments/9jrhrr/curse_of_strahd_adventure_log_the_immigrants_part/",
        "text": "**Part 7 of the Curse of Strahd Adventure Log. If you want to read earlier logs I post all of it at** [CoS Adventure Log](https://theimmigrants.obsidianportal.com/wikis/home-page)\n\nAfter the recent confrontation with Strahd, and each other, at the bridge the party moved along in tense silence for over an hour. No one muttered a word as they plodded on contemplating recent events. Strahd had left them feeling shame, frustration, fury, and hopelessness; he had bested them physically and mentally without every really doing anything. Strahd never attacked them in force, he simply spoke to them, weaving doubt and fear with his words and gestures, and when Ismark had finally attacked Strahd, a chuckle and simple wave of the hand had ended Ismark’s threat. To make matters even worse, Ireena still seemed to be charmed by Strahd and would occasionally comment about how he would know what do to and could make everything better again. The silence, with the exception of Ireena, continued for over an hour until a fork in the road forced everyone to start acting as a group again.\n\nThey had reached a signpost that pointed in three directions. Nearby was an empty gallows that creaked in the cold wind and a small graveyard covered in a low ground fog. The signpost listed Barovia Village to the east, back the way they had come, Tser Pool to the northwest, following a path that sloped downward into the trees, and Ravenloft/Vallaki to the southwest up a winding slope that continued to climb in elevation. The group knew that, with the delay imposed on them by Strahd, there was no way they would make it to Vallaki before nightfall. As they discussed their possible options Ismark, begrudgingly, told them that sometimes Vistani were known to make camp at the Tser pool but if they weren’t there today they would be even further behind as they would have to make their way back to this point. Given all the options the group found themselves at a loss. They didn’t want to be stuck outside after dark, but they also weren’t sure that the Vistani and their wagons would be there. Someone even mentioned that they could return to Barovia and try again the following day. The group considered, and discussed, and debated, and then debated even more.\n\nWhile all this went on Esmé grew a bit bored and began to survey their surroundings, or at least their surroundings within 60 feet, as her eyes were still missing. As she scanned the surrounding area she noticed that 6 of the graves in the graveyard were freshly dug and one had her name chiseled on it. Disturbingly, there was a grave for each of them: Potens, Esmé, Aelin, Pent, Able, and even Ismark; the only one missing a grave was Ireena. Upon pointing the graves out to the rest of the group they all concluded which direction to travel remarkably quickly. Wanting to get as far away from the graves as possible, they picked up their gear and moved up the southwestern road towards Ravenloft and Vallaki. Just as they started to move away from the crossroads they all heard a terrible creak from the gallows behind them. With an expectant groan, Pent and Aelin turned to find, as expected, the corpse of Aelin swinging from the gallows. Pent shouted out to the land around him to leave his wife alone and stormed off down the road, with the rest of the party following closely behind.\n\nNot long after leaving the gallows, Esmé noticed movement at the very edges of her vision in the woods nearby. Something was out there, watching them. It looked wolf like, yet somehow different, it wasn’t just a larger wolf, like the two that had accompanied Strahd. It seemed more cunning as well, any time Esmè tried to point it out to her companions the wolf thing would slip off into the trees. But it always returned, and it was definitely following them. Esmè continued so spot the creature following them as they moved ever westward, winding through the tree covered countryside. After several hours of travel the group came to yet another fork in the road, this time however, the decision was an easy one. The sign pointing west bore the name of Vallaki, the sign pointing to an old cobblestone road read Ravenloft; the group quickly moved on towards Vallaki. A short time later they found themselves passing through a familiar set of massive stone gates. They had come through a different set of these gates when they enter Barovia over a week ago. Here however, the statues maintained their heads, and stared out across the land with faces set in a stern vigil.\n\nWith afternoon behind them the group once again began discussing the plan for the evening. They talked about trying to pick up the pace and move to Vallaki as quickly as possible, though they knew they would still arrive after dark. Unless they found unexpected shelter the only other alternative seemed to be to camp in the wilds of Barovia at night. As if in response to their plight the group spotted a windmill several miles in the distance. As the road to Vallaki wound its way in the general direction of the windmill, the group was able to get a better look at it and it appeared to be abandoned. The windmill clearly wasn’t turning despite the cold wind blowing from the north and they could see no signs of activity in the area. They decided that they would seek shelter in the windmill for the night and set out for Vallaki in the morning. As they approached the front of the windmill discussing plans for the evening they were startled when a voice called out from inside the windmill demanding to know who was there and what they wanted. The windmill was clearly not abandoned.\n\nHoping that the occupant would allow them entrance they asked if they would be able to stay the night there and were promptly told no. From behind a closed door the woman inside called out that Barovia was no place for allowing strangers into one’s home and they would need to be on their way if they weren’t here to buy cookies. As it so happened, the resident of the windmill was the woman they had bought the cookies from in Barovia. Knowing the urgency of their situation, and wanting anything other than to be left out in the dark, Pent and Able set about negotiating some trade to let them stay there for the night. After some discussion it was agreed that in exchange for a single night of rest in the windmill, the group would fix the windmill, after getting one of their friends to Vallaki. The woman was curiously very specific on the phrasing as well, finally directing her question, still through a closed door, at Able. She asked, **“In exchange for one night of rest for you and your friends, you swear to return and fix my windmill, providing the supplies yourselves, as soon as you escort your friends to the village of Vallaki, and before taking on any other tasks. Do you swear?”** Able agreed. Upon the agreement being struck the woman told them that she would need some time to prepare the windmill for the group as it was a bakery and she wasn’t used to having guests. Finally, after an hour of waiting, the front door of the windmill opened.\n\nThe woman clearly stated that they were not invited in but if they could cross the threshold without an invitation then she would be fine with them spending the night and once they were all inside she explained you could never be too careful with so many vampires about. The group found a charming little bakery with sleeping pads scattered throughout the room, the woman said that she had left a cookie for each of them and that she would see them all on the morrow, and with that she quickly headed upstairs. The group settled down for the evening and after a quick dinner Ireena mentioned that she had seen these cookies being sold in town and had actually considered trying them herself, to which Ismark noticeably disagreed. Together they explained that the cookies were supposed to help take the eaters mind off of the terror of this land, it helped one sleep soundly and dream of happier places and better days. However, they were also rather addictive, and more than one townsfolk had sold everything they had in an attempt to maintain their mental escape from the hell that was Barovia. Other than that, the cookies were not known to cause any physical problems. Aelin, Pent, and Potens decided to try a cookie and after a few minutes fell soundly asleep and dreamt of happy days and better places. The rest of the group abstained from the “drug cookies” (as the group named them), barricaded the door and fell asleep for the night, hoping that the walls of the windmill would keep them safe.\n\nSafe they slept and woke the next morning refreshed, some more than others. It seemed that Aelin, Pent and Potens had all slept remarkably soundly and felt invigorated upon waking. As they all prepared to leave Pent spoke with the owner of the windmill and asked to see the damage to the windmill up on the second floor in order to assess the damages and determine what they would need to fix it. Begrudgingly, and with more than a few complaints, she led Pent up to the second floor where he found a large millstone in the center of the room with flour scattered all around the area. The central pillar of the windmill was heavily fractured half way to the ceiling and would need to be replaced, in the meantime the woman had been hand turning the mill to grind flour. Having assessed the damage Pent turned to go when he noticed that one of the baker’s aprons hanging on the wall was caked with blood. Pent said nothing and returned to the group to leave. As they all opened the door of the windmill to head towards Vallaki they found a message carved into the front of the door, **“Ireena will be mine.”** While most of the group found this disturbing, Ireena seemed almost hopeful that her good friend Strahd would show up to help them soon. The group groaned and moved on.\n\nOnce they were out of earshot of the windmill Pent told them about the bloody apron he had found. There was something definitely wrong with this place. They all decided that they really couldn’t leave this place unattended and headed back to the windmill. Esmé, using their natural ability to hide, and Potens, using his familiar and his magics, took it upon themselves to scout out the windmill while the rest of the party huddled around the side of the building in case a fight ensued. As they scouted out the situation, Potens made more than a little noise and heard several voices call out from within. Based on the sudden yelling, shouting, crude obscenities, and general nastiness they realized that there were, in fact, three women staying in the tower. Two sisters named Bella Sunbane and Offalia Wormwiggle, and their mother. They clearly didn’t like each other, the mother belittled them and threatened to eat them if they didn’t do what she asked, the sisters argued like bitter rivals even about little details, at one point going to far as to threaten to murder each other in their sleep. The women, and the group was beginning to suspect they were more than just women, were clearly very fucked up.\n\nAs the women became aware that someone was outside their home Esmé watched through a window as one of them disappeared for several minutes only to reappear and report that there were indeed a group of people huddled outside their tower and that they appeared to be up to no good. The mother decided to just ignore them and hope they would go away, after all if they didn’t, she said, the three of them would just kill them and eat the intruders. As time passed, one of the sisters would periodically vanish for some time and then reappear to report on the party. Eventually the group decided that they couldn’t just sit around forever and formulated a plan. Esmé would stay hidden, the casters would stay 30 feet from the front door, and the martial characters would flank the door, and everyone would ambush the women when they came out. To kick off the fight Potens sent a stone flying through one of the dirty windows. A slew of profanity followed and then Esmé watched as all 3 women simple vanished. The group waited in anticipation for the women to burst forth from the door. Instead they simply appeared surrounding the party and all cast sleep.\n\nWhat the women didn’t count out was that Aelin and Pent were of elvish decent, and so immune to sleep, Esmé was still hiding, and Ismark and Able were too hearty to fall to so simple of a spell. In their opening surprise volley the three women only managed to put two of the party to sleep. With their three targets so spread out the party began their assault and the battle was joined. Ismark and Able chased the women around the battlefield while most of the party launched ranged attacks against them. The women responded by hurling spells at the party, interspersed with plenty of profanity, putting several party members to sleep and practically killing Ismark. Whenever Ismark or Able managed to close on one of the women they would vanish and reappear a few moments later several yards away. This infuriating tactic was exceptionally successful as it left Able spending most of his time running from one place to another in an attempt to hit the women. With two of the party dying and another two of the group asleep things weren’t going well; at least until Aelin stepped up. With a single spell she healed every member of the group and brought both of the fallen members back to consciousness, and with that one act the tide of battle turned. The women could no long keep away from the group as the party began focusing their attacks on one woman at a time. As one of the daughters finally began to show significant wounds the mother screamed at her, **“Offalia Wormwiggle, if you fucking die and I have to eat another baby to reform the coven I will haunt your pathetic soul until the end of time.”** Upon hearing this, the daughter simply vanished, and the groups suspicions were all but confirmed; they were clearly facing a coven of hags.\n\nWith the tide of battle clearly in their favor the group refocused their efforts on the remaining two hag women and soon after, the second daughter vanished as her wounds began to show. The mother was in a fury; her two daughters had been forced to flee, several of the group seemed to be resisting many of her spells, thanks to the mental acuity the cookies have given them, and the remaining party members were closing in. This was clearly a fight she could no longer win. As she vanished she simply screamed at them, “**I hope you enjoyed eating little Timmy, his batch was especially delicious.”**\n\nHorror dawned on the faces of Potens, Pent and Aelin at the implications of what the hag had told them before she fled set in. They healed their wounds and entered the windmill in search of evidence of the horrors that may have been committed there. As they opened the front door a different scene than that of the prior night greeted them. It was still a bakery but caked with filth and blood, all manner of cooking items were strewn haphazardly about the room, and a sickly-sweet burnt odor permeated the place. Most disturbing of all was a cabinet they discovered in a corner that contained several locks of human hair. Each lock had a label next to it with a name, date, and batch number. The most recent read Timothy Canter / 11.26 / Batch 587. Aelin, Pent, and Aelin had eaten children, or at least cookies made with children. They continued upwards in the windmill until finally, on the top floor they found two children locked in cages and freed them from their captivity. Once Aelin and Esmé were able to calm them down they told them their names were Freek and Myrtle. They were also able to explain that the women ate children and ground their bones into dust to make cookies with them, they knew this because the woman constantly reminded the children that one day they would be next. Freek and Myrtle were both from the town of Barovia but refused to go back there as their parents were the ones that traded them to the hags in exchange for more dream cookies.\n\nWith the full depths of the hag’s depravity revealed the group decided that they had to do anything they could to stop this from happening again. They promised to take the children with them to Vallaki and then set fire to the inside of the tower. While the stone would not burn they would at least reduce it to a mere shell of a building. With the windmill consumed in flames, the group of 9 now made their way towards Vallaki.\n\nThey hadn’t won the fight with the hags, but they hadn’t died either. As the windmill burned behind them Able remembered the vow he had made with a hag; they all knew that they hadn’t seen the last of the coven.",
        "created_utc": 1538173851,
        "upvote_ratio": ""
    },
    {
        "title": "A Bard doing Bard things",
        "author": "Greatnesstro",
        "url": "https://www.reddit.com/r/gametales/comments/9jowd5/a_bard_doing_bard_things/",
        "text": "I posted this on r/DungeonsAndDragons, but thought y’all might like it to.\n\nI play a Bard in a 5th Ed game. We encountered a group of 12 ambassadors trying to negotiate the end of a civil war. Although we’re not exactly murder hobos, the party hadn’t come up against a mostly political challenge. So I came up with a plan. I wrote and performed this rap in a meeting between the ambassadors.\n\n“All I see is an issue of succession\n\nBut not one side is interested with concession\n\nBut believe you me \n\nno one wants to see \n\nthe people of these land’s oppression\n\nIt would be wise that you realize \n\nwhoever wins the prize\n\nNo one win possession\n\nThe only real play\n\nThe real gateway\n\nIs to do away \n\nwith transgression\n\nI know you can’t choose\n\nAnd what you got to lose, \n\nMaybe It’s Time to question\n\n*prestidigitation of “A COUNCIL OF KINGS!” over my head*\n\nIt’s a brand new day\n\nLet Democracy light the way\n\nIt will benefit the rich and poor\n\nLet’s fight no more\n\nLet go of the score\n\nAnd let’s end the horrible civil war!”\n\nIt’s important to note I have no musical background, nor am I particularly into rap myself. It went over very well, winning over all the ambassadors. ",
        "created_utc": 1538155171,
        "upvote_ratio": ""
    },
    {
        "title": "Cantankerous Zhou",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/gametales/comments/9jnhq4/cantankerous_zhou/",
        "text": "[deleted]",
        "created_utc": 1538145376,
        "upvote_ratio": ""
    },
    {
        "title": "[World of Darkness] When too many plots involving the God of the Underworld clash and everything goes to Hades in a handbasket (A Change of Heart Ch 20)",
        "author": "adartagnan",
        "url": "https://www.reddit.com/r/gametales/comments/9jmuf2/world_of_darkness_when_too_many_plots_involving/",
        "text": "&amp;#x200B;\n\nhttps://i.redd.it/i9f6wjc07zo11.png\n\n[Chapter 20](https://arianedartagnan.wordpress.com/2018/09/28/a-change-of-heart-chapter-20/) is up, in which all the plots against or involving Hades, the God of the Underworld, finally happen.  And Marina learns that NPC's don't always tell you the truth.\n\nFirst there's Marina's plot with the godlings to extract Hades' knowledge of the paths to the Underworld, which will supposedly cure the magical Plague.  And then there's Marina's plot with Demeter to free Persephone from the Underworld, which will supposedly cure the magical Plague.  And finally there's Ynez's plot with Hades to shove the goddess Hestia into Tartarus, which will supposedly also cure the magical Plague.\n\nSurprise!  It turns out that Persephone's child *is* the Plague itself, and that the godlings are helping the party's foster mother accumulate arcane knowledge so she can Ascend to a higher realm.  Persephone starts flooding Athens with Plague, and the godlings and foster mother steal all Hades' powers and Ascend.\n\nSo after all that planning, the party still hasn't fixed the Plague.\n\nThe table of contents is [here](https://arianedartagnan.wordpress.com/rpg-tales/a-change-of-heart-table-of-contents/).\n\nThe first post is [here](https://www.reddit.com/r/gametales/comments/8genjg/world_of_darkness_a_change_of_heart_chapter_1/).",
        "created_utc": 1538140471,
        "upvote_ratio": ""
    },
    {
        "title": "Ain't Misbehaving",
        "author": "Phizle",
        "url": "https://i.redd.it/juaoaxie3xo11.png",
        "text": "",
        "created_utc": 1538113544,
        "upvote_ratio": ""
    },
    {
        "title": "The Clumsiest Heist",
        "author": "Foxhound631",
        "url": "https://www.reddit.com/r/gametales/comments/9jfqhf/the_clumsiest_heist/",
        "text": "Hey all, long time reader, first time poster, on mobile, yadda yadda yadda.  \n\nBackground: Party of 4, playing 5e D&amp;D. DM upholds the “rule of cool” very strongly, so if some of this doesn’t sound kosher, whoops, oh well. Our group consists of Steinulf, dragonborn paladin; Corvus, kenku rogue; Eilwe, elven monk; and Maritus, human wizard.  \nSteinulf was recently turned from a brass flame dragonborn to an undead white frost dragonborn. He’s not pleased about this, and wants his fire back. The party recently entered a small town in the thick of winter, and noticed that the town maintenance guys use some sort of flamethrower to clear snow drifts. There’s also a drug problem in town, the drug in question is a red powder that has some pretty funky effects.  \nAnd with that, we’re pretty much caught up. It’s early afternoon, Maritus rolled poorly in the bar and is passed out in our quarters in the tavern, drunk. Eilwe is keeping an eye on him. Corvus and Steinulf decide to go on a hunt for some flamethrower fuel, because Steinulf has this wonderful idea involving huffing it and exhaling it as a sort of improvised flame breath. They find a town maintenance guy torching snow, and tail him until he walks into a building and comes out without the flamethrower.  \nThis building, the Mine building, is a large, two-story metal affair overhanging a large ravine. There are cargo platforms suspended from the overhang that go down into the ravine, serving as elevators for the mine. They’re winched up into holes in the floor. The only other entrances are a row of windows on the second floor, and a large industrial door in the front. Corvus spies an open window and climbs on in. He pokes around inside the building for a few minutes, and ends up inside a storeroom with large crates. *A wild Guard appears!* Corvus leaps behind some of the crates to hide. A couple bad rolls and one really good roll later, the guard can’t find him, but definitely heard him. Oh yeah, and he ended up smashing open a crate full of the Red Drug and getting a face full of it. The guard locks the storeroom, then runs off to sound the alert. Corvus has his own personal little freakout session inside.  \n*Cut to Steinulf, moping around outside*  \nSteinulf hears the commotion and decides to go get backup. At the tavern, Maritus is still passed out, and can’t be roused for anything. Eilwe is not pleased, but she comes with.  \nThey stake out the mine building for a few minutes and try to figure out where Corvus is, to no avail. Steinulf  gives up and knocks on the door.  \nA stereotypical eye-slit slides open. \n“Who is it?”   \n“I am... Schteinolff, Private Investigator. And this is my assistant, Oolwey. A guard ran by, and we offered our services to him. He told us to come speak with you.”  \n“...roll for bluff”   \nSteinulf narrowly passes, and is let into the building. The mine foreman tells him how they heard a commotion, and think someone broke into the building, they just can’t find him. He escorts Steinulf and Eilwe around, to the open elevator shaft, the catwalks above, and his office. They eventually end up inside the magazine, where they store the flamethrower fuel and blasting charges for the mine. Steinulf ~~distracts~~ interviews the foreman, while Eilwe walks off to “interview” the guard by the elevator shaft, their chosen patsy. She pulls off a sneaky Illusion of an orc crawling out of the elevator shaft, causing the guard to freak out and run away. The ruckus draws all the other guards in the building to the front door, where Mr. Scared Guard is frantically trying to escape.  \nSteinulf takes the opportunity of being alone in the magazine to steal flamethrower fuel. A little bit of inventory shuffling later, he has a Bag of Holding full of liquid flamethrower fuel, and a rucksack full of the rest of his equipment. At this point, Corvus has sobered up enough to break out of the storeroom. Eilwe grabs him and drags him back to the magazine.  \nWhat happens next is the smoothest unplanned escape known to man. Corvus takes the Bag of Holding (flamethrower fuel) and Eilwe’s Flying Broomstick, and zips out the open elevator shaft to freedom. Steinulf and Eilwe run to the scuffle at the front door. Steinulf shouts “He’s getting away! After him!” Steinulf, Eilwe, and the guards burst out the main door, and quickly lose each other in the streets.  \nEverybody meets up at the tavern that night, for a long lecture from Eilwe about silly things like “planning before we break into places” and “being responsible with flamethrower fuel” and such.  \n\nThanks for reading, this is my first attempt at putting our adventures down on paper. Let me know what you think and if you’d like to hear more. ",
        "created_utc": 1538075346,
        "upvote_ratio": ""
    },
    {
        "title": "Using The Grays in Starfinder",
        "author": "20sidedknight",
        "url": "https://www.reddit.com/r/gametales/comments/9j4d84/using_the_grays_in_starfinder/",
        "text": "Our DM's been using The Grays when we pass through 'Drift Travel' in Starfinder. We didn't know until 3 sessions later that one of the PCs (a Ysoki Mechanic) was kidnapped and replaced by one of these creepy guys and the player was playing as this undercover invader for weeks sabotaging our mission to find a way to explore the Drift. Now we're suspicious of who else this happened to.   \n\n\nIf you don't know what The Grays are or don't play Starfinder, link is context.   \n[https://www.youtube.com/watch?v=330Zxu1nTsY](https://www.youtube.com/watch?v=330Zxu1nTsY)",
        "created_utc": 1537981280,
        "upvote_ratio": ""
    },
    {
        "title": "Wait and See",
        "author": "Phizle",
        "url": "https://i.redd.it/yerzb8khnlo11.png",
        "text": "",
        "created_utc": 1537975111,
        "upvote_ratio": ""
    },
    {
        "title": "[5e Dungeons and Dragons Liveplay] Hyrule Chronicles Episode 15: Feathery Frustrations",
        "author": "ArticulateT",
        "url": "https://soundcloud.com/articulate-t/hyrule-chronicles-episode-15-feathery-frustrations",
        "text": "",
        "created_utc": 1537893821,
        "upvote_ratio": ""
    },
    {
        "title": "A party of 4 slayed an orchish wagon train of 90 orcs plus their chief. (ADND 2E)",
        "author": "Kanaric",
        "url": "https://www.reddit.com/r/gametales/comments/9ijo19/a_party_of_4_slayed_an_orchish_wagon_train_of_90/",
        "text": "A lot of people complain about how deadly ADND 2e is. I haven't had anyone really dying at all. We are using the -10 hp optional rule (ie what 3e uses but it exists in 2e) otherwise we would have had numerous deaths. This fight, a deadly random encounter that the party should have avoided, is something I FOR SURE thought would kill multiple party members. \n\nThe party just got finished killed a pack of ogres, by ambushing them with the druid's call lightning spell, and decided to rest for the night. They try to rest but are awakened by what sounds like wagons and chains. \n\nWhat they find is an orcish wagon train of 6 carts, each with slaves pulling them, and a little over 90 orcs. The orcs haven't spotted the party and were marching to some unknown location. Unknown to them this was a wagon filled with tribute to another tribe and inside was also the chief of the \"Old Woman\" orc clan. We are running The Horde boxset and in the Firepeaks area this was one of the clans which is where I got the name. The chief was an elite female orog. The \"old woman\" the clan is named for. \n\nThe party consists of a druid named Corvus, a halfling thief named Eli, a dwarven fighter/cleric named Furdurak, and a fighter named Darius. They also have a half-ogre NPC fighter named Gromph. \n\nCorvus decides to do his call lightning trick again and begins to try to cast the spell in a hidden area. The party waits to see if they are detected, they are not, and the spell strikes the orc's elite troops killing a large number of them. The party then all charge the archers, who make up the now majority of the force. \n\nThe party charges in, to take advantage of the -4 penalty to hit people who are in melee by archers (all the archers basically need to crit in order to hit at this point combined with the party's other bonuses). Gromph takes 31 damage from one team of archers shooting him. He is healed by the druid. The druid takes 20 something damage as well after he heals and so decides to run in and fight. \n\nAs the party is fighting the elite troops arm themselves with pikes and set up 3 groups of pike phalanx to box the party in where they are fighting. Furdurak casts the spell \"rockburst\", a spell granted by his deity, and slays a large number of them breaking their line. Also he didn't get his by any attack of opportunity on casting that spell. However after he casts that he is brought to -6 hp and falls unconscious. \n\nThe thief is taking advantage of the confusion this whole time to judiciously backstab various orcs then going into hiding. \n\nThey manage to slat a good 1/3 of the archers in melee at this point. Combined with the exploding magic they fail a morale check and begin to flee. \n\nCorvus then heals Furdurak. \n\nThe party then fights the team of veteran orcs and the female Orog jumps out of her caravan angered by the fleeing cowards. The thief then frees some of the prisons who cause further confusion among the remaining orcish soldiers. \n\nThe party then fights the veterans outnumbered 2-1 which is way better than the previous odds but before they charge Furdurak casts command on the Orog to \"kneel\". She kneels and the halfling backstabs her doing considerable damage. She charges at Furdurak who has Gromph helping him. She signals the two orcs attacking the druid to hunt down the halfling who at this point is in serious trouble. \n\nAt this point 10 minutes had passed (1 round = 1 minute in adnd) and Corvus calls a 2nd lightning bolt down on the orcish veterans slaying the Orog and one of the veterans attacking Furdurak. Another veteran is slayed by Furdurak. \n\nThe remaining flee. \n\nThis was like one of those crazy fights from the Goldbox RPGs of the late 80s where you fight 100 orcs and need AOEs to defeat them. The party did well in a fight I thought for sure they would have died. Random encounter and I rolled maximum. \n\nThe party rescued approximately 60 slaves and got around 8000GP worth of loot (mostly in gems) which in 2e at level 4-6 is a king's ransom. ",
        "created_utc": 1537808265,
        "upvote_ratio": ""
    },
    {
        "title": "He may be a Nothic, but I call him Ear Nest (Podcast Episode 3)",
        "author": "notashrimp16",
        "url": "https://www.reddit.com/r/gametales/comments/9ijbai/he_may_be_a_nothic_but_i_call_him_ear_nest/",
        "text": "Tabletop Potluck has a brand new episode of their arc playing Dungeons and Dragons 5th Edition!  Make sure to check it out [\\[here\\]](http://tabletoppotluck.libsyn.com/dd-episode-three-ear-nest)!\n\nIf you haven't heard Episode 2, you can hear it right [here](http://tabletoppotluck.libsyn.com/dd-episode-two-ars-poetica)! \n\n&amp;#x200B;\n\nWe also have a brand new kickstarter up and running! Consider [showing your support](https://kck.st/2wYVDMP) to get your name as an NPC in upcoming arcs!\n\n&amp;#x200B;\n\nFollow us on \n\n[Facebook](http://facebook.com/tabletoppotluck),\n\n[Twitter](http://twitter.com/tabletoppotluck),\n\n[Stitcher](https://www.stitcher.com/podcast/tabletop-potluck?refid=stpr),\n\n[Apple Podcasts](https://itunes.apple.com/us/podcast/id1312897506?ls=1),\n\n[Player FM](https://player.fm/series/tabletop-potluck),\n\nAnd wherever else you get your podcasts!\n\n&amp;#x200B;\n\nDon't forget to rate us and review if you like it! We also have a patreon that you can check out [here](http://patreon.com/tabletoppotluck).  And let us know if we missed something important or if you want to see anything on our show!",
        "created_utc": 1537805876,
        "upvote_ratio": ""
    },
    {
        "title": "Second Languages",
        "author": "Phizle",
        "url": "https://i.redd.it/oyjfkg9mm7o11.png",
        "text": "",
        "created_utc": 1537805254,
        "upvote_ratio": ""
    },
    {
        "title": "Agen Judi Poker Online Uang Asli Terbaik di Indonesia | POKERLIVE77",
        "author": "karimavostaudev",
        "url": "http://pokerlive77.asia",
        "text": "",
        "created_utc": 1537779794,
        "upvote_ratio": ""
    },
    {
        "title": "The Hunters Hunted II \"Corruption\" Chapter 10",
        "author": "TwinCitiesByNight",
        "url": "https://www.reddit.com/r/gametales/comments/9id8dx/the_hunters_hunted_ii_corruption_chapter_10/",
        "text": "Hello Folks,\n\nI bring to you the latest chapter of our The Hunters Hunted II story “Corruption”.\n\nThe group sets up a meeting and plans in case their sense of oncoming danger is real.\n\nThis is a The Hunters Hunted II game that takes place in Washington D.C. in September of 2009. The Hunters Hunted II is a Vampire: the Masquerade 20th Anniversary Edition expansion set in the One World of Darkness. The Hunters Hunted II is published by Onyx Path Publishing (Licensed from White Wolf Publishing).\n\nhttps://soundcloud.com/twin-cities-by-night/episode-206-the-hunters-hunted-ii-corruption-chapter-10\n\nIf you would like to support the podcast stop by our Patreon\nhttps://www.patreon.com/TwinCitiesbyNight\n\nCome by and visit our Discord!\nhttps://discord.gg/T9zeN9p\n\nCheck us out on iTunes:\nhttps://itunes.apple.com/us/podcast/twin-cities-by-night/id1246523585?mt=2\n\nCheck us out on Soundcloud \nhttps://soundcloud.com/twin-cities-by-night\n  \nFind us on Twitter!\nhttps://twitter.com/Twin_Cities_VtM\n\nFind us on Facebook\nhttps://www.facebook.com/TwinCitiesByNight/\n\nFind us on YouTube\nhttps://www.youtube.com/channel/UCBUyj7h-xIhwsM3kHK56SRA\n\nFor more White Wolf RPGs game play and media please check out \nhttps://www.facebook.com/groups/862703457198327\n",
        "created_utc": 1537747174,
        "upvote_ratio": ""
    },
    {
        "title": "Awesome Concrete Conference Table, Boardroom Tables Design and Fabrication",
        "author": "fainakaylerrce",
        "url": "https://designsbyrudy.com/portfolio/concrete-conference-table-design-and-fabrication/",
        "text": "",
        "created_utc": 1537667530,
        "upvote_ratio": ""
    },
    {
        "title": "Old man Henderson",
        "author": "Neknoh",
        "url": "https://www.reddit.com/r/gametales/comments/9i4av8/old_man_henderson/",
        "text": "\" Alright then, I'd like to start by saying that the GM was a bastard that had it coming. \"  \n\n\nIt has been voiceovered and posted in large collection threads, but searching for the name did not bring up any threads where you could read it for yourself.  \n\n\nThis is a legend and there are plenty of people out there who have not yet found it.  \n\n\nEnjoy.  \n\n\n[https://1d4chan.org/wiki/Old\\_Man\\_Henderson](https://1d4chan.org/wiki/Old_Man_Henderson)",
        "created_utc": 1537661187,
        "upvote_ratio": ""
    },
    {
        "title": "Vampire: The Masquerade - Twin Cities by Night \"Dread\" Chapter 25",
        "author": "TwinCitiesByNight",
        "url": "https://www.reddit.com/r/gametales/comments/9i46uf/vampire_the_masquerade_twin_cities_by_night_dread/",
        "text": "Hello Folks,\n\n\nI bring to you the latest chapter of our Vampire: the Masquerade – Twin Cities by Night story “Dread”\n\n\nWilliam meets up with Hardy Ellseworth for drinks and gets a tour of the Twin Cities.\n\n\nThis is a Vampire: the Masquerade Revised Edition game that takes place in the Twin Cities of Minnesota in the summer of 2010. Vampire: the Masquerade is a One World of Darkness game owned by White Wolf Publishing.\n\n\nhttps://soundcloud.com/twin-cities-by-night/episode-205-vampire-the-masquerade-twin-cities-by-night-dread-chapter-25\n\n\nIf you would like to support the podcast stop by our Patreon\nhttps://www.patreon.com/TwinCitiesbyNight\n\n\nCome by and visit our Discord!\nhttps://discord.gg/T9zeN9p\n\n\nCheck us out on iTunes:\nhttps://itunes.apple.com/us/podcast/twin-cities-by-night/id1246523585?mt=2\n\n\nCheck us out on Soundcloud \nhttps://soundcloud.com/twin-cities-by-night\nFind us on Twitter!\nhttps://twitter.com/Twin_Cities_VtM\n\n\nFind us on Facebook\nhttps://www.facebook.com/TwinCitiesByNight/\n\n\nFind us on YouTube\nhttps://www.youtube.com/channel/UCBUyj7h-xIhwsM3kHK56SRA\n\n\nFor more White Wolf RPGs game play and media please check out \nhttps://www.facebook.com/groups/862703457198327\n\n",
        "created_utc": 1537660099,
        "upvote_ratio": ""
    },
    {
        "title": "Anon gets help minmaxing",
        "author": "Phizle",
        "url": "https://i.redd.it/4brcjqw07vn11.png",
        "text": "",
        "created_utc": 1537656484,
        "upvote_ratio": ""
    },
    {
        "title": "In this episode, squabbles over loot and breaking evil weapons irritate our DM.",
        "author": "bishaha",
        "url": "http://newradiomedia-recast.streamguys1.com/content/geektainment/20180921160901-PodquestersEp028.mp4",
        "text": "",
        "created_utc": 1537620179,
        "upvote_ratio": ""
    },
    {
        "title": "[World of Darkness] When the party sets at least two separate traps for the God of the Underworld (A Change of Heart Ch 19)",
        "author": "adartagnan",
        "url": "https://www.reddit.com/r/gametales/comments/9hpu48/world_of_darkness_when_the_party_sets_at_least/",
        "text": "&amp;#x200B;\n\nhttps://i.redd.it/jeg2iipteln11.png\n\n[Chapter 19](https://arianedartagnan.wordpress.com/2018/09/21/a-change-of-heart-chapter-19/) is up, in which the party makes desperate, last-minute preparations for...something.  There are at least two separate plots in motion to trap Hades, the God of the Underworld, which will supposedly set in motion a string of events that will somehow deal with or fix the magical Plague.  \n\nAt least, so Marina believes.  It's really hard to know anything for sure when your opponent has Time magic and can see the future, so you and your co-conspirators refer to every component of the scheme as a \"thing.\"\n\nThe table of contents is [here](https://arianedartagnan.wordpress.com/rpg-tales/a-change-of-heart-table-of-contents/).\n\nThe first post is [here](https://www.reddit.com/r/gametales/comments/8genjg/world_of_darkness_a_change_of_heart_chapter_1/).",
        "created_utc": 1537536290,
        "upvote_ratio": ""
    },
    {
        "title": "[D&amp;D5e] Hooded Lantern Inquiry Pt. 8",
        "author": "w_nightshade",
        "url": "https://www.reddit.com/r/gametales/comments/9hp64x/dd5e_hooded_lantern_inquiry_pt_8/",
        "text": "&gt; Nez, Rickart and Couth (carrying Alice's unconscious body) flee into the forest, along with the cowardly priest who saved Alice, and a group of terrified villagers. Rickart gets swept up by Nez and readies his bow, knowing pursuers are not far behind. Indeed, glimpses of purple through the foliage become a crowd of kobolds and cultists, shouting for the adventurers' blood.  As they steel themselves for the chase, an earth-shattering roar fills the air, and a shadow covers the land... dragon!\n\nOur DM wanted to try something new, so he set up this chase sequence for us, promising a new mechanic that might prove interesting.\n\n&gt; Rickart lets some arrows fly, targeting the nearest cultist.  Nez lets Eldritch Blasts fly behind him, trying to thin the crowd of pursuing villains.  Then a crackling boom sounds, and the dragon's lighting breath strikes, digging channels in the earth and threatening instant death.  The party continues to try to deal with the threats they can, while praying that the next strike from above doesn't end their journey here.\n\nThe DM, on the dragon's turn, used Warhammer scatter dice to determine where the breath strike occurred on our roll20 map, working out who was in range and dealing damage accordingly.  Each turn the breath struck, something died.  Stakes were as serious as possible, and we were genuinely tense and scared.  It worked incredibly well.\n\n&gt; As Rickart peppers his target with arrows, another blast rends the heavens. It strikes the priest, who raises a rod of some kind, emanating a mystical glow.  It holds back the blast... but only for a moment.  He and several of his flock are no more. Unable to process this loss, Rickart hears deep sobs.  They sound like Nez, but from the perch on Nez's shoulders, Rickart can only see grim concentration on the dragonborn's face.  The look does not change as Nez focuses on a cackling kobold and sends a blast of Eldritch energy to wipe the smile off its face.\n\n&gt; Rickart continues to fire arrows at the same cultist, narrowing his focus in order to block out the existential threat surrounding him.  He draws energy to go on from each hit.\n\n&gt; Alice dreams of pie.\n\n&gt; The air crackles as the dragon prepares another blast, and Rickart sees the next few moments play out in awful slow-motion. The blast hits the ground immediately in front of Couth.  In the same instant, Couth's reflexes allowing him to see the inevitable, channels the last of his Qi energy into Alice, while hurling her away from the blast's epicentre.  As Couth and several nearby villagers evaporate into mist, Alice jolts awake - hurt but alive, prone but awake.  She hops up and starts running with the crowd while Rickart tries to shout an explanation.  It is lost in the chaos, but the salient points quickly become obvious to her.\n\nThis was a devastating loss. Couth has been with us since the start of our adventure, and we expected at least a bit of closure with him.  Now we have the joy of informing his family.  Ugh. We tried to save him mechanically, but it was too much like cheating.  Our only fudge was having him save Alice at the last moment, and the Qi dodge was our narrative justification.  He made all the saves to throw her free, so it felt legit enough for us.\n\n&gt; Rickart, knowing he needs to assist Alice, speaks a few words of encouragement to Nez, and leaps from his shoulders onto those of a nearby villager, then to another.  He nearly misses his third jump, but is caught by a befuddled but agile villager. the cultists and kobolds begin grappling with villagers, trying to bring them down and Nez blasts another kobold for his troubles.\n\n&gt; The dragon's lightning sears the air again, this time hitting the very stranger who caught Rickart. Rickart leaps from him to Alice, a narrow escape indeed. Alice catches Rickart as if they had predicted the manoeuvrer, and settles Rickart on her shoulders.  A cultist approaches from behind, but Rickart expertly skewers the assailant in the eye socket, almost nonchalantly. As a unit, they shrug off attempts to grapple them , and they hurtle forward, desperate to get to the safety of the keep.\n\nMade some heft DEX rolls between us, then I rolled natural max damage - sweet!\n\n&gt; The chase seems to continue for a geological age, arrows and eldritch blasts thinning the villains' ranks, swords fighting off attacks, and dragon's hellish fire raining from above, killing the innocent.  Suddenly the keep looms. The moment of relief is shattered when Alice and Rickart are roughly tackled to the ground.  The cultist responsible stalks the prone pair maliciously, but his menace is undercut by Nez's eldritch power knocking him back. Suddenly, a sonorous voice booms, \"You are all beneath me!\" and the shadow of the dragon lifts as it peels away.  The party and the few survivors scramble to the keep's gate, and are let in by the soldiers there.  For now, their ordeal is over... and all they need do is calculate the bloody cost.",
        "created_utc": 1537532092,
        "upvote_ratio": ""
    },
    {
        "title": "A Voice of Reason",
        "author": "Phizle",
        "url": "https://i.redd.it/gtqyd37f2fn11.png",
        "text": "",
        "created_utc": 1537459607,
        "upvote_ratio": ""
    },
    {
        "title": "\"It's *just* a *temporary* petrification.\" [Pathfinder]",
        "author": "SmallJon",
        "url": "https://www.reddit.com/r/gametales/comments/9hbq07/its_just_a_temporary_petrification_pathfinder/",
        "text": "*[A continuation of my previous post](https://www.reddit.com/r/gametales/comments/815wh6/youll_shoot_your_eyes_out_and_the_healers/), current party being: critfisher Samurai, fire Sorcerer, archer Bard (absent this session), dagger Rogue, Earth/Control Wizard (me, replacing my dead Paladin), Shadowdancer Monk (replacing dead Alchemist/Gunslinger).*\n______\nAfter trekking through most of a dungeon, the party arrives at what I presume to be the final boss: some kind of shadow caster. In his last round, the boss hits the Samurai, Rogue, and myself (the wizard) with Prismatic Spray. The Samurai and myself save against insanity, while the Rogue fails, and the Sorcerer kills the boss on her turn. Before I can celebrate the acquisition of my first enemy spellbook, the party has to deal with the permanently confused Rogue. She gets babble her first turn, I successfully identify what's happening, and the Monk hands me a scroll of Heal.\n\nFor both RP and party comp reasons, however, i have no ranks in UMD. The Sorcerer and the Monk both do, but with odds of success only around 50/50: the Bard is our UMD person, so no one felt the need to keep it high. My solution is simple; I will turn the Rogue to stone, we'll wait until the Bard is back with us, then I'll turn her back to flesh and the Bard will use the scroll!\n\nSo as I do a happy dance over a high-level caster's spellbook, the remainder of the party begin looting. Through an item, the Samurai detects an illusion in a near wall, going to investigate. He discovers, behind an illusion, a loose stone. He draws it free...\n\nGM to Samurai: \"What's your HP?\" The Samurai answers. \"Fort save... you're fine.\"\n\nGM to myself: \"Your HP is still [the number you mentioned last round]?\" It is. \"Fort?\" I roll a 15. \n\nGM to table: \"So, the Wizard is dead.\"\n\nGM to Monk: \"HP?\" Reports HP. \"Fort save.\" Rolls.\n\nGM to table: \"Monk's dead too.\"\n\nGM to Sorcerer: \"HP?\" Reports HP. \"Fort save.\" Rolls. \"Failed, but you live, take this much damage.\"\n\nThe stone was inscribed with Symbol of Death. the Samurai saved with his resolve, so the the Monk and my badly wounded Wizard take the damage and die. The Bard is gone today and I was the secondary healer. For the second time, myself and the player of the Monk have our characters killed together by the same thing!\n\nAnd now there's no one alive to use my spellbook and cast Stone to Flesh on the Rogue.",
        "created_utc": 1537412660,
        "upvote_ratio": ""
    },
    {
        "title": "A new 5e podcast; On The Shoulder!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/gametales/comments/9h1cqf/a_new_5e_podcast_on_the_shoulder/",
        "text": "[deleted]",
        "created_utc": 1537324739,
        "upvote_ratio": ""
    },
    {
        "title": "Robot Check",
        "author": "ibbiefarnandut",
        "url": "https://www.amazon.com/Miracle-Moringa-Vitamin-Ointment-Natural/dp/B016X6MJGM",
        "text": "",
        "created_utc": 1537315860,
        "upvote_ratio": ""
    },
    {
        "title": "That one time the players experienced a racial cliche for the first time.",
        "author": "twystoffer",
        "url": "https://www.reddit.com/r/gametales/comments/9h00lf/that_one_time_the_players_experienced_a_racial/",
        "text": "This story takes place during a game I was running that was based off the works of [Brandon Sanderson.](https://www.crafty-games.com/shop/mistborn-adventure-game/)\n\nThis particular part of the story took place on a world called Taldain. The thing about Taldain is it's a tidally locked world in between two stars of a binary system. This is important, because the way the stars and the planet were set up one side of the planet was always daylight and the other a sort of twilight.\n\nThe day side was a hot desert inhabited by a bunch of arabic-like white people, because that star had very little UV radiation.\n\nThe other side however was twilight due the star being dim, but produced a lot of UV and so the people were all very dark skinned.\n\nThe players found themselves on the dark side, and found a city of roughly WW2 level tech but with bioluminescent glowing shit everywhere. They also quickly found out that this place was basically nazi germany and that they stood out like sore thumbs, being an all white party.\n\nEventually they find themselves in The University (there's only one, and it's massive) and in the company of a daysider friendly professor.\n\nProfessor: Wow, you're really well spoken for daysiders. Oh, I don't mean it like that. I don't have a problem with daysiders, in fact, some of my best friends are daysiders.\n\nParty: Ouch. Wow. So *that's* what that feels like.",
        "created_utc": 1537313837,
        "upvote_ratio": ""
    },
    {
        "title": "Have a fun tabletop RPG story you’d like to share? Post an entry below and I might read it live on my radio show at 3 p.m. central! (Details below)",
        "author": "checkforloot",
        "url": "https://www.reddit.com/r/gametales/comments/9gxw4x/have_a_fun_tabletop_rpg_story_youd_like_to_share/",
        "text": "My tabletop RPG talk show, Rolling with the Crunches, is live at 3 p.m. central on EvolutionPOP!\n\nYou can tune in on EvolutionPOP’s Facebook page or their TuneIn Radio channel.\n\nI’m looking for stories to read on a new segment of my show, Topic Treasure! All you have to do is leave the game the story took place in, post a story below (please no cursing or explicit content), and I might read it on my radio show live at 3 p.m. central! \n\n",
        "created_utc": 1537298631,
        "upvote_ratio": ""
    },
    {
        "title": "[D&amp;D 3.5] Whiskers, destroyer of worlds.",
        "author": "Teufel_Barde",
        "url": "https://www.reddit.com/r/gametales/comments/9gxoeq/dd_35_whiskers_destroyer_of_worlds/",
        "text": "A druid in my game decided that he wanted an animal familiar that could get better over time but 'naturally' none of this leveling shit would improve it, so he got himself a tiger cub as his companion, a white tiger we all called whiskers. For all intensive purposes we just used the stats of a normal cat for whiskers and slowly scale him up as time went on throughout the campaign.\n\n&amp;#x200B;\n\nThe setting itself was low arcane magic, high divine magic, lots of religious zealotry, racial bigotry and hatred of anything outside the norm, nature worship was also considered heretical and pagan even if it still produced divine magic. The druid was a green skinned tiefling with orc blood and suffered from multiple personality disorder, switching between personalities at a roll of a dice every day, or whenever the player couldn't make it to a session, compared to everyone else, he stuck out like a sore thumb. Everyone just decided it would be better if he pretended to be an old medicine women, using burlap sacks as a sort of makeshift disguise when they had to go into a small farming town to get supplies and a place to stay the night because werewolves were a common problem after night outside the wooden barricaded walls.\n\n&amp;#x200B;\n\nOnce behind the big gate and in the local inn, things took a turn for the worse when the druid tried to steal from a guy by the fire and got his sack robe lit up by the fireplace (he took this so he could pick pocket the guy successfully anyway). The rest of the gang tried to put it out but one of the peasants threw ale at him to put it out, the druid then pulled back the hood to yell at him...only realizing what he had just done a second after. The whole inn broke out into a massive brawl with a bunch of low level peasants against the party, lethal weaponry was off limits in their eyes, so it was fists and none lethal magic only, this was the case for everyone, except whiskers.\n\n&amp;#x200B;\n\nThe first round went by and whiskers had ripped out the throats of two people, his bristled fur bathed in blood and the taste of flesh on his tongue, each following round saw a similar result, as whiskers was able to deal at minimum 4 HP due to his bonuses as a druids companion and natural cat stats. the floor was painted in gore by the time the peasants were actively trying to escape, all because this cat was able to dish out a maximum of three killing blows per turn against peasants with only 5 HP each.\n\n&amp;#x200B;\n\nAfter that little fiasco they left the village post haste, werewolves be damned and made a desperate run towards the capital under the cover of night, whiskers belly was full that day, but his taste for blood had yet to be truly sated.\n\n&amp;#x200B;\n\nJump forward several in campaign months and whiskers was now a fully matured tiger, sporting a beefy stat block for his race. The party were dungeon delving into the basement of a radical priests church, uncovering the true worshipping area of a dark god in the process. Things were going well until one of them decided to try and release a bunch of exceedingly gaunt and withered figures locked inside cells, a shame they had failed their perception check critically, or they might have noticed they were ghouls. In a fight of twenty against five, the party was really pushed to their limit, the sorcerer dropped dead first, followed by the bard who was knocked out after calling down a flight of stairs, slowly working the numbers down to just the druid and Whiskers, then only the tiger remained.\n\n&amp;#x200B;\n\nWe legitimately thought there was going to be a TPK that night, a single tiger against seven ghouls? No chance, for the ghouls that is. Whiskers started by disembowling two of them in the first round and managing to avoid every attack they tossed his way with his cat like grace, crushing the skull of a third between his jaws the following round, ignoring the few hitpoints of damage he took as he savoured the jerky like taste. One by one they fell, leaving just the final ghoul who made an attempt to run...There was no outrunning whiskers. Pounced and pinned from behind, the big floof ball rended the ghoul limb from limb, depositing the corpses on a pile before his master.\n\n&amp;#x200B;\n\nThis is from my most recent campaign, and after last night, whiskers is now more deadly than ever...scrimshawed enchanting on tiger claws might be a big mistake on my part in terms of balancing, but I cannot wait to see how many more bodies pile up underneath this deadly fur ball.",
        "created_utc": 1537297147,
        "upvote_ratio": ""
    },
    {
        "title": "When the audience tells you to kill off a beloved party member, you listen to them no matter how painful.",
        "author": "bishaha",
        "url": "https://v.redd.it/ohtma32361n11",
        "text": "",
        "created_utc": 1537291135,
        "upvote_ratio": ""
    },
    {
        "title": "The PCs Kill the Villiam with Metagaming",
        "author": "Phizle",
        "url": "https://i.redd.it/u0a68oflg0n11.png",
        "text": "",
        "created_utc": 1537282597,
        "upvote_ratio": ""
    },
    {
        "title": "The Party Fights the Alien Menace",
        "author": "Phizle",
        "url": "https://i.redd.it/zdokwtnv7tm11.png",
        "text": "",
        "created_utc": 1537195069,
        "upvote_ratio": ""
    },
    {
        "title": "Changeling: The Lost - \"Vanity\" Chapter 24",
        "author": "TwinCitiesByNight",
        "url": "https://www.reddit.com/r/gametales/comments/9gfn2r/changeling_the_lost_vanity_chapter_24/",
        "text": "Hello Folks,\n\nI bring to you the latest chapter of our Changeling: the Lost story “Vanity”\n\nKatrina tries something she found, Raymond finds a new purpose, and Frank fights off intruders and learns some of Charlie’s secrets.\n\nhttps://soundcloud.com/twin-cities-by-night/episode-202-changeling-the-lost-vanity-chapter-24\n\nThis is a Changeling: the Lost game that takes place in Fort Lauderdale, Florida in 1993. Changeling: The Lost is a Chronicles of Darkness game published by Onyx Path Publishing (Licensed from White Wolf Publishing)\n\nPlease subscribe and review the podcasts if you enjoy them.\n\nCome by and visit our Discord!\nhttps://discord.gg/T9zeN9p\n\nCheck us out on iTunes:\nhttps://itunes.apple.com/us/podcast/twin-cities-by-night/id1246523585?mt=2\n\nCheck us out on Soundcloud \nhttps://soundcloud.com/twin-cities-by-night\n  \nFind us on Twitter!\nhttps://twitter.com/Twin_Cities_VtM\n\nFind us on Facebook\nhttps://www.facebook.com/TwinCitiesByNight/\n\nFind us on YouTube\nhttps://www.youtube.com/channel/UCBUyj7h-xIhwsM3kHK56SRA\n\nFor more White Wolf RPGs game play and media please check out \nhttps://www.facebook.com/groups/862703457198327\n",
        "created_utc": 1537143853,
        "upvote_ratio": ""
    },
    {
        "title": "Part two of our DnD live show at Michigan Comic con",
        "author": "bishaha",
        "url": "http://newradiomedia-recast.streamguys1.com/content/geektainment/20180913142556-PodquestersEp027.mp4",
        "text": "",
        "created_utc": 1537106399,
        "upvote_ratio": ""
    },
    {
        "title": "Coffee Subscriptions Canada | Detour Coffee Roasters",
        "author": "bethanyhhswinde",
        "url": "https://detourcoffee.com/collections/coffee-subscriptions-canada",
        "text": "",
        "created_utc": 1537050590,
        "upvote_ratio": ""
    },
    {
        "title": "[5e] Two Gnomes in a Trench Coat II: World Domination",
        "author": "TheReginator",
        "url": "https://www.reddit.com/r/gametales/comments/9g3ufz/5e_two_gnomes_in_a_trench_coat_ii_world_domination/",
        "text": "Be me, [Victor Czernov](https://www.reddit.com/r/DnDGreentext/comments/8mn1ag/dd_5e_i_hid_my_actual_character_from_the_party/), blood mage extraordinaire. Also secretly two gnomes.\n\nPlayer of Nightbane moved states, his role in the party has been taken over by DMPC.\n\nDMPC is a deliveryman for a vampire clan. More specifically, the same clan that Victor has bad blood with, as per his backstory.\n\nVictor and Rho accompany DMPC back to the vampire lair, where Victor convinces the headmistress to close old wounds and allow him to serve the clan once more. See, Victor used to be something of an enchantment contractor for the clan until he killed one of its members (who was dangerously close to uncovering his terrible secret).\n\nHeadmistress agrees, but only in exchange for double the vampires lost.\n\nVictor accepts the counteroffer, and he and Rho get formally inducted into the clan, by, you know, getting vamped.\n\nRho uses his vampire salary to get some new swords. Victor goes to a butcher and buys many meats to affix to Meaty.\n\nMeaty is now large enough to ride.\n\nUndertake a series of low-profile missions for the clan. Victor is content, as these connections are allowing him to become more powerful with blood magic than ever before.\n\nEnd up at a small coastal town permanently shrouded by a supernatural fog. This intrigues Victor, who begins investigating its source. The first clue is a headless body in the basement of the inn.\n\nVictor raises his corpse, then goes out to get him a helmet to make him more inconspicuous.\n\nWalk into the blacksmith and cast Hold Person on the shopkeeper, then just take a greathelm and a sword.\n\nMake a quick pit-stop at the local church, put on the helmet, and use many illusion spells to appear as a valiant paladin.\n\nConvince the priest to give me several flasks of holy water.\n\nErrands done, Victor returns to the inn, and armors the zombie. Rho affectionately names him \"Chuck\".\n\nWhile investigating further, Victor, Rho, and DMPC are ambushed by cultists and punched into unconsciousness.\n\nThe three wake up in a prison cell. Victor is pissed.\n\nBreak out of prison by having Rho stick his arm through the steel bars then casting a Resilient Sphere on him.\n\nKill a guard, a strange fishfolk that the cultists appear to worship.\n\nUse Illusion to appear as one, then escort Rho and DMPC out of the prison with deception and creative usage of Private Sanctum.\n\nTurns out the prison is on a boat. Victor bars the doors and sets it on fire, watching it burn until it sinks into the harbor.\n\nManiacalcackle.exe\n\nFight more fishfolk that come out of the ocean, then raise their corpses and order them to purge the town. Leave none alive.\n\nVictor uses a bunch of short rests to keep casting Animate Undead, creating a snowball effect of zombies that eventually overwhelm the town. He then sets it alight as he leads his undead horde out of the city.\n\nOrder the zombies to capture some of the townsfolk alive, then kill them just before arriving back to the vampire lair.\n\nTell the headmistress that a town that would seek to harm the clan has been destroyed. She throws a feast in our honor.\n\nVictor stands up in front of the vampire assembly and gives a toast to this great victory, holding his goblet of blood high and quaffing it.\n\nPass a note to the DM: *The new blood is spiked with the holy water.*\n\nAll the vampires present drink.\n\nAll the vampires present die.\n\nVictor takes off his mask to reveal that he and his non-vamp lower half had switched places earlier.\n\n[MFW](https://i.imgur.com/I86Rj8g.gif) I am now the most powerful vampire in existence, even if it's by a technicality.",
        "created_utc": 1537036731,
        "upvote_ratio": ""
    },
    {
        "title": "The PCs Don't Screw it Up",
        "author": "Phizle",
        "url": "https://i.redd.it/n9eaewfqhfm11.png",
        "text": "",
        "created_utc": 1537029357,
        "upvote_ratio": ""
    },
    {
        "title": "Dark Lord Lyons: The Killer of Men",
        "author": "Splyth",
        "url": "https://www.reddit.com/r/gametales/comments/9g2cnz/dark_lord_lyons_the_killer_of_men/",
        "text": "WARNING Reign of Winter Spoilers\n\n[previous](https://www.reddit.com/r/gametales/comments/9dvonm/dark_lord_lyons_the_beginning/?utm_source=reddit-android)\n\nHello again traveller. I am here to continue the story of how a great and noble paladin became known as one of the most feared evil overlords to ever roam the planes.\n\nWe pick up with our heroes a few days ride from Waldsby; The last known location of the evil winter witch Nazhena.\n\nWe met a local guide native to Waldsby. She hates Nazhena for taking her daughter from her, and forcing her to supply a huge tithe a food to get her back. She has agreed to help us if we can get her daughter back.\n\nAnd so led by our new Ally we ventured towards the town. Unbeknownst to our heroes we had caught the eye of a pair of hungry looking eyes.\n\nAN ATTACK! The wolves were upon us! Led by a ferocious leader. A massive wolf of pure white save for the dried blood around his snot. His eyes, one the color of icy death the other the color of fresh blood.\n\nOur heroes fended the beasts off. But the leader had his eyes on Lyons. With a snarl he snapped his jaws and Lyons was soon on the verge of death. However at the last minute his allies managed to batter the other beasts into submission, and ran to his rescue.  With a mighty roar the beast fell.\n\nTheir guide examined the corpse and told them an old legend. One who wears the pelt of a winter wolf whose eyes were the color of blood and ice is blessed with the powers of the winter wolf. \n\nThey decided that true or no it was to good an opportunity to pass up. So they made a cloak of it and drew lots, Lyons won. And it was said that as he donned it his eyes became an icy blue, his scent became that if a wolf, and his hair became unnaturally white.\n\nAnd finally they arrived at Waldsby. Our guide cursed. Nazhena had gone. But she had left behind a Garrison and our guide's daughter. As a cursed doll that tried to murder her mother. After besting the doll that tried to murder us in the night. We were left with the garrison. \n\nThe doll had told us they we're holding our guide's uncle as well as the other villagers. We decided that Lyons, not being a stealthy sort, was to challenge them and draw them away whilst the rest of our heroes snuck in to free the prisoners.\n\nAnd so they split and the plan went well. Lyons proved to be more than a match for these lowly men at arms. The rest of the party did even better managing to capture the captain.\n\nSo we reconvened. The captain was bound but was refusing to divulge the location of Nazhena.\n\nFearing for their safety the party decided to free the prisoners but were loath to leave the captain alone.\n\nLyons voulenteered to stay with the captain. The party agreed. And so Lyons began trying his hand at talking to the captain.\n\nThe captain told him that torture is pointless. There was a sliver of ice in his body, that if he told us anything it would begin burrowing towards his heart. And even if he didn't Nazhena would probably kill him regardless.\n\nHearing his plight Lyons felt sympathy for this man, and offered him the only succor he could.\n\n\"Speak and I shall end your suffering quickly\" he said. The captain told them the location of Nazhena. The Pale Tower. The seat of power of Baba Yaga's daughter Elvanna. Nazhena's grandmother. \n\n\"Thank you, a bargain I made a bargain I will keep\" Lyons then beheaded the man... Right in front of the party and prisoners who only heard the last line and saw the beheading.\n\n\nAnd thus began the start of the legend of Dark Lord Lyons",
        "created_utc": 1537025646,
        "upvote_ratio": ""
    },
    {
        "title": "BBEG kills own daughter",
        "author": "Phizle",
        "url": "https://i.redd.it/8clvie98x7m11.png",
        "text": "",
        "created_utc": 1536939820,
        "upvote_ratio": ""
    },
    {
        "title": "[World of Darkness] When your local friendly Spanish Inquisitor just makes everything so much worse (A Change of Heart Ch 18)",
        "author": "adartagnan",
        "url": "https://www.reddit.com/r/gametales/comments/9frz39/world_of_darkness_when_your_local_friendly/",
        "text": "&amp;#x200B;\n\nhttps://i.redd.it/svdo3z57d7m11.png\n\n[Chapter 18](https://arianedartagnan.wordpress.com/2018/09/14/a-change-of-heart-chapter-18/) is up, in which the Spanish Inquisition shows up right after the party (mostly accidentally) kills yet another high-ranking mage.  But Inquisitor Zoe isn't there to charge anyone with witchcraft or even arrest Marina for attacking her (also sort of accidentally) in owl form earlier.  No, our friendly local Inquisitor just wants to make sure that her crush Ynez is okay after such traumatizing events!\n\nTo help prevent Ynez from losing control of her wrath and manifesting it as a homicidal bear, Zoe suggests a ritual to \"leash\" it...but of course the bear runs amok.  Then Ghallim, who as usual is pursuing his own goals, channels the goddess of the hearth, Hestia, into it, turning it into a super-bear that murders Zoe.  \n\nAnd then Ynez strikes a devil's bargain with the god of the underworld, handing over Athena in exchange for resurrecting Zoe.  The Paradox backlash from that ritual levels buildings all over the city.\n\nSometimes it seems like Athens would be a lot better off if the party just stopped trying to fix things.\n\nThe first post is [here](https://www.reddit.com/r/gametales/comments/8genjg/world_of_darkness_a_change_of_heart_chapter_1/).\n\nThe table of contents is [here](https://arianedartagnan.wordpress.com/rpg-tales/a-change-of-heart-table-of-contents/).",
        "created_utc": 1536931560,
        "upvote_ratio": ""
    },
    {
        "title": "Adoian Darkeyes",
        "author": "wraith345",
        "url": "https://www.reddit.com/r/gametales/comments/9fm4k3/adoian_darkeyes/",
        "text": "Please tell me what you think of my newest post \n\n&amp;#x200B;\n\n[https://storiesfromrpgs.blogspot.com/2018/09/adoian-darkeyes-part-3.html](https://storiesfromrpgs.blogspot.com/2018/09/adoian-darkeyes-part-3.html)",
        "created_utc": 1536874676,
        "upvote_ratio": ""
    },
    {
        "title": "That crazy rogue - ADND 2e",
        "author": "Kanaric",
        "url": "https://www.reddit.com/r/gametales/comments/9fm0n2/that_crazy_rogue_adnd_2e/",
        "text": "Continuing from [https://www.reddit.com/r/gametales/comments/9asyvs/adnd\\_2e\\_first\\_time\\_running\\_this\\_edition\\_since/](https://www.reddit.com/r/gametales/comments/9asyvs/adnd_2e_first_time_running_this_edition_since/)\n\nOur crazy rogue has had more adventures since then. \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**I Worship Bhall Now**\n\nBhall. Yes, lord of murder.\n\nSome time later the party get to a city I made called Sentinelspire. It's around the former \"Fortress of the Old Man\" from the hordelands set. In a previous campaign a party defeated that cult and tried to found a city there, this is that place some time later where some of the old characters are NPCs. The Fortress used to be a temple of Bhall and is much like the Hashishin fortress Alamut from crusader era folklore. I like central asian and Persia history quite a lot which is why i'm  running this kind of campaign.\n\nThe reason why the players are heading to this city is that they need to destroy an artifact, used by \"The Dead Three\" to ascend to Godhood, in the volcano there as it's \"elemental\" planar vulcanism and therefore what is needed to truly destroy this evil artifact. I previously had a priest of Mystra identify the object and she said if anyone were to use it they would become an Avatar of Bhall. The rogue immediately wanted to use the artifact, because it's a dagger, and thought it would be good for him and his magic item greed. I basically then explained that this artifact would turn his character into a NPC, and a dangerous one, if he were to use it after explaining in character as the Mystra priest as to why that would be a bad idea. I thought he got it.\n\nThe party talks with the Vizier of Sentinelspire, 2nd in command, and he informs them about the Bhall cult. The party asks more about it and it reveals the assassin past of the city and various lore about Bhall. The rogue's player at this point, whose still under contract with Gond, makes it clear that he worships Bhall now and wants his favor. Multiple players on the table give a \"WTF!?\" look. Especially the Lawful Good players. I remind them it was OOC and explain how Bhall is an evil god of assassins. I remind him as well about his pledge to Gond and he's like \"oh\" and drops the topic for now. He whispers to me basically that he still wants to steal the knife. I explain why that would be a bad idea again, warning him clearly, but he still wants to steal it. I'm like \"ok\" and accept it at this point.\n\n**The Mountain and the Secret Note**\n\nThe party then heads into the mountain towards the volcano. They find a knolwedgeable old man living in the mountain as a shepard who tells them about bhall. The rogue then starts going off about Bhall basically revealing how he wants to worship him and become and assassin and all that. This angers the old man of course. The party and the old man see the rogue as naive and all explain how Bhall is evil and how he will not be allowed to continue with the party if he wants to worship Bhall. The rogue backs down and basically says the he didn't know it was a the lord of murder, he just wanted to be an assassin. The good characters of the party all say \"assassination is murder\" etc etc etc. After the arguing and after the party gets a decent way into this dungeon they get to a former temple of Kossuth that is now a temple of Bhall.\n\nAfter this session the Rogue's player takes me aside and describes to me what he wants to do. He think he has some fool proof plan where he can climb down lower than the players and catch this dagger and steal it for himself as the toss it in. I'm like \"how do you think you can get away with this without them knowing?!?\", just totally confused. He's confident he can roll the sneak, climb, and dex checks. His hiding based and climbing based skills are all less than 50%.\n\nNext session was a short one because I had to leave early that day. Basically it was a brief exploration plus a combat, fighting the Bhall priests. The rogue passes me a note of what he wants to do mid-combat basically reiterating what he told me before. The session ended before the party tried destroying the dagger.\n\n**What Happens Next?**\n\nIt isn't 100% clear where or how the party is going to attempt to destroy the dagger. I haven't said everything the rogue has done this whole time, I skipped multiple sessions of the insanity, but at this point the hand holding has been gone for a while now. He almost had the two lawful good preists shun and arrest him seriously in the session immediately before this. He's on a last-chance with them.\n\nThe most likely outcome is that he tries to steal the dagger, fails, and the party sees this.\n\nIt's possible he fails his climbing roll and falls into lava.\n\nOr he steals the dagger, uses it, turns into an avatar of Bhall and then becomes an NPC.\n\nThat is if I even allow it to get this far. He still has that contract with Gond to fulfill. He tried to once but did it in a place that immediately was destroyed, as a DM I reminded him a couple of times but this time i'm going to have him receive a vision that he must fulfill his duties at this temple.\n\nThis will effectively cause him to destroy a temple of Bhall or to rebuke Gond. If he refuses Gond rescinds his earlier gift and summons him back to his realm.\n\nKnowing this rogue he will rebuke Bhall by destroying his temple and rededicating it to Gond and ALSO still take the dagger and still try to worship Bhall and all this will happen anyways. We will see, it's been ridiculous and interesting so far.",
        "created_utc": 1536873872,
        "upvote_ratio": ""
    },
    {
        "title": "A Slippery Slope",
        "author": "Phizle",
        "url": "https://i.redd.it/alx34osg0ul11.png",
        "text": "",
        "created_utc": 1536853897,
        "upvote_ratio": ""
    },
    {
        "title": "Rise of The Runelords Chapter 6: Secrets Behind The Curtain",
        "author": "nlitherl",
        "url": "http://taking10.blogspot.com/2018/09/rise-of-runelords-chapter-6-secrets.html",
        "text": "",
        "created_utc": 1536850246,
        "upvote_ratio": ""
    },
    {
        "title": "HOW NOT TO ESPIONAGE",
        "author": "CouchPotatoBrothers",
        "url": "https://www.reddit.com/r/gametales/comments/9f8tmn/how_not_to_espionage/",
        "text": "Here’s another tale of intrigue and espionage from our last session with the Wolves of Moonreach that I wanted to share. This may have been my favorite session we’ve ever done so far. Everyone brought their A-Game, and it was absolutely hilarious and fun. No combat even involved.\n\n***Preface:*** *So here’s the thing. Our adventuring party (The Wolves of Moonreach) are wanted in Deepminster for suspected collusion in treason to our country. This wouldn’t be so bad if we weren’t currently holed up IN Deepminster trying to free our friends who got themselves detained for the same crime.*\n\n*The first couple of days went okay, because nobody was aware we had arrived just yet, but when we went back to the boat we arrived in, it was teeming with the townguard. A couple of them saw through Pinwin’s absolutely terrible attempt at playing coy and chased us into a nearby alley. We ended up winning one guard over by curing a nasty boil affliction on his head (long story), and convinced him to set up a meeting with his commander. That way we could just tell them all that this was a huge misunderstanding, and that we were super loyal to the throne and just want to save everyone from Rothia.*\n\n*Which is totally true, by the way! We’re the goodies in this scenario! Unfortunately, there seems to be some sort of corruption in the council of Deepminster since the king had been seemingly assassinated.*\n\n*The meeting went terribly awry. It was a trap to apprehend us and send us in for questioning. We probably should’ve went in quietly. We didn’t. We ended up burning down the tavern we were meeting at and killing several town guards in our escape. Shit was going south. Haha.*\n\nWe were initially invited to Deepminster’s Harvest Feast as a reward for winning Ravenmoor’s Great Hunt, but as soon as we arrived in Deepminster, everything was going wrong. Some of you may remember my previous post about just trying to buy clothes. [You can check that out here, by the way.](https://www.reddit.com/r/DnD/comments/9asom4/when_shopping_goes_horribly_awry/)\n\nWe’ve been in Deepminster for a half a week. It was the night of the Harvest Feast. We needed to find a way to free our friends AND somehow appeal to the council to clear our names. We learned that only certain level guards can get into higher levels of the Tower of Law, and we needed access to the higher floors if we wanted to find our friends.\n\nEnter Gorbel’s disguise. Our idea was that she (a half orc bard) would whore herself up real nice and win over one of the commanders of the guard and get us into the Tower of Law where our friends supposedly were being kept. Well, she rolled really well on a disguise check, and Pinwin (our male halfling ranger) rolled really well for dolling up her wig she stole. So Gorbel looked GOOOOOOD. Companion-level good. (Companions are our world’s elite prostitute assassins.)\n\nWe head to the guard barrack district, most of us holing up in a nearby tabbard shop. Pinwin buys a shitload of sequins while we wait, so he can spiffy up his outfit even more for the feast. We listen in on our communication device in case Gorbel gets into trouble. Her safe word is cheese.\n\nAs luck would have it, she bumps into Acelyn Hardsprinter, one of maybe 10 commanders of the guard. Using a bit of persuasion and her feminine wiles, she convinces him to go get a drink with her at the nearby tavern. The tavern is silly with guards because it’s by the barracks. But that doesn’t phase Gorbel. Ace has clearly been in a dry spell, because he seems genuinely excited by Gorbel’s shameless flirting. She claims to be a prospective Companion, looking to see the sights of the city. He mentions that he’s attending the Harvest Feast as a very important announcer, and she sheepishly convinces him to bring her along as his plus one. He actually tells her to meet him at his own house around an hour or so before the event and they can arrive at the feast by carriage.\n\nThis info greatly works in our favor. If we can get the guy alone, we may be able to lift the key right off of him. My character To’marr (dwarf forge cleric) has an ability that allows him to create objects out of metal, including duplicates of keys. At the very least, we thought we could get Gorbel to convince him to take her up to a higher floor in the Tower of Law for some torrid and exciting pregame Orc sex, allowing us a means of entry.\n\nI come up with the idea to get help from Durant, one of our other friends in the city. He has a big ass snake whose bite is filled with truth-serum venom. I think that maybe she can further lower his inhibitions if Gorbel dilutes a bit of it into his drink. None of us had ever attempted this, but hey it was worth a shot, right?\n\n6:00 goes by, and she arrives at his estate, with the rest of us hiding in the shadows outside. It turns out this dude has servants working for him, so that complicates things a little bit. Gorbel is actually personally impressed by this guy’s apparent wealth, and jokingly considers abandoning the mission to make him her sugar daddy. Luckily, she’s more loyal than that. He wants to head out right away, but she convinces him to bring some glasses and “try the drink of her homeland.”\n\nHe seems a little suspicious, but he downs the beverage. Gorbel keeps flirting until we see what happens.\n\nOutside, the carriage arrives. It’s pretty fancy, almost Cinderella-like. 10/10 would carriage again. We’ve noticed that security is pretty lax right now in the guard district, presumably because they’ve dedicated most of their efforts to overseeing the Harvest Feast. The carriage has no guards, only two posh looking carriage drivers in tuxedos.\n\nSmuzog (our half orc barbarian teammate) has elected to wait back at our hidden base, as Durant was supposed to meet him with scrounged Deepminster guard armor, in case we needed our own disguises. So outside the Acelyn’s house were me (a very not sneaky dwarf wearing full plate armor), Pinwin (who was just excited to be involved), and our follower Zaiko, who quite literally a simpleton. He means well, but he’s essentially a dipshit.\n\nWhat’s my grand idea? Sneak up on the carriage drivers, knock them out. Take their clothes. Commandeer the carriage. Zaiko and I sneak up on the carriage, and I somehow do surprisingly well. I come down on one of the drivers and choke him out. Zaiko didn’t fair as well, startling the other driver and resorting to butting him in the face with the haft of his halberd. Nobody nearby seemed to notice, luckily. We drag their unconscious bodies into an alley. The clothes only fit Zaiko. I slap one of the top hats onto his giant fro. We both nervously sit at the front of the carriage, with me posing as a guard. Pinwin ends up hiding in a compartment under a seat inside the carriage.\n\nGorbel’s truth brew concoction ends up working pretty well. Acelyn becomes VERY forthright with his intentions, saying things like “I will say anything to impress you into having sex with me.”\n\nThe two of them come outside, and Gorbel meets eyes with us. We exchange quick nervous glances as the commander seems a little suspicious by my presence. We convince him that I’m an honor guard sent to protect the carriage. Acelyn decides he’s disinterested because he’s focused on trying to have sex with this lovely woman. We uncomfortably begin the ride to the Feast. He tells us where it is, but I decide to take a detour to the Tower of Law instead…\n\nI’m not good with Animal Handling, neither is Zaiko. We’re in over our heads, for sure. We continue on our journey as Gorbel attempts to further coerce the commander and get increasingly more flirty. Pinwin starts to run out of air.\n\nGorbel suggest to Acelyn that she wants him to prove his power to her and mentions she’s never done the nasty in a jail cell before. At this point, I’m jankily driving the carriage in circles around the block that the Tower of law is on because I’m stalling for time. Old Acey boy admits to Gorbel that he is super aroused, and would very much like to have sex with her, but he is obligated to do his duty at the feast and can’t be late.\n\nI grow impatient. I figure that Gorbel may be able to lift the key right off of him and maybe throw it off the carriage. Nervously, I call out to them.\n\n“My lord, err, would you maybe like to hear a romantic song on your ride to the Feast?”\n\nThey both agree. I’m not trained in performance. My charisma is also shit. Haha\n\nBut, I manage to actually sing okay. I call out “Oh, unlock the KEY to my hearrrrt!” And continually drop hints to get the key.\n\nEventually, Ace looks out the carriage window and notices that we’re clearly not where we’re supposed to be. He seems suspicious, but we play super coy and inexperienced. He points to where the Feast is obviously taking place and demands we go that direction and closes the window.\n\nI don’t think Gorbel had gotten the hint. That or she was trying to bide her time. Right around now, Smuzog arrives (NOT with guard uniforms) and meets my gaze as I anxiously continue driving the carriage in circles around the Tower of Law.\n\nTo try and get a moment alone with her, I decide to try and fake a carriage mishap. I jerk the vehicle to a stop and try to sabotage one of the wheels, thinking it would bring both of them out of the carriage so I could talk with Gorbel and tell her to get the god damned key. I try to break one of the wheels, but it’s super solid metal and won’t budge. Gorbel tells Acelyn that they should stay in the carriage (of course), and he opens the window demanding to know what’s going on. I make up some bullshit about the wheel and continue on our way again, STILL NO KEY. He’s getting more and more suspicious despite Gorbel’s persistent flirting.\n\nMeanwhile, Pinwin has almost totally ran out of air. He opens the compartment to get a breath in, but makes too much noise. Acelyn is about to look over, but Gorbel throws herself onto him and begins forcibly making out with him and feeling him up. Pinwin is shocked, but he manages to suck in somewhere and pops back into his hiding place. Gorbel manages to get a hold of his keys and stashes them away for the moment.\n\nShe gives me her new code word for obtaining the key by saying “I could really go for some chocolate cake.” This persuades Ace to have us stop super quickly at a bakery so he can please her.\n\nI shout back. “Just don’t eat too much. We wouldn’t want you to THROW IT OUT in the carriage.” Everyone agrees that’s a super weird way to say that, as we continue on.\n\nGorbel takes the hint and suggests that she’s hot. Acelyn gladly opens the window to the carriage to let in some air. She leans out and drops the key BARELY without letting him realize it’s happened. I hand the reins to Zaiko and roll right off of the carriage. As I run to get the key, I tell Smuzog to hop on in my place.\n\nWith the windows open again, Acelyn notices that we are still nowhere near the Feast and demands to know what the hold up is. Now Smuzog, who has a totally different voice than I do, apologizes and says they will make for the feast at once. Since they can’t see them up front, Acelyn confusedly asks if he’s the other one (referring to Zaiko). Smuzog just says “YES.”\n\nI run off and begin the hour long process of duplicating the key, hoping nobody runs into me, as the others make their way to the actual feast.\n\nSeemingly to minimize the tension, or maybe because he’s a wild card, Pinwin leaps out of his hiding spot in the carriage and yells “HELLOOOOO! I’m your performer for this evening.” Effectively startling the shit out of Gorbel and Acelyn. Gorbel plays dumb as Acelyn demands to know the meaning of this. Pinwin explains that he’s the entertainment for their ride to the feast and can play them music on his lute. Rolls like shit. Acelyn doesn’t believe him. Everyone jumps into help convince him, as Pinwin begins to cry and act hurt by his accusations. SOMEHOW, maybe because he’s drunk on snake venom, Acelyn is finally calmed down.\n\nAnyway, they arrive at the feast, and Smuzog just runs away, hoping to make it back to help me in the tower, while the rest of us attend the feast.\n\nMore shit hits the fan, as Gorbel runs into an old flame with a grudge, and I set fire to a building as a distraction and find my long lost brother, and Pinwin plays a dope lute solo, but those are part of a tale for another time. This has gone long enough.\n\nIt was just hilarious. I wish you all could’ve been there at the time. Everyone’s roleplaying was top notch, including our DM’s acting with the truth serum, and Gorbel’s impressive flirting skills, and Pinwin’s chaotically adorable anarchy he brings to the table. It such a fun session, and you only heard the Cliff Notes version. We’re just improvising on the fly and barely getting by, but we’re having a shitload of fun on our way! Thanks for reading!",
        "created_utc": 1536766577,
        "upvote_ratio": ""
    },
    {
        "title": "[5e Dungeons and Dragons Liveplay] Hyrule Chronicles Episode 14: A Giant Inconvenience",
        "author": "ArticulateT",
        "url": "https://soundcloud.com/articulate-t/hyrule-chronicles-episode-14-a-giant-inconvenience",
        "text": "",
        "created_utc": 1536684384,
        "upvote_ratio": ""
    },
    {
        "title": "Consequences &amp; Dark Turns, The Sage Unending, Campaign Diary 6",
        "author": "[deleted]",
        "url": "https://misanthropester.com/2018/09/11/consequences-dark-turns-the-sage-unending-campaign-diary-6/",
        "text": "",
        "created_utc": 1536680853,
        "upvote_ratio": ""
    },
    {
        "title": "Our live show from Michigan Comic Con resulted in some deadly audience participation",
        "author": "bishaha",
        "url": "http://newradiomedia-recast.streamguys1.com/content/geektainment/20180906145311-PodquestersEp026.mp4",
        "text": "",
        "created_utc": 1536680767,
        "upvote_ratio": ""
    },
    {
        "title": "Our live show from Michigan Comic Con resulted in some deadly audience participation",
        "author": "[deleted]",
        "url": "http://newradiomedia-recast.streamguys1.com/content/geektainment/20180906145311-PodquestersEp026.mp4 Size:1430 MB",
        "text": "[deleted]",
        "created_utc": 1536680546,
        "upvote_ratio": ""
    },
    {
        "title": "[Call of Cthulhu] Wasting time before a very important DEAD-line.",
        "author": "Teufel_Barde",
        "url": "https://www.reddit.com/r/gametales/comments/9esbzp/call_of_cthulhu_wasting_time_before_a_very/",
        "text": "My group at the time and I were a bit burned out from Pathfinder after doing a few campaigns, so we decided to go with some good ol' lovecraftian horror and suffering to spice things up a bit. After the usual campaign creation process I was able to piece something together for a campaign and gave them the year this would be set in as well as the part of the world. The place, Scotland, the year, 1975. With call of cthulhu I sit there with the players as they roll up the sheets, then let them come up with the backstory on their own time before emailing it to me, I usually like it to be with me about two days before the game, but it's not usually that big of an issue if it isn't with me by then. \n\n&amp;#x200B;\n\nTwo of my players gave me their backstories on the day and apologized for the lateness, although after reading it, I knew they did it on purpose just to try and get this by. Two cousins, both irish, about the same age, one of them with sandy blonde hair, the other sporting a bloody red mop of hair, they were called...Patrick Fitzgerald, and Gerald Fitzpatrick. This paired well with the drunken scottish grounds keeper and the barely sane ex teacher. The only 'normal' character was Rodrick von humpfsvolt, a german aristocrat who was being puppeted by Mike, and anything in the hands of Mike is never going to be 'normal'.\n\n&amp;#x200B;\n\nThe goal of the game was to explore this place called hamilton Academy which was shut down in 1972, but for the sake of the game, I just said it was abandoned after this and had since become a spoopy place. Rodtrick, being the exentric nobleman that he was, decided he wanted to explore the place and see if it was worth buying, with the estate agent (the ex teacher) acting as a guide, while the scotsman was just the hired help to keep it all from falling apart, patrick and gerald were Rodricks hired muscle. It didn't take long for things to get super spoopy, with the souls of students who commited suicide coming out at them now and again in various ways, slowly corralling them into one of the store rooms where old history artifacts were kept. Among these things was an old, carefully sealed up book that...Patrick instantly tore to shreds, along with anything else inside that box before anyone else could stop him. Rodrick promptly shot him in the leg with his hidden cane pistol and that sparked off a small brawl...which rodrick won, because pistol cane. \n\n&amp;#x200B;\n\nThe blood from the two soused irishmen dribbled over the shattered remains of one of the things patrick had broken, which turned out to be a soul eating pot that slowly reformed itself the more of their blood it drank until it became an indestructible jar that was slowly eating their souls. From the ripped up remains of the tome, the teacher figured out they'd need to interrupt the process and replace the souls from the irish boys with something of equal value, another roll revealing it would take about six ghosts to take the place of the two boys. It wouldn't even be that hard once they figured out how to use the jar, would have made a nice end to the first session...  \n\n\nPatrick and Gerald spent ages just trying to kill Rodrick after he had shot the two of them, now that his gun was out of ammo. The scotsman and the teacher tried to stop the pair but it was ultimately pointless, especially once the three men started to throw things from the research boxes at each other, ranging from a crystal skull to some manky old fedora and so on. This went on for about an out of game hour before I held up an hourglass I kept behind my DM screen and showed it to them all, before asking for patrick and geralds character sheets. I hadn't even planned on putting a defined time limit on it, instead planning to just let them go ghostbuster with the jar with some genuine justification, but they really just wanted to kill each other.  \n\n\nPatrick and Gerald died that night, with the remaining three using the now fully repaired jar to eat the ghosts and escape the estate, planning on returning with two competent figures to act as backup, which led to the first two group designed characters I've ever seen being made.",
        "created_utc": 1536622871,
        "upvote_ratio": ""
    },
    {
        "title": "[Dungeons and Dragons 5e] Where the Lightning Meets the Sea Episode 1",
        "author": "notashrimp16",
        "url": "https://www.reddit.com/r/gametales/comments/9eoapf/dungeons_and_dragons_5e_where_the_lightning_meets/",
        "text": "Tabletop Potluck has begun a new arc playing Dungeons and Dragons 5th Edition!  Make sure to check it out!\n\n&amp;#x200B;\n\nCheck it out \\[here\\] ([http://tabletoppotluck.libsyn.com/dd-episode-one-where-the-lightning-splits-the-sea](http://tabletoppotluck.libsyn.com/dd-episode-one-where-the-lightning-splits-the-sea));\n\n&amp;#x200B;\n\nWe also have a brand new \\[kickstarter\\] ([https://kck.st/2wYVDMP](https://kck.st/2wYVDMP)) up and running! Consider showing your support to get your name as an NPC in upcoming arcs!\n\n&amp;#x200B;\n\nFollow us on \n\n\\[Facebook\\] ([http://facebook.com/tabletoppotluck](http://facebook.com/tabletoppotluck)),\n\n\\[Twitter\\] ([http://twitter.com/tabletoppotluck](http://twitter.com/tabletoppotluck)),\n\n\\[Stitcher\\] ([https://www.stitcher.com/podcast/tabletop-potluck?refid=stpr](https://www.stitcher.com/podcast/tabletop-potluck?refid=stpr)),\n\n\\[Apple Podcasts\\] ([https://itunes.apple.com/us/podcast/id1312897506?ls=1](https://itunes.apple.com/us/podcast/id1312897506?ls=1)),\n\n\\[Player FM\\] ([https://player.fm/series/tabletop-potluck](https://player.fm/series/tabletop-potluck)),\n\nAnd wherever else you get your podcasts!\n\n&amp;#x200B;\n\nDon't forget to rate us and review if you like it! We also have a patreon that you can check out \\[here\\] ([http://patreon.com/tabletoppotluck](http://patreon.com/tabletoppotluck)).  And let us know if we missed something important or if you want to see anything on our show!",
        "created_utc": 1536594261,
        "upvote_ratio": ""
    },
    {
        "title": "Vampire: The Masquerade - Twin Cities by Night \"Dread\" Chapter 22",
        "author": "TwinCitiesByNight",
        "url": "https://www.reddit.com/r/gametales/comments/9ehnmy/vampire_the_masquerade_twin_cities_by_night_dread/",
        "text": "Hello Folks,\n\nI bring to you the latest chapter of our Vampire: the Masquerade – Twin Cities by Night “Dread” story.\n\nLenny receives information from a contact about a missing Kindred, and feeds to reestablish some form of control over his life again.\n\nhttps://soundcloud.com/twin-cities-by-night/episode-198-vampire-the-masquerade-twin-cities-by-night-dread-chapter-22\n\nThis is a Vampire: the Masquerade Revised Edition game that takes place in the Twin Cities of Minnesota in the summer of 2010. Vampire: the Masquerade is a One World of Darkness game owned by White Wolf Publishing.\n\nPlease subscribe, like and comment on the videos if you enjoy them.\n\n Come by and visit our Discord!\nhttps://discord.gg/T9zeN9p\n\nCheck us out on iTunes:\nhttps://itunes.apple.com/us/podcast/twin-cities-by-night/id1246523585?mt=2\n\nCheck us out on Soundcloud \nhttps://soundcloud.com/twin-cities-by-night\n  \nFind us on Twitter!\nhttps://twitter.com/Twin_Cities_VtM\n\nFind us on Facebook\nhttps://www.facebook.com/TwinCitiesByNight/\n\nFind us on YouTube\nhttps://www.youtube.com/channel/UCBUyj7h-xIhwsM3kHK56SRA\n\nFor more White Wolf RPGs game play and media please check out \nhttps://www.facebook.com/groups/862703457198327\n\n\n\n",
        "created_utc": 1536536410,
        "upvote_ratio": ""
    },
    {
        "title": "Space Station 13: You Will Rue This Day",
        "author": "ASAC_Schraeder",
        "url": "https://www.reddit.com/r/gametales/comments/9ehkzg/space_station_13_you_will_rue_this_day/",
        "text": "For the uninitiated, Space Station 13 is a top-down multiplayer game where 30 or so players all choose different jobs (Security guard, Medical Officer, Quartermaster etc) and all work together to survive on a space station. In most rounds there is a different \"goal\" at play - one player is the Traitor and must kill a few certain VIPs and escape, a few players are Terrorists and are secretly working to destroy the station, etc. My story isn't about any of that. My story is about a Clown.\n\n&amp;#x200B;\n\nClown is a job that most people only choose when they want to dick around and be a nuisance. Clowns have virtually zero tools or skills to make them valuable, but they do look hilarious and have a chance to honk a stupid little clown horn while they're walking. In my experience, Clowns are dangerous foes because only very experienced players choose them simply to have fun, and they know all sorts of tricks to at best be a monumental pain in the ass and at worst blow the station apart and kill everyone. The server I used to play on had an unwritten rule that stated murder is a crime... unless you're murdering the Clown. It was not uncommon to see, in the early-round rush where everyone's running around and grabbing the tools and such that they need, several Assistants beating a Clown to death with a toolbox while Security simply walked past. In the round in question, I had chosen Detective because I'm monumentally boring and like playing Law &amp; Order In Space and I ran afoul of the Clown almost immediately.\n\n&amp;#x200B;\n\nIn the pre-round rush, everyone was discussing how they're going to kill the Clown. The clown approached me, a Detective being a member of the Security forces, and asked me to protect him. I simply told him the truth: \"I can't\". He stood there for a moment, presumably digesting this information, and simply said \"You will rue this day\". He then walked off, his dramatic exit somewhat marred by the occasional clown-horn honk as he stepped into the shadows.\n\n&amp;#x200B;\n\nAlmost immediately I was summoned to several murder sites. You see, the Detective carries a special little analyzing tool that can scan blood types, fingerprints, even microscopic fibers on items or people. After scanning each and every corpse brought before me, the best \"evidence\" I could find is that all of these people had been killed by blunt force trauma, but finally the killer left me a clue: a single H.O.N.K. circuit board. The circuit board has only one purpose: building the H.O.N.K. mech, an unbelievably annoying mech equipped with several bike horns and such and is only ever requisitioned by a Clown with a serious chip on his shoulder. I had enough evidence to suspect my killer.\n\n&amp;#x200B;\n\nI returned to my detective office and, after locking the door, started interfacing with the Security terminal in order to place a Detain On Sight order for the Clown in the system. While messing around with the terminal I heard it: a far-off honk. You need to understand that while playing this round it was 3:30 AM, my lights were off, and I was hunched over my keyboard, totally invested in my game. I closed the terminal, looked at the windows beside the door to my Detective's office, and of course the Clown is there. Watching me. I drew my revolver, primed a flashbang and went to apprehend him. He sprinted off, I of course managed to flashbang myself, and the Clown escaped. I knew now that he was my man and he had to be stopped.\n\n&amp;#x200B;\n\nAfter recovering and locking myself back in my office, I put out a public address on the system-wide radio that the Clown is apprehend on sight and the first person to bring him to me would receive my revolver as payment. After this address, I went back to the terminal, finished what I was doing, and ran off from the computer to have a quick bathroom break. When I returned, I was summoned to an ongoing gunfight in the Cafeteria (the Bartender had gotten blind drunk, declared war on the Cook and was firing shotgun blasts at him through the pass-through window). After this I was summoned to the Cargo Bay by Head of Security and what I saw actually, genuinely and no exaggerating made my blood run cold.\n\n&amp;#x200B;\n\nThe Clown had captured the Quartermaster and used his access codes to order some things for delivery, and one of these things was a huge-ass laser that bolted to the deck. This Clown had taken this huge laser off the delivery shuttle, unpacked it, bolted it to the deck, torn up the deck plates, spliced the laser into the station's power supply, and replaced the plates. Then, he had bolted a chair to the deck in front of the laser, strapped the Quartermaster to it, and turned the laser on. How did I know the Clown had done all this? He had taken Polaroids of every step of the process and littered them all over the cargo bay. And the last piece of evidence that had led me to the Clown? In gigantic letters on the floor of the cargo bay, scrawled in white chalk, was one word.\n\n&amp;#x200B;\n\nH O N K\n\n&amp;#x200B;\n\nI honestly don't remember how that round ended, but I knew that I had seen one of the best things in my entire life that night. God bless you, Clown.",
        "created_utc": 1536535787,
        "upvote_ratio": ""
    },
    {
        "title": "Burning Down the House, The Sage Unending, Campaign Diary 5",
        "author": "[deleted]",
        "url": "https://misanthropester.com/2018/09/08/burning-down-the-house-the-sage-unending-campaign-diary-5/",
        "text": "",
        "created_utc": 1536507986,
        "upvote_ratio": ""
    },
    {
        "title": "Too Dark Park, The Sage Unending, Campaign Diary 4",
        "author": "[deleted]",
        "url": "https://misanthropester.com/2018/09/07/too-dark-park-the-sage-unending-campaign-diary-4/",
        "text": "",
        "created_utc": 1536507926,
        "upvote_ratio": ""
    },
    {
        "title": "[Tabletop] Wizard Games",
        "author": "Schadenfrueda",
        "url": "https://www.reddit.com/r/gametales/comments/9e995k/tabletop_wizard_games/",
        "text": "Nearly every evening, our wizard would send a message, with nothing but a simple message: a letter, sometimes two, and a number. He would give the DM a knowing look, and the DM would acknowledge it without further comment. Some time the next day, or sometimes the day after, he would get a similar message, just a couple of letters and a number. \n\nMe and the other players around the table were initially curious about this, and slightly miffed at our wizard's refusal to explain. This initial mild frustration soon enough became outright suspicion, and later open hostility, leading to the wizard nearly getting kicked out of the party, since we were all dead sure by that point for that he was sending coded messages to our villain, a crime boss known for using such tactics and also surprising us with seemingly impossible knowledge of our doings, particularly for a campaign where scrying was banned. \n\nThere finally came a point where, one night, we all snuck into his bag of holding, even going so far as opening his spell book, and found a series of notes that matched the messages he'd sent out, along with corresponding return messages. After several minutes of trying to puzzle it out, one of the more observant players finally asked to make a knowledge (arcana) check. After a good role, he finally got his answer. \n\nIt was chess notation. \n\nThe wizard had been playing chess with his old mentor, as a proxy for him and the DM to play their own game. ",
        "created_utc": 1536455661,
        "upvote_ratio": ""
    },
    {
        "title": "[Pathfinder] One feat to fool them all",
        "author": "Teufel_Barde",
        "url": "https://www.reddit.com/r/gametales/comments/9dzat2/pathfinder_one_feat_to_fool_them_all/",
        "text": "When playing d&amp;d or pathfinder at higher tiers, one school of magic eventually becomes mostly useless, illusions. You've got things like truesight, tremorsense, blindsight, even outright immunities, it used to be a real pain for my spellcaster players, because I like to allow improv and creative thinking when it comes to problem solving. This all used to be the case until I added in a metamagic homebrew feat of my own, which allowed illusions to override some of these, and helped my players make higher level illusionary spells. This tale is an excerpt from the campaign we first implemented these into.\n\n&amp;#x200B;\n\nThe party had managed to enter into the crystal maw of Dur-baagal, the ice primordial, tucked away within the plane of ice, on the borders of the wind and ice planes. The place was one giant sphere of perfectly clear ice that had been tucked away under miles and miles of thick blue ice, the whole place was illuminated by the spidery blue blood veins that were knitted into the walls, giving everything a faint azure glow. This was a boon and a bane, because while they could see literally every monster roaming the place right down to the very core where Dur-baagal's slowly regenerating body was, everything else could potentially see them, and Dur-baagal could feel that which touched his veins. So, in order to avoid as much conflict as possible, the wizard had everyone climb into the bag of holding, hopped onto the magic carpet they had stolen from Auril's court, and cast a metamagic altered Major image to make himself appear as a half human, half ice elemental creature they had killed back at the aforementioned court.  \n\n\nNormally, this disguise would have been easy to see right through, but with the meta magic feat in effect, he fooled everyone, the primordial and all, bypassing many a fight I had carefully planned and used his deep knowledge of the planes to accurately speak hothan (Ice plane tongue). Roll after roll, he had to try and withstand the pain of the sub zero tempratures in order to maintain the spell, not even able to drink potions as they froze the moment they came out of the bag, they had to rely on a system of the cleric holding his hand and healing him periodically the whole way down, only ever really pausing when the penalties he was getting from the cold started to increase due to the temprature dropping closer and closer to absolute zero. They decided it was better to maintain the illusion instead of fighting from there on in, so...they set fire to the magic carpet and used that to keep him warm for a few more minutes, allowing them to slowly pass by the last guards and into the final chamber.\n\n&amp;#x200B;\n\nThey came to rest at the first step up towards the huge frozen egg Dur-baagal resided inside, this room, unlike every other, was mildly warm, the air breathable and would have been pleasant if it wasn't for the thick, rancid stench of rotting blood and anti-freeze. Dur-baagal spoke to the wizard, who, using another spell, was able to imitate the soul of this beast whom he was cloaked as, the primordial beasts very psionic touch gave him brainfreeze, nearly freezing his synapses as they spoke. Upon command, the wizard produced the 'frozen core', the last thing dur-baagal needed to begin the final regeneration stage...It was actually a necklace of fireballs stuffed into a glass tube that was covered in frozen ice, but again, the wizard was able to make dur-baagal assume it was the real deal, after all, the primordial had never actually seen it. The tube was sucked into the egg, and after a split second, the beast began to let out a roar of anger...until all of the fireballs on the necklace went off when the tube was crushed.  \n\n\nAt that point, the whole party surged out of the-well not so much surged, more like, plopped out in a heap from the bag of holding. Combat insued against the semi restored and now badly damaged dur-baagal, whom they were able to put down with relative ease, their only major loss being the flying carpet and the wizards clothes once they had all been burned to a cinder. They escaped with a planar shift spell, forcing their way passed the now weakened magical barrier surrounding the place, the last major hurdle of their quest completed, all that was left was the victory lap. I couldn't decide between being outright furious with them, and overjoyed at their creativity, after a ten minute break, i settled on the latter and we wrapped up the campaign before going out to dinner.  \n\n\nI think they kind of knew they had undercut my final dungeon for it, and, well, the barbarian and fighter hadn't really had a chance to do that much for most of that final session, so we ran through it a second time without the illusion magic trickery...They died half way through because one of them had the bright idea to use an earthquake spell, in short, billions of iceshards fall, everybody froze.",
        "created_utc": 1536359994,
        "upvote_ratio": ""
    },
    {
        "title": "Dark Lord Lyons: The beginning",
        "author": "Splyth",
        "url": "https://www.reddit.com/r/gametales/comments/9dvonm/dark_lord_lyons_the_beginning/",
        "text": "WARNING MAJOR REIGN OF WINTER SPOILERS BELOW\n\nWARNING I played this years ago so details are VERY hazy\n\n&amp;#x200B;\n\nHail and well met traveler! Pull up a chair and I shall share the story of The Black Scourge, The Killer of Men, The Ravisher of Women, The Eater of Babies. A man who consorts with unholy beasts, and rumor has it, has become one himself. A man who has made a pact with something so unholy that even the light of the gods refuse to touch him. This is the story of Dark Lord Lyons. My paladin.\n\nHe started off, like most paladins, with vim and vigor for righteousness in his heart. He however had only dedicated himself to the concept of good, he was not beholden to any particular god. And so he sought adventure in the lands far to the north of Galorian.\n\nHe was joined by Karis, a stoic monk, and an alchemist of no small skill (his name has been lost to time). And the three soon found themselves in the midst of rescue mission, a noblewoman who was late for her rendezvous. We set out and quickly found a particular deranged suitor was behind this foul deed, after we dispatched him, a pale rider appeared, he was dying, and he begged us to help his mistress.\n\nWith nary a thought Lyons agreed. Much to his chagrin he learned this was no black rider but THE black rider, one of the 3 who served the witch Baba Yaga. But it was too late; a gaes had been laid upon him. Left with little choice, and the black rider's dying assurances that Ban Yaga would end this eternal winter, we set forth.\n\nThe cold winds were blowing hard, but eventually we found it’s source. A portal, chained to some cold plane, was the cause of this woesome winter. After dispatching some roughshod ruffians we decided to enter this perilous portal and give it’s maker a piece of our minds.\n\nWe found ourselves nearby a wizards tower. Of course we decided to investigate closer. Partially to see if this person was the portal’s maker, but also to get out of the now biting cold.\n\nWe very quickly realized that this was indeed the tower of the portal maker, for their men took umbrage to our presence and make their intentions known by firing upon us. But they were no match for our steel, our fists, and our guile , sorry did I say guile I meant explosions. He was an alchemist after all.\n\nAnd so we fought the vile creatures who dwelt within. However Lyons took every effort to offer them a chance to yield and live. All but the Raven Mistress of the Tower refused and perished. For her part, she claimed she only wanted to keep her ravens safe and warm. Seeing she meant no ill will he left her be whilst our noble heroes set off to find the master of this tower. A man named Radosek. This tower’s keeper. We fight him at the highest rooftops of the Pale Tower, and were almost brought low by his flight and lightning bolts, but our alchemist imbibed a magical elixir and took to the air to finish him. But alas in the tower master’s final moments he blinded our poor alchemist.\n\nWe sought to assist him, but he bade us not to. Instead he opted to stay at the tower with the Raven Mistress. His alchemy days were done.\n\nIn the commotion we had discovered two things of great import. The first was that Radosek served a Winter Witch named Nazhena, who was supposedly at Waldsby a town not to far away. The second was that without it's maker the portal had snapped shut. Seeing our path home closed and our options limited we decided, Karis and I, to set off to find this woman and root out her evil. \n\nWe were fortunate to come across 3 companions to assist us. A killer of giants Ulf, A conjurer of fire named Teyruin, and a hard nosed cleric named Ward. They too had met a rider (the black) and seeing their cause was aligned with ours we set off together towards the town of Waldsby.\n\nAnd here dear traveller is where everything begins to go wrong. But that tale shall have to wait for a later time.",
        "created_utc": 1536335793,
        "upvote_ratio": ""
    },
    {
        "title": "[World of Darkness] When you kill your ally's second-in-command sort of by accident (A Change of Heart Ch 17)",
        "author": "adartagnan",
        "url": "https://www.reddit.com/r/gametales/comments/9du8n0/world_of_darkness_when_you_kill_your_allys/",
        "text": "&amp;#x200B;\n\nhttps://i.redd.it/i40b4ydwdtk11.png\n\n[Chapter 17](https://arianedartagnan.wordpress.com/2018/09/07/a-change-of-heart-chapter-17/) is up, in which the party heads to the Acropolis - ostensibly to talk to mage allies in House Bonisagus, but really to investigate them for treachery.  Since the Bonisagi are conveniently distracted by a horrible, Plague-filled stone that sprouted in their library, Tel decides to distract them even more by splitting the stone \"slightly\" so Ynez can read their minds.  Of course he botches and blasts the thing right open, releasing the Plague all over the Acropolis.  \n\nThen the Bonisagi's second-in-command most unreasonably objects to having her mind read and threatens Ynez, who loses her temper and summons...her wrath in bear shape.  [Again](https://www.reddit.com/r/gametales/comments/8v5x1l/world_of_darkness_when_you_sortofaccidentally/).  Suffice to say that between the bear and Tel's divine weapons, the erstwhile ally winds up very very dead.  Now House Bonisagus wants nothing more to do with the party, ever again.\n\nAnd of course, who should show up but the Spanish Inquisition?!\n\nThe first post is [here](https://www.reddit.com/r/gametales/comments/8genjg/world_of_darkness_a_change_of_heart_chapter_1/).\n\nThe table of contents is [here](https://arianedartagnan.wordpress.com/rpg-tales/a-change-of-heart-table-of-contents/).",
        "created_utc": 1536326168,
        "upvote_ratio": ""
    },
    {
        "title": "A clip of a typical DnD misfortune.",
        "author": "bishaha",
        "url": "https://v.redd.it/7hb30q3otmk11",
        "text": "",
        "created_utc": 1536245754,
        "upvote_ratio": ""
    },
    {
        "title": "[The Dawnline] \"I Press The Button\"",
        "author": "BestCaseSurvival",
        "url": "https://www.reddit.com/r/gametales/comments/9dijru/the_dawnline_i_press_the_button/",
        "text": "This takes place during the playtest for a new game called The Dawnline, wherein vampires ancient beyond memory shepherd their villages of mortals away from the encroaching Dawnline - tarry too long in the twilight and the Dawn will eventually come to set you on fire. Move too far into the Dark and you will be eaten by monsters. Lose your village and you go feral. \n\nDramatis Personae:\n\n* Sench: Your humble narrator, a vampire made mostly of smoke and who almost remembers what it’s like to be mortal.\n* Lady Grieving Onyx: A vampire with a hide of stone, who has always moved just out of the corner of your eye, but has never moved while you’re watching. The tank of the group. \n\nWe are trying to shepherd our village across an area of sickness known as The Curse: it’s remarkably bad for humans to stay too long within The Curse, even where it’s shallow. Where it’s deep, even vampires with their remarkable regenerative abilities start to get sick, cough up blood, and generally have a bad time until they leave. This area of The Curse is dotted with pillars that repel The Curse, or possibly absorb it - either way, they mark an area of safe passage. The problem is that this passage is being guarded by the Radiant Cavalry, a group of vampires and mortals, some of whom even get high on vampire blood. We could bargain with them, but it’d be bad for us. There is also a Ruin nearby. Ruins are dangerous and full of ancient and imperfectly-understood secrets. \n\nWe had stolen several Radiant Steeds from where they were parked. Radiant Steeds are dope-as-hell chrome motorcycles that explode when the person attuned to them dies. We found some that were unattended and reprogrammed them. They are the steed of choice for the Radiant Cavalry, because they are ax-crazy marauders sometimes.\n\nWe determined to sneak around the Cavalry via the ruin, partly to catch them unawares and partly because there’s cool stuff in ruins. It was in the Deep Curse so they couldn’t go in force. It sucked for us, but what’re you gonna do. Inside, we found a vampire in a glass coffin who bombarded our minds with images of a past we don’t remember and forced us to activate the Autoclave Feature of the coffin, because being inside a glass coffin for ten thousand years or more apparently sucks. \n\nIt’s worth noting that this is the second or third such box we’ve ever seen, and each encounter ends the same way, more or less - the occupant demands death-by-autoclave.\n\nIn communing with its occupant before she committed suicide-by-booth, Lady Grieving Onyx gains a much deeper understanding of archaeotech at the cost of her ability to understand humans, while Sench… goes a little nuts, but that’s a story for another time. Lady Grieving Onyx determines that one can Attune to the box by getting some of your blood on it, but at the moment there’s only one thing we’ve seen boxes like this ever do.\n\nBeing adventurers through-and-through, we resolved to take the box with us - Archaeotech you can kinda-sorta trust is hard to find, and if nothing else a good garbage disposal is a handy thing to have. So we hitched it to the back of our steeds and considered the problem before us - a horde of bandits. They held the pass at a pillar, but we had an ace up our sleeve - our village has some trained Meteor Toads.\n\nWhat are Meteor Toads, I hear you ask. Meteor Toads are local fauna that have adapted to the ever-advancing Dawnline by hurling themselves into the stratosphere towards the Dark, destroying everything near where they came down, eating whatever they happened to kill, and hibernating until the Dawn starts catching up with them. Our village has trained these in the hopes that we can harness their motive power for our caravans. Yes, it’s a terrible idea, but one must keep occupied when fleeing the Dawn.\n\nSo we have our chief Toad-Trainer on standby on a hill some miles away, watching for the signal. Lady Grieving Onyx took with her a crossbow with a flaming bolt, but all she said of the signal was “You’ll know it when you see it.”\n\nWe decide that the only way to keep the bandits from killing us immediately is to ride right up to the pillar and park next to it - if they attack us, they risk detonating the Steeds, destroying the pillar, and losing their chokepoint. So we do just that, royally pissing off the bandits. Their leader, a vampire, doesn’t have much to say but “get away from the pillar so we can kill you” at first, but eventually offers a deal. They’ll take 20% of our village as food-slaves for their vampire food-slaves.\n\nObviously, this is unacceptable, even to a vampire. Why, the morale problems it would cause alone are insurmountable. But we do have an item of value in trade - the archaeotech autoclave garbage-disposal. I begin talking this up as a thing he should check out, which has him suspicious, but eventually I goad him into coming to take a look at it by challenging his leadership and soft-pedaling a mutiny among his followers. However, he’s very careful not to touch the box, because it’s hard to be quite that persuasive in a situation like this. So I stab him, making sure that when the sword comes out of his stomach the blood touches the box. When it does, the box schlorps him up like animate Jelly and leaves him, shocked and very pissed off, hammering silently on the inside of the coffin. \n\nNow, it’s important to explain what I wanted to happen next. I was hoping to trade him back to his crew for safe passage - we traverse our village and once we’re safe they get the box. The details will remain forever fuzzy, because Lady Grieving Onyx’s player goes:\n\n“I Press The Button.”\n\nThe button that autoclaves the occupant. \n\nThere’s silence as the GM pauses to start figuring out what happens. Then:\nThe coffin flashes with internal fire as the vampire bandit leader is incinerated.\n\nHis Radiant Steed, detecting the sudden lack of an owner’s heartbeat, detonates… *next to us and the pillar and his two cronies.*\n\nThey die in a small explosion and we are hurled meters away. We are told we’ll each start the next combat with 2d6 damage.\n\nOur spotter on the hill, having only been told he’d know the signal “when he sees it,” releases the toad.\n\nThere’s a descending whistle and the toad lands on one of the massed bandits, killing him and detonating his Steed. \n\nThe resulting chain reaction kills most of the bandit command camp in a series of extremely localized nuclear explosions.\n\nThe survivors, suddenly aware that their entire leadership is dead, most of their elite soldiers are dead, that they are now in the middle of an area of The Curse, and not knowing how many more toads we have in reserve, wisely decide to scarper. We are free to take our village across the shallow area of the Curse, and only suffer minor sickness.\n\nAnd that’s why impulse control is for losers. \n",
        "created_utc": 1536240351,
        "upvote_ratio": ""
    },
    {
        "title": "Rats of Tanglethorn Pt.7: The Tree of Woe",
        "author": "rangergames",
        "url": "https://rangergamespublishing.com/2018/09/rats-tanglethorn-pt-7-tree-of-woe/",
        "text": "",
        "created_utc": 1536164024,
        "upvote_ratio": ""
    },
    {
        "title": "[Starfinder] One good roll doth not an OP Race make.",
        "author": "GenericArcanist",
        "url": "https://www.reddit.com/r/gametales/comments/9cv1yr/starfinder_one_good_roll_doth_not_an_op_race_make/",
        "text": "My roommate and long-time friend concepted said race ages ago for Rifts: the Tri-Alyste. A cat-like warrior race with technology so advanced, they turned barbaric and warlike in their culture. Rest of the party is officially printed races; a Human, a Shirren, and a Ryphorian.\n\nThe mission was one like any other, if a bit more pleasant. The Android Explorer/Scientist, Mese-525 needed an escort into some dangerous space to record a near-miss by two stars to further the planetismal hypothesis, to which the exploration-savvy party and their destroyer were well apt for the job. While waiting the two weeks for data to be recorded, they explored the worlds around the passing stars.\n\nOn one world, they found a modern-ish starship owned by a military outfit gone manufacturer in more recent years, crashed into a desert. With the doors locked, Kuri (the Human Mechanic), and Oidroko (the Tri-Alyste Technomancer), make Engineering checks to open the door, with Xyllit (the Shirren Soldier) and Cyrus (the Ryphorian Mystic) on standby.\n\nIt went a little something like this:\n\n&gt; **Kuri:** “Engineering 23 to assist Oidroko.”\n&gt; \n&gt; **Oidroko:** “Engineering 42! Plus the 2 from Kuri’s aid, that’s 44!”\n&gt; \n&gt; **Me:** “Alright, one moment, this is quite a secure door…” *Starts looking up DCs to open doors.*\n&gt; \n&gt; **Oidroko:** “Starting to feel a little like What Was Done [See NOTE below]. Rolls so high, it’s like it doesn’t even matter what the DC is.”\n&gt; \n&gt; **Xyllit:** “I think this confirms what I’ve feared from the beginning; Oidroko is playing an OP race.”\n&gt; \n&gt; **Oidroko:** “I’m not that OP! I mean, the race has 2 HP…”\n&gt; \n&gt; **Cyrus:** “Yeah, which only accounts for 2 of how many of your HP?”\n&gt; \n&gt; **Oidroko:** “Seriously, the race doesn’t get much! Bonus to skills involving technology, Psychokinetic Hand at will, and Double Jointed, topped off with Darkvision and Light-Blindness.”\n&gt; \n&gt; **Cyrus:** “And the stat adjustments?”\n&gt; \n&gt; **Oidroko:** “Uh… +2 Dex, +4 Int, -2 Cha.”\n&gt; \n&gt; **Xyllit:** “+4 Int? That’s pretty strong.”\n&gt; \n&gt; **Oidroko:** “And Dragonkin have a +4 to Str, which is about equivalent.”\n&gt; \n&gt; **Cyrus:** “In a system where melee is ill-advised? No offense, Xyllit…”\n&gt; \n&gt; **Xyllit:** “I make it work.”\n&gt; \n&gt; **Me:** *Still reading…* “Greys get a +4 Int…” *Find my answer, smile wickedly.*\n&gt; \n&gt; **Oidroko:** “Besides, Izzy (me, the GM) designed and balanced the Tri-Alyste, and I’m built for skills.” \n&gt;\n&gt; **Me:** *Throw me under the bus, why don't you?*\n&gt; \n&gt; **Kuri:** *Being the lovely mediator she is.* “So, how about that door?”\n&gt; \n&gt; **Oidroko:** *With that hint of smugness.* “Yes, the door. Does a 44 open it?”\n&gt; \n&gt; **Me:** *Long inhale.* “No. You failed by 1.\"\n\nThe DC to disable the door was 40, with an additional +5 for the damaged state the vessel was in. They eventually got in by Xyllit hacking the door open with a Flare Axe.\n\nFor comparison, Kuri's Engineering is +20 at an Int of 19, and Oidroko's is +24 with and Int of 24 (as an Int-based class), with his +2 racial bonus when it applies. OP? You decide, but for level 10 characters, I think it's just right.\n\nBesides, not only did I let him play a Tri-Alyste, *I encouraged him to play one.* He was going to play a Dragonkin Solarion before I convinced him otherwise, and seriously, the Dragonkin Solarion would have been a bigger challenge for me to deal with than some techno-warrior cat.\n\nNOTE: What Was Done is my other campaign I'm currently running, where they net rolls of 80+ on the regular, so much so to the point that I've stopped asking for Diplomacy rolls. Either the NPC is instantly swayed by them or isn't. The PCs of What Was Done, however, are gods, so that's expected.",
        "created_utc": 1536063367,
        "upvote_ratio": ""
    },
    {
        "title": "Imp Familiar vs. Adult Red Dragon",
        "author": "Fauchard1520",
        "url": "https://www.reddit.com/r/gametales/comments/9cmh4p/imp_familiar_vs_adult_red_dragon/",
        "text": "Originally posted along with **[an accompanying comic](http://www.handbookofheroes.com/archives/comic/damage-type)**. Here be my tale. Ahem:\n\nSo no shit there we were, tunneling through solid rock a good sixty feet beneath the dragon's lair. We were making good progress until we got close. Once we came within 15 ft. of breaking through we had to take it in short bursts, casting silence and then digging like madmen so as not to alert our mark. We were thieves you see, and there are few prizes better than a dragon's hoard.\n\nCall us overly ambitious -- foolish even -- but we had spotted an opportunity. This dragon had served as our employer for some time, sending us out for a bit of knife work as the need arose. We knew that it kept a schedule, leaving its lair each day regular as clockwork to patrol its territory. Sure we were only 6th level mooks matching wits against an [adult red](http://www.enworld.org/forum/attachment.php?attachmentid=67558&amp;d=1427030445&amp;stc=1), but we were being careful. We'd put my imp familiar on lookout duty. He'd be able to spot the resident flying blast furnace from a mile away in the unlikely event that he made a premature return. Even better, I had [voice of the chain master](https://roll20.net/compendium/dnd5e/Warlock#toc_44) online as an extra line of defense. In other words, we had a rock solid early warning system down in our tunnels. We could turn around and skedaddle if things got hairy, and there was no way that hulking brute could follow us through our rinky-dink escape route.\n\nUnfortunately, we didn't count on the dragon keeping an alarm spell on his hoard. We broke into the chamber, the dragon banked hard, and we had mere moments to scoop loot. If you guys have ever seen [Supermarket Sweep](https://www.youtube.com/watch?v=XRLWtxoqAHs), it was like that, just with more magic items and pant-loading terror.\n\nWe'd gotten ourselves into a full on Bilbo burgling Smaug situation, and every round meant more money in the bank. That's when I made my critical error.\n\n\"Slow him down!\" I ordered my imp.\n\n\"You got it, Boss!\" he replied.\n\nWe took the money and we ran, and even then it was a close thing. There was a near-lethal amount of fire damage as Big Red blew his nose down our tunnel. We managed to escape without any casualties (accept of course my imp), and we made off with a pretty penny despite the setbacks. It was a modest success, even if we didn't come away with the haul of the century.\n\n\"Sorry, Boss!\" said my perky little familiar when I re-summoned him from death. \"I did my best, but he didn't even slow down!\"\n\n\"Well hey, thanks for making the effort. You're a trooper, little buddy! What did you do anyway?\"\n\nAnd that's when he handed me the empty strand that once held a fully charged necklace of fireballs. He'd thrown every single one at the dragon. The red dragon. The immune-from-fire red dragon. We'd managed to pocket a respectable number of magic items during the heist, but I'd have traded any three of them to get that necklace back.",
        "created_utc": 1535989320,
        "upvote_ratio": ""
    },
    {
        "title": "[Homebrew Game] Everyone Is Henderson",
        "author": "wraithstrike",
        "url": "https://www.reddit.com/r/gametales/comments/9clo87/homebrew_game_everyone_is_henderson/",
        "text": "I wrote up a little one-page RPG to play in downtimes between the sessions of my Harry Potter Campaign and my D&amp;D Campaign. Here's the rules:\n\nYour Name is Henderson. Could be a first name, could be a last name. Doesn't matter now that the great old ones came and wrecked the Earth. You're still alive though, as are your fellow \"Hendersons\" in this rundown pub also called \"Henderson's.\" And you've decided that you're just drunk enough to try to take down the Great Old Ones.\n\nYou have seven points to spend between two stats. Gnomes and Bullshit. Gnomes are your measure of health, and the number of rerolls you can make if you fail. Bullshit represents your as-yet unwritten six hundred page biography that details all the crazy shit you can, but totally should not be able to do.\n\nWhen you are attempting an action that should have no logical reason to work, roll a D6. If you roll under your Bullshit value, you succeed. If you roll above it, you lose a gnome. If you roll a 1, you succeed and regain one gnome.\n\nOnce per game, a Henderson may look to another Henderson and declare \"Hold My Beer and Watch This\" then roll to perform something extremely absurd. If the Henderson rolls a 1, they succeed at this reckless action and regain all their lost gnomes and the other Hendersons each regain one gnome from having witnessed such an event.\n\nIf you ever lose your last gnome, you must dramatically flip over your character sheet and shout \"Dey took ma gnomes!\"\n\nThose are the rules. Now, onto the story.\n\n---\n\nLizzie Henderson (Gnomes 3, Bullshit 4) and Henderson Lalama(Gnomes 4, Bullshit 3) have just downed another pint at this hole in the wall pub, and have gotten good and sloshed. So they decide to, in Lalama's words \"Fuck some shit up.\"\n\nLeaving the bar, they head to the local Hummer dealer. Seeing a non-euclidean fear beast guarding the gate, Henderson Lalama rolls a 2 to swagger into the place, gibbering like a shoggoth, acting like she belongs there. Once they find a suitably sized Hummer, Lizzie rolls a 1 to hotwire the ride and they immediately start driving to the old Four Corners Mall.\n\nAlong the way, both Henderson’s notice that the highway up ahead is out, and the path seems to be blocked by some floating mathematical equations that Lizzie Henderson recognizes from her days at NASA as the equations necessary for liftoff. Telling her companion this, she sits back as Henderson Lalama puts the Hummer into reverse, then floors it, rolling a 3 to ramp off the math, make the hummer do a double front flip and land safely.\n\nWhen they arrive at the mall, the main gate is protected by some kind of massive demon. Henderson Lalama decides to shout “Don’t see me” as she drives under its legs. With a roll of 2, the demon pays them no mind, even as they plow the hummer through the sliding glass doors.\n\nOnce in the mall, the first place they notice is the Build-a-Bear workshop, where a veritable army of soft fluffy things awaits to be recruited. While Lizzie Henderson loses a Gnome trying to convince the Build-a-Bears to join side, Henderson Lalama properly motivates the plushies and they all climb into the Hummer for the ride.\n\nThe next stop in the mall is the sporting goods store, where they pick up some fishhooks and nets for a purpose they’re not entirely certain of.\n\nThe rest of the mall is blocked off by an escalator, but Lizzie Henderson takes control of the Hummer and tells Henderson Lalama “Hold my Beer and watch this.” Rolling the needed 1, she throws the Hummer into gear, ramps it off a bench, and two-wheels the Hummer up the escalator, with one hand out the window to flip off any eldritch nasties that might come their way.\n\nOn the second floor of the mall, the Hendersons find a Lush, where they gather up fifty pounds of various soaps and hand lotions. Gotta keep clean even in the apocalypse.\n\nWhile Lizzie Henderson searches for anything of value inside Hot Topic, Henderson Lalama works on a little project. Taking apart her leather glove, belt and lighter, she rolls a 2 to craft a wrist rocket that she can load with the Lush bath bombs to create the world’s best smelling napalm.\n\nLizzie Henderson returns from the Hot Topic, her search fruitless. The place had been picked clean. So they drive on, through the security gate of Sears to find more things.\n\nStopping in the electronics section, Henderson Lalama rolls a 2 to take apart a washing machine. Grabbing the fire axe from the nearby wall, she chops into the ground, installing the drum of the washing machine in the hole and filling it with the blades and motors of a half-dozen blenders. Then she calls out “Eldritch beings can kiss my ass!” and this manages to attract one demon to run at her and promptly fall into her automatic pungee trap. While the blades chop up the demon, she takes a step back and lobs a burning bath bomb into the pit. This has a bonus effect. As the demon burns, all the other demons like it in the mall catch fire, due to a totally improbable, but totally awesome hivemind state.\n\nMeanwhile, Lizzie Henderson has found the clothing section and calls to her partner that she found something. Just as Henderson Lalama comes around, an even bigger demon emerges and Lizzie Henderson hands her compatriot a set of camouflage clothes. “Put this on.”\n\nWhat follows is a Thomas Sanders sketch as the eldritch nasty immediately loses sight of the camouflaged humans. Both Hendersons grab hold of the demon’s elongated tail and wrap it up in itself, before using the bath bomb launcher to set it ablaze.\n\nNext, the party runs through the home and garden section. Lizzie Henderson breaks apart some twenty pound dumbbells with a ridiculous amount of strength, and turns them into giant ninja stars.\n\nBefore leaving, the two Hendersons get curious, and decide to see what’s inside the employee lounge. Inside there, they find an open safe with a sawn-off shotgun and a note that reads “Our world has gone to hell. Hope this helps make it better. Signed, Darius Henderson.”\n\nWith their shopping trip done, they drive the Hummer out of the mall the same way they came in, and out towards the old air base to get a new perspective. While most of the aircraft around here is ruined, they manage to find one large hangar with a replica of the Hindenburg inside it. After parking the hummer in the passenger gondola, Lizzie Henderson takes over the job of flying this, and steers it towards the monolithic golden pyramid in the distance.\n\nThey both reason through their drunken stupor, that the best way to get the attention of the nasties is to crash the Hindenburg into the pyramid. They set all the hydrogen gas to pump out and ramp the Hummer out of the crashing zeppelin.\n\nThe explosion causes Cthulhu to rise up and seek vengeance, shouting in a long dead tongue. Both Hendersons think this is rather rude, so they order the Build-a-Bear army to mob Cthulhu while they head for a nearby laundromat. Henderson Lalama punches open a soap dispenser, so now they have an extra twenty pounds of laundry soap to add to their bath bomb collection.\n\nThey dive into a nearby brick oven pizzeria and start the process of baking a gigantic oatmeal, raisin and soap cookie to wash out Cthulhu’s mouth. Once it’s baked, they return to the fray. Lizzie Henderson hurls her dumbbell shuriken at Cthulhu to get his attention and when he turns, he sees the giant cookie on top of the Hummer. Cthulhu eats the cookie, and as soon as the soap touches the inside of his mouth, Henderson Lalama loads up another bath bomb, this one laden with fish hooks, into her wrist rocket and fires it down Cthulhu’s mouth, causing all the soap to ignite. Now, the Great Old One has napalm leaking from his mouth and he staggers towards a building, slamming his head into the skyscraper to end the pain. This causes the radio tower on top of the building to shake and Lizzie Henderson has an idea.\n\nShe climbs on top of the Hummer, points the shotgun at the radio tower’s base and shouts “This one’s for my gnomes.” She fires a blast from the shotgun, causing the guy wires around the tower’s base to snap. The radio tower breaks free and topples, the top of it falling down through Cthulhu’s burning face, impaling him to the ground.\n\nThe world is suddenly awash in reason and logic as a Great Old One lies dead. And at this point, both Hendersons decide to drive back to the pub and sleep off their encroaching hangovers.\n\nThe end.\n",
        "created_utc": 1535983084,
        "upvote_ratio": ""
    },
    {
        "title": "[Pathfinder] Punch the child, for the money!",
        "author": "Teufel_Barde",
        "url": "https://www.reddit.com/r/gametales/comments/9ce5oz/pathfinder_punch_the_child_for_the_money/",
        "text": "Smuggling is not an easy business, a fact my party learned the hard way when they said they wanted to try their hand at being an actual criminal organization, starting from the bottom and moving up. This misadventure all began with them as literal street urchins, pick pocketing from passers by and paying protection money to the local gang, over time they learned the skills of their respective classes and became their own 'thugs for hire' band who sold themselves to various groups in exchange for good cash.  \n\n\nIt eventually led to them getting a contract with some nobles from the upper district to help 'transport' various items to their estate, with their first job being a test. They had to get ten kilograms of empty soul gems from the docks to the estate without anyone discovering the contraband, it seemed simple enough, and they had plenty of options on how to get from point A to point B, but they didn't want to take the sewers, and they didn't want to take ages by weaving through the entire city in order to avoid checkpoints. So they had the brilliant idea to to go to the local butcher/baker and have him bake the diamonds into pastries, specifically ones without any sugar so they could avoid taxes, and set up a wagon to look like a street food vendor cart.  \n\n\nThey had to get through the lowest district to the noble district, but they didn't anticipate the fact that the street urchins would try to steal from the cart, to the point where none of them watched the back of the wagon while they all sat in the front. It was after their third perception check that they noticed a kid running away with a handful of pastries. The rogue went after the kid while the rest checked the wagon to see how many of the soul gem filled pastries were left, about 80% of them were still there, but that meant they were still missing a whole two kilograms of the stuff.  \n\n\nThe rogue brought the kid back quickly enough, and when they told him to hand over the food, he started scarfing it down like a pig. At first they tried to just stop him, but then the rogue yelled to the barb, \"Just punch the kid, for the money!\" The barb went into a rage and threw a flurry of punches...critting on three of them, which we all agreed were lethal. They pummeled the brat to death and filled the soul gem inside his gut, which they extracted with a blunt knife and some ribcage prying.  \n\n\nThey took the gem to a spellcaster friend they knew to ask the dead kid some questions, turns out the brat did know the other kids who had also stolen from the cart, and they used their connections to hunt them down, and took the pastries back...well, they took the ones that weren't eaten back, the soul gems that were eaten, they extracted in the same manner as the first. By the time they were done they had beaten up ten kids and killed three more. Things were already bad, but they made the choice to return to their wagon and continue, whilst still covered in the childrens blood, and after having been seen murder at least one child in the middle of the street.  \n\n\nThe guards at the gate wasted no time in trying to slap some shackles on them, and they bolted off at bullet speed. Needless to say, they had failed their contract with the nobles by this point, and learned as much the next day when a letter was sent their way, telling them to just give the soul gems to the representative of the nobles when they arrived. So instead they souled the gems to their mage friend and skipped town, because after their little escapade, no one was going to work with them again.",
        "created_utc": 1535911737,
        "upvote_ratio": ""
    },
    {
        "title": "An honorable end for Finn Wifflenuts in episode 25.",
        "author": "bishaha",
        "url": "http://newradiomedia-recast.streamguys1.com/content/geektainment/20180901020419-PodquestersEp025.mp4",
        "text": "",
        "created_utc": 1535896327,
        "upvote_ratio": ""
    },
    {
        "title": "[Adventurer Conqueror King] The Pool of the Moon",
        "author": "Nygmus",
        "url": "https://www.reddit.com/r/gametales/comments/9cad60/adventurer_conqueror_king_the_pool_of_the_moon/",
        "text": "We got a cheapass job to track some bandit motherfucker and wound up finding a dungeon under an abandoned tower. Not sure if this is Stonehell or not, it may be connected to it.\n\n\n\nWe fucked around, explored, chased off some skeletons with a turn undead. Went into a room which was mysteriously full of sand that turned out to be iron filings, very mysterious like. With a lever.\n\nWe spent literally 20 minutes talking over how to deal with the lever without being in the room before working out a clever method to trick a pig we had with us into pulling it while the rest of us were out of the room. It did nothing. Our rogue threw a dagger into the room to see if some sort of magnetic trap had triggered. Nothing. He ran in to grab his dagger.\n\nDoors at the sides opened up and freaking floating killer robots come out, run at him, and blender him.\n\nWe deal with the robots and leave the rogue in the room with his elephant-man Mammu henchman to guard him while we delve deeper.\n\nWe kick down a room, find a giant spider. Squash it. Fuck spiders. We loot the room full of bookshelves, find some old tomes and what looks like some scrub's spellbook, which may or may not be really valuable, we need to appraise it later.\n\nWe find another room, deal with the contents (some weird magic invisible net trap, an empty treasure chest), delve a little deeper, and find... some kind of strange pool, inscribed with text as follows:\n\n*\"May Father Moon’s forever changing face smile down upon he who swims these waters. Like the Moon himself, any who enters this still tide will find themselves changed. Perhaps in fullness, perhaps in waxing, perhaps in waning, but none shall exit unaltered. Gird your courage and swim, friend!\"*\n\nWe're... skeptical, to say the least. But the rogue's character pops up and says he wants a dip, so we head on back to collect him (we assume that the in-character piping up was his mage henchman, still with the group).\n\nMeanwhile, his Mammu henchman is dealing with the minor problem of a *fucking green slime oozing under the door holy shit what the fuck.* Through judicious application of sweeping aside the sand, pouring oil down, and lighting it as the slime oozes through the sand into the furrow, he manages to kill it (managing to kill a 2HD creature on a 1d4 thanks to godly bad HD rolls on the slime). \n\nWe make it back, pick up the Rogue, head back the way we came, promptly blunder (in one case literally) into a gelatinous cube. We mop it up without the dwarf getting *too* dissolved, find a fair bit of treasure (jackpot!) in the thing's gloop puddle, get the dwarf back on his feet, and get to the pool room without any further issue.\n\nReverently, we shove the rogue into the pool, and... he is transformed. His charisma score goes up by a point.\n\nAnother of his henchmen, impressed, climbs in and finds themselves transformed as well. We find out that it effectively lets you reroll one ability score of your choice, so a few more people go for dips. My sniper's tragically low (4) constitution becomes a healthy 11, my main character's utterly disgusting 4 Strength becomes a merely mediocre 8.\n\nThen Ghassan the Rogue jumps back in the pool.\n\nAnd is instantly dissolved into absolutely nothing, leaving the pool's waters black and lifeless.\n\nAbout twenty minutes later, when the laughing stops, we hogtie our second pig and throw it in the water, although it survives, sadly. And that's where we stopped for the night, to pick up the crawl tomorrow...",
        "created_utc": 1535873017,
        "upvote_ratio": ""
    },
    {
        "title": "[Pathfinders] The beginners campaign from lovecraftian hell",
        "author": "Teufel_Barde",
        "url": "https://www.reddit.com/r/gametales/comments/9c7grn/pathfinders_the_beginners_campaign_from/",
        "text": "Getting new players into the game has been, without a doubt, some of the most difficult and rewarding conundrum I have tackled over the years. One group in particular was actually from a fellow DM who was struggling to make something they considered 'fun', he was a good DM, but he was very much of the gygaxian school of DMing and did mainly contemporary fantasy. The group of four were actually interested, but they wanted something untraditional, not a tavern or anything of the sort. So I decided to co-DM with my gygaxian friend and use a few pathfinder modules as a base for my oh so cruel 'trial by fire' initiation.  \n\n\nWe helped them all make characters, my only stipulation was that they couldn't be from any unoffical/homebrew setting. This meant we ended up with an elven ranger from lord of the rings, a dragonlance lizardman cleric of tarkhsis, a human rogue from the world of conan the barbarian, and a harry potter human wizard. The backstories we kept to about a single paragraph each, the gaps we'd fill in later, though there was an ulterior motive as to why I had them keep their backstories nice and vague.\n\n&amp;#x200B;\n\nOne by one, we worked through the group, each of the newborn heroes experiencing a fear like no other. Each was chased down a hallway, or a tunnel, or through some thick, foggy woodland, whatever was tearing its way towards them could barely be seen, trailing bloody bandages behind itself, each time the scene ended in misfortune. The elf jumped off a cliff into the darkness below, the lizardman lost himself in the darkness after escaping the creature in the caves, the wizard was choked out in smoke from athousand fireplaces in the ministry of magic, and the rogue? He was the only one who fought back, being torn limb from limb, but never dying no matter how much he was shredded.\n\n&amp;#x200B;\n\nIn turn they woke up, now naked and badly bruised in some strange, dank cell together. They all rolled to try and remember, but even their highest roller could only remember what was his entire written backstory, nothing more, the worst of the lot being the rogue, who only knew a name, his name probably, Rodrick. They began to piece a few things together when they saw a faceless, palid, naked thing walk into the underground jail, moving without a noise on black tips for its feet, only to slip on a nurses outfit and a wig before her face shifted to match that of a stunningly beautiful women, the rest following suit. She looked like she was fresh from the shoot of a porno, soiled clothes and all. Afterwards she took a knife and started to casually cut a man tied to a table, peeling off strips of his flesh with a rusty razor before eating them.   \n\n\nThey used his screams to mask their attempts to open up the cell, which they pulled off with a nails and Rodricks overly dexterious fingers. One surprise round and two turns later, they had the creature laid out on the floor, rescuing the man once they were sure she/it/whatever was dead. He wasn't exactly useful to them in his current state, blubbering in fluent german, something about 'judas' and seemingly begging 'mein fuhrer' for something, a sense motive role allowed them to accurately guess he was begging for his leaders permission to go home. The rest of the cells were peppered with other people, some dead, others even more insane than the german from the table. The cleric slapped the man with a few basic heal spells and they took some time to help him calm down before running the gambit of their collective languages, eventually discovering that he could speak, of all things, angelic.  \n\n\nHe told them what he knew,starting with his name, Stefan, and that wherever they were used to be a safe place, a peaceful place, a floating manor surrounded by clouds. He had ended up here after fleeing the battlefield when his friends were killed by something called a 'tank', the people here were ethereal, almost dreamlike, kind enough to take him in and help him slowly recover from not only his injuries but the PTSD he was suffering from. But then the 'mustard gas' rolled in, no one could leave anymore, or come in, with those there already slowly being taken away until they came back again, replaced by these 'things'. He couldn't say anymore after that, breaking down into a babbling mess, begging for forgiveness from someone called joseph.  \n\n\nThey set him inside the cell they had gotten out of, took what they could from the room beyond the cells and headed upstairs. As Stefan had said, they were indeed in some sort of manor, but one that had suffered under its new owners. the floor was torn up, chains hung from the ceiling and walls up above, and a rank stench filled the air, the only thing left in tact were the window panes, keeping the yellow smoke outside. With little idea of what to do, they stuck as a group and slowly made their way down one of the halls, at which point I left to get a drink while my gygaxian friend had a field day conducting the group through the hellishly designed mansion.  \n\n\nThey fended off some more fiends and explored a decent amount of the first floor before realizing it might be best if they tried to find a safe place to rest, but the strangest thing was, none of them were actually tired. It was like they had no need for sleep, though the cleric and wizard would still need time to channel their energies, with the cleric in particular rather confused as to how he was using his. They pressed on, gathering bits and pieces of equipment here and there, with the ranger having to settle for a pair of butcher knives to make the most of his duel weapon fighting feat.   \n\n\nIn their first session they learned three important things, there was no escape as long as the mist was still present, this place kept people from getting tired or hungry and they were dealing with shapeshifters that were either smart enough to know shapeshifting wouldn't work, or too stupid to bother trying. Their next session opened up with them finding the last haven of sanity in this insane place, a barricaded section of the manor on the first floor with the people inside threatening to murder the party if they got too close. To gain their trust they had to bring bodies of the shapeshif-took them all of two seconds to just agree to doing that and brought all ten corpses they had murderified, and those were just the shapeshifters.\n\n&amp;#x200B;\n\nThey were let in and finally given some proper clothes to wear instead of the shabby scrubs they picked up along the way, a sign of good faith from the leader of this little pocket, a women by the name of doctor Honya. She was able to fill in a lot of their blanks, but the there were some very important things worth noting. She told them that everyone, not just the party, were suffering from amnesia to various degrees, and that diaries from other staff showed that this began around the time the fog changed colour, and that the dreams they had all experienced before coming here were not unlike those recorded by some of the final 'patients' who arrived here before the fog came.   \n\n\nFrom here on out they had a clear goal, figure out what the creature from their dreams was, and kill him. Meanwhile rodrick was still having problems remembering anything at all, seeming to actually get worse over time, to a point where he forgot what his face looked like...and lost it. Everyone nearly launched themselves at him then, but his cowering and fear showed that he was different to the other shapeshifters. Honya ordered everyone else to stand down and leave Rodrick and the rest of the party to her. In short order, they figured out another piece of the puzzle, the people who 'vanished' never truly left at all, it was still just those at the manor, just turned into these beasts, though rodtrick was clearly a defect of sorts, as he still had his mind.  \n\n\nThe rest of this mini campaign continued on with fewer developments after this, all of it building to the final encounter with the creature they eventually dubbed as the 'render-man'. They had no room to work towards, just a full list of everyone who had gone missing since this first started. Like many parties, they took the most sensible action and began crossing names off the list, killing every shifter they encountered, hoping to piss off the renderman enough to get him to attack, and that he did. By the time they had murdered about fifty of these things and broke some sort of alter they were praying to, he made his presence known, warping the room around them to make the shape of a five pointed star, with no exits. He fell from the ceiling first, trying to drag one of the players through the floor with him to get them alone, but failed on that attampt and had to resort to hit and run tactics with the players mainly getting damage off of delayed actions and attacks of opportunity.  In the end though, he was torn to pieces, sliced into tiny meat chunks.   \n\n\nHis high pitched wail was the fullstop in this particular chapter of events, as the manor slowly shifted back to how it was supposed to look, chains vanishing, damage being restored, even the memories of the parties past returned somewhat, not entirely. While the manor was restored, the yellow gas remained drifting around the base of the building. The death of the renderman was only part of the solution, the other half came from doctor honya, as she remembered a protocol to dispell such evils in these dire times. With the parties help, they were able to search the mansion and get a black, felt covered box with a white butterfly on it, inside was a glass one, made of obsidian. The doctor took it and whispered to the little thing before opening a window, tossing it out, only for it to take flight. Not long after, a figure, pitch black, more a humanoid shaped hole in space, carried in on butterfly wings. It took one look at the whole scene before snapping its fingers and sinking below the ground, some minutes later emerging with a few scrolls of ink soaked paper, which it handed do Honya through the window before fluttering off.  \n\n\nWhen asked about it, she told them that was the moonlight butterfly, a patron of the asylum of broken minds, which was where they had been for the entire campaign, a place between spaces for those needing a place to fix their heads and keep true insanity at bay. The party ended up staying there a little longer, getting themselves fixed up before they decided what to do next.  \n\n\nI don't Co-DM that campaign anymore, I left them to it after that inital introduction to the world of tabletop was done. I can only hope that they had some fun afterwards, with those same characters, or a new set, in a new world.",
        "created_utc": 1535843135,
        "upvote_ratio": ""
    },
    {
        "title": "5 Adventurers travel on a cursed ship to a cursed land",
        "author": "Kris_Bronze",
        "url": "https://youtu.be/DN_RAl1Idsc",
        "text": "",
        "created_utc": 1535832151,
        "upvote_ratio": ""
    },
    {
        "title": "[Vampire the Masquerade] 2 Camarilla Vampires Sneak Into A Sabbat Creation Rite",
        "author": "Kris_Bronze",
        "url": "https://youtu.be/0wTuiJa3J-w",
        "text": "",
        "created_utc": 1535830771,
        "upvote_ratio": ""
    },
    {
        "title": "The story of the game (Firefly Board Game)",
        "author": "GustavoBanan",
        "url": "https://www.reddit.com/r/gametales/comments/9bzee5/the_story_of_the_game_firefly_board_game/",
        "text": "I've been watching a lot of Wil Wheaton's show Tabletop recently, and he always talks about \"the story of the game\", or how the events and cards and dice rolls made would be explained narratively. Since I played his tabletop game of Firefly, I thought I would share my story.\n\nIn gameplay terms we were playing the scenario Harken's Folly. This means we had to befriend 4 underworld figures by completing jobs for them. We then had to go hack a server to obtain the location of a meeting. Finally, we had to travel to the meeting and charm our way inside to obtain some intel and win the game. The following is what happened.\n\nPicture 2 separate individuals:\nA rich gentleman out to become the universe's top information broker. And a gun runner with nothing better to do.\n\nThe gentleman immediately sets out to complete jobs for people. Since he is on his lonesome it takes him a while, but eventually he gets there. On the way a couple of the crew he hires get eaten by space cannibals, but he arrives at the hacking station.\n\nThe gun runner immediately hires other incredibly tough and incredibly stupid people, and bullies/shoots/explodes his way through as many situations as he can. He befriends the 4 underworld figures first, but due to greed he keeps taking jobs so he can hire smarter and more persuasive people. On one voyage across the universe the cops show up, arrest his medic, and take all the contraband he was supposed to deliver for a mob boss. He decides to give up on the jobs, but goes to try and hack the data himself.\n\nAt this point the two crews are in the same position: both want to hack the data. One is more balanced, but has been failing to pass through situations to get their chance at hacking the data. After a couple of tries they finally succeed, and are off to the final stage.\n\nThen we have Team Dipshit. These are 6 idiots, amongst them they have 11 guns, 2 mechanics knowledge, and 2 persuasion. The mechanics come from the pilot with a hacking rig, and the persuasion comes from one aforementioned idiot that gives him +1 persuasion while holding a gun, and a goddamn very fluffy pink dress. It took Mary bo peep and her 5 thugs 10 tries of bashing their skulls against the terminal until either the system broke or the cops, who we had alerted to our presence and granted us 8 warrants by this point, had decided to just let us win one and gave us the data we needed. And so we were off to the final stage.\n\nBy this point in time, the gentleman's crew had decided to take a couple of tries at charming their way through, went over to a nearby planet to buy more gear, went back to the meeting, stopping along the way to loot some contraband off derelicts may I add, and gave it another couple of shots.\n\nAt this point in time, the idiots arrived at the place, passed all their attempts to misbehave into the meeting, and had one final persuasion roll to make. One of the crew, a cantankerous old two-bit thug named Stitch, can roll a guns test as if it were a weapons test. And so after 10 tries to hack a goddamn server we caught up to the smug bastards who left us in the dust, and called the cops onto us, walked straight up into the meeting, and had our toothless hillbilly grandpa threaten everyone with a dead man's switch on a grenade for all their private data and won the game.\n\nAnd then probably that mob boss came and replaced our eyeballs with our testicles for forgetting to deliver his contraband.",
        "created_utc": 1535766512,
        "upvote_ratio": ""
    },
    {
        "title": "[World of Darkness] When things get really complicated with the Spanish Inquisition (A Change of Heart Ch 16)",
        "author": "adartagnan",
        "url": "https://www.reddit.com/r/gametales/comments/9btj7g/world_of_darkness_when_things_get_really/",
        "text": "&amp;#x200B;\n\nhttps://i.redd.it/7u6vw1na18k11.png\n\n[Chapter 16](https://arianedartagnan.wordpress.com/2018/08/31/a-change-of-heart-chapter-16/) is up, in which the head of the Spanish Inquisition seizes a beloved NPC, the trickster god of street orphans (who had the poor taste to pickpocket a priest), and severs his link to his human host.  This immediately causes the host body to age decades, so both human and god will die soon if the party does nothing.  Still having no control over her magic, Marina randomly turns into an owl and savages the Inquisitor with Life magic in revenge, but Ynez bodily blocks her and gets gashed too.  Oops.\n\nOn the bright side, the party has a bit of time to \"find\" (i.e. kidnap) a new child host for the trickster god, the Inquisitor has too huge of a crush on Ynez to move against the party, and the Paradox backlash (see [here](https://www.reddit.com/r/gametales/comments/984c3l/world_of_darkness_when_you_and_your_brother_swap/) and [here](https://www.reddit.com/r/gametales/comments/99y5um/world_of_darkness_when_two_pcs_switch/)) fades at last so Marina and Tel regain their original avatars and magical abilities.\n\nAnd then Tel turns into the prettiest Komodo dragon ever.\n\nThe table of contents is [here](https://arianedartagnan.wordpress.com/rpg-tales/a-change-of-heart-table-of-contents/).\n\nThe first post is [here](https://www.reddit.com/r/gametales/comments/8genjg/world_of_darkness_a_change_of_heart_chapter_1/).",
        "created_utc": 1535721481,
        "upvote_ratio": ""
    },
    {
        "title": "[D&amp;D 5e] Short actual play using a solo engine I designed (with lots of nice prose-y words to make it readable)",
        "author": "bionicle_fanatic",
        "url": "https://empaitirkosu.wordpress.com/2018/08/30/short-actual-play-using-mune/",
        "text": "",
        "created_utc": 1535661944,
        "upvote_ratio": ""
    },
    {
        "title": "[City of Mist] The obvious trap that wasn't",
        "author": "ThisOneCoconut",
        "url": "https://www.reddit.com/r/gametales/comments/9bkjwn/city_of_mist_the_obvious_trap_that_wasnt/",
        "text": "Okay, so this one is short and funny even though it ruined my (half-)carefully constructed plans at the time. I was the GM, and clearly overestimating my players' paranoia.\n\n**The context:** 21st century, modern times, except the arthurian myths were true-but-were-erased-by-history and arthurian figures are slowly being reincarnated into normal dudes and dudettes. When meeting another Awakened, they instantly know he or she is a reincarnation but not *who* this person was, and their memories are incomplete.  \nThe PCs are also aware that *all* Arthurian figures can be reincarnated, and possibly be enemies.\n\n​\n\nFrom the beginning, players decide on the artefact they want to start with as a group. After debating, they choose Lancelot's shield. The agreement is that they will, however, get it during the first session rather than from the beginning.\n\nPCs are Galahad, Elaine of Asholat, Bedwyr and Galehaut. Galehaut desperately wants to meet Lancelot once again, Galahad is Lancelot's son, Elaine was in love with Lancelot, Bedwyr wants to kick Lancelot's butt... Lancelot is kind of a running theme in the crew, and everyone would like to meet his reincarnation.\n\n​\n\nThe first session begins. Galahad briefly meets some shady dude claiming to be Lancelot, they fight \"for fun\", Galahad wins. Hearing his tale, PCs promptly deduce that this guy is too strong for them together to fight.\n\nIt's from this point onward that I should have understood that maybe I should not put traps for them.  \n\n\nThe next day, Bedwyr, an antiquarian who has been looking fruitlessly for possibly-arthurian items for *months*, get a warning for a shield that someone who obviously tries to conceal their identity is trying to sell. He recognizes the shield from his previous life, though he can't remember who owned it, only that he hated their guts. Symbols on the shield are a sword and water. 'Cuz you know, *Lancelot of the Lake.*\n\nCue nobody reacting.\n\nBedwyr asks for a meeting with the seller, who offers to meet alone, far from the city, by the river Test (yeah, really). Seller's email adress is [lnclt333999@gmail.com](mailto:lnclt333999@gmail.com).\n\nlnclt. LaNCeLoT. To think I thought I was being too obvious with that one.\n\nCue nobody reacting, except to ask why this obviously mundane event is being played out in the common chat rather than in private.\n\nBedwyr warns no one while I reflect upon my life choices, goes alone to a meeting with a disguised Morgan le Fay and gets cursed, the end.\n\n**Bonus:** half the party including Bedwyr's player took advantages such as \"suspicious\".  \n\n\n***Edit for clarity:*** *Bedwyr was cursed in a way that I knew would be very fun to his player and she is very, very excited about this. PCs will still get the shield, though in a way I hadn't expected. Nobody was harmed in this story except my definition of \"obviousness\".*",
        "created_utc": 1535642542,
        "upvote_ratio": ""
    },
    {
        "title": "[SR5] Rom, Evo and Jules I.T.",
        "author": "Caustic75",
        "url": "https://www.reddit.com/r/gametales/comments/9bfqpu/sr5_rom_evo_and_jules_it/",
        "text": "  \n\n**Part 1 – The Meet**\n\n&amp;#x200B;\n\nPCs – HMB (Hobo Murder Party)\n\nRaisin – Human, Rigger – Groups Voice of Reason\n\nMister Fuzzy Bottoms – Dwarf, Decker – Moral Compass of the Group\n\nBoomer – Elf, Street Sam – Biowared Speed, Stealth and Designated Marksman\n\nCans – Human, Street Sam – Cyberwared Close Combat Killer\n\nNails – Elf, Street Sam – Off Face\n\nMike(Will update with Characters name) – Elf, Mystic Adept - Assassin\n\nVic - Human, Street Sam ex cop groups tank\n\n&amp;#x200B;\n\nAfter a month long hiatus from their last gig a big run against EVO, the HMB is starting to get itchy for some work. Mister Fuzzy Bottoms is contacted about a Matrix meeting in two hours at a designated Host for a potential client. This is odd; usually their fixer just calls them up.\n\nMost of the team jacks in and goes on their Matrix meet. The host is described as an empty warehouse, shelves and all. A single door marked “Employee’s only” in the back. They open the door to find a single matrix persona present. He is dressed in Renaissance garb (feather in cap and all).\n\n“Hello. I am ROM. Sit.” His voice is monotone. He motions to the exact number of seats as there are runners present.\n\nFuzzy Bottoms – “I got a bad feeling about this.”\n\nRaisin – “You and me both.”\n\nROM – “I have been watching you for some time now. I am impressed with your skills.”\n\nFuzzy Bottoms – “Sh\\*t” \n\nOOC: I am getting ready to jack out. Keeping my finger on the eject button.\n\nRaisin – “You don’t happen to work for EVO do you?”\n\nROM – “A subsidiary actually named UtiliCrit”\n\nFuzzy Bottoms and the whole crew – “That’s it…let’s get out of here. I knew that EVO has been watching us.”\n\nROM – “They have.”\n\nFuzzy Bottoms – “Crap, Crap…Man let’s get out of here.”\n\nROM – “I am not here about that. ROM would like to hire you for personal reasons.”\n\nEveryone gets a quizzical look on their face at this point but they work it out quickly. ROM’s monotone voice and sudden reference to himself in the third person…ROM is a Digital Intelligence. There is much OOC discussion around the table about working for AI is never a good idea but they may as well do it since eventually they will rule us all and we need to get on their good side now.\n\nROM goes on to tell the group about his budding love interest with a co-worker at UtiliCrit, Jules a lead programmer. Problem is ROM is sequestered to UtiliCrit’s host and cannot leave.\n\nFuzzy Bottoms – “So what can we do to help you?”\n\nROM – “Three things. A small drone customization shop TubbsTech is working on a cutting edge human form drone. I require that. Secondly, I require you to secure a connection from UtiliCrit to the outside for me to inhabit the Drone. Thirdly, I am not good at talking to humans as you can tell. I require you to set up a date with Jules at her favorite restaurant.”\n\nBoomer squeaks – “Ohhhh a love story! We’re doing it!”\n\nRaisin – “I knew Boomer was going to go for this. Let’s talk about pay shall we?”\n\nFuzzy Bottoms – “And what kind of info you already know.”\n\nROM provides the group with a company info sheet on Jules that provides all the basic Human Resource data you would expect. As for pay he offers access to an EVO black account loaded with 250k new yen although there are certain exceptions. Only so much can be pulled out every week unnoticed or a tracer program will activate and alert EVO.\n\nNails – “This seems like a lot of work; sure you can’t throw in something else.” Gets 5 successes on a negation test vs. ROMs 1.\n\nROM – “A reasonable request. I will create false identities that should pass most scrutiny for each of your team as well. And give you the location and access code to a secret cache of supplies used by a black ops team I am aware of.”\n\nTeam agrees to take the job and logs out of the matrix.\n\n&amp;#x200B;\n\n((Sorry for editing or spelling errors, doing this from memory before I head off to work tonight.))",
        "created_utc": 1535596262,
        "upvote_ratio": ""
    },
    {
        "title": "Well.....time to get burnt to a crisp by a dragon.",
        "author": "bishaha",
        "url": "http://newradiomedia-recast.streamguys1.com/content/geektainment/20180824135258-PodquestersEp024.mp4",
        "text": "",
        "created_utc": 1535562751,
        "upvote_ratio": ""
    },
    {
        "title": "The Everywhere Queen: A 95-turn Total Warhammer World Conquest AAR",
        "author": "shoggyseldom",
        "url": "https://imgur.com/gallery/ofuSRLA",
        "text": "",
        "created_utc": 1535490638,
        "upvote_ratio": ""
    },
    {
        "title": "[5e Dungeons and Dragons Liveplay] Hyrule Chronicles Episode 13: Tools and Trinkets",
        "author": "ArticulateT",
        "url": "https://soundcloud.com/articulate-t/hyrule-chronicles-episode-13-tools-and-trinkets",
        "text": "",
        "created_utc": 1535482254,
        "upvote_ratio": ""
    },
    {
        "title": "On the troubles of transporting people living things...",
        "author": "misanthropester",
        "url": "https://newadthamtimes.weebly.com/season-2-session-4-part-1",
        "text": "",
        "created_utc": 1535406366,
        "upvote_ratio": ""
    },
    {
        "title": "ADND 2e. First time running this edition since 1999, player literally runs to the afterlife then wants to escape.",
        "author": "Kanaric",
        "url": "https://www.reddit.com/r/gametales/comments/9asyvs/adnd_2e_first_time_running_this_edition_since/",
        "text": "I'm running a 2e forgotten realms game using Hordelands content. To keep things short the players on a quest to find a shar outpost have allied with some gnomes who have a ice breaking steam ship to travel through the northern oceans. They come to their island, which was detailed in the hordelands box set, as having a glass spire in the city. Basically there are two factions who worship gond there, one who wants to destroy it and another who wants to build it. The builders think the tower will bring salvation to the world, the destroyers think it will burn the world in hellfire. \n\nThe players ally with the salvation sect, knowing Gond isn't an evil god. \n\nThey guard the tower for the night and with their skills and the fact a very smart player using the ADND 2e druid to it's fullest extent found a thief/illusionist who was trying to melt the tower beams with flammable metal (magnesium).\n\nThe players then arrest the remaining anti-tower cult people (did not kill a single one of them) and manage to convince the pro-tower cult to give them leniency. They pro-tower people believed once they finish the tower the anti-tower people would accept the \"truth\" and so they don't need to be punished as they were just afraid and misguided. \n\nAs they finish the tower it opens up and on the other side you have the light of heaven emanate from within. In there the players saw all sorts of fantastic clockwork and steam technologies. The gnomes mostly all go inside save a very small minority. \n\nThe parties rogue then runs inside. \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nUp to this point we changed the time at which we are playing. The player who plays the rogue said he probably won't be able to play anymore so I thought \"well ok, nice sendoff\" his character is in heaven now. WRONG\n\nThis player has kind of random acts of suicidal tendencies in the campaign so far and is lucky to be alive as it is. Since we've only played like 4 sessions with him so far nobody has really gotten annoyed yet. However idk if it's him or his roleplay but he basically is in character some kind of psychopath. In an earlier session there was a reward for capturing people who are, basically, bandits. I said you can bring them back alive but if you kill them all the guard captain needs is their head. The rogue then became obsessed with beheading EVERYONE even the alive and knocked out enemies the party wanted to interrogate. In the middle of discussing what to do with one NPC he constantly was saying how he wanted to behead the character lol. The party thinking this is his roleplay and EVERY SINGLE PARTY MEMBER being Lawful Good aside the druid whose NG (iirc) calls his character a psycho, which seems to annoy the player. So IDK if it's intentional or not. \n\nIt's funny with the head thing as well. They could have brought back the body. It's just for payment the captain wanted AT LEAST to recognize who was killed. That was the implication. Not \"Party of mostly-good players you must behead all and deliver them to me for my skull throne\". Punishment for banditry is death in this kingdom but they put people on trial lol. They did not want wanton murder. And this was implied throughout the time the party has spent in the city. The leaders of the city are a Duchess (LN), priest of Mystra, and priest of Lathander. Mystra priest is her personal priest. \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nAfter the player and gnomes enter the door vanishes. The island then begins to erupt in volcanism. The remaining gnomes flee to the players' ship. \n\nI basically was confused he did that and said smiled and said, \"well, you die, you willfully entered heaven\" and then described Gond's realm to him and how they accept them into the fold for his newfound piety. \n\nThe player was NOT happy and had a shocked look on his face. He then tried to describe all means where he can escape. He is only level 4 and he's just a cleptomaniac murderhobo thief lol. \n\nHe basically started to plead his character's case and obviously didn't want to die. IDK what he was thinking when he ran in there and nobody else at the table said anything. Most people were basically at a point of eyerolling from their facial expressions like \"seriously dude?\". I am a lenient DM usually and this was stretching my leniency. \n\nI basically had him encounter Gond who was welcoming everyone there. I had him plead his case before gond then roll a charisma check, he passed. He convinced gond that he is not a follower of his and was caught up with what's going on and entered. Gond was annoyed with his behavior and said he will need a favor from the rogue for his return, the character pled that he would do him a favor upon request and Gond returned him to the party's ship which was escaping the island. Gond basically said his covenant with the god can be revoked at any time if he doesn't do the favor Gond requests. \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nAfter a session the usual DM of this group warned me about this player saying he will do things like this and is a murder-hobo and annoying. I'm going to give him a chance but basically any \"gimmes\" after this is gone. We chose to play 2e for a more \"hardcore\" gaming experience. One of our priests is a level 2 melee character who rolled poorly at HP so only has 4. We've had near party wipes every session (so far no deaths, the -10hp rule has saved many). And i'm already running 2e about as modern/fun as you possibly can with some house rules to make the game more palatable to modern gamers. The main reason i'm running it to begin with is everyone likes how magic, magic items,  monsters, and classes work in 2e vs later editions and we wanted more risk. \n\nBecause of that I may have more tales in the future lol. ",
        "created_utc": 1535405232,
        "upvote_ratio": ""
    },
    {
        "title": "[Tabletop] How our campaign started",
        "author": "Schadenfrueda",
        "url": "https://www.reddit.com/r/gametales/comments/9an0cz/tabletop_how_our_campaign_started/",
        "text": "My favourite campaign that I have ever played is my current one. The DM is this girl with an incredible flair for drama and storytelling and a penchant for throwing us curveballs. \n\nThe way she started the campaign was most interesting. Our first session consisted of rolling characters, but once that was done, she kept in contact with all eight of us separately to flesh out character backstory, as well as the immediate circumstances before our meeting. Because none of us could all meet together again for a month, this meant smaller sessions with us one or two or three at a time. \n\nWhen we all arrived the next month for session two, she opened with all waking up in a prison cell. Over the course of the session, we each had to piece back together the events of the night before, starting with the classic tavern meeting that every party starts with, but also having to work out the fact that none of our memories of the night matched one another's, because, as it turned out, the DM had given us all slightly different stories for how we'd gotten there. Each of the mini-sessions she'd played with us had featured the same events and many of the same characters, yet from slightly different perspectives. \n\nOver the course of that evening, our characters had to work out who to blame for imprisonment, figure out what caused the riot that got us all sent here, learn about each other, and deal with shady and angry NPC prisoners who either blamed us for this predicament or sought to rob us. Our casual soccer mom who before knew nothing about the game quickly picked up on the diplomacy needed to keep our group together, this college student boy who loved the careless killing and stealing and raising of dead that comes with D&amp;D was pushed into developing a more complex backstory and even started to show cracks in his alignment, and all the rest of us, the more experienced roleplayers, were kept challenged and on our game the whole night. Our arguments were nearly all in character, metagaming was limited, and by the end every one of our characters felt detailed and tangible. It was quite a singular experience.  \n\n",
        "created_utc": 1535355832,
        "upvote_ratio": ""
    },
    {
        "title": "How Fortnite is Reshaping Story in Videogames",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=hycpfF22O7c",
        "text": "[deleted]",
        "created_utc": 1535274302,
        "upvote_ratio": ""
    },
    {
        "title": "Operation Greased Lightning -- Making Lemonade when RNGesus hands you Lemons",
        "author": "Nazmazh",
        "url": "https://www.reddit.com/r/gametales/comments/9ae1d2/operation_greased_lightning_making_lemonade_when/",
        "text": "So, we are taking two brand new players and one relatively new through a boxed campaign **[Forgot to mention in the title, but it is 5e DnD again]**. I'm not sure which, I don't really want to look it up and spoil myself as to story elements, so some of you may recognize elements. I'm also not 100% where the DM has made alterations to suit her purposes, so, don't worry if something seems off. Session one had us arriving at the town of Greenist as it was under siege by some sort of dragon and a cult of Tiamat, made of seemingly human cultists and Kobold minions.\n\nWe saved a group of humans and battled our way through the town to get them into the last certainly safe location in town - the keep. We were in rough shape, but everyone got in safely. We were approached by the local (magistrate? governor? mayor? authority figure of some sort -- I didn't quite catch who and wasn't writing exact notes this time around, like I was with previous campaign notes, since it seemed like I never got around to typing them up anyway) and we were asked if we could help. Thus we began session 2 today...\n\n*****\n**The party:**\n\n**Ardor** (aka Alistair Moonmarked, if you're on really familiar terms): Tiefling Paladin of Selûne *(played by me, so I might remember what he was doing, what happened to him, and his backstory, etc. a bit better)*. -- A young man raised as an orphan by relatively isolated clerics of Bahamut, more accustomed to training recruits and breaking them into a life of servitude. However, since the baby Tiefling had a crescent moon-shaped birthmark on his cheek, crescent moon-shaped horns, and a moon-shaped tail tip, along with lines of silver running through his horns and down his back. They tried to instruct him in the ways of the faith he was marked for, but there's not much formality to Selûne worship, and a lot of difference in the way Bahamut and Selûne clerics would run things, he's got a bit of a muddled education on the matter. He's working on figuring things out.\n\n**Ethel**: Forest Gnome Wizard (Illusionist) *(If you read my older stories, she's played by the only other veteran player at the table, who plays Dirk in the \"Best Heroes\" party. Although, the DM is a player from that campaign as well)*. -- A curmudgeonly old gnomish lady, who has recently taken up adventuring for some reason, though she's reluctant to open up as to why. Has a soft spot towards children. Carries a purse full of hard candies.\n\n**Rorik**: Hill Dwarf Cleric of [I'm not 100% Sure, this player is at the far end of the table from me and I haven't clarified] *(This player has at least some experience, but not much, I'm afraid I don't quite remember the backstory he's said for his character)*. -- I'm not entirely sure what has called Rorik to the adventuring life, but he has been steadfast and kind so far.\n\n**Libra**: Tiefling Druid *(One of the newbie players, I'm afraid her backstory much either. Will have to ask them about the stories if I do more recaps)*. -- A former acolyte who has shifted her worship more to the natural world. A kind soul at heart, but one who shows little mercy for those who would disrupt the balance of peace and the natural order of things.\n\n**Tarlan**: Forest Gnome Ranger *(The other newbie player. I do remember his backstory, because it's a bit more uncommon)* --  An interesting case. Has a haunted look about him, covers his head with his hat. Looks like he's scratching at a scar of some sort. Claims he's from the future and was exiled back in time \"to teach him a lesson\" of some sort. Not sure if he's lying, missing a few screws, or telling the truth we should take him seriously when he makes some of his disturbing claims. Still, he's effective enough in combat.\n\n****\n\nAfter the healer in the keep cast a special ritual to patch us up and restore our spells and abilities (necessary, considering the scraps we'd been in and work ahead of us for the night -- Ardor in particular had a nasty scar by his spleen where some kobolds had gotten some very lucky hits in just outside the keep's gate), we were given 5 tasks:\n\n1. There is a tunnel in the basement of the keep that could be used an escape route, but nobody's really used it in years. Somebody needs to ensure that it's safe and secure in case it needs to be used for an emergency evacuation of the keep.\n\n2. There were reports of a ship at the docks on the river with cultists running around. Maybe they were raiding the warehouses for supplies to take back to their stronghold. Maybe there were civilians there.\n\n3. There is a large multi-faith temple that is often frequented by travellers. Nobody is certain what has happened to it after the attack. It is likely that many took shelter there, as it is defensible. Someone should check on it, and maybe direct/escort survivors to the keep, if it is safe for them to move.\n\n4. There is a large granary in the town. The grain stores are crucial for the coming winter. We really need to prevent them from being destroyed or stolen by the cultists if the town is to survive beyond this night. Not to mention, if the cult takes them for themselves, that's going to be a boon for them.\n\n5. Finally, there is a prison on the north side of town. Nobody know what has happened to it in this chaos. While defensible, the guards and prisoners could be vulnerable to attack and are cut off from the rest of the survivors. Maybe the prisoners would even join up with the cult for a chance for freedom. Maybe they have some principles and don't want to end up as sacrifices - nobody really knows. Either way, knowing would be better than not knowing, and rescuing anyone and bringing them back to the keep would be best.\n\nAll of this should be accomplished before sunrise, because the usual supply caravans [and their mercenary escorts, which might have some extra muscle] were scheduled to arrive the next morning and it would be best to have as many people gathered together and a plan formulated as to what to do by then - either make a stand against what was left of the invaders, or make an escape - and it would be better to not have to go chasing down stragglers.\n\nAfter some planning, we decided to start with the tunnel, since it was closest, and seemed most crucial, especially since we'd be venturing further away with each other objective. The temple and granary seemed higher priority objectives otherwise. The docks were neutral priority, given that we didn't know exactly what was going on there -- river could be a means to bring in reinforcements and bigger beasties after all. The prison was deemed lowest priority, given its distance from the keep and the likelihood of it being a tough fight. We still do want to get there, but not at the expense of other goals, time-wise. We're going for efficiency. If nothing else, we'd hoped to check the tunnel then and head to the temple, which was the closest of the two \"other important\" objectives. We were directed towards the basement door and told to look for a large iron door. We were told that there should be a scout down there, but that he hadn't reported in, so the door should still be locked.\n\nWe made our way down the stairs. As luck would have it, everyone has darkvision. As luck wouldn't have it, there were a couple of kobolds down there waiting for us in the darkness. But we took them out quickly with only a couple of scratches. The large iron door was knocked off of its hinges. Damn. On the other side of the storage area, the passage narrowed quickly to a five-foot wide corridor, so not exactly much room to maneuver. We went through and found the scout KO'd, but breathing. Ethel slapped him awake, as only a cranky old lady can. Which naturally startled him, causing him to nearly strangle her until the rest of us calmed him down. We talked with him a bit. He cursed that the two kobolds and their flying friend **[Collective \"Whuh-oh\" from the group]** had knocked the door down after getting the drop on him, but was glad that it seemed like that was as far as they got -- someone needed to keep an eye on things, while someone else needed to see where this tunnel went though. He ran back to the keep to relay the development of the broken door and keep watch on the passage, while we pressed ahead **[We never Insight checked him, so I sincerely hope he was who he said he was, and not a cultist in disguise... Given what we overheard later, it does seem most likely that it was the case]**. We came to a locked double-gate, which Tarlan was able to pick open. However, it was quite rusty, so its creaking attracted a swarm of rats to our position. We swatted our way through them for a few rounds, mostly successfully. After a quick discussion, the gates were left unlocked - so that if the keep had to be evacuated quickly, the people wouldn't have to fumble for keys during an escape, seeing as the kobolds already found their way in anyway *[Collective Insight: Passed]*. Ethel did some quick prestidigitation to clean up some of the rust on the hinges so that the noise wouldn't attract rats or anything else next time, though.\n\nThe tunnel started to slant upward at this point, we could see light on the other side. Tarlan scouted ahead. He overheard voices talking - Cultists, talking about how they hadn't heard anything from the Kobolds they'd sent down to check the tunnel (no big loss in their minds), how they were eager to get their hands on more survivors, that sort of thing. He saw that it opened up into a warehouse on the exit of the tunnel. We didn't have much time to come up with a plan (Well, we could, but there was a lot to accomplish before the sun comes up). The tunnel was in theory a good bottleneck, since we were likely outnumbered, but at only 5 ft wide, we really couldn't do much fighting there. \n\nArdor decided that he would bait as many enemies as he could into the direct line of fire of the mouth of the tunnel, then the rest of the party could hit them with whatever they had ranged, or springing from the shadows. So, he casually strolled out and said to them something along the lines of \"Boy, I sure am a survivor of all this chaos, and sure appear to be lost and confused\" (Y'know, while decked out in armour, shield and morning star... and bolstered by some extra sewer smell thanks to Ethel's Prestidigitation...) *[Performance: Failed]*. He threw off the couple of cultists and their handful of kobolds for a few seconds before they swarmed him.\n\nArdor swatted one of the cultists, Tarlan shot her, and Ethel hit her with a Chill Touch, so she was dead before she got into striking position. One of the Kobolds got a good blast of Libra's Poison Spray and Rorik's Sacred Flame, so it dropped too. ...But Ardor was still surrounded at the front by the remaining cultist and a bunch of Kobolds, and one of the Kobolds was going for the large bay door out of the warehouse.\n\nThe rain of blows came in on Ardor. It was... not pretty, but he was still standing, barely *[1 hp barely]*. Libra used her Healing Word to give him a little bit of extra health and keep him from dying outright *[Unfortunately, the dice were a bit uncooperative and it wasn't much. Still, it was a bit better than 1]*. \n\nThen Ethel had an idea. An excellent, terrible, excellent idea. She cast Grease, centred on Ardor, who was currently surrounded. Everyone fell over. Ardor was first to his feet, but rather than hitting any of his prone foes, or moving away from the area and exposing his comrades to danger, he used the chance to throw a javelin at the Kobold who was struggling with the heavy door. A mighty heave and the javelin struck true, impaling the kobold to the the door! However, the momentum of the throw meant that even with his tail for added counter-balance, Ardor couldn't re-balance himself on the greasy ground, and he landed with a terrific face-plant. Just in time to be cut to ribbons by the Kobolds and cultist who stood up and moved forward on their turn. But, because Rorik had taken up position right behind Ardor, they couldn't move much further than that, and they all slipped in the grease again - Except for one kobold, who went for the door again.\n\nLibra had an idea to hasten the end of the battle, but it was risky, especially with Ardor being down in the middle of the grease - still, with Rorik right there to stabilize him, she went with it - Using her Druidcraft, she lit a torch and tossed it onto the grease-covered foes. The immolation was swift and decisive. Her fellow Tiefling was decidedly singed, but Rorik pulled him out of the fire (And may have heaved him directly into Ethel, but, hey, y'know, better than extra-crispy Paladin), and stabilized him (and just in time). Tarlan pinned the second kobold who was trying to open the warehouse door to it with a well-placed arrow, right next to its comrade. Ethel dealt the final blow to the last kobold who had not quite burnt to a crisp, with another well-placed Chill Touch.\n\nAs the party checked the room, finding four healing potions in the cultist's packs, off to the side (giving one to Ardor right away), they felt their strength recovering and themselves becoming empowered, as though the gods' favour shone down on them for their mission tonight **[Even though levelling up shouldn't technically restore HP and abilities on the fly, nor grant new powers until a rest, given that it's a long night ahead with lots of fights, the DM decided that the level-up would work like it does in video games. Her game, her rules. We don't get slaughtered. Rule of Cool sounds good to us!]**\n\nGetting our bearings, we realized that we were at the docks. Well, that's not what we had prioritized, but in the name of efficiency, we're here now, might as well keep rolling with it. We see a couple of small huts with lights on in them at the end of the dock. Doesn't look like much activity in nearby buildings other than the one we just cleared. Beyond that, there's a docked boat - a small trading ship, maybe. It seems like there's some activity on/in the boat, but not much on the dock  We're not that stealthy, collectively, thanks to Ardor and Rorik in heavier armour, so Tarlan goes and checks the huts out. A cultist is asleep in one, the other is empty. We deduce that the other cultist guard is likely on a patrol route of some sort *[Collective Insight: Passed]*. Tarlan slits the throat of the sleeping guard, and we all sneak up to the huts and hide in them (Rorik and Libra in one, gnomes and Ardor in the other because it would be a tight squeeze to fit all in one), propping up the body like he's still asleep (Ethel tidies up the mess)  *[Prestidigitation gets third star nomination tonight? You'll fully understand first and second star soon enough]*. There's a scroll with half a set of instructions for following runes like hopscotch on the dock to avoid alarms and traps.\n\nAfter waiting a few minutes, the other cultist knocks on the door of the hut, \"Hey, wake up! Your turn to walk the rounds! Hey!\" Dude is dead before he fully has the door open, between Ethel and Tarlan's readied attacks. Ardor shrugs from tense, readied stance to more casual \"Well, okay then\" stance. We find the other half of the instructions for getting safely across the dock and hide the body. \n\nQuick debate about what to do -- Is storming the boat o' cultists worth it compared to heading towards other goals? Temple is pretty close, and that was our higher priority. Decide that it doesn't cost us much to have Tarlan quickly scout the boat. He decides to avoid the whole mess that is the dock, and swims out to the boat (river is really slow here). He's pretty quick and quiet and starts scaling the boat (on the side facing away from the dock -- port side, I believe, ironically, because it's the least likely to be expected to be boarded), but then he loses his grip and falls in.\n\n...Making a big splash. (I mean as much as a gnome can splash, but still, big enough). **Lemons**\n\nThis causes a commotion from within the boat, drawing every cultist and kobold to the deck - 4 cultists, six regular kobolds, and one strange winged kobold. The all line up along the port side of the ship and start looking into the river for the source of the splash. Tarlan kept his head about him and swam under the dock, where he was able to stay out of side and come up for air. Meanwhile, everyone could clearly hear muffled cries for help coming from inside the ship.\n\nWell, it may not have been exactly how we planned it, but it just told us everything that we wanted to know - What their defensive capabilities were, what sort of purpose there would be to even bothering with the boat, and whether we would have to be careful in how we went about attacking it: A dozen individuals, rescuing hostages, and yes, because there were hostages to rescue. **Lemonade**\n\nAnd we now had an opportunity -- They were all distracted, looking off to the other direction from us, if we went carefully and quietly, we might be able to catch them off-guard. Easier said than done -- with two decidedly not-stealthy group members, and our ranger currently under the dock, but capable of rejoining the push. Also, a long, alarmed, and trapped dock between us and them.\n\n\"Thunderwave.\"\n\n\"Thunderwave?\"\n\n\"Thunderwave.\"\n\nWe had debated having Libra use Thunderwave at the earlier battle in front of the keep gate, but we didn't want to draw the attention to ourselves when we were wounded and trying to get wounded villagers to safety. But this was a large group. Clustered together. Near an edge, near water. Not swift-moving, not deadly, but certainly inconvenient. This could work. Might be worth spending a spell slot.\n\nLibra tried to move stealthily and carefully along the dock. The plan was for her to go ahead. As a druid, she'd have a better chance of going unnoticed and getting that surprise Thunderwave without the clunky heavy-armour squad blowing their stealth checks. So we readied some actions and let her go ahead, while Tarlan would carefully make his way back to shore on his turn.\n\n*[Libra's stealth check: 3]*\n\nLibra immediately set off a rune-based alarm. Ethel's readied action was to cast a Minor Illusion in front of her, looking like a crate. This meant that the cultists who were distracted wouldn't immediately recognize the source of the alarm buying us some more time, but they were turning their attention towards the dock. It also meant that they would hopefully not focus their attacks on the slightly-squishy druid.\n\nEthel had another idea. She cast Grease again. At the mouth of their boat/the ramp down to the dock. Ethel is a fun friend to have around.\n\nSpeaking of drawing fire from the squishy druid, Ardor started making his way carefully down the dock, throwing stealth out of the window -- Banging on his shield and shouting, but carefully following the pattern to avoid traps (alarms didn't really matter at this point).\n\nThe kobolds rushed to the ramp -- two of them slipped, sliding right off the dock into the river due to their momentum; two managed to keep their footing to the end of the ramp; and the final two slipped at the top of the ramp, but didn't fall off the boat. The cultists, following behind, stumbled on the kobolds -- two slipped in the grease, while the other two were stuck behind the pile. The flyer whips a stone at Ardor with a sling, but it's pretty easily blocked\n\nTarlan gets back to shore, everyone else moves closer to the rest of the fight as best they can. The flyer pulls out twin scimitars and does a dive-bomb fly-by of Ardor, Libra, and Rorik along the dock, but only really seems to nick Rorik. Ranged fighters take potshots at the flyer -- its blood looks very unusual compared to all the kobolds we'd killed so far.\n\nArdor and Libra block the dock back-to-back, in lieu of better positioning for now. The cultists and kobolds get to their feet as much as they can, but it's still a mess. Two kobolds rush the Tieflings. Libra crits the kobolds on her side as a reaction to it getting too close (she couldn't do much else, so she readied an action), killing it instantly. Ardor clonks the other kobold on his turn, taking it out and opening the lane.\n\nRiver kobolds swim down the dock. Other kobolds and cultists press the attack and keep coming down the ramp. Flyer doubles-back, drinks a strange, green potion and breaths fire at Team Tiefling *[Well, there's a bit of luck for us]* and it's every bit as ineffectual as breathing fire on tieflings usually is, though they both are lit up.\n\nBut, everyone is clustered together nice and neat at the edge of the dock/ramp. It's time. Ardor nods, understanding what's about to happen.\n\nAnd that it's probably gonna suck, at least a little, for him personally.\n\nLibra steps forward into the middle of the clusters of baddies and lets loose the crack of thunder. It knocks just about every remaining enemy out of the fight - including the river kobolds. Ardor is flung off the dock and into the side of the boat with a smack *[Con save: Failed]*, and less-than-gracefully splashes into the river *(Well, that's one way to put the fire out)*. Only the flyer and only cultist survived the hit (cultist was out of range, flyer passed his save). \n\nCultist sacrifices himself and his energy feeds into the flyer. Its wounds start to heal and it gets super energetic and starts moving quicker. It zooms towards Rorik and breaths frost breath towards him and Tarlan, missing Ardor in the water below. It dodges/shrugs off a couple attacks before it breathes deeply in again and exhales a spray of acid, but the cloud is thin and patchy, missing everyone. A few more hits from everyone (including a well-placed Ray of Sickness, I think, from Ethel) and a soggy, bedraggled Ardor climbs on shore, draws a javelin and lobs it through the side of the beastie, bringing it down once and for all.\n\nThe party rescues the hostages (save for the few poor souls that had already apparently been used as sacrifices) and gets them into the warehouse tunnel, towards the keep. Just as they decide to move on towards the temple, they here the roar of the dragon making another pass at the keep **[Session ends for this week]**",
        "created_utc": 1535270633,
        "upvote_ratio": ""
    },
    {
        "title": "Who Inquisits the Inquisition? We do! Pts. 5&amp;6",
        "author": "RFLS",
        "url": "http://www.giantitp.com/forums/showthread.php?554504-Who-Inquisits-the-Inquisition-We-do!-(A-Star-Wars-story)&amp;p=23324056#post23324056",
        "text": "",
        "created_utc": 1535260309,
        "upvote_ratio": ""
    },
    {
        "title": "Flinging and Flame",
        "author": "Waffletimewarp",
        "url": "https://www.reddit.com/r/gametales/comments/9a86g9/flinging_and_flame/",
        "text": "The group I’m DMing has a lot of fun characters to develop, but the frontrunners are the Dwarf of indeterminate sex Cleric of Light and the Goliath Barbarian. \n\nThe Dwarf wanted to use the domain of Light simply to have access to Fireball later. She also is continuing her minor goal of taking Goblins captive. I have yet to discover why. \n\nThe Barbarian however has made it his goal to throw every member of the party.\n\nFirst encounter: throws the aforementioned Cleric into a crowd of goblins since she has a stupidly high AC, then throws the Tiefling Bard out of the way of another group of goblins. \n\nThen at the end of the dungeon and after the Druid has become a Bear, a group of rival npcs are getting ready to escape. Now I had planned for this to be essentially a cinematic moment for exposition, but then I hear the Barbarian-\n\n“I throw the bear.”\n\nThree down, two to go. ",
        "created_utc": 1535215723,
        "upvote_ratio": ""
    },
    {
        "title": "[Tabletop] Our Pet Beholder",
        "author": "Schadenfrueda",
        "url": "https://www.reddit.com/r/gametales/comments/9a26tk/tabletop_our_pet_beholder/",
        "text": "(Dungeons and Dragons 5e) \n\nSo, our (mostly) tenth-level party was doing a dungeon, and the boss was a beholder named Gillithos that enjoyed creating nasty mind-control devices to turn random monsters into organised soldiers. We were freaking out at the time about this fight because his minions had already killed one of our own, the bard who was the comic relief of this group of adventurers who to a one dealt badly with stress, both as players and as characters, and also because his last miniboss had a curse that gave two of our remaining five, including our tank, disadvantage on mental saving throws for an hour, a lethal handicap against beamed spells. Trapped in a cave full of monsters and with nowhere to hide, we figured we probably had to confront this monster or go wading through a sea of minions and die ignominious deaths at the hands of goblins. \n\nMy character, a changeling druid named Lana Firetongue, a naïve fourteen-year-old with a penchant for causing random chaos and coming up with crazy plans that somehow work, finally stumbled upon her masterpiece of stupidity. Unlikely to survive a confrontation with a hostile beholder, why not make it friendly? So, without telling the rest of the group, mind you, she stealthed into the beholder's laboratory, and attempted to hunker down for a full minute. I got a total twenty on my stealth role for getting into the room, exactly one above the beholder's passive perception, which had me rather worried because its eye, should it ever be pointed at me, would dissipate Pass Without a Trace. \n\nJust as I started casting my spell, one with a verbal component, mind you, the Gillithos looked towards me, dispelling my stealth spell. I had to make a stealth role at disadvantage to keep from being seen while doing this, and rolled a natural two. Our DM made a perception role for Gillithos, and rolled a natural one; this resulted in him knocking over a piece of lab equipment just as he thought he heard a noise, and having to deal with that. I was, for the moment, able to continue my work. The rest of my party, meanwhile, was freaking out, running around like headless chickens unable to find their healer and not long from a confrontation with a group of minions. \n\nAnd, finally, with one more skin-of-my-teeth successful stealth role, I unleash my spell. Rising up from behind the desk where I'd been hiding, I let forth my Geas. The beholder turns around, hit by the spell just before his anti-magic cone would have prevented it, and rolls a natural one on his will save. \"What shall you have of me?\" it asked me. Surprised that it worked at all, and that I wasn't immediately hit with its disintegrator guns and killed with an earth-shattering kaboom, I just said, \"Help!\" \n\nAnd so help it did. It rose out of its lab and started slaughtering its armies. After a few rounds, every hostile creature around us was gone, and it disappeared to visit more death upon its own minions. After I explained to the rest of the party what I'd done, I managed to convince them to keep it around. After some time, it returned, gleeful at all the death it had just caused, and I gave it the overall Geas command to help me become max level, which it agreed to surprisingly willingly, since that meant more death and slaughter. \n\nThus concludes the story of how our party acquired Gil, our beholder companion, who was often found as a death laser tarantula on my shoulder. He later died during a higher-level encounter, but to this day I have a sketch on my wall of a spider with eight stalk eyes. \n\n",
        "created_utc": 1535152562,
        "upvote_ratio": ""
    },
    {
        "title": "[Pathfinder] One world to save many others.",
        "author": "Teufel_Barde",
        "url": "https://www.reddit.com/r/gametales/comments/9a21e5/pathfinder_one_world_to_save_many_others/",
        "text": "A weapon is neither good or evil, it is the man who decides what to do with it that dictates what its power is used for. These were the final words spoken to a young swordsman before being handed a parting gift from his master, the final sword from a rack, the last of five, with the other four given to his fellow apprentices. It was a cold, sleek, black thing that seemed to eat all that touched it, light, heat, even the force of the wind. Just touching its surface was enough to chill his blood, and holding the edge for too long made spots appear in his vision, it fed on whatever it could, and cared not for the source.\n\n&amp;#x200B;\n\nThis was the specters nail, a legendary and cursed sword that was given to Holden Melvolt after his two years of training to become a swordlord (reworked by me to make the prestige class actually viable.). With it he returned to a crater in the middle of nowhere to meet up with the old gang. Most of them arrived upon the agreed date, not all came back, and none of them were the same, but those who came were stronger than ever and ready to finally push beyond the realms of this small world and out into the multiverse. With a hop, skip and a jump the remaining four heroes of the original six delved through an arcane portal into the elemental planes and began to pick up a trail they had let run cold in favour of preparing for the literal hell ahead.\n\n&amp;#x200B;\n\nTheir goal was a simple one, find the duke of hell suluivick, take back the soul gem containing the souls of their home planet, kill him. It was a tall order, but they hadn't gone to all that effort to hone themselves for nothing. They started on the plane of fire, propositioning djinn sultans for favour in exchange for work, the kind of work, eventually building up a significant debt of favours in their favour after playing the game of politics within the copper city, even earning one wish from ruler of the first flame himself. They then repeated this process across the four planes, bouncing between them all for a decade, earning a reputation among the stars as some of the most dangerous sellswords in existence. Holden clashed swords with everything from angels to the spawn of an elder god, each time coming out victorious, learning more about the art of the sword with practice and from studying his enemies. By the time the decade was done he had become known as the black wisp, a phantasmal swordsman clad in an ethereal armour that made him all but impossible to hit and felled foes with scratches from his blade.\n\n&amp;#x200B;\n\nWhen it came time for them to execute their plan, they were even more detached from who they originally were. They even considered on giving up on their goal of saving their homeworlds souls, but they had come this far, made so many deals, killed so many people, going back now was an option, but not one any of them were willing to take. It had become a sunk cost at this point, two of the four cared, the others had grown apathetic to the cause, but they came along in the end, to finally put this to rest. So saying they called in all their favours, obtaining an army of otherworldly beings, transport to 8th circle of hell known as Caina, specific gear to make their assault easier, and most importantly of all, permission from the archdevil Mephistopheles to actually conduct this attack within his realm, so no other outside forces would stop them from taking their revenge.  \n\n\nThey were dropped into the tower of rusted iron and chains at its bottom level, surprising the bulk of suluivicks forces as they stormed upwards, killing all that stood in their way with ease at first, but in a matter of minutes they were met with hard resistance, enough to drag their advance to a stand still. Even with angels and djinn on their side, it really did get down to the main party cutting off the heads off the enemies leaders, slaughtering one after the other, taking one bloody step up the spiral at a time, supplies slowly dwindling with their allies falling left and right. Against all odds, they actually managed to kill every last defender, leaving only suluivick and the three remaining party members, their friend  dying along with a dragon after killing it mid air.  \n\n\nAt the top of his tower was a room, like an observatory, its walls covered in thousands of shelves, each holding a huge crystal the size of a bowling ball. Sitting at a large table depicting the map of some unknown world, dressed in fine velvet dyed the deepest purple, was Suluivick, the devil who's plan they had failed to stop all those years ago, his cultists having enacted world wide genocide in his name, sealing the souls of that planet into an orb for his use...that being a simple hobby of collection. He only glanced at them before taking a wisp from the orb next to him, sucking it down his spiked gullet casually, the cries for help were clear as day, the voice unmistakable in the silence of the moment, it was the soul of the clerics sister, now lost forever, used as a snack.\n\n&amp;#x200B;\n\nThey hammered into him with everything they had, spells of timestop and wish were burned, single use magic items of crippling arcana and even a sigil of holy consecration was burned into the ground to sanctify this ground for a short time. They hit him hard and fast, but despite their best efforts, he still proved to be too much of a challange, for the wishes were counterspelled, effects were resisted, even the specters nail couldn't siphon off enough of suluivicks energy to make him vulnerable in time to capitalize on it. Thats when holden had a plan.  \n\n\nWhen he got the chance, he raised his sword...and killed both his friends, his sword drinking in their souls, suddenly getting a huge boost to power from such large sources of energy, allowing Holden to weather one more round of suluvicks attacks before making another bold strike, aimming for the globe that contained the life force of his home world. For a moment, for that tiny amount of time, as all those souls flowed through the sword, it was satisfied, it hungered no more, and with that sudden sating of the eternal hunger, came a new power. Holden found himself wielding all that excess spiritual energy, though forced to listen to the anguished wails of billions as they were slowly eaten away, nearly driving him insane. With the specters nail, he hit the archduke, launching a surge of raw, unfettered energy at him that atomized his very being, leaving nothing behind, save for the marks left in the very fabric of space time from the blow.  \n\n\nHe took the soul gems of all the other worlds and made use of one last favour in the form of a whistle, calling Mephistopheles to complete the contract. There was a price for being able to launch this assault, that being the soul of whoever killed suluivick, Holden didn't surrender his right away though, making a secondary deal with him to delay claiming his soul in return for the specters nail...The look on his face when Mephistopheles declined and we started up another round of combat was priceless. And the look on my face when he said he snapped the final 'stick of timestop' he had kept throughout the final fight and purposefully failed using a planar cube to escape was even better.\n\n&amp;#x200B;\n\nHe took the orbs to heaven and left them in the angels care before returning to the dead husk of a world he had once called home, laying out a mat and stripping off all his worldly possessions, took to his knees, and held the specters nail in his hands. Without anyone to talk to, without anything to return to, without anything to justify living beyond this point and no desire to go to the afterlife, he ended himself there with the sword, letting it devour him. \n\n&amp;#x200B;\n\n//\n\nFor those of you wondering what on earth the specters nail was, it was an artifact class weapon that granted various bonuses depending on the number of creatures killed with it, with said bonuses going away over time as the sword 'digested' the spirits of those slain. Bigger souls also counted for multiple souls, and his two friends, when combined, were the equivalent of ten soul charges for the sword, which was enough to grant him the ability to use Haste with it.",
        "created_utc": 1535151332,
        "upvote_ratio": ""
    },
    {
        "title": "[World of Darkness] When two PCs switch personalities halfway through a campaign (A Change of Heart Ch 15)",
        "author": "adartagnan",
        "url": "https://www.reddit.com/r/gametales/comments/99y5um/world_of_darkness_when_two_pcs_switch/",
        "text": "&amp;#x200B;\n\nhttps://i.redd.it/960izny318k11.png\n\n[Chapter 15](https://arianedartagnan.wordpress.com/2018/08/24/a-change-of-heart-chapter-15/) is up, in which Marina and Tel basically swap personalities.  In a stunning development, Tel, who used to hate reading, develops a passion for the ancient and venerable Enochian language.  Marina the erstwhile bookworm, on the other hand, moons over her dead lover's diary and swans about smiling at NPCs and charming them into letting her have her way.  (How often do you and your friend get to roleplay each other's PCs halfway through a campaign?!)\n\nThe table of contents is [here](https://arianedartagnan.wordpress.com/rpg-tales/a-change-of-heart-table-of-contents/).\n\nThe first post is [here](https://www.reddit.com/r/gametales/comments/8genjg/world_of_darkness_a_change_of_heart_chapter_1/).",
        "created_utc": 1535123093,
        "upvote_ratio": ""
    },
    {
        "title": "[5e Actual Play Podcast] Dungeons, Dragons, and Dives - Episode 22: Carrion, My Wayward Son",
        "author": "popcrash3",
        "url": "https://www.podbean.com/media/share/pb-qyrpi-97be57",
        "text": "",
        "created_utc": 1534985582,
        "upvote_ratio": ""
    },
    {
        "title": "the 1 hour long kung-fury campaign",
        "author": "Mideanon",
        "url": "https://www.reddit.com/r/gametales/comments/99i520/the_1_hour_long_kungfury_campaign/",
        "text": "in this rpg, there are 3 stats           \nbeat-up     \nsneak     \ncop     \n\nso     \nour cops are called on a gang shootout      \n\"fuck off cops, or the illuminati will make you pay\"     \nthey beatup the gang                     \nback at precinct               \n\"what the fuck guys, you beat them up too hard and now they are suing\"               \n\"gimme your guns and badges\"                                                                 \nthey beat up the chief                    \nhe hits a wall, and a painting falls                    \nreveals illuminati triangle          \nsuddenly all cops start gunning for our protags          \nthey are beaten off as well          \nthey do some cop stuff               \nfind a guy          \nwho knows a guy          \nwho knows a guy          \nwho knows a guy whos being held by nazis          \nthat knows where the illuminati are               \nso they come to the nazi base, sneak a bit, beat up some nazis          \nfind the cell               \nsuddenly               \nhitler is holding the guy hostage          \n\"how about a truce\"          \n\"ze illuminati ztole my time machine\"          \n\"i want it back\"               \nthey disagree          \nthey realize he is also known as kung fuhrer          \nhe jumps out the window, hostage in tow          \nhe boards a plane and starts escaping               \none of the cops jumps on the wing               \nothers board another plane               \nthe dude on the wing is held back by hitlers pistol, but not for long          \nhe enters               \nthey have a fight          \nhitler falls out          \ninto the sea          \nthe other cops decide to crash the plane into hitlers fall spot                    \nhe later picks them up and drops the guy off               \nonward, to new york               \ntarget, a huge skyscraper, owned entirely by illuminati          \nfirst 2 cops jump onto the rooftop               \nthird one says fuck it and crashes the plane into the skyscraper          \nthey fight through the skyscraper as it is falling down          \nthey get to the machine          \nescape          \ndestination, some random battlefield          \nthey find and decide to beat up hitler               \nthey successfully do so and come back to the present          \nsuddenly crisis               \neverythings in red               \ncommies won the wars                    \nfreedom is in danger               \nthey use the time machine again               \nthis time try to find lenin and stalin               \nlenin and stalin are formidable foes               \nso is the red army               \nbut eventually they perservere               \nand beat them up          \ncome back to the present                    \neveryone is free                    \nthey sit down back at the precinct               \nanother job well done                    \nand that was the end of an hour long session               ",
        "created_utc": 1534979452,
        "upvote_ratio": ""
    }
]