[
    {
        "title": "Something Really Fucked Up Happened That I Can't Explain [Long]",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/77kngi/something_really_fucked_up_happened_that_i_cant/",
        "text": "[deleted]",
        "created_utc": 1508485327,
        "upvote_ratio": ""
    },
    {
        "title": "[Humour] When the Matrix is low on VRAM",
        "author": "[deleted]",
        "url": "https://i.imgur.com/fYOemCZ.jpg",
        "text": "[deleted]",
        "created_utc": 1508484441,
        "upvote_ratio": ""
    },
    {
        "title": "Naturopathic Clinic Toronto, Rosedale, Yorkville - Summerhill Naturopathic",
        "author": "MakenzieCannc5",
        "url": "http://summerhillnaturopathic.com/",
        "text": "",
        "created_utc": 1508469966,
        "upvote_ratio": ""
    },
    {
        "title": "Story from years ago. Seems like this is a good place for it.",
        "author": "recondonny",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/77gbyd/story_from_years_ago_seems_like_this_is_a_good/",
        "text": "I honestly don't remember how old I was at this point, probably 16ish. I was sleeping over at a friend's house, had been spending time over there since the 1st grade. The house was in a fairly rough neighborhood, so what I saw wasn't overly alarming at first. I had been sleeping on the couch in the living room and I woke up earlier than everyone as I normally did when I wasn't sleeping in my own bed. I had been awake for a few minutes and decided to look out the window to check on the weather or something. My friend's car was parked along the road. He had a Ford Taurus from  around 2000 with kind of a down-sloping front. There was an old obese man with gray hair and gray beard sitting in an old car, smoking a cigarette, that had seemingly drove directly into the front end of my friend's car, with his front end almost suspended on top of my friend's more \"slope-like\" front end. I was obviously spooked and ran into my friend's room to tell him. He was a mega-ass-hole when he slept, so after about 2-3 minutes of trying to wake him up, I decided to go look again and there was nothing. Assuming the guy had driven off, I went out to assess the damage. Wasn't a scratch on the car. Everyone says that I must not have been fully awake, but I know what I saw. Still gives me the shivers to this day.",
        "created_utc": 1508437274,
        "upvote_ratio": ""
    },
    {
        "title": "Why is this sub so inactive relative to its size?",
        "author": "CrouchingPuma",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/77g8q2/why_is_this_sub_so_inactive_relative_to_its_size/",
        "text": "It has almost 30,000 subs, but posts rarely manage more than a few dozen upvotes and the top post of all time is a photoshop from 4 years ago with less than 1,000 upvotes. What gives?",
        "created_utc": 1508436523,
        "upvote_ratio": ""
    },
    {
        "title": "Platonic Solids and SOREMs",
        "author": "FlowerAshley",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/77ftys/platonic_solids_and_sorems/",
        "text": "Not sure if this is a Glitch or if it has some meaning to it or what, but it's different and Id love some insight or thoughts...   When I was a child I used to have some very strange dreams. I remember them happening every time I would fall asleep from a very early age, and I remember them starting to go away and fade somewhere around 12 years old. It would start as I was falling asleep. I was aware that I was starting to fall asleep. The 1st thing that would happen is I could feel my aura or my energy. Hard to explain but it felt like my body, mainly my extremities, would poof out or get larger, like I could feel the energy surrounding each finger. Sort of like a buzzing poofy feeling. Like when you put the opposite ends of a magnet together. I could move my fingers a little bit and feel it, still staying in that in between asleep and awake state. Then I would go deeper into sleep. The moment I would click into sleep, I would enter a strange dream realm. It was black and infinite space. Not like the back of your eyelid that seems like a black sheet, but infinite space and depth of blackness. Then the shapes would come. Platonic Solids, all of them. They would enter the space from far far away and slowly come closer to me, and then pass me. I had no body, just seeing with my eyes. I could look around in this space and see the solids go past me and keep going behind me. They would get larger as they came towards me, and smaller as they went behind me. They would come 1, 2, or 3 at a time, different shapes and in different colors. Some of them were one solid color and some were colored metallic like. As 1 or a group would pass by there would be more coming in the distance. There wasn't any sound and I always had a feeling of amazement and wonder. This would happen for a few minutes, maybe ten, and then I would drift off into normal dreaming. \nI always wondered what the dreams were. As a child I assumed it was just something that happened to everyone, like it was your brain getting ready to dream and going into abstract thought or something. Now as an adult and looking into it, I realize this does not happen to everyone, in fact it is pretty rare. I should mention that at this age I had a really hard time falling asleep at night and would generally lay awake in bed for about 3 hours before this would happen, so maybe I was doing some sort of meditation and relaxation without really knowing what I was doing. I have realized as an adult that I do not have normal dream patterns like most people do, I have SOREM sleep and dream immediately after falling asleep, it doesn't take me 90 minutes to get to REM. I do not have narcolepsy, SOREM is a big indicator of that but I do not have it. These Platonic Solid dreams started to go away around 12 years old, I remember noticing that they were happening less and not lasting as long and eventually went away completely. It wasn't until last year (35 years old) that I started really thinking about them again and started researching them. As an adult, sometimes when I take a nap or fall asleep watching tv, I have really vivid dreams and when i wake up they feel like they are really important and a message is trying to be related, but as soon as I wake up the dream starts to suck put of my memory super fast and I can usually only grab onto the very last part of it, and make no sense if it. I actually didn't even realize that other people don't dream right away until researching sleep and dream cycles.  \nI have been trying to find a way to get the Shape Dreams to come back. I have been learning about meditation and enlightenment. I have had 1 experience in the last 2 months where I felt my aura again as I was falling asleep, 1st time that has happened since I was a kid.\nThoughts? ",
        "created_utc": 1508433036,
        "upvote_ratio": ""
    },
    {
        "title": "Displacement",
        "author": "techybae",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/77ehdi/displacement/",
        "text": "This story takes place in 2006. I was 19 and was about to start my first semester of Uni. I'd arrived late in the evening in the small town in northern Sweden where the campus was located. The town was a few hours drive from my home town, so I'd borrowed mum's car and loaded it full of my stuff. I spent much of the evening unloading the car, and by the time I was done, it was past midnight. Northern Scandinavia is known for the midnight sun, but as this was in the fall, and the weather was cloudy, and owing to the practice of not turning on the street lights at night until October, the town was nearly pitch black.\n\nI'd not secured a parking space by the dorm building, and no open spaces were available outside. I got in the car and drive around looking for a parking space. A few blocks over, I noticed a bright flash of light. As I rounded a corner, I came upon a parking garage, several stories tall. It was one of those self service ones, no dates or anything but with a ticket meter on each floor. I drove up and found a free space near the meter and the staircase landing in the second floor. I parked my car and went to the meter. It wouldn't take any of my coins. Annoyed, I went down to the ground floor and tried that meter as well. Same thing.\n\nFrustrated and tired, I swore and checked the meter, it had one of those \"I'm case of technical difficulties\" stickers with a phone number. I dialed it, thinking that if they had a system outage they might be able to give me a code or something to put in my windshield to not get ticketed.\nOne time went through, then a beep and \"The number you have dialed is inactive\".\n\nI gave up and decided to try my luck elsewhere. My fault or not, no one has as ever successfully disputed a picture parking ticket, and as a student I could Ill afford one. Just as I had rounded the street corner, the same flash of light as before, but brighter, lit up the night again.\n\nI eventually found a space with a meter that worked. I'm went back into town the next day. And the garage was gone. Replaced by an empty lot.\n\nI still live in this town. A parking garage was built on the lot in 2012... I swear it's the same one I entered in 2006.",
        "created_utc": 1508420927,
        "upvote_ratio": ""
    },
    {
        "title": "Reused animation for the sun players",
        "author": "thepobv",
        "url": "https://gfycat.com/PrestigiousWeeGreyhounddog",
        "text": "",
        "created_utc": 1508392624,
        "upvote_ratio": ""
    },
    {
        "title": "I'm having an existential crisis",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/7763ke/im_having_an_existential_crisis/",
        "text": "[deleted]",
        "created_utc": 1508328412,
        "upvote_ratio": ""
    },
    {
        "title": "Sound Change?",
        "author": "Spagettlover",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/7742gw/sound_change/",
        "text": "I'm not sure if this is a glitch in the matrix or something else entirely. Last year I was a host at a restaurant that I'd also gotten my best friend hired at. We had just gone off a wait and were standing by an empty booth near the host stand talking when the sound seemed to cut out, then whoosh (kind of like when you stick your ear to a seashell), then when that stopped the pitch and volume seemed different. My friend asked me if I'd heard it and when I said the sound change she knew exactly what I meant. This became more of a noticeable thing after that and when I'd hear it I'd ask other people if they'd heard it too. My friend and I made up a theory that only \"real people\" could hear it and others were just part of the simulation or experiment that we are living in. I was wondering if anyone else has experienced this or can explain it.",
        "created_utc": 1508298209,
        "upvote_ratio": ""
    },
    {
        "title": "my vision was restored temporarily",
        "author": "Spagettlover",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/773xvc/my_vision_was_restored_temporarily/",
        "text": "I just rediscovered my reddit account and post a few of my glitch in the matrix experiences. I've had really bad vision as far back as I can remember, without my glasses or contacts I have a visibility of about six inches. One morning a few years ago I woke up an hour earlier than I needed to, to get ready for school, I decided to get in the shower and go back to bed to let my hair dry a bit. When I got up I was able to see everything as sharp clearly, if not better, than I could with my glasses. I was afraid I had fallen asleep in my contacts even though I remembered putting on my glasses the night before but when I tried taking them out I realized I wasn't wearing them. I was a little shocked but enjoyed being able to see without the inconvenience of contacts or glasses and finished showering and went back to bed. When I woke up to my normal alarm my vision was back to normal and I wondered if I dreamed it but my hair was in a towel and still damp. ",
        "created_utc": 1508296791,
        "upvote_ratio": ""
    },
    {
        "title": "I came across this blog around 2008. I have come back to it periodically. I hate seeing the news but for a fact my mind was blown away with the accuracy of the 2010 Gulf of Mexico oil spill prediction and a couple others. Anyways would love to hear what you guys think.",
        "author": "L-Helexa",
        "url": "http://2063.blogspot.ca/?m=1",
        "text": "",
        "created_utc": 1508292096,
        "upvote_ratio": ""
    },
    {
        "title": "Pink hot dogs",
        "author": "cools4",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/7734c7/pink_hot_dogs/",
        "text": "Guys I'm so sorry if this doesn't belong here, but I remember as an elementary schooler around '96-'99, eating bright pink hot dogs which dyed the bun pink, in my school cafeteria. This was in North Carolina. I can't find any trace of any brand of hot dog with these characteristics online, probably because they contained an alarming amount of dye. Anyone know? Is this real or did I hallucinate bun-dyeing hot dogs?!",
        "created_utc": 1508288344,
        "upvote_ratio": ""
    },
    {
        "title": "Tiny flying purple + pink lights?",
        "author": "erinwolf1997",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/76s00u/tiny_flying_purple_pink_lights/",
        "text": "Please direct me to a more appropriate subreddit if applicable. \nWhen I was younger and would wake up with a nightmare, I would go to my parents' room and they would let me sleep in their bed. Most of the time I would lie awake for some time because of being scared by the nightmare, but would then fall asleep no problems. However, I can remember several times that I would be awake, staring at the ceiling, and suddenly noticed these lights. They were a mixture of hot pink and an electrifying purple, very small, and would leave a very slight trail as they flew in a semicircle around my parents' bed. This happened several times and I am fairly sure I wasn't dreaming. Weird part is I wasn't shocked at all by these weird little lights - they were just there and I was watching them and often I felt kind of comforted by their presence. Anyone else have a similar experience? What could they be? \n\nTL;DR: Tiny pink and purple lights would fly around my parents' bed when I'd sleep there after a nightmareas a young child. Don't think I was dreaming.  ",
        "created_utc": 1508174313,
        "upvote_ratio": ""
    },
    {
        "title": "future/premonition dreams and psychic deja vu information",
        "author": "zaqstavano",
        "url": "http://reddit.com/r/precognition",
        "text": "",
        "created_utc": 1508162871,
        "upvote_ratio": ""
    },
    {
        "title": "i have memories of an alternative life (goes wrong)",
        "author": "phugg2020",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/76o0sx/i_have_memories_of_an_alternative_life_goes_wrong/",
        "text": "Sometimes I randomly have memories of me being in places I don’t remember, I don’t know how to explain it but it really feels like I’be been there and it’s a real place that exists, but I never went there, I feel this really often, maybe it’s another life that I had before dying and getting to my actual life ? 🤔🤔🤔 id like to know if this thing happened to some other people.\n(I just discovered this sub so sorry if this has been asked a thousand times lol)",
        "created_utc": 1508126387,
        "upvote_ratio": ""
    },
    {
        "title": "Text from my own phone",
        "author": "neeganomg",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/76mg21/text_from_my_own_phone/",
        "text": "I don't know if my story belongs in this forum, so please redirect me if it doesn't. \n\nI'm sure many of you have noticed that occasional text from your own phone. For example, sometimes I get a text from my own number that's on behalf on my eye clinic or dentist prompting me to reply yes or no to confirm my appointment. However, this wasn't the case one particular morning about a year ago. \n\nAs I was driving to my 9 am class, I came to a stop at a red light that I routinely pass every day. I noticed that my phone buzzed and I got a text message. I looked at my phone and saw that it was a text from my own name. I thought that i had some appointment coming up that I was forgetting about, so I opened the text without thinking too much of it. When I did so, I saw that the text said \"can u see me ok\".  I started looking around frantically since I was still stopped at the red light but didn't see anything or anyone alarming. I texted back \"no\" to see if somehow I would get a response but I just received another text of \"no\" since I sent it to myself. \n\nLater that day, I tried searching to see if there was a hack or something that could explain this mystery text and didn't find anything. I'll post the photo of the message below. If anyone has any suggestions on what could have happened, let me know. It still creeps me out to this day![message ](https://imgur.com/gallery/TvNxH) ",
        "created_utc": 1508109034,
        "upvote_ratio": ""
    },
    {
        "title": "Text from own phone",
        "author": "[deleted]",
        "url": "https://i.redd.it/x32m2tusp2sz.jpg",
        "text": "[deleted]",
        "created_utc": 1508107980,
        "upvote_ratio": ""
    },
    {
        "title": "Strange dejavu experience",
        "author": "hashinggod",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/76l6lt/strange_dejavu_experience/",
        "text": "What is happening im having really strange pre dejavu experiences where i click that an event is coming in the sence that ive already experienced and have a slight incline to what is going ti occur then bam the dejavu starts. Its happened three times in the last week and is super strange.",
        "created_utc": 1508096664,
        "upvote_ratio": ""
    },
    {
        "title": "I believe I glitched election night 2016 while on acid",
        "author": "electricyouth955",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/76kwdt/i_believe_i_glitched_election_night_2016_while_on/",
        "text": "This is not my proper dimension. Most of it is the same, but there’s some pretty big differences. Election night of last year, I decided to take acid. I had already dropped it a handful of times that year, but this time was different. After taking the tabs, I vomited (which has never happened to me before on LSD and hasn’t happened since) and became very dizzy and disoriented, more so then usual on the drug. \nI ended up laying down on my floor for a while, feeling like I was floating through space and time and lost maybe an hour before coming too. Before I sort of passed out, Hillary Clinton was winning the election by far and was going to beat Trump. Once I checked  my phone however, this was no longer the case, Trump had won. How he had managed to beat Hillary within an hour made no sense to me, but I brushed it off. \nThat was only the first change, though. About two weeks later my boyfriend of six months broke up with me, telling me that I had “changed.” I was dumped over the phone thanksgiving night and never saw him again. He was not the type of guy to dump me over the phone on a holiday, we were very close. He also cut our shared phone service without telling me and sold 2 of my vinyl records I left at his house and he also threatened me with violence while trying to get them back. A complete 360 from the guy I knew. \nMore recently however, my dad found out that my stepmom has been stealing money from the family and instead of paying utilities, has been putting the money into her account. I have known this woman for nearly six years, this is not like her. This is not the same woman who visited me at my boarding school in high school and helped put my family back together. \nSome smaller changes I’ve noticed have been that apparently it’s not “Sex in the city” it’s “Sex and the city”, an Ashlee Simpson song I remember first hearing on the radio in the fall of 2004 was apparently a huge hit that summer (I listened to the radio all the time back then and I’m 100% positive that was not a summer song) and Madonna’s song “Hung Up” was apparently a huge hit in late 2005/ early 2006. I never heard that song until I got into her a few years later. \nMy iPhone 6s did not have FCC labels on the back, after that night FCC labels are on the back of my phone. \nThe last one I can think of at the moment is that one of my favorite movies, Clueless, had a spin-off TV series in the late 90’s. I’ve been a huge fan of the movie for years, and only found out about the TV show around late November. I’m positive that show did not exist in my dimension. \nOverall, the only good thing to come from this switch was the Clueless show. This dimension seems a bit more sinister then where I believe I came from. I believe the acid changed my body’s vibrations and I somehow made a switch with the me from this dimension. Don’t do drugs, kids.  ",
        "created_utc": 1508093991,
        "upvote_ratio": ""
    },
    {
        "title": "I think I’m going insane. Nothing is the same.",
        "author": "jesusjesusgod",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/76jj9n/i_think_im_going_insane_nothing_is_the_same/",
        "text": "I think I’m going insane. I don’t know how to explain anything happening around me. Everything changed in the blink of an eye. Today, my coworker of 10 years showed up, but looked completely different. I had always known him to be a caucasian man, but today he showed up and was inexplicably Asian. \n \nThis particular coworker is always playing pranks on me, so I thought for sure it had to be just a little joke he was playing. I started to get really worried when my coworkers wife went up to him and gave him a kiss like they had been together forever. I tried to finally prove that it was just a prank by grabbing one of the pictures he keeps on his desk of his family, one that would prove I wasn’t crazy. Everything fell apart when I realized it was the same Asian imposter in the picture! \n\nI don’t know what to do. I think I’m going insane. Nothing like this has ever happened to me and it feels like my life is completely turned upside down. Everything I once knew is no longer real  I’ve seen stories like this in this sub before, so I figured this would be the best place to post this. Someone please help me understand what’s happening to me.",
        "created_utc": 1508081035,
        "upvote_ratio": ""
    },
    {
        "title": "Itchy and Scratchy Show",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/76dabj/itchy_and_scratchy_show/",
        "text": "[deleted]",
        "created_utc": 1508000319,
        "upvote_ratio": ""
    },
    {
        "title": "Super Hearing.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/76cwva/super_hearing/",
        "text": "[deleted]",
        "created_utc": 1507996690,
        "upvote_ratio": ""
    },
    {
        "title": "Gameboy Music",
        "author": "measure400",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/765ak5/gameboy_music/",
        "text": "When I was growing up, I played Pokemon Gold on the Game Boy Color. A lot. While this isn’t remarkable in and of itself, the strange part comes in to play long after the game boy gets turned off.\n\nOccasionally, especially after a particularly long gaming marathon, I would start to hear the actual music. And I’m not saying that it was just playing back in my head, I mean it was legitimately like the game’s music was playing. I could hear the game music of a route and even could hear when a battle would start. Now, that all could have been just a trick of the mind, however my brother (with whom I shared a room) asked me, “Are you playing Pokemon right now?” Obviously, I wasn’t – but he too claimed that he could faintly hear the music playing, and it was in sync with the music I was hearing.\n\nThis would happen sporadically, but all the same I never have really thought of a rational explanation for what that noise was or how it could have been audible to others. \n\nBefore it gets asked:\n\n- My brother, even if he was messing with me then, would have owned up to it by now. We’ve discussed it recently and seeing as it happened ~15 years ago and he still is just as bewildered as I am.\n\n- Anyway, the sounds distinctly sounded like they were coming from inside my head so if he had a Gameboy hidden somewhere on his side of the room it would have sounded like it came from there\n\n-\tAs soon as I started toning it down with the video games it didn’t happen anymore. Really only ever had it happen with Gen II of Pokemon.\n",
        "created_utc": 1507906421,
        "upvote_ratio": ""
    },
    {
        "title": "typing it out won't do justice but I have 20 minutes to spare so i'm gonna try to explain",
        "author": "svwsp",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/75xeeu/typing_it_out_wont_do_justice_but_i_have_20/",
        "text": "europe and north america, mostly, from 2007-2017. the most important decade in the history of the planet. the dawn of the fourth technological revolution. i began to have intermittent bouts with extra-sensory perception and several instances both abroad and domestic that were metaphysically ... challenging... then my son was born. upon his arrival everything, the visions, the personas i had met, the bubbling political activity and the readings all made it clear.\n\nthe matrix has collapsed.  now the chaos has resulted in the Earth's 6 billion souls wreaking havoc on themselves. And now Humanity is realizing it's cognitive abilities faster than ever before. The question is, what will happen to the old system while we find our way? we are seeing it's undoing with every passing day.\n\nI will tie this final point in later. This is a pfl in a sense, but here's the spoiler for those wondering where this goes:\n\nHumanity is an inter-dimensional experience. Know that every thought and synapse further connects to those dimensions. It is our physical person that accepts them. There is no death, only arrival to this plane and departure from it to another. Unlimited dimensions are perpetually expanding and reacting to our desires, thoughts, wishes, and actions. Then our reality experiences the channeling of those dimensions.   \"Our dreams are not our own\" is in fact contrary to the truth, rather our dreams are entirely our own, for Life is a Dream, and Dreams, Dreams are.",
        "created_utc": 1507819096,
        "upvote_ratio": ""
    },
    {
        "title": "Don't really know if this is the right place to post",
        "author": "lizzzillas",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/75tm6h/dont_really_know_if_this_is_the_right_place_to/",
        "text": "I tell this story pretty often and only a handful of people have believed me. This happened when I was around 7 or 8 years old. In my room, my bed was in the middle of one wall, and my closet was parallel to the foot of the bed. I always slept with the closet door propped open because it was so full with junk it wouldn't close. I always kept my jacket I wore every day slung over the top of the door. \nOkay, so there was this one night where I'm really not sure if I was dreaming or if I was kind of half asleep/slightly awake, but I saw very clearly the jacket I had over the top of my door start to move, like someone was tugging on it. It yanked off and flew directly toward me and landed over my face. I woke up (fully) directly after that and the same jacket was laying right on top of my face, just like in the dream. \nI've considered that maybe I was having sleep paralysis, as I have that occasionally to this day, but there is no way the jacket could have been on my face any other way. It still creeps me out a little when I think about it but I like paranormal stuff so 🤷🏻‍♀️ ",
        "created_utc": 1507770385,
        "upvote_ratio": ""
    },
    {
        "title": "What was your fist experience with the mandela effect and how did you feel",
        "author": "Hempy1987",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/75p6it/what_was_your_fist_experience_with_the_mandela/",
        "text": "\n\nMine was the monopoly man's monocle. I had to go and grab my old box and stood there in awe as I saw he no longer had a monocle on a box I knew he did. I was stunned and in shock. I still feel numb thinking about it today\n\nhttps://youtu.be/wyKcKkwBxgQ",
        "created_utc": 1507729903,
        "upvote_ratio": ""
    },
    {
        "title": "Just joined Reddit and I've been wanting to let people know the weird stuff that happened to me growing",
        "author": "Seahawksfootball1",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/75nkvn/just_joined_reddit_and_ive_been_wanting_to_let/",
        "text": "When I was child around 7 or 8 the song \"where'd you go\" by fort minor came out. At the time I always asked my mom when it would come on the radio \"Mom I love this song I need to know the name of this!\" We could never figure it out after weeks just rarely hearing it on the radio. One night we're sleeping, I was young in a small house still sleeping with my mom, it's about 1 or 2 in the morning. We're dead ass asleep and she rolled over in her sleep and turned on the radio button on the alarm next to the bed, the song is BLARING. I instantly wake up \" MOM THATS THAT SONG\". She freaked the fuck out. She swore on her life she turned on the radio in her sleep and couldn't figure out the chance and possibility the song we've been searching for was on. Freaked her out for years. Freaks me out now thinking about it since I didn't really think anything of it being younger. ",
        "created_utc": 1507708055,
        "upvote_ratio": ""
    },
    {
        "title": "Old Stepdads weird experience that freaked me out",
        "author": "Seahawksfootball1",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/75nj8e/old_stepdads_weird_experience_that_freaked_me_out/",
        "text": "My old stepdad is a very non believer in paranormal activity. He said he's had one experience that he swear happened but he just always tried not to believe it. He lived in southern cal and shared a room with his sister when he was around 8 and she was 12. He was sleeping and dropped his favorite little blanket between his bed and the wall as one half of the bed was along the wall. There was still about a foot and a half of space between the wall and his bed. As he reached down and was feeling around something threw it back up back onto his bed. Instantly the first thing he thought was it was his sister fucking with him as she always did growing up and looked over to see her passed out on her bed. He absolutely froze laying there in his bed, what the fuck just threw that back up. He was one of the most stubborn people about paranormal things as I always asked him if he had ghost stories because I love that shit but he insisted every time, that is the only thing that's ever happened to him. He's tried to tell himself he didn't believe but by god he knows it happened. That story always stuck with me. ",
        "created_utc": 1507707352,
        "upvote_ratio": ""
    },
    {
        "title": "Not at a dealership",
        "author": "AuntBabyRIP",
        "url": "https://i.redd.it/5ovsqskpu2rz.jpg",
        "text": "",
        "created_utc": 1507673785,
        "upvote_ratio": ""
    },
    {
        "title": "I can see with my eyes closed",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/75hhzi/i_can_see_with_my_eyes_closed/",
        "text": "[deleted]",
        "created_utc": 1507646758,
        "upvote_ratio": ""
    },
    {
        "title": "I'm usually the first to dismiss \"time skip\" stories but I'm struggling to explain this one.",
        "author": "tiptoe_only",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/75fm63/im_usually_the_first_to_dismiss_time_skip_stories/",
        "text": "We see a lot of stories on this sub about how people have apparently jumped forward in time usually by several hours. We know the brain can do weird things before and after sleep or when we're on autopilot and a lot of the time that can explain it. I'm sure something like that *must* have happened last night but I'm not sure how it could have done.\n\nAround 11pm I went to bed and had started drifting off when my 6 week old daughter started fussing to be fed. She's never gone more than 3 hours without a feed before and was last fed at 7 so I was quite surprised she'd managed to last so long. I checked the time on my phone. It was 11:38. \n\nI picked up my daughter and started to feed her. She  always feeds for 5-20 minutes each time, and a few minutes into the feed my husband came up to bed. Again I was surprised as this is early for him. He started setting the alarm on his clock and the display lit up with the current time. It was 1:06. I confirmed this with my phone. I'd somehow lost almost an hour and a half.\n\nI can't have read the time wrong in the first instance. If my tiny baby had somehow managed to go six hours without being fed, then my breasts would have been REALLY sore and swollen with all the milk. They weren't. If I'd somehow fallen asleep feeding her, she would have unlatched. She hadn't. If she'd stayed on for that long then it would have become VERY painful for me and it wasn't.\n\nI wondered if I'd fed her at 11:38 then gone back to bed and fed her again around 1 and then sleep deprivation had erased my memory of going back to bed the first time. But that doesn't make much sense either. The baby wouldn't have wanted feeding so soon after the previous feed.\n\nMaybe I just need more sleep...",
        "created_utc": 1507622740,
        "upvote_ratio": ""
    },
    {
        "title": "Maybe not a glitch, but weird encounter anyway.",
        "author": "PM_ME_GIFTCARDS_NOW",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/75e89p/maybe_not_a_glitch_but_weird_encounter_anyway/",
        "text": "Driving on my way to work tonight I randomly had a thought pop into my head about somebody I used to work with, about 4 years ago. I haven't seen or talked to him in at least 3 years. Last I heard he'd moved almost 2 hours away. I wondered if I still had their number saved in my phone and decided I'd check once I got there and just send them a quick text if I did. Pulled into the parking lot, checked my phone, didn't have their number saved. Continued on into work. \n\n10 minutes after getting to work, this same person walks in and immediately comes up to me and says \"I've been thinking about calling you lately but didn't have your number! So good to see you!\" \n\nI'm still a little tripped out. ",
        "created_utc": 1507603858,
        "upvote_ratio": ""
    },
    {
        "title": "How can they be on the train AND at the bar?",
        "author": "[deleted]",
        "url": "http://imgur.com/UL9AKVu",
        "text": "[deleted]",
        "created_utc": 1507602876,
        "upvote_ratio": ""
    },
    {
        "title": "Can you read in your dreams",
        "author": "Gav6000045",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/757u7c/can_you_read_in_your_dreams/",
        "text": "I can read in my dreams but the writing doesn't make sense. The cheese was the only at contact us.Also TV doesn't exist in my dreams.",
        "created_utc": 1507539243,
        "upvote_ratio": ""
    },
    {
        "title": "Odd Time Rewind?",
        "author": "dawnofthedied",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/757gve/odd_time_rewind/",
        "text": "The other day I was sitting on the floor while playing with my dogs. One dog started to scratch his ear and I heard my friend say my name, and I said yeah? Got no response. I looked at the dog and I swear I thought I had lost my mind. It was almost as if he was moving in reverse. My friend said my name again and I felt nauseated. The dog began to scratch in the same motion. I told my friend to come here, and asked him if he had called my name twice... He said he had only called once and I immediately ran for the bathroom and threw up. What even!? ",
        "created_utc": 1507533104,
        "upvote_ratio": ""
    },
    {
        "title": "Woke up to someone walking in my room",
        "author": "shortlandryan",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/756y1k/woke_up_to_someone_walking_in_my_room/",
        "text": "I made an account just so I could share this. \n\nWhen I was in high school, we had just moved into a  place that we had lived in before, moved out of, and moved back in to. We had done some renovations after moving back in the second time and my family has been in this place for a while, so we know no deaths or anything like that had occurred. \n\nI think we were still unpacking, so my mattress was directly on the ground, no box spring or anything. Anyways, one night I woke up to the sound of someone walking into my room. I very distinctly remember hearing someone's steps dragging on the floor, and a combo of my mattress on the floor and me being a light sleeper means my eyes opened. \n\nI can not stress this enough - I WAS AWAKE. I just knew it was a man too, though I can't explain how. He wore white socks, tan pants, and I saw the bottom of a white jacket. I saw him take 3 steps into my room and I slammed my eyes closed. I was panicking - I thought someone was robbing us. I tried to pretend like I was asleep but it was so hard to get my breathing to calm down since my heart was beating so fast.  \"He\" stopped moving once I closed my eyes and eventually I told myself that i was going to die anyways, I may as well open my eyes and look at him. When I opened my eyes, no one was there. I hadn't heard any exiting steps, but my room was empty. \n\nMy heart was racing still, so I couldn't go back for hours. After reliving the moment over and over again something odd stuck out - when I saw him take 3 steps, I realized he was walking on this ugly blue carpet that was in our home the first time we lived there and we had renovated to wood floors. I also could hear my family in their respective rooms, snoring the night away. When I asked them about it the next day, they said they slept through the night and never got up. \n\nI will never believe someone telling me I was asleep for this or it was just a dream. I could never be creative enough to make up how crazy my heart beat was or having to convince myself to meet my maker and open my eyes when I was maybe 15. On the plus side, I never had an incident in my home like this again. ",
        "created_utc": 1507525536,
        "upvote_ratio": ""
    },
    {
        "title": "Alexa, am I dreaming?",
        "author": "AyChihuaxua",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/756a7o/alexa_am_i_dreaming/",
        "text": "Ever since watching Waking Life years ago, I remember the notion that technology, small text, lights, etc. doesn't really work well in dreams.  I have noticed though, that some aspects of technology have seemed to work better in my dreams lately.  I can pull out my phone, turn it on, and take a picture.  \n\nI can understand why something like a phone or TV would not work given normal circumstances, it might be more than the brain can generate from memory, whereas a conversation with a loved one might be easier.  \n\nYet, today, in a dream I had my Amazon echo in the room, and I asked it something basic like \"Alexa, how's the weather?\"  Instead of a voice, the Echo just made the sound of a voice like it was coming through a glitched out or broken connection.  I asked Alexa to tell me something else and go the same response.  \n\nIt was weird to me because, it's not like my mind had to generate something complex like a computer screen, but instead just a human voice giving a response.  Yet, somehow that got glitched out the same way that other technology does.  \n\nIt made me wonder that if life is simulated, if dreams are like beta versions of the program.  Like, the basics are running, but the higher level programs are turned off like pain, death, and apparently, computers.  ",
        "created_utc": 1507517291,
        "upvote_ratio": ""
    },
    {
        "title": "Dream came true",
        "author": "Gav6000045",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/751etd/dream_came_true/",
        "text": "I had a dream where I was eating a wrap with ham and cheese in it. It was my last day of high school. Someone walked in and said this is the last time you will eat here. I woke it. This was in march. On the last day of school I was eating a wrap with ham and cheese in it.someone walked in and said you guessed it this is the last time you will eat here. Same person same wrap same words. Not only that but I was sitting in the same chair as well.",
        "created_utc": 1507465685,
        "upvote_ratio": ""
    },
    {
        "title": "Man Vanishing from Car; Knowing What my Mom Would Say",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/750qn8/man_vanishing_from_car_knowing_what_my_mom_would/",
        "text": "[deleted]",
        "created_utc": 1507453881,
        "upvote_ratio": ""
    },
    {
        "title": "The sky over Sydney, Australia yesterday morning",
        "author": "tresslessone",
        "url": "https://i.redd.it/xwioha09faqz.jpg",
        "text": "",
        "created_utc": 1507329593,
        "upvote_ratio": ""
    },
    {
        "title": "I distinctly remember my father telling me something that he now denies",
        "author": "Ansalong",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/74otb0/i_distinctly_remember_my_father_telling_me/",
        "text": "I'm an only child and an only grandchild, so I had a pretty lonely childhood but I at least was close to my family. My parents very rarely went anywhere without me, and I only remember maybe four times in which I stayed with my grandparents overnight.\n\nMy great grandma was still alive at this point and I remember being in her trailer. My great uncle lived with her because obviously she was old and couldn't exactly be alone. I have a distinct memory of being left there and wandering around when someone threw me in a really nasty pond behind the house and I don't think I could get out (I was around 3-5)\n\nI definitely remember my dad mentioning it at least once. He said \"we left you with them once, but they hurt you and it won't ever happen again\"\n\nI asked him about it when I was a bit older and he just looked at me like I was crazy. He still has no idea what I'm talking about and I'm almost 19 now. I've considered that maybe it's just a faulty memory but it's always seemed kinda wrong? Just thought you guys might be interested.",
        "created_utc": 1507307953,
        "upvote_ratio": ""
    },
    {
        "title": "Teleporting cat?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/74lj9g/teleporting_cat/",
        "text": "[deleted]",
        "created_utc": 1507266126,
        "upvote_ratio": ""
    },
    {
        "title": "Watch \"jumping\" glitch",
        "author": "Throwaway230516",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/74hav3/watch_jumping_glitch/",
        "text": "I was on the phone to my mum today when she asked the time. I replied that it was 10 past 5.\n\nShe then said \"my watch says 10 past 4 that's odd\".\n\nI made a joke that it better be 10 past 5 or I was in the wrong place but she cut me off to say.\n\n\"Oh no, it's 10 past 5 now my watch just jumped, like the hand moved, that's really strange.\"\n\nJust made me think of this sub.",
        "created_utc": 1507222714,
        "upvote_ratio": ""
    },
    {
        "title": "Notifications",
        "author": "KenwayOTT",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/74gpxc/notifications/",
        "text": "I've had a tablet for a few years, and I don't usually take it out of the house. Sometimes I'll hear the notification sound from my tablet when I'm out despite it being miles away, and when I get home, sure enough there's a notification. I started getting curious about this and taking note of the time any time I hear this, and they match within 2 minutes or less (which makes sense given that the time on the tablet and what I'm using to take note of the time may not necessarily match). I get no information as to the contents of the notification, but I can more or less confirm that I'm consistently hearing the sound when I'm nowhere near my tablet without false positives. It's not connected to my phone or my car in any way. Anyone have any similar experiences, or ideas as to what might be causing this?",
        "created_utc": 1507217542,
        "upvote_ratio": ""
    },
    {
        "title": "'Stressed Out' by Twenty One Pilots came out later than I remember?",
        "author": "DickVanGlorious",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/74ejmk/stressed_out_by_twenty_one_pilots_came_out_later/",
        "text": "I remember so vividly kids at my school singing/yelling, \"wake up you need to make money\" before 2014, but stressed out was released 2015 and I can't find anywhere else where that line exists (or most likely I'm just shit at finding stuff).",
        "created_utc": 1507190519,
        "upvote_ratio": ""
    },
    {
        "title": "Who else remembers jumping down an entire staircase when they were kids?",
        "author": "220WTC",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/74d3i9/who_else_remembers_jumping_down_an_entire/",
        "text": "Then realised now they're older if they did it they'd probably break something ",
        "created_utc": 1507170434,
        "upvote_ratio": ""
    },
    {
        "title": "My cousin asked for song suggestions for her wedding, I suggested 3, they played, apparently she never asked for suggestions?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/74ac5o/my_cousin_asked_for_song_suggestions_for_her/",
        "text": "[deleted]",
        "created_utc": 1507143651,
        "upvote_ratio": ""
    },
    {
        "title": "Strange sensory perception that doesn’t match any senses",
        "author": "AndrewZabar",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/749v1t/strange_sensory_perception_that_doesnt_match_any/",
        "text": "This is definitely a strange one - at least for me. It’s not easy to describe, but I’ll try my best. \n\nI’ve recently had a memory surface. It’s not an event, but a memory of a perception. As an example, I’m sure most people have experienced remembering a particular smell or taste - maybe within a dream you have a recollection of the experience, maybe it’s just sometime on an ordinary day. You have the distinct memory of a specific and unique smell - something from long ago that’s unlike anything else in your experience. \n\nI’ve recently remembered a sensation - a perception. But it is not a smell, or taste, nor any other kind of sense that I’ve ever had. It’s a perception, an actual sensation that I feel, that doesn’t match any sense I’m familiar with. \n\nTo describe the actual feeling, it’s a kind of perception of decay, or putridity. A “badness” that is felt associated with exiting one area and entering another area. It’s not limited to indoor or outdoor, but I happen to have experienced it outdoor in my memory. It’s a sort of foulness, something about the air, or reality itself in the area, that’s decrepit. It gives me a feeling of there being something rotten about the area, but not a smell or anything like that. It’s just a perception unlike anything else. It’s not just a thought either, it’s an actual physical perception, but not one associated with any known senses. That’s the best I can do as far as explaining what it’s like. \n\nI can sort of recall it if I focus on a few images in my head, such as exiting a cabin to a wooded area, another is walking on the roof of a building, that has sort of cobblestone tiling on the roof. The air looks like it turns greenish around two feet off the ground. \n\nI realize it sounds a bit off the wall, but this is a real, tangible experience. I’m wondering if anyone has any ideas at all to explain what this is.",
        "created_utc": 1507139529,
        "upvote_ratio": ""
    },
    {
        "title": "BJs Card",
        "author": "Ljnick",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/746xer/bjs_card/",
        "text": "Here’s something that I’ve never been able to explain. One summer I was home from college and staying at my grandmother’s house with my uncle. (My grandma was staying at my aunt’s as she just had had knee surgery).\n\nMy uncle was a big fan of BJs which is a Sams Club like store if you’ve never heard of them. More or less you need a membership to shop there and they sell everything in bulk.\n\nAt any rate, we were both walking into the house after being away for the afternoon and discovered a random BJs membership card just sitting on the kitchen table. I picked it up and discovered that it had my name on it. I asked my uncle if he had gotten me a membership to BJs and he said no and had no idea where the card had come from. \n\nI asked my grandma if she had gotten me the card but she said she hadn’t either. I tried the card out and sure enough I had a BJs membership.\n\nTo this day I have no idea where the card come from.",
        "created_utc": 1507107347,
        "upvote_ratio": ""
    },
    {
        "title": "The wrong colored balloon.",
        "author": "Runes_mom",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/7441zi/the_wrong_colored_balloon/",
        "text": "It was about the year 2008 &amp; my son was about 4years old. We went to the grocery store &amp; they have greeters that will give kids balloons as you enter the store, very friendly. This one really kind African man knew my son's favorite color was yellow so when he saw us parking the car he ran &amp; got a yellow race car shopping cart &amp; a yellow balloon &amp; was waiting at the entrance for us to to come into the store. My son was thrilled. We tied the balloon to the side of the race car shopping cart so it wouldn't come off &amp; we went on our way. Once into the store we go through the produce 1st then around the corner is the bakery. I turn my back for just a moment to look at some bread &amp; turn back to the shopping cart &amp; notice that my son's balloon is not yellow....its RED! I didn't say a word, I didn't want to alarm my son who would make a scene but I'm looking all around to see who has his yellow balloon but there's nobody! I don't know why but I also checked my watch at this time. After accepting that nobody was around that could have taken switched his balloon &amp; taken off with his yellow one, I started inspecting the knot that I had tied to keep his yellow balloon on. It was just exactly as I had tied it. My son noticed me inspecting the balloon's string then he noticed that the balloon wasn't yellow anymore, that it had been changed for a red one &amp; he got really upset. He was crying, etc, just like I wanted to avoid. He didn't want the red balloon so we just gave it to another child &amp; continued our shopping &amp; went home. Once home, I was in the kitchen putting away the groceries &amp; noticed that the clock on the stove was flashing 43 minutes, meaning 43 minutes ago the power had gone out &amp; the clock on the stove had restarted. Well, 43 minutes ago was the exact time that I checked my watch when my son's balloon changed from yellow to red.",
        "created_utc": 1507070827,
        "upvote_ratio": ""
    },
    {
        "title": "Both my sister and I have this memory that doesn't exist",
        "author": "Lowkeycrazybitch",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/743ltw/both_my_sister_and_i_have_this_memory_that_doesnt/",
        "text": "My sister and I talk about this same, clear memory we share when we were little (4,6) but it never happened. At least in this universe.\nTo set the scene, it was a cloudy North Eastern day. We were both young so we had car seats and also both had our seatbelts on. Our mother had left the car to go to the mailbox, but did not park the car so it was still running. My sister and I both share the memory of our mother frantically chasing the car along our drive way but was too late... the car had driven into our pool. We both share the memory of staring at eachother and screaming, so afraid and realizing we were strapped in the car as it headed to our pool. Now I have a memory of us crashing into the pool, but my sister remembers clearly both of us drowning, with our seatbelts still on and losing consciousness.\nWhen telling our parents this, they say there is truth to the car running while my mother was getting the mail... but she quickly got in and put it on park. We're so confused by sharing this same memory.. is this an example of false memories? Or maybe in another universe my sister and I drowned at 4 and 6 years old. \nEdit: I don't know if this means much, but I have an insanely good memory. I have a very clear memory of my childhood and I remember days in extreme detail from when I was 4,5,6... etc I really don't forget anything from my childhood at all. So the fact that me and my sister both have this clear memory is really just spooky to me.. \nEdit2: We didn't talk about this with eachother for years. The first time we brought it up was at least years after it happened. Started with joking about the pool incident.. then my sister said you remember that too? ",
        "created_utc": 1507066472,
        "upvote_ratio": ""
    },
    {
        "title": "Hovering plane",
        "author": "o_clementine",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/73x5fs/hovering_plane/",
        "text": "A little while ago, I saw a plane very low in the sky, and it was just not moving, or moving extremely slowly, because it looked like it was hovering! I was in the car and it was moving faster than the plane. I am extremely confused, maybe it was just an illusion, but I wish I had caught it on camera. Has that ever happened to you? ",
        "created_utc": 1506992728,
        "upvote_ratio": ""
    },
    {
        "title": "This is your last chance",
        "author": "[deleted]",
        "url": "https://i.imgur.com/J7pRVHq.gifv",
        "text": "[deleted]",
        "created_utc": 1506946996,
        "upvote_ratio": ""
    },
    {
        "title": "Words in my head manifesting into reality",
        "author": "Ridavv",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/73lt1h/words_in_my_head_manifesting_into_reality/",
        "text": "Sometimes I will be thinking about something and the subject of the issue will almost certainly be casually mentioned on tv, said by someone else in a conversation, or play as a song on the radio. Been experiencing this since I was about 13, anyone else?",
        "created_utc": 1506866866,
        "upvote_ratio": ""
    },
    {
        "title": "Playing by ear",
        "author": "KaGe47",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/73lhmq/playing_by_ear/",
        "text": "I don't know if anyone else has had this happen (or even if it fits in here), but what happens quite regularly to me is this : I'll be at work or at home or whatever and I'll randomly start thinking about a song. Then shortly after the song will start playing on the radio. I also used to have the same with simpsons episodes, I'd think of a random specific quote from one of the episodes in the morning, and in the evening the episode would be on. This even happened when I stopped following the show, and the channel where they aired would often play episodes out of order so no way I could predict it unconsciously that way. Weird stuff...",
        "created_utc": 1506862819,
        "upvote_ratio": ""
    },
    {
        "title": "I had a glitch in the matrix when I was 3",
        "author": "Space_Dragon2017",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/73g1x7/i_had_a_glitch_in_the_matrix_when_i_was_3/",
        "text": "One day I woke on the floor on September 23, 2006 I woke to see my sister sleeping I barely remember her name I didn't know where I was all I knew was names I didn't know anything from the years before but I remembered names of the friends I have now but I was not in school yet so when I seen them I automatically knew their names and today found a note that has my handwriting form the year 2057 saying was going to kill myself but it was in a old pair of pants I wore the day I forgot everything from the years before.",
        "created_utc": 1506790837,
        "upvote_ratio": ""
    },
    {
        "title": "Woman disappeared on bridge",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/731lk2/woman_disappeared_on_bridge/",
        "text": "[deleted]",
        "created_utc": 1506619355,
        "upvote_ratio": ""
    },
    {
        "title": "Coffee's not prepared - on Repeat",
        "author": "krich315",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/730nc3/coffees_not_prepared_on_repeat/",
        "text": "My entire life is filled with events that I used to chalk up to \"paranormal\" experiences,  but now I know differently.  I have so many, that I could write a book.  Lately,  however,  I'm noticing it in regular life at a greater rate.  For example, the usual habit is that my husband's and my own alarms will go off, I wake up to tell him to turn off his alarms and lay there for a bit. He'll get out of bed, go to the bathroom, and go towards the kitchen afterward.  I usually follow and he will have my coffee waiting so we can go sit outside to drink our coffee before he heads off to work.  It's been different lately.  I see, feel,  and hear him do these things and that is usually my queue to get up.  What's been happening now is that I'll walk by the bathroom,  look in the kitchen and my coffee isn't waiting.  He hasn't touched his cup.  I look outside and he's not there.  I go back to the bed and there he is,  sleeping.  He never got out of bed at all. It happened this morning again.  I'm seeing the glitches and the repeats more often. Just last night,  I laid down in the den with my hubby to watch television before bed.  Our dog jumped up (she jangles from her collar and even though she should be a small dog,  she's stocky for her breed... so feeling her weight is inevitable), laid down,  and I covered her as usual. This time, I was focused on the show and was not thinking about whether she'd moved or not. I didn't recall her getting down. I was watching the show, looking to the left as she lays on my right out of my vision line.  Suddenly,  I hear her collar and feel her jump up and settle on me. I turn to cover her, as I always do, and she'd never moved.  She was already covered and sleeping on me. Many might think it's imagined or an expectation in my own mind,  but it's not. My dog jumping up on me when she was already there and covered was not something I anticipated or thought would occur again.  I heard and felt it, however. I could go on with experiences of seeing things or knowing things before they happen,  but these are occurring so frequently that I cannot deny the lifetime of experiences with glitches any longer. ",
        "created_utc": 1506610968,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone else remember Hugh Hefner dying around 8 months ago?",
        "author": "leeloobond",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/72xog2/anyone_else_remember_hugh_hefner_dying_around_8/",
        "text": "Definitely having a WTF moment right now. Both myself and my husband remember him kicking the bucket earlier this year! Anyone else remember this?",
        "created_utc": 1506570962,
        "upvote_ratio": ""
    },
    {
        "title": "Music imitates life",
        "author": "Cipher890",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/72lylv/music_imitates_life/",
        "text": "Something I notice now and again is that I'll be doing something, see something, or read something and as soon as I do the music I'm listening to switches to a song that directly relates to what I saw. I'm not stretching this, and I remembered this sub because I was browsing and as soon as I clicked on a post titled \"Star light, star bright\" the song Starlight by Muse came on shuffle. Maybe just a coincidence, but this seems to happen way more often than it should. ",
        "created_utc": 1506447089,
        "upvote_ratio": ""
    },
    {
        "title": "Naples Web Design Company - GGG Marketing Services",
        "author": "IrisEisenhowerm",
        "url": "https://gggmarketing.com/naples/web-design/",
        "text": "",
        "created_utc": 1506271091,
        "upvote_ratio": ""
    },
    {
        "title": "Dimensional jumping sub",
        "author": "Ursuchabetch",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/71x0ds/dimensional_jumping_sub/",
        "text": "I just tried to view r/dimensionaljumping and it says I dont have permission to view it? Is anyone else in there, and is it working for you? Ty in advance.",
        "created_utc": 1506152567,
        "upvote_ratio": ""
    },
    {
        "title": "Sweater Weather",
        "author": "doitforthev",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/71vvsz/sweater_weather/",
        "text": "Me and my husband were in Bath and Body Works earlier today and I read his mind. Seriously. He held up a candle called “Sweater Weather” but had the label turned away from me and the candles were away from us so I couldn’t see them. He smelled it and said ”It smells like Arctic Monkeys”. I immediately replied, “No, The Neighborhood sings that”. We stood for a second and he was dumbfounded, because he didn’t say anything to give away what the candle was called and he didn’t say the song name-nothing. I thought it was pretty freaky and we were both freaked out for the rest of the night so I thought I would share with you guys :)",
        "created_utc": 1506135662,
        "upvote_ratio": ""
    },
    {
        "title": "Heaven and Hell",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/71oqf0/heaven_and_hell/",
        "text": "[deleted]",
        "created_utc": 1506054668,
        "upvote_ratio": ""
    },
    {
        "title": "Randomly texted a girlfriend about bad cramps. She wrote me at the same time. Our random messages are oddly complementary",
        "author": "zballz",
        "url": "https://i.redd.it/zq994hiwdwmz.jpg",
        "text": "",
        "created_utc": 1505852097,
        "upvote_ratio": ""
    },
    {
        "title": "ceiling's fan : the most obvious glitch",
        "author": "moxemd",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/7158ze/ceilings_fan_the_most_obvious_glitch/",
        "text": "First sorry my English is bad\nso i will give a brief explanation\nso i was reading about double slit experiment, \nif you dont know it,watch this video\nhttps://www.youtube.com/watch?v=DfPeprQ7oGc\n\ni noticed how the ceiling's fan become transparent ( kinda it's blades disappear ) when it move fast , it move faster than the human eye capability to track it ( observe it ) , this can be applied to any object that move so fast, this would make sense if this is a simulation and there is a limited amount of computing power so only that which is observed is rendered, just like a computer program/game, since human eye cant observe the blades of a moving fan it basically disappear.",
        "created_utc": 1505847663,
        "upvote_ratio": ""
    },
    {
        "title": "I think I just experienced a glitch.",
        "author": "FNAFPCreator",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/713wm3/i_think_i_just_experienced_a_glitch/",
        "text": "So, I'm home schooled and am currently learning Algebra 2. Now, this particular textbook I have comes with a CD and program where after I do the lesson I can put the answers I got during the lesson and the program grades the problems for me. \n\nAnyways, just yesterday I did a lesson in this book and like always put the answers in. I come back today to do the next lesson and notice that the lesson I just did yesterday was completely blank. Not like someone erased it (for I would've noticed that) but like I never did the lesson or even touched that page at all. I look in my notebook (where I show my work for the problems I did) and the problems are still there. I look on the program and the problems are read as completed under there as well. \n\nThere may be some logical explanation for this, but I'm pretty freaked out regardless.",
        "created_utc": 1505836486,
        "upvote_ratio": ""
    },
    {
        "title": "The reoccurring address.",
        "author": "TheFatPossum",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/70zxza/the_reoccurring_address/",
        "text": "So when I was a kid, maybe about 13. I had a friend over at the time, let's call him jack. So jack and I went on a walk around the neighborhood and he told me about a number, an address, this address was something like 601 or 608 or something, it definitely started with a 6. So anyways he kept finding this number randomly around his house and his school and other places. So as we were walking we can across a house with pitch black windows and a blackish house, but the strange part was the address... it was the number. We decided to start walking faster, we looked at the other a address, 471, the number, 916, the number, 826, the number. We starting turning the other direction running. I had brought 3 throwing knives with me for protection.we heard a metal clang on the ground, We both stopped, I looks at my pouch just to realize I dropped one jack was frozen with fear so I had to tell him it was just a throwing knife, he helped be find it (it was dark and I didn't have my glasses on). We went back to my house and vowed never to tell anybody.",
        "created_utc": 1505787627,
        "upvote_ratio": ""
    },
    {
        "title": "The missing fork",
        "author": "faychi",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/70x4fw/the_missing_fork/",
        "text": "This is a mystery me and my friend have never forgotten. When we were around 13 years old we were eating noodles in her room with forks, I pick mine up and drop it. We laugh, I assumed it went under her bed so I got on the floor to get it - but it wasn't there. In fact it wasn't anywhere on the floor at all we both looked all along the floor. She ended up moving out of that house around 4 years later and she told me she didn't find the fork even after they moved. Kinda creeps me out in a funny way. \n\nPs. New to this subreddit so if anyone could explain how things like this happen where things just disappear with glitch logic that'd be ace.",
        "created_utc": 1505760993,
        "upvote_ratio": ""
    },
    {
        "title": "\"We Do Somethings Right\"",
        "author": "lumpysurfer",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/70ljv7/we_do_somethings_right/",
        "text": "When I was growing up I had a friend who was a lot more \"southern\" than the rest of us. He had a really rough home life, anger issues, and a reputation for being an asshole. However, we always got along. For the sake of the story we'll call him Adam.\n\nAdam drove a beat to shit F-150 he picked up real cheap after he wrecked his last car. After one particularly rough day at work his already finicky radio began malfunctioning. He absolutely destroyed the radio, door speakers, and a large portion of the dashboard with a Phillips head screwdriver he had handy in the cab. It looked like somebody had been using his dash board for target practice for years.\n\nOne day sometime after Adam had destroyed his dash we had decided to take his F-150 down to a local park. There was a large snow storm the night before and we intended to enjoy the snowy views and smoke a little pot (freaky stuff takes place before that ever occurred). This park was located off of quiet side road and being the dead of winter we hadn't seen a soul.\n\nAdam is driving, I'm in the middle, and my brother is on the passenger side of the bench seat. As we begin pulling into the parking lot for the park I hear a clear, confident, loud, almost stately 40's radio voice say \"we do somethings right\" directly behind my head. It was as if there was speaker hanging 6 inches behind me in the cab.\n\nNow I probably would have brushed it off as a one off instance of me hearing things that weren't there, if it weren't for the fact that the moment I heard it Adam slammed on the breaks sending his truck skidding across the snow. When we came to a stop my brother was the first to break the silence with something to the effect \"you guys fuckin' heard that right\". \n\nThe radio, at least what was remaining of it, didn't work. There was no speakers in the back deck to begin with. There was no one around. \n\nAfter pulling in and calming down we realized we all heard the same voice, same words, and at the same time. To a T. We attempted to laugh it off but tacitly came to the decision of going back home to smoke as we all knew we'd be driving back stoned in the same truck that just spooked the hell out of us. \n\nMy brother and I still jokingly say \"we do somethings right\" when something confounding occurs. \n\n\nPS: I know driving stoned is stupid regardless, this was quite some time ago.\n\n\n\n",
        "created_utc": 1505622362,
        "upvote_ratio": ""
    },
    {
        "title": "Time fucked up?",
        "author": "InjuredSmurf",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/70le1x/time_fucked_up/",
        "text": "Short one but still messed with my head this morning. I distinctly remember looking at my phone and seeing time said about 1:00am and shortly after I fell asleep. Woke up what seemed like hours later 100% refreshed and ready for action. Looked over at my phone and it was 12:15am.... I lost 45 minutes of sleep tonight and now I'm sat at work wondering how and why it happened. Also why do I feel so well rested!?",
        "created_utc": 1505620024,
        "upvote_ratio": ""
    },
    {
        "title": "Spoofed reality",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/70k90t/spoofed_reality/",
        "text": "[deleted]",
        "created_utc": 1505605526,
        "upvote_ratio": ""
    },
    {
        "title": "Identical Cars",
        "author": "[deleted]",
        "url": "https://i.redd.it/e0mca5vk5bmz.jpg",
        "text": "[deleted]",
        "created_utc": 1505595066,
        "upvote_ratio": ""
    },
    {
        "title": "Self repairing yarn?",
        "author": "bitterer",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/70ilo7/self_repairing_yarn/",
        "text": "When I was 11 or 12, I was sitting on our godawful plaid couch absentmindedly spinning a necklace made from yarn and pony beads around my finger (the original fidget spinner?) Suddenly, all the beads flew off the strand, skittering across the tile. Crap. I looked at the yarn to see where it broke... it hadn't. Was still tightly tied in an unbroken loop. There's no way the beads should have come off like that...but they did. Wtf. ",
        "created_utc": 1505587440,
        "upvote_ratio": ""
    },
    {
        "title": "3575...",
        "author": "TurtleBae94",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/70fj5r/3575/",
        "text": "Recently went for a meal with my close friend, who I met from a previous job.\n\nWe take goes and turns to pay for the bill each time we meet up and on this occasion it was his turn. We had these incredible hanging kebabs along with a few tasty draught ciders to wash them down.\n\nWe were sat outside, it was a bright, sunny day and they have a great beer garden at the place. I was going inside to take a leak once we'd finished so he asked me to take his card and pay at the bar whilst in there.\n\n\"3575\", he said.\n\nSo, I go in, do the deed and then make my way to the bar to pay. I tell the lad on the cashier our tab number and he gives me the receipt before handing over the card machine to me... the amount, £35.75.\n\nI was pretty puzzled so I asked the guy to hang on and I'll go back outside to check I heard my friend right.\n\nI say to him, \"your pin, what is it again?\"\n\n\"3575... yeah\"\n\n*cue absolute mindfucked expression*\n\n\"OK.. cheers..\"\n\nI went back inside to pay before fully explaining the situation. We had a really hard time processing those odds of getting the same amount as his PIN number. \n\nFelt this was the best place to share once finding this sub.\n\nEdit: Typed wrong number at the end. Oops.",
        "created_utc": 1505544835,
        "upvote_ratio": ""
    },
    {
        "title": "Timeline Bleed Through",
        "author": "Candyland214",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/702wn1/timeline_bleed_through/",
        "text": "\n Basically I had never heard of a timeline bleed through until after I experienced it and spent some time trying to explain what I experienced to some close open minded friends. This was about a month ago. Sitting outside relaxing, reflecting, reading while my girls were napping. Baby monitor beside me, my 7 month old woke up crying. I went inside. (Didn't bring the monitor with me). Got her up, changed her and was playing with her on the bed. She was smiling happy as can be. Then off in the distance I started hearing something. I don't even know how to explain where it sounded like it was coming from. In the house, like the other side of the house, but right next to me at the same time. Like a distant but close echo. It was crystal clear. The sound of my baby screaming in pain. Sounded like she was being tortured or was in some serious pain. That intense cry that scares every parent. It lasted about 15-20 seconds and then faded. Then a few days later it happened again. She was with me, content, and then that faint but close screaming.  \n\nI told a few people and said it was like I was hearing another reality on top of ours, like my gut was telling me the same thing. I'm a sane, logical person and don't \"hear things\" that aren't there. My husband experienced the exact same thing. He said he was sitting outside and over our house off in the distance (same direction I heard my daughter's cries) he said he heard the most horrible screaming like someone was dying in terrible pain. He described it as sounding the same as I heard. Screaming but it was like a there but not there, however very clear. \n\n   Then my cousin messaged me who I had told a couple weeks ago about the experience. He said he too, has heard other people telling him that they have been hearing yelling and screaming that is not where we are now. Like some other reality shit hit the fan. \n\n   Then a couple days ago I stumbled upon an article on my Facebook feed that was mentioning that some people who are sensitive to the shifts are hearing what they call timeline bleed throughs. I thought this is exactly what we were experiencing. I can think of no other explanation. I thought it was just me but I guess it's happening to people on a larger scale. \n\n   I don't know what has happened wherever we are hearing this from. But I'm glad to not be there and it is horrible to think about what is causing those screams.\n",
        "created_utc": 1505402537,
        "upvote_ratio": ""
    },
    {
        "title": "The best kind of glitch.",
        "author": "BillGatesAlladdin",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/6zwmnk/the_best_kind_of_glitch/",
        "text": "So my girlfriend and I have alternating shifts each day, she works 2nd shift at her job and I work 1st. Yesterday I came home and said hello and gave her some lovin' before she left for work. I asked her about how much pot we had left and if it wasn't much if shed mind picking some up on her way home from work, \"Yea there's a little left\" she answered. So after she leaves I proceed to get a little silly, open our stash box and there's two small containers in there, one empty, and the other with about 4 hits worth. Open it up and am a bit dissapointed cause there's a fairly large stem in there which made it look like there was more originally, bit of a let down but hey whatever let's take care of what's left. So I smoke. There is none left at all, I double checked everything. A couple hours pass and I've come down, still the only one in the house. Decide to step outside to smoke a cig and see if I can get any black gold out of the empty pipe. Open the box and the same two containers are sitting in there....one empty and one with about 4 hits worth...\"Okay well maybe I just didn't see it\" I thought. Yes I'm confused but hey, I'll take it. I open the container to get it out and thanks to the large stem I found in there I realized it was the exact same pot I had smoked earlier; same amount, same color, same huge stem right in the middle making it seem like it was more. I've experienced only a couple glitches but this is for sure the best one so far haha.",
        "created_utc": 1505328378,
        "upvote_ratio": ""
    },
    {
        "title": "Time change",
        "author": "ds155",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/6zvhwd/time_change/",
        "text": "On Aug 31, 2017 my brother and I were in a moving van and looked at the clock in the van and it was shortly before 2:30 pm est, however we each looked at our cell phones (different carriers) and the time was just before 3 pm. We'd been in the van all day and hadn't noticed a time difference so this kinda surprised my brother and I. I proceed to drive home and when we're off the highway I noticed my cell phone and the van were now on the same time, I'm surprised and tell my brother who looks at his phone which is now also the same time as the van. \n\nSorry about how poorly this is written, but it's my glitch in the matrix.",
        "created_utc": 1505318515,
        "upvote_ratio": ""
    },
    {
        "title": "We had the same conversation TWICE",
        "author": "[deleted]",
        "url": "https://i.redd.it/9e8o5qpz6olz.jpg",
        "text": "[deleted]",
        "created_utc": 1505317070,
        "upvote_ratio": ""
    },
    {
        "title": "Just experienced a glitch.",
        "author": "reformedmikey",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/6zuir5/just_experienced_a_glitch/",
        "text": "So I drive into work, and realized that I didn't have a belt on, which meant I didn't attach my badge to get into the building. So I left my badge at home, which is no big deal, just means I have to borrow someone's ID to get in and out of the building for any breaks today. Now, about an hour later I started playing with my work badge, not even noticing for about a minute. Then it hit me... I left that at home, on my kitchen table on top of my belt. I know I did, because I left the building with it on my belt but it appeared on my desk at work. ",
        "created_utc": 1505309274,
        "upvote_ratio": ""
    },
    {
        "title": "When you go back in time to warn your younger self of the shit show that is 2017 (X-Post from r/Pics)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/pics/comments/6zn6ob/when_you_go_back_in_time_to_warn_your_younger/",
        "text": "[deleted]",
        "created_utc": 1505226238,
        "upvote_ratio": ""
    },
    {
        "title": "Preston Lacy from Jackass",
        "author": "jawsrawflesh",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/6ziqo9/preston_lacy_from_jackass/",
        "text": "Not sure if this is the right thread, but it seemed most suiting. I very clearly remember months back that Preston Lacy from the Jackass crew had died of a heart attack (in the news, YouTube tributes, etc.) yet when I checked today I couldn't find evidence of his death anywhere... and he was in fact alive. I've asked a couple of friends who are fans of the series and they were convinced he had passed a while ago as well. Does anyone else recall hearing about this?? ",
        "created_utc": 1505168110,
        "upvote_ratio": ""
    },
    {
        "title": "The number 424 started haunting me, and I found out why",
        "author": "babybirdlover",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/6zilnk/the_number_424_started_haunting_me_and_i_found/",
        "text": "First a little background.  I am an only child, and I was born in 1960.  My mother had systemic Lupus and was not diagnosed until her 7th month of pregnancy and she went into seizure and my grandmother found her unconscious on the floor of their house.  They took me early on that night April 24, 1960,  I weighed 3 lbs 8 oz.   My grandparents were told my mother would not live, and that I was not fairing well.  I and my mother were called a \"miracle\" by the doctors and the nuns,  that saw me leave the hospital two months later.  My mother developed breast cancer and passed away in 2000.  The room she died in was room 424 at Mercy hospital.  In fact they had just discharged her, and few hours later was readmitted and put back in the same room.  It terrified me because the room was 424, my birthday, the day they said she was going to die in 1960, when I was born.  I have two children my mother adored a girl and a boy.   She was crazy about them.   Now to the present, starting about six weeks ago.  I started waking up and looking at the clock at exactly 4:24 am, so often that it starting giving me the creeps.  I would put a random video on Youtube and would sudden be 4 min 24 seconds long.  This happened more times than I could count.  I would go to different grocery stores around town, and reach up to get a product, that sometimes just popped into my head, because I hadn't eaten it since I was a kid, and see the price $4.24.  I would pick up a package of meat, the price would be $4.24!  I would go to the frozen food section, there would be a cluster of 4 different items in one close area, all $4.24! My tablet did not have the right time set on it, yet I just saw a video with the same same number spray painted on a wall in the video, and picked up my tablet with the time not set and and it said 4:24!  I had telling my daughter that my birth date was stalking me.  A month I was in a thrift store, and just picked a used cookbook, I had just opened it up, when my phone started to ring.  I put the open cookbook on the ground at my feet.  The call was from my daughter, she had just found a lump in her armpit.  I told her to go to the doctor, and got off the phone.  The cookbook at my feet that open to the first page, had a dedication that someone had written in ink, \"To blank blank, April 24, 1995.\"  I couldn't believe it.  We just found out she has stage 3 breast cancer.  I just believe my mother, who loved her so much, was trying to get through!  Not sure where this belongs, but I will post it here. ",
        "created_utc": 1505166724,
        "upvote_ratio": ""
    },
    {
        "title": "Did we collectively miss our opportunity to seize the future?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/6zi6tr/did_we_collectively_miss_our_opportunity_to_seize/",
        "text": "[deleted]",
        "created_utc": 1505162807,
        "upvote_ratio": ""
    },
    {
        "title": "Did the world really end?",
        "author": "Vanchicken2",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/6yqspb/did_the_world_really_end/",
        "text": "In 2012 people always said the world would end, but it didn't. Just think though, has anything ever felt real since 2012?  The weirdest shit goes on now, perhaps were really living in the matrix now. ",
        "created_utc": 1504824843,
        "upvote_ratio": ""
    },
    {
        "title": "large influx of planes and helicopters?",
        "author": "admiringgraser",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/6yqrr7/large_influx_of_planes_and_helicopters/",
        "text": "if this is the wrong sub reddit please let me know and i’ll delete and move the post!! but hey, for the past month or so there’s been large numbers of planes and helicopters of all sorts, military sometimes but mostly commercial actually, flying very low over my house and my friends house 3 miles away. i live on the coast of connecticut and my friend lives right on the beach, the planes usually never ever take the tracks they have been, and CERTAINLY never as low as they are now, and helicopters, unless news, are usually never seen. what’s all this about???",
        "created_utc": 1504824599,
        "upvote_ratio": ""
    },
    {
        "title": "I really have no explanation.",
        "author": "r977",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/6yonya/i_really_have_no_explanation/",
        "text": "This took place last Saturday. I was in my house, sitting at my computer watching YouTube videos. It was about 2:30, sun was coming in my window, beautiful day outside yadda yadda yadda. My light was turned off since the curtains were open. \n\nI was sitting pretty still for maybe an hour or so, then I abruptly stood up. I felt a rush of light-headedness followed by a loss of balance and my vision blurred. That's not the weird part, that happens to me all the time when I abruptly stand up. So I squeeze my eyes shut and put my hand against the wall for a couple of seconds until it passes, then I opened my eyes. I swear to God, it was night time. It's pitch black outside, and my light was still off. \n\nI freaked out for a second before turning my light on and checking the time on my phone, which said 11:18. My computer was still on and the monitor was asleep. I have no idea how it happened, as it seemed to only be a second or two. ",
        "created_utc": 1504804895,
        "upvote_ratio": ""
    },
    {
        "title": "My Mom's Glitch",
        "author": "Unicornzzz2",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/6yohet/my_moms_glitch/",
        "text": "Submitted to Glitch_In_The_Matrix as well. \nMy mom and stepdad have told me this story a number of times. The story never changes and they agree on the details every time I've talked to them about it. So, about 10 years ago, they decided to try a new restaurant where they could each try a Chicago Dog for the first time. It was a small place with a friendly staff, with TVs on the wall. They talked with the staff for a bit about what to get on their hot dog and then sat down. As they ate they watched a local news broadcast that reported the city's major NFL football player being arrested for allegedly raping his special needs family member. My mom and stepdad were taken aback, being huge sports fans and loyal to their city's teams... This was a really big deal and they even discussed it with the staff. Well, they left to go home and expected to find more of the story on the news but couldn't find anything else about it. Like... nothing. Very odd as again, this was big news for a star player in our city. Well, the next day, they drove past the restaurant and it was completely closed down, boarded up and everything. As I mentioned above, my mom talked to the staff a number of times and none of them mentioned that this was their last day being open. Since then, we've discussed this occurrence often. It's just so weird. We've all tried searching for the story about the NFL player online, never finding a thing. Like I said, its been about 10 years since this happened and they are still rattled by this experience.",
        "created_utc": 1504803272,
        "upvote_ratio": ""
    },
    {
        "title": "Glitch in the Matrix from 2006: The Morphing Squirrel",
        "author": "hopeseekr",
        "url": "http://www.incendiary.ws/node/221",
        "text": "",
        "created_utc": 1504766526,
        "upvote_ratio": ""
    },
    {
        "title": "I've got sunshine.",
        "author": "reaperdrone07",
        "url": "https://i.redd.it/kbwc990d1bkz.jpg",
        "text": "",
        "created_utc": 1504721943,
        "upvote_ratio": ""
    },
    {
        "title": "Unnerving buzzing that woke me up (but I don't remember falling asleep...?)",
        "author": "gloriav-a",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/6ycjr7/unnerving_buzzing_that_woke_me_up_but_i_dont/",
        "text": "I don't know whether this classifies as a \"glitch\" or not, but it freaked the crap out of me and I still don't know what it was. This happened maybe 2 months ago.\n\nIt was nighttime, I was in bed next to my fiancé and it was very late. He was already asleep. I was feeling... anxious. Sometimes when I'm still up that late, my mind wanders and I get scared of things that aren't there. So I did what I usually do when I'm feeling scared, and I said a prayer.\n\nI didn't feel very drowsy and felt fairly alert as I was praying. But the next thing I know, I'm awoken (I don't remember falling asleep), maybe 10 or 20 minutes later, to a loud buzzing in my ear that fades out. I don't even remember finishing the prayer. The buzz was like when you hear ear cells dying in your ear, but much, much louder, more intense, and it faded out quicker. To me it seemed external (not in my ear drum), but when I woke up my fiancé about it, he hadn't heard anything. While I've fallen asleep unexpectedly before, I haven't usually felt so lucid prior, and I've never had any weird buzzing in or after a dream or upon waking. Thankfully I managed to finish my prayer after that and fell asleep almost immediately after. Has anyone else ever experienced this?",
        "created_utc": 1504661916,
        "upvote_ratio": ""
    },
    {
        "title": "but we were actually using watermelons to bowl and eating bowling ball the whole time",
        "author": "lezbiansexx",
        "url": "https://www.youtube.com/watch?v=rqmBfzZB63U&amp;t=3s",
        "text": "",
        "created_utc": 1504647773,
        "upvote_ratio": ""
    },
    {
        "title": "Sometimes I subconsciously write a word twice",
        "author": "astrominer1",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/6yay5q/sometimes_i_subconsciously_write_a_word_twice/",
        "text": "This is more a post to satisfy a curiousity to a problem I've been having more frequently since discovering the ME.  In essence when I proof-read sentances I have written there are double words.  I know this can happen on autocorrect on mobile devices occasionally however this is mostly impacting me on a desktop computer.  I've done some googling and a few people report it happening alot and others from time to time.  It's like I glitched into a reality where I already typed the word, the explanation of the brain thinking faster than my fingers can type would miss out words I would have thought.\n\nI wondered if anyone else experiences this frequently?",
        "created_utc": 1504645202,
        "upvote_ratio": ""
    },
    {
        "title": "Disappearing Moth",
        "author": "AlexFulcrum",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/6yaj0n/disappearing_moth/",
        "text": "Hey everyone, i just remembered my second glitch story. This one is a lot simpler than the \"missing from school\" story.\n\nWalking downtown with one partner and two other friends. We find a big moth on the side walk. Being good vegans, we decide to go place them somewhere safer. My partner picks the insect up, but they fly off of their hand, and...\n\ngone.\n\nWe were all watching. So we look all around, our gazes darting through the nearby airspace. We check our clothes inside and out, including our shoes. We look all around us, but no, that large moth just flew into the air and vanished instantly. None of us have any clue what happened, and have been referring to that moth as \"the Bethesda bug\"\n\n\nincidental and unrelated: as a child, i also had a fish just disappear from a tank once. that type of fish is known to jump, but we found no remains inside or outside of the tank, with no human or animal that would have moved them.\n\nsometimes small animals just get deleted i guess?",
        "created_utc": 1504641437,
        "upvote_ratio": ""
    },
    {
        "title": "Alternate realities or printing error",
        "author": "MarkhamusPrime",
        "url": "https://imgur.com/2ori44r",
        "text": "",
        "created_utc": 1504619033,
        "upvote_ratio": ""
    },
    {
        "title": "One of us should change... it ain't gona me be 😒",
        "author": "bredani_462",
        "url": "https://i.redd.it/xvmgy1h5c2kz.jpg",
        "text": "",
        "created_utc": 1504616613,
        "upvote_ratio": ""
    },
    {
        "title": "Instantly spawn in your personal aircraft where ever u are easy useful GLITCH",
        "author": "reece-_-101",
        "url": "https://www.youtube.com/watch?v=qbgxHjeK-KI",
        "text": "",
        "created_utc": 1504556458,
        "upvote_ratio": ""
    },
    {
        "title": "Stick figure man tight me math and Woody from Toy Story kidnapped me and brought me into the world of the movie Osmosis Jones.",
        "author": "Bad-Luck-Kyle",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/6y1ixb/stick_figure_man_tight_me_math_and_woody_from_toy/",
        "text": "Alright so this title is weird, I know. But I actually believed these things happened.  So I only remember three things until I was about 5. The first one is I had this recurring experience that this stick figure that had a giant eye for a head ( it looked like something a kid would draw) and would drag me into the back yard and teach me math on one of those old school chalk boards. I was way too young to know what math was, but I knew it was math. I vividly remember seeing crazy equations, something you would find out of physics or advanced calculus textbooks. This would happen repeatedly, it felt like it was going on infinitely. I remember trying to hide and run from this stick figure but it would always find me and teach me the math on the chalk board.  The second thing that happened is directly after the first. It would skip to night time, and whenever my mom would put me in the cradle at night and shut the door behind her, all the lights would go out and woody would crawl from under my bed. He would take me out of the cradle and drag me under the bed. Then he would open this hidden hatch under my bed and throw me under, then it would turn into the scene in Osmosis Jones where they're falling into his esophagus and then it would go black. After it was dark for a while it would immediately go back to the first dream, where I would be trying to get away from the stick figure. Like I said, these two dreams happened repeatedly, for what seemed like months or years. And I only remember one other thing from then. I remember taking a sip of my dads beer he left on the table. I was thinking those dreams/hallucinations could have happened because I drank the beer but they both happened before and after I remember taking a sip of the beer. Does anyone have any thought about this? I've asked multiple people if they've had any experience like this one but they always think I'm either lying or think I'm crazy.",
        "created_utc": 1504543997,
        "upvote_ratio": ""
    },
    {
        "title": "This block of five apartments residents all have red cars",
        "author": "StrangeClownRabbit",
        "url": "https://i.redd.it/inh25loxoojz.jpg",
        "text": "",
        "created_utc": 1504451411,
        "upvote_ratio": ""
    }
]