[
    {
        "title": "My earbud appeared in my room",
        "author": "Jorgethemaster",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5v2181/my_earbud_appeared_in_my_room/",
        "text": "So I went out a few days ago with my earbuds as I always do. I used them on the subway and bus. Then I went to the store and when I put on my earphones as I was exiting I noticed I lost one of the little gel thingies that go on the tip of the earphones. I checked my pockets but nothing. Anyways, I took the loss and used one earphone for my commute home. I arrived home and took out my single earbud and threw my earphones onto my desk and then I see the missing gel earbud right beside the earphones. I don't have any spares laying around and I'm 100% sure it wasn't there before because I used both earphones for most of the day until it got lost. Can't really explain it, must've been a glitch",
        "created_utc": 1487557722,
        "upvote_ratio": ""
    },
    {
        "title": "Watch Battery Replacement at the Exact Time the Watch Previously Stopped Working",
        "author": "0eris0",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5v0hkc/watch_battery_replacement_at_the_exact_time_the/",
        "text": "This is crazy and maybe on some level I'm aware of what the time actually shows on the watch face, but dammit, this has now happened twice this year so far.\n\nI've inherited a bunch of old watches over the years from relatives and most of them work, they just need to have their batteries replaced from time to time, so it goes...\n\nAnyway, twice now when I've actually taken the time to replace the batteries in two separate watches, I have not had to reset the time as the time shown on the watch face was the actual time when I popped in the battery. \n\nThis is both coming home from work with a nice package full of things that I needed or coming back from the corner store with a watch battery in hand. Unbelievable...",
        "created_utc": 1487538878,
        "upvote_ratio": ""
    },
    {
        "title": "Disappeared",
        "author": "zephead345",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5upsyw/disappeared/",
        "text": "I am a service technician for an unnamed superevil mega cable corporation, the other day I was sitting in my truck after a downed job waiting on dispatch when on the other side of the street in a nice sub division was a lady jogging with her dog. Now I have thought of every explanation but parallel to me was another work van unmanned. The lady was running the opposite direction that I was facing, she passed behind the van and fucking disappeared. No she did not go into her house vision blocked by the van as it was between 2 houses and from my view I would've seen her enter either house. No she did not get in the van or get swooped by someone in the van as the cargo doors were pointed that way because I legit got out of my car walked across the street looked in the van and everywhere around. I have been racking my brain hard to explain but from my point of view and just logic in general she just fucking vanished. Normally I wouldn't notice something like this as I am usually screwing around on Reddit or playing hearthstone but I barely had enough service to see my route, so I was bored staring around. Honestly I have lost sleep over it, I am not a gullible person, nor am of below average intelligence or very superstitious......there was a glitch in the code.",
        "created_utc": 1487378303,
        "upvote_ratio": ""
    },
    {
        "title": "A while back someone posted here that she saw a magenta colored void in a drawer in her room. This article here explains magenta has no physical wavelength. Maybe there's something to this...",
        "author": "AnotherSmegHead",
        "url": "http://www.richannel.org/colour-mixing-and-the-mystery-of-magenta",
        "text": "",
        "created_utc": 1487280634,
        "upvote_ratio": ""
    },
    {
        "title": "I am glad to see you",
        "author": "Williamvertha",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5ugfm6/i_am_glad_to_see_you/",
        "text": "[removed]",
        "created_utc": 1487266065,
        "upvote_ratio": ""
    },
    {
        "title": "Spent a summer 14 years ago with a guy who didn't exist",
        "author": "shaikhchester",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5uf4tf/spent_a_summer_14_years_ago_with_a_guy_who_didnt/",
        "text": "I vividly remember befriending a tall, fair man with rosy cheeks and calling him Shaani Bhai (bhai is the Urdu term for brother,) only to be told that he never existed. \n\nOne summer, my family decided on a small tour of the Northern Areas of Pakistan. It's not unusual to plan such a trip - it's still done till today and honestly, the sights are breathtaking. This was at a time when my family was not burdened with paying for college tuition, and Pakistan's economy had yet to see the downfall it did in the subsequent years. I must have been about 7 years old. \n\nThis trip was planned with my cousins (I have a ton of them,) their families, and we were to visit some family friends along the way as well. \n\nSomewhere along this trip, on one of these visits to our family friends, I met Shaani Bhai. We're expected to respect our elders, and this guy was easily in his early 20's. Any elder man is our uncle, any elder boy is our bhai. \n\nShaani Bhai was one of the sweetest people there. He entertained my thoughts and humor - something most adults tend not to do. He held on to me while I almost slipped into a water spring. I even took a picture with him - I was standing on the rocks over a body of water and he was standing on a few rocks behind me.\n\nI still remember that he was gorgeous to look at - even my 7 year old self was smitten. I even remember visiting his house and meeting his parents with the rest of my family. I can still describe his house, but the room that I remember in great detail is the kitchen. It had pink walls and led out to the backyard where Shaani Bhai and I would chase each other. \n\nNow I didn't make much of it. I mean, you meet someone on a family trip where there are dozens of other people. You don't put in a lot of thought about it, especially when you're that young. However, a few weeks ago, I brought up Shaani Bhai in front of my mom and aunt. They were reliving all the trips we've been on and I decided to contribute as well. Now this is almost 14 years later, so I wasn't too surprised when they asked me who I was talking about when I referred to Shaani Bhai. I reminded them. They didn't have a clue. I brought up the photograph. My mom said that all our old photographs burned down with our house in 2007. (Our building was bombed, it was a political thing. Not important.) \n\nI tried my best to remind them. I described him. They didn't know. I told them about how I was always with him. I described the photograph. They said that there was no Shaani Bhai on the trip. In fact, we don't have a relative or family friend by that name. At all. \n\nI thought I made him up. That's the only logical explanation, right? But then I thought about his house. I started describing it to them. I saw their eyes go wide. They said that the house, did, indeed belong to family friends. But we never visited them. They had a son, too, but he wasn't with us on that trip. He fit the description, but his name wasn't Shaani. I mean, it wasn't like they were dead or the son was dead either. They just weren't on that trip, nor did we ever visit them. Basically, we had never met them. And I had never seen their house. They were surprised that I even knew about any of this. \n\nI still don't know how I know about Shaani Bhai. I know I met him, I know I was with him. I just can't prove it. But really - how do I prove that I spent a summer with a guy who supposedly wasn't there in the first place?",
        "created_utc": 1487254231,
        "upvote_ratio": ""
    },
    {
        "title": "Isabella22",
        "author": "Aidanfullne",
        "url": "http://imgur.com/DTm78W4",
        "text": "",
        "created_utc": 1487178012,
        "upvote_ratio": ""
    },
    {
        "title": "HUGE MANDELA EFFECT DISCOVERY!!! DX Music Video Changed!!! (proof!!!)",
        "author": "schooltrashers",
        "url": "https://youtu.be/q5aj-rluSqw",
        "text": "",
        "created_utc": 1487129860,
        "upvote_ratio": ""
    },
    {
        "title": "Bilocation",
        "author": "Tito_Quaid_",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5u2h5b/bilocation/",
        "text": "This happened last night.\n\nWe have three small kids and they wake up during the night often. So often that my and my wife have developed this sensitivity to their noises, moans, etc.\n\nLast night I heard my little girl crying and I woke up. I looked around and I saw my wife already standing on her side of the bed, waiting for any other noises. But I noticed that she was wearing a different pyjamas. I was yet on the bed. I looked down to the bed side of my wife and I saw her sleeping, in the original pyjamas. Then I felt surprised, and raised the head. And the\"extra\" wife was no more there.\n\nI wasn't scared at all. I thought that I want totally awake and that's all. And my daughter cried no more, so I fell asleep fast.\n\nIn the morning, I remembered everything perfectly.\n\nProbably nothing but some hypnagogic fantasy.",
        "created_utc": 1487101224,
        "upvote_ratio": ""
    },
    {
        "title": "My pants",
        "author": "AndThisIsMyPawnShop",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5tybmo/my_pants/",
        "text": "I have had this pair of blue pants for around 2 years. They are not regular jeans but are a very smooth surface, belt loops, they fit a very specific way that I recognize. They look a little bit weird in the front (I usually wear them as work pants.) For s time in my life I only had 2 pairs of pants, both this same brand. So these pants are the exact same except one color. They both have zippers, I should know I wore the same 2 pants for for a year of my life. I get some new clothes, none of this same brand and none made of the same material. And also I wouldn't buy the same brand because they look weird! One day, out of the the very pinnacle of the middle of the blue middle of the damn blue!!! My blue pants no longer has a zipper, but two buttons! No one touched them (I don't think!) wtf! I've had these pants for sooooo long. They fit the same! And I've never been able to unbutton that button either. So frickin strange man I do not understand! Glitch if I've ever experienced one!",
        "created_utc": 1487049723,
        "upvote_ratio": ""
    },
    {
        "title": "Looks like OP found another dimension ;)",
        "author": "machstem",
        "url": "https://www.reddit.com/r/mildlyinteresting/comments/5txfpa/my_phone_died_midway_through_taking_a_photo/",
        "text": "",
        "created_utc": 1487047617,
        "upvote_ratio": ""
    },
    {
        "title": "Schrödinger's Lunchbox",
        "author": "KubeKing4556",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5txhgo/schrödingers_lunchbox/",
        "text": "Let me preface this post by mentioning that I am a complete klutz who loses things often.\n\nLast December, I lost a purple with black trim lunchbox at school. I scoured my backpack, locker, and school's lost-and-found for this vital instrument of packed foods. In particular, I was hoping to reattain the ice pack contained inside, for my household was running dangerously low on such chilling devices.\n\nI decided to use a spare blue lunchbox, until my purple one was found. The situation was, of course, non-ideal, but I figured I could make do in the interim.\n \n&amp;nbsp;\n\nFast-forward to tonight. I was ready to prepare another one of life's midday meals, and reached into my bookbag... and pulled out my purple lunchbox.\n\nPlease note that my late afternoons are usually quite drowsy. I didn't fully consider the miracle that I was holding within my hands, until I trekked down towards the kitchen:\n\n\"Is that the *purple lunchbox* you lost in *December*?!?\"\n\nMy mother was understandably quite distressed, and so I took a moment to acknowledge her distressor, shrugging towards the box. I plopped the purple perpetrator of spacetime onto the kitchen counter. Pulling up on the velcro lid, I gleefully removed the coveted ice pack... to find that it was *below room temperature*.\n\nI hastily prepared and stored my food and hurried upstairs to my room, where my bookbag lay. After carefully searching every one of its zippered compartments, I realized that my blue lunchbox was nowhere to be found.\n\n&amp;nbsp;\n\nBased on the specific of today's events, I have no reasonable hypothesis to how this glitch might occur. Hopefully, checking my locker tomorrow will shed some light on the event.\n\ntl;dr I'm a complete klutz who loses things often: but sometimes I get those things back.",
        "created_utc": 1487039844,
        "upvote_ratio": ""
    },
    {
        "title": "Schrödinger's Lunchbow",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5txfkl/schrödingers_lunchbow/",
        "text": "[deleted]",
        "created_utc": 1487039247,
        "upvote_ratio": ""
    },
    {
        "title": "Phone Glitch",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5tvjil/phone_glitch/",
        "text": "[deleted]",
        "created_utc": 1487019981,
        "upvote_ratio": ""
    },
    {
        "title": "Continuous reawakening at 6:30 am",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5ttl6e/continuous_reawakening_at_630_am/",
        "text": "[deleted]",
        "created_utc": 1487001164,
        "upvote_ratio": ""
    },
    {
        "title": "Deja Vu",
        "author": "doitforthev",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5ttd01/deja_vu/",
        "text": "So I'm assuming this is the right place to post this. \n\nFor the past I don't know, year/year and a half, I've had really strange deja vu. Now, I say it's strange because of what happens during it. It isn't like regular \"oh this seems familiar\" deja vu. I know exactly what people are going to say or do right before they do them. I can usually see it happening a few seconds before it happens, and I know what's going to happen later. Most of the time I can say what someone is going to say, right before they say it. Sometimes I can even tell them what they're going to do before they do it.\n\nFor instance, yesterday my husband was sitting on the couch. I started getting the \"deja vu\" feeling. I saw him asking me to clean our fish tank. So I stood up, walked over to the fish tank, and told him \"yes, I'll clean the fish tank\". He's used to it now, but it still kind of freaks him out. As soon as I make a comment about the deja vu, the feeling goes away. I can still remember what they were going to say/do, but I don't feel weird anymore. It still freaks me out sometimes because I don't know if I've been through it before like some kind of weird future glitch or something. \n\n\nTL;DR I know what people are going to do or say right before they do/say it. ",
        "created_utc": 1486998819,
        "upvote_ratio": ""
    },
    {
        "title": "Fraternal Twin Glitch",
        "author": "Info4747realTime",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5tqjgs/fraternal_twin_glitch/",
        "text": "Background: I am 12 years older than my Twin sisters.  Let's call them Anne and Jane.  They are fraternal.  They are different heights (Jane 5' 5\" and Anne 5' 11\") .  Different weights.  Have completely different faces.  Have different hair colors.  They also do not have similar taste in clothing style or fashion-sense.\n\nToday I arrived to my parents house and noticed my mom and dad in the living room so I walked in to talk to them.  When I got in full-view of the room I saw my sister, Jane, laying down on the couch with the family dog on her chest.  I didn't acknowledge my sister verbally but started up a 10-15 minute conversation with my parents, pacing around the room while we talked.  Several times I turned and saw my sister Jane on the couch, wearing a white shirt and light grey sweat pants.  She had no verbal input to the conversation we were having but she kept laying there petting the dog.  Eventually the conversation was over and I went upstairs to the Twins' room to see Anne and ask her something.\n\nI was very startled to get to their room and see Jane in blue skinny jeans and a maroon top laying on her bed texting, Anne wasn't in there with her at all.  I was so confused that I cautiously spoke \"Jane...?\" because I didn't believe my own eyes.  She turned over to look at me quizzically.\n\nI turned on my heel and headed downstairs to find Anne laying on the couch in the exact position I thought I had seen Jane laying.  Though Anne had on a dark grey half-zip pullover and black leggings.\n\nObviously my parents saw that Anne was the one who had been there all along.  Jane had been upstairs the whole time.  I am the only person who experienced this \"glitch\" but the twins agree what happened was very odd.  They're both pretty 'woke' and agree I probably experienced some type of glitch or a possible merging of realities.\n\nI got an extremely weird feeling about it.  Like that maybe  the outcome of my life just changed because of this event.\n\nTL;DR - Twin sisters seemed to magically switched places in a Glitch-like event.  I'm the only one who experienced this.",
        "created_utc": 1486955458,
        "upvote_ratio": ""
    },
    {
        "title": "I am happy to see you",
        "author": "Ryderloskovs",
        "url": "http://imgur.com/xh4GFyb",
        "text": "",
        "created_utc": 1486947380,
        "upvote_ratio": ""
    },
    {
        "title": "Nice Sexy Selfie",
        "author": "Emersongongless",
        "url": "http://imgur.com/TmBSOap",
        "text": "",
        "created_utc": 1486901810,
        "upvote_ratio": ""
    },
    {
        "title": "Something that happened when I was a kid, it gave me the fear of falling.",
        "author": "ice_akito",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5thmvx/something_that_happened_when_i_was_a_kid_it_gave/",
        "text": "When I was a kid, our family went camping with another family. My brother and I got along with the little girl from the other family (name forgotten). Our dads decided to go fishing in the large creek/river that was nearby, that was when the little girl and I thought it would have been a good idea to explore the forest a little. We ended up on a slight cliff over looking our fathers fish. Thinking it was awesome we leaned over a little bit to get a better view... I suddenly fell and was hanging on for dear life. My friend was shocked and tried to get me up to no avail, I mean... we were both younger than 10 at the time... We screamed for our fathers to help us, which did nothing. Our fathers were both too far away not being able to hear us. As we screamed and screamed, panic started coming in... No one heard us... That is why I remember this moment so damned well. We panic so much and my fingers were slipping off the cliff. My new friend just got up and ran towards our mothers. I don't remember much afterward, but I remember my survival instinct kicking in and climbing back up. When I walked into camp, everything was as normal. The little girl was even cooking with her mother (apparently she never left). years later, I have a mortal fear of falling, and I can't stand near places where I think I could fall off of. I don't like cliffs, I feel terrified in an elevator, I always wear anti slip boots during the winter. Also, while I was pregnant with my kids, both times I was a practical recluse... I asked my mother about it and she \"denied\" it ever happened... telling me that I remembered it wrong. If I remember it wrong... where does this fear of falling come from?",
        "created_utc": 1486848406,
        "upvote_ratio": ""
    },
    {
        "title": "Power Girl Pity Sex Titty Sex",
        "author": "Aaronunef",
        "url": "http://imgur.com/12Kq94A#ZhQ6O",
        "text": "",
        "created_utc": 1486840627,
        "upvote_ratio": ""
    },
    {
        "title": "Fuck me please..",
        "author": "Jacksoncesbe",
        "url": "http://imgur.com/nBLofjV",
        "text": "",
        "created_utc": 1486817070,
        "upvote_ratio": ""
    },
    {
        "title": "Really weird experience on my way home",
        "author": "r00st0r",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5swiav/really_weird_experience_on_my_way_home/",
        "text": "I made this as an alt account so no one looks at my post history and thinks I'm crazy. This happened about a week ago and I'm very very confused about what I saw.\n\nI live in a neighborhood of a big city, not a downtown-looking area but a neighborhood where every street is lined with houses and shops. Not really the place where creepy things happen besides gang activity and crazy drifters. One night last week, I was hungry and took a late-night trip to Taco Bell around 1am. This night was unusually foggy, which is extremely rare for the area. I could only clearly see about 50 ft on all sides of me. \n\nI got my food and was on my way home. Despite the fog it was a pretty chill night with almost no other cars on the road. About a minute later I'm coming up towards an intersection of a small side street, and I see what looks like a big wavering garbage bag or tree on the sidewalk. I couldn't make it out very well as I was approaching due to the fog, and I think to myself \"haha that looks creepy as fuck like it's a person\". I get closer to it, and did a double-take with a huge scared shock going through my body. It was what looked like a slender, pitch-black figure with either a shovel or pitchfork, making extremely odd, jerking motions with his object toward the ground. \n\nI literally said aloud \"what the fuck did I just see\" to myself. It disappeared in the fog behind me as I was driving, and I didn't want to turn around to drive past it again. I just thought \"whatever\" and kept driving. The next thing I noticed gave me the worst shock of anxiety and panic I've ever felt. On the next street up, I saw an intersection that I thought was strange, because I didn't remember seeing so many shops in this spot before and it was a mostly residential few blocks.\n\nAs I drive past the light, I see the Taco Bell sign to my left. I was on the street where I started. This was impossible. The route to the Taco Bell is literally a straight-shot on the main street from the street I live on. I don't make any turns until I get to my street. I couldn't have gotten turned around somewhere. It was definitely not a different one, as I instantly recognized the same characteristics and began to recognize the street names as I drove past. I know I didn't accidentally go to a different one further up, as I specifically remembered the drive-through lady I regularly see when I go there. \n\nI didn't remember specifically what corner I saw the strange figure on earlier, but I didn't notice anything as I made my way home. I'm really weirded out by this and haven't stopped thinking about it. I don't have any history of hallucinations or time lapses, and I've been afraid to tell anyone about this. Is there any reasonable explanation for what happened to me, or did I experience a real glitch?",
        "created_utc": 1486597981,
        "upvote_ratio": ""
    },
    {
        "title": "Unexplained mark, trapped in bed",
        "author": "shaikhchester",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5ssg6p/unexplained_mark_trapped_in_bed/",
        "text": "A friend of mine has been sharing posts from this thread and I started looking into them as well. After going through a few of these posts, I feel like the users here might help me out with a bunch of strange stuff that's been happening with me. I'm sorry if I can't get back to anyone, I'm still trying to figure out how this works. \n\nA few things readers here should know:\n\n- Every day, I'm home alone from about 8.30 am to 10.30 am, after which the woman who nurses my grandmother shows up. I do not drink, I do not use any form of drugs. \n- A few months ago, I visited a friend's house for the first time. A few days after that, strange things started happening. I asked him if everything was okay at his end without mentioning anything that had been happening to me. He said that the domestic help around his house had been complaining about seeing things that weren't there and that his dog had been extra fidgety of late. He, himself, claimed to have seen blood dripping from a painting. I sincerely want there to be a logical explanation to all of this and this is the only thread I could think of. Redirect me if I'm at the wrong place. \n\nApart from the two incidents that I will talk about, there are sounds that I hear that come from nowhere in particular. We're a Muslim family, but my mother is Christian and is not well acquainted with the Qur'an. However, she heard someone reading the Qur'an at around 3 am from my grandmother's room - my grandmother has Alzheimer's and can neither speak nor move. I heard similar chanting a few days later. Objects disappear and reappear. That sort of stuff. \n\nNow, incident number one: I'm home alone, texting a friend. We're talking, everything's normal. Suddenly, I notice something red on my arm. Now, I'm studying medicine so I know about inflammatory reactions or allergies in general. There is no trigger in sight. The mark - it looks like fingers imprinted in a manner where someone was trying to tug at it - does not burn or sting. It's just there, popped up out of nowhere. I rub it to see if it's random paint or if it will come off. It does not. I decide to send a picture to my friend. I open the camera app to take a picture - the mark is gone. Vanished. I knew it was there for sure because I clearly remember being surprised to see it and I remember trying to rub it off. So there's no way it wasn't there. I don't make much of this incident. \n\nIncident number two: This happened a few days ago. I happen to experience sleep paralysis on and off. I don't have an erratic routine anymore, which is why the onset was a bit strange this time. However, I've learned to not panic and just wait for it to pass. Anyway, so this happened during the 8.30 and 10.30 time slot. I remember being in that state when you're awake but not fully, and I sort of knew what position I was in - I was on my side and was vaguely aware that my right arm is crushed under my body, but I can't feel it. My left arm is limp in its own position. I could hear my own thoughts and I remember thinking, \"Great, another attack.\" Nothing was out of the ordinary. That's when the weird shit started happening. \n\nSuddenly, I feel a HUGE gust of wind. Now it's winter here, I'm under a huge blanket and none of the windows are open, nor are any of the fans on. This uncharacteristic gust of wind woke me up. Like startled me awake. But I was still unable to move due to the paralysis. Now at this point, I can still hear my thoughts and I start wondering what that was. The gust of wind becomes more concentrated and focused - it's like someone is blowing in my ear and I can FEEL my hair moving, along with the blowing in my ear. That's when I try to move to see what's going on and I feel myself yelling in my head, telling myself to move. Then the whispering started. A voice starts whispering in my ear - actual whispering, the kind where you can feel their breath on you - saying \"Chalo.\" (Chalo is Urdu for 'let's go.') This gets repeated several times. And then, the weirdest thing happens - I start to speak and I reply saying \"Haan, chalo\" which translates to 'yes, let's go.' I heard myself say it, but it was unintentional - I had no control over my body. And then, the whispering stopped, the talking stopped and I open my eyes, like I try to really open them and all I see is complete darkness. That's it. \n\nI wake up an hour later and I'm completely normal. Like I remember the incident and am unfazed by it. I'm posting this here to help gain some insight about what could have happened. I talked to a few people and some suggested Black Magic, others suggested a form of possession. But I'm hoping for a more logical argument here. Help me out. Thank you in advance. \n",
        "created_utc": 1486557526,
        "upvote_ratio": ""
    },
    {
        "title": "Taste Buds Changing or Something More?",
        "author": "CyclopsorNedStark",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5sljhg/taste_buds_changing_or_something_more/",
        "text": "So about 2 years ago I traveled a few states away to compete at my first strongman contest. While at the store I bought some bananas and noticed they looked kinda odd, like too big. At the hotel I ate them and noticed they tasted funny, but whatever. Since then, almost everything I eat now tastes different. Like good stuff that everyone likes such as pizza, ice cream, cheese-things that have specific tastes. However, no one else seems to notice how these foods taste. My then-fiance said my taste buds were just changing, and she might be right, but since then I've made a point of asking various people if they remember how certain foods tasted different a while ago vs how they taste now. I feel like everything for me tastes more bitter and less enticing, while everyone else around seems to think food tastes as good as it ever did. I remember those damn bananas and ever since then it's all gone downhill for me in the taste department. I know I sound crazy.",
        "created_utc": 1486476179,
        "upvote_ratio": ""
    },
    {
        "title": "16 years later, I find out the house was different, and I was right.",
        "author": "stybowski",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5sjmub/16_years_later_i_find_out_the_house_was_different/",
        "text": "This was originally a comment from another post, but seen someone say you guys may be interested this kind of stuff so here we are, sorry the the length, TL;DR included at bottom. \n\nMy parents split sometime within the last 6 months of the year 2000, so I was either 4 or 5 depending on the month and they were still together so this was during the first 6 months. Our living room was more like a den, the dining room ended at a small step that opened up to a fairly large room, in the shape of an almost perfect square, where we have always had 2 couches and a tv. The living room is split in half by a wall that was added after the house was built to make an extra bed room(my room). \n\nSince I was born I've lived in that house, it has always been the same, no alterations when I was alive. We had no pictures of anything pre-conception of me due to a horrible fire at my grandmothers where all of our photos were kept. Now when I was 4-5 I had a dream that our living room was exactly the same, my parents sitting on the couch together watching tv, except this room was now double in length. So now like a rectangle, and I had a toy chest(blue tote with duct tape holding a crack together) against the wall. There was a scorpion in the floor so naturally I ran to my toy chest, got out my toy bat, and proceeded to unleash the beast on this scorpion. \n\nI wake up and think it was a weird dream but don't say anything. Roughly 5 years later I still remember it vividly. I ask my mom if the living room was ever a garage or just anything different for a reason it was so long? She told me no it always had been the way I knew it. Now I'm almost 22 years old, my brother owns and lives in the house, mother lives elsewhere. My brother has been renovating and he texts me and tells me he's tearing down the wall to my old room. I work off so when I'm finally home, 2 weeks ago, I go visit and look at his progress. \n\nWhen I walked through that door my stomach dropped and I had a lump in my throat. That damn dream. It was just like I remembered it 16ish years ago. I've never seen pictures of the house without the wall separating the two rooms, no one has ever told me or described it without it, nothing. I go talk to my mom and remind her of the dream, and how weird it was seeing it, and she told me she remembered me telling her but since I was so little and it was so weird to her, she just lied to me. But she did know it used to be that way, and apologized for lying, she just didn't want it to scare me some how. \n\nTL;DR-dreamt something different from house 16 years ago, brother recently renovates house, house now looks like it did in dream 16 years ago. ",
        "created_utc": 1486445667,
        "upvote_ratio": ""
    },
    {
        "title": "Replay",
        "author": "Mockturtle22",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5s4kjl/replay/",
        "text": "The other day I was driving to work past construction zones.  I reach the end where the sign comes up and says that the work Zone has ended and there were no more penalties also means you can start going 65 instead of 55 again.  \n\nI glanced down at my phone to see the time as I had it docked in front of my clock in the car; it read 11:26 am.  I kept my eyes on the road and then noticed the sign coming up again... in the same place it was before. When I  looked at the clock again it read 11:22 am. \n\nI've had moments of odd time lapses either losing or gaining, but something about this bothered me.  \n\nThe next day when driving to work I paid extra attention to see if there were perhaps two signs placed and to see if perhaps the two ramps happened to look at all alike and they don't. \n\nI can only fathom this to be a slight glitch. ",
        "created_utc": 1486255269,
        "upvote_ratio": ""
    },
    {
        "title": "Man disappearing when I looked away.",
        "author": "Trinesto",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5s43vw/man_disappearing_when_i_looked_away/",
        "text": "This happened a few months ago, when I was in the food court at my local shopping centre. We (me and mum) were trying to decide what to get, and I saw a guy sitting at a table near us who was eating, about halfway through his meal, and seemed to have some sort of eye problem (his eyes were going different ways). \n\nWe then looked away, and when I looked back, which was about seven seconds later, he was gone and I couldn't see him in the food court anywhere. Just as I had looked back, too, an elderly lady was just about to sit down at the table he had been previously sitting at. I pointed this out to Mum, and she too did look around the food court and couldn't see him anywhere. She did see him previously to me pointing this out by the way. \n\n\n",
        "created_utc": 1486250998,
        "upvote_ratio": ""
    },
    {
        "title": "The alternate timeline",
        "author": "CCninja86",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5rzgwc/the_alternate_timeline/",
        "text": "This happened a year or two ago and I still vividly remember it because of how weird it was.\n\nSo one day, I was walking home from University. I was walking down the main street towards the side street we live on.\n\nSuddenly, I saw a red Suzuki Swift that looked *exactly* like my mum's red Suzuki Swift drive past me down to the end of the main street, and turn into our street. Now, sometimes my mum would arrive home from wherever she was at roughly the same time as me, and if she saw me walking home, she would stop and give me a lift the rest of the way.\n\nThis time, however, she didn't stop. I didn't think much of it. She probably just didn't notice me.\n\nNot a minute later, I saw my mum in her red Suzuki Swift, drive past me, see me, and stop just ahead to pick me up.\n\nAt this point I was all like \"but...I just...you were...\". I was still looking down towards the end of the main street, to try and spot the other Suzuki Swift. Why? Our street is a dead end, if it took a wrong turn, it would have had to have come back the way it came, and I had been watching the entrance to our street the whole time and hadn't seen it come back out. Now, as far as I'm aware, no-one on our small, short street has the exact same model of car as my mum (but maybe they do, who knows!), so I thought, \"maybe a friend is visiting someone on our street and they've parked around the corner\"\n\nWe turn the corner....nothing. No sign of it. I look down every driveway as we pass. Nada. Gone. Disappeared into thin air.\n\nI may never find out exactly what happened that day, but I like to think that somehow an alternate timeline temporarily leaked into ours, and in that timeline, the only difference was my mum didn't notice me walking home.\n\n",
        "created_utc": 1486194596,
        "upvote_ratio": ""
    },
    {
        "title": "Disturbing nightmare when I was 4",
        "author": "Just__a__Throw_away",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5rz738/disturbing_nightmare_when_i_was_4/",
        "text": "Probably not really to be considered a 'glitch', but when I was just 4 years old I had a very scary nightmare which seemed to be very vivid too at that time.\n\nThe nightmare began with me waking up from another nightmare (yep, a nightmare in a nightmare ;p ). I was about to get out of my own room in order to walk to my parent's room to continue sleeping in between them (like I usually did back then after I woke up at the middle of the night being scared), but when I opened the door of my parent's room, I saw a bunch of like demons or some sort of things (pitch black vague shadow-like, even blacker than the room, although the room was already pitch black). They were floating above my parents, dancing and singing some weird mantra/chant which sounded like \"Tredies Missen\" to me which is weird because it doesn't make sense in any language (although, I'm Dutch, and it sounded like Dutch tho, but it's still meaningless).\nThere were like 10 to 20 of them, not appearing to have faces, not really distinguishable from eachother, floating a sort of halfly though eachother, kinda-sorta dancing, gathered as if they were celebrating someones fear/suffering/defeat (might be mine), looking like a sort of gush/clog.\n\nI remember just jumping in between my parents as usually, despite the fact that I was literally going through those demons. When I was in between my parents, I remember the demons sort of halfly floating around me dodging me, halfly disappearing, turning more to the background of the nightmare. I heard my parents just talking some nonsense in their sleep about everyday things like hanging the laundry. (I don't remember it after this part, I guess it just ended around this point)\n\nThe nightmare really left a huge impression on me, even until this day (I'm 19 years old now). It was very vivid and I still wonder how I managed to experience such a dark and sketchy nightmare just being only 4 years old. I remember often recalling the nightmare to my parents throughout my childhood. They also told me that I told them about the nightmare after waking up, and confirming that it was indeed a nightmare.",
        "created_utc": 1486189358,
        "upvote_ratio": ""
    },
    {
        "title": "Hey Uncle Frank...RIP Uncle Frank",
        "author": "CyclopsorNedStark",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5rn4t3/hey_uncle_frankrip_uncle_frank/",
        "text": "So I used to work at a store and spent the mornings alone unless a stray customer walked in. We were beside a Target and usually I people watched through our glass storefront. One morning I saw a tall, dark haired older gent get out of a pickup truck and he was accompanied by a buxom older blonde. Uncle Frank and Aunt Patty going to Target. I hadn't seen them in years (truly they were cousins but much older, hence the Uncle and Aunt part) so I stepped to the door and waved at Uncle Frank and he gave me his trademark Shooter McGavin and Aunt Patty smiled and waved too. Figured they'd stop in to say hi but didn't and when I got behind the counter again they were gone and so was the vehicle. Odd, I thought. A few days later I was talking to my mom, who didn't particularly like them for some reason, and I mentioned that I saw them. She then informs me that Uncle Frank died months ago and Aunt Patty is in hospice care...the next day we learn that she had died, her son had her buried hush-hush and nobody knew until it was all over. ",
        "created_utc": 1486046681,
        "upvote_ratio": ""
    },
    {
        "title": "The podcast that didn't exist",
        "author": "xoivana",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5rji48/the_podcast_that_didnt_exist/",
        "text": "I just thought of this while at work currently, and figured I'd write about it quickly. I figured this was the right place to put this. \n\n\nWhen I was 17 I woke up one morning to get ready for school. I had an old phone (it was before Androids came out or iphones, it definitely wasn't a black berry either), and my alarm went off. I went to press one of the buttons on my screen to shut it off, when a podcast started playing. I did have apps for random podcasts on my phone, but I never bothered them as they were usually boring radio shows. \n\n\nAnyways, I clicked the button and this random podcast started going off. A man started talking and stated that the podcast was, \"the only Indigenous podcast\" and went on, I shut it off and started my day.  A few days later, I thought about that podcast and asked myself if I was imaging things or not. During this time there wasn't a lot of \"Indigenous\" anything, so I was surprised to hear of such a thing, considering I coincidentally clicked on it. I ended up checking all of the podcast apps on my phone and found NOTHING. Not one single Indigenous podcast. \n\n\nEither this was a stroke of my imagination, or a glitch in the matrix.  ",
        "created_utc": 1485995708,
        "upvote_ratio": ""
    },
    {
        "title": "The missing Beyblade",
        "author": "obito343",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5rdc5f/the_missing_beyblade/",
        "text": "This took place when I was 10 or 11. I am currently 23. \n\nAs an explanation for those that don't know Beyblades were spinning top toys that battles in an arena. Two or more people would launch their Beyblades into a stadium then whose ever was left spinning or in the area won.\n\nNow there was a model of the arenas that was plastic and looked like a black and green warp hole. It was called the Vortex.\n\nMy brothers, my cousins, and I were all battling beyblades in my room(i shared a room with my brothers). Now everything was going perfectly fine for about an hour. Then my brother pitted his newest beyblade( named Wyborg) against my cousins best(named Drigger). They launched their Beyblades into the stadium and they both pulled pretty hard so they were spinning very fast rotating in opposite directions around the stadium not touching. Then after about 30 second we all got excited as we saw them bolting at one another finally to collide. When they did there was a large crack noise and we all saw Drigger fly out of the stadium. Then we noticed that the stadium had a hole in it in the place where they had clashed. However, we never found Wyborg. After this event we rearranged the room, cleaned it spotless, even to this day I still reside in the same room, no Wyborg has ever been found. We firmly believe that at that moment the Vortex opened and sucked Wyborg into it, thus it was lost forever.",
        "created_utc": 1485921785,
        "upvote_ratio": ""
    },
    {
        "title": "A little confused about missing games.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5rd1m9/a_little_confused_about_missing_games/",
        "text": "     I want to preface this by saying that I don't think I've ever experienced anything as odd as this in my life.  I've never used Reddit but as soon as I read some stories I thought mine might fit in here and had to make an account to post this. This whole thing started years ago, when I was maybe 10 years old. Back then I had my Nintendo DS lite, which was the hottest technology. I kept all of my game cartridges in a pouch that shuts with a zipper. \n\n     My favourite games to play were both Pokemon of some sort, but I don't remember exactly the names. I'll call them A and B. I vividly remember buying one of them, but the other I have no clue where or when I got it. \n\n     I played Pokemon A for a long time before I lost it. I searched for it everywhere I could think of - in the pouch, in my room, whenever I saw a game case I would open it to see if it was in there. I loved that game, so I made sure everyone in my house knew it was missing and was on the lookout for it. This continued for about a year before we moved. All of our belongings were packed up carefully, and every corner of the house was checked and double checked. At that point, I accepted that Pokemon A was just gone. I dropped it on my way to school or something. \n\n     Years passed. I beat Pokemon B. Almost all of high school passed, and every time I found something relating to my DS I would check it pityfully just in case I missed it every other time I checked there. I didn't use my DS anymore but that didn't stop me from mourning the levels I could have beat on my favourite game.  \n\n     When I was in 12th grade my mom found my game. It was in the drawer where I always studied, where the computer is. There was no way I would have missed it. And even back when we moved, the desk was emptied before it was transported to our current place.  I couldn't find any way for it to logically show up. \n\n     Anyway, I didn't question my luck. I played it on my old, tired DS with all of the excitement I used to have, after I made sure to put Pokémon B back in the pouch and zipped it shut. For some reason two days after I found my missing-for-around-7-years game, I decided to dump all my game cartridges out onto the floor to revisit all of them. I noticed right away that Pokémon B was now missing. I scoured the floor, checked the bag again, checked where I kept the bag in case it fell out there, and then checked the floor again. No sign of it. I still have no idea where that game went. This was only about a year ago, so I remember for sure that I didn't lose it out of carelessness.  I honestly don't know what happened either time, and I don't know what to think. ",
        "created_utc": 1485918327,
        "upvote_ratio": ""
    },
    {
        "title": "wtf is this......",
        "author": "[deleted]",
        "url": "https://i.reddituploads.com/939cc47e7ca04cf0b979724a70388c68?fit=max&amp;h=1536&amp;w=1536&amp;s=e8925066509911c7e67186f812def382",
        "text": "[deleted]",
        "created_utc": 1485896145,
        "upvote_ratio": ""
    },
    {
        "title": "Living dreams backwards?",
        "author": "Warranted_Narcissism",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5qhz4h/living_dreams_backwards/",
        "text": "I'm not sure how often it happens, I don't always notice, but I'll have dreams of things that haven't happened (yet) in reverse order. \n\nSay I go to sleep Tuesday, I have a dream of a day later in the week/month/etc but every conversation, interaction, event happens in reverse chronological order from the dream. \n\nIf I dream of something happening Thursday, the last event of that dream day is the first in the irl day.",
        "created_utc": 1485533823,
        "upvote_ratio": ""
    },
    {
        "title": "Two men, one man",
        "author": "powerpi314",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5qfbe2/two_men_one_man/",
        "text": "I parked my car at the local liquor store this evening and gathered my wallet. I noticed a man walking to the front door of the store before me, wearing a hat and distinguishable jacket with patches on it. I am very aware of my surroundings. As soon as he entered, I got out of my car and proceeded to walk towards the front door as well. I heard some talking behind me, so I turned around, and in the parking lot row behind my car was THAT SAME GUY standing there talking to two other people. I was so confused and when I went into the liquor store and looked for my purchase. He came in after me and made his purchase. After he left, I questioned the employees.\nThey assured me he had been their only customer enter the store before me in the last 5 minutes or so. How could I even mistake this? My mind is blown.\n\nEdited: Grammar",
        "created_utc": 1485493329,
        "upvote_ratio": ""
    },
    {
        "title": "The 10-Second Grocery Run",
        "author": "WaffleRafl",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5qeb7w/the_10second_grocery_run/",
        "text": "Alright, so I'm not sure if this is exactly the place to put this in, but I've wanted to mention it for a while and has never come up. \n\n\nI very vividly remember being 7-ish years old and having my mom tell me she would go grocery shopping for like an hour or two, so she would leave me home by myself. \n\nThis was one of my, although not the, first times being left home alone, so I was obviously very nervous. I followed her to the door and waved goodbye, then watched her get into the car and leave. \n\nThen, a couple seconds later, as I started heading up to my bedroom I heard the doorbell go off. I looked out the little windows beside the door and there she was just a couple seconds later, with about 4 heavy plastic bags on her hands, my mom.\n\nI opened the door up, confused as ever. My first instinct was to tell her, \"How did you get here so early? You just left!\" To which she responded with, \"It's been 2 hours. You must've fallen asleep or something,\" which disclaimer: I did not.\n\nLast time I mentioned it to her was a couple years ago, and she didn't even seem to remember. I guess she just got 4 very heavy items?",
        "created_utc": 1485480339,
        "upvote_ratio": ""
    },
    {
        "title": "The Royal Ontario Museum - a building that truly looks like a glitch in the matrix",
        "author": "WhosFamousNotMe",
        "url": "https://i.imgur.com/RA4tX6n.jpg",
        "text": "",
        "created_utc": 1485401900,
        "upvote_ratio": ""
    },
    {
        "title": "Glitch to Escape the Cops",
        "author": "loomin_knotty",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5q5ycz/glitch_to_escape_the_cops/",
        "text": "This story takes place around 6-7 years ago when I was back in college.\n\nI lived in a small town with little to do, so naturally I smoked and drank from time to time.\n\nOne quiet winter night, some friends and I ventured to a local cemetery that was walking distance from my house. It was dark out, and snow covered all the ground. There was also light snowfall. We were smoking in a central part of the cemetery, where there were benches and a streetlight. Darkness covered the rest of the cemetery. One side was limited by the Kalamazoo River, another by a main road, and the back side by wooded areas and farmland. It is a fairly sized cemetery.\n\nI had two tall bottles of beer in both pockets of my brand-new puffy winter coat, along with another in my hand. I was always on alert because of paranoia. I determined that if police were to come in and crash our get-together, through the only real exit of the main road, I would run directly into the darkness toward the backside of wooded areas and farmland.\n\nFunny enough at some point, we saw headlights, and I was a little drunk and high so I didn't waste a moment. I stuck to my plan and ran straight into the darkness. That instant scatter effect occurred and the 6 of us were all separated. Separated somewhere in the darkness of the cemetery, all hiding from this police car. I believe the police had received a call, or something, because they had their spotlight going and they were clearly looking for someone.\n\nThey didnt drive through and leave, they stayed for what felt like forever. I was lying down in the snow, adjusting my body behind gravestones as the spotlight traveled through the darkness. As time wore on, my eyes adjusted a little better (granted it was basically pitch black) and our particular group of friends used bird calls for an event such as this one.\n\nA message was sent out from one friend, essentially guiding us toward the backside of the cemetery to hop the farm wire type fence that ran along the perimeter.\n\nNow you might wonder why we didnt do that immediately, because it wasn't much of an option. The cop car was actively looking for movement, he was driving in and out, back and around. As he went to a further side of the cemetery, that's when the time was right to safely hop the fence to essential freedom in the woods or empty corn fields.\n\nNow me being a dumb kid, i didnt want to ruin my new coat. And the fence was about chest height. It had the sharp points at the top, and i was certain in the darkness and in my state that I would rip my coat. I also didn't want to dump or shake my beers, because like I said I was dumb. So I started running alongside the fence with my hand, because I really couldn't see much. I was hoping there would be a weakened or downed part that would be easier to hop, sort of like the easiest way over possible.\n\nAt this point, the cop car is coming back toward me, on the very dirt road inside the cemetery that ran alongside this fence. So time was truly against me. I still had a good 30 seconds before I had to cut my losses and get over the fence.\n\nAt that very moment, my hand felt a gap in the fence. I couldn't see, so I kinda waved my hand in that area, and sure enough there seemed to a point where the fence stopped, then started up again, about three feet wide. Like I said, I could see nothing, so I gingerly stuck my foot forward and-this I remember as clear as any memory I've ever had-my foot landed on the other side of the fence. In my hurry, I thought \"well that was fortunate.\" I ran twenty yards into the field and laid down.\n\nEventually the cop left, I popped a beer to yet another exciting adventure, and our group started to reconvene. Now, I still dont want to ruin my coat so I simply figure I'll run my hand along the fence to find the gap so I can just walk through again. But this time, I seem unable to find the gap. I walked a good 100 yards well past where I believed it to be, and all the way back down. There was a clear segment of corn field between wooded areas that the gap absolutely HAD to lie in.\n\nI walked along this fence a good three times back and forth, at this point my friends are yelling at me like \"what in the hell are you doing man?\" I figure of course the gap is there I dont wanna climb this stupid fence. Eventually I can't stay in the cold all night, I gave my beers to my friends, threw my coat over and climbed the fence. I know you're thinking I shouldve done that in the first place. Well I was young, high, drunk, and stupid. Well of course my friends dont care or even want to hear about my perplexity. So I just gave up. Since I live nearby, I thought, \"simple enough, Ill come back tomorrow to find the gap in the daytime.\" Of course, thats very simple.\n\nOnly, this gap did not exist the next day in the daytime either. The gap, did not exist at all.\n\nNow, I don't know what happened that night. But I can tell you with 100% certainty that I walked through a gap in that fence alongside that corn field. Maybe someone was looking out for me.\n\nSorry about the length, but the setting and detail makes it all the more verified that I remember this clearly. \n",
        "created_utc": 1485378899,
        "upvote_ratio": ""
    },
    {
        "title": "Waking Up",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5q1fmd/waking_up/",
        "text": "[deleted]",
        "created_utc": 1485321650,
        "upvote_ratio": ""
    },
    {
        "title": "Lady catches glimpse of other realities and dimensions on film",
        "author": "AcrylicPearl",
        "url": "https://m.youtube.com/watch?v=fyF0ozqYo7I",
        "text": "",
        "created_utc": 1485299030,
        "upvote_ratio": ""
    },
    {
        "title": "Walked through a teleport?",
        "author": "WebSlinger66",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5pxn2i/walked_through_a_teleport/",
        "text": "I was 16 and I was working for a moving company. We were downtown Louisville, KY and were just finishing up an office move. We maybe had a couple hours left to go. The whole crew decided to grab a bite to eat before we finish up the job. My friend and I were in charge of taking a old furniture to the basement (storage) for clean-up the next day where we would take unwanted items to our warehouse.\n\nWe got to the basement, dropped off what we had in our hands and decided to go upstairs and walk to fourth street to meet the guys (a block away). When we walked back up the stairs, we did not recognize anything we had seen all day. All we saw were more stairs and a long hallway. We took the hallway and it led us to another stairwell. We had no choice but to go down said stairs. We went down the stairs only to be met with the same hallway.\n\nWe decided to re-trace our steps and went back to the basement. We were on the other side of the basement and saw that most of the stuff we placed there all day was on the wrong side and there was a lot more of it. We then proceeded to go back up the stairs we took a hundred times that day and a door led us outside. We look at our watches and we were \"lost\" for 30 - 40 minutes.\n\nWe were surprised to walk out and realize we were a few blocks away from where we were working from. Took us 15 or so minutes to get to fourth street where the rest of the crew were just ordering and congratulating themselves on a job well done.\n\nAfter the meal, the supervisor told everyone to do a last sweep around the offices for personal items and/or trash. Once we did, everyone was piling in the trucks. We were apparently finished with the job. It was at that point that although we were lost for only 30 - 40 minutes, time went through 3 hours and they finished the job without us.\n\n\nWe lost 3 hours worth of work and transported a few blocks away even across several streets because of this glitch. I'm sorry if this seems confusing but we still have not figured it out. Fuck you Matrix! I wanted to get those extra 3 hours on my paycheck!\n\nEDIT: Cleared up timing confusion.",
        "created_utc": 1485281087,
        "upvote_ratio": ""
    },
    {
        "title": "Journaling? (In A Way)",
        "author": "CyclopsorNedStark",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5pwfrr/journaling_in_a_way/",
        "text": "Do any of you keep very detailed journals just to keep track of the flow of time? I try to journal, just for my own emotional needs, but I've found that I keep very specific and incredibly detailed notes on everything (when I have the time) and I find that when I go back and read them it's not always what I remember. (Always a possibility that what I documented and what I recall are not the same, to a degree.) Do any of you ever find this to be the case? And if so, do you trust one over the other? Any thoughts on the matter are welcome!",
        "created_utc": 1485268747,
        "upvote_ratio": ""
    },
    {
        "title": "[meta]: Who has tried to discover the nature of their glitch in a meaningful way?",
        "author": "1KnowNothing",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5pv5d7/meta_who_has_tried_to_discover_the_nature_of/",
        "text": "",
        "created_utc": 1485248463,
        "upvote_ratio": ""
    },
    {
        "title": "SOS",
        "author": "Max9419",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5puur3/sos/",
        "text": "So I was maybe 20 years old (now I'm 26) when I was sleeping and woke up to beeping in my head. \n\nIt went 3 short, 3 long, 3 short so I was really confused at first because there was nothing that could have made this sound in my room, I was freaking a little bit, watching around me, but then I ask myself \"What does it mean? maybe it's morse code?\"\n\nso I google it and found out that 3 short 3 long 3 short mean SOS. I still have chill when I'm talking about it.\n\nDidn't knew what to do, could not sleep for the rest of the night.\n\nWhatever it was, sorry I could not help you",
        "created_utc": 1485242653,
        "upvote_ratio": ""
    },
    {
        "title": "I lost a whole day when I was 7 and it's never been explained",
        "author": "fridaycaliban",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5ptigb/i_lost_a_whole_day_when_i_was_7_and_its_never/",
        "text": "This happened to be when I was 7 years old - I'm 21 now and it still freaks me out. \n\nIt was a Sunday, I specifically remember because the next day was the Queen's birthday so we had a public holiday and there would be no school. \n\nI went to sleep on Sunday night, then woke up in the morning excited for a day off. \n\nI walked out into the kitchen and my brothers were getting ready for school. I laughed at them because I thought they had forgotten about our day off. \n\n\"What do you mean? It's a Tuesday.\" My brother told me. I thought he was lying so I went to ask my Mum and she told me the same thing. \n\nI was adamant it was Monday as I had no recollection of the previous day - I asked what I had done and my Mum just looked confused and told me I went to the park or something. \n\nI have brought this up since I've gotten older and everyone just sort of shrugs it off. No idea what this means or if anything happened but I've always found it very strange and it makes me uneasy. ",
        "created_utc": 1485224462,
        "upvote_ratio": ""
    },
    {
        "title": "Wasted years of my life in a dream, what should I do?",
        "author": "Stornila",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5pppry/wasted_years_of_my_life_in_a_dream_what_should_i/",
        "text": "(This was originaly posted on r/dreams but a kind user named ANCEST0R sent me here, thanks)\n\nYou may have read the 2012 AskReddit post about another very long dream. I found it today when I was googling for 'dreams that lasts for years'.\n\nAnyways, my name is Jonathan, I am (appereantly) 14 years old, I live in Sweden, I do MMA (appereantly) not professionaly and I graduated, met a girl, got the ufc championship belt, got married and woke up. All in a single fucking night. It all started when I went to sleep (appareantly) last night. I guess I thought I woke up the next day, monday, went to school and continued my life. But no, I woke up like years later and now Im crying like a little kid losing their toy, or years of their fucking life. Now I have to relive my life... What should I do? The same thing? Go to college? For now I have no idea. One upside to this is that I have a ton of interesting stories. \n\nSo, if you want to hear any stories or maybe help me figure this out you can leave a comment bellow. Thanks for reading this long post.\n\nPS: I made my reddit account for this sole purpose. Im gonna go check our more of reddit now, seems like fun.\n\nEDIT (2017/01/27): I'm going to make a new thread and write down some stories, any suggestions? ",
        "created_utc": 1485188343,
        "upvote_ratio": ""
    },
    {
        "title": "Uhh guys..",
        "author": "Person_of_interest_",
        "url": "https://www.facebook.com/eric.hill1/posts/10209213452990884",
        "text": "",
        "created_utc": 1485121378,
        "upvote_ratio": ""
    },
    {
        "title": "Lifeguard glitch",
        "author": "Illumi_natas",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5pgegf/lifeguard_glitch/",
        "text": "So I just remembered a situation from my childhood that has always left me feeling rather uncomfortable whenever it comes to mind. \n\nI can't remember the exact time frame, but I want to say It was the summer between 6th and 7th grade, so I would have been about 12. I live with my dad, who decided at the beginning of the summer that he wanted to buy a season pass to our local public swimming pool and make me go with him almost every day. I didn't mind it, as it was something to do, and we live in a small town with a decent pool. It was kept clean and there was rarely very many people there, so it wasn't an unpleasant experience, in fact it's a summer activity I do to this day with my child. \n\nNaturally, since we go almost every day, we get to know the lifeguards fairly well and are on friendly terms with them, including knowing each other's names, small talk and whatnot. \n\nAt some point during this summer, the church youth group I'm a member of invites me along for a week long summer camp they put on every year, and I decide \"what the hell\" and join them. Thinking about it now doesn't necessarily evoke pleasant memories, as it reminds me of how utterly homesick I was the whole time, as well as the experience I'm about to tell you about. \n\nThis camp has a swimming pool that opens it's gates to let us in every afternoon. The first time I join the other kids for a swim I realize that I recognize one of the lifeguards as one of the ones that works back at the pool in my town, I had seen and spoken to her just 2 or 3 days prior to running into her here. Being so homesick, I remember feeling very happy to see a familiar face and I immediately approach her saying something to the effect of \"Wow, what a coincidence seeing you here all the way on the other side of the state, so you work here too?\" to which she responded \"What?\" or \"excuse me?\" (I can't remember the exact words, but I will never forget this conversation, even if I wanted to).  I reminded her who I was, and that I go to the pool where she works in (insert hometown here), and she says \"No, I don't work there, you must have me confused with someone else\". It's at this moment I realize that there's something different about her voice... an accent I don't remember her having. I ask her \"You're (the lifeguard's name, I can't remember now, but I want to say it was Chris) right? Where are you from?\". She informs me that she is in fact from Australia, not my hometown, nor has she ever heard of it. \n\nI just remember the whole situation being so surreal, not being able to wrap my head around what was happening. I mean I was a few feet away talking to her and it was HER, she didn't just look similar, she was IDENTICAL. She said she didn't have any family here, and I thought she was messing around with me, but that accent was definitely Australian, she wasn't faking it. \n\nI don't know if this was a glitch, I mean, I've heard the saying that everyone has a \"doppelganger\" but to this day I have seen people that look similar, but never any 2 people that looked identical, aside from twins of course, let alone with the same profession. \n\nWell​ thanks for taking the time to read this, it felt good to talk about it, and I figured that this sub was as good a place as any to get it off my chest since I've never really told anybody about it except my girlfriend. It's one of those things that makes you too uncomfortable to really talk about, but yup, it happened.",
        "created_utc": 1485082624,
        "upvote_ratio": ""
    },
    {
        "title": "Shirt fell through floor?",
        "author": "Ichieaneb",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5pfdzi/shirt_fell_through_floor/",
        "text": "This won't be nearly as interesting as most of the glitches here, but I was reading someone's story about the sippy cup sinking through the table, and it reminded me of the only unexplainable thing that has ever happened to me. So I decided to register to post it. \n\nI was probably around 12 years old, at Target with my Mom, shopping for clothes. One of us had picked a shirt off the rack and dropped it on the floor...but when we bent down to pick it up, it was gone. We both sort of freaked out and were jokingly saying things like \"what, did it fall through the floor?\". \n\nThere's no way someone could have swiped it up real quick, there was nobody around, Target is usually a really dead store, at least where I'm at. ",
        "created_utc": 1485062296,
        "upvote_ratio": ""
    },
    {
        "title": "Trump is eeerily similar to a 90s cartoon character",
        "author": "indra_sword",
        "url": "https://www.youtube.com/watch?v=LQmbttoxUeE",
        "text": "",
        "created_utc": 1484996494,
        "upvote_ratio": ""
    },
    {
        "title": "Future child?",
        "author": "fliffernim",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5p4aed/future_child/",
        "text": "Maybe this is a glitch, but I don't know who else to talk to about this.\n\nSo for the last seven years, I dream about the same little girl. She is aware that she has been in previous dreams although sometimes she is an infant (or I am still pregnant) and sometimes she is older (no older than 9). The last time I saw her, we were playing chess. She was waaaay too young (think 6, but she was playing on her own without any help) and she was talking to me about her visits. I asked her when she was coming again and she ignored me. I kind of realized what was happening and asked what she was doing and she said 'we are waiting for daddy to come home.' At the time, I was newly married and excited maybe I would be having a baby. She suddenly stopped appearing. I wound up getting a divorce and now I'm scared/worried because it's been a while since I've seen her. Im going to freak out if I have child, wondering if it's the one from all my dreams.",
        "created_utc": 1484923924,
        "upvote_ratio": ""
    },
    {
        "title": "Motorcycle accident glitch",
        "author": "yeyo90",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5p3d6w/motorcycle_accident_glitch/",
        "text": "This happened on an afternoon about 9 years ago when I was 17. I was an amateur rider driving my 600cc motorcycle following behind a buddy of mine up a mountain with lots of curves. He had a 1000cc engine so he soon left me behind. Trying to keep up, I sped up to catch up hitting some pretty high speeds. I glanced at my mirror for a split second as I saw head lights approaching from behind paranoid it could be a cop. When I looked back towards the road, I realized I was headed straight towards a sharp left-hand curve. I pulled on my handlebars so quickly but at this point I was on the edge of the road catching gravel. My motorcycle slipped out from under, caught my left leg, and started to drag me off the road, straight towards this cliff with a drop of at least 300 feet down into the canyon with no railings to keep me from going over. I cIearly remember feeling the loose gravel hit my feet as I went down and  remember I flinched so hard just before being tossed over that suddenly I was back on the road tumbling in the opposite direction away from that cliff. It felt like I had hit a reset button on a video game and got placed back in the center of the road. I remember rolling and sliding across the ground onto the opposite lane as I watched my bike light up the road with sparks from the metal grinding against the pavement.  My adrenaline was pumping so hard that I was able to pop back up and ran, or limped so fast towards my bike as my left foot flopped with every step I took. Somehow I managed to lift up motorcycle and hop back on to avoid getting hit by incoming traffic. I started my motorcycle up again and quickly made my way back down the mountain only thinking how pissed my dad would be at me for wrecking this brand new bike he had helped me buy just weeks before. \nThe shitties part about this was that I drove 20 miles home without a visor, and my shifting peddal had broken off so I had to reach down and somehow pull my gears in with my hand while on the highway. When I got home I realized I had driven on a flat front tire the entire time. With no one home and my legs completely roadrashed and swollen, I had to fall over again, crawl out from under the bike, up my porch into my house, then back down into my mom's SUV so I could drive myself back to the the hospital.  \nI often take that same drive sometimes and every time I pass by that same curve Im always left questioning how it is that I ever survived that fall. \n\nEdit: I love this subreddit and the stories everyone post on here. Glad some of you were interested in this one. I have many more glitches that I feel I could share so I will continue to post on here.",
        "created_utc": 1484911426,
        "upvote_ratio": ""
    },
    {
        "title": "I just happen to wake up on this sub reddit",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5p33m8/i_just_happen_to_wake_up_on_this_sub_reddit/",
        "text": "[deleted]",
        "created_utc": 1484906782,
        "upvote_ratio": ""
    },
    {
        "title": "I registered just to tell you my glitch",
        "author": "ddbswest",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5p2r1o/i_registered_just_to_tell_you_my_glitch/",
        "text": "Hi, I have a glitch you might be interested to hear. About 10 years ago me and my husband were living in Spain. We were lying in bed one morning when my mobile phone rang. When I picked the phone up to see who was calling, the caller ID said \"Home\". So while we were upstairs in bed our landline was downstairs calling us!? \n\nI answered the phone and it was a woman's voice, it sounded like a recorded message, but totally garbled and with lots of interference. I thought it *could* be Spanish so I tried really hard to tune in, but I couldn't make out a word. The message just continued until I hung up. \n\nI immediately went downstairs and picked the landline receiver up and it was just the normal dial tone. \n\nThanks for reading.",
        "created_utc": 1484900082,
        "upvote_ratio": ""
    },
    {
        "title": "Disappearing Ink",
        "author": "malo0149",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5p2352/disappearing_ink/",
        "text": "I have experienced one true glitch in my life. If something doesn't make sense I tend to assume my memory is wrong or something, but with this incident, I'm positive that's not the case. It's a small, insignificant event, but I could never figure out what happened.\n\nI was planning a birthday party, and made some paper invitations. I had plans to see a certain friend a few days after making the invitations, so I just wrote his name on the sealed envelope and set it on a table by the front door so I would remember to grab it on my way to see him. The envelope sat in the same spot for about two days, and I saw it every time I entered and left the apartment. My roommate confirmed that she noticed it, too.\n\nOn the third day, I arrived home and noticed a blank, sealed white envelope where the invitation had been sitting. I thought it was strange, and wondered where the invitation with my friend's name on it went. I opened the envelope, and it was one of the party invitations. As I looked closer, I noticed that  the back of the card had an impression of his name from where I had written it on the envelope...yet it was sealed, and completely blank.\n\nThe only people who had access to the apartment were me, my roommate, my boyfriend, and the landlords. Neither my roommate nor boyfriend touched the envelope, and I can't believe that the landlords would have messed with it. The most rational explanation I can think of is that someone entered the apartment, removed the envelope with the name on it, got a new blank envelope from my room, placed the invitation inside, sealed it, and returned it to the table by the door. Which isn't very rational. It could have been a prank played by my roommate or boyfriend, I guess...but that's also pretty far-fetched. There are plenty of much less lame and odd pranks they could pull.\n\nAlso, it wasn't defective ink: all the other invitation envelopes kept their inscriptions just fine.\n\nAny ideas on what happened?? This was almost 10 years ago and I've never been able to come up with a good explanation for this.\n\nTL; DR Writing disappeared from an envelope after two days.",
        "created_utc": 1484889762,
        "upvote_ratio": ""
    },
    {
        "title": "Was in a car crash, I blinked and was fine on the road again.",
        "author": "Aestheticrayquaza",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5ozydd/was_in_a_car_crash_i_blinked_and_was_fine_on_the/",
        "text": "So starting out I was going on a road trip with my best friend, and her family who I was particularly close with. Me and my friend were 17, this was three years ago yet I remember every detail. \n\nWe were headed to Colorado (she had more family there) it was about an 8 hour drive, mostly desolate roads. We were about two hours into the drive and I was wide awake and excited to be spending a few weeks with my best friend. We were playing cards against humanity in the back seats of the car (the car had three sections of seating) laughing in hushed tones so her parents wouldn't hear. I remember her little sister and older brother in the seats in front of us were playing with a gameboy. \n\nAll of a sudden the car is hit on the left side, my side. We immediately start rolling and I shut my eyes. When we finally stop with the car laying on its right side. I taste gravel and dirt, there's broken glass in my mouth and ears. I look around and see my friend who is unconscious and bleeding profusely. I immediately start sobbing while trying to get my mangled arm that is pinned against my own body weight to try to get my phone out of my back pocket. (My first plan was to call for help, I was pinned by travel bags and my friends legs)  I couldn't manage to make a sound with how dry and full of gravel my mouth was. As I'm sobbing while trying to coach myself to move my arm. I think \"please, this can't be happening\" and close my eyes in one last attempt to move my arm. When I open my eyes, we're back in the car, completely fine. Same point in the road, and it's announced that we'll head by a gas station pretty soon. I swung my arm with such force I hit the top of the car and dropped my cards as I opened my eyes. My friend said \"What are you doing?\" laughing at me. I looked around quickly and everyone was fine, oblivious to what I just witnessed. I still tasted gravel in mouth while finishing that game. We went about with our trip, and I never said a word. \n\nNo matter how it happened, I'm always grateful I was able to blink and go back. ",
        "created_utc": 1484865601,
        "upvote_ratio": ""
    },
    {
        "title": "I gained 6+ minutes today?",
        "author": "PM_ME_GIFTCARDS_NOW",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5oyl95/i_gained_6_minutes_today/",
        "text": "I left my house at 11:54 am today to take my kid to school. On a good day it takes me 7 minutes to get there, and it's snowing heavily today. We were already running late and I knew we'd be at least 5 minutes late for school. If not more. At a red light about a mile from the school I happened to glance at both my phone and the car clock. Both said 12:04pm. When I pulled up to the school a few minutes later I glanced down at the clock. It said 11:58am. Somehow not only was she not late, but I know for certain that it said 12:04 just a few minutes before. Both my phone and car clock were showing the same time again. I can't explain it. ",
        "created_utc": 1484853433,
        "upvote_ratio": ""
    },
    {
        "title": "Dreams and real life?",
        "author": "CyclopsorNedStark",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5owvjl/dreams_and_real_life/",
        "text": "I dream almost always, like anytime I fall asleep I have dreams. About 90% of the time, I wake up with the emotions I had in my dreams. I also have no concept of time in said dreams and often what happens is that I \"live\" through days or even years in my dreams and get weary and wake up feeling tired because, I assume, I was exhausted in my dreams. I often wake up not knowing if I am still dreaming or not because the emotions are so real to me that it often affects how I conduct myself in 'real life.' Sometimes I find that I wake up having lived through events that unfold in my day and ever since I was a kid I've experienced this. If there's such a thing as \"fixed\" time vs time that can be changed, I'd venture to guess that me, and others like me, could pass through it while dreaming as it would be easier and the least traumatic way of doing that. I often find myself questioning if what I'm doing is real life or not, based on the enormity and gravity of these dreams that often feel more real than my life. Thanks for reading.",
        "created_utc": 1484836511,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone else think that the united nations flag looks very strange?",
        "author": "tjtoobzalot",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5ovvr9/does_anyone_else_think_that_the_united_nations/",
        "text": "I remember it looking like a regular map you would see in school, now it seems to have \"flipped\" ",
        "created_utc": 1484821948,
        "upvote_ratio": ""
    },
    {
        "title": "Used 3 eggs from a full dozen and next time i looked the egg carton was still full",
        "author": "aWhaleOnYourBirthday",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5otw62/used_3_eggs_from_a_full_dozen_and_next_time_i/",
        "text": "",
        "created_utc": 1484792267,
        "upvote_ratio": ""
    },
    {
        "title": "I put my bike front tire into the small opening in a large brick (bicyle parking slot). My friends stupidly puts sideways force on the back of the bike twisting front tire (in same fashion as above), he starts apologizing, we take closer look and its in perfect shape!??",
        "author": "[deleted]",
        "url": "http://imgur.com/a/LMZty",
        "text": "[deleted]",
        "created_utc": 1484773467,
        "upvote_ratio": ""
    },
    {
        "title": "Not sure if De Ja Vu or future visions",
        "author": "xGaMbL3x777",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5oqyek/not_sure_if_de_ja_vu_or_future_visions/",
        "text": "So this happened to me when I was 18 (28 now).\n\nI wake up one morning and I have this really strong memory of this vivid dream I had that night. For some clarity, most of my dreams seem to happen in random chunks. I like to call them dream segments. The first segment of my dream I am in a movie theater with my aunt. The movie starts playing and its scoobie doo. Next segment happens and I am outside my front yard looking for my car. I normally parked my car right in front of the house but it's nowhere to be found. I check all along the street and even around the corner and nothing. Jump to next segment and I am at a gas station on the corner of a highway intersection in my town. I look up and see a bunch of planes flying in the sky towards the mountains. Next segment I'm in a factory and I'm on the second floor and I'm running away from something big that's chasing me. I'm jumping across rafters, swinging from some and I end up on the roof and am on the edge of falling off. And the last segment I am back home and I walk out of my room and into the living room and there are a bunch of my grandmothers friends there. My girlfriend at the time is at the front door and I let her in and go into my room. All of my grandmas friends just ignore me and act like nothing happened. Girlfriend proceeds to tell me that she wants to break up with me and that's when I woke up.\n\nAfter waking up and remembering this dream, I proceed to get a phone call. It my aunt. The one from the dream. She asks me if I want to go to the movies later after work. We hang up and I turn the TV on to start getting ready for work. Guess whats on? Pup Named Scooby Doo. I finish getting ready and at this point I'm feeling kinda weirded out.\n\nI walk out to go to my car. It's not parked in the normal spot. In fact I cant even see it from the front of the house. I freaked out and then I noticed that it was parked in front of the next door neighbors house but out of sight. The rest of the day is pretty normal. A day or so later however I happen to be at the gas station that I was at in my dream and would you believe it, there is an air show going on and a bunch of jets are flying in formation overhead and around the mountain.  That Friday I am at the movies and it was the premier of the first Transformers movie. At the end of the movie when Shia is getting chased by megatron through the big abandoned buildings and running up the stairs eventually ending up on the roof, I couldn't help but remember my dream segment. It felt exactly like that. And to top things off...  A few weeks later I find out that my girlfriend was cheating on me. I call her out on it and she decides to ends things.\n\nI have never had anything like this happen again so exactly. Ive had the usual feelings of de ja vu where you can just predict the next few events like you lived them before but this was just too weird. I'm not really sure what to  make of them but after finding this subreddit I have become addicted to glitch stories. Thought I would share my own finally.",
        "created_utc": 1484762850,
        "upvote_ratio": ""
    },
    {
        "title": "Predicting songs that will play next on the radio.",
        "author": "PM_ME_GIFTCARDS_NOW",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5oqua7/predicting_songs_that_will_play_next_on_the_radio/",
        "text": "I listen to Pandora daily, and I always leave it on shuffle. I have 50-60 different stations that are mixed in that shuffle. Occasionally when I start it up, before the app even fully loads, I start singing a song in my head. Every time I think of a song, it starts playing when the app loads and starts up. There was once that the song I thought of came on, then the second song was one my son had been thinking of. 2 completely different genres. Mine was an alt rock song and his was a Broadway song. It's weird. ",
        "created_utc": 1484761798,
        "upvote_ratio": ""
    },
    {
        "title": "\"feeling\" future events that are going to happen",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5opxni/feeling_future_events_that_are_going_to_happen/",
        "text": "[deleted]",
        "created_utc": 1484753039,
        "upvote_ratio": ""
    },
    {
        "title": "At the Gym",
        "author": "kingofthesofas",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5opt2b/at_the_gym/",
        "text": "So I was listening to my classic rock mix on my phone at the gym while working out. Then as a new song started to play (lynyrd skynyrd - Freebird) It sounded weirdly in stereo. I pulled my ear buds out and the gym was playing the exact same song over the speakers in almost exact sync with my phone playing it. Needless to say I assumed it was a glitch in the matrix. ",
        "created_utc": 1484751710,
        "upvote_ratio": ""
    },
    {
        "title": "I routinely have little flashes of events that happen in the near future (within 24 hours.)",
        "author": "CyclopsorNedStark",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5ops6x/i_routinely_have_little_flashes_of_events_that/",
        "text": "For instance, yesterday I woke up and I saw my girlfriend's face telling me that she was fired and was crying. That was at 7:45, at 12:51 it was happening. This is something I've experienced my entire life, my mother has the same thing. ",
        "created_utc": 1484751442,
        "upvote_ratio": ""
    },
    {
        "title": "What about Bob movie scene",
        "author": "JeffAlbertson93",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5opah7/what_about_bob_movie_scene/",
        "text": "This is another glitch that I noticed recently.  I know that on Netflix sometimes TV shows and movies do not use the original soundtrack because of some copyright issues, and I thought after watching the movie What About Bob, that that may have extended to actual names. The scene and which Bob is in the doctor's office for his first interview and Bob says, \" there are two types of people in the world Dr those who like the Beatles and those who do not.\"\nThe thing is when I watched the movie a couple of days ago the Beatles were switched with the name Neil Diamond. I saw this movie in the theaters when it came out and I have it on DVD and it was never Neil Diamond I'm not certain if it was the Beatles or not but it was definitely not Neil Diamond I looked back through IMDb and all over the internet to find any references to the line and it always comes up as Neil Diamond.  ",
        "created_utc": 1484745518,
        "upvote_ratio": ""
    },
    {
        "title": "Flashforwards?",
        "author": "imPaprik",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5op9d1/flashforwards/",
        "text": "So I keep having these weird experiences about once a year, where I get a vibrating numb glitchy feeling in the back of my head while seeing some weird scene that I don't really recognize.\n\nLater, it turns out that shit actually happens and I get this massive Deja Vu when I remember it from the flashforward.\n\nIt's always something super dumb though, like something that happens in a movie (that I couldn't have even seen before), video game or just me handing over a ticket to a friend.\n\nI kinda wish I could read \"important\" future instead of this dumb shit that's probably just weird coincidence.",
        "created_utc": 1484745129,
        "upvote_ratio": ""
    },
    {
        "title": "Abducted by aliens, or just a glitch?",
        "author": "Merkuri22",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5ootjn/abducted_by_aliens_or_just_a_glitch/",
        "text": "My husband and I used to do the grocery shopping together.  It usually took an hour, and we usually did it Saturday morning.  This one time, we did it in the evening instead.  Neither of us wanted it to take long, there was more fun stuff we could be doing on a Saturday evening, so we didn't dawdle or make jokes.  We zipped through the store.  We both felt like we'd done a spectacular job being fast, and that we couldn't have been in there more than 30 minutes.\n\nMy husband starts loading the groceries in the trunk and I turn on the car to warm it up.  My eyes fall on the car clock.  I just sat there for a moment and blinked, then got out and walked back to the trunk.\n\n&gt; Me: Hon, what time did we get to the store?\n\n&gt; Him: Eight o'clock.\n\n&gt; Me: It's nine thirty.\n\n&gt; Him: *What???*\n\n&gt; Me: It's nine thirty.  Half past nine.  We were in there for an hour and a half.\n\nHusband had to go to the clock to check for himself because he didn't believe me.  We checked our watches as well, and they showed a similar time, so it wasn't like the car's clock was on the fritz.  We joked on the way home that we'd experienced time loss, and might've been abducted by aliens.",
        "created_utc": 1484738502,
        "upvote_ratio": ""
    },
    {
        "title": "Physics glitched out on me.",
        "author": "the_one_who_says",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5oos11/physics_glitched_out_on_me/",
        "text": "So I am at my home standing by a window at the right most corner smoking. Just in front of the window are the porch area and our small garden. It was a windy day in Marseille France. Just when I flicked my cigarette in perpendicular to where I was facing, the cigarette flew straight and then with a gush of the wind it went like in straight line right down in the dustbin in the left most corner of the area. If you can imagine you throwing something straight and it's hit with something and it going at a right angle. \n\nI stood there thinking of how the fuck it could have been possible, like the nature telling me to throw it in the dustbin. !!!! \n ",
        "created_utc": 1484737829,
        "upvote_ratio": ""
    },
    {
        "title": "The laws of probability in instances of coin-flipping",
        "author": "MikeyTupper",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5ooprd/the_laws_of_probability_in_instances_of/",
        "text": "This happened when I was majoring in demography some years ago. I had a course on probabilities and statistics in a wide auditorium-style class. Our professor was a seasoned veteran and quite the demonstrator. He would often use practical examples to show us the probability of a certain event.\n\nOne time he was playing around with the notion of 50/50 odds. What can we fairly call a 50/50 situation? Of course the first example to come to mind is the coin flip. Only two possible outcomes: heads or tails, the probabilities of which are equal. Of course, if you are hopelessly inclined to determinism, you can blame the weight distribution in the coin or the ability of the coin flipper for seemingly favoring one side over the other in a given sample.\n\nAnd so the professor asked us which side we favor and why we think it would win. It's amazing to see the cognitive bias some people have for random events. Some people claimed vehemently that for some unknown reason, heads came up more often. Just a quirk of nature. Others believed that tails was the underdog that always came out on top.\n\nSo everyone chose a side, heads or tails. Classmates were surprisingly into this whole little competition. All this excitement for one coin flip. Winner takes all.\n\nAnd so he flips the coin into the air, students watching intently. It does an incalculable number of twirls, seemingly shuffling about its random number generator. It lands and starts to oscillate in a strange fashion, not quite deciding on a side. This is when the crowd erupts in thunderous cheer and applause, for the coin had finally settled on its side surface, upright.\n\nCheckmate, atheists.",
        "created_utc": 1484736758,
        "upvote_ratio": ""
    },
    {
        "title": "Some time dilation and a missing joint",
        "author": "Iksuda",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5oofnx/some_time_dilation_and_a_missing_joint/",
        "text": "This happened in high school, it's totally serious and not the result of being high. A friend and I were in his basement. He went upstairs for a drink and I rolled a joint for each of us. It took a bit, and it seemed he'd been gone too long. I placed both joints by the window (closed and locked) when finished and waited. I'd see them in the corner of my eye every now and then. Eventually, he got back. I asked him what he was doing and he said just getting water like it was obvious, but it had been ages and didn't make sense to me. I turned around to pick up the joints and let that go, but only a single one was there. I told my friend that one was gone, and started searching. He joined in the search. We searched absolutely everywhere, and you must understand, weed was very precious to us at this point and it was his weed, so he needed to find his weed and I needed to prove I didn't steal it. There is just nowhere it could've gone. Every nook and cranny was searched - even the ones it couldn't feasibly have rolled to. I've never been completely confident that something must have vanished by means that are totally beyond my understanding, whatever those may be, but I already thought this was a case of that or an elaborate and bizarre prank. I decided surely it must be some sort of prank and asked him what the deal was. He asked how he could've done that (and why he would) and I reminded him that he was gone a pretty long time (although that still doesn't explain it, I was just grasping at straws at that point). He denied he was gone long at all and said he'd basically gone upstairs and back. We were both creeped out at this point. I'm normally not the kind of person to freak out about something like this, so I think I tripped him off too, and we decided to find a way to confirm it. We tried looking at our phone times - dumb idea, they sync up themselves. Then we compared our phones to the clock on the wall in the basement. By my estimate, he was gone about 10-15m, and his estimate was 2m tops. The clock on the wall was 12m ahead, and he swore it was accurate recently. I'd probably have forgotten and let this go hadn't the two things happened in coordination, but it's just a bit too much for me. To be completely clear, we were not intoxicated for any part of this story.",
        "created_utc": 1484731729,
        "upvote_ratio": ""
    },
    {
        "title": "Colored marks on the wall after waking up from dreams",
        "author": "MusicPsychFitness",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5oo7c3/colored_marks_on_the_wall_after_waking_up_from/",
        "text": "I used to wake up from intense dreams and notice little marks on the wall next to my bed (almost like fingers dipped in paint dragged down it) that were both dark and also had rainbow colored tints to them, as well. I've yet to hear a good explanation. My own fingers wouldn't leave marks like that - and no way to explain the rainbow colors. When I'd wake up after a new dream I'd notice a new mark.",
        "created_utc": 1484727487,
        "upvote_ratio": ""
    },
    {
        "title": "More than Déjà vu",
        "author": "Effectuality",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5oo6pc/more_than_déjà_vu/",
        "text": "So I've had deja vu many times in my life, and that's cool, people get it, I understand that. However this one time sticks out in my head as a total glitch:\n\n&amp;nbsp;\n\nOur family dog died, and we were just about to move house, so we decided to go there and bury the dog at the new place. The back yard was really funky and this was the first time I had ever been there, but from the moment we arrived the whole thing played out like a script in my mind. I knew the whole area like the back of my hand and I knew every action and word of my family members before they occured. At one point, after we'd buried the dog, the script in my head told me my mother, sister and I were going to walk over the little bridge, while my step-dad went around. I decided to rebel against it and walked around the pond, and it felt like it was wrong. Like I had deviated from the intended path. I knew I couldn't say anything to my family because of the mood at the time and the fact it was so weird, and also the script didn't \"allow\" me to mention it, but honestly it was like reliving a moment I had experienced at least a dozen times before, and it still messes with my brain even now.",
        "created_utc": 1484727189,
        "upvote_ratio": ""
    },
    {
        "title": "Faces that I recognise",
        "author": "Somethingcleaver1",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5onkot/faces_that_i_recognise/",
        "text": "I'm terrible with names, I've known this forever. Faces stick pretty well though. When I was 12, my family and I traveled to Italy for the first time. We're in a very small mountain town, and we sit down for our first meal. Our waiter comes up to us and as he's laying out the menu I get a good look at his face and I could've sworn I'd met him and shook his hand 100 times before. Ask him in broken Italian if he'd ever been to the States (I'd never been outside the US before). Nope. I spent the whole lunch in a bit of a daze. I thought about what felt like previous meetings, and it all felt very strange. Afterwards I shook his hand and sure enough it felt exactly like it had before, yet I'd never met him before. Or seen him. \n\nI had another one of these experiences in Switzerland a few years later. Gondola up a mountain, and I am again completely taken aback, as the woman standing next to me with her Great Dane feels utterly familiar. Her clothes, her dog, her face, all appear to be like that of an old friend. Yet she's 20+ years older and I am well aware that I've never met her before, yet I feel like I have. I know it's easy to chalk up to Deja Vu, but these experiences (those two I selected because there's less chance I could've met them elsewhere) happen a ton for me and I always know when it's happening.  ",
        "created_utc": 1484717727,
        "upvote_ratio": ""
    },
    {
        "title": "Strange sleep-crunch",
        "author": "fucking_weebs",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5onh54/strange_sleepcrunch/",
        "text": "A few months ago this happened to me for the first time, and it's happened at least twice since then.\n\nI'll be sleeping deeply and soundly but all of a sudden I'll half-wake-up because at some point in my sleep, I closed my mouth and felt a \"crunch\" between my teeth. I fall asleep again instantly but wake up remembering it. I have no way to explain this \"crunch\" or what it could be. I definitely feel it and I'm pretty sure I'm hearing it, too. \n\nSuper strange and pretty glitchy to me.",
        "created_utc": 1484716396,
        "upvote_ratio": ""
    },
    {
        "title": "Strange event from my childhood",
        "author": "Iwanttodiekillmenow",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5ongo9/strange_event_from_my_childhood/",
        "text": "So when I was younger, about in 6th grade, every now and then this strange thing would happen to me as I went to bed at night. My parents would often go to bed a few hours after I did, so when I went to bed I would often hear them talking or watching the television. As I began to lay down in my bed, everything would go silent, I mean the moment I touched my bed. Obviously this would freak my 6th grader self out so I looked outside my room, all the lights were off and my parents had gone to bed, the clock always read 1:35 on the dot. Needless to say this and some other equally creepy events did a number on me as a kid. Wow, writing this is really giving me the spooks, although I think it will be healthy for me to finally get this off my shoulders.",
        "created_utc": 1484716228,
        "upvote_ratio": ""
    },
    {
        "title": "Voices in my head",
        "author": "FlowJock",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5ondre/voices_in_my_head/",
        "text": "This happened over 20 years ago when I was \"home free\" in Santa Cruz but it was so crazy, I'll never forget it. (It's actually part 2 of a much longer story but works as a stand-alone.)\n\nI was sitting in a car with a guy and we were thinking of going to the beach to have sex. A voice in my head said, \"You want a cigarette.\" So I told him that I wanted a cigarette.  He suggested that we stop on the way to the beach and the voice said, \"You want to go out on the street and find somebody with a cigarette.\" So I got out of the car and went to the street.\n\nI walked up and down the strip for several minutes and didn't notice anybody smoking. Then I saw a woman sitting alone on the curb and I felt urged to go ask her. She said that she was looking for one too so I asked the next person to go by if they had some and they did.\n\nI sat down with the woman and talked to her about how one of my goals in life was to spread love and intimidate bad guys with the power of kindness. (Super cheesy but I was young.) She said that it sounded like a good cause and right before her cab pulled up, she went to an ATM, got $20 out and said, \"I have an overwhelming urge to give this to you.\"\n\nThen the voice came back and said, \"You want to find somebody who has cigarettes and invite them to coffee.\" So I started walking up and down the strip again. By that time, it was late enough that all of the restaurants had closed so there weren't many people. Then, out of the blue, a man walks across the street toward me, and says, \"Would you like a cigarette?\"\n\nI asked him if he would like to go for coffee at Denny's and he accepted. While we were at coffee, he said that he had an urge to take me to a friend's house but it was the kind of place where you show up with an offering and he didn't have anything. I told him that I had money and gave it to him so he could buy a 6-pack for them.\n\nWe went there and all sorts of crazy shit went down. People introduced me to their (invisible) alien friends and sang songs in a supposedly alien language... \n\nThese days, I don't hear the voices anymore. (It was never a hallucination, it was more of a thought/feeling that didn't seem to come from me.) And I don't know whether it would be better to find out that it was all a crazy hallucination of some sort or to find out that it wasn't. If it wasn't, I've wasted the last 20 years of my life getting my shit together when there's a really awesome grand adventure out there.",
        "created_utc": 1484715211,
        "upvote_ratio": ""
    },
    {
        "title": "Passengers on a Plane",
        "author": "Pliass",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5oid4d/passengers_on_a_plane/",
        "text": "This happened to me a couple times when I was a teen . My parents used to fly me off to Europe, to see my relatives, and I would often end up going alone. \nI remember sitting in the lounge, waiting to board the plane with the rest of the people. Going alone (and being bored), I would usually sit and study the rest of the passengers flying out with me.  I would then set my sights on one passenger, for no particular reason, and for some reason think that's who I'm going to sit next to. My mind would tell me that. Weird thing is...it is the person I would end up sitting next to. I don't know these people, I don't know their seat numbers, but for some reason I feel like they are the ones that will sit next to me- and they are. \nIt happened a few times and it creeped me out...i chalk it up to just coincidence. \n",
        "created_utc": 1484663669,
        "upvote_ratio": ""
    },
    {
        "title": "Student predicting moment to teacher 5 years in advance.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5ofuac/student_predicting_moment_to_teacher_5_years_in/",
        "text": "[deleted]",
        "created_utc": 1484625611,
        "upvote_ratio": ""
    },
    {
        "title": "First one I ever felt like mentioning to anyone else. (Rogue Pills)",
        "author": "TheRiflesSpiral",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5ob67z/first_one_i_ever_felt_like_mentioning_to_anyone/",
        "text": "I get glitches every now and then like any normal person; nothing out of the ordinary really but this morning I had a really odd one like I've never experienced before.\n\nI take a pill every morning for acid reflux. It's part of my morning routine that goes: toilet, wash face/hands, contact lenses, shower, pill, brush teeth. I only mention that because by the time I'm out of the shower I'm well awake and not at all blurry... I'm already thinking about my day and what I want to accomplish.\n\nYou also need to know that when my wife picked up my pills this time, she got the \"wildberry\" flavored ones by accident. They are nasty. Awful. I hate them with a passion equaled only by my hatred for heartburn which is why I take them. Somehow they're both too sweet and simultaneously bitter and the effect is instantaneous... the moment the pill hits my tongue I'm reaching for a glass of water to get the pill down and the taste out and then I brush my teeth for good measure.\n\nNow to the glitch:\n\nI hop out of the shower, towel off and grab the pill bottle. I grab one out with my finger like always and put the lid back on the bottle. I pop the pill in my mouth but I feel it graze my cheek as if I've missed. I look around for it on the floor for a few seconds, see it, and lean over to pick it back up when that nasty taste washes over my whole mouth.\n\nI stood up and got a glass of water to wash it down thinking \"WTF?\" When I bent back down to see if there actually was a pill where I saw it, there wasn't one. I looked all over... it's just not there.\n\nI somehow simultaneously missed my mouth but didn't... saw the dropped pill but didn't... and tasted the pill but didn't.\n\nTL;DR: My Omeprazole is trying to convince me I'm insane.",
        "created_utc": 1484577888,
        "upvote_ratio": ""
    },
    {
        "title": "My life has always been glitchy, but this one took the cake.",
        "author": "lawn_gbord",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5oai06/my_life_has_always_been_glitchy_but_this_one_took/",
        "text": "I moved into the place I live about 7 months ago, and my roommate has a cool little book collection sitting in the living room. One day I decided randomly I want to read one of them, it rather appealed to me, the cover of it, i'm not sure why, but i grabbed it, put it on my dresser and forgot about it. [This is the book in question](http://www.goodreads.com/book/show/6163091-me-death) (note, I don't read books often, i'll have little phases where i'll read a book or two then not read for a year or sometimes longer)\n\nFast forward a month or so\n\nI live on the outskirts of Toronto, Ontario, Canada. The city I live in has a population of just under a million people, and is about a 20 minute train ride out of the city. I recently got a new job in Toronto, and my commute involves a train ride followed by a 8 kilometer longboard trip. On that longboard trip I ride the length of a street called Roncesvalles. \n\nThis Wednesday I had work, and I realized I have a 20 minute train ride, I may as well use that time to read. It's the perfect down time as I just sit there and think to myself and listen to music. \n\nI take a look at the 4 or 5 books I have on my dresser, and see Me &amp; Death, perfect! pack it in my back and head out for the train. \n\nUpon settling in the train I take out the book and open it up, the pre-pages or whatever you'd call them have two quotes on them.\n\n\"death in itself is nothing; but we fear\nTo be we know not what, we know not where.\" - John Dryden\n\n\"A man came to a river and wished to cross, but there was no bridge or ferry. He saw someone on the far side and called out. \"How do I get to the other side of this river?\" There was a pause and then the reply: \"What do you mean? You are on the other side.\" - Old Joke.\n\nOkay, nice, I like tone this book is setting. Open up the first page. \n\n**Chapter 1**\n\nI was walking up *Roncesvalles,* the big street in my neighborhood.\n\n... butterflies down my spine, neck hairs standing.. okay, cool, just a coincidence. I read a few chapters and in them he mentions  Fruit markets and bakeries that are still there, and my train ride was over, and I began my trek to work. Riding up Roncesvalles, seeing the places he mentioned in the book. And a name, Tadeusz. \n\nMy work has 5 or 6 tills open during busy times, and when a till finishes with a customer, they leave and the next available customer goes to them, no designated place for people to go. \n\nSo i finish with my customer and call for the next person, my work involves a membership so he hands me his ID, and on it as i'm typing his name into the computer, I see his middle name.. Tadeusz.. and it was at this point that I nearly lost my marbles.\n\nI explained to him about the book, and how I make the same way the book mentions, and talks about a gangster by the name of Tadeusz. He explains that it's a very uncommon name, and that it's his grandfathers name, and his grandfather is from that neighborhood, as it is a predominantly polish neighborhood. \n\nThis happened a few days ago and thinking about it still gives me this weird, yet tangible feeling. \n\nSorry for the wall of text \n",
        "created_utc": 1484568458,
        "upvote_ratio": ""
    },
    {
        "title": "Deja vu for an entire day",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5o94qp/deja_vu_for_an_entire_day/",
        "text": "[deleted]",
        "created_utc": 1484545796,
        "upvote_ratio": ""
    },
    {
        "title": "Sex with 3 diffеrent girls, 3 timеs fоr 1 month. Wеbsite which hеlpеd to find sex relаtiоn withоut monеy",
        "author": "Davidpebag",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5o82s5/sex_with_3_diffеrent_girls_3_timеs_fоr_1_month/",
        "text": "[removed]",
        "created_utc": 1484532491,
        "upvote_ratio": ""
    },
    {
        "title": "Real life screen tearing",
        "author": "usernameisusername57",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5o2uxx/real_life_screen_tearing/",
        "text": "This isn't a one time event, as it happens to me about once a week. I'll just be going about my day, when I will see a real life \"screen tear\" in my vision. For anyone who doesn't know what a screen tear is, it happens when a screen is receiving frames at a different rate than its refresh rate. Since screens draw frames from top to bottom, it will result in a horizontal line, where above the line is an older frame than below it. It is only a momentary thing, but really weirds me out.\n\n[example](http://imgur.com/a/WfvsV)",
        "created_utc": 1484467372,
        "upvote_ratio": ""
    },
    {
        "title": "My unexplained bedtime experience",
        "author": "mackoa12",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5o2lk7/my_unexplained_bedtime_experience/",
        "text": "So I've been travelling south-east Asia for the past month and a half with two friends. I'm not sure if this is the right subreddit for this but here it goes... We've been staying in hostels so there is 6-10 beds in the one room. \n\nThis particular night I went home a bit earlier than my other mates just so i could get a little bit more sleep. To preface this I will say i had taken a valium, a sleeping pill, so this could have been some trippy side affects from that but i remember I wasnt asleep. \n\nSo I'm lying in bed trying to go to sleep, I have music playing in my earphones. At one point I then think  I hear someone come into the room. I open my eyes and just see a floating light. I didn't really take any notice because I thought it was just one of my friends using their phone for light since it was too dark to see any thing other than the torch.\n\nIm just chilling and i see the light coming towards me slowly. I was thinking that my friend was just looking for something and then it stopped next to my bed. I thought at this point my friend was just fucking with me, I swore i could see the silhouette of my friend behind the light. The light turns off so I get my phone out and shine a torch where i thought my mate was sitting. No one was there. I was honestly so certain someone was there but  was the only one in the room. Really freaked me out.",
        "created_utc": 1484462851,
        "upvote_ratio": ""
    },
    {
        "title": "I predicted the future for a second",
        "author": "SoullessFool",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5o1yr9/i_predicted_the_future_for_a_second/",
        "text": "So as a 12 year old, I fell asleep as per usual, and had a strange dream that only showed as a moment, but lasted an eternity. I dreamt of being in a certain building and talking to people i didn't know in a room I'd never been in before.\n\nThe dream ended and I woke up, and I remembered nothing of it. A few years later, as a sophomore, I get this strange feeling of deja vū and remember the moment and my head starts hurting.\n\nFreaky stuff. I remembered nothing, but I knew everything.",
        "created_utc": 1484453668,
        "upvote_ratio": ""
    },
    {
        "title": "I remember events that I'm currently in.",
        "author": "EnderScout_77",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5o1j2c/i_remember_events_that_im_currently_in/",
        "text": "It's happened to me quite a few times. I'd be doing whatever, then I remember the scenario I'm in like it happened before, but it's happening then. It feels like I did do it before but I haven't.",
        "created_utc": 1484447825,
        "upvote_ratio": ""
    },
    {
        "title": "Bathroom Glitch",
        "author": "T_Carey2213",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5o0ykr/bathroom_glitch/",
        "text": "Hello, this is a story from when i was 15 or so. One day at my fathers house i decided i wanted to smoke some pot. Easy enough right? So i head into the bathroom because i found out the fan in bathrooms is really good at sucking up the smoke. ( when close to it) But after i had packed up the bowl i left the bag on the counter. This is when it gets weird. I turn the shower on hot and when i go to pick the bag up to toss it it just shriveled up into a ball. Almost as if somebody crumpled it up.. Needless to say i didnt shower that night.",
        "created_utc": 1484440899,
        "upvote_ratio": ""
    },
    {
        "title": "I had a vision that I would meet my classmate when I was about 9 yrs old",
        "author": "CogInTheWheel",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5o0lpu/i_had_a_vision_that_i_would_meet_my_classmate/",
        "text": "So when I was around 9 or 10, my whole family and I were going on vacation to a hill station. We were climbing the hill on an SUV and I vividly remember me sitting at the back of the vehicle with my parents and I had a weird feeling/vision that I would meet a classmate of mine at the resort we were going to. Since I felt weird and I was young, I immediately blurted whatever I had seen/felt to mom in an awkward manner. Guess what happened? A few hours later, as soon as we reached the resort and were offloading our bags from the vehicle in front of the reception, my classmate strolls down towards it from one of the cottages. My eyes got wide and started waving and calling out to him and then we had a chat. I told him what happened but I don't know if he believed it. I was just mind blown. My parents were stumped too and had no explanation. Coincidence? I don't think so.",
        "created_utc": 1484436868,
        "upvote_ratio": ""
    },
    {
        "title": "...Other Me?",
        "author": "chewmonster830",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5o0gqd/other_me/",
        "text": "The other me\n\n\nLast year I went to the pharmacy to pick up a prescription.\n\nI gave the pharmacy tech my name--which has an uncommon spelling--and my birthday, and she types them in.\n\n\"We don't have anything for you.\"\n\nI insisted they did; I'd dropped the script off the night before and someone had called to tell me it was ready that morning.\n\nShe went to double check, and came back a few minutes later.\n\n\"You picked it up already.\"\n\nI insisted I had not picked anything up, and that in fact someone called to tell me I needed to. She walked off to investigate and came back with a piece of paper, which she slid across the counter to me. \n\n\"Is this your information?\"\n\nI looked. Yes, that's my name... my birthday... my doctor... my prescription... my dose... but no, that's not my address.\n\n\"Hmmm, maybe someone else has the same name and the two accounts were somehow merged in the computer,\" the tech said. She disappeared into the back of the pharmacy again.\n\nThis time she came back with the pharmacist. He apologized profusely and told me something that sounded absolutely nuts - there was another person, with the same name and birthday (including year) as me, who goes to the same doctor, *gets the same medication at the same dose, and also uses this pharmacy.*\n\nMy identity doppelganger had picked up my script earlier in the day, because their refill wasn't ready and no one realized the mistake. (Which is very understandable.)\n\nI left the pharmacy and started googling out of concern that my identity hadn't been stolen somehow, and sure enough… there was Other Me... same name, same birthday, same town. Other Me has a website (ourname.com), a Facebook, a LinkedIn, a YouTube account. We also have a mutual professional friend, who I texted to confirm the coincidence. He says he's sure he mentioned the shared name coincidence offhandedly when we first met.\n\nIt's been months and I'm still a little weirded out by the whole thing. WHAT ARE THE ODDS.",
        "created_utc": 1484435302,
        "upvote_ratio": ""
    },
    {
        "title": "Then, the cops showed up..",
        "author": "Chickenhawked89",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5nzv2g/then_the_cops_showed_up/",
        "text": "When I was 17 I had a dream that I went to my job at Taco Bell and for some reason I had cause the manager to call the cops. I was standing at the register when the cops came around the corner, rushing the counter as I took a customers order. I stood there feeling scared while they handcuffed me and hauled me off. \n\nFast forward to later that afternoon. I go into work and I'm there for not more than 15 minutes when suddenly two cops come around the corner, just like in my dream. Believe it or not, I yelped and practically ran for the manager, panicked that my dream was coming true. Turns out a few minutes before I walked into work a homeless man had thrown change in the managers face and he had called the cops on him. Phew. What a relief. ",
        "created_utc": 1484428791,
        "upvote_ratio": ""
    },
    {
        "title": "Perfect Lego Throw",
        "author": "Its_PADington_MFers",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5nzenb/perfect_lego_throw/",
        "text": "Not exactly a glitch, but this was probably the most uncanny event in terms of the physics involved of my life.\n\nWhen I was about 10 and my sister was 13 we were playing with legos. I was holding one of those small cylindrical pieces that went into the pirate cannons between my thumb and index finger. \n\nI was spinning around when my sister threw one of the standard 1x2 pieces at me from maybe 10 feet away. I felt a small flick on my fingers that were holding the cylindrical piece and when i looked, I was holding the 1x2 piece that she threw.\n\nShe threw the piece (while i was spinning), it hit the piece I was holding, knocked it out from between my fingers, and I was now holding the piece she threw.  I don't think I could replicate that in a million attempts.\n",
        "created_utc": 1484424076,
        "upvote_ratio": ""
    },
    {
        "title": "My deja-vu was so strong I was able to stop and think about what would happen next, and I even remembered the remembering part. Like a 30 second \"Groundhog Day.\"",
        "author": "pincushionface",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5nzd0t/my_dejavu_was_so_strong_i_was_able_to_stop_and/",
        "text": "So I was working yesterday and for a good 30 seconds or so everything was so strongly deja-vu it was crazy.  The podcast that was playing was exact.  The movements I made with my hands were just so.  I was working on a sewing project, the fabric I was cutting was the exact fabric.  The pattern piece was exact.  The joke in the podcast was made as I pinned a specific place.  I was able to predict the next thing to happen and I even remembered the predicting it. \n\nMy husband doesn't believe in deja-vu and says it's likely that I have done something so similar in the past that I was remembering but that's impossible.  The pattern and fabric were all new, the podcast was new.  There's no way I've done that EXACT thing before.  It was creepy.",
        "created_utc": 1484423565,
        "upvote_ratio": ""
    },
    {
        "title": "I saw my grandmother when she was 7",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5nzc3t/i_saw_my_grandmother_when_she_was_7/",
        "text": "[deleted]",
        "created_utc": 1484423298,
        "upvote_ratio": ""
    },
    {
        "title": "Shadow Man Watches",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5nzaex/shadow_man_watches/",
        "text": "[deleted]",
        "created_utc": 1484422814,
        "upvote_ratio": ""
    },
    {
        "title": "Knowing that someone was murdered before it happened",
        "author": "Cinnamon2017",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5nvwo8/knowing_that_someone_was_murdered_before_it/",
        "text": "When I was in third grade, there was a girl in fourth grade, let's say her name was Lee. This was a very small school K-12. All I knew about Lee was her name, and that she had a sister in 6th grade. Then, from what I remember they moved away. However, I saw Lee in a nearby small town at a movie theater, in the lobby. She was all dressed up like a princess, with a light blue flouncy dress on and a white coat - way overdressed for the occasion. She didn't notice me. She looked extremely unhappy. My guess was that she was there with her father, I don't know why I thought that. I don't know if I heard that her parents split up or what. But my assumption, for some reason, was that her father had her this weekend, made her get all dressed up, and took her to the movies. Like she was his date. I don't know, I just felt sorry for her. Anyway, I go on to fourth grade. The teacher was out for some reason. I guess we had a substitute and she was out of the room. I remember this girl saying they were all going to go across the street to the funeral home, to look at Lee, who had died. That she had lived in this other city, the one they had moved to (not the one where I saw her at the movies), and had been murdered. I said No, I didn't want to go. I pictured her lying in the coffin all dressed up in her flouncy blue dress. I thought they would probably dress her in something like that. I wondered why they brought her back to this town to have the funeral, but I thought maybe she had relatives in town.\n\nSo, for the last few years I started wondering how she was murdered, at only 10 or 11 years old. And this is decades later. I could not remember her last name or find out anything about her. Finally through ancestry.com (which I already had), I figured out her name, and found some news articles about her. She had not died when I was in fourth grade, but when I was in ninth grade, and she was 16. When I was in seventh grade, the old school was torn down and a new school was built. But I clearly remember this happening in the fourth grade room, thinking about her being murdered and in her coffin, and ever after that picturing her dying as a little girl. I have tried to picture being told this when I was 15 and in the other school, in every classroom, outside, in the cafeteria, etc. I do not remember it. I really don't remember even thinking about her after fourth grade, if I did, it was seeing her at the movie theater and then being told in fourth grade that she had been murdered.\n\nI asked one of my friends who was in the fourth grade class with me if she remembered it. She said it was a very old lady who died, and they went across the street to look at her. My friend was not the one who asked me to go across the street. I have no idea why they would even want to do that, if it was an old lady they didn't know.\n\nDoes anyone have any ideas how this happened?\n",
        "created_utc": 1484372631,
        "upvote_ratio": ""
    },
    {
        "title": "My shift meal disappeared ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5ntpr7/my_shift_meal_disappeared/",
        "text": "[deleted]",
        "created_utc": 1484345901,
        "upvote_ratio": ""
    }
]