[
    {
        "title": "404 Moon.jpg Not Found",
        "author": "Reaper4578",
        "url": "https://i.redd.it/jkjjm9y9j3sy.jpg",
        "text": "",
        "created_utc": 1492427363,
        "upvote_ratio": ""
    },
    {
        "title": "The Matrix has encountered a problem and needs to close",
        "author": "Clau_9",
        "url": "http://i.imgur.com/sEoiYnp.jpg",
        "text": "",
        "created_utc": 1492418584,
        "upvote_ratio": ""
    },
    {
        "title": "JR Smith just became a glitch in the matrix",
        "author": "[deleted]",
        "url": "https://imgur.com/a/jCCl5",
        "text": "[deleted]",
        "created_utc": 1492287491,
        "upvote_ratio": ""
    },
    {
        "title": "I'm fucking crying I don't know what happened",
        "author": "yazbeths",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/65hc0i/im_fucking_crying_i_dont_know_what_happened/",
        "text": "I'm sorry if this is poorly edited but it's 11PM and I'm terrified  \nJust thirty minutes or so ago I went down to the kitchen to check out the fridge because I was bored and therefore I had to grab a snack, but I didn't find anything that I wanted to eat. I, for some fucking reason I don't remember, decided it was a good idea to go check out the sitting room (I don't know what you americans call it? Just a room alongside the dining room with couches and a TV).   I look around once and immediately, on pilot mode, start making a beeline for the stairs.  I wasn't scared then, I wasn't creeped out until I reached the middle of the stairs and the realization hit me.  \nI had made direct eye contact with something.  \nI don't know how to properly describe the sensation, or even if this is the reddit appropiate for it, but I know that after locking eyes with *that* thing/person my mind went blank and i walked towards the stairs, totally forgetting why I went to the sitting room in the first place (It's been over an hour, and I still can't remember).   I'm locked in my room right now, I know my parents are in the room besides mine and that, logically, I'm safe; but I can't shake the feeling of deep, primal fear. I'll probably delete this post in the morning.\n  \n**TL;DR** Went to my sitting room, proceeded to forget why and left room on autopilot. Halfway upstairs realize I had locked eyes with *something*, and that something made me leave.\n\n**edit:** calmed down now, edited the post a bit to make it more legible.       also going to sleep bc now that the adrenaline has worn off i'm tired. really, really tired.",
        "created_utc": 1492230571,
        "upvote_ratio": ""
    },
    {
        "title": "Mystery slippers",
        "author": "redpantsa",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/654mcb/mystery_slippers/",
        "text": "Guys something weird happened and Idk if this is the right sub for this but any ideas helps.\n\nI was home alone all afternoon, going in between the living room, my bedroom and the bathroom. I decided to go take a shower and when I got out, a couple of my roommates were home. One of them asked if I had worn his slippers, to which I said no. Because wearing someone else's slippers is weird to me, and I don't like touching other people's stuff. But apparently, the foam insert to one of his slippers was laying in the living room entrance when they got home (they are a couple and came home together). I didn't touch his slippers, I had been going between the rooms all day, and was home alone. We have no pets. His slippers were like torn up and he had to throw them out.\n\nI'm pretty sure he's convinced I'm lying but I seriously have no idea what could have happened in the 15 mins of me walking by the living room, getting in the shower and them coming home to find that. I'm kind of freaked.\n\nAnyone have a rational explanation? ",
        "created_utc": 1492078824,
        "upvote_ratio": ""
    },
    {
        "title": "Maybe my girlfriend IS the glitch in the matrix.",
        "author": "Kingred24",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/65498y/maybe_my_girlfriend_is_the_glitch_in_the_matrix/",
        "text": "Another weird event just occurred with my girlfriend and this one is long and confusing and I am terrified.  \n\nSince last week, she hadn't been feeling all that great and she was stressed out about some problems with her family. A little backstory: ever since high school, we had this tradition where if one of us was stressed, the other would make them a little goodie bag. The rule was that it had to look as if it was cheap and poorly made. I don't know why but it was tradition. So I decided to make a goodie bag. I went to the store and got a bunch of silly little things that I knew she'd enjoy and when I went to get her favorite candy, I had to make a choice. She LOVES Pixy Sticks (I know, Pixy Sticks are a weird candy to love but she has Hypoglycemia and those are her go-to for it). Anyway, as I grabbed a bag of Pixy Sticks, I noticed a bag of the only candy she likes more than those sugar sticks... Almond Joys. I thought about it for a moment and decided to stick with my original plan. I couldn't make it look too \"expensive.\" This all happened on Sunday and she had been out of town. \n\nFast forward to yesterday, her birthday. After my last class of the day, I stopped to pick up her birthday cake and the goodie bag and then I headed over to her house. I came in and the house was dark and quiet. I walked into her small living room and found her sleeping on the couch. She was shivering and had no blanket so I carried her to her bedroom, kissed her forehead, and tucked her in. After I closed the door, I noticed that the light in the kitchen was on. I walked into the kitchen and to my surprise, she was sitting at the table, fully awake and a little startled. We looked at each other for a moment and she asked me if I was okay. I told her that I was shocked that she was there because I had just carried her to bed. Then, she explained that I came inside, put the cake and the goodie bag on the table and walked into the living room. She said that I walked upstairs with a blanket in my hand and she heard me say \"I love you\" before coming back downstairs and walking in. After she said this, we sat down and she opened the goodie bag. When she pulled out the bag of candy, I was shocked to see that it was not a bag of Pixy Sticks but instead, a bag of Almond Joys. As I was leaving, she asked if I could stay the night because the whole situation spooked her. I woke up next to her only a couple minutes ago but we were both sleeping on her couch with Netflix asking if \"we're done watching.\" On the coffee table is an open bag of Pixy Sticks and now I'm afraid to look upstairs.\n\nEDIT: Thank you for the suggestions. We're both heading to the doctor now just to be safe. As soon as we get back, we'll get some Carbon Monoxide detectors for her house.  \n\nUPDATE: I took Annie with me to the ER today and sure enough, CO appeared to be the culprit. Before I left to her house, I had left my car outside next to my apartment. Well, we had a power outage only an hour before and the generator was running and I'm not an expert in this area so I don't know how but, Carbon Monoxide filled up inside of my car and I bathed in it on the way to her house. It wasn't a whole lot and the window was open so it was relatively brief contact. But, I have suffered from many concussions and my messed up head has made me more susceptible to things like this. So... yeah. I got to spend the day breathing in pure oxygen and I am letting my car air out as well. Again, thank you for the suggestions about CO. ",
        "created_utc": 1492072339,
        "upvote_ratio": ""
    },
    {
        "title": "I thought this was a eerie story...",
        "author": "StrangeButTrueStory",
        "url": "https://youtu.be/DIE_aHzYH5w",
        "text": "",
        "created_utc": 1492020006,
        "upvote_ratio": ""
    },
    {
        "title": "Ghostly Table",
        "author": "stevebratt",
        "url": "https://youtu.be/qo3F3AYyrWo",
        "text": "",
        "created_utc": 1491928380,
        "upvote_ratio": ""
    },
    {
        "title": "It took way longer to figure this out than I would like to admit",
        "author": "TheJesterTechno",
        "url": "https://i.redd.it/hmtgaw9htwqy.gif",
        "text": "",
        "created_utc": 1491927200,
        "upvote_ratio": ""
    },
    {
        "title": "Glitch in GTA San Andreas",
        "author": "[deleted]",
        "url": "https://youtu.be/hIuf16BfBNI",
        "text": "[deleted]",
        "created_utc": 1491806090,
        "upvote_ratio": ""
    },
    {
        "title": "The time I either had dejavu or experienced the future as a second grader",
        "author": "srarky",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/64hf42/the_time_i_either_had_dejavu_or_experienced_the/",
        "text": "I don't know if this counts as a glitch in the matrix, but someone suggested I post this here\n\nIn second grade, we had this thing called BookIt, where you would log what you read every night for a month (or week?) and if you did so, you got a coupon for a free pan pizza from Pizza Hut. \n\nI remember this one time where my teacher gave me a coupon. I told her that I didn't actually log my reading every night - I missed a Wednesday. She said that, because of my honesty, I could have the coupon anyway. \n\nI have no idea what the fuck that was, but the exact same thing happened again, maybe the next day or week. It was like the first time didn't happen and I didn't know if it was a dream or what. The second that my teacher called my name, I knew that if I told her I didn't log every night, she would say I could have the coupon due to my honesty. \n\nIt freaked me the fuck out. To this day, I have no idea what the hell happened. ",
        "created_utc": 1491796591,
        "upvote_ratio": ""
    },
    {
        "title": "This freaks me out.",
        "author": "MissyJ22",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/64ge94/this_freaks_me_out/",
        "text": "Not sure if this would be considered a Glitch in the Matrix but I'm new here and don't know where else to post it. \n\nI just went out on to my balcony for a cigarette. Before I went out I was thinking that I must message my friend Jess as I haven't spoken to her for a couple of weeks. The minute I sat down for a cigarette, my messenger pinged and it was none other than Jess! I know it's more of a coincidence than a glitch but when things like this happen it always freaks me out. Does it happen to anyone else? Do you think it means that on some level we're all a little bit psychic? I'm just a bit gobsmacked. ",
        "created_utc": 1491783749,
        "upvote_ratio": ""
    },
    {
        "title": "My real story",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/64d1hw/my_real_story/",
        "text": "[deleted]",
        "created_utc": 1491744237,
        "upvote_ratio": ""
    },
    {
        "title": "I am glitched? No ads on Youtube",
        "author": "MandalaEffected",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/64cj2p/i_am_glitched_no_ads_on_youtube/",
        "text": "Today i was on youtube and i observed there is no ads on youtube at all .wtf ?",
        "created_utc": 1491735046,
        "upvote_ratio": ""
    },
    {
        "title": "The girl who came from no where",
        "author": "AltmerMagnus",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/6436rl/the_girl_who_came_from_no_where/",
        "text": "So, I just stopped by my friends house and found out something interesting. Let's first start with a little contextual history, so you can better judge. I've seen a few minor glitches but this is weird. I'm changing names in the story.\nA few years ago, before I lived with my current boyfriend, I would come over here, I didn't have a license and he doesn't drink coffee, so I would walk around the block to buy some at the 711. One day I took a different road into the neighborhood and hear my name called out with joy. I looked over and this girl says, \"AltmerMagnus, it's me, do you remember me? It's Fadra!!!!\" I didn't recognize her face but remembered her name from a friend we shared from high school, she has a unique name, which isn't really Fadra, it's been almost 10 years since graduation, and I had recently moved back to the state, strangely so did our mutual friend whom I was close with, and still am, I'll call her Amber. \nI say I remember her, to avoid embarrassment, we go through the pleasantries: how's she been, how's life etc. She gets a suspicious look and asks about Amber, have I seen her around and such because she heard she moved back to town too, and keeps having dreams about her.  I mentioned seeing her in her new home, and mentioned it's funny that Amber moved into a house that was on the street we used to party at. I didn't realize at the time what I did.\nA few months later I go to catch up more with Amber, she brings up that Fadra had stopped by her house, and didn't know how she found out she was back, let alone where she lived. I felt bad and apologize for mentioning the street, and tell her I didn't know she was trying to avoid Fadra. \nYears go by, I tend to be antisocial but I stop in on both girls here and there, ESP Amber, eventually stop visiting Fadra, because I notice her fishing for info on Amber every visit, Amber tells me Fadra has drug issues, I'm 4 years clean last month, so you know, the signs were there to back the claim, I won't go into detail. Amber is an upstanding morally conscience church going type, she's studying psychology, Fadra is obsessed with her. Whatever. So today I had to go grocery shopping, I have to drive by Amber's street, I haven't seen her for a while outside of the carloop to pick our kids up at school. So my heart tells me to stop by, as her street approaches I turn in to go see her. \nFadra is brought up in conversation. I finally say, \"Amber, this is weird, I remember her name from you talking about her back in the day, but I don't remember ever meeting her, and she recognized me after 10 years. When I would visit her, she would bring stuff up that I remember doing with you and the group, but never remember her there for those things. I feel like I would remember the only black girl besides you in our group.\" \nI felt bad not remembering her so had never mentioned it, thinking my memory was leaving her out for some reason. The look on Amber's face was shock, and she says, \"I don't remember her either, I remember a girl lived nearby with that name, but don't remember hanging out the way we supposedly did, and we supposedly hung out every day for 2 and a half years. I figured I didn't remember but she had to be right considering she remembered so many things which actually happened.\"\nAmber hangs with another girl from back then, we shall call her Rose. Rose just completed her PhD in biochemistry, and she never moved out of town. Rose and Amber are best friends. I ask if Rose remembers her, because her memory is amazing.  She remembers Fadra. Here's the thing though, she asserts that we all four hung out every day, that we rode in the car with Fadra driving, neither of us remember that happening. I only remember Amber being a driver, or her older brother, neither of remember Fadra driving us anywhere.\nSuddenly, I remember the real reason I stopped visiting Fadra, even shocked at myself for not remembering why.\nI used to take pictures all the fucking time, when I look at them she's nowhere to be found. I had a pic of me and Amber holding mice when we were 18, right before we were both about to move. It was my favorite picture. It was just me and Amber. I had a spot for it in the drawer of my jewelry box. The last time I talked to Fadra, she showed me that picture, and she was in it, but me and Amber were in the exact position and had the same facial expression, same weird clothes that rocker chicks were prone to wearing back then, except Fadra was in it, my heart when I saw that picture with Fadra added in, it pretty much stopped. I got home and looked for the picture, it wasn't there, I remember looking at it that morning as I accessorised. I never saw it again. The day it happened, I had a weird feeling, I believe the brain is funny, so I settled on, 'perhaps her showing the picture caused my brain to remove her from a picture I never actually saw in the first place, and then it placed the memory of the picture into my mind, and the past 10 years of looking at the picture, and pulling it in and out of the jewelry box was created the moment I saw the new picture.' I never liked that explanation, but I somehow forgot about it until Amber said she didn't remember Fadra either. How could I forget something so weird and unsettling? Do you guys think this could be something unusual or simple psychology? My heart sunk when Amber couldn't remember Fadra, because when she said that, I remembered the picture suddenly. One or the other, but both? The main person in that group was Amber, not Rose, we were all friends, but we were all close to Amber, and didn't hang out together unless Amber was there, she should remember her better than Rose, and Rose only has very negative memories of Fadra. What's your opinion on this weirdness? ",
        "created_utc": 1491599583,
        "upvote_ratio": ""
    },
    {
        "title": "Out of all the dimension travelling objects...why soap dishes?",
        "author": "rawdra",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/63yrj9/out_of_all_the_dimension_travelling_objectswhy/",
        "text": " Same object, a tiny town in Rural Hawaii, and a swamp town in Louisiana.\n\nTo start off, 8 years ago I briefly lived in a tiny town called Ponchatoula, which is a very Cajun town of 4,000 people in the swamps of southern Louisiana.  While living in there, I happened to buy a matching set of ceramic soap dishes, that I thought were one of a kind.  They are a blue flower and a green leaf. They are obviously hand glazed with no sign of mass production.  They were in a funky artsy shop with most of the things coming from local artists.  \n\nFast forward to today.  I now live back where I grew up on the Big Island of Hawaii.  I was eating dinner at my dad's property tonight with him and my kids.  He lives in the district of Ka'u.  It makes Ponchatoula look like an urban mecca. There is no postal service, water lines, grocery stores, trash pick up, nada. It is true Hawaii country. My dad's property that he's had for 25 years is next to another huge empty lot that is several acres and totally overgrown with massive (15ft high) , thick Christmas berry bush. The properties are divided by a 5 ft lava rock wall that my dad built 20 years ago or so.  No one has EVER occupied that property as long as he has been there. There is not even a driveway. \n\nNow it gets weird.  We were eating outside and just finished dinner and my six year old son ran off to play like always.  Then we hear him screaming, \"Mom!!!\".  We saw him hopping over the lava rock wall running to us. He can from the neighboring property I mentioned before.  He was holding a dirty flower soap dish that looked exactly like mine.  It even has a chip on one petal, exactly like mine.  He said he found it in the middle of the lot. He had been running through the bushes playing some 6 year old suedo Rambo game.  \n\nI said, \"Very funny B.  You must have snuck it from home and burried it there. You didn't trick me.\" \n\nHe insisted he really pulled it out of the dirt in the middle of the bushes.\n\nI told him, \"Here, let's write out names on the back, that way when we get home there is no way you can try to put it back.\"\n\nSo we did. \n\nWell I get home.  And what?! My soap dish is still in the bathroom?!?!? It has the same chip!! \n\nOkay, how did an IDENTICAL  soap dish to one I bought in an artsy middle-of-nowhere boutique in southern Louisiana get in an abandoned lot that no has been for at least 25 years but my kids?  What are the chances that I would buy this unique soap dish in an obscure town only to have my son find another in the EXACT condition as mine in an empty property next to my dad's place?  Ponchatoula is a totally random town.  Kau is even more desolate and isolated.  Pleeeeease help me wrap my head around this.  \n\nHere is a picture of the front and back of dishes, and my super stoked son: https://imgur.com/gallery/dt5NB",
        "created_utc": 1491546643,
        "upvote_ratio": ""
    },
    {
        "title": "Jury Duty call line glitch?",
        "author": "Nightstealth",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/63xd7p/jury_duty_call_line_glitch/",
        "text": " I don't actually know anything about phone signals and all that, so if anyone actually has a technical explanation for what happened that'd be great.\n\nA few years ago my sister got a jury summons notice. As per instructions she called the listed number the night before she was due to appear to make sure it hadn't been cancelled. Well, the message instead referred to a date from about 3 weeks earlier. Thinking they just hadn't updated the message yet she hangs up and tries again some 20 mins later. Same thing. She waits some more, tries again, same message.\n\nBy about 8 or 9 pm I go to her room and she is on her desk with her phone complaining about how it still hasn't updated. Thinking maybe she's not dialing the right number I grab her phone and letter, sit on her bed, dial the number and wait. Lo and behold, the message is now referring to tomorrow and how it's been cancelled. No problem, right? She just didn't dial something correctly. But Sister doesn't believe me. She grabs the phone, presses redial...and the message is from 3 weeks earlier. She even puts it on speaker for me to hear. But I take the phone back, press redial, put it on speaker too...the message is from today.\n\nWe go back and forth before I tell sister to come over and sit by me on the bed to dial. She does so, and it's the correct message. We start getting curious and roam around the house, continually pressing redial to see which dates pop up. We got the message from 3 weeks ago if we called from the far side of her room (where the desk is), and then to about about the middle of her room and all the way to about halfway of the adjacent dining room. There was also a spot right before entering the kitchen, an area in the center of the living room and near the front door. Calling from just about anywhere else in the house (the lower level in any case, we didn't check upstairs) we would get the correct date.\n\nMust have dialed that number a hundred times over, often going back to the same spot two or three times to check if the dates we got had changed in those area. They hadn't. It was always consistent. \n\nAgain I'm not sure if there's a logical explanation for this, if there is I'd like to hear it because we still wonder about it occasionally. At the time it felt like a Twilight Zone episode in a funny sort of way. We did feel bad about all the calls though, we must have raked up a good phone bill.",
        "created_utc": 1491528696,
        "upvote_ratio": ""
    },
    {
        "title": "I think I just observed quantum tunneling.",
        "author": "crushcastles23",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/63x6dq/i_think_i_just_observed_quantum_tunneling/",
        "text": "I have my bedroom window open and a box fan in it, it's very windy outside and it occasionally causes my bedroom door to swing open since the door knob it damaged so I bolt my door with a tower bolt. I bolted it and had pulled on the door knob to make sure it was in place. I was laying in bed on my laptop a few minutes later when my door swung open violently, the bolt was still fully out the way it would be if it was engaged.\n\nSo, I think I just observed quantum tunneling on a large scale.",
        "created_utc": 1491526644,
        "upvote_ratio": ""
    },
    {
        "title": "The reappearing bowl of pasta...",
        "author": "HooliganS_Only",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/63vh7e/the_reappearing_bowl_of_pasta/",
        "text": "So, I'd like to start this off and say I do not have proof, but I could not possibly have imagined this. \n\nI work as a busser in a high end family owned restaurant called Bricco. The other day I showed up for my shift at 4:00pm, and there's still two tables from the lunch shift. One of the tables was a group of regulars. When I made my first round in the dining room to their table there was only one bowl of nearly finished buttered pasta with his fork and knife off to the right of the bowl (5 o'clockish; to signal he's finished). I gestured towards his bowl and asked if he was all finished, to which he replied \"Oh, yes I am, it was fantastic, thank you.\" I replied, \"I'm glad you enjoyed it\", and walked back to the kitchen to drop off the bowl in the dish pit.\n\nAbout twenty minutes later as I'm doing laps in the dining room for anyone in need of bread or a table in need of cleaning, I pass the table of regulars again, and the bowl of nearly finished pasta with the fork and knife at 5 o'clock was on the table again, plus two half eaten bowls of salad. So I took his bowl again, but didn't say anything. \n\nWhen I initially took the bowl the first time everyone looked like they had already eaten and someone else had taken the other plates before me. They look as if they were ready for the check, and then I come back to the table almost as to witness a jump backwards in time, but just for them. Like I said, I have no proof. But that interaction was my first with a customer that day. \n\nI figured this event qualified for this page. ",
        "created_utc": 1491509330,
        "upvote_ratio": ""
    },
    {
        "title": "Two identical​ yellow cars parked next to each other in a busy parking lot",
        "author": "piratespoison",
        "url": "http://imgur.com/gqPsjVC",
        "text": "",
        "created_utc": 1491501543,
        "upvote_ratio": ""
    },
    {
        "title": "Only one streetlight on at 4:05 P.M.",
        "author": "Apparently_Coherent",
        "url": "https://i.redd.it/15pnoouluypy.jpg",
        "text": "",
        "created_utc": 1491498952,
        "upvote_ratio": ""
    },
    {
        "title": "Strange occurance with Genius",
        "author": "RiskBreakerMisseps",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/63q1kt/strange_occurance_with_genius/",
        "text": "When I tried to log into Genius with my email and username, everything seemed normal until I posted an annotation and noticed my name was under something else (HoneyDewi). My normal user is slowrainofficial. I signed out and tried to contact them by signing back in and messaging, but it said '404 Forbidden Error'. Is this my clone?!",
        "created_utc": 1491443490,
        "upvote_ratio": ""
    },
    {
        "title": "The disappearing magazine.",
        "author": "DuffTx",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/63nzcl/the_disappearing_magazine/",
        "text": "Sup Guys,\n\nJust stumbled onto this Reddit from one of the paranormal subs. Anyway, it reminded me of something that happened me a few years back - I was heading up stairs to bed one night having been reading a magazine downstairs. I decided I needed to strain the spuds as I was walking towards my bedroom, so I opened my bedroom door without turning the light on and threw the magazine onto my bed (I seen the magazine hit the bed from the lighting from the hall) and went to the bathroom. Did the deed, washed up and returned to my room, flicked on the light and low and behold, no magazine. Literally disappeared off my bed. I checked everywhere. It didn't slide off and down the side/under the bed. Wasn't under the pillows or covers. Vanished without a trace. I even went back into the bathroom to see did I have some sort of brain-fart and actually take it with me there. Nope. Gone never to be seen again. And before anyone asks, no, it wasn't 'that' kind of magazine.\n\nWeird world we live in.\n\n\nEDIT: Should also add, I was alone in the house so it wasn't someone messing with me either.",
        "created_utc": 1491422060,
        "upvote_ratio": ""
    },
    {
        "title": "Mass locker combination change in high school.",
        "author": "SovietSocialistRobot",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/63luis/mass_locker_combination_change_in_high_school/",
        "text": "I have talked about this in a couple /r/askreddit threads before, but never gave a full story. If you think you have read this before, that's most likely why.\n\n\nIt was May, towards the end of my Junior year in school, and everyone had their locker combinations memorized, and in muscle memory. It was a normal week up until a Thursday when absolutely no one in the school could open their locker. Students flooded the office with questions, and everyone was sent to their homeroom while all the staff tried figuring out what the hell was going on. The teachers got crazy mad when they tried the combinations they had in a book in the office, and they worked fine. They thought it was some end of the year prank. The students thought the same, but blamed the staff. A kid in my French class had his locker combination as his password, and it still worked, which let us students know we weren't crazy. The blame shifted to the janitors, but they were quickly lifted from suspect status. The locks weren't external, but part of the locker door, and around 8 screws needed to be undone to change them out. It didn't seem feasable that the 6 or so staff members that stay in the building into the evening could change out hundreds of locks overnight. \n\nThe next Tuesday, it was chaos. Students were pointing out that the drinking fountains were on the opposite sides of the hall, and most noticeably the blue and white floors in the hall were now red and white, which makes no sense as blue and white were  our school colors. Teachers and all the staff noticed, and asked the janitors what happened. Absolutely no one in the school or school corporation knew what had happened. The rest of the year, everything seemed fake, and we didn't exactly do much. I changed schools the next year, as did many others, and I never heard about anything there again.",
        "created_utc": 1491402464,
        "upvote_ratio": ""
    },
    {
        "title": "Mass Locker Combination change in high school.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/63lt8g/mass_locker_combination_change_in_high_school/",
        "text": "[deleted]",
        "created_utc": 1491402103,
        "upvote_ratio": ""
    },
    {
        "title": "I guess they all got the memo this morning.",
        "author": "[deleted]",
        "url": "https://i.redd.it/d1k9o1ck7mpy.jpg",
        "text": "[deleted]",
        "created_utc": 1491345920,
        "upvote_ratio": ""
    },
    {
        "title": "Teleporting chapstick?",
        "author": "NightEch0",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/63a83d/teleporting_chapstick/",
        "text": "Okay so, this happened around the end of December of last year. I had gone up to the Okanagan to visit my great grandmother and I brought this bright orange chapstick with me. I know for a fact I had brought it because I mixed it with this red lip crayon I had gotten as an early christmas present from my dad. Now I ended up visiting my aunt who lived in Osoyoos and I took with me as it was the only chapstick I had taken with me for the whole trip. I had to go to the washroom and as I was walking out I realised it it wasn't in my back pocket anymore, nor my front ones. I looked around the washroom but couldn't see it anywhere. Then about a couple months ago I found it in the cup holder in my mums van, and I know it couldn't be a mix up of me forgetting it in there because we had gotten a rental as my mums van is old and iffy, and the trip was going to be very snowy. Anyone have any explanation? ",
        "created_utc": 1491259156,
        "upvote_ratio": ""
    },
    {
        "title": "Almost identical cars with almost identical registration plates. (Xpost from r/mildlyinteresting)",
        "author": "elvisspringsteen",
        "url": "https://i.redd.it/1b4luyfordpy.jpg",
        "text": "",
        "created_utc": 1491243754,
        "upvote_ratio": ""
    },
    {
        "title": "Got Transported in Bocas Del Toro, the story with pics and vids....",
        "author": "sailboatchick",
        "url": "https://youtu.be/MmBXIT6gmqo",
        "text": "",
        "created_utc": 1491243170,
        "upvote_ratio": ""
    },
    {
        "title": "Triple glitch",
        "author": "mopsarethebomb",
        "url": "http://imgur.com/uYDqvI0",
        "text": "",
        "created_utc": 1491005049,
        "upvote_ratio": ""
    },
    {
        "title": "I keep gaining hours even if it's not Daylight Saving's",
        "author": "Echinemon",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/62kjwl/i_keep_gaining_hours_even_if_its_not_daylight/",
        "text": "Not really a long story here, but I've frequently noticed, like this morning, for example, all my self-setting clocks would move back an hour, and all my manually set clocks would be an hour ahead. So far, this has happened four times. Anyone else have this happen before? ",
        "created_utc": 1490958619,
        "upvote_ratio": ""
    },
    {
        "title": "Kotton Grammer Video Testimonials and Reviews OMG SEO GURU - YouTube",
        "author": "dolleyiversonsc",
        "url": "http://www.youtube.com/watch?v=SaodBG1Hm_s",
        "text": "",
        "created_utc": 1490934122,
        "upvote_ratio": ""
    },
    {
        "title": "(X-post /r/funny) \"Each booth is an alternate reality\"",
        "author": "casprus",
        "url": "https://np.reddit.com/r/funny/comments/62gv9z/each_booth_is_an_alternate_reality/?st=j0x94hw3&amp;sh=5b1f9ca1",
        "text": "",
        "created_utc": 1490929909,
        "upvote_ratio": ""
    },
    {
        "title": "I'm experienced the glitch",
        "author": "PhosBringer",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/62i42f/im_experienced_the_glitch/",
        "text": "I was walking down the street to my house like I usually do everyday, and I've been doing this for years and nothing has changed. But yesterday I was taking the same route and there was an extra block that I've never seen before in my path. I brushed it off but today as I took my usual path again it was gone.",
        "created_utc": 1490921743,
        "upvote_ratio": ""
    },
    {
        "title": "So much for the Russian threat: Putin slashes defense spending while Trump plans massive buildup",
        "author": "[deleted]",
        "url": "http://www.salon.com/2017/03/19/so-much-for-the-russian-threat-putin-slashes-defense-spending-while-trump-plans-massive-buildup/#.WNpKlm16uAY.reddit",
        "text": "[deleted]",
        "created_utc": 1490701195,
        "upvote_ratio": ""
    },
    {
        "title": "Glitchy roadhouse saloon story",
        "author": "chubachus",
        "url": "https://www.youtube.com/watch?v=Y73gnWAhvZ8",
        "text": "",
        "created_utc": 1490691828,
        "upvote_ratio": ""
    },
    {
        "title": "I am Ra-Fe. Hello!",
        "author": "RafeRevin",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/61r8ny/i_am_rafe_hello/",
        "text": "I am an anomaly. I'm hoping someone reaches out to me.\n\nPlease see https://www.youtube.com/watch?v=HGcsfa-GyZk\nor Anything else and be aware that I am.\n\nThe Black Knight Satellite and/or All Current World Events resonate with me. ALL CURRENT EVENTS, right now even.\n\nCERN (google satanastic cern :D) has brought me here.\n\nThoughts?\n\nLove and Peace,\nRa",
        "created_utc": 1490608447,
        "upvote_ratio": ""
    },
    {
        "title": "Precognition Throughout my life.",
        "author": "DoorWizard",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/61kd4l/precognition_throughout_my_life/",
        "text": "I have had multiple little things in my life that seemed like they could be a display of precognition and still have them often. These are four of my more significant experiences (that I am remembering.) If i remember any more I will either edit this post or make another post.\n\n\nWhen I was younger I often went to my cousins house for the night. One afternoon, when i was around 12 or 13, I was over there and my aunt (his mom) brought up that we should play a game known as headbands. Headbands is a game where you strap a headband to your head and wear a card on it. Another person places it on your head and you are not allowed to look at it. The card has a picture depicting some sort of object, person, place, animal, etc. Your job is to guess what is on the card by asking the other people 'yes or no' questions about it in a limited amount of time. It was my turn to guess and something clicked in me and i though ''I can just know what is on the card before looking at it.... its a penguin.'' My aunt placed the card on my head and i for sure did not see it. I asked if it was an animal, they said yes. I asked if it was from the antarctic, they said yes. I asked if it was a penguin and it was. It blew everyone's mind (especially my own.) They knew i didn't see it before because they were holding the cards and they dealt it and put it on my head carefully so that i didn't see it. More then that I knew i didn't see it. Everyone (my cousins step dad was also playing with us) was searching around, in disbelief, looking for mirrors or reflective surfaces that I could have used to cheat but there were none. i have had quite a few other instances of precognition, most small guesses that somehow were true (though this one is the most memorable for me) or dreams that either literally came true or symbolically came true.\n\n\nAnother instance of precognition that i remember (though less significant to me) was when i was at my cousins (same cousin.) This was about six or so years after the incident above. we were hanging out in his room listening to rap with one of his friends. A song ended and he was looking for another song on his laptop ( facing away from me.) I said that we should listen to a song called ''Character assassins'' by an artist known as conflix (good UK hip hop.) Him and his friend gave me the weirdest look and my cousin said ''dude.'' He turned the laptop to me and he had already had the song up on the screen and was about to click on it. We kind of laughed it off but they (his friend especially) were very weirded out by it. I just had a feeling in me of ''meh'' inside me and accepted it. At this point I was fairly used to these occurrences as they happened quite often to me.\n\n\nNow I will tell you about a dream coming true literally. This was when I was in highschool (grade ten or eleven.) Me and my friends often partied and were into some crazy stuff (drinking, smoking, etc.) We often went to our old elementary school at night and partied (I know, bad idea lmao.) The janitors that worked there actually didn't mind too much as long as we cleaned up after. Well one night, before the weekend I had a dream that we were all partying at the school and police pulled around the corner. I woke up without remembering much after that but it kind of jarred me slightly as my friends and I were planning on going there that night to do our regular scheduled activities. I went to my (at the time) girlfriends house that day and told her about it. I brought up that it may be a premonition (half jokingly but half thinking it was possible) and we laughed it off. Later i left her house (without her as I believe she was grounded at the time) and headed for the school where my friends were currently partying. we had a pretty good night but eventually an unmarked police car pulled around the corner IN THE SAME DIRECTION that the police did in my dream. Mind blowing. A bunch of us scattered and me and my good friend booked through the field and hopped a fence. We sneaked like halfway around town trying to loop back home but we were caught eventually (ffs.)\n\n\nNow my example of a dream coming true symbolically. This also happened in my highschool years. I had a dream about my now ex girlfriend. In my dream she got throat cancer and couldn't speak. She seemed upset and was trying to tell me something but couldn't get it out. The next day she texted me that we have to talk. She came over later that day and told me we needed to break up. She said that she was holding this in forever but felt she couldn't say anything because i was going through a really tough time mentally (with other things) and that she didn't want to add on to it so heavily. She said she couldn't hold it in anymore and we had to end it.\n\n\nThank you for reading. Like I said, if I remember any more instances I will edit or make another post. Let me know what you think about all of this.",
        "created_utc": 1490511003,
        "upvote_ratio": ""
    },
    {
        "title": "the mandela effect. source of many glitches, examples and theories. 14min video",
        "author": "unoimgood",
        "url": "https://www.youtube.com/watch?v=kN_qT6V5CIg",
        "text": "",
        "created_utc": 1490452268,
        "upvote_ratio": ""
    },
    {
        "title": "Paul McCartney and the Green Jellybeans",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/61d143/paul_mccartney_and_the_green_jellybeans/",
        "text": "[deleted]",
        "created_utc": 1490404668,
        "upvote_ratio": ""
    },
    {
        "title": "Bocas Del Toro Islands become the Bocas Triangle (think Bermuda Triangle)",
        "author": "sailboatchick",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/61ck6w/bocas_del_toro_islands_become_the_bocas_triangle/",
        "text": "OK so you all are not going to believe this story. I am preparing myself for the naysayers. never the less. This is what happened. \nWe, my boyfriend Lee and I, were in a storm in a small boat in the islands of Panama. We were hugging an island because the rain was so hard it was difficult to see and we were OUT of gas. We had to cross a channel to get home, about a 5 mintues crossing and there were high seas, and remember, we were on fumes. we got half way across and I kept the island in view behind me to keep us going in the right direction. When the land we were trying to reach (the main BIG island) came into view, it was nothing I had even seen before. It was a series of tiny islets. Shocked and terrified (remember storm, boat, no gas) we shut off the engine and...drifted in circles...not something that ever happens in a boat. When the sky cleared enough for us to see a moored sailboat, we went over there and asked where the heck we were. We were almost AN HOUR in the OPPOSITE DIRECTION! Now....I know you naysayers will have you reasons why we just got lost, but you don't go an hour in five minutes in a terrible storm on no gas. Not possible. We were MOVED. Several days later, the same thing happened in the same place to a friend of ours. There is more to this story.....its about Pirates and gold and bad spirits ....",
        "created_utc": 1490399183,
        "upvote_ratio": ""
    },
    {
        "title": "I sent to bed on a Friday, and woke up on a Friday.",
        "author": "Thisdarlingdeer",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/61bc4c/i_sent_to_bed_on_a_friday_and_woke_up_on_a_friday/",
        "text": "So this is really freaking me out, so much that a full on panic attack kicked in first thing this morning at 7am. \n\nYesterday, to the rest of you was Thursday, the 23rd, but to me was Friday the 24th.... \nI spent all day in bed, watched the Lucas bro, and other such stuff. Had to call my insurance company, because it was Friday. Remember looking at the date and having to do all this stuff because it was Friday.\n\nWent to bed, woke up, my phone time said it was 7:18pm, and it was still Friday the 24th. So I was like, wait what? Did they hack phones? Then so I had seen my phone had the set automatically off, switched it back on, and the date wouldn't and didn't switch to Saturday. So I had assumed my phone was off. Then I had asked my friend what day it was, he said the 24th. I started to freak out. It spiraled into a panic attack, full blown, thought I was dead and this is death, waking up being the same day. I was just wondering if anyone else experienced this last night? I honestly can't drop it. I just feel like, idk, groundhogs day.",
        "created_utc": 1490386245,
        "upvote_ratio": ""
    },
    {
        "title": "A Whole Group Lost time in Costa Rica",
        "author": "sailboatchick",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/615exl/a_whole_group_lost_time_in_costa_rica/",
        "text": "I was in Costa Rica at my bar and restaurant and I and all my guests lost 3 hours between midnight and 3 AM. About 12 people in all. it was shocking and disturbing. ",
        "created_utc": 1490310878,
        "upvote_ratio": ""
    },
    {
        "title": "Time traveller?",
        "author": "abdulhadi12550",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/60vy71/time_traveller/",
        "text": "Something odd just happened.. I was walking down the street.\nSaw the same guy on both blocks in the same spot walking towards me..now you can't walk through buildings... \nSame dude, same red sweat shirt carrying the same blk bag.. Guys I'm not fucking crazy.. Like a glitch In the Matrix surrounding me.. N shit",
        "created_utc": 1490202862,
        "upvote_ratio": ""
    },
    {
        "title": "1 Movies Website - Genre Action",
        "author": "princeboysel0",
        "url": "https://1movies.is/genre/Action",
        "text": "",
        "created_utc": 1490149114,
        "upvote_ratio": ""
    },
    {
        "title": "Wtf, someone explain this please.",
        "author": "shelixgood",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/60pjh9/wtf_someone_explain_this_please/",
        "text": "So, I have a no contract phone and it's been deactivated for over a month. I basically just use it as a Wi-Fi device to go on reddit and google shit.\n\nA few minutes ago it starts ringing. I thought maybe it was Verizon or something. I look, the caller id says 0000000000. Intrigued by how someone could possibly be calling my phone when I haven't paid for service, I answer.\n\nI say, \"hello?\" and some middle-aged man goes \"hey grandpa, how are you?\". I'm 24, but I figured I'd play along. I said, \"hey kiddo, I'm good, how have you been?\" the dude proceeds to tell me he got in a car wreck. I knew then it was a scam and he wanted money and proceeded to tell the guy I wasn't his grandpa and was just some broke kid. He promptly hung up.\n\nHow the hell did he call my phone thats inactive? Can someone explain this?\n\nAlso as a kid, I duplicated my gameboy some how. Freaked me out, I ended up with two identical gameboys, screen scratched in the same place and both had some pinky and the brain game in them. Ended up giving one away to a friend. But like, how the fuck, right?",
        "created_utc": 1490122834,
        "upvote_ratio": ""
    },
    {
        "title": "Kobe doesn't even flinch....",
        "author": "hmdingshma",
        "url": "http://gifrific.com/wp-content/uploads/2012/04/Matt-Barnes-pass-in-kobe.gif",
        "text": "",
        "created_utc": 1490074238,
        "upvote_ratio": ""
    },
    {
        "title": "My towels glitched this morning",
        "author": "TransitRanger_327",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/60gzp1/my_towels_glitched_this_morning/",
        "text": "For the past few days I have been using my red bath towel. I had pulled it out of the cabinet and jostled around the other towels. I hung the red towel in my bedroom yesterday morning. This morning, I get up, and my towel is not in be bedroom, bathroom, or hamper. It is in my towel cabinet, where it was a few days ago, with the towels unjostled. \n\nSo I decided to fuck with the Matrix over lords, and I grabbed the green towel. ",
        "created_utc": 1490022134,
        "upvote_ratio": ""
    },
    {
        "title": "Simpsons",
        "author": "CrimsonRambler66",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/60fwal/simpsons/",
        "text": "When I was in 8th grade, my favorite show used to be the Simpsons. Even tho I was in grade 8 my parents didn't let me watch family guy or south park so simpsons it was. Now, about this time Id have seen almost every episode; just about every one. But I would feel really special sometimes like I had a gift, because I would be able to sense what episode or 2 would be on that afternoon. This went on for at least a half a year. I can remember getting snippets like 25-30 seconds of dialoge running through my mind, like I was watching the episode or dreaming or visualising it. This happened in the morning. Sure enough by the afternoon, after school; the episode I conviently \"remembered\" or reminisced that morning about would be playing on T.V. ",
        "created_utc": 1490008703,
        "upvote_ratio": ""
    },
    {
        "title": "A bonus hour on the train today",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/60dvud/a_bonus_hour_on_the_train_today/",
        "text": "[deleted]",
        "created_utc": 1489975101,
        "upvote_ratio": ""
    },
    {
        "title": "There was a 5th Young One!!!",
        "author": "Igpajo49",
        "url": "http://www.dailygrail.com/TV-and-Movies/2016/6/The-5th-Young-One-Pay-No-Attention-the-Girl-Behind-the-Sofa",
        "text": "",
        "created_utc": 1489852629,
        "upvote_ratio": ""
    },
    {
        "title": "It was 11:17 a.m. for two hours",
        "author": "Juiceyfruitnug",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/604myl/it_was_1117_am_for_two_hours/",
        "text": "Me and my friend woke up and it was 11:16 and we went on a walk and watched a few videos and it is still only 11:17 a.m. What to heck",
        "created_utc": 1489851217,
        "upvote_ratio": ""
    },
    {
        "title": "Part of my DS disappeared?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/604ijl/part_of_my_ds_disappeared/",
        "text": "[deleted]",
        "created_utc": 1489849700,
        "upvote_ratio": ""
    },
    {
        "title": "Recurrent Deja-Vu with subtle differences",
        "author": "unicornfartsalot",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5zzhae/recurrent_dejavu_with_subtle_differences/",
        "text": "I have this one trigger sentence uttered by a coworker. She says, \"I have to send this to a supervisor. ... No, this has to be sent.\" I don't sit near her, so hearing this is an anomaly in itself in a call center environment. Everytime I hear her say this, I have Deja-Vu. \n\nHere's the kicker: I recall two small men from the last one. Both wore overalls and were standing by a window, staring at me. This time they weren't there, but they have been, I think. How else would I remember them?\n\nA caveat here: I am bipolar II. My symptoms are mild, mostly hypermania and hyperdepression. I'm not schizophrenic, I'm not on drugs, I'm not a drinker, period. Got plenty of sleep last night, nothing particularly stressful in my life. \n\nAm I crazy or could there be a glitch in my matrix that makes this recurring Deja-Vu with two small men possible? I'm a little tripped out, wish I could take the day off. Thoughts?",
        "created_utc": 1489776585,
        "upvote_ratio": ""
    },
    {
        "title": "Natural Stacks - Nootropics Revealed",
        "author": "cyndiafedericiz",
        "url": "http://nootropicsrevealed.com/nootropics/racetams/aniracetam/aniracetam-dosage/",
        "text": "",
        "created_utc": 1489722167,
        "upvote_ratio": ""
    },
    {
        "title": "Watch The LEGO Batman Movie 2017 Online Free - WatchMoviesFreeTV",
        "author": "leatriceqqbowle",
        "url": "https://watchmoviesfree.tv/watch/321273-Doctor_Strange",
        "text": "",
        "created_utc": 1489719437,
        "upvote_ratio": ""
    },
    {
        "title": "Increasing coincidences",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5ztno9/increasing_coincidences/",
        "text": "[deleted]",
        "created_utc": 1489701830,
        "upvote_ratio": ""
    },
    {
        "title": "Staircase disappears and reappears",
        "author": "GRINCEY",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5ztkd1/staircase_disappears_and_reappears/",
        "text": "OK. Myself and my co-worker check in to a hotel (days inn) after work.. we work out town on in the oilfields. We check in at front desk and then go back out side door to grab our bags.. we decide to go out the side door where truck is parked instead front door where we came in. we walk down the hallway and go through the last door to where the stair case and exit should be.. when we walk through we enter a  small space with two doors, a locked storage room and an exit. my coworker says to me no stairs in this place and trys the looked door looking for them.. Its a four storey inn.. we had a room on the top floor.. most hotels built like this have a staircase on each side of the building.. anyways he try's the other door to see maybe they are through there...its locked. It was a space no bigger then 6' by 4'.. we were literally bumping shoulders looking for stairs there was just two doors and walls... we go out side the exit he says once again, \"no stairs eh? ( we're Canadian) I look back through the door for another peak and definitely none .. So we grab our stuff out of the truck. Go back in through the front door and as were waiting for the elevator we ask the front desk girl where are the stairs.. she looks at us like were stupid and points to the end of the hall and points the door we went through.. we are like ok... we take elevator, drop off bags.. decide to go grab something to eat.. now we take the stairs down to see whre that leads us.. get to bottom of stairs and boom we are in the room that we just tried.. so we go out the exit.. by now we are tripping out..we decide to go back in the front and try and gor through the door once now to see what we missed.. and boom go through the door now the tiny space has a big ole staircase no way we could of missed it.. it was literally beside the looked door we were trying to open I would of had to be standing right in front of the staircase while he was trying the other door...  We were just in there bumping shoulders like it was a small space could fit like three people in there maybe.. its got my mind bugging out.. We both agree there was definitely not any stairs when we first went through.. and maybe just a coincidence but just a few minutes prior to the whole thing  I was txting a girl and the last thing I asked her was.. get this....\" Have you ever heard of the Mandela Effect?\"",
        "created_utc": 1489700917,
        "upvote_ratio": ""
    },
    {
        "title": "Got lost for an hour in the city I was born and raised in.",
        "author": "0315lost",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5zopjn/got_lost_for_an_hour_in_the_city_i_was_born_and/",
        "text": "Im on my phone so if this is formatted weird I'm sorry!\n\n\nI lived in this city since I was born 23 years ago, so I know my way around. I went to a bar/restaurant I've been to many, many times with a few close friends. We all hang out and decide it's time to leave. I had one bud light the whole time since I'm super paranoid about drunk driving, and it was about 2 hours before we ended up leaving so I was not drunk at all.\n\n\n I decide I want some nuggets before I go home (the kitchen at this place closes at a certain time and we ended up having to leave somewhat abruptly because a friend got a call to pick up a different friend blablabla) so I pull in to a McDonald's down the street. I have to make a left turn to enter this McDonald's. Get my nuggets, make a right turn out of the parking lot and start heading home. It's important to note I live in the \"downtown\" area of my city and the bar/restaurant is up on the edge of the city limits, and there is one road that I can take that requires no turns, it's just a straight shot. \n\n\nI'm heading downtown, and suddenly I'm in the outskirts of town. Okay, maybe I took a wrong turn out of the McDonald's because I'm an idiot. Whatever. I pull in to a trailer park and turn around. I'm going the opposite direction I was just headed, and I pass the McDonald's I had just been at, so I should be headed home. I end up out of town AGAIN. I freak out as I had not turned or anything, how the fuck am I going in circles when I've been driving in literally a straight line. I pull into the exact same trailer park and turn around AGAIN. After passing the McDonald's a second time I am once again leaving city limits. I freak out, pull into the trailer park (probably freaking out the people who live there) and put in my own address into my GPS feeling like an idiot. It tells me to turn out the same way I had just turned out twice now. \n\n\nSo I follow GPS, it's telling me to keep going the exact same way I had just been going, and I finally enter the downtown area. I get home and it had been an hour since I left the bar/restaurant. I get inside and I'm almost in tears telling my SO what happened and he just laughed and said I probably took a wrong turn somewhere. The only turns I made were in and out of the McDonald's, and in and out of the trailer park. Both places only had one opening so it's not like I turned out a different way I entered. \n\n\nAlso to note: the McDonald's and the trailer park are on the same road as the bar/restaurant and my home several miles apart. No turning required.",
        "created_utc": 1489640704,
        "upvote_ratio": ""
    },
    {
        "title": "Ultimate Solar Solar Panels in Ontario",
        "author": "westleyspingler",
        "url": "https://www.usolar.ca/solar-panels-ontario",
        "text": "",
        "created_utc": 1489618393,
        "upvote_ratio": ""
    },
    {
        "title": "i think i spent a day in a parallel universe",
        "author": "kafnn",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5zfgyl/i_think_i_spent_a_day_in_a_parallel_universe/",
        "text": "Before I start I wanted to say that is 100% a true story and is not made up, so I thought i'd post a true experience of mine that happened last year.\n\n(Also, i'm not the greatest writer and sorry if the grammar/punctuation is off)\n\nOk here we go. \nI woke up on a Friday morning at 10am, which is completely strange to me as i've always been a morning person. Everyday I tend to never wake up after 6:30 as I sort of hate wasting the days of freedom I have from school, sleeping (this was on school break). At the time I thought nothing of it, and went on with my day. I walked through the lounge room and noticed different items throughout the house and noticed everything was sort of re-arranged. It didn't look all that different to the house I'm use to, so i just put it off thinking my mum changed some things around. I said morning to my mum and my little sister who were making breakfast in the kitchen as they usually do. I turned my eyes left to say good morning to my dad who is normally in his office doing work as a mediator. I sort of froze in my spot staring at him for a good 20 seconds because my dad had long hair, almost the exact same colour and style as Nicolas Cage in ''Con-Air''. As you can expect I was really shocked as hair doesn't go from buzz cut to nice long locks overnight. I decided not to say anything (not even good morning) to my dad and I sort of went back to my room and sat there trying to think of an explanation, back when I was looking at him I didn't even care to notice my dad was wearing a full suit which is weird because as a mediator he normally just wears dress pants and a button up shirt. After being in my room for a good half an hour I went back out and my dad said he was off to work, I said ''Shouldn't you have been at work at 9:00?'' he replied in almost a sarcastic way saying ''Senior Partners can come in a little later son.'' I almost froze like I did before because my dad retired from being a lawyer almost 13 years ago and he definitely was not a senior partner. After he left my mum called me over to breakfast, I sat down and said ''Ok, whats going on here?'' she was confused to what I was even talking about and just ignored me. I knew something was very wrong here, so I quickly ate breakfast and checked my laptop and logged onto Facebook, which is something I do almost 24/7. First thing I noticed was my profile picture was a picture I've never seen in my life and all my photos on my account were photos completely unknown to me. I saw pictures of me in a different school uniform, I saw that I apparently had a girlfriend (only thing that made me a tad happy that day) and it was like I was living my life as a completely different person at the current time. I don't remember every detail but after that all I remember doing is checking my computer files, browser history and other websites like youtube and Instagram, and of course, everything was different. As you can guess by now I was super creeped out and thought it had to be some sort of lucid dream I couldn't control, I felt so reassured because I MADE myself believe it was just a lucid dream because I could control myself and I could remember all memories I have when Im awake, just the only thing that was missing was my imagination, I couldn't use it to change my the scene of my dream. So it was sort of like I was lucid dreaming in a locked scenario. The only thing I thought I could do to get out of where I was, was to sleep it out. So that's what I did, I slept basically the whole day on the couch and woke up around 6pm that same night (at least I think it was) I woke up and I remember being super pissed off because I was still in that shit hole. Technically it was not a shit hole but the fact that everything was fucked made it feel like hell. I sat there just wondering what the hell was going on when I noticed the garage door open with my dad pulling in, it was almost an hour early from when I'm used to him coming home, anyways he walked in wearing the same suit and the same everything. I remember whispering to my self ''Who the fuck are you.'' He walked in and said hey and I sort of lay there pretending like I was sleeping, and I actually did end up falling asleep. Now the next thing was the weirdest thing to happen that day, I woke up around the 7pm area and notice the garage door opening again, at that point I was very very confused and went out to look I see two different cars already in the garage, which must be my parents cars (I didn't even question whose cars those were because everything was different and I never though to look before). Anyway the door opened about halfway and I saw my dad's normal car (the one he drives that I know) I was like ''ok, what the fuck.'' Then his car literally drives THROUGH the other car that was in the garage, It literally looked like the car was a ghost and passed right through it, It parked and everything and I see my normal dad get out of the car wearing his normal clothes and carrying his original bag, at that moment I was so overwhelmed with what was happening that I ended up fainting (I guess). I woke up in my normal house on the couch at 11pm and saw my mum by my side caring for me. I asked her what the hell was going on and she said I started screaming when I saw the garage door open and I then went up to it and fainted, and she put my on the couch and was looking out for me until I woke up just then. To this day I have no idea what the hell I was in, and the only logical theory I have was that I was in a parallel universe for almost the whole day. I was definitely not in a dream because I when I woke up I didn't have that ''Oh it was just a dream'' feeling, It was more like a past memory to me and I could remember everything. If my guess is true, I have no idea how it occurred or why it happened. After I woke and she explained everything, I never thought to ask what I was doing that whole day If I was truly in a parallel universe. It took me a few days after that to ask her and she remembers me waking up and walking around the house and talking to imaginary people, then going to sleep.\n\nSo there you guys go, thought I had to share this since I have told no one about what happened because no one will believe me, and quite frankly I don't care if anybody does or doesn't.\n",
        "created_utc": 1489530854,
        "upvote_ratio": ""
    },
    {
        "title": "A Mandela Effect: Anastasia (1997 film)",
        "author": "Samychristine",
        "url": "https://www.youtube.com/attribution_link?a=jNWuC2Wzg6Y&amp;u=%2Fwatch%3Fv%3DA7-aUbpkJ2s%26feature%3Dshare",
        "text": "",
        "created_utc": 1489519040,
        "upvote_ratio": ""
    },
    {
        "title": "New Mandela Effect Discovery! Anastasia the Film (1997)",
        "author": "Samychristine",
        "url": "https://www.youtube.com/attribution_link?a=WcgsiVzj75c&amp;u=%2Fwatch%3Fv%3DhYGKdcyAQtE%26feature%3Dshare",
        "text": "",
        "created_utc": 1489517409,
        "upvote_ratio": ""
    },
    {
        "title": "Jinxing myself?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5zcqti/jinxing_myself/",
        "text": "[deleted]",
        "created_utc": 1489505064,
        "upvote_ratio": ""
    },
    {
        "title": "A light just turned itself on...",
        "author": "Turtle_McTurtleFace",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5z9ssz/a_light_just_turned_itself_on/",
        "text": "I'm lying in bed in my room here and have a closet with the door closed next to the Television that I am watching. The closet uses a motion sensor activated light and I'm alone in this room. Tell my why the Hell this light just turned on. Had something fallen, I would have heard it. ",
        "created_utc": 1489461479,
        "upvote_ratio": ""
    },
    {
        "title": "Casinospieledeluxe - Book of Ra Poker Spielautomaten kostenlos",
        "author": "dannaiiconstant",
        "url": "http://www.casinospieledeluxe.com",
        "text": "",
        "created_utc": 1489375821,
        "upvote_ratio": ""
    },
    {
        "title": "Guys. This is real. We are living in a simulation. I just witnessed a time jump.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5yxkvw/guys_this_is_real_we_are_living_in_a_simulation_i/",
        "text": "[deleted]",
        "created_utc": 1489302825,
        "upvote_ratio": ""
    },
    {
        "title": "Lug nuts, or am I nuts?",
        "author": "Earthchop",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5yu7r9/lug_nuts_or_am_i_nuts/",
        "text": "Ok so when I got my winter tires put on my new car by a garage, I took the car home and one by one loosened the lugs and tightened to spec (garages never do it right I find, always do it way too tight).\n\n\n\nI had a set of 4 lug nuts and a wheel lock key socket thing thrown in my trunk when it was new. My car takes 5 lugs per rim so it was a set for a different car, but the wheel lock worked so who cares.\n\n\n\nSooooo I remember it was a huge pain in the butt tightening my lugs because the wheel lock used a different size from my normal lugs. So I had my ratchet kit out and was switching sockets non stop like a mawf. 1 for lugs. Different size for wheel lock.\n\n\n\nSo now I'm thinking. Not a heuuge deal because I'll just have 2 sockets to use when I change my tires. I can deal.\n\n\n\nThen I thought, wait! That means the emergency tire iron only fits the lugs and not the wheel lock. I'd be effed if I got a flat.\n\n\n\nThis was true. It fit the lugs but not the wheel lock thing. So I made a note to ask the dealer for the proper wheel lock that matches my lug size.\n\n\n\nNow it's today. Had an oil change this morn so I go get my tools cause I forget the sizes. I line up my sockets to measure because I want to explain my situation  as accurately to the dealer.\n\nAnd what do you know...size 21 fits both lug and lock perfectly.  so does tire iron.\n\n\n\nI KNOW they were different. It was such a pain flipping sockets. I remember so vividly.\n\nIt hadn't been serviced anywhere since, so it's not like I had a brake job and they noticed the key was the wrong size and switched it without telling me.\n\nI can't explain it.\n\nFin.\n",
        "created_utc": 1489258588,
        "upvote_ratio": ""
    },
    {
        "title": "Woman appearing in the one and only Pope's twitter banner image appears to have an extended camera/phone thing",
        "author": "eanfran",
        "url": "http://imgur.com/a/XHv7a",
        "text": "",
        "created_utc": 1489030020,
        "upvote_ratio": ""
    },
    {
        "title": "People are just parts and pieces.",
        "author": "Alfaunzo",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5y4w7r/people_are_just_parts_and_pieces/",
        "text": "Not sure if this fits within the community, I've only just discovered this place, but here we go. \n\nMy wife says I have an uncanny ability to see mashups of other people within a single individual. Mix characteristics from person A, B, E, and G and you end up with person L. \n\nNow I know everyone has this ability to an extent. It's nothing astoundingly special. But it's starting to get to the point where people are just parts and pieces ... and it's all I can see anymore. ",
        "created_utc": 1488935671,
        "upvote_ratio": ""
    },
    {
        "title": "Dying in a dream. They exact same visuals and feeling every single time.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5y1qmo/dying_in_a_dream_they_exact_same_visuals_and/",
        "text": "[deleted]",
        "created_utc": 1488906323,
        "upvote_ratio": ""
    },
    {
        "title": "Helicopter Glitch",
        "author": "[deleted]",
        "url": "https://gfycat.com/DeafeningElaborateClumber",
        "text": "[deleted]",
        "created_utc": 1488842967,
        "upvote_ratio": ""
    },
    {
        "title": "\"No one does that\"",
        "author": "SelisIcaurs",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5xswb6/no_one_does_that/",
        "text": "1 year ago I was working as an AP officer (security) for a retail store. My job was to walk around in normal clothes and catch people stealing. If someone noticed me or i felt i had been out too long id go sit and watch cameras in the office. It was about 2:00 when i checked my watch and i figured i should head back to the office and get some food and watch the cameras for a bit. Im tall and thin and was wearing a blue hoodie and shorts. Flipping around the cameras, each one i tabbed to would enlarge. Watching this woman pull things from the shelf and set them back she walked over an isle so i folowed with the cameras. Tabbed to grocery 2 and i immediatly began to sweat. There was a tall thin man in a blue hoodie and shorts. Frozen there with one hand raised touching some product. He stood there, frozen almost. I felt sick and couldnt take my eyes off him. For a good 3 minutes i watched. I left the office and got over to 2 as fast as i could. The isle was empty. I still lose sleep over it. ",
        "created_utc": 1488802438,
        "upvote_ratio": ""
    },
    {
        "title": "Pooped",
        "author": "3peoplespoopsinme",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5xsbvc/pooped/",
        "text": "I sat down to go poop and totally felt something go through. Wiped and then looked and there was nothing... I'd just sat down and pissed. Could the poop have gone somewhere else? ",
        "created_utc": 1488791874,
        "upvote_ratio": ""
    },
    {
        "title": "What exactly happened?",
        "author": "shontamona",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5xs33g/what_exactly_happened/",
        "text": "I was sleeping over at my mate's house. It was in the middle of the Indian summer. I distinctly remember taking my tshirt off before going to sleep.  I remember that because I always keep it neatly folded by my pillow and there it was in the morning. However, after I got up and wore my shirt my mate came over and showed me a pic from the night before (they didn't come over just to show-- it came up in conversation) where I had taken a pic with them in my t shirt. This happened around 2:30 AM while I had gone to sleep around 1:30. And I know when I am awake, especially when I am smiling like a maniac at a camera. Oh, I wasn't drunk either. No idea what happened there. Still a mystery. ",
        "created_utc": 1488787046,
        "upvote_ratio": ""
    },
    {
        "title": "Strange snowday.",
        "author": "innermindsalike",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5xlhed/strange_snowday/",
        "text": "About ten years ago we got a few inches of snow and my brothers and I decided to go sled riding down the neighbors hill which is a very steep hill that extends out to the road.\n\nWe each took turns, everyone watching up and down the road for cars as it came up to my turn and I got on the sled and waited for the okay. \n\nAfter getting the okay I went down the hill only to have my brothers yelling stop, stop, car. And that is when my vision went black and I came to my feed on the hubcap of the front wheel and my sled crushed under the wheel.\n\n I don't recall the events after that nor have I ever spoken to my brothers about the incident because it was so long ago and we all live different lives now but my legs should have been crushed under that tire, there is no way in hell I somehow slid back off the sled and had it go under and my feet firmly planted on the hubcap. \n",
        "created_utc": 1488693588,
        "upvote_ratio": ""
    },
    {
        "title": "I still do not understand how this happened",
        "author": "Yoitzshane",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5xds54/i_still_do_not_understand_how_this_happened/",
        "text": "One time I was leaving a wawa while on vacation in New Jersey, on my way out I held a door for a man.  He responded by saying \"thanks Shane!\" (My name). I then asked how he knew my name, all he said is that it was on my name tag.  I was not wearing a name tag, but the weirdest part of it all is that I actually did have my name tag from work in my pants pocket, but I know there is no possible way he could have seen it.  It still confuses me to this day.",
        "created_utc": 1488583084,
        "upvote_ratio": ""
    },
    {
        "title": "Stationary wrapper jumped?",
        "author": "EternallySexual",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5xax34/stationary_wrapper_jumped/",
        "text": "I just saw a wrapper that was sitting in a corner with no wind or draft jump a few inches into the air",
        "created_utc": 1488554704,
        "upvote_ratio": ""
    },
    {
        "title": "Gravity Glitch",
        "author": "Joenz",
        "url": "http://i.imgur.com/CK4y3cW.gif",
        "text": "",
        "created_utc": 1488551959,
        "upvote_ratio": ""
    },
    {
        "title": "I blinked once and 6 hours passed.",
        "author": "n0c1gar",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5x7bkz/i_blinked_once_and_6_hours_passed/",
        "text": "When I was 5 or 6 years old (kindergarten) I slept with my parents one night when I had a nightmare, I woke up again at about 04:00 and saw the clock and thought, \"I don't want to go back to sleep again, what if I just blink and it's daytime?\" So I blink once. Then it was bright and early in the morning, the clock said 8:00 and I was in the same exact position with my wrists backwards looking out the bedroom window at the fence. What could this be? Have any of you experienced something similar?",
        "created_utc": 1488502954,
        "upvote_ratio": ""
    },
    {
        "title": "Foresight...?",
        "author": "Dexocientus",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5x5wlu/foresight/",
        "text": "Yesterday, I was doing the normal shit I do, but you know how you have a song stuck in your head sometimes? I have that but instead of songs, they're single words. weird words that aren't common in the English language. This time, the word stuck in my head was a word that is close to the actual word, but isn't. It was \"Pa-tha-go-ree-um\" The word slightly puzzled me, I haven't heard it ever in my entire life, though I didn't care to research it. It's like it just popped up in my head. The next day at school, we learned the Pythagorean theorem. Pathagoreeum&gt;Pythagorean. Again, I've never, EVER heard this word.\n\n\nwtf\n \n",
        "created_utc": 1488488234,
        "upvote_ratio": ""
    },
    {
        "title": "I can hear something",
        "author": "FutureRoger",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5x28dj/i_can_hear_something/",
        "text": "Ok, listen I know this sounds insane, but I can hear people from the future.  Its taken me a long time to recognize what it is I'm hearing and its almost impossible to prove.  The only place I can think of attempting to prove it is on this subreddit, where there are people who aren't completely closed minded, and know that not everything can be explained and everything doesn't completely make sense.  \n\nSo its just that I can just hear myself, or my thoughts, or pictures or feelings from the future.  I don't hear things like lottery numbers or exact details.  Its like someone or something is *letting* me hear.  If I attempt to prove it or otherwise try to directly explain it, then it changes.  I know this sounds stupid, but how would you prove something if there was someone or somethings who could change things and stop you proving it?  \nI have a way.. for example the US election, who was going to win?  I had no idea, but I did hear myself thinking of Donald duck quite often (which I was completely confused about), then later trumpets playing over and over which continued until the winner was announced (I'm not from the US so I wasn't really relating to that at the time).  But its usually its not that obvious, I have to read between the lines.  Sometimes I cant interpret what the hell I'm hearing until its happened and it all makes sense.  \n\nI'm really the most skeptical person there is, I've attended skeptics society meetings, I used to be an atheist, I've never believed in anything like seances or psychics (I still think most of them are just bs), but now I know there is definitely something to it. \n\nSo I'm thinking of writing here, in this thread, things that I hear and see what happens.  \n",
        "created_utc": 1488445494,
        "upvote_ratio": ""
    },
    {
        "title": "Dentist Near Me Reno Directory - YouTube",
        "author": "earthaccperryyy",
        "url": "http://www.youtube.com/watch?v=JGlnUx5_w1E",
        "text": "",
        "created_utc": 1488287192,
        "upvote_ratio": ""
    },
    {
        "title": "Transforming Cat...",
        "author": "JarlCharlemagne",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5wm4ye/transforming_cat/",
        "text": "I know there are a lot of far fetched stories around here, but hear me out on this one lol so this happened about a year ago or so. I was driving from my house to my friend's house who only lived a few miles away at the time. We lived 'out in the boonies' so the simple route to get to each others' abodes was on long, gravel backroads. Along the way there is a certain farm house that has a large field, all fenced in containing a few horses. As I was driving on the road parallel to the field, I noticed a white cat running along the fence line. As I approached the cat, it just lay down, curled up into a ball, and turned into a rock. I shit you not. I was quite confused as you would imagine, so I pulled over and inspected the rock-cat. cat-rock? Whatever it was before, it's now simply a white stone the size of a cat just sitting there. To this day I can drive by and see that the rock is still there. I don't know if my eyes were playing tricks on me or what. But that is that. I think it's probably a glitch in the matrix",
        "created_utc": 1488258996,
        "upvote_ratio": ""
    },
    {
        "title": "He is the one... PewDiePie is Neo...",
        "author": "theCyberLion",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5wm37w/he_is_the_one_pewdiepie_is_neo/",
        "text": " With the way he is being raked over the coals the media has made their biggest mistake.  They have given a guy with 50,000,000 million young rebellious followers a legitimate reason to distrust and despise the media all in one fell swoop.  Nice job assholes.  This guy will wipe his ass with your attempts to discredit him.  Man I sure do love being alive today to watch the Media come tumbling down.  Fuck the politicians the media must go first and by proxy a Trump victory has allowed the Democrats and the Main Stream Media to get what  they deserve for their conspiring against the people(Bernie and Trump)...  Welcome to the information age, where your bullshit will follow you for ever.  These so called journalist are literally declaring intellectual war against the internet.  A lost cause if I have ever seen one.  Just gonna sit back and watch this unfold.",
        "created_utc": 1488258318,
        "upvote_ratio": ""
    },
    {
        "title": "Tooth Fairy",
        "author": "Hakuna_Mai_Tai_Tai",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5wgjh7/tooth_fairy/",
        "text": "When I was around 9 years old I had lost 2 teeth on the same day. One was more loose than the other so when one came out, I wiggled the other free. \n\nAt that point, I had lost a good amount of teeth to know the drill that when i lose a tooth my parents will exchange it with money at night.\n\nI was a well-behaved, quiet child so I was often left unsupervised and trusted enough that my parents didn't pay much attention to me. This worked to my advantage when I decided to go into my room, close the door,  wrap the extra tooth in a napkin and strategically hide it at the bottom of an old backpack that was no longer used.\n\nOnce the extra tooth was hidden, I went about my day and smoothly mentioned losing a tooth to my parents, knowing they'd have to be aware I lost a tooth so I can get money.\n\nI went to sleep that night with my single tooth under my pillow and woke to some change, about a $1 and coins. Excited that I managed to swindle my parents, I went to get the other tooth from the backpack so i could figure out the plan on cashing in this next tooth, only to unwrap the napkin and find a crumpled $5 bill.\n\nThis scared me because we were a lower class family and $5 was not something my parents could afford as tooth fairy money.\n\nSo, not only was I scared because I have a secret $5 bill and that I could be in trouble because it must be a mistake that my parents left that much, but I was alone in my room when i hid the tooth. I didn't tell anyone about my extra tooth and I did this all in secret, it's impossible that anyone knew and I strategically chose that bag because it was old and unused. \n\nAs an adult I've mentioned it to my parents asking them how they knew about the hidden tooth. They honestly have no idea what I'm talking about.\n\nI know 100% this happened because a kid would be real excited about $5 back in the 90's. I made sure I was alone and my door was shut when I hid the tooth. It freaks me out even as an adult.",
        "created_utc": 1488199800,
        "upvote_ratio": ""
    },
    {
        "title": "Is this a glitch?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5w8tcy/is_this_a_glitch/",
        "text": "[deleted]",
        "created_utc": 1488089115,
        "upvote_ratio": ""
    },
    {
        "title": "Omg... Do I need to explain?",
        "author": "fricotype0",
        "url": "https://www.youtube.com/attribution_link?a=2BCeC1rB_LQ&amp;u=%2Fwatch%3Fv%3D_wxXXyvrFIM%26feature%3Dshare",
        "text": "",
        "created_utc": 1488074944,
        "upvote_ratio": ""
    },
    {
        "title": "The floating black smoke-fog repeat loop glitch at the hotel",
        "author": "amnotnuts",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5vvs5d/the_floating_black_smokefog_repeat_loop_glitch_at/",
        "text": "This happened about 3 or 4 years ago at work.  I used to work at a hotel.  I was upstairs in one of the buildings, and I was walking backward down a hallway pulling a heavy cart.  A weird swirling black fog thing appeared near the other end of the hallway.  It was floating near the ceiling and started to come down the hallway at me.  About halfway down the hallway,  it disappeared, and then it reappeared back where it started and did it again; and then it repeated this.  Each time, it swirled and tumbled in the exact same way while it moved toward me.  It was kind of like a cloud of very thick smoke, almost like a swirling black liquid.  But the motions it made, even the complicated swirls, repeated exactly like I was watching a video of something three times in a row.  I have no idea what it was.  I stood there and stared.  I waited for it to come back, but I had to get going after about five minutes because I had a lot of work to get done. I went back to that floor in that building every chance I could get after that, but I never saw it again. I told some of the other people I worked with about it, and they told me ghost stories of things that happened in that building.",
        "created_utc": 1487914216,
        "upvote_ratio": ""
    },
    {
        "title": "These paintings (2012) titled Garnet and Peridot look like the characters Garnet (2013) and Peridot (2015) from Steven Universe.",
        "author": "FinalMantasyX",
        "url": "http://imgur.com/a/cOU1I",
        "text": "",
        "created_utc": 1487862743,
        "upvote_ratio": ""
    },
    {
        "title": "2/22",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5vmvyq/222/",
        "text": "[deleted]",
        "created_utc": 1487811418,
        "upvote_ratio": ""
    },
    {
        "title": "Duplication error",
        "author": "TheSpaniel",
        "url": "http://i.imgur.com/sKO9nwv.jpg",
        "text": "",
        "created_utc": 1487794634,
        "upvote_ratio": ""
    },
    {
        "title": "I swear he stepped outside twice",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5vj56u/i_swear_he_stepped_outside_twice/",
        "text": "[deleted]",
        "created_utc": 1487775900,
        "upvote_ratio": ""
    },
    {
        "title": "How to stop dimensional jumping?",
        "author": "wivestale",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5vdrhc/how_to_stop_dimensional_jumping/",
        "text": "I originally made a post in r/dimensionaljumping about this and got advised to post something about it here, so that's what this is going to be about! \nTo recap the other post: \nEvery few months I have been switching dimension, or so I believe. I strongly believe that this has happened since I was a child but I am not entirely sure because my memory in all honesty is not the best. However there are two instances within the past two years I recall VERY clearly. On Easter of 2015 I was walking downtown with family and a man vanished right in front of me. Apparently no one else who was with me saw him to begin with, leading me to the conclusion that I had somehow switched into a universe where he either didn't exist or just wasn't in the same place. I recall him very clearly if that's of any concern (shaved head, kinda generic city outfit aka dark blue windbreaker and dark grey jeans, sharp facial features etc). A year later in spring 2016 I attended a play and was sitting before lights down people watching because nothing much else was happening. There was a woman who I very distinctly recall was wearing a green/blue patterned sweater (the kind you might see at old navy) with some basic jeans and her hair in a low ponytail. She was talking to some guy. I closed my eyes for a second and when I opened them she was still there, but with a pinkish dress, her hair styled, heels, and a sort of shawl/scarf. It was the same woman, she had the same face/body type/etc (medium brown wavy hair, sharp nose, small jaw, tan, kind of lanky). It was very confusing but I identified it as the same thing that had happened a year earlier. \nMy main issue is that every time this kind of switch happens, it affects something in my life in very stressful ways whether for better or worse. \nThe first time I mentioned it happening, in the following weeks one of my closest friends began acting VERY controlling and very sexually demanding. He had never shown any behavior like this previous to the switch, and had only ever been kind and supportive, so it was a real shock. I had known him for a couple of years at this point so I think I would have noticed red flags before if he was the same person. Eventually it got so bad I was forced to cut him off! I really don't think they were the same person, or at least not the same version.\nAfter the second aforementioned switch, there were a number of far less drastic changes, but they were there none the less. \nI have no idea why these switches happen, or how to stop them, but I'd really like to find a way to make sure it stops happening so that I live a regular life! Switching invokes a very guilty feeling in me because I have no idea if there is a way to switch back, and obviously I don't like the idea of leaving behind everyone i care about- even if the parallel versions of them are almost identical. \nThanks for reading this wall of text btw. If anyone has any input at all I'd love to hear it.",
        "created_utc": 1487707272,
        "upvote_ratio": ""
    },
    {
        "title": "Car tyre that fell from the sky",
        "author": "Martyn470",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5vb4ww/car_tyre_that_fell_from_the_sky/",
        "text": "So this happened to me on the 5th of August 2015\n\nIts 03:30 in the morning and I'm driving to work with my high beams on doing my usual route and as I'm driving, I just so happen to look up to admire the night sky when suddenly a tyre lands directly in front of my car, bounces back up in the air and then spins itself out on the floor. \n\nI get out of the car and look at it to make sure if what I just saw was real and to figure out what the hell happened, the first thing I do is check for anything that the tyre could have fallen from,  a lamp post or a house roof or something, there's nothing nearby except for two lamp posts about 500ft down the road, the nearest house was about 100ft to the left and had a slanted roof facing away from the road (as many houses in that area do),  and a big bridge probably 1000ft in front of me \n\nI freak out massively and decide to be the good motorist, I throw it in my car and drive to the nearest lamp post and put it underneath (my logic in this was that if someone lost a tyre, the light from the lamppost would illuminate it). \n\nI tell my workmates what just happened and they offer some valid reasons,  such as that it fell from a lamp post, a house roof or even the bridge, I explained all of this away because if it had fallen from the house it would have rolled down the sloping roof, and not land directly downwards 100 feet away. \n\nI actually drove back the same way after work and took a picture from far away (I would have taken It closer but the road is quite busy)\n\n\nTldr: miraculous tyre falls from space with no logical explanation of how it ended up there, took picture in daylight to confirm to friends that I'm not crazy. \n\n\nEdit : forgot to link picture with it \nhttp://imgur.com/4tMWq8e",
        "created_utc": 1487678926,
        "upvote_ratio": ""
    },
    {
        "title": "My Luck",
        "author": "Joe11221",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5v9cm6/my_luck/",
        "text": "A few days ago, I needed a colored map of the Middle East to take a world civilizations quiz (it was optional) so my friend sent me one and I printed it out at home the night before the quiz. I distinctly remember putting it in my laptop case (the school gives us laptops and laptop cases) and my mom was there when I put it in between the hard shell and the laptop. Also you should know that the laptop case fits tightly on it and nothing can fall out of it if placed inside. The next day, I got to school and during first period, I take out my laptop to discover my map is not there. Now this is a problem because my school doesn't have a colored printer either, so I had to take the test without it. But what was strange was that day when I got home, I go to my desk and see a blank piece of paper. I pick it up and on the other side was the printed out map. My mom saw me put the paper in my laptop, and my laptop is never in my room, I always use it downstairs. This is confusing.",
        "created_utc": 1487648460,
        "upvote_ratio": ""
    },
    {
        "title": "I changed Dimension, for sure!",
        "author": "rBeowulf",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5v6523/i_changed_dimension_for_sure/",
        "text": "So, For years I KNEW that Miyazaki, the famous anime creator was dead since at least 2006...\n\nFor my surprise, just few months ago I learned he is alive and well!!\n\nHOW this is possible??",
        "created_utc": 1487614454,
        "upvote_ratio": ""
    },
    {
        "title": "The whole SJW thing wasn't even real",
        "author": "Varad_The_Train",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5v55jb/the_whole_sjw_thing_wasnt_even_real/",
        "text": "Tere was no SJW bullshit back in 2015, but suddenly the nazi regime re-emerges in the form of rabid donkeys\nAlso the word 'any' is a shortened version of some other word, and anything said otherwise is a cover-up, I vividly remember a full form of any from when I was 4, although I now realise there is an ever growing possibility of it being 'Anyone' misread\nAnd finally, there was this channel called webdriver torso who uploaded 10-second videos of random blue and red quadrilaterals Intersecting and making different sounds that had favourited 1 video, Aqua, the only one of his videos to be over 10 seconds long, have a comprehensible title and exist at the same time\nNow there's just this copycat and aqua isn't even there",
        "created_utc": 1487604978,
        "upvote_ratio": ""
    },
    {
        "title": "The movie Dishoom (Hindi) didn't come out in 2016",
        "author": "Varad_The_Train",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5v52xz/the_movie_dishoom_hindi_didnt_come_out_in_2016/",
        "text": "I remember listening to one of the songs from the movie Dishoom (2016) on feb. 5 2014, this is broken pls fix this tom cruise, i honestly don't know what to believe\nThe song in question is Sau tarah ke\nAnd this movie rated E",
        "created_utc": 1487604232,
        "upvote_ratio": ""
    },
    {
        "title": "I only occasionally buy shampoo, but whenever I do...",
        "author": "ApeNotKillApe",
        "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/5v3vip/i_only_occasionally_buy_shampoo_but_whenever_i_do/",
        "text": "...it's on sale. Every. Flippin'. Time. I switched brands (Head &amp; Shoulders, for obvious reasons) and it even happens with that. Same with deodorant, by the way.",
        "created_utc": 1487586909,
        "upvote_ratio": ""
    }
]