[
    {
        "title": "Random Note showed up on my iphone",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1jie87/random_note_showed_up_on_my_iphone/",
        "text": "I happened to look through my notes app on my phone today and notice something off. \nI opened it and looked at the date and time.  Sunday at 9:58 am\nAfter being out late Saturday, I was absolutely asleep at this time. \nMy iPad had been dead since Friday and I hadn't touched a computer since Thursday. \nThe note only said this: \n\n80 Robbins circle Dennis mass\n\nDennis Yarmouth high school\n\n:end note\n\nI live around 4 hours from Massachusetts, but never frequent there and haven been there since I was a little kid. \nI didn't even know Dennis Massachusetts was a place until today. \nI looked up the address and its a $600,000 house that was purchased in 1998\n\nCan someone explain to me how that address got there, or what significance this address has?",
        "created_utc": 1375381964,
        "upvote_ratio": ""
    },
    {
        "title": "Two glitches in my new house in the same week.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1jhljo/two_glitches_in_my_new_house_in_the_same_week/",
        "text": "I have two wall switches that control:\n1. the outlet that has my TV, PS3, and DVR plugged in.\n2. my ceiling fan/overhead light.\nI'm watching TV on Monday when suddenly switch 1 turns off. TV, PS3, DVR all shut off. My light was also off so it's pitch black in my room. I get up and make my way to the wall and flip the switch back on. It's not loose or easily flippable up or down.\n\nLast night both switches are on, however my TV, PS3, and DVR are off - i was just on reddit from my laptop. My remote controls are both over by the TV stand when suddenly the TV turns on. \n\nI don't have any logical explanation for either one. ",
        "created_utc": 1375358443,
        "upvote_ratio": ""
    },
    {
        "title": "I had the weirdest day today...",
        "author": "CodySmash",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1jh7ta/i_had_the_weirdest_day_today/",
        "text": "As soon as I woke up the first 2 hours of my day were backwards, like yea i woke up showered, ate, you know morning routine stuff, then I went to work but it all happened in reverse order. When I finally got to work, it switched back to regular. But the door to the back room opened up in itself instead and i just ended up walking in the opposite direction so I couldn't get anything that's usually back there. then other odoors started doing the same thing, but only the ones with knobs. I could only get into my room through the damn window. And get this I just watched my roommate pull my other mates outline off of him, he tried to walk and just disintegrated like sand or something. and then we straighened it out and started waving it around but when we went outside it like ripped a hole in the horizon and behind it was this wierd checkered pattern that kept shifting its shape, idk it was hard to explain but when we managed to stop looking at it 3 days had gone by. This is fucked up idk whats going on at all.",
        "created_utc": 1375337542,
        "upvote_ratio": ""
    },
    {
        "title": "Four days in a row now.",
        "author": "taterx13",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1jh2e4/four_days_in_a_row_now/",
        "text": "For the last few days now i have been woken up in the same strange way. Every morning at 10:03am on the dot, a small child rings a bell and screams. He sits on the old swing in the back yard and goes to town for like a solid 5 minutes. Before this started, i have never seen him. To my knowledge, no new families have moved into the neighborhood. Also after the ringing of the bell, i never see him for the rest of the day. Im getting kinda/really creeped out.",
        "created_utc": 1375331879,
        "upvote_ratio": ""
    },
    {
        "title": "Exactly the same... every night",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1jgy0g/exactly_the_same_every_night/",
        "text": "When I was 11 every night at 3:30 AM I would wake up, never failed, always the same... it started to be normal after 12. It still freaks me out to this day",
        "created_utc": 1375327950,
        "upvote_ratio": ""
    },
    {
        "title": "I keep the tv on for my dogs when im gone. Every day I come home and this ad is frozen on my screen (doesn't matter what channel)",
        "author": "[deleted]",
        "url": "http://imgur.com/y8PHdz7",
        "text": "",
        "created_utc": 1375295396,
        "upvote_ratio": ""
    },
    {
        "title": "how I feel reading every post in this subreddit",
        "author": "benriz",
        "url": "http://www.youtube.com/watch?v=U6MlaIe1ljs",
        "text": "",
        "created_utc": 1375261891,
        "upvote_ratio": ""
    },
    {
        "title": "I just need to document this.",
        "author": "geddycorn86",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1jefcl/i_just_need_to_document_this/",
        "text": "I keep dreaming and day dreaming about the name John Best and the word harvest. It seems really important and I don't know why yet. Just leaving this here incase it does make sense later.",
        "created_utc": 1375244213,
        "upvote_ratio": ""
    },
    {
        "title": "I was told to put this here, though I'm not sure it belongs.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1jbyh4/i_was_told_to_put_this_here_though_im_not_sure_it/",
        "text": "**From /r/nosleep**\n\nI don't know what's happening right now. I'm not even sure if this goes here, but it is pitch black outside of my bedroom window. Okay, it's night, but it's usually never this dark out there, even when it's cloudy. There's a street lamp right outside, and it usually lights everything up so that I can see behind the building, and even the apartment complex on the other side of the fence. Right now, though, when I look outside of my window, I see the light, but nothing else. Not even the other building, just black.\n\nI noticed this about a half an hour ago when I looked outside. I expected to see my usual view of the sky, the fence, and the other apartment complex, but I didn't. I saw black. This struck me as odd, so I went to another room to look out, expecting to at least see the same thing. I didn't. When I looked out the window in a different room, I could see everything as it should be; lit up by the street lamp.\n\nI came back into my room and got on facebook, and decided to ask my friend if it was black outside of her window. When I asked her, she said that it was. Okay, so I'm not alone on this. Then, I asked her if she could usually see outside of her window at night from street lamps, to which she replied \"No, there aren't any street lights at all. I can usually see outside though.\" This freaked me out even more. I decided to ask her if she could see out of any other windows.\n\n&gt;Me: Can you look out another window and see?\n&gt;Her: I'll go look now.\n&gt;Me: Okay\n&gt;Her: I can see the cars on the highway from the kitchen window. I can see the headlights and the street, and the houses across from me just fine.\n\nHer kitchen window faces the same direction as her bedroom, with the same view, so this freaked me out even more. She's not as freaked out by this as I am. It doesn't even seem to bother her. We sent a message to our other friend, but she isn't online, and hasn't seen the message yet. The friend I've been talking to says that it's weird, but I shouldn't worry about it. I can't help it, though, this has never happened and it's freaking me out. Has this happened to any of you before? Do any of you know what's happening?\n\nI'm really confused right now, and kind of scared. If it's like this again tomorrow night, or if my friend answers, should I update you guys? I don't know if I should, because I don't really know what's happening or if this is even anything at all.\n\n**Some additions that I had typed in the comments:** Shining a light out my window did nothing, it remained black. After going outside and looking in,  I could see inside of my room perfectly, but when I got back into my room, I could only see black out. Someone told me to open my window because I was being messed with, however, this is not the case, as my window is already open.\n\nI was directed here by /u/JayTread and my original post is [here](http://www.reddit.com/r/nosleep/comments/1jbm0a/is_it_pitch_black_outside_your_window/)",
        "created_utc": 1375163021,
        "upvote_ratio": ""
    },
    {
        "title": "pixelated trees on the side of a hill",
        "author": "thebeesremain",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1j84gf/pixelated_trees_on_the_side_of_a_hill/",
        "text": "A few years ago, my family and I were driving home from a camping trip up in the mountains.\n\nWe came around a bend, and ahead to the right was the side of a large hill, covered in pine trees just like all the others. However, what was really strange was that one area on this mountain was...fuzzy (like you would see on the far edges of the landscape in a game). Just this one area, as if someone had left a pixelated spot in the rendering.",
        "created_utc": 1375034384,
        "upvote_ratio": ""
    },
    {
        "title": "The hole in my sofa",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1j820r/the_hole_in_my_sofa/",
        "text": "I was about 6' tall when I was 14. We had a generic sofa where the seat was about 1.5 feet off of the ground (from the tip of my finger to my elbow) and the top of the arm of the sofa, where you rest your arm, was about 3 feet off the ground (from the tip of my finger to my shoulder). The actual measurements may be off, but what is important is the length in relation to my body parts. So I was flipping a coin, pretending to be two-face from Batman, when it disappeared into this hole in the corner of the couch, where the seat, back, and arm meet. I stuck my wrist in the hole and couldn't feel anything, so I reached until my elbow was in. I was elbow-deep in the sofa, and still couldn't feel anything, not the side, not the back, and not the ground, so I reached deeper. I figured I would keep reaching until I felt the ground, where I assumed the coin would be, so I reached all the way up until my whole arm was in the sofa up to my shoulder shoulder. I was surprised that I still couldn't feel the side or back of the sofa, let alone the ground, so I swung my arm around. My arm made almost a full 360 degrees, as if I was swimming the freestyle stroke of swimming or something, but I STILL couldn't feel anything. Keep in mind, this was in the corner of the seat, arm, and back. I took my arm out and measured it against the side and sure enough, I could touch the ground with the end of my middle finger, and the seat was where my elbow began. I moved the sofa to see if there was a hole in the ground and there wasn't, it was solid wood floor. I tried to put my arm back in the hole but the second time it was too small, I couldn't even fit my wrist in there. I was really freaked out at this point, but I had finally realized where all the TV remotes had gone.",
        "created_utc": 1375032133,
        "upvote_ratio": ""
    },
    {
        "title": "Shit...what did they change?",
        "author": "[deleted]",
        "url": "http://i.imgur.com/jo6YgWU.png",
        "text": "",
        "created_utc": 1374975877,
        "upvote_ratio": ""
    },
    {
        "title": "As an Amateur Radio Operator I experienced Long-Delayed Echoes (LDEs) at 145 MHz a few times",
        "author": "PlinyPompei",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1j44qn/as_an_amateur_radio_operator_i_experienced/",
        "text": "I was stationed at Okinawa in the 90's and took up Amateur Radio as a hobby, before PCs were ubiquitous. I would regularly make a CQ call in the early morning around sunrise, using either the local repeater or plain simplex mode. A few times, anywhere from 10-20 seconds later, I heard my own voice come back on the same frequency with the same call sign. Sometimes it would sound scratchy and distant, other times it was plainly audible. The sound of my own voice through the radio would send chills down my spine every time. Considering light can travel around the Earth 8 times per second, where were these radio echoes coming from some 10-20 seconds later? Evidently they are called [Long-Delayed Echoes](http://en.wikipedia.org/wiki/LDE) and no one knows for sure why they happen.",
        "created_utc": 1374865461,
        "upvote_ratio": ""
    },
    {
        "title": "I think the glitch in the matrix was recognizing the matrix, and this is the period in which we recognize the exercise; as opposed to surviving a world war, supposing there is also a reality that WW2 ended it all.",
        "author": "themanhefests",
        "url": "http://io9.com/if-this-theory-is-correct-we-may-live-in-a-web-of-alte-896376482",
        "text": "",
        "created_utc": 1374819501,
        "upvote_ratio": ""
    },
    {
        "title": "Weird night-time happenings",
        "author": "ladygerard",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1iy3dm/weird_nighttime_happenings/",
        "text": "I have two things that are so frequent it really freaks me out, not major things but still weird. Let me start by saying I have never once sleep-walked/talked etc.\n\nFirstly, I go to sleep in my pjs, I'm a really light sleeper (seriously a fly can wake me up), but more often than not I will wake up completely naked. I have no memory of doing this, it has happened to me whilst in bed with my SO and he doesn't ever remember seeing me take my pjs off. Weird.\n\nSecondly, me and my SO like to stay up talking in bed, so much so that we often fall asleep mid sentence. Every single dream I have when we are in the same bed is a conversation with him, with my room exactly as it actually is. The odd thing here is that through the night we will both wake up at the same time and both wonder whether or not we have had conversations, not even the same ones. It genuinely makes me question which parts of the night are dreams and which are reality, it scares me a little how indistinguishable they become.\n\nTL;DR Involuntary nakedness, Dreams/reality merging in the night",
        "created_utc": 1374658326,
        "upvote_ratio": ""
    },
    {
        "title": "Glitch or my personal superpower?",
        "author": "rbrumble",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1ixgh4/glitch_or_my_personal_superpower/",
        "text": "So, just found this subreddit today (hi) and this seems like a relevant story, so here goes:  9/10 times when I grab a reference book, like a dictionary or an encyclopedia, to look for somethign very specific, the book opens to the page where what I was looking for is listed.  Like if I need to find a word in the dictionary, grab it off the shelf and open it the word I wanted is staring back at me.  This has happened so many times, I call it out every time (I work in academia, so there's lot's of opportunity to seek reference manuals of some kind).  Weird, huh?  Glitch or superpower?\n",
        "created_utc": 1374632537,
        "upvote_ratio": ""
    },
    {
        "title": "In case anyone was wondering if OP would deliver on PC duplication glitch from 4 months ago",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1iwge9/in_case_anyone_was_wondering_if_op_would_deliver/",
        "text": "* [Original thread](http://www.reddit.com/r/GlitchInTheMatrix/comments/1ala02/duplication_glitch/)\n* [Recent thread by OP asking for free pizza](http://www.reddit.com/r/Random_Acts_Of_Pizza/comments/1iul1u/reuqestmaineno_food_until_wednesday/)\n* [His response when I suggested he sell one of his TWO gaming PCs.](http://imgur.com/GXp4T1d)\n\nself-post, wouldn't seem right to earn karma out of this",
        "created_utc": 1374605214,
        "upvote_ratio": ""
    },
    {
        "title": "Chameleon truck",
        "author": "ceversole",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1iuphs/chameleon_truck/",
        "text": "I was driving home after a trip out of town one day about a month or so ago, and I was driving at about 30 MPH going down this county road on the northern part of the county north from mine. There was a red pickup truck (F-150) in front of me and the guy, who I remember was wearing a white trucker cap, slowed down to turn into his short driveway. The truck was a little ways ahead of me but I began slowing down anyway because I'm always paranoid of getting too close to a braking vehicle. So I saw the guy in his red truck turn down his short driveway off, but there is farm equipment which obstructed my view of his property, but I know what the property looks like from driving past it so many times. There is only one driveway and that's the only place vehicles can go and it is very short. When I drove past his house, still going slow because there was a stop sign not far ahead, I looked over to where I expected his truck to be, and what I saw shocked me: the guy, still wearing his white trucker cap, was stepping out of a white F-150. I KNOW that truck was red on the road. I pay attention to things, and that truck was not white, yet it somehow was as the guy was stepping out of it. There were no other vehicles, nor any other people on the property. There was no possible other place for the red truck to be. As I said, the driveway is very short and close to the house, which is close to the road, too, and I know it wasn't a light trick because the sun wasn't out at the time. I watched the property disappear from my sight in my rear-view as a tried to comprehend what I had just saw. \n\nI haven't taken that route to get out of town in a while. Maybe it's time to do it again. \n\n",
        "created_utc": 1374541018,
        "upvote_ratio": ""
    },
    {
        "title": "What if all these supposed \"glitches\" are actually a quick and hopeful explanation of a perception that is lacking all the information?",
        "author": "collectiveevolution",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1iq45y/what_if_all_these_supposed_glitches_are_actually/",
        "text": "Could these \"glitches\" be our explanation for the misunderstandings of our reality? \n\nIt seems fairly easy to label an experience as a \"glitch in the system\" when in reality (beyond our perception of it) there is actually a logical explanation for our experience.\n\nI want to believe, but at the same time I also realize the weaknesses of human perception and the brains ability to quantify it's experiences.\n\n",
        "created_utc": 1374367773,
        "upvote_ratio": ""
    },
    {
        "title": "Another Doppelgänger",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1ipx4z/another_doppelgänger/",
        "text": "I submitted this as a comment in a previous post about OP seeing an older version of himself as a child and vice versa, decided to post it stand-alone: \n\nSomething similar happened to me when I was on vacation with my parents in Cozumel. We went there about once a year. As a little girl (maybe 11?) I was walking up to my hotel from the beach through rows of beach chairs where people were sunbathing. Something about one of the young women I found extremely compelling for no particular reason that I could determine. But I was drawn to her. I walked up to her--she was asleep on her chair. I knew I was being creepy but I couldn't help myself. I \"knew\" that it was me. She was older, but she was me. She was wearing a brown bikini and continued to sleep peacefully as I stared creepily at her. I brushed it off but I was fascinated by the experience. Years later, my family and I went back to Cozumel. I fell asleep on the beach in the sun, having completely forgotten the experience. I had the sensation that someone was near me and I woke up. Nobody was there, but that was when I remembered the experience from years before. I was 19, and wearing a brown bikini. ",
        "created_utc": 1374360646,
        "upvote_ratio": ""
    },
    {
        "title": "How have you dodged a bullet in your life?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1in2fn/how_have_you_dodged_a_bullet_in_your_life/",
        "text": "This is what I believe Reddit refers to as an \"X-Post.\" I posted this in the thread here: http://www.reddit.com/r/AskReddit/comments/1ijzbr/how_have_you_dodged_a_bullet_in_your_life/\n\nIt was suggested that I post this here, as well.\n\n\nWarning:[[Serious]][[Deep]]\nI'll answer this literally, because I do not know if I actually dodged the bullet or not.\n\n\nI was 22 years old and had ruined my life entirely. I had accused the only woman I ever loved of horrific things, and later found that she was having a child with someone else. My friends were alienated from me (before I recognized that I was the asshole--they couldn't be bothered to I dunno... tell me this).\n\n\nI became reclusive. Pushed people away. Stopped dating. Stopped doing anything but work and videogames. Was dependent on family for constant handouts and help. Could not support myself due to the lack of realization that I was entirely irresponsible (hindsight is always 20/20).\n\n\nI had recently purchased a .45 1911a. It was not a matter of gaining attention from anyone. Nobody knew of my battle because I was too ashamed to say anything about it. One night I decided it was over. I had no possible solution other than to end it. I loaded the 8 round clip, chambered it, put the gun in my mouth, the end of the barrel pointing towards my soft (?)palette(?)palate(?), shut my eyes, and pulled the trigger.\n\n\nNothing fucking happened.\n\n\nExcept that I had shit and pissed myself. I pulled the gun out of my mouth and looked at it. I threw up all over the bedroom floor. It was like that moment in Trainspotting (minus the drugs) where he had a moment of clarity while diving into a shitstained toilet for drugs.\n\n\nI spent the next god knows how long sobbing maniacally in the shower, I hadn't even bothered taking my clothes off at first. I was hyper-ventilating, vomiting, dry heaving, panicking, freaking out, and every time I tried to call for help my voice gave out. It just wouldn't work.\n\n\nI woke up to freezing rain, or what seemed like it. I was naked, clean, and cold water was pouring over me. I shut it off, grabbed a towel shivering. I got dressed in warm clothes despite the 100 degree temperatures outside and cleaned the carpet next to my bed. I washed my shit/piss stained sheets with heavy bleach and threw away the clothes I had worn the day before.\n\n\nAll day I looked at my pistol there in the corner. Staring at me. I finally went to pick it up and check it. I pulled the bullets out of the clip. I counted 7. I checked the chamber. Empty. Figuring that I had somehow just avoided death via a dud bullet, I went to my hands and knees to look for it. I didn't find the bullet. Rather, I found the empty casing.\n\n\nEver since that moment of realization, I have question reality to the fullest extent. Did I actually succeed in committing suicide that day, and I am merely living the life that I desired to have in that last final moments before my brain shuts itself down? Like an extended dream state to a comatose patient? Am I actually sitting in a coma in a hospital ward somewhere with half of my face missing due to screwing up the suicide attempt?\nIt is far too convenient, after all. I am now with the girl that I had mentioned earlier. The little girl that she was soon to have looks nothing like her supposed father. She calls me 'Daddy,' and acts just as much the shit that I was at her age. She has my skin, my eyes, my hair color, looks like me from the exact age before puberty took over. She is also too intelligent for her own good, just as I was in my younger years (and all it led to was trouble).\n\n\nThe questions have always been there: 8 bullets. 1 empty casing. 7 in clip. Gun smells like it was fired recently. I'm alive. No evidence of a bullet anywhere.\n\n\nIs it not a little too convenient that I am now a father to two children, have a beautiful soon to be wife who happens to be the \"one\" that got away, yet there's a missing bullet?\n\n\nShit, it's entirely possible that when you die before your time, you don't actually know it and simply slip into an alternate reality. Perhaps we are nothing but a computer simulation after all, and I was a corrected error in that the higgs boson conveniently 'erased' the bullet in the tiny fraction of a second it would have taken to go from the jacket to the four or five inches it would have traveled to get to the base of my brainpan. Oddly enough, I chose to become agnostic that day (was an atheist).\n\n\nNo matrix commentary here. Just a reality twisting what the fuck.",
        "created_utc": 1374252259,
        "upvote_ratio": ""
    },
    {
        "title": "I lost three hours.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1ijlw0/i_lost_three_hours/",
        "text": "I almost posted this to r/nosleep, but I figured this was a more appropriate sub reddit..\n\nTwo nights ago I had a dream about my last week of school for some reason. And at first I was all happy and shit that I was graduating, again, but then I realized something... \n\nI couldn't remember anything after 5th period. I would go to 5th period, and then it was just a blur. 6th and 7th weren't there, and my memory came back an hour or so after I was home, playing video games or something. \n\nThis troubled me a great deal in the dream. At first I theorized that it was me skipping, which was highly likely. My last two periods were joke classes, and by the last month of school I was skipping after 5th period whenever I felt like it. But I didn't remember texting anyone to come give me a ride, or walking home.\n\n So I called my friend and asked her, who had the same classes as me 5th through 7th period. She told me I was there, and that I took the bus home and everything.\n\nThis continued to perplex me in the dream world, when suddenly I just woke up. It was high noon, my summer sleep schedule has been in effect since june. I was lucky enough to had woken up before 1, honestly. Anyway, I dismissed it as a weird dream and went about my day. Skyped some friends, played LoL, TF2, etc, went out to waffle house with said friends, hung out with them a bit more, then came home.\n\nI had just finished typing up a large portion of a r/nosleep story I am currently not finished retelling. It was around 11:30 to my memory. I remember glancing over at my Navy START guide on my desk, this little book that is supposed to prepare you for bootcamp. I got mad at myself, because I ship out late august and I haven't worked out since I got back from a vacation in June.\n\nSo I got out of my chair, and paced around nervously a bit. I went on about it, saying aloud,\"What the fuck am I doing?\" \"They're going to roast me if I don't get serious\" etc etc, generally freaking the fuck out as I usually do. So I turned and walked in front of my tall mirror that is propped up on my dresser. I stood there in my boxers, leaned forward and stared at myself in the eyes.\n\nI began to give myself a pep talk. Cute, right? But it's worked before. I talk to myself, saying \"We're gonna do this shit, man\", and I usually end up doing it because I try not to break promises, even with myself. So I told myself,\"Tommorow we're gonna go out, run, do push ups, and study for that PQS eval shit.\" And I went on for about 2-3 minutes of this shit when I turned around and cheesily said,\"Alright team, break.\" \n\nI looked at my radio clock, it was 1 AM. I did a double take. My brother uses my computer as a gaming PC, and consequently fucks with shit in my room, so I looked at my iphone. 1:01 AM, July 17th. Ooookay.. Check the computer, 1:01 AM. Go on reddit, check the post time for my nosleep story. 2 hours ago. \n\nI started to panic a little. There's a reason I get so uneasy when I type up that story, and I feared for the worst. But then I remembered the whole day. Several references to time throughout the day. I remember waking up and hearing my dad loudly watch a movie, I believe it was that Will Ferrell movie where he's an OCD dude who is being narrated by some British woman. Can't remember the name. \n\nThe skype call, when I got in one my friends exclaimed immediately,\"Oh shit, it's 12:30? Thought it was 11. Gonna be late for work.\"\n\nI went on an old reddit thread out of curiosity, and read through \"new\". It was last month, some thread on askreddit about the most unexplained thing to happen to you. I read many stories about people losing time, thought nothing of it. \n\nDrove to my friend's house, when I got there he said,\"Whoa, you're here already? I swear you texted me just a second ago you were on your way.\"\n\nWe played Mario Party 7 from 6-9. Suddenly someone exclaimed,\"Oh shit it's dark out. Didn't even notice, dude.\" His girlfriend replied,\"Well you know.. time flies.\"\n\nAm I overreacting? Did I just have some kind of fucking stroke for 3 hours and stare at myself in the mirror? Am I just putting all these things together with no real meaning? I don't know, I should have payed more attention in psychology.. I think I know the term. Is it that one phenomena where you think about something, and you start to notice it around you often? \n\nI mean, that doesn't really make sense, because it happened after I realized it. This is so crazy. I'm 99% sure I posted that story at around 11:30",
        "created_utc": 1374129635,
        "upvote_ratio": ""
    },
    {
        "title": "Weird glitch while on the road",
        "author": "abrahamisaninja",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1iemdr/weird_glitch_while_on_the_road/",
        "text": "Coming home today from the girlfriends house today she asks me to steer  while she takes care of an uneven bit of her nail with a nail clipper. I was holding the wheel and cruising along the middle lane of the three lane stretch of freeway. She then gets done doing her thing and regains control of the wheel and I suddenly realize that we were in the far left lane all along even though we were just in the middle lane. It really freaked me out for a second but I can't seem to explain it. ",
        "created_utc": 1373971774,
        "upvote_ratio": ""
    },
    {
        "title": "Deadly Premonitions and Finishing Sentences",
        "author": "PandaPatrolSquad",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1i833u/deadly_premonitions_and_finishing_sentences/",
        "text": "Ever since I've been a kid I've had strange premonitions at random points during my life. These don't happen on a regular basis, or during any particular catalyst. Sometimes they happen when I'm relaxing on the couch, when I'm playing with a new pet, or when I'm studying for finals at college.\n\nEssentially what happens is time will freeze and visions will flood my head. Like I have been in that EXACT moment before and I can see what is going to happen. It's not Deja Vu, because I get those too, it's like Deja Vu plus a little of what will happen next.\n\nFor example. My parents surprised my brother on his thirteenth birthday with 2 kittens, I had no idea that they were buying them until they brought them home. So my mom, my brother, my sister and I (I was about 13) were all sitting in his room playing with these new kittens. But then time stopped. In my head I saw my mom collapsing, she couldn't breathe, the new kittens kept playing in the room with my brother while I ran and called 911. The ambulences came, took her to the hospital but in my head I knew she was dead. But then I snap back. Not a second has passed, yet I could see exactly where this day was headed. Except it didn't. She never collapsed and never died and to this day she is alive and better than ever. (I'm 21 now)\n\nThose are the ones that don't come true.\n\nOther times, like in a class at college I will get the exact same feeling but it's not of dread, time will stop and I will see where the lecture is going, or what someone will say next, so well in fact that I can finish their sentences for them. This one is from fourth grade, these have been happening all my life as well. My friend and I were talking about U.S. States and State capitals. We were talking about our favorite states, and he was saying something about his being Minnesota, whereas I said mine was Washington, but I had a moment just then and knew exactly what he was going to say, and completed his sentence for him. He said that \"well if we can't pick a state where we are from my favorite state is Washington too.\" To which I replied well you're just copying me. The only thing is that he hadn't said the sentence yet. He's the only close friend (Aside from my fiance) that knows that these moments happen. And to this day he will still joke about how I'm a \"mind reader\" although he doesn't really understand what it is. I don't even know what it is.\n\nThey've been happening my whole life and happen at the most odd times, but I can recall to the exact words that were said and what happened at that time since I can remember.\n\nTL;DR \nI randomly get visions of the future, bloody horrific occurrences that never turn out to be true, and normal every day life occurrences in which i can predict so well that I can complete entire conversations. ",
        "created_utc": 1373734052,
        "upvote_ratio": ""
    },
    {
        "title": "Glitch or...?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1i81a8/glitch_or/",
        "text": "I came home after a dinner with my family. My mom started to yell at me about something. I came over to my parents room and realized the attic door (we don't actually have an attic, its a small square in the cieling that you push up if you need to go up there to install a dish or soemthing) was slightly opened off to the side. No one had been in the house and until then we never knew it could even be opened.",
        "created_utc": 1373732277,
        "upvote_ratio": ""
    },
    {
        "title": "Unexpected glitch in an unexpected place (this morning)",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1i7z2j/unexpected_glitch_in_an_unexpected_place_this/",
        "text": "So this morning I sat on the the toilet and let out a solid 18 second piss.\n\nI stood up to see how high the piss level was in the toilet and i'll be damned if there wasn't a huge piece of dogshit in there.\n\nA piece of dogshit slid out my penis? I think not.\n\nI got glitched so hard.",
        "created_utc": 1373730007,
        "upvote_ratio": ""
    },
    {
        "title": "Smoke alarm.",
        "author": "Alt_Rox_HaXer",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1i7iy3/smoke_alarm/",
        "text": "So, as I'm sitting in my kitchen, waiting to cook my oh so delicious Totino's personal pizza, my oven is pre heating. And most of your ovens at home, like mine, have a bunch of shit in the bottom. Crumbs, that kinda thing. And my oven starts spewing a little smoke. No big deal, right? Turn on the fan, problem solved. So I walk away, and not 3 seconds later I hear the smoke alarm go off. So like a normal person would, I go fan that shit with my hat, its annoying as fuck. But when I get there and look up, ready to wave my arms like an idiot, I see no smoke alarm.\n\nI took it out because I smoke inside. I don't know how go explain it. I don't care. I'm gonna eat this pizza, and watch King of the hill, dammit.",
        "created_utc": 1373701829,
        "upvote_ratio": ""
    },
    {
        "title": "An Extra Puzzle Piece",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1i2ksc/an_extra_puzzle_piece/",
        "text": "I have a story that I think is perfect for this subreddit, so here it goes. I apologize for the length, but I feel it's necessary. \n\nI bought this 500 piece puzzle of the Neuschwenstein Castle at the mall one day with two of my friends. I was super stoked because I was lucky enough to visit the castle in person a few years back. I purchased the brand new, plastic-sealed puzzle, and left the mall in my friend's car. The puzzle didn't leave the bag from the store until we got back to my place. My friend that had driven to the mall headed home after awhile, and I got about half of the puzzle done that night after they left.\nThe next day, as I'm starting up the puzzle again, I get a text from my friend with a picture of a puzzle piece, and it just says \"Missing something? Found this in my car today!\" \nHe had discovered the piece right by his gear shift, and I had been sitting in the back seat. Well, shit. That's weird. Not sure how that happened but whatever, he's bringing the piece over so I might as well finish up what I can. No biggie.\n\nSo my friend gets to my place, and has the piece in his pocket. Neither of us have any idea how it got in his car, so we're joking around about it being a phantom puzzle piece or something. But. as we're putting the rest of the puzzle together, we realize that we don't need the piece that is in his pocket... because the puzzle is completely finished.\n\nSo my questions are:\n\n 1) How did that puzzle piece get out of the plastic wrap, out of the plastic bag, and into the front of the car? and \n 2) If that piece was actually able to wriggle out of the container, what are the odds of it being the one duplicate puzzle piece out of a 500 (or 501?) piece puzzle? \n\nIt's honestly just one of the strangest things that I've ever experienced. Other creepy things are a lot easier for me to rationalize and explain away than this magically-appearing puzzle piece. So what do you think?",
        "created_utc": 1373536060,
        "upvote_ratio": ""
    },
    {
        "title": "explain this?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1i2jtx/explain_this/",
        "text": "\nProbably different from most of the other stories in here, but when I was 11 or 12, I was bored and started rolling a die in my house. I was sitting on my floor (carpet) and rolling to see if I could get the same number multiple times in a row. After a few minutes, I started rolling 4's over and over again. I was rolling quickly and wasn't really thinking about what my hand was doing. I ended up rolling a \"4\" on the die a total of 49 times in a row. After that, the die behaved normally. It wasn't a loaded die, and I can't think of any way to explain it. I didn't shake up the die excessively, but I did roll it in a normal way. The total probability of that happening (given equal probability for each number) is something like 1 / ( 4.45 x 10^38 ), which seems impossibly low.",
        "created_utc": 1373534320,
        "upvote_ratio": ""
    },
    {
        "title": "I bought 4 tires when he suggested 4 tires for the price of 3.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1i27n6/i_bought_4_tires_when_he_suggested_4_tires_for/",
        "text": "So this happened last year, but i just found this subreddit. I have an old F150, and i needed new tires for it because the ones on the truck were bald from wear and tear. So i went to a local tire shop and talked to a guy about buying a set of tires that i thought looked good. and he said that thay dont run any deals on those, but a similar tire they're selling 4 for the price of 3. And i decided to still choose the more expensive tires. So i bought them, they put them on, and i started heading home. When i was in my truck, my dad called me and asked me how much it costed me, i forgot, and pulled out my reciept, only to notice, the guy only charged me for 3 tires when he was supposed to charge me for 4. I told my dad that and hung up. As soon as the phone call ended. My driver's side back of the truck just fell to the ground and started sliding across the pavment. I slowed down and pulled off to the side of the road and got out of my car. The whole wheel was gone...i called my dad, and he headed to where i was at. For the next 4 hours, my dad, mom, brother, cousin, uncle, 3 police, and i, searched for my wheel in a mile radius around where i was. We never found the tire.\nI then had to go back to the tire shop with my dad and buy another one.\n\nTLDR - acidently got 4 tires for the price of three because of the cashiers mistake, while i was driving home, one of my tires dissappeared off my truckand we never found it.",
        "created_utc": 1373518198,
        "upvote_ratio": ""
    },
    {
        "title": "Phantom phone number",
        "author": "wolfbunny92",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1i0n0r/phantom_phone_number/",
        "text": "To understand this story you need to know that in my house there is me(20f), my sister (22f), brother (12m) and both my parents, but my dad is hardly home so its a big running joke that my little brother is the 'man' of the house.\n\nSo I get a mms a few nights ago with a quote from tupuc about growing up with a lot of women, and the sender has also written \"hahaha so our boy Arj(my brother) is going to grow up to be the next Tupuc\"\nI assume it's an old family friend or something because I don't have the number where the text came from but the person seems to know my family so I reply with \"hahaha thats funny! but I'm so sorry who is this?\" to which I get no reply but forget about over the next couple days.\n\nLast night I get home and my sister who I haven't seen in a few days (we work opposing hours) is up so we have a chat and she asks me if  I got the mms she sent me\nI ask her what she sent me and she tells me she sent a Tupuc quote\n...the message I received is word for word exactly what is in her sent box with the same time stamp as displayed in her phone... but not from her number. We tried calling the number and no pick up.\n\nda FUQ",
        "created_utc": 1373475117,
        "upvote_ratio": ""
    },
    {
        "title": "Finally found the right subreddit. My friends think I killed Michael Jackson.",
        "author": "M0thersuperi0r",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1hwsf0/finally_found_the_right_subreddit_my_friends/",
        "text": "My band and I were playing a gig in our town, the day Michael Jackson died.\nAfter the gig, we packed all our stuff into the car, and started to head home. The bassist was driving, and I was in the passenger seat, while a good friend of mine was in the back with the keyboardist and the guitarist. While waiting at a red light, the guy driving started tapping the steering wheel. I caught on to it and starting singing over the rhythm; first a loose made up tune, which somehow progressed into The Jackson 5's 'blame it on the boogie'. I don't even know the lyrics to that song, apart from the chorus, but we all sand along anyway.\nSuddenly, my friend in the back asked: \"Who sings this song?\"\nMe: \"The Jackson 5.\"\nFriend: \"Are they still alive?\"\nMe: \"Let's see. Jackie, Tito, Marlon, Randy, and Jermaine? Yeah, they're alive.\"\nFriend: \"Wasn't MJ in the band?\"\nMe: \"Oh yeah, totally.\"\nThen, we got home. It was a little after 1 (IST), I think we sat on the couch to cool off, then I put on the news.\nMJ had just been pronounced dead in LA.\n\nMy friends like to joke I killed him; but honestly, I had similar experiences with both my girlfriend and my father's deaths. I don't want to believe this, because it feels like too much responsibility, but these are the facts, I suppose.",
        "created_utc": 1373339148,
        "upvote_ratio": ""
    },
    {
        "title": "I suppose you could call this a reccurence in the Matrix.",
        "author": "Carini95",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1hwp2n/i_suppose_you_could_call_this_a_reccurence_in_the/",
        "text": "So my father was an English major, and when he was younger, wrote for a few well known newspapers. In his spare time, he also cleaned gutters and painted houses. Years after he had changed jobs from writing to being in sales, he still did small handy-man side jobs. He was walking home from a job one night, probably around 9 P.M, and there are a few papers flying down the street in the wind. One comes towards him, and he stomps it down to stop it's flight. He looks at the paper, and it is an article he had written roughly 3 years prior to then.",
        "created_utc": 1373336470,
        "upvote_ratio": ""
    },
    {
        "title": "I'm new to this subreddit, am I doing it right?",
        "author": "Imashaaark",
        "url": "http://www.youtube.com/watch?v=jqLY96_zezc",
        "text": "",
        "created_utc": 1373336463,
        "upvote_ratio": ""
    },
    {
        "title": "Flashdrive cap completely disappeared from plain sight only to reappear two days later",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1hwno7/flashdrive_cap_completely_disappeared_from_plain/",
        "text": "Last month I was in a small, private computer lab at my university with at least eight other classmates, whom of which I'm all pretty close with. Had nothing on me but my flashdrive, and as I was preparing to take off, its cap fell off - it just lightly hit the table and fell off onto the floor. Or at least that was the most obvious place it could've fell to. I struggled alone for a few long minutes looking for this thing, I felt it was just so ridiculous so I started making a huge deal out of it and other classmates helped to meticulously scan over the entire area, and this white flash drive cap was absolutely nowhere to be found. \n\nTwo days later, I show up once my professor opened the door to the lab that hadn't been opened since last class session, and there it was... out in the open, just by my seat.",
        "created_utc": 1373335333,
        "upvote_ratio": ""
    },
    {
        "title": "Trees only partially rendered (x-post r/funny)",
        "author": "LifeinBath",
        "url": "http://i.imgur.com/BTQt4zl.jpg",
        "text": "",
        "created_utc": 1373133689,
        "upvote_ratio": ""
    },
    {
        "title": "The most insane thing that has ever happened to me.",
        "author": "BringForthTheRing",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1hmur0/the_most_insane_thing_that_has_ever_happened_to_me/",
        "text": "So on Wednesday, i left school like always and directly went home. I browsed reddit for a while then went to sleep. The next day i put on a new pair of jeans and go to school, on my way there for a second i thought i lost my phone, so i start to look through my pockets and nothing was there. In the end my phone was just in my jacket pocket. So i get into class and go directly to my seat. And in the middle of class i put my hand inside my pocket and feel this weird piece of paper. I get it out and have a look at it and it was a receit from a store i have never been to in my life. I show a friend of mine at recees and he says that he went to that exact store yesterday, and bought exactly those things on the reciet. Funny thing is, i didnt see him at all after school on wendesday. Whats also strange is that he never takes the reciets with him, so how on earth did the reciet get into my pocket.\nBear in mind that i wore different jeans on wednesday and thursday. And that my pockets were empty on my way to school.\n\nIts not that crazy but still....if any of you have any idea how that happened please tell me. ",
        "created_utc": 1372948029,
        "upvote_ratio": ""
    },
    {
        "title": "Forgot to render human",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1hgzt0/forgot_to_render_human/",
        "text": "This is one of the most vivid memories I have, which for someone with terrible memory problems, says a lot. This has always stuck out to me, and I still think of it and get weirded out somewhat often. The story itself isn't spectacular, but I know I saw it corectly. I tried so hard to convince myself otherwise, and just haven't ever been able to do it.\n\nIt was about 10 years ago, when I was 12 or so. I always had a thing about bridges. I would go through phases of being scared by them, and then love driving over them, and then switch back again. But even when I was scared of driving over a high bridge, I still loved looking down at all the cars driving underneath us. So one day at the George Bush turnpike in DFW, I was peering down at those cars below riding in the car with my mom, when I saw something I still can't explain. There was a convertible that immediately caught my attention, and there was nobody in the car. Not just no passengers of course, but no driver. I watched it for a few seconds before it passed out of sight, and there was absolutely nobody in the car. I told my mom, but of course she didn't believe me. Maybe y'all will. But I've never been able to explain it, and it's always bothered me just slightly...",
        "created_utc": 1372733628,
        "upvote_ratio": ""
    },
    {
        "title": "I had to do a double take and then another. I wasn't sure I was seeing this right. It just couldn't be...",
        "author": "gothewholehog",
        "url": "http://imgur.com/HOs4MtN.jpg",
        "text": "",
        "created_utc": 1372711751,
        "upvote_ratio": ""
    },
    {
        "title": "Weird Intuitive Moment",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1hds6x/weird_intuitive_moment/",
        "text": "I tend to sleep with my glasses somewhere in my bed. In fact, I do this every night. I can't believe I've kept them for as long as I have. Last night, I went to bed pretty late, around 3:30 am, and immediately fell asleep, glasses on the right side of the bed, me to the left. Suddenly, I jolted out of sleep. I looked over at my glasses, still folded closed on the other side of my bed. *Those are definitely going to break,* I thought. So I placed them up on a shelf about three feet above my bed and went right back to sleep. This morning I woke up, reached up to grab my glasses and found them snapped right in half. I can't really explain it. I don't know if it's a glitch in the matrix, but I woke up specifically to make sure my stupid glasses were safe, and at some point later in the night they broke, while they were on an empty shelf a few feet above my head. ",
        "created_utc": 1372623891,
        "upvote_ratio": ""
    },
    {
        "title": "How can this be explained?",
        "author": "herzberz",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1hbvg3/how_can_this_be_explained/",
        "text": "A several weeks ago, I was doing laundry.  I had a load in the washer.  The washer is the kind with a lid that opens on top.  When I check to see if the load is done, the washer lid was open, which had stopped the load mid cycle.  I thought that one of my roommates may have opened it, so I didn't think much about it.  Then about a week ago, the same thing happened.  I confronted my room mate about it, and he swore he didn't do it.  We play tricks on each other all the time, and he will always cop to it.  It really seemed like he wasn't lying, and I know him well.  I am positive I didn't open it either time, I never have to begin with.",
        "created_utc": 1372540128,
        "upvote_ratio": ""
    },
    {
        "title": "My cat was in two places at once.",
        "author": "MsLippy",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1h74rw/my_cat_was_in_two_places_at_once/",
        "text": "My cat is sitting on my lap. I heard his distinctive \"mraaaoow\" in the far corner of the room. \n(I have no other cats or animals a'tall)",
        "created_utc": 1372361026,
        "upvote_ratio": ""
    },
    {
        "title": "Two of my personal glitches",
        "author": "Chaos77719",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1h6ls5/two_of_my_personal_glitches/",
        "text": "So my first glitch is when I woke up earlier this week, the time was exactly 1:37 am. Nothing odd about it. Got up, went to the bathroom then fell back to sleep. Again I woke up and did the same thing, and when I looked at my clock it was 1:40 am. There is no way I could do all that and it only be a few minutes.\n\nMy second entry happened when I was in highschool, and still does to this day. Whenever someone asks a question, I like to answer it in my head. And most of the time, if its wrong in my head, someone else will say the exact thing I thought of. Like I'm projecting my thoughts into them. ",
        "created_utc": 1372347091,
        "upvote_ratio": ""
    },
    {
        "title": "Two Glitches This Morning. The Matrix Needs a Reboot",
        "author": "CitizenSam",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1h45ru/two_glitches_this_morning_the_matrix_needs_a/",
        "text": "I was driving to work this morning, waiting for oncoming traffic to break so I could make a left turn.  Four Mercedes in a row drive past me.  Odd, I thought.  But THEN, I look left to the road I am trying to turn on, and three more Mercedes are coming through.  I think the Matrix was running low on memory so it just rendered out a bunch of duplicate cars to save on RAM.\n\n\n\nThen I come in to work and walk past someone who I have never spoken to.  He points at me and says \"I should have went your way\".  I have no idea what he was talking about.  I think the Matrix cast the wrong character in today's program.",
        "created_utc": 1372263027,
        "upvote_ratio": ""
    },
    {
        "title": "Time Glitch",
        "author": "nicolombian77",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1h1xvb/time_glitch/",
        "text": "A few days ago, I was getting ready for an interview in the morning. I woke up at 7 and got ready and ate breakfast by 8. The interview was at 9 so I figured I should leave. I went to brush my teeth before going out and when I came out of the restroom, I saw that my phone said it was 10:30. I was completely dumbfounded by this. Either I went into a two-hour coma or I skipped time. The thing is that to me it felt as if time had gone normally and I didn't notice until I looked at the time. This is the biggest mindfuck that has ever happened to me.\n\nEdit: I chrcked the clocks on my phone and alarm clock, and I think the one in my interview.",
        "created_utc": 1372185338,
        "upvote_ratio": ""
    },
    {
        "title": "Saw my olderself when I was young, and my youngerself when I was old.",
        "author": "QuatroVeinte",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1h1u2k/saw_my_olderself_when_i_was_young_and_my/",
        "text": "My friend told me I should post this here.\n\nI was in Toronto when I was 15 with my parents, walking down the street, I wasn't paying attention tot he people, I was more or less admiring the tall buildings. I looked ahead of me and walking towards me was this person that I knew 100% had to be me, I don't know how i knew that but I knew it.. he was starring at me with a shocked/amazed look, we walked past each other still starring at each other. I knew that was me, well older me somehow, I just knew it. We didn't say anything just walked past each other starred in amazement and unbelief I would say. Fast forward 10 years, I'm back in Toronto, walking down the same street only in the opposite way as before, then I see my younger self walking towards me, I couldn't say anything or do anything but stare in unbelief. somehow this was me younger and I remember vividly both occasions. I think this is when I started to believe in cyclical time not linear... ",
        "created_utc": 1372182599,
        "upvote_ratio": ""
    },
    {
        "title": "Coincidence",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1h1ms5/coincidence/",
        "text": "After an exam the other day me and a friend were talking about it. Suddenly both of our bags broke at the exact same time, the straps coming out of the holders. Strange",
        "created_utc": 1372177185,
        "upvote_ratio": ""
    },
    {
        "title": "two simple yet odd recent glitches",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1h0spe/two_simple_yet_odd_recent_glitches/",
        "text": "the oddest one was last night, it was late and made a little snack. decided wanted a dipping sauce which was in a salad dressing jar that was laying flat on the bottom of my fridge. when i went to pick it up from the neck end it didn't move, not a bit in any direction, like it had the mass of a mountain. i let go and tried again and had no problem, nothing else moved, nothing was holding it in place and nothing was in the way or even touching it. \n\nthe other was last week when i was leaving for work i was thinking of wearing my belt since my jeans have been getting looser. so i look where i've been keeping my belt hanging in a door frame to use as a strop and it's not there. couldn't remember where i left it and didn't have time to look for it so figured it wasn't any big deal and went on to work. go on with my day, get home later that night and had not put any thought into the belt at all...then lo and behold, it's exactly where i had looked for it and there's no way i could have missed it, brown leather belt agains a white door frame. ",
        "created_utc": 1372139097,
        "upvote_ratio": ""
    },
    {
        "title": "Shared Dream",
        "author": "Andrew_mueller1019",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1gw9e7/shared_dream/",
        "text": "About 5 years ago, I had a dream of a past relative, my grandfather, working at the restaurant he owned. My brother, my aunt, and myself were also working that day. We all finished up the work day and sat down at a table and saw a severe weather alert on the news in our area. We looked outside and there was a tornado raging outside. We all dashed into the bomb-proof office. When we got in there we realized my grandfather was gone. We looked out and there he was in the hallway. He looked at all of us and said \"I will be fine, continue without me.\" I discussed this dream five years later with family members. They all described the dream exactly the same as I did. Could this be communication or reassurance from my grandfather? Could it just be a coincidence that we all had the exact same dream?",
        "created_utc": 1371965656,
        "upvote_ratio": ""
    },
    {
        "title": "[META] Why are there two subreddits for this topic?",
        "author": "SentimentalFool",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1gvkld/meta_why_are_there_two_subreddits_for_this_topic/",
        "text": "I just found out there is a /r/glitch_in_the_matrix with much more traffic and many more subscribers than this one. Since your missions seem to be the same, why aren't the two subs working together?",
        "created_utc": 1371938003,
        "upvote_ratio": ""
    },
    {
        "title": "Caught a moth.",
        "author": "SPCWalterSobchak",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1guimi/caught_a_moth/",
        "text": "This happened to me about a week ago, and after telling a couple buddies about it, they referred me to this subreddit to elaborate on the story.\n\nI have no explanation for what happened, and if it weren't for my sister being in the room at the time it happened, I probably would have checked myself into a mental institute by this point because it quite simply does not make any sense.\n\nI was sitting on my couch using my computer, my sister was sitting 5 feet away on another couch. She notices a moth flying around the room, and being terrified of bugs, I offer to catch it and let it outside so she doesn't have to deal with it. Conveniently enough, the moth flies within my reach, and I snag it out of mid-air with my right hand. \n\nAs this is happening, my left hand is casually making a fist while rested in my lap, which I thought nothing of at the time. After catching the moth, I feel it flutter around in my right hand for a few brief moments, and then it stops. I assume at this point that I had either closed my hand too tightly, killing it, or it had just realized that it wasn't going to get out and stopped putting up a fight. \n\nAfter shaking my hand slightly and still feeling no movement, I open my right hand and there is nothing there. Interesting, I think, it must have slipped out of my grip and I didn't notice. I then casually open my left hand which was rested in my lap, and lo-and-behold, the moth mysteriously flutters out. I instantly freak out and ask my sister if she saw what happened, to which she agreed that I had caught it with my right hand, but it had somehow moved to my left hand.\n\nMy right hand was never within a foot of my left hand while the whole incident took place over the course of 10 seconds or so, and if it weren't for her witnessing it, I would have thought I was crazy. I have no explanation for this other than a potential glitch in the matrix, quantum leaping, or some other phenomenon that I clearly do not understand.\n\ntl;dr Caught a moth in my right hand, open hand and nothing is there. Open left hand moments later and said moth flies away.",
        "created_utc": 1371888860,
        "upvote_ratio": ""
    },
    {
        "title": "Mysterious Text Message",
        "author": "guy_with_question",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1grgku/mysterious_text_message/",
        "text": "I'm not a frequent poster, but after I found this subreddit I instantly remembered something really strange that happened to me almost two years ago. \n\nIt was my senior year of high school. Every day I ate lunch with my close friends at the time. One of these friends has been my best friend for a long time, and is still my best friend today, we'll call him Pat. \n\nOne night, I had a strange dream that a traveling carnival had arrived in our town (a type of fair/carnival thing had recently passed set up near town if I recall, not really important to the story though). I sent Pat a text message asking him if he thought the group would be interested in going. I ended up at the carnival later in the dream, but I'm not sure if my friends were with me at all. Pat never responded to the text message.\n\nThe next thing I remember is waking up and getting out of bed. As usual, I was in a dazed state as I'm not a morning person. I grabbed my phone and saw a message from Pat saying: \"Yeah, let's go.\" I didn't understand it at first, so I just put the phone down and walked to the shower. It was when I was in the shower that I remembered the dream. As soon as I dried off, I went to check my phone. Nothing in the prior text conversation would have agreed with that response, and here was the really weird part: no date or time on the message. All I could see was that it was from Pat. \n\nOf course I asked Pat about it as soon as I saw him that morning, and of course he knew nothing about it, just as confused and baffled as I was. There was no record of the message on his phone, and he claimed to have no knowledge of sending the message. \n\nI have a few ideas about what happened. I'm always pretty skeptical, so I've always considered that Pat was playing a prank on me, as he has occasionally done in the past. But that wouldn't explain how we knew to send that message after a dream that he didn't have, or the lack of time or date on the message. I wonder if it was a message floating around from before that never successfully sent, but I know nothing about the technology of cellphones, and towers, and such (if anyone does know anything please chime in!).\n\nI would love to believe that the Pat from my dream sent me a text message that made it out of my head, or maybe I made contact with another dimension or something, but that would be silly. \n\nAnyways, that was just my personal glitch story. Thanks for reading! \n\nTL;DR Had a dream, dream friend may or may not have sent me a text message through to reality. ",
        "created_utc": 1371772881,
        "upvote_ratio": ""
    },
    {
        "title": "I met people in my dream... They also met me in the same dream.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1gqx3c/i_met_people_in_my_dream_they_also_met_me_in_the/",
        "text": "It was about 7 years ago... I was in 3rd grade and about 9-10 years old.\n\nOne night I had this very weird dream, I was in a dark city. The city was big. I recall I was with my family there, but soon we splitted up so it was only me and my mother.\n\nI proceeded to meet my best friend in this dream, and I remember that we went to do some stuff together.\nThe town was full of people. I remember some kind of police, and I knew that the police was evil. I remember persons busily walking by us, as we stood on the street. Very weird.\n\nThe next day, the same fucking dream continues! I met my best friend, we then had to go to some kind of arrangement (in the dream).\nI remember my family took us there.\n\nAnd we fucking met other people from the same class we went to, at the place. None of us seemed to think about the weird place we had gotten to, but we reacted as it was normal, and we talked and interacted with each other.\n\n\nHere's the twist... I told my friend, the day after, and he told me than he had the same fucking two dreams! Met the same people. \n\nWe then proceeded to ask my other good friend, and 3 others from the class. Whom we had met in this surreal dream.\nWHO ALSO HAD THE SAME TWO DREAMS! AND THESE WAS THE PEOPLE WE MET IN THE DREAM!\n\nI didn't think much of it then, but now it really fucks my logic up...\n\nWhat the actual fuck.\n\n\n**Edit:** When I think about it, it gives me a weird thought of alternative reality...\n\nThis shit happened. I had this dream.\n\nHowever, whether my friends tried to prank/scare me. Whether they lied to impress, or bond or become better friends with me... I don't know. But nothing similar has never happened.\n\nWeird world.",
        "created_utc": 1371757378,
        "upvote_ratio": ""
    },
    {
        "title": "I med people in my dream... They med me aswell in the same dream.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1gqvur/i_med_people_in_my_dream_they_med_me_aswell_in/",
        "text": "It was about 7 years ago... I was in 3rd grade and about 9-10 years old.\nOne night I had this very weird dream, I was in a dark city. The city was big. I recall I was with my family there, but soon we splitted up so it was only me and my mother.\n\nI proceeded to meet my best friend in this dream, and I remember that we went to do some stuff together.\n\n\nThe next day, the same fucking dream continues! I met my best friend, we then had to go to some kind of arrangement (in the dream).\nI remember my family took us there.\n\nAnd we fucking met other people from the same class we went to. None of us seemed to think about the weird place we had gotten to, but we reacted normal.\n\n\nHere's the twist... I told my friend, the day after, and he told me than he had the same fucking two dreams! We then proceeded to ask 3 others from the class (one of them was a weirdo though, so he might have lied) WHO ALSO HAD THE SAME TWO DREAMS! AND THESES WAS THE PEOPLE WE MED IN THE DREAM!\n\nI didn't think much of it then, but now it really fucks my logic up...\n\nWhat the actual fuck.",
        "created_utc": 1371756383,
        "upvote_ratio": ""
    },
    {
        "title": "Some guy read my mind at the grocery store.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1gqete/some_guy_read_my_mind_at_the_grocery_store/",
        "text": "This happened to me about 5 years ago when I was in college. It was late at night and I had been up playing video games. I got really hungry, and being a poor college student, only had cereal to eat, but no milk. So, I decide to go to the grocery store and get some milk. Again, it's very late, so there is almost no one in the store, and only one check-out lane open. I get my milk, and walk to the front to check out. When I get there, there is one guy in line. I am about 6'1\", and he was probably only an inch or two taller than me, but for some reason, it feels like he is towering over me like a giant. As I'm standing behind him in line, there is this really powerful and strange \"energy\" flowing between us. When he looks at me it feels like he is looking into my soul. After a bit, he pays, and starts to leave. Just as he's leaving he looks to me and says, \"enjoy your cereal\". I was only holding the gallon of milk. He had no way of knowing that I had cereal back at my apartment and was only at the store to get milk so that I could eat said cereal. Creeped me out.",
        "created_utc": 1371743761,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza glitch",
        "author": "selymsivad",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1gqe5o/pizza_glitch/",
        "text": "Ok this happened to me a few years ago. I was at my grandmothers house in monroe, (which is a very rural town). It was kind of late, and everyone was hungry so my dad ordered everyone some pizza. After ordering, me and my brother go to the basement to watch tv and wait for the pizza. About an HOUR goes by and the pizza still doesn't show up. We call them to complain and they said \"Sorry, your pizza driver is new and he got lost, he'll be there shortly.\" We said fine and I went back to the basement with my brother. But now, we are *starving*. I distinctly remember being weak and drained from hunger. So we are half dead, laying on tge couch when all of a sudden, I hear the door bell. I perk up immedietely, turn to my brother and say \"PIZZA!!!\". I hop over the couch and start crawling up the stairs. But when I was halfway up the stairs, I heard the doorbell again. And for some reason... I froze. I looked over to my brother who was starting at me like I was a freak. I said \"hey... How many times did the doorbell ring?\" And my brother said \"...once.\"\n\nI ran upstairs and asked my dad how many times the pizza guy rang the doorbell and my dad said \"once.\"\n\nI told them all what happened and my brother was the only witness to this glitch in the matrix. \n\nDoesnt matter, had pizza.\n\nTl;dr: I heard the doorbell ring in my head and got really excited, SECONDS before it actually rung. No idea how it happened.",
        "created_utc": 1371743263,
        "upvote_ratio": ""
    },
    {
        "title": "So this just happened and all I can think is \"wat.\"",
        "author": "Potato_of_Implying",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1gpva6/so_this_just_happened_and_all_i_can_think_is_wat/",
        "text": "A while ago, I decided to try to go to sleep, so I plugged in my phone on a bookshelf across the room and laid down.\n\nA few hours later, I'm turning in my bed, thinking about stuff.  All of a sudden, in one swift turn, my phone appears on my stomache, right after I decide that tomorrow I'm going to text someone (subject=irrelevant).\n\nWhat happened?",
        "created_utc": 1371720997,
        "upvote_ratio": ""
    },
    {
        "title": "Action figure transforms into an unpleasant surprise.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1gptf2/action_figure_transforms_into_an_unpleasant/",
        "text": "When I was about 7 years old I was playing some random games with my friends in a huge field when something caught my eye. I walked over and clearly saw a army man sized figurine laying in the grass that was like a baby blue color. I reached down to pick it up and realize I somehow picked up a weird inch long dark black beetle. I immediately freaked out a little and tossed the beetle away. Searched the entire area after and couldn't find the action figure.",
        "created_utc": 1371717669,
        "upvote_ratio": ""
    },
    {
        "title": "Random Street Fighter Noise",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1g75cj/random_street_fighter_noise/",
        "text": "I was sitting on my couch with a couple of buddies playing Fallout 3 GOTY, a gentleman's game. We're home alone in my house. The volume is pretty low since we were conversing, and other than the two TVs playing Fallout and two lamps, there were no other electronics on in the room. I pick up my iPhone to check a text message, reply to it, and put the phone on the coffee table in front of all 3 of us. Out of nowhere, my phone lights up, and a very clear \"HADOOOKEN\" plays on my phone. All of my friends noticed, and shrugged it off as something funny, but I picked my phone back up because I didn't know where that sound came from.\n\nI had only my messages app running. And none of my music has that sound bite. There was no apparent source, and there was no app running that wouldve played it. when the screen came on, there was no notification on the screen. All of my friends heard it and were sure it was a Hadoken from street fighter. Where did this come from, a parallel universe, perhaps? Any explanation? Please help me. I'm considering seeing a therapist.\n\nTL;DR phone randomly played audio clip of Ryu saying HADOKEN, no idea what app or where it came from.",
        "created_utc": 1371048886,
        "upvote_ratio": ""
    },
    {
        "title": "Disappearing Frisbee? Into the Abyss?",
        "author": "hazeind",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1g72qq/disappearing_frisbee_into_the_abyss/",
        "text": "So I live in a city on the water, and one of the best parks to go smoke at is this big grassy peninsula by a yacht club. It's a large enough area that you can smoke pot in public without worrying about disturbing the other people who are there. It was a really gorgeous Florida day out so two of my best guy friends and I decided to go smoke a j at the park.\n\nWhen we got there, we sat by the water to smoke privately and once finished, went and sat at a picnic table a just a little ways over from two dads and their kids playing. The fathers were throwing a frisbee around while the kids tried to keep up. All three of us were watching the frisbee getting tossed around. So one dad throws the frisbee to the other, and the guy goes to put his finger up to the center of the frisbee to sort of spin it on his finger (kind of like you would do a basketball) before catching it, and it just...shatters into chunks that disappear into thin air. \n\nNow, we were a little stoned, but all three of us saw this happen, and of course both of the men playing with the frisbee did as well. They seemed to just brush it off though they were scratching their heads, but we were freaking out. The frisbee didn't just pop out of existence, but break into big chunks that then disappeared (it happened really quickly). There were no pieces of it on the ground-both of the men searched- and it never reappeared. \n\nI'm seriously so glad my friends were there with me when it happened because people don't usually believe us at first when we tell them this story.\n\nExplanations?",
        "created_utc": 1371046615,
        "upvote_ratio": ""
    },
    {
        "title": "Dreaming",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1g3djf/dreaming/",
        "text": "Usually right before I wake up my dream lets me known I'm about to wake up \nI don't think that make sense, but I suck at explaing things theough text",
        "created_utc": 1370919241,
        "upvote_ratio": ""
    },
    {
        "title": "Missing beer, not what you think.",
        "author": "Shelldore",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1fty80/missing_beer_not_what_you_think/",
        "text": "Thursdays are my Fridays currently, so tonight I decided I would grab a six pack and watch a movie. I already had two beers in my fridge, so those plus the six pack made eight. I drank the two in my fridge and made a conscious effort to put the bottle caps on my counter to save them for my sister. As I went to grab a third beer which would have been the first in the six pack, I noticed that there was already a beer missing. Thinking that maybe I already drank it I checked the counter. Only two bottle caps. I checked the trash and there are only two beer bottles in there. I know there were six bottles in the carton when I bought it because I always check these things, like I check eggs. \n\nSo, there was a beer when I got home, and now that beer is missing. Where did it go? I haven't left my apartment or anything. Not really scary or freaky just... weird.",
        "created_utc": 1370566719,
        "upvote_ratio": ""
    },
    {
        "title": "An old high school buddy asks a favor of me, write him a letter of recommendation based on character. I agree to write one after my finals, i look in my shirt pocket and find a dollar and this fortune about an hour after.",
        "author": "FuckingQWOPguy",
        "url": "http://i.imgur.com/cFo0pVP.jpg",
        "text": "",
        "created_utc": 1370376371,
        "upvote_ratio": ""
    },
    {
        "title": "Saw something very out of place in the sky",
        "author": "ArmedShadowfox",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1fmuxj/saw_something_very_out_of_place_in_the_sky/",
        "text": "I'm 19, 5-6 years ago during the summer I was with my mother in my grandma's house. We were getting ready to go to sleep when she noticed from my bedroom window a strange image. I moved over to her and what I can describe at my best follows:\n\nIt looked like a spiral galaxy...one that you would see in the pictures from NASA, only it was about the size of the moon. And I remember naively thinking, \"oh it looks like a galaxy\", NOT what in the actual fuck is that doing so close and vivid?\nIt wasn't the moon because I searched for it right after noticing the image and found it to be high up in the sky.\n\nThis is the most inexplicable thing I have seen, as I am very familiar with everything to do with space, distance, relativity, and size and shape. \n\nWe simply disregarded it and went to bed after 5 minutes but I remember getting up to go look at every 5 minutes and it was SLOWLY FADING AWAY..??",
        "created_utc": 1370323495,
        "upvote_ratio": ""
    },
    {
        "title": "I just had a flashback of an odd memory",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1fk2v7/i_just_had_a_flashback_of_an_odd_memory/",
        "text": "This happened to me when I was younger, around 8 years old. I was playing baseball for a team and was walking to the game. Everything is normal and I'm walking across the field to our dugout. I'm just watching our team warm up then looking at the clouds when it happens. I get an odd feeling and realize I can not hear. I look around and see a baseball floating in front of my face not moving. I just casually duck and continue walking. Now I realize someone hit the ball with their Barnard almost hit me square in the face. The weirdest part was the feeling of no time passing, no sound, no feeling and no movement. Just had a flashback to this moment.",
        "created_utc": 1370227804,
        "upvote_ratio": ""
    },
    {
        "title": "Not sure if this goes here but it is still pretty cool. Found it while searching for an ssd.",
        "author": "kkerwood",
        "url": "http://i.imgur.com/6l9FTTK.jpg",
        "text": "",
        "created_utc": 1369723568,
        "upvote_ratio": ""
    },
    {
        "title": "Subway doppelgänger really tripped me up",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1f2i9i/subway_doppelgänger_really_tripped_me_up/",
        "text": "A few hours ago, I'm on the subway (I live in NY) and I'm standing by a set of doors. I don't really have anywhere to put my eyes so i'm scanning the people around me (it's a habit) and notice this one dude, nothing particular about him but I notice his existence. A seat near me opens up at the next stop so i sit down, now between the door I was at before and the next set of doors. A stop later, the doors open and a dude walks on (via the doors to my left.) I do a double-take. This guy looks EXACTLY like the aforementioned guy standing by the doors to my right. I look back to my right, he's still there. I look to my left, the other guy is there and yes, they are the SAME. Same face. And hair and general height. One has a beard, and the other has a bit of a squishier jawline, but that was all. it was EERIE AS HELL. I probably looked insane because i kept scanning back and forth between them, hoping someone would see my insane movements, echo them, and come to the same discovery, but i was alone in this. We stop at fulton st and they both get off. I tried to see if they joined up and were twins meeting up at that stop or something but it seems unlikely. (they were so near each other on the train and in each other's path of visibility, if they were twins or brothers someone would have said something.)\n\nI mean, I know there are explanations to this, but i have never felt so weirded out before. I wish i had figured out the answer.\n\n**TL;DR** I essentially saw two of the same person on the train today.",
        "created_utc": 1369546419,
        "upvote_ratio": ""
    },
    {
        "title": "Reached over to put away my toothbrush and this happened...",
        "author": "footstepsfading",
        "url": "http://imgur.com/AnvPMCJ.jpg",
        "text": "",
        "created_utc": 1369509604,
        "upvote_ratio": ""
    },
    {
        "title": "first deja vu that made me feel like there was a real glitch",
        "author": "esoterrorcat",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1eqvbq/first_deja_vu_that_made_me_feel_like_there_was_a/",
        "text": "Backstory: Two night ago I was sitting on my friends' porch. One of them used to live upstairs (apartment building in chicago for reference) and the other lived in a suburb nearby. Now they're engaged and moved into this downstairs unit last week so there would be room for their kid. \n\nThis is the first time i've ever been to their new apartment (lived in for 1 week). We're having beers on the back porch and suddenly a girl in a yellow dress and teal shoes comes down the outdoor stairs with a little terrier. Immediately everything around me starts to happen as what I can only describe as a real-time memory. everything that happened from that point, i knew, until she was gone.\n\nI asked her what kind of dog it was, she said she didn't know she was just watching it for a friend, and that he was a total handful; but i already knew that. i just had to get that off of my chest. it was the most powerful \"deja vu\" i've ever experienced.",
        "created_utc": 1369111483,
        "upvote_ratio": ""
    },
    {
        "title": "Discovered this subreddit a while ago, then I just saw this article and I thought you guys would be interested",
        "author": "Dappergentleraptor",
        "url": "http://www.theverge.com/2012/10/11/3487710/computer-simulation-silas-beane-university-bonn",
        "text": "",
        "created_utc": 1369068633,
        "upvote_ratio": ""
    },
    {
        "title": "Double dipping or the Matrix is glitching",
        "author": "[deleted]",
        "url": "http://i.imgur.com/9ivv2d2.png",
        "text": "",
        "created_utc": 1369012935,
        "upvote_ratio": ""
    },
    {
        "title": "Alphabet/Numerals not generating...",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1eiu9l/alphabetnumerals_not_generating/",
        "text": "So I awoke from a nap one lazy afternoon. I was on my side and tiredly squinted at my laptop screen that was directly by my side. Every single letter/number on this open wikipedia page was rapidly changing between different letters/numbers...like, 3 would become the letter H and so on- just REALLY fast- even weird hieroglyphic/ancient curly pattern symbols that I don't even know the meaning of...\n\nAfter about 2 minutes of \"wow fuck this is awesome\" I sat up and fully opened my eyes and everything was normal, but i could do it again for a further minute or two just by squinting my eyes... until this brain glitch sadly faded...\n\nWhat astounded me the most was the level of detail in the individual non-english symbols. It generally looked like it came from a legitimate language. Perhaps it came from all the untranslatable text I had trained my eyes on in the last 26 years, but damn it was amazing.\n",
        "created_utc": 1368805731,
        "upvote_ratio": ""
    },
    {
        "title": "I'm pretty sure my mom jumped through a wormhole.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1ecsoz/im_pretty_sure_my_mom_jumped_through_a_wormhole/",
        "text": "A few days ago (about a week), I was at my moms adult league soccer game with my brother. Once the game ended I told her I'd see her back at the house and left while she was grabbing her things, giving me an approximate 5 minute head start. My trip home took about 30 minutes and I hardy saw any cars at all. I didn't pass any cars and no cars passed me. When I arrived at my house her car was already there and she was in the house. I asked her how she beat me home and she said she didn't pass any cars and didn't get passed by any either. What the hell happened? ",
        "created_utc": 1368581799,
        "upvote_ratio": ""
    },
    {
        "title": "Echo",
        "author": "vonillabean",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1ebb8i/echo/",
        "text": "This has been happening since I was a child and happens quite frequently: When I am talking to someone while a TV or radio is on in the background, immediately after I finish a sentence, someone talking on the TV or radio will say the same word or phrase that just ended my last sentence. No one ever believes me when I tell them about it, but luckily, it happens so frequently, that it deems quite easy to prove as the truth. \n\nAnd not as frequently, in a room full of people, the same thing will happen but an actual person (having a completely separate conversation with someone else) will say the same word/phrase I just said.\n\nDoes this happen to anyone else?\n\n",
        "created_utc": 1368539947,
        "upvote_ratio": ""
    },
    {
        "title": "White fence.",
        "author": "Felinefriently",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1e9rar/white_fence/",
        "text": "Im sitting in my school bus, going through the usual route we take to get to the drop off point.\rWhile looking out the window gazing off into the distance I notice the same metal white fence we drive by every day on the way to the drop off school about nine miles out,but, this time the fence wasn't behaving like a fence. It was flapping about like a tarp.then i blinked and it was back to its average metal fence-ness.any explanation?i figured this would be the subreddit to put this in.",
        "created_utc": 1368480479,
        "upvote_ratio": ""
    },
    {
        "title": "Second time this has happened...",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1e5gks/second_time_this_has_happened/",
        "text": "I watch a lot of NBA basketball on tv, and I am currently watching the OKC v. Memphis game.  There was about 1 minute 30 seconds left in the half, and literally 1 second later there's 18 seconds on the clock.  I thought maybe my tv skipped but I had the live score up on my laptop that I was just look at too.  My eyes feel a little hazy so maybe I fell asleep for a second? But that never happens to me, I'm not even tired.  \nIt actually reminded me that this exact thing happened last year when I was watching a game on tv.  I'm watching it and suddenly the game is a minute ahead of where I was watching.  \nStrange glitch or do I need to call the cable company lol? ",
        "created_utc": 1368310601,
        "upvote_ratio": ""
    },
    {
        "title": "It happens EVERY time.",
        "author": "aarjaysee",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1dt74o/it_happens_every_time/",
        "text": "My girlfriend and I live with my mom, in a suburban area, in a group of townhomes.  Whenever I leave or come home, as I turn onto the highway (4 lane with center turning lane) there is a street light that turns off.   This happens every time I go by it.  It doesn't matter if I'm in my car, my girlfriends car, or on my bike.  It turns off every time right when I pass it.",
        "created_utc": 1367868887,
        "upvote_ratio": ""
    },
    {
        "title": "1387",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1ds7bs/1387/",
        "text": "Me and my roommate are writing papers, and he just opened a file that had some information pertaining to his paper. It was quite a bit longer than what he had written for this paper, and he tried to trick me. He said \"hey Bianchibmx, look I have 1387 words written\" (the number of words in the document) As it turns out, the wordcount of the paper I'm writing right now, is 1387 words.",
        "created_utc": 1367830634,
        "upvote_ratio": ""
    },
    {
        "title": "Portal creation glitch pics The objects it produces so far",
        "author": "McpeHax00r",
        "url": "http://imgur.com/w8pN7eg",
        "text": "",
        "created_utc": 1367455698,
        "upvote_ratio": ""
    },
    {
        "title": "Portal/ matter creation glitch pics",
        "author": "McpeHax00r",
        "url": "http://imgur.com/w8pN7eg",
        "text": "",
        "created_utc": 1367426694,
        "upvote_ratio": ""
    },
    {
        "title": "Portal/ matter creation glitch",
        "author": "McpeHax00r",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1dgfb2/portal_matter_creation_glitch/",
        "text": "So a couple weeks ago u was in my room, and I noticed that some things that I've never bought or been given were appearing in this cabinet \nSo I think nothing of it until the next day more stuff is in it! Like rocks toys, books, all random stuff \nAny explanation!",
        "created_utc": 1367374903,
        "upvote_ratio": ""
    },
    {
        "title": "A mild case of teleportation",
        "author": "mrkeked",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1d6bqx/a_mild_case_of_teleportation/",
        "text": "Okay, for this one, you have to assume that all that I'll describe is absolutely and unequivocally true. It has been a long time since it happened and many people tried to disprove or find alternate explanations for this, but they all fall under the \"maybe you're not remembering things right\" category. I distinctly remember thinking at the moment it happened that I would never be able to explain this. Okay, so here we go:\n\nWhen I was still living at my parents', we lived in an apartment with an underground garage. There is one entrance on the ground level for the main hall and a garage door that is opened with a clicker. On the parking level, there is another door, which opens with a separate key. The flat itself has a third key to get in, of course. None of these can be opened from the outside without a key.\n\nOne day, I arrived home, parked my car in the garage, went up to our flat and got in. There was no-one there. A couple of hours later, my dad arrived and, shortly after, I wanted to go out. However, I couldn't find my keys. I had my car key, but my house keys were nowhere to be seen. Since time was going by and I was starting to be late, I decided to leave, since I knew my dad would be in to open the door. I thought \"I'll find them later.\" I went down to the garage, into my car, and behold, my house keys were inside.\n\nNow, how did I get in the house?",
        "created_utc": 1367007165,
        "upvote_ratio": ""
    },
    {
        "title": "Name coincidence or I'm incredibly psychic",
        "author": "CHRISTINAK1980",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1d3y62/name_coincidence_or_im_incredibly_psychic/",
        "text": "I'm adopted (closed adoption).  My adoptive parents named me Christina Janelle - my Dad saw my name in a dream.  In 1998 I had my son Zach Tyler.  In 2001 I had my daughter.  We weren't entirely sure she was a girl so we had two names picked out - Portia for a girl and Nathan James for a boy.  A year after Portia was born I found my birth family.  My birth mom's name is Janel and she (at the time) was dating/living with a man named James.. I have twin siblings (two years younger than myself) - who go by their middle names - Tyler and Nicky.  Their legal last name is Zack - my sisters first name is Kristen.  And my youngest brothers name is Nathan...  Its not a ghost story like so many stories on here but it is wierd...and it freaked out everyone in my family.",
        "created_utc": 1366924447,
        "upvote_ratio": ""
    },
    {
        "title": "Name coincidence or I'm just entirely psychic",
        "author": "CKOSTICK1980",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1d3x94/name_coincidence_or_im_just_entirely_psychic/",
        "text": "I'm adopted (closed adoption).  My adoptive parents named me Christina Janelle - my Dad saw my name in a dream.  In 1998 I had my son Zachary Tyler.  In 2001 I had my daughter.  We weren't entirely sure she was a girl so we had two names picked out - Portia for a girl and Nathan James for a boy.  A year after Portia was born I found my birth family.  My birth mom's name is Janel and she (at the time) was dating/living with a man named James.. I have twin siblings (two years younger than myself) - who go by their middle names - Tyler and Nicky.  Their legal last name is Zack - my sisters first name is Kristen.  And my youngest brothers name is Nathan...  Its not a ghost story like so many stories on here but it is wierd...and it freaked out everyone in my family.",
        "created_utc": 1366923740,
        "upvote_ratio": ""
    },
    {
        "title": "Hearing a weird scream twice. Posting this in the right spot.",
        "author": "WindmillDragons",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1cngh1/hearing_a_weird_scream_twice_posting_this_in_the/",
        "text": "Somebody made a thread about \"glitches\" and I wrote this. Then someone posted about this sub.\n\n\nOne time back when I was in high school, I stayed home watching Firefly for the first time. I was powering through the series because the movie was coming out Friday. One of you can look up the year this happened.\nI was watching my perfectly legal copy on my computer on the main floor when I thought I heard a noise coming from upstairs. No one was upstairs. I paused the video, and listened.\nIt sounded like footsteps. But my house always sounds like there are random footsteps. I live near the water, and my understanding is that with all the sand in the soil, the houses settle more.\nI listen to the footsteps and try to play the dangerous game of \"Burglar or House\" when I hear a scream from upstairs. Well, it sounded like a scream.\nThere was something off about the sound. I couldn't place what was wrong, but it was wrong enough that I doubted what I heard. So I stayed downstairs, eyes trained on the stairs. My parents came home soon after and I didn't hear anything else and kinda moved on. I figured I worked myself up.\nThe next day I stayed late at school for some reason and needed to call my mom to come pick me up.\nI speed dialed home and instead of the typical connecting rings, I heard the same scream.\nI also realized what was off about the sound. It sounded computerized. Like a scream recorded in low quality.\n\nTL;DNR Was home alone and heard a weird scream that I would hear again calling home the next day",
        "created_utc": 1366337041,
        "upvote_ratio": ""
    },
    {
        "title": "Pinch Me!",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1ckdu3/pinch_me/",
        "text": "This happened twice when I was about 14 years old. Ever heard people say, \"Pinch me, I must be dreaming!\" Well, these two times I was having a really strange dream (and me remembering my dreams is VERY rare; I hardly ever wake up knowing what I dreamt), and at a certain point in the dream where everything sort of halted and collected itself, I said aloud in the dream, \"Pinch me, I must be dreaming!\" And I actually woke up immediately. Never happened again.",
        "created_utc": 1366238716,
        "upvote_ratio": ""
    },
    {
        "title": "I've been noticing really weird things lately...",
        "author": "ForgetMeWhenImGone",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1ck1je/ive_been_noticing_really_weird_things_lately/",
        "text": "So over the past few months things have been just disappearing and reappearing in weird places, things I haven't seen or touched in months. For instance, I had a pair of pants in which I ripped a massive hole in the crotch area. Today I decided to patch it, but it was completely gone, like it was never there in the first place (I know it's the same pair of pants). I also lost my external hard drive and have been searching for it for months. I have been sitting at my desk and using the keyboard slide part as a dinner table since then. I opened it yesterday and found that drive that's been missing for months. Things seem to be jumping through time too, because my room mate lost a thing about a month ago, and about a month later said thing appeared in the same place on my desk in December. I am kinda freaked out so sorry about the poor phrasing where it exists.",
        "created_utc": 1366230143,
        "upvote_ratio": ""
    },
    {
        "title": "Obvious photoshop widely accepted as \"poor camera work\" (xpost r/mildyinteresting)",
        "author": "sUpErLiGhT_",
        "url": "http://www.reddit.com/r/mildlyinteresting/comments/1chi7t/my_friends_engagement_picture_looks_like_they_are/",
        "text": "",
        "created_utc": 1366197752,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for \"The Voice\"",
        "author": "noyouretaken",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1cf2f4/looking_for_the_voice/",
        "text": "I'm looking for a link posted here god knows how long ago; it was to a soundcloud post titled \"The Voice\". I've searched through all my saves and all of my bookmarks and I simply cannot find it, but maybe one person on here still has the link. Who knows maybe even OP will see this. Thanks in advance!",
        "created_utc": 1366063356,
        "upvote_ratio": ""
    },
    {
        "title": "So, possibly the craziest coincidence in history occurred...",
        "author": "funkym0nkey77",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1cdpxs/so_possibly_the_craziest_coincidence_in_history/",
        "text": "I am still trying to make sense of this, my dad told me this yesterday.\n\nFirst off, I live in a small town in England with a population of about 20,000. Not many people. My dad bumped into someone he used to work with the other day, and started talking about coincidences. She said she had one that was unparalleled to anything else.\nHer daughter was born in my town, but moved to Australia as a young adult. She was in a restaurant (in Australia) with a friend, and they started talking about my town, where she used to live. She started talking about a bank she used to work at, and recalled a family that were frequent customers at the bank. She remembered the son the most, and started talking about him (let's call him John). The guy at the next table leans over and says \"Holy shit. I know that bank. I'm John.\" They started talking and IT WAS THE GUY! In Australia! Who she knew from a small town in England years ago, and they were sitting a table away from each other, and she talked about him at that time. What are the odds?\n\nTLDR: People who knew each other in England bump into each other in a restaraunt in Australia more than 20+ years later.  ",
        "created_utc": 1366018987,
        "upvote_ratio": ""
    },
    {
        "title": "Sweet dreams. Came true.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1cawmt/sweet_dreams_came_true/",
        "text": "So i went to visit my fam in Ohio. I watched pulp fiction for the first time and i fell asleep. So i had a dream me and my family went to the mall there in Ohio. In dream, i walked into a store I remember seeing a round rack of colorful leggings. And on the way home my mom says \"oh, i got you something\" and pulls out a pack of colorful hair bands.\n\nNext day my fam decides to go to the mall. We go, i see the store with the colorful leggings just like in the dream. No biggie. So my cousin and i go to the Cinnabon and get on line. The teenager working at the counter immediately starts starring at me.  And when we get to the register he says \" have you ever seen pulp fiction?\"   And i say yeah last night actually and he gets a weird smile on his face and says \"sweet dreams\".   \n\nAs we walk away my cousin says \"wth, that was weird.\"  I agree, i was weirded out by it. It left me in a fog and on our way home my mom says \"oh, i got you something.\" I knew what it was and she pulled out a pack of colorful hair bands.  ",
        "created_utc": 1365903648,
        "upvote_ratio": ""
    },
    {
        "title": "My mind apparently sent a text.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1c3m31/my_mind_apparently_sent_a_text/",
        "text": "I'm not sure if this belongs here, but this freaked the hell out of me. I was playing Skyrim literally 30 minutes ago. My friend texted me \"basketball tonight?\". Usually I respond \"who's going?\". I was playing skyrim so I didn't wanna stop the game. Literally, 20 seconds later he texts me \"Idk yet\". I was thinking to myself, he sent that to the wrong person because I haven't replied yet. So I get my phone and go respond to him. Apparently, I already did send the text \"who's going?\". I KNOW for a fact that I didn't, because I know thinking to myself I didn't wanna stop playing skyrim. I read the text preview from the iphone, so if I did respond, I would have to enter my passcode and then text that. I KNOW for a fact that I did not enter my passcode in. Did my mind send that text (I usually always send that text), or did I just totally blank out and not remember a) sending that text b)stopping skyrim c) entering my passcode all within the span of 30 seconds. Freaked me out. ",
        "created_utc": 1365638258,
        "upvote_ratio": ""
    },
    {
        "title": "Why This Sub Pisses Me Off, or, IS ANYONE ELSE OUT THERE??",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1bwgn8/why_this_sub_pisses_me_off_or_is_anyone_else_out/",
        "text": "I joined not because I wanted to submit anything, but because I wanted to see if anyone was saying the kind of stuff that was like what was going on with me. Instead, it's a bunch of \"when I was a kid\" or \"My watch was set wrong\" or a bunch of other serious stretches for anything approaching glitches. I don't have glitches, I have freaking giant banner ads. And it sucks and makes me feel crazy, and I just want to feel not alone. Things in my life have gone way past serendipity and synchronicity into predictability. It used to just be phones. I'd think of someone and they'd call a moment after, or I'd pick up my phone to text someone and it'd buzz in my hand with a message from them. Then it was fortune cookies, which I thought was just silly. Then the dreams started and it wasn't so silly any more. They keep happening, and no, it's nothing apocalyptic, it's MUNDANE and SAD. I dreamt a friend would leave and he did shortly after, very suddenly, I dreamt of my second husband, I dreamt of jobs I never knew I'd work. Sometimes it's just bits of conversations I'm going to have, sometimes it's places I haven't been to yet, or people I haven't met. I dream boring things and then they happen. Fine. Then I started talking too much, apparently, because I pre-announced two celebrity deaths (Anna Nicole Smith and Michael Jackson) while talking shit about them while I was at work. I made some joke about them not being long for this earth, and then they died within 24 hours. That doesn't make me feel freaky and crazy at all. Now my sisters are texting me from across the country telling me they're thinking of me while doing the exact same thing I am (last one was listening to \"Aneurysm\" by Nirvana).\n\nI'm a fucking social hermit. I don't talk to anyone, I don't get out at all, very few people see me, I rarely talk to my family, and I'm still either receiving or broadcasting, or worse, getting peeks at the script. It makes me feel crazy, it's NEVER anything big or practical or useful, and it's been getting more frequent over the past 5 years. I just want someone to fucking say anything like this happens to them instead of stuff misremembered from being a kid. You guys are looking so fucking hard because you want to believe, believe this: it's not fun. It's not useful. It makes me feel like something impossible (yet incredibly boring) is happening, and that makes me feel isolated and nuts. I'm a fucking thirty-something walking glitch and it sucks. It's not a fun story, it's not nosleep material, it's just invasive and scary.\n\nANYONE ELSE???",
        "created_utc": 1365399044,
        "upvote_ratio": ""
    },
    {
        "title": "I believe you are looking for /r/Glitch_in_the_Matrix/",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1bqmrn/i_believe_you_are_looking_for_rglitch_in_the/",
        "text": "",
        "created_utc": 1365177434,
        "upvote_ratio": ""
    },
    {
        "title": "Sonic the hedgehog",
        "author": "Cellophane7",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1bn94q/sonic_the_hedgehog/",
        "text": "When I was younger, me and my friend were hanging out, taking turns playing Sonic for Game Gear. It was my turn, and I was hit by an enemy, and when the rings came flying out of my character, which, in case you never played it is what always happens when you're hit, one of them flew off the screen and seemed to hit me. I didn't feel anything, but both of us saw it. We spent the next 10 minutes hunting for it, or something that could explain it, but we couldn't find a thing.",
        "created_utc": 1365055434,
        "upvote_ratio": ""
    },
    {
        "title": "Questions about Deja Vu",
        "author": "Metalhead242",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1bigb8/questions_about_deja_vu/",
        "text": "I just read a thread where people said they would have dreams and years later it would come true and they knew what would happen next.\nthe same thing happens to me only when it happens i dont remember whats going to happen next but after it does happen its like my memory refreshes and i remember the dream exactly. is this deja vu or some kind of real visions coming true. it might just be my brain trolling me.",
        "created_utc": 1364907711,
        "upvote_ratio": ""
    },
    {
        "title": "Starfish in water trough ",
        "author": "wolverinesss",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1b1w7e/starfish_in_water_trough/",
        "text": "I literally found a starfish in my horses water trough. A real, live (or at one point) starfish. I live over 200mi from the nearest body of salt water in the mountains. ",
        "created_utc": 1364318795,
        "upvote_ratio": ""
    },
    {
        "title": "Ok so this literally happened less than a minute ago and i wanna post it before i forget the details.",
        "author": "Suckmydongha",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1aukof/ok_so_this_literally_happened_less_than_a_minute/",
        "text": "I felt something moving very slowly on my leg. This is quite normal and i usually just ignore it because it always goes away after a few seconds. (i think its a small harmless spider that lives on the ceiling under my table). After about a minute its still there moving at a snails pace. It was still there after a minute, so this time I quickly reach down and grab it between my pinky and ring finger. I can feel that its quite a soft bug, not hairy, i couldnt feel any details like legs or anything... just felt like a hairball tbh(Hairballs feel different to hairy spiders &gt;.&lt;). Also it felt about as big as 2cm by 1cm, relatively big for y'know... household insects.\n\nI felt all this in a timespan of about one second because as soon as i felt it was soft i freaked out, retracted my arm from under the table and threw whatever it was on my table as fast as i could. As soon as i threw whatever that soft bug was onto my table nothing was there... There was no sound of wings, scuttling of legs or anything hitting the table... wtf.",
        "created_utc": 1364022310,
        "upvote_ratio": ""
    },
    {
        "title": "Deja vu dreams?",
        "author": "RyanTheKoolCat",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1atek0/deja_vu_dreams/",
        "text": "(Forgive me if I misspell anything as I am typing this on my phone) \nSo do these déjà vu dreams ever happen to any of you guys? Every once In a while I will have a very real dream about something that matters little (ex: picking up a pen or moving a chair). Usually I will dream the event and it could be anywhere from a week to months to a yer later that I will have almost a whole minute of déjà vu happening. I can't try to change what happens because that's what happened in the dream and its what will happen no matter what I do.... Do you guys ever experience this?( again I am sorry for any spelling errors touchscreen keyboards are a bitch)",
        "created_utc": 1363980059,
        "upvote_ratio": ""
    },
    {
        "title": "Premonition?",
        "author": "Archerdude96",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/1arbeo/premonition/",
        "text": "Okay, so I know this is kind of a silly scenario, but bear with me.\n\nSo in 9th grade, our class went down to the Library, as was customary to discuss \"new books\" or whatever. We went down once a month or so. Now, when you first walk into the library, the front desk is on the left and there is a sort of conference room in the back. On this particular trip to the library, we passed the front desk and went straight back to the conference room area, where the librarian started speaking about a jellybean counting contest. As soon as she said those words, the number 843 jumped into my head, completely out of nowhere, and I had not so much as glanced at the jar of jelly beans that were to be counted. I put this number into the drawing, and when the drawing day arrived, i was so completely sure that I had guessed correct. I had, off by a single bean. I wish I could say this has happened again, but alas, its the only instance of premonition or psychic whatever that I have had so far.",
        "created_utc": 1363901506,
        "upvote_ratio": ""
    }
]