[
    {
        "title": "‘Bart the Zombie Cat’ claws way out of grave",
        "author": "FrowsyCompromise",
        "url": "http://fox8.com/2015/01/27/walking-dead-kitty-bart-the-zombie-cat-claws-way-out-of-grave/",
        "text": "",
        "created_utc": 1422492989,
        "upvote_ratio": ""
    },
    {
        "title": "Amethyst moved on its own",
        "author": "m_queen",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2txy8n/amethyst_moved_on_its_own/",
        "text": "So I have quite a few stones/crystals that I collect, which I put on the windowsill to charge by the moon overnight.\nI had all of them lined up one night, when I decided to go get some takeout. I come back and just the amethyst is out of line, and I have no explanation at all!\nI've read somewhere that they have a lot of power and sometimes move on their own but wtf never really believed THAT much!",
        "created_utc": 1422431213,
        "upvote_ratio": ""
    },
    {
        "title": "Amethyst moved on it's own",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2txwdc/amethyst_moved_on_its_own/",
        "text": "So I have quite a few stones/crystals that I collect, which I put on the windowsill to charge by the moon overnight.\n\n I had all of them lined up one night, when I decided to go get some takeout. I come back and just the amethyst is out of line, and I have no explanation at all! \n\nI've read somewhere that they have a lot of power and sometimes move on their own but wtf never really believed THAT much!",
        "created_utc": 1422429703,
        "upvote_ratio": ""
    },
    {
        "title": "Random Floating Ball",
        "author": "johnd101",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2tximn/random_floating_ball/",
        "text": "I remember once when I was around 3-5 years old, I went to a hotel with my family for some reason. I remember my mom leaving the room to do something, while she was gone, the rest of us played I spy out of the window, while looking I saw a ball with a black and white zigzag pattern floating in some weird pattern, but no one else saw it when I pointed it out, I looked away and then looked back to find that the ball disappeared. \n\nTL;DR: Zigzag pattern ball floating outside hotel room, it disappears.",
        "created_utc": 1422420877,
        "upvote_ratio": ""
    },
    {
        "title": "A strange glitch during class.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2tu2rn/a_strange_glitch_during_class/",
        "text": "Maybe not a glitch, maybe just my shitty hearing. But who knows. Anyway, I was sitting in class, one earphone in my right ear, listening to some pretty loud music. I see another students hand go up. But then, I see his lips moving, but he's silent, I can't hear him. But a couple seconds after I hear my teacher saying something which seems to be a response to the student (it was about algebra) Strange.... I could hear the teacher but not the student, he was closer to me than the teacher was, I don't know what's up haha.",
        "created_utc": 1422362647,
        "upvote_ratio": ""
    },
    {
        "title": "How?",
        "author": "[deleted]",
        "url": "http://i.imgur.com/iC7apht.jpg",
        "text": "",
        "created_utc": 1422342569,
        "upvote_ratio": ""
    },
    {
        "title": "Helpful encounters",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2ts8h5/helpful_encounters/",
        "text": "I've got an exam tomorrow, so I'll be brief on the examples, but I've been observing a phenomenon for a while and it has become clear to me it is something real. \n\nIn this age of social media every now and then some person \"bothers\" me only he wants nothing from me. He initiates a conversation (a brief one) that goes naturally like it's gonna develop into a normal conversation (where you talk for about a vast number of things). What happens next is he's gonna say smth to me very relevant to my life. This something is always part of one of these categories:\n\n1. An answer to a question I've been having for a long time and stopped trying to figure it out.\n\n2. A very good advice\n\n3. A warning\t\n\nThis also happens in real life encounters. What amazes me is that the conversation would usually stop exactly after that. Also, usually I would not see or talk with that person after that ever again. It's like his purpose c'est fini. \n\nInterestingly, at number three usually it isn't even a phrase more of a look. They would send me a very weird look in a context and that's it. That's the warning. That \"context\" will happen to me and I have to be careful not to do what we were talking about when he gave me the look or just remember it. It's like some of these people man, I don't remember nothing I ever talked or did with them except for that creepy look and what we were talking when he/she gave it to me.\n\nWhat do you think?",
        "created_utc": 1422318883,
        "upvote_ratio": ""
    },
    {
        "title": "I truly have no way to put this into context...",
        "author": "thistrinket",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2tq3fw/i_truly_have_no_way_to_put_this_into_context/",
        "text": "When I was 4 years old, we lived in a small town and I had earned the right to walk around the block holding hands with my 4 year old friend unaccompanied by my mother. We took our privilege seriously and never strayed from our route (I'm sure my mother 'timed' us). When we rounded the second corner, we knew we were getting close to the church steps. We always made a habit of climbing to the top stair, sitting for a few moments and looking at the world from our elevated vantage point before we descended and continued on our way.\n\nOne day, as we approached the church, we saw a GIANT insect (twice the size of a man) sitting on the top step. We both stopped for a moment and looked at him, but for some reason neither of us felt afraid. We climbed the stairs and my friend and I sat on either side of the bug man. His antennae undulated slowly on top of his head. His top two arms were pulled close to his chest and moved slightly as well. I could see a slight translucence where the sun shined through his brown exoskeleton. He never spoke, but I knew he was aware we were there. My friend and I stayed no longer than usual, made eye contact and ran down the stairs at the same time. We grabbed each others hand and ran home to tell my mother about the giant bug man.\n\nWhen we burst through the door of my house, we breathlessly told the story of The Giant Bug Man sitting on the church steps to my mother. We begged her to go back and see him with us, but of course, she was busy making dinner and brushed our 'imaginary' urgent pleas aside. Ultimately, she sent my friend home early and I was threatened with no dinner if I didn't shut up about it.\n\nMy friend and I always talked about the 'bug man', but never again in front of adults. I moved away from the neighborhood and lost contact with my childhood friend. My mother has no memory of that afternoon.\n\nI am well into adulthood and I SWEAR it was real. \n\n",
        "created_utc": 1422284307,
        "upvote_ratio": ""
    },
    {
        "title": "ski helmet glitch.",
        "author": "eddie08",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2too5t/ski_helmet_glitch/",
        "text": "I was skiing with my class this past Friday (23rd of January, 2015) and my friend frank and I went to the chalet. we got there and wills friend micheal, and, his girlfriend, suzie were sitting at our table. whatever, we know them so we dont mind. We take off our helmets and go to get fries. We come back, and franks helmet is missing! We look under the table, franks backpack, asked other people, checked other table and even looked in the kitchen. Nowhere to be found! Micheal and Suzie both say they didn't notice it go missing. So frank gets a new one from the rental shop.\n\nfast forward\n\nTime to go home, and frank returns his rented helmet and hops on thee bus. There, on the f*cking seat, is franks helmet.\n\nEdit: just wanted to mention, names changed for privacy.",
        "created_utc": 1422242962,
        "upvote_ratio": ""
    },
    {
        "title": "I found a ring that was lost two years ago, in an impossible place",
        "author": "Manggo",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2tigiy/i_found_a_ring_that_was_lost_two_years_ago_in_an/",
        "text": "Three years ago, my girlfriend moved into my apartment. That year for Christmas, I got her a ring. Nothing too expensive, but nice. About a year later, she misplaced it after taking it off. We turned the entire apartment upside down and could not find a trace of it anywhere. We kept an eye open for it every day. \n\nFast forward a few months, we break up. She moves out, never see her again. \n\nTwo years pass, with a lot of new furniture, new clothes, new friends and others passing in and out of my apartment for various reasons. \n\nThree weeks ago, my close friend left the country, and I decided to move out of my apartment, and into hers. I packed most things up, leaving behind old furniture and old clothes for whoever may want them. \n\nA few days after the move was completely finished, I put on a coat I had recently bought, and checked my pocket to throw out whatever receipts I had in there (I always shove coffee receipts and whatnot into my pockets), and feel something thin and round. I thought it was a part of my keychain that had come off. \n\nIt was the lost ring. Two years after it vanished. In the pocked of a new coat. In a new apartment, previously owned by a friend whom I didn't even meet until a year after losing the ring. \n\nI'm still pretty confused. I have it in a box now, probably looking to sell it. Or keep it as some kind of good luck charm. \n",
        "created_utc": 1422108277,
        "upvote_ratio": ""
    },
    {
        "title": "Every day, for the past year, I have randomly looked at the clock when it is 23:37.",
        "author": "SirDolphin",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2tiaaj/every_day_for_the_past_year_i_have_randomly/",
        "text": "9/10 times, it's 23:37. Sometimes it's 22:37 or 23:38, but it's always at that sort of time. I have no idea why.",
        "created_utc": 1422102297,
        "upvote_ratio": ""
    },
    {
        "title": "Even The Matrix has trouble with physics (x-post from /r/GamePhysics)",
        "author": "TheOnlyMrYeah",
        "url": "http://gfycat.com/ForsakenWeightyCuscus",
        "text": "",
        "created_utc": 1422034446,
        "upvote_ratio": ""
    },
    {
        "title": "I heard the song \"Take Me To Church\" years ago.",
        "author": "sharpieinyourshirt",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2tbm5o/i_heard_the_song_take_me_to_church_years_ago/",
        "text": "I swear, I've heard that song years ago! That's why I know the lyrics, because it was a song I kind of grew up on. You know, when you've been hearing a song for years so you just naturally pick up on the lyrics? That's the only way I *could* know the lyrics because I never took out personal time to listen to the song, I would just hear it randomly. When I looked up the year it came out, I was freaked out. The reason I looked it up in the first place was because it suddenly blew up and I was just like \" Dude, why are y'all freaking out about this now when the song has existed for like, ever.\" Freaky.\n\nEdit: sorry for not responding sooner. I was very busy with other things.",
        "created_utc": 1421957002,
        "upvote_ratio": ""
    },
    {
        "title": "Full mind blow, just happened now.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2t85r6/full_mind_blow_just_happened_now/",
        "text": "I chopped up an apple and mixed it with yogurt as a dessert after dinner and when I went back to my room and started eating it (while watching Parks&amp;Rec) , there was one piece of apple that had the same form as all the other (cubic), but was orange. So I sucked the yogurt away from it and it was no apple. It was more like Japanese persimmon. But I don't even have Japanese persimmon. Weird as fuck. I ate everything though. \n\nEdit: BTW I also found a second piece of persimmon but that was it. Nothing but apple and two pieces of persimmon. ",
        "created_utc": 1421882407,
        "upvote_ratio": ""
    },
    {
        "title": "The Vanishing Pinball",
        "author": "hoyaguru",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2t5lvt/the_vanishing_pinball/",
        "text": "This happened about 26 years or so ago, give or take, and I still think about it once in a while. Everything here is completely true.\n\nYears ago, I was in the military, stationed in a remote base in the Australian Outback. It wasn’t really like a normal base, it was a small town in the middle of nowhere, totally self contained. All of the civilians in town worked in support of the military, from the barbershop to the stores and bars. There was a bowling alley for entertainment, but not much else, and this was back before the internet was a thing, so to say it was pretty boring out there is an understatement.\n\nThere was one small store there, kind of like a cafe, where you could get some fairly decent food to eat there, or “take away” (if you said you wanted it “to go”, they would just stare at you, they didn’t use that term in Australia). It was here that me and several other people saw the impossible happen.\n\nThey got a new pinball machine in the cafe one day, which was very popular for quite a while. I would play it every time I got something to eat. It was a fairly hard core pinball machine, it had two levels, lots of action, multi-ball, and a high score that was so far above anything I had ever reached on a pinball machine that I thought it would be impossible to beat it. So, having nothing better to do, I decided to learn every secret to the game, everything that had to be hit and in which order, how to get all of the bonuses, and so on. For months, that pinball machine was my mission.\n\nI got to know the teenagers and other military personnel who hung out at the café, we would play against each other often, and everyone soon became aware of my obsession. If they found something new, they would share it, and we’d have tournaments every weekend. Eventually I got better, and starting racking up some really high scores, but after a couple of months I was literally billions of points away from beating the high score. I figured it had to be fake, there was no way someone could get a score that high legitimately.\n\nAnd then one day, I literally had the game of my life. My first ball must have lasted 45 minutes or so, and I had beaten my previous highest score before I lost it. A few of the regulars had come over to watch, and when I lost the ball, the way they acted, you would have thought someone had just fumbled the winning touchdown in the end zone. I took a break, very happy with what I had done, but I figured now I would go back to playing like I normally did, and go home with a new personal record. And it seemed I was right, when I lost the second ball less than 3 minutes after I pulled the plunger. I had the maximum number of free balls after that miraculous first ball though, and the next two balls lasted a good 35 minutes or so.\n\nBy the time I got down to my last ball, I could see that breaking the record might be a possibility. By now there were about ten people crowded around the machine, commenting, oohing and ahhing when I got a really hard combo or kept a multi ball going for a long time. Honestly I felt kind of ridiculous, I’m usually not someone who likes being the center of attention, and this was feeling like some cheesy 80’s movie. I nervously started the last ball, and lost it just a few seconds after it hit the table. Luckily, this machine had a feature that shot out a free ball if you lost yours within a certain time, but it was a close thing as to whether I had lost the ball within that time. I swear you could have heard a pin drop, I think everyone watching had held their breath for the second or so the machine needed to either show my final score, or spit out the free ball. When the ball shot out, everyone started laughing, realizing how engrossed they all were in a silly game of pinball.\n\nSo I was back in the game. Everything was going well, but it was hard not to keep glancing up at my score, and trying to figure out how much I was going to make in bonuses. And finally, I got to the point where I knew that, even if I let go of the flippers and lost the ball on purpose, I would have the record. With that relief, I decided I didn’t want to just break the record, I wanted to shatter it! At that moment, the ball came down, and I tried to hit it up onto a ramp that would bring it up to the second level. I hit the ball with the flipper, but it was a little off, I knew it was going to hit just a little left of the ramp I was trying for. The ball went about three quarters of the way toward the back of the machine, and…vanished. Nothing. No bells or lights going off, no sounds from anywhere in the machine, the ball just wasn’t there any more. Everyone looked at each other, then they all looked at me, as if I had just performed a magic trick at the worst possible moment, and they were wondering why I would do that. I looked at my score, and I was less than a million points away from the high score. With my bonuses, I would make easily a half a billion points, but I would have to lose the ball to collect the bonus. After a few seconds of stunned silence, everyone started freaking out, trying to look in the machine from every angle to find the ball, in the hopes that if it were stuck, I could jiggle the machine and get it going again. But there was really nowhere for the ball to get stuck. And still, no sign of the ball.\n\nOne of the crowd got the owner of the café to come over, and we explained the situation. I hoped that maybe he could get the game open, but he said he didn’t have a key to it, it had to be serviced by the company who had brought it out. He said he would call them, but it would take them 2 or 3 days to come out (we were about an 8 hour drive from the next closest city, where the game came from). So, with no other alternative, the only thing I could do was to jiggle the machine and try to dislodge the ball. I started out barely nudging it, knowing that it I hit the machine too hard, it would tilt. If the machine tilted, it would lock the flippers, but worse, it wouldn’t add on the bonus score I had accrued. I nudged it harder and harder, from different angles, but no ball came out. Finally, I hit it just a little too hard, the tilt buzzer went off, and that was the end of that. My dream of breaking the impossible score had been within my grasp, I could have literally walked away from the machine and still beat it, but it was not to be. I put my initials next to the second place score, walked to the nearest bar, and proceeded to get hammered.\n\nYou can be damned sure I was at the café when the technician came out to fix the machine.\n\nThe owner had unplugged it that night, and put an “out of order” sign on it. No one in the town had a key that would open it, as far as I know, and no one really had a reason to open it, so I’m convinced that it was exactly as it was that night when the tech got there. He opened up the front of the machine, and took out the balls that were in the ready position for the next player, and one was missing. By this time, I had explained the whole situation, which I could see he wasn’t totally believing. He then proceeded to take the whole glass top of the machine, leaving it completely open. I showed him exactly where the ball had gone up, and the exact spot where it had vanished, but he confirmed that there was just nowhere in that part of the machine for the ball to fall into, jam on, or hide behind. He brought out one of those heavy duty black flashlights like they used on “The X-File”, and searched every part of the playable area, stuck his hands into every crack and crevice. He even got a heavy duty magnet on the end of a telescoping rod that he poked everywhere, but came up empty. Now it seemed that he was starting to believe me. He then proceeded to systematically tear the thing apart, and did a super thorough exam of every piece of the machine, but again, there was no pinball.\n\nHe finally gave up, put the whole thing back together again, put a couple of free credits on it for me, and left. I gave the free games away. I knew I’d never have a game like that again. I felt like it was some cosmic joke on me, some deity deciding I didn’t deserve this small victory, and if it happened once, why not a second time?\n\nI never played the game again. It was swapped out about a month later for a lame fighting game, and my high score (2nd place) went with it to parts unknown. I still think about it from time to time, whenever I hear someone talking about something being “impossible”, or seeing a “miracle” happen. I don’t bother telling them about the vanishing pinball, who would ever believe me?",
        "created_utc": 1421832050,
        "upvote_ratio": ""
    },
    {
        "title": "A 23-year-old student was trapped in a déjà vu time loop for 8 years... anxiety and LSD involved [x-post from /r/interestingasfuck]",
        "author": "Delicate-Flower",
        "url": "http://www.reddit.com/r/interestingasfuck/comments/2t3iw1/a_23yearold_student_was_trapped_in_a_d%C3%A9j%C3%A0_vu_time/",
        "text": "",
        "created_utc": 1421825468,
        "upvote_ratio": ""
    },
    {
        "title": "For once, this kind of thing happened to me.",
        "author": "MoistCashew",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2sueil/for_once_this_kind_of_thing_happened_to_me/",
        "text": "To give a little back story, I have 2 tennis rackets, one blue and one yellow. The blue one is my old one and serves only as a backup. The yellow one is the racket I play with. \n\nSo right before my tennis match, and I noticed that my [shock absorber] (http://i.imgur.com/JRux891.jpg) had fallen off of my yellow racket, presumably at the previous tennis club I played at. It was a Wilson logo. I thought nothing of it, as they are easily replaceable. I asked my coach for a new one, and he gave me a yin-yang designed new one and I played the match.\n\nAt the next match I played, I took my yellow racket out of my bag. I looked down at my shock absorber. \n\n*My old, Wilson logo shock absorber was back on the racket. The new, yin-yang one was gone.* \n\nI walked over to my coach in confusion, and asked him what he made of it. He had no idea. \n\nI kind of forgot about it, until I went to check my backup racket, which had been sitting in the same bag that it had been for the past few months. What do I find when I unzip the dusty bag?\n\n*It had the yin-yang on it.*\n\nAt this point I start freaking out, and ask anyone who could have possibly been playing a trick on me. Nobody has any clue. \n\nDo you guys think this is a \"glitch in the matrix\", or could there be a logical explanation? I am eager to hear your thoughts. \n\n**TL;DR**: Tennis racket shock absorber vanishes, re-appears, and its replacement shows up on my old racket in the garage.",
        "created_utc": 1421601718,
        "upvote_ratio": ""
    },
    {
        "title": "A jet engine fell in my room and I woke up in a golf course with sharpie on my arm",
        "author": "linkandcommentkarma",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2ss0kx/a_jet_engine_fell_in_my_room_and_i_woke_up_in_a/",
        "text": "I had a weird nightmare that lead me to sleepwalking now im here. I got saved by it. weird. still no news on where it came from.\n\nEDIT: This happened in Middlesex",
        "created_utc": 1421536148,
        "upvote_ratio": ""
    },
    {
        "title": "I saw this gif years ago, but what happens in it only happened this year...?",
        "author": "chaotic_david",
        "url": "http://i.imgur.com/RmeRd7b.gif",
        "text": "",
        "created_utc": 1421390381,
        "upvote_ratio": ""
    },
    {
        "title": "Story about a CD disappearing off a shelf (Black Hole)",
        "author": "zero86sk",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2scf5j/story_about_a_cd_disappearing_off_a_shelf_black/",
        "text": "My 1st post here. Decided to share something that has always bothered my brother and I. This happened arround 2002.\n\nWe used to have a room in a different part of the house when we were kids. (We live in an appartment building)\n\nWe had this custom burned CD full of games and Sims 1 mods. With a custom made cover and CD lable and everything. We put it down in a certain spot in the shelf. A minute later I realised I forgot to install one Sims mod I wanted so I ask my bro to hand me the CD over. It wasnt there. We thought it must have fallen off the shelf somewhere or something. We looked everywhere for it for months but nothing so we eventually gave up. \n\nWe called that spot of our room a black hole just for laughs. It became sort of an inside joke.\n\nAbout a year later (we dropped searching for that thing months ago) our parrents decided to move us to a bigger room. They moved every piece of furniture out of the room. (We decided to actually look if the CD still wasnt somewhere in the room, behind something, and nothing)\n\nI Also remember putting some small thing like a playing card or something into that spot monthes later and it also vanished.\n\n(Note) We know for sure no one took it or threw it out. Our mom even looked in every room for it and found nothing.\n\nWe still can't figure out what happened. It's 2015 and we still didn't find it. I doubt we ever will.",
        "created_utc": 1421195703,
        "upvote_ratio": ""
    },
    {
        "title": "My dog teleported",
        "author": "VintageSynth",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2s7rni/my_dog_teleported/",
        "text": "I always let my dog outside when I get home from school. So I let him outside and I went to use the computer for a bit. I heard a noise, so I thought my dog wanted back inside. So I opened the door, but I didn't see him. Usually he's right next to the door, but he wasn't there. So I called out for him. But then, he walked in from the living room. I didn't see him come in, and I am positive I let him outside. It was weird. ",
        "created_utc": 1421102600,
        "upvote_ratio": ""
    },
    {
        "title": "Goddamnit, this subreddit created a glitch in the matrix for me.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2s7pq5/goddamnit_this_subreddit_created_a_glitch_in_the/",
        "text": "Here I am, on my computer, when I remember the \"GlitchInTheMatrix\" subreddit. I navigate here and find the all-time top posts to reminisce. As I'm looking through the posts, I notice that none of the top posts look familiar to me. Not one story resembles anything I had previously read. I looked through like 4 pages of posts and became seriously concerned that the stories that I read a while back no longer existed and that I was crazy. I even searched for some key words that I remembered from those stories and got nothing. This is it, I guess, I'm in a new reality. \n\nTurns out there are two subreddits, this one and Glitch_in_the_Matrix. I'm starting to think it for this exact reason. Touché.",
        "created_utc": 1421101644,
        "upvote_ratio": ""
    },
    {
        "title": "I have the opposite of missing time ?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2s2eto/i_have_the_opposite_of_missing_time/",
        "text": "For instance for two days i was ahead a day ! \n( i thought it was thursday all day and half a night only to go to bed and wake up and go to work and its Tuesday ) i have this happen about twice a year . Wonder whats up . It sucks cause it never happens on weekend so i alwAys end up with an extra day of work !\n ",
        "created_utc": 1420991659,
        "upvote_ratio": ""
    },
    {
        "title": "Panorama Gone Wrong... Or Right(?)",
        "author": "A_12ft_200lb_Puma",
        "url": "http://imgur.com/53HAmw4",
        "text": "",
        "created_utc": 1420828699,
        "upvote_ratio": ""
    },
    {
        "title": "Elevator reflection glitch",
        "author": "alkaline810",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2rvivs/elevator_reflection_glitch/",
        "text": "I entered the building to my workplace this morning.  The elevator is around a corner, but because of shiny metallic walls I'm able to see a garbled reflection of a person entering the elevator and the doors closing right behind him.  I thought, \"great, now I have to wait an extra minute for him to get to his floor before the elevator comes back down to ground level to pick me up.\"  Seconds later I round the corner and push the button.\n\nThe elevator doors instantly opened with nobody inside.  WTF",
        "created_utc": 1420824841,
        "upvote_ratio": ""
    },
    {
        "title": "Could you guys try and help me figure out if we're living in a simulation or not? Here are some of my thoughts about the problem. : Glitch_in_the_Matrix",
        "author": "justonium",
        "url": "http://www.reddit.com/r/Glitch_in_the_Matrix/comments/2rq8tb/could_you_guys_try_and_help_me_figure_out_if_were/",
        "text": "",
        "created_utc": 1420709951,
        "upvote_ratio": ""
    },
    {
        "title": "Football games",
        "author": "rutrojan555",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2riqt9/football_games/",
        "text": "While I was in New Jersey I was watching the Wisconson Auburn game, and SportsCenter showed the highlights of the first half(halftime), but they posted the final score",
        "created_utc": 1420557984,
        "upvote_ratio": ""
    },
    {
        "title": "Light switch loop",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2rco4a/light_switch_loop/",
        "text": "Just now I was in bed, all other lights in the house got turned off by other occupants. I turn on my night light because I'm scared of the dark... I can't even relax with my eyes closed. I had to lean over to turn it on, I clearly remember turning it on and pulling sheets back up. I started thinking about how an Aquarium as a night light would be cool using Cavefish as they don't have day/night cycles (Aquariums is a hobby of mine). I also was doing maths with the numbers my clock displayed to clear my head. Few minutes later, I realised the light had been switched off at the plug. This happens all the time, especially with my electric blanket. My room also gets really cold suddenly every now and then. I thought I was just imagining these things but I'm 100% sure the light thing just happened now.",
        "created_utc": 1420419442,
        "upvote_ratio": ""
    },
    {
        "title": "Prediction about hospital room",
        "author": "X-3",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2r3dlq/prediction_about_hospital_room/",
        "text": "A little over a decade ago I had a vivid dream of visiting a hospital to see a friend. I had to get there at night and the journey was long. I can recall seeing the white lines on the highway go by and I could hear the clicks of the highway noise. \n\nWhen I arrived it was as if I was moved instantly to this dark area and doors were all around me - even above and below me. There were all kinds of doors - fancy doors, old wooden doors, wrought iron, brass and regular steel doors. Some of the doors were flat on the floor, I could enter them and I'd be standing upright.  I was intently looking for a room number and that number was 308.  I found the room, entered and there was my mystery friend I knew not, but I knew I was there to see them. They were a bit more than just a silhouette in a dark corner that I could not make out.  \n\nSuddenly I hear my name called and it's another friend of mine I do know.  He says my name and, \"It's so nice that you came to see me.  It makes me so happy.\"  His face was lit up, he was smiling and then just out of nowhere all emotion left his face, it got dark and he said \"308\". \n\nA few months pass and I have to go in the hospital.  I had a major surgery and in recovery they tell me as soon as I'm able to be moved they'll put me in a permanent room. So I'm groggy and I'm being wheeled down the halls.  The lights pass me overhead like the white divider lines on a major highway at night.  One wheel is wobbly on the roller bed and I can hear the tiles clicking by like I'm passing over a bridge.  It slows down, another nurse opens the door and she suddenly tells me \"Here we are.  Room 308\".\n\n",
        "created_utc": 1420198673,
        "upvote_ratio": ""
    },
    {
        "title": "Guys",
        "author": "theicywaffleman",
        "url": "http://i.imgur.com/8IYxjEl.png",
        "text": "",
        "created_utc": 1420141195,
        "upvote_ratio": ""
    },
    {
        "title": "Ever say something aloud while the TV is running in the background and someone on TV repeats the word you said?",
        "author": "Kcee101",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2qtq4w/ever_say_something_aloud_while_the_tv_is_running/",
        "text": "Happens to me all the time! Creeps me out.",
        "created_utc": 1419956951,
        "upvote_ratio": ""
    },
    {
        "title": "a stuck pixel in the matrix.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2qsyti/a_stuck_pixel_in_the_matrix/",
        "text": "Just happened right now. Looked at my door, saw two small square red dots. Darted around my eyes for a couple seconds, still there. One disappeared right away, second one took a couple more seconds.",
        "created_utc": 1419934630,
        "upvote_ratio": ""
    },
    {
        "title": "I used to keep a dream journal",
        "author": "The_Yak_Strikes_Back",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2qp1f8/i_used_to_keep_a_dream_journal/",
        "text": "Obligatory: sorry for formatting/grammar I'm on mobile.\n\nWhen I was a kid I used to keep a dream journal, in it I would write the date and time that I woke up, and whatever I could remember from the dream I had. This lead to a lot of strange dejavu moments but one of them always resonated with me.\n\n*(January 12th 4:43 a.m.)*\n\n*In my dream I woke up and looked at my clock it said \"2:17\" (night time 2:17) i started to feel like i was drowning, I told my parents and they took me to the hospital.*\n\nNot long after I had gone back to sleep I woke up feeling as if I was being choked, I looked at the clock \"2:17\" I got up and walked to my parents room and woke them up, they took me to the hospital.\n\nThat night I learned I had asthma \n\nWhen we got home I asked my dad what time we left the house at, he told me: \"about 2 in the morning, why?\"",
        "created_utc": 1419840406,
        "upvote_ratio": ""
    },
    {
        "title": "Some vans glitched the matrix (X -post r/funny)",
        "author": "LadyDecco",
        "url": "http://i.imgur.com/BRaHXkE.jpg",
        "text": "",
        "created_utc": 1419618870,
        "upvote_ratio": ""
    },
    {
        "title": "A Chickeny Glitch In The Matrix",
        "author": "AeonicButterfly",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2q7yox/a_chickeny_glitch_in_the_matrix/",
        "text": "So, this one happened a couple of years ago.  It's fairly simple, but still odd.\n\nI was out, eating lunch at McDonalds, with my boyfriend.  I was sitting on one of the tall chairs, the four that surround a table, and my boyfriend was standing behind me.  It was a Tuesday, so I had ordered a 6 piece chicken nuggets.\n\nSo I'm turned away from my food, talking to my BF, reaching behind me and eating them, just keeping a mental count of how many I've eaten, so I don't be ditzy and try grabbing a seventh one.\n\nWe were just talking, when I remembered a news story I wanted to show him, so I turned around after I had eaten three, to get a tablet out of my purse, and saw that I had three left.  So I turn back around, and show my BF the tablet, after I load the story.\n\nSo we keep chatting, and I keep eating without looking at my food.  Suddenly, I eat a seventh nugget, which startled me, because hey, six, so I turned around, and there were still three left on the tray, and since my BF was only looking at my face or the tablet, he didn't see it happen either.\n\nIt's just kind of an odd story, nothing serious, and I'm not complaining about the extra chicken.  Just weird.",
        "created_utc": 1419375121,
        "upvote_ratio": ""
    },
    {
        "title": "A man disappeared",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2q23qn/a_man_disappeared/",
        "text": "It's not really much, but when I was younger, when I was in my mother's car on the way to school, I was watching a man walk along and he just flat out disppeared. I'd totally forgotten about it until recently. This is the only 'glitch' I've ever had apart from the fact I clearly remember seeing Santa Claus in the sky at night when I was younger (which technically isn't a glitch).",
        "created_utc": 1419243588,
        "upvote_ratio": ""
    },
    {
        "title": "My friend and I lost a few hours while at work",
        "author": "the_girl_delusion",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2q0dnp/my_friend_and_i_lost_a_few_hours_while_at_work/",
        "text": "My friend and I do custodial work.  The building we have to clean takes us about four hours, give or take 30-45 minutes on particularly clean or dirty days.  We have pretty much the same routine every day, 5 nights a week.  \nWell one night, we finish up work and I look at my phone to check the time and wtf - work had taken us **seven** hours.  It had been an average night, not especially messy or anything, and we hadn't taken any breaks or done anything out of the ordinary.  Neither of us felt like we had been working for that long, either.\n\nBoth of us were, and still are, completely confused by it. ",
        "created_utc": 1419201411,
        "upvote_ratio": ""
    },
    {
        "title": "The mexican parking lot.",
        "author": "yazmincha",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2q0cum/the_mexican_parking_lot/",
        "text": "Hello Glitchers, I live in the Mexican city of Juarez, which is right in the border with el Paso, Texas. I say this just to create a context.\n\nAbout a year ago, my dad and I went to a mall in town because they were opening a book fair. Long story short, my dad drove us to the mall and we parked very close to the book fair since they were in outdoor tents outside of the mall, and we would not have to walk as much. We walked around the book fair and we decided to go inside of the actual mall and have lunch and maybe go to the movies.\nWe had a nice day at the mall, we bought books and some clothes, and since we are very close, we had fun with our inside jokes.\n\nSo after 4 or maybe 5 hours we decided to go home, and we walked outside of the mall to the place we parked the car. It was not there.\n\n\nOur first thought was that the car got stolen so we walked to the security stand of the parking lot. In order to get out of the mall, one must give a machine a ticket and pay for the time you spend at the mall. \n\nThe security guard said he did not see our car during his shift and maybe we should try to walk around the parking lot again. And so we did.\nWe found the car, facing west about 260 ft away from where we left it. We parked it facing north, so we could get out easily. We both freaked out. Everything was normal, everything was in place, but not our car. We got in, and the locks were not forced, the car was clean, even the sun top was in the exact same position where we left it. Nobody drove the car.\n\n\nBack in the day, my dad dropped out of psychology to study law, so he told me, \"Maybe what we just experienced was a weird case of a sort of mass hysteria, since we are both sure the car was not here.\"\nI was myself, majoring in physics and I remember reading something about a theory where all universes are identycal except from small details like objects being in different places once from the other.\nWe drove home and we decided to not think more about it, but today, after going shopping I asked him if he remembered what happened to us in the mall, because I read here about a person in a comment talking about a girl in Japan that went missing into a place with no animals or people, a sort of totally empty place.\nWe are now thinking we somehow switched dimesions or even universes, since that thing of the car does not make sense at all.\nDoes anybody have any idea?",
        "created_utc": 1419200937,
        "upvote_ratio": ""
    },
    {
        "title": "There's a cute glitch in the matrix.",
        "author": "[deleted]",
        "url": "http://i.imgur.com/dqRzU3j.jpg",
        "text": "",
        "created_utc": 1419187066,
        "upvote_ratio": ""
    },
    {
        "title": "A glitch in the Matrix - bug report.",
        "author": "[deleted]",
        "url": "http://i.imgur.com/mY47m5S.jpg",
        "text": "",
        "created_utc": 1418905527,
        "upvote_ratio": ""
    },
    {
        "title": "Found a true glitch in the matrix",
        "author": "tacos4everyone",
        "url": "https://vine.co/v/O5timI9x2tp",
        "text": "",
        "created_utc": 1418843282,
        "upvote_ratio": ""
    },
    {
        "title": "Item glitch",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2pbucq/item_glitch/",
        "text": "Hi, GitM!\n\nLong time lurker, first time poster. \n\nI've always considered myself to be a 'glitchy' person in that I seem to frequently encounter instances of strange coincidence or 'right place, right time' scenarios. Tonight was no exception. This story involves my favorite hat. I wear it often and it is a custom item that I gained in my travels. \n\nI work overnights, so I sleep in the afternoon and wake up at 10:10 pm. every work day. Yesterday I did some Xmas shopping before I went home to sleep. In the parking lot of my apartment complex, I had taken this hat out of my car and placed it (temporarily) on top of the vehicle to free up a hand to grab bags (I was wearing another one), bringing it inside, and going inside to sleep. \n\nAfter waking up and getting ready for work, I was looking for this hat. Couldn't find it. So I put on the other one and go outside to warm up the car. \n\nThere it is. Sitting on top of the car after 7 hours time passed. No wind blew it off. Nobody noticed it or took it. I was baffled. So I took it, put it in the car, and reported here. \n\nTl;dr: personal item glitches out, didn't lose my favorite hat",
        "created_utc": 1418617708,
        "upvote_ratio": ""
    },
    {
        "title": "My mom told me this.",
        "author": "TurtleInADesert",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2p9veu/my_mom_told_me_this/",
        "text": "So, my mother is a Mexican native.\n\nShe told me when she was young, she would have a dream about a finding a severed head in the forest and before waking up, the eyes would open. She had this dream for three years, not always, but it would happen at least once a week.\n\nIt stopped when she was walking near the forest, a man was cycling by and she recognized him, it was the same man she dreamed. She told me that the part that freaked her out most was, the man looked like he recognized her aswell.",
        "created_utc": 1418578236,
        "upvote_ratio": ""
    },
    {
        "title": "Two cars with almost the same number plates",
        "author": "[deleted]",
        "url": "http://youtu.be/D5b0O3t4MOQ",
        "text": "",
        "created_utc": 1418516600,
        "upvote_ratio": ""
    },
    {
        "title": "Predicted lady's floor on an elevator",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2p4pjh/predicted_ladys_floor_on_an_elevator/",
        "text": "So the other day I was with my relative in a hospital and she was on the sixth floor. I went on the elevator with my dad who was with me at the time to visit and when we got on, another lady www right behind us and I pressed six then looked at her and said, \"four right?\"\n\n\nShe nodded and her eyes were wide with fear and my dad gave me this look. Turns out it was her floor and when she left dad asked me how I knew her floor and I said that I never met her and I just knew where she was going. \n\nHow did this happen? How can I do more things like this?\nJc",
        "created_utc": 1418431056,
        "upvote_ratio": ""
    },
    {
        "title": "Future telling radio host",
        "author": "KaraokeJoe",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2oxamc/future_telling_radio_host/",
        "text": "I was on my way home from school listening to a country station and as I am pulling up to a red light at an empty intersection the song ends and they start the traffic report for right before rush hour. The host announces that there is a wreck at north oak and donland (street names changed for anonymity). That was the intersection I was stopped at so I think he must have some wrong information. Then I see a red mustang comes out of the street to my right to turn left and as he is turning he gets t-boned by a white cobalt! \n\nI am just glad that it wasn't my car that the wreck was meant for.",
        "created_utc": 1418259954,
        "upvote_ratio": ""
    },
    {
        "title": "I Could See Through My Eyelids as a Child",
        "author": "sharpieinyourshirt",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2osq7h/i_could_see_through_my_eyelids_as_a_child/",
        "text": "When I was about 7 ish years old, I spent most of my evenings watching tv after being outside all day. Usually during my tv watching time, a scary commercial for a new horror movie would come on. Being a 7 year old, my automatic reaction to seeing a scary commercial was to squeeze my eyes shut to avoid being scared shitless. But, I swear whenever I did this, I could still see what was going on on the tv THROUGH MY SHUT EYES. It gets weirder. The images didn't look like it was as if I were looking through something, it looked like it was made up of all the little spots of color you would see if you closed, then pressed on your eyes (do it, you'll know what I'm talking about). Although this doesn't happen any more, it wasn't that long ago (I'm almost fourteen now) so I still think about it every once in a while.\n\nEdit: I forgot to say that if I closed my eyes for anything else, I couldn't \"see\" through them.\n",
        "created_utc": 1418161917,
        "upvote_ratio": ""
    },
    {
        "title": "Sliding Television",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2opu9f/sliding_television/",
        "text": "Today, I was looking for anything interesting on /r/news, when I saw a headline about SNL's mocking Al Sharpton re the Garner Case. The record scratched. What?\n\nGarner was recent news, but SNL had been retired in 2009. I don't remember what made me look at it. It might have been after I had read an article about Lorne Michaels a few months ago. It might have been after the death of Robin Williams in August. It might have been after the death of Don Pardo. It might have been some other news. I was looking at a celebrity's filmography and appearances on IMDB. The list led to SNL, for which the episode list ended in 2009.\n\nI was surprised, because I hadn't noticed that the series had ended. I went to Wikipedia to fill in the blanks. Don Pardo had announced every single SNL until its very last episode. I imagined his final intro for the final SNL. Billy Crystal hosted. Lorne Michaels came back for the final show. A ton of previous hosts were there. I imagined the cast as they tried to belch out their lines with lumps in their throats. I imagined the tears as the cast and crew gathered for the parting shot.\n\nI wondered how I had missed it. How could I not have known? I mentally went back in time to review the circumstances in my life at the time. I wasn't watching much late night television at that time, and I haven't watched television at all for over two years. Maybe I simply missed the finale.\n\nI clicked on the /r/news link. The CNN page was dated today and had only a video. I declined to watch the video and flipped to Wikipedia to fill in the blanks. Apparently, SNL is still running. My mind is blown.\n\ntl;dr SNL had its series finale years ago, but it's still running.\n",
        "created_utc": 1418095522,
        "upvote_ratio": ""
    },
    {
        "title": "Bizarre time-jump experience. Blackout? Sleepwalking?",
        "author": "Luxifer",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2opfvn/bizarre_timejump_experience_blackout_sleepwalking/",
        "text": "Not sure if this is the right place, but I had to get some opinions on a bizarre time-lapse experience I had last night. I figured I must have blacked out or sleepwalked, even though I don't have a history of either, and some of the facts don't really add up.  \n\nAnyway I came home around 11pm last night and sat on my computer for around an hour watching some youtube videos on physics. At around midnight I started getting fairly weary and so I decided to head to bed. It was my typical routine: I shut down my computer and turned it off at the wall, went out for a smoke, locked the doors, cleaned my teeth and used the toilet before turning off the lights and getting into bed.  The thing about this, however, is that I *don't actually* remember getting into bed, or trying to fall asleep - something which I normally struggle to do. The last thing I remember is getting undressed and turning off the lights. \n\nEither way the next thing I knew, after a few strange dreams, is the sound of my sister saying my name. My family very rarely wakes me since I have an irregular sleep schedule due to work so it was enough to wake me up, since it was so unusual. To my horror I woke up in our living room, with me sleeping on the sofa. I vaguely remember saying something along the lines of \"what the hell am I doing here?\" \n\nEither way I was still tired so I got up and headed back to my room. I noticed then I was still fully dressed, and when I did get to my room the light was on, my computer was on and half-way through playing the last video I remember watching - and bizarrely, my bed was fully made as it was before I went to bed. I crawled back in slightly perplexed and went back off to sleep.\n\nI spoke to my parents this evening and my father stated that I wasn't in the living room when he left for work at 6:20am. My sister woke me up at 7am, and my mother stated she didn't hear any noise when she was awake in-between. So I'm left wondering... what the hell happened? Did I even go to bed? It felt somewhat like I literally skipped 7 hours, since everything was found exactly how it was when I thought I'd left it. And if I had blacked out, why and where? And how did I somehow make it into the living room between 620 and 7am without knowing?",
        "created_utc": 1418087503,
        "upvote_ratio": ""
    },
    {
        "title": "I think I might have crossed over with an alternate universe.",
        "author": "fuck_errthing",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2omx6s/i_think_i_might_have_crossed_over_with_an/",
        "text": "Ok, so this happened about 2 weeks ago and has been bothering me ever since. \nSo I work for a transport company and I am the morning shift supervisor. It's my job to get there at 5am and open up the depot ready for the staff to start at 6am. So this one morning about 2 weeks ago I go through my normal routine of getting up for work. I wake up at 3:30am then shower, get ready for work. I left for work just as I always do at around 4:15am. The first thing I noticed was that there was a lot more traffic than what I am used to seeing on the road at this time of the morning. Usually I see a few regular cars that I see most mornings. But this day is was literally like it was the middle of the afternoon traffic. Not peak hour traffic but constant traffic everywhere. About 5 minutes in to my trip I have a habit of checking to make sure I have everything I need. Wallet, phone, keys ect. Shit, no keys! I can't open the depot without them. I double check my pockets and through the car before I decide I have to turn around and go home to retrieve them. So I turn my car around and proceed home, as I'm turning in to my street there is a car turning out of my street. It's the exact same car as I drive. Me and the driver of the car makes eye contact with each other. I can't be sure because it was dark but I think I might have been looking at myself. I didn't think much of it at the time just thought it was a coincidence that a car the same as mine was leaving my street. So I ring and wake up my wife to let me in the house (no keys remember) she reluctantly gets up to let me in the house. I do a quick search of the house to no avail. The keys are not here. Lucky having a 2 year old boy has prepared me for this. I have a spare set of work keys that contains the bare minimum keys to get me in to work. So I once again set off to work. The trip to work goes as it normally would. The traffic was back to just a few cars on the road. I arrive at work and begin my opening up routine. As I reach my office I am stopped in my tracks. My office door is open the light is on and my KEYS are sitting in the middle of my desk! This absolutely floored me. There is absolutely no way I had left them there. They contain my house keys and I used them to get in my house the night before. \n\nSorry for the drawn out read but so many things happened that I still can't get my head around. Also excuse punctuation, I'm on mobile.\n\nTldr; went to work without my work keys, turned around to get them. Seen myself leaving my street. Didn't find my keys. Got to work to find my keys on my desk!\n\n",
        "created_utc": 1418035714,
        "upvote_ratio": ""
    },
    {
        "title": "Glitch while subscribing",
        "author": "xcompanioncube",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2oj7t0/glitch_while_subscribing/",
        "text": "I discovered this subreddit today and subscribed. Later in the day I was looking through My Subreddits and realized /r/GlitchInTheMatrix wasn't there, so I subscribed again. At night checking reddit again, realized that I somehow wasn't subscribed, even though I vividly remember subscribing twice before. I hit subscribe, went to post this, and am now somehow still not subscribed.",
        "created_utc": 1417936403,
        "upvote_ratio": ""
    },
    {
        "title": "My eyes had a frame rate drop?",
        "author": "kingkhani",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2oijxi/my_eyes_had_a_frame_rate_drop/",
        "text": "So I began day dreaming while sitting at my computer desk. I was really deep in thought and started to lean back on my swivel chair. As I slowly leaned back, it seemed as if the wall behind my computer screen was lagging behind, similar to a dropped frame rate.",
        "created_utc": 1417919488,
        "upvote_ratio": ""
    },
    {
        "title": "I just saw the moon move halfway across the sky in a matter of minutes.",
        "author": "NorthBlizzard",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2ogk0o/i_just_saw_the_moon_move_halfway_across_the_sky/",
        "text": "So I went out to have a cigarette. Noticed the moon was about midway up in the sky. Which I thought was weird because at this time in the morning it's supposed to be already by the horizon. I thought \"no biggie\" and smoked a bit. I didn't finish my cigarette, never do. I only smoke a bit then come back for more later. So, I go back in and about 10 minutes later I decide I want a few more puffs of cig. I go back outside and notice the moon is now way over by the horizon like it's supposed to be. Did space just lag for me or something the first time? ",
        "created_utc": 1417874553,
        "upvote_ratio": ""
    },
    {
        "title": "Not a believer in glitches, but something weird just happened.",
        "author": "Paisley8827",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2oeh8d/not_a_believer_in_glitches_but_something_weird/",
        "text": "I've been lurking this sub for awhile, and find the stories interesting. Just kind of snickered it off though. Told one of my coworkers about the sub and some of the stories. Took it as weird stories.........\n\nUntil now........We got a big box of chocolates delivered from a vendor at my work. Two of my coworkers just picked two chocolate bells from a section that didn't have any chocolates missing. When they turned back around none of the bells were missing, and there were no free spaces. And yet, they each had one. ???? \n\nSo, knowing about the glitches lets you see the glitches??? What the heck is going on here?\n\nThis is weird.",
        "created_utc": 1417815576,
        "upvote_ratio": ""
    },
    {
        "title": "Weird glitch in the morning",
        "author": "therealbigbudz",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2o9jeg/weird_glitch_in_the_morning/",
        "text": "Every morning when I shower, I leave my phone near the sink (other side of the room) playing music.  I listen to about 2 songs during my shower and get out.  \n\nI was in the shower, listening, and this strange thing happened several times.  The music would stop/stutter (playing from Nexus 4 + DoubleTwist) for a second (which it never does regularly) and the shower head would also stop/stutter the water flow at the EXACT same time.  This happened 2/3 times in the same shower, and it really weirded me out.  \n\nI can't really draw a connection between the two, besides MAYBE steam causing a delay / freeze in my phone?  But usually when I shower in the morning there is not enough steam in the room because its only 3-7 minutes.",
        "created_utc": 1417705900,
        "upvote_ratio": ""
    },
    {
        "title": "This thing happened",
        "author": "Mrfriedfood",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2ntd74/this_thing_happened/",
        "text": "This thing happened and it was freaky. I have no evidence that it actually happened but you can trust me because I'm a random guy on the internet. I'm still trying to get over this impossible thing that just happened. Crazy.",
        "created_utc": 1417319035,
        "upvote_ratio": ""
    },
    {
        "title": "Cloud texture didn't fully load [x-post from r/mildly interesting]",
        "author": "[deleted]",
        "url": "http://i.imgur.com/pAbdgwj.jpg",
        "text": "",
        "created_utc": 1417310297,
        "upvote_ratio": ""
    },
    {
        "title": "Sound glitch I experienced last night.",
        "author": "Laur-Ent",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2npsyg/sound_glitch_i_experienced_last_night/",
        "text": "We have two cats which are almost identical. Other people can't tell them apart but we know them well enough that it's easy for us, and we can even tell them apart by their meow and how/when they meow. One of them is more talkative and always lets out a little mouth-closed-kind-of-meow when he jumps off something and lands on the floor. The other cat is much more silent and only meows when he wants in or out. And this is a loud, mouth open yowling noise.\n\nLast night I was letting in the silent cat and he was coming through the door when I heard the distinct sound of our other cat jumping off something (paws thumping on the floor and making the vocal noise that goes with it) right behind me. Only he wasn't there, he was far away outside exploring as he usually does. I checked and couldn't find him anywhere, inside or outside. And it didn't make sense for the sound to come from behind me because there wasn't anything he could've jumped off of. It definitely wasn't the quiet cat either because I was watching him come in the door when I heard it.",
        "created_utc": 1417222706,
        "upvote_ratio": ""
    },
    {
        "title": "Shouldn't this be merged into /r/Glitch_in_the_Matrix?",
        "author": "invisibowl",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2npqff/shouldnt_this_be_merged_into_rglitch_in_the_matrix/",
        "text": "It's bigger than this one, and tbh having this one is kinda redundant. Maybe this sub could have something similar to /r/blackhole that when clicked sends users to /r/Glitch_in_the_Matrix?",
        "created_utc": 1417221009,
        "upvote_ratio": ""
    },
    {
        "title": "Crunchyroll only has premium and I can't wwatch anime",
        "author": "AnimeLu",
        "url": "http://imgur.com/2FKkdMf",
        "text": "",
        "created_utc": 1417217498,
        "upvote_ratio": ""
    },
    {
        "title": "Left the car, went into a store, came back out and the car was on...",
        "author": "BeforeTheRobots",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2niirx/left_the_car_went_into_a_store_came_back_out_and/",
        "text": "This happened a while ago, can't remember exactly when.\n\nI'm with my friend, we drive to a store, we park. I shut off the engine, remove my keys, and we go inside. After about 15-20 minutes we come back out and start walking to the car.\n\nHe turns to me and goes, \"You have a remote starter?\" I said \"No.\" He says, \"Well your car is on.\" I look and the headlights are on and the engine was running. My reaction was \"what the fuck!\" as I hold the keys in my hand. I rush over to the car, turn the keys in the ignition all the way to the right, then all the way to the left.\n\nBy all accounts it shouldn't have been running. I don't have any kind of remote starter. Neither I nor my friend could explain it.",
        "created_utc": 1417036138,
        "upvote_ratio": ""
    },
    {
        "title": "Is it just me or was there video of Michael Brown's shooting on Reddit back in August?",
        "author": "TheStrangeChild",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2ncst5/is_it_just_me_or_was_there_video_of_michael/",
        "text": "I seem to distinctly remember watching video of the incident occuring. I looked for it on Reddit but couldn't find it. This is not the first time weird incidents where I feel like I saw something that I can't find video footage of has occurred.",
        "created_utc": 1416904976,
        "upvote_ratio": ""
    },
    {
        "title": "Where does this car come from?",
        "author": "vrwim",
        "url": "http://i.imgur.com/xcY0FPd.gifv",
        "text": "",
        "created_utc": 1416762416,
        "upvote_ratio": ""
    },
    {
        "title": "I've seen this show before...",
        "author": "catfroman",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2n4rlj/ive_seen_this_show_before/",
        "text": "Started watching one of the newer episodes of Drugs Inc. Season 6 and it's called Bad Boys; episode 1 of the new season. I haven't watched any Drugs Inc. videos for at least a month or two since there were no new ones and I was tired of watching re-runs, even though it's one of my favorite shows.\nSo I'm watching and I realize the part I'm watching (with the Mexican hit-man) is really familiar. I was thinking about the next scene that would come up (guy walking his dog down a street, sagging, wearing a white shirt) and, lo and behold, a guy in a white shirt, sagging pants, walking his dog down the street. \nI was even able to guess, word for word, what the guy was going to say next during a particularly memorable scene.\n\nThought I was going crazy and checked the upload date on every copy of the video on Youtube and none of them are earlier than November 12th, 2014. Checked the Wiki for Drugs Inc. and the episode was release November 12th, 2014. \nHowever, I watched this video several months ago.\n\nAny ideas? Feels like I'm going crazy.",
        "created_utc": 1416708808,
        "upvote_ratio": ""
    },
    {
        "title": "Ok, something's up.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2n2ddd/ok_somethings_up/",
        "text": "A couple of months ago I was in my room, and my mom was in the kitchen. For me to get to the kitchen from my room, I have to open the door, make a right down our hallway, walk for 2 Mississippi seconds, and boom there it is. I hear her putting things away in the refrigerator. Then she turns the sink on, then turns it off. \n\nThen 3 seconds later I hear the *shower* turn on. Really. 3 seconds exactly. Now this is weird because it would be impossible for her to get from the kitchen to the bathroom in that amount of time. There are only 2 bathrooms in our house. The one on my side of the house, and the one near my parents' room on the other side of the house. She was using the latter. To get from the kitchen to that bathroom, she would have to cross the dining room, the living room and another hallway. It would take 7 Mississippi seconds to actually get there. But I kept this to myself, because what would I say? I'd look crazy.\n\nAnd today something else happened. I was walking down my driveway towards my backyard. The front half of the backyard is concrete, the back half is grass. I see my dog on the concrete part walking around slowly, just sniffing. I open the gate to gain access to my backyard, then shut it. While shutting it I looked away from my dog, and this was the only time I looked away from my dog. When the gate was completely shut, I looked back up again. This took exactly 2 seconds. And I see my dog in a different spot. At the very back of the backyard(the grass part, next to the end wall) taking a shit! My first reaction was laughing like a maniac, because it was just so random. But now I find it so weird because, well, it's a glitch. For him to have gone from that one spot to the other, it would've taken 5 Mississippi seconds. And I would've heard him too because of his jingly collars. And add an extra second or two for him to assume the shitting position. Just so weird.\n\nSo, these two events were quite literally glitches. They remind me of when your character respawns in a video game.",
        "created_utc": 1416642860,
        "upvote_ratio": ""
    },
    {
        "title": "I believe I am sharing my dreams with other people [X-post TheTruthIsHere]",
        "author": "ikeepadreamjournal",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2muqmq/i_believe_i_am_sharing_my_dreams_with_other/",
        "text": "Let me start this with a few things:\nI have a photographic memory allowing me to remember my dreams in great detail.\n\nI dream in color, with sound. All speech is audible.\n\nI dream every night and write them all down in a journal on my phone.\nA lot of my dreams are lucid. Its always been this way and I haven't done anything special to make this happen.\n\nAll of my dreams take place in the same town. All of them. Its a small town on a lake somewhere. We're either in the town itself, on the lake or at one of the many homes surrounding the lake.\n\nI'm always with the same people. I don't know any of them in real life but we're all very close in the dreams.\nThe dreams are a chronological series of events. I dream one night, wake up, go back to bed that night and I'm back at The Lake continuing on. They don't start up right where they last one finished. Its as if the time I spend awake is lost within the dream.\n\nWe have some sort of task that needs to be accomplished but no one ever talks explicitly about it. I think maybe we're searching for something and we know its somewhere in this town or in The Lake.\n\nSometimes things happen (once we went to the home of this old woman to talk to her. While we were there something bad happened and we all got separated, I remember running from the house and hiding in some brush about a hundred yards away.) Other times we'll be doing mundane things like arguing with each other over what we're \"supposed to do next.\" Is the way it is always stated.\n\nIts clear that our presence in the town needs to be kept quiet, for reasons unknown I've had more than one verbal confrontation with citizens of this place.\n\nOnce I was stranded in the town with none of my \"regular group\" of people. It was clear that something had gone wrong that day and for some reason I had to leave and it was very stressful.\nThere was one time myself and two of the others took a green SUV to a much larger city to visit a woman in some sort of refrigerated ware house like facility. I'm not sure what was discussed.\n\nSometimes I'm on the lake with this one guy. I don't know his name but he's always there so we'll call him David (he looks like a David). We're always in a shallow portion of the lake clearly looking for something. One of us is in the boat, the other is in the water walking along side. We switch off like this sometimes. I'm not sure what exactly we're doing but I think it has something to do with finding caves in the water. David and I speak to eachother as if this is our job and we were partnered up to do it.\n\nThere was a plane crash once. A small single engine plane went down over the lake. At the time I was driving some sort of sedan by myself down a road around the lake. Tall needle leaf trees came up on both sides of the road so I could only see it for a few moments as it passed over head. It was obvious out was crashing. As I was distracted by the plane, a motorcyclist (who must have been traveling at 40+ MPH) ran a stop sign to a small side road and slammed into the side of the car I was driving. He wasn't wearing a helmet and his head came through the window while his body hung limp out the side. I didn't look because I knew it would be awful. All I could hear was choking and gurgling. Then I woke up.\n\nThe plane crash was very significant some how. I'm not sure why, but we discuss the plane sometimes. What it seems like is we're not sure what happened to it and some of us are a little afraid(?) of it.\n\nThere's a housing development near the lake. Its a modern style, planned community with single story homes built between 1980-1995ish. Its the only real neighborhood like area around there. All other homes are built on private pieces of land around the lake. I'm in this subdivision some times, and it always ends badly. Myself and whomever I'm with at the time always end up running frantically away. These are by far the most stressful dreams I have. The neighborhood is very obviously where we want to be for some reason, whether we've tracked something/someone down to there I'm not sure. But we're always running and sneaking around. Very rarely is it day time if we're in this place and its clear we are not supposed to be there.\n\nThere are several homes within the neighborhood that have an ominous aura about them. These are the houses we're there for I feel like. I don't know why.\n\nThe Lake, The Town and The Neighborhood. These are the places I dream of and they're all related. Like I stated before, I dream every night. There's too much to write here. These dreams started about three and a half years ago. I've been searching this sub and others like it daily looking for anyone who dreams about The Lake. \n\nI feel as if I have enough information gathered to share this now. I have become convinced that the people in my dreams are real people sharing the same dreams for several reasons.\nI will answer any questions with as much detail as possible and hope this gets a moderate amount of attention. I would really like to discuss this and similar things. I've also posted this in /r/thetruthishere, if there are any more suitable subs to post this to, please let me know.",
        "created_utc": 1416463996,
        "upvote_ratio": ""
    },
    {
        "title": "People frozen in time",
        "author": "Powerpython",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2mue8a/people_frozen_in_time/",
        "text": "It all started as I was on a drive with my girlfriend. She was driving and I was looking out my window and saw in front of someones driveway this lady smoking a cigarette. But I continued to look and she was completely still. She held the same awkward stance as if she froze in the midst of moving her arm to take a drag. I was weirded out and just figured it was some sort of mannequin. But as we drove right by, I noticed the cigarette was lit. And the gaze upon her face was confused. I had no idea what to think, so I tried asking my girlfriend if she saw anything and she said she wasn't paying attention. This happened two weeks ago.\n\nFast forward to this morning. I work night shift, and was walking home after my shift at 6am. There were cars coming and going, and as I walked by one house I saw a man in his car getting ready to leave. The car was faced towards me and it seemed he was staring right at me. He was bent over as if he was looking for something, yet his head was up, and his hands were up over his steering wheel, but not touching it. I took a double take at this weird sight, and saw him in the same exact position. I continued on and as I walked right past his car on the side of the road, i looked in and saw him in the same exact position, looking straight ahead. I stopped right there and just looked for a few seconds. Nothing. He was still. Petrified in his weird position. Realizing just how fucking weird this was i got the fuck out of there. I walked home constantly checking over my shoulder. Needless to say I was spooked\n\nSo I'm pretty baffled about this. I have absolutely no explanation. The first time with the lady, i just thought it was some weird trick she was pulling or maybe it really was just some statue. But after seeing the guy, just stopping and taking a look into that guys car and just seeing him like that... Man I thought shit like this was fake. I thought stories like this were bullshit. Now I just don't know what to say.",
        "created_utc": 1416455879,
        "upvote_ratio": ""
    },
    {
        "title": "What is going on",
        "author": "reptilians13",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2mqe5j/what_is_going_on/",
        "text": "I was In a bathroom and I hear a man speaking Chinese frantically and I can't see what their doing but I understood it perfectly and translated it, I have never heard Chinese a day in my life and I confirmed I new when I walked out of the stall to see him washing his sons eyes which is what I heard him saying \" stand still it won't burn anymore \" did I just experience a glitch or is my brain fucking with me cause I'm 100% sure they were speaking Chinese not English ",
        "created_utc": 1416365480,
        "upvote_ratio": ""
    },
    {
        "title": "This is too strange to be a coincidence",
        "author": "Chumawumba",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2mq0ky/this_is_too_strange_to_be_a_coincidence/",
        "text": "Today I decided it would be a good idea to start eating healthy, so I went into my kitchen scouring for something nutritious to eat. I don't usually buy the groceries, so I don't know what we have in stock. Anyways, I find the \"fruit\" section in our fridge, and find a nice plump looking orange. When I cut open the orange, the insides are RED, and I mean BRIGHT red. \"No big deal\", I think, assuming that the orange went rotten. Now it gets weird.\n\nEVERY SINGLE orange in my fridge has a red inside, and it tastes NOTHING like an orange. Now I don't believe in superstition or anything, but I think something is seriously amiss. Why are my oranges turning red? It's probably just a coincidence that they are all rotten, but i'm not buying it. Today, when my girlfriend gets home, I'll have to ask her about it. Will keep you guys posted.",
        "created_utc": 1416358072,
        "upvote_ratio": ""
    },
    {
        "title": "Never thought to post this old story here.",
        "author": "Wait_No_Stop",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2mhtxw/never_thought_to_post_this_old_story_here/",
        "text": "This totally seems like it would fit the subreddit, but I've never thought to post it. I had almost forgotten about it entirely.\n\nWhen I was probably around 10 years old, I woke up for school one morning around 6am. My parents had gotten into an exercise kick, so they were both at the gym that morning. My sister didn't wake up until 7am for middle school, so I was the only one awake at home. I turned on my light and if I remember correctly, I needed to borrow something from my mom's bathroom. On one end of the hallway were my bedroom and my sister's bedroom(connected by a Jack and Jill bathroom). On the other end of the hallway was my parents' bedroom. Right past their door was our back staircase. I got out of bed and went into the hallway. It was really dark, but I started to walk towards my parents' room. Right as I got about halfway down the hall, I heard what sounded like probably 50+ of [these kind of pipes](http://imgur.com/afA9vlt) falling down our back staircase all the way from the top. It scared the shit out of me, but I walked down to the end of the hallway to look. There was nothing at the bottom of the steps. I even said, \"hello?\" just to see if anyone was there. When no one responded, I bolted back to my room. I asked my parents about it when they came home, and they looked at me like I was crazy. I still don't know what made that noise. We never found anything.",
        "created_utc": 1416171422,
        "upvote_ratio": ""
    },
    {
        "title": "Sound Error",
        "author": "Cybraxia",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2m91z5/sound_error/",
        "text": "I just opened my fridge to take out a bottle of powerade. I removed the bottle, and then reached through where it *was* to check the date on something - and heard the sound of the bottle falling over, despite it  standing securely on a counter, where I had placed it.\n\n It seems that the universe played bottlefalling.mp3 when bottle != true",
        "created_utc": 1415936503,
        "upvote_ratio": ""
    },
    {
        "title": "Dancing baby police radio",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2m5zim/dancing_baby_police_radio/",
        "text": "Not sure if this quite qualifies for this sub, but it's about the weirdest thing I ever experienced.\n\nSo, back when I was about 10, I picked up one of those [stupid dancing baby dolls](http://images.cloud.worthpoint.com/wpimages/images/images1/1/0610/13/1_5fe18e29c5507dc488b19c9ae41c0704.jpg) from a tabletop sale at the local church. Of course, after annoying my parents with it for a little while, it sat on my shelf never to be played with again. \n\nFast forward a couple of months, I'm lying in bed trying to get to sleep, when all of a sudden I hear a voice crackle out of nowhere, saying something about having to come down our road to find the suspect. \n\nOf course I jumped straight out of bed and began searching the area from which the voice came. The only thing in that part of the room that had a speaker was the dancing baby. Pretty rattled, I ran downstairs with the dancing baby and told my parents what happened. They laughed and told me I must've had a bad dream, and sent me off back to bed. \n\nFive minutes later, there's a banging at the front door as if someone's trying to break it down. I sneak out of bed in time to see my father answer the door, and sure enough there's two policeman and a giant rottweiler asking if they can get into our garden. My father lets them through the side gate, and I run back to my room to watch through the window. \n\nThe dog leads them straight to a conifer halfway up the garden. The policeman are shouting something at the tree, and the dog's going crazy barking and jumping at it. After a couple of minutes of this, they let the dog loose, and he jumps right into the tree and drags a man out by his foot. \n\nTurns out he'd robbed a house a couple of streets over and was garden-hopping trying to escape. That was pretty much the end of it, the police thanked my parents for their co-operation, and were on their way. \n\nFor months after that, I would lie sleepless, waiting for that damn baby to pick up another signal, just so I could prove to myself that I wasn't crazy. But it never did.\n\nTL;DR: [dancing baby](http://images.cloud.worthpoint.com/wpimages/images/images1/1/0610/13/1_5fe18e29c5507dc488b19c9ae41c0704.jpg) picked up police radio signal, parents didn't believe me, 5 minutes later police show up with a big dog and arrest a man hiding in our tree.",
        "created_utc": 1415868413,
        "upvote_ratio": ""
    },
    {
        "title": "I unknowingly predicted a horrifying commercial.",
        "author": "PolarDylan",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2m5cg9/i_unknowingly_predicted_a_horrifying_commercial/",
        "text": "So for those of you who don't know, adult swim makes these parody shows and commercials that they play at odd hours of the night. There's one particular one that becomes really creepy and unsettling. This one called \"Too Many Cooks\" \nhttp://m.youtube.com/watch?v=QrGrOK8oZG8\n\nI had heard about it and watched it a few days ago. Well when I got home from work, adult swim was on and I told my GF about it so we watched it together and we didn't even finish because of how creepy it truly is. Well we continued watching American Dad and it went black to go to a commercial break and I turned and said \"what if that commercial came on?\"\nBOOM. It's on. I literally looked at her, said that, turned back to the TV and there was that demonic song on. She didn't even have time to answer my question! She just screamed turn off the tv as I was already throwing the sheets off the bed looking for the remote! I couldn't find it and it kept going so I just went to the TV and hit the power button. We agreed it was safest to leave the house so we hit up Wendy's. But it was all terrifying none the less. ",
        "created_utc": 1415850746,
        "upvote_ratio": ""
    },
    {
        "title": "Thigs look smaller than they are",
        "author": "koalio",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2m0snk/thigs_look_smaller_than_they_are/",
        "text": "When i was like 5-6 and i couldnt sleep i would walk into my moms room and just lay there until i could fall asleep. In the process i would end up just staring at the the ceiling fan we had. I would just zone out and let my eyes focus on it. After a while of staring at it it almost seemed to get farther and farther away. I didnt move, the ceiling fan wasnt moving, and i dont know what happened. Ive had this since, but never as intense. The fan seemed to be a good 20 feet away from me and it was just super cool as a 6 year old so i just kept staring until it just stopped. Oh, and it was weird but it was almost a squeaking sound in my ears, which i think was a result of my mind thinking about ants. And the voices the 'ants' that i was thinking about were speaking at the same time, almost as if it was like being schizophrenic. But it was just tiny voices conversing to each other. Was this just an optical and mind illusion? Why did the fan look so far away? If the 'ants' i was imagining just that voice in your head, how were they speaking at the same time? Am i just dumb or was this weird as hell?",
        "created_utc": 1415751893,
        "upvote_ratio": ""
    },
    {
        "title": "Why Running Simulations May Mean the End is Near",
        "author": "[deleted]",
        "url": "http://ieet.org/index.php/IEET/more/torres20141103",
        "text": "",
        "created_utc": 1415749250,
        "upvote_ratio": ""
    },
    {
        "title": "Read about a death before it happened.",
        "author": "benelevator",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2m01kj/read_about_a_death_before_it_happened/",
        "text": "This was about six years ago. I had a night job at a local hotel and we always received a stack of newspapers around four in the morning. There's nothing going on at that time so I would normally read the local section, glance at the comics, and then hammer out the day's Sudoku. One night I remember very specifically reading about a roll-over death west of town; Male 28, Mitsubishi Eclipse, county road 5 or whatever. I filed it away and went about my night. I went home, went to bed and when I woke up that evening I found my roommate in the living room very upset. He said a friend of his had crashed his Eclipse and died instantly west of town that very morning. \n\nI said I had read about that morning, and my roommate pointed out it had just happened around 6AM and would not have been published yet. Needless to say I was a little freaked out. I went to work that night, the newspaper arrived around 4 o' clock as usual and I ripped it open and it was there; that same article I had read the night before exactly as I had remembered it. I couldn't find the previous day's paper and out of fear of lunacy I never bothered hunting for it but this whole thing is still scarred in my memory.\n\nThings rarely changed from night to night when I worked there and I've always had little cases of deja vu here and there but never to this extreme. Did I honestly experience an odd jump in time?\n\n\nedit: wording",
        "created_utc": 1415738516,
        "upvote_ratio": ""
    },
    {
        "title": "A second lasts two seconds",
        "author": "chaceaaron",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2lxc5l/a_second_lasts_two_seconds/",
        "text": "Okay, so this is a weird \"glitch\" I found out today. What you'll need is a watch that displays the seconds and change your computer's clock to also display the seconds. They should both be digital, although I haven't tried with analog. So what I did was I was just watching my watch's seconds change then I looked at my computer's seconds IMMEDIATELY and it seemed like it paused and didn't change. Then, what felt like two seconds later it did change, then kept at it's normal pace. Then I glanced at my watch's seconds after staring at the clock's seconds (keep in my it's a digital clock, both are) and it too felt like two seconds. Then kept going as normal. It's like if you glance at the seconds change on one device then look at another (as quickly as you can, trying to only move your eyes and not your head), it feels slower. You can sometimes do this by glancing at a random object then quickly looking at your watch or clock and it sometimes works, so you don't necessarily need a watch AND a clock. I got my brother and dad to do it and they were confused. You guys try it!",
        "created_utc": 1415673705,
        "upvote_ratio": ""
    },
    {
        "title": "Glitched deadbolt",
        "author": "gfuzz23",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2lmwxg/glitched_deadbolt/",
        "text": "TLDR: Deadbolt on my front door locked itself. \n\nSo today I walked into the front door of my 100 year old house, which was unlocked, and went straight upstairs to my room to get some stuff together because I'm going out of town. I got everything together and walked downstairs to put everything in my car. I go to open the front door and the deadbolt is completely locked. I obviously was not the one to do it, hence me posting here. I was the only one home, it wouldn't have been possible for anything on my person to have snagged it, and it's also not a loose deadbolt. You actually have to play with it for a second to get it in. WTF? ",
        "created_utc": 1415410282,
        "upvote_ratio": ""
    },
    {
        "title": "Apparently, Youtube is plugged in to the human thought matrix",
        "author": "itsadeadthrowaway",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2lja0j/apparently_youtube_is_plugged_in_to_the_human/",
        "text": "The other day I was driving my sister around, trying to help her buy a new car. During our conversation, she told me about an interview she had listened to a few days earlier, an interview of a rapper named Kevin Gates on \"The Breakfast Show\". I had never heard of the guy before.\n\nSo two days later, the movie Philadelphia was on tv. I'm a pretty big film buff, and I was reminded while watching the movie what an incredible performance Tom Hanks turned in. I wanted to listen to his acceptance speech for winning the Oscar for that role, so I pulled the video up on Youtube and watched it. And that's when I noticed...\n\nIn the list of \"other video suggestions\" on the side of the screen, I saw numerous other videos related to Tom Hanks, the Oscars, the movie Philadelphia...and then right in the middle of the list was the video of this fucking rapper Kevin Gates on The Breakfast Show, the very same goddamn interview my sister had mentioned to me the other day.\n\nI never googled the guy's name, I haven't followed hip hop music in years, and there is absolutely no reason this video should have been appearing anywhere in that list. I called my sister at work and told her what had just happened and we both thought it was pretty damn creepy.\n\nI've tried to find a way to rationalize how this happened. We do not live together, we do not share a computer, we do not share an internet connection. A few days have passed now but it's still freaking me out...it reminds me of that saying, \"Just because you know you're paranoid doesn't mean they aren't watching you.\"",
        "created_utc": 1415323422,
        "upvote_ratio": ""
    },
    {
        "title": "James Earl Jones",
        "author": "mightytiki",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2lj3p0/james_earl_jones/",
        "text": "A number of years ago, I remember very distinctly hearing on the news that James Earl Jones had passed away.  \"The Simpsons\" that weekend had a special \"in remembrance\" card at the end of the episode for him (they used a shot from the 'Round Springfield episode when Bleedin' Gum Murphy died).  I also remember going to CNN and reading an article about his death (Jones did the voiceover for the \"This is CNN\" tagline).  And I also remembered thinking that Jones could never be used as the voice of Darth Vader in any future Star Wars film (this was before Star Wars Episode III Revenge of the Sith had come out).\n\nAnyway, a over a year ago I was watching late night TV (Letterman I think), and they had James Earl Jones on as a guest.  I got that weird watery stomach feeling when I saw him.  I know, very definitively (at least in my mind) that he'd died.  I spent the next half-hour trolling the web trying to find anything that might prove me right.\n\nI've experience some other weird glitches in my life (like twice when I was a kid blinking my eyes and having it change from night to day in an instant).  Still this James Earl Jones thing haunts me.",
        "created_utc": 1415319932,
        "upvote_ratio": ""
    },
    {
        "title": "Yesterday happened twice",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2ld2tf/yesterday_happened_twice/",
        "text": "I don't know how big of a glitch this is, seems relatively big to me atleast. But yesterday happened twice. This is one of the first glitches I've had really. I realized what happened this morning when I woke up. I didn't really know how to process it. The day essentially repeated itself. It was a relatively normal day. I don't know what else to say about it really, just thought this was the best sub to share it on.",
        "created_utc": 1415192395,
        "upvote_ratio": ""
    },
    {
        "title": "You guys probably wanted to go to /r/Glitch_in_the_Matrix",
        "author": "Chronoglide",
        "url": "http://www.reddit.com/r/glitch_in_the_matrix",
        "text": "",
        "created_utc": 1415094902,
        "upvote_ratio": ""
    },
    {
        "title": "Where does this ref come from?",
        "author": "wtfmynamegotdeleted",
        "url": "http://www.youtube.com/watch?v=ZdKlf3igdy4",
        "text": "",
        "created_utc": 1415069496,
        "upvote_ratio": ""
    },
    {
        "title": "Apples from the Sky",
        "author": "notfarenough",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2ktvtn/apples_from_the_sky/",
        "text": "This happened about a month and a half ago. After talking about it with my daughters, they suggested I post the experience here.    So, about 4:00PM on a Monday in mid-September, I'm washing up some dishes in the sink. Our house - and the kitchen window in particular- face a small lake. As I'm washing dishes I just happened to be gazing out the window, thinking of all the ways I can keep geese out of the lake (I hate geese, and have come up with diverse ways to harass and make life generally uncomfortable for them)- when all of the sudden something drops with a large splash into the lake. The direction of the splash was, for lack of a better description, 'vertical'. This was odd, so I called my daughter: 'Hey Zoe, I was looking out the lake and something just fell in the water! Go check it out'. In short order, she walked out the back door and toward the lake. I followed her out the door- maybe 40 paces behind. We could see something red bobbing in the water. As she approached the water, there was suddenly another splash! This was about 15 feet from the first. Apples. They were apples. We looked all around to see if somebody was messing with us, but the neighborhood was dead quiet, and nobody was outside. In particular, nobody was within throwing or slingshot range. And these apples fell 'vertically'- straight down, with a circular splash. The bobbed in the water for the rest of the day, but never close enough to shore for me to retrieve them. Reddit, what do you think? Tossed from an airplane? Dropped by a bird? ",
        "created_utc": 1414709965,
        "upvote_ratio": ""
    },
    {
        "title": "My first glitch",
        "author": "M1lkweed",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2kqz4r/my_first_glitch/",
        "text": "When i was 6, i went to a charter school. One day i was on the play ground when the bell rang. It was time to go in, so i jumped down. In the middle of my jump, the world froze. I could look around, but for a few seconds, everything was still. I wasn't even falling. It cleared up in a few seconds though, still weird.",
        "created_utc": 1414640278,
        "upvote_ratio": ""
    },
    {
        "title": "I dont know if this is a glitch or not",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2khws5/i_dont_know_if_this_is_a_glitch_or_not/",
        "text": "One time last year i was at my grandparents for the weekend and we were all in the living room. I got up to go to the kitchen. Ill explain the layout of the house to understand this better. At the front door, to your left is a wall with the bathroom door, then to the right is the stairs. In front of you is the dining room. The dining room has this wall with two open areas on tje left and right that goes into the living room. I was in the living room, got up and walked through the dining room, towards the kitchen at the front of the house.\nI got up, and suddenly was at the dining room table. I dont remember walking to the table, i was just there.\n\nIf anybody know what happened or if this is a glitch, please comment. This has been confusing me for a while. ",
        "created_utc": 1414441352,
        "upvote_ratio": ""
    },
    {
        "title": "Daylight savings time - watch 1 hour out of sync",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2kdidq/daylight_savings_time_watch_1_hour_out_of_sync/",
        "text": "I woke up this morning, checked my watch, realised it was nearly 10:30am and jumped out of bed as I was late meeting my mum for breakfast. Checked my phone to see if she'd called or texted me, whereupon I noticed the clock read 8:30am. Checked my PC - it too said 8:30am. \n\nThrough a sleepy haze I realised the clocks must have gone back today, so I adjusted my watch, only for it to dawn on me it was 2 hours ahead, not 1. Yet it was correct last night.\n\nIt's an analogue watch, incapable of adjusting itself to daylight savings.",
        "created_utc": 1414337697,
        "upvote_ratio": ""
    },
    {
        "title": "Listen to the radio right before he spins out...",
        "author": "[deleted]",
        "url": "http://youtu.be/MXSFXPtcrlE?t=45s",
        "text": "",
        "created_utc": 1414189185,
        "upvote_ratio": ""
    },
    {
        "title": "A Weird Glitch During School",
        "author": "FunkyCam",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2k8ghf/a_weird_glitch_during_school/",
        "text": "This happened during my history class. Today is a pink out for my school, so almost everyone here is wearing pink. The girl in front of me had a few pink streaks in her hair for the pink out. As the class was working on some class work, I turned to my neighbor to ask a couple questions which I was confused on. As I turned back, I looked forward and the the pink streaks in the hair of the girl in front of me have seemingly disappeared. I was extremely confused so I just sat there wondering where the pink went as I was 100% sure that there were pink streaks in her hair. Ever since then, I have been extremely confused on how that happened. Does anyone have any explanation?",
        "created_utc": 1414186308,
        "upvote_ratio": ""
    },
    {
        "title": "Something spectacular that nobody else ever saw.",
        "author": "Gamerdoe",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2k6nfn/something_spectacular_that_nobody_else_ever_saw/",
        "text": "I'm so glad I've found a place to post this. This was an experience I had back in early highschool, I was either fourteen or fifteen.\n\nIt was late at night and I was up reading when I was supposed to be sleeping. (I had very strict parents) My dog was in my room and all was still and calm until about 1 am. My dog's head perked, and he let out a gruff, woof. The kind that meant he was about to freak out in 30 seconds if I didn't placate him. \n\nIt's pretty close to summer time so I think that maybe he heard some thunder off in the distance that my human ears couldn't yet pick up. I turn in my bed and look out the window, at first I see just the night sky, and keep intently looking for clouds or lightning before an insane spectacle takes place.\n\nThe whole night sky is lit up. Green, then red, then blue, then red, then blue and green once more. It goes on for only about 20 seconds and is pierced by the sound similar to that of a very large truck and then it's gone. My dog is flipping out and I'm shaking a little bit, as I quickly flip on the TV and turn it to the weather channel, waiting to see if a report comes up. I watch it for the next hour.\n\nI wake up that morning with my TV still on the weather channel. I get up and walk down stairs, and my mom asks me why the dog was barking last night, and I ask her if she was woken up by a bunch of colors in the sky. She shakes her head. I ask her if it had been on the news, once again a 'no'. I spent the next few days asking everyone and anyone around about it. Nobody saw anything.\n\nTo this day I still have no idea what in the world happened.",
        "created_utc": 1414145954,
        "upvote_ratio": ""
    },
    {
        "title": "My mom's GITM",
        "author": "heychampagne",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2jti8z/my_moms_gitm/",
        "text": "What I'm about to tell you happened to my mom about 10 years ago, when we were vacationing in an island called Vieques off the coast of Puerto Rico.\n\nMy mom, cousins, sisters and I were staying at a house we rented in this island. My mom got up to go to the bathroom in the middle of the night, and someone knocked on the bathroom door. She said she'd be out in a second, but when she opened the door there was no one there. She walked around the house looking for whoever knocked on the door, and came to a halt when she saw her brother in the kitchen, looking really skinny, waving at her and smiling. Thing is, not only was her brother really obese, but he hadn't come with us on that vacation. She says she didn't feel afraid and calmly went back to bed, completely forgetting about what had happened the next day. \n\nWell, this was on a Saturday night, and her brother died from a heart attack the next Tuesday at 42. Completely unexpected. \n\nI'm not even sure if this is a GITM, but I don't know what else to call it. It can't be paranormal if her brother was still alive when she saw him! Right? ",
        "created_utc": 1413836949,
        "upvote_ratio": ""
    },
    {
        "title": "Someone ordered 2 filet o fishes",
        "author": "alexthes0ck",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2jt1od/someone_ordered_2_filet_o_fishes/",
        "text": "No sentient person would freely order 1 let alone 2 of those nasty things.",
        "created_utc": 1413828922,
        "upvote_ratio": ""
    },
    {
        "title": "Not really a post just curiosity..",
        "author": "goldenshower6969",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2jmct1/not_really_a_post_just_curiosity/",
        "text": "Is GITM real or is it like nosleep and is fiction? I need to know because it would be disappointing if it was fiction.",
        "created_utc": 1413653106,
        "upvote_ratio": ""
    },
    {
        "title": "I think my mind skipped",
        "author": "Pipsquik",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2jjp77/i_think_my_mind_skipped/",
        "text": "So me and a few friends were hanging out last weekend home alone. One guy (let's call him Dylan) said he's going to get a beer. I decided I wanted one too so I got up a few seconds later. After he turned the corner I got up and followed him. The hallway takes like 8 seconds to get down and I was no more than 4 seconds behind him. When I turn the corner, he was gone so I figured he sprinted there for some reason. Then I went into the garage and he wasn't in there. I was so confused. I walked back down the hallway and he was sitting in his chair with a beer. Wtf happened?",
        "created_utc": 1413576256,
        "upvote_ratio": ""
    },
    {
        "title": "It was like I was reading his mind, or he was reading my mind.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2ji2p5/it_was_like_i_was_reading_his_mind_or_he_was/",
        "text": "I was watching Tosh.0. He was doing a segment about rape. All of a sudden, this thought popped into my head- \"Pear is an anagram of rape.\"\n\n*Immediately* after I thought that, Tosh said \"Rape is just 'pear' rearranged.'\"",
        "created_utc": 1413536245,
        "upvote_ratio": ""
    },
    {
        "title": "has been bothering me for years",
        "author": "marmorealvirgo",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2je8wl/has_been_bothering_me_for_years/",
        "text": "When I was a sophomore, so only a few years ago, there was a massive thunderstorm that my house was right in the middle of.  I've always been one to keep my windows open and they were pretty hard to close all the way in my old house, so when I noticed a growing puddle of water on the windowsill dripping down into the carpet I just assumed that I hadn't closed it all the way.  I remember thinking that if the water made a bubble under the carpet or mildewed or something that my mom would be pissed so I went to get a towel from my bathroom.  Then, as I walked back towards the window, I noticed that the entire puddle was gone.  I was super freaked out and felt the carpet that had been dripped on and it was completely dry.  The window was even sealed and locked.  SUUUUPER weird.",
        "created_utc": 1413439901,
        "upvote_ratio": ""
    },
    {
        "title": "What the actual fuck?",
        "author": "TheDero",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2jdbym/what_the_actual_fuck/",
        "text": "First post here, I only found this subreddit after texting one of my buds after this happened. I just got home from my algebra class about an hour ago, and I popped a pizza into the oven, and tossed the box into our recycling bin near the fridge. Nothing unusual. \n\n20 minutes pass and I'm finished eating, and my mother walks into the kitchen and picks up and tosses me the box, saying to go throw it in the bin in the garage. I get up, take the box *in hand*, walk to the garage door, open it and throw the box, barely missing the can. I missed it so slighlty that it bounced off the rim and landed IN MY SIGHT on the floor. My unfortunately lazy self left it, I walked back into the kitches AND MY MOM SAYS TO TAKE THE BOX OUT TO THE GARAGE.... THE PIZZA BOX WAS SITTING ON THE FUCKING FLOOR OF THE KITCHEN..\n\nI shit you not, I go back out to the garage, *pizza box again in hand*, and this time threw it into the can, and the other box was gone. \n\nWhat in the actual fuck",
        "created_utc": 1413417900,
        "upvote_ratio": ""
    },
    {
        "title": "Christmas ghost?",
        "author": "Areeane",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2ja64y/christmas_ghost/",
        "text": "Hey everyone! I don't know if this exactly a glitch, also not sure if this is the best place to post this story. I would post this to /r/nosleep but it's not scary or anything, just a bit strange I guess.\n\nIt was Christmas eve about 3 years ago. My boyfriend and I were over at my dad's home for the holidays and were having a great time! The people in the house were: myself, my boyfriend, my sister, my brother, my dad and my dad's gf at the time.\n\nIt was about 1-2AM and I was in a room on the top floor with my bf, lying in bed and talking before we fell asleep. Suddenly, the door opened and a tall, male-like figure stepped into the room and stopped a few steps in. It was really dark, so all I could make out was the general figure. It was definitely male, seemed taller than both my dad and my brother but I figured I was in bed so maybe my perspective was a little strange. After a few seconds of silence I said, \"Um, did you miss the bathroom?\" and laughed. The figure just stepped out of the room and closed the door without a word. My boyfriend and I were confused and joked that my brother or dad must have gotten up in the middle of the night and confused the rooms.\n\nIn the morning I got up pretty late, as I usually do, so most people were up by then and already eating breakfast. After a bit of talk I joked around, \"So which one of you mixed up our bedroom for the bathroom last night?\". Nobody had any idea what I was talking about. Having lived with my brother and my dad for my entire childhood, I knew that neither of them (or anyone else in my family) were prone to sleepwalking as it had never, ever happened before. They both said they had not gotten up at all the night before.\n\nAs we were trying to figure out what could have happened, my dad's gf said she knew what had happened. She believes in ghosts, after life, psychics, all that stuff while I really don't, but this is her story. She said that her father, while he was alive, would walk through every room of the house every Christmas eve to make sure that everything was set up and ready for Christmas day, and that every year since he died she usually would dream of him doing it. But this year, she didn't dream about it. She is absolutely, 100% convinced it was the ghost of her father, and we were the only ones awake to witness it (my bf saw the exact same thing I did). As for me, I don't really know what to make of it, but here's the story!",
        "created_utc": 1413341551,
        "upvote_ratio": ""
    },
    {
        "title": "Racoouldnt.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2j6703/racoouldnt/",
        "text": "I was driving on a dirt road when I came around the corner and hit a raccoon. I tried to avoid him with my wheels, but I felt the impact the creature.  I stopped and reversed but it was nowhere to be found. \n\nThe imprint of my tires were solitude in the lunar-like silt/dirt. ",
        "created_utc": 1413248352,
        "upvote_ratio": ""
    },
    {
        "title": "Did I teleport myself and my car?",
        "author": "zote84",
        "url": "http://www.reddit.com/r/GlitchInTheMatrix/comments/2j5d0a/did_i_teleport_myself_and_my_car/",
        "text": "This is actually my 2nd teleportation glitch, see [wrench in the headlight](http://www.reddit.com/r/Glitch_in_the_Matrix/comments/14vwr7/wrench_in_the_headlight/).\n\nIt was a 2 hour drive late at night and after a long day. I was nodding off momentarily so I decided to pull over and take a nap despite being less than 30 minutes from home. I don't think I was out more than an hour when I awoke and decided to continue. I couldn't find the freeway after trying to take what I thought would be a shortcut. I vaguely knew where I was but didn't know how to get back to the freeway. Being very tired I soon pulled off the road and fell asleep.\n\nWhen I awoke before sunrise, I knew exactly where I was: a mere 1/4 mile from my house and on the UCSD college campus. I have been here many times, I am very familiar with the area, and my girlfriend attends this school. This is not where I pulled over to sleep. I distinctly remember being 10 miles North. I apparently crossed 2 freeways, including the one I was looking for, and parked on campus without even recognizing anything. It is very difficult to even get to UCSD from the North without getting on a freeway.\n\nMaybe I was just really tired and hallucinating but I wasn't drunk or high. Maybe I was sleep driving?\n",
        "created_utc": 1413231916,
        "upvote_ratio": ""
    }
]