[
    {
        "title": "One of my students wants me to write them a med school recommendation. I feel unqualified?",
        "author": "PerceusJacksonius",
        "url": "https://www.reddit.com/r/GradSchool/comments/100qmw9/one_of_my_students_wants_me_to_write_them_a_med/",
        "text": "Basically, I was a TA last semester for a biology related class. The class had a large lecture complement that a professor led and then a few TAs including myself led a few discussion based classes once per week. \n\nI have a student who was great, they did very well, came to office hours most weeks, and was a good active participant in discussion. \n\nOver the break, the student sent me an email asking if I could be one of their med school recommenders in the spring as a past teacher. I wouldn't mind writing one as I only have good things to say, but aren't I as just a graduate student a bit unqualified? Our professors that led the class aren't accepting anymore requests for letters of rec for the year, so I can't suggest they ask them. I want to help them out, but I also feel like by saying yes I could be doing them a disservice by potentially harming the strength of their application. \n\nHas anyone been asked this before and have advice? If I should definitely turn them down, how to do so, or maybe if it is actually common for TAs to write med school letters of recommendation?",
        "created_utc": 1672599932,
        "upvote_ratio": 1.0
    },
    {
        "title": "Purpose of PhD degree",
        "author": "SatisfactoryHuan",
        "url": "https://www.reddit.com/r/GradSchool/comments/100q7n0/purpose_of_phd_degree/",
        "text": "[removed]",
        "created_utc": 1672598816,
        "upvote_ratio": 1.0
    },
    {
        "title": "Professors, if you don’t remember a former student enough to just instantly write a reco letter, what steps do you take to refresh your memory?",
        "author": "VicWoodhull",
        "url": "https://www.reddit.com/r/GradSchool/comments/100q0sg/professors_if_you_dont_remember_a_former_student/",
        "text": "",
        "created_utc": 1672598323,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is leaderships to you ?",
        "author": "NeomiahsMom314",
        "url": "https://www.reddit.com/r/GradSchool/comments/100phmz/what_is_leaderships_to_you/",
        "text": "",
        "created_utc": 1672596929,
        "upvote_ratio": 1.0
    },
    {
        "title": "Touring schools BEFORE applying?",
        "author": "Unknown_Afactor",
        "url": "https://www.reddit.com/r/GradSchool/comments/100ozm0/touring_schools_before_applying/",
        "text": "[removed]",
        "created_utc": 1672595611,
        "upvote_ratio": 1.0
    },
    {
        "title": "Review of Diversity Statement for Standard",
        "author": "ProjectLess3978",
        "url": "https://www.reddit.com/r/GradSchool/comments/100ov19/review_of_diversity_statement_for_standard/",
        "text": "[removed]",
        "created_utc": 1672595281,
        "upvote_ratio": 1.0
    },
    {
        "title": "Review SOP for Stanford",
        "author": "ProjectLess3978",
        "url": "https://www.reddit.com/r/GradSchool/comments/100ol5v/review_sop_for_stanford/",
        "text": "[removed]",
        "created_utc": 1672594539,
        "upvote_ratio": 1.0
    },
    {
        "title": "Invited to a graduate recruitment event?",
        "author": "Lyrae74",
        "url": "https://www.reddit.com/r/GradSchool/comments/100oic1/invited_to_a_graduate_recruitment_event/",
        "text": "I’ve applied to a number of biology PhD programs with an anticipated start date of fall 2023. I just got an email from one of the programs inviting me to a “recruitment event”. They’ve offered to pay for my flights/hotel/all expenses so I can come (schools on the other side of the country if that makes a difference). I’ve already talked with a professor at this university who’s said they were interested in me joining their lab before I applied. \n\nIs it a good sign that I got invited and is it worth it to go? If things go well am I likely to get an offer from the school? If so how should I prepare for this weekend, what should I wear, and should I come prepared with questions or do other research before hand?",
        "created_utc": 1672594328,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on getting employer tuition reimbursement 2 year retention waived.",
        "author": "BrainDistinct",
        "url": "https://www.reddit.com/r/GradSchool/comments/100moqv/advice_on_getting_employer_tuition_reimbursement/",
        "text": "Hi all,\n\nI am starting a MS a program this semester but am still working out funding details with my employer. My employer is a small company who just instituted a real tuition reimbursement plan and it requires 2 years of work after receiving any tuition reimbursement. They have offered to cover about 50% of tuition (IRS limit). Taking one class a semester, the program will take about 2-3 years. \n\nAlthough I like my job, I do not plan on completing this degree program at this employer as I will be moving within the next 2-3 years to a new city. For personal reasons I can’t “just wait it out” and I want to start now given the length of the program and I can’t afford to pay for it myself. My employer is very flexible so I may have a good shot at negotiating out of this stipulation but am interested in hearing others experiences with this. Thanks.",
        "created_utc": 1672589203,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling to finalize the research topic for my thesis proposal",
        "author": "ParticularBack",
        "url": "https://www.reddit.com/r/GradSchool/comments/100lr1y/struggling_to_finalize_the_research_topic_for_my/",
        "text": "Hi there, I'm a senior year business student, and this is my last semester. For the Capstone project, I'm writing a Thesis. I'm interested in Behavioral Economics (choice architecture, nudge theory, and default preference setting). I need help finding a feasible research topic in these areas for the Thesis writing. The biggest challenge is finding data. I'd like to know where you find data for your research projects or what pages you visit to find inspiration for your research topic.",
        "created_utc": 1672586427,
        "upvote_ratio": 1.0
    },
    {
        "title": "To leave or not to leave full-time MSW program?",
        "author": "Jaded_Dimension9685",
        "url": "https://www.reddit.com/r/GradSchool/comments/100ie76/to_leave_or_not_to_leave_fulltime_msw_program/",
        "text": "Background: I was an overachiever in undergraduate and really involved in clubs, studied abroad, lots of internships in HR. I majored in non-profit admin and French in college. My plan was to do a gap year and teach English in Spain, then apply for graduate school, which I did. Tbh, my mistake was rushing into grad school without a clear sense of direction. \n\nI applied and was accepted into a MSW program from where I got my undergraduate degree. I also received a graduate assistantship that will fund me for 2 years. \n\nI began the program this fall and I hated it. The content isn’t engaging and the class discussions aren’t lively or engaging. I don’t want to be a social worker. \n\nEveryday, I space out and think about how I should have done one more year in Spain, but at the same time, I don’t want to avoid adulthood. I see my friends making $50,000/$55,000 and realized I’ll be making $45,000 coming out with an MSW. \n\nI thought of doing macro social work, but when I go to indeed, a lot of those roles don’t require a Masters… I don’t see the point of slaving away for 2 more years just to make less or the same starting out that I can make now. \n\nI want to go back to HR, but I also go back and forth about wanting to stay in the program for the sake of getting a free masters… I’m very conflicted, any advice appreciated.",
        "created_utc": 1672575120,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any Thread/Sub-reddit for 2023 PhD application?",
        "author": "Late_Difficulty_7938",
        "url": "https://www.reddit.com/r/GradSchool/comments/100gx95/any_threadsubreddit_for_2023_phd_application/",
        "text": "",
        "created_utc": 1672568785,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mastering out of PhD",
        "author": "wearson41",
        "url": "https://www.reddit.com/r/GradSchool/comments/100cnm5/mastering_out_of_phd/",
        "text": "[removed]",
        "created_utc": 1672550675,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I committing career suicide? Should I commit regular suicide?",
        "author": "DenseSemicolon",
        "url": "https://www.reddit.com/r/GradSchool/comments/100arnu/am_i_committing_career_suicide_should_i_commit/",
        "text": "Is it true that as a humanities PhD I'm going to be disqualified for all jobs outside of academia? I know people who went into industry or related fields but other people have told me those jobs are for nepo babies. If you have a PhD you're overqualified for most jobs so they will never, ever take you. The academic market is a shitshow but I don't have much going for me otherwise. It's my third year, so too late to put out pubs worth a damn. Language knowledge isn't worth anything either, anyone can be good at a language. Should I just end it all now since I'll be effectively unemployable no matter what?",
        "created_utc": 1672543442,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cover Letter?",
        "author": "mattpit",
        "url": "https://www.reddit.com/r/GradSchool/comments/10097qg/cover_letter/",
        "text": "I’m currently applying to a Master’s Program. I have written two essays on my career aspirations and how I got where I am today, but then I saw that they also requested a cover letter, which seems odd to me. I’ve only ever written cover letters for jobs  and have no idea what i would put in a cover letter that hasn’t already been said in two essays and a resume. Has anyone else had to write a cover letter on top of essays for a master’s program before?",
        "created_utc": 1672538045,
        "upvote_ratio": 1.0
    },
    {
        "title": "What department would this thesis be done in? (pls read text)",
        "author": "gracie_780",
        "url": "https://www.reddit.com/r/GradSchool/comments/1008ko8/what_department_would_this_thesis_be_done_in_pls/",
        "text": "Sorry for this question in advance, I know it sounds kind of dumb!\n\nI’m majoring in computer science, and am considering going to grad school.\n\nHowever, in terms of what thesis to do, i was leaning towards something non technical, such as things on the line of IMPACTS of different tech (that is in no way a thesis, just a general thought to help you understand what I mean by non technical), or just something not related to finding new technological advancements, but something pertaining to how the present technological science affects society, in a social or biological perspective.\n\nWould i be doing my masters within the faculty of computer science/informatics, or would it be in an arts department?\n\nWould it be a hindrance for me applying to masters programs? It’s related to computer science, but not technical, so would they feel that it’s too much of a divergence from my undergraduate major?\n\nThank you so much!",
        "created_utc": 1672535914,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting M.A. abroad in Mexico in Spanish?",
        "author": "JoeTheSmhoe",
        "url": "https://www.reddit.com/r/GradSchool/comments/1006ybp/getting_ma_abroad_in_mexico_in_spanish/",
        "text": "I am a current undergrad majoring in English at a University of California. I've been studying Spanish for quite some time now and am fairly confident I can become fluent by the time I'd attend a masters program in Mexico. But more importantly...\n\nHow can one apply for a masters at a Mexico university? The best looking university I see is National Autonomous University of Mexico, but there post-grad section on there website doesn't work. I am not familiar with how applications go when applying as a foreigner / abroad. I see third party websites offering applications (like SMAPSE) but seems sketchy.\n\nThe reason I want a masters in Spanish *from* a Mexico-based university is because 1.) I want to immerse myself in the culture to improve my fluency -- two years in mexico city / mexico would be great for that 2. I want a \"stamp\" of fluency in Spanish on my resume, this may be a stupid idea, but I feel like having a \"M.A. Spanish - \\[Insert Mexican University here\\]\" would really give me a leg up on teaching jobs, especially since where I want to live / teach (california) always has a huge emphasis on being bilingual since they have high Spanish-speaking student %'s. If possible, I would love to teach spanish at the university level.\n\nAfter my masters, I fully intend to return to the United States to get my PhD in English, as my ultimate goal is to teach writing / english at the university. I understand some of the limitations of having a foreign masters degree, but as far as I can see it would only bolster my resume, and I have professors who have masters / PhD's from outside of the United States, so I don't think it will hurt me.\n\nTl;dr -- how do I apply for a masters in spanish to a mexico-based university as an American citizen?",
        "created_utc": 1672530696,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asking Advisor to Augment Stipend to a Livable Wage",
        "author": "Backda23",
        "url": "https://www.reddit.com/r/GradSchool/comments/1006vat/asking_advisor_to_augment_stipend_to_a_livable/",
        "text": "[removed]",
        "created_utc": 1672530424,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I get feedback on my Letter of Purpose from this sub?",
        "author": "bckyltylr",
        "url": "https://www.reddit.com/r/GradSchool/comments/100583m/can_i_get_feedback_on_my_letter_of_purpose_from/",
        "text": "I don't have any family that has been to school before and I am trying to enter a Masters Program. I'm not sure if my letter is appropriate or just a lot of crap that no one will care about. \n\n&amp;#x200B;\n\nCan I ask here for feedback? Would it be a bad idea to publish my letter to strangers on the internet?",
        "created_utc": 1672525342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Regular periods of low productivity",
        "author": "Sad-Amoeba-5315",
        "url": "https://www.reddit.com/r/GradSchool/comments/10041rp/regular_periods_of_low_productivity/",
        "text": "I am into Gradschool (Phd. student) for almost a year. Every month I have periods of high productivity lasting 10-12 days followed by a low productivity phase during which I just procrastinate and have no motivation to do my work.  \n\n\nI am wondering if others also suffer from similar issues and how does one get over them?",
        "created_utc": 1672521850,
        "upvote_ratio": 1.0
    },
    {
        "title": "Masters in CS",
        "author": "Competitive-Round197",
        "url": "https://www.reddit.com/r/GradSchool/comments/1002yjv/masters_in_cs/",
        "text": "[removed]",
        "created_utc": 1672518691,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does PhD GPA matter?",
        "author": "grrr112",
        "url": "https://www.reddit.com/r/GradSchool/comments/1002tae/does_phd_gpa_matter/",
        "text": "I'm doing a humanities PhD and ended my first semester with 2 A's and 1 B+. The B+ came as a bit of a shock, though it was for a class I did struggle with quite a bit. I'm thinking about asking the professor if there's any way I could submit a revised version of the final paper to bring the grade up but not sure how likely that is.\n\nI was wondering if anyone could give me a sense of how important PhD coursework grades are for things like grants and fellowships (both pre-dissertation and dissertation research)? I would assume they wouldn't have much bearing when it comes to postdoc applications/job search but please correct me if I'm wrong. \n\nTIA!",
        "created_utc": 1672518266,
        "upvote_ratio": 1.0
    },
    {
        "title": "Degree question",
        "author": "Macxmc",
        "url": "https://www.reddit.com/r/GradSchool/comments/1002kz1/degree_question/",
        "text": "[removed]",
        "created_utc": 1672517605,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it wise to enroll in a graduate program right after undergrad?",
        "author": "LearnandGrowAll",
        "url": "https://www.reddit.com/r/GradSchool/comments/10024tz/is_it_wise_to_enroll_in_a_graduate_program_right/",
        "text": "I was ecstatic to complete my undergraduate program due to the outrageous workload and stress. However, I begin graduate school in January, which is less than a two-month-break. \n\nI have heard the program is not difficult, but I will be transitioning to a full-time job as well. \n\nTruthfully, school has been an important aspect of my life for a while, and it is unfortunate I do not know when to take a break. \n\nThe piece of paper attracts me.",
        "created_utc": 1672516311,
        "upvote_ratio": 1.0
    },
    {
        "title": "Humanists and historians: how do you organize research projects and primary sources?",
        "author": "orchestraldreamer",
        "url": "https://www.reddit.com/r/GradSchool/comments/10018tc/humanists_and_historians_how_do_you_organize/",
        "text": "Hi all, happy New Year! I'm thinking of revamping my system for keeping research ideas and sources organized and am wondering what others do. \n\nBasically, I usually have 5-10 different projects or ideas for projects on the back burner in addition to my current focus, and I want a good, low-effort way to collect and organize relevant primary and secondary-source material for those projects I find it. I currently just dump everything I find in a Word doc (saved in Dropbox) for each project and use Zotero for citations, but I'd ideally like something a bit more streamlined and possibly more visual (bonus points for if it links cited quotations to the relevant place in PDFs of articles but can also accommodate photos of books and primary sources). I work on both a PC and an iPad, and an ideal solution would be something I could at least view on both devices. \n\nSo: what's your system? Do you know of something that would work for me?",
        "created_utc": 1672513739,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a Doctorate of Philosophy in Physics worth it financially?",
        "author": "Forward-Razzmatazz18",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzzzav/is_a_doctorate_of_philosophy_in_physics_worth_it/",
        "text": " Relative to starting work after earning a BD in a related field.\n\nMoved from r/AskAcademia to be more on topic or whyever they removed it.",
        "created_utc": 1672510154,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much does it cost?",
        "author": "Loud-Direction-7011",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzzgrs/how_much_does_it_cost/",
        "text": "Most PhD applications cost money, so I’m just wondering how much it might cost to apply to 10-20 programs. I’ll probably do 15. I want to be able to save up enough.",
        "created_utc": 1672508776,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was your experience of taking a break/ graduating late before applying for grad school?",
        "author": "cheerfulsmile",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzzb86/what_was_your_experience_of_taking_a_break/",
        "text": "I'm graduating late after doing an extra semester and taking one off. I'm in my 5th year of being in university. \nFriends I started university with are either working or in grad school. \nI'm also starting grad school applications next year. So my peers have gotten jobs/ into grad schools as well.\n\nI'm feeling unsure of the decisions I've made even though they were for a valid reason(my mental health + COVID). I don't regret taking a break but I would love to hear stories from people who took a break/ a year off before applying to grad school.",
        "created_utc": 1672508346,
        "upvote_ratio": 1.0
    },
    {
        "title": "(untraditional) Undergrad Major &amp; Grad school",
        "author": "Eastern_Car8764",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzy5sd/untraditional_undergrad_major_grad_school/",
        "text": "[removed]",
        "created_utc": 1672505165,
        "upvote_ratio": 1.0
    },
    {
        "title": "What can I do to max out my application?",
        "author": "Thrownaway_BC",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzw1te/what_can_i_do_to_max_out_my_application/",
        "text": "I’m a rising junior feeling anxious my application isn’t “good enough” after reading too much grad cafe. If you could read over some of my general stats and tell me where I stand that would be great.\n\nI’m in undergrad.\n\nI’m trying to get into a clinical psych program (PhD) I’m striving for my focus to be centered around children. \n\nI’m a double major double minor\nBS Psychology (Honors) GPA: 4.0 (UW)\nBA Literature (Honors) GPA: 3.99 (UW)\nChemistry (Honors) minor GPA: 4.0 (UW)\nCommercial Spanish (Honors) minor GPA: 4.0 (UW)\n\n\nGRE is optional at a lot of the places I’m applying to but I took a practice test and these were results\nVR: 167\nQR: 168\n\nAt the time I apply I will have 2.5 years research experience as a school liaison and hopefully be working with CASA (advocates for children in court) for about a year. I also have some research experience in a lab unrelated to psych (chem research). \n\nI’m part of Psi Chi and another psychology club at my university.\n\nI have 3 professors who have offered to write me a recommendation, one of them is the assistant dean of the English department and one of them is my research advisor.\n\nI also have about 1,000 hours of unrelated volunteer experience \n(PAWS, the alliance against seclusion and restraint and others) in leadership positions. By the time I apply I will have about 1,500 hours hopefully.\n\nIs there anything else I can do to make myself more appealing to grad schools?",
        "created_utc": 1672499248,
        "upvote_ratio": 1.0
    },
    {
        "title": "May Graduation",
        "author": "Bgitmarie",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzv5jh/may_graduation/",
        "text": "As 2022 comes to a close and I prepare for the upcoming semester, I’d like some advice. I walk across the stage for graduation in May and this Spring semester is my “last” (taking summer classes) of completing my MBA. What are some things to focus my attention on this semester? Yes the generic things like; network, apply to jobs, etc. what are more actionable things? For more insight in my life: although I work FT now, in August I’m taking a gap period to travel and have fun before diving into my dream career, should I solely focus on school or try to study for some certification? Should I start dating people in my program? Marriage is important to me but I held off on dating seriously because I wanted to focus on school. Should I be relaxing? What are things people did or wish they did in their last semester?",
        "created_utc": 1672496572,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best dressing format for an online PhD interview?",
        "author": "aglowraph",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzrmer/what_is_the_best_dressing_format_for_an_online/",
        "text": "",
        "created_utc": 1672484373,
        "upvote_ratio": 1.0
    },
    {
        "title": "Personal statement",
        "author": "porqueepinee",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzrgvm/personal_statement/",
        "text": "What does one actually write in a personal statement? Many help is appreciated!",
        "created_utc": 1672483784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would It Be Weird to Thank My Recommendors With Gift Baskets?",
        "author": "JacksonCorbett",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzp0mm/would_it_be_weird_to_thank_my_recommendors_with/",
        "text": "I'm so happy and thankful to my professors who gave me letters of recommendation for grad school. For context, the minimum number of recommendors needed to even be considered is 3. Last year, I got only 2 because the third bailed on me. Because of that I was considered for 0 out of the 15 universities I applied to (that's over a thousand dollars of application fees). But this year, I got 4 magnificent professors to help me out!\n\nSo I'm thinking about gifting them gift baskets. Specifically environmentally friendly vegan fruit gift baskets (they're environmentalist professors)\n\nBut would that be weird/over the top. It's just they've done so much for me I feel that this would be a way to express my gratitude.",
        "created_utc": 1672473858,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to switch programs within the same department?",
        "author": "Momokyuu",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzouzr/is_it_possible_to_switch_programs_within_the_same/",
        "text": "I applied for the applied math PhD program at my university since my end goal is to be an industry researcher instead of academic (the academic life seems rough) but my real passion lies in pure math (my original aspirations were in algebraic combinatorics) and after having taken applied math courses for the first time in the fall, I've realised I don't really enjoy it even though I did well so I want to stick to pure math even if finding a job will be harder. Is it possible to switch to the pure math program if I get in? Both programs are in the same department but the pure math program is probably a lot harder to get into considering my university is very well regarded for pure math but not very much so for applied math. On the other hand, the applied math program is very theoretical and is almost no different from a pure math program but I assume my potential advisors will not include pure mathematicians and thesis will have to focus on some applied topic.",
        "created_utc": 1672473263,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey! 4th year PhD student, 3-5 months left and 1 paper submitted out of 3. For 2023 I need a miracle.",
        "author": "HainiteWanted",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzmk1t/hey_4th_year_phd_student_35_months_left_and_1/",
        "text": "",
        "created_utc": 1672464888,
        "upvote_ratio": 1.0
    },
    {
        "title": "GPA question",
        "author": "Appropriate-Tea-3540",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzldkn/gpa_question/",
        "text": "[removed]",
        "created_utc": 1672461067,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much can a committee member ask for?",
        "author": "GradStuAbroad25",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzl5w1/how_much_can_a_committee_member_ask_for/",
        "text": "Hi Everyone,\n\nSo, I am a 3rd year PhD student (in the US) and I had to replace a member of my committee. Now the new member is asking me to take his course and do experiments related to his area of expertise. My PI told me that this is insane and that if I do everything that this member is asking for, I will need another 5 years in grad school. Today I sent this member an email explaining that I will not be taking his course and also will not do the work he is requesting. Has anyone had a similar experience? Can a committee member get me in trouble for not doing what he wants me to?",
        "created_utc": 1672460386,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stressing over Letters of Recommendation- Any help appreciated &lt;3",
        "author": "Reus112",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzkzp8/stressing_over_letters_of_recommendation_any_help/",
        "text": "I was wondering if you should ask for letters of recommendation immediately after graduating even if you're not sure if you're going to apply to grad school. I'm afraid that the longer I wait, the less my professors will remember about me. I'm worried if I decide to apply to grad school next year, that my professors will have little recollection of me by then so I should just ask for them now just in guess I do end up applying. I think I may have an incorrect  understanding of how letters of recs work but this has been severely stressing me out and damaging my mental health:(",
        "created_utc": 1672459843,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dear IRTA GPP PhD student Fellows... where yall at?",
        "author": "TheGuyWithThePotato",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzkga4/dear_irta_gpp_phd_student_fellows_where_yall_at/",
        "text": "I'll explain. I feel I've met plenty of Postdocs, but have yet to run into any predoc trainees. Big reason why I'm asking is because I'm curious if there is any one or group that advocates for us. This is my first year and I'm feeling defeated. Not because of the work or time commitments, but honestly... the stipend is garbage. What are we doing about this and why do I feel like no one wants to talk about it?\n\nI keep seeing things about training that should make grad students happier and better balanced. I wouldn't feel so unbalanced if I didn't have to fork over more than half of my income to rent alone. Is no one really seeing this or am I just the only poor kid eating a pop tart for lunch at the corner of the cafeteria?",
        "created_utc": 1672458165,
        "upvote_ratio": 1.0
    },
    {
        "title": "Transferring programs",
        "author": "seeking-jamaharon",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzivh3/transferring_programs/",
        "text": "Hi all, I am a first year PhD student and have very quickly realized my program is not what I was looking for. My advisor is super checked out, I HATE the city I’m in, and the research I have access to is not actually what I want to be doing. I want to transfer programs. I do have funding through 2026 but I suspect it will take me that long to finish my MA. Should I master out and go somewhere else for the PhD? How can I set myself up to be competitive in another cycle?",
        "created_utc": 1672453534,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you stay motivated when you're feeling burned out?",
        "author": "CyoteOneOne",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzgh7p/how_do_you_stay_motivated_when_youre_feeling/",
        "text": "This isn't meant to be particularly deep. I have my January master's exams coming up in a week or so;, been preparing loads but very worried I'm not gonna do well and wondering if all this is for me (probably just negative head talk). My plan is to do a PhD after so this is just stress deriding me but just a bit tired now I guess. What do you guys do or say to yourselves to keep going?\n\nn.b. please don't tell me to rethink doing the PhD at this point with literally a week before my master's exams. That isn't going to help my motivation right now. I mention this because on virtually every post I make about my future plans I'm told to give up now and while I normally ignore these comments, now is not a good time to say that me.",
        "created_utc": 1672446881,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did you not want a PhD at first, but then changed your mind? What was the reason?",
        "author": "mental_dissonance",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzg6p1/did_you_not_want_a_phd_at_first_but_then_changed/",
        "text": "",
        "created_utc": 1672446102,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does an interview or lack thereof equate to admission vs rejection?",
        "author": "LonelyBiochemMajor",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzg31x/does_an_interview_or_lack_thereof_equate_to/",
        "text": "I am from Canada so I’m not sure about the admissions from US universities. I applied to PhD programs and I’m wondering if no interview invite means rejection? It’s only been a couple weeks since my application was submitted, so I’m not too worried yet but I am unsure about how it works. \n\nAlso, will I receive an email about an invite? Or do I have to consistently check my applicant portal to see if I got one? \n\nThanks!",
        "created_utc": 1672445838,
        "upvote_ratio": 1.0
    },
    {
        "title": "dropping out?",
        "author": "oortofthecloud",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzfagk/dropping_out/",
        "text": "[removed]",
        "created_utc": 1672443816,
        "upvote_ratio": 1.0
    },
    {
        "title": "Go for a Ph.D. or back to the industry?",
        "author": "mydoggoisfine",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzevpm/go_for_a_phd_or_back_to_the_industry/",
        "text": " Hi folks,\n\nI've read quite a bit of threads about heading for a Ph.D. or working in the industry but still wondering about my coming choice. A bit of my context: migrated to Canada, about to graduate with a master's degree in materials science in Canada, and had 3+ years in a renowned US company (in manufacturing, not the materials science field) before moving back to academia.\n\nMy career goal (but not restricted to) is to be involved at a technical executive level in a corporate (but again, not restricted to). With quite acceptable results during my program (GPA: 4.0/4.0, published 4 papers at the time of graduation), I'm considering taking a Ph.D. in a prestigious institution. I do love science and want to pursue the research field but considering it context-wise (3+ years of experience), and financial-wise (aggression, low payment of a Ph.D. candidate) makes me rethink it.\n\nThanks,",
        "created_utc": 1672442754,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone received a master's in science-related research?",
        "author": "PartAdmirable3864",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzdfnk/has_anyone_received_a_masters_in_sciencerelated/",
        "text": "[removed]",
        "created_utc": 1672439107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone received their master's in science-related research?",
        "author": "PartAdmirable3864",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzdeed/has_anyone_received_their_masters_in/",
        "text": "[removed]",
        "created_utc": 1672439016,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for advice",
        "author": "QualityNarrow3840",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzd2c2/looking_for_advice/",
        "text": "Looking for advice about masters\n\nWhat’s up y’all, so I’m about to graduate with my bachelors in Criminal Justice. I have the opportunity to get my masters paid for but not sure exactly what to study. I know I’m not going to get it in CJ because that is pretty useless quite frankly. What do y’all think is a good masters to get with a BA in CJ? I was thinking political science, communications, or honestly just going into a completely different field like finance. I know that would be hard but it’s very doable. Or should I just get a second bachelors?",
        "created_utc": 1672438174,
        "upvote_ratio": 1.0
    },
    {
        "title": "should I be more paranoid about grad school writing?",
        "author": "Path-Majestic",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzbwjd/should_i_be_more_paranoid_about_grad_school/",
        "text": "Current undergrad senior here gearing up to start writing grad school personal essays (master of social work). I know I’m a reasonably strong writer, but I’m thinking back how much pressure was put on writing the perfect personal essay for undergraduate applications and even now for programs like med/law school. Is this pressure warranted? Is the level of personal essay writing way harder in grad school? Or am I just blowing it out of proportion?",
        "created_utc": 1672435300,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hiring a neurophysiology postdoc!",
        "author": "Amygdalohippocampus",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzbdox/hiring_a_neurophysiology_postdoc/",
        "text": "We would love to have you as a postdoc!  \n\nI'm looking for someone willing to start early to mid 2023. Position is at a major research university and medical center. More details upon messaging me (so I can avoid spam and spurious requests). \n\nThe position requires a Ph.D. in engineering, neuroscience, or a related field, with proficiency in MATLAB and/or computer programming. Prior experience in imaging or electrophysiology and/or signal processing is preferred but not required! Excellent opportunity to work among scientists, clinicians, and engineers at the forefront of neuroelectrophysiology and epilepsy research. \n\nIf you're willing to spread the word at your institution, please let me know, as this would be appreciated.",
        "created_utc": 1672434037,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for STEM grad students for a project to help create homework/exam questions (paid opportunity - $35/hr)",
        "author": "Magnificent-Mango",
        "url": "https://www.reddit.com/r/GradSchool/comments/zzbbkp/looking_for_stem_grad_students_for_a_project_to/",
        "text": "[removed]",
        "created_utc": 1672433900,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pursuing Second Masters Tips",
        "author": "stinkysneakyslinky",
        "url": "https://www.reddit.com/r/GradSchool/comments/zza4mh/pursuing_second_masters_tips/",
        "text": "[removed]",
        "created_utc": 1672430923,
        "upvote_ratio": 1.0
    },
    {
        "title": "A PhD supervisor fully plagiarised their former PhD student dissertation. His French University found him guilty. The sanction? They can't move up the salary scale anymore for the next two years. That's it.",
        "author": "aglowraph",
        "url": "https://www.challenges.fr/grandes-ecoles/paris-viii-un-enseignant-sanctionne-pour-avoir-plagie-la-these-de-sa-doctorante_839887",
        "text": "",
        "created_utc": 1672430799,
        "upvote_ratio": 1.0
    },
    {
        "title": "MSW or MS. Ed. in Counseling?",
        "author": "Affectionate_Ad2839",
        "url": "https://www.reddit.com/r/GradSchool/comments/zz9nw4/msw_or_ms_ed_in_counseling/",
        "text": "Interested in going to grad school. If anyone has info about what one can do with a MSW vs  MS. Ed. in Counseling?",
        "created_utc": 1672429800,
        "upvote_ratio": 1.0
    },
    {
        "title": "UT Austin vs John's Hopkins Online Computer Science Master's Program",
        "author": "_zer0_0ne",
        "url": "https://www.reddit.com/r/GradSchool/comments/zz9fn9/ut_austin_vs_johns_hopkins_online_computer/",
        "text": "[removed]",
        "created_utc": 1672429230,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any current University of Michigan PIBS PhD students here?",
        "author": "LiveFromUnderwater",
        "url": "https://www.reddit.com/r/GradSchool/comments/zz8sra/any_current_university_of_michigan_pibs_phd/",
        "text": "[removed]",
        "created_utc": 1672427692,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to answer supplemental question on grad school app",
        "author": "Rocks_for_Jocks28",
        "url": "https://www.reddit.com/r/GradSchool/comments/zz7elx/how_to_answer_supplemental_question_on_grad/",
        "text": "[removed]",
        "created_utc": 1672424225,
        "upvote_ratio": 1.0
    },
    {
        "title": "Letters of Recommendation Questions",
        "author": "Witnerturtle",
        "url": "https://www.reddit.com/r/GradSchool/comments/zz64nk/letters_of_recommendation_questions/",
        "text": "So I graduated a year and a half ago with an undergraduate degree in Math, and haven’t been able to find any work in my field so I want to go back to school and get a Masters. During my last year and a half of school, when I was taking most of my major related classes (which I did very well in) it was online and asynchronous because of COVID so I never even got to actually meet my professors. I have no idea where to even start looking for a letter of recommendation. Any advice?",
        "created_utc": 1672421189,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I spend this summer doing music?",
        "author": "king_kingcharles",
        "url": "https://www.reddit.com/r/GradSchool/comments/zz64k2/should_i_spend_this_summer_doing_music/",
        "text": "I'm currently a master's student in STEM and I'm starting my PhD this coming Fall 2023. I am committed to a career in science and academia, but music is a big passion in my life: when I started undergrad I was actually a music performance major. I quit as I didn't like the cutthroat nature of the classical music world and felt more passionate about science. However, before I quit, I participated in a summer music program that gave me a fellowship to study at a conservatory level, and over the years I've been wanting to return to music as a hobby. As such, I was thinking of using this summer, summer 2023, to audition for that program again. I would be able to regain some of the skills that evaporated when I stopped practicing, reconnect with old friends, and enjoy a summer in a really idyllic town, since I never get to travel. \n\nMy line of thought is that once I start my PhD, I will basically be starting my career in research, and I won't have time/it will be frowned upon to participate in something like this ever again (since summers are the most productive times for research). This might be my last chance to ever receive formal training in music for free, and my last summer to do something because I enjoy it, not for work. However, I am wrapping up my master's thesis this year, and am projected to defend at the end of the summer. Most people in my program spend this summer writing their thesis. It would take a lot of discipline and work to finish the majority of my thesis during the school year, before the summer, and focus on music over the summer while just editing my thesis. I also can't help but wonder if I should be using this summer to participate in a STEM internship or just focus on research, and I would be \"wasting my time\" by studying music. Does anyone have any thoughts on what I should do in this situation? Am I foolish for wanting to waste my summer like this?",
        "created_utc": 1672421183,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will European universities accept credits from a US community college for a Masters degree?",
        "author": "punicwars1",
        "url": "https://www.reddit.com/r/GradSchool/comments/zz578a/will_european_universities_accept_credits_from_a/",
        "text": "[removed]",
        "created_utc": 1672418935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I try to meet with faculty before applying to program",
        "author": "ImpPluss",
        "url": "https://www.reddit.com/r/GradSchool/comments/zz3u6m/should_i_try_to_meet_with_faculty_before_applying/",
        "text": "Hey guys,\n\n&amp;#x200B;\n\nKind of a follow up to a [recent post](https://www.reddit.com/r/GradSchool/comments/zoiwy8/a_couple_general_questions_about_what_constitutes/) on here...\n\n&amp;#x200B;\n\nAs I mentioned previously, I'm taking a gap year to try to publish a few sections of my master's thesis and cram a few conference presentations onto my CV before putting in doctoral applications.  \n\n&amp;#x200B;\n\nI'm in the humanities and my top pick school houses the archive of the author I'm planning to work with for my dissertation in their library's special collections.  I have an appointment with the library next week to access the archive for a project that I'm working on at the moment.\n\n&amp;#x200B;\n\nWondering if it would be worthwhile to reach out to a faculty member or two about getting coffee or having a quick talk while I'm on campus?  I can't seem to find any consistent recommendation either for or against doing this in any of the grad app guides I've looked over.",
        "created_utc": 1672415655,
        "upvote_ratio": 1.0
    },
    {
        "title": "Application to Grad School",
        "author": "MightySavier",
        "url": "/r/gradadmissions/comments/zyyggw/application_to_grad_school/",
        "text": "",
        "created_utc": 1672400384,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommended universities to study MS bioinformatics/comp biology for those with a pure wet-lab background?",
        "author": "No-Roll5444",
        "url": "https://www.reddit.com/r/GradSchool/comments/zytlo0/recommended_universities_to_study_ms/",
        "text": "[removed]",
        "created_utc": 1672382926,
        "upvote_ratio": 1.0
    },
    {
        "title": "In your experience, have you found an inverse correlation between grad school progress and the need to sleep with a blanket?",
        "author": "SeaHareKingdom",
        "url": "https://www.reddit.com/r/GradSchool/comments/zys8p1/in_your_experience_have_you_found_an_inverse/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/zys8p1)",
        "created_utc": 1672378510,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a 3.65 gpa good enough for grad school?",
        "author": "jeansarenice",
        "url": "https://www.reddit.com/r/GradSchool/comments/zyrpmv/is_a_365_gpa_good_enough_for_grad_school/",
        "text": "So I’m a BA Student for sociology. I went to CC and got my AA Psychology and sociology. I’m not applying until next fall but I got my GPA up a bit, (I transferred with a 3.50) it’s now a 3.65 and I have a university gpa of a 4.0 since transferring. I did 18 units this fall and I work full time as a mental health counselor at a facility step down from a psych hospital(in my state counselors only need to pass a certification exam, I’m not a therapist) and I do group therapy, one on one sessions and help them apply for welfare benefits. I’m on track applying to phd for sociology next cycle fall 2024. \n\nit’s safe for you all to assume that I have no social life, because I made a lot of bad choices when I was younger and partied too much. I had a substance use issue and I ended up homeless in CC and so I took off time to get housing and work. I got into a housing program and I’m now back on my feet. When I went through homelessness it affected my mental health and I failed almost all my classes one semester. When I went back after rehab and a year of getting back on my feet, I worked really hard and got straight A’s for a whole year. I’m worried that issue will effect my chances for grad school. \n\nI’ve done the same since transferring and I take my education really seriously. I got a TA position with a statistics professor at my Uni and I was able to get a Research assistant position at my uni next fall. I also applied for other out of state undergrad research positions for the summer and I’m  waiting to hear back from those. I also did independent research with my university and I submitted my research and got into the PSA, CSA and ASA (waiting on my panel assignment for ASA) to present. I just presented at the CSA and i got my panel assignment for medical sociology at the PSA this march. \n\nI have these extra curricular: \n-transfer honor society (I just had to register and have one yearly meeting) \n-Latinx cohort (I meet once a month; it’s a certificate program) \n-anthropology Club (I just meet every other week) \n-improv club (it’s once a week but it’s improv not really that strenuous) \n-mc nairs scholar \n-mentorship program (I’m a mentee and I meet with my mentor at my university once every two weeks) \n\nIve met with a few professors/grad students from universities I want to apply to and feel intimidated. I feel Ike because of my background and being the second in my family that went &amp; finished a BA and the first applying to grad school. I feel like I don’t know what I’m doing. I feel like my credentials aren’t enough and I’m worried my gpa will hold me back. I’ve worked so hard and I’m afraid having one bad semester will ruin my chances.",
        "created_utc": 1672376936,
        "upvote_ratio": 1.0
    },
    {
        "title": "English PhD at University of Michigan. How to increase my chances of acceptance?",
        "author": "Romanticdreamer3897",
        "url": "https://www.reddit.com/r/GradSchool/comments/zyrjuw/english_phd_at_university_of_michigan_how_to/",
        "text": "Basically, this school seems absolutely perfect for me. Their interdisciplinary track for English and women’s studies is exactly the kind of program I want to be in. I want very badly to get selected as I know it’s a fairly selective school in general. I know what documentation I need to provide already to apply because it’s outlined on the website, but I was hoping someone could offer more specific advice who has direct experience with the program? Or even just any of the grad programs at this school? I’m coming straight from undergrad pretty much (I graduated last year and I’ve been spending the past year working and saving money) but I did have a high gpa that I maintained while I was in school, and I am very passionate about my subject interest. I spend much of my free time learning about and reading material relevant to my field, and I want to prove to the people reviewing my application that I’m capable of handling it.",
        "created_utc": 1672376462,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it even worth it to fix a mistake like this?`",
        "author": "scrumchombo",
        "url": "https://www.reddit.com/r/GradSchool/comments/zypjxu/is_it_even_worth_it_to_fix_a_mistake_like_this/",
        "text": "I've seen threads with similar subject matter and usually the answer is that it's not particularly worth it, or that the committee won't notice. I am applying for a PhD in mathematics. My only real mistake was that, the application had me list all colleges I attended, so I had to list the local community college as one as I attended for dual credit courses. However, the start year for me was 2014, and I mistakenly put 2015 (I forgot that a particular class counted as dual credit in 2014).\n\nIs this something I should even go through the effort in contacting admissions to fix on my application? I doubt the dual credit courses are even of much importance when I am applying with a bachelors and a masters under my belt.",
        "created_utc": 1672370551,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fall 23 session application",
        "author": "Pushpita33",
        "url": "https://www.reddit.com/r/GradSchool/comments/zyphhl/fall_23_session_application/",
        "text": "[removed]",
        "created_utc": 1672370356,
        "upvote_ratio": 1.0
    },
    {
        "title": "Taking law school classes as a (non-law school) grad student",
        "author": "Historical_Eye_1776",
        "url": "https://www.reddit.com/r/GradSchool/comments/zyo5z4/taking_law_school_classes_as_a_nonlaw_school_grad/",
        "text": "I’m a grad student in history. My main research focus is legal history, so I was permitted to take two law school courses (legal history and legal philosophy) as a non-law school student this quarter.  \n\nHave any of you guys ever taken a law school class as a non-law school student? What was your experience like? Any advice on what to expect?\n\nI’m planning to talk to my professors once the quarter starts, but my main concern is that I’ll struggle in the courses as I won’t have the 1L curriculum. Would love to hear your thoughts!",
        "created_utc": 1672366700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it a better idea get Bachelors in MIS instead of CS and later get CS masters if I end up wanting more techy roles?",
        "author": "Putin666",
        "url": "https://www.reddit.com/r/GradSchool/comments/zymv4p/is_it_a_better_idea_get_bachelors_in_mis_instead/",
        "text": "I'm not sure about how good of a career computer science is anymore. Everyone says not to worry about CS getting over saturated because everyone drops out, meanwhile CS gradates have grown faster than any other field, over 100K CS bachelor graduates per year, more than double the rate several years ago. Also influx of people getting into the field from boot camps, and a quarter of all STEM majors go into the CS career path, and every social media influencer screaming at everyone to get into the field for easy 6 figures, plus out sourcing plus the tech layoffs all leads to new grads having no job, even with decent internships. Also because of this increased competition, to be a competitive CS new grad, you probably have to lock yourself in the basement for you entire college life and focus on getting super high GPA and then every free second on building skills and projects. The level of competition means the only way to be a competitive CS new grad is to sacrifice any semblance of social life. Work life balance is pretty important to me and CS might've have been good for it previously, but now it's probably over saturated. Meanwhile the MIS program at my college has 80K starting salary, and business is surely less time intensive than CS. I figure that if I want to get into the CS career, I can always learn those skills whether I have the degree, and maybe I can get masters in CS.\n\nMy questions: What do you think about graduating with a CS degree vs MIS? Which would have better work life balance? Is it realistic to be able to get a CS Masters with an MIS undergrad degree?",
        "created_utc": 1672363317,
        "upvote_ratio": 1.0
    },
    {
        "title": "I will be graduating with my PhD in biomedical science, and I am thinking of going into patent law. But what if I want to go back to research? Would it be difficult to get an industry position as a research scientist after a few years working outside of science?",
        "author": "Alternative-Habit-25",
        "url": "https://www.reddit.com/r/GradSchool/comments/zymcyz/i_will_be_graduating_with_my_phd_in_biomedical/",
        "text": "I’ve pretty much exclusively worked in lab environments and I don’t have any experience with law, but it’s an interesting path and I wanted to be a lawyer when I was a kid (thanks Elle Woods) but I chose science instead. A friend that recently graduated went into patent law and he loves it so far, and I thought it would be a good combination of science and law. I would be a scientist working on patents related to biomedical devices, drugs, etc. invented by individuals and companies. But if I hate it and I have an itch that only a pipette can scratch, would I be able to re enter the science field maybe after a max of 5 years? Has anyone done something similar? I would definitely go into industry and not academia.",
        "created_utc": 1672362054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I get my Ph.D?",
        "author": "kang1227",
        "url": "https://www.reddit.com/r/GradSchool/comments/zylrw6/should_i_get_my_phd/",
        "text": "I'm currently a junior in undergrad majoring in biochemistry. I have always loved chemistry since I first took the class in high school and have since plunged myself into the life/physical sciences. However, I have always wanted to be a surgeon for like my entire life. Recently, since like the middle of my sophomore year, I have started to change my mind about going to medical school and have recently been thinking about going to school to get my Ph.D in chemistry instead. However, after browsing subs like these, people have said that a Ph.D should only be pursued if absolutely necessary. My plan for getting a PhD is to work in industry after completing my studies. Should I just pursue my previous med school dreams or is pivoting to the pursuit of a PhD actually a good idea?",
        "created_utc": 1672360527,
        "upvote_ratio": 1.0
    },
    {
        "title": "vent: I’m a hair away from dropping out.",
        "author": "starbucksdrinker97",
        "url": "https://www.reddit.com/r/GradSchool/comments/zyk6rf/vent_im_a_hair_away_from_dropping_out/",
        "text": "I’ve been in my school counseling masters program since June 2021, and now i am officially halfway done (expected grad in 2024). Despite winter term starting next tuesday, I still haven’t signed up for classes. This time last year, I was itching to be back in class, but this year, even my monthlong holiday break isn’t enough. Every day is tinged with the fear or returning to class. Compound this dread with guilt over not being grateful to be in my ‘dream program’ (ha, a joke), and here I am. I don’t. Want. To go. Back. I am so burnt out. I am so tired. I am frustrated with how the program is working, due to our school falling apart. \n\nSomeone tell me it’s worth it.",
        "created_utc": 1672356713,
        "upvote_ratio": 1.0
    },
    {
        "title": "Survey for thesis",
        "author": "Msifan3",
        "url": "https://www.reddit.com/r/GradSchool/comments/zyj3k8/survey_for_thesis/",
        "text": "[removed]",
        "created_utc": 1672354132,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unsure of Best Research Fit for Grad School",
        "author": "greenteaandbook",
        "url": "https://www.reddit.com/r/GradSchool/comments/zygj5m/unsure_of_best_research_fit_for_grad_school/",
        "text": "I'm finishing up my undergrad and deciding on what to pursue for grad school. I originally planned to pursue a masters in immunology to work in industry. However, a combination of bad experiences with the working environment at an internship I did in an industry lab (overworked, not much recognition, aggressive lab members and lack of support from my supervisor despite appearing as supportive when in public) and discovering that protocols can get very boring when you're doing multiple replications of an experiment, I'm not sure if this field is the right for me anymore. Part of me wants to give it a chance since I enjoyed my classes in molecular biology a lot and I'm not sure if I'm disillusioned about the field because of my negative workplace experiences or because I really do dislike wet lab research in and of itself.\n\nI enjoy creating tools to help the scientific process and also enjoy a application/solution-oriented approach to research so I've been interested in biomedical enginering or bioinformatics as alternative fields to pursue. Concerning bioinformatics, I'm quite interested in protein design/engineering using computational tools. Tissue engineering and biomaterials is also quite fascinating but my understanding is that these probably involve a lot of wet lab work. Is there anyone in these fields that can tell me about what their day to day is like in the lab and career prospects in these fields? The thought of ending up in a similar lab environment to the one I was in previously makes me very anxious about applying to grad school, so I'd appreciate any advice on what to consider when contacting labs as well.",
        "created_utc": 1672348163,
        "upvote_ratio": 1.0
    },
    {
        "title": "Applying to Grad School- Unsure of Best Research Fit",
        "author": "yellow_benzene",
        "url": "https://www.reddit.com/r/GradSchool/comments/zygchx/applying_to_grad_school_unsure_of_best_research/",
        "text": "[removed]",
        "created_utc": 1672347730,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unsure of Best Research Fit",
        "author": "yellow_benzene",
        "url": "https://www.reddit.com/r/GradSchool/comments/zyg9p6/unsure_of_best_research_fit/",
        "text": "[removed]",
        "created_utc": 1672347567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question",
        "author": "Key-Lawyer-4181",
        "url": "https://www.reddit.com/r/GradSchool/comments/zyfujf/question/",
        "text": "Hello all, \nI have a question!\nAmong these two Which program would you choose to do and why?\n\n1. University of Maryland Baltimore county- Master of professional studies in Health information technology \n\n2. University of Washington- Master of Health informatics &amp; health information management",
        "created_utc": 1672346546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting into data science graduate programs...",
        "author": "soTizzy",
        "url": "https://www.reddit.com/r/GradSchool/comments/zyfrfx/getting_into_data_science_graduate_programs/",
        "text": "[removed]",
        "created_utc": 1672346339,
        "upvote_ratio": 1.0
    },
    {
        "title": "ISO Bad Finals Stories",
        "author": "botanistbae",
        "url": "https://www.reddit.com/r/GradSchool/comments/zyf43e/iso_bad_finals_stories/",
        "text": "Now that I have final grades back and am feeling a bit less traumatized, I'm hoping to commiserate. I'd love to hear anyone's terrible finals experience that so that we can all feel less alone.\n\nTLDR: Broke down sobbing during an oral exam due to insomnia and stress but ended up doing fine.\n\n\nMy story happened last month due to a shitty combination of things. It's my first semester as a grad student in a new state, and I've been feeling all the stress and loneliness I was promised. I was also part of the UC system strike, so throw in plenty of financial burden and uncertainty. Because of this, I started a side hussel that is very time intensive and takes a ton of focus, so even more stress. The stars aligned and my ADHD diagnosis finally got accepted and I started medication that gave me insane insomnia and depression (a max of 3 hours of sleep a night for a month will do weird things to your brain).\n\nThis final was for a 3 week portion of a course, so it was only about 12 lectures. Easy, right? Wrong. The prof is notorious for being harsh, and his lectures have an absurd amount of info on them. He even held class outside of class hours and went late in every single lecute because he was just teaching too much. It took me almost 3 hours per lecture just to study for the final. \n\nWhen the day of the final came, I felt bat shit insane. Like, I could barely get on a bike because I was worried I would bike into traffic by accident. It's an oral exam, so I couldn't even have time to reflect on questions. He was actually super nice but pushed for such tiny details that I full-on broke down sobbing. Like, disgusting, sniffling, heavy breathing, sobbing. He just kind of stared awkwardly and said I had been doing fine. I pulled my shit together and apologized profusely and finished the exam so I could go home and get horrendously drunk and forget. \n\nLooking back, I have no idea who I was. I quit the medication, the strike is over, and I know how to better balance my work, so I am back to normal stress now.",
        "created_utc": 1672344729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theorists - what do you do if you're tired?",
        "author": "Dig-Clean",
        "url": "https://www.reddit.com/r/GradSchool/comments/zyepm0/theorists_what_do_you_do_if_youre_tired/",
        "text": "I'm a postdoc in a theoretical field and I've had this problem since grad school - I suffer from periodic fatigue and also am just really sensitive to getting &lt;8 hours of sleep, so any amount of sleep deprivation and I'm completely shot the next day. It makes it hard to consistently get work done. I end up forcing myself to work anyway but getting very little done. But this happens too often for me to just skip working those days.\n\nAnyone have advice on how to manage this? (I've been to doctors and stuff and am pretty sure I've tried all the medical solutions possible for the fatigue at this point.)",
        "created_utc": 1672343818,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t want to work in my major after i finish my masters But i don’t want to disappoint my family",
        "author": "Thisnameisreserved",
        "url": "https://www.reddit.com/r/GradSchool/comments/zybw7r/i_dont_want_to_work_in_my_major_after_i_finish_my/",
        "text": "\n\nIt’s going to be long But appreciate if you read🙏🤝\n\n\n\nI am 21 years old. I’m in Master second year in music university and my major is classical flute. I’ve been doing this since i was 7. I came to the realization like 3 years ago that i do not like my major anymore. I honestly lowkey hate it. I do love classical music But i dont practice i am Really lazy and it just does not make me HAPPY AT ALL. Instead it drains my energy so much it doesnt fit my personality at all i hate it so much. \n\n\nCurrently Im working as a flute teacher (only 10hour per week) altough i adore kids i still dont see myself as a teacher in the future. Currently it is good for earn a little bit of money But it doesnt make me happy , i want something that makes me happy and not drains me. Also working as a teacher doesnt pay you good money in my country Its actually pathetic considering you have 1-2 degrees \n\nMy family Really proud of me because i am the first one in the family who got into college so basically i am their favorite and they are just Really proud. They paid lot of money for my education through out the years and i Really appreciate their support But i dont like What Im doing anymore and i dont want to live my life doing something i hate. \n\n\nI started skateboarding 9 months ago and honestly this is the first thing in my life that makes me feel free and insanely genuienly happy. I love cooking. I just want a chill lifestyle. I was thinking about being a chef in a chill place and just skating and love my life happily and after i while maybe open a coffee shop or something like that. I just want to live freely. But also i am scared to disappoint my family since they put lot of money into my education LITERALLY LOT OF MONEY\n\n\nWHAT SHOULD I DO? I AM SCARED TO BE HONEST!!!",
        "created_utc": 1672337243,
        "upvote_ratio": 1.0
    },
    {
        "title": "Correct me if I’m wrong.",
        "author": "Cyandreams__",
        "url": "https://www.reddit.com/r/GradSchool/comments/zybppn/correct_me_if_im_wrong/",
        "text": "I am very confused on the degrees grad school offers. Is it:\n\nCollege: Associates and Bachelors\nGrad school: PhD and Masters \nMed school: MD one degree?\n\nI am not really sure? Is it possible to get a MD degree in grad school without going to med school?",
        "created_utc": 1672336816,
        "upvote_ratio": 1.0
    },
    {
        "title": "BBA/MBA in Financial Management…PhD decision time",
        "author": "AKUSMC",
        "url": "https://www.reddit.com/r/GradSchool/comments/zyas65/bbamba_in_financial_managementphd_decision_time/",
        "text": "Hi everyone,\n\nThank you in advance. I am an avid learner and want to complete my PhD. \n\nAs the title states, I completed my BBA and MBA specializing in Finance. I currently manage a branch for a mid size publicly traded company so this is more for me than anything. \n\nConsidering a PhD in Business Admin rather than a DBA as I’m not in academia. \n\nMy question is what specialization would suit me well from the list below? Im considering Strategic Marketing, Project Management or Organizational Leadership. \n\nAdvanced Accounting\nFinancial Management\nGlobal Business Management\nHealth Services Specialization\nHomeland Security: Leadership &amp; Policy (HS)\nIndustrial/Organizational Psychology\nInformation Technology\nOrganizational Leadership\nProject Management\nStrategic Marketing",
        "created_utc": 1672334552,
        "upvote_ratio": 1.0
    },
    {
        "title": "Emailing Professors for PhD position",
        "author": "Muhammad_Ibrar",
        "url": "https://www.reddit.com/r/GradSchool/comments/zyafi4/emailing_professors_for_phd_position/",
        "text": "[removed]",
        "created_utc": 1672333690,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal for your chair person to ignore you?",
        "author": "HElizisme",
        "url": "https://www.reddit.com/r/GradSchool/comments/zyabwg/is_it_normal_for_your_chair_person_to_ignore_you/",
        "text": "[removed]",
        "created_utc": 1672333450,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is an impact factor of ~6-7 respectable?",
        "author": "NiteNiteSpiderBite",
        "url": "https://www.reddit.com/r/GradSchool/comments/zy9xkh/is_an_impact_factor_of_67_respectable/",
        "text": "I am going to graduate with a PhD in a biochemistry-adjacent field pretty soon and I'm struggling to assess my \"success\" in the program in some key arenas. Notably, I have been fortunate to publish three first-author papers but none of them are in super high impact journals. Each of the publications is in a journal with an impact factor of around 6 or 7. \n\nHow will this be received? I realize it's arguably better to publish fewer things in higher impact journals, but that wasn't really an option for me -- my lab is extremely small, COVID really derailed our progress, my first project got ruthlessly scooped, and a few other extenuating circumstances meant that I was essentially the only person working on each of these projects, so I'm glad they got completed at all.",
        "created_utc": 1672332488,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone had success using verified Edex courses for prerequisites?",
        "author": "diminutivemountain",
        "url": "https://www.reddit.com/r/GradSchool/comments/zy8vf3/has_anyone_had_success_using_verified_edex/",
        "text": "I am in the process of submitting applications to several M.Arch programs for Fall 2023. My undergraduate degree is in an unrelated field, so there are a few prerequisite courses I need to complete this spring/summer. I have enrolled in the necessary courses through a local state university but the cost per credit is a bit higher for non-degree-seeking students. Comparable courses are offered via Edex with a graded/verified track at a fraction of the cost. Naturally, I would prefer to go with the more affordable option but I’m concerned that the Edex transcripts will not hold as much weight or be taken as seriously as completing the coursework through a traditional university. \nI appreciate any anecdotes or advice on which route to take.",
        "created_utc": 1672329840,
        "upvote_ratio": 1.0
    },
    {
        "title": "Masters in Mechanical Engineering (need advice)",
        "author": "salmansid97",
        "url": "https://www.reddit.com/r/GradSchool/comments/zy6yhm/masters_in_mechanical_engineering_need_advice/",
        "text": "[removed]",
        "created_utc": 1672324838,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's considered as too many references?",
        "author": "thugga511",
        "url": "https://www.reddit.com/r/GradSchool/comments/zy51uj/whats_considered_as_too_many_references/",
        "text": "I have to write a report on a material, its properties, and applications. Naturally, I had to reference a lot for the properties and applications, I have 160 references for a 10-page report... is that okay or too much?",
        "created_utc": 1672319413,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to get help with med school assignments?",
        "author": "tirimba7",
        "url": "https://www.reddit.com/r/GradSchool/comments/zy49dr/where_to_get_help_with_med_school_assignments/",
        "text": "what websites do you use for help with essays and homework, when you're feeling a bit lazy or have too much to do and very little time? Kindly assist with solutions you've tried out and proven to be effective.",
        "created_utc": 1672316961,
        "upvote_ratio": 1.0
    },
    {
        "title": "People who quit their PhD *without* mastering out, tell me your stories",
        "author": "Wonderful-Neat917",
        "url": "https://www.reddit.com/r/GradSchool/comments/zy3v8w/people_who_quit_their_phd_without_mastering_out/",
        "text": "[removed]",
        "created_utc": 1672315656,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Graduate School (Masters Program) for me? Advice Needed + Pros and Cons List",
        "author": "icecreamninjaz",
        "url": "https://www.reddit.com/r/GradSchool/comments/zxzrrj/is_graduate_school_masters_program_for_me_advice/",
        "text": " Hi Guys,\n\nIm a long time lurker, and I decided to make this post now. A little about me, I am a 3rd year student at a respectable public university studying computer engineering with a current gpa of 3.89.\n\nLately I've been starting to think of what to do after college, whether it is to try my best to get a good placement in industry, or to go to graduate school (for a masters program specifically). There are pros and cons for both, and Im just not sure what to do, so I wanted to see if I can get some advice from others.\n\nPros:\n\n\\-I have heard time and time again that getting a masters degree will help put you ahead of the competition, especially for more competitive jobs. As a bonus, the average pay increase for people that have a masters is not miniscule.\n\n\\-It allows me to specialize in what I am interested in, such as machine learning and artificial intelligence. It also allows me to take classes that I would have taken if I was a cs major at my university (my university doesnt allow internal transfers into cs due to it being impacted).\n\n\\-Both my parents and a sibling have gone to graduate school. Both my parents have done exceptionally well in their careers, and they both highly recommend that I go to graduate school (to the point where they even have a graduate school fund setup for me).\n\n\\-I am a junior, and I still havent gotten an internship yet (currently at application 55 right now woo hoo!). This will most likely make me less desirable in the hiring pool after graduating and make it more difficult to get a job. Going to graduate school will give me more time to find something and possibly ride out the current recession and hiring freezes.\n\n\\-Its only 2 more years, right?\n\nCons:\n\n\\-2 more years of added stress from classes, exams, worries about failing, etc. I dont want to overstrain my mental health and well being. Sometimes I feel like I kind of want to take a break from school due to its stress culture.\n\n\\-Its 2 more years of basically unpaid work when I could be making money in industry.\n\n\\-I'd have to do alot of prep work for applying. Making connections with professors to get letters of recommendation, researching which schools I want to apply to, studying and taking the GRE, padding my extra curriculums as I currently am not part of any, etc. The only good part is that my GPA is excellent so I dont have to worry about that.\n\nI feel like this shouldnt be that difficult of a decision, however I cant help be feel stressed, anxious, and worried about whats to come and whether I will make the right decision. Will I disappoint people if I choose one or the other, will I fry my brain with too much stress, will I be able to find a job if I decide not to go to graduate school, etc.\n\nAny guidance is much appreciated. Thank you for taking your time in reading this!",
        "created_utc": 1672301040,
        "upvote_ratio": 1.0
    },
    {
        "title": "Idk how to search for grad schools",
        "author": "mahnoorzahiid",
        "url": "https://www.reddit.com/r/GradSchool/comments/zxxou2/idk_how_to_search_for_grad_schools/",
        "text": "I am looking/aiming for mid-tier grad schools for a PhD in neuroscience. My GPA is decent enough, nothing super stellar. How can i start looking for schools where i have a decent chance? Whenever i look up at Google, it feels like it only gives me the top-tier colleges only",
        "created_utc": 1672294136,
        "upvote_ratio": 1.0
    },
    {
        "title": "Peer review with your PI",
        "author": "alwayslost999",
        "url": "https://www.reddit.com/r/GradSchool/comments/zxxeem/peer_review_with_your_pi/",
        "text": "Hi fellow redditors,\n\nI know grad students sometimes peer review papers with their PI. Just wanted to clarify how it works. \n\nMy PI sent me a manuscript and told me to return with my comments. I don't think I'm formally doing the peer review. More like, the PI is busy and I'm doing the grunt work so they can push it out. (I hope they're trying to teach me how to review though.) \n\n1. Is this normal?\n\nI do have a publication history on the topic and feel confident to review and give helpful comments on the manuscript given to me. Additionally, I think it is a wonderful opportunity to learn to critique constructively. So I'll do it anyway. Hopefully learn from the boss how to do it right. \n\nHowever, I have some concerns.\n\n2. I don't think the editor is aware that I am reviewing/giving comments. They asked for my PIs insight, am I duping them by giving my opinion instead?\n\n3. Is it wrong that I have a copy of the manuscript in review without the consent of editor/authors?\n\n4. I want the editor to know I can review similar articles/techniques/concepts in future. How do I discuss this with my PI?\n\nPlease give me some insight! For reference, I do biomedical research.",
        "created_utc": 1672293255,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm having an impossible time collaborating/getting peer interaction since covid. Still.",
        "author": "8Splendiferous8",
        "url": "https://www.reddit.com/r/GradSchool/comments/zxx9py/im_having_an_impossible_time_collaboratinggetting/",
        "text": "I started my MSc in Physics in 2019 or something (I've lost track of time. Who the hell even knows anymore.) In 2020, I landed a summer internship with a National Lab far away from my school. When March hit, the internship, which was supposed to be onsite, was moved online. Moving past how crushed I was, I tried to make the best of it. The work was very different from the work my PI does (He does computational nuclear physics. This group does more applied mathematics and numerical PDEs.) But I found it 100x more interesting than any of the physics research my school has to offer. (They specialize in nuclear, optics, astro, and biophysics. All not my favorite, tbh. But I didn't know enough/have alternatives at the time to realize that it wasn't interesting to me.)\n\nOn my way out the door, one of the members on the research group with whom I was working made the unfortunate decision to offer me the opportunity to work with him for my thesis research. Basically, we called a Zoom meeting with my PI where we asked him to do me the solid of being my PI on paper (since I need a PI at my actual physical school,) but my project would be more or less entirely overseen by this guy (we'll call him my mentor) online at the lab. He agreed, but he warned me that because this research has nothing to do with his research, he can only provide limited assistance, so if I ended up up shit creek, I'd be, well, up shit creek. I agreed to the terms, and I was over the moon excited about it.\n\nThe thing is, while I find my research fascinating, being completely cut off from anyone who has anything to do with it has really impeded my progress. Any time I get stuck, I'm stuck. If I can't get the answer through my mentor, I damn near can't get an answer. And I can tell my mentor's getting impatient about it, which makes it that much harder to understand his explanations (which are much harder to understand as he verbally spews symbols at me over Zoom without a whiteboard.)\n\nIt's not like I used to always have to run to my PI/supervising professor every time I had a question (I've been a part of a couple research projects in the past before starting grad school, including one with my current PI.) If I got stuck, I often found a way--a friend, a colleague, something--to get my answer, either through discussion or through a suggested resource. I find that relying on a single source for help is both limiting to my understanding (I learn by variety. Also, my supervisor doesn't know the answer to my question; that's kinda the point of research.) and draining to my supervisor. And, I honestly haven't taken enough classes on the material in this current research to have sufficient background in it on my own. I'm certain that, had I made it into an environment where I was surrounded by people who were already knowledgable about this material, I probably would've been able to get up to speed relatively quickly. But I can only spend so long pining over what could have been before I have to put my big-girl pants on and write this thesis so I can move the hell on to the next stage of my life.\n\nOftentimes, these are simple questions, like, \"What's the term for this phenomenon/operator/process I'm doing so I know what to Google?\" But they take me ages to figure out because all I get from my friends focused on nuclear are shrugs. And I can tell my mentor is starting to think I'm stupid, and you know what? I'm at peace with that. I'd think I were stupid, too, if I had to hold my hand as much as he has. And I'm tired of explaining my angle to him. I just want to code up my final tests so I can finish already.\n\nI guess my question is, say I have a question like, \"How do I make a higher-order forward-difference first derivative operator?\" or \"I'm not understanding how to perform Von Neumann phase analysis on higher-order RKs.\" or \"Does anyone know anything about Perfectly Matched Layers?\" Is there any online forum anywhere where I can shoot the shit about math problems (like I used to do on a whiteboard with my friends in the Beforetime) with other people since I never befriended anyone in the lab where my research is headquartered so real-live physical people in my field are no longer available to me? Like, these aren't questions that exist in the vacuum of my lab group's research alone. These are relatively ubiquitous numerical problems. Someone out there knows something about my questions. But I can only absorb so much from reading. I need some amount of logical argumentation to orient my understanding. Is there anything of the nature that I'm describing, or am I SOL and doomed to continue brute forcing my way through this project for years indefinite?",
        "created_utc": 1672292850,
        "upvote_ratio": 1.0
    },
    {
        "title": "What problems have you found trying to get a job after graduating- and how did you overcome?",
        "author": "K-A-Mck",
        "url": "https://www.reddit.com/r/GradSchool/comments/zxwmjk/what_problems_have_you_found_trying_to_get_a_job/",
        "text": "Was job hunting straightforward, or did you need to do anything to spice up the resume?",
        "created_utc": 1672290904,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lost in last year of PhD",
        "author": "pkhadka1",
        "url": "https://www.reddit.com/r/GradSchool/comments/zxv085/lost_in_last_year_of_phd/",
        "text": "I am now in 6 and half year of my PhD program and planning to graduate this spring.\nPart of the problem is I am lost now on completing the program. Advisor and I had a deal that he will help on writing paper. Now the time is running out, and there is no paper ready and the advisor is still not committed.  Because of the experiments, I am also slow on writing a thesis and looking for jobs.\nSo lost now. Confidence is super low.\nAny suggestions on how to navigate the situation.",
        "created_utc": 1672286283,
        "upvote_ratio": 1.0
    }
]