[
    {
        "title": "How to improve application for next cycle?",
        "author": "BaruchHaShem719",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qxi15/how_to_improve_application_for_next_cycle/",
        "text": "[removed]",
        "created_utc": 1675265414,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my bad experience with Grad school normal?",
        "author": "gradsxhool567",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qvfsq/is_my_bad_experience_with_grad_school_normal/",
        "text": "[removed]",
        "created_utc": 1675260118,
        "upvote_ratio": 1.0
    },
    {
        "title": "Submitted application and stressing",
        "author": "Aggressive_Art_3468",
        "url": "https://www.reddit.com/r/GradSchool/comments/10quz6x/submitted_application_and_stressing/",
        "text": "[removed]",
        "created_utc": 1675258827,
        "upvote_ratio": 1.0
    },
    {
        "title": "two optional essays?",
        "author": "1EGOATJAMES",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qu7wq/two_optional_essays/",
        "text": "[removed]",
        "created_utc": 1675256567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Afraid my current PI will sabotage my offer",
        "author": "wifeyintheworld",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qu4ks/afraid_my_current_pi_will_sabotage_my_offer/",
        "text": "Hi all,\nA while back I posted about how I am a lab manager for a big shot PI in psych. I just found out last week that I got into my PhD program that I've been eagerly waiting to hear from (yay!).\n\nHowever, as the last post pointed out, my current PI is very manipulative and often gaslights her lab. I officially accepted my offer yesterday, but things have gone from bad to worse at my current position.\nShe berated my work yesterday on a script that did exactly what she wanted but it wasn't done \"her way.\" She also was upset that I didn't update her on it but I saved an email saying that she didn't want updated until it was finished. I'm not an expert in any of this, and I'm the only one in the lab able to somewhat execute her plans (everyone else is a 1st year grad student or RA). Everything has fallen on my shoulders and she has especially pushed me when she heard that I will be leaving for my program soon. \n\nI am super afraid that she is going to try to sabotage my program if I put in my 2 weeks notice. She knows the other PI that I will be working under in my PhD. I'm worried that because she was a reference for me, if I quit, she will try to rescind her reference (I don't know if that's even possible lol), but it's driving me crazy. I'm at my wits end at this place. I have 3 months to go in my contract but things are so bad that I'm not eating or sleeping right. I'm holding this lab together and I feel like I'm somehow responsible for everything and everyone. She continually says that for me to be a successful student I need to be able to put up with this environment. \n\nMy new program and advisor are awesome though. I feel respected there and acknowledged. But my current PI is making me worry that my new advisor will be like her. I hope not all labs are this way 😕 \n\nJust needed to vent again. It seems that reddit helps clear my mind when I talk to you all. \n\nThanks for reading.",
        "created_utc": 1675256316,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reality of US postdocs",
        "author": "Gullible-Flower3319",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qtsfo/reality_of_us_postdocs/",
        "text": "This video covers in details on how underpaid US postdocs are and how exploitative the system is. Enjoy !\n\nhttps://www.youtube.com/watch?v=mExlPihH3jk&amp;ab_channel=acollierastro",
        "created_utc": 1675255363,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reality of Postdoc positions in the US",
        "author": "Gullible-Flower3319",
        "url": "https://www.youtube.com/watch?v=mExlPihH3jk&amp;ab_channel=acollierastro",
        "text": "",
        "created_utc": 1675255167,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can do your assignments!",
        "author": "Homework_Guru",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qq3vu/i_can_do_your_assignments/",
        "text": "[removed]",
        "created_utc": 1675247323,
        "upvote_ratio": 1.0
    },
    {
        "title": "what will be preferable for me 12 or 18, or 24 months in Ms Data Science",
        "author": "zoeistheshah",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qkluc/what_will_be_preferable_for_me_12_or_18_or_24/",
        "text": "[removed]",
        "created_utc": 1675226045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was admitted to course I’m not qualified for",
        "author": "FrostingEastern5461",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qkjuw/was_admitted_to_course_im_not_qualified_for/",
        "text": "Like the title says, I joined a master of science program to, as you’d think, get a master of science. I need it to transition into the career I’d like to do. Anyhow, I was accepted into a few schools, chose one, and started classes. It turns out though, I’m woefully underprepared for the course content. I brought this up with my advisor and they revealed that after some review of my application materials they felt I was a little under qualified too. They gave me some extra materials and work to review to better myself and while I spend the majority of my time (when not working) trying to review the extra work and given work for my course I’m still under equipped. I spoke to my advisor again about how I felt and in short our conversation went something like this:\n“We made a mistake admitting you without having prerequisites”\n“Yes we expect you to pay for this course again if you don’t succeed”\n“You should seek out prerequisite course work at a local school”\n“You should try harder too”\nI can’t help but feel like I have been setup to fail and a bit cheated out of my money (I haven’t gone to like a sham school or anything - I’m attending a pretty notable school). I’m posting here to just seek some advice on anything I can do to either get my money back since they made a mistake or a better course of action. As of now I’ve got another masters program I deferred in my back pocket (that has already stated I’d need to take some extra classes to meet the prerequisites) but I’m just not sure where else to ask for advice. I don’t know anyone else who has done a masters",
        "created_utc": 1675225871,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cons of owning a cat??",
        "author": "adventuriser",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qk902/cons_of_owning_a_cat/",
        "text": "My partner and I are interested in adopting and adult cat..other than her allergies, what are some cons that are, perhaps, specific to grad students?",
        "created_utc": 1675224938,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chicago Harris R1 MPP decisions are out",
        "author": "Intelligent-Movie846",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qj9wd/chicago_harris_r1_mpp_decisions_are_out/",
        "text": "Did anyone else apply? &amp; are there any current Harris students here?",
        "created_utc": 1675222011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did anyone got into University of Florida graduate school as a Teaching Assistant (Department of Geological Sciences). I am not sure how much they will pay for a TA?",
        "author": "Adventurous-Try-7605",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qie55/did_anyone_got_into_university_of_florida/",
        "text": "[removed]",
        "created_utc": 1675219464,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I move to Europe (Msc) or stay in the US (PhD)?",
        "author": "TheCurlyBabla",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qi5gp/should_i_move_to_europe_msc_or_stay_in_the_us_phd/",
        "text": "I am finishing up my undergrad in the US (International student) and have been applying to grad school programs. I got multiple interviews that went really well and although I don't have any official offers yet, I am feeling a bit overwhelmed by the potential big life decisions I would have to make. \n\nThere is a joint masters program in EU that I am interested in and is split in two different countries (e.g France and Netherlands etc). At the same time I might get into great PhD programs in the US that I really liked. Choosing one or the other seems like an impossible decision for me. \n\nI would like to eventually get a PhD so it's great to have a head start by going to a PhD program right away, however I am not sure if I would like the locations as they are not very walkable and might make it hard for me to have fun. The European program is essentially diverse and international and I would get to spend at least 2 years in a different continent and might be able to finish up  my PhD in there as well. Moving to EU will allow me to be closer to family and buy me some time to have fun and travel before I start a PhD. At the same time, I am more inclined towards US PhDs because I like the system more and I like some of the labs better. \n\nI don't know if any of you will have an answer, but I will appreciate any insight.",
        "created_utc": 1675218782,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone recommend plagiarism checkers for personal use?",
        "author": "omniscientclown",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qi0dc/can_anyone_recommend_plagiarism_checkers_for/",
        "text": "I've been working on my thesis proposal, and I've been told that they do a plagiarism check. In one chapter, I summarize my own publication. Of course I have not intentionally plagiarized anything (Or myself), but I guess I want to make sure I didn't accidentally do anything? I use grammarly in Word, but I'm not sure if I can trust the plagiarism feature as I'm not sure if it checks it with research articles. \n\nSo are there any apps/websites out there that you recommend? I realize I probably won't be able to find anything for free. I don't mind paying, but there are lots of options out there and I want to make sure it's worth it. Thanks!",
        "created_utc": 1675218387,
        "upvote_ratio": 1.0
    },
    {
        "title": "On my last semester, with some regrets, and not entirely sure how to process it",
        "author": "Stunning_Elk2496",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qhbw5/on_my_last_semester_with_some_regrets_and_not/",
        "text": "[removed]",
        "created_utc": 1675216539,
        "upvote_ratio": 1.0
    },
    {
        "title": "Considering career switch from sales to Mental Health (masters in mental health). 2 kids, is it realistic?",
        "author": "EmotionalStill8086",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qh09r/considering_career_switch_from_sales_to_mental/",
        "text": "I work in sales and make more money than I ever thought and am miserable. I have a nest egg I’ve built up bc my true passion has and always will be helping people. My goal is to go get my Masters in Mental Health and eventually do private practice but I have several questions and concerns that I would love if you professionals could address. See below and if you respond, THANK YOU!! \n\n1) I hear even when you graduate with a masters of this nature that it’s hard to make money. What is realistic after schooling?\n\n2) Are there any jobs without any psychology degree that could help with tuition? For example, working as an advisor at the school I attend. I’m trying to find ways to make my cost for school go from 65k to 25-30k (if possible)\n\n3) I would love to be part of ketamine, mushroom, etc research and therapy. I’ve seen it work wonders on me. Can I get this type of schooling and go in to those fields as they pop up years from now?\n\n4) I work in sales working 24/7 but I know going back to school will be a giant shift for me and my family. I have 2 kids as well. Is it possible to work a full time job that’s not ultra demanding and do the schooling or am I out of a dang mind?\n\nI massively appreciate any insight. I am very serious about this but want to research everything before continuing. Thanks!",
        "created_utc": 1675215629,
        "upvote_ratio": 1.0
    },
    {
        "title": "Story of time as a grad student in the Counseling and Student Personnel Psychology(CSPP)/Counselor Education at the University of Minnesota",
        "author": "dogatemybiscuit7",
        "url": "https://medium.com/@student3200/my-story-counseling-and-student-personnel-psychology-cspp-counselor-education-at-the-university-b34dc4dc5d48",
        "text": "",
        "created_utc": 1675215575,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice on certificate programs",
        "author": "OkBoysenberry3570",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qg730/need_advice_on_certificate_programs/",
        "text": "[removed]",
        "created_utc": 1675213454,
        "upvote_ratio": 1.0
    },
    {
        "title": "Admission/Acceptance",
        "author": "Key-Lawyer-4181",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qfhdj/admissionacceptance/",
        "text": "Hello ,\nI have a question I really want to know about. Do anyone know if someone got an admission or accepted to a masters degree, but then decides to wait for 2 years before I start the program. do i have a choice to start the program  whenever i feel?\nThanks!!!",
        "created_utc": 1675211539,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please Advise - Literally Stuck in Grad School, Supervisors MIA",
        "author": "AdvicePlsGradStudent",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qew2u/please_advise_literally_stuck_in_grad_school/",
        "text": "[removed]",
        "created_utc": 1675210005,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please Advise - Literally Stuck in Grad School, Supervisors MIA",
        "author": "AdvicePlsGradStudent",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qesy8/please_advise_literally_stuck_in_grad_school/",
        "text": "[removed]",
        "created_utc": 1675209783,
        "upvote_ratio": 1.0
    },
    {
        "title": "Graduate admissions..",
        "author": "Maximum-Bake25",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qenrd/graduate_admissions/",
        "text": "[removed]",
        "created_utc": 1675209425,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will such a CGPA ruin my chances?",
        "author": "Classic-Traffic130",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qenf9/will_such_a_cgpa_ruin_my_chances/",
        "text": "Hi so I have a CGPA of 3.12 which I know is pretty low for grad school (I'm applying for MS Analytics)\nBut I graduated in 2021 and have had relevant work ex at good firms since then. I was very distracted in my early years at uni and spent most of my time playing shows with my band, chasing girls and partying. However, I tried turning it around mid way. The following are my scores per sem (appx.)\n\nGPAs: 2.5 &gt; 2.7 &gt; 2.95 &gt; 3.46 &gt; 3.46 &gt; 3.6\n\nI've had an upwards trajectory and that's what I'm trying to sell but I'm worried if this is still not enough to get a good admit.\n\nAny help would be appreciated. Thanks!",
        "created_utc": 1675209399,
        "upvote_ratio": 1.0
    },
    {
        "title": "Appealing Grade",
        "author": "sinayyy",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qdsc2/appealing_grade/",
        "text": "Has anyone ever appealed a final grade? If so and the outcome was successful. What do you think helped your case?",
        "created_utc": 1675207169,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird shenanigans at University-sponsored competition and unsure how to proceed",
        "author": "Specific_Training_78",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qdmev/weird_shenanigans_at_universitysponsored/",
        "text": "[removed]",
        "created_utc": 1675206750,
        "upvote_ratio": 1.0
    },
    {
        "title": "Built AI where you can ask questions in English about any file (i.e. research paper) and automatically get the answer or summary 10X faster",
        "author": "HamletsLastLine",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qd3og/built_ai_where_you_can_ask_questions_in_english/",
        "text": "[removed]",
        "created_utc": 1675205468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Built AI where you can ask questions in English about any file (i.e. technical PhD level research paper) and automatically get the answer or summary without the need of a research assistant",
        "author": "HamletsLastLine",
        "url": "https://www.humata.ai/",
        "text": "",
        "created_utc": 1675204252,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does a graduate student need to pay back if they withdraw?",
        "author": "pmdev1234",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qchlo/what_does_a_graduate_student_need_to_pay_back_if/",
        "text": "[removed]",
        "created_utc": 1675203975,
        "upvote_ratio": 1.0
    },
    {
        "title": "Motivation needed! Tell me how it feels to be done",
        "author": "allagashtree_",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qbpzu/motivation_needed_tell_me_how_it_feels_to_be_done/",
        "text": "I have one month left until I submit my dissertation. I am powering through but I am tired. It is crunch time.  Then I defend in April. How does it feel to be done? Is the relief all encompassing? I can't even imagine the feeling - tell me success stories if you felt relieved after you finished!",
        "created_utc": 1675202117,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grad students at my university are forming a union - what are your experiences?",
        "author": "Warm-Research-1346",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qb9rp/grad_students_at_my_university_are_forming_a/",
        "text": "[removed]",
        "created_utc": 1675201009,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switch PIs, schools, power through, or drop out?",
        "author": "botanistbae",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qahmv/switch_pis_schools_power_through_or_drop_out/",
        "text": "So. I've been a mess since I've gotten to grad school. If anyone from my program/lab sees this, it's pretty easy to figure out who I am, so hello!\n\nAgainst my better judgment, I let my previous boss talk me into going to a school (that frankly I was not excited about) because he works with my now PI. The PI is well known and puts out some great research. We didn't really have problems except that he is very hands-off. There were definitely red flags, but Jesus christ I did not realize how bad this would be. \n\nEverything has continuously gone downhill since I got here. The school fucked up my payment, so now I owe money. They fucked up my insurance, so now I owe money AND can't get more treatment until I jump through a million hoops. I had been working with a psychiatrist to get adhd medication right, but since they just switched my insurance, I can't see him anymore. The current meds are making me so emotional and I cannot.stop.crying. like, it's horrific, I've never been a crier and now it's everyday and in public. \n\nI was a part of the UC strike, and my PI has been retaliating because he knows he's untouchable. He pretty much said if any of us file a complaint, he will retaliate even harder. It's been miserable. During the strike I decided I'm definitely going for a masters and not a PhD because this sucks so hard. My PI has not helped me clarify what my project even is so idk what I'm even supposed to be doing day to day in the lab. I'm doing well in my classes and have a 4.0, but my lab work is not going well. \n\nI need something to change or else I'm going to go crazy.  It's only been about 6 months and I'm so fucking over this schools incompetence destroying my love for what I do. I could switch PIs but that would probably set me back progress wise which would suck because I want to leave this state asap. I'm probably just going to try any cry/power my way through the next year and some change, but I need somethibg to get better. \n\nDoes anyone have advice or experience with this kind of thing?",
        "created_utc": 1675199182,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone received an NYU MS IDM admit?",
        "author": "LonelyStar2012",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qaglo/has_anyone_received_an_nyu_ms_idm_admit/",
        "text": "[removed]",
        "created_utc": 1675199114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suggestions on increasing my research study participation",
        "author": "Destined2bGreat1",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qaavw/suggestions_on_increasing_my_research_study/",
        "text": "[removed]",
        "created_utc": 1675198766,
        "upvote_ratio": 1.0
    },
    {
        "title": "Masters Thesis submission!",
        "author": "Destined2bGreat1",
        "url": "https://www.reddit.com/r/GradSchool/comments/10qa57f/masters_thesis_submission/",
        "text": "[removed]",
        "created_utc": 1675198391,
        "upvote_ratio": 1.0
    },
    {
        "title": "MSc vs Working before beginning PhD? (College senior, need help)",
        "author": "AmoebaAsleep918",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q9xzl/msc_vs_working_before_beginning_phd_college/",
        "text": "Hi all, for some context, I am in my fourth year of college (graduating in May) for a B.S. in Microbiology in the United States. My long term goal is to get into research/being a professor with Infectious Disease, which would require getting my PhD. However, currently I am not ready (and have also past many deadlines) to apply to a PhD. For my after graduation plans, I am looking for opportunities that will put me in a better position to apply and will set me up to be successful in academia.\n\nThis week I received an acceptance to the London School of Hygiene and Tropical Medicine for their MSc in Immunology and Infectious Disease. I actually don't know much about this school at all and heard about it for the first time while looking up places to apply to. It would be around 40k USD (although I'm looking into scholarships) and one year long, but the program itself looks really interesting and like a good start into putting together my own research.\n\nI am also applying to and waiting to hear back from jobs here stateside. These would positions as a Research Assistant in labs within hospitals and universities - good for observing and contributing to research within immunology and ID. Financially it seems like a no brainer to stay within my home country, make money and then apply, but I am lucky to have the means to attend the MSc program. \n\nI am talking to professors/advisors, but I would be the first in my family to pursue this level of education, so I just wanted to ask here for some advice too. Is anything notably beneficial about either getting a masters (keeping in mind it is abroad) or working for two years in a lab? Has anyone heard of this school before and have advice regarding it? Is anyone willing to share which pathways they took to starting their PhD and how how that translates to what they would do if they were me?",
        "created_utc": 1675197933,
        "upvote_ratio": 1.0
    },
    {
        "title": "Opportunities for a gap year before physics PhD?",
        "author": "Relevant-Sink-6194",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q9cul/opportunities_for_a_gap_year_before_physics_phd/",
        "text": "[removed]",
        "created_utc": 1675196539,
        "upvote_ratio": 1.0
    },
    {
        "title": "High paying non-STEM degrees?",
        "author": "Lyra555",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q98vt/high_paying_nonstem_degrees/",
        "text": "Hi everyone, I'm looking for advice about which degree to get--if this isn't the right sub to be asking then I'm open to suggestions of where else I could post.\n\n\nMy current company offers tuition reimbursement so I am able to get a free master's degree. I already have a very good job in aviation so this degree would be more of a back-up in case I ever had to stop flying. I already have a master's in education and I am great with soft skills but lacking in the STEM fields (especially math--it's been about 20 years since my last math course). \n\n\nDegrees I'm considering are a master's in management, MBA, or supply chain management. There are so many fields and degrees out there that I'm overwhelmed with options. I'm looking for a degree that would make me the most employable with the potential to earn the most money but without a lot of math requirements. \n\n\nI thought supply chain management would be good because I already have so much experience in the transportation industry and the coursework looks doable. (only 2 math classes). If anyone has any other suggestions, I'd appreciate it as there are just so many options and there may be degrees/fields that I haven't even considered.",
        "created_utc": 1675196275,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can get a free master's degree but can't decide on a field",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1675196183,
        "upvote_ratio": 1.0
    },
    {
        "title": "Applying to Mykolas Romeris University",
        "author": "ThatLamePumpkin",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q8nx5/applying_to_mykolas_romeris_university/",
        "text": "Has anyone here applied to/gone to Mykolas Romeris Graduate School in Lithuania? I have some questions about the process and your experience.\nLithuania is not a common choice in my circle and what I found on Google was not super helpful so I would like to ask for advices here!\n\nThank you!!!",
        "created_utc": 1675194856,
        "upvote_ratio": 1.0
    },
    {
        "title": "Masters in CS as a Business grad",
        "author": "redditdave",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q8mqz/masters_in_cs_as_a_business_grad/",
        "text": "Hello,\n\nI hope no one finds it offensive if I post this question incorrectly in this sub. \n\nI have a Bachelors in Business, but really want to pursue coding. I’ve attempted an online bootcamp, but it’s too intense for me and I feel like I cannot be successful under those situations.\n\nI want to consider going back to college for a 2nd degree in CS. However, the only reputable public school around me in the bay is San Jose State University, with its ties to Silicon Valley.\n\nProblem is, I called them and they said they don’t allow 2nd bachelors. I would have to apply for a Masters in CS.\n\nProblem is, with no formal CS education other than some training in front end/backend languages from my bootcamp, how difficult would it be for one to successfully complete a Masters while holding down a full time job?",
        "created_utc": 1675194769,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone use a TTS reader to read to you while you work?",
        "author": "Ancient_Winter",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q8f4k/anyone_use_a_tts_reader_to_read_to_you_while_you/",
        "text": "I'm looking for a way that news and popsci articles (usually online, not something I download, but theoretically could download a snapshot of the webpage if necessary) could be read aloud to me while I work on other things. When I've tried to search for these I find anything from paid software to phone-only apps to extensions for browsers.\n\nDoes anyone have something like this they recommend? \n\nBonus points if it can be used to read actual science papers aloud, but I am unsure if that's even possible with the way PDFs are formatted, the way they might struggle with jargon and chemical names, not to mention citations, figures amid the text, etc. But if *that* exists I'd be over the moon. Thanks!",
        "created_utc": 1675194246,
        "upvote_ratio": 1.0
    },
    {
        "title": "When masters programs require 2 years of work experience, do they mean 2 years by the time of matriculation or application?",
        "author": "amonaroll",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q8ako/when_masters_programs_require_2_years_of_work/",
        "text": "",
        "created_utc": 1675193944,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got an application fee waiver from Iowa state university. Does this mean anything?",
        "author": "Bushmaster_M4",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q88fk/i_got_an_application_fee_waiver_from_iowa_state/",
        "text": "[removed]",
        "created_utc": 1675193793,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does it mean that I am getting PhD offers, but not MSc study offers?",
        "author": "Huskyy23",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q7hr4/what_does_it_mean_that_i_am_getting_phd_offers/",
        "text": "Just before I begin, I am really not complaining, I’m just curious and a little surprised at what has happened so far…\n\nSo I’ve applied to PhD programs,and MSc programs and I’ve received a few offers so far.\n\nI have received PhD offers at University of St. Andrews, and at Lancaster University, but I got rejected from a Masters at Cambridge.\n\nI’m a final year astrophysics undergrad and the programs are all Astronomy/Astrophysics.\n\nI mentioned the same stuff in each application, my summers of research experience, grades, etc, so considering a university like St. Andrews is so highly ranked, why would they accept me for a PhD, yet Cambridge rejected me for a Masters?",
        "created_utc": 1675192006,
        "upvote_ratio": 1.0
    },
    {
        "title": "After PhD rejection, should I pursue a masters before reapplying or just work as a research assistant for a year before the next cycle?",
        "author": "spycat500",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q70om/after_phd_rejection_should_i_pursue_a_masters/",
        "text": "This is for a clinical psychology PhD, and I’d likely have to do either a counseling or general psychology MA for the area I’m in",
        "created_utc": 1675190871,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to tell my PI I want to master out",
        "author": "macnless",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q5nj5/how_to_tell_my_pi_i_want_to_master_out/",
        "text": "Hey! I am 2 years into my graduate program and I have finally decided I want to master out. At first I thought of taking a leave of absence (LOA) but in the end, it won’t work out for me because I have a family pressing matter and I don’t want to have the pressure of needing to be back to grad school in a certain date. Also, taking a LOA would leave me with no degree to work and help my family financially after sacrificing so much throughout this last two years. My PI is new faculty and I’m the first student in the lab. The PI is super happy because just got an R01 yesterday, I submitted my new abstract, etc. I do not now how to tell the PI about mastering out, because it feels like a bad surprise. I am also super concerned about my stipend, salary, moving out, finding a job (my master’s would be in Neuroscience). I’ve lost love and passion for academia, and here I suffer more than enjoy, not even taking grad school like a “job” has helped. I need to constantly use stimulants to be motivated to do work and then use sleep pills to sleep, I get annoyed and feels like a burden doing anything related to my program. I also feel like I’m missing moments with my family that I won’t ever get back. \n\nAdvice, opinions and tips are welcome, thank you!",
        "created_utc": 1675187732,
        "upvote_ratio": 1.0
    },
    {
        "title": "CV writing",
        "author": "Wonderful-Ad9638",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q5n9s/cv_writing/",
        "text": "I’m applying to a biology PhD program and I’m confused how to write a CV. I have a resume, but I’m unsure how to make a successful CV with only undergraduate research experience. Am I suppose to put work experience that isn’t science related on the CV? Or extracurriculars that aren’t science related? Any guidance is helpful!",
        "created_utc": 1675187713,
        "upvote_ratio": 1.0
    },
    {
        "title": "BA to Bootcamp To MS?",
        "author": "LocoHama-045",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q5h9r/ba_to_bootcamp_to_ms/",
        "text": "[removed]",
        "created_utc": 1675187326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Decided to go to online GradSchool right after undergrad! Here's how it's going.",
        "author": "Federal_Two_9885",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q5bnv/decided_to_go_to_online_gradschool_right_after/",
        "text": "[removed]",
        "created_utc": 1675186952,
        "upvote_ratio": 1.0
    },
    {
        "title": "Decided to do online GradSchool the semester after undergrad. Was this a bad choice?",
        "author": "Federal_Two_9885",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q582d/decided_to_do_online_gradschool_the_semester/",
        "text": "[removed]",
        "created_utc": 1675186722,
        "upvote_ratio": 1.0
    },
    {
        "title": "bad gpa for first semester out of three semesters(masters program)Tips on how to increase my gpa?",
        "author": "Turbulent-Prompt8150",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q4s0b/bad_gpa_for_first_semester_out_of_three/",
        "text": "Received my results and I'm disappointed I got a 2.80 gpa for my first semester on my masters. The reason I'm disappointed and also shocked because my undergrad I got a 3.86 gpa and never went below 3.8 gpa. I know I have to aim for A+ for the second and third semester in my masters..., I'd just like to know if anyone encountered a similar situation like this and any tips so I don't get burnt out? Im doing a certain field in physics btw.",
        "created_utc": 1675185688,
        "upvote_ratio": 1.0
    },
    {
        "title": "What next after admitting to PhD program",
        "author": "Lynn0315",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q46nn/what_next_after_admitting_to_phd_program/",
        "text": "[removed]",
        "created_utc": 1675184342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Constant illness and huge life events. I feel like giving up. I have no drive left. Advice?",
        "author": "A-B-HAYY",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q3cd0/constant_illness_and_huge_life_events_i_feel_like/",
        "text": "Hello fellow grad students. I came into my program the fall of 2019. Very excited about academia and research. My first illness involved my gall bladder in my first and second semester. I had to deal with constant pain and problems until I had insurance and surgery in my second semester. I got past it and then boom pandemic. Literally the week I should have come back from surgery. Fine. I found a lab I loved and worked really hard pursing this area of interest and taking classes. No thesis in sight though. I dealt with small various illnesses due to my autoimmune disease and allergies thay are being treated with shots. I had a few reactions. Had mental health troubles got on meds.  2021 comes along my meds are working im feeling great and then my advisor was being a total B. The project I was told could be my thesis was no longer on the table and we had a falling out when I called her on this and I chose a new advisor. That was the year I almost lost my marriage due to ignoring my partner for school, for this advisor and was blaming every issue on him \"taking my time\". After the stuff with my advisor my eyes were open to the fact that no one truly had my best interest in mind except my husband. We decided to start trying for kids and decided on a more simple path to a thesis. Or so I thought. I started piloting in January 2022. I had my first miscarraige in April. It took a minute to get on my feet. I had my second miscarraige in July. I was destroyed. I was in and out of doctors offices for months and got a diagnoses in December with the information that being pregnant will be high risk, expensive and I will have to take these shots everyday that do not sound great as they cause a lot of discomfort and bruising. My pilot finally ended in November but December was a wash with the news and holidays. So I thought in the spring I would get back to it focus up, work a lot and finish by may or August of this year. Boom H. Pylori infection. Allergic reactions to multiple antibiotics. Now here I am end of January with a terrible stomach infection and waiting for insurance to approve the antibiotic I need. Ive lost all this weight, im exhausted because my diet is so strict to help my stomach and every other day or so I end up too sick to go to my work site or have to leave early. This spring will be a full year behind when I \"should have\" graduated according to this degree plan. We now have a ton a debt from hospital visits this year. Im feeling like I dont remember anything I have learned. Its like my head is empty most of the time. I have no excitement or passion.  How on earth can I possibly finish this out in a way I can be proud of? I feel like a joke when it comes to academia now. I want to give up but need my degree for my certification once I graduate so I cam finally have a family and support said family. Has anyone else had a journey that felt like the universe was against them? How do you manage to get through the home stretch feeling like shit physically and mentally? I mentally checked out most of last year with everything thinking I would have this semester to jump to it. And here I am.",
        "created_utc": 1675182352,
        "upvote_ratio": 1.0
    },
    {
        "title": "Masters of Professional Studies- worth it?",
        "author": "chikenugetluvr",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q30dv/masters_of_professional_studies_worth_it/",
        "text": "Are Masters of Professional Studies worth it?\n\nTrying to find some info on the MPS degree. Not even sure this is a thing outside America, but basically an MPS is different from an MS in the sense that an MPS does not require a thesis, usually only takes 2 semesters, and is geared towards practical applications for a job rather than a more theoretical MS. My question is, will employers take an MPS as seriously as a MS? I do not want to get an MPS if they don’t, because then I feel as if it would be a waste of time and money. However, it seems like you can learn some cool stuff- looking at an MPS in machine learning, 10 classes geared towards machine learning and real job applications. Any insight would be great, and if there is another subreddit to post this in let me know! Thanks in advance",
        "created_utc": 1675181575,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone tried to get a grad school loan AFTER buying a house?",
        "author": "6morecoffeeskthx",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q2tum/has_anyone_tried_to_get_a_grad_school_loan_after/",
        "text": "Hello!\n\nI am looking into grad schools right now, hoping to apply in the next few months and start Spring 2024. I am also looking to buy a house in the next 3ish months. Has anyone done this and was able to get both loans approved AND balance the financing?\n\n**For context:** I live in NJ and was just offered a full time job in PA, so my husband and I will be relocating to PA in the next few months. We want to buy in PA because prices are more reasonable than in the NYC suburbs that we are currently renting in. I was born and raised in PA so I know the area well and my husband spent a few years there as well for work. The plan is that both of us will be employed full time by the time we permanently move to PA. We both have a great credit history and almost no debt.\n\nMy new job offers tuition reimbursement and has connections with local schools where I could be offered a discount on tuition but I am unsure of which schools at this point. I have been toying with the idea of getting my MBA for about 10 years now and I am thinking at this point in my career, this is the right time to do it.\n\nThe thing about it is, I would need to apply for loans if I decide to go to grad school. With this plan, I would be asking for 2 very large loans within a year of each other. I did some googling and while there are a TON of articles on buying a home while having student loan debt, there isn't anything mentioned about the other way around which is my case....buying a home first, then getting a grad school loan.\n\nIs the reverse situation something that anyone else has done? What has been your experience working with lenders and would buying a house so soon impact my ability to get a loan for school?\n\nThank you for your help!",
        "created_utc": 1675181146,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I make an exit plan a after thesis defense and graduation?",
        "author": "sweatersocks95",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q2oc5/how_do_i_make_an_exit_plan_a_after_thesis_defense/",
        "text": "[removed]",
        "created_utc": 1675180798,
        "upvote_ratio": 1.0
    },
    {
        "title": "Making an exit plan after thesis defense and graduation",
        "author": "sweatersocks95",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q2m3b/making_an_exit_plan_after_thesis_defense_and/",
        "text": "[removed]",
        "created_utc": 1675180646,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conquering Anxiety: A Teen's Guide to Relief",
        "author": "Christinaaa12",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q29pb/conquering_anxiety_a_teens_guide_to_relief/",
        "text": "# A comprehensive guide for teenagers who are struggling with anxiety.\n\n# Written by a licensed therapist and counselor who specializes in the treatment of anxiety and related mental health issues, this book provides strategies and techniques for managing stress and overcoming worry.\n\nThis book covers a comprehensive list of topics, which are related to anxiety, it's causes, symptoms, and how to manage them. It provides techniques and strategies for coping with anxiety, building resilience, and staying positive, and it also covers various aspects of life such as time management, physical activity and nutrition, social support, sleep, dealing with stress and test anxiety, bullying, cyber bullying, and how to navigate social media and technology. It's a guide for teens who struggle with anxiety and provides them with the knowledge and tools they need to improve their mental and emotional well-being.\n\nIn addition to the topics listed above, the book also delves into the importance of self-compassion and how to be kind and understanding towards oneself. It also emphasizes the importance of seeking professional help and finding the right therapist, as well as the importance of mindfulness and incorporating it into daily life. Throughout the book, the author uses relatable examples, easy-to-understand explanations, and practical advice that is tailored to the unique challenges that teens face when it comes to managing anxiety.\n\nThe book's approach is holistic, it covers not only the psychological aspect of anxiety but also the physical and social aspects, it provides the reader with a comprehensive understanding of the subject matter, and provides them with the necessary tools to manage and overcome anxiety.\n\n**The author's deep understanding of the topic and years of experience in the field of mental health makes the book an authoritative source of information on anxiety and its management.**\n\nWhether you're a student, a young adult, or a parent seeking advice for your child, this book provides actionable insights and tools for building resilience, managing stress, and staying positive. The ultimate goal is to empower readers with the knowledge they need to live their best lives, free from anxiety and stress.\n\n# [You can read the book here &gt;&gt; Conquering Anxiety: A Teen's Guide to Relief](https://www.amazon.com/Conquering-Anxiety-Strategies-Techniques-Overcoming/dp/B0BSJGXKRF/)",
        "created_utc": 1675179799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Temple University graduate students go on strike",
        "author": "alli_oop96",
        "url": "https://www.inquirer.com/news/temple-university-strike-graduate-students-pay-20230131.html",
        "text": "",
        "created_utc": 1675177904,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm south Indian and I do not have a surname and my passport has my father's name instead of surname and I just have my name with my initial in my aadhar card. Will I face any issues if I register for GRE with my passport credentials?",
        "author": "kaakabiriyani",
        "url": "https://www.reddit.com/r/GradSchool/comments/10q1770/im_south_indian_and_i_do_not_have_a_surname_and/",
        "text": "I'm south Indian and I do not have a surname and my passport has my father's name instead of surname and I just have my name with my initial in my aadhar card. Will I face any issues if I register for the test with my passport credentials and will this difference in name cause any complications in my application process? Please reply ASAP thank you!",
        "created_utc": 1675177227,
        "upvote_ratio": 1.0
    },
    {
        "title": "How in the world do I prove a hypothesis if not with a questionnaire ?",
        "author": "_justpassingby007",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pywch/how_in_the_world_do_i_prove_a_hypothesis_if_not/",
        "text": "[removed]",
        "created_utc": 1675171325,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are exchange grades factored when counting GPA/evaluating application for international student",
        "author": "1EGOATJAMES",
        "url": "https://www.reddit.com/r/GradSchool/comments/10py0jr/are_exchange_grades_factored_when_counting/",
        "text": "[removed]",
        "created_utc": 1675168817,
        "upvote_ratio": 1.0
    },
    {
        "title": "ABD Depression",
        "author": "Trynanotbeinpain",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pxr6b/abd_depression/",
        "text": "Title says it all. I'm a humanities student working on my second chapter out of four, initially I was hoping I could finish my PhD by May (when I run out of funding) and have a full time non-academic job lined up. However, writing is rather slower than I anticipated, my family were slammed with sickness and someone was laid off, and suddenly the depression is real. It's SO fucking hard to even want to get out of bed at the prospect of 1) overcoming a mountain of writing under a deadline, b) applying for extra funding which would give me so much relief but I don't think I have a high chance of, c) engaging in a difficult non-academic job search during a recession.\n\nTrying to take it one week at a time but I'm not a robot who can predictably churn out XYZ number of words five days a week. Some weeks are fellowship deadlines, some weeks a job posting comes up, some weeks I have family things to attend to, and some weeks I churn out almost half a chapter. It's difficult to get so much done when life feels unpredictable. When I feel overwhelmed it's hard to want to socialize with friends, go to exercise classes, take care of older family members, or do creative things. I just want to curl up and watch TV and numb it all out.",
        "created_utc": 1675168035,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chanakyaneeti 3.0 - National Level Strategy-Based Case Study Competition",
        "author": "Team_Aswini_Bajaj",
        "url": "https://www.reddit.com/r/GradSchool/comments/10ptb4u/chanakyaneeti_30_national_level_strategybased/",
        "text": "[removed]",
        "created_utc": 1675154598,
        "upvote_ratio": 1.0
    },
    {
        "title": "Living on PhD Scholarships",
        "author": "zonamoroza",
        "url": "https://www.reddit.com/r/GradSchool/comments/10psaie/living_on_phd_scholarships/",
        "text": "[removed]",
        "created_utc": 1675151996,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are most phd scientists single and childfree?",
        "author": "ciqbu",
        "url": "https://www.reddit.com/r/GradSchool/comments/10prp7n/are_most_phd_scientists_single_and_childfree/",
        "text": "[removed]",
        "created_utc": 1675149681,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for an incoming Ph.D Student?",
        "author": "inaicecream12",
        "url": "https://www.reddit.com/r/GradSchool/comments/10ppeel/tips_for_an_incoming_phd_student/",
        "text": "Hello everyone! I’m going to be a Ph.D Student in Math in Fall 2022! I’m super excited to further my studies and career!\n\nI come from a tiny private institution in the U.S and I didn’t get to take classes like Topology, Analysis, and other higher level math courses but now that Qualifying Exams are in my future, I definitely need to get to cracking and learn new subjects as well as brushing up on courses from earlier on in undergrad.\n\nDoes anyone have any tips on what online resources I can use or any study tactics that will get me ready come this fall?\n\nAlso what should I expect going into a Ph.D program? How can I be the best student as possible?",
        "created_utc": 1675141775,
        "upvote_ratio": 1.0
    },
    {
        "title": "What PDF reading/editing software do you guys use? I need recommendations.",
        "author": "annacat1331",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pony3/what_pdf_readingediting_software_do_you_guys_use/",
        "text": "Hi, I am in my first year of a sociology Ph.D., and I do lots and lots of readings of academic papers I find and PDFs of readings given out by professors. I use Zotero for the papers, but I am struggling to find a good program to use for all of my electronic class readings. Here are my priorities. If anyone wants to share how they organize/annotate all of their stuff, feel free!  \n\n\\-must be simple to use, I don't need lots of fancy features(not a tech person)\n\n\\-must be easy to highlight and make comments \n\n\\-ideally has cloud syncing I use mac and I have an Ipad and an iPhone \n\n\\-is free or not super expensive(damn the grad school salary) \n\nLet me know if anyone has any ideas or suggestions, I really appreciate it!",
        "created_utc": 1675139798,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Northeastern graduate student was struck and killed by a police cruiser in Seattle. What we know.",
        "author": "saturatedsock",
        "url": "https://www.boston.com/news/local-news/2023/01/30/northeastern-student-jaahnavi-kandula-killed-seattle-police-cruiser/",
        "text": "",
        "created_utc": 1675137606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interview tips?",
        "author": "litslens",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pmjs4/interview_tips/",
        "text": "If anyone can please help me tackle the pre interview nerves anxiety that would be amazing. I recognize that practicing out loud serves best, but in addition to that, anyone have other tips?\n\nInfo: I’m already in graduate school, currently applying for externships. \n\nThanks in advance!!",
        "created_utc": 1675134671,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tablet Recommendations",
        "author": "sciencebyj",
        "url": "https://www.reddit.com/r/GradSchool/comments/10plj5l/tablet_recommendations/",
        "text": "Hey everyone, so just as the title says I’m curious as to what tablet brand you use that has been helpful as you navigate grad school, especially for reading papers. My iPad (a VERY old edition) is on its last legs. \n\nTIA!",
        "created_utc": 1675131836,
        "upvote_ratio": 1.0
    },
    {
        "title": "Plagiarism impact for PhD admission?",
        "author": "dasigua",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pl6yx/plagiarism_impact_for_phd_admission/",
        "text": " How screwed am I? I am a CS master student in a top 10 CS university, but I was caught plagiarism(I use code from github for one of my assignment and got caught, I tried to talk to the professor but it didn't work), so I received a D+ for that class on my transcript and an academic violation in my record. I planned to go for a PhD in CS and got solid research work(I have one published paper in system and networking field). What should I do? Is this a dead end for applying a PhD, should I get a job instead? Appreciate any advice.",
        "created_utc": 1675130884,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chemistry PhD",
        "author": "dareal-slim-katie",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pknnn/chemistry_phd/",
        "text": "I have never been in an academic setting that challenged me so much. In undergrad I was always on top of my work and had enough time to enjoy myself, go to the gym, and even party. In my second year of my PhD program all I do is work and on the weekends I usually sleep or go out somewhere just to try to enjoy myself. Now that the semester has begun I lost my Sundays to a full day of class work. I am so lucky to do what I love, but I love it a lot less when I am being overworked. It does not help that my PI is an absolute workaholic. How do people not burn out working 6 days a week with such mentally involved tasks?",
        "created_utc": 1675129362,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to deal with the enormity of your dissertation research",
        "author": "buttmeadows",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pkigi/how_to_deal_with_the_enormity_of_your/",
        "text": "[removed]",
        "created_utc": 1675128952,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get into an Ivy League MBA? Tips? Suggestions?",
        "author": "Puzzleheaded_Eye8633",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pjhml/how_to_get_into_an_ivy_league_mba_tips_suggestions/",
        "text": "[removed]",
        "created_utc": 1675126172,
        "upvote_ratio": 1.0
    },
    {
        "title": "Housing and Research Travel",
        "author": "tothelmac",
        "url": "https://www.reddit.com/r/GradSchool/comments/10phpev/housing_and_research_travel/",
        "text": "Hey all, I'm wondering how people handle uncertainty of grants re:housing etc. In Boston we are often asked to renew comically early (Jan 1st most of the time), and I'm not gonna hear about even my first grant until March. Not really sure what to do, I have a partner and a cat who would accompany me on my research so I'm not really able to look up housing until March at the earliest. Any tips welcome.",
        "created_utc": 1675121485,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling very depressed about how unfair my grad program is",
        "author": "-_ILoveBread_-",
        "url": "https://www.reddit.com/r/GradSchool/comments/10phiip/feeling_very_depressed_about_how_unfair_my_grad/",
        "text": "Hi I just found this community and would like to vent about my life. I just realized today how depressed I got over the course of my grad degree. Everything is unfair. \n\nI'm going to graduate in June with my master's and its currently crunch time. My TA position covers my tuition and I get a stipend, so I'm trying not to be ungrateful, but I've been feeling so depressed lately trying to get everything done. I work over 50 hours a week, and most of my job is glorified babysitting when I'm TAing students. I am overqualified to show 18yo kids how to make an LED light up. I've been so angry recently, why did the department set it up like this? \n\nSome of my coworkers have their tuition and stipend paid for by a company, so they have more time for research. However, it seems like most of them don't dedicate this extra time to their research and they fuck off and don't do anything. I swear one person doesn't work more than 4 hours a day, her advisor is mad at her for her lack of progress, and they still cut her TA hours and give her industry money. Why am I, the person who has racked up the most publications out of all of us, forced to work myself to the bone TAing, doing my homework for the unnecessary extra class my advisor made me take, and research.\n\nI am going INSANE trying to get everything done, and I don't know what to do. I'm not going to go to the department and snitch on my coworker, and I feel like he won't listen to me anyway. I'm so disgusted with my department. Anyway, my rant is over.",
        "created_utc": 1675121012,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need to switch advisors, need advice on how to word it",
        "author": "catsnpensnbooks",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pgxm4/i_need_to_switch_advisors_need_advice_on_how_to/",
        "text": "My advisor has done nothing for me the past two years. Now they are on sabbatical, and never check in unless I send about 300 messages (exaggeration). I have no active research projects (I’m technically on 3 projects, but my advisor is the PI and never gets back to me when I send emails or messages to see what I can do), no papers in the process of writing, and no teaching experience. \nWhat is the best way to phrase to other people/professors that I want to switch advisors? \n\nI’ve been begging for more experience the past year, from my advisor and other professors, but nothing comes of it. I’m so exhausted, that I no longer know what I can say to other people. \n\nI want to remain professional, but it’s really hard when I’m so tired and emotionally drained, and I tend to say the unfiltered truth.\n\nI was thinking of saying something along these lines:\n\n“I’m currently looking for a new advisor, since my current one’s style is not compatible with my career goals.”\n\nAny advice would be great. And I’ll also mention that I need more experience.\nOne of the hard parts about switching is that I’m funded on a project, and I do t want to lose that funding. Then, what I’m studying/interested in is not like anything else professors in the department are studying.",
        "created_utc": 1675119609,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your sleep schedule in grad school?",
        "author": "No-Appearance-664",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pgw55/whats_your_sleep_schedule_in_grad_school/",
        "text": "How many hours of sleep do you usually get? What time do you sleep and wake up? How do you make sure you’re not sleep deprived on a regular basis?",
        "created_utc": 1675119509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any chance for schools like Parson or Pratt for grad school with a 2.7 CGPA?",
        "author": "Dangerous_Wish4513",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pg4ir/any_chance_for_schools_like_parson_or_pratt_for/",
        "text": "[removed]",
        "created_utc": 1675117645,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grad students doing unpaid practicum/internships/etc.. how do you do it?",
        "author": "Mysterious-Visit-650",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pg2r3/grad_students_doing_unpaid/",
        "text": "",
        "created_utc": 1675117522,
        "upvote_ratio": 1.0
    },
    {
        "title": "Research Associate vs Post-Doctoral Fellow... which would you choose?",
        "author": "worstgurl",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pfwu8/research_associate_vs_postdoctoral_fellow_which/",
        "text": "Hi everyone. Just here looking for some perspective as I try to figure out my next steps in life.\n\nI'm a PhD Candidate, projected to finish and defend by end of May this year. I have been offered a post-doctoral fellowship, and I have an interview for a research associate position this week. I (obviously) haven't been offered the research associate position yet, but for the sake of argument, let's say I'm offered the job. I'm wondering about what people would do in my shoes if that were the case, as I see pros and cons to each role.\n\nPost-Doc. Fellowship:  \n\\- 70k CAD   \n\\- with a team I have a good rapport with and know well   \n\\- lots of opportunities for networking and professional development  \n\\- opportunities for publications and conference presentations  \n\\- remote but will require travel throughout a certain province (where I currently live)  \n\\- the same field as my PhD so gives me further opportunity to become an expert   \n\n\nResearch Associate:",
        "created_utc": 1675117128,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dude, why are conferences so expensive?",
        "author": "saturdazzze",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pfaxb/dude_why_are_conferences_so_expensive/",
        "text": "Sigh. I was accepted to present at a conference that I was pretty excited about. It's my first one. I did NOT expect to have to pay $200 for registration, $40 for a banquet, and about $500 to fly/lodge... This is about to be a $1,000 event after the fees! I'm a grad student. Translation: dirt poor. \n\nThere's options for grants, however, it's not expected to cover the majority/all of the expenses. I'm going to speak to my advisor about possible funding from my own department, but jeez. $1,000 for a CV boost? This is really sad.",
        "created_utc": 1675115714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on planning for a history masters?",
        "author": "chinchillatime",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pes6f/advice_on_planning_for_a_history_masters/",
        "text": "I am a junior history/anthropology major, women and gender studies minor (but due to my double major I have two more years to go). For reference I want to be an early modern historian, preferably focusing on the British Isles. I plan (hope!) to get my PhD after my masters. \n\nMy GPA is okay (3.3 atm but i anticipate it being higher by graduation) but I have several professors who adore me and I am fairly confident I could get multiple positive LoRs. I also have participated in anthropological research for 4 semesters and have one publication that way. I also did a historical archeology internship for a semester. \n\nMy main question is where do I start in determining what programs would be a good fit to apply to for my master's? I am a first generation college student so this is all foreign to me. Are there email lists I need to be following? How do I determine how I shape up and where I could possible consider one day applying to? My advisor kind of just acts like I should already know this stuff so sorry if these are basic questions.",
        "created_utc": 1675114500,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to drop out before semester ends",
        "author": "TayyOnTop",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pe8q9/want_to_drop_out_before_semester_ends/",
        "text": "[removed]",
        "created_utc": 1675113248,
        "upvote_ratio": 1.0
    },
    {
        "title": "YALE NP SCHOOL ADMISSIONS",
        "author": "Wonderful-Finding-88",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pdswl/yale_np_school_admissions/",
        "text": "[removed]",
        "created_utc": 1675112286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to drop out before semester ends",
        "author": "TayyOnTop",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pdniw/want_to_drop_out_before_semester_ends/",
        "text": "[removed]",
        "created_utc": 1675111926,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any advice for dealing with being frozen due to workload?",
        "author": "random_v_throwaway",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pd2oc/any_advice_for_dealing_with_being_frozen_due_to/",
        "text": "Hi everyone, \n\nI’m not sure the title is the best way to put but, but I’m not sure how to even phrase it. Basically, sometimes it‘s really difficult to do any specific work because of all the separate work I have to do. For example, I’m working on revisions for an R&amp;R, I’m working on another manuscript and doing that study itself, I’m teaching a class, I’m working on my prospectus revisions, preparing for a written comprehensive exam, and one of my professors (not on my committee) is pushing me to work on a project that is interesting and potentially important, but it’s a really time-demanding project and it’s only partially related to my dissertation. It’s just overwhelming and sometimes I just feel frozen and have a really hard time compartmentalizing the work, if that makes sense? \n\nI’m in my third year so I’m used to having a lot of work to do at this point, but I’m just struggling a lot right now. Does anyone have advice for this?",
        "created_utc": 1675110540,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you are struggling with mental health, do NOT reach out to your program advisors.",
        "author": "bloo-dragoon",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pc8f4/if_you_are_struggling_with_mental_health_do_not/",
        "text": "They do NOT have your best interest in mind. They only care about covering their own asses. \nI made the mistake of reaching out to my professor for support and instead I got a meeting with my program director telling me to take a leave and come back next year, putting my whole degree on hold for another year. She “graciously” took the initiative for me and cancelled my internship and started the process of withdrawal for me without giving me time to consider my options first. I’m in good academic standing and have good reviews from my professors so this response is just baffling. \nMy mental health has gotten even worse and now I’m standing outside the assistant dean’s office trying to reverse the damage she did. \n\nI never should have asked for help. I should have just suffered in silence. My life would be easier. Fuck university. Fuck grad school and fuck academia.",
        "created_utc": 1675108543,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any chance for schools like Parson or Pratt for grad school with a 2.7 CGPA ?",
        "author": "Dangerous_Wish4513",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pc7ke/any_chance_for_schools_like_parson_or_pratt_for/",
        "text": "[removed]",
        "created_utc": 1675108489,
        "upvote_ratio": 1.0
    },
    {
        "title": "Different Grad studies from undergrad ?",
        "author": "lizr26",
        "url": "https://www.reddit.com/r/GradSchool/comments/10pc2y6/different_grad_studies_from_undergrad/",
        "text": "hello, kind of what the title says. basically, i’m a second year molecular biology major and i’ve realized that i’m more interested in the chemistry part of molecular biology than the biology part. however, it’s a bit too late for me to switch over entirely to biochem. \n\nis it possible/ advisable for me to study biochemistry in grad school when i’ve done biology in undergrad ? if anybody has experience in this i would love some input ty ty",
        "created_utc": 1675108182,
        "upvote_ratio": 1.0
    },
    {
        "title": "Job Hunting, Part 1 - Not That Kind of Doctor",
        "author": "Internal-Humor-2867",
        "url": "https://youtu.be/CI7jk3UL9k8",
        "text": "",
        "created_utc": 1675104316,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on being more confident when interacting with my advisor?",
        "author": "messcogitans",
        "url": "https://www.reddit.com/r/GradSchool/comments/10p9tb9/advice_on_being_more_confident_when_interacting/",
        "text": "My advisor is brilliant, and I thoroughly respect and admire her approach and way of thinking.  But I tend to feel (and perhaps even act) like an incompetent fool during meetings. I have pulled a couple of all-nighters before meetings, and ironically end up with nothing to show for it. I've also blanked out a couple of times when discussing details, so I don't think I can expect her to trust my judgement or ability. My ideas usually get very politely turned down (there's a good reason for it) so I don't have the confidence to propose an ambitious project of my own. But when I go to conferences and meet other people in the field, I feel a little less like a nincompoop because they don't seem to think that my ideas aren't worth looking at (I've had a couple of people ask me to email them regarding details, and have received advice on how to pursue them). I'm not saying that I'm being underestimated by my advisor, but in her eyes, I think I'm probably her worst advisee. I'm working on a joint project with another of her other students, and I find my voice being drowned out since the suggestions/future directions are discussed with him more often, rather than when both of us are together or when I meet with her individually (of course, he meets with her earlier too, so that's also a reason). But I get the impression that my advisor thinks it's more of my co-first author's project rather than joint work. It doesn't help that he (my co-first author) has more high impact work, and is generally more confident.\n\nI don't want to get into the rabbit hole of comparing myself to someone else, but I would appreciate some advice on how to be more confident and not let my nerves get to me when I meet with my advisor. I've been working on being more organized, but I suppose it would help to not feel like a bundle of nerves when I meet because I'm usually not this nervous when talking to other profs.",
        "created_utc": 1675102851,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going from Law undergrad to MiM",
        "author": "ApartGarden",
        "url": "https://www.reddit.com/r/GradSchool/comments/10p97fk/going_from_law_undergrad_to_mim/",
        "text": "Hello,\n\nI'm currently in my 2nd year of a 4 year law undergrad degree in Europe, however  I'd like to pursue an MiM after I finish undergrad. Ideally I'd go to LSE, LBS, HEC, ESCP, or something similar. \n\nHowever, I'm a bit worried that my application wouldn't be as competitive being that I don't have econ/finance/management background. I have both research and work experience, but they are both in the field of law, completely unrelated to the aforementioned fields.\n\nDoes my law experience hinder a business school application? Should I strive to pursue more business-oriented professional experience/extra-curriculars? Or should I continue with my focus on law?",
        "created_utc": 1675101406,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m about to get my associates in May. When can I actually apply for masters programs? When is too early?",
        "author": "kojohn11",
        "url": "https://www.reddit.com/r/GradSchool/comments/10p8zrx/im_about_to_get_my_associates_in_may_when_can_i/",
        "text": "",
        "created_utc": 1675100891,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some GradSchool alternatives or paths I could take while interested in Academia?",
        "author": "Reystrek",
        "url": "https://www.reddit.com/r/GradSchool/comments/10p8ax7/what_are_some_gradschool_alternatives_or_paths_i/",
        "text": "[removed]",
        "created_utc": 1675099219,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two supervisors leading to double the headache",
        "author": "ness10692",
        "url": "https://www.reddit.com/r/GradSchool/comments/10p7j9k/two_supervisors_leading_to_double_the_headache/",
        "text": "Hello,\n\nI have 2 supervisors. They are both excellent people and I do like them. But I find myself oftentimes in these awkward situations where they both want things that are directly opposing what the other wants in terms of research/experiments and more. They frequently don't communicate with each other.   \n\n\nI'm now working on my permission to write and so many things are these awkwardly assembled pieces of wtf where I am just trying to make a coherent document without any guidance from either of them in the past 2 months. I've never written a document like this before and was told \"Just ask a friend for their permission to write\". I sent in my first draft and they want to have a meeting to discuss it tomorrow -  they both have opposing ideas and are tearing my work apart. Then they don't like how a bunch of data was processed and interpreted, I had sent them comprehensive reports previously breaking it all down in detail and they're now developing issues with it after I spent months on this document. Some of the issues with the data were brought up over a year ago and it was shrugged off but NOW it's an issue. \n\nThere is a whole bunch of other things too, but getting into it would probably get this post to the point where I could be identified by someone.\n\nI'm just so frustrated with the inconsistency and the lack of support. We were supposed to meet every 2 weeks - nope every 2 months. \n\nThis is partly just me ranting, but what is the best way to approach discussing these things with them? I know they aren't meaning for the situation to be like this and I intend to continue to work with the one supervisor in the future once I graduate as my field is fairly small.",
        "created_utc": 1675097331,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone tried grammarly for PS/ writing samples?",
        "author": "crybaby2125",
        "url": "https://www.reddit.com/r/GradSchool/comments/10p7ebx/anyone_tried_grammarly_for_ps_writing_samples/",
        "text": "Preparing for literature master application in Canada. \n\nEnglish is my second language, so I may need some help to make my personal statement and writing sample more academic.\n\nHas anyone tried grammarly premium for revision? And what's your reviews? \n\nThanks a lot for sharing. \n\nP.s. If anyone would like to help me with both writings, dm me. Will pay!!!",
        "created_utc": 1675096980,
        "upvote_ratio": 1.0
    },
    {
        "title": "Highest paying MFA in writing?",
        "author": "Potential-Berry9059",
        "url": "https://www.reddit.com/r/GradSchool/comments/10p7ddb/highest_paying_mfa_in_writing/",
        "text": "[removed]",
        "created_utc": 1675096913,
        "upvote_ratio": 1.0
    }
]