[
    {
        "title": "How did you decide what graduate program was right for you?",
        "author": "SpookyRabbit9997",
        "url": "https://www.reddit.com/r/GradSchool/comments/11m34xh/how_did_you_decide_what_graduate_program_was/",
        "text": "Context: I live in the US. I received a Bachelor's degree in engineering from a top school. I had a lot of parental pressure to get an undergraduate degree in either engineering or be pre-med, but I've always been interested in equity, health and wellbeing, and social justice. Now that I'm financially independent, I'd like to focus my career in this space. I have 2 years of experience right now at a consulting firm who will sponsor my graduate degree.\n\nI'm looking for matriculate to a program for Fall 2024 to use my company's graduate school sponsorship program. The sponsorship is limited to my current role so there is some time-pressure here. I was looking at doing an MPH and/or MBA, but there are just so many options out there. Some of the others I'm considering are Law, MPP, and MPA (and maybe even an MSW).\n\nMy question is, how did you go about picking the graduate program(s) you would apply for and aim for, especially when you are pivoting to a broad field? I recognize that all of these options would get me toward my goal, and I'm having a hard time getting a clear picture of which one makes the most sense for me.\n\nSome of the things I've tried so far are LinkedIn searches, reading about what graduates of different programs do, reading job descriptions of jobs that I might be interested in and seeing what kind of degrees they require. I think it's hard for me to get a lot of insight from this \"Googling\" because I'm not super clear about what will make me happy / suit my skillset, partially because I can't picture the role I see myself in, and partially because I don't have experience in any of these spaces.\n\nSome more details is I would like to have a career that gives me at least $100k salary, and I'd like to stay away from corporations (e.g., looking more in the non-profit space or public sector). I recognize that these things are close to mutually exclusive.\n\nI'd appreciate any food for thought this community can provide.",
        "created_utc": 1678298244,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lost my job in industry and want to go back to school- too late for fall 2023 to apply?",
        "author": "busfull",
        "url": "https://www.reddit.com/r/GradSchool/comments/11m33x7/lost_my_job_in_industry_and_want_to_go_back_to/",
        "text": "I was let go from my job in industry after 5 years (mostly my fault) and I want to make a pivot into academia. It seems like most schools had deadlines for applying in December/ January, although some schools have January as the soft deadline to get funding.\n\nIs it too late at this point to apply for the Fall 2023 semester? I'm really not ready for another industry job at the moment but I can't afford to wait all the way until Fall 2024 to go back to school without a job. How does this work as far as funding/ fellowships?",
        "created_utc": 1678298179,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a good thank you present for a graduate program coordinator who is moving on?",
        "author": "Curiosity-Sailor",
        "url": "https://www.reddit.com/r/GradSchool/comments/11m3397/what_is_a_good_thank_you_present_for_a_graduate/",
        "text": "We have an awesome grad program coordinator who is moving at the end of the semester to a different state for her husband’s new job. She has been so helpful to me and many others in the program. What would be a good thank you/going away present for her? Also, would a party be a good idea?",
        "created_utc": 1678298135,
        "upvote_ratio": 1.0
    },
    {
        "title": "Work experience on SOP",
        "author": "dumbcuntbutnice",
        "url": "https://www.reddit.com/r/GradSchool/comments/11m2sfk/work_experience_on_sop/",
        "text": "Applying to a MH counseling program and was fired from a research lab after 7 mo due to me criticizing the management of the lab to be poor and them exaggerating or falsifying reasons entirely to fire me. This is my only research experience but have a internship starting next month. I would like to talk about some type of work experience SOP but it’s only this or my time working as a nanny. It makes up a good portion of my SOP so I need to either keep it or replace it. Can I keep it and just not name the study or who it was under? Not sure how I should go about it or what to replace that section talking about my research entirely. I can stretch the nanny thing but it won’t be anywhere near as good",
        "created_utc": 1678297435,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sincerely considering quitting",
        "author": "saxlover69",
        "url": "https://www.reddit.com/r/GradSchool/comments/11m2q9a/sincerely_considering_quitting/",
        "text": "I’ve been fortunate enough to have been awarded a fellowship position at my university. I’m able to play and teach music that I love while earning my masters for free. I feel especially lucky because I didn’t major in music during undergrad, and was still accepted into this program. There are a few things that I’ve been struggling with, though. Even though I’m in school for music, I feel like I hardly ever get the chance to play with other people. It is not fulfilling my desire to create music, and I feel like my creativity is stagnating. (I will say though that my facility on the instrument has improved a lot since being here.) I barely have enough time to practice my instrument, do my homework, and take care of myself.\n\n I’m also really lonely here. Most everyone else did their undergrad here and are already friends, and I feel like I don’t fit in with them. This is partly due to the program being entirely male- dominated. I am the only woman grad student in this department and it feels isolating. I’ve been invited to hang out with them a few times but it hasn’t clicked. \n\nI want to quit after the end of this year and I don’t know how to talk to my advisor about it. I know it will come as a shock to everyone because I am always cheerful on the outside despite of how I truly feel. I don’t want to seem ungrateful for the opportunity, but I don’t feel like this is a fit for me.",
        "created_utc": 1678297298,
        "upvote_ratio": 1.0
    },
    {
        "title": "Answering grad school application questions",
        "author": "dumbcuntbutnice",
        "url": "https://www.reddit.com/r/GradSchool/comments/11m2844/answering_grad_school_application_questions/",
        "text": "One of my questions to answer is something along the lines of “describe and encounter with a person or group that is different from you” what are they looking for? I meet people every day that are different from me. What type of encounter or answer are they looking for?",
        "created_utc": 1678296168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Contacting supervisor after acceptance",
        "author": "chiancas",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lzxhf/contacting_supervisor_after_acceptance/",
        "text": "I was accepted to an MEng Civil Engineering program a few days ago (yay!), and the welcome letter I received mentioned that I should contact my supervisor to \"discuss my plan of study\". I'm wondering what I should say in my first email to them, as I've never spoken to them before. Thanks!",
        "created_utc": 1678290979,
        "upvote_ratio": 1.0
    },
    {
        "title": "when do you receive GA confirmation?",
        "author": "2morrow_is_a_gud_day",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lzvt8/when_do_you_receive_ga_confirmation/",
        "text": "[removed]",
        "created_utc": 1678290877,
        "upvote_ratio": 1.0
    },
    {
        "title": "When do you receive GA confirmation?",
        "author": "2morrow_is_a_gud_day",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lzugj/when_do_you_receive_ga_confirmation/",
        "text": "[removed]",
        "created_utc": 1678290792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can a PhD be bad for career in Materials Science industry?",
        "author": "Vikknabha",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lyv8f/can_a_phd_be_bad_for_career_in_materials_science/",
        "text": "So, I'm in MS program in Materials Science now. I like doing original research and want to do PhD but maybe will transition to industry after that. \n\nWill it be bad for my career, I have worked for some time in education sector with my previous Physics degree and I have no industrial experience in Materials Science. Will it make me less marketable if I jump into PhD after masters?",
        "created_utc": 1678288458,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting an MBA vs Computer Science OR Cyber Security Masters. (CS Undergrad here)",
        "author": "goldenstandard720",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lxzm4/getting_an_mba_vs_computer_science_or_cyber/",
        "text": "[removed]",
        "created_utc": 1678286301,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is coursework like for an English PhD?",
        "author": "TheSquirrel99",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lxwpz/what_is_coursework_like_for_an_english_phd/",
        "text": "Hello I am already getting a masters in English and have been entertaining the idea of potentially getting my PhD in English. I am curious what the courses in the level are like, what class work is like, and what career opportunities would come from getting this far. Thank you for answering!",
        "created_utc": 1678286086,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on Chicago School of Professional Psychology?",
        "author": "ferahs",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lxlxd/thoughts_on_chicago_school_of_professional/",
        "text": "[removed]",
        "created_utc": 1678285276,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wailisted by a program. At the same time, was invited for an interview for an external phd fellowship, any experienced individuals?",
        "author": "muaithaimma",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lv0i2/wailisted_by_a_program_at_the_same_time_was/",
        "text": "ok so I was waitlisted by my top choice (get into 2nd choice though hahahaha), and somehow I received an interview for an external phd fellowship (something like NSF, which is not link to the program or school that I applied to), the results of the fellowship will be out before April. So my question is, should I inform the admission comittee, and would winning the fellowship help me getting off the waitlist?",
        "created_utc": 1678278206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confusion regarding Master's in Information Systems Management program at Arizona State University",
        "author": "Lost-Jellyfish-5412",
        "url": "https://www.reddit.com/r/GradSchool/comments/11luhp5/confusion_regarding_masters_in_information/",
        "text": "[removed]",
        "created_utc": 1678276650,
        "upvote_ratio": 1.0
    },
    {
        "title": "Query regarding one year MS - Information Systems Management program at ASU (WP Carey)",
        "author": "Lost-Jellyfish-5412",
        "url": "https://www.reddit.com/r/GradSchool/comments/11luddy/query_regarding_one_year_ms_information_systems/",
        "text": "[removed]",
        "created_utc": 1678276259,
        "upvote_ratio": 1.0
    },
    {
        "title": "Internships Question",
        "author": "queenofcaptivation01",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lubww/internships_question/",
        "text": "I am looking for psychology internships for the summer. Does anyone have any advice about how to go about looking for them, or any internships in general? I’ve never applied to one and I am pretty intimidated on where to start. Is it too late for summer internships since we already in March?",
        "created_utc": 1678276130,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having doubt in selecting a program!",
        "author": "Lost-Jellyfish-5412",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lu8od/having_doubt_in_selecting_a_program/",
        "text": "[removed]\n\n[View Poll](https://www.reddit.com/poll/11lu8od)",
        "created_utc": 1678275862,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grad school interview. Should I be excited?",
        "author": "liatheaud1",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lth0e/grad_school_interview_should_i_be_excited/",
        "text": "So yesterday I had my interview for a doctoral program. The program director offered to put me in contact and introduce me with one of his field colleagues who works in my state. That was totally unexpected. Would you guys say this is a good sign? I’ve visited the campus in person before on an individual tour, so the program director has met me prior. Just didn’t know if I should only take this with a grain of salt or if I should start celebrating early 😂",
        "created_utc": 1678273416,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I get a PhD while working full time ?",
        "author": "ekene_k",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lrqq9/can_i_get_a_phd_while_working_full_time/",
        "text": "[removed]",
        "created_utc": 1678267396,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does grad school salary include tuition?",
        "author": "UniversityStudent360",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lrjax/does_grad_school_salary_include_tuition/",
        "text": "For tax reasons, my grad school money thing listed 2 parts: the tuition covered (like ~60k) and the stipend (~40k). So am I making 100k or 40k declarable?\n\nAnd if I get a scholarship/funding from DOE or DOD, how does that pay into this?",
        "created_utc": 1678266652,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does grad school salary include tuition?",
        "author": "Altruistic-Bid4584",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lrhxk/does_grad_school_salary_include_tuition/",
        "text": "[removed]",
        "created_utc": 1678266517,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the difference between PI and advisor?",
        "author": "Just-Acanthaceae-282",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lq9iq/what_is_the_difference_between_pi_and_advisor/",
        "text": "[removed]",
        "created_utc": 1678262327,
        "upvote_ratio": 1.0
    },
    {
        "title": "Decision acceptance timeline",
        "author": "Schrodingdong",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lpwdo/decision_acceptance_timeline/",
        "text": "Hi,\n\nI am an Indian student and have applied for MS in Data Science programs. I just got accepted into University of Massachusetts, Dartmouth. The decision letter says I should indicate my decision as soon as possible and that they reserve the right to cancel my admission and give it to another applicant if I take too long. I am waiting on other decisions, so my question is **How much time do they usually give to indicate acceptance?** \n\nAlso, if I do accept it now and letter get another admit and choose to pursue that school instead will there be any repercussions.\n\n&amp;#x200B;\n\nThank you in advance",
        "created_utc": 1678261079,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does undergrad GPA matter after grad school?",
        "author": "Impossible-Cry-495",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lpfju/does_undergrad_gpa_matter_after_grad_school/",
        "text": "",
        "created_utc": 1678259513,
        "upvote_ratio": 1.0
    },
    {
        "title": "Watering Down Options",
        "author": "collidis",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lotns/watering_down_options/",
        "text": "***\\*Second time posting due to removal from account age\\****\n\nHello everyone. This is going to be a lengthy post, but for anyone that sticks around, I greatly appreciate the help and feedback. This is a relatively new account, but some of the details will make it very easy to tell who I am. *If* you know who I am, hello!\n\nI am currently in my last semester of an MSc program (bio-energetics), but my research and guidance from my PI has been focused around biophysical science and biochemistry. It has been such a wonderful experience to investigate something using novel methods in order to give light to those that have a more structured understanding about X topic. This process got me hooked and shifted my career goals from physician, to PhD. What the theme of that PhD is *why* I am posting today. When I graduated from my undergrad, I had a laundry list of courses that were needed for medical school admissions, such as organic/inorganic/physical/bio chemistry. I decided to add some more courses under my belt because I had some semesters to kill and figured why not? Little did I know that this would later serve me well in understanding the literature and what went into the review for my research throughout the MSc program.\n\nI have spoken to my PI about his research, which is in organic chemistry and physical chemistry, but the conversations never gave me the clear cut answers I wanted. I would ask him questions like:\n\n* *What fields did you contemplate during your search for PhD programs?*\n* *Did you have a paper that changed your mind about your goals in research?*\n* *Being a chemist, how did you pick the specific branch of chemistry to go into?*\n\nI was searching for his sales pitch of why his branch was \"cooler\" than the others. I know that is unrealistic to expect, but with all the CO-Is and people I have collaborated with, I think all their fields are cool. So I guess my first question to everyone reading this post (even if your field is not in chemistry) is **what is your sales pitch to someone?**\n\nI have been fortunate enough to be in contact with people from varying disciplines, hoping to get some inspiration about themes I would like, but overall I am finding myself overwhelmed with my options and the sheer amount of cool sh\\*t science has to offer.\n\nIf you have any quick statements about your field or papers that shed light or advice in my situation, I would be more than appreciative.",
        "created_utc": 1678257546,
        "upvote_ratio": 1.0
    },
    {
        "title": "SCIENTISTS:Mathematicians DoubleThink",
        "author": "qiling",
        "url": "https://www.scribd.com/document/552377365/The-Age-of-the-Enlightenment-is-at-an-end-reason-is-bankrupt",
        "text": "",
        "created_utc": 1678251950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thinking about going to grad school",
        "author": "mkim_",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lmqvi/thinking_about_going_to_grad_school/",
        "text": "Hi all. I graduated from undergrad at 2019 with a BFA in graphic design and minor in advertising and public relations. I’ve been working a full time job since and been thinking about going back to grad school so I can make a higher earning in my career. \n\nI’m feeling very overwhelmed by the amount of resources available. I haven’t applied to colleges since I was in high school at 2013 and I honestly don’t know where to start since I had a lot of help applying for my undergrad. I’m also not sure if I want to study in a major design related to further advance my knowledge, or study in a field like marketing. Are there any websites or tips anyone has to get started and to make this a seamless process?\n\nThings like financial aid and scholarships are very important to me. I didn’t graduate with academic achievements but it is over 3.0. I currently work at a reputable digital media agency as a UI Designer.",
        "created_utc": 1678251212,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is Boston university(USA) for masters?",
        "author": "tantan_7777",
        "url": "https://www.reddit.com/r/GradSchool/comments/11ll634/how_is_boston_universityusa_for_masters/",
        "text": "I got into Boston university and I’m really happy as it was one my priority universities. It’s quite expensive tho. \nI got into the business analytics program. \nI’m not sure if it’s worth going TEHRE or can I choose another university. \nI have admits from other universities but not that we aren’t ranked as high as BU.",
        "created_utc": 1678246789,
        "upvote_ratio": 1.0
    },
    {
        "title": "Academic Deferral for Graduate School Admission",
        "author": "Hovercraft_Fair",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lk25e/academic_deferral_for_graduate_school_admission/",
        "text": "[removed]",
        "created_utc": 1678243858,
        "upvote_ratio": 1.0
    },
    {
        "title": "Academic Deferral For Graduate Admission",
        "author": "Hovercraft_Fair",
        "url": "https://www.reddit.com/r/GradSchool/comments/11ljywc/academic_deferral_for_graduate_admission/",
        "text": "[removed]",
        "created_utc": 1678243623,
        "upvote_ratio": 1.0
    },
    {
        "title": "Deferral for Academic Reasons",
        "author": "Hovercraft_Fair",
        "url": "https://www.reddit.com/r/GradSchool/comments/11ljy9n/deferral_for_academic_reasons/",
        "text": "[removed]",
        "created_utc": 1678243576,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you work while doing masters?",
        "author": "Leather-Value2474",
        "url": "https://www.reddit.com/r/GradSchool/comments/11ljrwq/can_you_work_while_doing_masters/",
        "text": "1. As an international student, I'll be able to work 20h per week, my master's will be full-time. Can you work during this time?\n2. Also, I have a full-time job for 40h, which may allow me to continue abroad.  \nCan I maintain this job for the first semester? Is it going to be illegal?\n3. What jobs did you work during your master's, and how was the pay? I don't want to stay away from the job market for two years.",
        "created_utc": 1678243117,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling torn between two programs… can’t decide which one to pursue in the fall. Advice?",
        "author": "nicolerene123",
        "url": "https://www.reddit.com/r/GradSchool/comments/11ljqpd/feeling_torn_between_two_programs_cant_decide/",
        "text": "Hello there! \n\nI am currently in my final semester of undergrad at UIndy, majoring in Human Biology. \n\nMy career goals are to go into forensics, preferable as a DNA analyst.\n\nI’ve been accepted to UIndy’s Masters in Human Biology program, as well as IUPUI’s non-thesis Forensic Biology program. \n\nI’m feeling truly torn on which program to pursue. I’ve made pros and cons lists of both and I’m still undecided. Originally I was all for IUPUI because I can finish the program in a year and get right to work. However, after learning about some of the opportunities I could have at UIndy, it has me second guessing. \n\nI’m already well established at UIndy and have worked with all of the professors in the program. If I went there for my Masters, I could work in the forensic DNA lab working on actual crime scene case work with a local police department. The program would take 2-3 years to complete. If I went to IUPUI, I could get an internship at a local forensic lab as well as complete the program in 1 entire year. \n\nAny advice would be greatly appreciated!",
        "created_utc": 1678243025,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m pretty sure my ex-PI scooped my ideas, but I can’t prove it so I have to suck it up.",
        "author": "throweweh18769",
        "url": "https://www.reddit.com/r/GradSchool/comments/11liujv/im_pretty_sure_my_expi_scooped_my_ideas_but_i/",
        "text": "[removed]",
        "created_utc": 1678240745,
        "upvote_ratio": 1.0
    },
    {
        "title": "What will your graduate stipend be for 2023-2024?",
        "author": "grad-stipends",
        "url": "https://www.reddit.com/r/GradSchool/comments/11li0sd/what_will_your_graduate_stipend_be_for_20232024/",
        "text": "[removed]",
        "created_utc": 1678238595,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m scared to go to grad school because it seems very lonely",
        "author": "infinite_treasure",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lhy57/im_scared_to_go_to_grad_school_because_it_seems/",
        "text": "I really want to continue my education, but I’m thinking that it would make me more lonely. As I took more upper level courses, there were less people, and it’s to the point where there’s only a few people in my class. \n\nThe thought of studying something a very small percentage of the world knows scares me, because I’m a very lonely person. I want to share experiences with people.\n\nI feel very conflicted. Currently I’m thinking of getting a PhD, and I don’t want those 4-6 years to be spent being alone. \n\nWhat should I do? Will I be okay?",
        "created_utc": 1678238408,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you feel like an alien walking on campus surrounded by undergrads ?",
        "author": "FaruinPeru",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lh0jp/do_you_feel_like_an_alien_walking_on_campus/",
        "text": "Hi! Whether ur doing a masters phd or post doc etc, i find it hard to make friends at university apart from my cohort. Let me explain, \n\n 22F. Moved to this city to do an MA, will start PhD in Sept fingers crossed. I’ve done my fair share in making friendships with my cohort but it’s always surface level so i won’t force anything. My cohort is alright, we’re definitely not a family. We all act more like acquaintances. Apart from that, I feel so age conscious when I walk around campus knowing it’s like 90% undergrads and Im older than all of them there. I tried being friends with those i meet here n there but the academic gap dynamic really shows when I tell them i’m a TA they act like i’m an elder citizen lol\nNo undergrad would want to hang out with a MA/PhD because they all have their own groups clubs and  friends. \n\nTl;dr/ Walking on campus makes me feel age conscious since like 90%+ is all undergrad and making friends with them as an older student is questionable . Making friends isn’t a priority but walking on campus shouldn’t make me feel like an alien either Lol &gt;.&lt; \n\nImportant note/ i get 22 is young &amp; undergrad students are 18-22+ but they still have this hierarchy and it’s as if being friends with a grad student is a bit awkward for them .",
        "created_utc": 1678236020,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doing my masters and feel pretty stupid",
        "author": "ivateh",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lgt00/doing_my_masters_and_feel_pretty_stupid/",
        "text": "I am doing my masters currently and also joined a new lab. They are completely new techniques and I don’t know a lot of basics. I am trying to pick up as fast as I can, but often mess up when my PI asks me questions regarding certain techniques and processes. My undergraduate lab research was pretty different from my current lab and I feel confused. I also feel like I am falling behind on my coursework and feel bad for even taking a break for a while. Any advice on how to deal with this?",
        "created_utc": 1678235485,
        "upvote_ratio": 1.0
    },
    {
        "title": "Harvard MPP 2023",
        "author": "daydreamingg_fairy",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lgano/harvard_mpp_2023/",
        "text": "[removed]",
        "created_utc": 1678234234,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any experience buying a home with a 1098-T instead of a W-2?",
        "author": "gelliebaby",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lga8v/any_experience_buying_a_home_with_a_1098t_instead/",
        "text": "As the question states. My two years of my stipend (income) came as a 1098-T. Pre-approval states 2 years of W-2 statements which I don’t have. Has anyone been able to be a pre-approved without a co-signer and with a 1098-T?\n\nPS: Preempting all the “how do you have enough for a 20% down payment?” comments. I don’t haha. I got really lucky; I’ve got quite a bit in savings because my my stipend is pretty good relative to the cost of living in my city plus I’m frugal as fuck. I’m looking to take advantage of some first-time buyer down payment grants/discounts hence why I can’t have a parent co-sign.",
        "created_utc": 1678234212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stanford REACH postbac",
        "author": "sunsetsss2",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lfyqg/stanford_reach_postbac/",
        "text": "[removed]",
        "created_utc": 1678233473,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Academic Homes website legit?",
        "author": "Local_Way_2459",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lelfv/is_academic_homes_website_legit/",
        "text": "This is the website to the page. https://www.academichomes.com/\n\nI am currently looking forward legit housing for living. I found this website but can't find any useful information to see if it is legitimate? \n\nWondering if anyone else has experience with this?",
        "created_utc": 1678230284,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much time did it take for you to hear back after admission interview? I appreciate everyone sharing their experience of waiting for a decision as I am still waiting for my result after a long time.🥹🥹🥹",
        "author": "Acrobatic-Luxus",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lel2u/how_much_time_did_it_take_for_you_to_hear_back/",
        "text": "",
        "created_utc": 1678230259,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having doubts about my age for PhD.",
        "author": "PrecociousMind",
        "url": "https://www.reddit.com/r/GradSchool/comments/11le557/having_doubts_about_my_age_for_phd/",
        "text": "I just finished my masters in cognitive neuroscience at age 37. I’ll be applying to PhD programs this fall and by the time I would start I’d be 39. I have a 4.0 in my thesis based masters, have worked at a top neuro research org for over 5 years and have a lot of writing, communicating, data analysis experience. My major concern is my age. Another concern is my undergraduate GPA is low. Reasons I want to do a PhD is I love research, managing people, the competition of it all, learning, and teaching college students. I’m aware of the competitive nature of obtaining a role in academia and am very cognizant of the risk I’m taking. I’m curious about the older PhD students experience. Thankfully, my husband is fully on board and is supportive. But obviously I’m no 21 or 31 year old. Any thoughts?",
        "created_utc": 1678229299,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the IRS actually come for any PhD students not reporting fellowships on tax returns?",
        "author": "tennis_fish",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lcwk5/does_the_irs_actually_come_for_any_phd_students/",
        "text": "Each year for the last three years, students in my department have received $14k that is automatically taxed plus an $8k fellowship that doesn't show up on the W2 form and therefore isn't automatically taxed before going into our bank accounts. Our university pays for all tuition and health insurance, so our annual income is effectively $24k, though the IRS in theory doesn't know about a third of that income. I know there are cases in which fellowships don't count as taxable income, but each of the 10-12 websites I've checked all suggest that for our specific situation, \n\nThat being said, I found out early on that most of the students in my department don't report the fellowship as taxable income, claiming that \"fellowships aren't taxed,\" and that since the IRS didn't give them any grief in the last two years for their tax return, it won't this year.\n\nIs it true, though, that the IRS really won't come for them? I'm just worried that they're going to be unexpectedly forced to cough up a few thousand dollars one of these days, which would put some of them in immediately financial distress.",
        "created_utc": 1678226593,
        "upvote_ratio": 1.0
    },
    {
        "title": "Writing a Conclusion in a Master's Dissertation [Humanities]",
        "author": "ilovebrownbutter",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lcakk/writing_a_conclusion_in_a_masters_dissertation/",
        "text": "Hi everyone,\n\nI'm currently trying to write a conclusion to my thesis. I had 3 case studies, and my \"guiding question\" was a little vague - \"to understand how is the state of... [these things of] museums\" I'd say what it was but it would give me away. So it wasn't very specific, but it was a goal. The teacher didn't complain about it. \n\nI have conclusions, but none are groundbreaking. I only have 3 case studies which I mean, it's a master's. I couldn't gather more and compare all of the case studies. It was a qualitative study rather than quantitative. But the goal was to sort of represent how things are with all museums in the whole country - but of course I stated that 3 case studies wouldn't show how they are nationally but they would give us a peek into it, for further studies to go deeper. \n\nI don't know if I'm making sense.\n\nAnyway, I have some findings, I do. But I feel like they are kind of disjointed little things. Kind of like: they could be better, but I guess they could also be worse; one of the case studies was worse than the others but the people I interviewed didn't seem to care (but the people I interviewed unofficially for pilot tests DID care, which is conflicting since I'm not putting it there because it's not official ugh).\n\nI don't have a magical statement that wraps things up assertively, nicely and in a useful way. I have disjointed sentences but I don't really know how to find them memorably in a structure like this one I'm seeing here https://www.scribbr.com/dissertation/write-conclusion/ I feel like it's a little like saying things I already said in the discussion. I want it to be memorable (i mean, not nobel-prize worthy - but memorable in that it shows clear takeaways and well, is memorable for whoever reads it - like they can read it and understand what I'm saying).\n\nSo I guess I'm really confused about what to do and I'd love some help here. Plus it's extra hard to make things \"memorable\" and have just that touch of narrative/emotion needed to make it memorable if you're following a guide. Not that I'd be able to do it without the guide.\n\nAny ideas? Thank you very much",
        "created_utc": 1678225259,
        "upvote_ratio": 1.0
    },
    {
        "title": "Too old to be going back to school?",
        "author": "circleinasquare_",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lc8qb/too_old_to_be_going_back_to_school/",
        "text": "Sooooo it’s been 20+ years since I was in college. I graduated summa cum laude with a degree that I didn’t use because I chose to have kids and be a sahm. \n\nLoved it, but kids were now older and I had a ton of time. No longer leading scouts and volunteering at schools, I decided to help women get unstuck and got some coaching certifications (not the scammy ones but ones they use in the corporate world). Also, took various classes on coursera for fun and found I enjoyed psychology more than machine learning. \n\nOn a whim, I applied to one accredited in-person school for clinical mental health counseling and (unexpectedly?) just got word that I got in! It is a 20 mins commute. \n\nNow…. I’m in a little bit of panic mode. As someone in their early 40s, my memory is not what it used to be. Do I really want to put myself through the academic rigor of “school” and worry about papers and tests? I would love to be a counselor (or in a helping profession) I’ve been told I have great aptitude for it…. But mannnn… what am I really (paying tons) to get into?? Is this just an accelerated path to turn all my hair white? \n\nWould love some advice for both people who went back to school later in life and those who got their LPC to share their stories :)\n\nThanks in advance for reading and your insight!",
        "created_utc": 1678225150,
        "upvote_ratio": 1.0
    },
    {
        "title": "Former mentor preventing me from getting a job by giving me a bad reference - details within",
        "author": "TastyTabithaToes",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lbvle/former_mentor_preventing_me_from_getting_a_job_by/",
        "text": "[removed]",
        "created_utc": 1678224326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Former mentor preventing me from getting employment by giving me a poor reference",
        "author": "TastyTabithaToes",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lbhox/former_mentor_preventing_me_from_getting/",
        "text": "[removed]",
        "created_utc": 1678223468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Graduate School Dilemma",
        "author": "nsternig",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lbg44/graduate_school_dilemma/",
        "text": "I am someone who is aspiring to retire early and can give context about my situation that I need advice with. I just turned 21 and live in the midwest.\n\nThis year I will be graduating from a top 10 public university (US) with a degree in finance. This is only my third year in school so I will be graduating early. In high school, I saved up as much money as I could and was able to pay for college and living expenses all on my own (started a business and made about $150,000 for college). I have outlined my current finances below:\n\n**Brokerage Account:** $42,000 (all held in $VT)  \n**Roth IRA:** $17,000 (all held in $VT)  \n**Cash:** $4,000  \n**Student Loans:** ($19,500)\n\n**Net Worth:** **$43,500**\n\nI have chosen to not pay off these loans yet because of the low rate **(3.75%)** and the fact that interest payments are currently paused until the freeze is lifted. I have accepted a job for the Fall of 2024 (this is far out but I did this in order to have the choice to attend graduate school) at a bulge bracket bank that pays **$110,000** a year. I was recently accepted into a master's program at Georgetown (1-year program) in technology management and have a great interest in working in fintech after a couple of years in banking. No matter what happens next year, I have signed a lease and will not be changing where I live during this master's program or \"gap year.\" Considering my two options, which would be the best choice for my financial future?\n\n**Option 1:** Attend grad school for **$55,000** and make about **$20,000** working part-time for the year. This has an opportunity cost of **$100,000** compared to option 2. When I consider this factor I think about how powerful a **$100,000** investment in index funds would be at the age of 21. I could complete this without taking out any more loans but wouldn't be able to pay off my undergraduate loans after graduation.\n\n**Option 2:** Do not attend grad school and make about **$65,000** working full-time for the year.\n\nBoth options will result in the same starting salary for me for the bank I will be working for but the master's program may result in higher-salary opportunities down the road. Please let me know if you have any advice that might help me decide what option is best for me, I appreciate your help!",
        "created_utc": 1678223374,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choosing a lab, priorities? Fear of severe burnout?",
        "author": "cupidbutch",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lb8pn/choosing_a_lab_priorities_fear_of_severe_burnout/",
        "text": "I'm a first-year PhD student in a plant biology program. I've finished up rotations last week and it's time for me to choose, but I'm stuck between two labs. The first lab looks like objectively the better option; guaranteed funding for 2-3 years, being one of two students for a great PI who I'm comfortable with (so lots of 1:1 time that I'll definitely benefit from), and a good track record for publishing in high impact journals. But I'm terrified of crashing and burning. I've heard it called \"a lab on steroids\" and whenever I ask how anyone is their first answer is always busy or tired. (Note: these are postdocs/students under a different PI, my potential PI's husband. Also a nice guy, but I've heard he *really* encourages overtime. But the lab space is shared so when I was in that lab I saw them everyday.) Because they're all so busy, it's hard for me to approach them sometimes. Asking a quick \"hey, do you know where this is\" isn't hard but as soon as I need to ask them to show me how to do something I'm terrified. \n\nThe tie-in to the title is that I'm worried about the lab's effect on my mental health which is, honestly, pretty bad a lot of the time. I've had to be hospitalized twice in the past 5 years, and one of my biggest triggers is prolonged periods of having no one to talk to. So even if I love the research, I'm worried a combination of the loneliness and likely overworking will wear on me too hard and I'll spiral out of control. \n\nThe second lab (third rotation) is an environment that I think I would be more relaxed in. I was much more likely to ask them for help, or even just complain about when my experiments weren't working. There's no immediate funding in this lab, so I would have to be a TA for at least a year. The PI is busier so I would have a weekly meeting with her instead of a more \"grab me if you need something\" situation, but she's also great. And she likes to emphasize that we need the work/life balance, which I really appreciate. I know that burnout in grad school is essentially unavoidable, but I feel like it won't hit me as soon or as hard if I joined this lab. The research is interesting as well, although working with maize isn't what I imagined myself doing. \n\nThe PIs for both labs have said I'm welcome to join if I decide to, and we've laid out potential projects for me to work on. Overall, I think I like the first lab as a strong career foundation, but the second lab seems like a \"safe\" option considering my mental health. Should I risk it?",
        "created_utc": 1678222926,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reaching Out to Advisors (PhD Programs)",
        "author": "caitdiditagain",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lawj1/reaching_out_to_advisors_phd_programs/",
        "text": "When would be a good time to reach out to potential advisors for Spring Admissions 2024? Applications for the schools I’m applying to are due October 15 and Nov. 1. I’m thinking if I reach out right now, that’d be way too early and if I reach out during the summer I definitely wouldn’t get a response.",
        "created_utc": 1678222210,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to ask for advice on thesis from prof?",
        "author": "allym0316",
        "url": "https://www.reddit.com/r/GradSchool/comments/11ladyc/how_to_ask_for_advice_on_thesis_from_prof/",
        "text": "So, I am in the second semester of my masters program. I will be beginning my thesis this fall, hopefully graduating in May 2024.\n\nI am a GRA for a professor in my dept and we are currently working on some substance use projects at her lab that I work for. For my thesis, I would like to do something very similar to the stuff we have worked on so far. I have a soft idea in mind, but I don't know if it is something that would be practical or not. I haven't formally asked her to chair my thesis yet, though I know that she did chair the theses of her most recent master's graduates who worked here prior to me. So, I have a few questions, because I am still learning grad school etiquette.\n\n1) Is it too soon to be asking for thesis advice/asking her to chair my thesis? Enrollment will soon open up for the Fall term, and I know theres paperwork and stuff to fill out for the restricted thesis hours. I don't want to ask her prematurely and look silly, but I also don't want to have to push off my graduation simply because I failed to properly prepare.\n\n2) Should I formally ask her to chair my thesis before introducing my idea? Or the other way around? \n\n3) How developed should my thesis idea be before introducing it? As I mentioned, I have a soft idea in mind, but I haven't written a proposal or anything.",
        "created_utc": 1678221071,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you start a thesis?",
        "author": "woahwoahhw",
        "url": "https://www.reddit.com/r/GradSchool/comments/11lac4p/how_do_you_start_a_thesis/",
        "text": "Does a thesis start from the problem formulation or do students jump into the literature review directly. Or is there a specific phase where students solely focus on searching for relevant literature? If yes, what is this phase called?",
        "created_utc": 1678220960,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your favorite website for generating apa references and citations. What is your favorite app for organizing lit reviews?",
        "author": "Affectionate-Risk-13",
        "url": "https://www.reddit.com/r/GradSchool/comments/11l9wtu/what_is_your_favorite_website_for_generating_apa/",
        "text": "",
        "created_utc": 1678219979,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interested in grad school but finances + health insurance concerns are holding me back",
        "author": "SoftwareOk5910",
        "url": "https://www.reddit.com/r/GradSchool/comments/11l9s1p/interested_in_grad_school_but_finances_health/",
        "text": "In the US. I'm doing undergrad CS research and am really enjoying it and think I'd really enjoy pursuing a higher degree in CS and continuing research.\n\nHowever, I'm 24 and have a number of chronic health conditions. I'll get kicked off my parents' health insurance at 26 . I really need health coverage in order to keep seeing my specialists and, you know, not die.\n\nAnd on top of that I've got about $30,000 in student loans and I'm not too keen on that growing much larger. \n\nAre there options out there for me to do grad school + have okay health insurance? Should I aim to get a job first and then try to fit in grad school part time?  What are your thoughts?",
        "created_utc": 1678219689,
        "upvote_ratio": 1.0
    },
    {
        "title": "The math is NOT adding up.",
        "author": "sinclairsays",
        "url": "https://www.reddit.com/r/GradSchool/comments/11l8njj/the_math_is_not_adding_up/",
        "text": "tldr: Master's tuition rates may sink me into a 5+ year financial hole. Is there more pain than gain? \n\nAs I prepare to  transition to graduate school directly from undergrad, the only problem I'm facing is the issue of funding. My top programs are asking for tuition on par with entry-level salary in my field. I'm wondering if I should've attended a cheaper undergrad uni, but the opportunities I had access to here is part the reason I was admitted this round.\n\nLet's say I can handle (take out loans) the MS tuition for 2 years. Then is a PhD next? A solid 3-7 years of (maybe) being funded with a living stipend (perhaps) that would leave me barely breaking even with living expenses and definitely incapable of paying back student loans. I guess the best path would've been going straight from BS to PhD, but COVID-19 in the middle of my undergraduate years cancelled a couple of research opportunities that I would've taken advantage of otherwise; thus, I wouldn't be as strong of a candidate for PhD programs. \n\nI will be the first in my family to attend graduate school, if we can find a way to afford it. I have no idea when the finances are supposed to make sense. Is industry before grad school a better deal to avoid soul-crushing debt? Has anyone regretted grad school, especially a Master's, for financial reasons? How do I know if I making the worst money mistake of my life!?",
        "created_utc": 1678217228,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theatre department at university of redlands worth it?",
        "author": "batdude_2",
        "url": "https://www.reddit.com/r/GradSchool/comments/11l80ub/theatre_department_at_university_of_redlands/",
        "text": "I just wanted to ask and see if someone could tell me if the theatre/drama department is decent or even worth it?",
        "created_utc": 1678215806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help finding an aggregative website or spreadsheet listing grant programs for social science research",
        "author": "BoredToDeath22",
        "url": "https://www.reddit.com/r/GradSchool/comments/11l7pc5/help_finding_an_aggregative_website_or/",
        "text": "Hey grad school peeps! I noticed there haven't been any posts in the past four years about good websites or sources that list grant programs for early-career social science researchers. I've done some cursory searching, but most of the websites I've found are either dead ends or for undergrads/advanced career researchers. Any help or pointers would be greatly appreciated!",
        "created_utc": 1678215101,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did anyone make a LinkedIn post for their grad school acceptance?",
        "author": "Lostaaandfound",
        "url": "https://www.reddit.com/r/GradSchool/comments/11l7o22/did_anyone_make_a_linkedin_post_for_their_grad/",
        "text": "If so, did you wait until you started the program or until after accepting it? \n\nI want announce the program I got into but haven’t seen those posts before and wasn’t sure on the best way to do that",
        "created_utc": 1678215021,
        "upvote_ratio": 1.0
    },
    {
        "title": "Transforming Dissertation Proposal into Final Dissertation?",
        "author": "KilometersofNothing",
        "url": "https://www.reddit.com/r/GradSchool/comments/11l6z83/transforming_dissertation_proposal_into_final/",
        "text": "[removed]",
        "created_utc": 1678213486,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alternative graduate school application timeline.",
        "author": "gemomics",
        "url": "https://www.reddit.com/r/GradSchool/comments/11l6xq3/alternative_graduate_school_application_timeline/",
        "text": "[removed]",
        "created_utc": 1678213393,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I pursue a Master degree with my situation?",
        "author": "imalamebutt",
        "url": "https://www.reddit.com/r/GradSchool/comments/11l67yt/should_i_pursue_a_master_degree_with_my_situation/",
        "text": "Hi everyone, \n\nI just found this sub while doing my research and thought I could get some advice from ya and see what would you do if you were me kind of situation. My apologies if this post is a bit of a mess or have some un relevant information so skip it if you want before reading further.\n\nI have my undergrad in Applied Mathematics (May 2018). I wanted to to go for Data Science/ Statistics kind of job after graduation but it was a bit hard since a lot of jobs I seen required or at least prefer a Master degree. While job searching, I got an offer for a Software Developer position? Unexpected, not sure how since my programming experience was low, all I could do at the time was “Hello World”. Not something I thought I would be doing but also I was tired of being a broke college student and since the job offer wasn’t bad, I took it without further thinking. 2 companies and 4 years later, I don’t think I am enjoying it that much. My mind has been wondering about the what if I was going to go for my original career plan, will I enjoy it more since that what I wanted? Since I lived my life as a fullest undergrad student like got involved in lots of different organizations, volunteers, frat parties, going to conferences… (mostly free or very cheap activities), also working part jobs to support myself. With the combinations of grants and part time job, I graduated debt free (I lived at home rent free and my parents gave me their old car, no other supports, I paid my own bills). The problem is… you get it, my GPA suffered a little (I never failed any classes but my average is C so it is below 3.00). I want to go back to school part time to get my master degree in Statistic while keeping my full time job. What do you think about my chances of getting accepted with below 3.00 GPA (planning to study hard for the GRE)? Anyone who may have a similar experience, would you do a M.S if you were me? Or should I just forget about it and go look for entry level Data Science/ Statistic job now?\n\nThanks everyone for reading and commenting.",
        "created_utc": 1678211823,
        "upvote_ratio": 1.0
    },
    {
        "title": "student help discord",
        "author": "Barry324567",
        "url": "https://www.reddit.com/r/GradSchool/comments/11l5402/student_help_discord/",
        "text": "I do help students handle their homework, assignments and any other coursework that they are unable to tackle. Join my server for assistance. \nhttps://discord.gg/EWkt8decGd",
        "created_utc": 1678209277,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for leaving an (unsuccessful) PhD and getting a job",
        "author": "vandelay_inds",
        "url": "https://www.reddit.com/r/GradSchool/comments/11l4xwq/advice_for_leaving_an_unsuccessful_phd_and/",
        "text": "I am just finishing up my third year and have a single publication from my first year. I recently submitted a paper which got rejected, and is, to be frank, not really worth resubmitting anywhere. \n\nYesterday I mentioned to my advisor that I was feeling like moving forward with my PhD wasn’t a good idea. Basically, he decided a couple of months ago that anyone who doesn’t have at least one publication a year must TA the following year. At the core, we really just don’t have any interests in common, and this has made getting on a fruitful research trajectory difficult. I also have felt in general like my advisor generally has had a lot of apathy toward my PhD and hasn’t provided much guidance in helping me learn to do good research. This, along with things that I could’ve done better as well. \n\nI don’t see a pathway to publishing before I leave for my internship in 2.5 months, and we both agreed that spending time TAing without having clear goals set for my research will just end with me wasting more time. \n\nI am going to look for another lab to join, because I still really want to finish, but I feel like the odds of getting into a new lab, given that I have been pretty unsuccessful in this one, are slim. As I said, I still would ideally finish my degree because I love my field, but I have concluded that staying in this lab is not a good way forward in general. \n\nOther than that, it is looking like there’s a high chance I will need to find a job. I have a MS in computer science, and I had a fairly successful internship last summer (they offered for me to return this summer, which I’m doing, but they don’t have any open full time roles due to the economic downturn). \n\nMy obvious dilemma is that I have a huge hole in my resume, and not much to show for my time as a PhD student, since everything I’ve done with my advisor has been kind of unsuccessful in one way or another. I also feel like I’m pretty knowledgeable about my field (multi-agent reinforcement learning), but that I don’t have a lot of concrete achievements to back it up yet. Additionally, I feel like this is a niche field that doesn’t offer much in industry besides pure research jobs. On top of all this, I feel like I’ve forgotten a lot of the generalist knowledge I had from my MS. In summary, I feel like I’m very specialized in a particular field but don’t have the credentials of an expert. \n\nI’m really just looking for advice on the steps I should take to start looking for a job. My target would be at least by September, since I have my internship coming up and enough savings to last until then.",
        "created_utc": 1678208889,
        "upvote_ratio": 1.0
    },
    {
        "title": "Georgetown GHD vs GW MPP",
        "author": "Aggravating-Job1219",
        "url": "https://www.reddit.com/r/GradSchool/comments/11l4tjc/georgetown_ghd_vs_gw_mpp/",
        "text": "",
        "created_utc": 1678208621,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grad students!!",
        "author": "NoInfluence1494",
        "url": "https://www.reddit.com/r/GradSchool/comments/11l4107/grad_students/",
        "text": "[removed]",
        "created_utc": 1678206848,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to include research in resume?",
        "author": "Rude-Illustrator-884",
        "url": "https://www.reddit.com/r/GradSchool/comments/11l3nv8/how_to_include_research_in_resume/",
        "text": "Hey everyone! I recently posted on my research going nowhere. My advisor isn’t being helpful at all and I have to pretty much have to chase after him just for him to tell me “I’ll think about it” when I try to come up with ways to move forward. And he hasn’t been writing my letter of progress that my fellowship is requiring and now I’m stressing out that they might cancel my fellowship. (Sorry needed to rant lol). \n\nSo I was job searching last night and came across a job that feels like it was made for me. Like even though my research isn’t going anywhere, I think I’ve acquired the exact skills they’re asking for. I don’t think it’d hurt to apply lol. My question is, how do you put your research skills in your resume? For example, the job is asking for people with experience with SAR and Lidar data which is exactly what my research is. Do I put my research as work experience and state specifically I worked with Lidar and SAR data? Any tips for people who’ve ended up working in industry would be much appreciated! \n\nAlso, do you think a job that wants that experience would care that I don’t have any papers? I was so close to having something to publish when we determined that my project wasn’t working out (or rather, my results can’t be validated). It’s not an academic job so would they care?",
        "created_utc": 1678206024,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does a roundtable look like?",
        "author": "Educational_Can_737",
        "url": "https://www.reddit.com/r/GradSchool/comments/11l19yc/how_does_a_roundtable_look_like/",
        "text": "[removed]",
        "created_utc": 1678200475,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kennedy School to merge MPA and MPP?",
        "author": "Financial-Pride1483",
        "url": "https://www.reddit.com/r/GradSchool/comments/11l08kp/kennedy_school_to_merge_mpa_and_mpp/",
        "text": "[removed]",
        "created_utc": 1678197922,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kennedy School to merge MPA and MPP?",
        "author": "Financial-Pride1483",
        "url": "/r/PublicPolicy/comments/11kz881/kennedy_school_to_merge_mpa_and_mpp/",
        "text": "",
        "created_utc": 1678197890,
        "upvote_ratio": 1.0
    },
    {
        "title": "When doing interpretative phenomenology analysis, what does it means when the data analysis process is described as an iterative process?",
        "author": "whimsicalhope",
        "url": "https://www.reddit.com/r/GradSchool/comments/11kzlfp/when_doing_interpretative_phenomenology_analysis/",
        "text": "Hi! I've been trying to figure out what it means when in this type of analysis the data analysis is described as an iterative process.\n\n*The analysis is fluid, iterative, and multi-directional, yet to illustrate how it unfolds, I placed the processes into distinct stages consistent with my data analysis.*\n\n*Once each transcript had been analyzed, I produced a final table of superordinate themes and their respective sub-themes. During this iterative process, I went back to the table of themes for each participant, reviewed them, and, if necessary, amended them and returned to the original transcripts.*\n\nCan someone help me understand this scientific term?",
        "created_utc": 1678196334,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do I do if I have passion but no skill?",
        "author": "06cactuskangaroo",
        "url": "https://www.reddit.com/r/GradSchool/comments/11kysig/what_do_i_do_if_i_have_passion_but_no_skill/",
        "text": "I am a third year undergraduate psychology major and human biology minor. My ultimate life goal is to get a PhD in neuroscience/neurobiology and do research and be a lecturer. I’ve always loved science, and my biggest passion in life is simply learning cool things and sharing that information with others. I am a first generation college student with an estranged family, and honestly my only support system is my partner. I’m not particularly close with any other classmates, professors, or advisors. I have ADHD and depression and while I am medicated for both, they prevent me from being as successful as I would like to be. All I want is to research and learn and teach but I don’t have spectacular grades, I’m awful at chemistry, and I don’t have any research experience in my junior year of undergrad. I feel like it’s too late for me to be successful. Any advice?",
        "created_utc": 1678194155,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pending Admissions Decision",
        "author": "Flat_Grocery_5860",
        "url": "https://www.reddit.com/r/GradSchool/comments/11ky9b8/pending_admissions_decision/",
        "text": "Hi guys I know this is a very vague post but has anyone heard back from Columbia Engineering School for Masters in Engineering and Management yet? Or for any masters programs in the Engineering School for that matter, just want to gauge how long I should keep my slim hopes up since it’s been a while and I haven’t heard anything.",
        "created_utc": 1678192703,
        "upvote_ratio": 1.0
    },
    {
        "title": "Admission decision",
        "author": "Tinklemypickle",
        "url": "/r/gradadmissions/comments/11k0j0l/admission_decision/",
        "text": "",
        "created_utc": 1678189660,
        "upvote_ratio": 1.0
    },
    {
        "title": "People who took gap years/went into industry before you started grad school, how did you get your reference letters?",
        "author": "DayDream11111",
        "url": "https://www.reddit.com/r/GradSchool/comments/11ks7hy/people_who_took_gap_yearswent_into_industry/",
        "text": "I plan to work before I go grad school (assume I still want to), but reference letter is a big issue I'm not sure what to do.",
        "created_utc": 1678172690,
        "upvote_ratio": 1.0
    },
    {
        "title": "MPPA",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1678172213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a lot of public speaking in MPPA program or is more group work? Specifically Carleton.",
        "author": "Eileenthequeen",
        "url": "https://www.reddit.com/r/GradSchool/comments/11ks0w7/is_there_a_lot_of_public_speaking_in_mppa_program/",
        "text": "[removed]",
        "created_utc": 1678172102,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve gained 20 pounds during my first 2 semesters and I feel super self-conscious",
        "author": "cute-asduck",
        "url": "https://www.reddit.com/r/GradSchool/comments/11krvj9/ive_gained_20_pounds_during_my_first_2_semesters/",
        "text": "Just a late night rant for something that has been bothering me. I started off my grad school experience by being one of the 2 fat people in the entire class of 35. That didn’t feel good to begin with but I realized this past weekend that I’ve since gained 20 pounds since September. I think it’s the combination of being less active, stress, eating more carbs/skipping meals, and a poor sleep schedule. I’m really feeling the pressure from 6 classes, side projects/volunteering, work on weekends, being a grad assistant, and juggling a serious relationship and family. I used to walk every day for 45-60 minutes (for 5+ years, having a family dog helped) but that’s no longer the case and graduating undergrad in 2020 and working full time was very stressful too. I also moved out on my own for the first time in august 2022. My body’s been through a lot but I feel like I can’t stop. I’ve been seriously considering an exercise bike workstation like this [one](https://www.amazon.com/dp/B0762FFNQ4/ref=cm_sw_r_cp_api_glt_i_DHC00SBSVCQWRQBHZWC1) that I can incorporate into my routine but $500 is a big investment. I may browse for a used one. \n\nI know the easiest solution is to just do less, but my program is super competitive and everybody here is an overachiever. Luckily I graduate May 2024 but I feel like a fricken loser.",
        "created_utc": 1678171615,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stress and Coping Strategies Survey",
        "author": "Competitive-Gene-37",
        "url": "https://www.reddit.com/r/GradSchool/comments/11kq6iu/stress_and_coping_strategies_survey/",
        "text": "[removed]",
        "created_utc": 1678166422,
        "upvote_ratio": 1.0
    },
    {
        "title": "rant/seeking advice For those in programs where classes frequently are on very serious and sad topics",
        "author": "laurdc143",
        "url": "https://www.reddit.com/r/GradSchool/comments/11kph2z/rantseeking_advice_for_those_in_programs_where/",
        "text": "[removed]",
        "created_utc": 1678164445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feelings Regarding Assessments (quizzes, exams) and Overall Difficulty",
        "author": "SunThenMoon",
        "url": "https://www.reddit.com/r/GradSchool/comments/11kmwl2/feelings_regarding_assessments_quizzes_exams_and/",
        "text": "I'm currently in a stats master's at an R1 while working full-time. My GPA is satisfactory (\\~3.75, 2/3 through my program), but I constantly feel that I am underperforming in my assessments throughout my program. The only point I did well on my exams and quizzes was during the introductory courses in my program (\\~90% and over). From then on my median scores have been in the low 80s across quizzes and exams for all of my classes, with plenty of scores in the 70s (I even got in the 40s for a final exam for one of my courses).\n\n&amp;#x200B;\n\nI constantly study for my exams and for my classes, even when there is no assessment incoming. The feeling that I'm wrestling with is that it doesn't seem like there's a point to even applying too much effort to study. Exams and quizzes are always extremely broad in scope, with any topic covered during the respective course as a possible question. I'm not complaining about difficulty - I think, overall, these assessments are \"fair\" in the sense that they address topics that were delivered to us at some point. But I feel like I have no idea what \"success\" is from a studying standpoint - it feels like the expectation is to simply completely understand all of the material covered to date. My scores tend to fall within the median, but I can't help but wonder how anyone is getting top marks. What am I missing? My homework marks are always good, but that's because I have time to invest into my answers and research. I simply am at a loss for how to completely understand the topics at hand to the point where I can recite perfect responses for a given exam. I want to do better on my tests, but it doesn't feel like I have the understanding necessary to produce A-level work during a quiz or an exam. I'm willing to put in any hours necessary, it's just that I don't know how to do so in a way that yields the outcomes I'm looking for.\n\nDoes anyone else feel anything similar? Does anyone have any advice? Am I just missing the foundational knowledge to really succeed in my program? Any thoughts welcome.",
        "created_utc": 1678157412,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I communicate with my advisor that I've got a lot on my plate in a professional manner?",
        "author": "Ninjallammas",
        "url": "https://www.reddit.com/r/GradSchool/comments/11km8qm/how_do_i_communicate_with_my_advisor_that_ive_got/",
        "text": "More and more tasks are being added to my plate, but I'm still working on the ones I started a month ago. I'm dividing the workload as best I can, but haven't been wrapping anything up like I want. I can feel the dreaded, \"Have you finished this yet?\" email is coming soon. I want to be able to respond with something more appropriate than, \"I'm spread thinner than the copper on a new penny. I'm working on it. You'll get it when you get it.\" that conveys that the delay is not because of a lack of effort. Can anyone offer some guidance on how to draft an appropriate response?",
        "created_utc": 1678155752,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to easily write your personal statement",
        "author": "Agile_Penalty962",
        "url": "https://www.reddit.com/r/GradSchool/comments/11klaie/how_to_easily_write_your_personal_statement/",
        "text": "[removed]",
        "created_utc": 1678153383,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did you go into grad school?",
        "author": "Blackpsych01",
        "url": "https://www.reddit.com/r/GradSchool/comments/11kk6qo/when_did_you_go_into_grad_school/",
        "text": "[removed]",
        "created_utc": 1678150671,
        "upvote_ratio": 1.0
    },
    {
        "title": "LOR Dilemma",
        "author": "DramaticIsopod5127",
        "url": "https://www.reddit.com/r/GradSchool/comments/11kjnq2/lor_dilemma/",
        "text": "[removed]",
        "created_utc": 1678149385,
        "upvote_ratio": 1.0
    },
    {
        "title": "homework help server",
        "author": "BadgerRich5801",
        "url": "https://www.reddit.com/r/GradSchool/comments/11khwsu/homework_help_server/",
        "text": "[removed]",
        "created_utc": 1678145326,
        "upvote_ratio": 1.0
    },
    {
        "title": "it's incredible how much school envoirment can affect someone personality",
        "author": "Prize-Ticket-7349",
        "url": "https://www.reddit.com/r/GradSchool/comments/11kht7j/its_incredible_how_much_school_envoirment_can/",
        "text": "I am in highschool and i tried two school till today and I understand now how schoolenvoirment is such a major things that affects personality, \n\nIn the Scholl before I didn't have problems and now that I changed school I kinda get bullied daily; in the new one everything is different teachers are meaner and more prone to get mad if students don't get some concepts and more prone to make fun of mistakes of students, \"in a gentle way\" to everybody not just me, to give lowers scores on avarge and to ignore bad behaviour bulling, it's like they don't care, even janitor are mean lol\n\nAlso the class is different most of them are childish asshole that insults other just for the depseration to fit in (not realising that making fun of others is what kill friendships in class omegalol) it's literaly a viscous cycle but they are too dumb to get it everybody is different here, even during my internship I meet people that went to the new school and they are assholes while I meet other of the old one and they are fine \n\nHow can school envoirment affect them so much? and I don't understand how it works like where does this evlnvoitment comes from?\n\nBtw I am changing school next year because I tired of dealing with human garbage everyday, I'm no patiemt enought for dealing with random insult dealy",
        "created_utc": 1678145103,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just defended my Thesis.",
        "author": "mojitron420",
        "url": "https://www.reddit.com/r/GradSchool/comments/11kgz20/i_just_defended_my_thesis/",
        "text": "Never thought this day would come, but I finally presented my defense for my MS Thesis. All the work has paid off and I have a job ready after I graduate. I still have some comments to address but I passed and have some time to finish everything. It is a good feeling, hadn't felt like this in a while.\n\nHard work pays off, Keep going guys.",
        "created_utc": 1678143239,
        "upvote_ratio": 1.0
    },
    {
        "title": "How bad does withdrawing from a class during a masters look for a PhD application?",
        "author": "MathemaTurtle",
        "url": "https://www.reddit.com/r/GradSchool/comments/11kglsf/how_bad_does_withdrawing_from_a_class_during_a/",
        "text": "I bit off a lot more than I can chew this semester.\n\nI'm doing school part time, only taking 1 class right now, a graduate level math course. I'm working 50 hrs/week, between my full time job and my side gig, and I have a lot of important stuff going on in my personal life.\n\nUnfortunately, the class I'm taking is too hard for me. The prerequisite class was much too easy, and did not prepare me for the challenge in front of me. I'm sure that if I spent 30 hrs/week studying I could pass, but looking at my weekly planner, there's no way to fit it in without major personal sacrifice for the next 12 weeks.\n\nI'm considering applying for PhD programs later in life (probably 5+ years from now). How bad would withdrawing from my only course this semester look on a transcript for a PhD application? (I'm guessing one is not too bad, but two is probably disastrous?)\n\nThanks",
        "created_utc": 1678142409,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experience required for direct-Entry PhD",
        "author": "Longevity-Fanatic",
        "url": "https://www.reddit.com/r/GradSchool/comments/11kfvjv/experience_required_for_directentry_phd/",
        "text": "Hey all!\n\nI'm a Biochemistry undergrad student and I hope to enter a direct entry PhD program in either Biochemistry or Molecular Biology.\n\nIn my undergrad, I have two choices for 4th year;\n1. Honours Thesis which may include research \n2. An extensive independent research project\n\nI don't believe I can take both.\n\nI understand that research experience is arguably the most important aspect of a grad school application, but would I be making myself less competitive not doing a thesis?\n\nWhat do y'all think would be the better option? Thanks for your help!",
        "created_utc": 1678140764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please HELP or SUGGEST something.",
        "author": "SupernovaeNeutronBH",
        "url": "https://www.reddit.com/r/GradSchool/comments/11kf9ld/please_help_or_suggest_something/",
        "text": "\n\nI am in a difficult situation. I got this one offer from university A with a good stipend and then I got another offer from University B, which is exactly doing work in my interest area but their stipend is very very low compared to what the first university is offering. And the difference in stipend is huge among them.\n\nI am an international, so I don't even get any fellowships. I am a first gen. and I don't know if I could ask for more money or if there is any other way to increase the stipend that university B is offering.\n\nPlease help and suggest.\n\nI have applied for Ph.D. in Physical Sciences.",
        "created_utc": 1678139447,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I transfer grad school?",
        "author": "godfrickyou",
        "url": "https://www.reddit.com/r/GradSchool/comments/11kew8t/should_i_transfer_grad_school/",
        "text": "Hey, so I’m a first semester thesis MS student at my grad school, and I kind of hate it?\nI don’t hate the research, I just feel really isolated from the other students (I’m queer in a very rural area), and not super supported by my advisor.\nI’m a RA, and I wouldn’t be able to go here without that, but I can barely afford to live as I am. I’m just, really frustrated by the situation.\nI’m thinking about living in this city 1.5 hours away that would be a lot better for me, I think? Found cheaper rent and some really cool people. And I was just going to go to my current university, and have weird long commute.\nBut maybe I should just transfer? The only thing is I would need a RA position or something to go to this new university. And I’ve already started my thesis, so I don’t know what to do about that. And…I don’t know. It’s been a super stressful situation",
        "created_utc": 1678138665,
        "upvote_ratio": 1.0
    },
    {
        "title": "Possibility of being able to switch from the MS track to the PhD track?",
        "author": "Pastacantlogin",
        "url": "https://www.reddit.com/r/GradSchool/comments/11kdxq9/possibility_of_being_able_to_switch_from_the_ms/",
        "text": "Hi! Unsure if I used the right flair, didn't know what to put it under. My grad school plans have been wonky recently. I was originally planning to stay at my home University for my MS since I found an advisor I really like with a funded research project. I also got into the University of Michigan as an MS student (the place I wanted to end up going to for my PhD later). However, my original advisor is moving to Reno and while at my home university I did find an alternate advisor, there's NO funding whatsoever, not even a TAship. I figure it's not worth it to stay in a program with an advisor that wasn't my first choice and doesn't feel like is right for me anymore. So my two main options are going to UNR with the original advisor (she said she'd be happy to still take me on there and we are currently discussing the program/funding) or the University of Michigan. If I go to UNR with her, I'd probably talk with her about applying as a PhD since it's a long move and I believe the right step for me career-wise (I live in Texas so \\~27 hour move!) \n\n&amp;#x200B;\n\nHowever, the program I really want to end up in is the University of Michigan. I know I applied and accepted as an MS student, but lately, I've been reevaluating my career goals and of course finances. Is it possible, once accepted and attending, to be able to switch to the PhD track? I know this is contingent on the department and advisor, but I want to know if anyone has ever done anything similar. The department is having its visit day on the 31st and I'll be able to discuss with my advisor more there about her research group and everything too. I hope this makes sense since it's been super stressful for me lately and just wanted some possible insight! If relevant my research/program areas are physical geography, ecology, and global change.",
        "created_utc": 1678136633,
        "upvote_ratio": 1.0
    },
    {
        "title": "Setting Up a Meeting to Tell Advisor I'm Quitting",
        "author": "Distinct-Mix-5568",
        "url": "https://www.reddit.com/r/GradSchool/comments/11kdr58/setting_up_a_meeting_to_tell_advisor_im_quitting/",
        "text": "I am in an astrophysics PhD program and have decided I'm going to quit after getting my Master's this Fall. I spent many months thinking through the decision, and am very certain that this is what I want/need to do (among other things, recently got an autism diagnosis and it made me realize how \"done\" with academia I am). \n\nEven though I will not officially be leaving the program for another 8 months or so, I am planning to tell my advisor about my decision next week, because we will need to discuss funding plans, etc. We meet every few weeks one-on-one to discuss my research updates, but I don't necessarily want to blindside him with this news without any warning. As far as he knows, I'm happy in the program and doing just fine. I've adequately prepared for the actual in-person conversation and what I'm going to say, but am struggling to decide how to preface the meeting.\n\nI was planning to email him something along the lines of \"Please let me know if you will have time for an individual meeting early next week. I might not have too many research updates, but would like to discuss my Comps timeline and post-Comps plans.\" (for context, Comps = Comprehensive exam/Master's defense)\n\nIs this enough \"warning\"? Should I say that \"I would like to discuss some more personal matters\" or something? If you can't tell, I have social anxiety in addition to the autism, lol. Any advice is welcomed.",
        "created_utc": 1678136265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone here doing a PhD in a non- STEM field? What is a typical day like for you?",
        "author": "mental_dissonance",
        "url": "https://www.reddit.com/r/GradSchool/comments/11kde5d/anyone_here_doing_a_phd_in_a_non_stem_field_what/",
        "text": "",
        "created_utc": 1678135508,
        "upvote_ratio": 1.0
    },
    {
        "title": "Admitted Masters Student: choosing between expensive top program vs. cheaper local program",
        "author": "itrainsontheroof",
        "url": "https://www.reddit.com/r/GradSchool/comments/11kdbfo/admitted_masters_student_choosing_between/",
        "text": "[removed]",
        "created_utc": 1678135351,
        "upvote_ratio": 1.0
    },
    {
        "title": "To unionize or not to unionize",
        "author": "DiamondEither4762",
        "url": "https://www.reddit.com/r/GradSchool/comments/11kd083/to_unionize_or_not_to_unionize/",
        "text": "My school is going to have an election to decide if PhD students will unionize or not. I know so little about this, is anyone here a PhD student that is unionized? Would love to hear any pros/cons \n\nThanks!",
        "created_utc": 1678134697,
        "upvote_ratio": 1.0
    }
]