[
    {
        "title": "How to buy UWO diploma and transcript?",
        "author": "miller18345",
        "url": "https://www.reddit.com/r/GradSchool/comments/zah539/how_to_buy_uwo_diploma_and_transcript/",
        "text": "[removed]",
        "created_utc": 1669973542,
        "upvote_ratio": 1.0
    },
    {
        "title": "University of Washington hybrid MBA help",
        "author": "e_zim2",
        "url": "https://www.reddit.com/r/GradSchool/comments/zagob2/university_of_washington_hybrid_mba_help/",
        "text": "\nHey all! Also posted on r/MBA\n\nReally considering going to the Foster school of business for my MBA, but the options are a little confusing. Also would be a move across country for me so that’s a bit jarring lol. \n\nWhat’s confusing me is the hybrid MBA option. Will I still be able to work full time or would it be better to work part time while completing my degree? “Better” as in what are class schedules like? Would I be able to complete lessons on my time and not be confined to a “M W F 9-9:50” type of scheduling? I know that I will have to be in person 3-5 days out of the month. However, could I select those days to be on the weekends? Or are there evening options?\n\nCompleting the degree part time isn’t an option for me since I wouldn’t qualify for my grants. However, currently living on the west coast now in the most expensive county of my state still doesn’t compare to the cost of rent in Seattle. I won’t have the option to not work. Luckily, my current place of work does have the option of a hybrid working remote  schedule. They have given the option of working fully remote to others who have moved out of state. If they don’t grant me that option, I’ll look somewhere in Seattle. My issue is if class schedules are confined to specific days and times and are mainly during the day then I’m not too certain on what to do work wise. \n\nIf anyone has been in my situation, has experienced the hybrid MBA, advice where to look for rentals, or just has genuine advice all would be appreciated!!",
        "created_utc": 1669971924,
        "upvote_ratio": 1.0
    },
    {
        "title": "First semester and I know I didn’t do my best work",
        "author": "Clipseexo",
        "url": "https://www.reddit.com/r/GradSchool/comments/zacflp/first_semester_and_i_know_i_didnt_do_my_best_work/",
        "text": "Quite a transition and I know I didn’t do my best work throughout this semester. First year first semester. I feel kind of disappointed in myself as a student. This is the first time I’ve really questioned myself academically especially as I just turned an assignment I’m not proud of.  I’m not at the point where I feel like I don’t belong in a master’s program I just felt attacked from all sides academically and I just didn’t feel ready my first semester and I’m just really down. Any advice.",
        "created_utc": 1669958102,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to not get exhausted at the end of the semester?",
        "author": "LightRailGun",
        "url": "https://www.reddit.com/r/GradSchool/comments/zabh17/how_to_not_get_exhausted_at_the_end_of_the/",
        "text": "[removed]",
        "created_utc": 1669955615,
        "upvote_ratio": 1.0
    },
    {
        "title": "Applying to PhD withoud masters diploma",
        "author": "almayandelon",
        "url": "https://www.reddit.com/r/GradSchool/comments/zaafmh/applying_to_phd_withoud_masters_diploma/",
        "text": "Hello, everyone. I have one concern about applications. Currently, I study MSc in ChemEng in Hungary, and it is expected that I will graduate in June of 2023. And I apply for graduate programs in the US for fall 2023 with my transcripts from bachelor and master studies. If I get acceptance letter from US universities, but not graduating from my current university with MSc degree, what will happen? Can US universities cancel my admission for that?",
        "created_utc": 1669952932,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I tell my advisor that I’d like some time off to prioritize my mental health?",
        "author": "Royal_Sun3162",
        "url": "https://www.reddit.com/r/GradSchool/comments/zaa3ht/should_i_tell_my_advisor_that_id_like_some_time/",
        "text": "Before I explain my dilemma more, I want to make clear a few things.\n\nI’m not clinically depressed and I’m fortunate enough to have a family + partner that love me very much, and a couple of long-time friends that I reach out to when I need to vent / be reassured. However, we live mostly apart as I study in the US but am originally from Europe. I also go to therapy and I feel like I’m improving in taking care of myself. \n\nAlso, my advisor is a nice person. She’s not particularly warm, but she’s also very professional and hands-off. \n\nThis semester has been hard on me as I’m struggling to come up with new research ideas, while also working on ongoing projects (that for a number of reason matter less than the “big idea” I still don’t have). Lots of ups and downs, and I’ve found myself doubting everything, from my ability to make progress on new grounds, to my very life choices of pursuing an academic career in my particular field and in the US. \n\nDilemma: \n\nI’ve decided to go home early, one week before the semester formally ends and to come back here at the very last moment. I’m rather desperately missing my family and partner, and am sick of the routine and social scene where I’m currently. While I hope to get some work done while I’m away, I’d also like to take substantial time off that is actually “off”, which will inevitably limit how much I’ll get done over the next few weeks. After having accomplished almost nothing this month, it would mean adding roughly another month and a half of delay (once you factor in travels, dead time and unimportant but mandatory things I have to do).\n\nSo, should I explain to my advisor my reasons for leaving early and for not planning to make much progress on the coming weeks? Mentioning that I’m doing it to prioritize my mental health and because this semester has been harder on me than before? On the one hand I feel like I owe her an explanation, and I don’t want her to think I’m shirking for no reason (or that I’m unaware of the consequences). On the other hand I’m afraid that this would amount to “oversharing” and I also don’t want to come across as whiny or seeking her pity. I also fear that by saying this I could bias her to discount my prospects as she might think I don’t have the will/stamina to complete this PhD successfully.",
        "created_utc": 1669952049,
        "upvote_ratio": 1.0
    },
    {
        "title": "Panic attack over zoom presentation",
        "author": "Fit_Scholar6545",
        "url": "https://www.reddit.com/r/GradSchool/comments/za8x9k/panic_attack_over_zoom_presentation/",
        "text": "[removed]",
        "created_utc": 1669949194,
        "upvote_ratio": 1.0
    },
    {
        "title": "For the humanities: What do grades \"look like\" in your department?",
        "author": "BooklessLibrarian",
        "url": "https://www.reddit.com/r/GradSchool/comments/za8jlv/for_the_humanities_what_do_grades_look_like_in/",
        "text": "[removed]",
        "created_utc": 1669948301,
        "upvote_ratio": 1.0
    },
    {
        "title": "How are folks feeling ?",
        "author": "Burkakk",
        "url": "https://www.reddit.com/r/GradSchool/comments/za6lq0/how_are_folks_feeling/",
        "text": "[removed]",
        "created_utc": 1669943735,
        "upvote_ratio": 1.0
    },
    {
        "title": "How should I fill out the financial data section of my master's application?",
        "author": "IngridNohlsson",
        "url": "https://www.reddit.com/r/GradSchool/comments/za5n7y/how_should_i_fill_out_the_financial_data_section/",
        "text": "**One of the schools I'm applying to asks for financial data in the application with this table to fill out:**\n\n&gt;*If you are not applying for aid, or if financial assistance cannot be offered by the University, describe how you would attempt to meet the financial costs of your graduate studies during your first academic year. You should include and list separately resources that you expect to be available to you from: personal funds (savings, trust funds, dividends); support from spouse's earnings; assistance from family or friends; grants from government agencies, foundations or employers; earnings from summer and part-time employment; and borrowing.*  \n&gt;  \n&gt;**Sources of funding for your first academic year:**  **SourceAmount**  \n&gt;  \n&gt;1   \\[ *source* \\]   $ \\[*amount*\\]  \n&gt;  \n&gt;2   \\[ *source* \\]   $ \\[*amount*\\]  \n&gt;  \n&gt;(etc)  \n&gt;  \n&gt;In the space below, give the amounts and sources of funds expected to be available to you for each subsequent year of study at the University of Chicago (i.e. beyond the first year).  \n&gt;  \n&gt;\\[ *text box to elaborate* \\]\n\n&amp;#x200B;\n\n**I'm not clear on whether I include every source of income available to me as a net sum or if I only add the estimated amount from each source I'd spend per year given the estimated COA.** \n\nFor example, do I say \n\n&gt;1. Personal Savings $XXXXXX &lt; the entire amount in my bank right now  \n&gt;  \n&gt;2. Spouse's Income $XXXXX &lt; whatever they make\n\nor\n\n&gt;1. Personal Savings $X,000  \n&gt;  \n&gt;2. Freelance Earnings $X,000  \n&gt;  \n&gt;3. Student Loans $X,000  \n&gt;  \n&gt;(where those three numbers add up to the estimated COA for the first year of the program?)\n\n&amp;#x200B;\n\n**Thanks for any insights you can give me! I'm at a loss!**\n\n\\----------\n\nNote: the application adds this disclaimer:\n\n&gt;*The information is important for internal University purposes and will be kept strictly confidential. Aid decisions are independent of the admission decision. Federal loan eligibility, if applicable, is determined through a separate application process.*",
        "created_utc": 1669941509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking participation in a study about Instagram profiling algorithm",
        "author": "makitron7",
        "url": "/r/NEU/comments/za5egz/seeking_participation_in_a_study_about_instagram/",
        "text": "",
        "created_utc": 1669941048,
        "upvote_ratio": 1.0
    },
    {
        "title": "I passed my advancements!",
        "author": "kittybabylarry",
        "url": "https://www.reddit.com/r/GradSchool/comments/za5d3c/i_passed_my_advancements/",
        "text": "Third time really is a charm. \n\nI can move on to the practicum part of my degree now :)",
        "created_utc": 1669940852,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fucked up on major scholarship competition",
        "author": "Sad_Shoe",
        "url": "https://www.reddit.com/r/GradSchool/comments/za52qx/fucked_up_on_major_scholarship_competition/",
        "text": "I spent ages trying to write a research proposal for the most prestigious scholarship at my school, and read over it a gazillion times until it was error-free. I also sent it to my supervisor, who advised me to change a small section, so I did. Unbeknownst to me at the time, I made an error on the section that I revised. After the revision I didn't think to send the proposal to my supervisor for another read-over, because I only changed a single sentence, and they seemed very stressed from teaching as well as helping multiple people with their scholarship application. So I just read it over and over by myself, and I couldn't find a single error. So I summitted my application. Roughly two hours after I submitted, I started getting concerned that I didn't list my dependent and independent variables properly, so I went back to look at my proposal. Lo and behold, I had reversed the two variables. The application had been submitted, so I couldn't do a damn thing about the mistake. I  heard from past applicants that typos don't necessarily make or break your application, but this wasn't a regular old typo, I literally fucked up on defining core research concepts. And now I feel goddamn awful for letting 10 grand of scholarship money slip through my hands. I also feel like I've left my supervisor down, as they spent a really long time writing a good recommendation. What a nightmare.",
        "created_utc": 1669940182,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it a faux pas to request to work with someone writing you a letter of recommendation?",
        "author": "sabre013_f86",
        "url": "https://www.reddit.com/r/GradSchool/comments/za40fv/is_it_a_faux_pas_to_request_to_work_with_someone/",
        "text": "[removed]",
        "created_utc": 1669937726,
        "upvote_ratio": 1.0
    },
    {
        "title": "loc advice",
        "author": "Burkakk",
        "url": "https://www.reddit.com/r/GradSchool/comments/za3z9g/loc_advice/",
        "text": "[removed]",
        "created_utc": 1669937650,
        "upvote_ratio": 1.0
    },
    {
        "title": "ı have encountered a professor who cares about professors I feel bad",
        "author": "Burkakk",
        "url": "https://www.reddit.com/r/GradSchool/comments/za3wt5/ı_have_encountered_a_professor_who_cares_about/",
        "text": "[removed]",
        "created_utc": 1669937490,
        "upvote_ratio": 1.0
    },
    {
        "title": "social/presentation anxiety as a grad student - discussion.",
        "author": "Silent-Radio-6864",
        "url": "https://www.reddit.com/r/GradSchool/comments/za396l/socialpresentation_anxiety_as_a_grad_student/",
        "text": "[removed]",
        "created_utc": 1669936049,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you deal with presentation anxiety as an academic?",
        "author": "Silent-Radio-6864",
        "url": "https://www.reddit.com/r/GradSchool/comments/za371v/how_do_you_deal_with_presentation_anxiety_as_an/",
        "text": "[removed]",
        "created_utc": 1669935923,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crippling social anxiety in class/presenting",
        "author": "Silent-Radio-6864",
        "url": "https://www.reddit.com/r/GradSchool/comments/za30n2/crippling_social_anxiety_in_classpresenting/",
        "text": "[removed]",
        "created_utc": 1669935556,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crippling social anxiety in grad school",
        "author": "Silent-Radio-6864",
        "url": "https://www.reddit.com/r/GradSchool/comments/za2dy0/crippling_social_anxiety_in_grad_school/",
        "text": "[removed]",
        "created_utc": 1669934198,
        "upvote_ratio": 1.0
    },
    {
        "title": "How viable is it to transfer universities(and perhaps asking for advice)?",
        "author": "Cleverwxlf",
        "url": "https://www.reddit.com/r/GradSchool/comments/za28o4/how_viable_is_it_to_transfer_universitiesand/",
        "text": "[removed]",
        "created_utc": 1669933890,
        "upvote_ratio": 1.0
    },
    {
        "title": "MA in (pure) Math possible without BA in Math?",
        "author": "PhilosophyDurian",
        "url": "https://www.reddit.com/r/GradSchool/comments/za208z/ma_in_pure_math_possible_without_ba_in_math/",
        "text": "[removed]",
        "created_utc": 1669933407,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it worth to continue being a slave?",
        "author": "AdEconomy9288",
        "url": "https://www.reddit.com/r/GradSchool/comments/za1xs3/is_it_worth_to_continue_being_a_slave/",
        "text": "[removed]",
        "created_utc": 1669933262,
        "upvote_ratio": 1.0
    },
    {
        "title": "should i quit master degree (grad school)",
        "author": "Birot_Conjard",
        "url": "https://www.reddit.com/r/GradSchool/comments/za1mkg/should_i_quit_master_degree_grad_school/",
        "text": "[removed]",
        "created_utc": 1669932617,
        "upvote_ratio": 1.0
    },
    {
        "title": "Research proposal issues",
        "author": "AssistAccomplished",
        "url": "https://www.reddit.com/r/GradSchool/comments/za1a55/research_proposal_issues/",
        "text": "Hi folks! I have been applying for a PhD position and it has not been very good so far. In my recent rejection, my academic background qualified; unfortunately, my research proposal did not make it. I was told that my research questions are \"too encompassing,\" among others.\n\nI am currently revising my proposal and I am honestly unsure how to narrow down my research questions. For the context, I am working on climate displacement.\n\nWould really appreciate any suggestions on how I can narrow down my research questions. Here they are, in case:\n\n* How do government officials, policymakers, and persons displaced by climate related events construe: (a) climate crises; (b) climate displacement; and (c) rights of climate-displaced persons?; and\n* What rights and rightlessness do these constructions produce among climate-displaced communities?\n\nThanks for the insights!",
        "created_utc": 1669931945,
        "upvote_ratio": 1.0
    },
    {
        "title": "When do you guys receive your contracts for teaching / TAing?",
        "author": "InfuriatingComma",
        "url": "https://www.reddit.com/r/GradSchool/comments/za0wdh/when_do_you_guys_receive_your_contracts_for/",
        "text": "[removed]",
        "created_utc": 1669931134,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it appropriate to reference a professor by name in personal statements?",
        "author": "WuffGang",
        "url": "https://www.reddit.com/r/GradSchool/comments/za0vky/is_it_appropriate_to_reference_a_professor_by/",
        "text": "[removed]",
        "created_utc": 1669931089,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unsubsidized Loans; Please Help!",
        "author": "Maleficent-Ruin-5158",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9y3gp/unsubsidized_loans_please_help/",
        "text": "[removed]",
        "created_utc": 1669925074,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does alumni interview mean for non requiring school?",
        "author": "Automatic_Screen349",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9y16n/what_does_alumni_interview_mean_for_non_requiring/",
        "text": "Welp. I got an email from a grad school program at Columbia that does not require alumni interview for all candidates, that I will indeed proceed with the interview.  Sounds great I guess…. Generally at this stage, what does it mean about my application status do you think?  \n\nI’m not terribly stressed but I’d also appreciate any tips!!  \n\nThanks 😊",
        "created_utc": 1669924932,
        "upvote_ratio": 1.0
    },
    {
        "title": "Defending in less than 24 hours and my nerves are going wild",
        "author": "shusshbug",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9uyuf/defending_in_less_than_24_hours_and_my_nerves_are/",
        "text": "",
        "created_utc": 1669918326,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to properly thank a professor who has done a lot for you?",
        "author": "almondmillkbaby",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9txue/how_to_properly_thank_a_professor_who_has_done_a/",
        "text": "[removed]",
        "created_utc": 1669916184,
        "upvote_ratio": 1.0
    },
    {
        "title": "Late Letters of Recommendation",
        "author": "leezy927",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9tktw/late_letters_of_recommendation/",
        "text": "[removed]",
        "created_utc": 1669915363,
        "upvote_ratio": 1.0
    },
    {
        "title": "Credit for Experimental work and writing",
        "author": "ancientwifi",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9t46y/credit_for_experimental_work_and_writing/",
        "text": "[removed]",
        "created_utc": 1669914287,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do/did you break up with your PI?",
        "author": "ImportantDocument940",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9t1al/how_dodid_you_break_up_with_your_pi/",
        "text": "It’s my first semester and i’m planning on leaving the lab that i’m currently in. I’ve built a relationship with my PI but I think their expectations on lab work and the ways they handle difficult situations with myself/other students isn’t what i’m looking for. I’ve discussed this with another professor and they’ve agreed that my PI does in fact expect significantly more work and hours from us compared to most other labs. I’ve discussed this with them before however I don’t see us agreeing on this so I’ve decided it’s better to find another lab (which I’ve been assured shouldn’t be an issue). I wanted to hear advice from other grad students in science/research who have had to switch PI’s and what that looked like for you.",
        "created_utc": 1669914100,
        "upvote_ratio": 1.0
    },
    {
        "title": "Postgraduate Taught (PGT) students currently studying in the UK needed for short survey! Chance to win giftcarrd",
        "author": "j_a_c_k_rodgers",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9sqvm/postgraduate_taught_pgt_students_currently/",
        "text": "[removed]",
        "created_utc": 1669913415,
        "upvote_ratio": 1.0
    },
    {
        "title": "Taking me too long to finish masters",
        "author": "mikamusings",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9smvh/taking_me_too_long_to_finish_masters/",
        "text": "[removed]",
        "created_utc": 1669913141,
        "upvote_ratio": 1.0
    },
    {
        "title": "Massive fck up in thesis process, help 😭",
        "author": "Intelligent-Year8330",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9sgnc/massive_fck_up_in_thesis_process_help/",
        "text": "To keep things simple. At my uni they require you to upload a progress report in October to be able to defend your thesis in Jan. \n\nI uploaded it. I am certain. But i just saw an email from my advisor that says she didn’t receive it!! This is my first reason for freaking out. My second is that she sent this email ages ago and I completely missed it. I feel so insanely incompetent! This is also bad because im resubmitting my failed thesis … \n\nThis year has been horrible for me due to personal health issues and i feel like i have 0 control over my health and mind and it’s seeping into my work. I feel terrible and am wondering if anyone has any advice on how i should approach this situation .. 😣",
        "created_utc": 1669912722,
        "upvote_ratio": 1.0
    },
    {
        "title": "US Govt Postdoctoral STEM Fellowship Research Opportunities",
        "author": "mbster2006",
        "url": "/r/postdoc/comments/z9okzk/us_govt_postdoctoral_stem_fellowship_research/",
        "text": "",
        "created_utc": 1669912238,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm shocked at the lack of effort/quality that my classmates put in",
        "author": "ToothOver9567",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9r7dl/im_shocked_at_the_lack_of_effortquality_that_my/",
        "text": "[removed]",
        "created_utc": 1669909702,
        "upvote_ratio": 1.0
    },
    {
        "title": "Opinions",
        "author": "Always_Hungry78",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9qfz7/opinions/",
        "text": "[removed]",
        "created_utc": 1669907868,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are the things you have to keep in mind as an international student while applying for MBA in top colleges?",
        "author": "Which_End_3498",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9o0qc/what_are_the_things_you_have_to_keep_in_mind_as/",
        "text": "[removed]",
        "created_utc": 1669901654,
        "upvote_ratio": 1.0
    },
    {
        "title": "No COLA, No Contract! Build rank-and-file strike committees across UC campuses and beyond! For a counteroffensive against the attacks on the working class!",
        "author": "exgalactic",
        "url": "https://www.wsws.org/en/articles/2022/12/01/xspe-d01.html",
        "text": "",
        "created_utc": 1669901213,
        "upvote_ratio": 1.0
    },
    {
        "title": "depressed",
        "author": "AdExtension7405",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9n6m4/depressed/",
        "text": "Hi guys, \n\nJust writing this post about grad school because I’d love to be heard by someone. I study in one of the wealthier uni in Asia as a postgrad and my first semester is over. I am feeling extremely depressed after I realised that I have scored A- for an essay I worked extremely hard for. I worked hard at it the entire semester and my efforts did not pay off at all. I feel extremely hurt by the harsh comments my essay received and also the fact that my peers who did last minute work scored A+ really affected my self-esteem. I am now reminded that I have always been the failure in life who put in more effort than others but always fail to perform when I needed to. I am reminded of how I have never been top student and am always merely an average student in my entire life, no matter how hard I worked and desired for stellar results. The crushing disappointment has convinced me that I am fundamentally flawed. I feel like I am so stupid I do not deserve to be a scholar or academic as I am unable to do something as simple as write an excellent essay when I have three months to do so. I am so depressed I remember now why I hate myself so much—it is because I am always the one who worked harder but fell short due to my pathetic intellect. I feel so depressed even when I know I am likely to get an A grade for the course on overall. This is because I have peers who are able to score A+s for every module who have been dismissive of me and my intellectual capabilities. I am never able to do as well as them no matter how hard I try—and no matter how mean or unfriendly they are to me. I wish I were dead because then I might not have to deal with this anymore. Being with my girlfriend makes things worse because she does not understand the pains I am undergoing and I do not want her to feel like she has to carry the burdens of a failed academic. I feel like the only victory I may gain over the system that brings me so much pain is to pack up and leave. Anyone in a similar situation would like to share some word of encouragement? Thank you for reading and God bless.",
        "created_utc": 1669899386,
        "upvote_ratio": 0.99
    },
    {
        "title": "How to I help with motivation and stop challenging myself to get as close to failing as I can.",
        "author": "nicoleb998",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9iktn/how_to_i_help_with_motivation_and_stop/",
        "text": "[removed]",
        "created_utc": 1669883220,
        "upvote_ratio": 1.0
    },
    {
        "title": "What remote sensing programs should I apply for?",
        "author": "Axelmaa",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9ik03/what_remote_sensing_programs_should_i_apply_for/",
        "text": "[removed]",
        "created_utc": 1669883124,
        "upvote_ratio": 0.99
    },
    {
        "title": "Why did you decide to go to grad school?",
        "author": "upsidedownsq",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9ifh3/why_did_you_decide_to_go_to_grad_school/",
        "text": "Just curious, what made you want to get a Masters degree?",
        "created_utc": 1669882641,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is PhD in North America Different from Europe?",
        "author": "anavarzaaa",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9iey1/is_phd_in_north_america_different_from_europe/",
        "text": "I've been looking and applying to PhD programmes all around the world. I got an offer from a good University in Canada. However, pay is really low (24k CAD per annum), considering rising inflation and the cost of living how do people suppose to survive with that? At least in Europe, you get the above minimum wage and it actually has some relatively good benefits such as paid pregnancy leave etc. On top of that, they expect me to only work for them and not do any independent work in my off time. I get the sensation that they will require me to work more than the listed hours and pay me less. Is this normal?",
        "created_utc": 1669882585,
        "upvote_ratio": 0.86
    },
    {
        "title": "Need help plzz! How to host lunch for guest speaker?",
        "author": "Jennylelelee",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9gted/need_help_plzz_how_to_host_lunch_for_guest_speaker/",
        "text": "[removed]",
        "created_utc": 1669876665,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone ever hosted lunch with a guest speaker? How does it work?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1669876572,
        "upvote_ratio": 1.0
    },
    {
        "title": "How I survived being a TA this semester:",
        "author": "AegonIXth",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9ezwr/how_i_survived_being_a_ta_this_semester/",
        "text": "[removed]",
        "created_utc": 1669870950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I switch to Math in masters(maybe Stanford) while my undergrad was Electrical Engineering?",
        "author": "triplerrr71",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9eus8/can_i_switch_to_math_in_mastersmaybe_stanford/",
        "text": "[removed]",
        "created_utc": 1669870591,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I know if I'm inexperienced or just incompetent?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1669869907,
        "upvote_ratio": 0.5
    },
    {
        "title": "Denied admission after spring deferral",
        "author": "the_lite_guy",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9dgzk/denied_admission_after_spring_deferral/",
        "text": "[removed]",
        "created_utc": 1669866822,
        "upvote_ratio": 1.0
    },
    {
        "title": "are my chances shot?",
        "author": "valentine-avenue",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9cyxn/are_my_chances_shot/",
        "text": "this sub prob gets this question a million times a day so i apologize in advance but i’m nervous about this. \n\ni’m looking at an F in a class (not for my major and not what i wanna pursue) this semester, leaving my GPA at about 2.4. i had a 3.7 last year and i plan on really grinding next semester and beyond to hopefully graduate with a 3.5. i’m a neuro major and want to do something with that in grad school but i’m not sure if i even have a chance anymore. \n\nany and all thoughts are appreciated\n\nedit: looking at an F due to my poor exam performances. course policy states that i must have a passing grade for both exams and hw to earn an overall passing grade. i’m doing fine hw wise tho",
        "created_utc": 1669865505,
        "upvote_ratio": 0.6
    },
    {
        "title": "How Can an Essay Writing Service Help Students?",
        "author": "VirgenHavens",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9cm54/how_can_an_essay_writing_service_help_students/",
        "text": "[removed]",
        "created_utc": 1669864623,
        "upvote_ratio": 1.0
    },
    {
        "title": "Most Trusted Dissertation &amp; Essay Writing Service working Since 2001 with all 5 star reviews.",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1669863514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for an international graduate student seeking to take break from school without jeopardizing their visa status.",
        "author": "Lucky_dime",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9ajht/advice_for_an_international_graduate_student/",
        "text": "I'm an international student in my first semester at a master's program in one of this US colleges. Unfortunately, I have found the whole ordeal very expensive - from tuition, rent, food, etc., and I'm increasingly finding it hard to survive here financially. I have considered transferring to more affordable programs, but none has materialized yet. At the moment, I really don't want to begin the spring semester in this same school to avoid further financial ruin, and I worry that doing so might affect my legal status here. Any tips for navigating this?",
        "created_utc": 1669859439,
        "upvote_ratio": 1.0
    },
    {
        "title": "Withdrawing from my MSc due to deteriorating health",
        "author": "triathlonspider",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9a4va/withdrawing_from_my_msc_due_to_deteriorating/",
        "text": "[removed]",
        "created_utc": 1669858395,
        "upvote_ratio": 1.0
    },
    {
        "title": "Leaving my masters program due to deteriorating health",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1669857991,
        "upvote_ratio": 1.0
    },
    {
        "title": "Leaving my masters degree due to my health condition",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1669857888,
        "upvote_ratio": 1.0
    },
    {
        "title": "Youngstown State Doctorate",
        "author": "Acrobatic_Emu_2787",
        "url": "https://www.reddit.com/r/GradSchool/comments/z99v58/youngstown_state_doctorate/",
        "text": "Hey there!\n\nI am a federal employee and I plan on being in the public sector until 2028 (10 years for PSLF). \n\nI want job security and a high salary which my job will give me. Fed employees work on a ranking system (1-15 levels) and I’m a level 12 making $90k a year. \n\nI constantly think about getting a doctorate in education. I know some academic careers won’t make $90k a year. \n\nBut this is something I want. I’m a first generation student and getting my masters was a significant and eye opening period of my life.\n\nI’m looking into Youngstown State University Doctor of Education – Educational Leadership – Health and Human Services. \n\nHas anyone graduated from this problem? If so, what is your experience? \n\nSorry for the drawn out post.",
        "created_utc": 1669857722,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm about to quit my MSc because of my health condition and I'm really worried about the consequences of my withdrawal",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1669857694,
        "upvote_ratio": 1.0
    },
    {
        "title": "Youngstown University Doctorate",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1669857652,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would anyone be able to review my personal statement?",
        "author": "sisalty",
        "url": "https://www.reddit.com/r/GradSchool/comments/z99jh5/would_anyone_be_able_to_review_my_personal/",
        "text": "[removed]",
        "created_utc": 1669856899,
        "upvote_ratio": 1.0
    },
    {
        "title": "grad school and going abroad",
        "author": "lmillen",
        "url": "https://www.reddit.com/r/GradSchool/comments/z98skl/grad_school_and_going_abroad/",
        "text": "hi everyone!\nI was wondering if anyone has gone abroad for grad school?\nor has done time abroad during grad school in an internship or study abroad type thing?\n\nany information is appreciated ! thank you XX",
        "created_utc": 1669855037,
        "upvote_ratio": 1.0
    },
    {
        "title": "CGS-M application for 2 departments at the same school",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1669854365,
        "upvote_ratio": 1.0
    },
    {
        "title": "Literally zero motivation",
        "author": "wtf_grad_throwaway",
        "url": "https://www.reddit.com/r/GradSchool/comments/z989s2/literally_zero_motivation/",
        "text": "[removed]",
        "created_utc": 1669853750,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else find TAing harder post pandemic?",
        "author": "Outside_Enthusiasm22",
        "url": "https://www.reddit.com/r/GradSchool/comments/z9823d/anyone_else_find_taing_harder_post_pandemic/",
        "text": "I don't mean to be rude it's like some undergrad students are even less prepared for entering university then before the pandemic. My thinking is virtual learning just didn't suit a lot of people? I'm getting tons of issues with behavior, meeting course expectations (like writing in full sentences yikes) and  plagiarism but damn they still want that A. I've got help from my department dealing with it and it sounds like professors are dealing with the same thing at my institution. Anyone else noticing this?",
        "created_utc": 1669853241,
        "upvote_ratio": 0.99
    },
    {
        "title": "Literally zero motivation",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1669853233,
        "upvote_ratio": 1.0
    },
    {
        "title": "Literally zero motivation",
        "author": "wtf_grad_throwaway",
        "url": "https://www.reddit.com/r/GradSchool/comments/z97tam/literally_zero_motivation/",
        "text": "[removed]",
        "created_utc": 1669852687,
        "upvote_ratio": 1.0
    },
    {
        "title": "Literally zero motivation",
        "author": "wtf_grad_throwaway",
        "url": "https://www.reddit.com/r/GradSchool/comments/z97s5l/literally_zero_motivation/",
        "text": "[removed]",
        "created_utc": 1669852605,
        "upvote_ratio": 1.0
    },
    {
        "title": "starting a minor vs taking higher-level classes in my major?",
        "author": "felvonulas",
        "url": "https://www.reddit.com/r/GradSchool/comments/z97q3y/starting_a_minor_vs_taking_higherlevel_classes_in/",
        "text": "hey guys! i was looking to see if i could get some advice. i'm currently a sophomore history major (BA) at a public college in the united states. i have no minor at the moment, but i was looking at picking up the anthropology minor we offer because anthro intersects pretty heavily with the area of history i'm in (social and cultural history). the only thing is, you need three or four 100-level classes to complete the first part of the minor, and then after that, the class offerings still aren't the best. my other option is to take higher-level history courses in my major (400-500s) in addition to some other school requirements, and just not take the minor. i've heard that minors matter less in graduate school applications than certain classes, field work, job experience, etc. but i wanted to get some feedback, maybe specifically to the humanities/history. the advisors at my school are pretty shitty and none of them were in humanities anyway, so it's not great to ask there. would just getting deeper into history be a better idea for sure?\n\ni'm also working at the historical library as an archivist and studying 2 foreign languages. would it be substantially beneficial to my applications to keep doing those activities, or take less time for them and take an extra class or two? i don't go to a super highly ranked university, but i'm just trying to balance what i do for a good graduate application. i plan to apply for an MA/PhD program in european history, if that matters. thanks!",
        "created_utc": 1669852466,
        "upvote_ratio": 1.0
    },
    {
        "title": "I messed up. Feeling ashamed, guilty, and scared",
        "author": "Picklepunky",
        "url": "https://www.reddit.com/r/GradSchool/comments/z97bph/i_messed_up_feeling_ashamed_guilty_and_scared/",
        "text": "[removed]",
        "created_utc": 1669851482,
        "upvote_ratio": 1.0
    },
    {
        "title": "Personal Stories and Advice on Graduate Admissions",
        "author": "xX627283377",
        "url": "https://www.reddit.com/r/GradSchool/comments/z96mdw/personal_stories_and_advice_on_graduate_admissions/",
        "text": "Firstly, thank you for taking the time to read this. I know graduate students can be busy.\n\nI hope to apply to either Spalding University or Eastern Kentucky University for their Psy.D. program, especially relating to their Forensics Psychology department. I was wondering if there are any members here that are currently enrolled or graduated from this program. I would love to hear your stories staring from your admissions right to the end.\n\nAlso, has anyone been rejected by graduate schools? What did you do after that to improve your chances?",
        "created_utc": 1669849829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ideas for Grad School?",
        "author": "kkdelux",
        "url": "https://www.reddit.com/r/GradSchool/comments/z96c6l/ideas_for_grad_school/",
        "text": "Hi r/GradSchool,\n\nI am looking for some advice to help clear up some of the mess I've found online.\n\nTo start, my background is I have a B.S. Computer Science from Cal State Northridge (Non-Target) and have been working in Defense Robotics for about 2 years. I find the technologies that I am working on exciting and innovative but unfulfilling.\n\nAfter about a year of feeling lost about my next steps, I have found a mission statement for myself; \"I want to make the **future** *possible* and make the **present** *better*\".\n\nI am trying to find a Grad School program that aligns with my mission statement and leverages my technical CS background. I would like to pursue a path that aligns with the goals of improving technology in a way that brings people together and improves their livelihood with the same ethos as the [Center of Humane Technology](https://www.humanetech.com/). However, I struggle with searching for programs because the concept of \"humane\" technology encompasses such a large amount on bodies of knowledge.\n\nBeing more of a technologist, I would prefer to stay on the side of implementation. A list of questions that I would like to research would be:\n\n* How can existing technology change to bring people together (conversely: decrease the divide in people), improve people's QoL, or just improve people?\n* What new technologies can be created to bring people together, improve people's QoL, or improve people?\n* What economic models would incentivize the natural creation of these technologies? (rather than those that currently incentivize the exploiting addiction and polarization)\n\nGoogle and LinkedIn searches have not yielded much quality information. I am hoping that this community would be able to help me identify any sorts of programs and/or advisors that are looking into these questions in a more formal academic manner.\n\nThank you in advance to those who respond. I appreciate how helpful and insightful this community is.",
        "created_utc": 1669849205,
        "upvote_ratio": 1.0
    },
    {
        "title": "To share or not to share...",
        "author": "thrwaway845481",
        "url": "https://www.reddit.com/r/GradSchool/comments/z929rq/to_share_or_not_to_share/",
        "text": "[removed]",
        "created_utc": 1669840196,
        "upvote_ratio": 1.0
    },
    {
        "title": "Received notice that my F31 was awarded today but will likely finish my PhD before it ends",
        "author": "JimJamb0rino",
        "url": "https://www.reddit.com/r/GradSchool/comments/z91hum/received_notice_that_my_f31_was_awarded_today_but/",
        "text": "Hi all, I'm a 5th year student and just got notified that my f31 was funded. Yay! However, I will likely finish my PhD before the awarded time is up- some experiments went better than expected. What is the etiquette for finishing before the end of the fellowship? Is it bad to end it prior to finishing? I know its not really a terrible problem to have, but I'm curious.\n\nThanks!",
        "created_utc": 1669838419,
        "upvote_ratio": 1.0
    },
    {
        "title": "What grad school feels like",
        "author": "Chris7thLegion",
        "url": "https://www.reddit.com/r/GradSchool/comments/z91a6t/what_grad_school_feels_like/",
        "text": "[removed]",
        "created_utc": 1669837943,
        "upvote_ratio": 1.0
    },
    {
        "title": "UAW local covering 11,000 University of California postdoc and academic researchers announces sellout agreements, as union seeks to shut down strike",
        "author": "exgalactic",
        "url": "https://www.wsws.org/en/articles/2022/11/30/acad-n30.html",
        "text": "",
        "created_utc": 1669835931,
        "upvote_ratio": 1.0
    },
    {
        "title": "Much needed advice: a complex PhD decision",
        "author": "panthsdger",
        "url": "https://www.reddit.com/r/GradSchool/comments/z900hs/much_needed_advice_a_complex_phd_decision/",
        "text": "My situation is a bit complex, but in short: I am deciding whether I should attend the top PhD program in my field (#1 ranked) versus attending a \\~#10-20 ranked PhD program that is local while staying at my current job.\n\nI currently **work a job** at a lab doing research that I absolutely love with an amazing supervisor, and if I choose the local PhD program I will be able to continue doing research here while receiving a decent portion of my salary. However, I applied to several PhD programs (three local and one at *the* top university, you know where) in robotics/ECE and after some discussions with several professors it seems that one of them wants me to join their lab in the Fall, thus my admittance is quite likely. This advisor in question seemed very kind and caring to her students, and, while they run a very successful lab, I am not particularly passionate about their research. I'm sure I wouldn't be unhappy there, but I am much more excited about the research I am doing now. I know that employers care a lot about which university you went to for robotics specifically, and I worry that if I go to a less reputable university then I would have less doors open for working on interesting projects in the future. I worry this will especially be the case if I decide to change my field of research within robotics, or my company, as the employers would be less interested in my publications and would base their decisions more off of my academics.\n\nThank you so much for reading through this, I have been struggling a lot with having clarity of though during this process. From (a) a long-term career perspective and (b) a short-term career perspective do you all have any advice for me that could help me with this tough decision?",
        "created_utc": 1669835131,
        "upvote_ratio": 1.0
    },
    {
        "title": "Deciding which school for a PhD in Robotics",
        "author": "panthsdger",
        "url": "https://www.reddit.com/r/GradSchool/comments/z8zwee/deciding_which_school_for_a_phd_in_robotics/",
        "text": "My situation is a bit complex, but in short: I am deciding whether I should attend the top PhD program in my field (#1 ranked) versus attending a \\~#10-20 ranked PhD program that is local. \n\nI currently **work a job** at a lab doing research that I absolutely love with an amazing supervisor, and if I choose the local PhD program I will be able to continue doing research here while receiving a decent portion of my salary. However, I applied to several PhD programs (three local and one at *the* top university, you know where) in robotics/ECE and after some discussions with several professors it seems that one of them wants me to join their lab in the Fall, thus my admittance is quite likely. This advisor in question seemed very kind and caring to her students, and, while they run a very successful lab, I am not particularly passionate about their research. I'm sure I wouldn't be unhappy there, but I am much more excited about the research I am doing now. I know that employers care a lot about which university you went to for robotics specifically, and I worry that if I go to a less reputable university then I would have less doors open for working on interesting projects in the future. I worry this will especially be the case if I decide to change my field of research within robotics, or my company, as the employers would be less interested in my publications and would base their decisions more off of my academics.\n\nThank you so much for reading through this, I have been struggling a lot with having clarity of though during this process. From (a) a long-term career perspective and (b) a short-term career perspective do you all have any advice for me that could help me with this tough decision?",
        "created_utc": 1669834884,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some graduate degree options with finance undergrad?",
        "author": "FarRoutine",
        "url": "https://www.reddit.com/r/GradSchool/comments/z8xv7x/what_are_some_graduate_degree_options_with/",
        "text": "I am a senior about to graduate with a BS in Finance. After completing an internship with a financial services company, I realized I don’t want to work in business. What are some options for a graduate degree that isn’t related to a business bachelor’s degree. Working in the government seems appealing so I was thinking getting an MPA might be a good idea. Thanks!",
        "created_utc": 1669830421,
        "upvote_ratio": 1.0
    },
    {
        "title": "School is getting rid of grad student resources",
        "author": "saturatedsock",
        "url": "https://www.reddit.com/r/GradSchool/comments/z8wtrs/school_is_getting_rid_of_grad_student_resources/",
        "text": "[removed]",
        "created_utc": 1669827994,
        "upvote_ratio": 1.0
    },
    {
        "title": "UT Austin vs USC Marshall MSBA comparison",
        "author": "SnooRabbits9587",
        "url": "https://www.reddit.com/r/GradSchool/comments/z8wlzr/ut_austin_vs_usc_marshall_msba_comparison/",
        "text": "[removed]",
        "created_utc": 1669827513,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you do if you try methods from existing studies and they DON\"T work?",
        "author": "calcetines100",
        "url": "https://www.reddit.com/r/GradSchool/comments/z8vu1o/what_do_you_do_if_you_try_methods_from_existing/",
        "text": "I have been doing some rare sugar extraction based on a very limited number of studies, and no matter how many times I repeat it, the yield is just...not as high as the studies suggest. In fact it's not even close. This is for a company related project and I feel pressures mounting on me because my boss is feeling pressure to get numbers ASAP from the company as well. I m starting to doubt the legitimacy of these studies methods. How do you deal with this?",
        "created_utc": 1669825657,
        "upvote_ratio": 1.0
    },
    {
        "title": "What made you want to go to grad school?",
        "author": "curlywitches",
        "url": "https://www.reddit.com/r/GradSchool/comments/z8vlof/what_made_you_want_to_go_to_grad_school/",
        "text": "[removed]",
        "created_utc": 1669825106,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not sure.",
        "author": "Ineedtofeelthings",
        "url": "https://www.reddit.com/r/GradSchool/comments/z8tey1/not_sure/",
        "text": "[removed]",
        "created_utc": 1669819851,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you were to create an indigenous technology, what would it be?",
        "author": "CardiologistLittle27",
        "url": "https://www.reddit.com/r/GradSchool/comments/z8swmo/if_you_were_to_create_an_indigenous_technology/",
        "text": "",
        "created_utc": 1669818579,
        "upvote_ratio": 1.0
    },
    {
        "title": "Review and comment on fellowship/internship statements",
        "author": "bubleteaandjelly",
        "url": "https://www.reddit.com/r/GradSchool/comments/z8s30a/review_and_comment_on_fellowshipinternship/",
        "text": "[removed]",
        "created_utc": 1669816443,
        "upvote_ratio": 1.0
    },
    {
        "title": "Update a month later…",
        "author": "Parking_Pineapple440",
        "url": "https://www.reddit.com/r/GradSchool/comments/z8s2gs/update_a_month_later/",
        "text": "I just re-read the post I made like a month ago about how miserable I am in my current program. Felt like writing again because things went off the deep end. In short, I reached my limit two days ago and ended up flying home. I’m finishing out my semester virtually. I thought I would survive the last three weeks living out there, but I just couldn’t do it; I even called my mom while I was in complete hysterics, which I don’t think I’ve ever done in my life. I really didn’t think this was going to happen. \n\nI’ve got a lot on my plate right now and just a lot to hash out. I’m throwing in applications for different programs, which my program coordinator suggested I do. I’ve been met with a lot of support. I’m hoping that at least being in this environment where I actually feel like I can live I’ll be able to close out stronger than I would there. But God, my brain is like a fried egg. \n\nI’m not particularly asking for any advice, just needed a place to write out this crazy journey I’m on. I should probably just drop my current program after the semester closes out and I get my grades, but it’s scary to think about the likely outcome of coming up empty with my apps and having no program to go back to. But on the other hand, considering how this semester has been, I don’t even know why I still feel like considering going back at all. It’s just a feeling of wishing I had a crystal ball to look into to know what the fuck is about to happen next for me. If you read this mess, thank you for your time.",
        "created_utc": 1669816403,
        "upvote_ratio": 0.99
    },
    {
        "title": "Would Graduate Institutions Be Understanding In Regards to an \"F\" That Was Due to Mental Health Issues? Future Coping Mechanisms",
        "author": "money5000",
        "url": "https://www.reddit.com/r/GradSchool/comments/z8rxzj/would_graduate_institutions_be_understanding_in/",
        "text": "I am going through mental health issues (primarily depression and possibly limited spurts of hypomania but unfortunately not in ways that help me to complete my assignments) and headache problems related to post-concussive syndrome, compounded by ADD I was already dealing with in the best of times. I am thinking of taking a leave of absence from my synchronous online graduate program (part-time, one class a semester) to rejuvenate myself and figure out what I want to do with my life. If I would want to transfer to a face-to-face/asynchronous online institution (depending on the class, would take face-to-face whenever possible for concentration/participation reasons) a few semesters down the line on a similar schedule or return to my synchronous online institution, would one F be disqualifying if I could explain that it was due to not being able to concentrate due to these aforementioned mental health issues? My plan whether I would switch or not would be to continue taking one course a semester.\n\nTo be more specific, I am currently in the Library and Information Science program at the University of Alabama Online and I am thinking about going hybrid at the University of Wisconsin - Milwaukee. I received an A in two previous classes and had a stellar undergrad record with a 3.8 GPA average over 135 credits.\n\nAlso, does anyone have tips on how to concentrate on your academic studies and prioritize your assignments when you are having struggles with paying attention? I do work a 40 hour a week full time job and a limited-term (fall/spring semester) 5.5 hour a week part time job so my plate is definitely full already.",
        "created_utc": 1669816065,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thesis vs. Non-Thesis",
        "author": "xpastelprincex",
        "url": "https://www.reddit.com/r/GradSchool/comments/z8ozyu/thesis_vs_nonthesis/",
        "text": "I just got accepted into a master’s program that has both a thesis and a non-thesis option of study. I would like to do a thesis as I feel like defending a thesis would be a good experience and would also look good while applying for a PhD, however since I work full time (and this job pays for my schooling so I can’t just not work) I don’t know if I’d have the time for a well rounded thesis. \n\nSo I wanted to come on here to ask some people who may have done a thesis before, do you think it’s feasible with a job? Have any of you yourselves done a thesis while working full time? How was it? \n\nThanks!",
        "created_utc": 1669807287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Organizing Against Precarity in Higher Education",
        "author": "Maxwellsdemon17",
        "url": "https://www.currentaffairs.org/2022/04/organizing-against-precarity-in-higher-education",
        "text": "",
        "created_utc": 1669806317,
        "upvote_ratio": 1.0
    },
    {
        "title": "Master‘s degree: Dublin vs. Colorado",
        "author": "sappycobain",
        "url": "https://www.reddit.com/r/GradSchool/comments/z8moec/masters_degree_dublin_vs_colorado/",
        "text": "[removed]",
        "created_utc": 1669799137,
        "upvote_ratio": 1.0
    },
    {
        "title": "**HELP** I can’t find Mount Sinai’s personal statement word count or page limit???",
        "author": "boopiedoopiepan",
        "url": "https://www.reddit.com/r/GradSchool/comments/z8kulg/help_i_cant_find_mount_sinais_personal_statement/",
        "text": "I don’t know if it’s the fact that I haven’t slept in 48 hours or that it’s 3 am rn but I cannot for the life of me find the requirements for the personal stamens. \n\n(Neuro Ph.D program specifically)\n\nWould anyone happen to know the requirement? Please help! I promise I’ll get some rest after I submit this. \n\nThanks in advance!",
        "created_utc": 1669793006,
        "upvote_ratio": 1.0
    },
    {
        "title": "Working Before Applying to Ph.D.?",
        "author": "muffinpie12",
        "url": "https://www.reddit.com/r/GradSchool/comments/z8kp6g/working_before_applying_to_phd/",
        "text": "[removed]",
        "created_utc": 1669792540,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I approach this?",
        "author": "4335788649",
        "url": "https://www.reddit.com/r/GradSchool/comments/z8kbmp/how_do_i_approach_this/",
        "text": "[removed]",
        "created_utc": 1669791424,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choose a minor for grad school, employability, or grade boosting?",
        "author": "_x-o_x-o_",
        "url": "https://www.reddit.com/r/GradSchool/comments/z8j392/choose_a_minor_for_grad_school_employability_or/",
        "text": "[removed]",
        "created_utc": 1669787846,
        "upvote_ratio": 1.0
    },
    {
        "title": "choose a minor for interest/mark boosting or employment or grad school?",
        "author": "_x-o_x-o_",
        "url": "https://www.reddit.com/r/GradSchool/comments/z8ixd1/choose_a_minor_for_interestmark_boosting_or/",
        "text": "[removed]",
        "created_utc": 1669787368,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stories from former grad school applicants!",
        "author": "Competitive-Name6256",
        "url": "https://www.reddit.com/r/GradSchool/comments/z8iwtj/stories_from_former_grad_school_applicants/",
        "text": "Hi all! I wanted to come here and see if any former grad school applicants have any inspiring stories that might help us current and maybe even future applicants be inspired. I thought quotes would help me (for example, *you miss 100% of the shots you don't take*) but I do think that some stories can possibly be even better because people have gone through similar experiences and it would be nice to see how former applicants' experiences were. So, those of you who have stories, I would love to hear them :)",
        "created_utc": 1669787326,
        "upvote_ratio": 1.0
    }
]