[
    {
        "title": "Very anxious about my interview",
        "author": "Designer_Anything318",
        "url": "https://www.reddit.com/r/GradSchool/comments/114vb6p/very_anxious_about_my_interview/",
        "text": "So I had my interview today and I think it went pretty well! I am anxious though, one of the questions I was asked my mind went completely blank and I had to gather myself for a few seconds before answering, and my answer was not amazing. I feel like that it definitely going to break my chances of getting in and make it seem to my interviewers that I didn’t prepare :(",
        "created_utc": 1676662173,
        "upvote_ratio": 1.0
    },
    {
        "title": "Emerson Grad School Decision Letters",
        "author": "LateInspector5173",
        "url": "https://www.reddit.com/r/GradSchool/comments/114vakk/emerson_grad_school_decision_letters/",
        "text": "[removed]",
        "created_utc": 1676662126,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will 2 withdrawals on a transcript affect chances of a future PhD acceptance?",
        "author": "swedishsgfpsycho",
        "url": "https://www.reddit.com/r/GradSchool/comments/114uz2f/will_2_withdrawals_on_a_transcript_affect_chances/",
        "text": "(28F) I’m going to be leaving my current PhD program at the end of this current semester for a variety of reasons (too far from home, need to be closer to family/friends, not financially sustainable to stay)- I’m a current 2nd year PhD student in a school psychology program. I am 100% confident in this decision. However, this week, a close family member had a health issue arise that I needed to go home for, and I think it’s going to make finishing all 4 classes of the semester difficult. I have a practicum which is 2 days a week and also a class, and a class that has projects linked to practicum. I am strongly considering withdrawing from these 2 classes and keeping my other 2. I receive a stipend for being a student, and as long as I am taking at least 6 credits, I can keep this and my financial aid. I also want to re-apply to other programs in the future. \n\nMy issue is, I am scared that if I have 2 W’s on my transcript, that no school will accept me in the future. I have gotten nothing less than a B during my masters and PhD so far, with the exception of 2 B-‘s (I have taken 29 classes so far). I should also add that I have a grade of Z for one dissertation credit I took since I haven’t completed the project yet. How would these W’s on my transcript hurt or affect my chances of getting in somewhere? Or if it is something like an online program would they not care as much? Any input from anyone would be so appreciated!",
        "created_utc": 1676661297,
        "upvote_ratio": 1.0
    },
    {
        "title": "That one thing you don't like about your PI ?q",
        "author": "calcetines100",
        "url": "https://www.reddit.com/r/GradSchool/comments/114uxd8/that_one_thing_you_dont_like_about_your_pi_q/",
        "text": "My PI is overall supportive and in fact compliments me quite often to other people. I have already two publication in his lab so everything is going well...but one thing that really bugs the shit out of me is that he keeps delegating tasks like 2-3 days before when he needs them to be done. Some are easy, but many take time and preparations, and because these are all related to external projects or other governmental grant projects, I can't say no unless I have already made some arrangement long while ago so that he can't force me to cancel them. \n\nWhat are your problem with your PI's?",
        "created_utc": 1676661175,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starting a professional degree was a bad choice",
        "author": "missdarbusisaqueen",
        "url": "https://www.reddit.com/r/GradSchool/comments/114ukop/starting_a_professional_degree_was_a_bad_choice/",
        "text": "I realized I want to do research and continue my studies at the postgraduate level but no PhD program wants someone with a professional degree especially since my program doesn’t have formal research options",
        "created_utc": 1676660282,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bachelor's in Finance - What graduate program is right for me?",
        "author": "chevycarl1",
        "url": "https://www.reddit.com/r/GradSchool/comments/114tazw/bachelors_in_finance_what_graduate_program_is/",
        "text": "Hi everyone!\n\nI completed my Bachelor's in Finance in 2017. Since then I have worked for a singular company in a corporate setting. 3 years in the billing department, and the last 2 years as a financial analyst. (FPA)\n\nI want to continue my career in corporate finance, but having trouble deciding which graduate program to pursue. Any advice??\n\nThank you",
        "created_utc": 1676657085,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to navigate job offers within 3 months of graduation?",
        "author": "OSU2015",
        "url": "https://www.reddit.com/r/GradSchool/comments/114qme6/how_to_navigate_job_offers_within_3_months_of/",
        "text": "A little background about me: PhD student in Biomedical Sciences, expected graduation May 2023. Great CV with 20+ publications (due to a length postbacc), leadership, and an industry-specific extracurricular.\n\nI attended a recruitment event for a company in a neighboring city. They liked my CV and heavily pursued me with a quick interview in Jan 2023. I received a fair, but not ideal, offer with regard to compensation. I would be required to commute a long distance or consider relocating, which I am reticent to do. I've been playing a dance with HR after they sent the offer letter with a 3-day expiration notice. They're willing to extend, but only for a few more days. I should've done a better job timing my other applications, but thought the interview practice would be ideal at this early stage.\n\nThe dilemma:  I haven't had a chance to interview at other locations, given their aggressive recruitment nature. Would it be fine to accept the offer and back out as needed if an offer in my home city arises? The company has a high level of turnover, but trains new graduates well. I've considered working there for a minimum of one year while continuing the job search for more-ideal positions. The commute would be draining and is my biggest complaint. I have little experience navigating this process and would love any feedback provided. Thanks!\n\nTL;DR: my first job offer is not ideal and came earlier than expected. Would it be ok to accept the offer now and pull out as needed if better offers come?",
        "created_utc": 1676650805,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did you choose between your top two schools? (Leaving the money aspect out of it)",
        "author": "ace-sal23",
        "url": "https://www.reddit.com/r/GradSchool/comments/114phwj/how_did_you_choose_between_your_top_two_schools/",
        "text": "[removed]",
        "created_utc": 1676649112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paid master's thesis at a research facility?",
        "author": "mitochondria-mango",
        "url": "https://www.reddit.com/r/GradSchool/comments/114karx/paid_masters_thesis_at_a_research_facility/",
        "text": "I am in a marine biology program in Italy. I've heard that some people can do their master's thesis with a research facility and get paid, rather than doing the thesis at the university.\n\nI've been trying to search for various research facilities around the world and contact them, but I have no clue if this is even common. One research facility in the U.S. said they don't give degrees therefore they don't host master's studuents... so is this not true then? \n\nHow do I go about finding a way to get paid while doing my master's thesis? Are there really research facilities out there that employ students while the student does their thesis with the facility? \n\nAnd before you talk about applying for scholarships/grants:\n\n1. There were two grant/scholarship opportunities from my university that I applied for when I got in but did not get them.\n2. I'm not eligible for Erasmus funding considering I'm not from the EU (I'm from the U.S.)\n3. FAFSA from the U.S. cannot be used for my university in Italy\n4. Any scholarships/grants in general are either for *only* those going to school in the U.S., or those going to a specific program in a specific country: there's no global *general* scholarships/grants that literally *anyone* can just apply to",
        "created_utc": 1676640484,
        "upvote_ratio": 1.0
    },
    {
        "title": "Say you are tasked to write a lit review of a field you pretty much know nothing about. How do you go about ?",
        "author": "BadMeditator",
        "url": "https://www.reddit.com/r/GradSchool/comments/114jmvm/say_you_are_tasked_to_write_a_lit_review_of_a/",
        "text": "(given that you don't have any opportunity to backtrack or reject this task)\n\nThe field is in electrical engineering.",
        "created_utc": 1676638423,
        "upvote_ratio": 1.0
    },
    {
        "title": "APA match",
        "author": "throwawaycameracharg",
        "url": "https://www.reddit.com/r/GradSchool/comments/114jiw0/apa_match/",
        "text": "Today my Psy.D. classmates find out the APA site they matched with for final internship. I have to stay an extra year for my thesis so I have to wait and apply next year. I feel devasted and so upset with myself that I couldn't get it together. Today sucks.",
        "created_utc": 1676638064,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it a good idea to get a postgrad at 18?",
        "author": "AdExcellent2533",
        "url": "https://www.reddit.com/r/GradSchool/comments/114ig8s/is_it_a_good_idea_to_get_a_postgrad_at_18/",
        "text": "[removed]",
        "created_utc": 1676634348,
        "upvote_ratio": 1.0
    },
    {
        "title": "I will get a postgraduate degree at 18.",
        "author": "AdExcellent2533",
        "url": "https://www.reddit.com/r/GradSchool/comments/114ie8q/i_will_get_a_postgraduate_degree_at_18/",
        "text": "[removed]",
        "created_utc": 1676634138,
        "upvote_ratio": 1.0
    },
    {
        "title": "I will get my postgraduate degree at 18.",
        "author": "AdExcellent2533",
        "url": "https://www.reddit.com/r/GradSchool/comments/114id8i/i_will_get_my_postgraduate_degree_at_18/",
        "text": "[removed]",
        "created_utc": 1676634038,
        "upvote_ratio": 1.0
    },
    {
        "title": "Contacting potential PhD project supervisor",
        "author": "heCanDo",
        "url": "https://www.reddit.com/r/GradSchool/comments/114h3go/contacting_potential_phd_project_supervisor/",
        "text": "I am going to begin applying for PhD positions soon and there is one program that I am very interested in. If accepted, I would be joining an already formed research program. I know that in most cases it is encouraged, if not required, to contact the potential supervisor prior to sending an application; however, with this program being a preexisting research group I am not sure how I should contact the potential supervisor (if at all). Would you recommend sending an email simply expressing my interest in the project, or should I include more (for example, CV)? \n\nThanks!",
        "created_utc": 1676630644,
        "upvote_ratio": 1.0
    },
    {
        "title": "Severely embarrassing myself in front of my prof",
        "author": "whereissav",
        "url": "https://www.reddit.com/r/GradSchool/comments/114c7h1/severely_embarrassing_myself_in_front_of_my_prof/",
        "text": "So I just completely embarrassed myself in one of my lectures today and my anxiety is at an all time high. I had to lead a class discussion about a specific text, while I was running on a few hours of sleep and nothing but Vyvanse running through my system. For context, I’m in an undergrad program (not in grad school) and this class pretty much focuses on thinking about different philosophical theories in the context of current world issues, the future, or change. \n\nNear the end of my discussion, my prof talked about international conflicts, his own personal ethnic identity and his relative beliefs relating to the theory. After all that, he brought up the recent news about the earthquake in Turkey and Syria (he’s neither). For some reason, even though I never share ANYTHING super personal in class, I shared that I had friends who’s families were impacted in the earthquake and pretty much my intention was to relate it to the topic of international global catastrophes and the theory. \n\nAnyways the way I attempted to even explain my point was embarrassing and completely incoherent, to the point where my prof misunderstood me and replied with “so you think we should all know about every single catastrophe or disaster that’s ever happened around the world at all times…?” But my point was that many of these international events seem like a distant or dystopian concept to us if we aren’t directly impacted (which related to a quote in the text). Regardless if my point was dumb to begin with, I said it in an even dumber way to the point where my prof looked visibly annoyed and I sounded like I was trying to be ultra woke even though it was just my adhd and anxiety brain completely malfunctioning. I really respect this prof and enjoy his class, but now I’m just cringing at myself and the thought of going back. Not only that but a few hours after class, he reposted something on one of his social media platforms (which he puts on the syllabus because it’s public/he’s fine with students following him) something along the lines of “yeah because posting about something will stop all of the bad things happening in the world right now.”\n\nI feel so much shame because I shared something personal and because I executed a poorly put together point from it plus now having to deal with the fear of being entirely misunderstood by my prof and classmates. Is there any way to recover from this? 🥲",
        "created_utc": 1676613686,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else not have a backup plan or is it just me?",
        "author": "HourStatistician3259",
        "url": "https://www.reddit.com/r/GradSchool/comments/114bxfb/does_anyone_else_not_have_a_backup_plan_or_is_it/",
        "text": "[removed]",
        "created_utc": 1676612690,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling like I’m at a crossroads",
        "author": "nicoleb998",
        "url": "https://www.reddit.com/r/GradSchool/comments/114brrk/feeling_like_im_at_a_crossroads/",
        "text": "So I’m in grad school currently online and am really struggling with motivation I have a friend doing my program with me that is almost all online and I really just don’t care anymore. Everything feels so repetitive and I only have a few classes left. I just feel like I can be spending my time better elsewhere on personal growth or at my job currently. Idk I’m trying to find motivation to just continue without failing cause I don’t even care about grades really I’m just floating through and I wish I would be more into it.  I love learning new things but the assignments just aren’t interesting to me I guess I don’t know. If anyone has advice or questions thank you!",
        "created_utc": 1676612122,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Correct a Prof on My Name",
        "author": "misschickpea",
        "url": "https://www.reddit.com/r/GradSchool/comments/114b41t/how_to_correct_a_prof_on_my_name/",
        "text": "I reached out to a professor I heard about but never had a class for because his background and career experience sounded like what I'm interested in doing\n\nHe was very helpful and kind in our first and only meeting over zoom. However, despite our names being fully on display constantly, he kept calling me Wendy. At first I thought I may have misheard him but he did it three times throughout our one hour call.\n\nI am a young Asian woman and I feel that he is definitely confusing me with some other Asian girl because I've had this happen to me by two other professors who were also white upper middle aged males. \n\nOf course, I don't think all older white men do that but in psychology class I learned that you can confuse faces for ethnicities and races you're not exposed to and I feel like that is just what is happening with this prof and the profs who have done it \n\nMY QUESTION IS it'd be nice if I could have him as a mentor bc he's the only prof so far who's offered further connection like a coffee chat and he's the most similar to me so far in terms of career interests, but I don't know how to establish my correct name in case he keeps calling me Wendy if we meet in person for a coffee chat like he offered.\n\nWe've had email exchanges already before our zoom meeting where I've signed it with my real name and I have yet to contact him on a follow up\n\nTLDR: Prof I don't have for a course but would like to connect with keeps calling me Wendy which is not my name despite email exchanges and zoom name display. How do I correct him?",
        "created_utc": 1676609896,
        "upvote_ratio": 1.0
    },
    {
        "title": "Favoritism",
        "author": "GulfFisher3",
        "url": "https://www.reddit.com/r/GradSchool/comments/114atbo/favoritism/",
        "text": "I need some advice. I'm fortunate to have a very kind advisor who goes out of their way to provide me with opportunities. However, it seems that they neglect other students in my favor. As I'm close to my labmates, it hurts me to see this happening. It also just makes me feel weird. People regularly tell me that I'm their favorite, and Friends have said that they're hesitant to tell others important information about TAing w/ my advisor in front of me. Some examples are: \n\n-Offering to take the whole lab to international conference, saying it was 100% going to happen, rescinding the offer for all the other students as we may not have enough money for summer months, and privately offering to let me go. Further, they expect another student to coauthor a workshop paper for this event even though they won't get to go. I offered too just say that they helped without actually spending their time on it. \n\n-Referring to others' work as mine when I'm objectively not the lead. I've privately DMed the other students that it's their work. I'm not even on the grant. \n\n-Openly talking about how other students are not good at our type of research while saying how great I am at it. I also lack experience and am therefore not good at it. The other student is a sensitive, kind person, and I know it affects them.\n\nThere're other examples, but this post is already long. I've tried pulling others up by co-researching and highlighting their contributions, but it doesn't seem to be helping. How can I reduce day-to-day favoritism without offending my advisor? How should I handle this conference? I do want to go.",
        "created_utc": 1676608902,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I do my masters in the UK or US?",
        "author": "Poetrymakes",
        "url": "https://www.reddit.com/r/GradSchool/comments/114ad5t/should_i_do_my_masters_in_the_uk_or_us/",
        "text": "\nHello all!\n\nI’m currently an English Teacher abroad in Japan. I finished my undergrad in 2021. I’m planning on returning back to school for my masters in teaching in 2024. \n\nThe thing is, I have a dilemma between two schools: My alum school in the US and a new school in the UK.\n\nI’ve weighed the pros and cons but a stubborn part of me wants to weigh both as equal. I’ve always wanted to study in another country, specifically the UK. I was thinking University of Bristol.\n\n\n\nHere are the pros and cons for my alum uni:\n\nPro: Small and intimate private school. Everyone knows each other and the staff and faculty are super kind and helpful. I can easily be admitted into the program. \n\nPro: I get a $5,000 scholarship when applying\n\nPro: It’s all online except for student teaching, so I can learn online while still teaching in Japan with cheap bills and a secure job before moving back to the US in time for student teaching. \n\nCon: It’s back in my home state which I have bad trauma around.\n\nCon: Now that I’ve experienced another country, going back to the US just doesn’t appeal to me too much\n\n\n\nUni of Bristol pros and cons:\n\nPro: Great experience in another country and in building my resume \n\nPro: Good teaching program and only 1 year\n\nCon: Expensive tuition for international students plus housing fees\n\nCon: The headache just thinking about student visas, applying for housing, etc. \n\nCon: I might not like it and won’t be able to leave\n\n\n\n\nI know it seems clear which school wins, but a part of me wants to study abroad too. But I don’t know is studying abroad is better than versus, say, a vacation if all I want to do is be in the UK. Would the loans be worth it to study abroad?\n\n\nThanks everyone!",
        "created_utc": 1676607400,
        "upvote_ratio": 1.0
    },
    {
        "title": "No Show Joe Group Member...",
        "author": "Cirrus-ly",
        "url": "https://www.reddit.com/r/GradSchool/comments/11498i0/no_show_joe_group_member/",
        "text": "Ok, help a girl out. STEM MS program. Group design and research paper. Semester long project. Professor encourages conversation only through the platform.\n\nOne group member ghosted us after Week 1. She said she would contribute and never showed back up. Project and paper are nearly complete. Seriously, abstract being written kind of complete.\n\nI emailed professor and asked if we had to include her on the documents since she hasn't contributed and is unlikely to. We noticed she was also not doing the class work either. Professor informed me that he was notified she is no longer in the class and said not to include her name on our work.\n\nToday I was tying up loose ends and double checking the formatting. I got a message from her requesting a Zoom call. I'm uncomfortable because whatever is said on Zoom won't hold up in a conversation with the professor.\n\nWould you entertain the call? The project and paper are practically done. We just have to present it. My thought is to decline and have her contact the professor. I just don't want to be cold.\n\nI don't know if she had contacted the other group member with a similar message, but I imagine so.",
        "created_utc": 1676603756,
        "upvote_ratio": 1.0
    },
    {
        "title": "Psychology Grad programs and Joint JD options (This is a long shot but maybe someone has an answer)",
        "author": "LittleBigFoot155",
        "url": "https://www.reddit.com/r/GradSchool/comments/114956l/psychology_grad_programs_and_joint_jd_options/",
        "text": "\nI am currently an undergrad studying psychology at Uni Of Tenn- Knoxville. I am planning on pursuing a law degree as well as a graduates degree in psychology. It’s my goal to pursue a graduates degree at an Ivy League or other prestigious university.\n\nLooking at my options it is difficult to find universities that offer joint programs for a JD and MA/PHD that has the field of psychology I’m interested in (forensics).\n\nThis leads to my question(s). Does anyone here know of a school that offers forensic psychology with the option to get a joint JD? If not forensics, does anyone have a recommendation for another field of psychology that could benefit me as an attorney? Lastly, does anyone recommend either a MA or PHD over the other?\n\nI apologize for the load of questions. Just trying to figure some stuff out. Thanks!",
        "created_utc": 1676603478,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trouble in Paradise",
        "author": "Appropriate-Kale-124",
        "url": "https://www.reddit.com/r/GradSchool/comments/1147hcb/trouble_in_paradise/",
        "text": "For the married and long term relationship folks here: I started graduate school last year, after some time unemployed during the pandemic (not by choice). Throughout that and now, I have been in a long term relationship. Going on 8 years, we got married last summer. We started dating in college, and my husband as been fortunately employed ever since we graduated in a well paying career. I, got laid off right before COVID, got a job, got laid off again, and then decided it was time for a career change. This decision was made independently and jointly with my husband, understanding that more school meant less income, we decided that the opportunity for greater future income, in addition to my happiness, was worth the time period of less than ideal (if at all income) as I would be entering a field with minimal funding opportunities. Fortunately, I got into a program with a scholarship and offering funding for my first year of the two year program. The second year would offer no funding as it was a clinical internship program and I would be taking out student loans for the first time in my education career (I was fortunate to had no debt from undergrad from scholarships). My husband only had a small amount of debt and paid it off in the first year out of undergrad. He also did grad school while working and his work paid for most of his second degree. \n\nThe trouble: he financially resents me. We embarked on this journey together, but he constantly reminds me how he spends very little on himself and everything on us. I recognize that he has helped me through the degree, and I am so grateful for it. But I have also worked for it as well (scholarships, TA and RA positions, etc.). Last year, all the small savings I accumulated went to our wedding and buying our first house. I don’t want to feel like I have to pay him back for the rest of my life, or have him continue to resent me if, say, we chose that I stay home after pregnancy when we decide to have kids, and my income goes down again. \n\nMy question: how do you all manage your financial relationship in your partnership?",
        "created_utc": 1676598515,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my PI setting me up for disappointment?",
        "author": "BrokenMothLamp",
        "url": "https://www.reddit.com/r/GradSchool/comments/1146dqn/is_my_pi_setting_me_up_for_disappointment/",
        "text": "I graduated last year as a transfer student and to be honest I wasn't sure if that was going to happen because I was incredibly sick and had so many freak accidents and tragedies each quarter I thought I was just going to drop out due to grief/almost dying or get kicked out due to academic probation (whichever came first). But fortunately I finally go medical attention and accommodations and my last two quarters (summer quarters) were some of the best grades in upper div classes I received. It helped my GPA but not enough because I still ended up with a 2.9.\n\nI'm now working as a lab tech at a top 3 private university in the field that I want to be in and my PI had a conversation with me where I was honest about why my grades were so bad, how I want to say in academia and desperately want a phd, why I wanted to be here, etc. My PI said one reason why I stood out was because I really knew my past research well (I was a research assistant during undergrad and spoke about it in my interview with him) and the letter of rec he received from my old PI, post doc, and professor were incredibly glowing and that \"those same qualities \\[I\\] have are 100% going to get me into a PhD program that \\[I'll\\] be incredibly excited and proud about\". He also said that I can use my essay space on my applications to explain all the stuff that happened during my two years at university.\n\nIt was somewhat encouraging because he is also on the admissions committee where I work but I can't help but still feel sick (especially reading about all the amazing applicants getting rejected this round). I've also read a lot here about how while, yes, it's possible to get into a great school with shit grades it's an exception and requires an outstanding application otherwise. I'm also stressed because most schools require 3.0 minimum and I don't even hit that. He told me to apply anyway. I will but it honestly feels like he is trying to be encouraging whilst also not being entirely truthful.\n\nAm I crazy to believe the hope he's giving? Or is my sick anxiety warranted? \n\nGood luck to the applicants in this cycle!!!",
        "created_utc": 1676595297,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got asked to return to my internship for the summer and I can't even feel happy bc of how my advisor acts about it",
        "author": "Champaign__Supernova",
        "url": "https://www.reddit.com/r/GradSchool/comments/114627l/i_got_asked_to_return_to_my_internship_for_the/",
        "text": "When I got an internship this past semester and I told my advisor I was at least expecting a congratulations but they didn't really even say anything. I'm doing well in it though and they already asked me to return for the summer. It's amazing how valued I feel there but I'm still having trouble feeling happy for this because I know my advisor isn't going to be happy. Even though they've shown repeatedly they only want me to be a means to their tenure I still want to make them happy. I don't get it. \n\nYou all have skills and value outside of academia though. Don't ever forget that or let others treat you like you don't.",
        "created_utc": 1676594360,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sorority Advisor as Letter of Recommendation?",
        "author": "New-Department-4122",
        "url": "https://www.reddit.com/r/GradSchool/comments/11451dh/sorority_advisor_as_letter_of_recommendation/",
        "text": "[removed]",
        "created_utc": 1676591544,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sorority Advisor as Letter of Recommendation?",
        "author": "New-Department-4122",
        "url": "https://www.reddit.com/r/GradSchool/comments/11450ou/sorority_advisor_as_letter_of_recommendation/",
        "text": "",
        "created_utc": 1676591495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Msc to Pgdip",
        "author": "ShadyAntonelli",
        "url": "https://www.reddit.com/r/GradSchool/comments/1144zuk/msc_to_pgdip/",
        "text": "If I were to get a PGdip instead of an MSc, would I still be eligible for a promotion in the workplace? Or would I need to eventually get a masters in the future to be able to climb the corporate ladder?",
        "created_utc": 1676591432,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chat gpt for finding scientific articles?",
        "author": "Mammoth_Housing_4420",
        "url": "https://www.reddit.com/r/GradSchool/comments/1144tms/chat_gpt_for_finding_scientific_articles/",
        "text": "Chatgpt has been awesome to locate scientific papers of interest, weird thing is sometimes i can't locate the scientific papers it finds for me in Google. It's happened a few times. Anybody know why that is?",
        "created_utc": 1676590992,
        "upvote_ratio": 1.0
    },
    {
        "title": "MFA Acting Brooklyn College",
        "author": "Ww730327",
        "url": "https://www.reddit.com/r/GradSchool/comments/1144tb1/mfa_acting_brooklyn_college/",
        "text": "[removed]",
        "created_utc": 1676590967,
        "upvote_ratio": 1.0
    },
    {
        "title": "My advisor won’t email me back!",
        "author": "MrUnknown1996",
        "url": "https://www.reddit.com/r/GradSchool/comments/1144q0i/my_advisor_wont_email_me_back/",
        "text": "I’m in the process of getting a complete draft done for my thesis, so far I’m on track to finish by mid March. But it feels like that’s about to be compromised because my professor won’t email me back. I always try to meet with him once a week to talk about my progress and how I should proceed. But he hasn’t responded to any of my emails since our last meeting. So I had to reach out to someone else in the department to figure out what’s going on and apparently he has been up to his neck in one of his research projects recently. \n\nWhat should I do?",
        "created_utc": 1676590726,
        "upvote_ratio": 1.0
    },
    {
        "title": "How involved are you?",
        "author": "astudentiguess",
        "url": "https://www.reddit.com/r/GradSchool/comments/11447zg/how_involved_are_you/",
        "text": "I'm an MA student in a thesis based program. I've done coursework and am writing my thesis. I'm also a teaching assistant. But I'm not involved in any of the department level administration stuff like student government, the union, on campus jobs, or research assistant work. My first year I really tried to get a library job but I didn't get selected. So that's that. But some of my peers are involved on multiple levels. I'm not even sure how they fit so involved. I feel out of the loop in general. \nI just don't find admin stuff interesting, which is why I'm in grad school doing what I am interested in instead of working some corporate job. I enjoy the reading and writing and lectures and seminars but I'm not so much into playing the game I guess. I never was in undergrad either. \n\nIs this okay for an MA student?",
        "created_utc": 1676589389,
        "upvote_ratio": 1.0
    },
    {
        "title": "Between 2 programs for an MPA",
        "author": "Big_Ad7616",
        "url": "https://www.reddit.com/r/GradSchool/comments/11440k3/between_2_programs_for_an_mpa/",
        "text": "[removed]",
        "created_utc": 1676588863,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone is getting ratio'd hard",
        "author": "knienze93",
        "url": "https://twitter.com/pengpeng_xiao/status/1625169701184716806?t=R131-jx2kpHeX7QNTj3IJg&amp;s=19",
        "text": "",
        "created_utc": 1676582116,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grad school when to switch jobs?",
        "author": "work_in_progress777",
        "url": "https://www.reddit.com/r/GradSchool/comments/1140rjf/grad_school_when_to_switch_jobs/",
        "text": "[removed]",
        "created_utc": 1676580728,
        "upvote_ratio": 1.0
    },
    {
        "title": "When to switch jobs?",
        "author": "work_in_progress777",
        "url": "https://www.reddit.com/r/GradSchool/comments/1140plf/when_to_switch_jobs/",
        "text": "[removed]",
        "created_utc": 1676580596,
        "upvote_ratio": 1.0
    },
    {
        "title": "How was the transition from full-time work to school full-time?",
        "author": "glossdino",
        "url": "https://www.reddit.com/r/GradSchool/comments/1140mbk/how_was_the_transition_from_fulltime_work_to/",
        "text": "For those who took gap year(s) or worked full-time and went back to school, how was that transition for you?\n\nHow different was working full-time to now doing school full-time? Or those who did both school &amp; work full-time id love to know your experiences!\n\nI currently work full time &amp; have been accepted at uc berkeleys MSW program for this upcoming fall. Trying to prepare myself for this transition of having a full-time job to attending school full-time and probably having little to no income lol",
        "created_utc": 1676580363,
        "upvote_ratio": 1.0
    },
    {
        "title": "CSUN ABA Fall 2023",
        "author": "bananatrunk",
        "url": "https://www.reddit.com/r/GradSchool/comments/113yso9/csun_aba_fall_2023/",
        "text": "[removed]",
        "created_utc": 1676575637,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to approach energy mismatch with advisor?",
        "author": "okillgoawaynow",
        "url": "https://www.reddit.com/r/GradSchool/comments/113ypvd/how_to_approach_energy_mismatch_with_advisor/",
        "text": " context - I'm a new phd student in a lab with a relatively new advisor who's still really young, in her 30s for sure. prior to this I did my undergrad/masters in a lab where my former advisor was much older and experienced - he was very slow and intentional about thinking through things. as a result, I've become a bit of a slow thinker myself - I'd prefer to take a long time to think about how to approach something and have a good amount of certainty that my approach will work before starting work on a problem\n\nthat being said, my new advisor is super sparky and energetic - much more so than I am. Manic, almost, so when we meet i find myself entirely overwhelmed. I basically can't keep up with her energy. She's the type that would prefer to explore a lot of interesting ideas at once instead of thinking through things slowly and patiently. Would it be out of line for me to ask her to slow down during our meetings? I know the energeticness isn’t something she can help but it’s overwhelming to the point that i don’t think we’re able to communicate very effectively. Any advice on how to approach?",
        "created_utc": 1676575435,
        "upvote_ratio": 1.0
    },
    {
        "title": "Future Plans and Decisions",
        "author": "Difficult_Sky_6710",
        "url": "https://www.reddit.com/r/GradSchool/comments/113yk5j/future_plans_and_decisions/",
        "text": "Hi! I’m a sophomore undergrad. I am finding a lot of things that I am interested in doing, specifically Occupational Therapy and Speech Pathology. I know that I have plenty of time to decide which one but I’m having a hard time deciding which one I like more.\n\nWould it be possible to do both if they both require a Master’s? I haven’t been able to find anything on Google but I have been researching schools that offer both programs. Also anyone with pros and cons, any advice would be greatly appreciated.",
        "created_utc": 1676575031,
        "upvote_ratio": 1.0
    },
    {
        "title": "general advice for recruitment weekend",
        "author": "sorta_round_square",
        "url": "https://www.reddit.com/r/GradSchool/comments/113xzuk/general_advice_for_recruitment_weekend/",
        "text": "Greetings! \n\nI was offered admission into my top choice humanities PhD program. They have invited me to their recruitment weekend and it is rapidly approaching. I'm interested in any general advice from those of you with experience attending these events. I plan to rock the business casual, meet with a handful of professors I want to work with/have mild familiarity with their work, and not getting wasted at the planned dinners. But beyond that, what should I expect, plan for, aim for, look for, identify as red flags, etc.?\n\nThanks in advance,\nSRS",
        "created_utc": 1676573609,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help choosing a minor to look good for gradschools",
        "author": "hockey-more-like",
        "url": "https://www.reddit.com/r/GradSchool/comments/113xkbo/help_choosing_a_minor_to_look_good_for_gradschools/",
        "text": "[removed]",
        "created_utc": 1676572522,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Need advice] Balancing working style and mental health",
        "author": "vanhoutens",
        "url": "https://www.reddit.com/r/GradSchool/comments/113xiu6/need_advice_balancing_working_style_and_mental/",
        "text": "I am seeking advice/opinions on working style in grad school. Generally, the consensus seem to treat research as a job from 8/9 to 5, mondays to fridays, be disciplined about it to succeed. \n\nTried as I might for the most part to adhere to this, on some days it makes me miserable. My mental health has not been the best either and I was just wondering if anyone has a similar work schedule like mine and still managed to succeed in their phd studies? \n\nI would go to school from say between 8 am-9:30 am to 5pm/6pm to work for maybe 2-4 days of the week. During that time, I estimate the real number of work hours done is maybe anywhere from 4 to 6 hours per day. \n\nThere will be 2 days of those weekdays where I stay home ( stay home simply because I don't feel like going to school) with very very low productivity. I would try to work but usually  output is very low or non existent on those two days(honestly time would have been better spent on hobbies guilt-free and coming back to work later). \n\nMy point is that I find it hard to do the routine 40 hours Monday to Friday consecutively on technical stuff (coding, reading papers, etc). I seem to be happier mental health wise on a work 2 to 2,5 days, take the next day easy/fill it with hobbies, work 2 days then rest the next 2 days.\n\nThis might ultimately slow down my progress (or maybe set me up for failure?), but has anyone succeeded in their phd with such work schedules before? \n\nThank you!",
        "created_utc": 1676572417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which GPA do you put on your grad school application?",
        "author": "ReplacementWooden210",
        "url": "https://www.reddit.com/r/GradSchool/comments/113vu8g/which_gpa_do_you_put_on_your_grad_school/",
        "text": "[removed]",
        "created_utc": 1676568086,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else feel like a masters degree isn’t valued by employers?",
        "author": "sidneywidney",
        "url": "https://www.reddit.com/r/GradSchool/comments/113uffu/does_anyone_else_feel_like_a_masters_degree_isnt/",
        "text": "I work in the public sector now but it’s with a job I’m overqualified for, and yet HR says I’m under filling. I’ve been applying to other jobs, both private and public, with no luck. \n\nI feel like I wasted time and money obtaining a degree from a great college that taught me such valuable knowledge and skills, but employers seem to only care if you have basic work experience filing paperwork. \n\nWhat has your experience been?",
        "created_utc": 1676564474,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need Advice: MSF vs MFE vs MSQF",
        "author": "brownassbitch666",
        "url": "https://www.reddit.com/r/GradSchool/comments/113u6rm/need_advice_msf_vs_mfe_vs_msqf/",
        "text": "I did my undergrad in math, computer science, and statistics, and am now working in electronic trading at a large firm. I've applied to a number of grad school programs, and am now having some tough decisions to face as I've gotten some admissions and now (gratefully) have choices!\n\nHow did you guys choose the program you're in now? I applied to a lot of FinMath / quant finance / pure finance programs, and I'm not sure which would be the right fit for me. Right now, I believe that I want to become a quant developer and eventually leverage a leadership level position at a small firm, but I want to go into a program that's best suited for this career path. I know that a lot of ppl opt for these MSQF/MFE programs for this route, but I've found that some pure finance programs (ex. Georgetown MSF) have a lot of research and growth opportunities that I find to be important in a master's program. How do I make my final decision?",
        "created_utc": 1676563848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do PhD students usually go back home for summer break?",
        "author": "mathememer",
        "url": "https://www.reddit.com/r/GradSchool/comments/113u6rd/do_phd_students_usually_go_back_home_for_summer/",
        "text": "I am currently applying to PhD programs in computational/applied math and just wanted to know how common it is for PhD students to take their summer/winter break to be with family. I know that students are expected to continue working on their research but is it common for people to take summers/winters off? I'm only asking because I an am international student and staying away from family for 4-5 years is kind of a bummer (to put it mildly)",
        "created_utc": 1676563848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Academic sabotage",
        "author": "Tania24k",
        "url": "https://www.reddit.com/r/GradSchool/comments/113u2ly/academic_sabotage/",
        "text": "[removed]",
        "created_utc": 1676563549,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is anyone doing a PhD just for the love of the game?",
        "author": "UnethicalCannibalism",
        "url": "https://www.reddit.com/r/GradSchool/comments/113s8st/is_anyone_doing_a_phd_just_for_the_love_of_the/",
        "text": "[removed]",
        "created_utc": 1676558714,
        "upvote_ratio": 1.0
    },
    {
        "title": "How early should I plan/start my thesis in a Master's program?",
        "author": "ZidaneOnTheBall",
        "url": "https://www.reddit.com/r/GradSchool/comments/113ri15/how_early_should_i_planstart_my_thesis_in_a/",
        "text": "Hey, I'm enrolling in a 1-year Master's program this fall, and I'm supposed to write a thesis at the end of the program. \n\nWhen should I start planning what my thesis would be about or how long before should I start writing? I've never written a thesis before and have no idea how it works.",
        "created_utc": 1676556640,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your writing or productivity snacks and drinks?",
        "author": "BugungeonMantis",
        "url": "https://www.reddit.com/r/GradSchool/comments/113rf4b/what_are_your_writing_or_productivity_snacks_and/",
        "text": "I’m currently in the writing phase of my PhD, sitting in front of a computer for too many hours a day constantly snacking and drinking coffee/tea. \n\nMy go to snacks have been jerky, hummus, oranges, pretzels and cheese. I’m curious to know how everyone else is sustaining themselves during these intense writing and analysis sessions.",
        "created_utc": 1676556410,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with shame?",
        "author": "peeyaluntt",
        "url": "https://www.reddit.com/r/GradSchool/comments/113pwil/how_to_deal_with_shame/",
        "text": "I (27F) tried too hard during my studies and ended with a burnout and a breakup. This led to decision and analysis paralysis, ending me getting caught up inside my head and wasting time (~2 years) going around in circles and gaining very few skills.I have a Master's degree in AI ( without any relevant work experience and the experience was just shitty cause of certain decisions I made) The shame is holding me back from talking to people, cause I think people can see that I am broken and I am ashamed of myself. I need to get over this to move on. I need to go back to being myself. I will start therapy at some point when I have the finance,  but for now, people of reddit... please help me through this.\n\nI had a good opportunity to make something of my life and wasted due to my own poor decisions and lack of perspective. I didn't know what to do. I tried too hard. I have told myself that I have forgiven me, but it doesn't change anything. I don't want my future decisions to be badly influenced due to shame and I'll feelings .\n\nThis is coming up especially in the context of applying for PhD positions, I am afraid to reach out to professors and kind of accept that I am not gonna do anything nice with my life.",
        "created_utc": 1676551899,
        "upvote_ratio": 1.0
    },
    {
        "title": "Creative “essay” idea?",
        "author": "virgoaliensuperstar",
        "url": "https://www.reddit.com/r/GradSchool/comments/113oa17/creative_essay_idea/",
        "text": "Hi all. I’m a postgrad, doing my degree in Art Curation and Museology. \n\nFor one of my classes, I have to do a 5 minute presentation and a 1500w “text response”. My tutor left an example of a HD (or, A+) previous students work. In her text response, her work was basically a creative response written as a recipe, including the method, options etc. it was really enjoyable! My tutor in our class also said another student did a IKEA-type style essay, with instructions as the text. \n\nI’m much more used to writing more formally, being from a BA undergrad. This is probably the root I’ll go, but I guess I’m wondering; what’s a creative way I could write my “text response” that’s out of the box, but doesn’t directly copy the recipe idea?",
        "created_utc": 1676546315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ms MIS at University at Buffalo",
        "author": "Depenti",
        "url": "https://www.reddit.com/r/GradSchool/comments/113n7sn/ms_mis_at_university_at_buffalo/",
        "text": "[removed]",
        "created_utc": 1676542064,
        "upvote_ratio": 1.0
    },
    {
        "title": "Needed advice on pursuing a Masters in CS whilst having a non CS degree.",
        "author": "Seddenter",
        "url": "https://www.reddit.com/r/GradSchool/comments/113m0yz/needed_advice_on_pursuing_a_masters_in_cs_whilst/",
        "text": "Hey! I am a Materials Engineer and I loved doing programming! During my degree I had 3 programming courses and did Matlab (No data structures and algorithms tho).\n\n I wanted to get into a grad school in US or Canada to further study programming. I have been working as a software engineer for almost an year, but I noticed, whilst US schools requirements are clear but Canadian schools just mention relevant degree. Would a Materials engineering be considered a relevant degree? Also, there is a program in university of Waterloo of Electrical and computer engineering in nanotechnology which I am interested to pursue because it would be combination of my current degree and computer science but again they state relevant degree is required.\n\nBut the thing is, should I pursue a degree or should I just learn online? I would love to in the end get highly adept in computational materials, especially using AI technology in material science to accelerate development of novel materials. Should I instead find a specific program of computational materials science instead?",
        "created_utc": 1676537140,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you fail a master thesis if you realise your research methodology is incorrect?",
        "author": "ssg_partners",
        "url": "https://www.reddit.com/r/GradSchool/comments/113kgt9/can_you_fail_a_master_thesis_if_you_realise_your/",
        "text": "If i mention the errors in my qualitative research methodology in the limitations section of the thesis, do you think the committee may still mark it as a failure?\n\nI'm in Germany and I've heard a couple of people failing their master thesis. So, it is not unheard of.\n\nMy supervisor is also the head of the entire study program. He is quite unavailable. I already signed a paper that makes me submit the thesis in 4 weeks or i would fail. So i do not have the time to do focus groups or interviews again (it's also hard to convince participants to do the interview again).\n\nJust to clarify: i haven't yet realised that my methodology was incorrect. Due to time practicalities, i started doing interviews much earlier and only now i started reading papers on the best way to conduct qualitative research. As i read more and more, i am more fearful that i will read something that will make me realize that i made a huge mistake in my interviews and i will have no options to correct it\n\n\nI have yet to do the coding and the analysis, and i can easily re-do these because it's completely in my control. Conducting another set of interviews? Not possible at all in the time given.",
        "created_utc": 1676530830,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I change my referee is they are also the PI of the project?",
        "author": "watermelonsugar96",
        "url": "https://www.reddit.com/r/GradSchool/comments/113jnwv/should_i_change_my_referee_is_they_are_also_the/",
        "text": "So I am applying for a PhD position in my department under a PI who also happens to be one of the referees mentioned in my CV. I had previously asked her if I could put her name down as a referee for PhD applications since she is very well known in the field I am applying in and I had only plans to apply outside my current university. However, a vacant position for a doctoral student has opened up at my current university with her as the PI of the project. How do I go about this? Do I leave her name in or ask someone else to be a referee for me for this application? The application requires 3 referees (she is one of the 3).",
        "created_utc": 1676527797,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to do while getting a masters in order to stand out for PhD applications",
        "author": "Redhead3658",
        "url": "https://www.reddit.com/r/GradSchool/comments/113igo1/what_to_do_while_getting_a_masters_in_order_to/",
        "text": "[removed]",
        "created_utc": 1676523565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Picking a School",
        "author": "rabij76",
        "url": "https://www.reddit.com/r/GradSchool/comments/113i10i/picking_a_school/",
        "text": "[removed]",
        "created_utc": 1676522033,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rochester or Pittsburgh??",
        "author": "rabij76",
        "url": "https://www.reddit.com/r/GradSchool/comments/113i0dg/rochester_or_pittsburgh/",
        "text": "[removed]",
        "created_utc": 1676521972,
        "upvote_ratio": 1.0
    },
    {
        "title": "PhD in computer vision at UCF",
        "author": "Sensitive_Ad6104",
        "url": "https://www.reddit.com/r/GradSchool/comments/113h7gx/phd_in_computer_vision_at_ucf/",
        "text": "[removed]",
        "created_utc": 1676519358,
        "upvote_ratio": 1.0
    },
    {
        "title": "Computer Vision at UCF",
        "author": "Sensitive_Ad6104",
        "url": "https://www.reddit.com/r/GradSchool/comments/113h1bp/computer_vision_at_ucf/",
        "text": "[removed]",
        "created_utc": 1676518796,
        "upvote_ratio": 1.0
    },
    {
        "title": "Panicking about language requirement",
        "author": "Gum-on-post",
        "url": "https://www.reddit.com/r/GradSchool/comments/113gyxu/panicking_about_language_requirement/",
        "text": "I am a PhD student in my second year, quickly approaching my comprehensive exams. My program requires we have a reading understanding of two languages outside of English *if* we study non-American history. I happen to study European history, so lucky me. \n\nI met the first language requirement with German, and will be taking an exam for Russian at the end of this month. Thing is, I am totally panicking about the Russian test. I have not had time to devote myself completely to getting myself to a decent level, especially with still doing coursework. Some professors recommended I visit Russia but...well, that's not in the cards. \n\nWith this exam approaching, I am seeking any and all advice and support. When I asked my advisor what to do, he said his students usually just take care of it, but gave me a couple of textbooks to study out of. I sent an email to the person that oversees our progress to ask for clarification on expectations. My cohort and older grad students are telling me it'll be ok and I'm worrying too much...but I don't know. I feel like my whole world will crumble if I don't pass this exam.\n\nHas anyone dealt with something similar? Any tips on getting from A1/A2 to A2/B1 in 12 days 🥲?",
        "created_utc": 1676518590,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to budget for an apartment based on stipend? Need Advice",
        "author": "the_encompassing_art",
        "url": "https://www.reddit.com/r/GradSchool/comments/113gw1q/how_to_budget_for_an_apartment_based_on_stipend/",
        "text": "I recently got accepted into my top grad school program that starts in August. I am now looking at apartments based on the stipend they are giving me (currently $37,000) and realized my dream of living alone in my own apartment will be difficult. Where I plan to live, the studio and one bedroom apartments range from $1,100-$1,700. I am now debating about getting roommates again in a larger apartment, but I don't want to give up the freedom and peace of mind of living alone. I figured my options are:\n\n1) Get the studio or one bedroom apartment and take out a small loan (Pro: good for mental health; Con: expensive)\n\n2) Get the larger apartment and deal with roommates (Pro: save money; Con: potential conflicts with roommates)\n\nI would appreciate hearing people's opinions or advice especially if they had to make this same decision. Also is it normal to take out a loan for grad school? I am the first in my family to get into grad school so I have no experience in navigating this part of my life yet.",
        "created_utc": 1676518332,
        "upvote_ratio": 1.0
    },
    {
        "title": "HELP AN UNDERGAD BROTHER OUT",
        "author": "Eastern_Car8764",
        "url": "https://www.reddit.com/r/GradSchool/comments/113gi4h/help_an_undergad_brother_out/",
        "text": "I'm an undergrad student having his first official research exp. this summer. I have a bit of experinece volunteering in a lab doing basic tasks.I've done some lit. review and had some lab sessions as part of my courses that were pretty educative and technical. Overall, I know some molecular bio techniques but nothing significant. \n\nMy question : so far I am accepted into a few positions, 2 of which are very interesting to me, but I have a hard time picking one : \n\nP.I. 1 : Nice person , straightforward but seems helpful , small lab ( like 3-4 ppl ) in a hospital , works on diabetes research ( pancreatic islet cell and diabetes research in mice , molec bio approaches ). I submitted an NSERC USRA with him. In case it helps indicate smt , good amount of citations and mid amount of publicaxns. Specifics : straight up told me his lab hasn't been seeing any phenotyoes in their mice so I shouldn't expect a great amount of result by the end of summer. \n\nP.I. 2 : Nice person , very very VERY big guy in this field , super high # of citations and lotta publications , realtively large lab ( I think 10+ ppl ). I suspect had many undergrads before. does cancer-immunology research on mice models. I submitted an applicaxn thru his department and picked him as my 1st option, and I got matched. Award amount same as NSERC USRA and quite competitive selexn. Since the applicaxn' thru a whole dpt, we also get to attend weekly journal clubs , workshops and meet-ups. \n\n- I'm particularly concerned about how pI#1 told me expect no results ( which I understand but he said that very early thru the process tbh ) , and whether going w prof 2 who's got a bigger name , bigger lab, more funding, &amp; higher publicaxns would seem like a wise choice, and also the fact that the dpt in which he's located offers weekly workshop things. COMMENTS APPRECIATED !",
        "created_utc": 1676517146,
        "upvote_ratio": 1.0
    },
    {
        "title": "How important is being in a well-established PhD program for an academic career?",
        "author": "LeastPoint8643",
        "url": "https://www.reddit.com/r/GradSchool/comments/113fbrb/how_important_is_being_in_a_wellestablished_phd/",
        "text": "I'm trying to decide between Caltech chem and Uchicago molecular engineering (PME) for grad school, with the ultimate aim of going into academia. PME is relatively new (\\~10 years old) and Caltech is pretty well-established at this point. PME has very qualified profs and resources; however, my advisor and other labmates tell me that Caltech is too good to pass up — especially over a relatively obscure program like PME. Do you think that they have a point? Rather, would the name and connections implicit in Caltech's established program really be that much of a boost? \n\nI know it would ultimately be my work that sets me apart from my peers, but I know I would do good work at either place. Chicago is a vastly superior location for my spouse, so I'm also weighing whether Caltech would actually benefit my career enough to overcome the fact that I would need to learn to drive this summer and make a daily hour-and-a-half commute through LA traffic to accommodate my spouse's job lol",
        "created_utc": 1676513554,
        "upvote_ratio": 1.0
    },
    {
        "title": "PhD struggles….I should just master out, right?",
        "author": "OneExhaustedAcademic",
        "url": "https://www.reddit.com/r/GradSchool/comments/113efwc/phd_strugglesi_should_just_master_out_right/",
        "text": "[removed]",
        "created_utc": 1676510900,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many jobs do/did you have in school?",
        "author": "UltimateLastThrowAwy",
        "url": "https://www.reddit.com/r/GradSchool/comments/113e18b/how_many_jobs_dodid_you_have_in_school/",
        "text": "I'm kind of curious as I am looking for a weekend/evening job to cushion my $360 every other week stipend.\n\n[View Poll](https://www.reddit.com/poll/113e18b)",
        "created_utc": 1676509720,
        "upvote_ratio": 1.0
    },
    {
        "title": "(EU Based Master’s) Any tips on how to find thesis and internship opportunities with average grades?",
        "author": "Kahveinmyveins",
        "url": "https://www.reddit.com/r/GradSchool/comments/113bgut/eu_based_masters_any_tips_on_how_to_find_thesis/",
        "text": "I’m in engineering and unfortunately chose a program that was more difficult than expected and very disorganized. After 3 years, i almost finished my courses, but ended up with average grades in most of them. \n\nThe few professors i asked for thesis opportunities ghosted me and i feel its because of my grades. Any tips?",
        "created_utc": 1676502709,
        "upvote_ratio": 1.0
    },
    {
        "title": "any advice for pursuing a computer science doctorate?",
        "author": "Prestigious_Block_52",
        "url": "https://www.reddit.com/r/GradSchool/comments/113b1xm/any_advice_for_pursuing_a_computer_science/",
        "text": "",
        "created_utc": 1676501623,
        "upvote_ratio": 1.0
    },
    {
        "title": "Transferring from one institution to another - success stories?",
        "author": "copixsic",
        "url": "https://www.reddit.com/r/GradSchool/comments/113atl3/transferring_from_one_institution_to_another/",
        "text": "Hey everyone. I guess that I’m just looking for validation that I’m making the right decision here. \n\nIn September I started a two-year Master’s program that is just not going well in any way. I have failed most of my courses so far despite my absolute best efforts in work, study methods, reaching out to professors and attending office hours, but something just is not clicking. The program is very highly theoretical and moving at a pace that I’m not used to (i.e., it’s split into trimesters instead of the semester structure I had in undergrad), and I’m just generally having a terrible time. It also doesn’t help that it’s in a foreign country from  my own, most of my cohort is originally from the country too, and frankly they’re a bit cliquey and it gets lonely. Also, my housing situation is awful, where I’m sharing a flat with a loud and mood-swinging alcoholic and I’m at a point where I try to spend the least amount of time at home as possible.\n\nI recently applied to and got an acceptance to another program, one year this time, at a different university. The program is more applied than my current one which is pretty congruent with the work I want to do post-grad, and the COL of the city is also lower to the point that I’d be able to afford living alone. On paper, this program seems to be a much better fit for me and my interests and desires, but moving and starting from scratch again in the next few months is honestly a little bit daunting. \n\nHas anyone else gone through anything similar? How was your experience? Are you happy with your decision? I’m not a very big fan of this “what am I doing with my life?” phase I’m finding myself in and I’d love to hear from anyone who’s been in a comparable spot.\n\nApologies for the wall of text, this got a bit longer than I expected. Thanks for reading!",
        "created_utc": 1676501013,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I even want a PhD?",
        "author": "king_kingcharles",
        "url": "https://www.reddit.com/r/GradSchool/comments/1139jno/do_i_even_want_a_phd/",
        "text": "I got into a couple top schools for my PhD, but I haven't been super excited about it. I'm not totally sure it's right for me, and I've been told a lot that a PhD is only something you should do if you really want it and can't imagine doing anything else. The thing is, I can't imagine myself in any other career. I just feel lazy. How do I know what's right for me?",
        "created_utc": 1676497782,
        "upvote_ratio": 1.0
    },
    {
        "title": "Check out our cheeky field school flyers we made",
        "author": "IKnowWhereTheBonesR",
        "url": "https://www.reddit.com/r/GradSchool/comments/11398b8/check_out_our_cheeky_field_school_flyers_we_made/",
        "text": "[removed]",
        "created_utc": 1676496967,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I get my GPA up to apply for Grad School?",
        "author": "ChulainnRS",
        "url": "https://www.reddit.com/r/GradSchool/comments/1138nvq/how_can_i_get_my_gpa_up_to_apply_for_grad_school/",
        "text": "Background:\n\nIn undergrad, I was in a bad spot emotionally. My sophomore year you can see a clear dip in GPA from the previous year, caused by the only person who ever encouraged me to pursue my field dying unexpectedly. He left his computer to me, which although Kickstarted me towards a degree in comp Sci, also led me to replacing my grief with distractions like video games. Then, I got hit with Covid, which made it worse. After that, and a very bad breakup, I started to get better. \n\nThe part that matters to schools:\n\nBecause of this, I graduated with a 2.7 GPA. I know as much as my classmates do, but I just skipped homework to play games instead. I've now had a job for a year, and I've grown a lot as a person. I've decided I want to get my masters to make it up to my loved one, but I'm afraid of my GPA stopping me. \n\nI've done a little research about it, and saw that often taking classes again don't amount to much GPA change. Does anyone have any advice on this? Is it OK to apply without 3.0? And is it a good idea to re-take some classes to get that GPA?",
        "created_utc": 1676495487,
        "upvote_ratio": 1.0
    },
    {
        "title": "Q: GradSchool interview finalist",
        "author": "theicelatteguy",
        "url": "https://www.reddit.com/r/GradSchool/comments/1138dxl/q_gradschool_interview_finalist/",
        "text": "[removed]",
        "created_utc": 1676494784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Master’s students: how are you primarily funding your degrees?",
        "author": "Former-Ad2603",
        "url": "https://www.reddit.com/r/GradSchool/comments/11385rs/masters_students_how_are_you_primarily_funding/",
        "text": "If you’re funded through a combination of the below, please choose whichever one brings you the most support.\n\n[View Poll](https://www.reddit.com/poll/11385rs)",
        "created_utc": 1676494177,
        "upvote_ratio": 0.99
    },
    {
        "title": "Just master out……right?",
        "author": "OneExhaustedAcademic",
        "url": "https://www.reddit.com/r/GradSchool/comments/1136t76/just_master_outright/",
        "text": "[removed]",
        "created_utc": 1676490666,
        "upvote_ratio": 1.0
    },
    {
        "title": "Working full time?",
        "author": "jackiieingle",
        "url": "https://www.reddit.com/r/GradSchool/comments/1135x0n/working_full_time/",
        "text": "I am in my second semester (out of 3 years) of my msw. I did fine my first semester and didn’t feel too overwhelmed, but I was working ~23 hours a week. I am struggling financially and have been considering going back to work full time, at least until I start my practicum next winter. Has anyone here worked full time and was able to be successful in school as well? \n\n(For non U.S. folks, full time is +40 hours a week)",
        "created_utc": 1676488311,
        "upvote_ratio": 1.0
    },
    {
        "title": "not trying to be dramatic, but long COVID is ruining my grad experience :)",
        "author": "cutefroginboots",
        "url": "https://www.reddit.com/r/GradSchool/comments/1135ubp/not_trying_to_be_dramatic_but_long_covid_is/",
        "text": "Since I got the covie (even after being vaccinated and boosted), my brain fog has persisted and continues to make grad school more difficult than normal. I have my candidacy exams coming up in the summer, but I honestly feel like I should just master out at this point. My memory is so bad now that I can barely remember main points of papers that I read even the day before, I forget words and thoughts mid-sentence, and I literally forgot an alternative hypothesis for one of my proposed aims when being asked about it recently. Like, it’s big stuff. \n\nI truly don’t think my department understands either. My brain just doesn’t work like it used to (for reference I got COVID almost a year ago now). When I forget things, my advisors and other faculty will dismiss it and tell me “oh that just happens with age!”. I feel like I’d be putting myself out of this misery by mastering out and avoiding oral exams (even though I’d still have a tough time with a written exam, I think I’d perform better than with oral). I guess I’m just here to vent, but also wondering if anyone has had a similar experience.",
        "created_utc": 1676488108,
        "upvote_ratio": 1.0
    },
    {
        "title": "US master's programs without GRE",
        "author": "rainbow_reddit_",
        "url": "https://www.reddit.com/r/GradSchool/comments/11354of/us_masters_programs_without_gre/",
        "text": "Hi, everyone. I am in my second year of college now in the Netherlands, studying sociology (graduating next year), so I am thinking a bit more seriously about my future. I am also thinking of applying to grad schools in sociology in the US. On websites of many universities, it says GRE is optional. I am not thinking of taking GRE and it is not like I really want to study in the US, but the US is just one of my options. Has anyone applied without submitting the GRE score and got accepted? I will give it a try as long as I am eligible to apply, but I am curious if not submitting GRE will affect the admission decision negatively. \n\nThank you,",
        "created_utc": 1676486284,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does an American fund an overseas postgrad with FAFSA still down?",
        "author": "Qahetroe",
        "url": "https://www.reddit.com/r/GradSchool/comments/1134t63/how_does_an_american_fund_an_overseas_postgrad/",
        "text": "Hey everyone,\nI’ve been saving for my postgrad since the pandemic started, and I have a lot of what my costs will be, but I still need about half the total cost of tuition + maintenance. \n\nI’ve been trying to start a FAFSA (update mine from last year), but with the Congress gridlocked on this debt cancellation issue, they’re not accepting any aid renewals or applications. Any advice?",
        "created_utc": 1676485480,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice for choosing advisor.",
        "author": "LegalPerspective8618",
        "url": "/r/PhD/comments/113366k/need_advice_for_choosing_advisor/",
        "text": "",
        "created_utc": 1676484075,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice for choosing advisor.",
        "author": "LegalPerspective8618",
        "url": "https://www.reddit.com/r/GradSchool/comments/11347hy/need_advice_for_choosing_advisor/",
        "text": "[removed]",
        "created_utc": 1676483984,
        "upvote_ratio": 1.0
    },
    {
        "title": "FAFSA processed in early January, adding schools now",
        "author": "Misssmaya",
        "url": "https://www.reddit.com/r/GradSchool/comments/1133rhx/fafsa_processed_in_early_january_adding_schools/",
        "text": "I submitted my FAFSA in early January. I thought that I had included all the schools I am applying to, but I didn't (don't ask how). I realized this today, and immediately added the schools. \n\nWould this affect my potential financial aid package? My FAFSA was already completed before all my deadlines, but now I added schools two weeks after some of the deadlines. Thanks!",
        "created_utc": 1676482817,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can a PI extort you?",
        "author": "dankyverno",
        "url": "https://www.reddit.com/r/GradSchool/comments/1133moi/can_a_pi_extort_you/",
        "text": "I've posted here about this PI before, so look there for context. Short version: because other people in my lab have done virtually nothing to help me with this labor intensive developmental project, I had to shell out an extra 1k to register for this semester to finish my thesis. \n\nToday, I met with my PI to discuss the thesis, which I thought was coming to a close. Toward the end of the meeting, he asked me to start collecting data again so that we can publish. I told him that I'm not interested in doing that, because I want to concentrated on defending my thesis and getting my degree. He said something like, \"Well, the babies will age out if you wait any longer. It shouldn't take you that long to add the data.\" This pissed me off because he has no clue how long it takes to find parents, schedule appointments, run the study, code the data, compile the data, clean the data, and analyze it. I told him that I was hesitant to collect again after last summer when I spent my own time and money driving back and forth 6 hours to collect 85% of my sample in my hometown with no help from the lab. He said \"This isn't just a homework assignment. This is a job. If I don't get a publication out of this, I'm not interested in the project at all.\" I asked, \"Do you mean you wouldn't sign off on my thesis?\" and he said yes. Has anybody else dealt with something like this? Like, is this legal???",
        "created_utc": 1676482484,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice: Cohort member fell in love with me, rejected and now shaming me to all members of department two years later",
        "author": "lurkergroove2",
        "url": "https://www.reddit.com/r/GradSchool/comments/1133kec/need_advice_cohort_member_fell_in_love_with_me/",
        "text": "This is such a complicated situation and I need advice.\n\nMy cohort member and I were friends throughout our program. He fell madly in love with me, crossed many boundaries and also (to oversimplify) trauma-dumped on me constantly to the point where it was seriously affecting my mental health. Seriously, it was bad. And I don't want to get into the details he is unfortunately dealing with serious mental illness and needs help. Needless to say I ended the friednship immediately when he confessed his very strong feelings for me. Best decision I've ever made. And I've moved on and my mental health has gotten so much better.\n\nNow, about one and a half years later (!!), I find out that he's going around the entire department talking about me to others frequently. Some people who are even overhearing conversations about what happened between us and talking about it. And somehow the general consensus among the men is that I am ``overreacting\". I won't even go there, but I want to nip this in the bud. What can I do? I feel extremely uncomfortable around the department and especially around my cohort member (his talking about me almost two years later) makes me feel very unsafe. I do not feel safe with this person being, as I suppose, so obsessed to the point of still talking about me to others frequently two years later. Any advice? What are my options? This is clearly crossing the line and affecting my experiences in the department.",
        "created_utc": 1676482359,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adobe Digital Editions",
        "author": "whyw",
        "url": "https://www.reddit.com/r/GradSchool/comments/11338uu/adobe_digital_editions/",
        "text": "I swear to god, it will be the death of me. \n\nThere has to be a better way. In fact--there is. LET US DOWNLOAD PDFS.  \n\nEvery couple months or years it just stops opening. I uninstalled it and reinstalled it today--same problem. Just will not open. Sits there on my taskbar looking like it is doing its job, but it won't do a damn thing. WORTHLESS.",
        "created_utc": 1676481772,
        "upvote_ratio": 1.0
    },
    {
        "title": "MSt classics Oxford vs MLit St Andrews",
        "author": "Bunkydog",
        "url": "https://www.reddit.com/r/GradSchool/comments/11328ig/mst_classics_oxford_vs_mlit_st_andrews/",
        "text": "Anyone familiar with these 2 programs and how they compare?",
        "created_utc": 1676479240,
        "upvote_ratio": 1.0
    },
    {
        "title": "Columbia law professor says \"f**k you\" to international students asking for slowing down lecture speed",
        "author": "jhwyz",
        "url": "https://www.theinternationallawyer.org/columbia-law-professors-f-k-you-to-international-student/",
        "text": "",
        "created_utc": 1676478737,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it inappropriate to ask a department contact for their admission statistics when inquiring about a program?",
        "author": "cuntextualize",
        "url": "https://www.reddit.com/r/GradSchool/comments/1131y2t/is_it_inappropriate_to_ask_a_department_contact/",
        "text": "",
        "created_utc": 1676478498,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conflicted",
        "author": "Oh585",
        "url": "https://www.reddit.com/r/GradSchool/comments/1131oaq/conflicted/",
        "text": "[removed]",
        "created_utc": 1676477774,
        "upvote_ratio": 1.0
    },
    {
        "title": "conference accessibility?",
        "author": "newusername118",
        "url": "https://www.reddit.com/r/GradSchool/comments/1130wr2/conference_accessibility/",
        "text": "I'm sorry if this is a silly question, but I'm going to my first conferences this semester and I'm not sure how to talk to them about accessibility. I'm a wheelchair user and I know I at least need to mention it but I don't know who I would talk to or what I would need to ask for. Does anyone have experience with this?",
        "created_utc": 1676475734,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you fill out FAFSA forms without committing to a school?",
        "author": "Visible_Manner9447",
        "url": "https://www.reddit.com/r/GradSchool/comments/11306iy/can_you_fill_out_fafsa_forms_without_committing/",
        "text": "Hey y’all, I need some advice.\nI applied to a bunch of grad programs this year. All you gotta know is I work in the arts. I’m still waiting to hear from several places, but I’ve already been accepted to a couple schools. However, these schools don’t seem to offer a ton in the way of financial aid. They all say scholarship money is available but that it doesn’t typically cover all the costs. Money is a huge obstacle for me in going back to school (especially because I work in the arts) I cannot remember from my undergrad days, but if I fill out Fafsa stuff and submit it, can I figure out how much aid I’ll get from a school and/or the government without committing to that school? \nThanks in advance!",
        "created_utc": 1676473775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Our department refuses to state what is our budget for training/research expenses",
        "author": "Massive_Echidna",
        "url": "https://www.reddit.com/r/GradSchool/comments/112znmo/our_department_refuses_to_state_what_is_our/",
        "text": "I am a PhD in a European university. Our department is quite small and PhDs are funded from different sources (department, university or government), but the department has always made it a point to give equal treatment to all of us, e.g. if a scholarship is less than the agreed department stipend they will match it. This stipend is clearly stated in the research agreement we sign. \n\nThe same goes in theory for training, conferences and other research expenses. We have always been told that every PhD is given the same opportunities regardless of their project or the nature of their funding. However, no number has ever been stated or written down. We essentially do not know how much money we have every year to attend conferences, trainings, get reimbursed if we have to travel for fieldwork, etc, we just ask and wait for approval. Obviously we talk to each other and we know how much everyone has spent every year with department approval.\n\nRight now I am having difficulties getting approval for a training I want to attend, because I have already been reimbursed for research-related expenses earlier this year. My supervisors are lobbying in my favor but the department says more funding would be an exception, as the total for this year would be close to 2000€. I know for sure other PhDs have been reimbursed more than 2000€/year over the past few years, regardless of their source of funding (all the money from other sources goes through the department anyway, we do not manage our own scholarships). \n\nWhat’s the best way for us to go about this? We would like more clarity about how much money is actually available to us, if it changes based on your source of funding, etc. Our head of department has also said several times that the department has loads of money this year, so it’s hard to understand why none of that is available to us. Any advice appreciated. Thank you!",
        "created_utc": 1676472365,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choosing a lower ranked program near fiancé?",
        "author": "bloodmist22300",
        "url": "https://www.reddit.com/r/GradSchool/comments/112zm9j/choosing_a_lower_ranked_program_near_fiancé/",
        "text": "I have received an offer from a program that ranks around 20th in electrical engineering in the US. I am also waiting on offers from some even higher-ranked institutes (MIT being one of them). Would it make sense to forgo any other higher-ranked school to stay near my fiancé  (who herself is a grad-student)? \n\n\\*Of course, this dilemma is contingent on whether I even get these offers, but please treat it as hypothetical.",
        "created_utc": 1676472264,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with letter of intent: intimidated by it and don't know where to start",
        "author": "miichan4594",
        "url": "https://www.reddit.com/r/GradSchool/comments/112ye9r/help_with_letter_of_intent_intimidated_by_it_and/",
        "text": "Hi everyone, I hope to apply to the University of South Florida's Master's program for Applied Linguistics. I am a 29-year-old African American woman and fear I do not have the lived experiences to help me. My Bachelor's degree was in English and I minored in East Asian studies. I have been passionate about English and language for nearly my entire life, and even my current job is as a Captionist for the Deaf and hard-of-hearing communities. I am currently teaching myself Korean and Japanese and have lived in Japan for a time. My mother is a self-taught linguist, fluent in French and Spanish. My paternal grandmother received a doctorate in Education with a focus on Urban Education and Development from Temple University in 1988. \n\nI will be a first-generation graduate and I am also worried about the GPA requirement, the minimum for admission is a 3.0, but because of being chronically ill and 2 major surgeries I had during the last 2 years of my Bachelor's degree, and the loss of my youngest sister and grandmother within 3 months of each other, I did my best but I missed the mark. Do I have any hope of being admitted?   \n\nThanks for looking at my post.",
        "created_utc": 1676468905,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advisor doesn't fully read my thesis drafts, is this normal?",
        "author": "Timber-TrussBridge",
        "url": "https://www.reddit.com/r/GradSchool/comments/112wa9f/advisor_doesnt_fully_read_my_thesis_drafts_is/",
        "text": "I'm working on my thesis (lit review part currently) and my advisor has been very slow to give feedback (like a month after i asked). We met to go over my thesis and she said she didn't even finish reading it because she thought it was under-cited. I'm not upset by the criticism that it's under-cited but I kind of feel bothered that she didnt even finish reading it, especially because the important parts most related to my results are at the end. If anything, I would rather have had feedback on those parts since they're more integral. Is this normal for advisors? I feel like this has happened multiple times now. My draft wasn't even overly long either, it's like 20 pages double spaced, so I feel like she could have read it even if she didnt want to leave feedback.",
        "created_utc": 1676462009,
        "upvote_ratio": 1.0
    },
    {
        "title": "Master in Electrical Engineering",
        "author": "Fun-Consequence-5844",
        "url": "https://www.reddit.com/r/GradSchool/comments/112u96f/master_in_electrical_engineering/",
        "text": "[removed]",
        "created_utc": 1676454056,
        "upvote_ratio": 1.0
    },
    {
        "title": "University of Edinburgh(UOE) vs Imperial College London(ICL) for Masters",
        "author": "Fun-Consequence-5844",
        "url": "https://www.reddit.com/r/GradSchool/comments/112u5vs/university_of_edinburghuoe_vs_imperial_college/",
        "text": "[removed]",
        "created_utc": 1676453682,
        "upvote_ratio": 1.0
    }
]