[
    {
        "title": "Advice for how to word resume and cover letter when applying to lower skilled jobs?",
        "author": "coffeeotter1353",
        "url": "https://www.reddit.com/r/GradSchool/comments/109ab3u/advice_for_how_to_word_resume_and_cover_letter/",
        "text": "I just quit my PhD in STEM (omg so happy!) and am currently living off savings which can comfortably last me a while. But of course I'm also looking at jobs. Right now I honestly would be pretty happy to do low-skilled jobs, like dishwashing or data entry. Does anyone have advice on how to not scare off employers by having a master's and mostly research experience?\n\nI'm also considering lab tech jobs and if anyone has advice on that I'd appreciate it too. Routine and repetitive hands-on bench work/fabrication was always my favourite part of research, and I'd like to communicate that without making employers think I'll jump ship when a research or leadership based role comes up.",
        "created_utc": 1673457947,
        "upvote_ratio": 1.0
    },
    {
        "title": "Non-STEM PhD students, where do you look for external research grants and/or internships?",
        "author": "linopedro",
        "url": "https://www.reddit.com/r/GradSchool/comments/1099cff/nonstem_phd_students_where_do_you_look_for/",
        "text": "Title. Life’s just harder out of stem.\n\nThanks!",
        "created_utc": 1673455680,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mid-Life Grad School and...Mixed Feelings",
        "author": "RedditSkippy",
        "url": "https://www.reddit.com/r/GradSchool/comments/1098pba/midlife_grad_school_andmixed_feelings/",
        "text": "First post here.  I'm about halfway through a one-year MS program in my current field.  Basically, I'm topping up my BS degree so that I'll be able to move up in my field.\n\nIt was always my intention to go back to school, but between debt for my first degree, and then life, it didn't happen until now.  I'll be 48 next month.  This is an incredible opportunity for me, basically my work is giving me a leave of absence to do the degree, and since the leave is part paid, the salary covers my tuition.  My husband and I sublet our home in a very high CoL area, and that covers our living expenses here.  So, the trade off for waiting 25+ years to return to school is that I'm covered financially, and that is huge.\n\nThat said, ugh.  I'm not sure I'm enjoying this experience as much as I hoped that I would.  I feel like I can't really relax into it.  Maybe that's IS, which I know is a banned topic here.  Part of the problem is that I don't really have a support system in the program.  My program is tiny, and my advisor is almost non-existent on campus (such a disappointment given that my undergrad advisor was a real powerhouse in the field and was a real mentor to me.)  I don't have a ton in common with my classmates, who are all lovely but at least 20 years younger than me.  They're going to school and working and doing the 10,000 other things that you do when you're 24-25 years old.  They don't have time to make a connection with an old gal.\n\nIf you've read this far, are there any mid-lifers on this sub in the same boat?  I guess it would feel better to know that I'm alone like this.",
        "created_utc": 1673454096,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scholarships/Awards",
        "author": "UleeBunny",
        "url": "https://www.reddit.com/r/GradSchool/comments/1097ou6/scholarshipsawards/",
        "text": "If you get a scholarship or award as a grad student are you supposed to use the money to pay for the experiments that you do (e.g. buy reagents and supplies)? I was hoping, if I got one, I could use it to supplement my stipend (I just had to pay for car repairs that cost the equivalent of over 3 months rent). \n\nI am writing a cover letter for an application, where I wrote that I was applying for the award “to support my studies”. My advisor , who just reviewed my cover letter asked me how I am going to use it “in support of research activities”. I’m not sure if he is indicating I should be writing a section on the research project budget and how I will be helping to pay the bills or something else. I wrote back “To pay my rent and grocery bills so I can focus on my research while not being homeless and malnourished :)”.",
        "created_utc": 1673451606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else especially enjoys the \"performance\" of teaching/lecturing?",
        "author": "The-Motherfucker",
        "url": "https://www.reddit.com/r/GradSchool/comments/1097byg/anyone_else_especially_enjoys_the_performance_of/",
        "text": "Im an instructor in an undergrad lab.\nThe lab always starts with me talking about the theory, presenting the models, give instructions and answer some questions.\n\nThis is the best part of my TA experience, standing in front of a crowd, talking, examining the audience, checking for their reactions, interacting with them.\nThe subject of the labs I teach don't change, and I feel like im putting up a show for them since the structure and contents of my little lecture is the same from week to week.\n\nIm not really adept in pedagogy so i mostly riff it out and improvise, and improve by their reactions.\n\nanyone else feel the same?",
        "created_utc": 1673450687,
        "upvote_ratio": 1.0
    },
    {
        "title": "hi",
        "author": "Character-Photo898",
        "url": "https://www.reddit.com/r/GradSchool/comments/10973zy/hi/",
        "text": "[removed]",
        "created_utc": 1673450118,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it even worth starting to study a course when the exam is tomorrow?",
        "author": "MastersBreakdown",
        "url": "https://www.reddit.com/r/GradSchool/comments/10972mq/is_it_even_worth_starting_to_study_a_course_when/",
        "text": "[removed]",
        "created_utc": 1673450023,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I do my master's in data science from Ireland or Scotland?",
        "author": "plantsbad",
        "url": "https://www.reddit.com/r/GradSchool/comments/1096pvl/should_i_do_my_masters_in_data_science_from/",
        "text": "[removed]",
        "created_utc": 1673449140,
        "upvote_ratio": 1.0
    },
    {
        "title": "Microbiology/Immunology",
        "author": "mxjuno",
        "url": "https://www.reddit.com/r/GradSchool/comments/10965d8/microbiologyimmunology/",
        "text": "Hi, just kind of bopping around ideas here. I am mid-career with young kids at home and have a MSN (general Master's of Nursing- I am an RN, not an NP), and work per diem jobs around my family's schedule. I'm intellectually bored and slightly resentful of not logistically being able to work very much right now but I feel very stuck when it comes to any kind of work that can't be shaped around everyone else's schedule, at least for the next several years. When I was getting my MSN I could be off when my kids were off and could do workarounds like listen to lectures while doing chores or exercising and it ended up working fine.\n\nI got excited about microbiology and immunology when I was doing my prerequisites and just started on a Coursera series from Rice, which is undergrad level. I think this is so fascinating and I'm loving engaging with science again. There are a few schools that offer a MS in micro/immunology online, which would fit with my life right now. An advanced degree may help a little in my career but not much. There are research nursing positions and there's definitely a place for nurse scientists, and I love the idea of translational science and the application of evidence based practice in such a practical field. There's also teaching. But my MSN already makes me qualified for a lot of this work and another advanced degree wouldn't add a whole lot.\n\nBecause of this it's honestly not completely worth the effort for career outcomes alone, and if I do go for another advanced degree it would have to be driven by personal interest as much as anything. I know several people at this point who have PhDs in fields as diverse as physics, economics and creative writing and all of them at some point expressed regret at the amount of time, money and effort that went into it compared to the diminishing returns professionally. I could justify a second master's in microbiology for personal edification but I have talked to scientists who said this isn't a useful degree, like it only qualifies you to be a lab manager. I wouldn't mind slowly chipping away at a PhD, even if it takes me the maximum amount of time allowed.\n\nAm I way off in even considering this? Does anyone know much about this, like if I start on one of the non-thesis online MS in micro/immunology degrees can I use the coursework to move into a PhD program at my own pace? \n\nI feel a little nuts even considering this, but nursing work and raising young kids is challenging me in all the most annoying ways and I really love science. Thanks in advance.",
        "created_utc": 1673447592,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quitting as a 5 year PhD",
        "author": "bogushoagie",
        "url": "https://www.reddit.com/r/GradSchool/comments/10964vv/quitting_as_a_5_year_phd/",
        "text": "I want to quit my PhD (STEM bioscience). It's too late for me to masters out (guidebook says that should be done before the 5th year) and I still have 2 years left at a minimum. No first author publications, and the project I am working on is dead in the water, but my advisor is having me continue to get something publishable out of it.  I still have 2 other projects I need to start and publish. \n\nI can't imagine doing this for another day, let alone 2+ more years. I am funded by a NIH fellowship so I feel stuck. I am not a good fit for a PhD and don't want to enter a career where I use this degree. I don't know what career I want at this point and I've been thinking about it for months. I really regret doing this degree but especially joining this lab. I see my cohort members graduating and doing significantly less work. I am envious and wish I could switch labs at a minimum. \n\nWould it be bad to quit this far in? I have so much time left and I am so unhappy, but not qualified to do anything else (my research skills are way too niche).  Are there viable options?",
        "created_utc": 1673447554,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about transcripts",
        "author": "arimgeo17",
        "url": "https://www.reddit.com/r/GradSchool/comments/1095xh5/question_about_transcripts/",
        "text": "Hello. I'm applying to master of landscape architecture programs right now and all of them ask for unofficial transcripts. \n\nI noticed that on my transcripts, my final semester grades are marked \"Mandatory Credit Non\" or \"MCRD\"  by my college because that was the semester when COVID hit. This means that that semester all our courses were made pass/fail instead of having letter grades. I passed all of my courses, so they're marked MCR, but for two I got MCRD, which means 'Mandatory Credit Non with Distinction\" which basically means that my professors thought I did well. However, there isn't a legend that specifies the \"With Distinction\" Part on the transcript pdf. \n\nMy question is, is it worth maybe editing the transcript to show what the MCRD means? Or trying to mention elsewhere in the application what this means? Although there are not many places to do that (most just ask for the transcript pdf and nothing else). Should I assume that the admissions committee would look into what the \"MCRD\" means themselves? Any other advice would be appreciated!",
        "created_utc": 1673447012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ask for some advice on reapplying for a PhD",
        "author": "AdministrativeNet664",
        "url": "https://www.reddit.com/r/GradSchool/comments/1095mtg/ask_for_some_advice_on_reapplying_for_a_phd/",
        "text": "[removed]",
        "created_utc": 1673446230,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ask for some advice on reapplying for a PhD",
        "author": "AdministrativeNet664",
        "url": "https://www.reddit.com/r/GradSchool/comments/1095lu0/ask_for_some_advice_on_reapplying_for_a_phd/",
        "text": "[removed]",
        "created_utc": 1673446161,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best way to weave one's way out of grad school in the US after 2nd year Ph.D?",
        "author": "mabhudhi",
        "url": "https://www.reddit.com/r/GradSchool/comments/1093ptw/what_is_the_best_way_to_weave_ones_way_out_of/",
        "text": "A friend came in with an MSc from outside the US and has gone through 2 years of Ph.D. study. Due to circumstances beyond their control, they can no longer proceed. Is there an official route out like master out (get a US masters and have 2 masters qualifications), or it is time to count losses and move on?",
        "created_utc": 1673440750,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Gem Fellowship work for remote masters?",
        "author": "Design-Hiro",
        "url": "https://www.reddit.com/r/GradSchool/comments/1092fo0/does_gem_fellowship_work_for_remote_masters/",
        "text": "Just curious - I am a gem fellow and I know my university doesn't take remote masters. But basically I have a few friends asking me if it does. Does anyone know?",
        "created_utc": 1673436346,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got virtual interview invite from Organic Chem, UT Southwestern...I'm Super nervous though still ve over 1 week to prepare....Any tips on expectations please!!!!!!? Also if u have interview in same school plz drop by!",
        "author": "Ok_Watercress1689",
        "url": "https://www.reddit.com/r/GradSchool/comments/1091rnk/i_got_virtual_interview_invite_from_organic_chem/",
        "text": "",
        "created_utc": 1673433840,
        "upvote_ratio": 1.0
    },
    {
        "title": "Phd supervisor Limbo",
        "author": "Vikastroy",
        "url": "https://www.reddit.com/r/GradSchool/comments/1091rmi/phd_supervisor_limbo/",
        "text": "I'm a new phd student. I had contacted a potential phd supervisor before coming to the campus via Google meet. However, later when I got a list of topics I asked the PhD supervisor to give me some time to explore other professors, which he didn't like and now after I met him again he said that I may or may not be selected under his supervision. I don't know what to do now. I want to work on his project which I deeply interested. What should I do now, I haven't met any other professor and I am panicking that I may not get a supervisor under my research interests. Will I be asked to leave the institute then ?",
        "created_utc": 1673433837,
        "upvote_ratio": 1.0
    },
    {
        "title": "Simon business school Msc Finance",
        "author": "maroon9497",
        "url": "https://www.reddit.com/r/GradSchool/comments/109126b/simon_business_school_msc_finance/",
        "text": "What is your review of the MSF program of Simon business school for a Non-American",
        "created_utc": 1673431122,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to study Economy after a life of art/advertisement/graphic design?",
        "author": "ILikeYourHairRicky",
        "url": "https://www.reddit.com/r/GradSchool/comments/1090zi1/is_it_possible_to_study_economy_after_a_life_of/",
        "text": "My aunt who is 45 years old has had a very successful career in advertisement/graphic design she had her own company and is nationally recognized for her work. However, she wants to change her career and study Economy at the University level. Basically she wants to get a real degree and good education. She’s not limited to the US so Europe and England specifically are options. Which schools offer programs or opportunities for an MA or degree in Economy? How can she go about preparing for these applications with no prior experience or education in Economy or tangential social science fields?",
        "created_utc": 1673430823,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Hamster Wheel of Doom",
        "author": "Royal_B35S_7",
        "url": "https://www.reddit.com/r/GradSchool/comments/108zih6/the_hamster_wheel_of_doom/",
        "text": "So, I'm in a graduate school for a physical science discipline and I don't have a background in that specific discipline. I have a Physics BS and it has yet to help me. I'm going to have to retake a course next semester simply because I had to learn what everyone else learned in 4 years in a couple of weeks and ofc I couldn't learn it all. On top of that,I didn't formally get a research advisor until the middle of my first semester. I also still don't have an office or funding on paper yet. I've been promised funding, but I'm still waiting for it to actually happen. Not to mention the head of the department tried to get me to do the \"non-thesis\" option from day 1 of being in the program. I feel like I'm on a hamster wheel here. I don't feel like my degree is valued in any way or that what I contribute means anything. It's hard seeing my colleagues get offices and research when it's pulling teeth for me to get the go ahead for a literature search. I'm only a first year grad student but this is already beginning to drain me. Any encouragement or words of wisdom? The imposter syndrome is kicking in HARD right now.",
        "created_utc": 1673424892,
        "upvote_ratio": 1.0
    },
    {
        "title": "suggestions?",
        "author": "strrpzz",
        "url": "https://www.reddit.com/r/GradSchool/comments/108zd9x/suggestions/",
        "text": "i need suggestions on what to do 0.0\ni’m about to graduate undergrad soon and am debating where i should apply to grad school. for starters, i am working towards gaining my PhD to become a professor. i live a couple hours away from home to attend the university that i am at now, but moving back home would present me the opportunity to apply to a different grad school, gain a certification to begin teaching sooner, and save money. although, i’ve had TA’s tell me that it’s overall easier to be accepted into grad school from the university you attended because references hold more weight, etc. not sure what the best decision here is.. any insight?",
        "created_utc": 1673424349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Working while doing an MS in molecular biology?",
        "author": "AdventurousOrb924",
        "url": "https://www.reddit.com/r/GradSchool/comments/108xjo1/working_while_doing_an_ms_in_molecular_biology/",
        "text": "I need some advice or perspective from any STEM professionals or graduate students who may have done this. I am about to graduate from undergrad in May, and have been preparing to apply for masters programs in biology for the upcoming fall.\nHowever, this evening my parents dropped a contingency on me that never before had been mentioned: if I do a masters I need to also work.\nMind you, they are not paying for the masters and do not expect me to pay them any sort of rent. So I was a bit surprised and taken aback by this sudden expectation. \nNow I feel hesitant about pursuing a masters and wonder whether I should first work and see what happens? I never worked and took classes at the same time before in college, so I don’t have the experience of juggling 2 such responsibilities at once. \nSo with all that, is it plausible for me to successfully complete a masters full time in such a subject while also working 25 hours a week? \n\nSincerely,\nStressed and uncertain 21 y.o. :/",
        "created_utc": 1673417902,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quitting/dropping out of my MFA in Creative Writing?!",
        "author": "kylabalis",
        "url": "https://www.reddit.com/r/GradSchool/comments/108vw6g/quittingdropping_out_of_my_mfa_in_creative_writing/",
        "text": "I [23F] am just starting my second quarter of an MFA Creative Writing program in poetry in the US and I'm seriously debating dropping out. \n\n(Info: I grew up in the West, moved to the East Coast as a teenager, went to undergrad out there, and returned to my home state out West for my program. I moved out alone, but my long-term boyfriend is planning to move out to join me this spring.)\n\nMy thought going into this program was that I wanted to one day be a poetry professor which I thought would be achievable with an MFA (my undergraduate creative writing professors only had MFAs). However, since beginning the program I have had a massive wakeup call and realized higher academia is dying and the chances of me getting a position as a professor are slim to none, and even if I did I'd most likely need a PhD. \n\nWhen I originally applied for MFA programs, I only looked at schools where I had a chance of getting fully funded. But I was only accepted to two programs (out of 19 applied) and was not offered funding at either. \n\nI was told there was a high chance I would be able to be funded for my second year of the program, but in December I got word that I was not granted the position that would offer that funding. \n\nSo at this point, I'm taking out massive loans to pay for school and cost of living and I don't even know what I hope to do with my life after I get my degree. \n\nOn top of it all, I have depression and anxiety, which gets worse in the winter, and since moving across the country for school (alone) I've been struggling severely.\n \nBut here's the catch: I have no idea what to do outside of this program. I'm terrified of finding a full-time job. I have no idea what career I'm even looking for, and kinda want to stay cocooned in this waiting period where I \"figure it out.\" But I'm paying way too much money to keep doing this without knowing what I want out of it. Most articles and stories/experiences I'm reading are of people who have other options if they quit grad school. I feel like I have no other options.\n\nThe only things I want to do with my life are sewing and poetry. The dream would be to start a small business selling handmade items, but that's much easier said than done. \n\nAny and all thoughts, advice, personal experiences, etc are much appreciated. I need fresh eyes on the situation. TIA!",
        "created_utc": 1673412690,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am interviewing with a university as lecturer, but some faculty of that university are friends with one person who dislikes me at my current school. Do you think this might lower my chances?",
        "author": "Impressive_Bank1253",
        "url": "https://www.reddit.com/r/GradSchool/comments/108vmx7/i_am_interviewing_with_a_university_as_lecturer/",
        "text": "[removed]",
        "created_utc": 1673411887,
        "upvote_ratio": 1.0
    },
    {
        "title": "Forced to change research projects.",
        "author": "DragonForg",
        "url": "https://www.reddit.com/r/GradSchool/comments/108vgua/forced_to_change_research_projects/",
        "text": "So, my PI decided it was time for me after one quarter to change my project to another student's project, since they will be leaving, from my pervious project which was my own. They did this since the project did not actually get anywhere within the first quarter of researching. I actually kind of agree that it most likely will not work and moving on is probably best. But it is still hard for me to just abandon all of my months long work for something else.\n\nThankfully the other project may be more successful as my PI insured, but I still feel distraught that I have to completely move focus onto something totally new. I also was really interested in some of the results of the experiments in my original project, but I also knew they wouldn't lead to any research paper\\*\n\n\\*I am a chemist, and a few experiments yielded unexpected products, that is in a complicated and inseparable mixture, it is not worthwhile since it is inseparable or at least perceived to be and is guaranteed not the ideal product. But it could have been interesting, there was potential.\n\nFinally, I also feel like I failed at succeeding even if I couldn't control the outcomes part of me feels like it could have been my fault or people may see it as my fault. Since I am the youngest in the lab, it is hard for me not to feel overshadowed by the other graduates, and having a project fail like this isn't exactly the best boost of confidence. \n\nWith that I am happy to move onto something better, but still have the looming feeling of lost potential, or FOMO. Has anyone else moved onto another project after spending hours about hours on another, and felt the same? How did it usually work out in the end? Will it also likely delay my graduation date or make it faster?",
        "created_utc": 1673411378,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts about going to the same school as undergrad for grad school?",
        "author": "AdFew4357",
        "url": "https://www.reddit.com/r/GradSchool/comments/108ud7c/thoughts_about_going_to_the_same_school_as/",
        "text": "I’ve been thinking about the whole moving out of state for grad school vs staying at my undergrad institution idea. Part of me wants to explore a new place, be in a new environment, learn from people in another department, but at the same time, I can’t help but feel kinda scared about moving away from my hometown. \n\nI do want to move out for my sake in terms of growth. My parents are roughly 25 minutes from my current undergrad institution, and while i do sometimes want to be independent and away from them, I think about how important a strong family support system could be while in grad school. With the ups and downs of a PhD program I have my friends who are still going here as well as my family and I often think about how moving away from that will just be being essentially alone. And I feel like that could negatively impact my performance to some extent. In addition, my current college is in a city, whereas other schools I’ve applied to are not necessarily in a city, and are in the middle of nowhere. \n\nI have thought about the pros and cons, but I wanted to hear your guys opinion. Does doing a phd at your same undergrad institution look bad? Especially if it’s a decently ranked program? Is it looked down upon? In my case what would you do?",
        "created_utc": 1673408166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grad school is a lonely journey.... Came across this map of \"lonely souls\"",
        "author": "jaybhum",
        "url": "https://www.reddit.com/r/GradSchool/comments/108u5r8/grad_school_is_a_lonely_journey_came_across_this/",
        "text": "[removed]",
        "created_utc": 1673407585,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grad school is a very lonely journey. I wonder if these are grad students",
        "author": "jaybhum",
        "url": "https://www.reddit.com/r/GradSchool/comments/108u489/grad_school_is_a_very_lonely_journey_i_wonder_if/",
        "text": "[removed]",
        "created_utc": 1673407461,
        "upvote_ratio": 1.0
    },
    {
        "title": "MA reading list length for humanities (german)",
        "author": "thedeutschealex",
        "url": "https://www.reddit.com/r/GradSchool/comments/108to0g/ma_reading_list_length_for_humanities_german/",
        "text": "Hey! I am starting my MA reading list to give to a professor. I cannot remember the length but I want to guess around 20 articles and maybe 3 books? Could anyone in the humanities or even same study corroborate this?",
        "created_utc": 1673406159,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weekly rhythms",
        "author": "BespectacledSci",
        "url": "https://www.reddit.com/r/GradSchool/comments/108tmfc/weekly_rhythms/",
        "text": "I was recently making my plan for this semester, so I spent some time reflecting on my previous semesters. One of the things I concluded was that I feel much more successful when I plan out my week, and when I have weekly rhythms.\n\nThis is what I’m thinking for my weekly rhythm this semester:\n\n-\tPlan my week on Sunday night.\n-\tSpend some time on Monday morning turning my data from the previous week into figures or slides to show my supervisor in our weekly meeting.\n-\tOne-on-one meeting with my supervisor on Tuesdays. Discuss previous results and this week’s plans.\n-\tSet aside a couple of hours at the end of the day Friday to wind down: clean up lab area, make note of consumables that I will need to remake the next week (like media or plates), collect all my data files from any instrument computers, go through my data and analysis and jot down anything that needs to be repeated or prioritized next week, water my office plants, and clear off my desk.\n\nDoes anyone incorporate something similar, where certain times each week are devoted to planning or analysis? What is your rhythm?  \nI would also love to hear how people fit in literature reading. Do you have a weekly time set aside for that, or do you wait until you’ve accumulated a certain number of papers and then step away completely to do a deep dive?",
        "created_utc": 1673406038,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are Johns Hopkins online masters worth it?",
        "author": "Certain_Cat1758",
        "url": "https://www.reddit.com/r/GradSchool/comments/108tkfc/are_johns_hopkins_online_masters_worth_it/",
        "text": "[removed]",
        "created_utc": 1673405899,
        "upvote_ratio": 1.0
    },
    {
        "title": "When is it time for someone to drop out of a PhD program?",
        "author": "OneMolarSodiumAzide",
        "url": "https://www.reddit.com/r/GradSchool/comments/108t8vl/when_is_it_time_for_someone_to_drop_out_of_a_phd/",
        "text": "[removed]",
        "created_utc": 1673404990,
        "upvote_ratio": 1.0
    },
    {
        "title": "SCM Graduate Programs- Thoughts/Advice?",
        "author": "ikeamoose",
        "url": "https://www.reddit.com/r/GradSchool/comments/108s48r/scm_graduate_programs_thoughtsadvice/",
        "text": "[removed]",
        "created_utc": 1673402001,
        "upvote_ratio": 0.99
    },
    {
        "title": "SCM Graduate Programs- Thoughts/Advice?",
        "author": "ikeamoose",
        "url": "https://www.reddit.com/r/GradSchool/comments/108s2xx/scm_graduate_programs_thoughtsadvice/",
        "text": "[removed]",
        "created_utc": 1673401905,
        "upvote_ratio": 1.0
    },
    {
        "title": "Canadian masters programs for a Biology major? need advice plz!!",
        "author": "lostwomen321",
        "url": "https://www.reddit.com/r/GradSchool/comments/108rwgp/canadian_masters_programs_for_a_biology_major/",
        "text": "Hey guys I (20F) am currently in my 3rd year of undergrad studying bio and I'm looking to apply to PA school. However, I want to have backups in case I don't get in and I was wondering if anyone here has advice/recommendations. \n\nI've looked at other programs at michener like cardiovascular perfusionist and it sounds rlly cool! Ideally, I'd prefer smth that doesn't require more than 2 years after undergrad and also pays well while still allowing me to be in healthcare. I feel like there are so many options out there that I'm not aware of so plz recommend some options!!",
        "created_utc": 1673401430,
        "upvote_ratio": 1.0
    },
    {
        "title": "History Ph.D. Language Requirement Question.",
        "author": "BarelyBoss",
        "url": "https://www.reddit.com/r/GradSchool/comments/108q5vb/history_phd_language_requirement_question/",
        "text": "I am looking at Universities for my Ph.D. in History and most require me to pass a foreign language exam with reading proficiency before the degree is awarded. I have time so that is not an issue, but my issue is on what language to focus upon. I am heavily leaning toward \"Britain and the British Empire\" with my period left up for debate for a moment, or the \"United States in the 1700's-Early 1900's\" The issue becomes that the prominent language in both areas was English, so not a second language. \n\n&amp;#x200B;\n\nIf you have been in a similar situation, which language did you pursue? Did you select a language from nearby locations?",
        "created_utc": 1673396867,
        "upvote_ratio": 1.0
    },
    {
        "title": "Software/hardware/workspace tips",
        "author": "charade_brigade",
        "url": "https://www.reddit.com/r/GradSchool/comments/108ojtu/softwarehardwareworkspace_tips/",
        "text": "I'm in my second semester of graduate school as an English major and I'm finding it really difficult to write papers on my laptop like I did in undergrad. I feel like I just keep shuffling through my sources and losing my place. Anyone have any tips?",
        "created_utc": 1673392970,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with teaching a fellow graduate student",
        "author": "16H07",
        "url": "https://www.reddit.com/r/GradSchool/comments/108nxzc/help_with_teaching_a_fellow_graduate_student/",
        "text": "I've been at grad school for a few years and I now TA - although I effectively run the whole class - for our introductory graduate seminar. \n\nOne of the new students has been doing quite poorly this year, just scraping B/C grades in classes, including the first semester of the graduate seminar. She has a poor attitude and is rude when I attempt to guide her to clearer discussion. Her grades on her papers have been poor - not all graded by me, and it is clearly a cause for concern, as she is now on academic probation - basically, she has been told that she can continue in the program if she self-funds, but otherwise, she has been encouraged to leave at the end of the year. I was only told this as I am her TA, and it is the chair and her advisor that came up with this plan. However, she is quite hostile to me as, for some reason, she clearly thinks I am the one who instigated this. Obviously, they asked me how she was doing in seminars, and even came to watch one or two under the guise of a teaching evaluation for me, and clearly it has caused them concern. \n\nThis semester, she has been sulking in our seminars so far - barely speaking apart from whispering to people next to her, and just giving off a vibe of 'I don't want to be here'. I do empathize and feel sorry for her, but it's really challenging to teach her when she's like this, and it's not going to help her case. I obviously can't tell her this, as she might be doing it in retaliation, but I really don't know what to do.\n\nDoes anyone have any advice? I don't really want to get the chair or her advisor involved but I feel like I should do something, otherwise she's going to get kicked out. In the short term, I also want to make my classroom a more enjoyable place for the other students.",
        "created_utc": 1673391565,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you know when to quit the PhD?",
        "author": "FreeSEXfromprison",
        "url": "https://www.reddit.com/r/GradSchool/comments/108nfak/how_do_you_know_when_to_quit_the_phd/",
        "text": "I’m in my fifth year econ. I have two (published) papers of the four I need to do my defence. A third is on it’s way but I’ll need one more month to finish it. I haven’t started the fourth yet. The last three years have been an anxiety riddled hellhole. It started with a project with a third party which obliterated my self confidence. We then lost an entire hard drive of research: I had to rebuild my first two papers from the ground up. I’m in therapy biweekly as a result. \n\nI already decided not to pursue academia after the phd. I do not have any ambitions to do so, but most importantly I lost the drive to do research and the curiosity. \n\nSince most days now start with anxiety and high Heart rates, I’m wondering if it’s still worth pushing through these last months just for personal satisfaction when I get my phd. I think it’s just not worth the damage i’m doing to my mental health. I wonder if any people can offer some guidance here.",
        "created_utc": 1673390390,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help - prof is letting me give input before they write my rec letter, what should I include?",
        "author": "dentistani",
        "url": "https://www.reddit.com/r/GradSchool/comments/108mtg6/help_prof_is_letting_me_give_input_before_they/",
        "text": "\\-the following regards a letter of rec that is to be used for dental school applications\n\nTLDR at the bottom if need be \n\nI have emailed a prof who was willing to write a rec letter for me, and in their email reply they ask for my resume, transcript, etc, but one of the bullets listed states they would like back \n\n*\"a comment about what specifically you would like me to address in your letter (I want to make sure that I am fulfilling your expectation of what I will comment about)\"*\n\n1) What would be most beneficial for me and my letter in including here? It's so broad that I understand what is meant, but at the same time dont, only because I feel like the input I can give here will be so valuable I want to choose what to say here correctly, and to maximize the 'benefit' I get from what I tell \n\n2) Additionally they have sent me a short questionnaire, where I can answer a few of the questions so they can base my letter off of substance that actually pertains to me personally. In the questionnaire, there are questions asking me (summarized) to...\n\n1. List obstacles that I have had to overcome / how they helped me grow\n2. Explain how my background / experiences / personality would provide diversity to the incoming class\n3. Explain a time I had to display sensitivity to someones feelings / needs \n4. Explain how I preserved through a stressful time in college\n5. Explain how I set goals for myself\n6. Explain a time I used critical thinking / the scientific method to solve something / how good I am at writing / quantitative reasoning\n\nIn short, displays of my experiences and possible strengths. My question though is which of these should I capitalize on? Per request I can only answer a few of the questions, and even the bullets above are combinations of themes (the questionnaire may split up a bullet above into 2-3 more specific questions), so which theme would make my letter more valuable? For example, would I stand out explaining to her / having her acknowledge my inter-personal skills? or would it be more valuable to answer a question that highlights a clinical experience? For those that know what sort of themes may 'look better' or 'give me an edge' I would appreciate some guidance on which of the questions I should submit and focus on for their help in writing my letter\n\n\\--\n\nIf anyone is able to give me insight on #1 and #2 above, I would truly appreciate it. I feel like I have a potentially great opportunity to really connect with my letter writer here and I just want to make sure I choose things that could either give me a leg up, or choose what those who read it would value. \n\n\\--\n\nTL;DR : My professor is letting me really showcase myself, and with the options they gave me on what I could potentially highlight, I want to ask and make sure if there is any one I could choose that would be 'better' than another, and what sort of things would overall make me more unique / what themes I should focus on that could help her write a non-generic essay",
        "created_utc": 1673389018,
        "upvote_ratio": 1.0
    },
    {
        "title": "Prof sent me her papers ahead of interview -- What do I do?",
        "author": "dust_and_shadows",
        "url": "https://www.reddit.com/r/GradSchool/comments/108mam6/prof_sent_me_her_papers_ahead_of_interview_what/",
        "text": "I have an interview coming up with a PI for a clinical psych program, and she sent me two of her papers saying we will discuss them during the interview. What should I look out for when reading the papers beyond making sure I understand them correctly? Should I come up with ideas based on her work to further probe this area? Should I look for things I think would be interesting to try doing differently? I'm terrified I'll get something wrong and completely embarrass myself talking about her work.",
        "created_utc": 1673387818,
        "upvote_ratio": 1.0
    },
    {
        "title": "Computer Science, Biostatistics, Health Informatics – best for biomedical data science?",
        "author": "itsmarq",
        "url": "https://www.reddit.com/r/GradSchool/comments/108ln1t/computer_science_biostatistics_health_informatics/",
        "text": "tl;dr – Trying to choose a masters’ program to do research in data science, in a biomedical/clinical context. Options are health informatics, biostatistics, and computer science.\n\n&amp;#x200B;\n\nHey everyone! I graduated from my bachelor’s in Biomedical Sciences this past spring, and have been exploring career options since then, including working at a clinical job, a research job, and self-learning programming/advanced math. \n\nI’ve come to realize I enjoy specific aspects from each experience:\n\n* Data visualization: I enjoy analyzing and communicating research visually, pulling from background courses in biostatistics and graphic design. \n* Research methodology: I noticed that the subject matter didn’t matter (ranging from cell biology to public health), but rather I take interest in how research is structured and designed, and how other computational methods could be applied (e.g. drawing from my science background to see how predictive machine learning can be used in biomedical imaging, epidemiology, etc.)\n* Clinical component: I’d still like to have a clinical/healthcare approach to things, e.g. not closing doors on the (pipedream of an) idea of being a clinician-scientist of sorts\n\n&amp;#x200B;\n\nThat being said, an ideal career of mine would consist of collaborating with various physicians and research groups. This includes working on designing research projects, applying statistical and computational methods for data analysis, and ultimately visually illustrating and communicating the results of the research (e.g. for the public and/or to other researchers).\n\nDoes such a career exist? I’m looking into Masters’ programs to explore the subject matter further, but it seems to be an intersect between computer science, biostatistics, and health informatics. What seems most appropriate from my experience/interests, alongside finding a job afterward?\n\n&amp;#x200B;\n\nSome side thoughts/notes:\n\n* Health informatics was the first thing I came across. Programs I’m looking at are 2 years with internships included. However, they seem more focused solely on management and policy of electronic health records (versus software development or data science), and I’m not too sure how this would translate out to other data science industries in the case I’m needing to pivot fields? Plus, a fair amount of the job descriptions also consider candidates in statistics and CS, but not the other way around\n* Biostatistics programs are 1-2 years long and some also have internships. They focus more on statistical theory alongside other public health concepts. However, I’ve also read that pure statistics might be more theory than I actually need, versus the software skills which data science employers look for?\n* Computer science programs are 2 years long, but I’d be finding internships on my own. Computer science is the least familiar of the fields to me, so I don't know how relevant the skills are in this program to my interests.",
        "created_utc": 1673386300,
        "upvote_ratio": 1.0
    },
    {
        "title": "How hard is it to switch an applicant from undergrad to grad?",
        "author": "Healthy_Landscape640",
        "url": "https://www.reddit.com/r/GradSchool/comments/108layw/how_hard_is_it_to_switch_an_applicant_from/",
        "text": "[removed]",
        "created_utc": 1673385520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Uncertain about acceptance.",
        "author": "FFFUUUme",
        "url": "https://www.reddit.com/r/GradSchool/comments/108l10k/uncertain_about_acceptance/",
        "text": "I have a GPA of 2.98 and the minimum GPA requirement is a 3.0\n\nMy work experience is great and so are my recommendations, but I'm just afraid that my GPA will prevent me from being accepted into the program. I have a ton of anxiety about submitting my application. (For a Master's in Mental Health Counseling) \n\nDo you guys think I have a fighting chance?",
        "created_utc": 1673384871,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for reviewing a final paper for a higher grade?",
        "author": "PrincessAegonIXth",
        "url": "https://www.reddit.com/r/GradSchool/comments/108kzmw/tips_for_reviewing_a_final_paper_for_a_higher/",
        "text": "[removed]",
        "created_utc": 1673384779,
        "upvote_ratio": 1.0
    },
    {
        "title": "Assistance with Grad School Application. How to select universities for research-based masters' in AI/ML",
        "author": "sskhan2",
        "url": "https://www.reddit.com/r/GradSchool/comments/108jm0s/assistance_with_grad_school_application_how_to/",
        "text": "[removed]",
        "created_utc": 1673381582,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for Selection of Grad School",
        "author": "sskhan2",
        "url": "https://www.reddit.com/r/GradSchool/comments/108jhg3/advice_for_selection_of_grad_school/",
        "text": "[removed]",
        "created_utc": 1673381287,
        "upvote_ratio": 1.0
    },
    {
        "title": "What questions do you wish you'd asked at visit days for PhD programs?",
        "author": "actinium226",
        "url": "https://www.reddit.com/r/GradSchool/comments/108ipzn/what_questions_do_you_wish_youd_asked_at_visit/",
        "text": "Just applied to a number of PhD programs in mathematics. We'll see if I even get into any, but assuming I do it's my understanding that they often have \"visit days\" so that prospective students can come tour the campus, talk to students, etc.\n\nI'm wondering what sort of questions I should ask? Or what sort of questions you wish you had asked or thought about in retrospect?",
        "created_utc": 1673379480,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you make a separate bibliography for different chapters by Mendeley? I am using MS word",
        "author": "pkhadka1",
        "url": "https://www.reddit.com/r/GradSchool/comments/108in41/how_do_you_make_a_separate_bibliography_for/",
        "text": "Is there a way i can do that in a single document? I tried section break, but it doesn't help.",
        "created_utc": 1673379291,
        "upvote_ratio": 1.0
    },
    {
        "title": "Failed my first Graduate Course.. What’s next?",
        "author": "chopscrewey_",
        "url": "https://www.reddit.com/r/GradSchool/comments/108i066/failed_my_first_graduate_course_whats_next/",
        "text": "For context: I am not a first semester student. My first year went fine, then I got sick with COVID and the next 2 years have been gnarly \n\nSo yeah.. I got an F in a class (which I’m not going to argue against because it was very hard to get anything done due to my home / health situation) and an A in the other course I was taking.\n\nI am going to obviously retake this course since I have the option according to my program. My question is: Has anyone been in a position like this where they had an F in one course and an A in the other course they were taking? Were you put on academic probation? Were you kicked out?\n\nI realize that this may seem jumbled.. but I would like some guidance here as I’ve received a mix of Cs and As for my second year in the program I’m in, and it’s not the workload that is a lot. It is the situation at home and health that is occurring. Any kind of answer, even if not favorable, would work best haha.",
        "created_utc": 1673377751,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I pursue an Art MFA or Art Ed MA?",
        "author": "wavyID",
        "url": "https://www.reddit.com/r/GradSchool/comments/108hqv3/should_i_pursue_an_art_mfa_or_art_ed_ma/",
        "text": "Or am I deluding myself, and would be wise just do a coding bootcamp",
        "created_utc": 1673377099,
        "upvote_ratio": 1.0
    },
    {
        "title": "Masters in clinical psych at Capella",
        "author": "cherrybaby1313",
        "url": "https://www.reddit.com/r/GradSchool/comments/108hn4u/masters_in_clinical_psych_at_capella/",
        "text": "Is it worth it? I know there’s a few extra courses that one would have to take to get an LPCC license in CA. Has anyone gone through this",
        "created_utc": 1673376848,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to create better bond with students?",
        "author": "ipayrentintoenails",
        "url": "https://www.reddit.com/r/GradSchool/comments/108h91b/how_to_create_better_bond_with_students/",
        "text": "I'm in my master's program for communication and part of my role is to teach sections of the introduction to public speaking class for undergrads at my university. Last semester, my classes went well, but I kept having a feeling that I wasn't as connected to my students as I could be. I know, it's ironic that I'm in communication but I have difficulties with forming good working relationships (my area is rhetoric, not interpersonal or organizational comm). I tend to be \"all about business\" and my goal this semester is to create a more close-knit and personable classroom environment. \n\nI'll be taking suggestions from people in my cohort to sit in a circle of desks with my students, rely less on PowerPoint, and start class with a brief conversation unrelated to class material (like asking about things going on in my students' lives or what they're interested in). Does anyone have any other suggestions on how I can show more personality, connect with my students, and allow my students to connect with each other?",
        "created_utc": 1673375908,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mayo Clinic Stipend Explained?",
        "author": "comphypotato",
        "url": "https://www.reddit.com/r/GradSchool/comments/108h6mr/mayo_clinic_stipend_explained/",
        "text": "Hello all, I have an upcoming interview with the Mayo Clinic, and I was wondering if anyone could explain the stipend aspect. It looks like my stipend is funded by the university, not by TA/RA. However, someone said that grad students can still get shafted by grant funding. Does this apply to the research funds themselves? I apologize in advance if this question seems basic. I have really struggled with the funding concept in general.",
        "created_utc": 1673375745,
        "upvote_ratio": 1.0
    },
    {
        "title": "In case any instructors would like to participate in a dissertation study:",
        "author": "poemsyouhaventread",
        "url": "https://www.reddit.com/r/GradSchool/comments/108gqs7/in_case_any_instructors_would_like_to_participate/",
        "text": "[removed]",
        "created_utc": 1673374689,
        "upvote_ratio": 1.0
    },
    {
        "title": "Motivated to work hard and apply to top grad schools for my line of work (CS/ML), but wondering how much my undergrad 2.97 gpa (Aerospace Engineering) will factor into my ability to be competitive for certain programs",
        "author": "Lurie_",
        "url": "https://www.reddit.com/r/GradSchool/comments/108gonj/motivated_to_work_hard_and_apply_to_top_grad/",
        "text": "I have great work history with relevant experience, and also the remainder of this year until August when applications open up to add to my public profile and prove I am a competitive candidate, but how much of that matters when so many programs have a hard cap at 3.0?\n\nI plan to reach out to the offices of many universities to ask directly, but wanted to see if anyone had any similar experience with this as well.\n\nAnother idea I’ve had is to keep up with publications coming from students in these grad programs over the course of this year, in hopes of being able to convey these efforts and my level of interest in my application essay. I’m worried if this idea is a bit overzealous?",
        "created_utc": 1673374545,
        "upvote_ratio": 1.0
    },
    {
        "title": "advice for masters after a major in CE",
        "author": "PPdemon",
        "url": "https://www.reddit.com/r/GradSchool/comments/108g2o0/advice_for_masters_after_a_major_in_ce/",
        "text": "[removed]",
        "created_utc": 1673373109,
        "upvote_ratio": 1.0
    },
    {
        "title": "advice on masters after a major in computer eng major",
        "author": "PPdemon",
        "url": "https://www.reddit.com/r/GradSchool/comments/108fznc/advice_on_masters_after_a_major_in_computer_eng/",
        "text": "[removed]",
        "created_utc": 1673372911,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate my office",
        "author": "zebrapaad",
        "url": "https://www.reddit.com/r/GradSchool/comments/108fsvq/i_hate_my_office/",
        "text": "I hate my office on campus. I hate going to campus and sitting there for hours trying to work and feeling annoyed about being there.\n\nI'm thinking about bringing in some plants and stuff. Is this a good idea? what have you done to make your office a better working environment?",
        "created_utc": 1673372463,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there an easy way to export search results from pubmed and/or psychinfo?",
        "author": "ekkm",
        "url": "https://www.reddit.com/r/GradSchool/comments/108egnh/is_there_an_easy_way_to_export_search_results/",
        "text": "I am starting a review paper for my qualifying exams and want to export the articles to a spreadsheet for tracking if possible. \n\nI’ve never done this before so it’s also possible there is a simpler way to organize. I am following the 2020 PRISMA guidelines. Anyone have any tips??",
        "created_utc": 1673369281,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you guys do it?",
        "author": "catsarelife7742",
        "url": "https://www.reddit.com/r/GradSchool/comments/108ech1/how_do_you_guys_do_it/",
        "text": "I’m a third-year PhD student in a STEM field. How do you guys wake up every morning and get motivated to go to your office and be productive everyday?\n\nI’ve been working from home a lot since I no longer have classes. But I’m also not even up for candidacy yet since I have to submit my first-author paper as a prerequisite. But my project hasn’t been as clear-cut as my advisor and I originally thought, so we’re probably going to have to adjust the scope of the paper just so I can publish something. I kind of feel like a failure, and it’s so hard to stay motivated. But my advisor wants me to aim to actually come into the office everyday and be more productive that way.",
        "created_utc": 1673369000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asking Professor to recommend me to another one",
        "author": "StayCivilE",
        "url": "https://www.reddit.com/r/GradSchool/comments/108e4bs/asking_professor_to_recommend_me_to_another_one/",
        "text": "I was just interviewed by one professor who said that he was impressed by my profile and that my research may be useful to him. But he also mentioned that there is another professor from the same department who may be a better fit for me. The problem is that this professor hasn’t responded to my email, and I’m worried that the first one may be thinking that I am already talking to the second one. Is it appropriate to ask the first professor to recommend me to a second one in hopes that they will respond? Or is there a better way to go about this situation? Many thanks!",
        "created_utc": 1673368435,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling punished for going to grad school",
        "author": "thelure2112",
        "url": "https://www.reddit.com/r/GradSchool/comments/108daye/feeling_punished_for_going_to_grad_school/",
        "text": "Back in 2015 I was one of those people who graduated with an education degree deciding they didn't want to be a teacher. Through one way or another I found myself in finance. First in insurance sales then to client service on to operations now finally I've spent the last 3 years as an executive assistant at a multi-billion dollar AUM firm to the CIO of the company. During this time I really discovered I wanted to do financial analysis, as one might imagine I do a lot of the leg work already on collecting data for people to form it into reports given that I work directly under the CIO.\n\nSo, early last year I decided to apply to a part time Masters of Finance program at a local university. It's an average one that fits the bill &amp; has a lot of strong local connections for employment. Since then, I have been explicitly told that we are to small to higher any more financial analysts (we have two already, one is a former Ivy &amp; the other is the boss' daughter) &amp; that I'll have to find work elsewhere when I graduate. Which for what it's worth I understand &amp; suspected this would be the case. However, since then it feels like I have kind of been on the outs, like I'm not a team player. Then this year, I got a way smaller raise than the previous (1% raise in an 7% inflationary environment), which has kind of confirmed my suspicions that they aren't thrilled with my career choices. (yes I know the market has been down 25% &amp; we are always the first hit by this as the money managers but I'm literally making less than when I started when you account for inflation)\n\nIt's just incredibly aggravating, I know some people here might say \"you should be happy they aren't just looking to replace you\" but I would have thought I'd receive some more support... It just feels like I'm being punished for \"not knowing my place\".",
        "created_utc": 1673366436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does your supervisor forget what you have done?",
        "author": "Material-Egg7428",
        "url": "https://www.reddit.com/r/GradSchool/comments/108bstd/does_your_supervisor_forget_what_you_have_done/",
        "text": "My supervisor makes me constantly go over my data. Every time I do it feels like he is looking at it for the first time. He also forgets what experiments I have done - saying my project is going slow until I remind him. He is a relatively new PI so maybe it is just stress.",
        "created_utc": 1673362632,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doctoral student needs assistance.",
        "author": "DMW23__",
        "url": "https://www.reddit.com/r/GradSchool/comments/108auoz/doctoral_student_needs_assistance/",
        "text": "[removed]",
        "created_utc": 1673360103,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips and Tricks to Avoid Procrastinating",
        "author": "Fernontherocks",
        "url": "https://www.reddit.com/r/GradSchool/comments/108af2q/tips_and_tricks_to_avoid_procrastinating/",
        "text": "Last semester entering my second year, I started off good and while dealing with depression, anxiety, and addictions, the semester kinda spiraled. I realized I got to a point where the day OF one of my classes final papers was due I stated the assignment (the liar in my head that says “ah I work well under pressure or ah I can do it last minute and still get a good grade”) not anymore. I waited and waited for who knows what to start that assignment and I had the worst time of my life. I’m traumatized. I was so stressed out finals week that I threw up from nausea, had major major anxiety, pretty much broke down half way and started ending my sentences midway because I just could not keep going for the life of me. That level of stress was traumatic and I know it’s my fault. I need to make changes. I promised myself if I did that to myself again I would drop out. And since I have Qualifying exams this semester, I’m like SpongeBobs brain, all chaos. All I can think about are my professors thinking “how did she get in with this work? Or just thinking the worst of my capabilities. Which I also feel like I’ve partly lost. My writing was so good before, now it’s hard to make a sentence sound good enough. I bombed those finals so hard, when I think about it I get anxiety again. I feel kinda numb too, I’m worried that I didn’t really panic knowing those papers were due that day. Not panicking means I’m not caring anymore and that’s scaring me. Factors like being far away from home and being lonely in a new city with no real friends, mental health struggles, and life in general has been bumpy for all of us the last two years. Have any of you experienced this stress trauma before? How have you dealt with it? Or if you have any tips on being productive and avoid procrastinating please let me know. I’m desperate. I don’t want to end up hating my career bc of grad school. I LOVE what I do, I love being an archaeologist, I can’t see myself doing anything other than that. Which is why dropping out of grad school is NOT a choice. I have to finish, but I need help managing it all along the way. Thanks in advance.",
        "created_utc": 1673358966,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me find a university for my masters :((((",
        "author": "chanandlerbonngg",
        "url": "https://www.reddit.com/r/GradSchool/comments/1089jdm/help_me_find_a_university_for_my_masters/",
        "text": "Hello All, \n\nI am going crazy trying to find **a good University for my master's degree**, **please sugges**t anyone you know. My criteria:\n\n**Masters in:** Management, Finance, or a related field. \n\n**Rank:** Top 200 World ranking :')\n\n**Tuition Fees**: Maximum of 6,000$/Year  :')\n\nI don't have GMAT or GRE, only TOEFL and a bachelor degree in Engineering &amp; Management.\n\nI would love to go to Canada or US but the prices are too high, so if you have any other recommendations please let me know.",
        "created_utc": 1673356446,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for websites where I could find FULL articles for my research",
        "author": "TitanROG",
        "url": "https://www.reddit.com/r/GradSchool/comments/1089995/looking_for_websites_where_i_could_find_full/",
        "text": "I'm doing research on AI and information technology and am in desperate need of some popular websites that could be used to find published articles/scientific papers on this subject. Obviously I will be crediting the authors as I am obligated to do so.",
        "created_utc": 1673355616,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dissertation writing",
        "author": "dissertationwriting1",
        "url": "https://www.reddit.com/r/GradSchool/comments/1088fhu/dissertation_writing/",
        "text": "[removed]",
        "created_utc": 1673353029,
        "upvote_ratio": 1.0
    },
    {
        "title": "Porn &amp; Sexual Fantasies Questionnaire",
        "author": "AnnaLauraResearch",
        "url": "https://www.reddit.com/r/GradSchool/comments/1085w3m/porn_sexual_fantasies_questionnaire/",
        "text": "[removed]",
        "created_utc": 1673343936,
        "upvote_ratio": 1.0
    },
    {
        "title": "Changing PhD program after one year",
        "author": "azzazzani",
        "url": "https://www.reddit.com/r/GradSchool/comments/1085k4t/changing_phd_program_after_one_year/",
        "text": "[removed]",
        "created_utc": 1673342581,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do Grad Schools have supplement essays (like Undergrad)?",
        "author": "SadWolverine24",
        "url": "https://www.reddit.com/r/GradSchool/comments/10851e4/do_grad_schools_have_supplement_essays_like/",
        "text": "",
        "created_utc": 1673340601,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice needed for possible grad school rejections",
        "author": "Ill-Jaguar-242",
        "url": "https://www.reddit.com/r/GradSchool/comments/1084fn2/advice_needed_for_possible_grad_school_rejections/",
        "text": "[removed]",
        "created_utc": 1673338290,
        "upvote_ratio": 1.0
    },
    {
        "title": "AH Advice needed on potential grad school rejections",
        "author": "Ill-Jaguar-242",
        "url": "https://www.reddit.com/r/GradSchool/comments/1084er7/ah_advice_needed_on_potential_grad_school/",
        "text": "[removed]",
        "created_utc": 1673338203,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you do a second Master's in this case?",
        "author": "sanadabeeeech",
        "url": "https://www.reddit.com/r/GradSchool/comments/1081ja0/would_you_do_a_second_masters_in_this_case/",
        "text": "[removed]",
        "created_utc": 1673328194,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experiences with anxiety during graduate school",
        "author": "Goobzo",
        "url": "https://www.reddit.com/r/GradSchool/comments/10817i8/experiences_with_anxiety_during_graduate_school/",
        "text": "I am a life sciences PhD student who transferred from a MSc program in September after two years. Lately I have been experiencing bouts of anxiety over my future and especially the uncertainty of graduation and job prospects. The average length of a PhD student in our program is around 5 years, but many people in my lab tend to graduate in 6 and sometimes 7 or 8. As much as I enjoy research, I do not want to do it forever and hope to start a career in scientific consulting. I am worried that no matter how hard I work, I will be stuck here for more than I have anticipated and will be essentially putting my life on hold. Granted, I am still relatively young (25) but the thought of putting my life on hold longer than I anticipate gives me anxiety.",
        "created_utc": 1673327165,
        "upvote_ratio": 1.0
    },
    {
        "title": "Search for grad schools by application deadline?",
        "author": "supposenot",
        "url": "https://www.reddit.com/r/GradSchool/comments/1080nsn/search_for_grad_schools_by_application_deadline/",
        "text": "Prospective math PhD student here. I recently finished applying to all the schools on my list (there's 10 of them). I want to apply to a few more since I have the time; it seems like there are still a few schools with deadlines clustered around 1/15 and 2/1.\n\nIs there a way I can search for more schools whose deadlines haven't passed yet? Or does anybody know of some schools with decent (algebraic) topology departments who are still accepting applications for next fall?",
        "created_utc": 1673325499,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to negotiate salary (nicely) for an academic position that's seemingly paying too little?",
        "author": "Jealous_Poem8304",
        "url": "https://www.reddit.com/r/GradSchool/comments/107zfbc/how_to_negotiate_salary_nicely_for_an_academic/",
        "text": "[removed]",
        "created_utc": 1673321854,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starting a PhD program I do not plan to finish",
        "author": "Part-time-Gangster",
        "url": "https://www.reddit.com/r/GradSchool/comments/107z8ig/starting_a_phd_program_i_do_not_plan_to_finish/",
        "text": "[removed]",
        "created_utc": 1673321307,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some good ways to earn money while in grad school?",
        "author": "ceramicplush",
        "url": "https://www.reddit.com/r/GradSchool/comments/107z717/what_are_some_good_ways_to_earn_money_while_in/",
        "text": "Looking for a way to earn money while still putting school first.",
        "created_utc": 1673321192,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I apply to an MA program if I don't want one?",
        "author": "chaoticguppy",
        "url": "https://www.reddit.com/r/GradSchool/comments/107z42b/should_i_apply_to_an_ma_program_if_i_dont_want_one/",
        "text": "[removed]",
        "created_utc": 1673320950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Johns Hopkins online masters",
        "author": "Certain_Cat1758",
        "url": "https://www.reddit.com/r/GradSchool/comments/107xwtu/johns_hopkins_online_masters/",
        "text": "[removed]",
        "created_utc": 1673317628,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much does SOP length matter?",
        "author": "lets-snuggle",
        "url": "https://www.reddit.com/r/GradSchool/comments/107xm85/how_much_does_sop_length_matter/",
        "text": "Hi! Not sure if this should be in this sub or /gradadmissions but I’m really stressing.\n\nI applied to 8 schools for School Psychology, Ed.S/ MA CAGS, M.Ed. I submitted my SOP to all of them except one. \n\nThe instructions say “you are encouraged to limit your sop to one single page typed.” But I can’t for the life of me seem to go under a page and a half, even with single spacing (which I’m unsure if that’s what they’re asking for. The wording of “one single page typed” is odd bc it could have been “one page typed.”\n\nIf my spacing is 1.15, my statement is a page and a half. If it’s single, my statement is a page and then like one small paragraph on page 2. \n\nIs an automatic not- read or “she doesn’t follow directions, how could we admit her to a grad program?” Thought process if it’s a little over the encouraged amount? \n\nIf so, any advice on how to shorten it is helpful. \n\nP.S. I’m using Times New Roman font in 12pt",
        "created_utc": 1673316833,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"The Gap or Grow?\"",
        "author": "Historianblayde",
        "url": "https://www.reddit.com/r/GradSchool/comments/107x5ul/the_gap_or_grow/",
        "text": "So, just found out that I failed my first course ever. I feel like a failure. Not just because I failed this one class but because now.. I have to wait another damn year to graduate. Technically I was supposed to graduate with my cohort (2022) last year but I decided to take a break because I was overwhelmed.\n\nBut anyway, yeah. Here I am writing and thinking what hell to do with my \"break\". Yep, a break, or gap since I failed that one course I am stuck and unable to advance to the next class and I must wait until July to retake the class.  \n\nFor any of you who had this same issue, what did you do with your time? \n\nof course, have a job/career but I mean what did you do with this time? did you try to plead and appeal the course? did you decide to give up and take that semester as a gap/break, did you take a new job/task and save money so you can afford to take the freakin class another time? A big bother for me is the amount of loans I have to pay back :(\n\nI'd really like to know some other ways I can be useful because if I am idle, I'll just give up and will probably (or not) regret it for my entire existence.",
        "created_utc": 1673315604,
        "upvote_ratio": 1.0
    },
    {
        "title": "Discrimination for Hospitalization",
        "author": "Acceptable_Bad_",
        "url": "https://www.reddit.com/r/GradSchool/comments/107wfrg/discrimination_for_hospitalization/",
        "text": "Am I better seeking out help from a University's Equity Office for Discrimination or filing a direct complaint with the US Equal Employment Opportunity Commission? I have been told by many that universities seek to protect themselves and are not there to help the student.",
        "created_utc": 1673313658,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was reading over the review paper I published and I found one numerical error that may or may not be big...",
        "author": "calcetines100",
        "url": "https://www.reddit.com/r/GradSchool/comments/107w5ml/i_was_reading_over_the_review_paper_i_published/",
        "text": "Last year I published a review paper that included a table of amino acid content of several plant protein isolates. I was reading it again to jog my memory about certain information, but as I was reading over, I found that one amino acid content from a certain plant was mis-reported because I made a mistake in not putting a decimal point. On one hand I feel like this should be an easy fix...but how do I approach my boss about it? it's super embarrassing.",
        "created_utc": 1673312913,
        "upvote_ratio": 1.0
    },
    {
        "title": "Returning to grad school later in life - is it worth it?",
        "author": "ComfortableComplex26",
        "url": "https://www.reddit.com/r/GradSchool/comments/107tagy/returning_to_grad_school_later_in_life_is_it/",
        "text": "I am considering going back to school in the future to get my PhD in geography, but am nervous because I’ve been out of the academic world for a few years and I’ll be starting later in life than I intended. I’ve pushed off going back to school for a few years due to financial constraints, but still really want to achieve it someday and like the idea of working as a professor in the future. \n\nHas anyone started a doctorate program in their 30s and have advice? Did you find it worth it or wish you would have started sooner?",
        "created_utc": 1673305703,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stop FOMO for applications (international relations programs)",
        "author": "hhq002",
        "url": "https://www.reddit.com/r/GradSchool/comments/107srmd/how_to_stop_fomo_for_applications_international/",
        "text": "[removed]",
        "created_utc": 1673304480,
        "upvote_ratio": 0.99
    },
    {
        "title": "Need to meet with advisor soon, but completely behind in work",
        "author": "MajorRedhead",
        "url": "https://www.reddit.com/r/GradSchool/comments/107sdo9/need_to_meet_with_advisor_soon_but_completely/",
        "text": "I’m planning to defend and graduate with my PhD this semester. I am scheduling to meet with my advisor to discuss planning the defense and getting the final edits on my dissertation complete. They knew I had a couple chapters that needed major work and we discussed that I’d get this finished last semester, then they could read over the dissertation early this semester and offer advice. However I’m nowhere near finished. I barely did anything last semester or the last year to be honest. I’ve been dealing with so much that has caused me great stress and anxiety including health issues, personal issues, immigration issues, family and spouse health and medical issues, etc. Trying to get through each day without breaking down is my primary goal and most of my time goes to self-care at this point because I don’t know how else I will be able to function. \n\nThe problem is obviously my work has taken a backseat. I need to meet with my advisor to discuss my progress soon and am nervous to say that despite being given so much time away from research or teaching duties to work on it I just haven’t been able to motivate myself to do it. I will try to get as much done as I can before our meeting (the pressure of that deadline at least helps a bit because I have no other choice) but otherwise I’m at a loss at how to discuss this. Do I be honest about my personal difficulties or is that none of their business? Does it look like I’m just making excuses? How do I approach this?\n\nAlso anyone in this situation, how did you get yourself to actually finish the work in time? I hate to say it but as a perfectionist dealing with mental health issues the idea that my dissertation is going to be kind of rough at the end of this is causing me a great deal of guilt but I’m too miserable and tired to put in the effort anymore.\n\n(And before anyone says to get psychological help, I have already tried but it’s not helpful. There really is no helping the fact that my life sucks and overwhelmingly sucks a lot of the time. The vast majority of my problems are completely beyond my control.)",
        "created_utc": 1673303606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mention professors in SOP?",
        "author": "opti-mist",
        "url": "https://www.reddit.com/r/GradSchool/comments/107s9ws/mention_professors_in_sop/",
        "text": "How important is it to mention a professor and interest in their work for the particular universities that I am  applying for?\nGraduate program: Business Analytics, MS. \n\n(Most universities have deadlines in feb/march and am working on supplemental essays rn)",
        "created_utc": 1673303381,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stressed out about PhD defense",
        "author": "Heparanase",
        "url": "https://www.reddit.com/r/GradSchool/comments/107ro3o/stressed_out_about_phd_defense/",
        "text": "Wednesday is the day. After 5.5 years of research, I will defend my thesis versus 6 highly renowned scientists in my field. 45 minute barrage of questions coming my way, and I cant be more stressed about it. During the project, I already developed an anxiety disorder, and even though I've stepped out of science, this last step gets to me. I've been preparing non stop for the last two weeks, but it just makes me realise how much there is to know. Everyone tells me to enjoy the moment, and I will, if I just manage not to faint. Any advice from folks on the other side?",
        "created_utc": 1673302018,
        "upvote_ratio": 1.0
    },
    {
        "title": "Freaking out about finishing",
        "author": "Experience_Pleasant",
        "url": "https://www.reddit.com/r/GradSchool/comments/107r6dd/freaking_out_about_finishing/",
        "text": "A year and a half ago I had nothing to show for grad school and was overweight. Since then, I published four papers and lost 70 lbs out of my goal of 90 lbs while also gaining a lot of new friends. Doing all this, I feel like I am the happiest I've ever been in my life. However, this has made me rather scared for the future. With all that work I feel like I put myself in a great spot, but I am just terrified for the complete restart of my life again. How is starting a career in a completely new area from scratch?",
        "created_utc": 1673300955,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to you personally determine if you’re doing enough?",
        "author": "Thunderplant",
        "url": "https://www.reddit.com/r/GradSchool/comments/107pvh0/how_to_you_personally_determine_if_youre_doing/",
        "text": "I’m a second year grad student in experimental physics with a very hands off advisor. On the plus side, I can take vacation whether I want, and choose to work or not work whatever days and hours I please. However, the downside of this is I have no idea how to evaluate those decisions (ie can I take another vacation? Can I go home early a few days this week to play a game I’m super exited about? Etc) I work alone on my projects and there are no deadlines so it’s hard to know if I’m making enough progress. I’ve worked a lot less this year than last due in part to health issues and I have no idea where my quantity of work falls on a spectrum from totally fine to totally unacceptable.\n\nI’m curious how other people evaluate their time and make these decisions about how much to work.",
        "created_utc": 1673298064,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free ride to grad school right after graduation vs putting yourself through grad school later on?",
        "author": "RandomPerson0703",
        "url": "https://www.reddit.com/r/GradSchool/comments/107p57w/free_ride_to_grad_school_right_after_graduation/",
        "text": "I am a junior getting my BA in social sciences who wants to study public policy, public administration, or international relations at grad school, with the intent of staying in the country where I get my MA. I want to get my degree overseas because my country values prestige over the quality of education, and even the most prestigious schools (which are the only ones that put effort in their master's programs) aren't demanding, according to my friends and acquaintances who go to these schools.\n\nA government organization in my country stations its second-year employees overseas to get their MAs. You would still get your salary during your studies and tuition will be paid for by the government if you stay on afterward for a certain number of years. I am considering it as an option because it would take me a lot of time to afford a proper education on my own, considering how expensive tuition is at my dream schools, and how expensive living costs are in general. \n\nThe problem is, the working conditions are terrible. Government employees aren't paid well (only 50-60% of what consulting firms pay), the work culture is toxic, and there's a lot of overtime. There is also the fact that I do not intend on staying forever, whereas the position was made to train people into future high-ranking officials. However, the job would open a lot of doors for me and give me some prestige. It's difficult to get an entry-level position overseas as a non-citizen, but this job would guarantee me a job overseas for as long as I work there. \n\nOn the other hand, a consulting job in government relations would pay a lot better (with a much better work culture and less overtime) and would give me relevant experience. I'll have more time to consider my options and I'll be able to save up for grad school overseas on my own in about 5 years, even less if I opt for a double degree with a domestic university. However, it will be difficult to find a job and stay, and I don't think I'd be able to handle not being able to stay despite getting a taste of what it's like to live in whichever country I get my MA in. (I've lived in a few other countries before and I always get depressed after coming back.)\n\nThis may not be the best sub for this, but I'm asking here since grad school is the one thing I know I want to do. I would appreciate any insights you may have.",
        "created_utc": 1673296403,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am not sure whether to pursue a masters in Biomedical Engineering or one in Math",
        "author": "WalkAny4437",
        "url": "https://www.reddit.com/r/GradSchool/comments/107okl4/i_am_not_sure_whether_to_pursue_a_masters_in/",
        "text": "[removed]",
        "created_utc": 1673295116,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should I pursue: a masters in Biomedical Engineering or in Math?",
        "author": "WalkAny4437",
        "url": "https://www.reddit.com/r/GradSchool/comments/107oetk/what_should_i_pursue_a_masters_in_biomedical/",
        "text": "[removed]",
        "created_utc": 1673294756,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does choice of graduate school matter in Biological Sciences?",
        "author": "Gryph0np",
        "url": "https://www.reddit.com/r/GradSchool/comments/107nxwl/does_choice_of_graduate_school_matter_in/",
        "text": "Basically the title :)",
        "created_utc": 1673293716,
        "upvote_ratio": 1.0
    },
    {
        "title": "I spent so much time on the logistical/practical parts of research that I hardly learned any of the theory and literature",
        "author": "Mammoth_Reach6550",
        "url": "https://www.reddit.com/r/GradSchool/comments/107nbkl/i_spent_so_much_time_on_the_logisticalpractical/",
        "text": "[removed]",
        "created_utc": 1673292297,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ideas for general exam questions",
        "author": "Careful-Sun4657",
        "url": "https://www.reddit.com/r/GradSchool/comments/107n6ir/ideas_for_general_exam_questions/",
        "text": "My committee chair has begun drafting my general exam questions and has asked for my input on what I may be interested in writing. She is more than equipped to write all of them for me, but if I can guide her, it may be more beneficial for me at the end. It will be 3 questions around 10 pages each and related to my research interest of palliative care for heart failure patients. BG: For my dissertation, I plan on conducting a qualitative study that explores the decision making process (as well as barriers and facilitators) for patients who are recommended to receive this specialized care.\n\nFor those who completed their GE, did you have input on your questions and how did you arrive at your decision? I know I want to complete a literature review for 1 paper, but currently stuck thinking about what I want for the other 2. Thanks in advance!",
        "created_utc": 1673291982,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friendship, Humor, and Conflict Survey",
        "author": "SunFlowerOfDoom",
        "url": "https://www.reddit.com/r/GradSchool/comments/107n3ba/friendship_humor_and_conflict_survey/",
        "text": "[removed]",
        "created_utc": 1673291774,
        "upvote_ratio": 1.0
    }
]