[
    {
        "title": "Are countable nouns considered uncountable nouns when in their singular form?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/92jnxf/are_countable_nouns_considered_uncountable_nouns/",
        "text": "[deleted]",
        "created_utc": 1532754394,
        "upvote_ratio": ""
    },
    {
        "title": "Has the world \"doubt\" a negative connotation?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/92jl0m/has_the_world_doubt_a_negative_connotation/",
        "text": "[deleted]",
        "created_utc": 1532753600,
        "upvote_ratio": ""
    },
    {
        "title": "\"What time is it?\" \"what temperature is it?\" how are these questions wrong? are they wrong in the same way? Are they actually correct?",
        "author": "blind___surgeon",
        "url": "https://www.reddit.com/r/grammar/comments/92itvo/what_time_is_it_what_temperature_is_it_how_are/",
        "text": "",
        "created_utc": 1532746129,
        "upvote_ratio": ""
    },
    {
        "title": "I'm having trouble with a couple sentences in my novel...",
        "author": "CeilingUnlimited",
        "url": "https://www.reddit.com/r/grammar/comments/92i0i2/im_having_trouble_with_a_couple_sentences_in_my/",
        "text": "Do these two sentences work regarding the grammar?  They read well, but I keep thinking I have a dangling modifier in one or both of them.  Thoughts/Suggestions?\n\n&gt;The same could not be said for his blue button-down, the blood stains sending it straight to the trash can.  He’d helped himself to a bright red Morgantown Schools shirt, complete with pearl snaps down the front and a block-letter embroidered ‘MSD’ above the pocket.  \n\nThanks.",
        "created_utc": 1532738547,
        "upvote_ratio": ""
    },
    {
        "title": "Indirect object question",
        "author": "ImprobableSnowman",
        "url": "https://www.reddit.com/r/grammar/comments/92gua7/indirect_object_question/",
        "text": "Why does \"Giovanna is buying the book\" contain a direct object (book), but \"Maria will speak to Luigi\" contain an indirect object (Luigi)?\n\nIs it because Luigi is the object of \"to\"?  And because Luigi is \"getting\" the speech, he is an indirect object?",
        "created_utc": 1532729064,
        "upvote_ratio": ""
    },
    {
        "title": "How would I properly caption my photo?",
        "author": "wowzahs098",
        "url": "https://www.reddit.com/r/grammar/comments/92gpco/how_would_i_properly_caption_my_photo/",
        "text": "Excuse me if it’s obvious, but I’m torn between three different captions, and I’m not sure which one is correct.\n\nFinally saw some Picasso’s.\nFinally saw some Picassos.\nFinally saw some Picassos’.\n\nFeedback would be appreciated, thanks!",
        "created_utc": 1532728025,
        "upvote_ratio": ""
    },
    {
        "title": "Is it redundant to say “the bottom line is...” when that sentence is actually the bottom line?",
        "author": "Mohskito",
        "url": "https://www.reddit.com/r/grammar/comments/92gh6z/is_it_redundant_to_say_the_bottom_line_is_when/",
        "text": "Edit: A kind redditor suggested I write an example so that they can help me solve this issue. Isn’t that nice? You guys are taking time out of your day to help me sound smarter and more educated. Bottom line: this is why I love reddit. ",
        "created_utc": 1532726345,
        "upvote_ratio": ""
    },
    {
        "title": "We need an answer!",
        "author": "Bigfatass12",
        "url": "https://www.reddit.com/r/grammar/comments/92gezj/we_need_an_answer/",
        "text": "I was headed to a store with my wife. “Do they have something there?” She asked. “They don’t,” I replied. “but do you know where does?”    \n“Do you know where does” has puzzled and confounded is for months (maybe even a year). Please help!  Is this a grammatically correct statement?",
        "created_utc": 1532725892,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best way to say “getting off was way easier without snow”",
        "author": "darealsneaktalk",
        "url": "https://www.reddit.com/r/grammar/comments/92g3gq/what_is_the_best_way_to_say_getting_off_was_way/",
        "text": "",
        "created_utc": 1532723599,
        "upvote_ratio": ""
    },
    {
        "title": "The commas that cost companies millions",
        "author": "SandalVulvage",
        "url": "http://www.bbc.com/capital/story/20180723-the-commas-that-cost-companies-millions",
        "text": "",
        "created_utc": 1532722227,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any problems with this inscription?",
        "author": "PleaseHelpMeFind2018",
        "url": "https://www.reddit.com/r/grammar/comments/92fp4y/are_there_any_problems_with_this_inscription/",
        "text": "If anyone can help, I'm writing this in a book that I'm giving to my little sister. \n\nName,\n\nI have watched you grow into a smart, talented, and amazing woman. You have accomplished so much already. I know that there have been times of struggle, but you have overcome them admirably. I hope that this book can help you as you continue. While there will undoubtably be more times of adversity in your life, I know that you are capable of persevering. You’ve already proven it. Let your faith and devotion help guide you as you determine your next steps.\n\nLove,\n\nMe",
        "created_utc": 1532720722,
        "upvote_ratio": ""
    },
    {
        "title": "This makes me angry every time I start a Civ game.",
        "author": "[deleted]",
        "url": "https://i.redd.it/n5kaxl2fajc11.png",
        "text": "[deleted]",
        "created_utc": 1532716131,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to correct my grammar for the GRE: Using quotes to highlight words.",
        "author": "dude8462",
        "url": "https://www.reddit.com/r/grammar/comments/92et9q/trying_to_correct_my_grammar_for_the_gre_using/",
        "text": "I have to do a analytical writing section of the GRE, which includes a few essay types. One of them is the argument type, where you analyze an argument for assumptions. I was using quotes to highlight a particular use of a word and describe assumptions by it's word choice. Here is an example from my essay:\n\nSurveys can be a tricky thing to base your opinions off of. This survey found that typical jazz fans spend around 1000 $ annually on \"jazz entertainment\". C - note developers would like us to believe that \"jazz entertainment\" relates to going to jazz clubs, but it could also relate to purchasing Cd's, memorabilia, instruments, or going to concerts. We simply do not know how the study defined jazz entertainment. \n\nHere I put \"jazz entertainment\" in quotes because the phrase held a lot of assumptions with it. I normally do this in my informal text, and was wondering if this was considered grammatically correct for an essay. ",
        "created_utc": 1532714503,
        "upvote_ratio": ""
    },
    {
        "title": "For an initialism in a game I play, there is a character called a “serial killer”, that is abbreviated as “sk”. When referring to it, do you say “a sk” or “an sk”?",
        "author": "seth1299",
        "url": "https://www.reddit.com/r/grammar/comments/92e2cj/for_an_initialism_in_a_game_i_play_there_is_a/",
        "text": "“An sk” seems more grammatically correct, but saying “an serial killer” is completely grammatically wrong.",
        "created_utc": 1532709393,
        "upvote_ratio": ""
    },
    {
        "title": "What are the sites, where I can practice my grammar?",
        "author": "julia0212",
        "url": "https://www.reddit.com/r/grammar/comments/92dzd0/what_are_the_sites_where_i_can_practice_my_grammar/",
        "text": "I want to find a site, where I will see an explanation of the rule and then practice exercises. The best option will be if there are explanations for each exercise (why chosen option is right or not). The site I used is [https://www.englishrevealed.co.uk/fce\\_grammar.php](https://www.englishrevealed.co.uk/fce_grammar.php) However, I want to practice with more advanced topics and exercises.",
        "created_utc": 1532708818,
        "upvote_ratio": ""
    },
    {
        "title": "when the act is forceful and extreme or when the act are forceful and extreme",
        "author": "6elixircommon",
        "url": "https://www.reddit.com/r/grammar/comments/92d1go/when_the_act_is_forceful_and_extreme_or_when_the/",
        "text": "",
        "created_utc": 1532702148,
        "upvote_ratio": ""
    },
    {
        "title": "What are some polite and concise alternatives to \"I don't care\"?",
        "author": "KristinaAlves",
        "url": "https://www.reddit.com/r/grammar/comments/92cvlm/what_are_some_polite_and_concise_alternatives_to/",
        "text": "",
        "created_utc": 1532700922,
        "upvote_ratio": ""
    },
    {
        "title": "A software to correct grammar and explain why?",
        "author": "TheYoungerM",
        "url": "https://www.reddit.com/r/grammar/comments/92cklf/a_software_to_correct_grammar_and_explain_why/",
        "text": "I'm a native English speaker, teaching vocabulary to my non-native friends. A lot of times, the sentences they make have grammar errors, which I correct, but I cannot explain why it's wrong. I don't know the grammar. I realized that google corrects simple grammar mistakes in its search bar, so I wonder, is there a software that can do the same and explain the error?\n\nOn a sidenote, is there a \\*\\*small\\*\\* book I can read to help me help them?",
        "created_utc": 1532698619,
        "upvote_ratio": ""
    },
    {
        "title": "From the time he was a little boy he had had outlandish habits.",
        "author": "Trylon2",
        "url": "https://www.reddit.com/r/grammar/comments/92c7nh/from_the_time_he_was_a_little_boy_he_had_had/",
        "text": "This **had had** part left me bewildered. Why not just say\n\n&gt;From the time he was a little boy he **had** outlandish habits.",
        "created_utc": 1532695648,
        "upvote_ratio": ""
    },
    {
        "title": "\"Including but not limited to?\"",
        "author": "KingOfSquirrels",
        "url": "https://www.reddit.com/r/grammar/comments/92bzcj/including_but_not_limited_to/",
        "text": "Can someone explain to me how much I will be earning?\n\n\"Your salary is £18000 per annum, less any lawful deductions, including but not limited to tax and national insurance\"\n\nDoes this mean I earn £18000, including tax and national insurance? Or am I going to be earning less due to tax and NI?\n\nThanks",
        "created_utc": 1532693613,
        "upvote_ratio": ""
    },
    {
        "title": "Can you shorten \"nothing will\" to \"nothing'll\"?",
        "author": "megamoo7",
        "url": "https://www.reddit.com/r/grammar/comments/92bn64/can_you_shorten_nothing_will_to_nothingll/",
        "text": "Can you shorten \"nothing will happen\" to \"nothing'll happen\"?  The little red squiggly line says no, but I'm sure I've heard it spoken that way. Or perhaps it sounds like that when said quickly?  It is for dialogue in a fictional story. ",
        "created_utc": 1532690321,
        "upvote_ratio": ""
    },
    {
        "title": "What are your favorite compound words, and why?",
        "author": "justwannajust",
        "url": "https://www.reddit.com/r/grammar/comments/92bkof/what_are_your_favorite_compound_words_and_why/",
        "text": "",
        "created_utc": 1532689591,
        "upvote_ratio": ""
    },
    {
        "title": "Should I add a comma before ‘not’ here? Why?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/92bcjc/should_i_add_a_comma_before_not_here_why/",
        "text": "[deleted]",
        "created_utc": 1532687089,
        "upvote_ratio": ""
    },
    {
        "title": "Can the phrase \"Danish school\" be used to mean \"the Danish school system\"?",
        "author": "h8bit",
        "url": "https://www.reddit.com/r/grammar/comments/92avi5/can_the_phrase_danish_school_be_used_to_mean_the/",
        "text": "Hi!\n\nI have a very specific problem that I'm having trouble finding an answer to on my own. It has to do with the word *school* when it is modified by an adjective of nationality like *Danish*. I want to express the following sentiment: \"The school system in Denmark is the most valuable thing we have.\" I am restricted by the number of letters I can use, so I have to shorten it a bit. There seems to be a gap in my knowledge of idiomatic English here, however, and I can't hear if the following is correct or not:\n\n*Danish school is the most important thing we have.*\n\nDoes that mean what I want it to mean, and is it idiomatic? If not, what can I change to convey the correct meaning in idiomatic English in as little space as possible? I considered adding the definite article:\n\n*The Danish school is the most important thing we have.*\n\n...but again I am unsure if this will be understood to mean what I want it to mean, or if the reader will think I'm talking about a specific school.\n\nIt is frustrating beyond words that I can't seem to find an answer on my own, so I hope one of you can help me. I tried googling about four million variations of phrases involving the word *school* modified by an adjective of nationality, but the majority of hits on such searches have to do with specific schools like *The Danish School of New York* etc.\n\nThanks!",
        "created_utc": 1532681540,
        "upvote_ratio": ""
    },
    {
        "title": "Ex1) I didn’t know you (had or has) a dog. Ex2) I didn’t know the crowbar (says or said) Supreme &lt;~~ I know the answers are had and said but can someone please drop a link in the comment section to a website where I can teach my self about this.",
        "author": "g7val",
        "url": "https://www.reddit.com/r/grammar/comments/92anxn/ex1_i_didnt_know_you_had_or_has_a_dog_ex2_i_didnt/",
        "text": "",
        "created_utc": 1532678913,
        "upvote_ratio": ""
    },
    {
        "title": "Pet peeves:",
        "author": "SamEvansRobertson",
        "url": "https://www.reddit.com/r/grammar/comments/929wgz/pet_peeves/",
        "text": "[removed]",
        "created_utc": 1532670349,
        "upvote_ratio": ""
    },
    {
        "title": "Value workshops or values workshops?",
        "author": "ayushyadav96",
        "url": "https://www.reddit.com/r/grammar/comments/929hbc/value_workshops_or_values_workshops/",
        "text": "“I have attended several value/values workshops in the past”",
        "created_utc": 1532666152,
        "upvote_ratio": ""
    },
    {
        "title": "Let as act and not shrink.for fear our motives be misunderstood.",
        "author": "Blubberskate",
        "url": "https://www.reddit.com/r/grammar/comments/928uou/let_as_act_and_not_shrinkfor_fear_our_motives_be/",
        "text": "\"Let us act and not shrink for fear our motives be misunderstood.\"\n\nI don't understand how the grammar and syntax works in this sentence. Can someone explain this to me? Thanks",
        "created_utc": 1532660249,
        "upvote_ratio": ""
    },
    {
        "title": "Should do and doing it...can someone help?",
        "author": "kokochocho",
        "url": "https://www.reddit.com/r/grammar/comments/928pjq/should_do_and_doing_itcan_someone_help/",
        "text": "My Korean friend asked me for some help with a grammar question. English is her second language, but she speaks pretty fluently. Her question really has me stumped. \n\nShe sent me a picture with a phrase that states, “Wisdom: finding out what you should do and doing it”. \n\nIs this even grammatically correct? Her question/ to we’re:\nWhat is the difference between \"do\" and \"doing it\" here? Aren’t these both present participle? Why did they write it twice?\n\nI really would appreciate any help!!",
        "created_utc": 1532658968,
        "upvote_ratio": ""
    },
    {
        "title": "\"Where were...\" question",
        "author": "AbsoluteLedge",
        "url": "https://www.reddit.com/r/grammar/comments/927v4o/where_were_question/",
        "text": "I know when we use the phrase \"where were\", it usually applies to they (ie: where were they?)  \n\nBut say if I wanted to know the location of A&amp;B, do I say \"where were A &amp; B?\" or \"where was A &amp; B?\"  \n\nThanks!",
        "created_utc": 1532651843,
        "upvote_ratio": ""
    },
    {
        "title": "Unsure of whether to use past tense or present tense in this example.",
        "author": "ShivVGC",
        "url": "https://www.reddit.com/r/grammar/comments/927uar/unsure_of_whether_to_use_past_tense_or_present/",
        "text": "\"Both agreed that it was inevitable and that they needed to talk with Jiggly and Puff sometime before they arrive in New Mawile City.\"\n\nor\n\n\"Both agree that it was inevitable and that they needed to talk with Jiggly and Puff sometime before they arrived in New Mawile City.\"\n\nBasically, arrive or arrived?",
        "created_utc": 1532651667,
        "upvote_ratio": ""
    },
    {
        "title": "Is using had in this example wrong?",
        "author": "ShivVGC",
        "url": "https://www.reddit.com/r/grammar/comments/927l74/is_using_had_in_this_example_wrong/",
        "text": "A few minutes had passed when he stood in the driveway. \n\nor\n\nA few minutes passed when he stood in the driveway.",
        "created_utc": 1532649592,
        "upvote_ratio": ""
    },
    {
        "title": "Help please!",
        "author": "Penguinpreacher",
        "url": "https://www.reddit.com/r/grammar/comments/9268ki/help_please/",
        "text": "Hi guys. What sound better to you...\n\nI'll love you now and forever and every seconf **BETWEEN.**\n\nI'll love you now and forever and every seconf **INBETWEEN.**\n\nSorry but english isn't my native language and I sometimes strugle with this kind of stuff",
        "created_utc": 1532639403,
        "upvote_ratio": ""
    },
    {
        "title": "Why is it \"than previously thought,\" not \"than they previously thought\"?",
        "author": "Epik132",
        "url": "https://www.reddit.com/r/grammar/comments/925ybg/why_is_it_than_previously_thought_not_than_they/",
        "text": "Title says it all. Here's the full sentence:\n\n\"Threatened coral reefs have long been an outcry for ecologists and conversationalists, but this new research suggests that the degradation of coral reefs could have far longer lasting effects _than_ previously thought.\"\n---\nThe answer is \"no change,\" but why couldn't it be \"than they\"? Is it grammatically correct both ways and simply a conciseness issue?\n\n",
        "created_utc": 1532637414,
        "upvote_ratio": ""
    },
    {
        "title": "All the vs All of the",
        "author": "pantsdeleon",
        "url": "https://www.reddit.com/r/grammar/comments/925r5x/all_the_vs_all_of_the/",
        "text": "Both of these are correct:\n\n\"All the king's horses and all the king's men\"\n\nor\n\n\"All of the king's horses and all of the king's men\"\n\nIncluding the \"of\" seems optional, and sometimes a matter of personal style as it does slightly change the feel of the phrase, but I'm wondering if anyone knows the name for this part of speech or this grammatical principle? ",
        "created_utc": 1532636066,
        "upvote_ratio": ""
    },
    {
        "title": "“I have read and understand the statement”.",
        "author": "DevilRyder",
        "url": "https://www.reddit.com/r/grammar/comments/925l1i/i_have_read_and_understand_the_statement/",
        "text": "Can you have a past tense and present tense verb in the same sentence?",
        "created_utc": 1532634907,
        "upvote_ratio": ""
    },
    {
        "title": "Which sentence is punctuated correctly? I wrote all three but cannot decide which one is punctually correct.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/925h65/which_sentence_is_punctuated_correctly_i_wrote/",
        "text": "[deleted]",
        "created_utc": 1532634151,
        "upvote_ratio": ""
    },
    {
        "title": "Is it “log in to” the website or “log into” the website?",
        "author": "alebv232523",
        "url": "https://www.reddit.com/r/grammar/comments/925d27/is_it_log_in_to_the_website_or_log_into_the/",
        "text": "",
        "created_utc": 1532633355,
        "upvote_ratio": ""
    },
    {
        "title": "My brain is not working any longer; is the use of \"whom\" required here?",
        "author": "Dauntlessthinker",
        "url": "https://www.reddit.com/r/grammar/comments/9256og/my_brain_is_not_working_any_longer_is_the_use_of/",
        "text": "Thus, the focus on using racial statistics to determine who to target as potential threats tells society more about society than it does about the potential criminals",
        "created_utc": 1532632114,
        "upvote_ratio": ""
    },
    {
        "title": "Who/Whom did we take from you? Who/Whom have you lost?",
        "author": "_Lanka_",
        "url": "https://www.reddit.com/r/grammar/comments/924z5e/whowhom_did_we_take_from_you_whowhom_have_you_lost/",
        "text": "From a movie trailer, sounded odd to me.",
        "created_utc": 1532630731,
        "upvote_ratio": ""
    },
    {
        "title": "Singular they and verbs",
        "author": "cchings",
        "url": "https://www.reddit.com/r/grammar/comments/924ywx/singular_they_and_verbs/",
        "text": "When referring to a single individual that is nonbinary or of an unspecified gender as they, do you use singular or plural verbs?",
        "created_utc": 1532630686,
        "upvote_ratio": ""
    },
    {
        "title": "When using “an” before an adjective",
        "author": "stgrdr",
        "url": "https://www.reddit.com/r/grammar/comments/924k5g/when_using_an_before_an_adjective/",
        "text": "When using an adjective that starts with a vowel before a noun that starts with a consonant, do you say “an”? Example: “a asshole design” vs “an asshole design”",
        "created_utc": 1532627894,
        "upvote_ratio": ""
    },
    {
        "title": "Does this make sense",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/92482f/does_this_make_sense/",
        "text": "[deleted]",
        "created_utc": 1532625619,
        "upvote_ratio": ""
    },
    {
        "title": "Than vs. Then question",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/923xn0/than_vs_then_question/",
        "text": "[deleted]",
        "created_utc": 1532623690,
        "upvote_ratio": ""
    },
    {
        "title": "What's this grammar thing called?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/923qun/whats_this_grammar_thing_called/",
        "text": "[deleted]",
        "created_utc": 1532622417,
        "upvote_ratio": ""
    },
    {
        "title": "The phrase \"full of\"",
        "author": "jnt85",
        "url": "https://www.reddit.com/r/grammar/comments/922ne7/the_phrase_full_of/",
        "text": "Can someone explain to me why \"full of history\" is correct, but \"full of fashion\" is wrong?\n\nA friend is asking me and I can't find a way to explain it.\n\nAlso, when can I use the phrase \"full of\"?",
        "created_utc": 1532614671,
        "upvote_ratio": ""
    },
    {
        "title": "Using \"have had\" to describe something that has happened and continues to happen",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/9225ub/using_have_had_to_describe_something_that_has/",
        "text": "[deleted]",
        "created_utc": 1532610973,
        "upvote_ratio": ""
    },
    {
        "title": "Use of \"did not\" at the end of a sentence.",
        "author": "MidEUW",
        "url": "https://www.reddit.com/r/grammar/comments/9223rq/use_of_did_not_at_the_end_of_a_sentence/",
        "text": "Hello,\nIs it correct to end a sentence comparing two objects with \"did not\" at the end? For example, \"This study compared a system using xpto software with another system which did not.\"",
        "created_utc": 1532610518,
        "upvote_ratio": ""
    },
    {
        "title": "So when exactly so we use ; and -",
        "author": "karimyamout",
        "url": "https://www.reddit.com/r/grammar/comments/921vo6/so_when_exactly_so_we_use_and/",
        "text": "",
        "created_utc": 1532608614,
        "upvote_ratio": ""
    },
    {
        "title": "Is \"whenever this day comes up\" correct?",
        "author": "yasser_negm",
        "url": "https://www.reddit.com/r/grammar/comments/921jkg/is_whenever_this_day_comes_up_correct/",
        "text": "I'm reffing to my graduation day, I wrote \"I hope that whenever this day comes up, I'll only remember the good times\".\n\nSo, is it correct in terms of grammar and meaning overall?",
        "created_utc": 1532605573,
        "upvote_ratio": ""
    },
    {
        "title": "Think strategic or strategically",
        "author": "redbulls2014",
        "url": "https://www.reddit.com/r/grammar/comments/920va1/think_strategic_or_strategically/",
        "text": "Q : If we think ____,we can come up with a plan that promises success.\n\n(A) strategic (B) strategically\n\nThe answer is A as stated in my book, please help me explain why as I think both A and B works.",
        "created_utc": 1532598396,
        "upvote_ratio": ""
    },
    {
        "title": "Whoever or Whomever?",
        "author": "brangorm",
        "url": "https://www.reddit.com/r/grammar/comments/91zv88/whoever_or_whomever/",
        "text": "I’m trying to figure out whether or not this sentence is correct.\n\n“This message is sent to whoever reads it.”\n\nAt first it seems obviously wrong - “whomever” should the object of the preposition “to”. But I analyzed it further and thought about how the object of the preposition is more accurately described as the noun phrase “(whoever reads it)”. If this is true, then “whoever” is actually doing an action (reading) within the noun phrase “whoever reads it”. Thus, because it is the subject within that noun phrase, “whoever” makes sense.\n\nSo, which is it? I’m having trouble writing “to whoever” so it would help if someone else thought it made sense.",
        "created_utc": 1532586872,
        "upvote_ratio": ""
    },
    {
        "title": "I'm in a coma, I need a comma specialist!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/91ylzw/im_in_a_coma_i_need_a_comma_specialist/",
        "text": "[deleted]",
        "created_utc": 1532574324,
        "upvote_ratio": ""
    },
    {
        "title": "“Passed” or “Past”",
        "author": "DevilRyder",
        "url": "https://www.reddit.com/r/grammar/comments/91ydiw/passed_or_past/",
        "text": "When do you use them?",
        "created_utc": 1532572298,
        "upvote_ratio": ""
    },
    {
        "title": "“Memory” as a non-count noun in a technical computing setting.",
        "author": "Bad_Fashion",
        "url": "https://www.reddit.com/r/grammar/comments/91yb4e/memory_as_a_noncount_noun_in_a_technical/",
        "text": "Hey everyone, I’m currently editing a document with a lot of technical computer terminology. The original author, on multiple occasions, wrote, “the at least one memory” in reference to a computer’s memory. My instinct is that it should read, “at least one memory *device*” or “at least one *type* of memory” however, they’ve written it so many times that now I’m starting to second guess myself. \n\nIs computer memory a non-count noun in a technical setting? There is no such thing as just “*a* computer memory”, correct? ",
        "created_utc": 1532571727,
        "upvote_ratio": ""
    },
    {
        "title": "Need help writing an inspiring quote",
        "author": "doesntitmatter",
        "url": "https://www.reddit.com/r/grammar/comments/91y71q/need_help_writing_an_inspiring_quote/",
        "text": "\"Don't be the type of person where if you were to meet your own self, then you wouldn't enjoy your own company.\"\n\nHow can I make this more consice and easy to understand without making grammatical errors?",
        "created_utc": 1532570783,
        "upvote_ratio": ""
    },
    {
        "title": "Spotted: one of us.",
        "author": "swissviss",
        "url": "https://i.redd.it/u336xlkc37c11.jpg",
        "text": "",
        "created_utc": 1532568458,
        "upvote_ratio": ""
    },
    {
        "title": "What verb tense should I use with \"whenever\" ?",
        "author": "yasser_negm",
        "url": "https://www.reddit.com/r/grammar/comments/91xtpc/what_verb_tense_should_i_use_with_whenever/",
        "text": "\" Anyway, I hope that whenever this day comes up, I'll only remember the good times, and I won't remember how awful were those days.\" Talking about my graduation and the days of college.\n\nAlso if I want to use the verb \"forget\" instead of \"won't remember\" , what verb tense should I use? \nLike: whenever this day comes up I hope that I \"had forgotten\" all of this.",
        "created_utc": 1532567651,
        "upvote_ratio": ""
    },
    {
        "title": "Is \"hadn't gone outside\" grammatically correct?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/91x1nw/is_hadnt_gone_outside_grammatically_correct/",
        "text": "It is obviously an acceptable sentence in terms of common english, but do participial tenses not also abide by the \"split infinitive\" rule such that \"had\" and \"gone\" need to be right next to each other?",
        "created_utc": 1532561506,
        "upvote_ratio": ""
    },
    {
        "title": "Home - Jackson County Animal Clinic",
        "author": "fernandaconnell",
        "url": "http://www.vethospitalofjacksoncounty.com",
        "text": "",
        "created_utc": 1532561327,
        "upvote_ratio": ""
    },
    {
        "title": "Help! That's or that are in a sentence context?",
        "author": "djtopcat",
        "url": "https://www.reddit.com/r/grammar/comments/91wzlz/help_thats_or_that_are_in_a_sentence_context/",
        "text": "I saw an article today where the author wrote this.  \n\n\n\"Human beings are the only species that's not smart enough\"  That sounds wrong to me.   \n\n\nShouldn't it be \"Human beings are the only species that are not smart enough\"?   thx",
        "created_utc": 1532561075,
        "upvote_ratio": ""
    },
    {
        "title": "Tell them \"No\" or Tell them no (without quotes)",
        "author": "BathRoman",
        "url": "https://www.reddit.com/r/grammar/comments/91vw3h/tell_them_no_or_tell_them_no_without_quotes/",
        "text": "I'm writing a story in which the following happens:\n\n&gt;\"If I tell you something, you promise not to get mad?\"  \n&gt;  \n&gt;If someone ever asks you this question, tell them \"no.\"\n\nSo I'm not sure if that \"no\" is supposed to be in quotes or not. Are there rules about this?",
        "created_utc": 1532553016,
        "upvote_ratio": ""
    },
    {
        "title": "Is it grammatically correct to say “they have more experiences than you, and are therefore eligible for giving advise”?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/91vcba/is_it_grammatically_correct_to_say_they_have_more/",
        "text": "[deleted]",
        "created_utc": 1532549279,
        "upvote_ratio": ""
    },
    {
        "title": "SAT Paragraph Sequencing - Quotes or \"Body\"?",
        "author": "Epik132",
        "url": "https://www.reddit.com/r/grammar/comments/91vb5f/sat_paragraph_sequencing_quotes_or_body/",
        "text": "If these two paragraphs both talk about the same thing, which would logically be more sequential? \n\n1. Quote - \"The Black Death in medieval Europe was caused by a variant of Y. pestis that may no longer exist,\" wrote the researchers, led by Hendrik and Johannes.\n-\n2. Paragraph - Researchers in the recent study believed the modern plague and the plague of the 14th century were both caused by the same bacterium (Y. pestis). They suspected that there are different versions of Y. pestis - one that caused the very serious plague years ago.\n-",
        "created_utc": 1532549075,
        "upvote_ratio": ""
    },
    {
        "title": "what is the word for . . .",
        "author": "prenzzu",
        "url": "https://www.reddit.com/r/grammar/comments/91u0ji/what_is_the_word_for/",
        "text": "What is the word for being intimate with someone but you don't love him/her? ",
        "created_utc": 1532540506,
        "upvote_ratio": ""
    },
    {
        "title": "Does this senetence use the word \"wishes\" correctly?",
        "author": "BerkeleyNONO",
        "url": "https://www.reddit.com/r/grammar/comments/91t3io/does_this_senetence_use_the_word_wishes_correctly/",
        "text": "He went to see his dying cousin under the wishes of his mother.",
        "created_utc": 1532534452,
        "upvote_ratio": ""
    },
    {
        "title": "Check out this review of a local Barbershop.",
        "author": "charlesboymary",
        "url": "https://i.redd.it/nxxu3odl14c11.jpg",
        "text": "",
        "created_utc": 1532531543,
        "upvote_ratio": ""
    },
    {
        "title": "I translated my portfolio from German to English! You want to help me find some mistakes?",
        "author": "WhyNotABanana",
        "url": "https://www.reddit.com/r/grammar/comments/91rsce/i_translated_my_portfolio_from_german_to_english/",
        "text": "[removed]",
        "created_utc": 1532525010,
        "upvote_ratio": ""
    },
    {
        "title": "which witch is wich?",
        "author": "WorstTeammate",
        "url": "https://www.reddit.com/r/grammar/comments/91r35d/which_witch_is_wich/",
        "text": "Not native English speaker here.\nI can never remember which word is what. \nI often use wrong words because I don't remember what word is what.\n\"..he hated  blue, **witch** is why he painted it red\" \n\nIs there a rule that will help me remember what word is what, and how they're spelled?",
        "created_utc": 1532518954,
        "upvote_ratio": ""
    },
    {
        "title": "I see opportunities everywhere, not I see opportunities are everywhere.",
        "author": "JudgeDreadnought",
        "url": "https://www.reddit.com/r/grammar/comments/91qp33/i_see_opportunities_everywhere_not_i_see/",
        "text": "What's the rule on display here?",
        "created_utc": 1532514949,
        "upvote_ratio": ""
    },
    {
        "title": "Capital or no capital?",
        "author": "bp5678",
        "url": "https://www.reddit.com/r/grammar/comments/91qi9h/capital_or_no_capital/",
        "text": " Should these departments (eg recruitment, sales) have capital letters in these examples:  \n\n\n\"**Summer** is a busy time for our recruitment team\"  \n\n\n\"Once **Recruitment** has built up a '100-strong team\"  \n\n\n\"This summer has seen our **sales** team working as hard as ever.\"  \n\n\n\"Our small but friendly **sales** team will ensure your family is put into the best room\". ",
        "created_utc": 1532512874,
        "upvote_ratio": ""
    },
    {
        "title": "What determines if a verb takes an 's' in these examples?",
        "author": "shinjirarehen",
        "url": "https://www.reddit.com/r/grammar/comments/91qa0x/what_determines_if_a_verb_takes_an_s_in_these/",
        "text": "What determines whether the verb has an *s* on it in these examples?\n\n&gt; If he fails....\n\n&gt; If they fail...\n\n&gt; If you fail....\n\n*You* and *he* are singular (I know you can be plural, but for the sake of this example, it's singular), so it's not number.\n\n*He* and *they* are both third person, so it's not person.\n\nIs there some other concept here I am not aware of?\n\nI started thinking about this in the context of using *they* as a singular gender neutral third person pronoun (controversial, I know). I'd assume it would take the same verb forms as *he* and *she*, but \"If they fails\" sounds so wrong.",
        "created_utc": 1532510220,
        "upvote_ratio": ""
    },
    {
        "title": "Is \"appending something to the end of a file name\" a redundant sentence?",
        "author": "cayal3",
        "url": "https://www.reddit.com/r/grammar/comments/91p2b0/is_appending_something_to_the_end_of_a_file_name/",
        "text": "",
        "created_utc": 1532496732,
        "upvote_ratio": ""
    },
    {
        "title": "Can you say \"come in to the outside\" ?",
        "author": "pinkzeppelinx",
        "url": "https://www.reddit.com/r/grammar/comments/91ocyr/can_you_say_come_in_to_the_outside/",
        "text": "",
        "created_utc": 1532490048,
        "upvote_ratio": ""
    },
    {
        "title": "Not pursue vs not to pursue.",
        "author": "futureventura",
        "url": "https://www.reddit.com/r/grammar/comments/91njpb/not_pursue_vs_not_to_pursue/",
        "text": "One of my students had a question about a sentence construction that I didn't have an answer for. \n\nThe original sentence is as follows. \n\n&gt;The victim can request the police not pursue charges against the perpetrator. \n\nThey asked why the following two constructions would then be incorrect. \n\n&gt;The victims can request the police not to pursue charges against the perpetrator. \n\nAND \n\n&gt;The victims can request that the police not to pursue charges against the perpetrator. \n\nThe only explanation I can give as to why these two sentences are not grammatically sound is that they sound funny, but I'm not satisfied with this answer and it's not particularly helpful to the student. \n\nCan someone please explain this to me? ",
        "created_utc": 1532483002,
        "upvote_ratio": ""
    },
    {
        "title": "This is not a joke.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/91n7yk/this_is_not_a_joke/",
        "text": "[deleted]",
        "created_utc": 1532480303,
        "upvote_ratio": ""
    },
    {
        "title": "What is the subject of this sentence?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/91n5z5/what_is_the_subject_of_this_sentence/",
        "text": "[deleted]",
        "created_utc": 1532479833,
        "upvote_ratio": ""
    },
    {
        "title": "Unraveled vs unravelled",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/91n3ym/unraveled_vs_unravelled/",
        "text": "[deleted]",
        "created_utc": 1532479389,
        "upvote_ratio": ""
    },
    {
        "title": "Can you help me with a doubt about participle clauses?",
        "author": "luchorz93",
        "url": "https://www.reddit.com/r/grammar/comments/91n18p/can_you_help_me_with_a_doubt_about_participle/",
        "text": "Hello everybody I come here because I need some help. I'm studying for a Grammar test and I'm having some problems undertanding Participle Clauses.\n\nThis would be the second time I sit for this exam. The first time I had several mistakes but there was one point where I felt absolutely lost.\n\nThe point said \"Rewrite the sentences using participle clauses\"\n\nI would leave the sentences here, below them you would find my original answers with the teacher's corrections (Right or Wrong). Finally below my answers I wrote my corrections based on what I have read about the topic. I just want to know if my new answers are right and in case they aren't I would like to know why.\n\nThanks in advance!\n\n1. ***Flying over the Sahara desert, I realized just how enormous it is***\n\n**My answer:** Flying over the Sahara desert, I realized just how enormous it is. (Right)\n\n***2. If an injury is cleaned immediately, it usually heals up quickly.***\n\n**My answer:** Cleaning an injury immediately usually make it heals up quickly. (Wrong)\n\n**2nd Answer:** Cleaned immediately, an injury usually heals up quickly.\n\n***3. After they had walked all day, they at last reached the remote village.***\n\n**My answer:** After walking all day, they at last reached the remote village. (Wrong)\n\n**2nd Answer:** Having walked all day, they at last reached the remote village.\n\n***4. It snowed heavily for hours, with the result that all the roads were blocked.***\n\n**My answer:** It snowed heavily for hours, resulting in all roads blocked (Wrong)\n\n**2nd Answer**: Having snowed heavily for hours, all roads resulted blocked.\n\n***5. As they felt hungry, the four travellers stopped at a small café.***\n\n**My answer:** Feeling hungry, the four travellers stopped at a small café. (Right)\n\n***6. I set the alarm clock before I went to bed because I didn’t want to oversleep.***\n\n**My answer**: Before going to bed I set the alarm clock because I didn’t want to oversleep (Wrong)\n\n**2nd Andwer:** Not wanting to oversleep, I set the alarm clock before I went to bed",
        "created_utc": 1532478760,
        "upvote_ratio": ""
    },
    {
        "title": "Help with sentence on medical personal statement.",
        "author": "Pupsinmytub",
        "url": "https://www.reddit.com/r/grammar/comments/91i3st/help_with_sentence_on_medical_personal_statement/",
        "text": "Does this sentence have grammar or punctuation errors? \n\n\nIf contributing in even the smallest ways - transporting a patient, stacking supplies, even holding a hand - could be this edifying, then healthcare was more than just an option for me, it was a calling. ",
        "created_utc": 1532444259,
        "upvote_ratio": ""
    },
    {
        "title": "Clouding vision",
        "author": "Pedobear831",
        "url": "https://www.reddit.com/r/grammar/comments/91htlv/clouding_vision/",
        "text": "Is clouding vision correct? Or is clouding being used incorrectly?",
        "created_utc": 1532442193,
        "upvote_ratio": ""
    },
    {
        "title": "The number one most unpredictable person!",
        "author": "AEatS",
        "url": "https://www.reddit.com/r/grammar/comments/91hay4/the_number_one_most_unpredictable_person/",
        "text": "I was wondering if the MOST in \"The number one MOST unpredictable person!\" is completly unnecessary or is ok to br there? Or maybe get rid of \"number one\"?\n",
        "created_utc": 1532438228,
        "upvote_ratio": ""
    },
    {
        "title": "My leaving or me leaving?",
        "author": "Georgiebabypie",
        "url": "https://www.reddit.com/r/grammar/comments/91gafs/my_leaving_or_me_leaving/",
        "text": "What is the grammatical term for using my/his/her/their and an ‘ing’ word? \n\nE.g: does anyone object to my leaving/ does anyone object to me leaving. \n\nWhy is the former correct, and is the latter incorrect? \n\nThanks! ",
        "created_utc": 1532429034,
        "upvote_ratio": ""
    },
    {
        "title": "Dinosaur robot, or robot dinosaur?",
        "author": "zheyangtinghao",
        "url": "https://www.reddit.com/r/grammar/comments/91g0pw/dinosaur_robot_or_robot_dinosaur/",
        "text": "Which one is correct, please?  \n",
        "created_utc": 1532426149,
        "upvote_ratio": ""
    },
    {
        "title": "Question related to Direct and Indirect Objects",
        "author": "xeonn01",
        "url": "https://www.reddit.com/r/grammar/comments/91fvt3/question_related_to_direct_and_indirect_objects/",
        "text": "Hey guys, just a quick grammar check for two sentences:\n\nShe taught English to me.\n\n\\---&gt; English = Direct Object, me = Indirect Object and Object of Preposition \"to\"\n\n\\^ Kindly confirm if my understanding is correct.\n\nShe taught me English.\n\n\\---&gt; me = Direct Object, English = ???\n\n\\^ What is \"English\" here? Is it the Indirect Object?\n\n\\------------------------------------------------------------------- The above is clear.\n\nFollow-up question:\n\nElla shot an arrow at Lucian.\n\n\\---&gt; arrow = DO, Lucian is the IO.\n\nElla shot Lucian WITH an arrow.\n\n\\---&gt; Is Lucian now the DO? I ask because \"arrow\" doesn't look like it can be a DO here. It looks like an object of the preposition \"with.\"",
        "created_utc": 1532424542,
        "upvote_ratio": ""
    },
    {
        "title": "Frolicing or Frolicking?",
        "author": "IronclawFTW",
        "url": "https://www.reddit.com/r/grammar/comments/91f6q8/frolicing_or_frolicking/",
        "text": "I see both being used on Google. I learned in school once it was \"Frolicing\", but can't be sure. I of course mean the word to goof around, having fun, doing silly things.\n\nJust noticed the spell-checker here gives the red line under \"Frolicing\", but not \"Frolicking\", so guess it IS \"Frolicking\"?. The plain word is \"Frolic\", not \"Frolick\", but guess some gets the **k** added when doing the **ing** thingy.",
        "created_utc": 1532416118,
        "upvote_ratio": ""
    },
    {
        "title": "Some Redditors answered some questions and I am going to site them. Reddit is a bit different than just a website. How would you cite this in APA?",
        "author": "trundyl",
        "url": "https://www.reddit.com/r/grammar/comments/91e5f2/some_redditors_answered_some_questions_and_i_am/",
        "text": "",
        "created_utc": 1532405438,
        "upvote_ratio": ""
    },
    {
        "title": "Patiently Waiting or Waiting Patiently?",
        "author": "ForcedGrimace",
        "url": "https://www.reddit.com/r/grammar/comments/91e0jp/patiently_waiting_or_waiting_patiently/",
        "text": "",
        "created_utc": 1532404229,
        "upvote_ratio": ""
    },
    {
        "title": "Two quick questions",
        "author": "THUNDERWANG",
        "url": "https://www.reddit.com/r/grammar/comments/91bi5b/two_quick_questions/",
        "text": "Can you guys help me decide between these options?\n\n1. The group is/are disagreeing among themselves about the results.\n\nIs the answer “are” because the group should not be seen as a collective here?\n\n2. There is/are a raincoat and umbrella in the closet.\n\nIs the answer “is” because raincoat and umbrella should be treated as one?\n\nEdit: Here’s a third.\n\n3. Storms at sea is/are a reason for extreme caution?\n\nIs the answer “are” because you don’t treat storms as a singular concept here? \n\nThanks in advance!",
        "created_utc": 1532383662,
        "upvote_ratio": ""
    },
    {
        "title": "Definiteness restrictions",
        "author": "alcoyana",
        "url": "https://www.reddit.com/r/grammar/comments/91axkh/definiteness_restrictions/",
        "text": "I am trying to determine if there's a definiteness restriction in this context:\n\n    (i) Mary believed ____ to jog regularly\n\nIs it the case that (i) is acceptable with definite noun phrases (i.e. *John*, *her son*, *the man next door*, etc.) but unacceptable with indefinites (i.e. *a man*, *a friend*, *a neighbour*, etc)?\n\n",
        "created_utc": 1532379595,
        "upvote_ratio": ""
    },
    {
        "title": "Any new grammar guide out there",
        "author": "Nerd_199",
        "url": "https://www.reddit.com/r/grammar/comments/91awnt/any_new_grammar_guide_out_there/",
        "text": "",
        "created_utc": 1532379414,
        "upvote_ratio": ""
    },
    {
        "title": "Capitalization",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/91asvh/capitalization/",
        "text": "Should the word “multipurpose room” be capitalized (M and R)? This is on an invitation for a party. My hunch is that is should not be since it’s a common/generic noun unless a the room has a formal name that precedes it, i.e., The Trump Multipurpose Room. \n",
        "created_utc": 1532378663,
        "upvote_ratio": ""
    },
    {
        "title": "Punctuation question for you English pros",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/91amz0/punctuation_question_for_you_english_pros/",
        "text": "[deleted]",
        "created_utc": 1532377528,
        "upvote_ratio": ""
    },
    {
        "title": "\"Happenings\" in a sentence",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/919cnm/happenings_in_a_sentence/",
        "text": "[deleted]",
        "created_utc": 1532368859,
        "upvote_ratio": ""
    },
    {
        "title": "What’s the expression for when two things are the same?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/916z1l/whats_the_expression_for_when_two_things_are_the/",
        "text": "[deleted]",
        "created_utc": 1532351785,
        "upvote_ratio": ""
    },
    {
        "title": "Is it \"cells's migration\" or \"cells' migration\"? (or can I not use this contraction in this case?",
        "author": "oizhre",
        "url": "https://www.reddit.com/r/grammar/comments/916tnu/is_it_cellss_migration_or_cells_migration_or_can/",
        "text": "Hi!\n\nI'm writing my thesis in English (not first language) and my supervisor made me doubt something I use: \n\nIf I want to say: \"the migration of the cell\", I can write \"the cell's migration\"! Now how do I write it if I am talking about cells, plural? Can I use this contraction in this context? ",
        "created_utc": 1532350531,
        "upvote_ratio": ""
    },
    {
        "title": "Why do some people add an exclamation point in between words?",
        "author": "ZodiacPaladin",
        "url": "https://www.reddit.com/r/grammar/comments/91515w/why_do_some_people_add_an_exclamation_point_in/",
        "text": "I was just over at the DBZ subreddit and almost every post concerning an alternate form of someone/thing was like \"Goku!Blue\" or \"Mustache!Vegeta.\" Why is this?   \n(I tried googling this, but I kept getting questions about what it means to \"add dots\" (Ellipses) to your sentence... That wasn't helpful so I came here.)",
        "created_utc": 1532330939,
        "upvote_ratio": ""
    },
    {
        "title": "Should it be \"To Whoever\" or \"To Whomever\"?",
        "author": "IAmNotWhoever",
        "url": "https://www.reddit.com/r/grammar/comments/91500w/should_it_be_to_whoever_or_to_whomever/",
        "text": "https://i.redd.it/8pbnvz0fnlb11.jpg",
        "created_utc": 1532330553,
        "upvote_ratio": ""
    },
    {
        "title": "Keeping doing",
        "author": "maybe82",
        "url": "https://www.reddit.com/r/grammar/comments/914g9s/keeping_doing/",
        "text": "Why does *keeping doing* sound wrong? Keep follows the verb pattern of *keep + verb-ing* as in \"I keep seeing him\" or \"He kept talking\" so why can't I put it into continuous? Is it because there are two verbs in ing forms together and it's only possible of one is a gerund?\n\n\n\"I keep doing\" is present simple but acting like present continuous.\n\n\nWhat's going on?",
        "created_utc": 1532324281,
        "upvote_ratio": ""
    },
    {
        "title": "If I mention someone in a sentence, how many times should I use their name?",
        "author": "MrGuyGaming",
        "url": "https://www.reddit.com/r/grammar/comments/912y37/if_i_mention_someone_in_a_sentence_how_many_times/",
        "text": "For example, \"John is going to the store. \\_\\_\\_\\_ will buy eggs and milk.\"\n\nShould I put \"John\" or \"he\" in the blank?",
        "created_utc": 1532309823,
        "upvote_ratio": ""
    }
]