[
    {
        "title": "What does \"solid\" mean?",
        "author": "EngLearnerAibek",
        "url": "https://www.reddit.com/r/grammar/comments/10ebft5/what_does_solid_mean/",
        "text": "The Last of Us - Season 1 - Episode 1 \\[08:57-\\]\n\nMAN: She'll stay as long as you want. Tell ya all about Atkins\n\nMr. Adler: Great! I'll let Connie know.\n\nGIRL: **Solid**",
        "created_utc": 1673959633,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the difference between unlit and unlighted",
        "author": "Emilyx33x",
        "url": "https://www.reddit.com/r/grammar/comments/10ebele/what_is_the_difference_between_unlit_and_unlighted/",
        "text": "ICAO aeronautical chart symbols are labelled as ‘unlighted obstacle’. Why not unlit?",
        "created_utc": 1673959529,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does \"slid\" mean?",
        "author": "EngLearnerAibek",
        "url": "https://www.reddit.com/r/grammar/comments/10easeo/what_does_slid_mean/",
        "text": "He grins at me, and I know exactly what’s going through his mind, considering he just **slid** his left hand into his pocket.\n\nContext:\n\nI can’t see Cap from inside the elevator, but I hear him grunt something in return. He doesn’t sound nearly as eager to make small talk with this guy as he was with me. This man looks to be in his late twenties at most. He grins at me, and I know exactly what’s going through his mind, considering he just **slid** his left hand into his pocket.",
        "created_utc": 1673957567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can’t decide if this needs a comma.",
        "author": "NoUsernameHereNow",
        "url": "https://www.reddit.com/r/grammar/comments/10eao14/cant_decide_if_this_needs_a_comma/",
        "text": "“My crimes have earned me renown the likes of which you struggle to yearn for.”\n\nShould there be a comma after renown?",
        "created_utc": 1673957159,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are or is?",
        "author": "CyberJokerWTF",
        "url": "https://www.reddit.com/r/grammar/comments/10eacxf/are_or_is/",
        "text": "I’ve sent you a copy of the report, let me know “if there are any mistakes in it” VS “if there is any mistake in it” \n\nWhich is correct any why?",
        "created_utc": 1673956164,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was or is?",
        "author": "Sheeppowz",
        "url": "https://www.reddit.com/r/grammar/comments/10e98r2/was_or_is/",
        "text": "I know this is supposed to be easy but at times I got confused by it that I need to change my phrasing and avoid the use of was and is and any past tense (don't even know if that is possible lol)\n\nSo this is the situation. I went to this class and it was(?) great, and the people over there were(?) friendly. So if I say 'was', does that mean now I don't feel great about it anymore? \n\nFor were, when I said that does that mean that I am thinking that they were friendly in the class, but now they are not friendly anymore?",
        "created_utc": 1673952150,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grammar help",
        "author": "DrgXvier",
        "url": "https://www.reddit.com/r/grammar/comments/10e7x7x/grammar_help/",
        "text": "English isn't my first language, that's why I'm confused with this two phrases.\n\nWhich response is correct in this scenario?\n \n\"Let's have a baby.\" \n\n\n\"I'm not ready with that.\" or \"I'm not ready for it.\"?",
        "created_utc": 1673947234,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this sentence correct? \"So what do you actually believe with your spirituality? Because I know you're very spiritual.\"",
        "author": "556595252e",
        "url": "https://www.reddit.com/r/grammar/comments/10e5qaa/is_this_sentence_correct_so_what_do_you_actually/",
        "text": "",
        "created_utc": 1673939166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can nouns be implied for prepositions?",
        "author": "newmodemthrowaway",
        "url": "https://www.reddit.com/r/grammar/comments/10e2kfu/can_nouns_be_implied_for_prepositions/",
        "text": "I'm using CMOS which requires prepositions in titles to be lowercase. I might be overthinking this but can the word \"out\" in the title \"I Went Out Walking\" be a preposition or must a noun actually be present thus it's an adverb?",
        "created_utc": 1673929027,
        "upvote_ratio": 1.0
    },
    {
        "title": "help me analyse a clause.",
        "author": "ghostmosquito",
        "url": "https://www.reddit.com/r/grammar/comments/10e2j94/help_me_analyse_a_clause/",
        "text": "Consider the sentence: *All that glitters* is not gold.\n\nIn the above sentence, which type of clause is \"all that glitters\"?\n\nIs it noun clause, adverb clause, or adjective clause?",
        "created_utc": 1673928924,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mottos, slogans, mission statements quoted in text",
        "author": "awholenoobworld",
        "url": "https://www.reddit.com/r/grammar/comments/10e2e8o/mottos_slogans_mission_statements_quoted_in_text/",
        "text": "For an example, which of the below would be correct (in a fictional work)? I've seen both used (perhaps according to different style guides?? Or perhaps wrongly)...\n\nThe Time Guild's prime directive was, \"Leave things exactly as you found them.\"\n\nThe Time Guild's prime directive was \"leave things exactly as you found them.\"",
        "created_utc": 1673928519,
        "upvote_ratio": 1.0
    },
    {
        "title": "Explaining something in the middle of a sentence",
        "author": "Its_GhostWriter",
        "url": "https://www.reddit.com/r/grammar/comments/10e0lup/explaining_something_in_the_middle_of_a_sentence/",
        "text": "So this one always stumps me! I know it’s not the strongest sentence but say you have something like- \n\n“Right as the Avatar- a native alien species- are faced with an attack-“ \n\nIs THAT correct, or is it \n\n“Right as the Avatar, a native alien species, are faced with an attack -“ \n\n(Please ignore the actual sentence because this is just an example, lol) I’m actually a beta reader for amateur stories and FanFiction and this always confuses me. I never know what to correct it to. \n\nIt could even be “When Meg- Danny’s younger sister- got here, she-“ \n\nOr is it “When Meg, Danny’s younger sister, got here, she-“",
        "created_utc": 1673923457,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is \"ensure your best experience?\" correct?",
        "author": "Realistic_Ad_6867",
        "url": "https://www.reddit.com/r/grammar/comments/10dy2eq/is_ensure_your_best_experience_correct/",
        "text": "This Live Demo Event is coming!\n\nBefore we start, we prepared a specific guide to ensure your best experience.\n\nIs this correct? Or is \"ensure you the best experience\" or \"ensure you have the best experience\" better?",
        "created_utc": 1673916638,
        "upvote_ratio": 0.99
    },
    {
        "title": "What is the term for when an adjective has the same meaning as the noun that follows.",
        "author": "Shazam884",
        "url": "https://www.reddit.com/r/grammar/comments/10dwrbv/what_is_the_term_for_when_an_adjective_has_the/",
        "text": "For example: “They are stupid idiots” here ‘stupid’ and ‘idiots’ have the same meaning; ‘stupid’ is redundant.\n\nI’m not thinking it’s ‘synonym’ because those are words w/ the same meaning.\n\nSide question: in the above example is my use of apostrophes between words fine, or should I have use quotation marks?",
        "created_utc": 1673913291,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does “Almost” have a direction?",
        "author": "lasperado",
        "url": "https://www.reddit.com/r/grammar/comments/10dvqhz/does_almost_have_a_direction/",
        "text": "Could you say “it’s almost 4” if it is past 4 (example, 4:01)? Is “almost” always implying an approach or direction towards but not exceeding the description?",
        "created_utc": 1673910812,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a term for place locations that are derived from physical space. Historic places in NYC like \"The Five Points\" and \"Mulberry Bend\" refer to an intersection where multiple roads came together and the other had a bend in the road. Thanks!",
        "author": "bobbyamillion",
        "url": "https://www.reddit.com/r/grammar/comments/10dvk6e/is_there_a_term_for_place_locations_that_are/",
        "text": "",
        "created_utc": 1673910407,
        "upvote_ratio": 1.0
    },
    {
        "title": "Commas",
        "author": "yellowgirlyellow",
        "url": "https://www.reddit.com/r/grammar/comments/10dvbpl/commas/",
        "text": "Would the sentence be:\n\n1) Tom’s sentence stops, drawing to an end as he looks over his shoulder.\n\nOr\n\n2) Tom’s sentence stops, drawing to an end, as he looks over his shoulder.",
        "created_utc": 1673909890,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could someone explain what part of the sentence a predicate is?",
        "author": "spicyycornbread",
        "url": "https://www.reddit.com/r/grammar/comments/10dvalm/could_someone_explain_what_part_of_the_sentence_a/",
        "text": "Title. What is a predicate and could someone give an example?",
        "created_utc": 1673909815,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did I use the dash correctly? I think not.",
        "author": "author-miglett2",
        "url": "https://www.reddit.com/r/grammar/comments/10dsje0/did_i_use_the_dash_correctly_i_think_not/",
        "text": "Shoes — I wasn’t a big fan of them.",
        "created_utc": 1673904169,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Conjunctive Adverbs are Adverbs While They're Not Really?",
        "author": "gresh12",
        "url": "https://www.reddit.com/r/grammar/comments/10ds938/why_conjunctive_adverbs_are_adverbs_while_theyre/",
        "text": "I'm aware that conjunctive adverbs are a special type of adverb. However adverb is a word that modifies a verb, adjective or another adverb. This special type of adverb doesn't do any of them. Why we name them as adverbs?",
        "created_utc": 1673903698,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"you probably have heard of them\" sounds passive aggressive to me",
        "author": "TechnicalShare3",
        "url": "https://www.reddit.com/r/grammar/comments/10dqz0z/you_probably_have_heard_of_them_sounds_passive/",
        "text": "So I've heard my ESL friend say this a few times when mentioning something like a company or brand, usually in the context of work. I am in tech and he'll mention a new tech company and add \"you probably have heard of them\". For example \"Instagram let's you share pictures, you probably have heard of them.\" But replace Instagram with a more niche company. Majority of the time, I or the other person has never heard of the company.\n\nFor some reason this sounds passive aggressive but I know my friend doesn't mean it that way. He's generally just sharing something he'll learn with others. What are your thoughts?",
        "created_utc": 1673901595,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Coming\" versus \"Going\" - Am I using these two words incorrectly?",
        "author": "IPreferDiamonds",
        "url": "https://www.reddit.com/r/grammar/comments/10dqjh1/coming_versus_going_am_i_using_these_two_words/",
        "text": "For context - I'm a 54 year old American woman and an avid reader.\n\nLately, I have noticed in books and a few times on television that I see/hear \"coming\" when I think it should be \"going\". So now I am wondering if I was taught incorrectly. \n\nExample on television in show I just watched:\n\nFirst person said: \"Get your things. I'm taking you home.\"\n\nSecond person said: \"I'm not coming with you.\"\n\nI would have said (and written) \"I'm not going with you.\"\n\nAm I wrong?\n\nI think of \"going\" as going somewhere, leaving where you are now.\n\nI think of \"coming\" as bringing something to you, to your location.\n\n???",
        "created_utc": 1673900883,
        "upvote_ratio": 1.0
    },
    {
        "title": "You and me vs me and you",
        "author": "macfixplus",
        "url": "https://www.reddit.com/r/grammar/comments/10dpnza/you_and_me_vs_me_and_you/",
        "text": "Is there any scenario in the English language where you can put yourself first? Like “me and blank” Or is it always “blank and I” &amp; “blank and me”?",
        "created_utc": 1673899026,
        "upvote_ratio": 1.0
    },
    {
        "title": "Settle a debate for me, which of these two is the correct way to phrase this?",
        "author": "CivilHedgehog2",
        "url": "https://www.reddit.com/r/grammar/comments/10dok5m/settle_a_debate_for_me_which_of_these_two_is_the/",
        "text": "Are the eyes what do it? Is it just inside?  \nAre the eyes what does it? Is it just inside  \n\n\nBoth referring to the eyes of a love interest.",
        "created_utc": 1673896461,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"... then all was silent\" - why is 'all' used here instead of 'everything'?",
        "author": "Wadomicker",
        "url": "https://www.reddit.com/r/grammar/comments/10do6yz/then_all_was_silent_why_is_all_used_here_instead/",
        "text": "From what I learned, 'all' cannot be used independently and must precede a noun ('all people'), unlike everything ('count everything here'). There are exceptions like in the phrase \"that's all about us\". But I still cannot understand the example from the title or these sentences:\n\nAll I said he was: \"no\". \n\nAll she had ever said was a lie.\n\nThat's all.",
        "created_utc": 1673895638,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you write In these cases?",
        "author": "bythebystander",
        "url": "https://www.reddit.com/r/grammar/comments/10dnimc/can_you_write_in_these_cases/",
        "text": "I am writing a dissertation, and of course do not want to sound stupid. Can you write 'In these cases\" when referring to multiple instances of something?",
        "created_utc": 1673894171,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which of these is correct? Is more than one version correct? Please explain why.",
        "author": "Main-Measurement3790",
        "url": "https://www.reddit.com/r/grammar/comments/10dk6tb/which_of_these_is_correct_is_more_than_one/",
        "text": "Hi all. I am study correct usage of pronouns. I have 3 versions of a sentence. I believe the first version is correct. I would like to know if the other two are also correct/incorrect and why. \n\nThank you!\n\nVersion 1: During the meeting with the citizens, the mayor seemed to be surprised by their questioning the validity of the data.\n\nVersion 2: During the meeting with the citizens, the mayor seemed to be surprised by them questioning the validity of the data.\n\nVersion 3: During the meeting with the citizens, the mayor seemed to be surprised by they questioning the validity of the data.",
        "created_utc": 1673888878,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grammar help.",
        "author": "PeePeeffff",
        "url": "https://www.reddit.com/r/grammar/comments/10dg1jr/grammar_help/",
        "text": "I don’t speak English as a first language but my teacher says that saying “today’s” is grammatically incorrect (ex “today’s newspaper is interesting”)\n\nTeacher says it’s supposed to be “the newspaper of today” to be completely grammatically correct, and using “today’s” will be penalized on tests.",
        "created_utc": 1673879670,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does \"break\" mean?",
        "author": "EngLearnerAibek",
        "url": "https://www.reddit.com/r/grammar/comments/10ddbjy/what_does_break_mean/",
        "text": "'Cause I might **break**\n\nContext: Billie Eilish - ilomilo\n\n\\[Verse 2\\]\n\nThe world's a little blurry\n\nOr maybe it's my eyes\n\nThe friends I've had to bury\n\nThey keep me up at night\n\nSaid I couldn't love someone\n\n'Cause I might **break**\n\nIf you're gonna die, not by mistake",
        "created_utc": 1673872061,
        "upvote_ratio": 1.0
    },
    {
        "title": "which one is more accurate which one sounds better?",
        "author": "Party_Grade_3280",
        "url": "https://www.reddit.com/r/grammar/comments/10dcdgo/which_one_is_more_accurate_which_one_sounds_better/",
        "text": "1.does yor next hotel room give access to a jaccuzi\n\n2.does yor next hotel room give **you** access to a jaccuzi\n\n3.does yor next hotel room also give access to a jaccuzi",
        "created_utc": 1673869015,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does it mean by \"I am vowed by what you did?\"",
        "author": "CarUnable2234",
        "url": "https://www.reddit.com/r/grammar/comments/10daelh/what_does_it_mean_by_i_am_vowed_by_what_you_did/",
        "text": "I read this line from the NY Post and it's said by a politician.\n\nBut I lost the original link. Thanks for your help.",
        "created_utc": 1673861889,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interpretation Assistance",
        "author": "clumsyhuman643",
        "url": "https://www.reddit.com/r/grammar/comments/10d15nk/interpretation_assistance/",
        "text": "Hello! I work with Botox at my job and I was reading a little bit about it. I read this from an article and I would like a second opinion on whether my interpretation is correct. The statement is: “Toxins are detoxified in air within 12 hours”. So I think this means that if you accidentally spilled Botox, it will most likely be gone within 12 hours from the moment you spilled it since almost every area is surrounded my air. Is all of my interpretation correct?",
        "created_utc": 1673832191,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the current consensus on English pronunciation of years after 1999?",
        "author": "mobileagnes",
        "url": "https://www.reddit.com/r/grammar/comments/10d0t22/what_is_the_current_consensus_on_english/",
        "text": "Of course 2000 is 'two thousand'. It seems where I live, we use 'two thousand (and) [last digit]' for 2001 to 2009, then it varies for the 2010s with some people using 'two thousand (and) [ten to nineteen]' switching anywhere along the line to 'twenty...'. So far, the 2020s clearly are 'twenty twenty-[last digit]' with very few holdouts saying 'two thousand (and) twenty-something'. A casual abbreviation I used to hear was 'two oh-two' for 2002 or 'two fifteen' for 2015, often during car talk when referring to model years. The normal abbreviation we often did was 'oh-seven' for 2007.\n\n\nIs it different where you live? Has anyone started saying stuff like 'twenty oh-three' for 2003? Has anyone who grew up after 1999 somehow preferred 'one thousand nine hundred...' after being raised on a decade+ of 'two thousand (and)'? Have people started reverting back to just using the last 2 digits such as 'twenty-two' for 2022? I'll admit saying 'twenty twenty-two' feels like a tongue twister and 'two thousand (and) twenty-two' feels easier but longer of course.\n\n\nI'm one of the few holdouts still using 'thousand' (except for 2020) and so am waiting for the day someone tells me 'it's just twenty-three, OK? Not two thousand blah blah'.\n\nI'm curious how this will change over time given how much video coverage exists from the 2000s/2010s and how it may influence pronunciations of those years in the future. Billions of people probably heard at one point or another George W Bush saying 'September the eleventh, two thousand one' in reference to the date, as well as other similar pronunciations for years around then. There may not be as much historical audio to reference the early 1900s, so everyone just pronounces 1900 to 1909 the way we pronounce other 19XX years or addresses (how do you pronounce 1909 or 2009 if it's part of an address or room number?).",
        "created_utc": 1673831255,
        "upvote_ratio": 1.0
    },
    {
        "title": "(When talking about a direction) “That’s way too North” or “Way to North”?",
        "author": "Inevitable_Shirt5044",
        "url": "https://www.reddit.com/r/grammar/comments/10czazt/when_talking_about_a_direction_thats_way_too/",
        "text": "",
        "created_utc": 1673827349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is This Phrase Correct?",
        "author": "InitiativeThis2168",
        "url": "https://www.reddit.com/r/grammar/comments/10cyp1d/is_this_phrase_correct/",
        "text": "[removed]",
        "created_utc": 1673825811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friday the 13th and apposition",
        "author": "newacc9900",
        "url": "https://www.reddit.com/r/grammar/comments/10cw2ld/friday_the_13th_and_apposition/",
        "text": "A student asked me on Friday why the number comes after the noun in Friday the 13th. My assumption is that \"the 13th\" is just an appositive phrase, but I told the student I'd get back to her on it in the next class.\n\nAm I correct?",
        "created_utc": 1673819447,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the grammar here right? It doesn't seem like it.",
        "author": "author-miglett2",
        "url": "https://www.reddit.com/r/grammar/comments/10cvrzw/is_the_grammar_here_right_it_doesnt_seem_like_it/",
        "text": "\"Don’t you ‘yeah, dad’ me, son.\"",
        "created_utc": 1673818719,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the meaning of this sentence?",
        "author": "Familiar_Sun6150",
        "url": "https://www.reddit.com/r/grammar/comments/10cvadk/whats_the_meaning_of_this_sentence/",
        "text": "Someone replied to me saying \"Oh! You’ve met out teacher.\". What does this really mean? Is there a typo or a spelling mistake?",
        "created_utc": 1673817549,
        "upvote_ratio": 1.0
    },
    {
        "title": "Indefinite article before lucky coincidence?",
        "author": "Quirky-Bug3582",
        "url": "https://www.reddit.com/r/grammar/comments/10cv6m1/indefinite_article_before_lucky_coincidence/",
        "text": "Should there be an indefinite article before lucky coincidence in this sentence?\n\nWhether it was fate or lucky coincidence, I am glad I met you.",
        "created_utc": 1673817307,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it correct to say that",
        "author": "barbariell",
        "url": "https://www.reddit.com/r/grammar/comments/10cuysw/is_it_correct_to_say_that/",
        "text": "Hello. I’m writing a text on the subject how food brings us closer and let’s you experience new things. I thing food is a catalyst for feeling good towards people you share an experience with. Can my title be “Catalyst for camaraderie”. Does that fits the subject, is it correctly written and do you have any suggestions for a better title? Thank you!",
        "created_utc": 1673816796,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where/which",
        "author": "withheldforprivacy",
        "url": "https://www.reddit.com/r/grammar/comments/10cur9c/wherewhich/",
        "text": "*A wide, spacious locker which even a teenager can fit in.*\n\nDoes this sound natural? Or should I replace *which* with *where*?",
        "created_utc": 1673816327,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would either of these titles be grammatically correct?",
        "author": "Nyarlathotep13",
        "url": "https://www.reddit.com/r/grammar/comments/10cu5ee/would_either_of_these_titles_be_grammatically/",
        "text": "I was looking through the music player in an old game when I noticed that one of the track titles looked a bit odd, said title being \"Fate to Despair.\" Out of curiosity I checked how  the title was originally written in the game's native language, but it turns out that it and a few other tracks were always written in English.\n\nRegardless, a decade or two later this game received a re-release and it appears that someone must have felt the same way as I did about that aforementioned title as it's now listed as \"Fate of Despair.\" However, that wording still seems off to me. Thus, I was curious to know if both of these titles were grammatically incorrect or if one of them actually was proper.",
        "created_utc": 1673814904,
        "upvote_ratio": 1.0
    },
    {
        "title": "Found this very unusual sentence in a book. Does it make sense ?",
        "author": "luucif3r",
        "url": "https://www.reddit.com/r/grammar/comments/10cu05u/found_this_very_unusual_sentence_in_a_book_does/",
        "text": "\"Coming-attractions trailers and the film's poster design usually leave no doubt about what genre the film is in, the better to target fans\"\n\nIt's the \"*the better to target fans*\" that doesn't seem to make any sense within context. Instead, shouldn't it be:\n\n\"The less doubt the coming-attractions trailers and film's poster design leave about what genre the film is in, the better to target fans\" ?\n\nMind you, my native language isn't English, so I'm most certainly not familiar with some obscure sentence structures, which I recognize this might be.",
        "created_utc": 1673814572,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a credible summary (e.g. in table form) of the position of adjuncts/adverbials?",
        "author": "femke_0",
        "url": "https://www.reddit.com/r/grammar/comments/10crtzo/is_there_a_credible_summary_eg_in_table_form_of/",
        "text": " The chapters on adjuncts/adverbials in CGEL and A Comprehensive  Grammar  of the English Language are 122 pages and 180 pages  respectively.  Has  anyone come across a dependable summary (e.g. in  table form) of the  position of adjuncts/adverbials, preferably one which correlates  semantics with syntax?  For example, manner adjuncts are generally (1)  adverb/prepositional phrases and (2) positioned at the end of the  sentence.  With it being a summary, I don't expect it to be   comprehensive, but it would be nice if some effort/thought has been put   into it.  Thanks in advance.",
        "created_utc": 1673809399,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this an independent clause?",
        "author": "zorroelk",
        "url": "https://www.reddit.com/r/grammar/comments/10cr3ol/is_this_an_independent_clause/",
        "text": "I'm still trying to figure out what makes something an independent clause:\n\n\"Seeing the woman he love got hurt, Mark gathered his strength to fight back\"\n\nIs \"Seeing the woman he love got hurt\" an independent clause? My assumption right now is \"no\" since there's a verb \"Seeing\" and an object \"The woman\" but no subject. Am I correct?",
        "created_utc": 1673807682,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the proper way to say it \"Games and Toys\" or \"Toys and Games\" and why?",
        "author": "tempo90909",
        "url": "https://www.reddit.com/r/grammar/comments/10cptv8/is_the_proper_way_to_say_it_games_and_toys_or/",
        "text": "",
        "created_utc": 1673804678,
        "upvote_ratio": 1.0
    },
    {
        "title": "My girlfriend and I got into a huge argument over a memorial sticker on someone’s car.",
        "author": "Andy_McBoatface",
        "url": "https://www.reddit.com/r/grammar/comments/10cpdw0/my_girlfriend_and_i_got_into_a_huge_argument_over/",
        "text": "The memorial sticker said “The half of my heart is in heaven with my son”\n\nI believe it conveys that “half of heart” and “[her] son” are two different subjects are “in heaven”. \n\nShe said it conveys the message that they are one subject, but it never sat right with me.\n\nWhat sounds right? And what would sound better?",
        "created_utc": 1673803599,
        "upvote_ratio": 1.0
    },
    {
        "title": "'Between' preposition or adverb?",
        "author": "meowarfroar",
        "url": "https://www.reddit.com/r/grammar/comments/10cnwwq/between_preposition_or_adverb/",
        "text": "I understand that to identify that a word is a preposition, it has to be followed by an object but, I'm quite confused when is \"between\" an adverb? \n\nLet's say the sentence is... \"I sat between Michael and John...\" \n\nHope you can give examples too. Thanks for your help!",
        "created_utc": 1673800036,
        "upvote_ratio": 1.0
    },
    {
        "title": "You both are named Valentine. That makes two Valentines.",
        "author": "GLOBALSHUTTER",
        "url": "https://www.reddit.com/r/grammar/comments/10cn5ps/you_both_are_named_valentine_that_makes_two/",
        "text": "Should there be an apostrophe?",
        "created_utc": 1673798197,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which sentence is correct; I had played the game, I have played the game or I did play the game.",
        "author": "RozzoMo",
        "url": "https://www.reddit.com/r/grammar/comments/10cm7wt/which_sentence_is_correct_i_had_played_the_game_i/",
        "text": "I'm having trouble deciding when to use each sentence.",
        "created_utc": 1673795742,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which sentence is correct; I had played the game, I have played the game or I did played the game.",
        "author": "RozzoMo",
        "url": "https://www.reddit.com/r/grammar/comments/10cm55q/which_sentence_is_correct_i_had_played_the_game_i/",
        "text": "title",
        "created_utc": 1673795539,
        "upvote_ratio": 1.0
    },
    {
        "title": "How should I properly capitalize the following in a sentence?",
        "author": "LeoKliesen",
        "url": "https://www.reddit.com/r/grammar/comments/10cl3un/how_should_i_properly_capitalize_the_following_in/",
        "text": "\"British Government\" or \"British government\"?\n\nThank you very much! :)",
        "created_utc": 1673792689,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this following sentence gramatticaly correct?",
        "author": "vincentvangoh",
        "url": "https://www.reddit.com/r/grammar/comments/10cj91m/is_this_following_sentence_gramatticaly_correct/",
        "text": "This movie has so much to talk about.",
        "created_utc": 1673787482,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does using whenever + present perfect have two different interpretations?",
        "author": "Conectiololo",
        "url": "https://www.reddit.com/r/grammar/comments/10cj278/does_using_whenever_present_perfect_have_two/",
        "text": "\"Whenever I have eaten something spicy, I need to drink a lot of water\"  \nOne way I see this sentence is that you have experienced that eating something spicy makes you need to drink a lot of water in your life.  \nAnother way I see this sentence is that if you are in a situation where you have eaten something spicy you need to drink water.   \nIs this correct?",
        "created_utc": 1673786881,
        "upvote_ratio": 1.0
    },
    {
        "title": "usedn't or didn't use to",
        "author": "Westie_Bestie",
        "url": "https://www.reddit.com/r/grammar/comments/10cgqiz/usednt_or_didnt_use_to/",
        "text": "I always thought the negative form of used to was didn't use to and I remember the teacher saying that, but now I have come across usedn't in a book with the same meaning. If used is past simple, how can usedn't be correct? At least it should be usen't. What about need? Is there are neededn't?",
        "created_utc": 1673779168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should it be 'look' or 'looks'?",
        "author": "blitzkrieg987",
        "url": "https://www.reddit.com/r/grammar/comments/10cg9oa/should_it_be_look_or_looks/",
        "text": "A moment of silence arises, during which none of the two look(s?) at the other.",
        "created_utc": 1673777391,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meaning of the clause \"brought up on the bottle\"?",
        "author": "ghostmosquito",
        "url": "https://www.reddit.com/r/grammar/comments/10cbxfk/meaning_of_the_clause_brought_up_on_the_bottle/",
        "text": "What is the meaning of \"brought up on the bottle\" in the following sentence:\n\nThe bear was so small and helpless that it had to be brought up on the bottle by the lady.\n\nGoogle search tells me it means \"brought into slavery\" which doesn't feel right in the above sentence.",
        "created_utc": 1673761507,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this sentence correct?",
        "author": "Fantastic_Leg2433",
        "url": "https://www.reddit.com/r/grammar/comments/10cbd08/is_this_sentence_correct/",
        "text": "\"My romantic experience in the past and my romantic interests in the immediate future are all centered around women with braces\"\n\nIs the \"are\" in the part   \"...in the immediate future **are** all centered....\"   correct? \n\nSince without the conjunction it would be \" My romantic experience in the past **has been** centered around women with braces\" , I am confused whether my original sentence is correct or not.",
        "created_utc": 1673759651,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did Thomas Paine use both \"hath\" and \"has\" in the same sentence?",
        "author": "VegasBallroom",
        "url": "https://www.reddit.com/r/grammar/comments/10cb4eo/why_did_thomas_paine_use_both_hath_and_has_in_the/",
        "text": "The word \"hath\" is an older form of \"has\", more commonly used before the 1700's. \n\nThe transition from \"hath\" to \"has\" (or more broadly -th to -a) occurred gradually over the course of a few hundred years. In the year 1693 records show they were equally used, and 100 years later \"hath\" was still used about 15% of the time. Even in The Jungle Book (1894), characters speak with \"thou\" and \"thee\" when quoted, yet the main text of the book uses the more prevalent -s.\n\n Nevertheless, if \"hath\" is just an older form of \"has\", then why would someone use both, let alone in the same sentence?\n\n\"...but it hath so far happened that the first has failed, and the second has withdrawn her influence.\"\n\n- Thomas Paine 1776",
        "created_utc": 1673758908,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whomever",
        "author": "ToughPillToSwallow",
        "url": "https://www.reddit.com/r/grammar/comments/10ca6ac/whomever/",
        "text": "Some chick posted a pic with “literally sending to whoever upvotes.” Obviously not true, but could this be “whomever” instead? Seems like it could go either way. “Whoever” is acting as both a subject and an object.",
        "created_utc": 1673755954,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am going to get a jacket with my name and profession embroidered.",
        "author": "lucashieee",
        "url": "https://www.reddit.com/r/grammar/comments/10c9wm5/i_am_going_to_get_a_jacket_with_my_name_and/",
        "text": "I need help with the punctuations because I dont want my last name to be disclosed.\n\nShould it be (First name) P., RN or (First name) P, RN ?\n\nThank you!!",
        "created_utc": 1673755144,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this grammatically correct?",
        "author": "playfulpandemonium",
        "url": "https://www.reddit.com/r/grammar/comments/10c8dlj/is_this_grammatically_correct/",
        "text": "I’m writing song lyrics and want the amount syllables to make sense with the music. There is a line that says “To (action) is to never have had etc…” I know that is correct, but another line only fits if I say “To (action) is never to have had etc…”. Can I switch “never” and “to” while keeping the same meaning?",
        "created_utc": 1673750587,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it \"confirmED receipt\" , \"confirm receipt\", or \"confirm received\" ?",
        "author": "ddmoneymoney123",
        "url": "https://www.reddit.com/r/grammar/comments/10c7ny0/is_it_confirmed_receipt_confirm_receipt_or/",
        "text": "Let's say you write an email and you want the recipient to write back or acknowledge that they've been notified. which one do you use?",
        "created_utc": 1673748577,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why use commas when there’s a period?",
        "author": "loorpie",
        "url": "https://www.reddit.com/r/grammar/comments/10c75rb/why_use_commas_when_theres_a_period/",
        "text": "Title",
        "created_utc": 1673747151,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a credible summary (e.g. in table form) of the position of adjuncts/adverbials?",
        "author": "femke_0",
        "url": "https://www.reddit.com/r/grammar/comments/10c3vf8/is_there_a_credible_summary_eg_in_table_form_of/",
        "text": "The chapters on adjuncts/adverbials in CGEL and A Comprehensive  Grammar of the English Language are 122 pages and 180 pages  respectively.  Has anyone come across a dependable summary (e.g. in  table form) of the position of adjuncts/adverbials, preferably one which correlates semantics with syntax?  For example, manner adjuncts are generally (1) adverb/prepositional phrases and (2) positioned at the end of the sentence.  With it being a summary, I don't expect it to be  comprehensive, but it would be nice if some effort/thought has been put  into it.  Thanks in advance.",
        "created_utc": 1673738383,
        "upvote_ratio": 1.0
    },
    {
        "title": "There's not a day that passes by without you crossing in my mind?",
        "author": "Recent-Skill7022",
        "url": "https://www.reddit.com/r/grammar/comments/10c32dg/theres_not_a_day_that_passes_by_without_you/",
        "text": "Hey guys, can you help me form a verse that has 8 syllables:\n\n There's not a day that passes by \\_\\_\\_\\_/\\_\\_\\_\\_/\\_\\_\\_\\_/\\_\\_\\_\\_\\_/\\_\\_\\_\\_\\_/\\_\\_\\_\\_\\_/\\_\\_\\_\\_\\_/\\_\\_\\_\\_\\_:\n\nThere's not a day that passes by without you crossing in my mind?",
        "created_utc": 1673736447,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mixing simple past tense and progressive for simultaneity",
        "author": "TennisMathematician",
        "url": "https://www.reddit.com/r/grammar/comments/10c2wmm/mixing_simple_past_tense_and_progressive_for/",
        "text": "In the sentence below, progressive was used both in the main clause and in adverbial clause of time to indicate two simultaneous actions:\n\nWe **were lying** on the beach sunbathing as they **were playing** volleyball.\n\nThe same meaning is obtained by replacing progressive with the simple past tense, as in the sentence below:\n\nWe **lied** on the beach sunbathing as they **played** volleyball.\n\nHowever, what happens if the simple past tense and progressive are mixed together, as in the sentence below?\n\nWe **were lying** on the beach sunbathing as they **played** volleyball.\n\nDoes this sentence have exactly the same meaning as the first two sentences?",
        "created_utc": 1673736082,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resume question: if a job I've held since 2010 is my primary income, should I still list employment in reverse chronological order?",
        "author": "Misplaced_Altruism",
        "url": "https://www.reddit.com/r/grammar/comments/10bzxsc/resume_question_if_a_job_ive_held_since_2010_is/",
        "text": "I understand that reverse chronological order is preferred for resumes, but I am in something of a strange situation.\n\nMy primary income is from a job I have held since 2010, with several other employers since then. So for this job it says, \"2010 to present\".\n\nShould I still list my employment in reverse chronological order, or more my oldest job and primary income to the top of the list?\n\nThank you",
        "created_utc": 1673731383,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confused with multiple \"ands\" and the need for punctuations in a sentence.",
        "author": "Fantastic_Leg2433",
        "url": "https://www.reddit.com/r/grammar/comments/10bzcxm/confused_with_multiple_ands_and_the_need_for/",
        "text": "I am writing the following sentence:\n\n\" Compact objects are extremely dense objects and they include neutron stars, black holes, white dwarfs and could possibly also include hypothetical stars like boson stars.\"\n\nHowever, Grammarly suggests I put an \"and\" before white dwarf stars, as follows:\n\n\"Compact objects are extremely dense objects and they include neutron stars, black holes, and white dwarfs and could possibly also include hypothetical stars like boson stars.\"\n\nWhy would that \"and\" be there and is Grammarly suggesting wrong? Is there any mistake in the structure of my original sentence?",
        "created_utc": 1673730272,
        "upvote_ratio": 1.0
    },
    {
        "title": "“All Inclusives ‘Is’ A Great Way To Go” / “What’s Your Thoughts”",
        "author": "Longjumping-Fox154",
        "url": "https://www.reddit.com/r/grammar/comments/10byva9/all_inclusives_is_a_great_way_to_go_whats_your/",
        "text": "I’m kind of losing my mind with Reddit’s high number of people that use “is” with a plural instead of “are.” It’s really, really bad. Just spelling mistakes in general are pretty damn bad, too. It seems as though few of these people have ever “red” anything. I’ve never been to the grammar subreddit before &amp; had to look it up because of this. It’s driving me nuts. Is there basically no way back at this point?",
        "created_utc": 1673729076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which of These is Correct?",
        "author": "InitiativeThis2168",
        "url": "https://www.reddit.com/r/grammar/comments/10byv8l/which_of_these_is_correct/",
        "text": "\"I would hate for you to get into a relationship and your parents **be** a hinderance.\"\n\nOR\n\n\"I would hate for you to get into a relationship and your parents **being** a hinderance.\"\n\nI have a hunch that it's the first one, but I'm not certain.",
        "created_utc": 1673729073,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anytime vs any time",
        "author": "likerunningwater",
        "url": "https://www.reddit.com/r/grammar/comments/10bv3vc/anytime_vs_any_time/",
        "text": "Hey everyone, I was hoping somebody could help me out. I’m struggling to understand the difference between anytime and any time. Which sentence is grammatically correct? \n\n1.) “Would you be available any time this Friday?”\n\n2.) “Would you be available anytime this Friday?”",
        "created_utc": 1673719929,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm supposed to quote thoughts/words I said to myself?",
        "author": "clamsquad",
        "url": "https://www.reddit.com/r/grammar/comments/10bpukt/im_supposed_to_quote_thoughtswords_i_said_to/",
        "text": "For example: I saw a drone racing on ESPN the other day, and I was like \"what the hell am I watching\"?\n\nAlso, what and where is the end punctuation supposed to be? My statement isn't t a question, but the thought to myself is.\n\nPlease help me. Things like this make me sick with wonder. I need to know the proper way.",
        "created_utc": 1673706857,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does 'even' do in a sentence, e.g. 'Even if it rains, I'm going to ...'",
        "author": "Joe6pack1138",
        "url": "https://www.reddit.com/r/grammar/comments/10bmj4b/what_does_even_do_in_a_sentence_eg_even_if_it/",
        "text": "What would be the best way to explain it to someone learning English?",
        "created_utc": 1673696449,
        "upvote_ratio": 1.0
    },
    {
        "title": "When vs That",
        "author": "phileotus",
        "url": "https://www.reddit.com/r/grammar/comments/10bmcwi/when_vs_that/",
        "text": "There are many problems that women's rights are limited. \n\nThere are many problems when women's rights are limited.\n\n&amp;#x200B;\n\nAre both sentences correct grammatically? And do they have the same meaning?",
        "created_utc": 1673695803,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to explain that there is no comma splice in \"Come 2030, New Yorkers won’t be allowed to replace their gas stoves with new ones if they break down.\"",
        "author": "SATOEFL",
        "url": "https://www.reddit.com/r/grammar/comments/10bleoh/how_to_explain_that_there_is_no_comma_splice_in/",
        "text": "I am pretty sure the comma below does not introduce a comma splice.\n\n&gt;Come 2030**,** New Yorkers won’t be allowed to replace their gas stoves with new ones if they break down.\n\nBut how can we explain it from the perspective of an English grammatist?\n\nCan we say that \"come 2030\" is equivalent with \"When 2030 should come\"?\n\nThanks for your insights!",
        "created_utc": 1673692252,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does \"contest\" mean?",
        "author": "EngLearnerAibek",
        "url": "https://www.reddit.com/r/grammar/comments/10bl9ti/what_does_contest_mean/",
        "text": "They gathered all their boats and built a barrier on the riverbank in preparation to **contest** the Carthaginian crossing.\n\nContext: \n\nHannibal rested his army for 3 days in hostile territory and began preparations to cross the Rhône. With the Roman army just 4 days away, Hannibal wanted to avoid a set-piece battle with the Gauls, eager to press on towards the Italian peninsula as soon as possible. But on the opposite riverbank, encamped was the army of the Cavares tribe, a Roman ally. They gathered all their boats and built a barrier on the riverbank in preparation to **contest** the Carthaginian crossing.",
        "created_utc": 1673691731,
        "upvote_ratio": 1.0
    },
    {
        "title": "Correct punctuation at the end of a card or letter.",
        "author": "QueenOfPurpleMusic",
        "url": "https://www.reddit.com/r/grammar/comments/10bi0kp/correct_punctuation_at_the_end_of_a_card_or_letter/",
        "text": "I'm overthinking again as I so often do, especially when it comes to perfecting my grammar, but I’ve realised that I don't actually know how to punctuate the end of handwritten communication; for example, if I was to sign _love always_ as I often do or _love from_, how would I punctuate that properly? Which is more grammatically correct? \n\n_love always,_\n_love from,_\n\nor: _love, from, _ or something else?\n\nI’ve never known which is more accurate; I just end up writing them with a comma just before my name.",
        "created_utc": 1673679360,
        "upvote_ratio": 1.0
    },
    {
        "title": "Comma before wherein",
        "author": "da42boi",
        "url": "https://www.reddit.com/r/grammar/comments/10bdhrb/comma_before_wherein/",
        "text": "Are there any general rules regarding the placement of a comma before the word 'wherein' in a sentence, or is it just based on the writer's preference? \n\nEg: 'The analysis presented in \\[2\\], wherein a novel technique is applied to..., was particularly compelling'\n\nIs the comma appropriate here? Also, does the answer to this question depend on the length of the sentence? \n\nThanks in advance!",
        "created_utc": 1673664796,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are ‘can/could’ and ‘be able to’ always interchangeable?",
        "author": "Miscellaneous_Ideas",
        "url": "https://www.reddit.com/r/grammar/comments/10bc76b/are_cancould_and_be_able_to_always_interchangeable/",
        "text": "I read in a grammar book that there is sometimes an occasion on which you cannot use 'can/could' but only 'be able to'. Is this true?",
        "created_utc": 1673661085,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'll do",
        "author": "dcguy852",
        "url": "https://www.reddit.com/r/grammar/comments/10ba5y7/ill_do/",
        "text": "What's with the \"I'll do a gin and tonic\" when ordering? I just noticed this a few months ago and it's everywhere. Had it been this way for a while? What's wrong with \"may I have\" ??",
        "created_utc": 1673655476,
        "upvote_ratio": 1.0
    },
    {
        "title": "APA citations",
        "author": "miridoff",
        "url": "https://www.reddit.com/r/grammar/comments/10b9fan/apa_citations/",
        "text": "I have a doubt regarding the use of in-text citations and a list of references at the end. Is there a need for every reference in the bibliography at the end to have an in-text citation? Is it enough to include the citation in the bibliography and not inside the text? Is there any official source that talks about this? \nThanks",
        "created_utc": 1673653557,
        "upvote_ratio": 1.0
    },
    {
        "title": "either or “aither”",
        "author": "ActualIyCameron",
        "url": "https://www.reddit.com/r/grammar/comments/10b6l4g/either_or_aither/",
        "text": "so in series and stuff I see people pronouncing “either” as either ‘ai-ther’ or ‘either’\n\n(that whole sentence was really confusing to write lol) \n\nis it a accent thing or is it depending on what you’re saying?",
        "created_utc": 1673646490,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it discouraged 'at' whether or discouraged 'about' whether?",
        "author": "Meet-my-pet-rock-241",
        "url": "https://www.reddit.com/r/grammar/comments/10b6kyh/is_it_discouraged_at_whether_or_discouraged_about/",
        "text": "For example 'we feel discouraged at/by/about (?) whether any good will come out of this'\n\nWhich is the right preposition?\n\n&amp;#x200B;\n\nThank you!",
        "created_utc": 1673646480,
        "upvote_ratio": 1.0
    },
    {
        "title": "When should I use an apostrophe in this case?",
        "author": "kohlltrain",
        "url": "https://www.reddit.com/r/grammar/comments/10b6g57/when_should_i_use_an_apostrophe_in_this_case/",
        "text": "I’m getting frustrated trying to remember when it’s appropriate to use an apostrophe. If I’m botching anything please correct me. I appreciate the help in advance!\n\n\nIn this instance, I’m about to send an email to a dog breeder inquiring about an upcoming litter to get a new puppy! When I went to type in the subject line, “Shaggy and Pepper’s 2023 Litter,” I am somehow getting confused about where/if the apostrophe should be placed in ‘Pepper.’\n\nMy question is should the subject be written as:       \n- Shaggy and Pepper’s 2023 Litter              \nOR\n- Shaggy and Peppers 2023 Litter\n\n\n\nThanks for your help!!",
        "created_utc": 1673646147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grammar Help!!",
        "author": "Ok_Display3378",
        "url": "https://www.reddit.com/r/grammar/comments/10b6cli/grammar_help/",
        "text": "*The unknown is a concept that some find frightening and others, exciting.*\n\nDo I need the comma before \"exciting\"?",
        "created_utc": 1673645905,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need apostrophe help, I’m losing my mind. Please help!",
        "author": "kohlltrain",
        "url": "https://www.reddit.com/r/grammar/comments/10b59od/i_need_apostrophe_help_im_losing_my_mind_please/",
        "text": "I’m getting frustrated trying to remember when it’s appropriate to use apostrophe. If I’m botching anything please correct me. I appreciate the help in advance!\n\n\nIn this instance, I’m about to send an email to a dog breeder inquiring about a upcoming litter to get a new puppy! When I went to type in the subject line, “Shaggy and Pepper’s 2023 Litter” I am somehow getting confused about where an apostrophe should be placed.\n\nMy question is should it be: \n- Shaggy and Pepper’s..\nOr\n- Shaggy and Peppers..\n\n\nAlso, I know “I’m” is never supposed to be lowercased, but does the same rule for “It’s” apply?\n\n\nThanks for your help!!",
        "created_utc": 1673643318,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lead or Led? Settle a debate.",
        "author": "SugarcubeMarshmallow",
        "url": "https://www.reddit.com/r/grammar/comments/10b57ei/lead_or_led_settle_a_debate/",
        "text": "So, the internet (which we all know holds the wisdom of the universe) tells me that the past tense of 'lead' is 'led.'  But I grew up believing that it is 'lead.'  What's the true answer and does that vary depending on UK v. US grammar or old v new (like when they changed the use of the apostrophe in its and it's)?  Would love some other words to wisdom to help me on this.  I feel like my whole life has been a lie now.",
        "created_utc": 1673643167,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does this sentence mean?",
        "author": "The_Hack_Modeller",
        "url": "https://www.reddit.com/r/grammar/comments/10b3hgz/what_does_this_sentence_mean/",
        "text": "Does the sentence \"You receive 50% of your DNA from each of your parents\" mean you get:\n\na) a total of 50% of DNA from your parents; \n\nor\n\nb) 100% of your DNA from your parents (50% of your DNA from your mother and 50% from your father)?",
        "created_utc": 1673638972,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does this phrase sound right?",
        "author": "The_Grumpy_Dutchman",
        "url": "https://www.reddit.com/r/grammar/comments/10b3a97/does_this_phrase_sound_right/",
        "text": "Giving a professional reference for a friend. Does the bolded phrase sound/look correct? Included the entire sentence for context, but only focused on the bold portion.\n\n \"I’ve worked with him in a professional capacity for many years in the past and **I’m positive he has the skillset, and beyond, necessary to be a great asset wherever the need arises**.\"",
        "created_utc": 1673638483,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is \"looking back\" on a point in time an incorrect use of english?",
        "author": "Addelyin",
        "url": "https://www.reddit.com/r/grammar/comments/10b1xnk/is_looking_back_on_a_point_in_time_an_incorrect/",
        "text": "Hello! I am not a often on the language side of reddit but I just had a bit of a dissagreement (aka a fun debate) with my Dad that prompted this question. \n\n\"I am looking back on my first day of school\"   \nMy Dad thinks that using the term \"looking back\" when refering to perceiving time is an incorrect  \nuse of the english language.   \nI dissagree. I think it's a perfectly valid way of expressing that you are thinking on a past event.\n\nI would normally put my argument as to why here, but my dad isn't here to defend his side so I'm just going to leave it at that. I don't think I could correctly portay his thoughts on the matter.  \nI might add something in the comments at a later date if the conversation picks up. \n\nThis is honestly just a bit of fun but I'm very much looking forward to seeing what others think.   \n(Also I have ADHD which makes it very hard to remember to check back in on my reddit posts. I am not trying to ghost y'all or anything. I'll be back eventually to see everyones thoughts and talk about it.)",
        "created_utc": 1673635184,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the following sentence grammatically correct - \"Make all local taxes excluded\"?",
        "author": "__daijobou",
        "url": "https://www.reddit.com/r/grammar/comments/10b1e3l/is_the_following_sentence_grammatically_correct/",
        "text": "I want to communicate to a user that they can exclude all local taxes if they wanted to. I'm not really well versed with the rules of the language but would like to know which of these sentences (or as a matter of fact - both of these sentences) are correct and why.\n\n1. Make all local taxes excluded.  \n(I personally feel this reads wrong, but not sure whether it is grammatically wrong as well, and if it is, then why?)\n2. Exclude all local taxes.\n\nAre 1 and 2 both correct? If yes, which one would be better.",
        "created_utc": 1673633879,
        "upvote_ratio": 1.0
    },
    {
        "title": "What exactly is the difference between 'I would've' and 'I'd have'?",
        "author": "Ian1231100",
        "url": "https://www.reddit.com/r/grammar/comments/10azdqi/what_exactly_is_the_difference_between_i_wouldve/",
        "text": "",
        "created_utc": 1673628979,
        "upvote_ratio": 0.99
    },
    {
        "title": "Urgent help needed",
        "author": "CheeseIsLife161616",
        "url": "https://www.reddit.com/r/grammar/comments/10ayj5z/urgent_help_needed/",
        "text": "Original sentence:\n\nMy younger brother, Spencer, is amicable. \n\nPlease help me fix these commas and help me figure out what rule I am missing here.",
        "created_utc": 1673626868,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something that's been bothering me: media referring to sports teams as \"it\" more and more.",
        "author": "Charming_Ad644",
        "url": "https://www.reddit.com/r/grammar/comments/10ax3s4/something_thats_been_bothering_me_media_referring/",
        "text": "There is no way I'm the only one that sees this as dumb, not normal, and possibly even completely incorrect grammatically. (yeah my grammar isn't amazing but this isn't about me) I see pretty much no one speaking about this ever and that blows my mind.\n\nHockey websites, broadcasts, basically all main line media has been referring to teams as \"it\" more and more and it's just mindbogglingly stupid to me. I'm sure it's happening across all sports too but I pay most attention to hockey. Let me provide some really bad examples of this: \n\nDuring TSN World Junior broadcast, before Canada played Slovakia in the quarter final, the broadcast said \"If Canada beats the Slovaks, it will move on to play USA\". Number 1, this would never happen in the past. Everyone would say \"they\" in that instance when referring to Canada because it was known that saying \"it\" would be nonsensical. Now I'm going to explain why it makes 0 sense to refer to a team as \"it\".\n\nDuring the game, the commentators never say \"it\", but \"they\". \n\n\"Canada going to the penalty kill, THEY will have to kill this off here\"                                                                        \n\"Slovaks look a bit sloppy, and Canada, well THEY have just been dominating\"\n\nIf saying \"it\" is grammatically correct over \"they\", why not say \"it\" all the time throughout the game as well when referring to a team? To me, the fact that they don't points to the obvious logical conclusion of \"it\" not being grammatically correct or necessary, because if it was correct they wouldn't use something incorrect like \"they\" at all. They wouldn't use both.\n\nIf you go to NHL com right now, you'll see a news headline about Seattle's victory over Boston right now that says \"KRAK IN THE ARMOR - Streaking Seattle Kraken blanks Boston, hands it (when referring to just \"Boston\") 1st regulation loss\"\n\nSomebody please try to tell me that saying \"it\" in that instance sounds better than \"club\", or \"squad\". You can't, you literally can't. \"it\" sounds and looks ridiculously stupid there. Hands IT (sports TEAM Boston) first regulation loss. \n\nBecause this is happening more and more lately, and it always used to be \"they\", \"them\", or something other than freaking \"it\", i'm not sure an argument can be made that \"it\" is more correct grammar.",
        "created_utc": 1673623303,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a difference between saying \" I don't like to lose games\" Vs I don't like to lose at games\". Is one more correct?",
        "author": "jingleson",
        "url": "https://www.reddit.com/r/grammar/comments/10awsuc/is_there_a_difference_between_saying_i_dont_like/",
        "text": "",
        "created_utc": 1673622514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please use \"that is\" in a sentence, I'm confused ho to. Please help me",
        "author": "Awkward_Department19",
        "url": "https://www.reddit.com/r/grammar/comments/10avvsk/please_use_that_is_in_a_sentence_im_confused_ho/",
        "text": "\"that is\" means \"that is to say\"\n\nBut I want to see \"that is\" being used in a sentence. Thank you!",
        "created_utc": 1673620153,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friends continuously saying like",
        "author": "EntireNecessary9084",
        "url": "https://www.reddit.com/r/grammar/comments/10avdeh/friends_continuously_saying_like/",
        "text": "Not sure if this is best place to post this I am trying to figure out if I am a hater or if my friends statements actually have a reason to get me to roll my eyes. Recently they’ve been saying ‘like’ before an actual statement. \n\n‘It’s like bad’ \n‘I like love it’ \n‘My stomach like doesn’t hurt right now’ \n\nThis boils my blood to be honest and everyone’s just started adding ‘like’ into any sentence. People already say like more than they should but now it feels like they’re purposely trying to be repetitive. Every time they use like in this sense my fight or flight response kicks in. Would this piss anyone else off or am I just being an ass? Do I bring this up or just let them sound illiterate? This isn’t grammatically correct right? So many emotions and questions please help",
        "created_utc": 1673618775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I use \"whose\" in reference to things other than a person?",
        "author": "EngLearnerAibek",
        "url": "https://www.reddit.com/r/grammar/comments/10attxy/can_i_use_whose_in_reference_to_things_other_than/",
        "text": "Words and phrases **whose** meaning I don't know.",
        "created_utc": 1673614409,
        "upvote_ratio": 1.0
    },
    {
        "title": "stared open-mouthed",
        "author": "LegendenHamsun",
        "url": "https://www.reddit.com/r/grammar/comments/10as4rq/stared_openmouthed/",
        "text": "Should you separate open-mouthed with a comma in this sentence?\n\nHe stared, open-mouthed\n\nor is it fine to write\n\nhe stared open-mouthed",
        "created_utc": 1673608885,
        "upvote_ratio": 1.0
    }
]