[
    {
        "title": "is this sentence correct?",
        "author": "Fish_Fucker69s_GF",
        "url": "https://www.reddit.com/r/grammar/comments/zmkhin/is_this_sentence_correct/",
        "text": "Now, I can confirm that he is a true English gentleman. Sometimes he is too pushy and chatty, but I do not entirely dislike him. he still has my respect because of his honorable deed.",
        "created_utc": 1671109147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Verb: singular or plural?",
        "author": "okayabc",
        "url": "https://www.reddit.com/r/grammar/comments/zmjkbc/verb_singular_or_plural/",
        "text": "I just suddenly went by a sentence: \"There ARE a sofa, a desk and eight chairs.\" in a student textbook in my country. I was pretty confused because I thought the to be verb will be defined by the noun following right after the to be verb, which in this case is \"a sofa\", and it is singular. \n\nIf I was right, the sentence should be \"There IS a sofa, a desk and eight chairs\" right?",
        "created_utc": 1671106182,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about possessives",
        "author": "thisisstiv",
        "url": "https://www.reddit.com/r/grammar/comments/zmiv8r/question_about_possessives/",
        "text": "Should possessive be used in \"LVMH's stock\" like in TSLA's share price? If not, please help me explain the difference?\n\n\"While Tesla (TSLA)’s share price has plummeted 54% this year,  LVMH stock has held steady, supported by robust sales in the United  States and Europe.\"\n\nSource: [https://edition.cnn.com/2022/12/14/business/bernard-arnault-richest-person/index.html](https://edition.cnn.com/2022/12/14/business/bernard-arnault-richest-person/index.html) \n\nThanks a lot.",
        "created_utc": 1671103721,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quick grammar check: Is it that they or just they?",
        "author": "talan2",
        "url": "https://www.reddit.com/r/grammar/comments/zmhmzw/quick_grammar_check_is_it_that_they_or_just_they/",
        "text": "The first thing I noticed about the kittens was that they / they weren't as mischievous as I thought they would be. \n\nAnd what's the rule for using that before they?",
        "created_utc": 1671099010,
        "upvote_ratio": 1.0
    },
    {
        "title": "the phrase put me off",
        "author": "itchypitbull",
        "url": "https://www.reddit.com/r/grammar/comments/zmhi5u/the_phrase_put_me_off/",
        "text": "Which of these sentences is correct? and why is one correct and the other is wrong?\n\nthanks in advance\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nThe heavy rain put me off on going for a walk.\n\nThe heavy rain put me off going for a walk.",
        "created_utc": 1671098478,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello! I have some questions I wanted to share. 1- What preposition do you use after the verb \"to die\" when you want to express the date when someone passed away? is it \"in\" or \"on\"? 2- What if it's just one of the two previously mentioned, when do I use the other? 3- Same rules apply to to be born?",
        "author": "DavidRedFox",
        "url": "https://www.reddit.com/r/grammar/comments/zmhfs5/hello_i_have_some_questions_i_wanted_to_share_1/",
        "text": "",
        "created_utc": 1671098244,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"You shouldn't have hid your face\" OR \"you shouldn't have hidden your face\"",
        "author": "fizzkhalifa78",
        "url": "https://www.reddit.com/r/grammar/comments/zmgwq2/you_shouldnt_have_hid_your_face_or_you_shouldnt/",
        "text": "which of the above sentence is grammatically correct??",
        "created_utc": 1671096148,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm wondering if this quote I thought of today makes sense?",
        "author": "Macrodope",
        "url": "https://www.reddit.com/r/grammar/comments/zmcmeh/im_wondering_if_this_quote_i_thought_of_today/",
        "text": "\"My actions adduce impervious cogency, for one cannot surmount that which is an inextricable constant of zenith\". \n\nThoughts?",
        "created_utc": 1671080348,
        "upvote_ratio": 1.0
    },
    {
        "title": "Instead of ‘so much’ is ‘I hate you so bad’ still a correct sentence?",
        "author": "ccallista",
        "url": "https://www.reddit.com/r/grammar/comments/zmaxza/instead_of_so_much_is_i_hate_you_so_bad_still_a/",
        "text": "",
        "created_utc": 1671075028,
        "upvote_ratio": 1.0
    },
    {
        "title": "u all non binaries gender things so f@@ked up lol u shadow ban me for asking questions about grammar and anglish language? i was confused of your usage of them/they instead of he/she i didnt want to offend u fragile faggots xD snowflakes weak..",
        "author": "666trevor666",
        "url": "https://www.reddit.com/r/grammar/comments/zm9793/u_all_non_binaries_gender_things_so_fked_up_lol_u/",
        "text": "[removed]",
        "created_utc": 1671069931,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is there a comma before \" most notably\" ?",
        "author": "Immediate-Voice6581",
        "url": "https://www.reddit.com/r/grammar/comments/zm8drb/why_is_there_a_comma_before_most_notably/",
        "text": "In the two years since it’s been running, the board has taken on a small but essential set of cases**, most notably** Facebook’s decision to ban President Donald Trump from the platform because of his posts during the January 6 insurrection**, a decision** it upheld but critiqued.\n\nWhy is there a comma before \" most notably\" and \" a decision?\" thank you.",
        "created_utc": 1671067642,
        "upvote_ratio": 1.0
    },
    {
        "title": "What punctuation would go between “agenda is” and “Does” Academic essay.",
        "author": "PinotGrigioGrl",
        "url": "https://www.reddit.com/r/grammar/comments/zm7dx7/what_punctuation_would_go_between_agenda_is_and/",
        "text": "My primary question from this research agenda is; Does the rate of technological advancement create a first-mover advantage for a state in competition with another?",
        "created_utc": 1671064934,
        "upvote_ratio": 1.0
    },
    {
        "title": "Em dash questions",
        "author": "Misplaced_Altruism",
        "url": "https://www.reddit.com/r/grammar/comments/zm7b8x/em_dash_questions/",
        "text": "I had two questions about em dashes. \n\n**1) Em dashes to connect two two independent clauses.** \n\n*\"Cancer didn’t bother me—I had a laundry list of vices that would kill me long before a tumor.\"* \n\nI prefer a dash to a semi colon given the somewhat 'punch line' nature of this line. Does this work Also, to my understanding it is correct in fiction to have no spaces around an em dash, is this correct? \n\n**2) Em dashes to show interrupted dialogue, or a brief aside in continuous dialogue.** \n\nA) **Em dashes to show interrupted dialogue.** \n\n\"How you say it? The anem, anem—” \n\n“Anemia,” I said.\" Does this work. \n\nB) **Em dash to show a brief aside in continuous dialogue.** \n\n**\"**Their eyes glow at night, and Adam—” his voice dropped to a whisper, “—never in the world have you seen something like it. \n\n&amp;#x200B;\n\nIf someone if all of these usages are correct, you'd be saving my life. I have a story due at midnight. \n\nThank you internet person.",
        "created_utc": 1671064728,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Did I just witnessed\" or \"Did I just witness\"",
        "author": "ZeljeznicarSampion",
        "url": "https://www.reddit.com/r/grammar/comments/zm5zo0/did_i_just_witnessed_or_did_i_just_witness/",
        "text": "As far as I know, it's \"did i just witness\" but asking just in case",
        "created_utc": 1671061245,
        "upvote_ratio": 1.0
    },
    {
        "title": "blood soaked, bloodsoaked or blood-soaked?",
        "author": "Nyarlathotep13",
        "url": "https://www.reddit.com/r/grammar/comments/zm5nqz/blood_soaked_bloodsoaked_or_bloodsoaked/",
        "text": "My first inclination is that it should be one word like \"bloodstained,\" but looking online it seems like it's  commonly written as two words or a hyphenated word, thus I'm not sure which I should be using.",
        "created_utc": 1671060393,
        "upvote_ratio": 1.0
    },
    {
        "title": "Standard Who/Whom Question",
        "author": "monkskunkdunk",
        "url": "https://www.reddit.com/r/grammar/comments/zm3sg1/standard_whowhom_question/",
        "text": "\"Donations can be given only to persons [who/whom] the donator believes are new members of the organization.\"",
        "created_utc": 1671055775,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"which of us WAS right\" or \"which of us were right.\"",
        "author": "Misplaced_Altruism",
        "url": "https://www.reddit.com/r/grammar/comments/zm0ige/which_of_us_was_right_or_which_of_us_were_right/",
        "text": "In the sentence, \"Maybe it didn’t matter who of us were right.\" Should it be was or were? \n\nThanks!",
        "created_utc": 1671047752,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to use too vs to in this sentence.",
        "author": "Thementalistt",
        "url": "https://www.reddit.com/r/grammar/comments/zlypif/how_to_use_too_vs_to_in_this_sentence/",
        "text": "Looking to create an account called TooNotBeInspired or ToNotBeInspired. \n\nIt essentially will be an account calling fake people out setting unrealistic expectation for people with false information and lies about who they really are. \n\n\nWhich version of to works for that?",
        "created_utc": 1671043157,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using demonstrative pronouns",
        "author": "julietbrea",
        "url": "https://www.reddit.com/r/grammar/comments/zlye80/using_demonstrative_pronouns/",
        "text": "We have to give some peer feedback on a college-level essay today and the person I am peer reviewing has repetitively used the word \"obesity\" in his essay. I will include a short excerpt from his work...\n\n**\"Many people are panicking about the rise of obesity because they do not know the solution to cure obesity. They have wondered what caused obesity and what will be the steps to cure obesity?\"** Within the first 6 sentences, he uses the word \"obesity\" 9 times. \n\nIn high school we never really touched on grammar much, but I'm pretty sure he should've just incorperated demonstrative pronouns instead of using that word so much.... right? I don't think he is trying to use the repetition as like a way to stress the importance, I think he just forgot words like \"it\" and \"that\" existed or something. I also have a feeling english is just maybe not his first language, based off past essays I've reviewed and errors that are consistent with someone who probably isn't familiar with how english works. It's an online class so I've never met the dude.",
        "created_utc": 1671042412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this incorrect?",
        "author": "erbieq",
        "url": "https://www.reddit.com/r/grammar/comments/zly32i/is_this_incorrect/",
        "text": "It's hard working with other writers sometimes because I'm not sure if they're trying to edit with their voice in mind......\n\n&amp;#x200B;\n\n\" Opening my eyes, I could’ve guessed the two who decided to bother me – the Ederin sisters, Gwenlin and Paereen.\"",
        "created_utc": 1671041692,
        "upvote_ratio": 1.0
    },
    {
        "title": "Instead of saying \"easier said than done\" can you say \"not an easy thing to be done\" ?",
        "author": "ontheroad337",
        "url": "https://www.reddit.com/r/grammar/comments/zlx4zx/instead_of_saying_easier_said_than_done_can_you/",
        "text": "",
        "created_utc": 1671039483,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Text Citations",
        "author": "Nicolelaschnolle",
        "url": "https://www.reddit.com/r/grammar/comments/zlvwa9/in_text_citations/",
        "text": "Hi all \n\nIf I’m writing an essay on 2 poems from the same author, how would I do in text citations for the works?\n\nEx: I’m doing my essay on Blake’s “The Tyger” and “London”\n\nWould I write in my essay:\n\nIn Blake’s poem, “The Tyger,” he says “this” (Blake line 4).\n\nOr would I say:\n\nIn Blake’s poem, “The Tyger,” he says “this” (“Tyger” line 4).  \n\nOr would I say:\n\nIn Blake’s poem, “The Tyger,” he says “this” (/Tyger/ line 4).\n\nI guess I’m just wondering if I use his last name in the in text citation even though I’m using 2 of his works, or would I cite the work specifically in the citation and how to do that?",
        "created_utc": 1671036545,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would I format this quote in MLA format",
        "author": "Seb-_8",
        "url": "https://www.reddit.com/r/grammar/comments/zlvsiy/how_would_i_format_this_quote_in_mla_format/",
        "text": "The quote is said by Vince Lombardi; however, there is no source when he said the quote. The quote is, “The man on top of the mountain didn’t fall there” so would I just put his last name at the end of quote and no page number or how would I cite this quote?",
        "created_utc": 1671036295,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grammatically speaking, which of the three are correct?",
        "author": "JDG1822",
        "url": "https://www.reddit.com/r/grammar/comments/zlvg2l/grammatically_speaking_which_of_the_three_are/",
        "text": "1. “Arizona sunsets are different.”\n2. “Arizonan sunsets are different.”\n3. “Arizonian sunsets are different.”\n\nI had corrected someone when they said the first option, stating that the second option is the correct one. But looking back, I’m not sure which of the last two options are correct.",
        "created_utc": 1671035437,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grammatically speaking, which of the three are correct?",
        "author": "JDG1822",
        "url": "https://www.reddit.com/r/grammar/comments/zlvfwa/grammatically_speaking_which_of_the_three_are/",
        "text": "1. “Arizona sunsets are different.”\n2. “Arizonan sunsets are different.”\n3. “Arizonian sunsets are different.”\n\nI had corrected someone when they said the first option, stating that the second option is the correct one. But looking back, I’m not sure which of the last two options are correct.",
        "created_utc": 1671035426,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does English orthography prohibit back-to-back apostrophes? If so, is there any way to contract \"something is\" while also eliding the G?",
        "author": "Alohamori",
        "url": "https://www.reddit.com/r/grammar/comments/zluv7f/does_english_orthography_prohibit_backtoback/",
        "text": "We can use an apostrophe in place of a final G to more accurately reflect the way a speaker might pronounce a word (`readin'`, `somethin'`), and of course we also use \n an apostrophe to perform contraction (`everything is` -&gt; `everything's`).\n\nWhat happens when these two mechanisms meet? Both`somethin' isn't right` and `something's not right` are fine, but `somethin''s not right` speaks for itself. Are we forced to compromise here or is there perhaps an accepted rule that says we use just the one apostrophe and allow it to stand in for both the elision and the contraction?",
        "created_utc": 1671034034,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is this sentence saying?",
        "author": "Minimum-Attention216",
        "url": "https://www.reddit.com/r/grammar/comments/zlun8x/what_is_this_sentence_saying/",
        "text": "“You, your spouse and your children, up to age 19, are covered while insurance is in effect”\n\nWho is covered here? Only children under 19? Spouse and children under nineteen? All of us as long as we’re under 19? Me and my spouse regardless of age as well as our young children?",
        "created_utc": 1671033510,
        "upvote_ratio": 1.0
    },
    {
        "title": "Italicizing or Quotation marks for foreign languages?",
        "author": "jeffersonfsteelflex",
        "url": "https://www.reddit.com/r/grammar/comments/zluj4m/italicizing_or_quotation_marks_for_foreign/",
        "text": "For an essay, some words that I keep the original Spanish in (ex: Sendero Luminoso or el profesor) feel to fit better as italicized, but if I am using \"Noche Buena,\" (Christmas Eve in Spanish), it seems to fit better with quotation marks. \n\n&amp;#x200B;\n\nThis is for Chicago style, any guidelines I should know? Can I use both italics and quotations marks?",
        "created_utc": 1671033228,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would be a better way to say as awesome as challenging?",
        "author": "ontheroad337",
        "url": "https://www.reddit.com/r/grammar/comments/zlu6m3/what_would_be_a_better_way_to_say_as_awesome_as/",
        "text": "",
        "created_utc": 1671032364,
        "upvote_ratio": 1.0
    },
    {
        "title": "How strict are grammar rules for commas in dialogue?",
        "author": "Misplaced_Altruism",
        "url": "https://www.reddit.com/r/grammar/comments/zltpfu/how_strict_are_grammar_rules_for_commas_in/",
        "text": "Can you use a comma to show a pause in spoken dialogue, even if not grammatically necessary? The genre is literary fiction. \n\nFor example:\n\nHe lost a son who was just a boy, and now drinks more than both of us together.\"",
        "created_utc": 1671031209,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this sentence correctly written in past tense?",
        "author": "Uuthgar",
        "url": "https://www.reddit.com/r/grammar/comments/zlt137/is_this_sentence_correctly_written_in_past_tense/",
        "text": "\"She picked up the dress and splayed it out in front of her, examining its surface carefully.\"\n\nI'm doing some creative writing and I'm trying to be more careful about my use of tenses. This sentence 'sounds' right, but isn't \"examining\" present tense? Would it be more correct to write:\n\n\"She picked up the dress, splayed it out in front of her and examined its surface carefully.\"",
        "created_utc": 1671029645,
        "upvote_ratio": 1.0
    },
    {
        "title": "Differences between \"(Read: . . .)\" and \"i.e.\"?",
        "author": "RotaVitae",
        "url": "https://www.reddit.com/r/grammar/comments/zlrc5o/differences_between_read_and_ie/",
        "text": "I'm a little confused by this. I've only seen \"(read:...) in scholarly papers or conversation, but to my mind they roughly fulfill the same function.\n\ni.e., in other words, clarifies the intention of a word or subject, while Read: implies how one should read/interpret the implications of a word or phrase. But read almost seems more snobbish or mildly sarcastic, like \"I'm saying x, but you should *really* read it as y, nudge nudge.\"\n\nCould you clarify? Thank you.",
        "created_utc": 1671025537,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a word for this?",
        "author": "Ice-Guardian",
        "url": "https://www.reddit.com/r/grammar/comments/zlmqfi/is_there_a_word_for_this/",
        "text": "I keep thinking it's welscmertz or ennui, but it's not precisely.\n\nWhen someone isn't satisfied with working 9-5, going out weekends, settling down and retiring at 90 with a shit pension, no savings and unable to do the things you wanted to.\n\nI can't find a word that describes it. I guess it'll be a philosophical word.",
        "created_utc": 1671010639,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it preferable to use a comma at the end of second last item of a list?",
        "author": "DavidGamingHDR",
        "url": "https://www.reddit.com/r/grammar/comments/zlmg34/is_it_preferable_to_use_a_comma_at_the_end_of/",
        "text": "Hi there!\n\nJust had a quick question. Is it better to add a comma between the end of the second last item of a list, and the following \"and\", or not?\n\nFor example:\n\n1. Apples, pears**,** and strawberries.\n2. Apples, pears and strawberries.\n\nThanks!",
        "created_utc": 1671009582,
        "upvote_ratio": 1.0
    },
    {
        "title": "How should I format this laser engraving?",
        "author": "AzeriKashew",
        "url": "https://www.reddit.com/r/grammar/comments/zll7h4/how_should_i_format_this_laser_engraving/",
        "text": "Hello all,\n\nI am customizing a commemorative knife made for a previous Eagle Scout achievement, and I would like your assistance in finding the most suitable way to display the desired text for engraving. \n\nThe maximum available space allows 35 characters, engraved on a stainless steel handle. Chosen font shown is in [picture](https://imgur.com/gallery/wCL5QtU) attached. Name, Title as well as the Month and year of the award must be present, but may be rearranged however if incorrect, etc. \n\nThanks for any help in advance.",
        "created_utc": 1671004850,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"The Alps is/are a mountain range.\" \"The West Indies is/are a group of islands.\"",
        "author": "bareunnamu",
        "url": "https://www.reddit.com/r/grammar/comments/zlkoab/the_alps_isare_a_mountain_range_the_west_indies/",
        "text": "I have been studying Vocabulary in Use Intermediate 2nd Edition by Stuart Redman published by Cambridge University.\n\n&amp;#x200B;\n\nIn Unit 42, it says \"**The Alps are a mountain range**\" and \"**The West Indies are a group of islands.**\" Does the book make sense? I thought it might be correct to say \"**The Alps is a mountain range**\" and \"**The West Indies is a group of islands.**\"",
        "created_utc": 1671002819,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is 'holy cow' one of the most common and generic exclamatory phrases in English?",
        "author": "Briacle",
        "url": "https://www.reddit.com/r/grammar/comments/zlk42y/is_holy_cow_one_of_the_most_common_and_generic/",
        "text": "Not from a strictly textbook point of view. I'm talking about a practical real world scenario where a stronger English exclamation than \"wow\" is used.\n\nI'm trying to give examples to an English learner. How would you explain this to somebody whose first language is not English? Without being too explicit or vulgar, English speakers tend to say things like \"holy smokes\" or \"great Scott\" to express surprise or bewilderment. What's the most common and generic one that's more powerful than \"wow\" but doesn't involve any profanity? I'm thinking it's \"holy cow,\" but is this just my generation? Do younger or older generations say something different?",
        "created_utc": 1671000811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Non Native English speaker here, which is correct?",
        "author": "ruitachibanateamonly",
        "url": "https://www.reddit.com/r/grammar/comments/zlj8ue/non_native_english_speaker_here_which_is_correct/",
        "text": "Is it \n\n\"You don’t have much of a life *THAN*\" or  \n\nYou don’t have much of a life *THEN*",
        "created_utc": 1670997857,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are either of these considered oxymorons: \"IPX4 Waterproof\" or \"water resistant Waterproof\"",
        "author": "odysseynova",
        "url": "https://www.reddit.com/r/grammar/comments/zlicu9/are_either_of_these_considered_oxymorons_ipx4/",
        "text": "",
        "created_utc": 1670994998,
        "upvote_ratio": 1.0
    },
    {
        "title": "is \"IPX4 Waterproof\" a oxymoron",
        "author": "odysseynova",
        "url": "https://www.reddit.com/r/grammar/comments/zli475/is_ipx4_waterproof_a_oxymoron/",
        "text": "",
        "created_utc": 1670994257,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is it called when you add a letter to a word for a pun?",
        "author": "stefansalvawhore",
        "url": "https://www.reddit.com/r/grammar/comments/zlhnjy/what_is_it_called_when_you_add_a_letter_to_a_word/",
        "text": "eg ) holy moly turns into hole-y moly because they’re talking about gold or something idk",
        "created_utc": 1670992835,
        "upvote_ratio": 1.0
    },
    {
        "title": "The grammar in \"You're no daughter of mine\".",
        "author": "Edouardwanders",
        "url": "https://www.reddit.com/r/grammar/comments/zlhck3/the_grammar_in_youre_no_daughter_of_mine/",
        "text": "I saw this sentence while playing video games and coundn't figure out the rule. I did think of the pattern \"no + noun = not a noun\" as long as the noun is gradable. But in this case, I don't think \"daughter\" is anywhere near gradable. Could anyone explain how this sentence is right to me please? Thanks in advance!",
        "created_utc": 1670991923,
        "upvote_ratio": 1.0
    },
    {
        "title": "quick grammar check",
        "author": "InG00dFaith",
        "url": "https://www.reddit.com/r/grammar/comments/zlgcfy/quick_grammar_check/",
        "text": "\"I just sat through this quiz with various people watching me as my brain blanks out and dies\"\n\n&amp;#x200B;\n\nshould it be \"as my brain blankED out and dieD\" , or is the original statement correct? Or are they both correct based on context? I'm relating what happened to me to a friend.",
        "created_utc": 1670989005,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which way should I word this sentence?",
        "author": "Speakersonicz",
        "url": "https://www.reddit.com/r/grammar/comments/zlfl7i/which_way_should_i_word_this_sentence/",
        "text": " Assembled Gasket and Sender and utilizing a lock ring machine to screw the sender in place\n\nAssembled Gasket, Sender and utilizing a lock ring machine to screw the sender in place\n\nIf you have a better way to word this sentence, then i'm all eyes for it",
        "created_utc": 1670986902,
        "upvote_ratio": 1.0
    },
    {
        "title": "how can I make this sentence sound better?",
        "author": "Special-Culture-970",
        "url": "https://www.reddit.com/r/grammar/comments/zldax5/how_can_i_make_this_sentence_sound_better/",
        "text": "Studying media historically allows for a more comprehensive understanding of their continuing influence on humans, technology, the environment, culture, and the world at large, among countless other things, both known and unknown. \n\nIs it even grammatically correct as it is?",
        "created_utc": 1670980830,
        "upvote_ratio": 1.0
    },
    {
        "title": "Duo, Duel, and Dual",
        "author": "TA_OGBOYs",
        "url": "https://www.reddit.com/r/grammar/comments/zld8gu/duo_duel_and_dual/",
        "text": "Hello everyone, can you explain the difference between the three words in the title? I don't know when to use each word, and thank you.",
        "created_utc": 1670980660,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is “the” in “the Church of Jesus Christ of Latter Day Saints” capitalized?",
        "author": "HumpyTheClown",
        "url": "https://www.reddit.com/r/grammar/comments/zlck4l/is_the_in_the_church_of_jesus_christ_of_latter/",
        "text": "",
        "created_utc": 1670978929,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you see a siren?",
        "author": "NoUsernameHereNow",
        "url": "https://www.reddit.com/r/grammar/comments/zl8qp5/can_you_see_a_siren/",
        "text": "This is really confusing me and I feel like it shouldn’t! \n\nI’m referring to the siren of a police car/ambulance, and I’ve just written a sentence in which a character believes the emergency services are on their way.\n\nI’ve written: “in those final moments, he thought he saw sirens”, by which I’m referring to the flashes of blue and red that obviously herald their arrival.\n\nI was just wondering, though, can you actually SEE a siren, or is it by definition a type of sound only?",
        "created_utc": 1670969690,
        "upvote_ratio": 1.0
    },
    {
        "title": "This use of the word, \"which\".",
        "author": "_player_0",
        "url": "https://www.reddit.com/r/grammar/comments/zl8mcf/this_use_of_the_word_which/",
        "text": "Is there anything wrong with this sentence? \nWhat part of speech is the word, \"which\" in the sentence? \n\n_I had dogs growing up, but they stayed outside (which freedom I think is better for them)._",
        "created_utc": 1670969407,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is \"high as wise and willing hands\" an alliteration from Beowulf?",
        "author": "jeiay",
        "url": "https://www.reddit.com/r/grammar/comments/zl6w9s/is_high_as_wise_and_willing_hands_an_alliteration/",
        "text": "",
        "created_utc": 1670965450,
        "upvote_ratio": 1.0
    },
    {
        "title": "Since I am a bit unsure about the answer of another very kind and helpful Redditor I would like to ask my question here once more to make sure. \"He is named after a famous celebrity\". Could anyone analyze this sentence (so what each word functions as e.g \"He\" is the subject and a pronoun\") Thanks",
        "author": "BimboDollMaker247",
        "url": "https://www.reddit.com/r/grammar/comments/zl674c/since_i_am_a_bit_unsure_about_the_answer_of/",
        "text": "",
        "created_utc": 1670963806,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a question about will vs. going to. When you look it up on the web and when I refer to what I learned in school I get a completely different result compared what native speakers tell me.",
        "author": "BimboDollMaker247",
        "url": "https://www.reddit.com/r/grammar/comments/zl42w9/i_have_a_question_about_will_vs_going_to_when_you/",
        "text": "In school, they taught us (native german speaker) that we use going to future for previously made plans or intentions, things based on present evidence and in general anything we thought of before speaking. Meanwhile, native speakers in a way tell me the opposite. While school taught me that I should use will for things like promises, threats, inventions and basically anything I decide at the moment of speaking as well as things I cant influencer (the sun will rise) natives here also tell me a different thing. Most natives here have told me that I should use going to for less serious things and will for things with more determination behind the. For example they consider \"I will win\" as more serious and dedicated than \"I am going to win\". So please feel free anyone who is teaching English and has a wider knowledge on this topic please educate me because right now I am unsure who I should believe. Greetings Max",
        "created_utc": 1670958771,
        "upvote_ratio": 1.0
    },
    {
        "title": "Writing out an object's dimensions (like 3x4' or 5x10') — where do the hyphens go?",
        "author": "numerousest",
        "url": "https://www.reddit.com/r/grammar/comments/zl2boi/writing_out_an_objects_dimensions_like_3x4_or/",
        "text": "Suppose there is a painting that measures 5 feet high and 10 feet wide (5x10'). How would you write this out entirely in words?\n\n1. a five foot by ten foot painting\n2. a five-foot by ten-foot painting\n3. a five-foot-by-ten-foot-painting\n4. a five-by-ten foot painting\n5. a five-by-ten-foot painting\n6. a five foot–by–ten foot painting (en dash)",
        "created_utc": 1670954662,
        "upvote_ratio": 1.0
    },
    {
        "title": "is this sentence grammarly correct",
        "author": "Memebba",
        "url": "https://www.reddit.com/r/grammar/comments/zl22d2/is_this_sentence_grammarly_correct/",
        "text": "However, nothing concrete has yet to be done.",
        "created_utc": 1670954102,
        "upvote_ratio": 1.0
    },
    {
        "title": "When writing emails greetings.",
        "author": "Leugim7734",
        "url": "https://www.reddit.com/r/grammar/comments/zl1k1v/when_writing_emails_greetings/",
        "text": "Good morning [name], \n\nOr \n\nGood morning, [name], \n\nWhich one is the correct one? Or it doesn't matter?",
        "created_utc": 1670952915,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the phrase 'Some of you be' ever correct?",
        "author": "unicornsodapants",
        "url": "https://www.reddit.com/r/grammar/comments/zl0hef/is_the_phrase_some_of_you_be_ever_correct/",
        "text": "I received an email with the sentence, \"Some of you be experiencing severe storms in your area.\"  Is this correct grammar?  \n\nMy initial thought is that the sentence should read, \"Some of you are experiencing severe storms in your area.\"   That got me wondering, is the phrase \"Some of you be\" ever correct?  If it is, can I please have an example of the phrase used in a sentence other than the one provided?\n\nThank you.",
        "created_utc": 1670950479,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Oh-so easy” or “oh-so-easy”",
        "author": "CollectiveEra",
        "url": "https://www.reddit.com/r/grammar/comments/zl0awe/ohso_easy_or_ohsoeasy/",
        "text": "“Try our new platform—we’ve made it *oh-so easy*.”\n\nI’m confused on which to use here. It seems like “oh-so easy” makes the most sense because without the “oh,” it would obviously be “so easy” not “so-easy.”\n\nBut then wouldn’t “oh-so-easy” be a compound adjective for the “it”…?!\n\nI think I’ve read it so many times that my mind is fried… please help!",
        "created_utc": 1670950031,
        "upvote_ratio": 1.0
    },
    {
        "title": "Besides vs In the end",
        "author": "Sukardaddy",
        "url": "https://www.reddit.com/r/grammar/comments/zkwemt/besides_vs_in_the_end/",
        "text": "I had a little argument with my English teacher about what is the correct word to complete the sentence with.\nI'll be happy for your help and explanation.\nThe test is about connector words.\nHere's the sentence:\n\n_______ Wayne, Tom and Bob are my closest friends.",
        "created_utc": 1670939952,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help with a subject-verb agreement error, please!",
        "author": "halfbeastbeowulf",
        "url": "https://www.reddit.com/r/grammar/comments/zkwb13/i_need_help_with_a_subjectverb_agreement_error/",
        "text": "How should I categorize and analyze this error: \"I would living\"?",
        "created_utc": 1670939675,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help for an upcomming english exam",
        "author": "SniperCaroline",
        "url": "https://www.reddit.com/r/grammar/comments/zkw3mf/i_need_help_for_an_upcomming_english_exam/",
        "text": "Is this sentence corect and if so why?\n\n\"My family decided that going to New York, to experience the American culture, would be a good way for me, to see how other people live\"\n\nI am especially uncertain of the first part",
        "created_utc": 1670939098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Outside sth. or outside of sth.",
        "author": "MeisterSchmidt",
        "url": "https://www.reddit.com/r/grammar/comments/zkve1x/outside_sth_or_outside_of_sth/",
        "text": "Hi, I'm writing lyrics for a new song at the moment. The sentence in question is:\n\n''I feel unsafe outside my cage.\"\n\nIs outside correct as a preposition in this case or does it have to be \"outside of\"?",
        "created_utc": 1670937029,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help check my short story.",
        "author": "Whateverchan",
        "url": "https://www.reddit.com/r/grammar/comments/zks07w/please_help_check_my_short_story/",
        "text": "**Opening:** A concert is being held tomorrow, and naturally, (A) wants to go. But try as he may, he hasn't been able to get his hand on a ticket. No matter where he asks, all the tickets were sold out. Being a crazy fan, he wants to attend the concert no matter what.\n\nHe hears rumors that the (B company) has one last ticket which was reserved for (C man). Desperate to attend the concert, (A) decides to assault the (B location) to get his hands on that ticket. Unbeknownst to him, (C man) had reserved that ticket for (D guy) as a birthday gift...\n\n**Ending:** A succeeded in retrieving the concert ticket from the (B company). Wasting no time, he heads to the location of the concert immediately. However, unbeknownst to him, (D guy) was already on his tail. (D), also another crazy fan, wasn't going to let (A) get away with his ticket. Enraged that A had stolen his birthday present, D transforms into his X form, and goes after A... **-End-**\n\nIt's just a silly short story I wrote. Just want to know if there's any issue with past tense or present tense in it. If you see something else odd, please let me know as well.\n\nThanks in advance! :)",
        "created_utc": 1670925367,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does 'Opposite' And 'Reversing' Have The Same Meaning?",
        "author": "InspectionSolid8732",
        "url": "https://www.reddit.com/r/grammar/comments/zkps6w/does_opposite_and_reversing_have_the_same_meaning/",
        "text": " *Just as McClure invented GPS by thinking in the (　　　　　) direction of Guier and Weiffenbach’s ideas, we can come up with creative discoveries by looking at things with new eyes.*\n\nHi, everyone! I need your help.\n\nI wonder if 'reversing' can also work in the blank above. I already looked up in Google, and there are many examples of 'thinking in the opposite direction' or 'thinking in the reverse direction'. However, the only example of 'in the reversing direction' on Google is all about vehicles going backward, just like the sentence below.\n\n* If the system determines a possible collision with an object in the reversing direction, automatic deceleration will be activated. Also, beeping sounds will activate.\n\nBut the sentence on top is not about the observable physical movement, but about the abstract notion. So in my opinion, 'reversing' would not be the right word for the blank. But I'm not 100% sure, so I'm asking for your insight. Any ideas are welcome!",
        "created_utc": 1670916751,
        "upvote_ratio": 1.0
    },
    {
        "title": "there are 3 spots in a finals essay where i’m not sure if my grammar is quite right and i’d really appreciate help!",
        "author": "juicyglittershart",
        "url": "https://www.reddit.com/r/grammar/comments/zkpl08/there_are_3_spots_in_a_finals_essay_where_im_not/",
        "text": "ok, the spots are:\n\n1. Those people are making demands: they’re demanding the enshrinement of abortion rights into law, they’re unionizing their workplaces.\n\nis this best or would it be better to use a semicolon or break it up into sentences (Those people are making demands. They’re demanding the enshrinement of abortion rights into law. They’re unionizing their workplaces.)\n\n2. When socialists join mainstream movements for abortion rights, they are able to share a socialist vision of a world in which bodily autonomy cannot be stripped from us with a huge audience that may not have heard it otherwise.\n\nwould ending that with “with a huge audience that may never hear it otherwise.” be better grammatically? is there an even better option i’m missing?\n\n3. Alternatives often remain out of sight.\n\nthis one’s actually word choice. i would like to replace “out of sight” with something better/clearer. \n\nthank you for any help!",
        "created_utc": 1670916024,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this the right placement of a comma?",
        "author": "Old_Introduction5472",
        "url": "https://www.reddit.com/r/grammar/comments/zknlgj/is_this_the_right_placement_of_a_comma/",
        "text": "“I know that sounds hard but if you avoid carbohydrates like bread, cereal, crackers, and avoid even fruit like apples and oranges that have high sugar in them you will have less cravings and if you have less cravings you will eat less whilst still not feeling hunger, keeping you satisfied for that day.”",
        "created_utc": 1670909617,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone tell what she is saying?",
        "author": "helpmeidentifywords",
        "url": "https://www.reddit.com/r/grammar/comments/zkn4gb/can_anyone_tell_what_she_is_saying/",
        "text": "https://youtu.be/_H0vfeIntjE\n\nIt might seem bizarre to request a translation from English into English, but this Hispanic woman's accent is so difficult for me to understand, that I feel that I need help, possibly from someone who speaks Spanish.\n\nAt 18:57, she says 'For preachers', but I cannot tell what she said. The next thing that I'm able to make out is 'for all of the--' before she changes her sentence.\n\nNow, she's obviously not a native speaker, so that is probably a major reason why I'm unable to understand her, but if anyone were to help out, that would be amazing",
        "created_utc": 1670908214,
        "upvote_ratio": 1.0
    },
    {
        "title": "What kind of sentence are these?",
        "author": "MaxHayday",
        "url": "https://www.reddit.com/r/grammar/comments/zkn153/what_kind_of_sentence_are_these/",
        "text": "'None but truth triumphs?'\nThe options given are assertive, affirmative and negative\n\n'I wish I were a man' \nOptions are assertive or affirmative",
        "created_utc": 1670907941,
        "upvote_ratio": 1.0
    },
    {
        "title": "in search of a book on grammar",
        "author": "rh397",
        "url": "https://www.reddit.com/r/grammar/comments/zkm6vg/in_search_of_a_book_on_grammar/",
        "text": "Hello,\nFor context, I have a B.A. in English, but I am looking for a good book on grammar, whether it be a reference book or a high level textbook.\n\nI might be teaching high school English in the future, and I would love something to brush up the subject on for my own sake as well as to keep for reference or use as a teaching aid.",
        "created_utc": 1670905492,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are commas optional after three word introductory phrase?",
        "author": "Misplaced_Altruism",
        "url": "https://www.reddit.com/r/grammar/comments/zkj3rv/are_commas_optional_after_three_word_introductory/",
        "text": "Take a sentence like, \"As everyone ate their voices crowded together, blending into a thick mix of languages\". \n\nIs a comma after ate, \"As everyone ate, their voice...\" or is that optional since the phrase is less than 4 words?",
        "created_utc": 1670897050,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should this word be singular or plural?",
        "author": "Longjumping-Dog9149",
        "url": "https://www.reddit.com/r/grammar/comments/zkj15v/should_this_word_be_singular_or_plural/",
        "text": "Say you have a sentence with a parenthetical in the middle- does the parenthetical influence whether the following word is singular or plural? \n\nFor example:\n\nHis brawn, paired with my intelligence, make(s) us stand out.\n\nOr\n\nMy abilities, along with my tenacity, make(s) me the best candidate. \n\nI put them in a free grammar checked and both the singular and plural versions “passed,” so I’m confused which is right?",
        "created_utc": 1670896859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about punctuating a list in dialogue",
        "author": "Misplaced_Altruism",
        "url": "https://www.reddit.com/r/grammar/comments/zkhem5/question_about_punctuating_a_list_in_dialogue/",
        "text": "I usually prefer to just use commas and periods as much as I can in dialogue. For a sentence like:\n\n*\"Whatever it is you want in life, happiness, power, fame, just gemstones are enough. Enough for all of it. What say you?\"* \n\nHow would you format this? Is this better:\n\n*\"Whatever it is you want in life: women, power, fame—just a few strands of their hair is enough. Enough for all of it. What say you?*  \n\nAny suggestions?",
        "created_utc": 1670892620,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've noticed I make a word order mistake.",
        "author": "Somethinghells",
        "url": "https://www.reddit.com/r/grammar/comments/zkh77g/ive_noticed_i_make_a_word_order_mistake/",
        "text": "\"How could I have **not** seen this?\" This is a sentence from a show I've been watching.\n\nNow, this is how I would write this sentence:\n\n1.Declarative - *I couldn't have seen* *this* or *I could* ***not*** *have seen this*\n\n2. Interrogative - *How couldn't I have seen this?* or *How could I* ***not*** *have seen this?*\n\nWhy do I want to put **not** where I have put it? I am really surprised, even a little shocked, that I have problems with word order.",
        "created_utc": 1670892099,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello friends of grammar, my family has a 10 year raging debate going on. Whats the proper way to pluralize my last name? My family is the Los Angeles Davises. My last name is Davis. What's correct? Davis'? Davis's? Davises?",
        "author": "TheTimDavis",
        "url": "https://www.reddit.com/r/grammar/comments/zkglsg/hello_friends_of_grammar_my_family_has_a_10_year/",
        "text": "",
        "created_utc": 1670890588,
        "upvote_ratio": 1.0
    },
    {
        "title": "“He was given [an apple.]” Is “apple” the direct object here?",
        "author": "onelastlightofficial",
        "url": "https://www.reddit.com/r/grammar/comments/zkehwx/he_was_given_an_apple_is_apple_the_direct_object/",
        "text": "“He was given an apple.”\n\nI can’t find a single resource anywhere that talks about direct objects with the passive voice, but just as “he” is the subject in this construction here, wouldn’t “apple” be the direct object in this passive construction? \n\nAlso, a Sidenote: (I tried looking up if passive sentences can have direct objects, but I couldn’t find anything on it).\n\nI know that this topic is similar to sentences that have both an indirect and direct object, and uses something called “dative” but I still haven’t gotten an answer on this.\n\nFor instance:\n\nI gave him an apple.\n\nDative —&gt; I gave an apple to him. (Switches the indirect and direct object).\n\nAs for the Passive… (two variations):\n\n“An apple was given to him.”\n\nOr (my original example)\n\n“He was given an apple.”\n\nI know that both sentences are possible, but, my ultimate question is: in the passive example, I.e.: “he was given an apple,” is apple the direct object of this passive construction, or not? If not, then what is it?\n\nThanks, you guys.",
        "created_utc": 1670885609,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help with my lyrics",
        "author": "Kayttaja99",
        "url": "https://www.reddit.com/r/grammar/comments/zkeey9/i_need_help_with_my_lyrics/",
        "text": "I'm writing a song. I am not a native english speaker so I need help with the lyrics. Is it understandable to sing \"walk here on my scene, i'll take you into your dreams\"? Or should the lyrics be \"walk into my scene\" or \"walk here to my scene?\". Or something else? There is a idiom \"come on the scene\" but I think the word \"come\" does not fit the song.",
        "created_utc": 1670885433,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does hammer and sickle have a dash?",
        "author": "jeffersonfsteelflex",
        "url": "https://www.reddit.com/r/grammar/comments/zkde0l/does_hammer_and_sickle_have_a_dash/",
        "text": "Wonder if the words \"hammer and sickle\" should have a dish between each one, for example, \"hammer-and-sickle graffiti?\"",
        "created_utc": 1670883285,
        "upvote_ratio": 1.0
    },
    {
        "title": "After God enters into my sexy body, my dick starts dancing and spinning. God is the horny ghost",
        "author": "Firm-Magazine1833",
        "url": "https://www.reddit.com/r/grammar/comments/zkcw2c/after_god_enters_into_my_sexy_body_my_dick_starts/",
        "text": "[removed]",
        "created_utc": 1670882212,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I have a new idea about the simple past that works quite well and want to ask if it makes sense. Can I use the simple past without a past time as long as the person I am speaking to knows what time I am referring to? For example (Example below) (Thanks for the help on my Exam today : ) )",
        "author": "BimboDollMaker247",
        "url": "https://www.reddit.com/r/grammar/comments/zkcmta/i_think_i_have_a_new_idea_about_the_simple_past/",
        "text": " \n\nIf  I say \"Sorry I didnt mean to scare you\" my friend most likely knows what past moment I mean since for example 5 minutes ago I jumped him and he was surprised by it. So I think maybe a good rule for me would be  that the simple past answers the when most often while the present perfect is more about what result it has for the present or how it relates to the present. So when I use simple past the when should be clear to my partner in a way and when it isnt clear and I don't focus on time but the result or importance of the action now I use present perfect. I as the speaker decide which one I want to use. Neither of them are right or wrong in some situations but they just mean different things. As I said yesterday I had my last exam earlier today and I am sure it went quite well. I want to thank every single one of you that has helped me so far with this problematic topic. It is a journey for me to learn this lovely language and my goal of becoming a good English teacher one day seems to get closer and closer. So yes thanks to all of  you for always being so patient with me and answering my questions : )  merry Christmas you all and enjoy the free time without my \"stupid\"  questions haha",
        "created_utc": 1670881675,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which sentence is correct? Why?",
        "author": "corgosinho",
        "url": "https://www.reddit.com/r/grammar/comments/zkcj1t/which_sentence_is_correct_why/",
        "text": "Did you find the book you wanted?\nOr\nDid you find the book you want?",
        "created_utc": 1670881470,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this a slang sentence?",
        "author": "Lyrics100",
        "url": "https://www.reddit.com/r/grammar/comments/zkbhu7/is_this_a_slang_sentence/",
        "text": "Now we gotta show we been had these and pretend it's something new?\n\nThis has to be grammatically wrong right? We been had part...",
        "created_utc": 1670879227,
        "upvote_ratio": 1.0
    },
    {
        "title": "Punctuation help",
        "author": "No-Winter588",
        "url": "https://www.reddit.com/r/grammar/comments/zkawkg/punctuation_help/",
        "text": "When we think of a sport(?) be it basketball, football, lawn tennis, or the likes (?) we believe that most of the burden of winning and performing is on the shoulders of the players and the team on field. \n\nWhat punctuation is best suited in place of (?)",
        "created_utc": 1670877971,
        "upvote_ratio": 1.0
    },
    {
        "title": "I dont know if the semi colon is in proper use",
        "author": "JamesTheMemeDealer",
        "url": "https://www.reddit.com/r/grammar/comments/zk89nx/i_dont_know_if_the_semi_colon_is_in_proper_use/",
        "text": " and then the new guy; Cormac. Walks in last.",
        "created_utc": 1670872244,
        "upvote_ratio": 1.0
    },
    {
        "title": "My interest in dogs came/comes from…?",
        "author": "strawbarrassed",
        "url": "https://www.reddit.com/r/grammar/comments/zk84ja/my_interest_in_dogs_camecomes_from/",
        "text": "Is this a stylistic choice? Different meaning? Thank u 🙏",
        "created_utc": 1670871933,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quoting Text Messages",
        "author": "indianajoe777",
        "url": "https://www.reddit.com/r/grammar/comments/zk5ect/quoting_text_messages/",
        "text": "So, I know that when quoting text messages you simply format it like you would spoken dialog. However, since the quote is a literal representation of what was written elsewhere (not speech converted to text), do punctuation and capitalization rules apply?\n\nFor instance:\n\nFor speech you would write something like:\n\nBetty turned to Sue and said, \"You shouldn't come to work tomorrow.\"\n\n&amp;#x200B;\n\nFor texting, if the actual text message received on your phone was: u shouldnt come it to work tomorrow\n\nHow should you format it?\n\n1. Betty texted Sue. \"u shouldnt come to work tomorrow\" (exactly as written)\n\nOr\n\n2. Betty texted Sue. \"You shouldn't come to work tomorrow.\" (corrected)\n\nOr\n\n3. Betty texted Sue. \"U shouldnt come to work tomorrow.\" (Cap and period, but otherwise verbatim)",
        "created_utc": 1670866153,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are these archaic forms used correctly?",
        "author": "Tarachian_farmer",
        "url": "https://www.reddit.com/r/grammar/comments/zk34ct/are_these_archaic_forms_used_correctly/",
        "text": "Sorry if this post becomes too long. I have special trouble with the verb forms, and I wanted to know if I have been using them correctly.\n\n\"\\[...\\] the one who bringeth death  \\[...\\]\"\n\n\"\\[...\\] Then will thou spare us the shame of defeat  \\[...\\]\"\n\n\" That is not why I am come, but to reveal to thee what is hidden from thine eyes. For the fate of thee and thy kin hath already been sealed: ye shall be victorious, and return to thy promised land. And thou \\[...\\] will be rewarded with a mighty son, who will surpass thee in fame. However, fate hath its price, and he assured that thou shalt have a short life and thou shalt not see the work of thy hands grow.\" \n\n\"Thou hast corrupted the spirit of the highest art, the spirit of that which moveth Cosmos and giveth life, and have used it to bring suffering \\[...\\]\" \n\n\"And who art thou to dictate the use of mine art? Fine then, behold, for while thou wastest it in foolish songs to the wind and the trees, and the unattainable stars, I have used it to mine advantage.\" \n\n\"\\[...\\] if thou wishest to use art for thine advantage, as thou say, then I shalt too: I dare thee to a song duel, and whoever wineth shalt have the fate of these poor people in his hands, and whoever faileth will retire forever, humiliated.\" ",
        "created_utc": 1670861141,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this grammatically correct or is it a poetic licence?",
        "author": "Zerras_Ren",
        "url": "https://www.reddit.com/r/grammar/comments/zk2zef/is_this_grammatically_correct_or_is_it_a_poetic/",
        "text": "Is the phrase \"thinking of that which we cannot see\" a grammatically correct phrase or is it a poetic licence? \nI had an argument over this with a close friend of mine and we wanted to see if someone more knowledgeable than us knew the answer. Thanks in advance.",
        "created_utc": 1670860842,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using “with” twice",
        "author": "wouldratherdaydream",
        "url": "https://www.reddit.com/r/grammar/comments/zjyper/using_with_twice/",
        "text": "I came across a sentence that had the phrase, “with chapters with titles”. I don’t think that’s acceptable grammar. Is it?",
        "created_utc": 1670850651,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the word provement that means proof really exist?",
        "author": "waveflos",
        "url": "https://www.reddit.com/r/grammar/comments/zjyd01/does_the_word_provement_that_means_proof_really/",
        "text": "But I can’t find it in any dictionaries😳",
        "created_utc": 1670849883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this sentence correct?",
        "author": "StillPickingUsername",
        "url": "https://www.reddit.com/r/grammar/comments/zjxavy/is_this_sentence_correct/",
        "text": "With one touch, the talisman cursed the king. *But he could be saved by marrying a woman possessing the sacred figurine, rumored to be reclusive and unkind.*\n\nMy concern is about the sentence in italics. It seems like the last part after the comma (rumored to be reclusive and unkind) describes the sacred figurine while it should describe a woman. Is the sentence correct?",
        "created_utc": 1670847108,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this sentence correct?",
        "author": "Somethinghells",
        "url": "https://www.reddit.com/r/grammar/comments/zjvddu/is_this_sentence_correct/",
        "text": "\"It's a 3 times more expensive purchase.\"\n\nSomehow I want to put the article right before \"purchase\".",
        "created_utc": 1670841765,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the differences between \"ranked war/kill\" and \"ranked warring/killing\"? and what is their sentence structure?",
        "author": "Huy3nEnhUnicorn",
        "url": "https://www.reddit.com/r/grammar/comments/zjvci8/what_are_the_differences_between_ranked_warkill/",
        "text": "",
        "created_utc": 1670841689,
        "upvote_ratio": 1.0
    },
    {
        "title": "For English teachers to point out to students: comparison between 1500s English and 21 century vernacular for emotional power",
        "author": "qiling",
        "url": "https://www.reddit.com/r/grammar/comments/zju5kp/for_english_teachers_to_point_out_to_students/",
        "text": "For English teachers to point out to students: comparison between 1500s English and 21 century vernacular for emotional power\n\nMagister colin leslie dean the only modern Renaissance man with 9 degrees including 4 masters: B,Sc, BA, B.Litt(Hons), MA, B.Litt(Hons), MA, MA (Psychoanalytic studies), Master of Psychoanalytic studies, Grad Cert (Literary studies)\n\nstates\n\ncomparing Shakespeares sonnets to a 21 century vernacular poet we see that\n\nShakespeare is Apollonian ordered cold formalistic lacking in any emotion all in the head\n\nwhereas the 21 century vernacular poet is Dionysian unstructered chaotic non-formal full of fire and emotion all in the soul\n\nwhere 1500s English strangles the emotion puts it in a verbal formalist straitjacket and castrates it by verbal cleverness and tooo much thought\n\nthe 21 century vernacular poet frees the emotions lets them fly on the wings of rhythm on the spontaneity emotion pure emotion with no cleaver verbiage free of thought\n\nwhat do you think of this competition\n\nhttp://gamahucherpress.yellowgum.com/wp-content/uploads/Competition.pdf\n\nor\n\nhttps://www.scribd.com/document/187929154/Dean-Shakespeare-contest-erotic-poetry",
        "created_utc": 1670838197,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is football's \"Mr. Irrelevant\" a postpositive adjective?",
        "author": "thegeorgianwelshman",
        "url": "https://www.reddit.com/r/grammar/comments/zjtu59/is_footballs_mr_irrelevant_a_postpositive/",
        "text": "I'm watching the highlights from the 'Niners-Bucs game and it occurred to me that both QBs were drafted last in their year:\n\nEach is a \"Mr. Irrelevant.\"\n\nThen I started wondering how a headline about the match-up would read:\n\n\"Battle of Misters Irrelevant\" or \"Battle of Mister Irrelevants\"?\n\nWhich would be correct?",
        "created_utc": 1670837338,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a rule against consecutive uses of the colon?",
        "author": "Mevidia",
        "url": "https://www.reddit.com/r/grammar/comments/zjstys/is_there_a_rule_against_consecutive_uses_of_the/",
        "text": "Is there any rule that forbids the use of multiple colons withing the same sentence?\n\nExample: an independent clause introduces a list of items by means of a colon, and the last of those items is further illustrated following a second colon.",
        "created_utc": 1670834476,
        "upvote_ratio": 1.0
    },
    {
        "title": "Changing part of a word to make a joke or value statement is called:",
        "author": "Thunderbolt61911",
        "url": "https://www.reddit.com/r/grammar/comments/zjo5lx/changing_part_of_a_word_to_make_a_joke_or_value/",
        "text": "I’ve tried to define this practice without success.\n\nExample: “Stealership” instead of dealership\nMeaning: Dealership, as in car dealership, with the added meaning that car dealerships are rip offs and steal your money.\n\nIE: https://youtu.be/meHYBhcpdvQ\n\nThe adjusted word usually rhymes with the original word, I think.  It’s slang, of course, but this particular behavior I find very annoying and I’d like to know what it’s called.  I seem to recall Trump and company engaging in this practice?",
        "created_utc": 1670822112,
        "upvote_ratio": 1.0
    },
    {
        "title": "With regards to ordering soup and indefinite articles",
        "author": "Background_Ear_3327",
        "url": "https://www.reddit.com/r/grammar/comments/zjlizv/with_regards_to_ordering_soup_and_indefinite/",
        "text": "Before anything, I would like to say that I have read the FAQ on a/the, but my questions remains unanaswered.  \n\n\nI came across this sentence \"I would like corn soup, a salad, and a steak\"  \nI don't know why there isn't an 'a' in front of corn soup. It seems natural to say the sentence as it's written. Would it be correct to say \"A corn soup\", or should it be left as is?  \n\n\nThank you for reading. I hope someone can explain this to me.",
        "created_utc": 1670815885,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lord of the Rings: \"None of us should wander alone, you least of all.\" Did Boromir misspeak? Shouldn't it be \"most of all\"?",
        "author": "tnitty",
        "url": "https://www.reddit.com/r/grammar/comments/zji985/lord_of_the_rings_none_of_us_should_wander_alone/",
        "text": "Full question in the title. Not sure if this is a grammar or logic question, but when I hear this line in the movie, it seems like Boromir spoke incorrectly.\n\nThanks",
        "created_utc": 1670808852,
        "upvote_ratio": 1.0
    },
    {
        "title": "zero kilometer food",
        "author": "Proud_Ad_1473",
        "url": "https://www.reddit.com/r/grammar/comments/zjh3q1/zero_kilometer_food/",
        "text": "Hello, fellow grammarians!\nI am not quite sure how to use 'zero kilometer produce /food' in a sentence. I'm trying to say that 'most of the ingredients we use in this restaurant are zero kilometer' . Would that be correct?.\nI'd rather say that 'we are environmentally friendly and our ingredients are locally sourced/produced', but the zero kilometer needs to be used.\nThanks for your help.",
        "created_utc": 1670806444,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this sentence reporte speech?",
        "author": "ontheroad337",
        "url": "https://www.reddit.com/r/grammar/comments/zjgj3j/is_this_sentence_reporte_speech/",
        "text": "My mother told me I was beautiful",
        "created_utc": 1670805264,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the difference between \"either\" and \"or\"?",
        "author": "ontheroad337",
        "url": "https://www.reddit.com/r/grammar/comments/zjg2h5/whats_the_difference_between_either_and_or/",
        "text": "",
        "created_utc": 1670804364,
        "upvote_ratio": 1.0
    }
]