[
    {
        "title": "How to correctly use the word ‘plethora’",
        "author": "yuzarna",
        "url": "https://www.reddit.com/r/grammar/comments/zverog/how_to_correctly_use_the_word_plethora/",
        "text": "Is it ‘a plethora of…’ or simply ‘plethora of…’\n\nI think the latter but would like to check",
        "created_utc": 1672028141,
        "upvote_ratio": 1.0
    },
    {
        "title": "An elegant word to mean ‘bad imitation’",
        "author": "yuzarna",
        "url": "https://www.reddit.com/r/grammar/comments/zveqda/an_elegant_word_to_mean_bad_imitation/",
        "text": "A friend of mine recently described something meaning a ‘bad imitation’ of something else as a ‘facsimile.’\nObviously the word facsimile is completely wrong here, but it did make me wonder what more elegant word could be used instead of saying a ‘bad imitation.’\nI would propose ‘caricature’ as a starter. \n\nI would love to hear some of your thoughts.",
        "created_utc": 1672028008,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've been wondering whether this is correct enough to write",
        "author": "adrienrublev",
        "url": "https://www.reddit.com/r/grammar/comments/zvd6m1/ive_been_wondering_whether_this_is_correct_enough/",
        "text": "I wrote a poem. I included the line \"I do believe Ted Kaczynsky\" \n\nI wanted to ask if it's okay to write \"believe Ted Kaczynsky\". I know that you can say \"trust Ted Kazynsky\" but I don't think it fits well. I also usually hear \"believe in someone\".",
        "created_utc": 1672022621,
        "upvote_ratio": 1.0
    },
    {
        "title": "Isn't Nazi already plural?",
        "author": "iliketolickthebuttah",
        "url": "https://www.reddit.com/r/grammar/comments/zvbtoe/isnt_nazi_already_plural/",
        "text": "Growing up, i was told that Nazi is already plural like Deer. \n\nYou dont need to add an S and adding an s is a mistake that came from Americanism \n\nAm I wrong? \n\nIs Nazis grammatically correct or wrong?",
        "created_utc": 1672018183,
        "upvote_ratio": 1.0
    },
    {
        "title": "Plural of “says” when the plural speakers are named.",
        "author": "DanyulD",
        "url": "https://www.reddit.com/r/grammar/comments/zvbist/plural_of_says_when_the_plural_speakers_are_named/",
        "text": "My partner and I received a welcome mat this Christmas with a graphic of our two cats and a caption that says “Welcome, says JoJo and Potato!”\n\nIt’s a minor detail but we’ve been discussing back and forth on whether “says” is the correct form of the word. Should it not be say, as in “They say” or does the reversal of verb and pronoun change it. Does the fact that the plural speakers are named change anything. Help is very appreciated",
        "created_utc": 1672017206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this sentence correct?",
        "author": "DiscvinE",
        "url": "https://www.reddit.com/r/grammar/comments/zvayhg/is_this_sentence_correct/",
        "text": "Hii! I'm talking about a school play we (with some classmates) made and how it was too short and there were a lot of informations that we couldn't tell because we didn't have enough time\n'there was way more to unpack'",
        "created_utc": 1672015417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Settle This Debate: Old VS Older",
        "author": "TheGreenShyguy",
        "url": "https://www.reddit.com/r/grammar/comments/zva3e7/settle_this_debate_old_vs_older/",
        "text": "So I and my buddy are having a debate, we want to know who is factually right. That said, if you have the answer, please have some kind of evidence it's a fact, so that way there'll be no room for debate.\n\nNow here's the topic:\nOld and older are the same word, but to describe someone or something as older, you NEED to say \"older\".\n\nMy argument is that you can say \"I'm 30, and that guy is 40, he's old.\" this is just a longer way of saying \"older\" as long as it is made clear within that sentence it's comparing. \n\nMy friend is saying that's wrong and that the way I used it is incorrect completely-- the only way to say one is older is by saying \"You can't say I'm 18, and that guy's 30, he is old, and that be the comparison.\"\n\nThanks and Merry Christmas!",
        "created_utc": 1672012687,
        "upvote_ratio": 1.0
    },
    {
        "title": "How should quotation marks go",
        "author": "beanstastebad",
        "url": "https://www.reddit.com/r/grammar/comments/zv9424/how_should_quotation_marks_go/",
        "text": "Like I always thought it was “like this” but now I see people doing it „like this” so idk. Basic question but I’m confused now",
        "created_utc": 1672009606,
        "upvote_ratio": 0.99
    },
    {
        "title": "What would the plural form of a name consisting of two nouns be? For example, would it be \"Elf on the shelves\", or \"Elves on the shelves\"?",
        "author": "Ink_Demon_IRL",
        "url": "https://www.reddit.com/r/grammar/comments/zv8kz1/what_would_the_plural_form_of_a_name_consisting/",
        "text": "",
        "created_utc": 1672008016,
        "upvote_ratio": 1.0
    },
    {
        "title": "Punctuation for Proceeding Dialogue Tags",
        "author": "AffectionateTune6820",
        "url": "https://www.reddit.com/r/grammar/comments/zv7a8c/punctuation_for_proceeding_dialogue_tags/",
        "text": "Hello Reddit! I have a question that I am *sure* someone, at some point, must have asked before, and yet the answer continues to evade me nonetheless. It is, as the title says, about using punctuation before dialogue tags. \n\nSo my understanding is that when a **pre**ceding dialogue tag is used, you either (a) place a comma if it's being spoken or (b) place a period if it's an action.\n\nEx.\n\nShe said**,** \"You can't equate the two.\" ⇢ spoken tag\n\nShe shook her head**.** \"You can't equate the two.\" ⇢ action tag\n\nThe problem is that I don't know if these same rules apply to **pro**ceeding dialogue tags. I was under the impression that you *always* use a comma *unless* you're choosing to end the sentence itself (in which case there wouldn't be a dialogue tag afterwards anyway). \n\nEx.\n\n\"You can't equate the two**,**\" she said. ⇢ spoken tag\n\n\"You can't equate the two**,**\" she shook her head. ⇢ action tag\\*\n\nBut the more I look at the asterisked example, the more... wrong it looks to me? I dunno. I feel like it should follow the same rules as preceding dialogue tags do, but I'm not sure.",
        "created_utc": 1672004159,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Arabic Grammar) How would it be written (and spoken) if the perfect tense verb حقّ was about هن?",
        "author": "sabr-bg",
        "url": "https://www.reddit.com/r/grammar/comments/zv5ivn/arabic_grammar_how_would_it_be_written_and_spoken/",
        "text": "",
        "created_utc": 1671998836,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone please fix it asap?",
        "author": "maalik_reluctant",
        "url": "https://www.reddit.com/r/grammar/comments/zv4ack/can_someone_please_fix_it_asap/",
        "text": "Hey everyone. \n\nI’ve written this sentence but I don’t think I’m able to communicate what I want. What I’m trying to say over here is that tone can be perceived in a different way to an outsider who is not accustomed to the environment and they can find it aggressive without the content of the person saying it. \n\n“if maybe the other gender's tone of language is a bit aggressive so the other gender and he/she interprets it in some other way and the reason for that is that the person may not be accustomed to a person who talks like that, and this is mainly an area where students struggle a lot.”",
        "created_utc": 1671995114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yo is there something wrong with sentence cause they been on my neck with this",
        "author": "Husket11",
        "url": "https://www.reddit.com/r/grammar/comments/zv36va/yo_is_there_something_wrong_with_sentence_cause/",
        "text": "\"Bro tried to fanego his way into getting cheeks\"",
        "created_utc": 1671991744,
        "upvote_ratio": 1.0
    },
    {
        "title": "how can we use (get used to) in present simple?",
        "author": "Southern-Blueberry85",
        "url": "https://www.reddit.com/r/grammar/comments/zv2x88/how_can_we_use_get_used_to_in_present_simple/",
        "text": "question: Ali didn't smoke in the past but he smokes these days. (rewrite the sentence using \"gets\".) \n\nI checked the answer sheet and it tells me that the answer is (Ali gets used to smoking)\n\nis it the correct answer? thanks btw",
        "created_utc": 1671990938,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would the phrase “it’s good and not good” be considered an oxymoron?",
        "author": "steaksauce94",
        "url": "https://www.reddit.com/r/grammar/comments/zula2w/would_the_phrase_its_good_and_not_good_be/",
        "text": "",
        "created_utc": 1671923649,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the actual rule for the pronunciation of homographs acting as different parts of speech?",
        "author": "Qfwfq_on_the_Shore52",
        "url": "https://www.reddit.com/r/grammar/comments/zujrbx/what_is_the_actual_rule_for_the_pronunciation_of/",
        "text": "For example, why is the noun \"rebel\" ponounced differently than the verb? And the verb \"learned\" pronounced differently than the adjective?",
        "created_utc": 1671918912,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone please fix it?",
        "author": "maalik_reluctant",
        "url": "https://www.reddit.com/r/grammar/comments/zuhp70/can_someone_please_fix_it/",
        "text": "Hey everyone. Im transcribing an interview and this is what I came up with which doesn’t sound professional. Would appreciate if someone could fix it.\n\n“To this, the response we got from the interviewee was that as a person living in the twenty-first century, he thinks it is a model duty to have harmony between the different genders.\nFurthermore, he added that the division of both sexes has completely transformed the world and the developing countries are probably struggling with it more. Talking about the system in which he works in he said that he personally thinks that the institution has a certain bias towards a specific gender.\nThis was followed by an example of how if he as a male teaches in an all-girls school where the system and the faculty and administration are dominated by women if there is a male there will be some sort of an uncomfortable environment being created for that male teacher or faculty member and also for the students as they will not be able to talk about certain issues as openly. As opening up to the same genders as your own is much easier than interacting with the other gender about certain issues.”",
        "created_utc": 1671912650,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about comma usage -- independent clause + dependent clause with implied subject",
        "author": "Karzov",
        "url": "https://www.reddit.com/r/grammar/comments/zugkf0/question_about_comma_usage_independent_clause/",
        "text": "Hi,\n\nI've come over a special case regarding commas and independent clauses fairly often when reading news, mostly The Guardian, and also while reading fiction:\n\n*Men were often depicted as being dominant and aggressive, and were expected to be leaders in their communities.* \n\nWhat is the rule for the comma separating the two clauses? The first one \\[men were often depicted as being dominant and aggressive\\] is an independent clause and can stand on its own. The second one \\[and were expected to be leaders in their communities\\] cannot, though the subject \"they\" is implied.\n\nMy take is that the comma increasees readability and avoids confusion, but wouldn't it be grammatically correct to write:\n\n*Men were often depicted as being dominant and aggressive, and* ***they*** *were expected to be leaders in their communities.*\n\nThe thing is, I've seen this so often I would say it is a broadly applied stylistic choice if not grammatically correct. Googling has offered no solutions to this one.\n\nYou got any thoughts on this?",
        "created_utc": 1671909259,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this \"that\" extraneous?",
        "author": "RusticBohemian",
        "url": "https://www.reddit.com/r/grammar/comments/zufosi/is_this_that_extraneous/",
        "text": "Michael thought XXX was perfectly acceptable, and **that** those who criticized him for doing so were hypocritical because they xxx. \n\nIs the word \"that\" extraneous in this sentence?",
        "created_utc": 1671906690,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is ''would have'' used for future perfect reported speech and not present perfect?",
        "author": "MarkClover",
        "url": "https://www.reddit.com/r/grammar/comments/zue46s/why_is_would_have_used_for_future_perfect/",
        "text": "The rule is to backshift one tense.  Why is would suddenly a tense?\n\n''I will have lived in Delhi.''\n\nShe said that she would have lived.\n\nShe said that she has lived in Delhi.",
        "created_utc": 1671902064,
        "upvote_ratio": 1.0
    },
    {
        "title": "what's the subject in this sentence (There are many good reasons for our policy)?",
        "author": "Specialist-Intern686",
        "url": "https://www.reddit.com/r/grammar/comments/zudqo9/whats_the_subject_in_this_sentence_there_are_many/",
        "text": "",
        "created_utc": 1671900971,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why isnt heavily decorated hypenated?",
        "author": "quietdog1",
        "url": "https://www.reddit.com/r/grammar/comments/zuafg0/why_isnt_heavily_decorated_hypenated/",
        "text": "",
        "created_utc": 1671890539,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why use prepositions in cases where we don't have to?",
        "author": "STEIN197",
        "url": "https://www.reddit.com/r/grammar/comments/zu6wct/why_use_prepositions_in_cases_where_we_dont_have/",
        "text": "For example \"pull out\". Why do we need \"out\" when \"pull\" already means to take something out? Another example - \"lift something up\". Why use \"up\" when \"lift\" alread means to take something upwards? And there are plenty of phrasal verbs that use verb and preposition with the same meaning. What's the difference between \"pull\" and \"pull out\", \"lift\" and \"lift up\" (and I'm not wondering about exactly these cases, I'm in general)?",
        "created_utc": 1671876312,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this sentence correct?",
        "author": "Finance_Plus",
        "url": "https://www.reddit.com/r/grammar/comments/zu6m0u/is_this_sentence_correct/",
        "text": "\"How many countries is Russin the official language of?\"\nIt doesn't bother me if it sounds unnatural, I just want to settle a debate whether its correct.",
        "created_utc": 1671875063,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any reason to use 'being that' instead of concise words like since or because?",
        "author": "Briacle",
        "url": "https://www.reddit.com/r/grammar/comments/zu2vjl/any_reason_to_use_being_that_instead_of_concise/",
        "text": "\"Being that\" is a phrase that has always annoyed me because it takes two words, and I can't figure out what it conveys that you couldn't just get across by saying \"since\" or \"because.\" For that reason, using \"being that\" is always incorrect as far as I'm concerned, just like how you should never use \"on account of\" either. But is there anything I'm missing, and there's actually a reason or situation to use the wordy variant?",
        "created_utc": 1671860326,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does \"came together\" mean?",
        "author": "EngLearnerAibek",
        "url": "https://www.reddit.com/r/grammar/comments/zu2s6z/what_does_came_together_mean/",
        "text": "How his improbable visit **came together**\n\nExamples that I also don't understand:\n\n1. You gotta be in it for the long haul if you ever want to see it come together.\n2. But it all came together in 2017.\n3. Everything came together tonight.\n4. \"We wish we could have worked it out, but it just didn't come together for us.",
        "created_utc": 1671859978,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you diagram this sentence for me?",
        "author": "Dutch-Shops",
        "url": "https://www.reddit.com/r/grammar/comments/zu0zkq/can_you_diagram_this_sentence_for_me/",
        "text": "“Hector thought he could impress his boss by staying late at the office”\n\nI’m trying to figure out how many clauses there are.",
        "created_utc": 1671853838,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grammar Check Help",
        "author": "ZhhTeo",
        "url": "https://www.reddit.com/r/grammar/comments/ztyfij/grammar_check_help/",
        "text": "Hi there, I have a friend graduating soon and I hope to write him an appreciation note, but I am concerned that my English isn't good enough and I don't want to embarrass myself by giving him a note full of errors. Can anyone help me out by proof-reading my notes (below) ? Thank you in advanced!\n\n‘Leave no man behind', a defining moment when you first said that. The moment that I knew you are the kind worth chumming up with, and I am glad we did, not just friends but bosom pals.\n\nAcademically, we're inseparable partners, conquered through ups and downs, dealing with all sorts of weird/challenging assignments/lecture(r)s. I couldn't have made it this far without you. You're a great partner and an even greater friend. For that, I am grateful.\n\nSocially and emotionally, you were always there to back me up whenever I got in trouble, providing the necessary support when I most needed it. I cherish all the memories that we've shared, from the overnight party, to every short/long trip that we've travelled. I am gonna miss all of them dearly.\n\nA true friend is the greatest of all blessings. You have a heart of gold, may you remain faithful and truthful as you always have been.\n\nThank you for being an invaluable friend and partner all along. You have brightened my days and made my campus life even more fulfilling. It's been an honour. \n\nA toast to the past and cheers to the future. \n\nGod bless.",
        "created_utc": 1671845737,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your favorite thesaurus resource?",
        "author": "randopop21",
        "url": "https://www.reddit.com/r/grammar/comments/zty99z/whats_your_favorite_thesaurus_resource/",
        "text": "I default to the obvious one but can't help but think there is something better.",
        "created_utc": 1671845206,
        "upvote_ratio": 1.0
    },
    {
        "title": "TIPS. To Insure Prompt Service. But this acronym can't work, right? You aren't \"insuring\" prompt service. You're \"ensuring\" prompt service. But we cannot jam the acronym through as TEPS. Side note: I know it isn't actually an acronym. But was whoever came up with the acronym grammatically correct?",
        "author": "ultranothing",
        "url": "https://www.reddit.com/r/grammar/comments/ztwdzs/tips_to_insure_prompt_service_but_this_acronym/",
        "text": "",
        "created_utc": 1671839714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why no \"a\" article before \"code\"?",
        "author": "xLNBx",
        "url": "https://www.reddit.com/r/grammar/comments/ztufyz/why_no_a_article_before_code/",
        "text": "Why is it \"[Infrastructure as Code](https://en.wikipedia.org/wiki/Infrastructure_as_code)\" if we have \"[Software as a Service](https://en.wikipedia.org/wiki/Software_as_a_service)\"?\n\nIs it because code is uncountable?\n\nOr something to do with code being both singular and plural? (Can be plural codes, too, in some cases)",
        "created_utc": 1671834318,
        "upvote_ratio": 1.0
    },
    {
        "title": "question",
        "author": "anonybecz",
        "url": "https://www.reddit.com/r/grammar/comments/ztprpn/question/",
        "text": "Is it “to of been” or “to have been”?",
        "created_utc": 1671821983,
        "upvote_ratio": 1.0
    },
    {
        "title": "How important is the order of words for deciding the subject of the sentence?",
        "author": "Dietoli",
        "url": "https://www.reddit.com/r/grammar/comments/ztmzhn/how_important_is_the_order_of_words_for_deciding/",
        "text": "For the sentence - To be a doctor is my dream.\n\n\"To be a doctor\" is the subject.\n\nWhereas, for the sentence\n\n\"My dream is to be a doctor\"\n\nThe subject is \"my dream\".\n\nSo, does the earlier occurrence of words play a crucial role for deciding the subject?\n\nOr is it possible to have a subject that is occurring late?",
        "created_utc": 1671816004,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which of these 2 versions of the fairy tale can be read to learn a spoken language?",
        "author": "EngLearnerAibek",
        "url": "https://www.reddit.com/r/grammar/comments/ztmcbx/which_of_these_2_versions_of_the_fairy_tale_can/",
        "text": "Version 1: [https://www.storyberries.com/fairy-tales-hansel-and-gretel-by-hamilton-wright-mabie/](https://www.storyberries.com/fairy-tales-hansel-and-gretel-by-hamilton-wright-mabie/)\n\nVersion 2:[https://www.grimmstories.com/en/grimm\\_fairy-tales/hansel\\_and\\_gretel](https://www.grimmstories.com/en/grimm_fairy-tales/hansel_and_gretel)",
        "created_utc": 1671814719,
        "upvote_ratio": 1.0
    },
    {
        "title": "The word “the” and use before car makes, ship names, and models in general.",
        "author": "Lanky_Consequence_43",
        "url": "https://www.reddit.com/r/grammar/comments/ztjui3/the_word_the_and_use_before_car_makes_ship_names/",
        "text": "[removed]",
        "created_utc": 1671810221,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help with a sentence",
        "author": "Apprehensive_Pear757",
        "url": "https://www.reddit.com/r/grammar/comments/ztf37r/need_help_with_a_sentence/",
        "text": "In search of fulfillment we settled where it’s most empty… is this sentence correct?",
        "created_utc": 1671801716,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whoever vs Whomever",
        "author": "PM_ME_COOL_POTATOES",
        "url": "https://www.reddit.com/r/grammar/comments/zt9n7v/whoever_vs_whomever/",
        "text": "“This effect does not extend to whomever is in possession of the item.” \n\nI’m not sure whether or not to use whoever or whomever here. I understand that if you can replace it with “he” then “who” is the correct word, and “him” results in “whom”. However, the first half of the sentence makes sense with him. “This effect does not extend to him.” The second half makes sense with he. “He is in possession of the item.” Which should I use?",
        "created_utc": 1671781759,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grammarly as a crutch",
        "author": "MitchMcConnellsStash",
        "url": "https://www.reddit.com/r/grammar/comments/zt947h/grammarly_as_a_crutch/",
        "text": "Native English speaker. I'm considering subscribing to Grammarly premium to get the tone suggestions. Is anyone else concerned that having a device owned by a corporation edit your language might give rise to anything weird down the line?",
        "created_utc": 1671779614,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need Your Help With The Title",
        "author": "akarev",
        "url": "https://www.reddit.com/r/grammar/comments/zt7e9n/need_your_help_with_the_title/",
        "text": "Hi there! English isn't my first language and I just wanted to check whether I wrote my blog post title correctly:\n\n* Do You Need a Graphic Tablet for Product Photography Retouching?\n\nor do I need to write \"Graphics Tablet\" ?  \n\n\nThanks.",
        "created_utc": 1671773325,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does \"swollen with rain\" mean?",
        "author": "EngLearnerAibek",
        "url": "https://www.reddit.com/r/grammar/comments/zt79aj/what_does_swollen_with_rain_mean/",
        "text": "The terror, which would not end for another twenty-eight years—if it ever did end—began, so far as I know or can tell, with a boat made from a sheet of newspaper floating down a gutter **swollen with rain**.\n\nContext: It. Chapter 1. AFTER THE FLOOD (1957) (Stephen King)",
        "created_utc": 1671772828,
        "upvote_ratio": 1.0
    },
    {
        "title": "S in Skin always capital?",
        "author": "CardiologistNo6209",
        "url": "https://www.reddit.com/r/grammar/comments/zt78yc/s_in_skin_always_capital/",
        "text": "“You have got the most beautiful skin.”\n\nS here in skin should be capitalised?",
        "created_utc": 1671772799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Character dialogue that refers to a specific noun",
        "author": "Antiquier",
        "url": "https://www.reddit.com/r/grammar/comments/zt55nb/character_dialogue_that_refers_to_a_specific_noun/",
        "text": "Sorry, I couldn’t figure out how to phrase my question concisely enough for the title. Here’s my issue:\n\nJames said, “I call this next song the Devil’s Teapot.”\n\nShould the Devil’s Teapot be italicised or have single quotes? Should “the” be capitalised?\n\nSame sort of question with this example:\n\nJames said, “My favourite word is teapot.”\n\nDoes teapot need to be italicised or have quotes around it?",
        "created_utc": 1671765864,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which one looks/sounds better",
        "author": "Sense_Hairy",
        "url": "https://www.reddit.com/r/grammar/comments/zt1zvn/which_one_lookssounds_better/",
        "text": "“Look at that! The trifecta of clumsiness,” I say, hinting that I’m on my last straw; so I don’t misdirect my anger. \n\n“Look at that!” I say, hinting that I’m on my last straw so; they don't make me misdirect my anger, “The trifecta of clumsiness!”",
        "created_utc": 1671756125,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you capitalize \"home\" if it is used like \"Earth\"?",
        "author": "OhWowOkayy",
        "url": "https://www.reddit.com/r/grammar/comments/zt11hg/can_you_capitalize_home_if_it_is_used_like_earth/",
        "text": "",
        "created_utc": 1671753456,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are Inadequate and Imperfect synonyms?",
        "author": "kingofconnecticut",
        "url": "https://www.reddit.com/r/grammar/comments/zt08cf/are_inadequate_and_imperfect_synonyms/",
        "text": "If not, in your view, how are these words different?\n\n&amp;#x200B;\n\nThanks",
        "created_utc": 1671751511,
        "upvote_ratio": 1.0
    },
    {
        "title": "Darkness's grave, Darkness' grave, or darkness grave?",
        "author": "eelittna",
        "url": "https://www.reddit.com/r/grammar/comments/zsyvel/darknesss_grave_darkness_grave_or_darkness_grave/",
        "text": "I'm leaning towards Darkness' because the word has an s at the end.\n\nThis might mean the grave of darkness but regardless of meaning which ones are grammatically correct?",
        "created_utc": 1671748266,
        "upvote_ratio": 1.0
    },
    {
        "title": "Become sillier vs. become even sillier",
        "author": "BiggusVickus",
        "url": "https://www.reddit.com/r/grammar/comments/zsx1tf/become_sillier_vs_become_even_sillier/",
        "text": "Last year I made a sign for my brother for his birthday. It said \"A silly goose lives here. Don't give him any Trix, they are for kids. He's extremely silly, I swear!\" \n\nThis year for Christmas I want to make a second sign, but I'm running out of space. I want to say \"Don't give the silly goose lemonade. He'll become even sillier from the sugar rush!\". \n\nI am a tiny big short on space, and was wondering if I can get rid of the word \"even\" to save space and still make sense. \n\nI think that it makes grammatical sense, but the \"even\" emphasizes the increase in silliness. \n\nThanks",
        "created_utc": 1671743694,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a name or nickname for multiple compound words?",
        "author": "savehonor",
        "url": "https://www.reddit.com/r/grammar/comments/zsv4dm/is_there_a_name_or_nickname_for_multiple_compound/",
        "text": "So, the other day I went outside and I saw my kids prints in the snow. He wasn't wearing shoes. When I had talked to him I said \"I saw your **barefootprints** in the snow\". And I realized, that I wasn't sure if my brain-&gt;mouth had said **bare footprints** or **barefoot prints**. And it got me thinking; is there a known term for multiple compound words (that work/make sense) like this? If not, what do you think would be a fun or playful description? Double compound? Compound chain? Multicompound? Obviously, I'm referring to English. This would be absolute moot point in German.\n\nFor fun; any other examples that you can think of?",
        "created_utc": 1671738727,
        "upvote_ratio": 1.0
    },
    {
        "title": "Once and for all and please only people who are 100 percent sure. Do we use the present perfect for recent actions or only for recent actions with present relevance? This has been confusing me for a while now so I want to know which one is right. (I need help for my Exam tomorrow)",
        "author": "BimboDollMaker247",
        "url": "https://www.reddit.com/r/grammar/comments/zstztc/once_and_for_all_and_please_only_people_who_are/",
        "text": "For example in a majority of video games the announcer voice uses the perfect a lot, or news speakers, or when we talk about recent events like the world cup for example \"An ally has been slain\" for the video game, \"He has been elected president\" for news and \"They have won the world cup\". Do we actually use present perfect here because all those actions are recent or because they are relevant for the present? This does confuse me quite a bit because I am unsure about one thing. Do we only use present perfect with recent actions because they are more likely to be important for the present moment or does recency itself require present perfect if no time like \"5 minutes ago\" for example is given? So does present perfect itself carry a sense of recency for you native speakers? If I told you \"They have won the world cup\" would this automatically be more recent for you than \"They won the World Cup\" simply because my choice of tense? I would greatly appreciate any advice here since I need to know this before I head into my last exam before Christmas. Enjoy your holidays everyone, whatever you might celebrate and thanks in Advance : )",
        "created_utc": 1671735846,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"James, as he introduced himself, and I began to play catch.\" How can I rephrase that for clarity?",
        "author": "TimesNewIndian",
        "url": "https://www.reddit.com/r/grammar/comments/zstxjr/james_as_he_introduced_himself_and_i_began_to/",
        "text": "There is a strict upper word limit so fewer words are better. Adding a non-essential modifier after \"James\" seems odd and unconventional. Thanks in advance.",
        "created_utc": 1671735684,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"... I will contact you to discuss same.\"",
        "author": "Linked1nPark",
        "url": "https://www.reddit.com/r/grammar/comments/zsrwhz/i_will_contact_you_to_discuss_same/",
        "text": "I've recently been talking to some lawyers, and I read the following sentence in a letter they sent me (emphasis my own): \n\n&gt; \"In some real estate transactions, there may be unforeseen issues and/or difficulties that arise as a result of matters beyond my control, if this occurs, I will contact you to discuss same.\"\n\nI thought the use of \"same\" here was a typography error and asked about it. The lawyer responded with this explanation:\n\n&gt; \"Oftentime in legal practice, the word 'same' is used to refer to the aforementioned subject. In this case, we will be contacting you to discuss any unforseen issues and/or difficulties that may arise throughout the process.\"\n\nI understand the explanation, but the use of \"same\" in this context still feels really clunky and out of place. It's being used a sort of noun, which feels really weird. Wondering if anyone here has thoughts or insight into this usage.",
        "created_utc": 1671730672,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clearer vs. More clear",
        "author": "recklessvisionary",
        "url": "https://www.reddit.com/r/grammar/comments/zsrnks/clearer_vs_more_clear/",
        "text": "In this article is read today I saw a usage or “clearer.”  I would have said “more clear.”  What’s the consensus?\n\n“Yet as Zelensky departed Washington for a lengthy and similarly risky return trip to Ukraine, it wasn't clear that a pathway to ending the conflict was any clearer.”\n\nhttps://www.cnn.com/2022/12/21/politics/takeaways-volodymyr-zelensky-visit-to-washington/index.html",
        "created_utc": 1671730091,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using quarrel with combot",
        "author": "anathamatha",
        "url": "https://www.reddit.com/r/grammar/comments/zsqsdg/using_quarrel_with_combot/",
        "text": "We were playing a game which involves short and long range fighting. I had said \"I have no quarrel with short range combat\". Mostly trying to say lets fight in close range. Am I right for using this sentence correctly?",
        "created_utc": 1671728044,
        "upvote_ratio": 1.0
    },
    {
        "title": "Possessive Initials help? ex. Joe K's. hat vs Joe K.'s hat?",
        "author": "firehawk9001",
        "url": "https://www.reddit.com/r/grammar/comments/zsolai/possessive_initials_help_ex_joe_ks_hat_vs_joe_ks/",
        "text": "",
        "created_utc": 1671722661,
        "upvote_ratio": 1.0
    },
    {
        "title": "Excessive use of possessive pronouns",
        "author": "SpencerKibosh",
        "url": "https://www.reddit.com/r/grammar/comments/zsnw8v/excessive_use_of_possessive_pronouns/",
        "text": "What's the deal with the unnatural stuffing of possessive pronouns? I mean, is it really important to always emphasize that something belongs to someone?\n\nHere are a few examples:\n\"I've just had MY coffee\". \"I was YOUR typical kid\". \"I'm having MY breakfast\".\n\nWouldn't a simple definite or an indefinite article suffice?\n\nEnglish is not my native language, but it seems to me that this is a growing trend. And a pretty comical one.",
        "created_utc": 1671720824,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does \"had little to bite and to break\" mean?",
        "author": "EngLearnerAibek",
        "url": "https://www.reddit.com/r/grammar/comments/zskaiq/what_does_had_little_to_bite_and_to_break_mean/",
        "text": "He had little to bite and to break, and once when great dearth fell on the land, he could no longer procure even daily bread.\n\nContext: [https://www.worldoftales.com/fairy\\_tales/Brothers\\_Grimm/Margaret\\_Hunt/Hansel\\_and\\_Grethel.html#menu2&amp;gsc.tab=0](https://www.worldoftales.com/fairy_tales/Brothers_Grimm/Margaret_Hunt/Hansel_and_Grethel.html#menu2&amp;gsc.tab=0)",
        "created_utc": 1671709788,
        "upvote_ratio": 1.0
    },
    {
        "title": "Instead of Calling Something a Tall Order; Saying it's Like Treating Sepsis?",
        "author": "2cubes",
        "url": "https://www.reddit.com/r/grammar/comments/zsjs4v/instead_of_calling_something_a_tall_order_saying/",
        "text": "\"Blah blah blah is like trying to treat sepsis.\" meaning it is a B\\*\\*ch.\n\n   I looked all over the internet and reddit for anything reacting to the phrase. Here is a different example just in case I confused anyone or pissed them off rather than getting help by accident.\n\n   Ex: Fred likes his new propane grill. It is the first grill Fred has ever owned. At the barbeque John asks Fred to grill what John brought from home on Fred's new propane grill. John brought a full turkey that is still frozen. Fred agrees by saying this to John.\n\n   \"Thank you for coming, John. Preparing a full turkey that is still frozen on my new propane grill for you would be my pleasure. It will be easy to start the grill because reading the owner's manual eliminated any would-be time wasted but it will be *like trying to treat sepsis* cooking it evenly all the way through. Let's go together right now and turn it on for the first time, my friend.\"\n\n&amp;#x200B;\n\nI can't be the only one who actually thinks talking about sepsis is normal.",
        "created_utc": 1671708001,
        "upvote_ratio": 1.0
    },
    {
        "title": "KING OR THE KING?",
        "author": "Salty-Percentage8202",
        "url": "https://www.reddit.com/r/grammar/comments/zsj9rd/king_or_the_king/",
        "text": "In the sentence: \n\nSimba was the young lion who was to become KING. \n\n\nIs it the correct use? Should it be used with \"The\"?\n\nSimba was the young lion who was to become THE KING. \n\nAre there any meaning differences?",
        "created_utc": 1671706250,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bring or brings?",
        "author": "greenacregal",
        "url": "https://www.reddit.com/r/grammar/comments/zsilr3/bring_or_brings/",
        "text": "Hi all! I’m currently editing a doc for work and my brain isn’t working!\n\nWould you say:\n- our team bring a sense of fun\n- our team brings a sense of fun \n\nThank you!",
        "created_utc": 1671703899,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there an adverb form of adjectives that end with -ly (e.g. 'friendly')?",
        "author": "Briacle",
        "url": "https://www.reddit.com/r/grammar/comments/zsf1ob/is_there_an_adverb_form_of_adjectives_that_end/",
        "text": "For example, you couldn't say \"he talked to me friendlily\" or \"she sang lovelily.\" Those words simply don't exist in English, so do adjectives ending in -ly simply not have any adverb forms? If, for some reason, you have to use these adjectives as adverbs, would you have to say something like \"he talked to me in a friendly way/manner\" or \"she sang in a lovely way/manner\"?",
        "created_utc": 1671691834,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the SVO in: ''The drill sergeant makes the soldiers do push ups.''",
        "author": "MarkClover",
        "url": "https://www.reddit.com/r/grammar/comments/zsezu0/what_is_the_svo_in_the_drill_sergeant_makes_the/",
        "text": "",
        "created_utc": 1671691677,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to interrupt a half written word?",
        "author": "johnrose12345",
        "url": "https://www.reddit.com/r/grammar/comments/zschhi/how_to_interrupt_a_half_written_word/",
        "text": "For example, \"She's a bitc— I mean witch!\"\n\nOr\n\n\"She's a bitc— witch!\"\n\nI don't know how to format this type of interruption. How do I interrupt the word as if I was saying something naughty, but I played it off by saying a different word?",
        "created_utc": 1671684314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it okay to use two different types of present?",
        "author": "BaldTango",
        "url": "https://www.reddit.com/r/grammar/comments/zsb9n4/is_it_okay_to_use_two_different_types_of_present/",
        "text": "Say i have a paragraph written in present simple, for example. \"Bob continues to work on his car.\" and the next paragraph is written in present perfect, example. \"Bob smiled as he looked at his car with happiness.\" \n\n&amp;#x200B;\n\nIs that okay? should i use the same type of present? I'm not too educated in that area of grammar.",
        "created_utc": 1671680886,
        "upvote_ratio": 1.0
    },
    {
        "title": "is \"of\" necessary here or should be omitted? Example: Celebrating our 15th year of contributing to the cultural landscape....",
        "author": "MondsMusic",
        "url": "https://www.reddit.com/r/grammar/comments/zsa2hn/is_of_necessary_here_or_should_be_omitted_example/",
        "text": "",
        "created_utc": 1671677658,
        "upvote_ratio": 1.0
    },
    {
        "title": "What stylistic treatment do we give to The Code of Hammurabi?",
        "author": "thegeorgianwelshman",
        "url": "https://www.reddit.com/r/grammar/comments/zsa0vk/what_stylistic_treatment_do_we_give_to_the_code/",
        "text": "My instinct is to place it in quotation marks, since it is a small work, but that doesn't feel right, somehow.\n\nIs it merely capitalized?",
        "created_utc": 1671677533,
        "upvote_ratio": 1.0
    },
    {
        "title": "Word usage help!",
        "author": "Sense_Hairy",
        "url": "https://www.reddit.com/r/grammar/comments/zs6kpm/word_usage_help/",
        "text": "So I was wondering if you could use the word: “folly” as a synonym for “façade”?\n\nExample: “I knew that decorum he showed earlier was a folly!” \n\nCould you use it like that?\n\nPs. (I know this post doesn't fit here, but r/writing makes you have 3 comment karma to even post)",
        "created_utc": 1671668700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I have the punctuation right?",
        "author": "daisyonmytoe",
        "url": "https://www.reddit.com/r/grammar/comments/zs4fsx/do_i_have_the_punctuation_right/",
        "text": "\"I saw Jack weeks before I met him, but on the day we met, my friend and I were sitting in the same row as his friends who had saved him a seat.\"\n\nThanks! I always feel like I use too many commas.",
        "created_utc": 1671663722,
        "upvote_ratio": 1.0
    },
    {
        "title": "'Employees who apply, but are not selected for a posted position may request, in writing, the reason they were not selected for the position.'",
        "author": "shiwankhan",
        "url": "https://www.reddit.com/r/grammar/comments/zs104v/employees_who_apply_but_are_not_selected_for_a/",
        "text": "Can anyone explain or critique this sentence and its use of commas?\n\nIs it a reasonable interpretation that 'the reason' be in writing, and not the 'request'? \n\nHow could it be made more clear? I'm from Ireland and I find this baffling.",
        "created_utc": 1671657033,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is north, south, east, west capitalized AFTER a highway number? Example - \"75 south\" or \"75 South\"?",
        "author": "CSwork1",
        "url": "https://www.reddit.com/r/grammar/comments/zs00r2/is_north_south_east_west_capitalized_after_a/",
        "text": "",
        "created_utc": 1671654834,
        "upvote_ratio": 1.0
    },
    {
        "title": "A guy earlier told me that \"I have killed him\" is totally wrong and he cant think of a scenario where he would use it. For him \"I killed him\" is the only logical option since you can only kill someone once and only one person can actually do it. (Continues below)",
        "author": "BimboDollMaker247",
        "url": "https://www.reddit.com/r/grammar/comments/zrzuee/a_guy_earlier_told_me_that_i_have_killed_him_is/",
        "text": "What do you think? Is this true? I feel like this is more a choice of style in a way. For example as we all know we use present perfect for recent actions with present relevance so lets say I am a head hunter and call my boss on the phone surely I could say both \"Boss I killed him, Target down\" or \"Boss I've killed him, Target down\" or can I not? Sure it is a past action but the information I am conveying here is obviously relevant for the present and the time of the killing itself does not matter so why does this guy (who is a teacher btw) claim I cannot use the perfect construction? Or lets say I have been watching two bears fight each other for hours (for whatever reason I am just making examples here xD) and one finally wins I as a non-native would say both \"Finally he has killed him\" and \"Finally he killed him\" work just fine here.",
        "created_utc": 1671654445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grammar check!?!",
        "author": "SnooCakes350",
        "url": "https://www.reddit.com/r/grammar/comments/zrynk5/grammar_check/",
        "text": "Is there anything grammatically incorrect about the phrase \"give thanks always\" ?",
        "created_utc": 1671651790,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't think of a good word to use in place of \"portraying\"? Can I say \"using a black bag to represent Mbappe\"?",
        "author": "Warm_Novel2522",
        "url": "https://www.reddit.com/r/grammar/comments/zrymhj/i_cant_think_of_a_good_word_to_use_in_place_of/",
        "text": "Person 1: Angry Argentina fans transferred their anger to a black bag that represented Mbappe.\n\nPerson 2: PORTRAYING Mbappe as a black bag strikes me as a very racist action, although it may not be so.",
        "created_utc": 1671651718,
        "upvote_ratio": 1.0
    },
    {
        "title": "Comma in place of a preposition?",
        "author": "flapper_mcflapsnack",
        "url": "https://www.reddit.com/r/grammar/comments/zrxntt/comma_in_place_of_a_preposition/",
        "text": "Is the sentence, “Imagine the psychological turmoil the executives must be facing, learning their mistake.” an improper use of a comma?\n\nIf it were changed to, “Imagine the turmoil they must be facing upon learning their mistake,” it would be a proper sentence, I believe. \n\nI’m wondering if that comma use in the first sentence is improper and, specifically, why it may be improper.",
        "created_utc": 1671649513,
        "upvote_ratio": 1.0
    },
    {
        "title": "“For myself by me”",
        "author": "heyits_emily",
        "url": "https://www.reddit.com/r/grammar/comments/zrvrdk/for_myself_by_me/",
        "text": "I am trying to say this project/collection of material is for me but is also being completed by me. What is the correct way to say that? I feel dumb even asking — thanks in advance!",
        "created_utc": 1671645443,
        "upvote_ratio": 1.0
    },
    {
        "title": "Comma needed before sitting? \"The pretty blond girl, sitting in my dental chair and awaiting my ministrations, had the perpetually pleading and wounded look that would have alerted any observing cult leader they had likely just found a new recruit.\"",
        "author": "Kid_Charlema9ne",
        "url": "https://www.reddit.com/r/grammar/comments/zrscrx/comma_needed_before_sitting_the_pretty_blond_girl/",
        "text": "I can't tell whether the participial phrase(?) that starts with sitting and is comma-ed off from rest of sentence is essential information and would be restrictive (is that correct term for an essential phrase? I know it's typically used for clauses). Are commas required there?  Also, is there an easy litmus test to determine if the phrase is essential?  I'm always having trouble with that. Please correct me if I'm using any wrong terms.  Thanks!",
        "created_utc": 1671638901,
        "upvote_ratio": 1.0
    },
    {
        "title": "For + pronoun + verb construction?",
        "author": "M1CHES",
        "url": "https://www.reddit.com/r/grammar/comments/zrovbp/for_pronoun_verb_construction/",
        "text": "Heyy, I have a question about this construction. Apparently it's a thing but I can't find anything about it  online since I don't even know how it's called.\n\nExample: *Send this one to journey elsewhere, for we have need of sterner stock.* \n\nIt comes from a video game Darkest Dungeon, which is famous for its formal style and fancy words.\n\nAs far as I understand, it means:\n\n*Send this one to journey elsewhere,* ***because we need*** *(a?)* *sterner stock.*\n\nCould someone direct me anywhere where I could get some more info on this? I'm soooo tempted to use it XD",
        "created_utc": 1671634073,
        "upvote_ratio": 1.0
    },
    {
        "title": "With regards to weather, why do we not say winding?",
        "author": "Stevepac9",
        "url": "https://www.reddit.com/r/grammar/comments/zrm5y9/with_regards_to_weather_why_do_we_not_say_winding/",
        "text": "Rain becomes raining  \nSnow becomes snowing  \nWhy does wind not become winding?",
        "created_utc": 1671629557,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does \"to\" mean in \"hormones to affect\"?",
        "author": "EngLearnerAibek",
        "url": "https://www.reddit.com/r/grammar/comments/zrgky4/what_does_to_mean_in_hormones_to_affect/",
        "text": "The endocrine system is composed of glands that produce hormones **to** affect changes in distant target organs.\n\nContext: [https://www.youtube.com/watch?v=Tn3c6wgNjB8](https://www.youtube.com/watch?v=Tn3c6wgNjB8)",
        "created_utc": 1671618687,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not physically possible or physically impossible?",
        "author": "bayrho",
        "url": "https://www.reddit.com/r/grammar/comments/zrf3rd/not_physically_possible_or_physically_impossible/",
        "text": "I think they’re both technically correct, but which one do you prefer?",
        "created_utc": 1671613217,
        "upvote_ratio": 1.0
    },
    {
        "title": "There were only one set of answers: the ones on that book",
        "author": "Freak-1",
        "url": "https://www.reddit.com/r/grammar/comments/zrbkeo/there_were_only_one_set_of_answers_the_ones_on/",
        "text": "Should I use a colon?",
        "created_utc": 1671601022,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you make it sound like a word is being dragged on?",
        "author": "Nice_Connection6465",
        "url": "https://www.reddit.com/r/grammar/comments/zr6rxz/how_do_you_make_it_sound_like_a_word_is_being/",
        "text": "I need a word to look like it's being dragged on. I cant use something like \\[thiiiiiiiiiiiiis\\] because it looks too silly. I thought using an ellipse may help but it just makes the mood feel like \\[this...\\]\n\nP.S The way I'm using this as if someone is calling your name",
        "created_utc": 1671587081,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this okay to use?",
        "author": "Nice_Connection6465",
        "url": "https://www.reddit.com/r/grammar/comments/zr5vzk/is_this_okay_to_use/",
        "text": "\"O-\" My voice sounded croaky so I cleared my throat, \"Okay.\"\n\nP.s My writing throughout the text has been quite a bit informal, but I was wondering if this overstepped the line.\n\nThank you!",
        "created_utc": 1671584720,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is \"champion\" plural in this context?",
        "author": "ancient_dino",
        "url": "https://www.reddit.com/r/grammar/comments/zr59ih/why_is_champion_plural_in_this_context/",
        "text": "On Wikipedia under [FIFA World Cup](https://en.wikipedia.org/wiki/FIFA_World_Cup), is writes:\n\n&gt; The reigning champions are [Argentina](https://en.wikipedia.org/wiki/Argentina_national_football_team), who won their third title at the [2022 tournament](https://en.wikipedia.org/wiki/2022_FIFA_World_Cup), in [Qatar](https://en.wikipedia.org/wiki/Qatar).  \n\nWhy is it \"reigning champions\" not \"reigning champion\"? Since \"reigning\" means \"currently holding a particular title,\" and Argentina isn't sharing the title with multiple countries, shouldn't there only be one champion?",
        "created_utc": 1671583392,
        "upvote_ratio": 1.0
    },
    {
        "title": "Upon which I will touch upon :/",
        "author": "q0mlm",
        "url": "https://www.reddit.com/r/grammar/comments/zr3l2j/upon_which_i_will_touch_upon/",
        "text": "Sentence example:\n\n&gt;\\[...\\] with several other Disorders, ***which I shall touch upon*** in the Sequel of this Discourse\n\n[Source](https://books.google.ie/books?id=kNrRjZ0cScoC&amp;pg=PA3&amp;lpg=PA3&amp;dq=%22which+*+touch+upon%22&amp;source=bl&amp;ots=y_GqAbVf74&amp;sig=ACfU3U3clfZl4jjnu1KKp6Geo3Bjp23AWQ&amp;hl=en&amp;sa=X&amp;ved=2ahUKEwi2-enrqYn8AhXUg1wKHdBfAXY4ChDoAXoECAgQAw#v=onepage&amp;q=%22which%20*%20touch%20upon%22&amp;f=false)\n\nI'd like to know if there is any way to rephrase this sentence using *upon which* at the beginning of the relative clause, for example: \n\n&gt;\\[...\\] with several other Disorders, ***upon which I shall touch*** \\[***u******pon*** :/\\] in the Sequel of this Discourse\n\nHow does which-clauses interact with phrasal verbs? Is it ever possible to place the adverbial particle before the *which* as in which-clauses with no phrasal verbs, like :\n\n&gt; Anatomy is the great ocean of intelligence ***upon which*** the true physician must sail",
        "created_utc": 1671579731,
        "upvote_ratio": 1.0
    },
    {
        "title": "Watch engraving",
        "author": "rememberthechildren",
        "url": "https://www.reddit.com/r/grammar/comments/zqzjw8/watch_engraving/",
        "text": "Time-sensitive because I’m trying to get this engraving done on a pocket watch for my father for Christmas, and these are my options. Any advice on which sounds best to you guys would be wonderful! \n\n-To the very best papa, with love\n\n\n-To the very best papa with love\n\n  \n- With love, to the very best papa\n\n\n- To the very best papa\nLove, (my child’s name) \n\nAlso should I include the dash before the inscription? My issue with including my child’s name is just that she’s only two so it’s obviously not actually from her; it’s from me and my husband as well. The sentiment behind the pocket watch though is that my father’s grandfather had a pocket watch that all the grandchildren loved to fiddle with, so I included that option. Any variation of these is fine, or any other ideas you may have. I just want to be sure it’s the best option as the watch itself was fairly expensive!",
        "created_utc": 1671570071,
        "upvote_ratio": 1.0
    },
    {
        "title": "should there be hyphens here: \"He is concerned about his higher-than-desired voice\"?",
        "author": "Special-Culture-970",
        "url": "https://www.reddit.com/r/grammar/comments/zqzhl9/should_there_be_hyphens_here_he_is_concerned/",
        "text": "Just wondering if it should be higher than desired or higher-than-desired or higher-than-desired-voice or something else",
        "created_utc": 1671569943,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quick question about voice/tense",
        "author": "jQuellN27",
        "url": "https://www.reddit.com/r/grammar/comments/zqyn8y/quick_question_about_voicetense/",
        "text": "I know that passive voice exists, but I'm not sure if this sentence counts as being in passive voice:   \n\"Her curiosity got her killed.\" \n\nWhat would you call exact tense be that I used here? Is this passive voice or something else? \n\nThanks!",
        "created_utc": 1671567896,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can 'Ruski' be used as a replacement for 'Russian'?",
        "author": "dead_idols",
        "url": "https://www.reddit.com/r/grammar/comments/zqxxw0/can_ruski_be_used_as_a_replacement_for_russian/",
        "text": "Can one say 'Ruski child', or can't it be used as an adjective.",
        "created_utc": 1671566204,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m writing an automated ooo message, can someone please tell me if this sounds right?",
        "author": "Crazyyycatlady",
        "url": "https://www.reddit.com/r/grammar/comments/zqxug3/im_writing_an_automated_ooo_message_can_someone/",
        "text": "English isn’t my first language, and my English-speaking bf said this doesn’t sound right; I feel that it’s right however, considering that I meant for it to be applicable to the dates indicated (21st-27th of Dec) regardless when during this time frame someone would try and message me:\n\n“I’m on annual leave/away from the 21st to the 27th of December and would have limited access to emails. In the background, however, I would be checking my ***/*** screening blood tests to prevent delays in infusion bookings. If there are any urgent queries, blahblahblah…”",
        "created_utc": 1671565969,
        "upvote_ratio": 1.0
    },
    {
        "title": "It is our ability to act independent(ly) of our circumstances that makes us free.",
        "author": "Formiddabledrip",
        "url": "https://www.reddit.com/r/grammar/comments/zqwp6d/it_is_our_ability_to_act_independently_of_our/",
        "text": "I am wondering whether the adjective or the adverb is preferable in this sentence. Obviously, it modifies a verb, but I still think the adjective better expresses the meaning: that we our not determined by our environment.\n\nWhat is your take?",
        "created_utc": 1671563216,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about Gerunds and Participles",
        "author": "vty23v98v",
        "url": "https://www.reddit.com/r/grammar/comments/zqw2h4/question_about_gerunds_and_participles/",
        "text": "If Participles can act as indirect objects in sentences, and gerunds act as nouns, who do I distinguish the two? Or can a word be a participle *and* a gerund?",
        "created_utc": 1671561731,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is it the English language but just American Sign Language?",
        "author": "jagged_jaws",
        "url": "https://www.reddit.com/r/grammar/comments/zqt3t2/why_is_it_the_english_language_but_just_american/",
        "text": "I am posting this question as to why there is the definite article in front of English language but not asl because I am curious about the rationale behind it. From how I see it, they are both about something definite and for that reason need the article before them.\n\nThx in advance.",
        "created_utc": 1671554600,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is it American Sign Language but the American language?",
        "author": "jagged_jaws",
        "url": "https://www.reddit.com/r/grammar/comments/zqrelg/why_is_it_american_sign_language_but_the_american/",
        "text": "I am posting this question as to why there is the definite article in front American language but not in front of asl because I am curious about the rationale behind it. From how I see it, they are both about something definite and for that reason need the article before them.\n\nThx in advance.",
        "created_utc": 1671550352,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sentences with \"have had\", please. 🙈",
        "author": "blackcoffeeme",
        "url": "https://www.reddit.com/r/grammar/comments/zqqqmu/sentences_with_have_had_please/",
        "text": "",
        "created_utc": 1671548660,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could anyone make these two sentences a little more elegant?",
        "author": "SomethingClever2468",
        "url": "https://www.reddit.com/r/grammar/comments/zqqcjz/could_anyone_make_these_two_sentences_a_little/",
        "text": "Also, is it \"it's\" or \"its\"?\n\n&amp;#x200B;\n\n\"If you couldn't tell by the theme of this website and by the fact its on  Friday the 13th, darker colors and tones are appreciated but there is  no formal dress code. All we ask that you look your best!\"\n\n&amp;#x200B;\n\nThank you in advance!",
        "created_utc": 1671547614,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling with comma placement",
        "author": "andthepinktanksroar",
        "url": "https://www.reddit.com/r/grammar/comments/zqom85/struggling_with_comma_placement/",
        "text": "Is it 'The 2000's best film' or 'The 2000s' best film'? \n\n&amp;#x200B;\n\nHelp please !",
        "created_utc": 1671543116,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does \"all in\" mean?",
        "author": "EngLearnerAibek",
        "url": "https://www.reddit.com/r/grammar/comments/zqn2ya/what_does_all_in_mean/",
        "text": "He knew he didn’t have to decide right then and then stick to it for the rest of his life, but he was the type of person who, once he chose something, he was pretty much **all in** on it.\n\nContext: [https://www.youtube.com/watch?v=zZcWBUZEhME](https://www.youtube.com/watch?v=zZcWBUZEhME)",
        "created_utc": 1671539087,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does \"somewhat\" mean?",
        "author": "EngLearnerAibek",
        "url": "https://www.reddit.com/r/grammar/comments/zqiq6v/what_does_somewhat_mean/",
        "text": "He had **somewhat** recently developed a fondness for spending time secluded in nature, and he loved studying and collecting plants and minerals and whatever else he could find, often creating journals with drawings and diagrams to identify and log his findings.\n\nContext: [https://www.youtube.com/watch?v=zZcWBUZEhME](https://www.youtube.com/watch?v=zZcWBUZEhME)",
        "created_utc": 1671523984,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Is us” or “are us”",
        "author": "kumori5578",
        "url": "https://www.reddit.com/r/grammar/comments/zqinu7/is_us_or_are_us/",
        "text": "I work in marketing as a copywriter, I am working on an ad at the moment and cannot decide between using “is us” or “are us” here is the context:\n\nThe only other people who….. is us\n\nI wrote it like that and my clients approved. After reviewing it myself, I realised, shouldn’t it be “are us”? Considering it’s referring to “other people” and those are people “are us” ?",
        "created_utc": 1671523766,
        "upvote_ratio": 1.0
    }
]