[
    {
        "title": "‘For still others’ what does it mean?",
        "author": "sheeshhhhhh",
        "url": "https://www.reddit.com/r/grammar/comments/zzo5lc/for_still_others_what_does_it_mean/",
        "text": "I saw some sentences starting with “for still others” and i have no idea what it means. thanks!",
        "created_utc": 1672470511,
        "upvote_ratio": 1.0
    },
    {
        "title": "have I filled in correct phrasal verbs?",
        "author": "RepublicTraditional",
        "url": "https://www.reddit.com/r/grammar/comments/zznu6t/have_i_filled_in_correct_phrasal_verbs/",
        "text": "1. How did you come (by) this rare book?\n2. The result will come (out) soon. \n3. The thieves broke (into) the shop and stole all the jewellery. \n4. Terrorism has broken (off) a lot of families in our village. \n5. How are you getting (along) in your new hostel? \n6. She found it difficult to get (along) with her new neighbours.\n7. She kept (away) nothing from me.\n8. We must keep (on) our progress.\n9. Can you make (out) the meaning of what she says?\n10. He has made (over) all his property to his younger brother.",
        "created_utc": 1672469343,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does that sentence make sense to you",
        "author": "Freak-1",
        "url": "https://www.reddit.com/r/grammar/comments/zzmk4x/does_that_sentence_make_sense_to_you/",
        "text": "Wandering in the universe, thinking what could have and have not been.",
        "created_utc": 1672464896,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does open borders mean?",
        "author": "Fainting_GoatMilk",
        "url": "https://www.reddit.com/r/grammar/comments/zzlyd0/what_does_open_borders_mean/",
        "text": "This is a debate resolution I am working with:\n\n**Resolved: Justice requires open borders for human migration.** \n\nCan anyone provide grammatical justifications for the number of borders that need to be addressed in  an affirmative case for this resolution?\n\nThe resolution uses the plural 'borders', but a common interpretation is to focus on a single borderland, one border shared by multiple countries. If I wanted to argue that borders means more than a single border land is there a way to justify this argument with a grammatical standard or rule? \n\nThanks!",
        "created_utc": 1672462935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clarification of Sentence",
        "author": "Jitball",
        "url": "https://www.reddit.com/r/grammar/comments/zzlgew/clarification_of_sentence/",
        "text": "Not sure if this is the correct subreddit to post this on, but I’m reading Franz Kafka’s Metamorphosis and I’ve come upon a sentence I can’t decipher “Were all employees, every one of them, louts, was there not one of them who was faithful and devoted who would go so mad with pangs of conscience that he couldn’t get out of bed if he didn’t spend at least a couple of hours in the morning on company business?” Does this mean that all employees that work there go insane with guilt if they don’t spend their mornings at work? If that’s the case why does it start with “not one of them”? Thanks!",
        "created_utc": 1672461321,
        "upvote_ratio": 1.0
    },
    {
        "title": "Too much redundancy?",
        "author": "randopop21",
        "url": "https://www.reddit.com/r/grammar/comments/zzj83e/too_much_redundancy/",
        "text": "I want to say \"The device provides the user with an unbiased arms-length 2nd opinion, something a dear friend might feel uncomfortable giving.\"\n\nAre \"unbiased\" and \"arms-length\" too close in meaning such that one is redundant?\n\nI worry that \"unbiased\" is clinical by itself and \"arms-length\" is a bit idiomatic (not everyone might know what it means).",
        "created_utc": 1672454541,
        "upvote_ratio": 1.0
    },
    {
        "title": "Press/force",
        "author": "withheldforprivacy",
        "url": "https://www.reddit.com/r/grammar/comments/zzj7id/pressforce/",
        "text": "What's the difference.\n\n1. She pressed herself to smile.\n2. She forced herself to smile.",
        "created_utc": 1672454495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would hyphenated words be considered one word or two?",
        "author": "SubstantialMohawk",
        "url": "https://www.reddit.com/r/grammar/comments/zzhrhd/would_hyphenated_words_be_considered_one_word_or/",
        "text": "For example, is the word \"All-star\" two words?",
        "created_utc": 1672450407,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to punctuate a list of parallel things?",
        "author": "Educational-Yam333",
        "url": "https://www.reddit.com/r/grammar/comments/zzgnzf/how_to_punctuate_a_list_of_parallel_things/",
        "text": "I always run into an issue of creating a list of parallel things, if that makes sense. I struggle knowing when to use a semicolon or a comma. Here's an example:\n\n  *I've always been stuck between the sensitive and the sensible; the creative and the practical; the artist and the scientist.* \n\nI like this sentence a lot, but I always make weird sentence structures that I don't know the proper grammar for. It's frustrating!!\n\nSo, do I use a semicolon or comma? Is there a way to save this sentence from grammar issues, or should I rewrite it? I write a lot of other sentences similar to this, so I would love to resolve this so I can avoid making the same mistake! Any advice is appreciated :D",
        "created_utc": 1672447397,
        "upvote_ratio": 1.0
    },
    {
        "title": "but not both?",
        "author": "chronoboy1985",
        "url": "https://www.reddit.com/r/grammar/comments/zzfeme/but_not_both/",
        "text": "In the following sentence “but” is a conjunction, however the clause is a dependent clause. So should there be a comma or not before but? \n\n*We can bring the cat or dog, but not both.*",
        "created_utc": 1672444114,
        "upvote_ratio": 1.0
    },
    {
        "title": "The IRS' or IRS’s?",
        "author": "MHmemoi",
        "url": "https://www.reddit.com/r/grammar/comments/zzeqkz/the_irs_or_irss/",
        "text": "I’m reading a news article, and there’s a sentence that starts with “The IRS’ failure to...”\n\nShouldn’t there be an “s” after that apostrophe?",
        "created_utc": 1672442391,
        "upvote_ratio": 1.0
    },
    {
        "title": "\" to convert the US systems or \"to convert the US'systems\"?",
        "author": "MysteriesandThoughts",
        "url": "https://www.reddit.com/r/grammar/comments/zze7no/to_convert_the_us_systems_or_to_convert_the/",
        "text": "what option would be correct?",
        "created_utc": 1672441072,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is this form called, and when is it used?",
        "author": "Beppbubt",
        "url": "https://www.reddit.com/r/grammar/comments/zzdf7m/what_is_this_form_called_and_when_is_it_used/",
        "text": "Sometimes you find sentences built like this: \"The assistant should ensure that all participants **be** muted\" instead of what intuitively would seem correct: \"The assistant should ensure that all participants **are** muted\". I am fairly certain both are correct, but the former is much more rare and formal by my estimation. Could anyone enlighten me as to when it is used and if it has a name?",
        "created_utc": 1672439076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two words that sound the same, have the same meaning, but are spelled different.",
        "author": "Ok_Proof_6672",
        "url": "https://www.reddit.com/r/grammar/comments/zz9zh8/two_words_that_sound_the_same_have_the_same/",
        "text": "Would you just call this a homophone or something else? For instance, let's just say you could spell bird as bird or berd. They are pronounced the same and both mean the same thing. Would they be homophones or something else?",
        "created_utc": 1672430578,
        "upvote_ratio": 1.0
    },
    {
        "title": "past continuous in these sentences. What does it mean?",
        "author": "DrawerNervous3649",
        "url": "https://www.reddit.com/r/grammar/comments/zz9kya/past_continuous_in_these_sentences_what_does_it/",
        "text": " \n\n**1 Alex was living in Japan for six years so he decided to sell his car in the US.**\n\nWhat does the sentence mean?\n\n*a) He had lived in Japan for six years when he decided to sell his car.*\n\n*b) Alex intended to live in japan for six years, so he decided to sell his car.*\n\n**2 I was living in England for two years as part of a student exchange programme.**\n\nWhat does the sentence mean?\n\n*a) The speaker claims that he spent two years living in England.*\n\n*b) The speaker claims that he was going to spend two years living in England.*",
        "created_utc": 1672429592,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many is vs. how many are.",
        "author": "adammh23",
        "url": "https://www.reddit.com/r/grammar/comments/zz8lbl/how_many_is_vs_how_many_are/",
        "text": "I am writing an email for work and trying to ask someone what amount of employees would be too many. Do I ask “how many employees is too many?” or “how many employees are too many?”",
        "created_utc": 1672427171,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are both lines grammatically correct or 1) is wrong?",
        "author": "Beneficial_Gold8152",
        "url": "https://www.reddit.com/r/grammar/comments/zz5thn/are_both_lines_grammatically_correct_or_1_is_wrong/",
        "text": "**1) Shouldn’t condemning extremism end it?**\n\n**2)** ***Shouldn’t condemning extremism put an end to it?***",
        "created_utc": 1672420454,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the difference between \"take in\", \"indulge in\", and \"soak up\"?",
        "author": "RealMrOoof",
        "url": "https://www.reddit.com/r/grammar/comments/zz1pbk/whats_the_difference_between_take_in_indulge_in/",
        "text": "I'm preparing for an exam but I'm not sure what are the differences between these three words. Could someone explain it to me please?",
        "created_utc": 1672410083,
        "upvote_ratio": 1.0
    },
    {
        "title": "When to use ‘by’ or ‘with’",
        "author": "maalik_reluctant",
        "url": "https://www.reddit.com/r/grammar/comments/zz1eme/when_to_use_by_or_with/",
        "text": "Hey everyone. I’m writing this summary about a book on my laptop and I have this grammarly extension which highlighted a few issues . I’d appreciate if someone could explain the difference .\n\n\n“She starts with describing her life ….”\n\nThis is where the grammarly extension suggests that it should be ‘by’ instead of ‘with’. I know ‘by’ sounds more appropriate but does it make any difference.\n\n\nSecondly, I saw that grammarly keeps correcting the names of the countries by adding the article ‘the’ before the name. Ex “ It has been prevalent in UK”. This is where it suggests that I should use ‘the’ before the country. Is it important?",
        "created_utc": 1672409295,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a useful distinction between adjectives and noun adjuncts in rare cases?",
        "author": "goofballl",
        "url": "https://www.reddit.com/r/grammar/comments/zz1aw1/is_there_a_useful_distinction_between_adjectives/",
        "text": "The word square is both a noun and an adjective. When you have a square table is it a noun adjunct or an adjective, and does the distinction matter? \n\nI don't think there are too many cases where the noun and adjective form are the same, so maybe it's a moot point.",
        "created_utc": 1672409014,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can “who” used to refer non living things?",
        "author": "VectorSpeedWarrior",
        "url": "https://www.reddit.com/r/grammar/comments/zyy299/can_who_used_to_refer_non_living_things/",
        "text": "It’s like you are talking to a machine and you ask it: “who are you?”. So is this sentence true or you should use “who are you?”",
        "created_utc": 1672398811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does \"What people ask\" sound natural?",
        "author": "Rangerswill",
        "url": "https://www.reddit.com/r/grammar/comments/zyvf9e/does_what_people_ask_sound_natural/",
        "text": "I want to use this as one of the **headings** in a paper where I answer the common questions about the topic beneath this title. But does \"What people ask\" sound natural or poor grammar?",
        "created_utc": 1672389281,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are participle phrases in absolute construction restrictive or non-restrictive?",
        "author": "Conectiololo",
        "url": "https://www.reddit.com/r/grammar/comments/zystc5/are_participle_phrases_in_absolute_construction/",
        "text": "Many websites say that an absolute phrase has a noun + modifiers.  \nAn example: \"John being happy, I felt I had succeded in my goal.*\"*  \nHere, since \"John\" is a specific person shouldn't this be non-restrictive? If so, shouldn't a comma also be there after John?   \nHere is another example: \" The sun having risen, we set out on our journey.\"",
        "created_utc": 1672380285,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"No other choice but...\" or \"No other choice than...?\"",
        "author": "SUBLALBUS",
        "url": "https://www.reddit.com/r/grammar/comments/zyst81/no_other_choice_but_or_no_other_choice_than/",
        "text": "Hi. So, say I want to say that banana pudding is my only choice for dessert (that's not what I am actually writing about, but just go with it for the example). Would I say, \"I have no other choice but banana pudding\" or \"I have no other choice than banana pudding\" or are both of them correct? Thank you for your assistance!",
        "created_utc": 1672380276,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fowler's Dictionary of Modern English Usage or Garner's Modern English Usage",
        "author": "WarStrategist",
        "url": "https://www.reddit.com/r/grammar/comments/zynkbm/fowlers_dictionary_of_modern_english_usage_or/",
        "text": "I am a budding academic who is keen on working on all aspects of my grammar usage. I have the budget for one book on modern English usage and was wondering if people suggest the [4th edition Fowler](https://www.amazon.com/Fowlers-Dictionary-Modern-English-Usage-dp-0199661359/dp/0199661359/ref=dp_ob_title_bk) or [5th edition Garner](https://www.amazon.com/Garners-Modern-English-Usage-Garner/dp/0197599028/ref=tmm_hrd_swatch_0?_encoding=UTF8&amp;qid=1672364953&amp;sr=1-9). What are the main differences between the two and if I could only have one, which and why?\n\nIf it helps to know my field of study it is foreign policy/military strategy and history. I do, however, also write some fiction.",
        "created_utc": 1672365119,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would there be a comma between a word and \"for\"?",
        "author": "ThisIsMyUsername163",
        "url": "https://www.reddit.com/r/grammar/comments/zymztx/would_there_be_a_comma_between_a_word_and_for/",
        "text": "\"Only the will of a classicist can complete the cycle of rebirth for all preceding emissaries have been lost beneath the Earth\" is the sentence. Would there be a comma between rebirth and for? Also would earth be capitalized?",
        "created_utc": 1672363647,
        "upvote_ratio": 1.0
    },
    {
        "title": "Semiquincentennial vs quarter-millennial?",
        "author": "mobileagnes",
        "url": "https://www.reddit.com/r/grammar/comments/zyim9s/semiquincentennial_vs_quartermillennial/",
        "text": "This has to do with the upcoming celebrations for the USA's 250th birthday. I'm from Philadelphia, so the birth city. I don't know about anyone else, but semiquincentennial does not easily roll off the tongue like quarter-millennial does. We recently celebrated a new millennium in 1999/2000/2001, so chances are everyone (except maybe gen Z?) has that memory fresh on their minds anyway. 250 years is a quarter of a millennium. Semiquincentennial breaks down to half of 500 years. Are both valid?",
        "created_utc": 1672352973,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adiós or Adieu?",
        "author": "PesAddict8",
        "url": "https://www.reddit.com/r/grammar/comments/zyi90i/adiós_or_adieu/",
        "text": "Hi, I was thinking of curating a Spotify playlist for my favourite songs from 2022. Thought of naming it 'Adios 2022' at first but 'Adieu 2022' sounds fine as well.\n\nWhich one would sound more correct in the context?",
        "created_utc": 1672352136,
        "upvote_ratio": 1.0
    },
    {
        "title": "I thought of a new term, and I'm not sure I'm the first to think of it.",
        "author": "RogueJyn",
        "url": "https://www.reddit.com/r/grammar/comments/zygim6/i_thought_of_a_new_term_and_im_not_sure_im_the/",
        "text": "Triggerbaiting  (verb) The act of purposefully saying something others disagree with for the soul purpose of making them angry.",
        "created_utc": 1672348126,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think we should just use continual conjunctions to separate items in a list instead of commas",
        "author": "ChristianPacifist",
        "url": "https://www.reddit.com/r/grammar/comments/zyftxw/i_think_we_should_just_use_continual_conjunctions/",
        "text": "My number one concern when writing is effective communication, and I find more often than not that using comma separated lists create ambiguity and awkwardness that muddies my message. Conjunctions used continually, while certainly clunkier, can convey the items in a list unambiguously and provide overall more effective communication and especially are useful when the list of items contains complex verb phrases.\n\nOxford comma, no Oxford comma... it doesn't matter to me! In my opinion, just string together multiple uses of \"and\" or \"or\"! My inspiration for this stylistic innovation is computer programming by the way where logical expressions are often constructed via one or many AND or OR operators.\n\nWhat do people think of my new grammatical innovation for the English language? Will you join me in this usage?",
        "created_utc": 1672346507,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Advertisement\" pronunciation with long \"i\" sound versus short \"i\"",
        "author": "ChristianPacifist",
        "url": "https://www.reddit.com/r/grammar/comments/zyed6q/advertisement_pronunciation_with_long_i_sound/",
        "text": "Growing up I always thought that the word \"advertisement\" pronounced with a long \"i\" was more like a commercial ad trying to sell you something, while the short \"i\" pronunciation was more informational like a notice or announcement of an event in the newspaper.\n\nI'm an American also who speaks with a New York / New Jersey accent, so this could just be a regional or super local understanding (or even something in my own head), but I am curious if anyone has any thoughts. This is super hard to Google for due to the identical spelling lol.\n\nAre these two separate words with two separate meanings and pronunciations in spite of having the same spelling? Is anyone else familiar with this approach to the word \"advertisement\"?",
        "created_utc": 1672343011,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the difference between \"we want\" and \"we are wanting\"?",
        "author": "_mutecity",
        "url": "https://www.reddit.com/r/grammar/comments/zyc0ez/what_is_the_difference_between_we_want_and_we_are/",
        "text": "I'm a non-native English speaker. I've lived in the U.S. for a year, and I never near anyone use the phrase \"I am wanting _\" in conversation, but I see it constantly on Reddit.\n\nWhat is the difference? When should I use which? I only ever learned \"I want\" or \"We want\"",
        "created_utc": 1672337529,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Alleged\" v. \"Allegedly\"",
        "author": "NPHolt",
        "url": "https://www.reddit.com/r/grammar/comments/zy7kni/alleged_v_allegedly/",
        "text": "Any fellow legal writers: is it better to refer to \"alleged negligent behavior\" or \"allegedly negligent behavior\"?",
        "created_utc": 1672326468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Commas and lists",
        "author": "NPHolt",
        "url": "https://www.reddit.com/r/grammar/comments/zy7ev3/commas_and_lists/",
        "text": "Is comma placement in the following correct? \n\n\"Plaintiff alleges that he was discriminated against, and that he was incorrectly denied promotion.\"\n\nI'm unsure if the allegations listed should be treated as independent clauses.\n\nThanks.",
        "created_utc": 1672326047,
        "upvote_ratio": 1.0
    },
    {
        "title": "A question concerning \"from\"",
        "author": "_1Michael1_",
        "url": "https://www.reddit.com/r/grammar/comments/zy0c9t/a_question_concerning_from/",
        "text": "Hello. This question is ridiculously easy, but I'm still concerned about this: \"Susan called her friend from Spain\". \nCould the \"from\" here refer to both Susan's friend living in Spain and/or Susan herself being in Spain and directing a phonecall from there? Is there a specific syntactic category that explains it?\n\nThank you in advance for your answers. Basically, I'm just an enthusiast, not a native speaker.",
        "created_utc": 1672303129,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this sentence in present perfect tense?",
        "author": "xlynx0",
        "url": "https://www.reddit.com/r/grammar/comments/zy074c/is_this_sentence_in_present_perfect_tense/",
        "text": "\"There have always been people that are willing to donate their body for research.\" \nIs this in the prefect tense?",
        "created_utc": 1672302611,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trouble with dialogue punctuation",
        "author": "college_atlas",
        "url": "https://www.reddit.com/r/grammar/comments/zxykha/trouble_with_dialogue_punctuation/",
        "text": "Hello all.\n\nI'm writing some dialogue and I'm not sure of the punctuation.\n\nThe last sentence is more of a definite statement but I'm unsure if it's written as a rhetorical question.\n\nIs it\n\nI’m not sure we’re in the most secure location. **We are at war you know?**\n\nor\n\nI’m not sure we’re in the most secure location. **We are at war you know.**\n\nYour advice appreciated.",
        "created_utc": 1672296916,
        "upvote_ratio": 1.0
    },
    {
        "title": "getting up or get up",
        "author": "DrawerNervous3649",
        "url": "https://www.reddit.com/r/grammar/comments/zxw9xs/getting_up_or_get_up/",
        "text": "They are on a week holiday at the sea now. They are **getting** up at 10 o'clock everyday.  \nThey are on a week holiday at the sea now. They **get** up at 10 o'clock everyday. \n\n&amp;#x200B;\n\nWhich one is correct?",
        "created_utc": 1672289897,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does \"brought this up\" mean?",
        "author": "EngLearnerAibek",
        "url": "https://www.reddit.com/r/grammar/comments/zxuua9/what_does_brought_this_up_mean/",
        "text": "Cameron **brought this up** from the ER.\n\nContext: **House, M.D. \\[S05E17\\] #02** ( **02:55-03:40** )\n\n \n\n**FOREMAN:** Cameron brought this up from the ER.\n\n\\- Doesn't look like a friendship bracelet.\n\n**KUTNER:** It's Phineas Gage. The most famous case study in medical history.\n\n\\- You're telling me this patient got a railroad spike drilled through his frontal lobe?\n\n\\- No, no trauma, but he does have frontal lobe disinhibition. Just like Gage.\n\n\\- Gage was a different person after the spike. Argumentative, impulsive.\n\n\\- Whereas our guy became a different person after chardonnay.\n\n\\- He was sober when they brought him in. There's also the nosebleed, the collapse.\n\n\\- MRI show anything?\n\n\\- Nothing.\n\n\\- Good. What fun would that be? So the tumor's not in the cool neighborhood. It's cool neighborhood adjacent.\n\n\\- A well-placed tumor in the nasal cavity, eroding into the brain could do the damage.\n\n\\- Go stick a scope up Phineas' nose and see what you find.",
        "created_utc": 1672285817,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m vs I am",
        "author": "pecanpiebutt",
        "url": "https://www.reddit.com/r/grammar/comments/zxtweo/im_vs_i_am/",
        "text": "What is the difference between “I’m” and “I am”? Someone just scolded me for using “I’am” instead of “I am” in my email.  I’m confused..",
        "created_utc": 1672283241,
        "upvote_ratio": 1.0
    },
    {
        "title": "An interjection. The dragon's tail—whose tip is forked—was green. The movie, whose ending sucked, was long. Is WHOSE the only word here? Which's? The movie, which's ending sucked. That? The movie, that's ending sucked. Is it THAT? My friend makes my brain collapse with her questions.",
        "author": "dalibor_gursky",
        "url": "https://www.reddit.com/r/grammar/comments/zxt0eb/an_interjection_the_dragons_tailwhose_tip_is/",
        "text": "",
        "created_utc": 1672280879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Difference between a colon and semicolon when joining independent clauses",
        "author": "Nelpski",
        "url": "https://www.reddit.com/r/grammar/comments/zxqkqs/difference_between_a_colon_and_semicolon_when/",
        "text": "I've been struggling to locate a concrete difference between the use of a colon vs a semicolon when used to join two independent clauses. \n\nBoth seem to be used interchangeably, the only difference I've ever heard is that the colon is \"stronger\" than a semicolon but I am having a hard time understanding what that means. \n\n7ESL gives the following examples:\n\n__**Colon:**__\n*\"Clank was right: the sky is falling.\nA shark is not a mammal: it is a fish.\n\n__**Semicolon:**__\n*I eat cake whenever I can; life’s too short to have it only on special occasions.\nEvil is not born; it is made.*\n\nI am struggling to perceive the difference between these groups of sentences.\n\nThanks for any help",
        "created_utc": 1672274708,
        "upvote_ratio": 1.0
    },
    {
        "title": "White and Black in terms of race should be capitalized, here's my reason why.",
        "author": "flossingjonah",
        "url": "https://www.reddit.com/r/grammar/comments/zxp6xk/white_and_black_in_terms_of_race_should_be/",
        "text": "Other regions may view race differently, this is more of a US-specific post. Sometimes I see both of those ethnic groups in lowercase. Sometimes only Black is capitalized. Sometimes Black and White are both capitalized. But here is my reason why both should be capitalized.\n\nThe reason why the ethnic/racial groups White and Black should be capitalized is because every other racial group is capitalized. **If all other ethnic groups use capital letters, why not White and Black? Also, the APA** [states](https://apastyle.apa.org/style-grammar-guidelines/capitalization/proper-nouns) **that both should be capitalized.**\n\n* September 15 is the first day of Hispanic Heritage Month.\n* Navajo, Cherokee, and Seminole are some examples of Native American tribes. \n* My best friend is East Asian.\n\nThose groups are already capitalized. Now here are some examples of White and Black being capitalized:\n\n* The majority of people in Europe are White, while the majority of people in sub-Saharan Africa are Black.\n* Henry VIII, Leif Erikson, and Nikola Tesla are some famous White historical figures.\n* Famous Black American musicians include Michael Jackson, Whitney Houston, and Louis Armstrong.\n\nIt only makes sense that the first letter of White and Black is capitalized too, especially after seeing \n\nWhen talking abut skin color, it doesn't necessarily apply, since you are referring to the color of someone's skin, not describing their ethnicity. \n\n* 94% of people in Maine have white skin.\n* Sitting out in the sun will give you tan skin.\n* The prime minister of India has brown skin.\n* My doctor from Cameroon has black skin.\n\nBoth examples being used:\n\n* Jacob has black skin. He is Black. (His skin color is not an ethnicity, so it is not capitalized. However, his ethnicity is capitalized.)\n* Tyler has white skin. He is White. (Ditto as above.)\n\nSo to fix a sentence here:\n\n* Jacob is black, Tanner is Asian, and Tyler is white.\n\nChange it to:\n\n* Jacob is Black, Tanner is Asian, and Tyler is White. \n\nWhat are your thoughts on capitalizing those groups?",
        "created_utc": 1672271359,
        "upvote_ratio": 1.0
    },
    {
        "title": "Comma after last night?",
        "author": "Responsible-Hope-859",
        "url": "https://www.reddit.com/r/grammar/comments/zxo5kt/comma_after_last_night/",
        "text": "Is a comma needed after last night in this sentence: Last Night, I was writing down my fitness goals and that morphed into meal prep ideas.",
        "created_utc": 1672268909,
        "upvote_ratio": 1.0
    },
    {
        "title": "get vs getting",
        "author": "YoCCC",
        "url": "https://www.reddit.com/r/grammar/comments/zxnkv8/get_vs_getting/",
        "text": "vibes i get from u\n\nor vibes im getting from u ?",
        "created_utc": 1672267575,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does this sentence make sense (non-native English speaker)",
        "author": "balloonbiceps",
        "url": "https://www.reddit.com/r/grammar/comments/zxjh67/does_this_sentence_make_sense_nonnative_english/",
        "text": "Hi, am from Denmark and it makes sense in Danish, yet I’m not sure translated:\n\n“Praise often becomes non-concrete as we fear to show that we don’t know it all, but I’ve chosen to go against this”\n\nHave a great day",
        "created_utc": 1672258010,
        "upvote_ratio": 1.0
    },
    {
        "title": "When can I put a comma before \"the\"?",
        "author": "aspeninrain",
        "url": "https://www.reddit.com/r/grammar/comments/zxh5ko/when_can_i_put_a_comma_before_the/",
        "text": "I was reading this sentence, (from *Something I've Been Meaning to Tell You - Alice Munro*)\n\n    We saw it come in over the tree tops, all red and silver, the first close-up plane I ever saw. \n\nand I am confused with the whole idea of when to add a comma before \"the\" and when not to. Here there are no subordinating conjunctions or omitted coordinating conjunctions.",
        "created_utc": 1672252558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using “an” in front of a word starting with u.",
        "author": "jjeenniiffeerr",
        "url": "https://www.reddit.com/r/grammar/comments/zxgclz/using_an_in_front_of_a_word_starting_with_u/",
        "text": "I get you use an in front of words beginning with vowels, but I saw a tweet that said “an Urus” (which I believe is a lambo model but that’s not important) and it just sounded super weird to me reading it out loud. Is this proper use of grammar? Or would using “a” be more appropriate? Is there a specific rule on this?",
        "created_utc": 1672250702,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does wailing silently make sense...?",
        "author": "unglydono",
        "url": "https://www.reddit.com/r/grammar/comments/zxfhb7/does_wailing_silently_make_sense/",
        "text": "I wanted to add a dramatic effect to a story I'm working on but I wasn't sure if this would make sense..\n\nHere's the sample of the text:  \nBaihe remembered that day vividly— while the bulky armored men celebrated their triumph, Baihe wailed silently within the embrace of what can be now known as a corpse. She had the will to not be discovered but not strong enough to suppress her tears.",
        "created_utc": 1672248663,
        "upvote_ratio": 0.99
    },
    {
        "title": "Can someone help me figure out a way to remember the I before E rule? I know the rhyme, but in practice I'm always unsure when spelling words like piece and receive. Any good tricks to finally lock this down for me?",
        "author": "Collinsc108",
        "url": "https://www.reddit.com/r/grammar/comments/zxeeyj/can_someone_help_me_figure_out_a_way_to_remember/",
        "text": "",
        "created_utc": 1672246163,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which of the Big Romance Languages has the fewest number of irregular verbs?",
        "author": "Repulsive_Opinion990",
        "url": "https://www.reddit.com/r/grammar/comments/zxd5dk/which_of_the_big_romance_languages_has_the_fewest/",
        "text": "",
        "created_utc": 1672243150,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this a complex sentence?",
        "author": "No-Time-5935",
        "url": "https://www.reddit.com/r/grammar/comments/zxc102/is_this_a_complex_sentence/",
        "text": "It is imperative that we carry on with the plan.",
        "created_utc": 1672240457,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does it have to be ‘you and I’?",
        "author": "piklboi69",
        "url": "https://www.reddit.com/r/grammar/comments/zxadq2/does_it_have_to_be_you_and_i/",
        "text": "I was playing the new Pokémon game, when one of the characters said: \n‘Time to show that thing what you and me can do!’\n\nI’m pretty sure it should be ‘you and I’, right? I would usually shrug it off as a mistake, but this is from a triple A title, and I’m questioning my knowledge. Help",
        "created_utc": 1672236305,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"He wondered: does frost fall from the sky?\" Is this grammatically correct?",
        "author": "qwertdwlrma",
        "url": "https://www.reddit.com/r/grammar/comments/zx9tl7/he_wondered_does_frost_fall_from_the_sky_is_this/",
        "text": "",
        "created_utc": 1672234781,
        "upvote_ratio": 1.0
    },
    {
        "title": "City names as adjective",
        "author": "ScepticalWorm",
        "url": "https://www.reddit.com/r/grammar/comments/zx7x6l/city_names_as_adjective/",
        "text": "Hi grammar folks,\n\nnon-native here. If you say things like \"The portland street gangs\" or \"She's a chicago waitress\", is that a) correct? And b) Do I have to use upper or lower case on the city names?",
        "created_utc": 1672229089,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I make this sentence more concise this way?",
        "author": "quantummyy",
        "url": "https://www.reddit.com/r/grammar/comments/zx5ckc/can_i_make_this_sentence_more_concise_this_way/",
        "text": "I was writing something that went like this: \"....opportunities to have deep dialogues on Keynesian theory with someone as passionate about economics as I am **about** physics.\" Can I remove the 2nd \"about\"?",
        "created_utc": 1672219642,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a formal and technical way to say \"from scratch\"?",
        "author": "Imposter_89",
        "url": "https://www.reddit.com/r/grammar/comments/zx2fq0/what_is_a_formal_and_technical_way_to_say_from/",
        "text": "I know this subreddit is mainly for grammar, but hoping someone can help! I did try to Google formal and technical synonyms, but they just don't sound right. It is for my dissertation, so being technical is important. The synonyms I found were: from the ground up, from zero, from the beginning, etc. They don't work for my case. I want to say that I coded a certain algorithm from scratch, as in I didn't use any already available and built-in programming functions and libraires. I currently have it as: \"... Algorithms X, Y, and Z were coded from scratch...\". If \"from scratch\" is okay to use, please let me know so I can keep it the way it is. Thank you in advance!",
        "created_utc": 1672208767,
        "upvote_ratio": 1.0
    },
    {
        "title": "Word",
        "author": "XtraStorage",
        "url": "https://www.reddit.com/r/grammar/comments/zx274q/word/",
        "text": "“You’re a freaking 5 y/o” is very different if you remove the “‘“ and “e” in “You’re” and move the “a” to after “freaking” it’s a very different sentence.",
        "created_utc": 1672207954,
        "upvote_ratio": 1.0
    },
    {
        "title": "Period right after question mark?",
        "author": "GermanLearner321",
        "url": "https://www.reddit.com/r/grammar/comments/zx1zf5/period_right_after_question_mark/",
        "text": "Hi, I'm following American English. Which of the following sentences are correct? Or are both these two sentences incorrect?\n\n&amp;#x200B;\n\n 1) I said, “Wheelchair?.” I just gulped; how I will distribute books in the wheelchair?  \n\n 2) I said, “Wheelchair?”. I just gulped; how I will distribute books in the wheelchair?",
        "created_utc": 1672207246,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does \"the winds had come\" mean?",
        "author": "EngLearnerAibek",
        "url": "https://www.reddit.com/r/grammar/comments/zx122g/what_does_the_winds_had_come_mean/",
        "text": "There had been steady rain for a week now, and two days ago **the winds had come** as well.\n\nContext: Stephen King - It\n\n \n\n**Chapter 1**\n\n**AFTER THE FLOOD (1957)**\n\n**1**\n\nThe terror, which would not end for another twenty-eight years—if it ever did end—began, so far as I know or can tell, with a boat made from a sheet of newspaper floating down a gutter swollen with rain.\n\nThe boat bobbed, listed, righted itself again, dived bravely through treacherous whirlpools, and continued on its way down Witcham Street toward the traffic light which marked the intersection of Witcham and Jackson. The three vertical lenses on all sides of the traffic light were dark this afternoon in the fall of 1957, and the houses were all dark, too. There had been steady rain for a week now, and two days ago **the winds had come** as well. Most sections of Derry had lost their power then, and it was not back on yet.",
        "created_utc": 1672204266,
        "upvote_ratio": 1.0
    },
    {
        "title": "When using an em dash before a quotation mark, is a space necessary?",
        "author": "Devoted_Sentinel",
        "url": "https://www.reddit.com/r/grammar/comments/zwy6kf/when_using_an_em_dash_before_a_quotation_mark_is/",
        "text": "I was under the impression that it was, and have been writing sentences like\n\n\\&gt;He frowns— \"Are you okay?\"\n\nIs this correct, or maybe something that varies by style? I appreciate any help",
        "created_utc": 1672195695,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mixing of Would and Will",
        "author": "BikingEveryday",
        "url": "https://www.reddit.com/r/grammar/comments/zwtvjd/mixing_of_would_and_will/",
        "text": "Just saw this sentence from an article:\n\nIt’s not that they can’t admit it but because they are so independent they think their resentment is obvious. They WOULD ask you to be friends because they WILL still want a second chance with you.  \n\nMy question is why didn’t the author use will/will or would/would here? I can’t get the purpose of using the would/will pattern.  Please help.",
        "created_utc": 1672184020,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this what they call an Adjective?",
        "author": "DeviCateControversy",
        "url": "https://www.reddit.com/r/grammar/comments/zwtm1i/is_this_what_they_call_an_adjective/",
        "text": "What type of word is \"*verbally*\"? Specifically with the 'ly' at the end.\n\nWhen referring to communication through text, like this post for example, would \"textually\" work? As in \"*I was textually communicating that...*\"",
        "created_utc": 1672183366,
        "upvote_ratio": 1.0
    },
    {
        "title": "For for? Had had?",
        "author": "Necessary-Piccolo127",
        "url": "https://www.reddit.com/r/grammar/comments/zwrrzx/for_for_had_had/",
        "text": "Are you able to say “for for, so long—much like you can say “ she had had enough?”",
        "created_utc": 1672178997,
        "upvote_ratio": 1.0
    },
    {
        "title": "get or got?",
        "author": "jiyajaale",
        "url": "https://www.reddit.com/r/grammar/comments/zwmb8q/get_or_got/",
        "text": "\"While my host also ensured that I get the right exposure while I was there.\"\n\nIn my opinion, it should be \"***got***\" in the sentence instead of \"***get***\".",
        "created_utc": 1672165569,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help me find another way to write this sentence 😭",
        "author": "SunnyBubblezz",
        "url": "https://www.reddit.com/r/grammar/comments/zwkt1s/please_help_me_find_another_way_to_write_this/",
        "text": "I feel like it’s so wrong but I can’t think of a way to write it differently. \n\n“Some nights, at 3am, I wake up and think back on things I said in a conversation and why it was such an awkward thing to say.\n\nI’m not a native English speaker and I’m SUPER bad at grammar. 😢 help",
        "created_utc": 1672161751,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a term for wording that has unnecessary verbiage?",
        "author": "AbeLincolnMixtape",
        "url": "https://www.reddit.com/r/grammar/comments/zwks8w/is_there_a_term_for_wording_that_has_unnecessary/",
        "text": "If someone says “That is *less unlikely* than Hell freezing over” - it’s a double-negative, right?\n\nBut what if someone says “That is *more unlikely* than Hell freezing over?\n\nWouldn’t “less likely” make more sense than “more unlikely”? Or is it just personal preferance?\n\nIs there a grammatical term for this?",
        "created_utc": 1672161694,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whom did she call? or Who did she call?",
        "author": "itsHaMaaa",
        "url": "https://www.reddit.com/r/grammar/comments/zwk4wc/whom_did_she_call_or_who_did_she_call/",
        "text": "which is correct? whom did she call? or who did she call?",
        "created_utc": 1672160061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is completed vs is complete?",
        "author": "mintylaced",
        "url": "https://www.reddit.com/r/grammar/comments/zwk0lc/is_completed_vs_is_complete/",
        "text": "The sentence is: You’ll be notified when the transfer is completed. \n\nNot sure if it should be is completed or has been completed. Also think it’s completed as in finished, not complete as in whole? Would love any help, thank you!",
        "created_utc": 1672159755,
        "upvote_ratio": 1.0
    },
    {
        "title": "Use of the word \"his/her/its\"",
        "author": "OrdinaryGrapefruit",
        "url": "https://www.reddit.com/r/grammar/comments/zwjyzi/use_of_the_word_hisherits/",
        "text": "\"Rachel's report card is a good representation of ***her*** intelligence and work ethic.\"\n\nIn the above example, is it okay to use the word \"her\" even though the subject of the sentence actually  isn't Rachel but Rachel's report card.",
        "created_utc": 1672159637,
        "upvote_ratio": 1.0
    },
    {
        "title": "What tense is this?",
        "author": "urassicpleb",
        "url": "https://www.reddit.com/r/grammar/comments/zwie0a/what_tense_is_this/",
        "text": "“Before we add the vegetables, we…”\n\nIs this just present tense?",
        "created_utc": 1672155441,
        "upvote_ratio": 1.0
    },
    {
        "title": "don't you or do you?",
        "author": "satorusthirst",
        "url": "https://www.reddit.com/r/grammar/comments/zwhzyv/dont_you_or_do_you/",
        "text": "I'm quite familiar with the rules of question tags. However, I got confused when I tried to use the frequency adverb \"never\".\n\nFor example:\n\n\"You never listen, don't you?\" \n\"You never listen, do you?\" \n\nThe sentence is in affirmative, but by adding \"never\" we gave it a negative meaning. So which one is it? \n\nIf the intention of said adverb is to give a negative meaning to an affirmative statement, then the question tag should be in affirmative, right?",
        "created_utc": 1672154443,
        "upvote_ratio": 1.0
    },
    {
        "title": "If a name ends in S and you want to make it possessive, do you use s's or s'",
        "author": "RusticBohemian",
        "url": "https://www.reddit.com/r/grammar/comments/zwhyc2/if_a_name_ends_in_s_and_you_want_to_make_it/",
        "text": "",
        "created_utc": 1672154332,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does \"hacking out\" mean?",
        "author": "EngLearnerAibek",
        "url": "https://www.reddit.com/r/grammar/comments/zwhgjz/what_does_hacking_out_mean/",
        "text": "His brother, William, known to most of the kids at Derry Elementary School (and even to the teachers, who would never have used the nickname to his face) as Stuttering Bill, was at home, **hacking out** the last of a nasty case of influenza.\n\nContext: Stephen King - It (Chapter 1) AFTER THE FLOOD (1957) \n\nA small boy in a yellow slicker and red galoshes ran cheerfully along beside the newspaper boat. The rain had not stopped, but it was finally slackening. It tapped on the yellow hood of the boy’s slicker, sounding to his ears like rain on a shed roof . . . a comfortable, almost cozy sound. The boy in the yellow slicker was George Denbrough. He was six. His brother, William, known to most of the kids at Derry Elementary School (and even to the teachers, who would never have used the nickname to his face) as Stuttering Bill, was at home, hacking out the last of a nasty case of influenza. In that autumn of 1957, eight months before the real horrors began and twenty-eight years before the final showdown, Stuttering Bill was ten years old.",
        "created_utc": 1672153058,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best way to learn English grammar?",
        "author": "HappySir8",
        "url": "https://www.reddit.com/r/grammar/comments/zwgwb1/what_is_the_best_way_to_learn_english_grammar/",
        "text": "",
        "created_utc": 1672151430,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does it feel? or How does it feels?",
        "author": "Psychological-Dirt35",
        "url": "https://www.reddit.com/r/grammar/comments/zwgw82/how_does_it_feel_or_how_does_it_feels/",
        "text": "",
        "created_utc": 1672151424,
        "upvote_ratio": 1.0
    },
    {
        "title": "discussion",
        "author": "H0eZ989",
        "url": "https://www.reddit.com/r/grammar/comments/zwgue7/discussion/",
        "text": "so me and my sister were arguing about if saying \"last post before year end\" is grammatically correct i think its more correct to say \" last post before THE year endS \" but my sister thinks otherwise",
        "created_utc": 1672151278,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was the King's English correct",
        "author": "ViKtorMeldrew",
        "url": "https://www.reddit.com/r/grammar/comments/zwe11j/was_the_kings_english_correct/",
        "text": "I'm reminded of the deeply touching letters, cards and messages which so many of you have sent my wife and myself, and I cannot thank you enough for the love and sympathy you have shown our whole family.\n\nIs 'myself' correct there?  We reckon it should be 'me'.  Someone sends a card to you but Charles can send a card to himself.",
        "created_utc": 1672142258,
        "upvote_ratio": 1.0
    },
    {
        "title": "which one is grammatically correct",
        "author": "lemonandkiwilime",
        "url": "https://www.reddit.com/r/grammar/comments/zwd3qq/which_one_is_grammatically_correct/",
        "text": "I procrastinate more\nI procrastinate more than you do\nI procrastinate more than you",
        "created_utc": 1672138843,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help me restructure this sentence",
        "author": "billythekid696",
        "url": "https://www.reddit.com/r/grammar/comments/zwbyd2/please_help_me_restructure_this_sentence/",
        "text": "I want to send me friend a message about someone who passed away but I can't think of the best way to phrase it.  This is what I have:\n\n\nI find it so remarkable how even though he was dealing with much more than most people, the support he offered his friends and family, was much more than most people.",
        "created_utc": 1672134335,
        "upvote_ratio": 1.0
    },
    {
        "title": "never had anything been as dear to me",
        "author": "immasitonthefloor",
        "url": "https://www.reddit.com/r/grammar/comments/zwa5oy/never_had_anything_been_as_dear_to_me/",
        "text": "does this sentence make sense? i want to say that “something” is the dearest i’d ever had",
        "created_utc": 1672127234,
        "upvote_ratio": 1.0
    },
    {
        "title": "You Snost, You Lost",
        "author": "WJROK",
        "url": "/r/whatstheword/comments/zw084s/wtw_for_or_literary_device_for_when_you_change/",
        "text": "",
        "created_utc": 1672126401,
        "upvote_ratio": 1.0
    },
    {
        "title": "The meaning of 'save'",
        "author": "Silly_Tangerine948",
        "url": "https://www.reddit.com/r/grammar/comments/zw9csx/the_meaning_of_save/",
        "text": "What does 'save' mean grammatically and semantically when used in such a way (from the first poem of The Esdaile Notebook by PB Shelley):\n\n\"Hushed below the battle's jar\nNight rests silent on the Heath,\nSilent save when vultures soar\nAbove the wounded warrior's death.\" ?",
        "created_utc": 1672124344,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would I add the question mark to this sentence?",
        "author": "ferretboi18",
        "url": "https://www.reddit.com/r/grammar/comments/zw89bc/how_would_i_add_the_question_mark_to_this_sentence/",
        "text": "“Do you want me to lock the door, because that’s what I normally do”. On the surface it would make sense to just add it at the end but when pronouncing the sentence, your voice adds it after “Do you want me to lock the door” and then “because that’s what I normally do” is an entirely different thought. So ultimately we have “Do you want me to lock the door? That’s what I normally do.” How would you add in the “because” and keep things grammatically correct?",
        "created_utc": 1672120686,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a slightly more elegant way of expressing mock concern.",
        "author": "randopop21",
        "url": "https://www.reddit.com/r/grammar/comments/zw6q42/looking_for_a_slightly_more_elegant_way_of/",
        "text": "I personally love \" Oh no. Anyway… \" but was hoping there's a slightly more sophisticated way to say it.  \n\nSomething you can use at, say, a posh cocktail party when someone tells you a boss that had been a bully to you had recently been fired.",
        "created_utc": 1672115813,
        "upvote_ratio": 1.0
    },
    {
        "title": "Working at the factory or in the factory?",
        "author": "Arnolf_Himmler",
        "url": "https://www.reddit.com/r/grammar/comments/zw3fg2/working_at_the_factory_or_in_the_factory/",
        "text": "[removed]",
        "created_utc": 1672106034,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the \"a\" necessary btw?",
        "author": "Arnolf_Himmler",
        "url": "https://www.reddit.com/r/grammar/comments/zvz2oi/is_the_a_necessary_btw/",
        "text": "[removed]",
        "created_utc": 1672094352,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why can \"I got it\" be used in the present tense?",
        "author": "LinguisticsTurtle",
        "url": "https://www.reddit.com/r/grammar/comments/zvya8g/why_can_i_got_it_be_used_in_the_present_tense/",
        "text": "You'd say: \"I bought something for you. I got it at the store a week ago.\" \n\nBut you'd say \"I got it\" if someone throws you something; you'd say that before the object is even in your hands. And if someone gives you an instruction then you'll say \"I got it\" and you're using it in a present-tense sense.",
        "created_utc": 1672092323,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this rule for adverbs of probability correct?",
        "author": "DecksDark628",
        "url": "https://www.reddit.com/r/grammar/comments/zvsz8u/is_this_rule_for_adverbs_of_probability_correct/",
        "text": "My book says that adverbs of probability come **after will**, but **before won't**. And while the examples they provide seem fine, it seems to me like there are a lot more positions that would be valid as well:\n\n* I **definitely** will be more respectful next time\n* She **probably** will get angry when she finds out\n* **Certainly** they will have finished by now, It's already been four hours.\n* I will **maybe** help you later if I feel like it\n* We won't have much time, **probably**\n* **Probably** he will be waiting for you at the door\n\nI'm aware some of these exceptions come from \"breaking the natural order of a sentence\", and would be more common while speaking, but even then, is there a rule for what positions would be acceptable and which would sound unnatural?",
        "created_utc": 1672078317,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quick sentence check. It has been driving me crazy.",
        "author": "Material_Cake_383",
        "url": "https://www.reddit.com/r/grammar/comments/zvqua2/quick_sentence_check_it_has_been_driving_me_crazy/",
        "text": "Which is correct if any?\n\n1. She writes notes to herself so she can remember the names of the trees.\n\n2. She writes notes for herself to remember the names of the trees.\n\n3. She writes herself notes to remember the names of the trees.\n\nI think 1 or 2.",
        "created_utc": 1672072449,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I start this sentence with my or me?",
        "author": "talan2",
        "url": "https://www.reddit.com/r/grammar/comments/zvpjsr/should_i_start_this_sentence_with_my_or_me/",
        "text": "Dan frowned at Sam and said, My/Me calling you out on your crap and telling you to stop blaming other people for your problems doesn't mean I'm heartless.\"",
        "created_utc": 1672068802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does this sentence read correctly?",
        "author": "AltmanFromAltworld",
        "url": "https://www.reddit.com/r/grammar/comments/zvp8p5/does_this_sentence_read_correctly/",
        "text": "'I vow to choose kindness, that of which expects no return'\n\nIn the sense of choosing to be kind to all, and not expecting any kindness in return.\n\nThanks.",
        "created_utc": 1672067880,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is \"on the streets stands not a single person\" correct?",
        "author": "Limp-Dinner-3287",
        "url": "https://www.reddit.com/r/grammar/comments/zvnn07/is_on_the_streets_stands_not_a_single_person/",
        "text": "A non-native English speaker here. I used this sentence in my composition exam and my teacher remarked that it's a wrong usage. I thought it's equivalent to \"not a single person stands on the streets\"? Am I using the sentence pattern incorrectly? Any help would be appreciated.",
        "created_utc": 1672062997,
        "upvote_ratio": 1.0
    },
    {
        "title": "„How’s my boy been though?“",
        "author": "VCA2",
        "url": "https://www.reddit.com/r/grammar/comments/zvnlqd/hows_my_boy_been_though/",
        "text": "Is that grammatically incorrect?\nCause I got roasted for that and then I tried to correct it with „how has been my boy“ I don’t know if I have been speaking proper English until now 😭",
        "created_utc": 1672062879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please check my email which I need to send the professor. Thank you :)",
        "author": "Advisor-Time",
        "url": "https://www.reddit.com/r/grammar/comments/zvn3il/please_check_my_email_which_i_need_to_send_the/",
        "text": "Dear Professor,   \n\n\nThank you for replying.  \n\n\nYes, professor, I am available whenever you think you can allocate time for the call. Yes, we can meet on 13th January. Thank you.   \n\n\nKind regards,  \n\n\nAX",
        "created_utc": 1672061196,
        "upvote_ratio": 1.0
    },
    {
        "title": "Position of \"even\" in this sentence.",
        "author": "wanegrit",
        "url": "https://www.reddit.com/r/grammar/comments/zvms9i/position_of_even_in_this_sentence/",
        "text": "I'm translating something into English, and one of the sentences I wrote was this:\n\n\"It was horribly damp, the wet coldness even wriggling its way in through a fur coat and causing shivers.\"\n\nDoes the way I use \"even\" here make sense? I think it does, but I got some feedback saying that it does not. What do you think?",
        "created_utc": 1672060086,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to punctuate a sentence to imply the flow of the speech?",
        "author": "Freak-1",
        "url": "https://www.reddit.com/r/grammar/comments/zvme8a/how_to_punctuate_a_sentence_to_imply_the_flow_of/",
        "text": "For example:\n\nThe best thing I could offer my country was building its basis [, /:/;] its children.",
        "created_utc": 1672058517,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the phrase \"I'm back\", what is back?",
        "author": "hkamist",
        "url": "https://www.reddit.com/r/grammar/comments/zvjypv/in_the_phrase_im_back_what_is_back/",
        "text": "My brother insists it's an adverb but I'm not quite sure.. what grammatical function does it serve in this case?",
        "created_utc": 1672048494,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any English words that don't mean anything when used by themselves?",
        "author": "Briacle",
        "url": "https://www.reddit.com/r/grammar/comments/zvhsju/are_there_any_english_words_that_dont_mean/",
        "text": "In other words, the word by itself in a vacuum is absolutely meaningless; only when used in conjunction with another word does the word actually have any meaning. I got the idea for this from a discussion on /r/ChineseLanguage about the word 葡萄, which means grape. However, those two words by themselves have no meaning, and are in fact some of the very few words in Chinese that mean nothing by themselves.\n\nI was wondering whether anything similar exists in the English language. I think \"immemorial\" kind of fits; you could say \"since time immemorial,\" but there's no such thing as the word \"immemorial\" by itself. It's never used outside the context of that fixed expression, so are there any other examples of words like this?",
        "created_utc": 1672039610,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does \"goes through\" mean?",
        "author": "EngLearnerAibek",
        "url": "https://www.reddit.com/r/grammar/comments/zvgbhn/what_does_goes_through_mean/",
        "text": "You really think someone who **goes through** 10 assistants a year and doesn't return her own children's phone calls would give a damn about the state of the American short story?\n\nContext: House, M.D. S05E17 **\\[00:00-02:25\\]** \n\n&amp;#x200B;\n\n\\- Am I going to have to give a speech? You're the publisher, can't you do it?\n\n\\- I can warm them up, but you're gonna have to get over this fear of public speaking before the book tour.\n\n\\- Everybody! Can I have your attention? Thank you. Tim has a few words to say. There you go, Tim. They're warmed up.\n\n\\- Well. What do you say at a time like this? Seriously, what do you say?\n\n\\- You could thank people for coming.\n\n\\- Thank you, Nick.\n\nActually, I'm always thanking Nick. A man famous not only for his ruthless editor's pen, but his patient hand-holding of crazy authors. You'd think that after three novels, I'd start to develop a little confidence, but...\n\n\\- For a book like this, we are happy to supply the confidence. Bestseller.\n\n\\- Well, that's not going to happen.\n\n\\- What?\n\n\\- Come on. Short stories don't make money. Short stories weren't making money back in 1908. You'd have to be mathematically illiterate to think they'd do as well as a novel.\n\n\\- Okay, Nick, let's step away from the champagne before somebody gets hurt.\n\n\\- You slaved over this book right next to me. Why would Northrop even publish it if it's only going to tank?\n\n\\- Have you failed to notice you're our star author? Obviously, Elaine wouldn't want to offend you.\n\n\\- Honey...\n\n\\- I'm sorry, I don't… I don't know why I said that.\n\n\\- He's joking. Nick knows as well as anyone what you have done is art.\n\n\\- So is folding paper into animal shapes, but you don't expect to make a living off it.\n\n\\- What the hell is wrong with you?\n\n\\- You really think someone who **goes through** 10 assistants a year and doesn't return her own children's phone calls would give a damn about the state of the American short story?\n\n\\- Please, be quiet.\n\n(SNIFFLES)\n\n\\- I think something's wrong.\n\nThat title was a mistake, too. People are going to compare you to Salinger. (CHUCKLING) And boy, are you going to come up short in that one.\n\n\\- (GASPS) Honey?\n\n\\- Call 911. Help! We need help!",
        "created_utc": 1672033812,
        "upvote_ratio": 1.0
    }
]