[
    {
        "title": "Dumb question about punctuating an independent clause + conjunction + sentence fragment",
        "author": "Octodab",
        "url": "https://www.reddit.com/r/grammar/comments/10luavw/dumb_question_about_punctuating_an_independent/",
        "text": "Having a brain fart today reddit. I have a probably dumb question. Do you need a comma before the conjunction in this type of sentence:\n\n\"He went to the store for eggs and milk but came home with beer instead.\"\n\nI want to say that the comma before the \"but\" is optional, but I can't remember for sure. The English major in me feels deep shame.\n\nThanks!",
        "created_utc": 1674746645,
        "upvote_ratio": 1.0
    },
    {
        "title": "Comma or no comma?",
        "author": "PaddysThong",
        "url": "https://www.reddit.com/r/grammar/comments/10lsxcc/comma_or_no_comma/",
        "text": "Hello! I’m just looking for some quick help on whether the phrase “love you bye” would be written out like that or “love you, bye” \n\nI’m not the brightest of the bunch so any simple answers would be very appreciated!",
        "created_utc": 1674743010,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hyphens use in list of phrases",
        "author": "Luckypomme",
        "url": "https://www.reddit.com/r/grammar/comments/10lr77w/hyphens_use_in_list_of_phrases/",
        "text": "What's the standard correct use here of hyphens to save repetition in a list? thanks for any advice you can offer!\n\n Children’s, Orthopaedic and Eye Hospitals\n\nChildren's-, Orthopaedic- and Eye Hospitals?\n\nI found the rule copied below but that seems to be for single bits of words, I'm not sure about a phrase like 'Children's Hospital'\n\n&amp;#x200B;\n\n**Using Hyphens in Lists** \n\nIf the second part of all the words in a list is the same, a hyphen  can be used to stand in for this part of the word in all the words  except the last one.\n\nFor example:\n\n&amp;#x200B;\n\n* two-, three-, or fourfold\n* uni-, bi-, and tricycles\n\n#",
        "created_utc": 1674737868,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m having a bit of trouble wrapping my brain around a double negative.",
        "author": "_KrustytheClown_",
        "url": "https://www.reddit.com/r/grammar/comments/10lpw0t/im_having_a_bit_of_trouble_wrapping_my_brain/",
        "text": "The sentence: “That’s not to say that Bigelow shys away from depicting women getting physically and psychologically brutalized. “\n\nI’m trying to express that Kathryn Bigelow (the director) isn’t afraid of depicting violence towards women in this movie. Do I have it correct? Or should it be “That’s not to say that Bigelow DOESN’T shy away from depicting…”",
        "created_utc": 1674733233,
        "upvote_ratio": 1.0
    },
    {
        "title": "the vs a",
        "author": "Westie_Bestie",
        "url": "https://www.reddit.com/r/grammar/comments/10lodfu/the_vs_a/",
        "text": "I am having problems with articles.Here are all the problems:\n\nShe stopped at THE supermarket to buy food.\n(why the and not a?)\n\nThe butter and cheese she bought were good.\n(why not the butter and THE cheese)\n\nThe glass and plate are mine.\n(same problem, why not the glass and THE plate)",
        "created_utc": 1674726983,
        "upvote_ratio": 1.0
    },
    {
        "title": "is this a dangling modifier? \"without a hint of irony in his voice I was left with no choice but to question my own understanding of the universe.\" or does the second pronoun disambiguate it?",
        "author": "dalibor_gursky",
        "url": "https://www.reddit.com/r/grammar/comments/10lnxrh/is_this_a_dangling_modifier_without_a_hint_of/",
        "text": "",
        "created_utc": 1674724962,
        "upvote_ratio": 1.0
    },
    {
        "title": "'s problem",
        "author": "Westie_Bestie",
        "url": "https://www.reddit.com/r/grammar/comments/10lnn74/s_problem/",
        "text": "The windows of the classroom.\nI thought to rewrite this as \"classroom's windows\", but apparently it's incorrect. Why?",
        "created_utc": 1674723627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interpretation Assistance",
        "author": "clumsyhuman643",
        "url": "https://www.reddit.com/r/grammar/comments/10ll7ed/interpretation_assistance/",
        "text": "Hello! So I work with Botox at my job and I was reading a source about it. The source says: “Toxins are detoxified in air within 12 hours\" which means that if you accidentally spilled Botox, it will most likely be gone within 12 hours from the moment you spilled it despite the possibility of Botox transferring to anywhere multiple times, right?",
        "created_utc": 1674713525,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I say a word before or after is?",
        "author": "AshtonYoutube9312",
        "url": "https://www.reddit.com/r/grammar/comments/10ljmie/should_i_say_a_word_before_or_after_is/",
        "text": "For example: \"Do you know what is sarcasm?\"\nor \"Do you know what sarcasm is?\"",
        "created_utc": 1674708016,
        "upvote_ratio": 0.99
    },
    {
        "title": "Questions on adverbial participles.",
        "author": "Conectiololo",
        "url": "https://www.reddit.com/r/grammar/comments/10livtw/questions_on_adverbial_participles/",
        "text": "&gt;I saw tens of rare animals (while) **living in Africa**  \nI learned many things **working my own store**\n\nThese participles would seem like they're adverbials. But I often see these type of sentences without  commas before the participles. If they're really adverbials shouldn't a comma be used like \"He ran incredibly fast, trying to escape from the monster\"  \nAnd how about the sentence \"He died trying\"",
        "created_utc": 1674705630,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this proper grammar",
        "author": "Big-Range-6255",
        "url": "https://www.reddit.com/r/grammar/comments/10lh1m8/is_this_proper_grammar/",
        "text": "If I said “I wish you’d died” would this count as proper grammar",
        "created_utc": 1674700055,
        "upvote_ratio": 1.0
    },
    {
        "title": "When showing possession with a word ending in s, would you write s' or s's? Ex: James' or James's, Seychelles' or Seychelles's, classics' or classics's",
        "author": "jempai",
        "url": "https://www.reddit.com/r/grammar/comments/10lgiyo/when_showing_possession_with_a_word_ending_in_s/",
        "text": "",
        "created_utc": 1674698536,
        "upvote_ratio": 1.0
    },
    {
        "title": "End of sentence: \"we\" or \"us\"?",
        "author": "taujenn",
        "url": "https://www.reddit.com/r/grammar/comments/10lfz2z/end_of_sentence_we_or_us/",
        "text": "My grammaritically-fanatical family and I had quite a debate over this tonight, and we're not sure who is in the right...\n\n&amp;#x200B;\n\nIn the sentence \"The boy is shorter than \\_\\_\\_.\", would the last word be \"us\" or \"we\"?  I was taught \"us\" as it's the objective pronoun of the verb \"is\", while my parents insist it would be \"we\", since they were taught to add an \"are\" to the end of a setence like that (The boy is shorter than we are).  I'm pretty sure by adding that, they're changing the objective to a subjective (us connects to is, now we connects to are), which changes the sentence entirely.\n\n&amp;#x200B;\n\nHELP!",
        "created_utc": 1674696955,
        "upvote_ratio": 1.0
    },
    {
        "title": "Small-time or small time",
        "author": "Equivalent_Package56",
        "url": "https://www.reddit.com/r/grammar/comments/10lfbex/smalltime_or_small_time/",
        "text": "When reporting an error to the IT team, please provide a (small-time/small time) range in which it occurred.",
        "created_utc": 1674695071,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you call a husband who is loving and a good provider but is just nottoo showy or sweet or good with surprises?",
        "author": "Sunnyppies",
        "url": "https://www.reddit.com/r/grammar/comments/10lfaxq/what_do_you_call_a_husband_who_is_loving_and_a/",
        "text": "I couldnt point out the exact word for my dad. He is loving to my mom, a hood providee. He is not just showy or not comfortable with it. Not th e \"surprise sweet type\". But he does sometime but just subtle and that grand and showy",
        "created_utc": 1674695033,
        "upvote_ratio": 1.0
    },
    {
        "title": "Function of noun phrase",
        "author": "FiggyBoy999",
        "url": "https://www.reddit.com/r/grammar/comments/10lex88/function_of_noun_phrase/",
        "text": "After he had killed everyone - men, women, and children - Killy felt nothing but regret. “men, woman, and children” is a noun phrase but what function does it serve? Is it a direct object, and indirect object, a subject, or something else?",
        "created_utc": 1674693964,
        "upvote_ratio": 1.0
    },
    {
        "title": "Appositive vs Adverbial",
        "author": "FiggyBoy999",
        "url": "https://www.reddit.com/r/grammar/comments/10les6e/appositive_vs_adverbial/",
        "text": "In “He looked like a cat” is “like a cat” an adverbial phrase modifying “looked” or an appositive phrase modifying “He”?",
        "created_utc": 1674693572,
        "upvote_ratio": 1.0
    },
    {
        "title": "“A” vs “An” in a very specific usage…I’m so embarrassed that I have to come to Reddit for help",
        "author": "nxxptune",
        "url": "https://www.reddit.com/r/grammar/comments/10ld3bm/a_vs_an_in_a_very_specific_usageim_so_embarrassed/",
        "text": "I pride myself on my above-average writing, grammar, reading, and vocabulary skills. I’ve always been the best in my classes with these topics I never thought I’d be on the grammar subreddit asking for something as simple as the “a vs an” rule, but here I am. Man, I feel really stupid..\n\nAnyway, now to actually ask the question after saying all that to prevent anyone thinking I’m dumb:\n\nThe sentence I’m writing in a research essay about mental health and friendships is “…this should not get in the way of a otherwise fulfilling friendship…” and the sentence goes on, but I keep second guessing myself if I should be saying “a otherwise” or “an otherwise”. I’ve said both aloud and when I did that “an otherwise” sounded more correct, but seeing “an otherwise” typed out or written on paper looks very wrong to me so I can’t figure it out. I know that “a” vs “an” isn’t a set rule because if it starts with a vowel but sounds like a consonant then you use “a” despite the rule and vise-versa…but I can’t figure this specific usage out after an hour of trying both. \n\nI’d really appreciate if someone told me which is the correct usage. I really don’t want to get a point off just because I keep psyching myself out.",
        "created_utc": 1674689106,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having a small discussion over evacuate. Which is preferred, evacuating a building, or evacuating people from a building. My opponent in this debate stipulates evacuating people means the removal of waste matter from the person.",
        "author": "circular_file",
        "url": "https://www.reddit.com/r/grammar/comments/10lb3ze/having_a_small_discussion_over_evacuate_which_is/",
        "text": "They used an excellent clip from 'The Wire' as an illustration of usage.  \nhttps://www.youtube.com/watch?app=desktop&amp;v=h5d82ndui_s",
        "created_utc": 1674684157,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which word is the noun in this sentence:",
        "author": "ThePricelessOne",
        "url": "https://www.reddit.com/r/grammar/comments/10la702/which_word_is_the_noun_in_this_sentence/",
        "text": "The people have faith that they are always right.",
        "created_utc": 1674681920,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it correct to use contraction the way Eminem does?",
        "author": "farhadsalimi",
        "url": "https://www.reddit.com/r/grammar/comments/10l7wrz/is_it_correct_to_use_contraction_the_way_eminem/",
        "text": "Hey there!  \nI was listening \"Jimmy, Brian and Mike\" and noticed something a bit weird to me who English isn't his mother tongue and that was when Marshall said:  \n\n\n&gt;I told him not to lift when he sniffs, **he don't listen.**\n\n  \nI have also heard few American friends of mine talk same way. I wanted to know if it sounds weird or it's kinda Street-type of speech(?).",
        "created_utc": 1674676410,
        "upvote_ratio": 1.0
    },
    {
        "title": "Between or During Year x - Year Y?",
        "author": "tjeerdje",
        "url": "https://www.reddit.com/r/grammar/comments/10l4sme/between_or_during_year_x_year_y/",
        "text": "My boss keeps correcting passages where I state, for example:  \n\n\n'This line was produced between 2018–2021'   \n\n\n... and she changes it to : \"'This line was produced during 2018–2021'   \n\n\nTo me this sounds weird. I tried googling for the answer but could not find it.  \nIf there is a correct answer, a reliable source would be highly appreciated!",
        "created_utc": 1674669153,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this a compound sentence?",
        "author": "ghostmosquito",
        "url": "https://www.reddit.com/r/grammar/comments/10l3cvn/is_this_a_compound_sentence/",
        "text": "Consider the following sentence:\n\nWalk quickly, else you will not overtake him.\n\nNow I understand that this sentence has two independent clauses, but are they co-ordinate clauses as well? Structurally they do not seem to carry the same \"weight\". Also, the sentence seems to be an exception to the FANBOYS rule (Compund sentences must be joined by For, And, Nor, But, Yet, So). \n\nThoughts?",
        "created_utc": 1674665693,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would/should you capitalise both words in \"American English\"? And \"French Canadian\"",
        "author": "DeutschEnglish12345",
        "url": "https://www.reddit.com/r/grammar/comments/10l2ptl/wouldshould_you_capitalise_both_words_in_american/",
        "text": "",
        "created_utc": 1674664104,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does “go fast” in this passage mean?",
        "author": "Fatandumb-7125",
        "url": "https://www.reddit.com/r/grammar/comments/10l0o5m/what_does_go_fast_in_this_passage_mean/",
        "text": "No one has taken over my lease yet. But it was still July and I expected the place to go fast closer to the start of the semester.",
        "created_utc": 1674659019,
        "upvote_ratio": 1.0
    },
    {
        "title": "More spelling than grammar; but why is there no second h in threshold?",
        "author": "paxdei_42",
        "url": "https://www.reddit.com/r/grammar/comments/10kz643/more_spelling_than_grammar_but_why_is_there_no/",
        "text": "",
        "created_utc": 1674654980,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where are the errors? Tell me where you see them, and I'll tell you my tutor's outrageous response to what I selected! I've already submitted this, so not cheating! Ha",
        "author": "mrspea84",
        "url": "https://www.reddit.com/r/grammar/comments/10kyj4z/where_are_the_errors_tell_me_where_you_see_them/",
        "text": "&amp;#x200B;\n\n \n\n#### \"Edit the text below.\n\n**Add or remove apostrophes** where appropriate. There are **3** **errors** to be corrected. \n\nI peered out the window at the lengthening shadows of the trees. We'd been on the road for six hours, but it felt like sixty given the appalling surface. I was now worried that we wouldnt arrive before nightfall, and my fears weren't helped by the drivers eccentric behaviour. Although it was dark, he still hadn’t turned the vans lights on.  \n\n\nThrough my translator, I enquired why, yet I immediately wished I hadn't. There weren’t any.  \n\n\nFearing that we might all have to spend a night in the jungle, I ventured another question beloved of children everywhere. “Are we nearly there yet?” Just one more hour was the reply.  \n\n\nI checked my watch. Sunset was in 10 minutes. Fifty minutes on an unmade trail at 40 miles per hour. In the jungle. In the dark. Just great. \"",
        "created_utc": 1674653032,
        "upvote_ratio": 1.0
    },
    {
        "title": "The NBA but not the NAFTA?",
        "author": "publish_my_papers",
        "url": "https://www.reddit.com/r/grammar/comments/10kyfpg/the_nba_but_not_the_nafta/",
        "text": "Knowing some languages, I am fully aware how irregular a language could be and English, thankfully, believe it or not, is one of the more regularized languages. Nevertheless, I still don't understand the use of articles.\n\nThe NBA vs. the NAFTA.\n\nSome sources say THE NAFTA, such as Wikipedia. I have seen many credible sources that do not. The NYT - btw \"the\" here as well - arguably one of the most rigorously edited newspapers publishes articles that say things like the following:\n\n\"Mr. Trump has criticized Nafta\"     \nor  \n\"Over the past quarter century, Nafta has reshaped the United States economy\"\n\nBut I have never seen someone say the NBA without the \"the\".\n\nThere are many cases like this such as organization names, or American history vs. the American government, and many more. Does anyone have any systematic approach to this?",
        "created_utc": 1674652731,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can i say “you had better to go to university ”",
        "author": "RayRay222009",
        "url": "https://www.reddit.com/r/grammar/comments/10kx5z3/can_i_say_you_had_better_to_go_to_university/",
        "text": "",
        "created_utc": 1674648506,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the difference between these two sentences?",
        "author": "phileotus",
        "url": "https://www.reddit.com/r/grammar/comments/10kx5wl/whats_the_difference_between_these_two_sentences/",
        "text": "They believed what all men had to do for their families was work overtime.  \n\nvs.\n\nThey believed all men had to do for their families was work overtime.",
        "created_utc": 1674648500,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is “insanely chill” an oxymoron?",
        "author": "AbeLincolnMixtape",
        "url": "https://www.reddit.com/r/grammar/comments/10kwxv1/is_insanely_chill_an_oxymoron/",
        "text": "Or is “insanely” a fair modifier?",
        "created_utc": 1674647732,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to know when a subordinating clause ends?",
        "author": "De_fau_lt",
        "url": "https://www.reddit.com/r/grammar/comments/10kw5lu/how_to_know_when_a_subordinating_clause_ends/",
        "text": "Hi, when you look at the rules for a independent clause, you can get a good idea when it ends. For example, a independent clause must have a subject, verb, and a complete thought. However, a dependent clause does not have to be a complete thought. This is were I am lost. I will now give an example below and an explanation for the confusion.\n\nExample:\n\nSteve went to the ball since it was nice, and Steve admired nice things.\n\nConfusion:\n\n“Since it was nice” is the subordinating clause. How do I know when it ends and the next independent clause starts?\n\nDo I know because the coordinating conjunction “and” is a sign that the dependent clause has ended?\n\nWhat if there is no coordinating conjunction to indicate the end of a subordinating clause?",
        "created_utc": 1674644704,
        "upvote_ratio": 1.0
    },
    {
        "title": "LET US LEARN SENTENCE PATTERN - SUBJECT",
        "author": "Podcasterselvi",
        "url": "https://www.reddit.com/r/grammar/comments/10ku8ee/let_us_learn_sentence_pattern_subject/",
        "text": "  \n\n**Sentence**\n\n**A sentence is a group of words that expresses a complete idea. It contains a subject (S) and a verb (V).** \n\n**The Basic Elements of a Sentence**\n\n**A sentence has two basic elements: the subject and the predicate. The subject is a noun, a pronoun, or a group of words acting as a noun. It is what the entire sentence is about. The predicate contains a verb that describes the subject.** \n\n**Subject**\n\n**The subject is a noun, noun phrases, or pronoun. Usually, it comes before the main verb. It represents the person or thing about which something is stated.**\n\n**Predicate**\n\n**Predicate can either describe an action that the subject is performing, or a state of being that the subject is experiencing.**\n\n**Examples**\n\n**1.** **He/ runs**\n\n**2.** **This book/ is heavy**\n\n**3.** **I and my friend/ went to the market**\n\n**4.** **My dog/ may bite strangers**\n\n**5.** **Venus/ is the hottest planet in the solar system** \n\n**Subject-verb agreement means using the right version of the verb to agree with the subject.** \n\n**Thanks for listening. Please subscribe, like and share the link to students. You can download for listening again and again.**\n\n**All of my episodes are available in https://www.buzzsprout.com/2107418/**\n\n**https://anchor.fm/selviraveendran**\n\n**You tube link** \n\n**https://www.youtube.com/channel/UCxqnQfBAeJQO4O\\_55T\\_N1CQ**\n\n**BLOG LINK https://podcasterselvi.blogspot.com/**",
        "created_utc": 1674636616,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the metaphorical use of the word payday?",
        "author": "Life_passenger_x",
        "url": "https://www.reddit.com/r/grammar/comments/10ku38b/what_is_the_metaphorical_use_of_the_word_payday/",
        "text": "Thanks for your help",
        "created_utc": 1674635994,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does every piece of dialogue have to have a “said x” after it, or can you cut that out once the speakers have been established?",
        "author": "Skating_N_Music_Dude",
        "url": "https://www.reddit.com/r/grammar/comments/10kqxt6/does_every_piece_of_dialogue_have_to_have_a_said/",
        "text": "",
        "created_utc": 1674623942,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does every piece of dialogue have to have a “said x” after it, or is that only necessary when you introduce a speaker? (Example included.)",
        "author": "Skating_N_Music_Dude",
        "url": "https://www.reddit.com/r/grammar/comments/10kqwhf/does_every_piece_of_dialogue_have_to_have_a_said/",
        "text": "I’m trying to improve my grammar and punctuation, and I want to know if this basic little practice dialogue is written correctly. It might be better to ask, if it is written correctly, if it is necessary to end each sentence this way, or if it’s better to cut out the back-and-forth once the known speakers are established? Here’s the example:\n\n“Guess what,” said Julia.\n“What?” replied Matthew impatiently.\n(***I was thinking I could cut it here***)\n“I know something you don’t know!” Julia taunted.\n“Julia, will you please go away?” Matthew pleaded. “You’ve been bothering me for over an hour, and I’ve got a lot of work to do. Can’t you go somewhere else?”\n“But Matthew, there’s no one else to annoy,” responded Julia.\n“What about Bob?” Matthew put forward.\n“Bob is weird Matthew!” answered Julia with a shift in her tone.\n“Then he’s perfect for you!” Matthew exclaimed.\n“Did someone call for me?” Bob said as he entered the room.",
        "created_utc": 1674623813,
        "upvote_ratio": 1.0
    },
    {
        "title": "Calling a thirty years old man “a big teen”",
        "author": "Life_passenger_x",
        "url": "https://www.reddit.com/r/grammar/comments/10kqgiv/calling_a_thirty_years_old_man_a_big_teen/",
        "text": "Cause he is dressing and acting like a teenager, is this correct in the familiar English?",
        "created_utc": 1674622359,
        "upvote_ratio": 1.0
    },
    {
        "title": ", or ;? Any other improvements to the statement? Thank you!",
        "author": "Salty_Pineapples_",
        "url": "https://www.reddit.com/r/grammar/comments/10kng6e/or_any_other_improvements_to_the_statement_thank/",
        "text": "It'd be good to view it at some point as I've only briefly seen inside it once, about six years ago when me and my mum popped around. I'm happy to help you out with it as well, regardless of whether or not I buy it.",
        "created_utc": 1674613138,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Do I Say…",
        "author": "FireflyAdvocate",
        "url": "https://www.reddit.com/r/grammar/comments/10kn8l9/how_do_i_say/",
        "text": "If I used an electronic hand-held machine to dry my hair yesterday how do I say that with proper grammar?\n\nIs it weird to say “I blew-dried my hair yesterday?”  What are less abrasive sounding alternatives?",
        "created_utc": 1674612523,
        "upvote_ratio": 1.0
    },
    {
        "title": "FREE EBOOK /The Gregg Reference Manual: A Manual of Style, Grammar, Usage, and Formatting",
        "author": "Infamous_Custard7113",
        "url": "https://www.reddit.com/r/grammar/comments/10kmtms/free_ebook_the_gregg_reference_manual_a_manual_of/",
        "text": "[removed]",
        "created_utc": 1674611347,
        "upvote_ratio": 1.0
    },
    {
        "title": "what happened with the \"the\"?",
        "author": "igorflorentino",
        "url": "https://www.reddit.com/r/grammar/comments/10kmb1n/what_happened_with_the_the/",
        "text": "I just saw this phrase in a movie\n\n\\- you're the only one who sees the world same way I do\n\nIs itn't supposed to have a \"the\" before \"same\"?\n\nI'm think that it's not wrong because it was in a big movie that usually have a team to review the grammar",
        "created_utc": 1674609865,
        "upvote_ratio": 1.0
    },
    {
        "title": "question about the use of \"as\"",
        "author": "igorflorentino",
        "url": "https://www.reddit.com/r/grammar/comments/10klwcg/question_about_the_use_of_as/",
        "text": "are there differences in meaning between these two phrases?\n\nyou're the only one who sees the world the same way I do \n\nyou're the only one who sees the world the same way as I do",
        "created_utc": 1674608700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help regarding the following statement",
        "author": "Southern-Implement12",
        "url": "https://www.reddit.com/r/grammar/comments/10kko47/help_regarding_the_following_statement/",
        "text": "The statement:\n\nM is the second to the right of Q, who is at one of the ends.\n\nQuestion:\n\nIs it M that is at one of the ends or is it Q?",
        "created_utc": 1674605334,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me with this pharaise please.",
        "author": "Fred_iz",
        "url": "https://www.reddit.com/r/grammar/comments/10kjnp1/help_me_with_this_pharaise_please/",
        "text": "Hi all, \n\nI want to ask my students to write their responses based on the priority from the most important to the least important. What is the best way to put it in a question.\n\nMy original question is\n\ne.g. What are the 5 MAIN reasons for **delay in projects**? Write based on their priority.",
        "created_utc": 1674602713,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is \"wonderstricken\" a real word?",
        "author": "aspareaccounts",
        "url": "https://www.reddit.com/r/grammar/comments/10kik3e/is_wonderstricken_a_real_word/",
        "text": "I'm wondering because I see it occasionally but most people use \"wonderstruck.\"",
        "created_utc": 1674599968,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this correct?",
        "author": "Somseaco",
        "url": "https://www.reddit.com/r/grammar/comments/10kfnwu/is_this_correct/",
        "text": "My mom wished herself a tattoo in english but I can't let her have it until I know this sentence is entirely correct.\n\"Only angels that fly alone have the strongest wings.\"\nShe's talking about those in heaven, so shouldn't it be \"Only the angels...\"? Also, not \"that\" but \"who\"?",
        "created_utc": 1674592962,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help!",
        "author": "Agc_1623",
        "url": "https://www.reddit.com/r/grammar/comments/10kfh0p/help/",
        "text": "I’m making an ad for a seafood section.\nIs it “Seafood Lovers” or \n“Seafood Lover’s”",
        "created_utc": 1674592503,
        "upvote_ratio": 1.0
    },
    {
        "title": "I left you a message",
        "author": "Sparkmane",
        "url": "https://www.reddit.com/r/grammar/comments/10kbzw7/i_left_you_a_message/",
        "text": "I use this phrase a lot, and it always sounds incorrect. 'I left you a message.' 'I left a message on his machine.' Is this correct, or would a human being phrase it differently?",
        "created_utc": 1674584109,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help in explaining?",
        "author": "TheGodpapi",
        "url": "https://www.reddit.com/r/grammar/comments/10k9e57/help_in_explaining/",
        "text": "Can you explain to me why “a cheap taste” is wrong? Thank you!",
        "created_utc": 1674577681,
        "upvote_ratio": 1.0
    },
    {
        "title": "Verbiage",
        "author": "kittydreadful",
        "url": "https://www.reddit.com/r/grammar/comments/10k97xg/verbiage/",
        "text": "Unless I’m mistaken, this is a noun.  It means ‘nonsense’.  \n\nWhy does it get trotted out in corporate speak to mean ‘wording’?",
        "created_utc": 1674577238,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Hands of time” capitalization.",
        "author": "onlythebestboys",
        "url": "https://www.reddit.com/r/grammar/comments/10k8lm8/hands_of_time_capitalization/",
        "text": "If we write “I wish I could control the hands of time.” Should we capitalize “Time” since it is being personified/anthropomorphized?",
        "created_utc": 1674575643,
        "upvote_ratio": 1.0
    },
    {
        "title": "Helping friend with resume",
        "author": "the_greatdisaster",
        "url": "https://www.reddit.com/r/grammar/comments/10k6hy9/helping_friend_with_resume/",
        "text": "Can someone look at this job description and see if they can find any errors and to shorten it as well :( Thanks so much\n\nAnimal Caretaker -\n\nResponsible for the care and husbandry of a wide variety of species such as sheep, pigs, rats, mice, frogs, dogs, etc. This includes the handling of animals and the ability to transfer them to other enclosures providing food and water. Other responsibilities include sexing and identifying animals and closely observing for any abnormalities or health conditions. Performs a weekly animal sensor. Participation in continuous training sessions is necessary to always stay up to date and meet the standard of the facility.\n\nAssess and cage wash to sterilize and disinfect all animal materials all while following standard operating procedures maintaining the animal morgue. Monitoring the animal room and environmental conditions is recorded daily. Autoclaving out hazardous materials and breaking down rooms monthly\n\nInteracting with investigators co-workers and vets is extremely crucial.",
        "created_utc": 1674569901,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are the clauses of this sentence coherent? :Baring it's jagged, pointed teeth, not even a single mouse dared to come near this creature",
        "author": "Striking_Tell0804",
        "url": "https://www.reddit.com/r/grammar/comments/10k5jf1/are_the_clauses_of_this_sentence_coherent_baring/",
        "text": "",
        "created_utc": 1674567078,
        "upvote_ratio": 1.0
    },
    {
        "title": "question about parts of speech",
        "author": "igorflorentino",
        "url": "https://www.reddit.com/r/grammar/comments/10k5huc/question_about_parts_of_speech/",
        "text": "**Hello, could you please help me with a grammar question?**  \n\n**in the phrase: - we'd be talking about the most tectonic shift in the status quo**  \n\n**\"tectonic shift\" is a verb or just \"shift\" is the verb?** \n\n **also \"tectonic\" is a subject?**\n\n**it's look like a adjverb since the main function is to express the size of the shift**  \n\n**I'm in doubt if the part \"the most tectonic shift\" is made of** \n\n**- the\\[article\\] most\\[adjetive\\] tectonic\\[subject\\] shift\\[verb\\]** \n\n **or its** \n\n **- the\\[article\\] most\\[adjetive\\] tectonic\\[adverb\\] shift\\[verb\\]**  \n\n**I'm a portuguese speaker**",
        "created_utc": 1674566956,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me understand the difference between past and passed",
        "author": "Dudesonthedude",
        "url": "https://www.reddit.com/r/grammar/comments/10k5b5u/help_me_understand_the_difference_between_past/",
        "text": "I think I understand the mechanics of both words pretty well but here's something I cannot wrap my head around \n\nIf I'm talking about the time, and I say quarter past 5, this is the correct usage of the word past\n\nBut logically to me this should be passed. Its 15 minutes passed the hour of 5, we're not talking about the past we're talking about the position of the big hand on a clock, or how long passed the hour it is \n\nI get this wrong every time and now I'm starting to remember the rule, the less sense it's making to me",
        "created_utc": 1674566397,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me choose between these two recommendations?",
        "author": "Infinite_Abalone9499",
        "url": "https://www.reddit.com/r/grammar/comments/10k2dxq/help_me_choose_between_these_two_recommendations/",
        "text": "***1- A Student's Introduction to English Grammar*** (2007)  \nRodney Huddleston &amp; Geoffrey K. Pullum  \n\n***2- High School English Grammar and Composition***\n\nBook by H. Martin and P. C. Wren",
        "created_utc": 1674555664,
        "upvote_ratio": 1.0
    },
    {
        "title": "'He is EU's laughing stock' or 'He is the EU's laughing stock'?",
        "author": "your-wurst-nightmare",
        "url": "https://www.reddit.com/r/grammar/comments/10jzn95/he_is_eus_laughing_stock_or_he_is_the_eus/",
        "text": "The same goes for 'He is the UK's greatest ally' or 'He is UK's greatest ally'. I think I'm gravitating towards 'the' in the EU example, but no 'the' in the UK example for some reason.\n\nJust found myself pondering about this for a minute and I'm still not sure which one's correct. Google yields plenty of results for both of these.",
        "created_utc": 1674543674,
        "upvote_ratio": 1.0
    },
    {
        "title": "'He is EU's laughing stock' or 'He is the EU's laughing stock'?",
        "author": "kindaboiledegg",
        "url": "https://www.reddit.com/r/grammar/comments/10jzmrx/he_is_eus_laughing_stock_or_he_is_the_eus/",
        "text": "The same goes for 'He is the UK's greatest ally' or 'He is UK's greatest ally'. I think I'm gravitating towards 'the' in the EU example, but no 'the' in the UK example for some reason.\n\nJust found myself pondering about this for a minute and I'm still not sure which one's correct. Google yields plenty of results for both of these.",
        "created_utc": 1674543623,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the correct way to write this slogan / tag line?",
        "author": "stephenmatt",
        "url": "https://www.reddit.com/r/grammar/comments/10jx9qz/whats_the_correct_way_to_write_this_slogan_tag/",
        "text": "Me and a business partner are trying to figure out the grammatically correct way to put this statement.\n\nA company built on honesty, quality, and innovation. Just to be Clear.\n\nA company built on honesty, quality, and innovation: Just so we’re Clear.\n\nA company built on honesty, quality, and innovation, just to be Clear.\n\nAnyone know?",
        "created_utc": 1674535101,
        "upvote_ratio": 1.0
    },
    {
        "title": "In “I heard a loud crash” why is “a loud crash” a noun phrase rather than an adverb phrase? Doesn’t it describe what I heard, therefore modifying the verb?",
        "author": "PeePeeCumuuu",
        "url": "https://www.reddit.com/r/grammar/comments/10jw9bt/in_i_heard_a_loud_crash_why_is_a_loud_crash_a/",
        "text": "[removed]",
        "created_utc": 1674531778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did I use i.e. the correct way?",
        "author": "MRPENNYMISER",
        "url": "https://www.reddit.com/r/grammar/comments/10jw7ma/did_i_use_ie_the_correct_way/",
        "text": "What I wrote:  \"A nation state is when the state shares its border with a nation, i.e. there is only one nation within the state.\"\n\n(for Human Geography AP)\n\nIf I'm not mistaken, i.e. is used to somewhat clarify what you're saying by explaining it in different terms.",
        "created_utc": 1674531624,
        "upvote_ratio": 1.0
    },
    {
        "title": "She quit last year. Only now do I see how much we took her for granted.",
        "author": "Life_passenger_x",
        "url": "https://www.reddit.com/r/grammar/comments/10jw0d8/she_quit_last_year_only_now_do_i_see_how_much_we/",
        "text": "I’m learning English and i found this phrase on an grammar test application \nBut i doesn’t sound correct to my ear \nCan anybody explain please",
        "created_utc": 1674531006,
        "upvote_ratio": 1.0
    },
    {
        "title": "as a foreigner I want to use these words properly : nonetheless, nevertheless and notwithstanding. I'm confused and not sure how to use them and or differences.",
        "author": "Crisbel86",
        "url": "https://www.reddit.com/r/grammar/comments/10jul7w/as_a_foreigner_i_want_to_use_these_words_properly/",
        "text": "",
        "created_utc": 1674526664,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are skorts singular or plural? Seems kind of awkward either way",
        "author": "amedicalprofessional",
        "url": "https://www.reddit.com/r/grammar/comments/10ju6a1/are_skorts_singular_or_plural_seems_kind_of/",
        "text": "Short = pair of shorts\n\nskirt = a skirt\n\nskort= ?????",
        "created_utc": 1674525444,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"We examined the correlation between A and B and C\" - how do I phrase it so that it's not confusing to read? B &amp; C are supposed to be grouped.",
        "author": "spaceshlp",
        "url": "https://www.reddit.com/r/grammar/comments/10jtbam/we_examined_the_correlation_between_a_and_b_and_c/",
        "text": "If I write 3 and's in a sentence, it may look like I'm looking at the correlation between A and B, and B and c, and A and C. \n\nI'm looking at the correlation between A and B, and A and C. \n\nHow can I phrase it so that this is clearly conveyed? Can I use a comma after A to convey this like so: 'A, and B and C'?",
        "created_utc": 1674522898,
        "upvote_ratio": 1.0
    },
    {
        "title": "Company Slogan - Need Help!",
        "author": "stephenmatt",
        "url": "https://www.reddit.com/r/grammar/comments/10jt2yr/company_slogan_need_help/",
        "text": "I am looking to see if this statement is grammatically correct. Our company has the name Clear in it so I want to know. Should Clear we capitalized and is the comma in the right spot.\n\nThank you.\n\nA company built on quality, honesty, and innovation, just so we’re Clear.",
        "created_utc": 1674522235,
        "upvote_ratio": 1.0
    },
    {
        "title": "“In my opinion, it’s a fact.” Proper English or not?",
        "author": "TomorrowLazy",
        "url": "https://www.reddit.com/r/grammar/comments/10jsyfq/in_my_opinion_its_a_fact_proper_english_or_not/",
        "text": "Just for some background I’ll use it in a sentence similar to where I seen it: \n\n“I think that (x) would help (y) based off of things I’ve witnessed. What do you think? In my own opinion, it’s a fact.”\n\nI know that the beginning of the sentence above could have an impact on whether what I’m asking is true or not (I.e. if one thought (x) would help (y) and it were based off scientific research - then technically speaking, wouldn’t saying “in my opinion, it’s a fact” make sense [even if it’s not needed] since it’s subjective?). \n\nMy overall question is: \n\nIf one were to include that specific part of the sentence into a larger one would it be improper English? Because yes, an opinion is not a fact. But, if someone has an opinion that a fact is true (even if it’s not), then isn’t it a fact that they have that opinion? Or, does the rule of “no opinion can be a fact (and vice versa)” apply, no matter what? \n\nTo further my question: \nIf someone were to say “I don’t think this person did (x)” and a different person says “This person did not do (x) because of (y)”. The first person is saying something based off opinion, the second being a fact backed by evidence. \nDoes this example veto my question? Since any sentence with “I/my” becomes opinionated, or is the sentence in the title of this post an exception? \n\nBy no means am I an expert on the English language, I just find this very interesting and I may be illiterate and overthinking, with this being a simple answer- but either way, I’m intrigued to see what people say. \n\nThanks in advance!",
        "created_utc": 1674521911,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grammar ambiguity",
        "author": "HumanoidPizza",
        "url": "https://www.reddit.com/r/grammar/comments/10jsj4w/grammar_ambiguity/",
        "text": "If I was to say “thoughts on Apple and Microsoft merging” that could imply that such a merger has happened. Or it could simply be asking thoughts on the idea of it. Of course the ambiguity could be avoided by rephrasing the question, but is there a name for this ambiguity?\n\nAnother example:\n\nIf I asked “thoughts on Elon Musk’s purchase of twitter” before the purchase actually happened, then this would be more confusing. Is there a term for using “purchase of twitter” as a potential concept rather than an actual past occurrence?\n\nAdditional question:\n\nWhat part of speech does thoughts take in those sentences? In a sentence that just says “thoughts on butter” what part of speech it thoughts?",
        "created_utc": 1674520685,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I use etc. after a list of questions?",
        "author": "Internal-Place-1793",
        "url": "https://www.reddit.com/r/grammar/comments/10jrs1b/how_do_i_use_etc_after_a_list_of_questions/",
        "text": "I am writing an essay and need some clarification on how to use etc. after a list of quesitons. How do I punctuate and capitalize it? Also, is the hyphen used correctly?\n\nhere's my sentence:\n\n I would start by meeting to identify the goals they want for their child, and determine what is most important to them – do they seek help with daily routines? The child’s Social skills? Transition strategies to PreK? Etc.  \n\n&amp;#x200B;\n\nThank you!",
        "created_utc": 1674518576,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a term for this?",
        "author": "Amazing_Lemon6783",
        "url": "https://www.reddit.com/r/grammar/comments/10jrroz/is_there_a_term_for_this/",
        "text": "Is there a grammatical term for redundant phrases like \"infinitesimally small\" or \"massively huge\"?",
        "created_utc": 1674518549,
        "upvote_ratio": 1.0
    },
    {
        "title": "ENGLISH: PAST SIMPLE + GERUNDIVE/INFINITIVE? What´s the difference and how do you determine which is the correct use/why?",
        "author": "Pedro_pikaPiedra",
        "url": "https://www.reddit.com/r/grammar/comments/10jq4t9/english_past_simple_gerundiveinfinitive_whats_the/",
        "text": "Hello all\n\nI was marking a student´s work with them (levelA2) and struggled to explain the following:\n\nWHEN I FINISHED EATING (Not when I finished to eat) vs I STARTED TO STUDY\n\n\\- \"When I finished to eat\" doesn´t sound right and I corrected this to \"When I finished eating\" however later on we cam across \"I started to study\" which I left uncorrected. My student noticed this and answered why it wouldn´t be \"I started studying\". I decided that \"I started to study\" sounded better but I´m unsure why this is the case.....might you be able to explain why??\n\nThis is my student´s text in its entirety (with corrections in CAPITALS):\n\n \"Yesterday I woke up at 12:00 o’clock. After I had breakfast. I always eat two SLICES OF toast and my coffee with milk. When I finished (/T/) EATING, I started /ID/ to clean my house BECAUSE It was very dirty. Then I ate a salad and took a shower. At 16:00 p.m I started /ID/ to study until 20:00 p.m. I was very tired, so I made my dinner, had dinner and watched /T/ my favourite series. I wasn’t very sleepy so I read a book until 22:00 at night. When I started /ID/ to feel sleepy, I went to bed and fell asleep. It was a very normal and boring Sunday.\"\n\nThanks in advance!",
        "created_utc": 1674514403,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do the Following Sentences Have Indirect Objects?",
        "author": "Ok_Blackberry_137",
        "url": "https://www.reddit.com/r/grammar/comments/10jpykt/do_the_following_sentences_have_indirect_objects/",
        "text": "I need to know if an oblique argument can be an indirect or direct object.\n\nA. He drove me to Portland.\n\n(My guess is there is no object bc \"Portland\" is oblique)\n\nB. He worked my shift for me.",
        "created_utc": 1674513958,
        "upvote_ratio": 1.0
    },
    {
        "title": "What exactly does “constitutes a miracle” mean?",
        "author": "Ad-astra99",
        "url": "https://www.reddit.com/r/grammar/comments/10jopu2/what_exactly_does_constitutes_a_miracle_mean/",
        "text": "Would constitutes a miracle be the same thing as saying “the event that occurred *counts* as a miracle”?  For example: a survivor of a car accident describes a near deadly crash they survived and I say “that story constitutes a miracle” seems a bit akward. Or is it?",
        "created_utc": 1674510929,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"If your computer were on, but there were no picture on the screen, you would take it to the repair shop.\" - Grammatically correct?",
        "author": "Juggertrout",
        "url": "https://www.reddit.com/r/grammar/comments/10jlnlm/if_your_computer_were_on_but_there_were_no/",
        "text": "Is this an example of an unreal conditional? If so, is it correct to use WERE twice, instead of WAS?\n\nThank you for your help",
        "created_utc": 1674503514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which sentence is correct?",
        "author": "YaySamoyed",
        "url": "https://www.reddit.com/r/grammar/comments/10jln7l/which_sentence_is_correct/",
        "text": "I'm not sure whether to use 'who are' or 'who is' for this sentence:\n\n\"Who is Underground?\" or \"Who are Underground?\"\n\nFor context, this is a slide on a presentation talking about a collective group of traders called \"Underground\".",
        "created_utc": 1674503490,
        "upvote_ratio": 1.0
    },
    {
        "title": "compare",
        "author": "BOBOLIU",
        "url": "https://www.reddit.com/r/grammar/comments/10jljue/compare/",
        "text": "compare the price of A with that of B\n\nvs.\n\ncompare the prices of A and B",
        "created_utc": 1674503267,
        "upvote_ratio": 1.0
    },
    {
        "title": "difference between",
        "author": "BOBOLIU",
        "url": "https://www.reddit.com/r/grammar/comments/10jlijz/difference_between/",
        "text": "`difference between the price of A and that of B` \n\nvs.\n\n`difference between the prices of A and B`",
        "created_utc": 1674503180,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accuse sb of doing st and make an accusation against sb for doing st?",
        "author": "AlexEspRey69",
        "url": "https://www.reddit.com/r/grammar/comments/10jky11/accuse_sb_of_doing_st_and_make_an_accusation/",
        "text": "I would like to know if the expression \"make an accusation against sb\" is followed by the preposition \"for\" if I want to add why I'm making this accusation. I understand that I can say something like this:\n\nMy mom accused me of having eaten all the cake. (here accuse is a verb)\n\nBut, can I say this? \n\nMy mom made an accusation against me FOR HAVING EATEN ALL THE CAKE??\n\n&amp;#x200B;\n\nThe same doubt is with the expression \"put the blame on sb\"\n\nCan I say something like:\n\nMy mom put the blame on me FOR HAVING EATEN ALL THE CAKE?\n\n&amp;#x200B;\n\nWhat is the correct preposition that is followed by these two expressions (make an accusation against sb + ? / put the blame on sb + ? )\n\n&amp;#x200B;\n\nThank you :)",
        "created_utc": 1674501780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I need a comma here?",
        "author": "uniqueUsername_1024",
        "url": "https://www.reddit.com/r/grammar/comments/10jkbgq/do_i_need_a_comma_here/",
        "text": "\"She spent the first few weeks in a dull haze**,** punctuated by brief flashes of lucidity.\"\n\nI know I've read sentences with this construction before, but I can't remember how they were formatted, and we never went over it in any of my English classes. I don't even know what to google.",
        "created_utc": 1674500294,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this grammar correct? I'm confused. . .",
        "author": "jeiram19",
        "url": "https://www.reddit.com/r/grammar/comments/10ji5ha/is_this_grammar_correct_im_confused/",
        "text": "I saw a post with the headline that goes \"Beyoncé paid 24m for popping up in Dubai\" Shouldn't it be Beyoncé got paid or was paid?",
        "created_utc": 1674495147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Capitalisation question",
        "author": "planetapiruleta",
        "url": "https://www.reddit.com/r/grammar/comments/10jgq02/capitalisation_question/",
        "text": "Hello,\n\nI have a grammar dilemma. I work for an organisation that owns a hospital. Let's call it Dragon Hospital. When I refer to the hospital without using the full name, is it correct to capitalise the word, since I am referring to a very specific hospital? \n\n'We received 200,000 patients at the Hospital.' \n\nThank you!",
        "created_utc": 1674491745,
        "upvote_ratio": 1.0
    },
    {
        "title": "Numbers is a headline can be confusing?",
        "author": "DeafAndDumm",
        "url": "https://www.reddit.com/r/grammar/comments/10jfyn6/numbers_is_a_headline_can_be_confusing/",
        "text": "I know we're supposed to spell out numbers. Like for example:\n\nLimit one bottle per customer. Not: Limit 1 bottle per customer.\n\nSuppose you have like a heading on a flyer and you want the heading to say:\n\nBuy 5 bottles and get 1 free!\n\nIs the above correct or should it be: Buy five bottles and get one free!",
        "created_utc": 1674489830,
        "upvote_ratio": 1.0
    },
    {
        "title": "so i have a question in the sentence \"is that your dog in the garden?\" the prepositional phrase in \"in the garden\" work as an adverbial or as an adjectival",
        "author": "anasthedestroyer",
        "url": "https://www.reddit.com/r/grammar/comments/10jf9x3/so_i_have_a_question_in_the_sentence_is_that_your/",
        "text": "",
        "created_utc": 1674488132,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the use of the semicolon correct in the following statement: \"The three powders were accurately weighed; 3 g of Powder A, 2 g of Powder B, and 5 g of Powder C\"",
        "author": "shaleenaditya",
        "url": "https://www.reddit.com/r/grammar/comments/10je8na/is_the_use_of_the_semicolon_correct_in_the/",
        "text": "",
        "created_utc": 1674485468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Punctuation",
        "author": "Richiieee",
        "url": "https://www.reddit.com/r/grammar/comments/10jallc/punctuation/",
        "text": "Punctuation is one of my weaknesses and I struggle with making sentences look proper.\n\nAfter saying, \"For example,\" do you put a comma, colon, or semicolon?\n\nWhen a comma doesn't quite fit, what should go in its place? For example, if I were to say, \"the movement doesn't seem natural\" but then I also want to say, \"it just looks like someone waving their arms in the air,\" do I connect them with a semicolon, hyphen, em dash, or en dash?",
        "created_utc": 1674474429,
        "upvote_ratio": 0.99
    },
    {
        "title": "What does \"proceeded\" mean?",
        "author": "EngLearnerAibek",
        "url": "https://www.reddit.com/r/grammar/comments/10j9m21/what_does_proceeded_mean/",
        "text": "As the Carthaginians started disembarking on the eastern riverbank, Hanno sent a part of his force to loot and destroy the Cavares camp, while he **proceeded** to charge at the Gauls near the river. The Cavares were stunned by the flanking maneuver and they began fleeing the field in panic, unable to cope with Hannibal's perfectly synchronized attacks. With the Gauls scattered, the battle was soon over and the Carthaginians hastily **proceeded** to cross the river.",
        "created_utc": 1674470655,
        "upvote_ratio": 1.0
    },
    {
        "title": "Problem with sentence",
        "author": "maalik_reluctant",
        "url": "https://www.reddit.com/r/grammar/comments/10j9880/problem_with_sentence/",
        "text": "Hey everyone. I’m writing this to my boss, and I’ve been told that she is sick. Would really appreciate if someone could fix this for me.\n\n“I hope you’re well. I’ve come to known that you haven’t been feeling well. Just wanted to wish you a speedy recovery, and hope to see soon again at work.”",
        "created_utc": 1674469039,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tricky Who vs Whom. Help please!",
        "author": "Uriel_Arc",
        "url": "https://www.reddit.com/r/grammar/comments/10j6s22/tricky_who_vs_whom_help_please/",
        "text": "Reviewing and editing some religious/Christian poetry and am a little stumped on whether it ought to be Who or Whom for these 3 stanzas from two different poems. These are 4 line-long rhyming stanzas. I would greatly appreciate some help in discerning whether the below stanzas are grammatically correct the way they are (with Who) or whether they should be changed (to Whom). An explanation of why it is correct or wrong would be very helpful! Thank you! \n\nEx. 1\n\nWith tender trembling before God’s chosen,\nThe lily bore witness to the Virgin Most Mild,\nWho in her most blest womb would be woven,\nThe form and smile of the Christ Child\n\nEx. 2\n\nFollowing this paternal assurance\nCame a grim caution in solemn lament,\nAs Raguel warned of seven grooms prior,\nWho were killed one-by-one without relent.\n\nEx. 3\n\nAs by some ghastly force each groom was killed;\nA covetous demon with foul intent:\nTo keep all men who wed Sarah from life,\nAs he holds her own in ceaseless torment.",
        "created_utc": 1674458913,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saw an ad and I’m wondering about the comma usage",
        "author": "cgjkbvc",
        "url": "https://www.reddit.com/r/grammar/comments/10j3vd5/saw_an_ad_and_im_wondering_about_the_comma_usage/",
        "text": "“Getting a smartphone too soon, means they miss out on moments like these.”\n\nThe comma just looks wrong to me.  I also would likely write “means that they” instead.",
        "created_utc": 1674448469,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's correct to use \"whites\" and \"blacks\" in this context?",
        "author": "ElKonig",
        "url": "https://www.reddit.com/r/grammar/comments/10j0i1e/its_correct_to_use_whites_and_blacks_in_this/",
        "text": "I've realized americans use the structure \\[ term of definition \\] + people to indicate a certain group of people. Example: Black people, white people, Irish people and etc. My question is: is this sense, would be correct to use only the words \"blacks\" and 'whites\"?",
        "created_utc": 1674438105,
        "upvote_ratio": 1.0
    },
    {
        "title": "is \"what with\" proper?",
        "author": "ze_helkitty",
        "url": "https://www.reddit.com/r/grammar/comments/10j0dyo/is_what_with_proper/",
        "text": "\" Someone does not need anywhere near that amount of money to their name. What with the lower 50% of people making not even a thousandth of that, inequality such as that is inexcusable.  \"\n\nWanted to know if this thought is proper grammar, specifically the \"what with\". I say it a lot so when i read this aloud it sounds fine but I wanted to double check. TIA",
        "created_utc": 1674437754,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is an imperative sentence and its all usage?",
        "author": "No_Artist2653",
        "url": "https://www.reddit.com/r/grammar/comments/10izrns/what_is_an_imperative_sentence_and_its_all_usage/",
        "text": "Hello folks,\n\nWhat is an imperative sentence? And please let me know all usage of it.\n\n**Thanks!**",
        "created_utc": 1674435940,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is an imperative sentence and its all usage?",
        "author": "No_Artist2653",
        "url": "https://www.reddit.com/r/grammar/comments/10izqfi/what_is_an_imperative_sentence_and_its_all_usage/",
        "text": "Hello folks,\n\nWhat is an imperative sentence? And please let me know all usage of it.   \n\n\n**Thanks!**",
        "created_utc": 1674435845,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's more corret?",
        "author": "rick217",
        "url": "https://www.reddit.com/r/grammar/comments/10iwybs/whats_more_corret/",
        "text": " As soon as i bought the bargain, i went straight home\nOr\nAfter i bought the bargain, i went straight home",
        "created_utc": 1674428311,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using a pronoun to refer to the correct person",
        "author": "Strikefinger",
        "url": "https://www.reddit.com/r/grammar/comments/10iwowd/using_a_pronoun_to_refer_to_the_correct_person/",
        "text": "As I'm not a native English speaker I sometimes struggle with my English writing. Here's my latest issue:\n\nI wrote the following sentence:\n\n\"My Mother fashioned it for her friend as an apology for overstepping her station.\"\n\nThe second her in this sentence should refer to the grandfather, however it could also be interpreted as referring to the friend which would confuse the reader.\n\nHow would you restructure or rewrite this sentence to make sure it is interpreted correctly?",
        "created_utc": 1674427654,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grammar question",
        "author": "Buchshot44",
        "url": "https://www.reddit.com/r/grammar/comments/10ivxc0/grammar_question/",
        "text": "When you’re saying steph Curry’s shoes would u call them curries or curry’s. Ex do u have any curries. Or for u have any curry’s",
        "created_utc": 1674425723,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saw an advert today and it got me thinking",
        "author": "682goldE",
        "url": "https://www.reddit.com/r/grammar/comments/10is7xc/saw_an_advert_today_and_it_got_me_thinking/",
        "text": "Saw an advert today \"We have kittens that will be looking for their forever homes soon\" it got me thinking should there be an apostrophe in \"homes\" or not?",
        "created_utc": 1674416570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about dialogue questions",
        "author": "All_Or_Nothing_247",
        "url": "https://www.reddit.com/r/grammar/comments/10irgsv/question_about_dialogue_questions/",
        "text": "I have a piece of dialogue that goes:  \n\n\n&gt;\"I apologize, Alex. I don't know what's come over me. What did you say,\" Steve asked, trying to offer a smile.\n\nIs this grammatically correct? I'm worried about the last sentence in the speaking part, I don't know if that should remain a comma or become a question mark. Any other advice is welcomed and appreciated! Thank you in advance!",
        "created_utc": 1674414673,
        "upvote_ratio": 1.0
    },
    {
        "title": "Our family's or families'",
        "author": "lewsh111",
        "url": "https://www.reddit.com/r/grammar/comments/10ir6ml/our_familys_or_families/",
        "text": "I'm writing our wedding invitations and we have a section about children being invited. Should it be written as \"our family's children\" or \"our families' children\". \n\nThanks!",
        "created_utc": 1674414001,
        "upvote_ratio": 1.0
    }
]