[
    {
        "title": "Paper due tomorrow. Struggling with quotation marks, periods, colons, semicolons, dashes, and commas...",
        "author": "KainKaNgKanin",
        "url": "https://www.reddit.com/r/grammar/comments/9ctih6/paper_due_tomorrow_struggling_with_quotation/",
        "text": "I need help with knowing which punctuation mark to use for the following sentences:\n\n1.) For a second, I would think she was me—a little girl throwing out unsophisticated, ugly words—pitching them, catapulting them. \n\n2.) It took a screaming 12-year-old to have me realize: kids are people, too. \n\n3.) It’s not just my sister. I used to think all people were the same, making it hard to listen to what they had to say.\n\n4.) The way they dressed and spoke—I estimated people like a number. \n\n5.) People put the word “weird” next to her name so often, it made Oranger her last.\n\n6.) I said “Hi,” and our coversations began from there. \n\n7.) I kept thinking, “What does she want to hear?” or, “What would make her feel better?”\n\n8.) I stopped thinking about my own replies; she never asked for my advice in the first place. \n\n9.) For her feelings to get through to me, all I needed to do was stop thinking for a second and sympathize; to sink into her words, rather than the ones floating around in my brain.\n\n10.) It’s something so simple, yet so important: listening.\n\nThanks for taking the time to read, if you did!! I looked stuff up online, and now I’m doubting everything I’ve revised. Sentences #1, #3, #5, #6, #8, and #9 are the ones I am most worried about. Please help me out! \n\n",
        "created_utc": 1536047127,
        "upvote_ratio": ""
    },
    {
        "title": "Is: “This apple, and all of those pears, are rotten” correct? Or would it be “is rotten”?",
        "author": "UnderwaterDialect",
        "url": "https://www.reddit.com/r/grammar/comments/9cs659/is_this_apple_and_all_of_those_pears_are_rotten/",
        "text": "",
        "created_utc": 1536033098,
        "upvote_ratio": ""
    },
    {
        "title": "Help me on my English",
        "author": "imbokerph",
        "url": "https://www.reddit.com/r/grammar/comments/9crg0i/help_me_on_my_english/",
        "text": "I'm a Filipino and I'm not good in English. Please help me. I'm constructing a caption for my instagram post. Would you check for grammatical errors? Help me to make a better caption. Caption draft below. thanks\n\n\" We ate Korean food at MR. KIMCHI Batangas City last August 27. It was our first time to eat there, great experience!\n\nI'll treat the group probably next month, any suggestions where to eat? 😉 \"",
        "created_utc": 1536026513,
        "upvote_ratio": ""
    },
    {
        "title": "filler or impersonal subject question",
        "author": "cbijeaux",
        "url": "https://www.reddit.com/r/grammar/comments/9crfyk/filler_or_impersonal_subject_question/",
        "text": "I am working on some materials for an ESL class about filler subjects (There is/There are) and I have found something interesting. According to the reference I am using (a simple grammar book), it says that even if the object is two singular items combine with a conjunction, I have to use 'there are' (There are a pen and a book on the table). It makes sense but it sounds so wrong to me (native English speaker). Is this just me never mastering the grammatically correct term, or is the book just incorrect?",
        "created_utc": 1536026501,
        "upvote_ratio": ""
    },
    {
        "title": "Oxford Comma",
        "author": "livingto_love",
        "url": "https://www.reddit.com/r/grammar/comments/9cptrx/oxford_comma/",
        "text": "Is there a different type of comma other than the oxford comma? If not, why do we always specifically say \"oxford comma\"? If so, what are they and what's the difference?",
        "created_utc": 1536013352,
        "upvote_ratio": ""
    },
    {
        "title": "Are \"A\", \"An\" and \"The\" capital before a sentence, and is the word following it capital too?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/9cpiqv/are_a_an_and_the_capital_before_a_sentence_and_is/",
        "text": "Bothered me for years, thanks for all help.",
        "created_utc": 1536010930,
        "upvote_ratio": ""
    },
    {
        "title": "Their or They're",
        "author": "The_Real_Denlah",
        "url": "https://www.reddit.com/r/grammar/comments/9coyww/their_or_theyre/",
        "text": "Original post: **Lol. And yet you wish your team had their record.**\n\nHad someone argue and call me a moron because I used \"their\" instead of \"they're\".\n\nWhich is correct?  I'm worried I might have lost all faith in humanity. Or am I a moron and their was wrong to use?",
        "created_utc": 1536006864,
        "upvote_ratio": ""
    },
    {
        "title": "This song lyric sounds off...is this correct English?",
        "author": "swirly023",
        "url": "https://www.reddit.com/r/grammar/comments/9corz9/this_song_lyric_sounds_offis_this_correct_english/",
        "text": "There’s this song called ‘Miracle’ by Dutch country artist Ilse de Lange. It has this odd chorus that sounds like it’s not quite right, but I can’t figure it out. Side note: English is my second language.\n\n\nThe lyrics in question: \n\n“A miracle looking in my life,\n\nA mirror-ball showing me all these faces.\n\nA miracle looking in my life\n\nAfter all”\n\n\n\n\nShouldn’t it be “a miracle looking INTO my life” or “a miracle looking AT my life?” Is there any way in which the original lyrics make sense?",
        "created_utc": 1536005498,
        "upvote_ratio": ""
    },
    {
        "title": "Why is am’t not a word?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/9cmyyh/why_is_amt_not_a_word/",
        "text": "[deleted]",
        "created_utc": 1535992840,
        "upvote_ratio": ""
    },
    {
        "title": "Had fallen and sunken and rollin' ??? lol. Rolled I guess?",
        "author": "v_i_o_l_e_n_c_e",
        "url": "https://www.reddit.com/r/grammar/comments/9cmyj0/had_fallen_and_sunken_and_rollin_lol_rolled_i/",
        "text": "[removed]",
        "created_utc": 1535992751,
        "upvote_ratio": ""
    },
    {
        "title": "Is butt-ass naked one adjective? Or is there a different word for the butt-ass part because it specifies the specific type of naked?",
        "author": "SunRaLordQuas",
        "url": "https://www.reddit.com/r/grammar/comments/9cmwnd/is_buttass_naked_one_adjective_or_is_there_a/",
        "text": "",
        "created_utc": 1535992377,
        "upvote_ratio": ""
    },
    {
        "title": "I'm having trouble with a sentence... \"I hope these books blow your mind as much as they did ___\" (me / to me / mine / to mine). Which one should I use and why?",
        "author": "athompsons",
        "url": "https://www.reddit.com/r/grammar/comments/9clf6o/im_having_trouble_with_a_sentence_i_hope_these/",
        "text": "&amp;#x200B;",
        "created_utc": 1535980859,
        "upvote_ratio": ""
    },
    {
        "title": "How do you punctuate written text within a sentence?",
        "author": "JackYAqua",
        "url": "https://www.reddit.com/r/grammar/comments/9cknk1/how_do_you_punctuate_written_text_within_a/",
        "text": "For example: He hung up a sign that read \"Back in 5 minutes\" as if they got customers here.\n\nOr when someone passes on a short note on to another, or someone picks up a book and notices its title, etc.\n\nIs it in quotes? Is it in cursive? Do I have to sprinkle some commas in there somewhere? And what is the grammatically correct term for \"written text within sentence\" so I can google it without getting ten pages of dialogue tag tutorials?",
        "created_utc": 1535973387,
        "upvote_ratio": ""
    },
    {
        "title": "Is \"Ardor\" used correct?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/9ckbdj/is_ardor_used_correct/",
        "text": "[deleted]",
        "created_utc": 1535969726,
        "upvote_ratio": ""
    },
    {
        "title": "Is a participle clause always adverbial, or can it be adjectival?",
        "author": "SorryIWasUpset",
        "url": "https://www.reddit.com/r/grammar/comments/9cjb6a/is_a_participle_clause_always_adverbial_or_can_it/",
        "text": "Question: Can a participle clause traditionally considered to have an \"adverbial\" meaning be adjectival?\n\n\nI'm talking about a case such as this:\n*Towering over the San Francisco Bay, the Golden Gate Bridge is the city's most famous landmark.*\n\n\nIn this case, does \"Towering ... Bay\" have to be considered an adverbial clause? In that case, a number of grammar books say that there should be an implied conjunction (e.g. \"Having eaten its fill, it returned to its cave\" = \"Because it had eaten...\" or \"After it had eaten...\"). So what would the conjunction be here?\n\n\nIt makes more sense to me that it is an adjective modifying \"the Golden Gate Bridge,\" I can't find a clear explanation of this or any support for it.",
        "created_utc": 1535957967,
        "upvote_ratio": ""
    },
    {
        "title": "Should / should have in a narrative...details below",
        "author": "skullkandyable",
        "url": "https://www.reddit.com/r/grammar/comments/9ciy4a/should_should_have_in_a_narrativedetails_below/",
        "text": "This is from a story. Everything is set in the past. Here's an edited excerpt.\n\n&gt; Neil entered the office. The doctor gave him the results and invited him to stay. Neil had mixed feelings. He (1) shouldn't stay any longer. In fact, he (2) shouldn't have come to begin with.\n\nI'm sure (2) is correct. But what about (1). Should + verb is present tense. There is no present tense in this form, except for speech. But I need to show the difference between judging the action the character was about to take and the action he already took. Thanks!",
        "created_utc": 1535954142,
        "upvote_ratio": ""
    },
    {
        "title": "Prism",
        "author": "ripform",
        "url": "https://www.reddit.com/r/grammar/comments/9cinw3/prism/",
        "text": "Is it correct to replace the words \"point of view\" with, \"prism\"?\n\nEx: Through my prism (instead of point of view).",
        "created_utc": 1535951219,
        "upvote_ratio": ""
    },
    {
        "title": "Is 'Politics' a plural, or singular word?",
        "author": "TheSagesIntern",
        "url": "https://www.reddit.com/r/grammar/comments/9ci9br/is_politics_a_plural_or_singular_word/",
        "text": "Do you say, \"That's (that is) politics for you.\", or, \"Those are politics for you.\" I've been thinking this over way too long. The first one sounded more correct but now they both sound wrong.",
        "created_utc": 1535947211,
        "upvote_ratio": ""
    },
    {
        "title": "'a' or 'an' ? Please help!",
        "author": "MartinWSun",
        "url": "https://www.reddit.com/r/grammar/comments/9ci4p0/a_or_an_please_help/",
        "text": "Hi guys, I am constructing the sentence 'We are working on a album' but should it be 'We are working on an album'?\n\nIt is doing my head in!!! I've searched online but found no real clear answer, so I thought I'd ask you guys :)\n\nThanks!",
        "created_utc": 1535945937,
        "upvote_ratio": ""
    },
    {
        "title": "Shouldn’t this say “who”, not “whom”?",
        "author": "chrisdidit",
        "url": "https://i.imgur.com/YgboNHZ.jpg",
        "text": "",
        "created_utc": 1535942212,
        "upvote_ratio": ""
    },
    {
        "title": "Use of \"would have\" for true statements",
        "author": "jslsyl",
        "url": "https://www.reddit.com/r/grammar/comments/9ch6eu/use_of_would_have_for_true_statements/",
        "text": "\"Would have\" is sometimes used for true rather than hypothetical or counterfactual statements. For example, a history teacher might say \"the cavemen would have used rocks rather than actual tools,\" and the \"would have\" in that sentence just feels different from a normal \"would have\" in terms of purpose. Why is that?\n\nFurthermore, is something like \"the U.S. intervened to prevent the imbalance of power, as an imbalance of power would have jeopardized later talks\" correct if the imbalance of power actually occurred?",
        "created_utc": 1535936739,
        "upvote_ratio": ""
    },
    {
        "title": "Usage of \"neither more nor less\"",
        "author": "diaracing",
        "url": "https://www.reddit.com/r/grammar/comments/9cgqsj/usage_of_neither_more_nor_less/",
        "text": "Is it correct to say: \"It is neither more nor less than my opinion.\"?\n\nIf yes, how can I use \"neither more nor less\" at the end of the sentence above?\n\nFor example, is it correct (in terms of grammar and punctuation) to say: \"It is my opinion, neither more nor less.\"?\n\n&amp;#x200B;",
        "created_utc": 1535932707,
        "upvote_ratio": ""
    },
    {
        "title": "Past vs Present",
        "author": "christdaburg",
        "url": "https://www.reddit.com/r/grammar/comments/9cfw5o/past_vs_present/",
        "text": "\"The unique challenges I have faced during my work and volunteering has shed light on weaknesses that I have.\"\n\nShould it be \"has shed light\" or \"have shed light\"?",
        "created_utc": 1535925291,
        "upvote_ratio": ""
    },
    {
        "title": "word request: I am looking for a word that describes following direct orders without any thought. machine-like action",
        "author": "cwunder98",
        "url": "https://www.reddit.com/r/grammar/comments/9ces1h/word_request_i_am_looking_for_a_word_that/",
        "text": "",
        "created_utc": 1535916459,
        "upvote_ratio": ""
    },
    {
        "title": "Why doesn't the U.S. Marshals Service use an apostrophe or much in the way of capitalization?",
        "author": "CeilingUnlimited",
        "url": "https://www.reddit.com/r/grammar/comments/9ce9y0/why_doesnt_the_us_marshals_service_use_an/",
        "text": "I am writing about the U.S. Marshals Service and can't figure out a couple of things regarding the grammar.\n\n1)  The formal title is \"The United States Marshals Service\" with no apostrophe s.\n\n2)  Unless followed by a name or used as a specific title, the USMS uses lower case for 'marshal' and 'deputy.'   As in \"The deputy marshal refused to comment,\" or - even more perplexing - \"There are several U.S. marshals in the room.\"  Shouldn't it at least be \"U.S. Marshals in the room.\"\n\n\nHere's some examples:\n\n[Their Home Page Title.] (https://www.usmarshals.gov/)\n\n[News article using lower case in headline and first sentence.] (https://www.pennlive.com/news/2018/08/slain_deputy_marshal_to_be_rem.html)\n\n[Press release from Marshals Service using lower case in first two paragraphs.] (https://www.usmarshals.gov/montage/)\n\nHelp!  \n\na)  Why no apostrophe?  What's going on here?\n\nb) How do I show both singular and plural possessive?\n\nc)  When do I capitalize?\n\n\nThanks.",
        "created_utc": 1535912606,
        "upvote_ratio": ""
    },
    {
        "title": "What's so bad about using \"they\" in place of \"he/she\"?",
        "author": "Incendance",
        "url": "https://www.reddit.com/r/grammar/comments/9cdnjx/whats_so_bad_about_using_they_in_place_of_heshe/",
        "text": "I've never understood why people would say he/she instead of they. They seems much easier to write or type out and it flows much better than he/she, so what's the problem?",
        "created_utc": 1535908019,
        "upvote_ratio": ""
    },
    {
        "title": "Need help figuring out the answer to this joke",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/9cd3ix/need_help_figuring_out_the_answer_to_this_joke/",
        "text": "[deleted]",
        "created_utc": 1535903870,
        "upvote_ratio": ""
    },
    {
        "title": "What are possible meanings of: \"I will check\"?",
        "author": "Immistic",
        "url": "https://www.reddit.com/r/grammar/comments/9cd2bo/what_are_possible_meanings_of_i_will_check/",
        "text": " Does saying: \"I will check my results\" when you've actually checked and known your results give \"even the appearance\" of misleading the other person Does saying: \"I will check my results\" when you've actually checked and known your results give \"even the appearance\" of misleading the other person?",
        "created_utc": 1535903606,
        "upvote_ratio": ""
    },
    {
        "title": "Who can point me to a website that calculates sentence length?",
        "author": "sarariman9",
        "url": "https://www.reddit.com/r/grammar/comments/9cbuzb/who_can_point_me_to_a_website_that_calculates/",
        "text": "I could have put this in /r/copywriting, but it only has 11k registered users compared to /r/grammar's 27k. Not long ago, I noticed that a piece I wrote had a Fleisch reading ease score of 54.18 (difficult to read), So I decided to make my sentences shorter. I googled and found nothing I liked. I want something like [this](https://app.readable.io/text/) that highlights overlong sentences (at least when it works). But I put the limit at 20 words, just like the American Press Institute. Who can assist me?",
        "created_utc": 1535893163,
        "upvote_ratio": ""
    },
    {
        "title": "Missing comma?",
        "author": "jerweb63",
        "url": "https://www.reddit.com/r/grammar/comments/9cbmpu/missing_comma/",
        "text": "Is a comma not required here? It seems like a pair of commas would be needed. I have enclosed the suspect phrase in braces. The same afternoon that I left Virgil, {a Catholic monk I had been corresponding with} left a message on my phone to tell me about Doug Monroe, a religious solitary who had been living alone for a decade in New Mexico’s vast Gila Wilderness.\n\nTaken from https://www.theguardian.com/us-news/2017/oct/06/hermits-solitude-wilderness-new-mexico",
        "created_utc": 1535890512,
        "upvote_ratio": ""
    },
    {
        "title": "Is this correct: \"this type of cases\"",
        "author": "hmoabe",
        "url": "https://www.reddit.com/r/grammar/comments/9can4o/is_this_correct_this_type_of_cases/",
        "text": "\nSomeone asked on a Facebook group whether this phrase is written correctly. Not to me; it sounds like fingernails on a blackboard. These two would be fine: \"this type of case\" and \"these types of cases\".\n\nSuggestions? A cite? ",
        "created_utc": 1535876814,
        "upvote_ratio": ""
    },
    {
        "title": "Are there online tools which show how english work? (such as verb conjugators)",
        "author": "earth_nice",
        "url": "https://www.reddit.com/r/grammar/comments/9cai0m/are_there_online_tools_which_show_how_english/",
        "text": "I learned about online 'english verb conjugator's. They show how english tenses work for each given verb.\n\n​\n\nAre there other these kind of tools to learn how English works?",
        "created_utc": 1535874804,
        "upvote_ratio": ""
    },
    {
        "title": "What's the unique difference between unconditionally and unreservedly?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/9ca92l/whats_the_unique_difference_between/",
        "text": "[deleted]",
        "created_utc": 1535871602,
        "upvote_ratio": ""
    },
    {
        "title": "Omitting certain prepositions in this phrase?",
        "author": "megatonfist",
        "url": "https://www.reddit.com/r/grammar/comments/9ca4yh/omitting_certain_prepositions_in_this_phrase/",
        "text": "If you don't have someone correcting you, you'll never know what you're doing wrong.\n\nIf you don't have someone correcting you, you'll never know what it is that you're doing wrong.\n\nWhich is correct?",
        "created_utc": 1535870056,
        "upvote_ratio": ""
    },
    {
        "title": "Does this make sense? United sovereign sanctuary of .",
        "author": "demysterisdomlasagna",
        "url": "https://www.reddit.com/r/grammar/comments/9c9ufe/does_this_make_sense_united_sovereign_sanctuary_of/",
        "text": "Shouldn't it be United Sanctuaries ? ",
        "created_utc": 1535866335,
        "upvote_ratio": ""
    },
    {
        "title": "Singular vs Plural verb with \"or\"",
        "author": "Fantality4",
        "url": "https://www.reddit.com/r/grammar/comments/9c9tta/singular_vs_plural_verb_with_or/",
        "text": "My friend and I are having a debate.\n\nShe thinks it's correct to use \"aren't\" in the following sentence:\n\nWhy aren't Mike or Billy here.\n\nI think it is correct to use \"isn't\".\n\nWhy isn't Mike or Billy here.\n\nWhich one is correct?",
        "created_utc": 1535866148,
        "upvote_ratio": ""
    },
    {
        "title": "Shoud I use \"with\" or \" at \" ?",
        "author": "taynho",
        "url": "https://www.reddit.com/r/grammar/comments/9c9kmd/shoud_i_use_with_or_at/",
        "text": "1/ In economics, the number of male doubled that of female,  (at/with ) 150\n\n2/ More female  chose to study marketing and accounting than male , ( with/at) nearly 120 and 200 students respectively\n\n&amp;#x200B;\n\nIn sentence #1, do people understand that 150 is 150 males , not 150 females ?",
        "created_utc": 1535863291,
        "upvote_ratio": ""
    },
    {
        "title": "It's Grammarly Giveaway!",
        "author": "hasnainhaider123",
        "url": "https://gleam.io/o73G2/grammarly-premium-account-giveaway-by-tech-2-learners",
        "text": "",
        "created_utc": 1535861724,
        "upvote_ratio": ""
    },
    {
        "title": "Grammar help please",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/9c94kf/grammar_help_please/",
        "text": "[deleted]",
        "created_utc": 1535858630,
        "upvote_ratio": ""
    },
    {
        "title": "Died in vs. died of",
        "author": "abrolol007",
        "url": "https://www.reddit.com/r/grammar/comments/9c8m64/died_in_vs_died_of/",
        "text": "My friend and I got into an argument on how to refer to when someone dies in something like a crash or fire or something along those lines. My friend thinks that saying died in or died of a crash are equally correct and I'm of the opinion that saying died in a crash is at least more appropriate if not obviously correct and that died of is better for a specific cause like died of a heart attack. So which one of us is right?",
        "created_utc": 1535853644,
        "upvote_ratio": ""
    },
    {
        "title": "Is there online tools which shows how English works? (such as verb conjugators)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/9c869t/is_there_online_tools_which_shows_how_english/",
        "text": "[deleted]",
        "created_utc": 1535849550,
        "upvote_ratio": ""
    },
    {
        "title": "Had to post this.",
        "author": "cdash4",
        "url": "https://i.redd.it/t01ft8qv0qj11.jpg",
        "text": "",
        "created_utc": 1535848592,
        "upvote_ratio": ""
    },
    {
        "title": "\"this one reveals\" vs \"this one can reveal\"",
        "author": "Patchmenotes",
        "url": "https://www.reddit.com/r/grammar/comments/9c7oc4/this_one_reveals_vs_this_one_can_reveal/",
        "text": "How come \"this one reveals\" has an \"s\" at the end, but then if you add the word \"can\", it's now  \"this one can reveal\" where \"reveal\" has no \"s\" now. \n\nFor instance, it's grammatically correct to say either: \"this one reveals his true self at night\" or \"this one can reveal his true self at night\".....adding the word \"can\" changes whether it's \"reveals\" or \"reveal\", which is weird.",
        "created_utc": 1535845005,
        "upvote_ratio": ""
    },
    {
        "title": "Has vs. Have after nonessential (?) clause",
        "author": "veronicas_slushie",
        "url": "https://www.reddit.com/r/grammar/comments/9c6jsf/has_vs_have_after_nonessential_clause/",
        "text": "Hi, I would like some input on which of these two sentences is correct.\n\n* 1) John's case, and others like his, has made me a better doctor.\n* 2) John's case, and others like his, have made me a better doctor.\n\nI think that #1 is correct, but #2 *sounds* correct. Thanks.",
        "created_utc": 1535835795,
        "upvote_ratio": ""
    },
    {
        "title": "'Many' is correct but 'a lot of' is not on a sentence. why?",
        "author": "earth_nice",
        "url": "https://www.reddit.com/r/grammar/comments/9c5vgd/many_is_correct_but_a_lot_of_is_not_on_a_sentence/",
        "text": "This test question is from a British text book. (Penguins readers level tests)\n\n​Answers included **a lot of** and **many**. So I choosed both of them. But only **a lot of** was correct.\n\n.\n\nI had **a lot of** letters yesterday.\n\n**~~many~~**\n\n​\n\nWhy is **many** incorrect here? Is it something about British English?\n\n***^(Pointing out my grammar/style/typo errors is welcome!)***",
        "created_utc": 1535830521,
        "upvote_ratio": ""
    },
    {
        "title": "Is it repetitive to use the word my when talking about objects that implied are yours?",
        "author": "LegalJackFruit",
        "url": "https://www.reddit.com/r/grammar/comments/9c5sir/is_it_repetitive_to_use_the_word_my_when_talking/",
        "text": "For example, if I said \"I spend time with family\" would I have to use the word \"my\"?  Why is it that typically you would say, \"I'm going to Dad\" to siblings but to peers you would say \"I'm going to my Dad\"?  Isn't it implied that its your dad if you don't include the \"your\".",
        "created_utc": 1535829900,
        "upvote_ratio": ""
    },
    {
        "title": "Showing relationship with Just as, so too",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/9c53kk/showing_relationship_with_just_as_so_too/",
        "text": "[deleted]",
        "created_utc": 1535824650,
        "upvote_ratio": ""
    },
    {
        "title": "Warriner's English Grammar and Composition [grade 9] answer key",
        "author": "The_New_Eternet_Hero",
        "url": "https://www.reddit.com/r/grammar/comments/9c4k2s/warriners_english_grammar_and_composition_grade_9/",
        "text": "Does anyone have an answer key to this book? There's no way for me to actually check my answer and it's a fairly old book. If so, please drop a link down below, please.",
        "created_utc": 1535820585,
        "upvote_ratio": ""
    },
    {
        "title": "A thing that is multiple things or ends in an \"s\", use &lt;is&gt; or &lt;are&gt;?",
        "author": "Lord_Trolldermort",
        "url": "https://www.reddit.com/r/grammar/comments/9c4fzi/a_thing_that_is_multiple_things_or_ends_in_an_s/",
        "text": "I'm just going to give the last example I used, because Word is like, bitching at me..\n\n&amp;#x200B;\n\n My foremost reason for doing this &lt;are&gt; professional considerations.  \n\n&amp;#x200B;\n\nNow, I use are, it feels right to me. But MS Word seems to think I'm wrong. Should it be an &lt;is&gt; here or &lt;are&gt;? Btw, I'm native English speaker.  ",
        "created_utc": 1535819749,
        "upvote_ratio": ""
    },
    {
        "title": "I cannot conceive of his accepting the post.",
        "author": "toke-in-all",
        "url": "https://www.reddit.com/r/grammar/comments/9c3z0v/i_cannot_conceive_of_his_accepting_the_post/",
        "text": "or of him accepting the post?\n\n\nThanks :)",
        "created_utc": 1535816282,
        "upvote_ratio": ""
    },
    {
        "title": "Was told this could fit here",
        "author": "charredchard",
        "url": "https://i.redd.it/m0g3e198anj11.jpg",
        "text": "",
        "created_utc": 1535815416,
        "upvote_ratio": ""
    },
    {
        "title": "Found a misspelling bot; checking to see whether it visits this site",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/9c3rye/found_a_misspelling_bot_checking_to_see_whether/",
        "text": "[removed]",
        "created_utc": 1535814757,
        "upvote_ratio": ""
    },
    {
        "title": "Punctuating sentence with inline questions",
        "author": "diaracing",
        "url": "https://www.reddit.com/r/grammar/comments/9c31w9/punctuating_sentence_with_inline_questions/",
        "text": "Kindly, help me correct the wrong one in terms of the punctuation and grammar if any.\n\n1- \"should I leave now?, or I have to wait? I really am tired.\"\n\n2- \"I need to ask you something: should I attend this meeting?\"\n",
        "created_utc": 1535808632,
        "upvote_ratio": ""
    },
    {
        "title": "If you're trying to further explain something that's already inside a parethesis, you'd use brackets, so what then would you use inside brackets to go into tangential detail even further?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/9c12pk/if_youre_trying_to_further_explain_something/",
        "text": "[deleted]",
        "created_utc": 1535784351,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone from here help me check my small paragraph/ sentence grammar .",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/9bznby/can_someone_from_here_help_me_check_my_small/",
        "text": "[removed]",
        "created_utc": 1535769007,
        "upvote_ratio": ""
    },
    {
        "title": "Proper use of semicolon?",
        "author": "Jahankes",
        "url": "https://www.reddit.com/r/grammar/comments/9bz94y/proper_use_of_semicolon/",
        "text": "\"Can you move?\"\n\"My arms, yes; my legs, no\"\n\nWhat is the appropriate grammar to use here? Is the semicolon correct? ",
        "created_utc": 1535765117,
        "upvote_ratio": ""
    },
    {
        "title": "Past Perfect questions",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/9bz272/past_perfect_questions/",
        "text": "I'm having a bit of trouble understanding certain aspects of the past perfect tense.\n\nSo my premise is, it deals with events that happened in the past at different times.\n\nOne event is in past perfect, the other, more close to the present event, in the past simple.\n\n**If that is correct, then how does this phrase work? (It's used in testing)**\n\n&gt;Many students only find out in their first year of college that certain high school courses they hadn't paid much attention to are actually critical to their academic success.\n\nI'm not seeing any verb in the past simple tense. I see the \"hadn't\" aka the past perfect. So this confuses me.\n\nThe students did not pay attention in the past -&gt; after that line I was expecting another event/action, still in the past, but a bit more towards the present.\n\n'Most students only find out...' doesn't look like past to me.",
        "created_utc": 1535763322,
        "upvote_ratio": ""
    },
    {
        "title": "Past form of conditional sentences.",
        "author": "earth_nice",
        "url": "https://www.reddit.com/r/grammar/comments/9by58h/past_form_of_conditional_sentences/",
        "text": "I'm trying to tune my understanding.\n\nPlease give comments if I'm doing this right.\n\n.\n\n1. I'll buy it if it isn't too expensive.\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_   &lt;-- This is NOW.\n2. I'd `(would)` buy it if it wasn't so expensive. \\_\\_\\_\\_\\_\\_\\_\\_ &lt;-- This is NOW, too. We use past tense because it is imagination and the meaning is now.\n3. ~~I'd (had) bought it if it hadn't been so expensive. \\_\\_\\_&lt;-- This is PAST.~~     (This one is wrong. Thank you  [u/bnhaaccount](https://www.reddit.com/user/bnhaaccount/) )\n\n.\n\n3. I would have bought it If it wasn't so expensive. \\_\\_\\_\\_&lt;-- This is PAST.\n\nAlso, for 3rd sentence, can we also say this sentence without using perfect tense?\n\n​\n\n***^(Pointing out my grammar/style/typo errors is welcome!)***",
        "created_utc": 1535755239,
        "upvote_ratio": ""
    },
    {
        "title": "Do you guys know any app or website that can provide the pronunciation of the words as in the picture (near to the show IPA)?",
        "author": "raylgive",
        "url": "https://i.redd.it/57scvmsg6ij11.png",
        "text": "",
        "created_utc": 1535753617,
        "upvote_ratio": ""
    },
    {
        "title": "On the depravity of \"and/or\"",
        "author": "pirsqua",
        "url": "http://www.slaw.ca/2011/07/27/grammar-legal-writing/",
        "text": "",
        "created_utc": 1535748778,
        "upvote_ratio": ""
    },
    {
        "title": "How to list then continue the sentence",
        "author": "bonkerskiki",
        "url": "https://www.reddit.com/r/grammar/comments/9bxayf/how_to_list_then_continue_the_sentence/",
        "text": "I want to list 3 or more things which to choose between(or not and) then continue the sentence on.\n\n Examples:\n\n'When I cry, sleep or laugh I always look ugly' or is it 'When I cry, sleep or laugh, I always look ugly' or anything else... this one is really confusing me.\n\nHow I'm using it: 'If you triumph, fail or do nothing it's because you chose too.' &lt;- is this right?\n\n&amp;#x200B;\n\nThanks for any help, this one has stumped me.\n\n&amp;#x200B;",
        "created_utc": 1535748671,
        "upvote_ratio": ""
    },
    {
        "title": "It isn’t that. Vs. It’s not that.",
        "author": "loopdydoopdy",
        "url": "https://www.reddit.com/r/grammar/comments/9bx0g7/it_isnt_that_vs_its_not_that/",
        "text": "Im just wondering if there’s a difference between these two phrases. One where the contraction is “isn’t” and one where it’s “it’s.” They both day the same thing (at least I think they do). Is there ever a situation where one is preferred? Or maybe one’s just more correct. Any of you people know?",
        "created_utc": 1535746523,
        "upvote_ratio": ""
    },
    {
        "title": "\"It's a simple calculus.\"",
        "author": "AeonExalted",
        "url": "https://www.reddit.com/r/grammar/comments/9bwoec/its_a_simple_calculus/",
        "text": "Okay, yes, r/unexpectedthanos.\n\nSo this has been bothering me since watching Infinity War, but when Thanos says this phrase, is it grammatically correct? I'm assuming it is—since it made it into a big-budget movie—but wouldn't something like \"*It's simply calculus\"* be more grammatically correct?\n\nIt makes sense if I think about it enough, but that \"a\" just sounds really jarring to me. Could someone explain it?",
        "created_utc": 1535744059,
        "upvote_ratio": ""
    },
    {
        "title": "Whattsap needs to stop",
        "author": "hotdigggedydog",
        "url": "https://i.redd.it/vifpkygr9hj11.png",
        "text": "",
        "created_utc": 1535742617,
        "upvote_ratio": ""
    },
    {
        "title": "Picture This:",
        "author": "CaptainSmashy",
        "url": "https://www.reddit.com/r/grammar/comments/9bvu75/picture_this/",
        "text": "Picture this: a girl is walking on the beach.\n\nPicture this. A girl is walking on the beach.\n\nPicture this; a girl is walking on the beach.\n\n  \nWhich one is right?",
        "created_utc": 1535738190,
        "upvote_ratio": ""
    },
    {
        "title": "Using nouns which are both countable and uncountable.",
        "author": "earth_nice",
        "url": "https://www.reddit.com/r/grammar/comments/9bvijm/using_nouns_which_are_both_countable_and/",
        "text": "Example word: **noise**. (*countable, uncountable*)\n\n.\n\n1. It's late. we mustn't make **a** noise.\n2. It's late. we mustn't make **\\_** noise.\n\n.\n\nAre these above examples both correct?\n\nAs you noticed one has `a` and the other hasn't.\n\n.\n\nWhen a word is bot countable and uncountable can we use whatever form we want?\n\n​.\n\nMy problem is the text book gives me `1` as an example. But I always tend to use `2`.\n\n.\n\n***^(Pointing out my grammar/style/typo errors is welcome!)***\n\n​",
        "created_utc": 1535735930,
        "upvote_ratio": ""
    },
    {
        "title": "What is being referred to as valuable in this sentence? Is it the time or the letter?",
        "author": "butternutsquash4u",
        "url": "https://www.reddit.com/r/grammar/comments/9bvaca/what_is_being_referred_to_as_valuable_in_this/",
        "text": "“I sincerely appreciate you taking the time to read this letter as I know it is valuable.”\n\nMight have made a mistake when I wrote my Senator. Thank you for your help!",
        "created_utc": 1535734372,
        "upvote_ratio": ""
    },
    {
        "title": "Can \"they\" be used as a singular pronoun?",
        "author": "PumpkinSloth",
        "url": "https://www.reddit.com/r/grammar/comments/9bus37/can_they_be_used_as_a_singular_pronoun/",
        "text": "Would I get marked down on an exam or essay for using \"they\" as a singular pronoun?",
        "created_utc": 1535730796,
        "upvote_ratio": ""
    },
    {
        "title": "When using an 'x' to say 'times' (\"10x magnification\") is there a standard on if the 'x' is lowercase or capitalized?",
        "author": "Bersho",
        "url": "https://www.reddit.com/r/grammar/comments/9bui8c/when_using_an_x_to_say_times_10x_magnification_is/",
        "text": "Self explanatory.  My boss and I were discussing this today.  Wondering if it is specified anywhere what to do in this case.  Also, we cannot remove the 10x and make it '10 times' which is probably the best grammar case.",
        "created_utc": 1535728871,
        "upvote_ratio": ""
    },
    {
        "title": "Is \"subscribe to a religion?\" the right way of saying it?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/9bugk8/is_subscribe_to_a_religion_the_right_way_of/",
        "text": "[deleted]",
        "created_utc": 1535728551,
        "upvote_ratio": ""
    },
    {
        "title": "Which one is correct?",
        "author": "Ggb363",
        "url": "https://www.reddit.com/r/grammar/comments/9bucaj/which_one_is_correct/",
        "text": "1) This is one of the factors that contribute to pollution.\n2) This is one of the factors that contributes to pollution.",
        "created_utc": 1535727709,
        "upvote_ratio": ""
    },
    {
        "title": "What is correct?",
        "author": "cookmybook",
        "url": "https://www.reddit.com/r/grammar/comments/9bu1pq/what_is_correct/",
        "text": "My name is William. You can call me 'Will'.\n\nMay name is William. You can call me Will. \n\n&amp;#x200B;\n\nDo I use quotations when defining an nickname? Should I add a comma? ",
        "created_utc": 1535725524,
        "upvote_ratio": ""
    },
    {
        "title": "Where should the commas be? Should I add one after \"experience\"? Is the one after \"skills\" necessary?",
        "author": "dpaanlka",
        "url": "https://i.redd.it/3d4lplexnfj11.jpg",
        "text": "",
        "created_utc": 1535723212,
        "upvote_ratio": ""
    },
    {
        "title": "There don't vs there doesn't",
        "author": "PunishedLowtek",
        "url": "https://www.reddit.com/r/grammar/comments/9bth7z/there_dont_vs_there_doesnt/",
        "text": "Of the two sentences:\n\n\"There don't appear to be any bugs.\"\n\nvs\n\n\"There doesn't appear to be any bugs.\"\n\nWhich is correct? The first sounds right to me because bugs is plural. Or are both just awkwardly worded?",
        "created_utc": 1535721062,
        "upvote_ratio": ""
    },
    {
        "title": "Help me with this please",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/9bsnp7/help_me_with_this_please/",
        "text": "[removed]",
        "created_utc": 1535713527,
        "upvote_ratio": ""
    },
    {
        "title": "How should I pronounce strigine?",
        "author": "Ploomy-",
        "url": "https://www.reddit.com/r/grammar/comments/9bs85f/how_should_i_pronounce_strigine/",
        "text": "I’ve listened to different videos and voice clips. Everyone has a different take on it. \n\n[I have found this on wiktionary](https://en.m.wiktionary.org/wiki/strigine)\n\nBut I can’t understand what this says (Received Pronunciation) enPR: strĭʹjīn, IPA(key): /ˈstɹɪd͡ʒaɪn",
        "created_utc": 1535708617,
        "upvote_ratio": ""
    },
    {
        "title": "Plural names when speaking of an extended family.",
        "author": "CeilingUnlimited",
        "url": "https://www.reddit.com/r/grammar/comments/9bqjbc/plural_names_when_speaking_of_an_extended_family/",
        "text": "A ranch is owned by a man named Baker who has four sons.  The man dies and wills the ranch in equal parts to all four sons.\n\nIs it now The Baker's Ranch or the Bakers' Ranch?  Also, is 'The Baker Ranch' still correct?  ",
        "created_utc": 1535689372,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone please explain what tenses these are?",
        "author": "crooshkeenlawn",
        "url": "https://www.reddit.com/r/grammar/comments/9bpku4/can_someone_please_explain_what_tenses_these_are/",
        "text": "Example:  \n\n\n*If I won the lotto, I would buy a house.*\n\n&amp;#x200B;\n\nI'm assuming the second clause is conditional? That makes the first clause a subjunctive?\n\n&amp;#x200B;\n\nWhat about this one:\n\n&amp;#x200B;\n\n*If I were rich, I would buy a ferrari.*\n\n&amp;#x200B;\n\nLet me know please!",
        "created_utc": 1535680558,
        "upvote_ratio": ""
    },
    {
        "title": "What would be the correct way to say this?",
        "author": "Scmethodist",
        "url": "https://www.reddit.com/r/grammar/comments/9bpitg/what_would_be_the_correct_way_to_say_this/",
        "text": "\nThere are few ways less noble to serve our country than through military service.\n\nOr\n\nThere are few ways more noble to serve our country than through military service.",
        "created_utc": 1535680078,
        "upvote_ratio": ""
    },
    {
        "title": "For those who want to express clearly their emotions",
        "author": "the_antmich",
        "url": "https://i.redd.it/l2a61uxvfbj11.jpg",
        "text": "",
        "created_utc": 1535672035,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone please check my grammar and sentence structure for this short essay about my hometown I have to submit for a job application?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/9bnoht/can_someone_please_check_my_grammar_and_sentence/",
        "text": "[removed]",
        "created_utc": 1535664483,
        "upvote_ratio": ""
    },
    {
        "title": "Plural or singular difficulty.",
        "author": "Titanarmin",
        "url": "https://www.reddit.com/r/grammar/comments/9bn4s3/plural_or_singular_difficulty/",
        "text": "\"The mnemonic device that I use is flash cards\"\n\"The mnemonic device that I use are flash cards\" \nWould it be is or are? Mnemonic device is singular but flash cards is plural so I'm not sure.",
        "created_utc": 1535660140,
        "upvote_ratio": ""
    },
    {
        "title": "Capitalize or to not capitalize title of position and department name in a cover letter?",
        "author": "Lachaca02",
        "url": "https://www.reddit.com/r/grammar/comments/9bn26v/capitalize_or_to_not_capitalize_title_of_position/",
        "text": "Sentence in cover letter is similar to: I'm applying for office assistant for human resources department...\n\nDo I capitalize position of title and department or no? Which sentence is correct? If neither, then what would be the correct form?\n\n1. I'm applying to the office assistant position in the human resource department.\n\nOR\n\n2. I'm applying to the Office Assistant position for the Human Resource Department.",
        "created_utc": 1535659657,
        "upvote_ratio": ""
    },
    {
        "title": "Difficulties punctuating a sentence",
        "author": "melficebelmont",
        "url": "https://www.reddit.com/r/grammar/comments/9bmuru/difficulties_punctuating_a_sentence/",
        "text": "&gt;By labeling a game one appeals to a subset of consumers who may decide to play the game on such a basis and expect certain elements thereby predisposing them to dislike said game in instances in which the expected elements are lacking, irrelevant of any other quality elements present in the game. \n\nI know this sentence is rather large and cumbersome but would like it remain one sentence. I have am having difficulties punctuating it though since my intuition says it needs more than it has but can cannot specify where or why. If I really have to seperate it into 2 sentences I think it would go like this:\n\n&gt;By labeling a game one appeals to a subset of consumers who may decide to play the game on such a basis and expect certain elements. This thereby predisposes them to dislike said game in instances in which the expected elements are lacking, irrelevant of any other quality elements present in the game. \n\n&amp;#x200B;",
        "created_utc": 1535658204,
        "upvote_ratio": ""
    },
    {
        "title": "Is it correct to write \"his hipocrisy on (the topic)\"? If not, which is the correct way to express this statement?",
        "author": "b__________________b",
        "url": "https://www.reddit.com/r/grammar/comments/9blpyn/is_it_correct_to_write_his_hipocrisy_on_the_topic/",
        "text": "",
        "created_utc": 1535650474,
        "upvote_ratio": ""
    },
    {
        "title": "How to use the word lie?",
        "author": "Theo1290",
        "url": "https://www.reddit.com/r/grammar/comments/9blijb/how_to_use_the_word_lie/",
        "text": "Say I want to write this sentence for a comparison essay;\n\n\"Points of similarity ..... across these two texts\"\n\nCan I use lay or lie?",
        "created_utc": 1535649079,
        "upvote_ratio": ""
    },
    {
        "title": "There is/are a peacock and a crow sitting outside my door.",
        "author": "slurpeee76",
        "url": "https://www.reddit.com/r/grammar/comments/9bks0w/there_isare_a_peacock_and_a_crow_sitting_outside/",
        "text": "please help ",
        "created_utc": 1535644087,
        "upvote_ratio": ""
    },
    {
        "title": "Her and I or she and I",
        "author": "Arceist_Justin",
        "url": "https://www.reddit.com/r/grammar/comments/9bkh1x/her_and_i_or_she_and_i/",
        "text": "When I was typing up a description for my profile picture into Microsoft Word. I typed the following sentence within a paragraph.\n\n&amp;#x200B;\n\n\"*This update also adds quests, side quests, and missions that either my Pony Waifu Princess Celestia needs to do or her and I need to do.*\"\n\n&amp;#x200B;\n\nMicrosoft World said that \"her\" needed to be a \"she\" but it does not sound right when I say it out loud with \"she\". It sounds way better with \"her\". So I told Microsoft Word to ignore it.\n\n&amp;#x200B;\n\nWhen I pasted it into my profile picture description, even Grammarly said that it needed to be \"she\" but it still does not sound right when I say it.\n\n&amp;#x200B;\n\nWhich is the correct way?",
        "created_utc": 1535641987,
        "upvote_ratio": ""
    },
    {
        "title": "xkcd: Begging the Question",
        "author": "tuctrohs",
        "url": "https://xkcd.com/2039/",
        "text": "",
        "created_utc": 1535641461,
        "upvote_ratio": ""
    },
    {
        "title": "Question on quotes and comma",
        "author": "cookmybook",
        "url": "https://www.reddit.com/r/grammar/comments/9bk8zk/question_on_quotes_and_comma/",
        "text": "What is correct when discussing a nickname as follows: \n\nExample: \n\nYou can call me, \"Will\". \n\n&amp;#x200B;\n\nIt feels awkward when refferring to a nickname. \n\n&amp;#x200B;\n\nMy instinct is to write: \n\nYou can call me 'Will'. \n\n&amp;#x200B;\n\nWhat is correct? ",
        "created_utc": 1535640427,
        "upvote_ratio": ""
    },
    {
        "title": "Comma Question",
        "author": "ohmy1027",
        "url": "https://www.reddit.com/r/grammar/comments/9bjvuw/comma_question/",
        "text": "I work for a contractor and am responsible for sending bids. Below is what I type in the body of the proposal. Should the commas before the word \"dated\" be there? I don't normally use the Oxford comma, even though Grammarly suggests it every time I type a list but it makes no suggestings as to the commas that I am asking about. \n\n\"John Smith Contractor, Inc. hereby proposes to furnish labor, material and equipment to complete the following at the above-referenced as per plans and specifications, dated July 17, 2018, Addendum No. 1, dated August 8, 2018, Addendum No. 2, dated August 17, 2018 and Addendum No. 3, dated August 17, 2018 all by Smith, Smith and Smith Architects, Inc.:",
        "created_utc": 1535637778,
        "upvote_ratio": ""
    },
    {
        "title": "Not sure about the right answer.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/9bjtth/not_sure_about_the_right_answer/",
        "text": "[deleted]",
        "created_utc": 1535637329,
        "upvote_ratio": ""
    },
    {
        "title": "Help! Not sure about the commas here.",
        "author": "SmirkingDesigner",
        "url": "https://www.reddit.com/r/grammar/comments/9bjkt3/help_not_sure_about_the_commas_here/",
        "text": "Helping someone with some edits and I don't know if I'm just tired or what, but this is stumping me.   \n\"Jon and his wife, Dona, and their 8 month old son, were on their way to a new home, to a new life.\" &lt;Original sentence.  \n\n\nWhen I look at it, I feel like its wrong. Is it correct as is? Or maybe  \n\n\n\"Jon, his wife Dona, and their 8 month old son were on their way to a new home, a new life.\"?  \n\n\nOr something else?  \n\n\nHelp is appreciated! Thank you.",
        "created_utc": 1535635358,
        "upvote_ratio": ""
    },
    {
        "title": "I was rejected for a job as a copy editor and was wondering why that was",
        "author": "sarariman9",
        "url": "https://www.reddit.com/r/grammar/comments/9bjdhg/i_was_rejected_for_a_job_as_a_copy_editor_and_was/",
        "text": "I thought /r/grammar was a better place for this than /r/proofreading. I got rejected for a job as a copy editor where I'd be working from home. The reason was that I was too shit—I allegedly missed clear grammar mistakes and overedited. The company doesn't give detailed feedback, so I'm trying here. I'm posting the text rather than a Google Docs file because I'd like to see the changes. Here we are:\n\nSection 1\n\nA community is a group of people with some common properties, a subset of a network whose users are densely connected and have similar attributes, e.g., they like to play badminton or their research area is similar. In social networks, individuals will form various communities according to their interests.  Although the structure of social networks will change with time,  communities are relatively stable. \n\nIn this area, the main issue is how to detect the communities with high influence in a social network. Researchers have proposed many methods, mainly including links and attributes. They have detected communities through social links, content (39-41), node attributes (42), sentiment topics (43), and others (44). The relevant literature will be analyzed as follows:\n\nSection 2\n\nFractured geological formations are ubiquitous throughout the world and are of interest in a number of contexts: (1) reservoir exploitation for water supply; (2) contamination from subsurface waste repositories; (3) petroleum reservoir exploitation; (4) geothermal reservoir exploitation and heat storage; (5) mining and mineralization processes (in situ leaching and location of ore bodies); (6) geotechnical applications (including effects on underground storage reservoirs, tunnels, and other structures); and (7) deeper Earth systems, such as earthquakes and ocean floor hydrothermal venting (1, 2). In the field of petroleum reservoir exploitation, there is an increasing amount of research into fractured oil and gas reservoirs because these occupy a considerable proportion of attention (3-7).\n\nSection 3\n\nGlobal change pressures have increased the prevalence of forest fires in western North America (1–3). Therefore, a better understanding of the connection between resulting perturbations in environmental factors and ecosystem processes, such as decomposition, will be vital to modeling ecosystem responses in the wake of such disturbances (4–7). Microbial production of extracellular enzymes (EEA) involved in decomposition is regulated by the quantity and quality of substrates, which can change significantly after forest fires, although other factors such as moisture and pH are known to impact EEA as well (8–10). In particular, fire disturbances dramatically alter soil carbon (C) and nitrogen (N) pools, pH, and the water holding capacity of soil (11,12), which may all continue to change through succession. These factors may thus affect microbial investment in both C and N, targeting decomposition enzymes across short time scales of ecosystem recovery (possibly for months).\n\nSection 4\n\nMoreover, IoT portable devices communicate with each other and thus require an enormous amount of memory to store and process data. The memory requirement in IoT depends upon the applications related to the market. For instance, in the case of a huge amount of data storage and information-handling for a long period of time, high-density memory, such as DRAM or Flash, is required. On the other hand, for high data transfer rate systems, fast SRAM memory is necessary, where a high clock frequency is essential to communicate between IoT devices. Therefore, SRAM is always preferred as cache memory due to its faster response. Moreover, the robustness of such memory systems respective to the variations in process-voltage-temperature (PVT) values of metal oxide semiconductor devices (MOS) and power efficiency are two of the most important design constraints (4). Per the literature, more than 40 percent of active energy is consumed due to current leakage in modern high-performance processors (6,7). Moreover, most of the time, a large number of SRAM cells used in present generation on-chip cache memory stands in a hold state where leakage power dominates dynamic power. Thus, leakage reduction has become the imperative concern in SRAM memory design.\n\nEDIT: Someone thought it was best to include the original text, so here it is:\n\nSection 1\n\nCommunity is a group of people with some common properties. In social networks, individuals will form varies communities by interests. A community is a subset of the network that the users are densely connected and have similar attributes, e.g., they like to play the badminton, their research area is similar and others. Although the structure of social networks will be changed with the time, the community is stable relatively. In this area, the main issue is how to detect the communities with high influence in social network. Researchers have proposed many methods. It mainly includes links and attributes. They have detected the communities through social links, content[39-41], node attributes[42], sentiment topics[43] and others[44]. The relevant literature will be analyzed as follows.\n\nSection 2\n\nFractured geological formations are ubiquitous throughout the world, and are of interest in a number of contexts: (1) reservoir exploitation for water supply; (2) contamination from subsurface waste repositories; (3) petroleum reservoir exploitation; (4) geothermal reservoir exploitation and heat storage; (5) mining and mineralization processes (in situ leaching and location of ore bodies); (6) geotechnical applications (including effects on underground storage reservoirs, tunnels and other structures); and (7) deeper Earth systems, such as earthquakes and ocean floor hydrothermal venting [1, 2]{Berkowitz, 2002 #2845}. And in the field of petroleum reservoir exploitation, there are more and more researches on the fractured oil and gas reservoirs because the fractured oil and gas reservoirs occupy a considerable proportion [3-7].\n\nSection 3\n\nGlobal change pressures have increased the prevalence of forest fires in western North America [1–3]. Therefore, a better understanding of the connection between resulting perturbations in environmental factors and ecosystem processes, such as decomposition, will be vital to modeling ecosystem responses in the wake of such disturbance [4–7]. Microbial production of extracellular enzymes (EEA) involved in decomposition is regulated by quantity and quality of substrate that can change strongly after forest fires, although other factors such as moisture and pH are known to impact EEA as well [8–10]. In particular, fire disturbances dramatically alter soil carbon (C) and nitrogen (N) pools, pH, and water holding capacity of soils [11,12], which may all continue to change through succession. These factors may thus affect microbial investment in both C and N targeting decomposition enzymes across short time scales of ecosystem recovery (e.g., months).\n\nSection 4\n\nMoreover, the IoT portable devices communicate with each other and thus require an enormous amount of memory to store and process data. The memory requirement in IoT depends upon the applications related to market. For instance, in case of huge amount of data storage and handling information for a long period of time a high density memory like DRAM and Flash are required. On the other hand, for high data transfer rate systems, a fast SRAM memory is required, where a high clock frequency is essential to communicate between IoT devices. Therefore, SRAM is always preferred as a cache memory due to its faster response. Moreover, the robustness of such memory systems respective to the variations in process-voltage-temperature (PVT) values of metal oxide semiconductor devices (MOS) and power efficiency are two of the most important design constraints [4]. As per the literature, more than 40% of the active energy is consumed due to the leakage current in modern high performance processors [6,7]. Moreover, most of the time a large number of SRAM cells used in present generation on-chip cache memory stand in hold state where leakage power dominants over the dynamic power. Thus, leakage reduction has become the imperative concern in the SRAM memory design.",
        "created_utc": 1535633720,
        "upvote_ratio": ""
    },
    {
        "title": "Whether to add a last verb or not. 'I don't go there as much as you (go).'",
        "author": "earth_nice",
        "url": "https://www.reddit.com/r/grammar/comments/9bja9j/whether_to_add_a_last_verb_or_not_i_dont_go_there/",
        "text": "Original sentences are below. I tend to add verb `do` after them. Is it OK? \n\n'I don't go out as much as you.'\n\n'I don't go out as much as I used to.'",
        "created_utc": 1535632975,
        "upvote_ratio": ""
    },
    {
        "title": "A trophy dedication.",
        "author": "igorsmith",
        "url": "https://www.reddit.com/r/grammar/comments/9biwq6/a_trophy_dedication/",
        "text": "\"ADMIRED FOR HIS FRIENDSHIP, CELEBRATED FOR HIS FONDNESS OF OLANDS EXPORT ALE, AND UNRIVALED IN HIS ABILITY TO DELIVER A BAD JOKE\".\n\nAm I saying this properly?  It's a dedication to a recently passed friend that's going on a hockey trophy. \n\nIs there a better way to say this that keeps to the message?  \n\nAny help would be appreciated. ",
        "created_utc": 1535629629,
        "upvote_ratio": ""
    },
    {
        "title": "Which time should I use in that case? It really messes me up",
        "author": "youmeanWELL",
        "url": "https://www.reddit.com/r/grammar/comments/9bht3f/which_time_should_i_use_in_that_case_it_really/",
        "text": "Hey guys! Let me ask you for a little help. I'm not a native english speaker, you know, so sometimes I'm not confident how to say something. Usually translator helps me out but this time it doesn't. So here is the thing. I have a phrase and I need an advice which time will be right for that sentence. Present Continuous or Present Perfect Continuous? There are two variants of mine:\n\n1. *We're dying the whole our life.*\n2. *We've been dying the whole our life.*\n\nSo I know that Present Continuous (PC) is used when the action's being done at some time period, like *he was working all summer.* But Present Perfect Continuous (PPC) is used when I do know the length of time period and the moment when it's ended right? So here is the thing that messes me up.\n\nA process of dying is a process of getting closer to your death isn't it? So when the baby's born he's getting closer to his death with every second he lives. So we can say he's dying can't we?\n\nAnd here's the thing. The end of this action is death. And actually we know when this action will be ended. When we died. Even if we don't know when it'll be exactly we know the consequent end of this process. So should I use PPC if I know the moment when the action from sentence will stop or this moment is still unknown for me if I don't know exactly when it's happen so I should use PC?\n\n​\n\nI intuitively prefer the PC but I wanna see which one the native speaker would say :)\n\n​\n\n*PS, it's a little depressive maybe but it is what it is :D*",
        "created_utc": 1535617459,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to interpret \"the reason that...\" in two ways?",
        "author": "ijngf01020304",
        "url": "https://www.reddit.com/r/grammar/comments/9bhiss/is_it_possible_to_interpret_the_reason_that_in/",
        "text": "Is it possible to interpret \"the reason that...\" in ways? \n\nFor example: The reason that you did not finish the homework is unacceptable.\n\n①You have provided an excuse for not having finished the homework, but such excuse is not acceptable.\n\n②You have provided an excuse for some mistake that you made. Such reason is that you have not finished the homework, and such reason is not acceptable.",
        "created_utc": 1535613916,
        "upvote_ratio": ""
    },
    {
        "title": "Is this right use of colon?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/9bgob8/is_this_right_use_of_colon/",
        "text": "[deleted]",
        "created_utc": 1535604740,
        "upvote_ratio": ""
    },
    {
        "title": "How to separate groups of names within a paragraph - commas, semicolons, or a combination?",
        "author": "misspygmy",
        "url": "https://www.reddit.com/r/grammar/comments/9bgi2f/how_to_separate_groups_of_names_within_a/",
        "text": "I’m writing a list of people performing at a small music festival. Most are either performing solo or in groups of two or three.\n\nThe acts are something like this, but this list needs to be in paragraph form:\n\nJenny\nBilly and Steve\nBob\nJim, Charles, and William \nStephanie and her Stephamatics\nTom and Sally\nVanessa, Tim, and Mildred\nBetty \n\nThanks in advance for your help!",
        "created_utc": 1535603048,
        "upvote_ratio": ""
    }
]