[
    {
        "title": "'Less than' or 'fewer than' for units of time?",
        "author": "OzarkMountain",
        "url": "https://www.reddit.com/r/grammar/comments/93sfy8/less_than_or_fewer_than_for_units_of_time/",
        "text": "Since time is abstract, but approximated as if composed of distinct units, in which cases would you use \"fewer than\" instead of \"less than?\"\n\nWould it depend on if you are quantifying it in exact units as opposed to a fluid substance?\n\n\"It will happen in less than forty hours.\"\n\"I work fewer hours this week than my typical forty.\"\n\nCan someone explain how to do this properly?",
        "created_utc": 1533153744,
        "upvote_ratio": ""
    },
    {
        "title": "Have I correctly used a semi-colon in this list?",
        "author": "lukelfcpower",
        "url": "https://www.reddit.com/r/grammar/comments/93rtq8/have_i_correctly_used_a_semicolon_in_this_list/",
        "text": "&gt;JetBrains IntelliJ IDEA, PhpStorm, WebStorm; Atom; NetBeans; Notepad++\n\nJetBrains is a software development company who have tools such as the ones listed before the first semi-colon. Does it make sense to separate their tools with a comma, and then separate other tools with a semi-colon?\n\nI would also like to know if it would be acceptable to separate a small list with semi-colons, for example:\n\n&gt;Apple; Pear; Orange",
        "created_utc": 1533149610,
        "upvote_ratio": ""
    },
    {
        "title": "is or are",
        "author": "2unfit2quit",
        "url": "https://www.reddit.com/r/grammar/comments/93rpg2/is_or_are/",
        "text": "Can anyone tell me if its ‘is’ or ‘are’ please? Also is there a different between US and UK English?\n\nJohn is a bit of a X\n\nJohn and his ten houses is/are a bit of a X\n\nThe Mondeo is very impressive\n\nThe Mondeo and its list of features is/are very impressive",
        "created_utc": 1533148824,
        "upvote_ratio": ""
    },
    {
        "title": "Book Dedication: Style and Grammar",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/93rout/book_dedication_style_and_grammar/",
        "text": "[deleted]",
        "created_utc": 1533148710,
        "upvote_ratio": ""
    },
    {
        "title": "When should I use a comma?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/93qvzr/when_should_i_use_a_comma/",
        "text": "Not talking about anything in specific. Commas in general, rather.",
        "created_utc": 1533143491,
        "upvote_ratio": ""
    },
    {
        "title": "Many vs multiple...",
        "author": "blacklabel85",
        "url": "https://www.reddit.com/r/grammar/comments/93qq96/many_vs_multiple/",
        "text": "Multiple seems to have become interchangeable with many in the last few years, and it grinds my gears. I frequently argue with a colleague when he says something like \"I watched x film multiple times\".\nI'm of the opinion that multiple means something that has many sub-parts or elements. So a multi-tool is one tool made up of many tools. \nI would never say \"I drank multiple pints last night\" nor would I ask \"how multiple pints have you had?\"\nMy colleague contends that multiple is just a synonym of many.\n\nAnyone got any thoughts on this?",
        "created_utc": 1533142488,
        "upvote_ratio": ""
    },
    {
        "title": "Indirect speech - a point of grammar or style?",
        "author": "SomeHSomeE",
        "url": "https://www.reddit.com/r/grammar/comments/93p9j1/indirect_speech_a_point_of_grammar_or_style/",
        "text": "I was writing a meeting readout the other day, and had a disagreement with my boss.  (At my work, a good writing style and correct grammar are both seen as very important).\n\nIn the meeting, Steve said \"I hope that X will happen\".\n\nI wrote in the readout:\n\n\"Steve said he hopes that X will happen\".\n\nMy Boss corrected it to\n\n\"Steve said he hoped that X would happen\".\n\nI argued that 'hope' is a lasting emotion and I judge that Steve continues to hope X will happen.  So therefore writing 'hopes' is accurate, and from a stylistic perspective reads better.  I agree \"hoped\" would also be grammatically correct, but IMO is stylistically not as good, as it implies he may no longer hold that hope.\n\nShe argues that, grammatically, \"hoped\" is the only option and style doesn't come in to it.\n\nWhat do you think?\n\nEDIT:  X is referring to something next year",
        "created_utc": 1533132496,
        "upvote_ratio": ""
    },
    {
        "title": "Will it be to get to the truth?",
        "author": "pm_me_your_hurt",
        "url": "https://www.reddit.com/r/grammar/comments/93odek/will_it_be_to_get_to_the_truth/",
        "text": "or get at the truth?\n\n\nAlso what will be the passive voice of :- \"I shall unlock the secrets of their success\", he said.",
        "created_utc": 1533125209,
        "upvote_ratio": ""
    },
    {
        "title": "\"Those prescribed the drugs\". Passive voice?",
        "author": "maybe82",
        "url": "https://www.reddit.com/r/grammar/comments/93no5a/those_prescribed_the_drugs_passive_voice/",
        "text": "In the sentence \"This is because those prescribed the drugs do not take them\".\n\nWhat's happening with *\"those prescribed the drugs\"*.  I can recognise it is passive but there is no verb *be*.\n\n\"Subject\" + verb be + past participle (by agent).\n\n\nMy guess is that it is that usually it would be \"Those *who are* prescribed...\"  but the *who are* can be omitted for some reason. \n\nAny help appreciated  :)",
        "created_utc": 1533117973,
        "upvote_ratio": ""
    },
    {
        "title": "On Prepositions",
        "author": "King--of--the--Juice",
        "url": "https://www.youtube.com/watch?v=fGkxvn00Eak",
        "text": "",
        "created_utc": 1533110214,
        "upvote_ratio": ""
    },
    {
        "title": "Is \"On the basis that\" grammatically correct?",
        "author": "Im_Tsuikyit",
        "url": "https://www.reddit.com/r/grammar/comments/93m9ni/is_on_the_basis_that_grammatically_correct/",
        "text": "I've tried searching, but no dice. I do know \"On the basis of\" is correct, but what about \"On the basis that?\"",
        "created_utc": 1533102225,
        "upvote_ratio": ""
    },
    {
        "title": "Can u say \"Wanna grab something to eat with me?\" in a non-dating sense? (between good friends) In english?",
        "author": "weamphn2",
        "url": "https://www.reddit.com/r/grammar/comments/93lp4s/can_u_say_wanna_grab_something_to_eat_with_me_in/",
        "text": "I'm trying to know this. I just don't wanna use it and make myself feel like it's an awkward situation. ",
        "created_utc": 1533096775,
        "upvote_ratio": ""
    },
    {
        "title": "Can or could? You or I?",
        "author": "trippyhippy_",
        "url": "https://www.reddit.com/r/grammar/comments/93lolw/can_or_could_you_or_i/",
        "text": "I'm writing an apology for my friend and the ending line is this:\n\n\"I guess I can say it's been a while.\"\n\nIs this proper or should I change it? Thanks!",
        "created_utc": 1533096650,
        "upvote_ratio": ""
    },
    {
        "title": "Most indian don't know how to use xxxxxx, especially xxxxxx",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/93lf8n/most_indian_dont_know_how_to_use_xxxxxx/",
        "text": "[deleted]",
        "created_utc": 1533094443,
        "upvote_ratio": ""
    },
    {
        "title": "How to Punc List of Sentences?",
        "author": "squarepantsyo",
        "url": "https://www.reddit.com/r/grammar/comments/93kpsn/how_to_punc_list_of_sentences/",
        "text": "Hi there, \n\nFor the sentence below, 1) can u use commas? 2) can each new item remain lowercase? They are technically sentences but... Seems cluttered to bring out the semi-colons.\n\nIn terms of the pros, the beds are comfy, the staff are friendly, and there are two swimming pools.",
        "created_utc": 1533088546,
        "upvote_ratio": ""
    },
    {
        "title": "What is the difference?",
        "author": "prashil1126",
        "url": "https://www.reddit.com/r/grammar/comments/93kmye/what_is_the_difference/",
        "text": "What is the difference between the following sentences?\n1. The number of students in the class is fifty.\n2. A number of students in the class are fifty.",
        "created_utc": 1533087896,
        "upvote_ratio": ""
    },
    {
        "title": "Can I use 'would like' or 'want' in place of 'wanted'?",
        "author": "Mr__Christian_Grey",
        "url": "https://english.stackexchange.com/questions/458289/can-i-use-would-like-or-want-in-place-of-wanted",
        "text": "",
        "created_utc": 1533087491,
        "upvote_ratio": ""
    },
    {
        "title": "\"Every fish [have/ has] bodies\"",
        "author": "R3w1",
        "url": "https://www.reddit.com/r/grammar/comments/93k9ce/every_fish_have_has_bodies/",
        "text": "Every fish has bodies\n\nOr\n\nEvery fish have bodies\n\nI was overhearing a children's book being read and that sentance caught my attention. The book said \"Every fish have bodies\" which sounds incorrect... is it?",
        "created_utc": 1533084810,
        "upvote_ratio": ""
    },
    {
        "title": "Question about using a plural when you aren't referencing more than one",
        "author": "hiredgoon",
        "url": "https://www.reddit.com/r/grammar/comments/93js83/question_about_using_a_plural_when_you_arent/",
        "text": "For example, when speaking informally I might say, \"On take my child to work day, I had to take little Timmy home early because he was bothering others.\" \n\nIn this case, I don't really mean Timmy was bothering more than one person.  Rather he was bothering a single person, though perhaps he could have been bothering more than one person (but not the  primary meaning I intended to convey).  \n\nIs it reasonable for people to always interpret this as more than one person was being bothered or is it as reasonable to assume it is a reference to one \"other\".   \n\nIs there a way of describing this grammar or word choice issue?   \n\nThank you.",
        "created_utc": 1533081008,
        "upvote_ratio": ""
    },
    {
        "title": "Is it since or sense?!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/93jevy/is_it_since_or_sense/",
        "text": "[deleted]",
        "created_utc": 1533078158,
        "upvote_ratio": ""
    },
    {
        "title": "A group of pilots are scheduled for a meeting (Apostrophe usage?)",
        "author": "Sock_Eating_Golden",
        "url": "https://www.reddit.com/r/grammar/comments/93iiku/a_group_of_pilots_are_scheduled_for_a_meeting/",
        "text": "Management sent out an email about the upcoming \"Pilot's meeting.\" The singularpossessive apostrophe usage spurred a debate in the office. At first I thought that \"Pilots' meeting\" would be appropriate, as many pilots are having a meeting. Though the pilots don't own the meeting. So, \"Pilots meeting,\" may be the most correct. \n\nThough for now we settled on just, \"Pilot meeting.\"\n\nThanks for your thoughts. ",
        "created_utc": 1533071682,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for some help with hyphens, commas, and the better sentence...",
        "author": "archeopteryx",
        "url": "https://www.reddit.com/r/grammar/comments/93ibnd/looking_for_some_help_with_hyphens_commas_and_the/",
        "text": "This sentence was initially built in this way:\n\n&gt;Where else can you wait in a line two-days-long only to ultimately admit that it wasn’t so bad after all?\n\nBut, I feel like it doesn't read that well when written in this way, so I tried:\n\n&gt;&gt;Where else can you wait in a two-day-long line only to ultimately admit that it wasn’t so bad after all?\n\nI couldn't really decide if one was better than the other, or if the hyphens were making it worse.  So, after some restructuring, I came up with:\n\n&gt;Where else can you wait in one line, for two days, to complete a five-minute task, only to ultimately admit that it wasn’t so bad? \n\nI don't know.  I do know I'm overthinking this.  Thoughts?",
        "created_utc": 1533070366,
        "upvote_ratio": ""
    },
    {
        "title": "thats broken english right there, yeah?",
        "author": "MangoM8",
        "url": "https://i.redd.it/2v84tkg2jcd11.png",
        "text": "",
        "created_utc": 1533070124,
        "upvote_ratio": ""
    },
    {
        "title": "Slimy",
        "author": "doonlaker",
        "url": "https://www.reddit.com/r/grammar/comments/93i2gq/slimy/",
        "text": "What is the correct name for the resultant word when you add “y” to the end of a noun? Does it simply become an adjective? \n\ne.g.  \njunk - junky\nFilm - filmy\nSand - sandy",
        "created_utc": 1533068637,
        "upvote_ratio": ""
    },
    {
        "title": "Is it 1 lb or 1lbs? 2 lb or 2 lbs? Pound Problem",
        "author": "cat_glitch",
        "url": "https://www.reddit.com/r/grammar/comments/93gys8/is_it_1_lb_or_1lbs_2_lb_or_2_lbs_pound_problem/",
        "text": "Help! I'm reviewing an old catalog my company made years ago and using it to extract data for a new one. In it there is are variety of ways a pound is abbreviated. For a lot of items that are a pound it is written as 1 lb. or 1 lbs.  Is a period needed at the end of lb or lbs? Is one pound 1 lb or 1lbs? Is that the same for something that is more than a pound? I can't find any information on this. I even reached out to my old english professor and they aren't too terribly sure. \nThank you!!!! I really appreciate any feed back",
        "created_utc": 1533061115,
        "upvote_ratio": ""
    },
    {
        "title": "Mr. NAME or MR. NAME?",
        "author": "melissirl",
        "url": "https://www.reddit.com/r/grammar/comments/93goy2/mr_name_or_mr_name/",
        "text": "When a name is written in all caps, should the title (or suffix) be all caps? (e.g Mr. Dr. Jr. etc.)\n\nI make nametags, and we are trying to decide what the standard should be. It doesn't come up that often, so we don't have one yet. ",
        "created_utc": 1533059318,
        "upvote_ratio": ""
    },
    {
        "title": "Using superlatives with \"there be\"",
        "author": "PM_ME_ROBOT_KITTIES",
        "url": "https://www.reddit.com/r/grammar/comments/93gor2/using_superlatives_with_there_be/",
        "text": "I'm not a native speaker, but I've spoken English for a pretty long time. Sometimes, somethings sound wrong to me, but I not really sure if it's really wrong or I'm just not familiar with that particular construction.\n\nI ran into the phrase \"There are the best wines in Chile\". My immediate thought was that it was wrong, but I can't explain why.\n\nIs it really wrong? And if yes, why? Thanks in advance",
        "created_utc": 1533059282,
        "upvote_ratio": ""
    },
    {
        "title": "Customer's or Customers'",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/93g852/customers_or_customers/",
        "text": "[deleted]",
        "created_utc": 1533056228,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any grammatical reason why 'firefighter' is correct but 'tourguide' wouldn't be?",
        "author": "funnyapparition",
        "url": "https://www.reddit.com/r/grammar/comments/93f9u9/is_there_any_grammatical_reason_why_firefighter/",
        "text": "For another example, 'babysitter' is the accepted word but you wouldn't write 'cabdriver'. Is it just because some words are established as compounds and that's it? My SO and I got in a joke-fight about it (he thinks 'tourguide' is fine) and it seems wrong to me but I don't know what the actual grammatical argument would be. Help?",
        "created_utc": 1533049719,
        "upvote_ratio": ""
    },
    {
        "title": "[X-POST] TIL the letter J is as uncommon in English as the letter X. The only less common letters are Q and Z. -So would the English language be able to function without these 4 letters?",
        "author": "flipflopfeet",
        "url": "http://letterfrequency.org",
        "text": "",
        "created_utc": 1533046048,
        "upvote_ratio": ""
    },
    {
        "title": "\"Bring\" vs \"Bring to\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/93ejk0/bring_vs_bring_to/",
        "text": "[deleted]",
        "created_utc": 1533044260,
        "upvote_ratio": ""
    },
    {
        "title": "\"Who kissed whom\" or \"Who kissed who\"?",
        "author": "notrudedude",
        "url": "https://www.reddit.com/r/grammar/comments/93e558/who_kissed_whom_or_who_kissed_who/",
        "text": "I have made these graphs for who kisses who(m) for a few different TV shows. First I thought it was \"who kissed whom\" (I have learned to replace the word with her/him), but then someone commented I was wrong, so then I changed it to \"who kissed who\", but someone commented I was wrong again. So I really have no clue. Not a native speaker btw. ",
        "created_utc": 1533041017,
        "upvote_ratio": ""
    },
    {
        "title": "Can I refer to a body part as being insensitive?",
        "author": "RoyalWalrus112",
        "url": "https://www.reddit.com/r/grammar/comments/93cacm/can_i_refer_to_a_body_part_as_being_insensitive/",
        "text": "My coworker doesn't believe that you can, I.E my feet are insensitive. He doesn't think that's correct. Is it or how should I refer to the lack of sensation in a single part of the body",
        "created_utc": 1533021174,
        "upvote_ratio": ""
    },
    {
        "title": "Help with some simple grammar",
        "author": "Kejxifbensk",
        "url": "https://www.reddit.com/r/grammar/comments/93bimx/help_with_some_simple_grammar/",
        "text": "I'm wondering if this sentence is grammatically correct and if not what the correct way of wording this sentence would be\n\nThe sentence is \"Samantha nor I did anything wrong.\"\n\nAll suggestions/help will be appreciated",
        "created_utc": 1533012974,
        "upvote_ratio": ""
    },
    {
        "title": "Help me settle an argument",
        "author": "TheGreyTulip",
        "url": "https://www.reddit.com/r/grammar/comments/93a66w/help_me_settle_an_argument/",
        "text": "I don’t know if this is the right place to post this but please help me prove my boyfriend wrong (or prove me wrong). We are watching a show and one of the characters responds to someone else saying death threats are no big deal by saying “...why would a death threat be a big deal? Oh that’s right, ‘cause it threatens death.” \n\nNow I’m trying to explain to my boyfriend that I think that’s incorrect because a death threat THREATENS YOUR LIFE. He says that the wording is correct because it threatens you with death, but if that was that case the correct phrasing would be just that. It threatens YOU WITH death. Saying it threatens death is incorrect in my opinion but if I’m wrong please help me understand why because neither of us wants to budge so I want Reddit’s opinion to tell me whose actually correct.",
        "created_utc": 1533001039,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a saying/idiom for...",
        "author": "rebeday",
        "url": "https://www.reddit.com/r/grammar/comments/93a4os/looking_for_a_sayingidiom_for/",
        "text": "Hi! \n\nI'm racking my brains but can't pinpoint the exact idiom I'm trying to remember. I'm trying to express a person who says things just for the sake of saying something. It's a sort of instant gratification that they receive simply by getting their word out. I keep wanting to lip service or cheap talk, but these aren't correct. \n\nCan anyone help? Thank you!",
        "created_utc": 1533000705,
        "upvote_ratio": ""
    },
    {
        "title": "Laying or lying",
        "author": "TheHungryHeathen",
        "url": "https://www.reddit.com/r/grammar/comments/939ez7/laying_or_lying/",
        "text": "The cable was laying on the ground. \n\nOr,\n\nThe cable was lying on the ground. \n\nWhich is it and why? Thanks. ",
        "created_utc": 1532994921,
        "upvote_ratio": ""
    },
    {
        "title": "Is this incorrect: “The functionality of a MSO...”",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/938yxq/is_this_incorrect_the_functionality_of_a_mso/",
        "text": "It’s driving me crazy because I think there should be an “an” in front of “MSO”, but they keep using “a”.",
        "created_utc": 1532991458,
        "upvote_ratio": ""
    },
    {
        "title": "Does one “have” or “use” bad grammar?",
        "author": "ciel-nocturne",
        "url": "https://www.reddit.com/r/grammar/comments/938gkz/does_one_have_or_use_bad_grammar/",
        "text": "“They have bad grammar.” OR “They use bad grammar.”\n\nI was thinking about this example if you input a different noun instead:\n“She has a pencil.” Vs. “She uses a pencil.” \n\nSo would both of the examples with “bad grammar” work but have different meanings, like the pencil example?",
        "created_utc": 1532987710,
        "upvote_ratio": ""
    },
    {
        "title": "What grammar rule is this colloquially use?",
        "author": "unconnected3",
        "url": "https://www.reddit.com/r/grammar/comments/938e69/what_grammar_rule_is_this_colloquially_use/",
        "text": "This question I am asking I will admit is lacking. The post I will **admit's** wording could have been written better.\n\nAs a native speaker it sounds normal to say admit's wording outloud in this context. Is this just me shortening admit its to admit's? Or is there a grammar rule at usage. Or is this just me speaking outloud and having bad syntax leading to a misusage of English (The second sentence if written down seems clearly wrong, but when spoken outloud sounds more natural)",
        "created_utc": 1532987228,
        "upvote_ratio": ""
    },
    {
        "title": "What is the difference between defense and defence?",
        "author": "princeofeldar",
        "url": "https://www.reddit.com/r/grammar/comments/937x33/what_is_the_difference_between_defense_and_defence/",
        "text": "Maybe it can be asked before but as a non-native speaker it stuck to me and only place around I can learn it here. Thanks already.",
        "created_utc": 1532984006,
        "upvote_ratio": ""
    },
    {
        "title": "How to correctly say: \"I don't think there's anything we don't know who it belongs to.\"",
        "author": "Aleksik",
        "url": "https://www.reddit.com/r/grammar/comments/937nl5/how_to_correctly_say_i_dont_think_theres_anything/",
        "text": "\"I don't think there's *anything* we don't know who *it* belongs to.\"\n\nI don't know the first one's correct form.\n\nAlso, is this one correct:\n\n\"I don't think there's anything we don't know the owner of.\"\n\nThanks in advance  ;)",
        "created_utc": 1532982193,
        "upvote_ratio": ""
    },
    {
        "title": "Would this be a correct use of a semi-colon?",
        "author": "KratosOne",
        "url": "https://www.reddit.com/r/grammar/comments/937mul/would_this_be_a_correct_use_of_a_semicolon/",
        "text": "The three prongs of the trident symbolize the three principles of good government; Government of the people, government by the people, and for the people.\n",
        "created_utc": 1532982048,
        "upvote_ratio": ""
    },
    {
        "title": "Please tell me I'm not senile yet: \"The men and women of this department take great pride in providing direct and support police services to the nearly 42,000 citizens and the many thousands who work and visit X city every day.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/9377o0/please_tell_me_im_not_senile_yet_the_men_and/",
        "text": "[deleted]",
        "created_utc": 1532979232,
        "upvote_ratio": ""
    },
    {
        "title": "A weird situation where \"It's\" is used as a possessive instead of a contraction.",
        "author": "EddieMorraNZT",
        "url": "https://www.reddit.com/r/grammar/comments/9376zq/a_weird_situation_where_its_is_used_as_a/",
        "text": "One of my favorite games is called \"Getting Over It with Bennett Foddy.\" However, the title is frequently abbreviated to just \"Getting Over It.\" \n\nI was writing about the game's graphics, and I noticed that when I wrote \"Getting Over It's graphics,\" I used \"It's\" as a possessive, not a contraction. I figured some of you grammar nuts might be interested!",
        "created_utc": 1532979106,
        "upvote_ratio": ""
    },
    {
        "title": "How would punctuate the following question....",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/9374wc/how_would_punctuate_the_following_question/",
        "text": "[deleted]",
        "created_utc": 1532978707,
        "upvote_ratio": ""
    },
    {
        "title": "Why do computers always mark the word \"themself\" as incorrect",
        "author": "ToxicShardShock",
        "url": "https://www.reddit.com/r/grammar/comments/936whb/why_do_computers_always_mark_the_word_themself_as/",
        "text": "and always wants to spell \"themselves.\" It always throws me off.",
        "created_utc": 1532977184,
        "upvote_ratio": ""
    },
    {
        "title": "Appropriate Form of a Dash",
        "author": "randomthrowaway62019",
        "url": "https://www.reddit.com/r/grammar/comments/935zav/appropriate_form_of_a_dash/",
        "text": "What is the proper form of dash to use when indicating a specific university within a statewide university system, and why?\n\nUniversity of Missouri-St. Louis (hyphen)\n\nUniversity of Missouri–St. Louis (en dash)\n\nUniversity of Missouri—St. Louis (em dash)\n\nMy intuition says en dash, but I'm not sure, hence the question.",
        "created_utc": 1532970989,
        "upvote_ratio": ""
    },
    {
        "title": "\"Standardize\" vs \"Standardize on\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/935dmo/standardize_vs_standardize_on/",
        "text": "[deleted]",
        "created_utc": 1532966978,
        "upvote_ratio": ""
    },
    {
        "title": "Glomar Response for Multiple Parties (either/neither question)",
        "author": "D_Jinny",
        "url": "https://www.reddit.com/r/grammar/comments/935dgf/glomar_response_for_multiple_parties/",
        "text": "So the traditional Glomar response for a single party is: \"The group has neither confirmed nor denied the accusations.\"\n\nWhat if you have two parties? Would \"The accusations have been neither denied nor confirmed by either group 1 or group 2\", or would it be \"neither group 1 nor group 2\"?",
        "created_utc": 1532966943,
        "upvote_ratio": ""
    },
    {
        "title": "Though.",
        "author": "acaestadaro",
        "url": "https://www.reddit.com/r/grammar/comments/93452n/though/",
        "text": "I am not a native speaker of inglish. I love the word \"though\" but i dont know when is correct to use it. Can you help me to use it more often?\n",
        "created_utc": 1532958011,
        "upvote_ratio": ""
    },
    {
        "title": "My antivirus software wants me to “upgarde” my security. I know I should (upgrade), but this has me rethinking the decision...",
        "author": "coasting_along",
        "url": "https://i.redd.it/ebpbvam563d11.jpg",
        "text": "",
        "created_utc": 1532956824,
        "upvote_ratio": ""
    },
    {
        "title": "I don’t like you because you’re rich.",
        "author": "shawn_tai",
        "url": "https://www.reddit.com/r/grammar/comments/933yjn/i_dont_like_you_because_youre_rich/",
        "text": "Does this sentence mean “the reason I don’t like you is because you’re rich” or “it’s not because you’re rich that I like you. I like you for other reasons”? Is it [I don’t like you][because you’re rich] or [I don’t][like you because you’re rich]?",
        "created_utc": 1532956498,
        "upvote_ratio": ""
    },
    {
        "title": "'I like to do roller skates'",
        "author": "1caj",
        "url": "https://www.reddit.com/r/grammar/comments/933u6r/i_like_to_do_roller_skates/",
        "text": "How do I describe to my ESL student that this is not correct?  or is it correct?  Thanks in advance.",
        "created_utc": 1532955477,
        "upvote_ratio": ""
    },
    {
        "title": "\"All that that that that that man said was correct\", what is the meaning of each \"that\"?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/932obh/all_that_that_that_that_that_man_said_was_correct/",
        "text": "[deleted]",
        "created_utc": 1532943448,
        "upvote_ratio": ""
    },
    {
        "title": "Commas and quotation marks: when?",
        "author": "megaghost9",
        "url": "https://www.reddit.com/r/grammar/comments/932l8q/commas_and_quotation_marks_when/",
        "text": "I’m a little confused about using commas before quotation marks. Quite often I’ll see something like:\n\n*John always used to say, “I don’t care about baseball.”*\n\nBut I also see stuff like:\n\n*John always used to say “I don’t care about baseball.”*\n\nFrankly I prefer the second one, especially if the quote isn’t the end of the sentence. It feels like it flows better. Why is it that some writers don’t always use commas before quotations, and how do you know when and when not to? ",
        "created_utc": 1532942420,
        "upvote_ratio": ""
    },
    {
        "title": "Mark Nichol, a writer at Daily Writing Tips, discusses the best books on grammar and punctuation",
        "author": "FiveBooks",
        "url": "https://fivebooks.com/best-books/best-books-grammar-and-punctuation-mark-nichol/",
        "text": "",
        "created_utc": 1532935900,
        "upvote_ratio": ""
    },
    {
        "title": "Not an American, could anybody please see if this makes at least some sense?",
        "author": "throwaway1590721091",
        "url": "https://www.reddit.com/r/grammar/comments/930xlg/not_an_american_could_anybody_please_see_if_this/",
        "text": "I apologize for the throwaway, I am afraid that I can get recognized.\n\nThese are project descriptions. Please let me know if something here sounds just not right. Thank you!\n\n#### Project 'N'.\nA bot for a mobile game 'Name of the Game' used by hundreds of people from different countries across the globe.  \n\n#### 'N' Forums Monitor.\nA monitor for 'N' forum that collects activity information about the readers of a chosen subforum and provides insights about the best possible times to make posts.  \n\n#### Mobile game 'N'!\nThe objective of the game is to get as high up in the sky as possible avoiding different obstacles on the way.\n\n#### Demos of Physics Phenomena.\nA project intended to increase audience interest in physics through making material comprehension easier and more engaging.",
        "created_utc": 1532923830,
        "upvote_ratio": ""
    },
    {
        "title": "Who or Whom when both apply?",
        "author": "TomsAliens",
        "url": "https://www.reddit.com/r/grammar/comments/930r5s/who_or_whom_when_both_apply/",
        "text": "I'm writing a song that contains the line: \"I dream of someone (who/whom)'s not you\", and I don't know whether to use who or whom. I know the trick where you replace it with he/him, but both apply here. \n\nit's\n\"I dream of HIM\", not \"I dream of HE\"\nbut at the same time it's\n\"HE's not you\", not \"HIM's not you\"\n\nSo, in this situation, both are correct, but also incorrect. What do I do here?\n\n\n",
        "created_utc": 1532922118,
        "upvote_ratio": ""
    },
    {
        "title": "Were vs. Was (Subject-Verb Agreement)",
        "author": "bennyh6813",
        "url": "https://www.reddit.com/r/grammar/comments/930mgg/were_vs_was_subjectverb_agreement/",
        "text": "Which of these sentences are correct:\n\n\nLooking back at all of the different approaches/therapies for modifying behavior that were discussed in Module 15\n\nvs.\n\nLooking back at all of the different approaches/therapies for modifying behavior that was discussed in Module 15\n    \n",
        "created_utc": 1532920877,
        "upvote_ratio": ""
    },
    {
        "title": "Does this sentence make sense? Specifically the ending",
        "author": "Jmills2",
        "url": "https://www.reddit.com/r/grammar/comments/930h1f/does_this_sentence_make_sense_specifically_the/",
        "text": "To enhance a corporation’s income potential by utilizing statistical analysis on data and metrics to determine feasibility, make forecasts on future trends, and suggest improvement solutions. \n\nThis is my objective on my resume, and I'm not totally sure that last part makes sense \"and suggest improvement solutions\"    Is it because improvement and solutions are both nouns?",
        "created_utc": 1532919488,
        "upvote_ratio": ""
    },
    {
        "title": "Weird contradiction stuff going on.",
        "author": "night_shark_115",
        "url": "https://www.reddit.com/r/grammar/comments/92zn3i/weird_contradiction_stuff_going_on/",
        "text": "If I asked someone \"How little do you think I don't not anti dislike you\" and they said a lot, would that mean they thought I disliked them or liked them? ",
        "created_utc": 1532912068,
        "upvote_ratio": ""
    },
    {
        "title": "Couples shower or couples' shower",
        "author": "jellybeaner",
        "url": "https://www.reddit.com/r/grammar/comments/92zgsb/couples_shower_or_couples_shower/",
        "text": "Having a couples(') shower and am trying to work out the correct grammar. Google was no help. Thanks in advance. ",
        "created_utc": 1532910520,
        "upvote_ratio": ""
    },
    {
        "title": "Does the term \"Grammar Nazi\" enrage you?",
        "author": "GrammarNaziish",
        "url": "https://www.reddit.com/r/grammar/comments/92yqay/does_the_term_grammar_nazi_enrage_you/",
        "text": "I created this handle to post my grammar-related things, and got shadow-banned in another group because 1) they didn't like me correcting people's grammar in a non-grammar-related sub, and 2) a large number of people seemed enraged that I called myself a \"Grammar Nazi\", because of its associations with actual Nazis.\n\nDoes the term bother you?",
        "created_utc": 1532904036,
        "upvote_ratio": ""
    },
    {
        "title": "This resulted from your efforts vs This was resulted from your efforts.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/92yovf/this_resulted_from_your_efforts_vs_this_was/",
        "text": "[deleted]",
        "created_utc": 1532903701,
        "upvote_ratio": ""
    },
    {
        "title": "Test is a test",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/92ynaw/test_is_a_test/",
        "text": "[deleted]",
        "created_utc": 1532903339,
        "upvote_ratio": ""
    },
    {
        "title": "Studying for the GRE, can you check my comma use?",
        "author": "dude8462",
        "url": "https://www.reddit.com/r/grammar/comments/92xf6j/studying_for_the_gre_can_you_check_my_comma_use/",
        "text": "I hated English in high school, and it is kind of biting me in the but. That being said, I have a few sentences in no particular order that I would like some opinions on (all of a sudden I am paranoid about all my comma usage XD). \n\n* For example, coffee shops can be used to energize customers, as places to study, and as a social meeting place.\n* Before the owner of the local coffee shop decides to cut hours, he should investigate customer demographics, active hours, and employee needs.\n* Students may use the area to study, friends may come to relax, and some may be attracted to the simple coffee aroma. \n* Many employees are off on weekends, meaning there may be more customers using the store to relax, rather than trying to get energized.  (pretty use this one was wrong but I wasn't able to correct in during my trail run)\n\nThanks for the help!",
        "created_utc": 1532893420,
        "upvote_ratio": ""
    },
    {
        "title": "\"There Are Consequences To Killing a God\" Is this a correct use of grammar? Consequences to/of/for?",
        "author": "Zatouroffski",
        "url": "https://youtu.be/Cp4jGZ1vz2s?t=94",
        "text": "",
        "created_utc": 1532893374,
        "upvote_ratio": ""
    },
    {
        "title": "Past Perfect tense-",
        "author": "nemesisnicks",
        "url": "https://www.reddit.com/r/grammar/comments/92wvu9/past_perfect_tense/",
        "text": "If two actions happened in the past, it may be necessary to show which action happened before, earlier than the other. The simple past is used in one clause and the past perfect in the other; \n\nHow is this sentence correct- \nWhen I had my dinner I went to bed.\n\nIt should be like this- I went to bed when I had my dinner. ",
        "created_utc": 1532889179,
        "upvote_ratio": ""
    },
    {
        "title": "Do you have to you use \"the\" before \"English language\"?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/92wgr2/do_you_have_to_you_use_the_before_english_language/",
        "text": "For example:\n\n- English language is pretty stupid after all. \n- There are 15 Tenses in English language.",
        "created_utc": 1532885815,
        "upvote_ratio": ""
    },
    {
        "title": "When do you use a coma before the word \"though\" and when you don't?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/92w9e3/when_do_you_use_a_coma_before_the_word_though_and/",
        "text": "[deleted]",
        "created_utc": 1532884157,
        "upvote_ratio": ""
    },
    {
        "title": "My SO keeps using “costed” as the past tense of “cost.” Was there ever a historical usage of this word?",
        "author": "nsjersey",
        "url": "https://www.reddit.com/r/grammar/comments/92w2lh/my_so_keeps_using_costed_as_the_past_tense_of/",
        "text": "I know “costed” is correct when it means “to estimate or determine the cost of something.”  \n\nBut I seem to remember that “costed” can be used as the past tense of “cost,” and was done long ago. I had a search explaining it, but haven’t been able to re-locate it. ",
        "created_utc": 1532882658,
        "upvote_ratio": ""
    },
    {
        "title": "Is it grammatically correct to say \"A meteorite fell...\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/92vp8q/is_it_grammatically_correct_to_say_a_meteorite/",
        "text": "[deleted]",
        "created_utc": 1532879551,
        "upvote_ratio": ""
    },
    {
        "title": "Correct punctuation for eg. / e.g.?",
        "author": "drizzlydry",
        "url": "https://www.reddit.com/r/grammar/comments/92v2vi/correct_punctuation_for_eg_eg/",
        "text": "What is the correct punctuation for this sentence?\nI love doing outdoor activities with my wife (eg. Hiking, swimming and surfing.) and reading books. Is an eg. starting a sentence? No clue.\nAlso I don't know if eg. is even correct or whether it should be e.g. (which to me seems clunky to look at).",
        "created_utc": 1532874124,
        "upvote_ratio": ""
    },
    {
        "title": "Her hair was yellow and her eyes, blue.",
        "author": "miiucky",
        "url": "https://www.reddit.com/r/grammar/comments/92uw5j/her_hair_was_yellow_and_her_eyes_blue/",
        "text": "Does it need the comma???????????????????",
        "created_utc": 1532872410,
        "upvote_ratio": ""
    },
    {
        "title": "in a predicament / at a predicament",
        "author": "Syfogidas",
        "url": "https://www.reddit.com/r/grammar/comments/92tqny/in_a_predicament_at_a_predicament/",
        "text": "Is there a difference, or are they interchangeable?",
        "created_utc": 1532858062,
        "upvote_ratio": ""
    },
    {
        "title": "\"Money is the root of all evil\". Is this a passive sentence?",
        "author": "baconfrygood",
        "url": "https://www.reddit.com/r/grammar/comments/92tnmk/money_is_the_root_of_all_evil_is_this_a_passive/",
        "text": "",
        "created_utc": 1532856675,
        "upvote_ratio": ""
    },
    {
        "title": "what do I use, do or does, in this situation?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/92t7my/what_do_i_use_do_or_does_in_this_situation/",
        "text": "[deleted]",
        "created_utc": 1532850018,
        "upvote_ratio": ""
    },
    {
        "title": "I love you! --- Me too! OR -- You too!",
        "author": "zheyangtinghao",
        "url": "https://www.reddit.com/r/grammar/comments/92so0o/i_love_you_me_too_or_you_too/",
        "text": "If person A says \"I love you\"\n\nHow can person B respond? \n\n\"Me too\"\n\nor\n\n\"You too\"\n\nWhat do these mean, thanks! ",
        "created_utc": 1532842890,
        "upvote_ratio": ""
    },
    {
        "title": "Do I need commas here?",
        "author": "R3w1",
        "url": "https://www.reddit.com/r/grammar/comments/92slg7/do_i_need_commas_here/",
        "text": "&gt;Being at home, with her, makes me sad\n\n&gt;Being at home with her makes me sad\n\nDo I need commas here? Do the commas make sense?",
        "created_utc": 1532842088,
        "upvote_ratio": ""
    },
    {
        "title": "Large to small or small to large numerical value?",
        "author": "Rainoffire",
        "url": "https://www.reddit.com/r/grammar/comments/92shp8/large_to_small_or_small_to_large_numerical_value/",
        "text": "I am making a cancellation policy stating,\n\"Between 30 days to 16 days/16 days to 30 days prior, a 20% cancellation charge will be applied.\"      \nI am conflicted between the choices. Our reservation staff says the larger to smaller value is correct.      \nHowever, I feel that small to large value is the correct way.",
        "created_utc": 1532840849,
        "upvote_ratio": ""
    },
    {
        "title": "Semi Colon or Comma for separating these items in a list?",
        "author": "Jmills2",
        "url": "https://www.reddit.com/r/grammar/comments/92s0gb/semi_colon_or_comma_for_separating_these_items_in/",
        "text": "These are being listed as you see them on my resume.  Is what I have correct or should they both be commas, or both be semi colons?  The first set are a list of skills and the second set are my interests.\n\nAccess, PowerPoint, Word, Visio, Project, Tableau, InDesign, Google Digital Garage\n\nand\n\nTraveling; fishing; hiking; fantasy football; photography; pet care; gaming",
        "created_utc": 1532835688,
        "upvote_ratio": ""
    },
    {
        "title": "“If Weezer does..” vs. “If Weezer do..”",
        "author": "DavidxRussell",
        "url": "https://www.reddit.com/r/grammar/comments/92rne9/if_weezer_does_vs_if_weezer_do/",
        "text": "Do bands insist on a singular or plural verb?",
        "created_utc": 1532831896,
        "upvote_ratio": ""
    },
    {
        "title": "That vs who",
        "author": "porcupinesage",
        "url": "https://www.reddit.com/r/grammar/comments/92rijb/that_vs_who/",
        "text": "“You’re the one that doesn’t care about that.”\n\nIs this sentence grammatically correct? I was watching TV Series Suits’ S5E14 and Mike Ross says that. \n\nShouldn’t it be “You’re the one who doesn’t care about that?”\n\nI know it may be a small error but just wanted to clarify nonetheless :)",
        "created_utc": 1532830503,
        "upvote_ratio": ""
    },
    {
        "title": "Grammar 100",
        "author": "[deleted]",
        "url": "https://i.redd.it/9sr5rrdrbrc11.jpg",
        "text": "[deleted]",
        "created_utc": 1532813423,
        "upvote_ratio": ""
    },
    {
        "title": "Difference between \"She eventually...\" and \"Eventually, she...\"",
        "author": "lionsagechisel",
        "url": "https://www.reddit.com/r/grammar/comments/92pbym/difference_between_she_eventually_and_eventually/",
        "text": "How would you describe the difference between phrasing a sentence in these two ways? Is it just a stylistic choice? Is one more active than the other, and if so, why?\n\nAnother example would be something like...\"The dog ran out of the house after the party.\" VS \"After the party, the dog ran out of the house.\"\n\nBoth of them seem to be active sentences because the dog, the subject, comes before the verb, ran. ",
        "created_utc": 1532810985,
        "upvote_ratio": ""
    },
    {
        "title": "I can’t tell which is stupider.",
        "author": "RSTLNE3MCAAV",
        "url": "https://www.reddit.com/r/grammar/comments/92p3v2/i_cant_tell_which_is_stupider/",
        "text": "This is my problem sentence:\n\n“I can’t tell which is stupider, the comments to the tweet or the title of this post.”\n\nShould “is” be “are”?\n\n“I can’t tell which are stupider, the comments to the tweet or the title of this post.” \n\nOn one hand “comments” is plural but “title” is singular. Which conjugation of be should I use? ",
        "created_utc": 1532809129,
        "upvote_ratio": ""
    },
    {
        "title": "Interrogative or declarative?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/92oytd/interrogative_or_declarative/",
        "text": "[deleted]",
        "created_utc": 1532808005,
        "upvote_ratio": ""
    },
    {
        "title": "\"take care\" vs \"take care well\"",
        "author": "ajou",
        "url": "https://www.reddit.com/r/grammar/comments/92oo68/take_care_vs_take_care_well/",
        "text": "I have a friend who isn't fluent in English, and he usually says \"take care well\" to me when we say goodbye. I pointed out that he should just say \"take care\" instead, but I don't know exactly why it's wrong to say \"take care well\". I'm not exactly a grammar expert, but it feels wrong. If someone can please explain the reasoning behind my intuition, or tell me if I'm wrong, I'd greatly appreciate it. Thank you! ",
        "created_utc": 1532805587,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone give me an example of glib statement?",
        "author": "Mralmond45",
        "url": "https://www.reddit.com/r/grammar/comments/92ommc/can_someone_give_me_an_example_of_glib_statement/",
        "text": "I starting to feel like everything I say sounds too glib, but I never really know for sure. Does anybody know any examples of a statement that sounds glib?",
        "created_utc": 1532805235,
        "upvote_ratio": ""
    },
    {
        "title": "People need to stop misusing 'which'",
        "author": "TitanOverlos",
        "url": "https://www.reddit.com/r/grammar/comments/92o5jm/people_need_to_stop_misusing_which/",
        "text": "[removed]",
        "created_utc": 1532801506,
        "upvote_ratio": ""
    },
    {
        "title": "Beer or Beers?",
        "author": "gaelgeagom",
        "url": "https://www.reddit.com/r/grammar/comments/92ncxv/beer_or_beers/",
        "text": "You would not say you saw two ‘deers’ but people insist on pluralizing the frosty beverage. On top of sounding better, it’s a liquid so I don’t see any reason to pluralize it. It is not as if people drink the actual cans or bottles, why is it pluralized?",
        "created_utc": 1532795267,
        "upvote_ratio": ""
    },
    {
        "title": "\"He speaks perfect English\" or \"He speaks English perfectly\"?",
        "author": "R3w1",
        "url": "https://www.reddit.com/r/grammar/comments/92mzxp/he_speaks_perfect_english_or_he_speaks_english/",
        "text": "&gt;He speaks perfect English\n\n&gt;He speaks English perfectly\n\nWhich way would be grammatically correct? Do both of them work?",
        "created_utc": 1532792355,
        "upvote_ratio": ""
    },
    {
        "title": "\"I turn to Madeline, seated at my side.\" - Is this a dangling modifier?",
        "author": "StepW",
        "url": "https://www.reddit.com/r/grammar/comments/92m5jg/i_turn_to_madeline_seated_at_my_side_is_this_a/",
        "text": "See title.\n\nSemantically, it's pretty obvious that Madeline is the one referred to as being \"seated at my side\".\n\nBut *grammatically*, is this a dangling modifier? I.E. would the absolute phrase **\"seated at my side\"** link to **\"I\"** since that's the subject of the clause **\"I turn to Madeline\"**, or would the absolute phrase correctly be referring to Madeline?\n\nHelp is appreciated!",
        "created_utc": 1532784899,
        "upvote_ratio": ""
    },
    {
        "title": "Comparison of two different things",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/92lglh/comparison_of_two_different_things/",
        "text": "[deleted]",
        "created_utc": 1532777242,
        "upvote_ratio": ""
    },
    {
        "title": "\"On the morning of the day IN which [XYZ happens] \" vs \"On the morning on the day ON which [XYZ happens]\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/92l8iu/on_the_morning_of_the_day_in_which_xyz_happens_vs/",
        "text": "[deleted]",
        "created_utc": 1532774367,
        "upvote_ratio": ""
    },
    {
        "title": "Capitalization is key",
        "author": "[deleted]",
        "url": "https://i.redd.it/hhowayoibjc11.jpg",
        "text": "[deleted]",
        "created_utc": 1532766554,
        "upvote_ratio": ""
    },
    {
        "title": "Will vs shall vs would in future sentences",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/grammar/comments/92kmva/will_vs_shall_vs_would_in_future_sentences/",
        "text": "[removed]",
        "created_utc": 1532766100,
        "upvote_ratio": ""
    },
    {
        "title": "Why is the correct answer \"'d have\"? Why not \"had\"?",
        "author": "[deleted]",
        "url": "https://i.redd.it/wnpyue49bnc11.png",
        "text": "[deleted]",
        "created_utc": 1532764826,
        "upvote_ratio": ""
    },
    {
        "title": "I like all kind of movies/ all kinds of movies?",
        "author": "Rudy_Rhod",
        "url": "https://www.reddit.com/r/grammar/comments/92kd56/i_like_all_kind_of_movies_all_kinds_of_movies/",
        "text": "Which one is right? Thank you for your help :)",
        "created_utc": 1532762513,
        "upvote_ratio": ""
    }
]