[
    {
        "title": "A word or expression for \"something old disguised as a new thing\"",
        "author": "thatcuntcat",
        "url": "https://www.reddit.com/r/grammar/comments/yvvctq/a_word_or_expression_for_something_old_disguised/",
        "text": "I cant think of anything aghhhhhhh. I'll take as many guess as possible",
        "created_utc": 1668514216,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"couple of ...\" vs. \"couple...\"",
        "author": "luckyshot33",
        "url": "https://www.reddit.com/r/grammar/comments/yvtw3n/couple_of_vs_couple/",
        "text": "*It will take a couple of days.*\n\n*It will take a couple days.*\n\nDid the second version just evolve over time and has become acceptable? Are there instances when adding \"of\" does not make sense?",
        "created_utc": 1668510022,
        "upvote_ratio": 1.0
    },
    {
        "title": "English is so confusing",
        "author": "ElvenNeko",
        "url": "https://www.reddit.com/r/grammar/comments/yvsilr/english_is_so_confusing/",
        "text": "If there are maintenance, are there secondarytenance? \n\nHow many infants needed to form an infantry? \n\nCan you be underwhelmed, or just whelmed? \n\nIf you give psychotherapist some space, he will become a psycho the rapist? \n\nCan one bearly bear a bear, or bear is unbearable? \n\nIf you advance, how advanced you are? \n\nIf you making a pun, does that make you puny?",
        "created_utc": 1668505921,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coversion is a real word...right?",
        "author": "LuminousMushroom999",
        "url": "https://www.reddit.com/r/grammar/comments/yvrdd5/coversion_is_a_real_wordright/",
        "text": "I wanted to type this into something professional I'm working on and I wanted to confirm the spelling, but Google doesn't seem to believe that any such word exists, and my writing app keeps underlining it in red. I tried looking further into it, but all I can find are apps and websites correcting me to \"Conversion,\" which isn't even close to what I'm trying to say. For the record, I'm referring to \"Coversion\" as the standard form of \"Covert,\" as in \"Covert Operations.\" Please tell me this is a real word, or barring that, at least tell me what word I could use in it's place",
        "created_utc": 1668502329,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am dumb....Please help",
        "author": "IAMABLOODY",
        "url": "https://www.reddit.com/r/grammar/comments/yvplnx/i_am_dumbplease_help/",
        "text": "I am trying to buy a domain.",
        "created_utc": 1668495738,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Split infinitive vs. Split ???) -- She had to first complete Step A. ------ She did it by first completing Step A.",
        "author": "HenHanna",
        "url": "https://www.reddit.com/r/grammar/comments/yvokv5/split_infinitive_vs_split_she_had_to_first/",
        "text": "&gt; split in·fin·i·tive  [split inˈfinədiv] NOUN\n\n&gt; ----------       a construction consisting of an infinitive with an adverb or other word inserted between to and the verb,\n\n&gt; ------e.g.------     she seems to really like it.\n\n_______________________\n\nAre there ppl who complain about (object to)  the following [by  ADV.  verbing] , too ?     (is there a name for this construction?)\n\n_______________\n\n- She had to first complete Step A.\n- She did it by first completing Step A.\n\n_________________\n\n- She had to quickly complete Step A.\n- She did it by quickly completing Step A.",
        "created_utc": 1668492229,
        "upvote_ratio": 1.0
    },
    {
        "title": "“him” or “his”",
        "author": "oraclequery",
        "url": "https://www.reddit.com/r/grammar/comments/yvklcv/him_or_his/",
        "text": "I think I’ve been staring at this too long! Is it:\n“…in spite of his being sick.”\nor\n“…in spite of him being sick.”\n?",
        "created_utc": 1668480227,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help using “juxtaposition”",
        "author": "9negativecreep",
        "url": "https://www.reddit.com/r/grammar/comments/yvj8um/help_using_juxtaposition/",
        "text": "Is saying “Austen uses juxtaposition to contrast Captain Wentworth’s admirable character with negative adjectives” grammatically correct?",
        "created_utc": 1668476586,
        "upvote_ratio": 1.0
    },
    {
        "title": "When vs Whenever. Why are these becoming interchangeable?",
        "author": "Katt1922",
        "url": "https://www.reddit.com/r/grammar/comments/yvhf2q/when_vs_whenever_why_are_these_becoming/",
        "text": "I hear people using whenever in place of when and it drives me nuts! Should they be interchangeable? \n\nFor me “whenever” only denotes something happening over and over, where as when can be used for multiple instances or a single instance. \n\nExample of what I consider misuse:\nWhenever I turned 18, I had a party.\n\nIt seems like it’s becoming super normalized so I’m thinking maybe it’s fine grammatically?\n\nI still hate it.",
        "created_utc": 1668471614,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this sentence correct like this?",
        "author": "tomatoesarelife",
        "url": "https://www.reddit.com/r/grammar/comments/yvfq5x/is_this_sentence_correct_like_this/",
        "text": "Thank you for being more than who you have to be, and inspiring us to be all we can be.",
        "created_utc": 1668467272,
        "upvote_ratio": 1.0
    },
    {
        "title": "How should this sentence be formatted?",
        "author": "HabitatForHumanityAU",
        "url": "https://www.reddit.com/r/grammar/comments/yvfbet/how_should_this_sentence_be_formatted/",
        "text": "I'm writing an essay but this one sentence seems extremely awkward, and I can't think of how to format it to make it less awkward.\n\nThis paper seeks to answer the fundamental questions: How do firms finance their operations? And, How Should Firms Finance Their Operations? \n\nAny suggestions?",
        "created_utc": 1668466298,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is “chunk” a collective plural in US English?",
        "author": "spikyyellowwave",
        "url": "https://www.reddit.com/r/grammar/comments/yvc9no/is_chunk_a_collective_plural_in_us_english/",
        "text": "Hi all! I’m a native speaker from America and I’m twisting myself into knots over this…\nIn my notes I’ve written “a big chunk [of people] are…”. In the US we typically treat collective nouns as singulars, so I’m thinking it should be “a big chunk is.” But that just sounds wrong! Maybe I used “are” because I’m talking about people and it sounds more personal?\n\nCan any Americans (or anyone who knows more than me about linguistics!)  weigh in? Do we say “chunk is” or “chunk are”?!",
        "created_utc": 1668459170,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it grammatically sound to use the phrase, \"It was a long awaited exception this last Sunday\" in this context",
        "author": "WillingnessOk3438",
        "url": "https://www.reddit.com/r/grammar/comments/yvbptu/is_it_grammatically_sound_to_use_the_phrase_it/",
        "text": "I was conversing with a friend whose native tongue isn't English, although she has a good mastery of it. I commented to a picture of a warmer weather for this time of the season and she replied, \"It was a long awaited exception this last Sunday\".\n\nTo me, it sounds a little awkward because \"exception\" is not frequently used conversationally in this way. In addition, \"long awaited\" can imply long-expected, whereas exception is an anomaly -- something you rarely expect. It could also be the object in the sentence, but it doesn't sound intuitively right to me. I can think of better fitting words in this context, like \"respite\", for instance. I'm curious if some English majors can chime in on whether it's technically correct and why or why not.",
        "created_utc": 1668457916,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I use presently instead present?",
        "author": "Alttyyay",
        "url": "https://www.reddit.com/r/grammar/comments/yv89su/can_i_use_presently_instead_present/",
        "text": "\"at your presently self\" is this okay?",
        "created_utc": 1668450796,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Are we going home?\" vs \"We are going home?\"",
        "author": "WaltWhitman11",
        "url": "https://www.reddit.com/r/grammar/comments/yv89j9/are_we_going_home_vs_we_are_going_home/",
        "text": "One asks a direct question and the other can be a question or an answer depending on how it's said.\n\n\"We are going home?\"\n\n\"We are going home.\"\n\nIs there a formal name for this? Is it an indirect question, or is it just tonal?",
        "created_utc": 1668450782,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you call the action of being reflected?",
        "author": "RASPUTIN-4",
        "url": "https://www.reddit.com/r/grammar/comments/yv3pj5/what_do_you_call_the_action_of_being_reflected/",
        "text": "When you create a shadow it's called \"casting a shadow.\" Do you also \"cast a reflection\" whenever you stand near a mirror, or is it called something else?",
        "created_utc": 1668441760,
        "upvote_ratio": 1.0
    },
    {
        "title": "I never understand or understood?",
        "author": "ddmoneymoney123",
        "url": "https://www.reddit.com/r/grammar/comments/yv397a/i_never_understand_or_understood/",
        "text": "I can’t tell. Please help. Thumb up for you.",
        "created_utc": 1668440826,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is \"I tend to do gerunding\" gramatically correct English?",
        "author": "exxjob",
        "url": "https://www.reddit.com/r/grammar/comments/yv37w0/is_i_tend_to_do_gerunding_gramatically_correct/",
        "text": "",
        "created_utc": 1668440748,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are the function of \";\" and \"·\" in this type of expression?",
        "author": "Sandvos",
        "url": "https://www.reddit.com/r/grammar/comments/yv2p4s/what_are_the_function_of_and_in_this_type_of/",
        "text": "",
        "created_utc": 1668439678,
        "upvote_ratio": 1.0
    },
    {
        "title": "Loss of \"to be\" when using modal verbs in passive voice",
        "author": "brother_p",
        "url": "https://www.reddit.com/r/grammar/comments/yv1an4/loss_of_to_be_when_using_modal_verbs_in_passive/",
        "text": "I've noticed this trend increasingly over the past few years, though I can't say for sure when I first encountered it. Specifically, people have increasingly started dropping \"to be\" from modal verbs in the passive voice.\n\nFor example instead of: \"My computer **needs to be** fixed\" I see instead \"My computer needs fixed.\"\n\nMy questions:\n\n* Does anyone else notice this?\n* What is behind this?",
        "created_utc": 1668436738,
        "upvote_ratio": 1.0
    },
    {
        "title": "does this sentence make sense? how to reword if grammatically incorrect?",
        "author": "RestartMeow",
        "url": "https://www.reddit.com/r/grammar/comments/yv18ef/does_this_sentence_make_sense_how_to_reword_if/",
        "text": "The owner would be more inclined to voluntarily abide by your self-entitled imposition on their private/ personal property(s) under a less hostile encroachment by one cowardly individual that remains adamant to hypocritical anonymity.",
        "created_utc": 1668436597,
        "upvote_ratio": 1.0
    },
    {
        "title": "Excuse me, is there any English text error in this news release? And do people who are not good at English think that this news release is poorly written? Or do people with poor English feel that this news release is written in common English while Americans and British write in dialect? Ha ha!",
        "author": "Informal-Strategy-21",
        "url": "https://www.reddit.com/r/grammar/comments/yv04st/excuse_me_is_there_any_english_text_error_in_this/",
        "text": "In August this year, Chinese ocean going fishing vessels and law enforcement vessels of the United States Coast Guard clashed on the high seas, and the incident took place on the high seas near the Galapagos Islands! At that time, the US patrol ship \"James\" asked for boarding inspection of Chinese ocean going fishing vessels that were fishing -- and then three Chinese ocean going fishing vessels accelerated to leave, and one of them turned around and hit the \"James\", forcing the latter to evade. According to American media reports, the officers and soldiers of an American law enforcement ship named \"James\" boarded and inspected some Chinese ocean going fishing vessels, and the Coast Guard officers in charge of commanding operations said proudly that at that time, \"the Chinese fishing vessels tried to escape\", but they successfully completed the task. In addition, a Chinese ocean going fishing vessel trying to escape almost ran into the US law enforcement ship named \"James\" in order to \"avoid inspection\", and a \"fierce confrontation\" broke out between the two sides. The US Coast Guard said: \"It is illegal for Chinese fishing vessels to engage in\" illegal, unreported and unregulated \"fishing activities, so members of the US Coast Guard forcibly boarded the fishing vessels for inspection.\". However, during this period, the Chinese ocean going fishing vessels refused the request of the US law enforcement ship, and accelerated to leave the relevant sea area. Another ocean going fishing vessel turned its bow and rushed towards the US law enforcement ship, almost hitting. Subsequently, the US law enforcement ship immediately took relevant measures.",
        "created_utc": 1668434206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else irked by the use of \"addicting\" instead of \"addictive\"?",
        "author": "PoesMyHardAsb",
        "url": "https://www.reddit.com/r/grammar/comments/yuvhkl/anyone_else_irked_by_the_use_of_addicting_instead/",
        "text": "I get so peeved when people say stuff like, \"This game is so addicting.\" I've never heard people use that form of the word until a few years ago. I don't like how it sounds.\n\nTo be fair, I don't even know if there is a \"correct' usage of the word - using \"addicting\" could be right for all I know.   \nThe switch from \"addictive\" to \"addicting\" feels like it came out of the blue though, and I have no idea why people have started adopting it.",
        "created_utc": 1668422499,
        "upvote_ratio": 1.0
    },
    {
        "title": "present perfect + conjunction + reduced cluse (seeing)",
        "author": "Medical_Ad_3855",
        "url": "https://www.reddit.com/r/grammar/comments/yuuopd/present_perfect_conjunction_reduced_cluse_seeing/",
        "text": "&amp;#x200B;\n\nis seeing a reduced cluse? what would be the complete sentence instead of seeing? it cannot be dependent to the verb \\*has\\* because if it was then it should be \\*seen\\* not \\*seeing\\*. \n\n&amp;#x200B;\n\nThe use of mobile phones and tablets for viewing purposes has increased by almost three quarters to 26% and tablet use seeing an almost four-fold increase to 19%.",
        "created_utc": 1668420238,
        "upvote_ratio": 1.0
    },
    {
        "title": "is this a sentence fragment: Fred was leaning over the geraniums. His backside in the air, head lost in the shrubbery.",
        "author": "AlbertCMagnus",
        "url": "https://www.reddit.com/r/grammar/comments/yuquf4/is_this_a_sentence_fragment_fred_was_leaning_over/",
        "text": "why is 'shrubbery' not a finite verb?",
        "created_utc": 1668406796,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do bullet lists mean ‘and’ or ‘or’?",
        "author": "Potential-Airline417",
        "url": "https://www.reddit.com/r/grammar/comments/yuqrzg/do_bullet_lists_mean_and_or_or/",
        "text": "I’m struggling to interpret this bullet list. Extra confused by the grammar at the end of each point, some including the word ‘and’. Which of the below three options is the correct interpretation? You are allowed to provide only one toilet if:\n1. all of those bullet points are met\n2. one (or more) of those bullet points are met\n3. a specific combination of those bullet points are met\nSorry if this is confusing, I don’t know how else to ask this!\n\nText:\n\nEmployers may provide for the use of employees, one toilet if:\n\n • The maximum number of persons of either sex, engaged or employed at any one time is fewer than 10.\n• It is completely enclosed, to ensure privacy;\n• It has an inside lock; and\n• Provision is made for the disposal of sanitary towels; and\n• It does not contain a urinal.\n\nWhere circumstances warrant, an employer may arrange to share facilities with other employers.\nAny toilets provided by an employer that are open to or available for use by members of the public should not be taken into account for the purpose of determining whether sufficient conveniences have been provided.",
        "created_utc": 1668406558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is speculation used correctly in this sentence?",
        "author": "chellybelly2619",
        "url": "https://www.reddit.com/r/grammar/comments/yuow58/is_speculation_used_correctly_in_this_sentence/",
        "text": "boyfriend and i have a slight disagreement. \n\nMe: are you going on monday or tuesday?\n\nHim: i don’t know. i wanted to talk with you and create some speculation \n\n\nis this the proper use of the word speculation?\n\nwould it work if it was phrased “i wanted to talk to you and speculate”?\n\nis speculation different from speculate?\n\nthank you so much",
        "created_utc": 1668400379,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did you hear the meeting with the Board of Directors 1) is moved 2) was moved 3) was moving 4) is moving to three P.M. today?",
        "author": "Mauer13",
        "url": "https://www.reddit.com/r/grammar/comments/yuov11/did_you_hear_the_meeting_with_the_board_of/",
        "text": "",
        "created_utc": 1668400279,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I use a comma, semi-colon, or colon here?",
        "author": "Lmzerped",
        "url": "https://www.reddit.com/r/grammar/comments/yuo9cj/do_i_use_a_comma_semicolon_or_colon_here/",
        "text": "Hey, I'm writing a short paper for my English class and I'm not sure what punctuation to use for one sentence.\n\nThe sentence says \"Compared to the twentieth century, Europe is now much older, denser, and urbanized, resulting in a much different Europe today.\"\n\nWhat should I put between urbanized and resulting and why? I've been reading rules on punctuation but I'm struggling a bit with this specific example. Thank you so much!",
        "created_utc": 1668398441,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hyphenating noun-noun compound adjectives",
        "author": "PurulentPaul",
        "url": "https://www.reddit.com/r/grammar/comments/yunmlp/hyphenating_nounnoun_compound_adjectives/",
        "text": "So I read somewhere that when a compound noun that usually has a space is used as an adjective (ie before another noun), a hyphen should be added for clarity. For example,\n\nIce cream -&gt; Ice-cream shop\n\nFire hydrant  -&gt; Fire-hydrant manufacturer\n\nNerve agent -&gt; Nerve-agent antidote\n\nIt's pretty hard for me to imagine someone confusing the compound noun being \"cream shop\" or \"hydrant manufacturer\" in these situations. Is this correct practice?",
        "created_utc": 1668396573,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone tell me the figurative techniques used in these quotes?",
        "author": "Betasoup_YT",
        "url": "https://www.reddit.com/r/grammar/comments/yun1l5/can_someone_tell_me_the_figurative_techniques/",
        "text": "There's something in our world that makes men lose their heads...when it's a white man’s word against a black man’s, the white man always wins.\n\n“The one place where a man ought to get a square deal is in a court-room, be he any colour of the rainbow, but people have a way of carrying their resentments right into a jury box.” (243)\n\n“I ain’t ever seen any jury decide in favour of a coloured man over a white man” (230)\n\nNaw, Jem, I think there’s just one kind of folks. Folks.”\n\n“What's rape?” ()\n\n“Well, it'd be sort of like shootin' a mockingbird, wouldn't it?” () ",
        "created_utc": 1668394881,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Is high quality\" or \"Are high quality\"",
        "author": "adalgar1224",
        "url": "https://www.reddit.com/r/grammar/comments/yum14k/is_high_quality_or_are_high_quality/",
        "text": "My wife and I have a slight disagreement, which of the below is more correct when referring to a specific brand?\n\n\"I like them because their clothes is high quality.\"\n\nOR\n\n\"I like them because their clothes are high quality.\"",
        "created_utc": 1668391971,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help with proper capitalization, a bit urgent :) Thank you in advance :)",
        "author": "KoolAidJammers_Grape",
        "url": "https://www.reddit.com/r/grammar/comments/yulkqu/please_help_with_proper_capitalization_a_bit/",
        "text": "When referring to Count Dracula, would I say:\n\n \"a prisoner to the corrupt count.\"\n\nor\n\n \"a prisoner to the corrupt Count.\"",
        "created_utc": 1668390736,
        "upvote_ratio": 1.0
    },
    {
        "title": "That's where we'll meet, somewhere under the stars. In Eternal Dark",
        "author": "MODman01",
        "url": "https://www.reddit.com/r/grammar/comments/yui7z0/thats_where_well_meet_somewhere_under_the_stars/",
        "text": "What is the correct way to write this sentence?  \n\n\n'That's where we'll meet, somewhere under the stars.\n\nIn Eternal Dark'  \n\n\nIt is a small thing I wrote for a friend passing.",
        "created_utc": 1668381711,
        "upvote_ratio": 1.0
    },
    {
        "title": "Settle a bet",
        "author": "eamoselwardo",
        "url": "https://www.reddit.com/r/grammar/comments/yufoly/settle_a_bet/",
        "text": "\"One runner fainted during the race. She ........ enough water. \" She hadn't been drinking'' or \"she hadn't drunk\"?",
        "created_utc": 1668376494,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would you call the words “to be” in a sentence?",
        "author": "ohjessica",
        "url": "https://www.reddit.com/r/grammar/comments/yudugs/what_would_you_call_the_words_to_be_in_a_sentence/",
        "text": "For example, if I say “This drawer needs to be fixed” instead of “This drawer needs fixed,” what would the “to be” part of the sentence be called?",
        "created_utc": 1668372810,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about chronological transitions",
        "author": "JohhnyDVS",
        "url": "https://www.reddit.com/r/grammar/comments/yudtr6/question_about_chronological_transitions/",
        "text": "When using chronological transition words such as “first, second, third” how far can I continue? For example can I continue by using fourth, fifth and sixth?",
        "created_utc": 1668372764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Punctuations",
        "author": "Pink_Moone-stone",
        "url": "https://www.reddit.com/r/grammar/comments/yudojs/punctuations/",
        "text": "I just received feedback on one of my submissions, and the main thing pointed out was my punctuations. These were some of the sentences:\n\n “Unravelling GPCRs and Beta-arrestins lock-and-key interaction for drug development”\n\n“Lack of regulation in these signalling cascades are associated with pathologies, such as cancer” \n\nI guess I don’t really understand why this is wrong, so would be nice with an explanation for future reference",
        "created_utc": 1668372474,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why can't we just call them builds instead of buildings?",
        "author": "bobbyamillion",
        "url": "https://www.reddit.com/r/grammar/comments/yu7um1/why_cant_we_just_call_them_builds_instead_of/",
        "text": "",
        "created_utc": 1668359961,
        "upvote_ratio": 1.0
    },
    {
        "title": "who is first in line vs which of you is first in line",
        "author": "dickiebirdington",
        "url": "https://www.reddit.com/r/grammar/comments/yu74nq/who_is_first_in_line_vs_which_of_you_is_first_in/",
        "text": "A student asked what is the difference here. \n\nI have no idea how to get explain it. Help me please!",
        "created_utc": 1668358294,
        "upvote_ratio": 1.0
    },
    {
        "title": "When referring to someone by their past rank…",
        "author": "XkommonerX",
        "url": "https://www.reddit.com/r/grammar/comments/yu5od8/when_referring_to_someone_by_their_past_rank/",
        "text": "Writing a formal letter about a military member. When I knew them they were a Sergeant but have since been promoted. Do I refer to them in the letter as “former Sergeant X” or “then Sergeant X” or something else? I do need to refer to them by rank at least in the beginning of the letter.",
        "created_utc": 1668355206,
        "upvote_ratio": 1.0
    },
    {
        "title": "“The first time he met Thomas was in prison.”",
        "author": "Anoniimuzz",
        "url": "https://www.reddit.com/r/grammar/comments/yu42qc/the_first_time_he_met_thomas_was_in_prison/",
        "text": "Is this a correct sentence?",
        "created_utc": 1668351670,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘The boy who bullied other children was punished.” “There is a man at the door who wants to see you.” Why restrictive clauses?",
        "author": "Kid_Charlema9ne",
        "url": "https://www.reddit.com/r/grammar/comments/yu3zqw/the_boy_who_bullied_other_children_was_punished/",
        "text": "Those sentences were used as examples for restrictive clauses (and not simply because commas weren’t used).  I don’t see how either relative clause is essential to the meaning of the main clause.  The boy was punished.  He was also a bully. There is a man at the door.  He also wants to see you. To me, the relative clauses are extra information.  Why were these classified as restrictive clauses?  Again, the book wasn’t trying to tell you to take a clue from the lack of commas.  Thanks for your help.",
        "created_utc": 1668351500,
        "upvote_ratio": 1.0
    },
    {
        "title": "AI Powered Writing Assistant - A Native Mac App",
        "author": "juliarmg",
        "url": "https://www.reddit.com/r/grammar/comments/yu16m8/ai_powered_writing_assistant_a_native_mac_app/",
        "text": "Hello,\n\nI wanted to bring you an AI writing/research tool I built. I hope this community will find it useful. Unlike other AI tools, I built a native Mac app to have tight integration with the OS. It uses the GPT-3 model behind the scenes to allow users to brainstorm and write any type of business content. The top features are,\n\n1.  Fix grammar mistakes on any piece of text.\n    \n2.  Rewrite your content into 5 different tones without leaving your favorite editor.\n    \n3.  Write with AI. Give hints or just ask it to continue writing.\n    \n4.  Generate summaries and counter-arguments for any content.\n    \n\nThe major differences with other AI tools are,\n\n1.  You use your own OpenAI API keys, hence budget friendly.\n    \n2.  You can use AI assistance across your favorite applications on Mac. No need to switch windows or change your workflow.\n    \n3.  It has many utility tools to help business people, such as Google sheet/Excel formula generator, Keynote presentation creator, reply to emails, and so on.\n    \n4.  Keyboard shortcuts and Spotlight integration support make it even easier to write/rewrite content.\n    \n\n[https://elephas.app](https://elephas.app) is the website.\n\nI am looking forward to your support and feedback",
        "created_utc": 1668344833,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who is correct?",
        "author": "Odballl",
        "url": "https://www.reddit.com/r/grammar/comments/ytyynk/who_is_correct/",
        "text": "Expressing \"work hours\" as a continuous variable or [Stannis Baratheon whispering \"fewer\"?](https://imgur.com/a/zl6XpKo)?",
        "created_utc": 1668338774,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is “key” occasionally acceptable without an article?",
        "author": "kajma",
        "url": "https://www.reddit.com/r/grammar/comments/ytxdik/why_is_key_occasionally_acceptable_without_an/",
        "text": "As in “concentration is key.”",
        "created_utc": 1668333860,
        "upvote_ratio": 1.0
    },
    {
        "title": "Per or as per?",
        "author": "J-hope9326",
        "url": "https://www.reddit.com/r/grammar/comments/ytx7t7/per_or_as_per/",
        "text": "Which is correct, AS PER internal monitoring or PER internal monitoring?",
        "created_utc": 1668333387,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the subject and object of this sentence?",
        "author": "X4Bugsy4X",
        "url": "https://www.reddit.com/r/grammar/comments/ytwe7c/what_is_the_subject_and_object_of_this_sentence/",
        "text": "Economic hardship caused many 19th century Europeans wanting a better life to immigrate to the US.",
        "created_utc": 1668330703,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is \"unstuck yourself!\" grammatically sound?",
        "author": "pumnezeu",
        "url": "https://www.reddit.com/r/grammar/comments/ytvvv9/is_unstuck_yourself_grammatically_sound/",
        "text": "Hello, non-native english speaker here, would someone mind explaining to me if this syntagm is correct? I can't put my finger on it, but  it sounds completely wrong to me.  \n\n\nTried finding other verbs that would behave similarly but couldn't identify any as of yet :)",
        "created_utc": 1668328642,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning never stops/stop ?",
        "author": "ddmoneymoney123",
        "url": "https://www.reddit.com/r/grammar/comments/ytu8ev/learning_never_stopsstop/",
        "text": "Why is learning never stops(plural) but if you say “ learning stop(singular) \n\nHow does the meaning change if I add S vs no S ?",
        "created_utc": 1668322335,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"You'll start in to race..\"",
        "author": "PSyCHoHaMSTeRza",
        "url": "https://www.reddit.com/r/grammar/comments/ytt0yk/youll_start_in_to_race/",
        "text": "In \"Oh, the Places You'll Go\" by Dr Seuss, there is a part that goes: \n\n\"You can get so confused\n that you'll start in to race\ndown long wiggled roads\nat a break-necking pace\"\n\nThat \"you'll start in to race\" bit bothers me. Why did he write it that way? It would make more sence to just remove the word \"in\" won't it?",
        "created_utc": 1668318055,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"buttstroked\" and \"buttstruck\" versus \"buffaloed\" and \"pistol-whipped\"",
        "author": "postgygaxian",
        "url": "https://www.reddit.com/r/grammar/comments/ytr8kg/buttstroked_and_buttstruck_versus_buffaloed_and/",
        "text": "For many readers, \"butt\" means \"buttocks\" or \"posterior region\" and \"stroke\" means \"touch gently.\" Thus when most people see \"butt\" and \"stroke\" in the same sentence, they expect to see something like \"Mary stroked the cat's butt,\" or \"John stroked Mary's butt,\" or \"The cat tried to stroke John's butt, but its claws drew blood accidentally.\"\n\n\nFor some reason, however, the act of striking a combatant with a rifle-stock is not called a \"stock-strike\"; it is called a \"buttstroke.\" Thus when reading sworn testimonies regarding close-quarters combat, one comes across awkward constructions such as \"I was out of ammunition, so I buttstroked him once, and he stopped fighting; I assumed he was still alive but unconscious. Later we discovered he was dead. I don't know whether my buttstroke killed him, or whether he died while unconscious.\"\n\nSee also:\n\nhttps://military-history.fandom.com/wiki/Buttstroke\n\nOnce one has accepted the premise that this combat maneuver is called a \"buttstroke,\" the problem of using this as a verb is unsettling.  \"I buttstroked the enemy\" sounds horrible, as does \"I buttstruck the enemy.\" The verbs \"buttslam\" and \"buttsmash\" do not seem to clarify the intended meaning. \"Stockslam\" and \"stocksmash\" sound euphonious enough, but they appear in no dictionaries and thus if I were to use them, people would have to ask me what I meant, and would finally say, \"Oh! You are talking about buttstroking!\"\n\n\nIn the 19th century, a strike with the barrel or side of a pistol was sometimes called \"buffaloing.\"\n\nQuote:\n\n\n&gt;pistol-whipping should be done with the gun held in an ordinary manner, hitting the target with an overhand strike from either the long, heavy barrel of the gun or the side of the gun in the area of the cylinder. It was a fairly common and highly successful way to knock a man unconscious (assisted by the heavy weight of the handguns of the day), and was known as \"buffaloing\", with the verb form being \"to buffalo\".[3][4] This form of pistol-whipping with an 1860s-style revolver was tested on the Spike TV television show Deadliest Warrior.[5] The testers showed that using the long barrel of a Colt revolver in a whipping motion produced enough force to fracture a skull and could potentially kill a man with a single blow. In modern times, pistols are much more compact, typically extending no more than approximately four inches past the trigger, making them much less suitable for pistol-whipping with the barrel than their predecessors. Because of this, pistol-whipping is now mainly performed by hitting a person with the base of the grip while still holding it normally, striking in a downwards motion. This adds the weight of the gun to the force of the blow and allows the metal frame (rather than the barrel) to be the point of impact but deprives the blow of the leverage provided by barrel length. \n\n\nhttps://military-history.fandom.com/wiki/Pistol-whipping\n\n\nHowever, buttstroking is not the rifle analog of buffaloing. The rifle version of buffaloing would be a strike with the barrel of the rifle.  Buttstroking with a rifle is highly analogous to pistol-whipping with the butt of a pistol.  However, I don't think anyone would be willing to refer to buttstroking as \"rifle-whipping.\"",
        "created_utc": 1668312078,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does the phrase \"vassal of horror\" mean? Can someone please break it down for me?",
        "author": "Epic-JackyWen",
        "url": "https://www.reddit.com/r/grammar/comments/ytr88i/what_does_the_phrase_vassal_of_horror_mean_can/",
        "text": "",
        "created_utc": 1668312051,
        "upvote_ratio": 1.0
    },
    {
        "title": "real quick, i dont know why im brain farting",
        "author": "howdoiusereddit50",
        "url": "https://www.reddit.com/r/grammar/comments/ytr596/real_quick_i_dont_know_why_im_brain_farting/",
        "text": "which is correct: \n\n  A targeted plan entails that people who make under a certain amount of income would be relieved of **all, or close to all,** amounts of student debt. \n\n  A targeted plan entails that people who make under a certain amount of income would be relieved of **all, or close to all** amounts of student debt,  \n\nand: \n\n People have come to the conclusion that colleges should **encourage, not punish** the diversity...\n\n People have come to the conclusion that colleges should **encourage, not punish,** the diversity...",
        "created_utc": 1668311808,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where is the ATM machine/an ATM machine?",
        "author": "Dry_Age_5674",
        "url": "https://www.reddit.com/r/grammar/comments/ytpzcr/where_is_the_atm_machinean_atm_machine/",
        "text": "Where is \n\na) the ATM machine?\n\nb) an ATM machine?\n\nwhich one is correct?\n\n&amp;#x200B;\n\nthx in advance.",
        "created_utc": 1668308127,
        "upvote_ratio": 1.0
    },
    {
        "title": "I donated a hundred dollars/hundred dollars/a hundred dollar.",
        "author": "Dry_Age_5674",
        "url": "https://www.reddit.com/r/grammar/comments/ytog0k/i_donated_a_hundred_dollarshundred_dollarsa/",
        "text": "I donated \n\na) a hundred dollars\n\nb) hundred dollars\n\nc) a hundred dollar\n\nwhich one is correct?\n\n&amp;#x200B;\n\nThanks in advance for your answer.",
        "created_utc": 1668303465,
        "upvote_ratio": 1.0
    },
    {
        "title": "We'll submit a proposal once the inspection phase is complete/completed",
        "author": "ddmoneymoney123",
        "url": "https://www.reddit.com/r/grammar/comments/ytneqj/well_submit_a_proposal_once_the_inspection_phase/",
        "text": "is it complete or completed? which one is correct and why ? for me I think it's \"completed\"",
        "created_utc": 1668300430,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Doing\" and \"overdoing\"",
        "author": "ResponsibleLow7781",
        "url": "https://www.reddit.com/r/grammar/comments/ytlfgk/doing_and_overdoing/",
        "text": "I was wondering if both *knead* and *grind* sound OK with the verbal preffix *over-* in the following sentences:\n\n&gt; (1a) Don’t knead the dough to a hard lump!\n&gt; \n&gt; (1b) Don’t over-knead the dough to a hard lump!\n&gt; \n&gt; (2a) Don’t grind the coffee beans to powder!\n&gt; \n&gt; (2b) Don’t over-grind the coffee beans to powder!",
        "created_utc": 1668294990,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need someone to proofread a second chance letter to work",
        "author": "Ice2045",
        "url": "https://www.reddit.com/r/grammar/comments/ytl10v/need_someone_to_proofread_a_second_chance_letter/",
        "text": "As stated, Im posting this on behalf. Letter is finished and Im hoping someone could shed some light and see if the letter will execute well enough to give colleague a chance to come back. DM me if interested. Thanks",
        "created_utc": 1668293967,
        "upvote_ratio": 1.0
    },
    {
        "title": "does this sentence make sense ?",
        "author": "wowchowe",
        "url": "https://www.reddit.com/r/grammar/comments/ytkrod/does_this_sentence_make_sense/",
        "text": "\"it's up to you to judge what you think will help me.\"",
        "created_utc": 1668293283,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you omit (BE) in this sentence? If so, why?",
        "author": "i_simp_for_potatoes",
        "url": "https://www.reddit.com/r/grammar/comments/ytjgoj/can_you_omit_be_in_this_sentence_if_so_why/",
        "text": "I was helping a friend with some of their Latin assignments the other day. One of the sentences translated to \" no avarice is without punishment.\" I insisted on omitting \"is\" from the sentence as it sounded better in my head. Honestly, leaving \"is\" in that sentence sounded weird to me for whatever reason. They got their assignment graded today and we went to check it. Only to find out that one of their professor's corrections was adding \"is\" to that sentence. Most of the corrections felt nitpicky and some of them sounded wrong, but I can't say anything based on how they sound to me without having some good evidence. \n\nSo my question is \" is it grammatically correct to omit the word \"is\" from that sentence? And if so, why? \".",
        "created_utc": 1668289982,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about the proper punctuation of possessives",
        "author": "Fifalife18",
        "url": "https://www.reddit.com/r/grammar/comments/ytj10f/question_about_the_proper_punctuation_of/",
        "text": "I know that it is correct to write:\n\nI borrowed a friend of mine's bike.\n\nIs it correct to write:\n\nI borrowed a friend of mine's son at work's bicycle.",
        "created_utc": 1668288863,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please let me know if this is correct phrasing",
        "author": "Kolos182",
        "url": "https://www.reddit.com/r/grammar/comments/ytiyhs/please_let_me_know_if_this_is_correct_phrasing/",
        "text": "\"Sims game makers don't have to spend money on **other than simlish language voiceovers**\".   \nIn this case \"other than simlish language voiceovers\" by meaning is the same as \"languages that are not simlish\". For some reason I prefer first case, is it grammatically correct?",
        "created_utc": 1668288690,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Borne of\" or \"Born of\" success",
        "author": "EmpireStrikes1st",
        "url": "https://www.reddit.com/r/grammar/comments/ytgpwh/borne_of_or_born_of_success/",
        "text": "Which is correct?\n\nThe context is: stages of decline.\n\nPride borne of/born of success is step one. So we become too proud because we are successful, and that causes decline.",
        "created_utc": 1668282966,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this correct? \"Afar the church, hurried the leper.\"",
        "author": "Osborne-Swif",
        "url": "https://www.reddit.com/r/grammar/comments/ytg69b/is_this_correct_afar_the_church_hurried_the_leper/",
        "text": "",
        "created_utc": 1668281514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using \"with\" twice.",
        "author": "Favoniuz7",
        "url": "https://www.reddit.com/r/grammar/comments/yteg52/using_with_twice/",
        "text": "I'm not sure if this is the proper way to form this sentence. \"... working WITH people WITH the necessary experience...\" Is that the proper way for that sentence or do I need to change it?",
        "created_utc": 1668277040,
        "upvote_ratio": 1.0
    },
    {
        "title": "sesquipedalian dummies",
        "author": "sowatifuranazz",
        "url": "https://www.reddit.com/r/grammar/comments/yte9wo/sesquipedalian_dummies/",
        "text": "Instant access to the internet has bred an entire generation on people trying to dazzle and confuse people with bullshit ! Misusing words just makes you look stupid to those who actually articulate effectively without resorting to such childish antics",
        "created_utc": 1668276594,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"My mom and I are going to the store\" or \"My mom and me are going to the store\"",
        "author": "commeilfaut26",
        "url": "https://www.reddit.com/r/grammar/comments/ytdqko/my_mom_and_i_are_going_to_the_store_or_my_mom_and/",
        "text": "I know that one uses mom and I when \"mom and I\" is the subject, but I feel like the \"are\" makes it awkward?",
        "created_utc": 1668275236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can some one help me with this sentence. I feel the following sentence is grammatically correct, some one disagrees.",
        "author": "bilpo",
        "url": "https://www.reddit.com/r/grammar/comments/ytcwkl/can_some_one_help_me_with_this_sentence_i_feel/",
        "text": "“First name last name”, she should have made you go to English class.\n\n\nRather than:\n\n“First name last name”, she should have made you gone to English class.",
        "created_utc": 1668273223,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is advocate and activist the same thing?",
        "author": "Ok-Memory2809",
        "url": "https://www.reddit.com/r/grammar/comments/ytboqm/is_advocate_and_activist_the_same_thing/",
        "text": "",
        "created_utc": 1668270532,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is or are",
        "author": "ilianie",
        "url": "https://www.reddit.com/r/grammar/comments/ytaupl/is_or_are/",
        "text": "Which one is correct? \n\n\"Is Alex and said Natasha Canadian?\"\n\nor\n\n\"Are Alex and said Natasha Canadian?\"\n\nif so, why?",
        "created_utc": 1668268684,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adverbial or Object complement? \"I pushed him into the hole\" What is \"into the hole\"?",
        "author": "Conectiololo",
        "url": "https://www.reddit.com/r/grammar/comments/yt9s1z/adverbial_or_object_complement_i_pushed_him_into/",
        "text": " Reasons why I think it is an adverbial: Tells us where I pushed him which is \"into the hole\"  \nObject complement: Tells us where he is now after being pushed. Similar to sentences like \"He made me happy\" Happy is telling us what emotion I am feeling.",
        "created_utc": 1668266210,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the term for a combination of two words (not joined)?",
        "author": "Hypothesist1",
        "url": "https://www.reddit.com/r/grammar/comments/yt8d3l/what_is_the_term_for_a_combination_of_two_words/",
        "text": "There are some combinations of words that go together very frequently. For example: \"Prime Minister\", \"top secret\", \"free gift\", \"over the top\", etc.\n\nI've been looking but I can't find a term for these. I would expect the term to be \"phrases\", but this is too generic, as it can apparently mean [any grammatically correct group of words](https://examples.yourdictionary.com/phrase-examples.html). To me, \"Prime Minister\" or \"top secret\" are special phrases due to their specific meaning and frequency of use. Is there a term for these?\n\n(Full disclosure: I want to know the term for these because I'd really like to find an online tool where I can input the first word, and get given a list of all of these \"special phrases\". I know there are online phrase finders, like [https://www.phrases.com/](https://www.phrases.com/), but these generally have a small set (e.g. 2500) of what are actually common sayings or idioms. If I type in \"stranger\" I'd expect to see \"Stranger Things\", and \"stranger danger\" and other most commonly combined, meaningful phrases with the word strange. Given the internet, and data science, I'm amazed there isn't a repository of these common phrases that are currently used, because they are powerful, and are especially useful in advertising, book titles, etc. If there is, can you point me to it? Thanks!)",
        "created_utc": 1668262865,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do in these situations!?",
        "author": "usernamesarehardas",
        "url": "https://www.reddit.com/r/grammar/comments/yt7s2x/what_do_in_these_situations/",
        "text": "There are three scenarios that trip me up often I'd like your input on.\n\n1. When writing a sentence that's asking a question while also making a statement, does it end with a period or question mark? Ex. What's Stacy's mom's phone number so I can go and shag her.\n\n2. When writing a list that contains quotation marks or apostrophes, do you place the comma before or after the quotation marks? Ex. We need bananas, a 'BBD Dildo,' and ham.\n\n3. When ending a question with a quote, do you put the question mark before or after the end quotation marks? Ex. Can you believe Stacy's mom said, \"The backdoor is ready for you.\"?",
        "created_utc": 1668261490,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a strict use of the word \"correlation\" ?",
        "author": "Golexous",
        "url": "https://www.reddit.com/r/grammar/comments/yt1bwc/is_there_a_strict_use_of_the_word_correlation/",
        "text": "Friend basically says that I shouldn't use the word \"correlation\" \"correlate\" at all unless we're speaking of statistics or I have a data on comparison, Instead I use a \"better\" word like related.\n\nIs there any rules around this word? Did I misused? Should I only use it when speaking of statistics? Is this not generally accepted to use in a conversation?",
        "created_utc": 1668242967,
        "upvote_ratio": 1.0
    },
    {
        "title": "only as a modifier",
        "author": "livswlrd",
        "url": "https://www.reddit.com/r/grammar/comments/yswk9n/only_as_a_modifier/",
        "text": "hi, so i’m stuck on a homework question and needed help. how do we use only in a sentence. \n\nis this a correct way? \n\n“I only ask because i care about you”\n\nor \n\n“the dog only barks at jason”",
        "created_utc": 1668227665,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does this require a colon",
        "author": "jeffersonfsteelflex",
        "url": "https://www.reddit.com/r/grammar/comments/yswgaq/does_this_require_a_colon/",
        "text": "I was wondering whether the phrase \"This begs the question, how do you train for a marathon?\" (question itself is irrelevant) requires a colon or a comma after the word \"question\" or is either acceptable? Thanks!",
        "created_utc": 1668227315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Most animals have a tail/tails?",
        "author": "Dry_Age_5674",
        "url": "https://www.reddit.com/r/grammar/comments/ysw9tv/most_animals_have_a_tailtails/",
        "text": "Most animals have a tail?\n\nMost animals have tails?\n\n&amp;#x200B;\n\nwhich one is correct?\n\nThanks in advance.",
        "created_utc": 1668226708,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I using the word “appeal” correctly?",
        "author": "Im-on-a-banana-phone",
        "url": "https://www.reddit.com/r/grammar/comments/ysvr8k/am_i_using_the_word_appeal_correctly/",
        "text": "So I’m writing a song and the verse goes as following\n\n\nSo I’m quick to strike up a deal\n\nWe’ll write down all our names and put it in a wheel\n\nSpin it around and let the fates appeal \n\n\nWhat I mean to say is let the fates decide, but that doesn’t rhyme\n\nI looked up the definition and it was along the lines of “to make a decision” but I don’t think it was in the traditional sense… any help if it isn’t used correctly? Suggestions for an alternative?",
        "created_utc": 1668225074,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is the possessive plural form of words like cactus and syllabus",
        "author": "aylvioben",
        "url": "https://www.reddit.com/r/grammar/comments/ysufyv/what_is_the_possessive_plural_form_of_words_like/",
        "text": "",
        "created_utc": 1668220828,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grammar help",
        "author": "corn-guy",
        "url": "https://www.reddit.com/r/grammar/comments/ystb33/grammar_help/",
        "text": "Is the sentence \"To whom may be reading this\" Correct? In the context that someone has left a note addressed to whoever happens to be holding it and reading. Thanks!",
        "created_utc": 1668217244,
        "upvote_ratio": 1.0
    },
    {
        "title": "what do we call this expression?",
        "author": "Cry32Wolf",
        "url": "https://www.reddit.com/r/grammar/comments/yssd3r/what_do_we_call_this_expression/",
        "text": "\"we're gonna need a bigger house if we intend to start a family, and intend to start a family we do\".\n\nneed some more examples. thx in advance ;)",
        "created_utc": 1668214376,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it wrong to say \"take a trip to a museum\"?",
        "author": "Warm_Novel2522",
        "url": "https://www.reddit.com/r/grammar/comments/ysoewe/is_it_wrong_to_say_take_a_trip_to_a_museum/",
        "text": "Instead of saying \"students usually pay visits to the museum,\" can I say \"students usually take a trip to the museum.\"",
        "created_utc": 1668203834,
        "upvote_ratio": 1.0
    },
    {
        "title": "“The Chicago Manual of Style” Is Hands Down the Best Style Guide of All Time",
        "author": "WorkingOutinEveryWay",
        "url": "https://www.reddit.com/r/grammar/comments/ysnrrj/the_chicago_manual_of_style_is_hands_down_the/",
        "text": "It’s just so intuitive, and most of the guidelines it sets are logical.",
        "created_utc": 1668202223,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does \"I'm going to keep myself short\" make sense?",
        "author": "MrAnimeWeirdo",
        "url": "https://www.reddit.com/r/grammar/comments/ysnmet/does_im_going_to_keep_myself_short_make_sense/",
        "text": "All that google translate is offering me is 'I'll be brief', but I don't like it. What are some other options?",
        "created_utc": 1668201863,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the English helper verb \"to be\" disappearing in written work??",
        "author": "Froyo_hairdo",
        "url": "https://www.reddit.com/r/grammar/comments/ysnhg7/is_the_english_helper_verb_to_be_disappearing_in/",
        "text": "So I'm English as a first language but lately I've been really confused when reading social media posts mainly, where it seems like people are dropping \"to be.\" Examples - instead of \"this dress needs to be altered\" someone will write \"this dress needs altered.\" Or, instead of \"my car needs to be cleaned,\" it's written \"my car needs cleaned.\" \n\nDid I miss the memo that \"to be\" is being increasingly dropped? Has anyone else noticed this or has it always been this way and I'm just bugging out?!",
        "created_utc": 1668201529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you sense check this sentence please?",
        "author": "Repulsive_Geologist5",
        "url": "https://www.reddit.com/r/grammar/comments/ysna21/can_you_sense_check_this_sentence_please/",
        "text": "My ESL friend sent me this sentence, describing a fishing device.  He asked if the grammar is correct, and I'm not sure! Could you please help?\n\nThe sentence is: \" I think it breaks in water to spread a load of food during the grabbing of food the shit fish grab the hook and fly \"",
        "created_utc": 1668201030,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Shakespeare utilizes his 11th-century Scottish world to portray the theme that violence is a cycle, driven by the pursuit of power, that causes suffering and pain”",
        "author": "11231123123",
        "url": "https://www.reddit.com/r/grammar/comments/yslyn8/shakespeare_utilizes_his_11thcentury_scottish/",
        "text": "",
        "created_utc": 1668198254,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do we hate \"me\"",
        "author": "yw1hbmk",
        "url": "https://www.reddit.com/r/grammar/comments/yslq1t/why_do_we_hate_me/",
        "text": "I'm curious to know if many of you have experienced this. I find that \"me\" is being heavily phased out and incorrectly replaced by \"I\" and \"myself\".   \n\n\nFor example, when adding another person in the sentence, we often incorrectly use I as the object instead of me (e.g., Amy asked John and I for some help).  And when it really doesn't sound right to use I instead of me, I often find we replace it with myself (e.g., If you have any questions, you can ask Dale or myself). Has anyone else noticed this funny phenomenon? 😄  \nReference:\n\n[https://medium.com/@amani.ibrahim/the-ostracism-of-me-7c2219a482e6](https://medium.com/@amani.ibrahim/the-ostracism-of-me-7c2219a482e6)",
        "created_utc": 1668197752,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could someone please tell me if I’m using commas correctly in this sentence?",
        "author": "baycrdor",
        "url": "https://www.reddit.com/r/grammar/comments/ysl8p8/could_someone_please_tell_me_if_im_using_commas/",
        "text": "His nasally vocals remind one of a dental drill, which may be more pleasant than the self indulgent, and at times, comically offensive content of his lyrics. \n\n\n(I’m not actually this bitter. Our writing prompt was “who is the worst musician of all time”)",
        "created_utc": 1668196750,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do they differ and when do I use which one?",
        "author": "HourNo8194",
        "url": "https://www.reddit.com/r/grammar/comments/yskt2u/how_do_they_differ_and_when_do_i_use_which_one/",
        "text": "Did you have lunch?\nHave you had lunch?",
        "created_utc": 1668195804,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ten Years' War - what is this apostrophe?",
        "author": "TheQuestionOfNen",
        "url": "https://www.reddit.com/r/grammar/comments/yskooi/ten_years_war_what_is_this_apostrophe/",
        "text": "I came across this article [Ten Years' War - Wikipedia](https://en.wikipedia.org/wiki/Ten_Years%27_War).\n\nCan someone explain what is the purpose of this apostrophe? I'd like to understand, in as much detail as possible, how this mechanic works here. How do I read this title and what are some of the other usages? As an example, if there is a book or story about some arbitrary decade in history, would it be called \"(The) Ten Years' Story\"?",
        "created_utc": 1668195545,
        "upvote_ratio": 1.0
    },
    {
        "title": "Articles issue",
        "author": "ImmajustAg",
        "url": "https://www.reddit.com/r/grammar/comments/yskfiq/articles_issue/",
        "text": "Guys recently I found a sentence from an exercise which I'm stuck on:\n\nAnd then one of ... other men said something like, “Quick, ... money! Give me ... money!” So one of ... tellers handed them some ... bags.\n\nIt says that in this part “Quick, ... money! Give me ... money!” should be **“Quick, the money! Give me money!”** \n\nWhy does the first part have the definite article and the second part doesn't? Or is it a misprint?  \n\n\nCould you provide your take on it and why?  \n\n\nThank you in advance my friends",
        "created_utc": 1668195004,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best way to format this sentence?",
        "author": "neurosthetic",
        "url": "https://www.reddit.com/r/grammar/comments/ysdtzu/what_is_the_best_way_to_format_this_sentence/",
        "text": "My sentence is: \"There were many career options available for me—becoming a psychiatrist, a psychologist, a social worker, etc.—though I ultimately decided to become a psychotherapist.\"\n\nI worry that the \"etc.\" does not belong inside of the em dashes. Is this sentence fine as is, or should I, for example, use a colon preceding a list instead?",
        "created_utc": 1668180941,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a more basic alternative to \"A Student's Introduction to English Grammar\"",
        "author": "Kid_Charlema9ne",
        "url": "https://www.reddit.com/r/grammar/comments/ysdlt9/looking_for_a_more_basic_alternative_to_a/",
        "text": "Hi all,  I started to read \"A Student's Introduction to English Grammar\" and found it a little too involved for my needs. It seemed like it bordered on linguistics.  I just want to be able to look at a sentence and be able to pick out the big picture parts of speech.  I don't need to know the 50 types of relative clauses, just that it is a relative clause, an adverbial phrase, etc.. Basically, I always want to know where to put a comma (I've read some punctuation books but they require a knowledge of grammar).  I'm not going to make any of the mistakes in Strunk and White so I need it to be more advanced than something like that.  Thanks.",
        "created_utc": 1668180464,
        "upvote_ratio": 1.0
    },
    {
        "title": "For me/you vs To me/you",
        "author": "CavaloAlado",
        "url": "https://www.reddit.com/r/grammar/comments/ysc71v/for_meyou_vs_to_meyou/",
        "text": "Hey, I have a quick question about the use of 'to me' and 'for me'. I look up on the internet and I find out that one of the uses of 'to me' is to give your opinion about something. On the other hand, 'for me' is when something is important to you, something that can help you in a certain way. However, I found a sentence that I don't fully agree with the usage of these terms and I would like another opinion regarding it.\n\n&gt;1) **For** me, it's though sometimes, when you want to talk about the small details.   \n&gt;  \n&gt;Here, I would chose 'to me' instead of 'for me'.  \n&gt;  \n&gt;2) **To** you isn't a better experience, but **to** the most of people that were at the event was a better experience.  \n&gt;  \n&gt;I wrote this sentence I'd like to check if it's right. Here, either 'to you' or 'to the most of people' seems a little awkward to my non-native ears and the usage of 'for' instead of 'to' sounds better.\n\nThanks!!!",
        "created_utc": 1668177132,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it correct to say \"I'm impassioned by ___.\" For example, \"I'm impassioned by the study of neurology\"",
        "author": "MeleeMeow",
        "url": "https://www.reddit.com/r/grammar/comments/ysapr3/is_it_correct_to_say_im_impassioned_by_for/",
        "text": "",
        "created_utc": 1668173836,
        "upvote_ratio": 1.0
    },
    {
        "title": "At the forest or in the forest? And why?",
        "author": "ImmajustAg",
        "url": "https://www.reddit.com/r/grammar/comments/ys9vos/at_the_forest_or_in_the_forest_and_why/",
        "text": "Can't find any explanation on this guys HELP",
        "created_utc": 1668171807,
        "upvote_ratio": 1.0
    }
]