[
    {
        "title": "I’m taking a degree in college, but I also want to learn a new language.",
        "author": "R3UN1TE",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dkcpr/im_taking_a_degree_in_college_but_i_also_want_to/",
        "text": "My degree is computer Programming. So a lot of learning and coding, Java, c+ etc. At the same time I want to start learning Japanese. However, I believe it wouldn’t be smart to start learning  Japanese while taking a degree. I think my brain will consume too much informations. What are your thought to this? Should I finish my school first then learn Japanese Language or it should be fine and I could do both.",
        "created_utc": 1673889116,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pimsleur language learning courses/Best deal",
        "author": "Ok_Student_46",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dkbby/pimsleur_language_learning_coursesbest_deal/",
        "text": "",
        "created_utc": 1673889060,
        "upvote_ratio": 1.0
    },
    {
        "title": "Emotions I feel when speaking German",
        "author": "FitPriority7490",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dj3z4/emotions_i_feel_when_speaking_german/",
        "text": "I have been learning German for two years. I think I understand german at b1 b2 level. but when i want to speak german i am afraid of not being able to explain myself properly. How can I overcome this fear?",
        "created_utc": 1673886976,
        "upvote_ratio": 1.0
    },
    {
        "title": "Today is my 10 year Anki anniversary - 0 days missed",
        "author": "JS1755",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dhyfa/today_is_my_10_year_anki_anniversary_0_days_missed/",
        "text": "Total reviews: more than 2.8 million.  \n\nI started with Italian.  I created all 26,384 cards manually, one by one, no automation.  This year, I stopped adding new cards from May to October to have more free time to ride my e-bike.  This is also the year Wanikani overtook Italian for most reviews.  I only missed two days since I started this deck, but my stats got messed up when I moved across 9 time zones and by one of the Anki updates.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/jbg8ktnxcfca1.png?width=777&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=eb0a5b1e191c53c6db0dc41c57f0b2eed73fd5f4\n\nNext oldest deck is Japanese Core10k.  I took a break with this deck way back.  I also stopped adding new cards here from May-Oct this year.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/9dtwnl09dfca1.png?width=849&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=a8a220c5b6356b3c4f9aae2075850235d51a3d53\n\nThen there are my French decks, which overlap with Italian &amp; Japanese.  I made 10,886 cards by hand.  I stopped new cards from May-Oct, but am now adding 15/day in preparation for the C1 exam in March.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/dm6oca6mdfca1.png?width=784&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=1bbbf4952ce776d103320bc150ec36c061a7aca7\n\nAnd there's Wanikani, closing in on 1 million reviews.  I slowed down from May-Oct, only adding one new kanji per day.  Hit level 60 in September, no new items left to add since 21 Dec 22.  Now just working on burning the rest.  Started 7 years ago in March.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/hlzrnr94efca1.png?width=786&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=8a8b8f45617fca2390018a5669a3e35a9d544e81\n\nI have 5 other Anki decks (I'll skip posting those stats), plus KaniWani and Bunpro (no stats for these), so my total is over 2.8 million reviews, plus 102,000 reviews with Glossika, mostly Japanese.\n\nI've made over 37,000 cards by hand, one at a time.\n\nIt's annoying that the two days I missed Italian I actually studied my other decks, but because I changed my routine, I simply forgot to do that deck.\n\nFWIW, approaching 66 years of age.  You need to be retired like I am to have time for all this learning.",
        "created_utc": 1673884317,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a website to teach my native language (Italian) and earn something?",
        "author": "AndrexPic",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dhy6x/is_there_a_website_to_teach_my_native_language/",
        "text": "I'm a cashless medicine student and I'm also fluent in English, so I tought that maybe I could teach Italian, but I don't really know where to look at.",
        "created_utc": 1673884299,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you could instantly know an Arabic language which would it be and why?",
        "author": "TheeConqueror",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dhmhx/if_you_could_instantly_know_an_arabic_language/",
        "text": "I am personally interested in learning one which maybe most applicable to leveraging into understanding other Arabic languages or whichever is spoken by the largest amount of people (apparently, Egyptian Arabic)",
        "created_utc": 1673883538,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best shows on Netflix to learn English",
        "author": "LeoSzac",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dgvcu/best_shows_on_netflix_to_learn_english/",
        "text": "There are many shows on Netflix that can help you learn English, some examples are:\n\n1. \"Friends\" - A classic American sitcom with a wide range of vocabulary and idiomatic expressions.\n2. \"The Crown\" - A British drama that uses advanced vocabulary and formal English.\n3. \"Breaking Bad\" - An American crime drama that uses strong storytelling and complex vocabulary.\n4. \"Stranger Things\" - A popular American science fiction-horror series, it uses everyday conversation and some technical terms.\n5. \"The Office\" - An American mockumentary sitcom, it uses everyday conversation and office jargon.\n6. \"The Good Place\" - An American fantasy-comedy series, it uses everyday conversation, idioms, and some technical terms.\n7. \"Sherlock\" - A British crime drama it uses advanced vocabulary and idiomatic expressions.\n\nRemember that the best way to learn English is to combine watching shows with other methods, such as reading, listening to music, and speaking with native speakers.",
        "created_utc": 1673881702,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is it difficult to learn German (I’m French)",
        "author": "getwellmyfriend",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dgdyb/how_is_it_difficult_to_learn_german_im_french/",
        "text": "I have zero knowledge and I don’t even know how to say thank you in German..\n\nI will stay in Germany for the next 3 years ( I’m leaving France in June).\n\nAny recommandation ?\nStreaming site dubbed in German with English subtitles ?\n-Tv show? \n-Book",
        "created_utc": 1673880549,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are the best apps and bloggers for learning arabic",
        "author": "STEMUki",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dg2hy/what_are_the_best_apps_and_bloggers_for_learning/",
        "text": "",
        "created_utc": 1673879735,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you speak to Siri in a different language to learn the language?",
        "author": "Happy_Traveller_2023",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dg13s/can_you_speak_to_siri_in_a_different_language_to/",
        "text": "[removed]",
        "created_utc": 1673879637,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parallel text and French book recommendations",
        "author": "MWiblin",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dfuyh/parallel_text_and_french_book_recommendations/",
        "text": "I’m doing the 12 book challenge or I guess just reading loads. Is reading parallel text with English translation good? Or is the constant switching not good for enforcing target language learning? I sometimes find typing a word into Google translate every other minute quite annoying.\n\nAlso any French book recommendations? Im currently reading a book which has 8 short stories in French which I like. And also considered Harry Potter in French and ‘le petit prince’ which is apparently a famous easy to read book",
        "created_utc": 1673879194,
        "upvote_ratio": 1.0
    },
    {
        "title": "want to learn american accent anybody can help?",
        "author": "Mukeshkarwasra",
        "url": "https://www.reddit.com/r/languagelearning/comments/10deo2h/want_to_learn_american_accent_anybody_can_help/",
        "text": "",
        "created_utc": 1673876025,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alphabet puzzle - Hi. I bought this at a garage sale in New Orleans. I can’t figure out what language it is. Does anyone care to try and solve it? ( the little radio at top right keeps stumping me )",
        "author": "kschorp",
        "url": "https://i.redd.it/eqyzz1nq8gca1.jpg",
        "text": "",
        "created_utc": 1673876001,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tensing throat muscles for better German pronunciation?",
        "author": "CharmingM4n",
        "url": "https://www.reddit.com/r/languagelearning/comments/10de606/tensing_throat_muscles_for_better_german/",
        "text": "Am I on to something here? I'm desperate to take the edge off my accent. I've been recording myself and feel when I tense my throat muscles a bit then my German sounds a lot more authentic.... on the other hand when I speak English I feel action in the front of my mouth more.....\n\nWhat are your thoughts?",
        "created_utc": 1673874569,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tightening throat muscles for better German pronunciation?",
        "author": "CharmingM4n",
        "url": "/r/German/comments/10de46i/tightening_throat_muscles_for_better_german/",
        "text": "",
        "created_utc": 1673874466,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm not sure how to start and maintain studying for Spanish",
        "author": "Xumot",
        "url": "https://www.reddit.com/r/languagelearning/comments/10db3g9/im_not_sure_how_to_start_and_maintain_studying/",
        "text": "I have audible for when I drive to work. I have Pimsleur and Paul Noble. I have a few workbooks that I got from B&amp;N (practice makes perfect). I am a complete beginner (as in I can say hola), and all the guides I have read or seen talk about the apps I have but don't really delve into the structure. Do I write traditional flashcards for words or would it be better for phrases? When they say spend a few hours a day studying is that mostly toward listening or writing/speaking or all of the above? \n\nI use Duolingo and Memrise as well. Any help is much appreciated.",
        "created_utc": 1673864461,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am a heritage speaker and I had to speak to my granny",
        "author": "Geekplayer",
        "url": "https://www.reddit.com/r/languagelearning/comments/10daib4/i_am_a_heritage_speaker_and_i_had_to_speak_to_my/",
        "text": "I hope this post is ok here, it's kind of a vent.\n\nI am so embarrassed... the Russian that came out of my mouth was so bad. Even a 6 year old would speak better than me, it was so broken.\n\nBeing a heritage speaker is so frustrating, I could understand her perfectly, and I could think of the things I wanted to say to her perfectly but when it came to actually getting words out of my mouth... oh boy.\n\nI only speak Russian with my mom and it's always about the same stuff (are you hungry, come here, do this, do that, how are you feeling, you bastard, I love you, can you make me tea, let's go to X, I'll do X when I come home, clean your room, etc...).\n\nI tried duolingo and similar stuff but it was too easy and didn't help me... I guess I need to practice speaking but I can't force conversations on my mom or granny, it would be too wierd and artificial. Fml.",
        "created_utc": 1673862283,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you possibly speak a language without knowing it, without understanding what you are saying?",
        "author": "Organic_Radio8936",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dabwz/can_you_possibly_speak_a_language_without_knowing/",
        "text": "Like just know how the words sounds\nLanguages with different texts like russian,japanese,hindi,etc",
        "created_utc": 1673861606,
        "upvote_ratio": 1.0
    },
    {
        "title": "does it help watching things with TL dubs and TL captions even though I'm not understanding anything?",
        "author": "PixPizza123",
        "url": "https://www.reddit.com/r/languagelearning/comments/10d993y/does_it_help_watching_things_with_tl_dubs_and_tl/",
        "text": "what should I do to watch these things? TL dubs and NL captions? the other way around? both TL? how does one immerse themselves when it comes to watching things?",
        "created_utc": 1673857556,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help needed to master a British accent",
        "author": "thekopydude",
        "url": "https://www.reddit.com/r/languagelearning/comments/10d97t5/help_needed_to_master_a_british_accent/",
        "text": "Hey everyone,\n\nFirst off, I'm not sure if this is the right sub to post this on, but I hope it is:)\n\nI am looking for a native person to help me and my friend improve our English. We have a C1 level of English, and we need help with things like pronunciation, intonation, word stress, fluency, etc, as we are trying to master a British accent. Thank you for reading this and thanks so much in advance!\n\nHave a blessed day:)",
        "created_utc": 1673857418,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should i buy anki app which is quite expensive for me ?",
        "author": "TehEvil127",
        "url": "https://www.reddit.com/r/languagelearning/comments/10d8p94/should_i_buy_anki_app_which_is_quite_expensive/",
        "text": "",
        "created_utc": 1673855564,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to do after Duolingo?",
        "author": "DominusPhoenix",
        "url": "https://www.reddit.com/r/languagelearning/comments/10d7s78/what_to_do_after_duolingo/",
        "text": "I’m currently learning French on Duolingo and having some fun using it. I had a gander at the resources to learning french on this subreddit and it felt really overwhelming because it had a lot of resources and I started doing duolingo because it was at the top. After I’m finished with the full duolingo course what would be the next step?",
        "created_utc": 1673852328,
        "upvote_ratio": 1.0
    },
    {
        "title": "Smaller Languages Have The Best Resources",
        "author": "throwaway69287514683",
        "url": "https://www.reddit.com/r/languagelearning/comments/10d7l0w/smaller_languages_have_the_best_resources/",
        "text": "Why is it that smaller languages seem to have the best (free) resources online? \n\nFor instance, Croatian and Slovak are not very popular TLs even when compared to other slavic languages like Russian and Polish, yet they both have some amazing, entirely free courses that can easily be found via google search. Looking for a free, comprehensive course in German or Mandarin Chinese or even Spanish though is like trying to raise the dead: impossible and a waste of time. As a Croatian heritage-learner, I’m not complaining that easy-croatian exists, but I’m just wondering why it seems like the bigger languages don’t have an equivalent.",
        "created_utc": 1673851647,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Is the fast and best way to learn Chinese for absolute beginner ?",
        "author": "A-questioner",
        "url": "https://www.reddit.com/r/languagelearning/comments/10d7fio/what_is_the_fast_and_best_way_to_learn_chinese/",
        "text": "",
        "created_utc": 1673851137,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for learning multiple languages at the same time?",
        "author": "Cocoa-Shunter",
        "url": "https://www.reddit.com/r/languagelearning/comments/10d7fhm/tips_for_learning_multiple_languages_at_the_same/",
        "text": "Visited my partners family in Latvia recently and had a really enjoyable time and I am quite likely to return there with her annually or bi-annually.\n\nHer sister and mother speak good English but her father not so much, though granted his English is still better than my Russian.\n\nI am learning Russian mainly to communicate with her family easier but would also like to learn some basic Latvian, enough to be able to navigate things like going shopping or taking public transport without having to burden other people.\n\nI am fine when I am with my partner, but would like to be more self-sufficient and make her visits home less stressful when she doesn’t have to worry about me so much.\n\nDoes anyone have any tips for learning multiple languages at a time?",
        "created_utc": 1673851134,
        "upvote_ratio": 1.0
    },
    {
        "title": "Drops annual sub for $50",
        "author": "koreanese77",
        "url": "https://www.reddit.com/r/languagelearning/comments/10d5skr/drops_annual_sub_for_50/",
        "text": "Been using Drops for free for a week and just got this offer. Is this worth it at this price? (I unfortunately just missed that huge discount at the end of 2022…) I’d be using it to study Japanese as a beginner. Thanks in advanced!",
        "created_utc": 1673845786,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anki",
        "author": "gerrly",
        "url": "https://www.reddit.com/r/languagelearning/comments/10d5f2w/anki/",
        "text": "I am confused as to how to use Anki to learn a language. They are just digital flash cards, right? \n\nI have duolingo super, which I know isn’t great, but it’s kind of fun. Then I joined this subreddit and saw people talking about Anki and even just watching shows in your TL with your native subtitles. But I still don’t understand what to do with Anki. Please help!\n\nNative language is English and TL is French (3 years of high school French classes, but I’m 37 now, so… that was a long time ago).\n\nThank you!",
        "created_utc": 1673844641,
        "upvote_ratio": 1.0
    },
    {
        "title": "alveolar tap help",
        "author": "DamageIllustrious716",
        "url": "https://www.reddit.com/r/languagelearning/comments/10d51iz/alveolar_tap_help/",
        "text": "I've been trying for a while now to produce an alveolar tap for a spanish soft r. For a while i substituted it as a D but that fell apart when i had to use it at the end of words so i want to learn the actual pronounciation. I've spent the past 3 hours trying to do it and i don't know what im doing wrong. I tap my tounge upon the back of the alveolar ridge like all the diagrams say, but it comes out as an l instead of an R. Any help would be appreciated.",
        "created_utc": 1673843454,
        "upvote_ratio": 1.0
    },
    {
        "title": "OK to learn speaking &amp; listening first before learning to read script &amp; alphabets in other languages?",
        "author": "NickHeathJarrod",
        "url": "https://www.reddit.com/r/languagelearning/comments/10d51gt/ok_to_learn_speaking_listening_first_before/",
        "text": "Hi, I'm planning to learn Tamil &amp; Japanese someday. As of now, I'm only self-learning to listen to spoken Tamil &amp; Japanese speeches while watching movies or anime. I'll be learning to read Tamil words or Japanese script later this year.\n\nIs this a good idea?",
        "created_utc": 1673843449,
        "upvote_ratio": 1.0
    },
    {
        "title": "The babbel lifetime subscription 60% off sale ends tonight. Is it worth getting? How useful is it in learning languages…is fluency possible from it?",
        "author": "Public_Dig_8992",
        "url": "https://www.reddit.com/r/languagelearning/comments/10d4k45/the_babbel_lifetime_subscription_60_off_sale_ends/",
        "text": "",
        "created_utc": 1673841953,
        "upvote_ratio": 1.0
    },
    {
        "title": "24 M looking for a F to help me learn a new language and I’ll teach them English if need be! Want to learn a European language if possible",
        "author": "Apprehensive_Hat1358",
        "url": "https://www.reddit.com/r/languagelearning/comments/10d4b9q/24_m_looking_for_a_f_to_help_me_learn_a_new/",
        "text": "Looking for a European language teacher! Thank you!",
        "created_utc": 1673841234,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beautiful English words related to flowers",
        "author": "margopham",
        "url": "https://www.reddit.com/r/languagelearning/comments/10d4aq1/beautiful_english_words_related_to_flowers/",
        "text": "",
        "created_utc": 1673841185,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free French Speaking Classes",
        "author": "Mario_master99",
        "url": "https://www.reddit.com/r/languagelearning/comments/10d2dl0/free_french_speaking_classes/",
        "text": "Hi everyone, I need help using up some class credits on Lingoda. I get a rebate if I use up all my credits by actively attending classes, but I have an excessive amount of credits left to use. If you want access to my account, you can take as many classes as you'd like for the next 2 weeks (after which the credits will expire). You can take any level above A1.1 (basic understanding). Dm me if you're interested!",
        "created_utc": 1673835593,
        "upvote_ratio": 1.0
    },
    {
        "title": "(re)learning persian/farsi as a heritage speaker",
        "author": "roxannexcherry",
        "url": "https://www.reddit.com/r/languagelearning/comments/10d29lj/relearning_persianfarsi_as_a_heritage_speaker/",
        "text": "Both my parents are native Farsi speakers but unfortunately my reading/writing abilities are not good at all due to growing up in an English speaking country. I was wondering if anyone had any resources (specifically books) that they found helpful in learning or relearning Farsi. Thanks so much!",
        "created_utc": 1673835285,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for making the most of a language-learning trip?",
        "author": "miianah",
        "url": "https://www.reddit.com/r/languagelearning/comments/10d26zy/tips_for_making_the_most_of_a_languagelearning/",
        "text": "Hi everyone, I'm going to be living in a Francophone country for 2-3 months on a tourist visa in order to solidify my French-speaking skills. Country still undecided. For those of you who have done a similar trip in your TL, what tips do you have for getting out, making friends, and overall, maximizing the amount of time you spend immersed in the language? (I wish I could get a job but visa won't allow it.) Thanks for the input!",
        "created_utc": 1673835079,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get better at writing formally",
        "author": "SylvesterAI",
        "url": "https://www.reddit.com/r/languagelearning/comments/10d1db6/how_to_get_better_at_writing_formally/",
        "text": "   I've hit the intermediate plateau and I think I'm doing a pretty good job making my way past it so far, but I want to expand my knowledge even more and learn how to write formally. I wouldn't say I'm terrible at it, but I definitely could improve a lot and would like to be able to write essays without much trouble. I'm not sure how to go about getting to this point and would like some advice from some people who have achieved this.",
        "created_utc": 1673832770,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having trouble deciding if I should learn Mandarin or Korean first?",
        "author": "ellaumu",
        "url": "https://www.reddit.com/r/languagelearning/comments/10d0s69/having_trouble_deciding_if_i_should_learn/",
        "text": "I like both languages a lot but I’m having trouble deciding which one I should learn first. I thought maybe  mandarin first since my goal is to be able to understand artist post on weibo 🤣 and to be lightly conversational. For Korean I plan to move to Korea in two-three years so I would like to be more conversationally fluent. So unsure if I should start with Korean because it’s more of a goal to be fluent or start with Mandarin because my goal is less intense.",
        "created_utc": 1673831188,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is learning Mandarin as hard as they say for a english speaker? My goal is to learn that and Korean.",
        "author": "ellaumu",
        "url": "https://www.reddit.com/r/languagelearning/comments/10d0lph/is_learning_mandarin_as_hard_as_they_say_for_a/",
        "text": "Hello friends! I decided I wanted to learn Mandarin for a bit before diving into Korean again. I see that Mandarin is considered one of the hardest languages to learn but to my surprise the grammar structure isn’t too far off from English. Korean while easy to read the grammar has been killing me.",
        "created_utc": 1673830725,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your Language related unpopular opinion?",
        "author": "Themerchantoflondon",
        "url": "https://www.reddit.com/r/languagelearning/comments/10czzlc/what_is_your_language_related_unpopular_opinion/",
        "text": "Mine is that Danish is actually the nicest sounds of the three Nordic Languages (Swedish/Norwegian/Danish)",
        "created_utc": 1673829069,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best city to go to learn French?",
        "author": "miianah",
        "url": "https://www.reddit.com/r/languagelearning/comments/10czrj8/best_city_to_go_to_learn_french/",
        "text": "I'm planning on staying in a Francophone country for 2-3 months starting in March on a tourist visa to solidify my French speaking skills. My instinct is to stay in Paris since I have family there and have been there many times, but I found that my French hardly improves when I'm there. Too many people speak English and I found it hard to make friends. I'm definitely open to staying there again and hope this time will be different since I'm making a conscious effort.\n\nSo, what are some cities or countries I should go to to learn French? Nice, Brussels, Liege, Abidjan, Dakar, etc. No Quebec since it's too cold that time of year unfortunately. Looking for a place that has friendly people who will be patient with my French, with activities to do to help my language learning skills like museums, movies, etc., and that's accessible to me as an American and Guinean national. Thanks so much for the input.\n\nAnd for those who have done a similar trip, what advice do you have for making friends and maximizing the amount of time you're speaking and hearing French? I would love to get a job but visa won't permit it in the EU at least.",
        "created_utc": 1673828496,
        "upvote_ratio": 1.0
    },
    {
        "title": "Study 3 languages at same time, but 2 of them are in intermediate level (B1).",
        "author": "Angel-Mysterious",
        "url": "https://www.reddit.com/r/languagelearning/comments/10czdc1/study_3_languages_at_same_time_but_2_of_them_are/",
        "text": "I've been studying English for the past 2 years and Spanish for some months. This year I've been thinking in study German too, and with this study 3 languages at same time, but 2 of them are in intermediate level. What you guys think about it? I don't think it would be hard because 2 of them are already in B1.\n\nOBS1: I have a lot of free time.\n\nOBS2: Spanish isn't hard for Brazilian people, because it shares around 70% of vocabulary with portuguese, then making it not so hard.",
        "created_utc": 1673827517,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are CEFR levels really that representative? Should they be reworked?",
        "author": "araiderofthelostark",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cz0h2/are_cefr_levels_really_that_representative_should/",
        "text": "Here's something I find myself wondering about quite often. I would like to hear your thoughts on the matter.\n\nIf I had to self-assess my English level, I would say I am probably B1-B2. \n\nI would consider a C1 speaker to be somebody with a really, really high level of English. Someone who makes basically no mistakes and is able to express themselves with no issue. They may lack some vocabulary they haven't had the chance to be exposed to, like the way one should refer to the British Royals, taxonomy (e.g. names of fish species), film-related vocabulary (lens, reel, aperture), or any other areas to which an advanced non-native may simply not have had enough exposure. What I mean is, natives are probably going to be familliar with all that obscure vocabulary through sheer exposure, even if they are not personally interested in film, fish, or the British Monarchy. They also may have an audible accent.\n\nA C2 speaker, in my opinion, would be somebody with a near-flawless knowledge of English. Say, a professor who has spent the last 20 years in America, effortlessly using highly precise vocabulary in their area of expertise. Someone who is able to use, \"hither\" or \"notwithstanding\" in a sentence without it sounding forced, pretentious, or out of place.\n\nI wouldn't consider myself to be either, so I would evaluate myself as a B1 or a B2. I frequently make errors, my sentences tend to come across as unnatural, and I am not particularly eloquent. \n\nHowever, whenever I try to complete B2 level tests I find on the Internet, I find them incredibly easy. They all utilize relative simple vocabulary and sentence structure. During my high school final tests, I actually got 100% on the English exam, and that one is supposed to be about B2.\n\nIndeed, whenever I read posts or comments by self-proclaimed B1 or B2 speakers, I do tend immediately notice a ton kf errors, such as noticeably unnatural wording, missing articles, and so on.\n\nSo, in my opinion, the CEFR grading system is not very well done. What they consider to be B1/B2 I would consider to be A2 at most. I am definitely not an advanced speaker of English, yet I find B1 and B2 tests ludicruosly easy. \n\nSo I think that he CEFR is just one big lie. B1/B2 tests are so ridiculously easy that I would never consider somebody to be an intermediate speaker of English just because they passed them.\n\nIn my opinion, the CEFR scale is not well done.\n\nWhat do you think?",
        "created_utc": 1673826616,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think of YouTube polyglots",
        "author": "Putrid_Glass_8894",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cyzqz/what_do_you_think_of_youtube_polyglots/",
        "text": "For example Xiaoma\nDoes they just learn a limited vocabulary in each language then show it?\n\nIt seems like poliglote it's someone who learned more then 3 languages fluently instead.",
        "created_utc": 1673826565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seedlang",
        "author": "jlh217",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cyst4/seedlang/",
        "text": "Hi, I bought a year subscription of seedlang to learn german but am not using it anymore. It is a good app but i lost motivation when i missed a streak lol. I am taking an intensive class so its just a supplement resource for me. My subscription is good until September 8. My question is, am i allowed to sell my account?  I dont think i can get a refund for it and i dont want it to go to waste if possible. I sent a message to Seedlang to ask but i havent heard from them yet. \n\nThank you.",
        "created_utc": 1673826073,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a really good app without premium to pay for. At least if premium that really helps and it’s worth the money?",
        "author": "consciuosmind",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cwypn/is_there_a_really_good_app_without_premium_to_pay/",
        "text": "",
        "created_utc": 1673821605,
        "upvote_ratio": 1.0
    },
    {
        "title": "My thoughts on Lingoda after 7 days and 3 classes",
        "author": "edelay",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cwc19/my_thoughts_on_lingoda_after_7_days_and_3_classes/",
        "text": "I just completed a 7 day trial of Lingoda and I thought I would share my thoughts here. During that 7 day trial I took 3 French grammar classes.\n\nFirstly, if you sign up for the 7 day free trial, put an alarm on your phone to cancel the trial before the end of the 7 days. If you don't, your credit card will be charged for a monthly subscription.\n\n**THINGS I LIKED:**\n\n\\- there is a reasonably good free test of your language level. \n\n\\- you can read the slides for the class before it starts\n\n\\- you can do a quiz before and after the class\n\n\\- prepared materials involved interaction: reading, answering questions, going into breakout rooms, role playing\n\n\\- teacher gives feedback on each student after the class\n\n\\- you can rate each teacher and the class itself after the class\n\n\\- 2 teachers that I had were friendly and competent\n\n\\- while you can take any course that you want, they have collection of courses for each CEFR level and actually break each level down into 2 or 3 sub-levels. For B2 there is B2.1, B2.2 and B2.3.\n\n\\- classes are in Zoom, and not some proprietary/flakey software\n\n\\- when the free trial was over, it was very easy to cancel before a paid subscription kicked in\n\n\\- the clases are completely in the target language\n\n\\- you have access to every quiz and all of the materials for each class at every level\n\n**THINGS THAT I DIDN'T LIKE:**\n\n\\- only 4 languages: English, French, Spanish and German\n\n\\- I find the classes a bit old fashioned: teacher is reading notes, then asking students questions in turn.\n\n\\- teachers put the students on the spot instead of asking who wants to answer\n\n\\- the feedback for each student after each class is limited and generic. \n\n\\- the classes run for a full 60 minutes, which gives the teacher no breaks between classes and it means classes will start exactly on time and end exactly on time which leaves little time for chat chat with the teacher or other students\n\n\\- not much opportunity for free conversation since each class has a lot of slides to go through\n\n\\- not much opportunity to talk to the other students except in a structured way\n\n\\- if you don't cancel before the 7 days are over, you will be signed up for a monthly subscription\n\n\\- there is no way to sign up for courses ad hoc, or as you go, you must sign up for some sort of subscription of X classes per month\n\n\\- once the class is over, there is no way to interact with the teacher or the other students\n\n**THOUGHTS IN GENERAL/WOULD I TAKE CLASSES WITH THEM AGAIN:**\n\n\\- Although I find their sessions a bit old fashioned , I could see taking courses with them to brush up on specific points of grammar\n\n\\- I prefer talking with tutors because if I sign up for 60 minutes, I can talk for 60 minutes. With a group classes of 5 students I can talk for 60 / 5 = 12 minutes, but then the teach has to talk for at least half that time, so maximum I can speak is 6 minutes. Granted, learning a language isn't just about speaking, it is about listening, reading, writing and learning grammar.\n\n\\- Because I knew I would be called upon in class to answer questions from the slides, I would spend about 2 hours reading, understanding and answering all of the questions in the slides. Even though I found this boring, I was highly motivated to do it because I didn't want to be embarrassed in class by not knowing an answer. This got me to study the subjunctive for 2 hours, then discuss it in class for 1 hours... I have never been able to do that with a grammar topic before.\n\n\\- I find that the company has very realistic claims about language learning, which are rare in this industry. They don't say you will be fluent in a couple of months if you are a beginner.\n\nI think I would take classes from them again in the future to brush up on grammar, but I think tutoring services such as Italki are cheaper per minute of actual speaking. With a tutor I get detailed feedback on what I need to work on.\n\nThe Lingoda Sprint interests me as a way of forcing myself to study hard for 2 months and if done correctly, this would be free.",
        "created_utc": 1673820066,
        "upvote_ratio": 1.0
    },
    {
        "title": "does anyone else get really nervous when speaking to natives of their target language?",
        "author": "Practical_Zombie_221",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cvbid/does_anyone_else_get_really_nervous_when_speaking/",
        "text": "today at work a hispanic family came in to shop. i always get really excited when that happens because i hype myself up to ring them up in spanish but always end up chickening out. today i went for it and it was a mess. my legs were shaking and i couldn’t get any words out, it was really embarrassing. they were really kind and understanding but the worst part was that i know i know enough spanish to have had a conversation with them. how do you guys calm your nerves in these situations?",
        "created_utc": 1673817621,
        "upvote_ratio": 1.0
    },
    {
        "title": "an app to get example sentences",
        "author": "braminer",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cv1cr/an_app_to_get_example_sentences/",
        "text": "Hey everyone,\n\nI'm learning Japanese and am trying to find an app to get example sentences for the words that I'm learning.\n\nDoes anyone have any suggestions?\nThanks in advance",
        "created_utc": 1673816965,
        "upvote_ratio": 1.0
    },
    {
        "title": "By learning your target language, what languages became more accessible to learn?",
        "author": "Suffolk_",
        "url": "https://www.reddit.com/r/languagelearning/comments/10curen/by_learning_your_target_language_what_languages/",
        "text": "For example, an English speaker may have trouble finding resources to learn Guarani or Quechua. However, a Spanish speaker has more available options to learn those languages. Another example would be a Polish speaker who wants to learn Malagasy. They'd likely struggle to find many Polish to Malagasy learning materials. In contrast, a French speaker would have learning materials targeted specifically for them.",
        "created_utc": 1673816337,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spanish language schools in mainland Spain or the canaries?",
        "author": "Keyg28",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cuin1/spanish_language_schools_in_mainland_spain_or_the/",
        "text": "Hi guys,\n \nI’m (19F) planning to travel abroad to learn Spanish this summer in July/August and was looking to get feedback or advice from anyone who’s done so before. I’m based in Ireland so thinking of the Canary Islands or mainland Spain rather than Central America. I’m looking to do intensive lessons as I don’t have any Spanish so like 20 lessons a week plus maybe 5 or 10 individual ones as that’s what these programs seem to offer. What is the best route to go with accommodation? Should I use the company or arrange private accommodation? I have two colleagues in work that are from Fuerteventura and Barcelona so could probably help me find legitimate accommodation there if anyone has experience with good language schools there. Otherwise, what are the red flags for a school? Green flags? I’m particularly interested in learning hospitality related vocab as that’s the industry I currently work in. I don’t drive so city living is better, does anyone who’s lived in the canaries know how feasible it is to cycle? I’ve only visited on holidays.\n \nThanks,",
        "created_utc": 1673815772,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best language to learn in Europe for work from the below options?",
        "author": "Dry_Musician_9096",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cuezn/what_is_the_best_language_to_learn_in_europe_for/",
        "text": "What is the best language to learn in Europe for work from the below options?,which one do you guys think has more work opportunities and will take less time to learn?\n1-German\n2-Dutch\n3-French\n4-Spanish \n\nThanks in advance!",
        "created_utc": 1673815527,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it okay to take a break from learning one language by studying another until you regain motivation for the first language?",
        "author": "MrBroDudeMann",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cucvh/is_it_okay_to_take_a_break_from_learning_one/",
        "text": "",
        "created_utc": 1673815392,
        "upvote_ratio": 1.0
    },
    {
        "title": "Offering: English/Filipino Seeking: Korean/Spanish",
        "author": "GreenEstablishment47",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cuarv/offering_englishfilipino_seeking_koreanspanish/",
        "text": "[I’d also love to connect with those learning the same languages as me! That would be great.]\n\nI can read, write and understand Korean but I couldn’t speak it very well. I’m taking classes at the moment so it would be a big help if I have someone to correct my pronunciation and making sentences.\n\nI mostly understand Español from context clues and since we have common words in Español, I have not yet started a formal class but I wish to know some phrases!",
        "created_utc": 1673815253,
        "upvote_ratio": 1.0
    },
    {
        "title": "What language level would you say you are when you can easily be yourself?",
        "author": "FietserInDeVS",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ctytc/what_language_level_would_you_say_you_are_when/",
        "text": "When you can do things like effortless tell jokes and make everyone laugh. Would this be B1 or B2?",
        "created_utc": 1673814481,
        "upvote_ratio": 1.0
    },
    {
        "title": "Renewing my knowledge",
        "author": "Nymfadore",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cts86/renewing_my_knowledge/",
        "text": "Hello everyone\n\nI come here seeking your advice and opinions. 15 years ago I got my B2 level in French language. Unfortunately since then I haven't spoken, written or practised them in any way. I am afraid I have forgotten everything I learnt.\n\nI am currently making plans to move to a French speaking country in the near future (~3 years). What in your opinion is the best way to refresh my knowledge? Should i try studying completely by myself? Is a teacher necessary? Thankfully I am close to some people that speak the language and I could in theory practice with them.\n\nThank you and happy learning!!",
        "created_utc": 1673814036,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anti-Profit Vocab App (for English, Spanish, German, Ukrainian, Russian, Hungarian)",
        "author": "jbnyc1",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ctl2m/antiprofit_vocab_app_for_english_spanish_german/",
        "text": "Hey all, I'm part of a non-profit software team that makes applications for learning languages. Our Picture Dictionary app is now fully available for learners of Spanish, and for anyone learning English, German, Ukrainian, Russian, and even Hungarian. Our offline apps are 100% free, which means NO ADS, NO PREMIUM, NO DATA-COLLECTION. We are just a small team of volunteer language enthusiasts who believe in free education ✊\n\n[https://spe-not.com/en/picture-dictionary](https://spe-not.com/en/picture-dictionary)",
        "created_utc": 1673813556,
        "upvote_ratio": 1.0
    },
    {
        "title": "who wants to learn Hebrew?",
        "author": "Ok_Respect_657",
        "url": "https://www.reddit.com/r/languagelearning/comments/10crs0y/who_wants_to_learn_hebrew/",
        "text": "[removed]",
        "created_utc": 1673809272,
        "upvote_ratio": 1.0
    },
    {
        "title": "London French course to achieve C1 and affordable",
        "author": "Commercial-Resort431",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cqy04/london_french_course_to_achieve_c1_and_affordable/",
        "text": "[removed]",
        "created_utc": 1673807317,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT for language learning: A game changer for language learners",
        "author": "edelay",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cq9ar/chatgpt_for_language_learning_a_game_changer_for/",
        "text": "Hey everyone,\n\nI recently discovered the power of ChatGPT for language learning and I couldn't be more excited. For those of you who don't know, ChatGPT is a large language model developed by OpenAI that can understand and generate human-like text.\n\nAs a language learner, I've always found it challenging to practice speaking and writing in my target language. But with ChatGPT, I can now have real-time conversations and get feedback on my grammar and vocabulary. It's like having a personal language tutor available 24/7.\n\nNot only that, ChatGPT can also help me with reading and listening comprehension by providing me with summaries, translations, and explanations of texts and audio in my target language.\n\nOne of the most exciting things about ChatGPT for language learning is its ability to understand and respond to context. This means that it can understand my questions and provide me with relevant and accurate information. This is especially helpful for more advanced learners who are looking to expand their knowledge and understanding of the culture and society of their target language.\n\nOverall, I believe that ChatGPT has the potential to revolutionize language learning and make it more accessible and efficient for everyone. If you're a language learner, I highly recommend giving it a try.\n\nLet me know your thoughts and experiences with ChatGPT for language learning in the comments below!\n\n\\*\\*\\*\\*\n\nI asked **ChatGPT** to create this post on this reddit forum by asking it \"**Make a Reddit post about how ChatGPT could be used for language learning**\". I have to say that the post is not bad at all. What do you think?",
        "created_utc": 1673805687,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the weirdest grammatical quirk of your TL that you like to fixate on?",
        "author": "NeverBefore800",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cq20x/what_is_the_weirdest_grammatical_quirk_of_your_tl/",
        "text": "For me it's how for some passive verbs, you don't need a preposition afterwards in Indonesian. But only some passive verbs.",
        "created_utc": 1673805219,
        "upvote_ratio": 0.99
    },
    {
        "title": "can anyone recommend some good books",
        "author": "yakisobatakoyaki",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cpzxw/can_anyone_recommend_some_good_books/",
        "text": "[removed]",
        "created_utc": 1673805082,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are you thankful about regarding your language learning journey over the last year?",
        "author": "edelay",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cpz1u/what_are_you_thankful_about_regarding_your/",
        "text": "I am thankful to my language partner Marie who has spoken to me almost every week for the last 2.5 years. Thanks for being helpful and kind with my learning. Thanks all of the interesting articles that you have shared with me.\n\nThank you to Perle who has been doing language exchanges with me for a long time despite having a much higher level of English than I do of French. Thanks for all of the discussions about veganism and for your contagious enthusiasm for my native language of English and for the encouragement with my French.\n\nThanks to Wafaa for all of the great exchanges in French and English and your perspective on the world and world events.\n\nThanks to my long term French tutor Anna who has endless supplies of interesting articles and videos and great advice on learning her language. Thanks for being patient and adaptable but also really funny.\n\nThanks to the mods on Writestreak for tirelessly correcting over 450 posts I have written there.\n\nThanks to the French speakers on HelloTalk for giving feedback on over 2 years of recordings and posts there.\n\nThanks to all of the regulars on the French group chats who are friendly, interesting and open minded. Every week I learn something new about French but also about other countries and cultures.\n\nWhat are you thankful about regarding your language learning for the past year?",
        "created_utc": 1673805025,
        "upvote_ratio": 1.0
    },
    {
        "title": "Curious the age range of language learners on this sub. What age are y’all and how many languages do you speak?",
        "author": "herrlowe",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cpyld/curious_the_age_range_of_language_learners_on/",
        "text": "",
        "created_utc": 1673804997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think going to a native-TL-speaking country is a good idea to help learn?",
        "author": "NeverBefore800",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cptnc/do_you_think_going_to_a_nativetlspeaking_country/",
        "text": "",
        "created_utc": 1673804661,
        "upvote_ratio": 0.99
    },
    {
        "title": "Is language learning dependent on being able to understand the meaning of the target language?",
        "author": "NeverBefore800",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cph47/is_language_learning_dependent_on_being_able_to/",
        "text": "[removed]",
        "created_utc": 1673803817,
        "upvote_ratio": 0.99
    },
    {
        "title": "Survey about language learning and language exchange",
        "author": "dongxiaa",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cpazv/survey_about_language_learning_and_language/",
        "text": "Hello everyone! I’m currently studying UX design and I have homework to create a survey. Since I love language learning I decided my survey to be about people who love to study languages and have problems finding a language partner. The survey is anonymous and won’t take you more than 5 minutes. It is also entirely with educational purpose. I would greatly appreciate it if you could help me out and fill out the form. Here is the link for the survey: https://docs.google.com/forms/d/e/1FAIpQLSemC3yisE8mqh-86JaTJ1cwocwX4rQEBzF3_j1nkmS5FiyJpg/viewform",
        "created_utc": 1673803404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is language learning possible with nothing to associate meaning with?",
        "author": "NeverBefore800",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cp3oa/is_language_learning_possible_with_nothing_to/",
        "text": "[removed]",
        "created_utc": 1673802914,
        "upvote_ratio": 0.99
    },
    {
        "title": "Regarding native languages and jobs",
        "author": "seyramlarit",
        "url": "https://www.reddit.com/r/languagelearning/comments/10coztm/regarding_native_languages_and_jobs/",
        "text": "Probably not the most appropriate sub but maybe some of you know something about this.\n\nI was raised in a bilingual household. As such I speak language X and Y, and live in a country that has no ties to either language. My company asked for proof that I speak one of them... I'm now curious. \n\nAm I legally required to take an official test to prove that I do speak a language? Or how can I prove that I was simply raised in that language? Are companies and agencies simply supposed to take my word for it?",
        "created_utc": 1673802660,
        "upvote_ratio": 1.0
    },
    {
        "title": "AI for chats in other languages",
        "author": "Equivalent_Ad_8413",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cowtf/ai_for_chats_in_other_languages/",
        "text": "Has there been a decent chatbot released for conversations practice in other language? If imagine it would work best if you could set the level.",
        "created_utc": 1673802462,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to learn a language just by reading a foreign book with no pictures AND without looking up any words, without using any translations, and without using the words in any interaction whatsoever?",
        "author": "NeverBefore800",
        "url": "https://www.reddit.com/r/languagelearning/comments/10coiqg/is_it_possible_to_learn_a_language_just_by/",
        "text": "This is a strengthening of a question that was asked before. I am wondering whether you think this is possible.",
        "created_utc": 1673801520,
        "upvote_ratio": 0.99
    },
    {
        "title": "Studying Italian and French at once - is it a reasonable thing?",
        "author": "tide-pods-are-yummy",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cnqao/studying_italian_and_french_at_once_is_it_a/",
        "text": "I'm a native Spanish (Castilian) speaker, currently attending A2-level class for Italian. While discussing about the different languages I was considering studying with the teachers of my language school, I mentioned I was considering signing up for A2 French along with Italian, and the C1 French teacher advised me against it.\n\nAccording to them, French and Italian are too different in terms of phonetics, and they also said that students who took both languages often had a hard time. I did study French in the past for like 7 years, but forgot some of it within the last 2 years, so I'm somewhere around an A2 level if I manage to polish it up.\n\nI really wanna sign up for Italian and French next year, but should I listen to the French teacher and maybe leave French for later?",
        "created_utc": 1673799583,
        "upvote_ratio": 1.0
    },
    {
        "title": "How important is conversational practice for mastering a foreign language?",
        "author": "learnenglish96",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cnfq6/how_important_is_conversational_practice_for/",
        "text": "[removed]",
        "created_utc": 1673798867,
        "upvote_ratio": 1.0
    },
    {
        "title": "need help with Arabic",
        "author": "Dense-Climate-7509",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cnfo4/need_help_with_arabic/",
        "text": "",
        "created_utc": 1673798863,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chinese Song Recommendations",
        "author": "youmomas",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cneqp/chinese_song_recommendations/",
        "text": "I've recently been on the hunt for some songs in Mandarin Chinese that have a simple background guitar tune. I'm not a very professional guitar player, so just something I can sing around a campfire (if that makes sense). I love enaging with my languages through singing and music that bonds people together. I'll attach a song that gives you an idea, and it is also a song recommendation for anyone learning Spanish.  \n\n[O Pato - Ebony Lauren](https://www.youtube.com/watch?v=gw1exf19lQM)\n\nI do not have a preference in stye. It could be a song that your grandparents used to listen to, or even young teenagers these days really adore. I like all types of music :)\n\nThank you for your help, and have a good day.",
        "created_utc": 1673798798,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would it be accurate to say that learning a language is like entering a new world?",
        "author": "justkeepbreathing94",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cmsfx/would_it_be_accurate_to_say_that_learning_a/",
        "text": "Here's an example. My wife is natively Polish, while I am not and don't know any Polish at all (besides \"kurwa\"). There is a whole world of culture, tradition, books, movies, comedy/jokes, so on, that I'll have no access to. It's like she has this other world, the Polish world, that I'm an outsider to.\n\nWould you say learning a language let's you into other worlds like this?",
        "created_utc": 1673797257,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you cope with a language with a substantial diglossia?",
        "author": "tiger5grape",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cmal7/how_do_you_cope_with_a_language_with_a/",
        "text": "I've been studying Persian for some years now and am quite advanced, but I'm still very insecure about this.",
        "created_utc": 1673795945,
        "upvote_ratio": 1.0
    },
    {
        "title": "French pronunciations are hard in conversations",
        "author": "3sperr",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cljf1/french_pronunciations_are_hard_in_conversations/",
        "text": "Like bro, Ive been learning french for a solid 7-8 days, but idk if I'll be able to make solid conversations with people. Like I can make a few conversations myself and I can make a tad bit of small talk and goodbyes, but the pronunciations are hard. Sometimes when a native speaks, you wont be able to pick out the words theyre saying because of the pronunciations, so youd end up not knowing what theyre saying. It sucks. Text isnt that bad because I dont have to pronounce it, but the French conversations are built diff. This is my first language that Im learning seriously. Duolingo btw\n\nDoes this get easier? Ive been practicing everyday for 7-8 days straight, so will I be alot better at french audios and translating natives' french speaking by April at least?",
        "created_utc": 1673793911,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are you thankful about regarding langage learning over the last year?",
        "author": "edelay",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cl6yn/what_are_you_thankful_about_regarding_langage/",
        "text": "I am thankful to my language partner Marie who has spoken to me almost every week for the last 2.5 years. Thanks for being helpful and kind with my learning. Thanks all of the interesting articles that you have shared with me.\n\nThank you to Perle who has been doing language exchanges with me for a long time despite having a much higher level of English than I do of French. Thanks for all of the discussions about veganism and for your contagious enthusiasm for English.\n\nThanks to Wafaa for all of the great exchanges in French and English and your perspective on the world and world events.\n\nThanks to my long term French tutor who has endless supplies of interesting articles and videos and who has endless advice on learning her language. Thanks for being patient and adaptable but also funny.\n\nThanks to the mods on Writestreak for tirelessly correcting  over 450 posts I have written there.\n\nThanks to the French speakers on HelloTalk for giving feedback on over 2 years of recordings and posts there.\n\nThanks to all of the regulars on the French group chats who are friendly, interesting and open minded. Every week I learn something new about French but also about other countries and cultures.\n\nWhat are you thankful about regarding your language learning for the past year?",
        "created_utc": 1673792939,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spanish Refresher",
        "author": "bussappa",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ckwny/spanish_refresher/",
        "text": "I need to refresh my Spanish but I need to do it when I'm driving or working so it can't be a visual learning aide.  Any recommendations for audio files?  I was looking at Babbel but I'm not sure if they provide audio files.",
        "created_utc": 1673792131,
        "upvote_ratio": 1.0
    },
    {
        "title": "What accent do I have?",
        "author": "elisamartina",
        "url": "https://v.redd.it/0ljd4anbn7ca1",
        "text": "",
        "created_utc": 1673789956,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to learn Spanish language in less time? Skillshare is the only one best platform to learn any language easily in less time.",
        "author": "TheRunic2",
        "url": "https://skillshare.eqcm.net/0Jb3BO",
        "text": "",
        "created_utc": 1673788341,
        "upvote_ratio": 1.0
    },
    {
        "title": "English C1 contents/what learn at this level",
        "author": "bottlecrazylittle",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cjiqz/english_c1_contentswhat_learn_at_this_level/",
        "text": "[removed]",
        "created_utc": 1673788239,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any examples where the singular and plural word are totally different? For example someone told me that in Arabic the word for tower is burj and the plural is a totally different word i.e. Abraaj. Wondering if that was actual?",
        "author": "entropy_bucket",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cj7wa/are_there_any_examples_where_the_singular_and/",
        "text": "",
        "created_utc": 1673787379,
        "upvote_ratio": 1.0
    },
    {
        "title": "namms ke tonn",
        "author": "ThrowRA8888899900",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cikv2/namms_ke_tonn/",
        "text": "Da piao no ćou dey shiim es ta waherm",
        "created_utc": 1673785388,
        "upvote_ratio": 1.0
    },
    {
        "title": "I write French and English perfectly and understand it without problem but I am not able to pronounce anything well even though I have been studying them for years. Does anyone know why this is happening?",
        "author": "thaliawithasperger",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cijp0/i_write_french_and_english_perfectly_and/",
        "text": "",
        "created_utc": 1673785281,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Websites for Learning Russian?",
        "author": "ctreaked",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cg5b9/best_websites_for_learning_russian/",
        "text": "As the title says I'm just looking for the best websites to learn the Russian Language. If you could drop anything that's helpful that would be great thank you! :)))",
        "created_utc": 1673776913,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you use LingQ for books or other reading content?",
        "author": "PositiveSimilar",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cf5fl/do_you_use_lingq_for_books_or_other_reading/",
        "text": "I'm interested in understanding how other people use LingQ. Personally I only use it for books but I know it's built more for other content and maybe I'm missing some of its useful features.",
        "created_utc": 1673773125,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are your best strategies for learning a language?",
        "author": "Pigsfly13",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cdrda/what_are_your_best_strategies_for_learning_a/",
        "text": "i’m talking the stuff others don’t regularly try or use, what works for you and why? can be as specific or unspecific as you like\n\nhoping to just get a master list type thing for new learners who don’t know where to start",
        "created_utc": 1673767883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reading in my TL takes me back to how I felt reading books as a child",
        "author": "spooky-cat-",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cbxfx/reading_in_my_tl_takes_me_back_to_how_i_felt/",
        "text": "It’s that feeling of not understanding every word, and having to be ok with that and imagine the scene anyway. And figuring out what words mean purely based on the context - I love that lightbulb moment where the meaning of a word finally clicks after seeing it several times.  Maybe it’ll only feel this way until my vocabulary and reading ability improve, but I’m enjoying it for now!",
        "created_utc": 1673761508,
        "upvote_ratio": 1.0
    },
    {
        "title": "do u think English as a language is overrated?",
        "author": "SoftClear",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cb1aq/do_u_think_english_as_a_language_is_overrated/",
        "text": "",
        "created_utc": 1673758671,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many new cards should be added to anki every day to get the best out of vocab study?",
        "author": "illuso07",
        "url": "https://www.reddit.com/r/languagelearning/comments/10calay/how_many_new_cards_should_be_added_to_anki_every/",
        "text": "",
        "created_utc": 1673757274,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you often can't remember the language of something you've read or watched?",
        "author": "No_Government_8303",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cah0k/do_you_often_cant_remember_the_language_of/",
        "text": "Sometimes I don't even realize what language something that I'm consuming is in, I mean it's funny, 'cause it seems like my brain doesn't categorize languages in boxes anymore, it is just information. \nI guess it's common, but it's also interesting to realize that.",
        "created_utc": 1673756915,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am curious,Can I learn a language I never learnt before through only and only reading a book about it with no pictures?is it scientifically possible?",
        "author": "Organic_Radio8936",
        "url": "https://www.reddit.com/r/languagelearning/comments/10cacjz/i_am_curiouscan_i_learn_a_language_i_never_learnt/",
        "text": "",
        "created_utc": 1673756508,
        "upvote_ratio": 1.0
    },
    {
        "title": "According to you,what is the most intense and challenging ways possible to learn kanji?",
        "author": "Organic_Radio8936",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ca58b/according_to_youwhat_is_the_most_intense_and/",
        "text": "",
        "created_utc": 1673755862,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the best way you guys have found to learn Thai?",
        "author": "Equivalent_Fault_473",
        "url": "https://www.reddit.com/r/languagelearning/comments/10c83b2/whats_the_best_way_you_guys_have_found_to_learn/",
        "text": "Places like Babel and Duolingo don’t provide it so I thought I’d ask someone who may have learned it or knows a program that offers it (English speaking)",
        "created_utc": 1673749782,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any way to learn Japanese as a group online?",
        "author": "SkepticChair",
        "url": "https://www.reddit.com/r/languagelearning/comments/10c80ht/is_there_any_way_to_learn_japanese_as_a_group/",
        "text": "[removed]",
        "created_utc": 1673749557,
        "upvote_ratio": 1.0
    },
    {
        "title": "You can download all the Course Contents (PDF) for Rosetta Stone for free",
        "author": "bojsy",
        "url": "https://www.reddit.com/r/languagelearning/comments/10c7ahu/you_can_download_all_the_course_contents_pdf_for/",
        "text": "[https://support.rosettastone.com/s/article/Rosetta-Stone-Course-Contents?language=en\\_US](https://support.rosettastone.com/s/article/Rosetta-Stone-Course-Contents?language=en_US)\n\nDoesn't necessarily make it worth buying now, but it does help if you've already got it or just want to check out what kind of content they offer. They even included a vocabulary list with frequency for some languages.",
        "created_utc": 1673747520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Countries in SE-Asia in their native language",
        "author": "trend_maps",
        "url": "https://i.redd.it/imz083qa35ca1.jpg",
        "text": "",
        "created_utc": 1673740993,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any recommendations on flashcard apps?",
        "author": "The_Guermo",
        "url": "https://www.reddit.com/r/languagelearning/comments/10c4oe3/any_recommendations_on_flashcard_apps/",
        "text": "I tried Anki, and after fighting it for 5 minutes because I wanted to review a deck for the second time, and it being vehemently opposed to it and it only allowing me to review the card again in a few minutes or 4 days. I've decided it's best to move on. Any thought?",
        "created_utc": 1673740451,
        "upvote_ratio": 1.0
    },
    {
        "title": "using an AI to chat to in your target language?",
        "author": "johnjohnjohnxxxxcc",
        "url": "https://www.reddit.com/r/languagelearning/comments/10c4703/using_an_ai_to_chat_to_in_your_target_language/",
        "text": "I was curious about this but was worried the AI would use wrong grammar, does anyone have experience with it and have an AI that you would recommend?",
        "created_utc": 1673739202,
        "upvote_ratio": 1.0
    }
]