[
    {
        "title": "Indonesian study material",
        "author": "I-am_robot80",
        "url": "https://www.reddit.com/r/languagelearning/comments/11tntwc/indonesian_study_material/",
        "text": "Hello my fellow language learners! I have resently fell in love with the indonesian language and i would like to learn it but i havent found any good materials to study from. Would be amazing if you could share free materials (yt channels also) that i could start with!\n\nPs english isnt so if i did some bigger mistakes could you please correct me \n\nThanks🙂",
        "created_utc": 1679050790,
        "upvote_ratio": 1.0
    },
    {
        "title": "My english doesn't come naturally, any advice?",
        "author": "Impossible-Movie8728",
        "url": "https://www.reddit.com/r/languagelearning/comments/11tnrqe/my_english_doesnt_come_naturally_any_advice/",
        "text": "English is my second language, spanish is my first. I absolutely know english fluently and know everything about grammar and even only think in my head in english. The only issue I have though is that I can't really speak it without having to think about it instead of it just coming out of my mouth naturally. The reason why is because I'm kind of insecure about my english even though I would say it sounds fluent but you can still hear a little accent there, to me I  just think it sounds weird. I even think it's an accomplishment when I say a full sentence without it sounding weird or like I'm not pronouncing the words too harshly (this might have to do with the fact spanish is my mother tongue and we pronounce words strongly if you know what I'm saying). My issue is that I also stutter, and my mind goes instantly blank while speaking, and can't really talk it fast, and these stupid reasons are the reason why I can't even socialize. Does anyone have any tips that can help with this?",
        "created_utc": 1679050591,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey! I need suggestions for a language exchange game in person.",
        "author": "throughawayaccount01",
        "url": "https://www.reddit.com/r/languagelearning/comments/11tmege/hey_i_need_suggestions_for_a_language_exchange/",
        "text": "I plan to meet a bunch of people who speak different languages. I want to keep them and myself engaged into doing something that is both fun and beneficial for our language practice. If we can bond over it, that's great too... I've been thinking doing something like crosstalk, but with drawing, and then we have to guess the expression. For example, if you have noticed, there are a lot of expression that have a different meaning in every native language than the literal meaning when translated. I plan to have at least 10 or probably way more people, so it's gonna be a party, with drinks in the mix.  \n\n\nDo you have any suggestions? I would really appreciate them.",
        "created_utc": 1679046191,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anybody know some Dzhongkha[Bhutanese] learning apps",
        "author": "Lukkoleuka69",
        "url": "https://www.reddit.com/r/languagelearning/comments/11tm9cg/anybody_know_some_dzhongkhabhutanese_learning_apps/",
        "text": "",
        "created_utc": 1679045720,
        "upvote_ratio": 1.0
    },
    {
        "title": "How effective are cultural products (of high difficulty to engage) in language learning?",
        "author": "Crackedpeppers",
        "url": "https://www.reddit.com/r/languagelearning/comments/11tlzby/how_effective_are_cultural_products_of_high/",
        "text": "[removed]",
        "created_utc": 1679044812,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone wanna learn mandarin with me,also japanese is ok, I'm Chinese in Canton China. I would like to lever up my English too.I appreciated chat with me .if you are interested in china culture, please let me know.",
        "author": "Maximum-Pop-164",
        "url": "https://www.reddit.com/r/languagelearning/comments/11tlevj/anyone_wanna_learn_mandarin_with_mealso_japanese/",
        "text": "",
        "created_utc": 1679042803,
        "upvote_ratio": 1.0
    },
    {
        "title": "A shit ton of resources!",
        "author": "SpyClipy",
        "url": "https://www.reddit.com/r/languagelearning/comments/11tl1g8/a_shit_ton_of_resources/",
        "text": "So yesterday I posted the link to the Chinese sub (because I learn chinese) and people really liked it, so ill extend it to all of you :D\nA friend of mine made a DC server where she has uploaded a lot of grammar books, audio files, and other language learning resources for a bunch of languages! \n(For my chinese learners we got HSK standard course 1-4 books, grammar books, children story books etc etc)\n\nAtm the server has these languages, but ask for an other one and im sure they’ll add more:\nSpanish, English, German, Korean, Japanese, Chinese, Vietnamese, Fane, Portuguese, French.\n\nhttps://discord.gg/GZ5vrzQN\n\nIf this post is against the rules of the sub im sorry, but it really is an awesome place and I truly believe yall will find use for it :D",
        "created_utc": 1679041390,
        "upvote_ratio": 1.0
    },
    {
        "title": "Arabic Grammar Guide Books",
        "author": "atlas0204",
        "url": "https://www.reddit.com/r/languagelearning/comments/11tkcqr/arabic_grammar_guide_books/",
        "text": "I am awful at Arabic and have a big exam this year for the language so wanna try improving it, and the grammar portion practically takes up the entire paper so does anyone knows any good grammar guidebooks or exercise books?",
        "created_utc": 1679038794,
        "upvote_ratio": 1.0
    },
    {
        "title": "for all of you that decided to stop learning a language, do you still try to passively engage with it?",
        "author": "NepGDamn",
        "url": "https://www.reddit.com/r/languagelearning/comments/11tk6kf/for_all_of_you_that_decided_to_stop_learning_a/",
        "text": "After two years with Finnish, I've realised that I don't have pretty much any way to engage with it in my personal interests so, instead of keep bashing my head against a wall, I think that it would be better to switch to another language (still quite sad after 2 years tbh, but I wouldn't even consider myself an intermediate in that language)\n\nI'm curious to hear your experiences with dropping a language though. I've bought some books, so I will obviously keep reading them but would you still do flashcards/vocab review in that case? (maybe ~5min instead of ~15/20)",
        "created_utc": 1679038152,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone can do this 🥺 its really important 🙏🏻",
        "author": "Purklyy",
        "url": "https://www.reddit.com/gallery/11tk1hw",
        "text": "",
        "created_utc": 1679037610,
        "upvote_ratio": 1.0
    },
    {
        "title": "Apps for French Canadian?",
        "author": "SaltyPea8",
        "url": "https://www.reddit.com/r/languagelearning/comments/11tikhi/apps_for_french_canadian/",
        "text": "Im looking for an app that teaches French canadian. Unfortunately the French on the apps I’ve seen is France French but the two are different. My girlfriends family is from Quebec and I’ve been with her for 6 years and still haven’t picked it up. I’m hoping someone could give a hand",
        "created_utc": 1679032367,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have no idea what language to learn I feel so unmotivated",
        "author": "Individual-Month633",
        "url": "https://www.reddit.com/r/languagelearning/comments/11tg25j/i_have_no_idea_what_language_to_learn_i_feel_so/",
        "text": "Originally I used to study Japanese, Korean, German and a bunch of other languages because I love falling in love with the language how it sounded and all the culture that was behind it as well as the people. But ever since covid it is been hard for me to revert back to language learning specifically Japanese ( which was the one I was most successful in learning) mainly because I’ve lost inspiration. Originally this year as I was planning to finish learning Japanese and get tutoring but I feel like it’s time to move on but I feel guilty at the same time. I want to learn a new language but I just don’t know what to learn now or if I will be able to.",
        "created_utc": 1679024456,
        "upvote_ratio": 1.0
    },
    {
        "title": "50 shades of asking someone to open a window in Japanese",
        "author": "AutisticAndy18",
        "url": "https://i.redd.it/9agkd8v539oa1.jpg",
        "text": "",
        "created_utc": 1679019551,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best way to go about learning Spanish? From a total beginner to proficient?",
        "author": "realitybend18",
        "url": "https://www.reddit.com/r/languagelearning/comments/11td3b3/best_way_to_go_about_learning_spanish_from_a/",
        "text": "Tips and tricks for learning a new language fast? Setting phones language to Spanish? Watching Spanish movies? Asking my spanish speaking friends to speak spanish with me?",
        "created_utc": 1679016235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I study English Grammar?",
        "author": "Angel-Mysterious",
        "url": "https://www.reddit.com/r/languagelearning/comments/11tcpn6/should_i_study_english_grammar/",
        "text": "I've been study English for 2 years or so and I've been doing mostly reading and listening. I studied grammar, but only the extremely basic. Should I start to study English Grammar in depth now or wait until I'm fluent or next to it?\n\nMy objective for the future: to be completely fluent in English, after all I'll be a English Teacher.\n\nOBS: I have a lot of free time.",
        "created_utc": 1679015222,
        "upvote_ratio": 1.0
    },
    {
        "title": "Korean speakers: Is this a good way to start learning how to read Korean characters? I saw a YouTube video with this idea and added some extra letters to it but was wondering how correct this was. I'm also having trouble understanding the double consonants.",
        "author": "LPineapplePizzaLover",
        "url": "https://i.redd.it/0kqmpofx67oa1.png",
        "text": "",
        "created_utc": 1679014888,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to really pronounciate Valeria in Germany?",
        "author": "maiasub",
        "url": "https://www.reddit.com/r/languagelearning/comments/11tceo0/how_to_really_pronounciate_valeria_in_germany/",
        "text": "How to find its ipa?",
        "created_utc": 1679014413,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like being proficient in English isn't a big deal?",
        "author": "Ghost3080",
        "url": "https://www.reddit.com/r/languagelearning/comments/11tbqau/i_feel_like_being_proficient_in_english_isnt_a/",
        "text": "I'm from a country where supposedly only 5% of the population can have a conversation in English. I have 0 friends or acquaintances who can speak English. \n\nI used to think that it was an impressive feat to be good at English, because while I was in school, I was the guy who everyone asked for the answers during English tests. And maybe it still is an \"impressive feat\", but only in my country of Brazil. \n\nAfter I was introduced to the English world of the internet, I saw how it is the language that connects the whole planet, and before that, I had zero knowledge of this fact. So because of this, I feel like speaking English isn't something impressive at all, but maybe I am wrong? I honestly don't know.",
        "created_utc": 1679013099,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who help me to learn english??",
        "author": "didof98",
        "url": "https://www.reddit.com/r/languagelearning/comments/11taly1/who_help_me_to_learn_english/",
        "text": "",
        "created_utc": 1679010726,
        "upvote_ratio": 1.0
    },
    {
        "title": "need help translating this symbol please!",
        "author": "ProtectionNo6594",
        "url": "https://i.redd.it/ptdw1zbf78oa1.jpg",
        "text": "",
        "created_utc": 1679008891,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone correct my mistakes?",
        "author": "jesaispasmoii",
        "url": "https://i.redd.it/lmwa0ozk68oa1.jpg",
        "text": "",
        "created_utc": 1679008595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hubei Dialect of Mandarin Chinese",
        "author": "Rocksarecool10",
        "url": "https://i.redd.it/i3pxzpjgr7oa1.jpg",
        "text": "",
        "created_utc": 1679003510,
        "upvote_ratio": 1.0
    },
    {
        "title": "Most useful/essential languages for each continent?",
        "author": "ExquisiteTerra",
        "url": "https://www.reddit.com/r/languagelearning/comments/11t6kgt/most_usefulessential_languages_for_each_continent/",
        "text": "Hi. I want to learn the most essential/required languages for each continent of the world. I have:\n\nNorth America (English)\nSouth America (Spanish)\nEurope (English, because it is the lingua franca of Europe)\nOceania (English)\n\nI plan on learning Mandarin for Asia. With English and Mandarin you can get by pretty well in China + India (i.e. most of Asia).\n\nBut what about Africa? Is English good enough to get by in most of Africa? Or would I need French/Arabic? Do the Arabic-speaking countries in Africa have good English? Is English useful in the African countries that have French as an official language? \n\nOr maybe I should just skip Africa since it's not that important? What do you think?",
        "created_utc": 1679001442,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why exactly am I less fluent in English than I am in Polish",
        "author": "araiderofthelostark",
        "url": "https://www.reddit.com/r/languagelearning/comments/11t5oeb/why_exactly_am_i_less_fluent_in_english_than_i_am/",
        "text": "[removed]",
        "created_utc": 1678999396,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT4 for language learning",
        "author": "NigroqueSimillima",
        "url": "https://www.reddit.com/r/languagelearning/comments/11t56ml/chatgpt4_for_language_learning/",
        "text": "As many of you might know, ChatGPT4 was released this week and I've been interested in using it for language learning. What's nice about ChatGPT4 is you can ask it create sentence in target language, at a target language level, and you can even ask it for a specific subject. An example in French\n\nPrompt: Give me an example of French sentences at levels from A1 to C2..\n\nOutput:\n\nHere are examples of French sentences at each level from A1 to C2, along with their English translations:\n\nA1 (Beginner):\nSentence: Je m'appelle Marie.\nTranslation: My name is Marie.\n\nA2 (Elementary):\nSentence: Elle travaille dans un bureau.\nTranslation: She works in an office.\n\nB1 (Intermediate):\nSentence: Si je finis mon travail tôt, je pourrai aller au cinéma.\nTranslation: If I finish my work early, I can go to the cinema.\n\nB2 (Upper-Intermediate):\nSentence: Malgré la pluie, ils ont décidé de continuer leur randonnée.\nTranslation: Despite the rain, they decided to continue their hike.\n\nC1 (Advanced):\nSentence: En dépit des progrès technologiques, la fracture numérique persiste dans de nombreuses régions du monde.\nTranslation: Despite technological advancements, the digital divide persists in many regions of the world.\n\nC2 (Proficient):\nSentence: La mise en œuvre de politiques environnementales rigoureuses est indispensable pour atténuer les effets du changement climatique et préserver la biodiversité.\nTranslation: The implementation of rigorous environmental policies is essential for mitigating the effects of climate change and preserving biodiversity.\n\nFurthermore, you can ask it make the sentences about a specific subject, if you so choose.\n\nPrompt: Give me an example of Spanish sentences about Mexico City at levels from A1 to C2..\n\nOutput\n\nHere are examples of Spanish sentences about Mexico City at each level from A1 to C2, along with their English translations:\n\nA1 (Beginner):\nSentence: México es una ciudad grande.\nTranslation: Mexico City is a big city.\n\nA2 (Elementary):\nSentence: En la Ciudad de México hay muchos museos.\nTranslation: In Mexico City, there are many museums.\n\nB1 (Intermediate):\nSentence: Si viajo a la Ciudad de México, quiero visitar el Palacio de Bellas Artes.\nTranslation: If I travel to Mexico City, I want to visit the Palace of Fine Arts.\n\nB2 (Upper-Intermediate):\nSentence: A pesar del tráfico, la Ciudad de México ofrece una amplia variedad de actividades culturales y recreativas.\nTranslation: Despite the traffic, Mexico City offers a wide variety of cultural and recreational activities.\n\nC1 (Advanced):\nSentence: La Ciudad de México enfrenta desafíos considerables en términos de contaminación del aire y gestión del transporte público.\nTranslation: Mexico City faces considerable challenges in terms of air pollution and public transportation management.\n\nC2 (Proficient):\nSentence: La implementación de políticas urbanas sostenibles es fundamental para mejorar la calidad de vida de los habitantes de la Ciudad de México y mitigar los efectos del cambio climático en la metrópoli.\nTranslation: The implementation of sustainable urban policies is essential for improving the quality of life for Mexico City's inhabitants and mitigating the effects of climate change in the metropolis.\n\nWe can try this in more difficult languages as well...\n\nGive me an example of Japanese sentences about American history at levels from A1 to C2..\n\nOutput: In Japanese, language proficiency levels are not defined as A1 to C2 but rather by the Japanese-Language Proficiency Test (JLPT) levels, which range from N5 (beginner) to N1 (advanced). Here are examples of Japanese sentences about American history at each JLPT level, along with their English translations:\n\nN5 (Beginner):\nSentence: アメリカは1776年に独立しました。\nRomaji: Amerika wa 1776-nen ni dokuritsu shimashita.\nTranslation: America became independent in 1776.\n\nN4 (Elementary):\nSentence: アメリカの初代大統領はジョージ・ワシントンです。\nRomaji: Amerika no shodai daitōryō wa Jōji Washington desu.\nTranslation: The first president of the United States was George Washington.\n\nN3 (Intermediate):\nSentence: アメリカ南北戦争は1861年から1865年まで続きました。\nRomaji: Amerika nanboku sensō wa 1861-nen kara 1865-nen made tsuzukimashita.\nTranslation: The American Civil War lasted from 1861 to 1865.\n\nN2 (Upper-Intermediate):\nSentence: ルイジアナ買収は、アメリカがフランスから大きな土地を買った歴史的な出来事です。\nRomaji: Ruijiana baishū wa, Amerika ga Furansu kara ōkina tochi o katta rekishi-teki na dekigoto desu.\nTranslation: The Louisiana Purchase was a historical event in which America bought a large piece of land from France.\n\nN1 (Advanced):\nSentence: 1960年代のアメリカでは、公民権運動が盛んになり、アフリカ系アメリカ人の権利拡大を求める声が高まりました。\nRomaji: 1960-nendai no Amerika de wa, kōminken undō ga sakari ni nari, Afurika-kei Amerikajin no kenri kakudai o motomeru koe ga takamari mashita.\nTranslation: In the 1960s in the United States, the civil rights movement gained momentum, and calls for the expansion of rights for African Americans intensified.\n\nAnd Russian: Give me an example of Russian sentences about Japanese history at levels from A1 to C2..\n\n\nOutput:In Russian, language proficiency levels are not defined as A1 to C2 but rather by the Test of Russian as a Foreign Language (TORFL) levels, which range from Elementary (A1) to Native Speaker (C2). Here are examples of Russian sentences about Japanese history at each TORFL level, along with their English translations:\n\nElementary (A1):\nSentence: Япония - это островная страна.\nTranslation: Japan is an island country.\n\nBasic (A2):\nSentence: Самураи были воины в Японии.\nTranslation: Samurai were warriors in Japan.\n\nIntermediate (B1):\nSentence: Эдо было старым названием Токио.\nTranslation: Edo was the old name of Tokyo.\n\nUpper Intermediate (B2):\nSentence: В 1945 году Япония капитулировала после атомных бомбардировок.\nTranslation: In 1945, Japan surrendered after the atomic bombings.\n\nAdvanced (C1):\nSentence: Мэйдзи-исин был периодом быстрого модернизации и западизации Японии в конце 19-го века.\nTranslation: The Meiji Restoration was a period of rapid modernization and Westernization of Japan in the late 19th century.\n\nNative Speaker (C2):\nSentence: С эпохи Тайка, начавшейся в 645 году, Япония пережила серию политических реформ, направленных на централизацию власти и укрепление императорского правления, что оказало значительное влияние на дальнейшее развитие японской культуры и общества.\nTranslation: Starting from the Taika Era in 645, Japan underwent a series of political reforms aimed at centralizing power and strengthening imperial rule, which had a significant impact on the further development of Japanese culture and society.\n\nYou can ask for grammatical explanations as well, I ask it the explanation the translation of the most advanced Japanese sentence :\n\nHere's an explanation of the translation:\n\n1960年代のアメリカでは (1960-nendai no Amerika de wa) - This part of the sentence translates to \"In the 1960s in the United States.\" The term \"1960年代\" (1960-nendai) refers to the decade of the 1960s. \"アメリカ\" (Amerika) is the Japanese word for America or the United States, \"では\" (de wa) is a particle combination that sets the context or location.\n公民権運動が盛んになり (kōminken undō ga sakari ni nari) - This part translates to \"the civil rights movement gained momentum.\" \"公民権運動\" (kōminken undō) is the Japanese term for the civil rights movement, \"が\" (ga) is a subject marker, and \"盛んになり\" (sakari ni nari) means \"gained momentum\" or \"became active.\"\nアフリカ系アメリカ人の権利拡大を求める声が高まりました (Afurika-kei Amerikajin no kenri kakudai o motomeru koe ga takamari mashita) - This part translates to \"and calls for the expansion of rights for African Americans intensified.\" \"アフリカ系アメリカ人\" (Afurika-kei Amerikajin) is the Japanese term for African Americans, \"の\" (no) is a possessive particle, \"権利拡大\" (kenri kakudai) means \"expansion of rights,\" \"を\" (o) is an object marker, \"求める声\" (motomeru koe) means \"calls for\" or \"voices demanding,\" \"が\" (ga) is a subject marker, and \"高まりました\" (takamari mashita) means \"intensified\" or \"increased.\"\nCombining all these parts, you get the English translation: \"In the 1960s in the United States, the civil rights movement gained momentum, and calls for the expansion of rights for African Americans intensified.\"\n\nFrench is the only language in this post I actually understand anything, so please let me know if the rest of the translations make sense. I purposely picked subject matters, for Russian and Japanese that are unlikely to be heavily discussed in the respective language in order to see if I could get it to trip up.",
        "created_utc": 1678998260,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT4 for language learning",
        "author": "NigroqueSimillima",
        "url": "https://www.reddit.com/r/languagelearning/comments/11t56bw/chatgpt4_for_language_learning/",
        "text": "As many of you might know, ChatGPT4 was released this week and I've been interested in using it for language learning. What's nice about ChatGPT4 is you can ask it create sentence in target language, at a target language level, and you can even ask it for a specific subject. An example in French\n\nPrompt: Give me an example of French sentences at levels from A1 to C2..\n\nOutput:\n\nHere are examples of French sentences at each level from A1 to C2, along with their English translations:\n\nA1 (Beginner):\nSentence: Je m'appelle Marie.\nTranslation: My name is Marie.\n\nA2 (Elementary):\nSentence: Elle travaille dans un bureau.\nTranslation: She works in an office.\n\nB1 (Intermediate):\nSentence: Si je finis mon travail tôt, je pourrai aller au cinéma.\nTranslation: If I finish my work early, I can go to the cinema.\n\nB2 (Upper-Intermediate):\nSentence: Malgré la pluie, ils ont décidé de continuer leur randonnée.\nTranslation: Despite the rain, they decided to continue their hike.\n\nC1 (Advanced):\nSentence: En dépit des progrès technologiques, la fracture numérique persiste dans de nombreuses régions du monde.\nTranslation: Despite technological advancements, the digital divide persists in many regions of the world.\n\nC2 (Proficient):\nSentence: La mise en œuvre de politiques environnementales rigoureuses est indispensable pour atténuer les effets du changement climatique et préserver la biodiversité.\nTranslation: The implementation of rigorous environmental policies is essential for mitigating the effects of climate change and preserving biodiversity.\n\nFurthermore, you can ask it make the sentences about a specific subject, if you so choose.\n\nPrompt: Give me an example of Spanish sentences about Mexico City at levels from A1 to C2..\n\nOutput\n\nHere are examples of Spanish sentences about Mexico City at each level from A1 to C2, along with their English translations:\n\nA1 (Beginner):\nSentence: México es una ciudad grande.\nTranslation: Mexico City is a big city.\n\nA2 (Elementary):\nSentence: En la Ciudad de México hay muchos museos.\nTranslation: In Mexico City, there are many museums.\n\nB1 (Intermediate):\nSentence: Si viajo a la Ciudad de México, quiero visitar el Palacio de Bellas Artes.\nTranslation: If I travel to Mexico City, I want to visit the Palace of Fine Arts.\n\nB2 (Upper-Intermediate):\nSentence: A pesar del tráfico, la Ciudad de México ofrece una amplia variedad de actividades culturales y recreativas.\nTranslation: Despite the traffic, Mexico City offers a wide variety of cultural and recreational activities.\n\nC1 (Advanced):\nSentence: La Ciudad de México enfrenta desafíos considerables en términos de contaminación del aire y gestión del transporte público.\nTranslation: Mexico City faces considerable challenges in terms of air pollution and public transportation management.\n\nC2 (Proficient):\nSentence: La implementación de políticas urbanas sostenibles es fundamental para mejorar la calidad de vida de los habitantes de la Ciudad de México y mitigar los efectos del cambio climático en la metrópoli.\nTranslation: The implementation of sustainable urban policies is essential for improving the quality of life for Mexico City's inhabitants and mitigating the effects of climate change in the metropolis.\n\nWe can try this in more difficult languages as well...\n\nGive me an example of Japanese sentences about American history at levels from A1 to C2..\n\nOutput: In Japanese, language proficiency levels are not defined as A1 to C2 but rather by the Japanese-Language Proficiency Test (JLPT) levels, which range from N5 (beginner) to N1 (advanced). Here are examples of Japanese sentences about American history at each JLPT level, along with their English translations:\n\nN5 (Beginner):\nSentence: アメリカは1776年に独立しました。\nRomaji: Amerika wa 1776-nen ni dokuritsu shimashita.\nTranslation: America became independent in 1776.\n\nN4 (Elementary):\nSentence: アメリカの初代大統領はジョージ・ワシントンです。\nRomaji: Amerika no shodai daitōryō wa Jōji Washington desu.\nTranslation: The first president of the United States was George Washington.\n\nN3 (Intermediate):\nSentence: アメリカ南北戦争は1861年から1865年まで続きました。\nRomaji: Amerika nanboku sensō wa 1861-nen kara 1865-nen made tsuzukimashita.\nTranslation: The American Civil War lasted from 1861 to 1865.\n\nN2 (Upper-Intermediate):\nSentence: ルイジアナ買収は、アメリカがフランスから大きな土地を買った歴史的な出来事です。\nRomaji: Ruijiana baishū wa, Amerika ga Furansu kara ōkina tochi o katta rekishi-teki na dekigoto desu.\nTranslation: The Louisiana Purchase was a historical event in which America bought a large piece of land from France.\n\nN1 (Advanced):\nSentence: 1960年代のアメリカでは、公民権運動が盛んになり、アフリカ系アメリカ人の権利拡大を求める声が高まりました。\nRomaji: 1960-nendai no Amerika de wa, kōminken undō ga sakari ni nari, Afurika-kei Amerikajin no kenri kakudai o motomeru koe ga takamari mashita.\nTranslation: In the 1960s in the United States, the civil rights movement gained momentum, and calls for the expansion of rights for African Americans intensified.\n\nAnd Russian: Give me an example of Russian sentences about Japanese history at levels from A1 to C2..\n\n\nOutput:In Russian, language proficiency levels are not defined as A1 to C2 but rather by the Test of Russian as a Foreign Language (TORFL) levels, which range from Elementary (A1) to Native Speaker (C2). Here are examples of Russian sentences about Japanese history at each TORFL level, along with their English translations:\n\nElementary (A1):\nSentence: Япония - это островная страна.\nTranslation: Japan is an island country.\n\nBasic (A2):\nSentence: Самураи были воины в Японии.\nTranslation: Samurai were warriors in Japan.\n\nIntermediate (B1):\nSentence: Эдо было старым названием Токио.\nTranslation: Edo was the old name of Tokyo.\n\nUpper Intermediate (B2):\nSentence: В 1945 году Япония капитулировала после атомных бомбардировок.\nTranslation: In 1945, Japan surrendered after the atomic bombings.\n\nAdvanced (C1):\nSentence: Мэйдзи-исин был периодом быстрого модернизации и западизации Японии в конце 19-го века.\nTranslation: The Meiji Restoration was a period of rapid modernization and Westernization of Japan in the late 19th century.\n\nNative Speaker (C2):\nSentence: С эпохи Тайка, начавшейся в 645 году, Япония пережила серию политических реформ, направленных на централизацию власти и укрепление императорского правления, что оказало значительное влияние на дальнейшее развитие японской культуры и общества.\nTranslation: Starting from the Taika Era in 645, Japan underwent a series of political reforms aimed at centralizing power and strengthening imperial rule, which had a significant impact on the further development of Japanese culture and society.\n\nYou can ask for grammatical explanations as well, I ask it the explanation the translation of the most advanced Japanese sentence :\n\nHere's an explanation of the translation:\n\n1960年代のアメリカでは (1960-nendai no Amerika de wa) - This part of the sentence translates to \"In the 1960s in the United States.\" The term \"1960年代\" (1960-nendai) refers to the decade of the 1960s. \"アメリカ\" (Amerika) is the Japanese word for America or the United States, \"では\" (de wa) is a particle combination that sets the context or location.\n公民権運動が盛んになり (kōminken undō ga sakari ni nari) - This part translates to \"the civil rights movement gained momentum.\" \"公民権運動\" (kōminken undō) is the Japanese term for the civil rights movement, \"が\" (ga) is a subject marker, and \"盛んになり\" (sakari ni nari) means \"gained momentum\" or \"became active.\"\nアフリカ系アメリカ人の権利拡大を求める声が高まりました (Afurika-kei Amerikajin no kenri kakudai o motomeru koe ga takamari mashita) - This part translates to \"and calls for the expansion of rights for African Americans intensified.\" \"アフリカ系アメリカ人\" (Afurika-kei Amerikajin) is the Japanese term for African Americans, \"の\" (no) is a possessive particle, \"権利拡大\" (kenri kakudai) means \"expansion of rights,\" \"を\" (o) is an object marker, \"求める声\" (motomeru koe) means \"calls for\" or \"voices demanding,\" \"が\" (ga) is a subject marker, and \"高まりました\" (takamari mashita) means \"intensified\" or \"increased.\"\nCombining all these parts, you get the English translation: \"In the 1960s in the United States, the civil rights movement gained momentum, and calls for the expansion of rights for African Americans intensified.\"\n\nFrench is the only language in this post I actually understand anything, so please let me know if the rest of the translations make sense. I purposely picked subject matters, for Russian and Japanese that are unlikely to be heavily discussed in the respective language in order to see if I could get it to trip up.",
        "created_utc": 1678998241,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any free sites that can help me learn Spanish?",
        "author": "Lucasspookuss",
        "url": "https://www.reddit.com/r/languagelearning/comments/11t518r/any_free_sites_that_can_help_me_learn_spanish/",
        "text": "I’m a beginner and am really interested in learning Spanish. I currently speak English and Japanese, and am really wanting to further my knowledge of other languages and Spanish is something I’ve always wanted to learn. Is there any sites you recommend 😁",
        "created_utc": 1678997917,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning Hindi Question",
        "author": "anda_tarkari",
        "url": "https://www.reddit.com/r/languagelearning/comments/11t4se9/learning_hindi_question/",
        "text": "Im Indian, but grew up in the US, so my native language is English, but I am fluent in Odia as well because I speak it at home (Odia is a language from East India that is related to Hindi, Bengali, etc). \n\nI can understand a bit from similar vocab, more if it is written, and I know the script from reading religious stuff in Sanskrit, so could I learn Hindi by just watching stuff in it? \n\nThe main problems I have are the Urdu words that don’t have equivalents in Odia, like arambh vs shuru, since they make up a large part of casual speech and the grammar. \n\nI",
        "created_utc": 1678997357,
        "upvote_ratio": 1.0
    },
    {
        "title": "As a foreign language major in college, is it weird to want to talk to someone after overhearing the person speak in the language I am learning?",
        "author": "Intrepid-Message-274",
        "url": "https://www.reddit.com/r/languagelearning/comments/11t4mqb/as_a_foreign_language_major_in_college_is_it/",
        "text": "I went back to college to pursue my love of languages. When I was younger I loved going to Disney just to see how many languages I could recognize and understand. After not keeping up with my studies, I went back to college (2 years ago) to become an interpreter. The language I am learning is not super common where I live, so when I hear it I want to at least say hi. Is that weird? I get so excited to hear it out and about.",
        "created_utc": 1678996983,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the most obscure languages you can speak or are learning?",
        "author": "Xefjord",
        "url": "https://www.reddit.com/r/languagelearning/comments/11t4e7z/what_are_the_most_obscure_languages_you_can_speak/",
        "text": "Hey Xefjord here. I am interested in what the most obscure languages our community speaks and what the most obscure languages some of you are learning is. It is of course relative so feel free to comment whatever you feel fits.\n\nI would also love to hear your experience learning these languages, as well as what drew you to them.\n\nAlso, if anyone speaks an especially obscure language and wants to work together. I do make free survival courses for every living language no matter how obscure (so long as it is not extinct or a conlang) but I would still love to hear about the conlangs and extinct languages people's are learning :)",
        "created_utc": 1678996446,
        "upvote_ratio": 1.0
    },
    {
        "title": "A dedicated discord server for the Cambridge English Assessment Exam.",
        "author": "Linguistatics",
        "url": "https://www.reddit.com/r/languagelearning/comments/11t49ri/a_dedicated_discord_server_for_the_cambridge/",
        "text": "[removed]",
        "created_utc": 1678996163,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for easily accessible Croatian language learning options",
        "author": "Elle241",
        "url": "https://www.reddit.com/r/languagelearning/comments/11t3e5c/looking_for_easily_accessible_croatian_language/",
        "text": "My husband is Croatian as is his entire family, and we return to Croatia to visit often enough that I feel I could benefit from learning the language to a decent extent. \n\nI’ve discovered the apps Mondly and Drops teach Croatian, does anyone have any opinion on which is better? I am also open to suggestions if there is a better option out there, doesn’t have to be free, I’d prefer it to be something I can use on my phone though. \n\nThank you!",
        "created_utc": 1678994097,
        "upvote_ratio": 1.0
    },
    {
        "title": "Online English Lessons for 3$-6$ an Hour; Homework and Essay Check; Rephrasing. Read Below for Further Details:",
        "author": "Ok-Challenge9827",
        "url": "https://www.reddit.com/r/languagelearning/comments/11t2oi0/online_english_lessons_for_36_an_hour_homework/",
        "text": "\nPrice (Other Services):\nHomework Check - 3$-10$ (depending on difficulty and length) ;\nEssay Check - 5$-15$ (depending on difficulty and length) + includes reccomendations ;\nRephrasing - 3$-15$ (depending on length) :\n\n\n\nPrice (Online Lessons): \nIndividual Lessons - 6$ (Reading, Writing) ;\nIndividual Lessons - 5$ (Speaking) ;\nIndividual Lessons - 5$ (Grammar) ;\nIndividual Lessons - 7$ (Reading, Writing, Grammar, Speaking) ;\nGroup Lessons (Siblings, Friends ect.) - 3$-5$ (depends on number of people) :\n\n\n\nAvailable Classes (Eastern Time):\n\nMonday: 8:00 AM - 9:00 AM ;\nWednesday: 7:30 AM - 8:30 AM / 1:00 PM - 2:00 PM ;\nFriday: 1:00 PM - 2:00 PM ;\nSaturday: 8:00 AM - 9:00 AM ;\nSunday: 6:00 AM - 7:00 AM / 8:00 AM - 9:00 AM / 11:00 AM - 12:00 PM :\n\nLessons are held online using Google Meets or Teams.             \n\nContact for more information.",
        "created_utc": 1678992468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with preparation for my German language test",
        "author": "unendlicheeinsamkeit",
        "url": "https://www.reddit.com/r/languagelearning/comments/11t29jp/help_with_preparation_for_my_german_language_test/",
        "text": "I'm planning to take my german B2 test soon and as the title says I need some help preparing I believe I got the basics covered but what I lack is practice so if u got anything that could help me use my German regularly whether it's podcast, books, websites with exercises or social media platforms I'll be very grateful to you . :)",
        "created_utc": 1678991527,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to study",
        "author": "ObjectiveAnalysis645",
        "url": "https://www.reddit.com/r/languagelearning/comments/11t241x/how_to_study/",
        "text": "Hello everyone. I can’t believe I have to ask this but can you give me some advice on how to study? I never liked studying hence why I went to a trade school …. I don’t know what to do to get me in the mood to say “yup okay let’s study” what do you suggest I do? I really want to give school my all this time around. Thanks in advance.",
        "created_utc": 1678991182,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm not sure if I should study in the mono/bi/tri-lingual program.",
        "author": "Heavy_Purchase539",
        "url": "https://www.reddit.com/r/languagelearning/comments/11t23pk/im_not_sure_if_i_should_study_in_the/",
        "text": "Hello, all.\n\nThis might not be the most traditional post on /r/languagelearning, but I thought my fellow language lovers might have some good advice for my current conundrum.\n\nI'm living in a French-speaking region of the world, and I'm enrolled in a university there studying finance. I'm studying at this university specifically because the program is great and I really want to improve my French. The university offers the program either monolingually (French), bilingually (French and English), or trilingually (French, English, and Spanish).\n\nI speak English natively, my Spanish is probably at a C2 level (it's my heritage language), and my French is at a strong B2/C1.\n\nI did a semester in the bilingual program and I didn't like it as much because everyone spoke fluent English so everyone spoke in English with me. However, in groups, it was all French, but I felt weird speaking in French when everyone established that I spoke English.\n\nI'm kind of interested in the monolingual program because I think everyone there is going to feel more comfortable speaking French, so my French will improve. I'm also interested in the trilingual program because I'll get to improve my business skills in all three languages, also, as a language learner, it'd be amazing to have a degree in your field and have it explicitly say \"trilingual.\" That sounds awesome! I'm not so interested in the bilingual program. I will say that this only applies to the core courses, as the specialized courses for my major (finance) will be exclusively in French. I'm also required to study abroad, and I'm thinking of Chile to strengthen my Spanish. I think that if I can study abroad twice (which I'm actively going to pursue), I'm going to see if I can study in Romandy/Suisse Romande or France, to strengthen my French.\n\n**Long-term plan**: work in finance on Wall Street, and then live and work in Miami. If all my dreams come true, then I live in Latin America and make an American income. Therefore, Spanish and English will always be relevant in my life, English being more relevant, and French to a way lesser degree. Maybe I'll work with Swiss/French/Monégasque/Belgian/Luxembourgish bankers at some point in my career.\n\nThanks, merci y gracias!",
        "created_utc": 1678991157,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I take a break or continue with my curriculum?",
        "author": "ericaeharris",
        "url": "https://www.reddit.com/r/languagelearning/comments/11t0lsd/should_i_take_a_break_or_continue_with_my/",
        "text": "I’m learning Korean. I initially started learning via my Korean friends. I found myself in a Korean community unexpectedly and began to pick up the language. My Korean friends range in no English spoken to fluent.\n\nAfter learning some with them, I began to use YouTube and the Talk to Me in Korean curriculum. I finished Level 2 (out of 10), but could not understand the conversation at the end because I didn’t remember some of the vocabulary words and my listening skills are still improving.\n\nInitially, I thought maybe I should take a break on the curriculum and grammar to try to learn more vocabulary and understand that sample conversation before I continued with the curriculum.\n\nNow, I’m starting to second guess this line of thinking and I’m wondering if I should just keep on with the curriculum and learn vocabulary as I go.\n\nI’m also going to Korea in July and want to learn as much as I can before then, especially since I’ll be seeing some of my friends who don’t speak English and I want to be able to communicate more with them. Thoughts?",
        "created_utc": 1678987860,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommendations for overcoming the intermediate plateau",
        "author": "thawkins6786",
        "url": "https://www.reddit.com/r/languagelearning/comments/11szzdp/recommendations_for_overcoming_the_intermediate/",
        "text": "I am looking for some advice or maybe someone's personal experience on how they overcame the intermediate plateau. I have been learning Spanish now for about 2 years and have gotten to point where I am comfortable having very basic conversations with people, but over the last few months I have felt my progression grinding to a halt. Currently my daily learning routine consists of a 30 min Pimsler audio course, 20 to 30 mins of duolingo and 20 to 30 mins of Spanish youtube. I also have a 30 min conversational lesson on italki twice a week. Any advice on things i should change or add to my daily routine would be much appreciated!",
        "created_utc": 1678986526,
        "upvote_ratio": 1.0
    },
    {
        "title": "The difference between the \"natural\" and the traditional methods",
        "author": "justwannalook12",
        "url": "https://www.reddit.com/r/languagelearning/comments/11szqdb/the_difference_between_the_natural_and_the/",
        "text": "I've seen people commenting that everyone has their own personal learning styles and there is no agreed upon way for everyone to copy. Rightfully so.\n\nBut one of the big downsides of going with the traditional classroom and textbook methodology or even going 50/50 and adding immersion, is that you get tired! We're all human and unless you have a built-in environment like a university or insane self-motivation, then sooner or later, you will stop.\n\nThe \"natural\" method, or comprehensible input, or immersion, whatever you want to call it has that big advantage. Obviously in the beginning, it's a lot of work to listen to even a 10 min podcast but as you advance, your tolerance increases until it's about as much as much effort as listening to your NL. You don't get tired. And that's a big thing especially if we're talking about thousands of hours needed to reach \"fluency\" or your end goal.",
        "created_utc": 1678986003,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did you pick which language to focus on?",
        "author": "mrschwob",
        "url": "https://www.reddit.com/r/languagelearning/comments/11synjt/how_did_you_pick_which_language_to_focus_on/",
        "text": "I am currently a humble monoglot. I have interest in the following languages for the following reasons:\n\n-Spanish : I live in the US, and this is a practical language to learn + My partner speaks it + Spanish is the foreign language I am the most advanced in (though I'm still bad at it)\n\n-German : My grandparents are German, and I always had a goal to be able to speak with them + I have distant family in Germany (never met them though) + I may want to move to Germany/Switzerland later in my career\n\n-Tagalog : My partner's native tongue and her family's + I would love to go to the Philippines + Easiest access to practice (with family!)\n\n-Mandarin : Right now, my favorite language + I have many Chinese friends to practice with\n\n-Russian : Want to read Golden Age of Russian Literature (though I know this would be VERY hard to do)\n\nThey are listed from most proficient to least proficient. Realistically, I only have time for one to \"rigorously\" study for the time being. I feel like I change my mind every day on what to study, and I never make great progress because of this. How did you choose which language(s) to focus on, and do you have any tips for me?",
        "created_utc": 1678983617,
        "upvote_ratio": 1.0
    },
    {
        "title": "💀",
        "author": "Old_Set1465",
        "url": "https://www.reddit.com/r/languagelearning/comments/11sykie/_/",
        "text": "[removed]",
        "created_utc": 1678983434,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you recommend the best start way to learning Latin?",
        "author": "kimvely_anna",
        "url": "https://www.reddit.com/r/languagelearning/comments/11sxcex/can_you_recommend_the_best_start_way_to_learning/",
        "text": "And how about Duolingo?",
        "created_utc": 1678980648,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tartu University's machine translation engine now translates 23 Finno-Ugric languages",
        "author": "PoiHolloi2020",
        "url": "https://estonianworld.com/technology/tartu-universitys-machine-translation-engine-now-translates-23-finno-ugric-languages/",
        "text": "",
        "created_utc": 1678979023,
        "upvote_ratio": 1.0
    },
    {
        "title": "French!",
        "author": "FIREful_symmetry",
        "url": "https://www.reddit.com/r/languagelearning/comments/11swf4k/french/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/ovgvjewm74oa1.png?width=526&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=8ad5c263bc456ec9dd6f4bff5bdf0b472a9f5347",
        "created_utc": 1678978533,
        "upvote_ratio": 1.0
    },
    {
        "title": "Simplest flashcards Android app?",
        "author": "atazix",
        "url": "https://www.reddit.com/r/languagelearning/comments/11sw91u/simplest_flashcards_android_app/",
        "text": "i need the simplest possible app.\nbasically, i need a note taking app where i write whatever on one side, flip the note and write whatever on the other side. that's it. basically, i need a digital version of a small piece of paper so i can write things on both sides and flip it whenever i need to learn new vocabulary.\n\ni have ADD so all these ankis and quizlets and whatnot are way too overkill for me.\n\noh and please no obnoxious \"signing in\" if possible. i dunno why on earth they force to create an account for every minute app these days.",
        "created_utc": 1678978153,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a native english speaker as a partner",
        "author": "AdministrationNew205",
        "url": "https://www.reddit.com/r/languagelearning/comments/11svix0/looking_for_a_native_english_speaker_as_a_partner/",
        "text": "Hello everyone, I’m looking for a native english speaker to have conversations with on the phone for practice. I can provide insights to the individual’s communication style on things such as the use of filler words etc.. if you’re interested please let me know, thanks!",
        "created_utc": 1678976456,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone tell me what does 'of which' in that sentence mean?",
        "author": "PlatinumCrowbar239",
        "url": "https://i.redd.it/zz7zpjwzh5oa1.jpg",
        "text": "I've been struggling with this sentence. I know preposition can be moved to the beginning of the relative clause but I don't think that 'of' is written before 'which' because when preposition is moved to the beginning of the relative clause, the next word should be noun not verb.",
        "created_utc": 1678976114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone tell me what does 'of which' in that sentence mean?",
        "author": "PlatinumCrowbar239",
        "url": "https://i.redd.it/h6e3x5mph5oa1.jpg",
        "text": "I've been struggling with this sentence. I know preposition can be moved to the beginning of the relative clause but I don't think that 'of' is written before 'which' because when preposition is moved to the beginning of the relative clause, the next word should be noun not verb.",
        "created_utc": 1678976018,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for an Native English Speaking Partner",
        "author": "AdministrationNew205",
        "url": "https://www.reddit.com/r/languagelearning/comments/11suyfy/looking_for_an_native_english_speaking_partner/",
        "text": "Hello everyone, I’m looking for a native english speaker to have conversations with on the phone for practice. I can provide insights to the individual’s communication style on things such as the use of filler words etc.. if you’re interested please let me know, thanks!",
        "created_utc": 1678975152,
        "upvote_ratio": 1.0
    },
    {
        "title": "When it comes to pronunciation, should you exaggerate it a bit at first?",
        "author": "linguistca",
        "url": "https://www.reddit.com/r/languagelearning/comments/11suy4u/when_it_comes_to_pronunciation_should_you/",
        "text": "I feel like there's often a debate whether to over-pronounce things at first or to let it develop naturally even if it's weak-sounding or hard to hear. Some thoughts I see feel like the exaggeration creates too much of a \"parody\" way of speaking  but then others have said that when they get complimented the most on their accents and quality of speech is when they are doing so. It seems like maybe if you overdo it at first to where you think you sound too strong, that actually once it settles down and you're having to use it in an active conversation, that it's just right?\n\n&amp;#x200B;\n\nWhat about when it's harder to project and still speak clearly? I feel like sometimes you really do have to practice over exaggerating then. \n\n&amp;#x200B;\n\nSome also say not to work on it at all and that it'll just come over time. So I wondered what others' thoughts were on this, and what you've had success with overall?",
        "created_utc": 1678975130,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there an app or widget to give you live subtitles or a voice over in your language, during watching a tik tok live stream? On iPhone",
        "author": "writtendream2",
        "url": "https://www.reddit.com/r/languagelearning/comments/11su25d/is_there_an_app_or_widget_to_give_you_live/",
        "text": "",
        "created_utc": 1678973004,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I learn the language taught by my school or should I choose a language and learn it by myself?",
        "author": "GuyThatIsQatari",
        "url": "https://www.reddit.com/r/languagelearning/comments/11st4cu/should_i_learn_the_language_taught_by_my_school/",
        "text": "Yeah so the question is: Should I learn the language taught by my school or should I choose a language and learn it by myself?",
        "created_utc": 1678970655,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it possible to learn a language in 3 months?",
        "author": "imitbmijp",
        "url": "https://www.reddit.com/r/languagelearning/comments/11srntp/is_it_possible_to_learn_a_language_in_3_months/",
        "text": "my friend says he has a friend who learned russian in 3 months, is that possible to do? I told him that seems really quick, no?",
        "created_utc": 1678966949,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a problem reading out loud NUMBERS",
        "author": "EstimateWise5911",
        "url": "https://www.reddit.com/r/languagelearning/comments/11sr8lv/i_have_a_problem_reading_out_loud_numbers/",
        "text": "One thing that I like to do is talk to natives using Cambly. To improve my pronunciation, I enjoy reading out loud. But always when I see a number, my brain freezes and, I only can think of this number in my mother language. I have already been reading more texts with numbers of any type: time, age, prices, etc... Is it a normal thing? Can someone give me some advice?",
        "created_utc": 1678965743,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any Spanish Grammar Audio Courses/Podcast Recommendations?",
        "author": "soapandwhory",
        "url": "https://www.reddit.com/r/languagelearning/comments/11sr7ws/any_spanish_grammar_audio_coursespodcast/",
        "text": "I'm around a B1 level in Spanish and arguably have B2 listening/reading skills (or at least I'm fast approaching this level). However, when it comes to the production aspect of the language, I find myself struggling to confidently conjugate verbs, even though I can totally understand them via input. I know the common advice here would be to get a grammar textbook but it's not something that suits my learning style, at least right now when I wouldn't be motivated to do so. Ideally, I'd love to have an audio course for grammar and particularly one where the speaker only speaks in Spanish. \n\nOne podcast I've found that ticks this box is 'Hoy Hablamos Gramática'. Others I've found tackle grammar in a sporadic manner, which while useful, isn't want I'm looking for as I want something more structured.\n\nAny recommendations at this point would be great! Please note that I'm specifically looking for audio sources (I'm a big fan of non-audio formats such as Kwiziq) as this is what I need in this current stage of my learning journey. Thanks!",
        "created_utc": 1678965684,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello. I'm starting to learn German on my own and I'm having a bit of a tough time building my syllabus. Would like some help!",
        "author": "myEyesAreKindaFine",
        "url": "https://www.reddit.com/r/languagelearning/comments/11sr6ac/hello_im_starting_to_learn_german_on_my_own_and/",
        "text": "My objective for this \"course\" is to learn very basic vocabulary, grammar, and reading comprehension. My resources are The German Grammer Drills textbook and the textbook my university uses for level 1 German (I'm not taking the course so don't have access to the syllabus, but do have the textbook), a dictionary, and a few other online resources for quizzes and such. I will be designating 2 hours a week for it for 13 weeks. Does anyone have tips for how I can build it/have an example that worked well for them?",
        "created_utc": 1678965555,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey Friends!! 😊 What language is this? And does anybody know what it means please?",
        "author": "Salty_Ad5916",
        "url": "https://i.redd.it/eioreytrh4oa1.jpg",
        "text": "",
        "created_utc": 1678963929,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm working on a AI-powered foreign language tutor to simulate talking to a native speaker without the fear or embarrassment. Any devs wanna help?",
        "author": "friedrice4u",
        "url": "https://www.reddit.com/r/languagelearning/comments/11sqfjq/im_working_on_a_aipowered_foreign_language_tutor/",
        "text": "test server: https://lang.ztag.com\n\n[https://github.com/playztag/ai-language-tutor](https://github.com/playztag/ai-language-tutor)\n\nThis is SUPER CRUDE right now, I slapped it together using ChatGPT-4 in a day. Wanted to get this out there quickly to see if anyone wanna help with this project. You can test it on my AWS server but I'm really new at all this and 99% followed AI given instructions so dunno how reliable anything is. It's somewhat functional but has A LOT of room to improve.\n\nAnyone wanna help? Thanks!!",
        "created_utc": 1678963254,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I get rid of needing subtitles when learning a foreign language?",
        "author": "noobknight87",
        "url": "https://www.reddit.com/r/languagelearning/comments/11sptv0/how_do_i_get_rid_of_needing_subtitles_when/",
        "text": "I want to learn languages whose media does not usually offer subtitles and watch videos that do not come with subtitles/listen with podcasts, but I keep feeling like I need subtitles as it seems daunting to not watch anything without subtitles even though I really do not want to rely on this tool. In any case I really don't want to rely on subtitles in the next foreign languages that I learn.\n\nHow do I break out of this mindset? The foreign languages that I already speak are extremely popular and thus offer subtitles for 90% of the videos that I want to watch, and anyway I've reached a point where I can listen to entire podcast episodes and series in these languages without a transcript anyway (so activating them is more for convenience), so I have already become accustomed to subtitles.",
        "created_utc": 1678961319,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning another latin/greek derived language - if only to improve my english",
        "author": "22sev",
        "url": "https://www.reddit.com/r/languagelearning/comments/11sp72i/learning_another_latingreek_derived_language_if/",
        "text": "When looking up words, such as \"echelon\" for example, Ive noticed that in french \"echelle\" means ladder, and it got me thinking that possibly if I learned french, I would almost automatically understand many more English words (as well as having another language under my belt, which in itself is wonderful enough obvs)\n\nSpanish may have the same effect, as well as German.. Am I right in thinking this? If so, which language would you recommend would be best to take on?",
        "created_utc": 1678959101,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with some sentences",
        "author": "christinaxmay",
        "url": "https://www.reddit.com/r/languagelearning/comments/11so8jo/help_with_some_sentences/",
        "text": "Hi everyone!\n\nCan you please help with me several sentences? \n\n1. The heroine ________ (prefer) to be with Paul because James _______ (argue/always).\n\nMy answer was “prefers” and “is always arguing”. But the book says “always argues”. Why? She finds him annoying, it happens constantly that’s why we use present cont.\n\n2. Already this week, I _______ (sent) her five emails – and I _______ (receive) a reply to all of them in just in few minutes.\n\nPlease explain me why we use present perfect in the first place and past Simple in the second place. It was the right answers in the book.\n\nHave a nice day!",
        "created_utc": 1678955658,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learn to build an E-Commerce Site with React | Full Stack Masterclass",
        "author": "Reginald_Martin",
        "url": "https://hubs.la/Q01GZw450",
        "text": "",
        "created_utc": 1678946491,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning another language as a dyslexic.",
        "author": "Pebbles14Ya",
        "url": "https://www.reddit.com/r/languagelearning/comments/11sl4mw/learning_another_language_as_a_dyslexic/",
        "text": "Hello, I have to take 4 semesters of Spanish for my degree. This said, I do actually want to learn Spanish. However, I do have Dyslexia and it is making my life a nightmare. I was wondering if anyone who has Dyslexia has learned another language successfully? I am trying to hard and barely keep afloat. I would also like to put out there that this is the only subject I do not have an A in. \n\nI know all Dyslexics are different, so I will put my struggles here. \n-My vowels tend to get mixed up even if I know how to spell a word. Sometimes, I can catch this, but not all the time. I am the worst with \"ie\" mix ups. \n-It gets worse when I get frustrated and letters can move.\n- It is also auditory for me. There are many words in english I can read correctly and not pronounce correctly. \n- Word recollection. Often, I want to use a word, and it just will not come to the forefront on my mind, and this is with English, which is currently my only language.  \n- There is a lag. I'll actually know what is being said, but I will ask, and right before they start to explain, I realize what was said. \n\nThe list is actually really long, so I decided to stop. With English, I still struggle at times, but for the most part, I can work around my Dyslexia. With Spanish I have no tools available specific for learning with Dyslexia and I could not learn English until I was taught in a way that was Dyslexia oriented. \nI can also say that even though I am struggling I am oddly doing better than the first go around. I was a child then, though 😅\nWorst part about this is many of the struggles I thought I had gotten over are rearing their ugly head into my everyday life with English now, too. It's kind of like learning a new language sent my Dyslexia into overdrive.  Anyways I really hope someone has suggestions! I am sorry this ended up being so long.",
        "created_utc": 1678944292,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found this - 'MIT Kanji Learning Any Time, Any Place For Japanese V, Spring 2022'",
        "author": "europa-eu",
        "url": "https://www.youtube.com/watch?v=_FtXi0_ZMvk&amp;list=PLUl4u3cNGP62Mr5APSizHgFa0hRiWgPln",
        "text": "",
        "created_utc": 1678943662,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where do I find the most difficult, mumbling, naturalistic audio?",
        "author": "LeGrandSommeil",
        "url": "https://www.reddit.com/r/languagelearning/comments/11skxje/where_do_i_find_the_most_difficult_mumbling/",
        "text": "Most podcasts, radio plays, sports broadcasts, youtube videos and other social media are too clean and polished, in that they're presented, scripted, or people usually speak in turns into professional sound equipment.\n\nIn order to challenge myself, where can I find media (preferably thousands of hours) of multiple native speakers talking amongst each other, interrupting, losing trains of thought, swallowing words and sentences? Is there any type of \"genre\" of media like that? As naturalistic and as difficult as possible? In short, eavesdropping on a conversation at a coffeeshop or bar between two friends - something like that.\n\nRecommendations for French would be the best, but for any language would be grand. Thank you!",
        "created_utc": 1678943621,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do i pronounce a pharyngeal N",
        "author": "Joinedtoaskagain",
        "url": "https://www.reddit.com/r/languagelearning/comments/11sjlap/how_do_i_pronounce_a_pharyngeal_n/",
        "text": " \n\nany tips to pronounce a pharengyal N?",
        "created_utc": 1678939363,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on learning multiple (East Asian) languages at once?",
        "author": "tofu_teacherinkorea",
        "url": "https://www.reddit.com/r/languagelearning/comments/11shrpr/advice_on_learning_multiple_east_asian_languages/",
        "text": "Hello all! It's a lifetime goal of mine to be fluent (or at least conversationally fluent) in Mandarin Chinese, Japanese, and Korean. This is way harder said than done, especially since the languages share such similar patterns and sounds. I initially thought learning one at a time would be best, as that was the easiest way to not get confused between them. But when I move onto the next language and don't speak the previous for a while, I basically lose my ability in the previous language. On the flip side, when I study the languages at the same time, I get confused and mix them up (ex. adding Chinese words into Japanese sentences).\n\nFor context, I learned Mandarin Chinese in an intensive program in university and then switched to Japanese in order to study abroad in Japan. After learning Japanese, I basically lost any and all of my abilities in Mandarin. I live in Korea now and have been trying my best to learn Korean, but I've noticed that my Japanese knowledge interferes with being able to progress in Korean. \n\nIs it best to consistently study all 3 languages as often as possible? Should I break them up into blocks (like Chinese one week, Japanese the next, etc.)? What is the best course of action for continuing to progress in and maintain all 3 languages? \n\nWhen I've asked for advice about this before, people tell me to just give up and focus on one language only, but I refuse to believe it's not possible!",
        "created_utc": 1678934364,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beijing Chinese same as Mandarin",
        "author": "HandsPHD",
        "url": "https://www.reddit.com/r/languagelearning/comments/11sh2b8/beijing_chinese_same_as_mandarin/",
        "text": "Just purchased a multi language sub to Glossika which was pretty expensive. \n\nWhen I purchased I watched a lot of reviews that all said that it was a great resource. \n\nThe reviewers mentioned that it has Mandarin Chinese. Now that I purchased I noticed that it's listed as Beijing Chinese and they have Chinese (Taiwan). \n\nSo is this just a way to say standard mandarin or is this a special dialect? \n\nI'm concerned since I know that the Norwegian they have a dialect that's only spoken by like 5% of the population of Norway. It's a little annoying. They should have both. \n\nAnyone have any info on this that could help out?",
        "created_utc": 1678932598,
        "upvote_ratio": 1.0
    },
    {
        "title": "AI Prompts for Language Learning",
        "author": "fosskers",
        "url": "https://www.reddit.com/r/languagelearning/comments/11sgnff/ai_prompts_for_language_learning/",
        "text": "Hi folks, I'm working through German and with the release of GPT-4 yesterday, it occurred to me that AI chats like these can be an excellent source of \"raw conversation volume\". It obviously doesn't replace talking to a real human with spoken words, but for more mundane tasks like correcting grammar mistakes or exposure to realistic vocabulary, there's definitely potential here. Here's the prompt I've crafted so far. It's decent but doesn't always work as intended:\n\n---\n\nI am learning German. Let's have a conversation in German. If I make a mistake,\nplease give me the correct German in parentheses before your actual response.\nFor example, if I say:\n\nWas kann man finden in Bonn?\n\nYou would respond:\n\n(Was kann man in Bonn finden?)\n\nFollowed by your actual response.\n\nFurther, if I type English in square brackets, it means I don't know the German\nfor it. Please correct this in the same way. For example, if I say:\n\nDas war ein [joke].\n\nYou would say:\n\n(Das war ein Witz.)\n\nFollowed by your actual response.\n\nIf instead my message is completely in English, I am probably asking you a\nfollow-up question or correcting you in some other way. Ready?",
        "created_utc": 1678931593,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am interested in learning German. How difficult is German to learn?",
        "author": "SubstantialFact5498",
        "url": "https://www.reddit.com/r/languagelearning/comments/11sftqo/i_am_interested_in_learning_german_how_difficult/",
        "text": "",
        "created_utc": 1678929576,
        "upvote_ratio": 1.0
    },
    {
        "title": "Opinions on the colloquial series?",
        "author": "Joanta11111",
        "url": "https://www.reddit.com/r/languagelearning/comments/11sfjmo/opinions_on_the_colloquial_series/",
        "text": "The text book series. Personally I like them because they have so many languages, but I've never really tried them - what did you think of them?",
        "created_utc": 1678928901,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beginner French learner",
        "author": "Eminems-Burner",
        "url": "https://www.reddit.com/r/languagelearning/comments/11sfaxf/beginner_french_learner/",
        "text": "As the title states, I'm interested in learning French. Would Duolingo and a podcast be enough? If not, what else can I do to help further my understanding of French?",
        "created_utc": 1678928330,
        "upvote_ratio": 1.0
    },
    {
        "title": "How are my Hànzì looking?",
        "author": "LTAD_2108",
        "url": "https://i.redd.it/btwdej3ha1oa1.jpg",
        "text": "",
        "created_utc": 1678925155,
        "upvote_ratio": 1.0
    },
    {
        "title": "Changed my phone language",
        "author": "realestateby_zach",
        "url": "https://www.reddit.com/r/languagelearning/comments/11sdc0c/changed_my_phone_language/",
        "text": "I just changed the language on my phone to my TL and I’ve also started watching some shows in my TL with TL subtitles. Is this all a good idea and what else can I do to help me with my TL to understand words quicker and be more on my feet? I listen to music in my TL as well.",
        "created_utc": 1678923561,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can i be less aware from my pronunciation?",
        "author": "Appropriate_Nail_141",
        "url": "https://www.reddit.com/r/languagelearning/comments/11scilz/how_can_i_be_less_aware_from_my_pronunciation/",
        "text": "So i don't talk much neither in my target language or in my native but i get on a advanced level enough to identify when the pronunciation is wrong or when has accent and etc. And any time i try to speak i can't make my mouth do the right pronunciation even that i know exactly what is wrong and what should do insted then i get frustrated and quit. I know that to get it right it's just practice but how can i be sufficiently unaware that my pronunciation is bad to continue?",
        "created_utc": 1678921599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Deutsch&amp;Polnisch",
        "author": "Lanky_Hearing_368",
        "url": "https://www.reddit.com/r/languagelearning/comments/11sbgfi/deutschpolnisch/",
        "text": "Hey, \nI'm Michael, I come from Poland and it would be my dreams come true to make a friendship and teach languages each other. So let's talk and learn together 😎",
        "created_utc": 1678919138,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning a language will literally change your life.",
        "author": "ItsMou",
        "url": "https://www.reddit.com/r/languagelearning/comments/11sbf2g/learning_a_language_will_literally_change_your/",
        "text": "I am so grateful i learned English, i have acquired new knowledge regarding many different things. For example, i learned how to lose weight following an American doctor plan, i tried before many things, but they didn't work out until i found him. I got a new knowledge regarding western culture and their religion which i knew nothing about before learning the language so i become more tolerant to other people ideas and more accepting to foreign ideas. When i struggle with my studies i could simply search it up in English and would find something that could help me out with it, so now i have my native language and English to find the answer to my problems so i doubled the resources. Learning English led me also to find people on the internet who is self improving and that's motivating me to change my life.\nI can now watch movies without struggling and could communicate with many different people because English is a universal language and i could listen to more music genres that are very different than music genres in my native language. So how learning a language changed your life?",
        "created_utc": 1678919051,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Speakometer good for practicing pronunciation?",
        "author": "Horridhorsey",
        "url": "https://www.reddit.com/r/languagelearning/comments/11sawhh/is_speakometer_good_for_practicing_pronunciation/",
        "text": "I’ve been looking for a good app to practice RP because I desperately need to improve my accent and came across this app. I wonder if anyone here have used it before and can say if it’s any good and by good I mean correct. It does seem good. I’ve already tried it out but I want to be 100% sure.",
        "created_utc": 1678917923,
        "upvote_ratio": 1.0
    },
    {
        "title": "Logographic Languages Are Brilliant",
        "author": "ilovepizza1183",
        "url": "https://www.youtube.com/watch?v=mRlgpbGJG-I",
        "text": "",
        "created_utc": 1678915413,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any free apps other than duolingo to learn Hebrew",
        "author": "SpartanStriker08",
        "url": "https://www.reddit.com/r/languagelearning/comments/11s9i77/are_there_any_free_apps_other_than_duolingo_to/",
        "text": "I’m using duolingo to learn Hebrew but I want an app that can teach me Hebrew better, so does anyone have app suggestions?",
        "created_utc": 1678914875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free English lesson",
        "author": "grouseystuff",
        "url": "https://www.reddit.com/r/languagelearning/comments/11s9d3y/free_english_lesson/",
        "text": "Hey guys \n\nI offer a free conversational English lesson.\nDuration: 25-30 minutes.\nAt the end you will get personalized feedback.\n\n\nThere’s a catch though, I’d like to record our lesson and put it on YouTube.\n\n\nIf you’re fine with that, hit me up to arrange it.\nCheers",
        "created_utc": 1678914565,
        "upvote_ratio": 1.0
    },
    {
        "title": "From A1 to B1 in 15 months (German)",
        "author": "Due-Negotiation-7573",
        "url": "https://www.reddit.com/r/languagelearning/comments/11s6onp/from_a1_to_b1_in_15_months_german/",
        "text": "With my partner we are moving to Germany in august 2024 in order to study a bachelor in English. Even when the language of our studies is not German we were told that we need a decent level of it, the University there asks for A2, we think that we should be around a B1 level minimum. Now we recently started A1 lessons in the Goethe Institut in our country but I don´t think that is enough.\n\nThat said, what other resource do you recommend us in order to complement the classes in the Goethe? Any app is good? I've been reading mixed reviews about Babbel, Rosseta Stone and Rocket so I am not sure. Any recommendation outside that?\n\nThank you a lot in advance!",
        "created_utc": 1678908752,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you get job opportunities abroad if you learn your target language?",
        "author": "nullineta",
        "url": "https://www.reddit.com/r/languagelearning/comments/11s5s72/can_you_get_job_opportunities_abroad_if_you_learn/",
        "text": "For example, if you were to learn Finnish, would you have a higher chance of being offered a job/career in Finland?",
        "created_utc": 1678906886,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do highly accomplished language learners have in common?",
        "author": "homocomp",
        "url": "https://www.reddit.com/r/languagelearning/comments/11s4w38/what_do_highly_accomplished_language_learners/",
        "text": "[removed]",
        "created_utc": 1678905032,
        "upvote_ratio": 1.0
    },
    {
        "title": "Call for Mango Languages Users to Participate Research Survey (collaboration with Michigan State University)",
        "author": "mango_languages",
        "url": "https://www.reddit.com/r/languagelearning/comments/11s4lf0/call_for_mango_languages_users_to_participate/",
        "text": "Eligibility: You have used the Mango Languages app/software in the past 6 months.\n\nMango Languages has partnered with a research team in the Second Language Studies program at Michigan State University to examine how and why people use language learning software like Mango. Whether you use Mango every day, or tried it once and decided it wasn’t for you, or if you’re anywhere in between, we’d love to hear from you! \n\nFor more information, and to participate, simply click the link to complete a 15-minute survey: [https://msu.co1.qualtrics.com/jfe/form/SV\\_3DbGZCqyqEyYo4K](https://msu.co1.qualtrics.com/jfe/form/SV_3DbGZCqyqEyYo4K)\n\nUpon completion of the survey, you may be selected to participate in a one-on-one follow-up interview with the MSU research team (this is optional - you can indicate if you'd like to be contacted for an interview). Interviews will be conducted via video chat and scheduled at your convenience. Participants selected for interviews will receive an Amazon gift card.\n\nNote: This study has been approved by the Michigan State University Institutional Review Board (i.e., ethics approval for human subjects research).",
        "created_utc": 1678904422,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to become conversational in 10+ languages and would so many prevent one from reaching any kind of fluency?",
        "author": "Kucing_Muslim",
        "url": "https://www.reddit.com/r/languagelearning/comments/11s4deh/is_it_possible_to_become_conversational_in_10/",
        "text": "",
        "created_utc": 1678903966,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bing/Perplexity AI",
        "author": "Impossible_Fox7622",
        "url": "https://www.reddit.com/r/languagelearning/comments/11s3g7e/bingperplexity_ai/",
        "text": "Has anyone been using Bing and Perplexity AI to go down rabbit holes and read interesting things in their target languages? \n\nI’ve found them quite useful at generating interesting content for me to read. I might also start putting things in a Flashcard app just to review the stuff I find most interesting/useful",
        "created_utc": 1678902046,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alternatives to Memrise on Android",
        "author": "polyglot2be",
        "url": "https://www.reddit.com/r/languagelearning/comments/11s37th/alternatives_to_memrise_on_android/",
        "text": "Does ay key know any alternatives with more or less the exact same features of LingQ, but actually allow to to log in on the android app?",
        "created_utc": 1678901548,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have an oral presentation about Colombia in Spanish tomorrow, I’m happy for all feedback I can get since my Spanish (in my opinion) is trash. Thanks beforehand",
        "author": "Active_Passion1075",
        "url": "https://v.redd.it/sywy92esxyna1",
        "text": "",
        "created_utc": 1678896700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Duolingo’s Innovative Use of GPT-4 to Enhance Language Learning",
        "author": "TechBeamsBlog",
        "url": "https://www.techbeams.com/tech/duolingos-innovative-use-of-gpt-4-to-enhance-language-learning/",
        "text": "",
        "created_utc": 1678896414,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I know when to use hiragana and katakana?",
        "author": "Organnss",
        "url": "https://www.reddit.com/r/languagelearning/comments/11s0pdq/how_do_i_know_when_to_use_hiragana_and_katakana/",
        "text": "",
        "created_utc": 1678896160,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone please recommend me a good spanish textbook?",
        "author": "Moonworm04",
        "url": "https://www.reddit.com/r/languagelearning/comments/11rzgib/can_someone_please_recommend_me_a_good_spanish/",
        "text": "What I'm searching for is like a really good spanish textbook(s) that you can follow from beginner to advanced.\n\nWith pictures, chapters with vocabulary, grammer explenations, excercises, stories, information about the culture etc.\n\nLike a really good textbook that a private school would use.",
        "created_utc": 1678893529,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for an Iranian to read English books together",
        "author": "ThebigAmateur",
        "url": "https://www.reddit.com/r/languagelearning/comments/11rzewy/looking_for_an_iranian_to_read_english_books/",
        "text": "Hi.\nTitle says it all. I can read modern books easily, and I think it would be great to discuss the prose and language part of a book with someone else. Also, I can use some motivation to keep consistency in reading. So, is there any Iranian who would like to read English books with a fellow reader?",
        "created_utc": 1678893429,
        "upvote_ratio": 1.0
    },
    {
        "title": "Study English for Free with Alison",
        "author": "Powerful_Painter4247",
        "url": "https://www.reddit.com/r/languagelearning/comments/11rz2ba/study_english_for_free_with_alison/",
        "text": "[removed]",
        "created_utc": 1678892687,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beginning Tagalog learner's check-in, motivation for those considering learning a new language",
        "author": "gavrynwickert",
        "url": "https://www.reddit.com/r/languagelearning/comments/11ryhgq/beginning_tagalog_learners_checkin_motivation_for/",
        "text": "I see a lot of success stories here from people who have reached C1/C2 in their target language, and while I love to read them and find them incredibly motivating, I thought it might be encouraging for someone new to learning a language to see my \"success story\" as someone still making my way to A2. I say success story in quotes because I still have a long way to go, as you'll see, but I'm sure many of you can relate to the feeling of excitement that comes from checking off some of the milestones I'll get into.\n\n**Background:** I'm learning Tagalog/Filipino, with the main goal of being able to understand friends who speak it. Speaking, reading, and writing are all things I've been practicing as well, just to a lesser extent. **Past language-learning experience:** I don't speak a second *spoken language*, but I've learned American Sign Language (ASL) to a conversational, one-on-one proficiency, but that was after many classes, tutoring sessions, and going to many Deaf community events. This unfortunately led me to believe that I had two options for learning a language: classes or Duolingo. Thankfully I discovered some language learning YouTubers (Lindie Botes, first, then Matt vs Japan, Steve Kaufmann, etc.) who inspired me to take independent language learning seriously. THIS SUB also encouraged me so much to take language learning seriously. **Regarding time:** I should also say that I work full time, but am able to study at work depending on the day, and I'm not taking classes this semester. I have one cat and zero children, so I have a lot of free time to dedicate to language learning.\n\n**Resources:** (generally in order of how helpful they have been)\n\n1. [**Tagalog Decks**](https://www.tagalogdecks.com/) \\- this language-specific SRS deck app and website from [Tagalog.com](https://Tagalog.com) has been hugely helpful. Within about two months of using it, I've studied 1400/2000 cards, and the impact of this on my listening comprehension has been clear. \n2. **Tutoring** \\- I've had upwards of 30 lessons since I started studying on the 1st of the year. Some lessons have been classic teaching-style with PowerPoint, some have been listening practice, some conversation practice, and sometimes a mixture. I do want to hone my goals for tutoring sessions, but as a beginner, I think it's okay to let the tutors/teachers lead, since they're going to have a pretty good idea of what will help you. Any tips on this subject would be appreciated!\n3. **Mango Languages** \\- apps that teach Tagalog are somewhat uncommon (Duolingo does not), but I was grateful to discover that my local library offers a free subscription to this app. It only contains one unit for Tagalog, with ten chapters, which I completed in less than a month. However, it made for a good start.\n4. **Textbook** \\- I began my studies with *Tagalog for Beginners* by Joi Barrios. It took me about 2 months to finish, and was also a good introduction to all sorts of vocabulary, grammar, stories, etc. In the beginning, I was doing every exercise, and by the end, I was reading through the dialog and stories of each lesson on LingQ and calling it a day. \n5. **Readers** \\- there are very few books available in Tagalog on Amazon, so online reading resources have been incredibly helpful. I used my free trial of LingQ to read lots of children's stories and work through the last several chapters of the textbook I mentioned, but since then I have graduated to (slowly) working my way through a Wattpad novel using [Tagalog.com's free reader](https://www.tagalog.com/reader/).  I do want to read more as I continue my studies, so any tips y'all have would be appreciated.\n6. **YouTube teachers** \\- if you really seek them out, you can find lots of people offering totally free, in-depth tutorials regarding various vocabulary, grammar points, etc. I keep a list of teachers along with links to some of their best playlists on my [Tagalog resource Google Doc](https://docs.google.com/document/d/1_V_SHPUirhUPXTsOzP9r0xkoI_xQQ3VpyMSaiii70ps/edit?usp=sharing).\n\n**Stats &amp; More Background Info**\n\n* As of writing this, **I have studied for 128 hours** (average of 1h 44m/day).\n* **I have \"immersed\" for 141 hours** (average of 1h 54m/day).\n* At 50 hours and 100 hours, I recorded a quick check-in by reading and listening to various things and recording how much I understood, so I can look back on my progress in the future. \n* Things I count as studying: flashcards, apps, textbook study, reading, tutoring sessions, some Pimsleur, and things of that nature.\n* Things I count as immersion: listening to podcasts, watching YouTube, watching movies and TV shows, even if they're dubbed and even if I have English subtitles on, etc. \n* I track my time via TimeCap, and generally hit play as soon as I start a movie and hit pause as soon as the credits roll, and the same for podcasts and other media. For me, I'm not just tracking how many hours I've spent hearing the language, I'm also tracking how much time I've dedicated to it, even if I'm watching a movie that doesn't have as much dialog.\n* Early on, when I'd listen to a podcast in Tagalog, I would understand *nothing*, naturally. That's where Taglish podcasts came in handy, since some speak 70-90% in English and 10-30% in Tagalog. By listening to a podcast like Telebabad Tapes, I was able to familiarize myself with various common turns of phrase, with the helpful context of English. I understand why some steer clear of Taglish, but to be honest, I see it as a gift. In the future, I'd like to create a list of podcasts organized by approximate Tagalog/English percentages, with the idea that once a learner understands most of one, they can move onto the next.\n* I'm picking up on more and more without subtitles, but if I'm watching a dubbed show that I'm genuinely interested in, I'll often rewind, put on English subs, and re-watch a scene if I feel like I missed something.\n\n**Things I've learned about language learning:**\n\n* Someone once told me **\"Don't do anything unless you have to.\"** As a language learner, I only study using a certain method if I want to. I don't really force myself to do anything. My philosophy is that if I neglect an area, and it gets bad enough, then I'll probably find the motivation to go and work on it, if it's really holding me back. As a beginner, though, take advantage of the freedom. Explore all the avenues of learning and find what you enjoy.\n* Comprehension is as simple and as complicated as understanding the words someone uses. A few days ago, I ran across [this video](https://youtu.be/DlGYeWTflBQ) about getting tired after becoming full/satiated, and was so excited that I understood most of it. So I started to pick apart *why* I understood it, and realized it was because he speaks clearly, I know most of the words he uses, and I generally have a good understanding of what he's talking about. Other videos of his are even better, since he uses more visual aids (mostly stock photos) and gestures to various body parts when he discusses them. If I could just find videos exactly like this, but one for every major conversation topic, I'd be set!\n* One time, in an I-Witness documentary, [someone said \"Laban lang,\"](https://youtu.be/Ubz1ESh81dM?t=1210) and that stuck with me, because I knew \"lang\" (it means \"just\" or \"only\"), but couldn't understand what he was saying before it, since I didn't know the word and there aren't any subtitles. A week or so later, I was in a tutoring session, and the tutor mentioned \"laban\" and said it meant \"fight.\" Immediately, my brain remembered hearing that, and made sense of this thing I had almost forgotten about (laban lang = just fight, or just keep fighting). That experience really proved to me that the brain is always trying to make sense of things. The more attention you can afford to give your immersion, the more you will be rewarded. (Also, some sources say this is borrowed from Cebuano, which I would like to learn at least to an intermediate level in the future.)\n* Also, because of immersion, I understood \"'Di ba?\" to mean \"Right?\" before I even knew that it comes from \"Hindi ba?\" which is basically just asking, \"No?\" as in \"Am I wrong?\" That was another small thing that I got a lot of joy out of understanding.\n\nEvery day, when I start to get obsessed with where I might be in a month, or six months, I remind myself of how far I've come in 73 days. If my past self saw me now, they'd be so impressed, even with the small strides I've made. If I just keep studying and immersing myself in the language, my future self will probably be just as impressed with what I can accomplish.\n\nTo everyone out there learning Tagalog, or any other language of the Philippines, ***laban lang!***",
        "created_utc": 1678891450,
        "upvote_ratio": 1.0
    },
    {
        "title": "Timeframe for learning to read and write only?",
        "author": "AbsoluteUnit1997",
        "url": "https://www.reddit.com/r/languagelearning/comments/11rw7yn/timeframe_for_learning_to_read_and_write_only/",
        "text": "My spoken cantonese and mandarin is fluent, but I can't read or write at all. What is the timeframe I should aim for to become fluent in these aspects? My english is fluent aswell (UK based).",
        "created_utc": 1678886531,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beginner French for 5 year old",
        "author": "TrampolineMama",
        "url": "https://www.reddit.com/r/languagelearning/comments/11rvukr/beginner_french_for_5_year_old/",
        "text": "Hello,\n\nI'll be traveling with my 5 year old daughter from end of May until end of August.\n\nShe will be attending French Immersion grade 1 when we come back, so I'm looking for suggestions of app/programs that she can do online to get her familiar with French while we're away. Any recommendations would be appreciated.\n\nThank you.",
        "created_utc": 1678885673,
        "upvote_ratio": 1.0
    },
    {
        "title": "For language learners and teachers who are exploring how to use AI, such as ChatGPT for better language learning. /r/AIinLanguageEducation",
        "author": "OsakaWilson",
        "url": "https://www.reddit.com/r/languagelearning/comments/11ruzpv/for_language_learners_and_teachers_who_are/",
        "text": "I've just created /r/AIinLanguageEducation. At the moment I'm the only one there, but I've put up several of the ideas that I've been using for learning and teaching with AI, mainly ChatGPT.\n\nI'd love if others would join and add their experiences and get ideas from others.\n\nIf you have an interest in language learning and how AI can help, please stop by and become part of the community.",
        "created_utc": 1678883477,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your fav method to learn language?",
        "author": "Sucxces_93",
        "url": "https://www.reddit.com/r/languagelearning/comments/11rtqqu/whats_your_fav_method_to_learn_language/",
        "text": "Pick fav below. My fav is talking with people because this is the most important thing and source of it.\n\n[View Poll](https://www.reddit.com/poll/11rtqqu)",
        "created_utc": 1678880084,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I alone who does not want to change their phone settings to their TL for more *immersion*",
        "author": "dontgetmewrongonthis",
        "url": "https://www.reddit.com/r/languagelearning/comments/11rruwz/am_i_alone_who_does_not_want_to_change_their/",
        "text": "Many people seem to want to change their phone/computer/whatever they use the most to their TL, so that they were 'forced' in a way to start understating.\n\nMy native language is Russian, but I have long been using English for everything, including phone settings - wanna read a book, watch a movie, play a videogame - everything is in English.\n\nI feel more comfortable this way, English feels like my *main* language. That's why I know that even when I become very good at German I won't change whatever I'm using the most to German. I do play games and read books in German, but my most favorite online game as well as the best books I simply want to enjoy will be forever in English ❤️\n\nAnyone else feels this way?",
        "created_utc": 1678874234,
        "upvote_ratio": 1.0
    }
]