[
    {
        "title": "Powerful technique for learning by context",
        "author": "EseIzan",
        "url": "https://www.reddit.com/r/languagelearning/comments/10erbmr/powerful_technique_for_learning_by_context/",
        "text": "[removed]",
        "created_utc": 1673998457,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips for learning Russian?",
        "author": "Suitable-Customer-50",
        "url": "https://www.reddit.com/r/languagelearning/comments/10eqsu0/any_tips_for_learning_russian/",
        "text": "",
        "created_utc": 1673997203,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the translation of this song: Sqwore - Звезда упала I think it’s Russian and it sound good so I’ll learn Russian where do I start? What do I need to know",
        "author": "anines4",
        "url": "https://www.reddit.com/r/languagelearning/comments/10eqs45/what_is_the_translation_of_this_song_sqwore/",
        "text": "",
        "created_utc": 1673997153,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting back on track with language learning. Any techniques I should use?",
        "author": "Antonell15",
        "url": "https://www.reddit.com/r/languagelearning/comments/10eq81t/getting_back_on_track_with_language_learning_any/",
        "text": "So in earlier years I’ve taken spanish as a language mostly because it could be beneficial since I’ve been to Spain a few times. It was also popular at my school. I had it for a total of 5 years but never put too much effort into it and didn’t really understand it.\n\nNow however, 2 years after I last had a course in spanish, I feel like learning it again. Maybe on my own terms this time around. I wanted to do a trip throughout the Americas. Speaking spanish would certainly help. \n\nI do use duolingo, not that I think it helps that much but just so I can do something language based daily. Being swedish, I don’t struggle with pronounciation. It is somewhat similar to spanish so I think I’ll eventually get by just fine.\n\nWhat I’m seeking is tips and guides on how to continue from where I left off. It is of course hard for you to know my progress (IDK BX or CX level either). I also just found this sub so there’s that! \n\nWhere would you advice me to start off? Any certain techniques that would be useful?",
        "created_utc": 1673995807,
        "upvote_ratio": 1.0
    },
    {
        "title": "After almost 3 years of learning french i finally decided to try a language learning app like the youngsters. This is the first thing they gave me",
        "author": "greyslopp",
        "url": "https://i.redd.it/tz6ybholypca1.jpg",
        "text": "",
        "created_utc": 1673993657,
        "upvote_ratio": 1.0
    },
    {
        "title": "Goldlist vs Anki?",
        "author": "Impressive_Top789",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ep8ai/goldlist_vs_anki/",
        "text": "I've searched on this reddit for opinions on Goldlist vs Anki. I see that Anki is the crowd favorite, but I want to know the exact why.\n\nGoldlist is intriguing to me, especially since I'm learning a language that uses a completely different alphabet than my NL and all other languages I have already learned. It would force me to use the alphabet of my TL, which seems good. \n\nAnki has proven to be ineffective for me, despite proper daily usage over 60 straight days. I'm still not absorbing the same set of words. And it's like 100 words. \n\nI admit that I'm neurodivergent and have a TBI, but my short-to-long term circuits seem to work just fine in any other context. And that's literally less than 2 words a day. I could learn them much faster by straight forced repetitive repeating.\n\nI'm personally so sick of hearing how Anki is god-like, but that might be just my frustration talking--and I'm wondering if Goldlist might be a better option for me. But I'm unclear about the science of either method.\n\nSo, please explain it like I'm a kid. Why Anki vs. Goldlist (or literally any other method for vocab)",
        "created_utc": 1673993485,
        "upvote_ratio": 1.0
    },
    {
        "title": "Berlitz French test",
        "author": "SilverstoneOne",
        "url": "https://www.reddit.com/r/languagelearning/comments/10eo7ws/berlitz_french_test/",
        "text": "Hi All! \n\nDoes anyone have any resources for a mock French test with Berlitz? \n\nI want to practice old exams but can't find them anywhere online. Does anyone have a link for old exam questions?\n\nThank you 🙏",
        "created_utc": 1673991146,
        "upvote_ratio": 1.0
    },
    {
        "title": "Those who have studied an Indigenous American language, what language(s) did you learn and how did you learn it?",
        "author": "Inter_Sabellos",
        "url": "https://www.reddit.com/r/languagelearning/comments/10eo47u/those_who_have_studied_an_indigenous_american/",
        "text": "Title says it all.",
        "created_utc": 1673990911,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can Greek and Armenians understand each other's language? If not, how much does knowing one help to learn the other?",
        "author": "tdsallday",
        "url": "https://www.reddit.com/r/languagelearning/comments/10enoyh/can_greek_and_armenians_understand_each_others/",
        "text": "",
        "created_utc": 1673989950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any other ways to build up vocabulary?",
        "author": "Unique-Whereas-9209",
        "url": "https://www.reddit.com/r/languagelearning/comments/10enkab/any_other_ways_to_build_up_vocabulary/",
        "text": "So I’ve been working hard on my Russian, I’ve been watching and rewatching/reading and rereading A LOT, and it works but it gets so exhausting and it seems to have burned out my motivation a bit.\n\nI’d like to try a different approach and get back into it later \n\nI don’t want the whole experience to turn into a chore \n\nDoes anyone have any ideas or other techniques to build up vocabulary during burnout periods?",
        "created_utc": 1673989643,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unwritten language",
        "author": "ApprehensiveRich9603",
        "url": "https://www.reddit.com/r/languagelearning/comments/10enjtg/unwritten_language/",
        "text": "In your opinion, what are the difficulties and challenges of learning an unwritten language?",
        "created_utc": 1673989614,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you deal with the sadness when long term language partners are \"ghosting/dumping\" you?",
        "author": "Civil-Cardiologist52",
        "url": "https://www.reddit.com/r/languagelearning/comments/10engbr/how_do_you_deal_with_the_sadness_when_long_term/",
        "text": "I do understand that situations change, some get really busy, reach their language goal or disappear completely. \n\nI have had many language exchange partners and formed great friendships. There were also long term exchange partners whom I talked to every day and met but it leaves a very bad and cold aftertaste when the person ghosts you immediately everywhere after reaching their goal( earning certificate etc.) and not even giving me the chance to congratulate..I guess that's one of the frustrating things when you are a serious learner.\n\nDo you have similar experiences? How do you usually move on?",
        "created_utc": 1673989389,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question for B2/C1 level learners",
        "author": "LaReineDesRats",
        "url": "https://www.reddit.com/r/languagelearning/comments/10en1wl/question_for_b2c1_level_learners/",
        "text": "Just curious: does anyone sometimes go back and revise things you learned at B1/B2 level just to keep everything in check?\n\nI've considered doing this as a teacher mentioned in a class the other day that most of the B2/C1 students studying for French DELF/DALF often focus so hard on complicated parts that they slip up on the simple basics as they haven't thought to revisit the foundations of the language during their preparation.",
        "created_utc": 1673988478,
        "upvote_ratio": 1.0
    },
    {
        "title": "How well do you need to speak a language to teach it?",
        "author": "Usual_Quiet_2209",
        "url": "https://www.reddit.com/r/languagelearning/comments/10emyki/how_well_do_you_need_to_speak_a_language_to_teach/",
        "text": "",
        "created_utc": 1673988266,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to increase my learning efficiency in a class full of people talking the language?",
        "author": "AnythingButPredictab",
        "url": "https://www.reddit.com/r/languagelearning/comments/10emkuu/how_to_increase_my_learning_efficiency_in_a_class/",
        "text": "I'm a native Arab and fluent in English. However, I have to learn French in university alongside studying engineering. \n\n\nWe are learning the basic stuff albeit a little fast. However, most of my classmates are French educated so a lot of times I struggle to understand their communications with our teacher. I've always read that the best way to learn a language is to be with people who speaks the language (immersion). So, what are some tips to maximize my learning effectiveness taking into consideration that 70% of the time I can't comprehend what others are saying?\n\n\nPlease note that I don't have any idea about the language and that this course is mandatory.",
        "created_utc": 1673987387,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are Chinese titles of Hollywood films different between various regions?",
        "author": "blackcyborg009",
        "url": "https://www.reddit.com/r/languagelearning/comments/10em7vq/why_are_chinese_titles_of_hollywood_films/",
        "text": "For example:  \nThe film M3GAN (by Universal Pictures) has different Chinese movie titles:  \nHong Kong / Macau =  人工殺姬   \nTaiwan =  窒友梅根   \n\n\nThe Matrix Resurrections (Warner Brothers)  \nHong Kong / Macau =  22世紀殺人網絡 復活次元   \nTaiwan =  駭客任務：復活   \n\n\nI think maybe they should just do what Fox / Disney does and just do one titles for all Chinese-speaking territories:  \n\n\nAvatar The Way of Water  \nTraditional chinese (all) =  **阿凡達：水之道**   \n\n\nBlack Panther Wakanda Forever  \n黑豹2：瓦干達萬歲",
        "created_utc": 1673986537,
        "upvote_ratio": 1.0
    },
    {
        "title": "Improving 4 languages",
        "author": "Trickmaster98",
        "url": "https://www.reddit.com/r/languagelearning/comments/10em2y6/improving_4_languages/",
        "text": "Hello everyone,\n\nI am a speaker of two mother languages and another 2 that I learned. I can speak them fluently but there’s a vocabulary gap in almost all of them. I was wondering if there’s a way to learn about 15 random words a day and have them translated to all other languages, like an app, a site etc.\n\nThank you!",
        "created_utc": 1673986221,
        "upvote_ratio": 1.0
    },
    {
        "title": "How hard is it to pass German B2 level ?",
        "author": "PUPPADAAA",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ekjsq/how_hard_is_it_to_pass_german_b2_level/",
        "text": "I have recently found out about the vocational training visa in Germany, but it requires me to have B2 level certificate. The thing is I have zero knowledge about German, but I do have some basic knowledge of Dutch and Norwegian (A2).\n\nThe question is, will it be possible for me to pick up German and pass B2 within a year or it takes more time to be on that level? \n\nI would appreciate it if you could share your experience and the tips, thank you 😊",
        "created_utc": 1673982678,
        "upvote_ratio": 1.0
    },
    {
        "title": "What languages are about to become extinct by the end of the 21st century?",
        "author": "araiderofthelostark",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ejib7/what_languages_are_about_to_become_extinct_by_the/",
        "text": "I have read that a significant percentage (about 90%) of human languages spoken at the beginning of this century are projected to become extinct by the end of it. I have just read this on Wikipedia, but I have heard a similar claim before, including on Reddit, so I am not basing this question just on that.\n\nI wonder, does that mean Polish is threatened? Is it an endangered language? Do you think Polish will have become obsolete by the end of this century? Why?\n\nI am a native speaker of Polish, and I have been wondering about to what extent is it endangered.\n\nWhat about other languages? Which ones are in danger of dying out, what do you think?\n\nI apologize for my low English proficiency.",
        "created_utc": 1673980221,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you be interested in an other reading system like LingQ, LWT, VocabTracker? What kind of features would you like to see in it?",
        "author": "More_Commercial1979",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ejfsm/would_you_be_interested_in_an_other_reading/",
        "text": "[removed]",
        "created_utc": 1673980053,
        "upvote_ratio": 1.0
    },
    {
        "title": "What languages are about to become extinct by the end of the 21st century?",
        "author": "araiderofthelostark",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ejf5j/what_languages_are_about_to_become_extinct_by_the/",
        "text": "I have read that a significant percentage (about 90%) of human languages spoken at the beginning of this century are projected to become extinct by the end of it. I have just read this on Wikipedia, but I have heard a similar claim before, including on Reddit, so I am not basing this question just on that.\n\nI wonder, does that mean Polish is threatened? Is it an endangered language? Do you think Polish will have become obsolete by the end of this century? Why?\n\nI am a native speaker of Polish, and I have been wondering about to what extent is it endangered.\n\nWhat about other languages? Which ones are in danger of dying out, what do you think?\n\nI apologize for my low English proficiency.",
        "created_utc": 1673980012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Polish about to become extinct by the end of the 21st century",
        "author": "araiderofthelostark",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ej5qu/is_polish_about_to_become_extinct_by_the_end_of/",
        "text": "I have read that a significant percentage (about 90%) of human languages spoken at the beginning of this century are projected to become extinct by the end of this century. I have just read this on Wikipedia, but I have heard a similar claim before, including on Reddit, so I am not basing this question just on that.\n\nI wonder, does that mean Polish is threatened? Is it an endangered language? Do you think Polish will have become obsolete by the end of this century? Why?\n\nI am a native speaker of Polish, and I have been wondering about to what extent is it endangered.\n\nI apologize for my low English proficiency.",
        "created_utc": 1673979391,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is not being able to translate equal to lack of knowledge in a language?",
        "author": "STON3K0LDK1LL3R",
        "url": "https://www.reddit.com/r/languagelearning/comments/10eiut1/is_not_being_able_to_translate_equal_to_lack_of/",
        "text": "Hi all for reference I'm primarily learning Spanish, love reading it online and listening to it in music and stuff. I'm not going to pretend I'm even close to fluent but I'm good enough to at least get the jist of about maybe 50% of the things I read. If there's a word I commonly see but am not sure of I google it every time to reinforce what it's meant to mean. However for example on call of duty mw2 there are bits and pieces of spanish and my friends have been playing it and ask me to translate or in farcry 6 my friends would say \"what does this mean?\" \n\nNow most of the time I don't really know verbatim what it is but I could tell you at least a topic or what I think it means because I'm getting to a point where in context and from reading native speakers I get faint ideas of what things mean. For example \"órale\" my friend asks me what does that mean and I say I don't know it sounds like maybe slang but I'd think it means to hurry up or something based on the context of mw2 or even in a song I have on they'll ask to translate it and sometimes I like to practice translating songs but I'm not very good at it but I can tell you the rough idea of a song. \n\nWould it be fair to say that it's not the most incredibly useful to know another language of you can't necessarily translate it? I don't really know but I know translating is a separate skill that takes lots of practice on its own but I'd like to know your thoughts on it.",
        "created_utc": 1673978696,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for specific goal",
        "author": "Bigchooma",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ehqnp/advice_for_specific_goal/",
        "text": "[removed]",
        "created_utc": 1673976055,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does the Anki media sync take so much time?",
        "author": "Head-Piglet8536",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ehmvu/why_does_the_anki_media_sync_take_so_much_time/",
        "text": "I am syncing my phone with the computer and despite I have 5G with 200mbit download it seems to be a never ending progress. How can that be? The size isn’t bigger than 1GB…\n\nI just want to learn my language decks on my phone 😭",
        "created_utc": 1673975802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Solve Spanish doubts",
        "author": "AngelesMenaC",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ehl9o/solve_spanish_doubts/",
        "text": "Hey! Do you want to learn Spanish? If you are a beginner or intermediate learner, and want to ask questions to native speakers, it’s probably complicated to post each question online and just sometimes get an answer. Also, it’s not very easy to have no one to check your progress. So that’s why I wanted to create a what’sapp group, leaded by me (a native speaker) for you guys to join. Here we will:\n\n answer questions \nSchedule free video calls for that same purpose \nGive or advice material for working in specific areas\n\n[group link](https://chat.whatsapp.com/LMQ1g8XBSjLDRCN16kKMlh)",
        "created_utc": 1673975700,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Make New Year's Resolutions that Stick",
        "author": "Sprachprofi",
        "url": "https://www.reddit.com/r/languagelearning/comments/10eg1pn/how_to_make_new_years_resolutions_that_stick/",
        "text": "[removed]",
        "created_utc": 1673971937,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning German vs Hungarian from a Bulgarian native speaker point of view",
        "author": "tonysubliminalfan",
        "url": "https://www.reddit.com/r/languagelearning/comments/10efsvp/learning_german_vs_hungarian_from_a_bulgarian/",
        "text": "I've heard from many people learning Hungarian is near impossible and very hard since it's nearest relative is Finnish, and the two aren't even that related. I've found out that in going to Budapest this upcoming summer and want to try to learn some of the language before going. Any tips?\n\nOn the other hand I've taken an A1 language class in German and I find it really difficult (I got an A in the course). German words are actually harder for my brain as Hungarian ones rely more heavily on vowels (Despite SZ for S sound, it seems Hungarian has less consostant clusters). In German I struggle with genders the most but also, despite not knowing but 2 or 3 words in Hungarian, Hungarian is easier to read than German and even Polish. I think knowing some light Turkish from TV soaps helps as well in terms of the way words are put together in Hungarian.\n\nMaybe it's in my blood as it's very possible Proto-Bulgar probably had a similar grammar structure to Hungarian. And maybe it helps I dig the culture, I find Budapest one of the most beautiful capital in Europe and *the* most attractive in Central Europe.",
        "created_utc": 1673971339,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vocabulary classification",
        "author": "hn-mc",
        "url": "https://i.redd.it/haarpcjnimca1.png",
        "text": "",
        "created_utc": 1673970012,
        "upvote_ratio": 1.0
    },
    {
        "title": "What digital tools, devices or processes are the most helpful in your language learning journey, and why? (a language teacher's inquiry)",
        "author": "malykot",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ef7wy/what_digital_tools_devices_or_processes_are_the/",
        "text": "Hello!\n\nI’m a language teacher and I feel it’s due time for a proper renewal. I feel like I’ve ran the gamut with regard to my own practice, and a little digging in shows that there are more than a few things out there to try out with my classes.\n\nHowever, though I’m well aware experimentation is part of the fun, I’m ever the time-efficient person and I’d like to know what you, as language learners of all sizes and shapes, deem worthy of staple status. What has undergone the tedious sieving of your learning path. What unmade the steepness of your slope, and showed you the ropes. Stuff that legendary old toolboxes are made of.\n\nIn a world that spins ever faster, with an ever growing amount of means at our disposition, I’m looking for what made your learning experience greater, both from subjective and objective perspectives.\n\nI’m talking apps, add-ons, platforms, softwares or digital processes for that matter (i.e. asynchronous classes).\n\nIt can be either specific to one of the good old categories of language as we define it such as grammar, vocabulary and phonetics, or even a more combinative tool.\n\nI realize my question’s very wide, and that’s because I’m open for any angle on the question!\n\nDon’t be shy of mentioning any classic stuff that I may already know of if there are some holy cows. I may have missed out on something!\n\nOf course I’m also ready for any propositions off the beaten track, or things that are being tried at that. stage of your process, yet already deliver.",
        "created_utc": 1673969884,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your go-to book(s)?",
        "author": "Efficient_Horror4938",
        "url": "https://www.reddit.com/r/languagelearning/comments/10eezgp/whats_your_goto_books/",
        "text": "What are your favourite books to look for in your TL to help you build reading comprehension?\n\nI've seen Harry Potter, Wimpy Kid and Percy Jackson mentioned around the reddit as general recs, but what do you personally use, even if you don't automatically recommend it?\n\nMine are:\n\n* *Anne of Green Gables* by LM Montgomery  - even though it has flowery, old fashioned language, I know it and love it so well I don't care. This one skyrocketed my German grammar comprehension.\n* Anxious People (*Folk med ångest*) by Fredrik Backman - I happened to read this in English right before I needed to desperately study German. I liked it so much I wanted to read it again but couldn't justify the time out of German practice so I bought it in German instead. It's so simple and conversational I've also bought it in Latvian now...",
        "created_utc": 1673969295,
        "upvote_ratio": 1.0
    },
    {
        "title": "Arabic Lebanese and Egyptian resources?",
        "author": "_velvetthunderr",
        "url": "https://www.reddit.com/r/languagelearning/comments/10edwx3/arabic_lebanese_and_egyptian_resources/",
        "text": "Hi everyone!!\n\nI’m simply looking for top 250 words/phrases in the Lebanese Dialect, and the Egyptian Dialect. Not having much luck but surly there must be a resource like this out there!\n\nCan anyone recommend anything?",
        "created_utc": 1673966560,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free French Speaking Lessons",
        "author": "Mario_master99",
        "url": "https://www.reddit.com/r/languagelearning/comments/10edt2p/free_french_speaking_lessons/",
        "text": "Hi everyone, I need help using up some class credits on Lingoda. I get a rebate if I use up all my credits by actively attending classes, but I have an excessive amount of credits left to use. If you want access to my account, you can take as many classes as you'd like for the next 2 weeks (after which the credits will expire). You can take any level above A1.1 (basic understanding). Dm me if you're interested!",
        "created_utc": 1673966268,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I add anything else to my daily routine?",
        "author": "Minter_moon",
        "url": "https://www.reddit.com/r/languagelearning/comments/10edb4a/should_i_add_anything_else_to_my_daily_routine/",
        "text": " So currently I'm learning German. After doing some research, this is what I've been doing every day for a couple weeks now:\n\n One Pimsuler lesson a day \n\n Grammar lesson from a book I purchased (with CD included), I take notes and practice writing\n\n For more passive listening, I've been watching playthroughs of my favorite video games from German youtubers \n\n And I've been listening to a ton of music in German! Having a lot of fun with that and I started a notebook for translating some of these songs to gain random vocabulary etc \n\n I'm trying not to overwhelm myself and I feel like spreading all of these things out through the day instead of sitting down for a couple hours grinding is working for me. But I'm just wondering if anyone has any other random suggestions for more I should be including? Oh also, I do practice speaking with my 6 year old. So it seems like I'm covering all the basics but I hope I'm not missing anything detrimental.",
        "created_utc": 1673964954,
        "upvote_ratio": 1.0
    },
    {
        "title": "Extreme advice: seek embarrassing situations and smile",
        "author": "jamager",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ed4iq/extreme_advice_seek_embarrassing_situations_and/",
        "text": "This is a story that happened right now 10 years ago, when I was in Dublin to learn English.\n\n&amp;#x200B;\n\nI was with a friend queuing at a café, and my friend wanted to order a latte for he and his girlfriend. We had been in the queue for some good 20 minutes.\n\nWhen it was his turn to order, he realized that he didn't know how to pronounce *latte*. Being spelled similarly as *late*, he pronounced it as such (/leɪt/ instead of /lɑ.teɪ/). \n\nSo he ordered *2 latte* like /tu leɪt/, raising the hand and making an V sign with 2 fingers for visual aid.\n\nNot only his pronunciation really sounded like \"*too late*\" (which was plausible, after 20 minutes in the queue), but we also didn't know that in Ireland (and other Commonwealth countries) one must do the V sign with the palm facing outward, because otherwise it can be considered an insult.\n\n&amp;#x200B;\n\nSo the waitress readily interpreted the order as \"*too late now, f\\* off*\", which made for an extremely tense and uncomfortable minute, as the guard approached us with a very serious guard face. \n\nOnly the nervous smile of my friend, while pointing with the eyes to the menu behind the waitress, saved the situation.\n\n&amp;#x200B;\n\nNow, this happened to him and not to me for a very simple reason: I wanted a latte too, but because I didn't know how to pronounce it, I chose a tea instead. \n\n&amp;#x200B;\n\nI derive 3 lessons from this. \n\n&amp;#x200B;\n\n\\- First, even if at that point our English was quite miserable, we instantly became world experts in recognizing and pronouncing the word *latte*. My accent still leaves to be desired, but my god, do I nail *latte*... for some reason, everything that you learn in a highly emotional situation immediately sticks like nobody's business. \n\nEmotion is the single most effective memory hack in existence.\n\n&amp;#x200B;\n\n\\- Secondly, the waitress probably forgot all about it the day after, but I still remember it 10 years later.  In 99.99% of cases is only the one suffering it that makes a big deal of an embarrassing situation, and it is a such shame that the fear of making or saying something stupid stops us from learning more meaningfully.\n\nShould not be for my friend, I would still probably be ordering teas. \n\n&amp;#x200B;\n\n\\- The third lesson is the simplest: Smile. No matter what the situation, always smile.\n\n&amp;#x200B;\n\nHappy learning everyone, and don't be afraid of *lattes*!",
        "created_utc": 1673964471,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I’m around B1-B2. Not exactly sure but I would like practice with a native speaker. If there is anyone willing to spend a few min with me everyday just talking about a random topic through chat I would appreciate it very much. (English)",
        "author": "OkWash7979",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ecu2v/i_think_im_around_b1b2_not_exactly_sure_but_i/",
        "text": "",
        "created_utc": 1673963697,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best English Dictionary with word list function",
        "author": "Vid0fnir",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ebpwg/best_english_dictionary_with_word_list_function/",
        "text": "I wondered what the best English Dictionary is, which has a decent app and functionality. I am mainly looking for the features of saving and cataloging words. So far I have looked at the Oxford Advanced Learners dictionary and the one from Cambridge. I am willing to spend a bit of money if someone has a positive experience with a certain tool.\n\nThank you!",
        "created_utc": 1673960475,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me decide which language to learn!",
        "author": "Aspen_GMoney",
        "url": "https://www.reddit.com/r/languagelearning/comments/10eblh7/help_me_decide_which_language_to_learn/",
        "text": "I am about to start a quest to learn a new language. Right now, I am fluent in English and Spanish. I am applying to medical school in 1.5 years, and I want to add another language to my tool belt, not just for competitiveness but also for my personal development. Here are my options and thought processes: \n\n1. Mandarin. This is my first choice because I find the language beautiful and challenging, and it is incredible when non-Chinese people speak fluent Mandarin. I live in the Bay Area and hope to stay in this community for medical school and residency, and there is a more significant Asian population here. My partner and I talk about enrolling our kids (whenever we have them) into a dual language school where they teach Mandarin and English. This would be useful to have conversations with them as they grow up.\n2. French. My partner is Brazilian and fluent in Portuguese, French, English, and Spanish. He spent five years studying in France for his Ph.D., and we casually dream that one day we'll retire in France. I took a year of French in college, and I enjoyed it. Yet again, I find this language beautiful and would be proud to be a French speaker traveling in Europe.\n3. Brazilian Portuguese. Although they live in Brazil and we don't see them regularly, the only person I know I can speak Portuguese with is my partner. My partner's family only speaks Portuguese and no English. When we have kids, this might become a more significant issue since they'll probably be around, and I won't be able to communicate with them.\n4. German. I am half-German and half-Mexican. My name is Günter, and I don't speak German, lol. Imagine introducing yourself as Günter in Germany and don't speak any German. Not that I care, but it is a tad bit embarrassing. I have a German family, but not much. I could only speak German with some distant cousins, my dad and aunt.  \n\nI know this post is \"do what you want,\" but I am curious if anyone has some insight or advice to sway me in a particular direction. If you made it this far, thanks!",
        "created_utc": 1673960120,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got a serious question",
        "author": "Quinney27",
        "url": "https://www.reddit.com/r/languagelearning/comments/10eaqsv/i_got_a_serious_question/",
        "text": "About Lost \n\nLost: not knowing where you are\n\n???: not knowing where you’re going \n\nWhat word is ??? I really want to know to know",
        "created_utc": 1673957412,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to create Anki cards by your own?",
        "author": "Head-Piglet8536",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ea8yf/how_to_create_anki_cards_by_your_own/",
        "text": "I mean beautiful Anki cards with Audio data, pictures and so on. (For language learning)",
        "created_utc": 1673955773,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you go from B2 to C1?",
        "author": "JokeApprehensive1852",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e9o4e/how_do_you_go_from_b2_to_c1/",
        "text": "I currently have B2 level in a language but I don't know how to get to C1. \n\nI have been at the same level for years. I use it every day, I can understand everyday conversations perfectly, I can join in. I understand films, podcasts, so I don't feel that I can improve from that. However the C1 tests are very difficult and I don't speak the language at an academic level. \n\nI have to read a lot of scientific papers for university and I understand them but I wouldn't be able to present at a conference or write a research paper myself. \n\nI've never got this far with a language, so I'd love to hear if anyone has any experience or the same problems.",
        "created_utc": 1673953712,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does it take to sound like a native in a foreign language?",
        "author": "Organic_Radio8936",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e95fp/what_does_it_take_to_sound_like_a_native_in_a/",
        "text": "An When I mean Native,I mean the following 2 points:\n\n1)The ability to entertain conversations with native speakers about a variety of topics while leaving them with the impression that you are a native speaker of the language.\n\n\n2) The ability to pronounce a language in a way that replicates the pronunciation of native speakers.",
        "created_utc": 1673951813,
        "upvote_ratio": 1.0
    },
    {
        "title": "Minimum amount of study to keep a foreign language somewhat fresh and not declining?",
        "author": "AdZestyclose8267",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e8rx6/minimum_amount_of_study_to_keep_a_foreign/",
        "text": "I'm currently in South America and studying Spanish for 2-3 hours per day. I've also studied German to a B1+ level and will return to German-speaking Europe later this year. What's the minimum amount of time I should give to German per day to keep it from getting rusty? If anyone has some experience with this, please let me know what kind of things you did to maintain a B1-B2 language for 6-12 months while not actively using it.",
        "created_utc": 1673950431,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I teach my Cambodian friend the English alphabet?",
        "author": "leosmith66",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e8rpm/how_can_i_teach_my_cambodian_friend_the_english/",
        "text": "She does not read any language, but wants to learn English. I want to start her with the alphabet. Can you recommend a free program to help with this? She is an adult, and we both know this will be difficult. Prefer a resource that has audio.",
        "created_utc": 1673950407,
        "upvote_ratio": 1.0
    },
    {
        "title": "my experience with basque",
        "author": "brickxell",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e8dsl/my_experience_with_basque/",
        "text": "so i started studying basque a couple weeks ago and its actualy a lot easier then i  thought i seurlyesy    (sorry for spelling mistackes) the only thing that is a little confusing is suffixes",
        "created_utc": 1673948996,
        "upvote_ratio": 1.0
    },
    {
        "title": "American Sign Language Resources?",
        "author": "arrozcongandul",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e87c7/american_sign_language_resources/",
        "text": "Hey all, just wondering if any one has any experience learning ASL and if so, what are some resources (a dictionary you love would be nice!) you used to become fluent? Also, what was your experience learning like? I'm a hearing person with no deaf or CODA friends or family, so really coming at this from scratch. \n\nI've put a lot of work into improving my Spanish (heritage language) and Portuguese over the last few years and just feel like this is important and could be a really enriching experience to connect with a group of people in my own country who I otherwise don't have any direct connection to. Thanks in advance for any support",
        "created_utc": 1673948309,
        "upvote_ratio": 1.0
    },
    {
        "title": "When is it time to call it quits, or take a break?",
        "author": "Repulsive-Warthog667",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e840m/when_is_it_time_to_call_it_quits_or_take_a_break/",
        "text": "In my 3rd year of self taught learning of my target language.\n\nI live in the target language country. I study with a variety of techniques, listen to a hell of a lot of audio, write down words, etc.\n\nI practice everyday, and there while there is some noticeable improvement there's never enough to actually comprehend anything spoken. Nor can I say anything comprehensible (not for lack of practice).\n\nEven basic tasks with speech (ordering a coffee) are beyond me. The greatest reward I have is the embarrassment caused by me attempting to talk, and the native looking so confused.\n\nAny questions directed at me, no matter how slow, the words just do not go in my ear.\n\nHonestly pointing and grunting (or using English) is far more effective than any spoken attempts.\n\nOn the plus side, teachers seem to have the magical ability to understand me and I them, although this superpower evaporates in the real world.\n\nI have a decent reading comprehension, that is I can understand far more written than spoken.\n\nI recently did a audio test A2.1 listening test and I that was light years ahead of me. I switched down to A1 and that was still far beyond me. Although I was able to grasp at least the situation and grab some keys words from the beginning of the audio. If I have visual queues I can probably understand whats going on at the A1 level.\n\nI switched down again to A0-A1 level and can pretty much understand everything. I don't seem to be able progress beyond this level.\n\nWhilst I may able to eventually reach my target level of B1, at my current rate it will take 20-30 years. It does not seem adequate compensation for the effort.\n\nI have made the mistake in the past of being too stubborn and persisting with things I wasn't good off and it never paid off long term.\n\nI am considering now having one last effort, then taking a break, and then trying again. If I don't see A2 level progress, after that I might quit. It seems the reasonable thing to do.",
        "created_utc": 1673947946,
        "upvote_ratio": 1.0
    },
    {
        "title": "anyone know what language this is?",
        "author": "Inrisd",
        "url": "https://i.redd.it/i4o7yyc46mca1.jpg",
        "text": "",
        "created_utc": 1673947759,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any good timing apps?",
        "author": "SummerChild_",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e7xxc/any_good_timing_apps/",
        "text": "Hello yall. I finally developed some discipline to sit down every day for an hour and learn a language. I find it really helpful to have a timer and ability to see how many hours this year/month/week I have spent learning. I have tried a couple of softwares, but unless it's a paid version, they are really limited or have just super basic stuff. I do not need some fancy premium functions, but a simply user friendly app that can give me a time report of selected period. I would really appreciate if you could suggest anything.",
        "created_utc": 1673947306,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT is a game changer",
        "author": "willuminati91",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e7pz3/chatgpt_is_a_game_changer/",
        "text": "Screw Ikenna's new app and the Duolingo bird. Has anyone used chatGPT as a tool for language learning? I'm really impressed and I'm going to be using it a lot more.\n\nThings I have done so far:\n\nHad a conversation about a subject and asked it to correct my mistakes.\n\nExplain a sentence grammar and then make it simpler to A2 and then more advanced C1. Make the sentence more informal or formal.\n\nExplain grammar with examples.\n\nAsked for recommendations for books, movies etc for my language level.\n\nCreate a study plan.",
        "created_utc": 1673946510,
        "upvote_ratio": 1.0
    },
    {
        "title": "English meme",
        "author": "Haunting_Compote7955",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e77q6/english_meme/",
        "text": "Taking a dog named \"Shark\" to the beach was a terrible idea.",
        "created_utc": 1673944632,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get speaking skills at the pace of your train of thought?",
        "author": "CharzardKing",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e6x3y/how_to_get_speaking_skills_at_the_pace_of_your/",
        "text": "I learned Spanish in Monterrey, and I somehow let my speaking fall way behind my other skills. My long-term goal is to go beyond C-2 and have native-level fluency because I would like to start a family with my girlfriend, who is Mexican. I don’t care if I retain an accent, I just want the speed, vocabulary, and grammatical correctness of a native speaker. \n\nThe written skills are my strongest. I’ve finally gotten comfortable listening to her talk at full speed for several minutes, with all the slang and figures of speech. But I cannot get my vocabulary or grammar knowledge to come to the surface at the same pace as my train of thought when I’m speaking, it sometimes is so infuriating that I want to cry. I stumble over simple phrases that I could express in a more complex manner if I had the time to write it out. I’m supposed to meet her family this year and I have to improve before then so I don’t appear too shy. How do I fix this? Do I need to slow myself down and focus on speaking correctly rather than focusing on the ideas I’m trying to convey?",
        "created_utc": 1673943520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which is easier: chineze hanzi or japanese kanji",
        "author": "MysteriousWeeb2669",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e5qj8/which_is_easier_chineze_hanzi_or_japanese_kanji/",
        "text": "All I know that I have to learn more hanzi than kanji if I want to speak chinese but kanji are slightly harder to learn because they are not as simplified as hanzi and one kanji can have a lot of different pronounciations.\n\nWhat do you say?",
        "created_utc": 1673939189,
        "upvote_ratio": 1.0
    },
    {
        "title": "What exactly do people mean when they say to immerse yourself!?",
        "author": "ICRAPUNDERYOURDOOR",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e5nzf/what_exactly_do_people_mean_when_they_say_to/",
        "text": "Everytime I ask for advice in regards to learning a language, I always get greeted with the old fashioned \"Immerse yourself by watching TV/Read books!!!\"\n\nBut I never understood what exactly you're supposed to do during that. Do you just stare at for example, the TV and hope you learn some new words? Or are you supposed to translate every single word you don't know and repeat until you understand everything without guessing?\n\nNo one really explains this to me, so I'm asking here. Anything helps :)",
        "created_utc": 1673938939,
        "upvote_ratio": 1.0
    },
    {
        "title": "Language learning app for basics?",
        "author": "hvksh",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e5027/language_learning_app_for_basics/",
        "text": "I’m taking German in college but for some logistical reasons I’ll have to start at the secondary elementary course instead of the very first one, so I’m looking for the best app that I can use for 20-30 minutes a day for ~5 months just so I can be a little prepared with the basics. I have a bit of prior experience learning a (different) secondary language.",
        "created_utc": 1673936606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning how to read Thai?",
        "author": "BrothaManBen",
        "url": "/r/thai/comments/10e40p5/learning_how_to_read_thai/",
        "text": "",
        "created_utc": 1673933448,
        "upvote_ratio": 1.0
    },
    {
        "title": "if i speak 5 languages with my kids, would they have trouble communicating in all of them?",
        "author": "PixPizza123",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e30rk/if_i_speak_5_languages_with_my_kids_would_they/",
        "text": "if i had children and spoke 5 languages with them at home, how bad would it affect them? would they be able to talk just at like 7 years old? is it more bad than good for them?",
        "created_utc": 1673930388,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate Babbel LIVE - don't buy if you want to do language classes after your workday",
        "author": "sophiewithaf",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e30mo/i_hate_babbel_live_dont_buy_if_you_want_to_do/",
        "text": "I  work all day and I only have time in the evening, and there are no  Italian classes after 5 on most days. I have had the same problem in  French and from what I've seen, German. The customer service is unhelpful and says that they will add a  request. I have sent so many emails. There is also not many languages.  Other people in the western hemisphere have been complaining. I have  bought a 6-month subscription now I can't use it????? I am currently  wasting my money. It was so useful for learning in the past and has  gotten me closer to fluent than any other site in the past. I can't  afford Italki, either.\n\nDM if you're having the same problem and we'll plan to do something.  This can't continue",
        "created_utc": 1673930377,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question For Language Interpreters",
        "author": "wannabepolyglot2001",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e2ups/question_for_language_interpreters/",
        "text": "For those who are professional interpreters, do you always convey speech as if the person is speaking, using \"I/me/my\", or are there ever instances when you say \"she/he/they said...\"? From videos I've watched online most intrepreters use \"I/me/my\", but I wondered if this was an industry standard or a personal preference.",
        "created_utc": 1673929891,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm a bilingual person and planning to be trilingual, how is this can effect my life?",
        "author": "Cheva_De_Kurumi",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e2nsm/im_a_bilingual_person_and_planning_to_be/",
        "text": "So I'm a bilingual and planning to learn 3rd language (forced for moving out) I'm wondering how having 3rd language gonna effect my life? I sometimes forget terms in my first language but I remember them in my 2nd which it's confusing me sometimes, will this issue get worse if I learn 3rd language?",
        "created_utc": 1673929300,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone here attended Middlebury and if so, How did it go? What is your opinion on it?",
        "author": "NeverBefore800",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e1vnn/has_anyone_here_attended_middlebury_and_if_so_how/",
        "text": "",
        "created_utc": 1673927040,
        "upvote_ratio": 0.99
    },
    {
        "title": "How do you assess your language level for free (or low cost)?",
        "author": "pm_toss",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e1t8t/how_do_you_assess_your_language_level_for_free_or/",
        "text": "I tested for 3 of the languages I have learned at b2, b2 and a2. I want to set a goal to be at a higher level but I don't need these languages for my career so I don't really want to pay (I rather pay for lessons).",
        "created_utc": 1673926849,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mohammad Tariq Anees's answer to What is the Czech translation for 'You are welcome' or 'don't worry about it'? - Quora",
        "author": "Comfortable-Sir9630",
        "url": "https://www.quora.com/What-is-the-Czech-translation-for-You-are-welcome-or-dont-worry-about-it/answer/Mohammad-Tariq-Anees-1",
        "text": "",
        "created_utc": 1673925083,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else get annoyed by flirty language podcasting hosts?",
        "author": "jungle_capital",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e0eky/anyone_else_get_annoyed_by_flirty_language/",
        "text": "I've listened to one language learning podcast for awhile. It's good but the two hosts (one male and one female) have become increasingly flirty with each other and super cringe. I feel like the third wheel, when I'm just here to learn. They should just fvk and get it over with. Have to find a new podcast ugh.",
        "created_utc": 1673922873,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help improving my Oral english",
        "author": "Fairylishan",
        "url": "https://www.reddit.com/r/languagelearning/comments/10e0bws/i_need_help_improving_my_oral_english/",
        "text": "[removed]",
        "created_utc": 1673922670,
        "upvote_ratio": 1.0
    },
    {
        "title": "Posted in the correct subreddit",
        "author": "ZhangtheGreat",
        "url": "https://i.redd.it/ky09cicv1ica1.jpg",
        "text": "",
        "created_utc": 1673922372,
        "upvote_ratio": 1.0
    },
    {
        "title": "What languages are easier to learn after Celtic languages?",
        "author": "Master-of-Ceremony",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dzomk/what_languages_are_easier_to_learn_after_celtic/",
        "text": "At some point I'd like to learn Scottish Gaelic, being Scottish myself, and also because the words look cool as fuck. However I'm not sure dead set on it, and if it was at least somewhat related to other non-Celtic languages that would be nice because then I could use it as extra motivation to get two languages for the price of 1 (or probably 1.8 realistically but still). Language family trees don't make it clear, since Celtic languages are usually yeeted off to the side somewhere, so was wondering if anyone here had a better idea? I know it's not very related to most European languages, but does it by chance share a lot of structure with any thing?",
        "created_utc": 1673920922,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using Voice-to-Text to verify my pronunciation. Thoughts?",
        "author": "lindsaylbb",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dzm22/using_voicetotext_to_verify_my_pronunciation/",
        "text": "I often use voice-to-text in my target language, and if it picks up my words correctly, I understand that my pronunciation doesn’t have big issues. Because it understands me, my accent must be within TTS tolerance. It might not be like talking with a real person, but it’s always there with me. Is it a proper assessment? Is there any harm in doing so?",
        "created_utc": 1673920755,
        "upvote_ratio": 1.0
    },
    {
        "title": "For those that speak at least 3 languages, how do you handle with learning a new language?",
        "author": "Direct_Check_3366",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dzk2h/for_those_that_speak_at_least_3_languages_how_do/",
        "text": "In my case I currently speak 4 languages. All of them are spoken fluently and I really enjoy learning new languages.\nI have friends and family for speaking in each language.\n\nSometimes I feel I should not learn a new language because I feel that when I start a new language, my level in my other languages decreases.\nI have sometimes the feeling that I should work on my current languages and get better at them instead of learning a new one.\nSometimes I learn a new word and I check I know them in the other languages, and I’m like “wait, I’m not sure I know this word in x language lol”.\n\nOn the other hand, I think “I can speak it fluently so why not learn a new one? I really enjoy from it!”.\n\nHow do you handle this? Does this happen to you? Do you do something about it?",
        "created_utc": 1673920606,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you structure your flash card decks? Or, what kind of decks/flashcards to you find most useful?",
        "author": "equal_inequity",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dzju7/how_do_you_structure_your_flash_card_decks_or/",
        "text": "I am looking to start creating my own flash card decks (probably in Anki but I haven’t decided yet) and am not sure how best to go about it. If possible I would rather start how I mean to go on to prevent rework.\n\nI’m really interested in hear how others go about this, as well as the community’s views on what are the most useful kind of decks/flashcards.\n\nFor reference I am quite new to language learning, and am studying Spanish and Japanese.",
        "created_utc": 1673920588,
        "upvote_ratio": 1.0
    },
    {
        "title": "What percentage of vocabulary learned should be of verbs vs. nouns vs. adjectives?",
        "author": "Ryptr",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dzfi6/what_percentage_of_vocabulary_learned_should_be/",
        "text": "I hear all the time that verbs are the heart of a language, so I'm guessing it'll probably be the highest percentage of the three. Adjectives, maybe not so much? What should someone reasonably aim for for decent conversational fluency?\n\nMaybe something like 50% verbs, 35% nouns, 15% adjectives?",
        "created_utc": 1673920264,
        "upvote_ratio": 1.0
    },
    {
        "title": "How far will completing the whole Duolingo tree get you?",
        "author": "academicbird4",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dz50m/how_far_will_completing_the_whole_duolingo_tree/",
        "text": "E.g. what language level (A1, A2, B1, B2, etc.) would I be at if I completed the whole Duolingo tree?",
        "created_utc": 1673919491,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to become fluent in French",
        "author": "academicbird4",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dz2ci/i_want_to_become_fluent_in_french/",
        "text": "I know some French (basic grammar, pronunciation, and vocab). For example, I can conjugate ER, IR, and RE verbs and can conjugate present tense to past tense. My goal is to eventually become fluent in French, and I’m hoping to become fluent within the next couple of years. Where should I start with this? I don’t have the resources to pay for a teacher or travel to a predominantly French-speaking country/region, and I don’t know where to start. Does anyone have a daily practice routine/plan that they could share? Thank you!",
        "created_utc": 1673919296,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I sound native again?",
        "author": "Solid_Willow_4859",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dyvop/can_i_sound_native_again/",
        "text": "Just for some context I was born in America but my parents are immigrants from Ukraine/Russia, both Russian speakers. I grew up speaking Russian only but I eventually forgot how to speak after I started going to school and speaking English. Recently I’ve been trying to get myself to relearn how to speak just by interacting with Russians online and in real life as much as possible. But what I noticed is I don’t sound native anymore. My pronunciation is fine on a lot of words, but certain words I struggle with and I have a slight American accent. I’m not a language expert so I’m just curious: Is it possible to make myself sound native like my family or am I going to have that little accent as a scar after not speaking Russian for years.?",
        "created_utc": 1673918812,
        "upvote_ratio": 1.0
    },
    {
        "title": "I understood 😱",
        "author": "Raber_31",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dytaf/i_understood/",
        "text": "My girlfriend and I went to a trip we barely planned anything about. It was not really difficult to get to the place, still we paid a travel agency to show us around and get the best experience possible. When we were on our way back, in the bus, no one sat in the same seats we sat at the beginning, I sat where I could and took the last seat available. The couple next to me were speaking Italian and I understood.\n\nI'm so happy for the fact that I've been exposing myself to Italian for a couple of months and I was able to form sentences as if they were speaking with me. I didn't let them know fearing they would stop talking or use a different language so I wouldn't understand what they were speaking. So I kept my mouth shut and took advantage of the moment.\n\nIve been watching tv in Italian and that's it. I like getting familiar to how the language sounds like and then I start studying grammar or memorizing vocab, any tips would be appreciated...",
        "created_utc": 1673918631,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spanish speaking penpal?",
        "author": "StudyConsistent7993",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dy8my/spanish_speaking_penpal/",
        "text": "Bueno! \nI am hoping  to meet someone who is interested in also learning Spanish and able to have text conversations daily or at least multiple times a week for at least a month. If it filters into phone conversations that would be good too. \nI’m an  English speaker who is Spanish intermediate.\n\nPlease DM if you’re interested  😆",
        "created_utc": 1673917113,
        "upvote_ratio": 1.0
    },
    {
        "title": "should I learn Russian or French?",
        "author": "crusader_dalek",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dxlmr/should_i_learn_russian_or_french/",
        "text": "I'm a native arab and my English is better than most teachers that teach me, so to say, I got control over 2 languages, English is part of my daily life even more than my native language at this point, and I Want to learn a new language, so which of two is easier to learn",
        "created_utc": 1673915397,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Mondly worth the investment for learning Croatian?",
        "author": "Jakequaza__",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dxas8/is_mondly_worth_the_investment_for_learning/",
        "text": "I’ve been wanting to learn croatian and i’ve just stumbled on an ad which gives 96% off the lifetime subscription for the app and its one of the few apps that actually seems to offer this language and i’m just wondering if this app is worth £89.99 for a lifetime subscription (down from £2000). Or are there better apps for learning croatian? If its a lifetime one i would probably also use it for more languages since i do hope to one day learn more after croatian but i’m just not sure how effective the app is and if there are better ones.",
        "created_utc": 1673914626,
        "upvote_ratio": 1.0
    },
    {
        "title": "Typing or handwriting, who's the best?",
        "author": "Angel-Mysterious",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dv0ye/typing_or_handwriting_whos_the_best/",
        "text": "I wanna improve my writing English.\n\nBut I have a question, is handwriting better than typing? What do you guys thing about it?",
        "created_utc": 1673909175,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the right way to grade Anki card sucess?/How do you do it?",
        "author": "Master-of-Ceremony",
        "url": "https://www.reddit.com/r/languagelearning/comments/10durpf/whats_the_right_way_to_grade_anki_card_sucesshow/",
        "text": "I was wondering if anyone has tips (or especially if you know what research says) about the best way to do Anki card retention. For example, today I came across the word \"tratar\" (for translating to English from Spanish). I couldn't remember and gave it about 10 seconds thought and realised that it was the same as \"tratamiento\", and got the answer from that. Then I checked I was correct, and clicked 3 (Good). But this turned out be for review in 1 month, which I thought was make too long. The other options were 20 days or 1.4 months I think. So I'm wondering if people know what the right way to grade cards is for optimal spaced repetition?",
        "created_utc": 1673908581,
        "upvote_ratio": 1.0
    },
    {
        "title": "Repetition Without SRS",
        "author": "skibblez_n_zits",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dub39/repetition_without_srs/",
        "text": "I have been learning Chinese for a few years now with moderate success.  Along the way I've used several different techniques such as extensive listening and reading (à la Krashen), and also doing flashcards SRS style with Anki and Pleco.  I feel like each of these techniques has its own pros and cons, but I'm curious if anyone has used a similar technique like the one I'm about to describe that is sort of a mix of the two methods.\n\nSuppose you have some form on comprehensible input, this could be a movie, book or podcast, but let's go with a book for this example.  As for units to measure your progress, you could also use things like sentences, paragarphs, or chapters.  Let's use paragraphs for this example.  \n\nMy idea is that on day one you read paragraphs 1 through 5.  On day two, you read paragraphs 2 through 6.  On day 3 you read paragragraphs 3 through 7 etc.  Below is a table to help visual for what I am thinking. P(n) is the paragraph, and the X indicates what paragraphs you should read on that day.\n\n\n | P1 | P2 | P3 | P4 | P5 | P6 | P7 | P8 | P9 | P10\n---|----|----|----|----|----|----|----|----|----|----\nDay1 | X | X | X | X | X |  |  |  |  | \nDay2 |  | X |X  |X  |X  |X  |  |  |  | \nDay3 |  |  | X |X  |X  |X  |X  |  |  | \nDay4 |  |  |  |X  |X  |X  |X  |X  |  | \nDay5 |  |  |  |  |X  |X  |X  |X  |X  | \nDay6 |  |  |  |  |  |X  |X  |X  |X  |X \n\nHas anyone ever tried a technique like this, and if so, did it help you acquire your language any faster than extensive reading or SRS alone?  \n\nI feel like this could be a good way to get repetition into your routine without having to endure the tediousness and boredom of flashcards.  It may not be a \"perfect\" methord according to the Anki SRS algorithm.  It's also not perfect according to the extensive reading model either, as the input becomes less and less compelling with each subsequent read, but in the end I feel like something like this could have positive results, even though I haven't tried it yet.  What does reddit think?",
        "created_utc": 1673907547,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resources Of Sweden",
        "author": "juanchi_Stralis",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dtufj/resources_of_sweden/",
        "text": "\n\nHello everyone! I have in my goals to learn Swedish and move to Sweden in the future, what online books do you recommend? What television programs or series do you recommend to know the pronunciation? Thank you!!",
        "created_utc": 1673906564,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fascinating observations regarding the silent period in language learning (input vs output)",
        "author": "JohnnyFontanaHD",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dt37t/fascinating_observations_regarding_the_silent/",
        "text": "I would like to preface by saying that my personality is that of wanting to know the whys of how things work, not necessarily looking for resolve. Meaning, aside from language learning, I enjoy connecting dots from a psych/sociological aspect in understanding why we do what we do. I know that folks online tend to thrive on the ignorant in that we tend to want to answer questions, rather than flesh out ideas from original posters. Also, I know that I came off pretty passionate in my previous post, so this time it's less about me, and more about the culture of language learning itself. The reason that prompted me to write this post is due to my wild experience this weekend visiting Mersin, Turkey, after having traveled from Istanbul. \n\nAs I said, I love to connect dots and understand the deeper meanings of social dynamics. As such, I'm heavily in tune with various subcultures such as fitness, nutrition, music, politics, cars, astrology, personality traits, current events, etc... In that, I have found a striking correlation between many of these groups. What I have noticed is that the deeper you get into a particular area of interests, you pass a certain threshold by where commonality no longer exists between the newbies and veterans of these spaces. With language learning, there seems to be more discussion on fluency, rather than the real world struggles of functional language learners. What's kind of frightening is that you have people imposing their views on others based on \"scientific research\". To be more specific, I have found similarities between the silent period (language learning) fasting/keto (fitness/nutrition) and NOFAP (period of no masturbating within men's self-help groups). I have literally read tons of posts/responses on delaying speaking, people discussing not breaking their \"silent period fast\" for over a year, and relishing on several months of no output. \n\nI find this extremely interesting that we have debates on whether to speak or not when it comes to language learning. Perhaps living in America has corrupted my idea of language learning because as so many immigrants arrive, they often must attempt to speak for the most part. This is not coming from a place of judgement, but more so of fascination. It is if we are promoting home schooling for language learning, rather than realizing that some people must travel and attend work or schooling abroad. \n\nThis is simply a working theory, but it seems as if the active online community has been overrun by language learners without an explicit need to learn a language. Therefore, their mindset is different to that of those who have to use it as a means to function daily. I have even read others telling folks, who experience passive bilingualism, that the reason why they aren't able to speak is because \"they don't have enough input\"- despite the person just simply not having practiced output enough. What is even beyond fascinating, but downright insane, was a person telling another poster to not necessarily worry about output for a few years when learning a language. That advice alone can seriously cause someone to question how we even got to this point... However, I do believe that sometimes we need to get out of our own ways and accept that people have experiences vastly different to our own. The concept of \"I have never experienced this, therefore it doesn't exist\" is highly prevalent amongst the online community. \n\nThe question then becomes- who are the points of reference for the common functional language learner just trying to get by in their target country? We give advice on preventing bad habits and fossilization, but who exactly are we targeting? Do we advise those who migrate to Mexico and India to delay their output?  If we have all these folks wearing their CEFR patches on their arms, giving advice from the comfort of their native home, it then becomes hard to relate to those struggling while living in their target country. Perhaps, those who are in their target country aren't online, but rather busy immersing their way to output.  Not to offend anyone but to me, it almost feels as if we have entered the world of Whole-foods vs your local grocery store when it comes to language learning. It's as if it all stems from the need to be fluent, rather than functional in your use of a language. You have those who can afford the luxury of spending months on input, tutors, and paid online software, whereas others have to rely on broken language just to get by day to day. For those that state that they never learned a language while living in their TL country, only means that the motivation wasn't there. This was my idea behind my previous post, but I admit that I came off a bit gunny with some of my choice of words. Again, this is not a matter of \"do what feels right\", but more so of this being much of the content that new language learners are presented with. \n\nFor me having to move to Germany in a few months, all the research regarding language learning is basically all about Comprehensible Input and less on immersion and output. For example, the same author of short stories that I have been consuming simultaneously has videos on why immersion isn't a great language learning strategy for beginners. I may be projecting here, but perhaps he is catering to a certain demographic of folk who have the above stated time and luxury. So, the question again becomes who are the people that we are using as reference- especially for those who need to use foreign language as a means to function... Seriously, type in silent period and you will find how many people are cozied up with their books and discussing whether to speak now or wait a year or two. So, that right there is extremely fascinating and I wonder what creates that mindset, as well as how much digitization has affected the way language learners socially interact. I can't even count the number of times I have heard or read people say that they \"developed a better accent as a result of waiting to speak\"... How does one even come to that conclusion? I am telling you that I have come across some interesting points.\n\nTo close with my own story from this past weekend, I had the hardest time in Mersin. In Istanbul, one can get by without even having to know Turkish for the most part. I decided that since I will only be here for one year, I wanted to fully engage in French and German via listening/reading. I have made no effort to learn the basic Turkish vocabulary whatsoever. This weekend was surely eye-opening. Shopping at the mall was a struggle, traveling by taxi, and even getting into some of the busier restaurants was challenging. It's not so much the struggle, but more of not knowing even the basic words such as right/left, food items, excuse me, etc...  Again, this is not me traveling to my TL country for the experience. I actually live here and have an address; this is my home for 12-15 months or longer, depending on if I want to renew my contract. I simply hate not being able to express myself freely and have dialogue with people. I enjoy asking questions and figuring things out. I remember living in Latvia around 2002 and was able to get around the city with only a few months of learning words/sentences. Had I introduced CI via reading and listening, I probably would have been having conversations after 13 months. What worked was picking up on vocabulary and using them daily. However, since I haven't lived outside the US since 2004, I haven't had to revisit the process of learning a language. To my wife's surprise, I still remember sentences, times, and numbers even after 20 years of leaving that country and never using Latvian. I suppose I have the learning gene as many of the diplomats in my family do.\n\nNonetheless, there was an incident this weekend in Mersin by where my party was greeted upon entering into a particular establishment, but when it was apparent that we didn't speak Turkish, it suddenly became \"reservation only\". Throughout the interaction, it was told to us that \"when we go to America, we have to speak English. When you are in Turkey, you have to speak Turkish\". I am not going to lie to you... That really hit me and I dwelled on that for a moment because for so many years, I have been hearing something similar while living in Miami, Florida towards the Cubans. \n\nI had a conversation with one particular restaurant owner who is originally from Belgium, but of Turkish parents and speaks English, Turkish, Russian, French, Flemish, and German.  We discussed how he learned English and my process of learning German. He told me that I have to speak. Yes, reading and listening is good, but I have to make mistakes and speak. He mentioned that during his days as a salesman in Bodrum, he had to learn the profiles of the customers in order to develop rapport for more sales. This was how he learned French, Russian and English as it was a matter of survival and repeating the same sentences over and over. Eventually he was having full conversations by simply listening to native speakers and repeating what they said. \n\nSo, this is not a criticism towards those who rather bathe in their silent period. I am not attacking anyone, so please do not take it as though I am trying to undermine anyone and I am not looking for a fight. This is simply a conversation of what I have been observing. I am still trying to find what will work for me, but what I do know is that I must acquire the basic German vocabulary for the next few months. I will then get out there with real people, take a few in-person courses, and interact with real folks when I arrive in Germany in June. As for French, I will continue reading/listening, and begin engaging with more French family members. I will of course use reading and listening to fine tune, but I can't afford the luxury of not \"breaking my silent period fast\". I have to literally go out and eat 6 meals a day or else I will be left starving when I visit my family in France come July, lol...\n\nFinally, if you have no interest in reading this lengthy post, taking the time to comment that you have no intention on reading this entire post says something about you... Just move on.",
        "created_utc": 1673905107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips on first time Japanese",
        "author": "Neon-Reddit",
        "url": "https://www.reddit.com/r/languagelearning/comments/10drb8w/tips_on_first_time_japanese/",
        "text": "Hello! I'm a new Japanese learner, I would like to know some tips from you all on how to be successful in basic speaking! Anything helps :)",
        "created_utc": 1673902160,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the most supportive thing someone has done for you during your language learning journey?",
        "author": "SandsOfTime8088",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dqu5q/whats_the_most_supportive_thing_someone_has_done/",
        "text": "Maybe you have a patient co-worker who is willing to have conversations with you, a family member that gifted you a learning tool you couldn't afford, or perhaps a loved one just made you a dish that's culturally linked to your TL. What are some heartwarming things people have done to help support your language learning journey?",
        "created_utc": 1673901360,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it good to talk to your children from an early age in a non-native language if you haven't fully mastered it?",
        "author": "armeliens",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dqbrr/is_it_good_to_talk_to_your_children_from_an_early/",
        "text": "For example what if I had children and I wanted to teach them English, which is not my first language (mine is Italian) and which I haven't fully mastered (I'm a B2)?",
        "created_utc": 1673900506,
        "upvote_ratio": 1.0
    },
    {
        "title": "hebrew in exchange for another language",
        "author": "NomDeGuerrePmeDeTerr",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dpkli/hebrew_in_exchange_for_another_language/",
        "text": "Would anyone be interested in doing a regular zoom/skype class, I need to study hebrew. \n\nCan offer a language exchange with \nEnglish \nItalian \nFrench \nGerman. \n\nIdeally once a week or so.",
        "created_utc": 1673898804,
        "upvote_ratio": 1.0
    },
    {
        "title": "learning french for 2 weeks",
        "author": "Pgogos1",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dpaps/learning_french_for_2_weeks/",
        "text": "i have been learning french for 2 weeks now and I can understand 60% of written french, I can't understand spoken french or speak it. Is this good progress for 2 weeks or should i be able to know more",
        "created_utc": 1673898161,
        "upvote_ratio": 1.0
    },
    {
        "title": "12 Book Challenge Jan Check-in",
        "author": "Vonvanz",
        "url": "https://www.reddit.com/r/languagelearning/comments/10donvs/12_book_challenge_jan_checkin/",
        "text": "Hello everybody! I hope the year has been treating you well so far. This is the middle of the month progress to see how far everyone is coming along. You should be about halfway done your first book so congratulations!! Please answer a few prompts below:\n\n1) How many new words/ sentence structures have you come across? What’s one that sticks out to you the most?\n\n2) Do you believe you are on track to complete your goal in time? \n\n3) Can you give us a brief summary of your book so far? (Reply in TL)\n\nDon’t quit everyone! You’re almost there :D",
        "created_utc": 1673896697,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for mandarin learning?",
        "author": "SriveraRdz86",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dohbv/tips_for_mandarin_learning/",
        "text": "I'm about to start a Chinese mandarin course, any recommendations you could share? up until now I've been learning romance languages and I am told that mandarin is a whole new world and I have no idea what to expect.",
        "created_utc": 1673896281,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I find online teachers?",
        "author": "SageEel",
        "url": "https://www.reddit.com/r/languagelearning/comments/10do4if/how_can_i_find_online_teachers/",
        "text": "At my school, I'm taking lessons for French and Spanish; however, they are the only two languages available, there. I'm also learning Japanese, Portuguese and Indonesian, yet (obviously) progress is faster with an actual (online) teacher. Any ideas?\n\nFeel free to also leave examples that don't include my target languages, so that other people who come across this post might benefit.",
        "created_utc": 1673895502,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is one common deck for everything a good idea?",
        "author": "uanitasuanitatum",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dnlaw/is_one_common_deck_for_everything_a_good_idea/",
        "text": "Hello folks. This is my first post, I think. Glad to be here. I have a small-ish deck where I add everything, three languages so far plus general interesting facts or information. I make sure to tag notes in case I want to change things up later, but for now, I haven't really noticed any major inconveniences.\n\nMy note type is basic and reverse, a type I'm not completely sold on, but it's what it is for now. Recognition is no problem, obviously, and even the reverse, when asked to produce target language, I know which language I'm supposed to supply out of the three.\n\nWhile this may be manageable with a relatively small deck, maybe it would be wiser to have separate decks, but I like having everything in one place. \n\nThoughts?\n\nThank you.",
        "created_utc": 1673894330,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anybody else study in secret?",
        "author": "bre5634",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dn81d/does_anybody_else_study_in_secret/",
        "text": "As in you only study at weird hours of the day, everything is digital (no paper trails), etc. All for the purpose that the people around you wouldn’t support it/make you stop/tear you down. How do you go about it? How do you feel?",
        "created_utc": 1673893577,
        "upvote_ratio": 1.0
    },
    {
        "title": "Practice",
        "author": "Alone-48",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dn1rw/practice/",
        "text": "Someone wanna chat with me on English I wanna improve muy skills if I can",
        "created_utc": 1673893242,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your favorite part of learning a new language?",
        "author": "FietserInDeVS",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dmf6y/whats_your_favorite_part_of_learning_a_new/",
        "text": "My favorite part is how my personality changes. I become a more extroverted person when speaking my target language and have an easier time making people laugh and smile.",
        "created_utc": 1673892157,
        "upvote_ratio": 1.0
    },
    {
        "title": "do you know what this means?",
        "author": "Rexxar433",
        "url": "https://i.redd.it/j2ih4nsr1gca1.jpg",
        "text": "",
        "created_utc": 1673891700,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you can't spend 3 months in latin america for your immersion, you might want to check out these 10 cities!",
        "author": "justwannalook12",
        "url": "https://i.redd.it/2ipskye2zfca1.png",
        "text": "",
        "created_utc": 1673890752,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can understand my language but can barely speak it.",
        "author": "dzcn",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dleqv/i_can_understand_my_language_but_can_barely_speak/",
        "text": "Bit of context: I was born &amp; raised in the UK, but my parents &amp; siblings were all born in India in a small state off the west coast called Goa. So I grew up with only my family speaking to me \"Konkani\" (our native language) and I only ever talked to other people in English. My siblings both speak fluent English with British accents, and my dad rarely speaks to me in Konkani. It's mostly only my mum that speaks to me in Konkani. I understand about 90% of the language, and I understand the language through context but don't know a lot of literal translation, which is where I feel like my problem is. Whenever I try and speak the language I often try and translate the words from English to Konkani because I'm not sure how else to formulate sentences without knowing the meaning of words. I can have simple conversational interactions, for example if I'm at a shop or if I'm greeting someone, but I can't have deep conversations or make jokes as I would in English. It's weird because if I hear a word, I'll know what it means, but if I'm speaking and trying to convey something I'll often forget the word. It's annoying because I also learnt Spanish at school from the ages of 11 to 16 and I literally speak that better than my native language. Any tips on how I can improve on my speaking skills? Its hard to learn with writing because we use the devanagari script, and because its use is limited, there isn't much content online to learn from. I feel like I could easily nail the language in 3-4 months if I had something to learn from because my pronounciation on words is pretty good. The only sort of \"education\" I think I could learn from is by watching movies in our native language from CDs I have at home.",
        "created_utc": 1673890654,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a French Language Learning site",
        "author": "willyhlobler",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dlaf5/looking_for_a_french_language_learning_site/",
        "text": "Is there a site to learn French like spanishdict.com for Spanish? It was very useful for learning Spanish and now I'm learning French, but I'm struggling with French pronunciation however.",
        "created_utc": 1673890480,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to start learning Ukrainian, how do I learn the Alphabet first?",
        "author": "Ukrainedefender101",
        "url": "https://www.reddit.com/r/languagelearning/comments/10dkpii/i_want_to_start_learning_ukrainian_how_do_i_learn/",
        "text": "",
        "created_utc": 1673889629,
        "upvote_ratio": 1.0
    }
]