[
    {
        "title": "Remembering words from novels",
        "author": "Jcal_",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuw2gg/remembering_words_from_novels/",
        "text": "Hello,\n\nI'm reading through a novel in Japanese aimed at young adults at the moment, it's maybe 30% unknown words but depends a lot on what's going on in the book. I'm reading it with LingQ so word meanings are on the side whenever I need to check them and I'm putting new words on flashcards just to go through them and try and keep them in my memory a bit, but not doing the flash cards super seriously.\n\nMy question is, how am I meant to remember these words? Maybe it's the quantity but most of them are words that I see once and they don't come up again, like low use descriptive words that I'll never use in conversation. Arguably I don't need to remember them in that case but a friend told me it's pretty easy to read for any adult so I feel like I should be trying to remember them. Although I'm not studying the words super seriously I feel like is forget them in a few days if I did anyway because I'd never use them.\n\nIs this a quantity thing (too many unknown words) or is there actually not much point learning them? I kinda wanna just read the book and forget about words tbh but at the same time I want to learn more words too, but idk when I'm even gonna use most of these. It just feels like from here on out I'm mostly looking at a huge mountain of low use words that are never gonna stick. 😕",
        "created_utc": 1671966105,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which part of Chinese is really difficult for a CSL learner?",
        "author": "MasterShifuONYT",
        "url": "/user/MasterShifuONYT/comments/zuugwz/is_chinese_really_difficult_for_a_csl/",
        "text": "",
        "created_utc": 1671961550,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any handwriting tips? Trying to learn to write more fluidly in hangul.",
        "author": "vrilliance",
        "url": "https://i.redd.it/v500g6oj328a1.jpg",
        "text": "",
        "created_utc": 1671961364,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can’t decide which language to learn",
        "author": "Funny-Grocery8459",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuuziq/cant_decide_which_language_to_learn/",
        "text": "WARNING: Long post, and I apologize for the messy post, I posted this through my phone.\n\n\nI live around the NYC metropolitan area, and the vast  amount of ethnic enclaves that are nearby caused me to develop a passion for learning foreign languages. However, after 6 years of dabbing though different languages, I can only speak English and Spanish. I really want to choose ONLY ONE  language to learn, and stick to it. Here are a list of languages I’ve considered learning (and dabbled). There’s no specific order to the list.\n\n\nGerman\n- Pros\n    - Considered temporary working in Germany (tech job)\n    - German ancestry (from great grandparent)\n    - Love listening to Rammstein, Blümchen, and other German folk music\n\n- Cons\n    - Huge dialect difference between regions \n    - Majority of Germans speak English\n\n\n\nYiddish\n- Pros\n    - Live near a Hasidic Jewish community\n    - Interested in learning more about Hasidic Jew’s culture, and interact with them.\n\n- Cons\n    - Not beneficial in the long term\n    - Hasidic Jews don’t really interact with people outside of their religion \n    - I tried learning it, but I was quickly unmotivated. I only managed to learn the alphabet.\n\n\n\nFinnish\n- Pros\n    - Love listening to Finnish music\n    - Very unique language (only major language similar to Finnish is Estonian)\n    - Love the way how it sounds\n    - Logical grammar\n\n- Cons\n    - Very little use of the language\n    - Written vs spoken language differences are huge\n    - Since the amount of speakers is low (~5 million), finding someone to practice with is difficult.\n\n\n\nGreek\n- Pros\n    - Greece is on my list of top 5 countries to travel\n    - Amazing Greek mythology, philosophy, other literature \n    - Read the Old Testament (I heard that Koine Greek is similar to Modern Greek)\n    - Sounds like Spanish when spoken, but isn’t mutually intelligible at all.\n    - Love the Greek script\n    - Difficult grammar. This may seem like a unusual pro, but I really want to challenge myself.\n\n- Cons\n    - Not a very useful language in terms of number of speakers \n\n\n\nTurkish\n- Pros\n    - Watch Turkish dramas \n- Cons\n    - Lack of motivation \n    - Not very useful for me \n\n\n\nHebrew\n- Pros\n    - Read the Old Testament\n    - Considering temporarily living in Israel (Tech job)\n    - Love the Hebrew script\n    - Hasidic Jews may or may not speak Hebrew (live near a Hasidic Jew community).\n\n- Cons\n    - Tried dabbling that language, but also only managed to learn the alphabet \n    - Reading is difficult since the vowels aren’t displayed in words.\n    - Majority of Israelites speak English\n\n\n\nChinese\n- Pros\n    - China is on my list of top 5 countries to travel\n    - A little more than 1 billion speakers\n    - Learning Chinese would look amazing on my resume\n    - Fascinated with Chinese characters\n    - Logical grammar \n\n- Cons\n    - Struggle mastering the tones \n    - No interest living in China, Singapore, or Taiwan. \n\n\n\nKorean\n- Pros\n    - Watch Korean movies (favorite movie is Train to Busan)\n    - Listen to EXO\n    - Nearby Koreatown\n    - Love the Korean script \n    - Difficult grammar. Again, this may seem like a unusual pro, but I really want to challenge myself.\n\n- Cons\n    - Besides EXO, I really don’t listen to K-Pop\n    - I’m only into Korean movies, not Korean drama\n    - No interest living in South Korea. \n\n\n\nSwahili\n- Pros\n    - Spend at least 3 months traveling to East Africa\n    - Tone-less African language \n\n- Cons\n    - Not really useful to me other than travel\n    - Difficult to find someone to practice with, and hard to find good online resources \n\n\n\nZulu\n- Pros\n    - Clicks\n\n- Cons\n    - I only considered learning the language only because of the clicks\n    - Struggle with tones and telling where the long vowels are\n    - No passion for South African culture\n    - Not useful to me at all\n    - Difficult to find someone to practice with, and hard to find good online resources",
        "created_utc": 1671961301,
        "upvote_ratio": 0.99
    },
    {
        "title": "word order comparison between turkish-japanese and turkish-english shown with the help of colour codes.",
        "author": "Informal_Body1160",
        "url": "https://i.redd.it/a1azn9zj208a1.png",
        "text": "",
        "created_utc": 1671954843,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you learn the meaning of words accurately?",
        "author": "SingleBeach7986",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuskob/how_do_you_learn_the_meaning_of_words_accurately/",
        "text": "I only speak English, so sorry if this is a stupid question. I assume languages develop independently of one another (that is to say, there is no single source of truth). So while for most nouns it's probably going to be pretty accurate, the English version for more complex/vague words is going to be harder to interpret the exact meaning. If a word directly translates from Chinese to English as \"fortune\", maybe the meaning in Chinese is slightly different from what English speakers think when we think \"fortune\".\n\nSo basically I'd like to know how to learn a language without that discrepancy (or if direct translations are almost always accurate enough to account for this, or if it's something I should be able to just pick up on somehow the more I learn).\n\nThe more I type the more I realize how ridiculous I sound since people learn English in different ways and words don't have the exact same meaning to all native speakers, but I'd still like to read any thoughts about this topic from people who actually have experience with learning languages.",
        "created_utc": 1671950616,
        "upvote_ratio": 1.0
    },
    {
        "title": "What language should I learn?",
        "author": "DJCHICKENBOAH",
        "url": "https://www.reddit.com/r/languagelearning/comments/zurvnx/what_language_should_i_learn/",
        "text": "",
        "created_utc": 1671947768,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is drops a legit learning resource? I would just be rather safe than sorry.",
        "author": "InternationalBath742",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuqrkb/is_drops_a_legit_learning_resource_i_would_just/",
        "text": "I am looking for more resources for my spanish and japanese and just want to be sure it won't steal my info or anything.",
        "created_utc": 1671943402,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can reading eventually help listening?",
        "author": "Warrior-Mentality",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuqfa6/can_reading_eventually_help_listening/",
        "text": "I'm curious about your thoughts on learning by reading first then catching up your listening later. Do you think this is a viable option? I've been trying listening predominantly but sometimes I feel like if I do things this way it'll speed up the process, lol.",
        "created_utc": 1671942078,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can reading eventually help listening?",
        "author": "Warrior-Mentality",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuqe56/can_reading_eventually_help_listening/",
        "text": "I'm curious about your thoughts on learning by reading first then catching up your listening later. Do you think this is a viable option? I've been trying listening predominantly but sometimes I feel like if I do things this way it'll speed up the process, lol.",
        "created_utc": 1671941960,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can reading eventually help listening?",
        "author": "Warrior-Mentality",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuqe4n/can_reading_eventually_help_listening/",
        "text": "I'm curious about your thoughts on learning by reading first then catching up your listening later. Do you think this is a viable option? I've been trying listening predominantly but sometimes I feel like if I do things this way it'll speed up the process, lol.",
        "created_utc": 1671941959,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can reading eventually help listening?",
        "author": "Warrior-Mentality",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuqdbd/can_reading_eventually_help_listening/",
        "text": "I'm curious about your thoughts on learning by reading first then catching up your listening later. Do you think this is a viable option? I've been trying listening predominantly but sometimes I feel like if I do things this way it'll speed up the process, lol.",
        "created_utc": 1671941875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can reading eventually help listening?",
        "author": "Warrior-Mentality",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuqdb1/can_reading_eventually_help_listening/",
        "text": "I'm curious about your thoughts on learning by reading first then catching up your listening later. Do you think this is a viable option? I've been trying listening predominantly but sometimes I feel like if I do things this way it'll speed up the process, lol.",
        "created_utc": 1671941873,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can reading eventually help listening?",
        "author": "Warrior-Mentality",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuqafb/can_reading_eventually_help_listening/",
        "text": "I'm curious about your thoughts on learning by reading first then catching up your listening later. Do you think this is a viable option? I've been trying listening predominantly but sometimes I feel like if I do things this way it'll speed up the process, lol.",
        "created_utc": 1671941561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help talking or finding new topics to talk about.",
        "author": "OhhEaze98",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuq6pu/need_help_talking_or_finding_new_topics_to_talk/",
        "text": "Hello everyone. As the title suggests I’ve basically ran out of topics to talk about with people on this language learning application I’m using. Things like where I work, what am I studying or basically anything that has to do with my daily life and activities I’ve talked about. My issue here then is that I’ve already memeorized a lot of these answers. I’ve even made up new stories and memorized those stories as well. So my question here is where can I find topics or how can I talk about new topics to talk about, that way I can feel more comfortable and expand my vocabulary as well.",
        "created_utc": 1671941161,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can reading eventually help listening?",
        "author": "Warrior-Mentality",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuq5hk/can_reading_eventually_help_listening/",
        "text": "I'm curious about your thoughts on learning by reading first then catching up your listening later. Do you think this is a viable option? I've been trying listening predominantly but sometimes I feel like if I do things this way it'll speed up the process, lol.",
        "created_utc": 1671941032,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can reading eventually help listening?",
        "author": "Warrior-Mentality",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuq3no/can_reading_eventually_help_listening/",
        "text": "I'm curious about your thoughts on learning by reading first then catching up your listening later. Do you think this is a viable option? I've been trying listening predominantly but sometimes I feel like if I do things this way it'll speed up the process, lol.",
        "created_utc": 1671940845,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much does learning an ancient language help in understanding the related languages?",
        "author": "TennonHorse",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuq29t/how_much_does_learning_an_ancient_language_help/",
        "text": "Lets say I learnt Sanskrit to a very decent level, then how much does it help in understanding other related ancient IE languages like Hittite, Ancient Greek, Latin in written form? How about modern IE languages in spoken form? What if I learnt an additional ancient language, say, Ancient Greek, how much IE content will I understand?",
        "created_utc": 1671940718,
        "upvote_ratio": 1.0
    },
    {
        "title": "Social media communities for language learning",
        "author": "kitsked",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuo0ee/social_media_communities_for_language_learning/",
        "text": "I'm looking for a platform that can offer some motivation and way to share streaks, achievements, maybe thoughts discussion etc with other language learners. I'm thinking similar to what Strava does for cycling etc. I like the social media and light competitive aspects of Duolingo etc but would like a platform that is not connected to a specific app because language learning involves more than one platform. Any suggestions?",
        "created_utc": 1671932987,
        "upvote_ratio": 1.0
    },
    {
        "title": "i am starting to dread the studying despite liking the language, how do i deal with this?",
        "author": "UnknownWisp",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuo00k/i_am_starting_to_dread_the_studying_despite/",
        "text": "i am studying german and while most say it's a hard language (it is for most) i simply find it easy to understand, just need to put in the effort for it and use repetition system for things that one simply has to memorize (looking at you partizip 2)\n\nbut i am really starting to hate the studying, not the language, not the class, the studying itself.\n\nat first i loved it, it was fun, i was understanding ezpz things are good. but as i went in, i started to hate it and i can't figure out why so here's what i do.\n\nwe use menschen, the teacher teaches us grammar, communication, some listening and that's it. so what i do is, i see what i have in my notebook, give it a read to understand everything and remember it (takes about 15 to 30 mins) and then i jump to the main course book and do on my own what the teacher didn't do which could take about an hour and then finally the workbook which takes about 1 to 2 hours depending on how much i understand.\n\nthis is dreadful. once i am done i simply do not have time to memorize words and their articles so i just make do with what just sticks in my brain (surprisingly more than i thought would do, i have a horrible memory)\n\ni take two classes a week but the thing is, at first i used to study between each day then i fell to only one day and now sometimes i don't even study except before the class with a few hours ( i know how bad this is).\n\nthe reason for that is that i physically DREAD the studying. i DREAD opening the books,  i literally feel the physical pain. i am top of my class, i enjoy the language and i truly enjoy all of this AND YET i feel like i hate it everytime i open the books now unlike before when i loved doing it. \n\nhow do i deal with this? is this mismanagement of studying or simply overburning? i have never been an academically smart guy so whatever may seem obvious to some may be oblivious to me so any tips are appreciated!\n\nextra information if it matters:\n\nmy main language is arabic, my course days are sunday and Wednesday.\n\nand it does feel like it would be nice to have a class or two be skipped so i can rest my head and catch up to things i missed.",
        "created_utc": 1671932948,
        "upvote_ratio": 1.0
    },
    {
        "title": "Receptive bilingualism - relearning how to speak with fluency",
        "author": "guavagirls",
        "url": "https://www.reddit.com/r/languagelearning/comments/zume1r/receptive_bilingualism_relearning_how_to_speak/",
        "text": "I am a receptive bilingual, so I can fully understand when people are talking to me in Afaan Oromo without having to translate it to English in my head, but it is so difficult to form sentences except for the few that the I use on a regular basis. Oromo was the only language I spoke until primary school, where I learned English. I have an intuitive understanding of what sounds 'wrong' if there is something missing in grammar/sentence structure. I can read it if I focus and take a lot of time. I feel like I am stuck at a kid level of language learning. \n\nThere are two questions I wanted to ask to everyone on this subreddit:\n\n1. Does anyone have any stories on how long it took to go from receptive bilingualism to full fluency in first language? How long did it take and what processes did you use?\n2. Oromo seems to have less resources for mid level learners (the stuff I find is like basic alphabet and vocab I already know). Anyone have resources for Oromo language learning?",
        "created_utc": 1671927261,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to learn some language but I'm disabled and bad memory, what to do?",
        "author": "Resident-Street-4847",
        "url": "https://www.reddit.com/r/languagelearning/comments/zult3w/i_want_to_learn_some_language_but_im_disabled_and/",
        "text": "i'm mentally disabled and bad memory ...i'm not good imitating accents and not good memorizing stuff and difficult rules. If i study asian language it really difficult learning the writing.\n\ni wanted to try korean or japanese but too difficult, too many letters and for the korean too difficult sounds i can't say them. And there's no helps anywhere in real life or online. Nobody wants to help disabled person. First it's almost impossible make online foreign friends, but it's even more impossible fine foreign friend when you disabled mental...the foreigners don't want to meet people like us.  I'm from america",
        "created_utc": 1671925352,
        "upvote_ratio": 1.0
    },
    {
        "title": "After years of learning today I used for the first time my target language for something useful in the place where I live",
        "author": "imberttt",
        "url": "https://www.reddit.com/r/languagelearning/comments/zulokj/after_years_of_learning_today_i_used_for_the/",
        "text": "I live in Argentina since the day I was born, I learned English in school and spent the last 5 years of my life surfing reddit and consuming English content, I can say right now that I can speak this language and it's a big part of my life.\n\nthe argentinian city where I live is not by any means a hot touristic spot, I don't think I have recognized an international tourist in my city ever, in my entire 22 years-long life.\n\nI have been working for a local convenience store for a couple weeks and today _the_ day just arrived.\n\nan older women got in, she had a thick accent but nonetheless was able to communicate clearly, the problem came when she told us she wanted some tape, my coworker asked her if she wanted one of those wider tapes more commonly used for boxes, or one of the narrower ones, while she did know the spanish word for tape, she had difficulties with recognizing the spanish words for wide and narrow(ancho and angosto respectively).\n\nI translated those words for her and she told me in english which one she wanted, me knowing I may not have the luck to see another English speaker in my city ever again, I had a little chat with her, cool woman, 10/10 interaction.\n\nI don't know why but I was so happy to make use of my language skills in a real setting. even if I already have weekly zoom calls with an English speaker.",
        "created_utc": 1671924937,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think it's ill-advised to be taking things slow when learning a language?",
        "author": "araiderofthelostark",
        "url": "https://www.reddit.com/r/languagelearning/comments/zulcx5/do_you_think_its_illadvised_to_be_taking_things/",
        "text": "[removed]",
        "created_utc": 1671923896,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Fastest Way To Learn A New Language",
        "author": "RazWaters",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuji2b/the_fastest_way_to_learn_a_new_language/",
        "text": "[removed]",
        "created_utc": 1671918126,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you could magically apply ONE massive change to your target language, what would you do?",
        "author": "JakeYashen",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuhg4e/if_you_could_magically_apply_one_massive_change/",
        "text": "To qualify, it must be a change that completely and utterly changes the character of the language. The change must be so huge that it renders the language nearly (or even completely) unrecognizeable.\n\nI'll start.\n\n**German:** I'd make it polysynthetic. Agglutination is so rare among European languages, and polysynthesis is unheard of in this part of the world! Let's have a polysynthetic German. Shit's dope.\n\n**Norwegian:** I find it so sad that Norwegian lost its cases :(  So let's give it seven! Seven highly regular cases: Nominative, accusative, dative, genitive, instrumental, locative, and vocative.\n\n**French:** Nah, you're perfect the way you are. You do you, French\n\n**Mandarin Chinese:** Four tones is kind of a letdown! Let's revamp the tonal system: ten tones, with some tone contrasts being used for some kind of grammatical purpose in addition to the purely lexical functionality that irl Chinese has. \n\n**American English:** This one's my native language! But if I could magically change the language in a fundamental way, I'd give it an EXTREMELY STRONG Native American substrate. Strong enough to alter English's grammar, vocabulary, and phonology to the same degree (or greater!) as Norman French did, way back in the day.",
        "created_utc": 1671911917,
        "upvote_ratio": 1.0
    },
    {
        "title": "The annual WaniKani sale is on and I wanted to ask if anyone has any testimonials",
        "author": "Aspiring_Catgirl",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuhej4/the_annual_wanikani_sale_is_on_and_i_wanted_to/",
        "text": "It’s cheaper, but still incredibly expensive and I don’t have a whole lot of money to spend.",
        "created_utc": 1671911780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chinese, Japanese, Korean. Which one is the most useful in Europe?",
        "author": "xAlcy",
        "url": "https://www.reddit.com/r/languagelearning/comments/zugjvn/chinese_japanese_korean_which_one_is_the_most/",
        "text": "I'm a 19 y.o. European student who would like to become an interpreter, translator, or language teacher. \n\nLanguage programs here require studying two languages at a time, my first choice being German.   However, I'm having a hard time picking the second language. My options are Chinese, Japanese, or Korean; I'm completely aware of how challenging these languages are (as I'm slightly familiar with all of them), but I'm willing to put in the work required to succeed. \n\nWhich of these three languages do you think would be the most in demand for translation work or teaching in Europe? If anyone has any experience or insights on this topic, I would really appreciate it!",
        "created_utc": 1671909220,
        "upvote_ratio": 1.0
    },
    {
        "title": "interesting language learning scene in a movie",
        "author": "gluemeOTL",
        "url": "https://www.reddit.com/r/languagelearning/comments/zughnm/interesting_language_learning_scene_in_a_movie/",
        "text": "I just watched \"13th warrior\" where back in medieval times, a poet from Iraq ends up joining a viking tribe on a quest. And there's this campfire sequence where they show his language acquisition of Swedish/Norse.\nI know it's a time-lapse but I wish I could learn that fast just by listening 😁\n\nhttps://youtu.be/aVVURiaVgG8",
        "created_utc": 1671909040,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning Spanish &amp; Chinese simultaneously, what’s the best way to go about it?",
        "author": "EbonyBetty",
        "url": "https://www.reddit.com/r/languagelearning/comments/zufw2t/learning_spanish_chinese_simultaneously_whats_the/",
        "text": "During college I took five years of beginner to level 3 Spanish so I’m not starting from square one with this language. \n\nUnfortunately, I didn’t keep up practicing after I graduated three years ago and I’d say my current Spanish fluency is at intermediate conversational/reading level.\n\nAs for Chinese, I'm at the basics. Like, \"hello my name is...\" and \"the boy is happy.\" \n\nThanks to the holiday break, I'm at my longest Duolingo streak ever with 27 days for both languages practicing about 1-2 hours a day, and I hope to keep it going. However, once January comes and work is back on the table, I'll probably have only an hour of practice at most per day. \n\nWhat's the most efficient and effective way to ration my learning time between these two languages? Should I spend less time on Spanish since I'm more familiar with it and devote more to Chinese since I'm still starting out? Or should I spend less time on Chinese since I'm still learning the basics and spend the extra time to solidify the established Spanish? \n\nAny advice, tips, tricks are welcome!*\n\n*Except the advice to drop one of the languages entirely.",
        "created_utc": 1671907297,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lingopie lifetime is 70% off right now",
        "author": "Cheshire_Cat3333",
        "url": "https://i.redd.it/rgqc72ckkx7a1.jpg",
        "text": "",
        "created_utc": 1671906551,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hebrew learners, what helped you to start reading without vowel markings?",
        "author": "collaredfairy",
        "url": "https://www.reddit.com/r/languagelearning/comments/zufl2v/hebrew_learners_what_helped_you_to_start_reading/",
        "text": "I find it so, so hard. \nEven learning Japanese wasn't so hard.\n\nLike, are you *really* supposed to just memorize every word?\nI feel like it's such a passion killer.",
        "created_utc": 1671906395,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does “this feels targeted” mean?",
        "author": "TemporaryNebula2463",
        "url": "https://i.redd.it/o7d7iu2tjx7a1.jpg",
        "text": "",
        "created_utc": 1671906297,
        "upvote_ratio": 1.0
    },
    {
        "title": "Old English or Sumerian?",
        "author": "qtummechanic",
        "url": "https://www.reddit.com/r/languagelearning/comments/zufip4/old_english_or_sumerian/",
        "text": "I’m currently learning Korean, but I’ve always found these two languages extremely fascinating. I am thinking about beginning to dabbling in one (possibly both eventually). I’m curious which one would have more resources available and possibly some recommendations. I know old English would be easier in terms of linguistic difficulty but that doesn’t concern me. Both are equally fascinating to me. I’m simply trying to base my initial decision on materials/reading material available in each one.",
        "created_utc": 1671906201,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does being bilingual actually work in your head?",
        "author": "bain_de_beurre",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuf79e/how_does_being_bilingual_actually_work_in_your/",
        "text": "I'm not really sure how to explain this question so hopefully it comes across accurately. I'm wondering for those who are actually bilingual, how does it work inside your mind when you're reading or hearing your second language? Do you actually translate things inside your head as you're reading/listening? Or do you just *know* the words and what they mean and you don't actually have to translate anything?\n\nI asked this because I'm currently trying to learn a second language but I'm in the beginning stages. Some things that are very basic and have been repeated a million times I just know when I hear them and don't even really have to think about what they mean, I just know it. Other things that I'm only slightly familiar with I have to pick apart and actually translate them in my head to make out the sentence, which usually takes awhile.  I'm just kind of wondering, will it get better/easier because I will just know things and won't have to pick everything apart anymore? Or will I just get really fast at picking things apart?",
        "created_utc": 1671905262,
        "upvote_ratio": 1.0
    },
    {
        "title": "My question to multilinguals: How don't you forget languages you learn",
        "author": "myseparationanxiety",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuf6ap/my_question_to_multilinguals_how_dont_you_forget/",
        "text": "[removed]",
        "created_utc": 1671905184,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a neutral honorific?",
        "author": "mossryder",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuey45/is_there_a_neutral_honorific/",
        "text": "In english? Was this posted a million times? Sorry.",
        "created_utc": 1671904532,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which should I learn first in 2023: French or Spanish?",
        "author": "NickHeathJarrod",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuekga/which_should_i_learn_first_in_2023_french_or/",
        "text": "My bg: I'm Malaysian and have been speaking Malay &amp; English for a lifetime. I learn English since I was a kid not just by English classes but also movies, cartoons, songs, etc. Considering to learn beginner Japanese, Hindi and an European language in 2023. Original plan is to learn French, mostly because I love reading bande dessinee or French comics, but I'm more tempted to learn Spanish as the language is now everywhere in the global pop culture. Asking this as I doubt I have more room nor time for one more European language in one year.\n\nAny advice?",
        "created_utc": 1671903372,
        "upvote_ratio": 1.0
    },
    {
        "title": "English listening comprehension",
        "author": "cuevadanos",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuehn9/english_listening_comprehension/",
        "text": "I have an English exam coming up and I would like to improve my listening comprehension, as it’s the skill I’m weakest at.\n\nThe ideal thing would be to watch BBC or national US broadcasting (because I’ll be exposed to Received Pronunciation and General American English that way) but I would definitely rather watch RTÉ (Irish television). \n\nIrish accents are known for being quite different from British/American accents. Will this be a big problem? Will hearing Irish accents improve my comprehension of other accents?",
        "created_utc": 1671903145,
        "upvote_ratio": 1.0
    },
    {
        "title": "Practising speaking Spanish by talking to a bot or with a podcast? Does it exist?",
        "author": "Separate_Box_2292",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuef0r/practising_speaking_spanish_by_talking_to_a_bot/",
        "text": "Are there apps or podcasts that i could use to practice speaking spanish? I would prefer something where I dont haveto actively use my phone so i could use it while driving car for example.",
        "created_utc": 1671902941,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you learn new words? What is the better way to improve your active vocabulary?",
        "author": "jeron_gwendolen",
        "url": "https://www.reddit.com/r/languagelearning/comments/zuee2w/how_do_you_learn_new_words_what_is_the_better_way/",
        "text": "Simply writing them down doesn't seem to be very effective.",
        "created_utc": 1671902861,
        "upvote_ratio": 1.0
    },
    {
        "title": "Source for creating a language",
        "author": "romblaster",
        "url": "https://www.reddit.com/r/languagelearning/comments/zue9sq/source_for_creating_a_language/",
        "text": "So for Christmas my brother and I have been giving each other presents that are hard to open, and this year he got me a lockbox that can only be opened by solving a riddle and putting in the code. And next year I wanted to one up him by creating a language that he would have to decipher to open his gift. Does anyone know where I can find a good source for creating and deciphering a language?",
        "created_utc": 1671902513,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best language to learn as a REMOTE freelancer? How to AVOID COMPETING with English-speaking people from India/Pakistan?",
        "author": "xXguitarsenXx",
        "url": "https://www.reddit.com/r/languagelearning/comments/zue3qr/best_language_to_learn_as_a_remote_freelancer_how/",
        "text": "*I'm a Software Engineer who wants to work REMOTELY with a high salary while living in cheap countries (for example Peru or Thailand).*\n\n**The problem is that:**\n\n* Salaries are very low when working for local companies in cheap countries. (Usually: high cost of living = High salaries, Low cost of living = Low salaries)\n* When working remotely for high-paying countries (For example Switzerland or USA), they often pay remote workers less for one of the 2 reasons:\n\n1. They pay you less because you live in a cheaper place (Location-dependent salaries)\n2. They pay you less because some guy from India/Pakistan is willing to do the same work for a lower price and you both speak English. \n\n# Can learning another language help me avoid competing against people from India/Pakistan?\n\n**These are my current languages:**\n\n* Danish: Fluent (Native)\n* English: Fluent\n* Spanish: Intermediate\n* German: Beginner\n\n**Option 1: Just work for Danish clients**\n\nI'm considering only working for danish clients because I'm natively fluent in Danish (a hard language to learn) and people from India/Pakistan don't seem to learn danish, so they don't drag down the salaries when working remotely for danish companies.\n\nHowever, only 5.800.000 live in Denmark, so I'll need a skillset that is not TOO niche, so I can find enough customers.\n\n**Option 2: Learn German**\n\nLearning German will allow me to work for clients from Germany, Switzerland, Austria &amp; Liechtenstein.  These countries have comparable salaries to Denmark (Switzerland has HIGHER salaries).\n\nThis will give me access to WAY more customers if I want to have a niche skillset, however, I'll also be competing with way more people (there are way more people speaking German compared to Danish). Also I think people from India/Pakistan might be more willing to learn German and drag those salaries down.\n\n**Option 3: Learn French**\n\nThis will also give me access to some countries with high salaries (For example Switzerland and Canada). However, most of the countries speaking french don't have as high salaries as those speaking german. The good thing though is that people speaking french natively generally are less willing/able to learn English, compared to the people who natively speak German.\n\n**Option 4: Learn Spanish**\n\nMost countries that speak Spanish don't have very high salaries, so maybe not so useful. Only useful if I want to start a business and use cheaper labor from South America.\n\n**Option 5: Portuguese** \n\nSame as Spanish.  \n**Option 6: Russian** \n\nSame as Spanish.  \n**Option 7: Arabic** \n\nSame as Spanish, with the exception of some countries in middle east with high salaries like Dubai and Qatar. However, Arabic is VERY difficult to learn, compared to German &amp; French, which can also give access to countries with high salaries.  \n**Option 8: Mandarin Chinese**\n\nSame as spanish.\n\n# Which language will be best for me to learn if I want to have high paying clients while living in a cheap country?\n\nAt the moment I think the best solution for me might either be to just serve Danish clients, since I'm danish myself and not many others can talk the language. However, I'm also considering German, because it could give me access to Switzerland with very high salaries, or french, because it also gives me access to Switzerland, but also Canada, which will be very useful if I want to live in South America and work in the same timezone. \n\nWhich language do you think is most useful to learn as a Software developer freelancer who wants to work for high paying clients while living in cheap countries, without competing against people from India/Pakistan?",
        "created_utc": 1671902028,
        "upvote_ratio": 1.0
    },
    {
        "title": "Let's have a Christmas Chat!",
        "author": "chinesedanny",
        "url": "https://youtu.be/oves2I_bq2g",
        "text": "",
        "created_utc": 1671901954,
        "upvote_ratio": 1.0
    },
    {
        "title": "Portuguese Nature Method being created by me (I'm doing for free, so, think twice before telling I'm here to self-promote)",
        "author": "Adventurous-Cold-308",
        "url": "https://i.redd.it/8njpdb03hv7a1.jpg",
        "text": "",
        "created_utc": 1671899263,
        "upvote_ratio": 1.0
    },
    {
        "title": "apps to learn advanced french",
        "author": "marineilyne",
        "url": "https://www.reddit.com/r/languagelearning/comments/zud108/apps_to_learn_advanced_french/",
        "text": "I have been living in France for a year, and I am B1, I understand French when they speak, I understand the main idea of ​​the books I read, however I still find it difficult to speak especially.\nIt would also be nice to improve my vocabulary and make it more formal.",
        "created_utc": 1671898802,
        "upvote_ratio": 1.0
    },
    {
        "title": "German language penpal",
        "author": "InsecureSquid",
        "url": "https://www.reddit.com/r/languagelearning/comments/zucwi2/german_language_penpal/",
        "text": "Hello,\nI'm Manca (18). I come from Slovenia and have been learning German for quite some years. I'm at a B2 level right now and I'm am trying to incorporate it more into my everyday life. My plan is to get the TestDaf certificate to go study in Germany. I'm interested in math, programming and other sciences. I also pick up a lot of random hobbies along the way. I also love gaming and play mainly League (I stopped...idk if I should even start again lol). xD\nI'm searching for a penpal that would practice German at a higher level with me. Maybe a fellow learner or anybody really. :)",
        "created_utc": 1671898415,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to learn American Sign Language? Check us out!",
        "author": "Ok-Bandicoot-6106",
        "url": "https://www.reddit.com/r/languagelearning/comments/zucvp8/want_to_learn_american_sign_language_check_us_out/",
        "text": "[removed]",
        "created_utc": 1671898343,
        "upvote_ratio": 1.0
    },
    {
        "title": "Langotalk - AI Chatbot to practice a language",
        "author": "oopiex",
        "url": "https://www.reddit.com/r/languagelearning/comments/zucp49/langotalk_ai_chatbot_to_practice_a_language/",
        "text": "A new way to test your language skills thanks to technology advancing, [Langotalk](https://www.langotalk.org/). It's a chatbot based on GPT-3, you can practice Spanish / French / Italian / Dutch / German / English with it.",
        "created_utc": 1671897780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning German through comprehensible input",
        "author": "AgnesBand",
        "url": "https://www.reddit.com/r/languagelearning/comments/zubpzc/learning_german_through_comprehensible_input/",
        "text": "I'm wondering if anyone has any experience with either the book Deutsch Für Ausländer or the book Deutsche Sprachlehre Für Ausländer and could recommend me either book?\n  \nThey both seem so similar so I'm unsure.\n\nThanks in advance",
        "created_utc": 1671894739,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone tell me what she said or what language she is speaking?",
        "author": "Physical_Radio6335",
        "url": "https://v.redd.it/fpe2o4g7dw7a1",
        "text": "",
        "created_utc": 1671891978,
        "upvote_ratio": 1.0
    },
    {
        "title": "Personal Problems and Polygot and Personal Problems",
        "author": "stanger_here_myself",
        "url": "https://www.reddit.com/r/languagelearning/comments/zua36d/personal_problems_and_polygot_and_personal/",
        "text": "How do polyglots manage personal relationships and learning languages?  I'm not talking about someone who grew up speaking multiple languages.  I learned L2 as an adult and everyone was like, \"wow that's nice.  You are so well rounded and smart\".  Now it's number 3 and my partner is like, \"hey you spend all your time chatting with strange dudes you met on the internet.\".  My kids are warning me about internet stranger  danger and asking why we can only listen to podcasts in Uzbek on the six hour drive to grandma's.\n\n In my mind I'm envisioning myself divorced, my kids hate me, and i have to drop my LINGQ subscription because of child support. Also I'm arrested at the airport because I'm muttering to myself in Uzbek.",
        "created_utc": 1671889372,
        "upvote_ratio": 1.0
    },
    {
        "title": "Language flashcard apps",
        "author": "Lower-Good8049",
        "url": "https://www.reddit.com/r/languagelearning/comments/zua1xp/language_flashcard_apps/",
        "text": "Hi, I'm currently learning spanish and I'm looking for a flashcard app that does the following things:\n\nEach word added goes into a list. The user can create extra lists for currently learning, organize by topic, etc.  Obviously there is one big list to include all words ever entered into the app. One word can belong to multiple lists.\n\nWhen you add words, supply a short one term translation, along with an optional section for more detailed longer definition(s), or example sentences (User can put whatever they want) This would show up when you click on a word to see its \"flashcard\" view.\n\nThose are all the basic features I'd need.\n\nDoes any app like this exist? I'm a (novice) software engineer and was thinking of developing something to meet my needs, but I wanted to check to see if it's not already out there.",
        "created_utc": 1671889254,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did you fit shadowing into your routine?",
        "author": "No_Hold1990",
        "url": "https://www.reddit.com/r/languagelearning/comments/zu9z1e/how_did_you_fit_shadowing_into_your_routine/",
        "text": "[removed]",
        "created_utc": 1671888974,
        "upvote_ratio": 1.0
    },
    {
        "title": "The most believable polyglot video I have yet seen on youtube - Mistakes are a part of learning.",
        "author": "Joe1972",
        "url": "https://youtu.be/GofAopYUZ54",
        "text": "",
        "created_utc": 1671886540,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help! I'm a loserglot (a failed polyglot)!",
        "author": "otc456",
        "url": "https://www.reddit.com/r/languagelearning/comments/zu7uxz/help_im_a_loserglot_a_failed_polyglot/",
        "text": "Hi, my circumstances:\n\n- Native Italian, but haven't lived in Italy for 25 years and not very interested in catching up;\n\n- Have lived in UK for most of these 25 years, not bothered to improve;\n\n- have been learning German for 20 (!) years, still stuck at B1/B2;\n\n- have been learning Dutch for 10 years, stuck at B1/B2;\n\n- have been learning French for 2 years, probably at B1/B2 but lost motivation.\n\nAs I live in UK and no realistic chances of moving abroad and perfecting  any of the above to say, at least C1, I keep on rotating between all of them, hoping I get to that ideal spot where I am fluent, but this will never come if I stay here in UK.\n\nSo, I'm happy with watching movies/news in German, Dutch, French, but I don't know what to do. On one hand I'm just tempted to give up learning, but I feel if I did, I'd have squandered 20 years on nothing.\n\nI don't even know what I want but this is frustrating.",
        "created_utc": 1671880549,
        "upvote_ratio": 1.0
    },
    {
        "title": "IG ACCOUNT IDEA",
        "author": "keto123_",
        "url": "https://www.reddit.com/r/languagelearning/comments/zu7rlm/ig_account_idea/",
        "text": "",
        "created_utc": 1671880144,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey everybody! I'm a 22 year old Turkish. Is there anybody learning Turkish? :) I'm looking for a friend to practice speaking with me. The mother language must be English. Thus, we can correct each other's mistakes by having conversations in both English and Turkish.",
        "author": "pork61",
        "url": "https://www.reddit.com/r/languagelearning/comments/zu7da1/hey_everybody_im_a_22_year_old_turkish_is_there/",
        "text": "",
        "created_utc": 1671878407,
        "upvote_ratio": 1.0
    },
    {
        "title": "finding people to talk to",
        "author": "VeloLis",
        "url": "https://www.reddit.com/r/languagelearning/comments/zu6xd7/finding_people_to_talk_to/",
        "text": "[removed]",
        "created_utc": 1671876440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Realistic ways to practice speaking",
        "author": "Gigi_gold",
        "url": "https://www.reddit.com/r/languagelearning/comments/zu5zf6/realistic_ways_to_practice_speaking/",
        "text": "",
        "created_utc": 1671872409,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's a word for positive manipulation?",
        "author": "connect-maya",
        "url": "https://www.reddit.com/r/languagelearning/comments/zu5png/whats_a_word_for_positive_manipulation/",
        "text": "Like e.g. planting trees",
        "created_utc": 1671871229,
        "upvote_ratio": 1.0
    },
    {
        "title": "word order comparison between turkish-japanese and turkish-english shown with the help of colour codes.",
        "author": "Helpful-Citron-8853",
        "url": "https://i.redd.it/4foyutfj2t7a1.png",
        "text": "",
        "created_utc": 1671870096,
        "upvote_ratio": 1.0
    },
    {
        "title": "frustration over tutors",
        "author": "Mentalaccount1",
        "url": "https://www.reddit.com/r/languagelearning/comments/zu2j6j/frustration_over_tutors/",
        "text": "Every single time they will just ask me to book a lesson with them but not trial, it's a full priced lesson just so that we can discuss their teaching method. I find it irresponsible that one cannot communicate prior to first lesson. Given that I'm paying for a full price lesson just to talk about their teaching methodology or asking me what I want it simply is a waste of money. Not only that, after paying the first lesson just to talk without learning, I have to book a few more lessons just to see and try if they really stick to what they said about their teaching method and content and also to see if it suits me. \nMost of the time, they NEVER do what they said they will. So meaning my money is wasted on the first few lessons which amount to like 100 dollars plus. Its quite a sum. \nI'm looking for both Korean and Spanish tutors and they usually do not disclose information for example, teaching method, having own notes or not and which book they use. Since they don't usually follow what they said or promised and don't even care about the student's needs, I wonder what's the point of putting in so much effort to find a tutor.",
        "created_utc": 1671859094,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I learn French or German",
        "author": "rio_katie",
        "url": "https://www.reddit.com/r/languagelearning/comments/zu28kc/should_i_learn_french_or_german/",
        "text": "[removed]",
        "created_utc": 1671858071,
        "upvote_ratio": 1.0
    },
    {
        "title": "word order comparison between turkish-japanese and turkish-english shown with the help of colour codes.",
        "author": "Weekly-Effort1217",
        "url": "https://i.redd.it/3h4on85t1s7a1.png",
        "text": "",
        "created_utc": 1671857738,
        "upvote_ratio": 1.0
    },
    {
        "title": "Apps for English learning from Burmese?",
        "author": "SingerIll6157",
        "url": "https://www.reddit.com/r/languagelearning/comments/zu1t1b/apps_for_english_learning_from_burmese/",
        "text": "Hi - there is a domestic helper living in my apartment block who does not speak English, and is totally isolated as a result. I think this suits her employers so they are not going to help her. \n\nI wanted to suggest to help some apps/YouTube channels but don't know where to start. So far we just communicate via Google translate as she understands little more than hello, goodbye, please, thank you. \n\nAny ideas?",
        "created_utc": 1671856591,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hand symbol",
        "author": "GurAccomplished5846",
        "url": "https://www.reddit.com/gallery/zu1igj",
        "text": "Anyone recognize this hand symbol ?",
        "created_utc": 1671855581,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best way to learn a different sentence structure?",
        "author": "bibliophilia321",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztyshf/best_way_to_learn_a_different_sentence_structure/",
        "text": "Hello all, I am learning Spanish and I idk what my level is but I’m at a point where I can have somewhat of a conversation, although I make mistakes/don’t know a lot of vocabulary. My language partner (who is learning English) told me that my biggest weakness right now is that he can tell that I am translating from English into Spanish when I talk. I am using Spanish words but still following an English sentence structure when I speak. I know I do this, but honestly I don’t understand Spanish sentence structure. Sometimes I read a sentence and knows every single word but have a hard time understanding the meaning because the structure is so different. Are there resources for this? I’m very frustrated/discouraged. Thank you.",
        "created_utc": 1671846880,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I tell my friends that I don't always like speaking English to them without sounding rude? (part vent)",
        "author": "TaGeuelePutain",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztwqee/how_do_i_tell_my_friends_that_i_dont_always_like/",
        "text": "A bit of background - I reached C1 level in French around 5 years ago after living in France for a bit. Since then I go back for 1-2 months every year and have a good amount of acquaintances/friends who are francophone. My level could definitely improve and admittedly I haven't really \"studied\" it in quite some time, though I don't have any issues using it apart from complex subjects like politics or cultural things. It's rare, but not absent, that I don't understand something like a word or idiom/expression.\n\nOne thing I've noticed though throughout the years is that most of my francophone friends *never* talk to me in French. Our relationships are 100% in English, to the point it even feels like they pretend like I don't speak any French at all. If we are alone then they will speak to me in English. If i say something in French, i get a cringe vibe and they switch immediately back to english. If there's a group of french people we are with they will talk in French to the other french people but switch to english as soon as they start talking to me, even if I am the only english speaker in the group, and even if I'm contributing to the group conversation in French.\n\nThis *really* bothers me, and since moving to Montreal and being around other francophones (mostly french, not quebecois) I've really become aware of how much I'm used as english practice. I find myself avoiding certain people that I know will only talk to me in English because I start to get the sense they are only friends with me for the sole purpose of practicing, especially if their english is so-so. \n\nHow do i say this without coming across as rude? also, is it just me or is this rude on their part as well?\n\n&amp;#x200B;\n\nTLDR:\n\nDespite having a (somewhat) high level in French,  close french friends insist on speaking only english to me. French acquaintances will always try to practice even if they didn't ask me, and it really bothers me. How do politely say I don't want to speak english sometimes with them?",
        "created_utc": 1671840686,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which site to learn English",
        "author": "Possible-Alarm-5992",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztwpj7/which_site_to_learn_english/",
        "text": "Hello.\nJust I have simple question to you. Which website do you use to improve your English? I tried to find any website and app with simple language and interesting subject to read and I choose BBC but by the way I was thinking about which website could help me to improve my English. I mean not only improve English through news but in generally.\nThanks and Merry Christmas.",
        "created_utc": 1671840617,
        "upvote_ratio": 1.0
    },
    {
        "title": "Names that change in other languages",
        "author": "lybertyne",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztv0pn/names_that_change_in_other_languages/",
        "text": "I was reading an article on the Icelandic Wikipedia about Henry VIII.  You´d expect the names to be \"Icelandic-ised\" and they were.  Henry becomes Hinrik.  Mary becomes Maria.  Elizabeth becomes Elísabet.  And then we come to Edward, which has been rendered in Icelandic as Játvarður!  Are there any names in languages you know that are completely different from one language to the next?",
        "created_utc": 1671835909,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the first language you started learning and when did you start learning it?",
        "author": "UwU9999n",
        "url": "https://www.reddit.com/r/languagelearning/comments/zturo0/whats_the_first_language_you_started_learning_and/",
        "text": "",
        "created_utc": 1671835227,
        "upvote_ratio": 1.0
    },
    {
        "title": "i need help with anki and languge learning in general",
        "author": "googoomanman0",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztul0n/i_need_help_with_anki_and_languge_learning_in/",
        "text": "how do i download anki and what is the best way to learn spainish i already have duolingo LOL but i want other ways that can help to",
        "created_utc": 1671834704,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with my thesis",
        "author": "itengkr",
        "url": "/r/italianlearning/comments/zspg4t/help_with_my_thesis/",
        "text": "",
        "created_utc": 1671832572,
        "upvote_ratio": 1.0
    },
    {
        "title": "how long should I study before getting burnt out?",
        "author": "Amazing_Unit_6494",
        "url": "https://www.reddit.com/r/languagelearning/comments/zttfgr/how_long_should_i_study_before_getting_burnt_out/",
        "text": "I need to get myself ready for an exchange program so I need to teach myself a few grammar topics in the holidays to get ahead, how many hours are recommended so I don't get burnt out?",
        "created_utc": 1671831703,
        "upvote_ratio": 1.0
    },
    {
        "title": "When should I start watching TV/Movies in the language that I'm learning?",
        "author": "Hippo-stomp",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztt4go/when_should_i_start_watching_tvmovies_in_the/",
        "text": "I'm currently learning Portuguese and I've been really enjoying it so far. A difficult problem that I have is listening to the language naturally. Music and reading are of course easier for me but hearing it naturally spoken is tough. When I was staying in Brazil, I met many people who learned English through watching the show Friends. I was curious about when was a good time to start assimilating yourself into the language through media. \n\nDoes it matter when? How do you guys recommend watching? Are subs on or off? Is my house on fire? Am I ever going to have that magical ear?",
        "created_utc": 1671830891,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do i find Russian generally easier than Spanish?",
        "author": "Zhizha_",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztsinc/why_do_i_find_russian_generally_easier_than/",
        "text": "According to Wiki and people on the net it should be somewhat harder, but i think it has something to do with my N language but it’s Kurdish(indo-European) it uses the Arabic alphabet! I don’t know Russian just clicks, and I like both but i think I’ll go for Russian first, what do you think?",
        "created_utc": 1671829254,
        "upvote_ratio": 1.0
    },
    {
        "title": "Made a mistake today",
        "author": "ThatOddBlackFellow",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztsfbf/made_a_mistake_today/",
        "text": "So I work in a wear house where most of my coworkers speak Spanish today I absently mindely replied to a question in Spanish. Now they are all speaking to me in Spanish I'm not conversational yet and it so embarrassing.",
        "created_utc": 1671829016,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone bought Language Simp’s Patreon?",
        "author": "Themanbehund",
        "url": "https://www.reddit.com/r/languagelearning/comments/zts4i1/has_anyone_bought_language_simps_patreon/",
        "text": "[removed]",
        "created_utc": 1671828188,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any good resources for learning Adyghe and/or Kabardian?",
        "author": "cheshsky",
        "url": "https://www.reddit.com/r/languagelearning/comments/zts1c6/any_good_resources_for_learning_adyghe_andor/",
        "text": "So, I've decided to learn an extremely underrepresented language. It's Adyghe, but it has enough mutual intelligibility with Kabardian for Kabardian resources to be good enough (and tbf I do consider them two dialects of the overall Circassian language). I already have 50 Steps' Adyghe course and Adyghe Sounds on my phone. Does anyone else know any other good resources, apps or textbooks?",
        "created_utc": 1671827953,
        "upvote_ratio": 1.0
    },
    {
        "title": "NY good resources for learning Adyghe and/or Kabardian?",
        "author": "cheshsky",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztrrxq/ny_good_resources_for_learning_adyghe_andor/",
        "text": "So, I've decided to learn an extremely underrepresented language. It's Adyghe, but it has enough mutual intelligibility with Kabardian for Kabardian resources to be good enough (and tbf I do consider them two dialects of the overall Circassian language). I already have 50 Steps' Adyghe course and Adyghe Sounds on my phone. Does anyone else know any other good resources, apps or textbooks?",
        "created_utc": 1671827251,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone here have experience with programming languages?",
        "author": "mickmikeman",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztqnit/does_anyone_here_have_experience_with_programming/",
        "text": "How would one go about learning one? Preferably for free.\n\nAlso which ones are the most useful/in demand?",
        "created_utc": 1671824285,
        "upvote_ratio": 1.0
    },
    {
        "title": "Christmas and New Year poems in 18 languages",
        "author": "OliviaJonesData",
        "url": "https://www.youtube.com/watch?v=-oqAukK5dO0",
        "text": "",
        "created_utc": 1671823843,
        "upvote_ratio": 1.0
    },
    {
        "title": "What mundane part of your target language is the hardest to learn for you?",
        "author": "BirdCute",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztqgfs/what_mundane_part_of_your_target_language_is_the/",
        "text": "I don't know if anyone else has this issue, but I always find it super hard to learn names of the days of the week in my target language. I've been studying Italian for over two years now and I'm only 100% certain for about names of 4 days lol. I also started learning Japanese very recently and I feel like the same story is happening again.\n\nFor some reason, it also always takes me much longer to parse numbers in spoken language than the rest of the speech. Pretty weird.\n\nHow about you folks?",
        "created_utc": 1671823784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resources for learning Mauritian Creole",
        "author": "OkBasil_147",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztqflh/resources_for_learning_mauritian_creole/",
        "text": "Can anyone recommend any good resources for learning Mauritanian Creole?",
        "created_utc": 1671823721,
        "upvote_ratio": 1.0
    },
    {
        "title": "I could use some new podcast recommendations",
        "author": "KingSnazz32",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztpqw5/i_could_use_some_new_podcast_recommendations/",
        "text": "I use podcasts when out for walks a lot, but realized I'm pretty bored with my current crop. I'm interested in anything you might recommend in Spanish, Brazilian Portuguese, French, and Italian. I like historical stuff (really in depth, not shallow bites), anything to do with language, or maybe interesting hobbies, travel, economics, that sort of thing.\n\nIf someone has a really beginning Swahili podcast, I'd appreciate that, too, but that's a longshot, I know.",
        "created_utc": 1671821921,
        "upvote_ratio": 1.0
    },
    {
        "title": "Community Welcome Phrasebook: 10 Phrases To Welcome People - avagu press",
        "author": "avagupress",
        "url": "https://avagupress.com/community-welcome-phrasebook/",
        "text": "",
        "created_utc": 1671819939,
        "upvote_ratio": 1.0
    },
    {
        "title": "How are youtubers able to learn that fast?",
        "author": "pikachuuu232",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztooj5/how_are_youtubers_able_to_learn_that_fast/",
        "text": "On youtube, there are some people who put in their video titles: \"how i learnt french in 1 month\" or \"speak chinese fluently in only 6 months\". Or something similar.... \n\n\nIs this really possible? I know there are some people who are able to speak a lot of languages but this still seems fast\n\n\nOr does language learning become really easy after a certain point? For example, (germany) we need to study english from 3rd grade to 10th grade to get to b1 or b2 level. The second foreign language only takes 3 years. (B1) \nAnd in university, it is possible to reach c2 in 6 semesters (4 hours lessons each week. If one can keep up.) \n\n\nPeople like this have 1m views. Did they study 20 languages so the 21th one becomes easy? Because the course/school speed increases so much after the first foreign language. \nOr is there another secret to learning french in 1 month?",
        "created_utc": 1671819103,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I study German or English?",
        "author": "TomasKTZ",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztomcn/should_i_study_german_or_english/",
        "text": "[removed]",
        "created_utc": 1671818950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fluency",
        "author": "AlabamaFan17",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztod8i/fluency/",
        "text": "If I want to become fluent in a language in 4 years, how many minutes/hours should I spend practicing it each day?",
        "created_utc": 1671818322,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you get traveling to Europe with only English?",
        "author": "AdorableFluffy123",
        "url": "https://www.reddit.com/r/languagelearning/comments/zto6t2/can_you_get_traveling_to_europe_with_only_english/",
        "text": "What do you think?",
        "created_utc": 1671817836,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get a free $750 CashApp Card! New Cash App Hack Method! Only 72 left",
        "author": "Techgee78533191_7376",
        "url": "https://www.reddit.com/r/languagelearning/comments/zto5w2/get_a_free_750_cashapp_card_new_cash_app_hack/",
        "text": "[removed]",
        "created_utc": 1671817783,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get a free $750 CashApp Card! New Cash App Hack Method! Only 72 left",
        "author": "austinjamesxyz_3032",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztnxtt/get_a_free_750_cashapp_card_new_cash_app_hack/",
        "text": "[removed]",
        "created_utc": 1671817500,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get a free $750 CashApp Card! New Cash App Hack Method! Only 72 left",
        "author": "Cirv_j_8602",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztnpub/get_a_free_750_cashapp_card_new_cash_app_hack/",
        "text": "[removed]",
        "created_utc": 1671817234,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get a free $750 CashApp Card! New Cash App Hack Method! Only 72 left",
        "author": "DanielCocris_4355",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztni8z/get_a_free_750_cashapp_card_new_cash_app_hack/",
        "text": "[removed]",
        "created_utc": 1671817001,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rolls Royce's new NFT collection is Live! 800 NFTs for the first 800 people!",
        "author": "m_ng85_6378",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztn417/rolls_royces_new_nft_collection_is_live_800_nfts/",
        "text": "[removed]",
        "created_utc": 1671816209,
        "upvote_ratio": 1.0
    },
    {
        "title": "Porsche's new NFT collection is Live! 1000 NFTs for the first 1000 people!",
        "author": "raerobinNFT_7421",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztmqsw/porsches_new_nft_collection_is_live_1000_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671815610,
        "upvote_ratio": 1.0
    },
    {
        "title": "Built a study app (looking for feedback!)",
        "author": "echoprofofficial",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztmljb/built_a_study_app_looking_for_feedback/",
        "text": "[removed]",
        "created_utc": 1671815284,
        "upvote_ratio": 1.0
    },
    {
        "title": "Balenciaga's new NFT collection is Live! 2022 NFTs for the first 2022 people!",
        "author": "APEmoveApp_4363",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztlwd4/balenciagas_new_nft_collection_is_live_2022_nfts/",
        "text": "[removed]",
        "created_utc": 1671813685,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rolls Royce's new NFT collection is Live! 800 NFTs for the first 800 people!",
        "author": "shotamikaia_2722",
        "url": "https://www.reddit.com/r/languagelearning/comments/ztlmrk/rolls_royces_new_nft_collection_is_live_800_nfts/",
        "text": "[removed]",
        "created_utc": 1671813224,
        "upvote_ratio": 1.0
    }
]