[
    {
        "title": "What's the hardest part about learning a language?",
        "author": "Crugladon",
        "url": "https://www.reddit.com/r/languagelearning/comments/10j3wku/whats_the_hardest_part_about_learning_a_language/",
        "text": "[removed]",
        "created_utc": 1674448576,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you apply to go to a school to learn Spanish in another country?",
        "author": "freshlikeair",
        "url": "https://www.reddit.com/r/languagelearning/comments/10j3c3m/how_do_you_apply_to_go_to_a_school_to_learn/",
        "text": "I’m in my mid 20s and I recently started taking an interest in learning Spanish.  I want to experience what a different culture is like and live there.  I’m not sure how to go about doing this.  \n\nShould I have been doing this when I was younger? \n\nDo I just need to find a school in the country I want to go to and apply?  I’m just not sure how it all works.",
        "created_utc": 1674446796,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT works as a much better translater than Google Translate :)",
        "author": "Max74215",
        "url": "https://i.redd.it/n5yj9v0pqpda1.png",
        "text": "",
        "created_utc": 1674444902,
        "upvote_ratio": 1.0
    },
    {
        "title": "Like Looking Through A Dirty Window",
        "author": "Otherwise_Koala_8008",
        "url": "https://www.reddit.com/r/languagelearning/comments/10j2gxf/like_looking_through_a_dirty_window/",
        "text": "[removed]",
        "created_utc": 1674444083,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know what this is? I found this slip of paper on the ground",
        "author": "Electroblazer789",
        "url": "https://i.redd.it/0bz4uiyq5rda1.jpg",
        "text": "",
        "created_utc": 1674444025,
        "upvote_ratio": 1.0
    },
    {
        "title": "New Icelandic Learning Community",
        "author": "Asvalendorf",
        "url": "https://www.reddit.com/r/languagelearning/comments/10j14gr/new_icelandic_learning_community/",
        "text": "A brand new sever for learning Icelandic for serious students more focused on learning the language. https://discord.gg/Cm9hHyZPMx",
        "created_utc": 1674439955,
        "upvote_ratio": 1.0
    },
    {
        "title": "Might be a dumb question but what does it mean?",
        "author": "deer_remi",
        "url": "https://www.reddit.com/r/languagelearning/comments/10j0msx/might_be_a_dumb_question_but_what_does_it_mean/",
        "text": "I've been learning some new languages and joined this sub not too long ago and there's something I noticed, everyone uses A0, B2, C1 etc. I understand that they're different levels of language learning but what exactly do they mean? Also I saw someone say they got a B2 certificate, how and why? Genuinely curious as I'm not that educated on \"proper\" (?) language learning",
        "created_utc": 1674438508,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you like learning by listening to podcasts? Here's a tool to help translate the words you don't know while listening",
        "author": "lilsniffles206",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iyhlt/do_you_like_learning_by_listening_to_podcasts/",
        "text": "[removed]",
        "created_utc": 1674432315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will this plan get me to B2?",
        "author": "jabonjabon",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iy3rc/will_this_plan_get_me_to_b2/",
        "text": "[removed]",
        "created_utc": 1674431289,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tandem alternatives with a focus on live calls?",
        "author": "crossbowthemessenger",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iwlr0/tandem_alternatives_with_a_focus_on_live_calls/",
        "text": "Hey folks. I've tried using Tandem in the past, but I find that most people prefer to leave audio messages, which just don't do it for me. It can take a lot of investment before you have calls with people, and it's not easy to know if you click with them conversationally before that, so I just end up using italki instead.\n\nAre there any equivalents with a feature to filter only for live conversations or similar?",
        "created_utc": 1674427430,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to learn a new language but I can’t decide out of French, Spanish or German. Does anybody know what the easiest or maybe the handiest language is?",
        "author": "SatisfactionBig3955",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iw13e/i_want_to_learn_a_new_language_but_i_cant_decide/",
        "text": "",
        "created_utc": 1674425995,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Little Prince in Berber",
        "author": "SugarPotatoes",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ivehx/the_little_prince_in_berber/",
        "text": "Does anyone know where I could order a copy of the Little Prince in Berber?   \n\n\nI'm also looking for it in Arabic, there's very few copies on Amazon.",
        "created_utc": 1674424433,
        "upvote_ratio": 1.0
    },
    {
        "title": "hi! I want to learn Spanish but I don't know where to begin!",
        "author": "toocleanforyall",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iurq4/hi_i_want_to_learn_spanish_but_i_dont_know_where/",
        "text": "Besides using language learning apps like Duolingo or Language Transfer, where should start when learning a new language? Do you start off by learning basic words?",
        "created_utc": 1674422873,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can i memorize 100.000 words ? what apps or sites would you use for this ?",
        "author": "iniv189",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iuqvm/can_i_memorize_100000_words_what_apps_or_sites/",
        "text": "",
        "created_utc": 1674422811,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I up my Indonesian vocabulary fast?",
        "author": "Purple-Scientist",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iuibj/how_do_i_up_my_indonesian_vocabulary_fast/",
        "text": "So I need help. Sorry if this is a noob question. BUT, I started learning Bahasa Indonesia last December and I feel like I understand about 30% of the written text already, but I want to understand more. Do I just binge articles, books, movies, etc? Or is there a more efficient way?",
        "created_utc": 1674422226,
        "upvote_ratio": 1.0
    },
    {
        "title": "Those of you who studied in your free time, how long did it take to become conversational?",
        "author": "Aggressive_Grand_897",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iuhbr/those_of_you_who_studied_in_your_free_time_how/",
        "text": "A little background on me. I took one semester of an asian language in school but I recently graduated so now I am studying online with a tutor. I want to learn this asian language to a point where I can have a general conversation to a somewhat basic level about anything that's on my mind. I'd say right now I know about 300 words and can order food etc. One of my online tutors told me in 3 months I will be able to speak in conversation about most things I want however online here many say it takes years if you aren't living in the country/studying abroad. I am planning on doing flashcards every day and meeting with my online tutor 3 times a week along with talking to my friends who speak this language natively every day. \n\nI am not asking you to predict for me exactly, but just wondering if there are any people who are in the sake situation as me and if you can speak conversational, how long did it take? Just looking for data points thanks",
        "created_utc": 1674422155,
        "upvote_ratio": 1.0
    },
    {
        "title": "How are the most frequent words found and compiled ?",
        "author": "iniv189",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iufmn/how_are_the_most_frequent_words_found_and_compiled/",
        "text": " [https://en.wiktionary.org/wiki/Wiktionary:Frequency\\_lists](https://en.wiktionary.org/wiki/Wiktionary:Frequency_lists)  [https://gist.github.com/h3xx/1976236](https://gist.github.com/h3xx/1976236) I saw these lists and I keep thinking about how they are archived",
        "created_utc": 1674422040,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spanish Resource Similar to 90 Day Korean?",
        "author": "Professional_Fee6322",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ito6k/spanish_resource_similar_to_90_day_korean/",
        "text": "A few years ago, I was learning Korean and got pretty far with the 90 Day Korean resource. Now, I am trying to learn Spanish and looking for something similar. Any suggestions?  Thanks!",
        "created_utc": 1674420171,
        "upvote_ratio": 1.0
    },
    {
        "title": "Premade anki decks aren't bad",
        "author": "Artexie1",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ite3k/premade_anki_decks_arent_bad/",
        "text": "Hi, \n\nAs the title says I don't understand why people hate premade anki decks. I also think you should make your own decks if you're more advanced in the language and just add words you don't know while consuming the media. But when you are complete begginer how are you supposed to learn vocabulary? In every language I learn I do at least 5000 most common words because I just can't learn grammar without understanding rest of the sentence.",
        "created_utc": 1674419479,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m not sure exactly what my fluency level is, how should I evaluate it?",
        "author": "Picu24-alt",
        "url": "https://www.reddit.com/r/languagelearning/comments/10itch3/im_not_sure_exactly_what_my_fluency_level_is_how/",
        "text": "I can understand my TL if spoken at a slow to moderate pace. I can read Google stuff in my TL with little to no problem(unless I search up something highly specialized). I can automatically conjugate anything correctly for whatever context I’m speaking in without thinking about it. I can also communicate whatever it is I’m trying to say albeit a little slowly. To be fair, I’d recon a third grader could communicate more effectively than I can but I can still say whatever I want to or need to say, sometimes I have to phrase it weirdly though.",
        "created_utc": 1674419370,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I unlearn english?",
        "author": "knowledgeablematrix",
        "url": "https://www.reddit.com/r/languagelearning/comments/10it7re/how_can_i_unlearn_english/",
        "text": "Hello.\n\nWhen I was a child my parents made me learn english. My native language is spanish.\n\nHowever, to know this language put me in contact with a culture I dislike, that sadly has a large influence on the rest of the world.\n\nSadly I understand those people and I would rather not hear anything about them. I think it would be less direct and less infuriating if I didn't understand what they say.\n\nSo I would like to know how can I purposefully unlearn english, so I end up knowing only spanish, which is enough for all my needs.",
        "created_utc": 1674419037,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you believe in energetic or dimensional languages?",
        "author": "thiscontradiction",
        "url": "https://youtu.be/2dr_g6d8Yiw",
        "text": "",
        "created_utc": 1674418995,
        "upvote_ratio": 1.0
    },
    {
        "title": "People who went from studying one language to two, did this help with burn out it increase it?",
        "author": "beartrapperkeeper",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iso86/people_who_went_from_studying_one_language_to_two/",
        "text": "Title. Been busting my hump with Chinese for a while, want to continue but i am definitely feeling a bit of a burn out. Love language learning, is definitively my hobby. Wondering if adding another language would help a bit? Not increasing study time but rather adding variety.",
        "created_utc": 1674417673,
        "upvote_ratio": 1.0
    },
    {
        "title": "Language Learning startup partner?",
        "author": "asm-us",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ir4yf/language_learning_startup_partner/",
        "text": "Hi everybody,  \nIt was challenging for me to study English. It took me a very long time to be able to start talking in English. I am now working on an idea to better the language learning process, especially for people who already are intermediate level at it. If you would like to join me to discuss my ideas and maybe partner with me, please dm me!  \nYour input will be appreciated. I will probably ask for a video call then!",
        "created_utc": 1674413884,
        "upvote_ratio": 1.0
    },
    {
        "title": "Risks and benefits of beginners practicing conversation?",
        "author": "Lysenko",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ir4v7/risks_and_benefits_of_beginners_practicing/",
        "text": "Output practice is widely considered necessary to become naturally proficient with speaking and writing rapidly.  A common circumstance is to speak with a tutor or native language exchange partner who can offer corrections. However, another common circumstance, encountered in the real world in online chat channels or in classes, is conversation practice that is conducted by beginners or intermediate speakers talking with each other.\n\nOn the one hand, these activities force learners to make an effort to communicate, and there are those (like Benny Lewis) who advocate doing these kinds of things very early.\n\nOn the other hand, I have recently heard the objection that learners speaking to each other with a high error rate, without someone else actively stopping and correcting the conversation, risks interfering with learning by exposing everyone to low quality input while they practice.\n\nI personally think this argument doesn’t hold much weight.  In such a practice situation, most learners will be so focused on trying their best to produce credible output that the modest amount of input from other learners won’t be too much of a problem, as long as they’re reading and listening to lots of high quality content otherwise, and engaging in other activities like tutoring or grammar study.\n\nFor context, I’m coming at this from the point of view of embracing an input-heavy approach with very modest explicit study of grammar that’s usually inspired by questions raised by the input.  The language I’m studying has grammar that is considered unusually tricky, and even many native speakers report that they do not feel fully comfortable with the language’s grammar as educated adults.  So, learners make a LOT of mistakes.\n\n(How this came up was that I joined a language Discord server and started chatting. Unfortunately, I tend to make a lot of grammatical errors, though I have a decent low-intermediate vocabulary and my writing is usually comprehensible, and the server owner, a more advanced learner, took it on him/herself to correct each mistake.  I privately requested that he/she stop correcting me, as I was just hoping to try to use what language I had without being interrupted, and after a long delay I was told that the moderators had discussed this, and decided that accepting correction was mandatory, as it “wouldn’t be fair to let [me] interfere with others’ learning by providing them bad input.” I allowed that they could run their server however they like, and left, but it was definitely a blow to my confidence.)\n\nThoughts?",
        "created_utc": 1674413876,
        "upvote_ratio": 1.0
    },
    {
        "title": "criticism of learning a language for the purpose of heritage/ reconnecting to roots",
        "author": "raignermontag",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iqzbb/criticism_of_learning_a_language_for_the_purpose/",
        "text": "I often heard of other Americans learning their language-of-choice for heritage reasons: they are Hispanic, or German, or Japanese, etc. by blood. It completely makes sense to me, never questioned it.\n\nRecently I've been building my family tree on [Ancestry.com](https://Ancestry.com) and the more I learn about my Italian family, the more I've built an urge to learn Italian so I can feel closer to them. So far, I felt I've done nothing wrong.\n\nThen I did some research into this and I discovered Italians (those born and bread in the motherland) think that the concept \"iTaliAn-aMeriCans\" want to reconnect with \"thEir LanGuAge\" is absolutely bonkers. The prevailing opinion, at least that which I can gather from the internet, is that any Italian born outside of Italy is **not Italian** (no asterisk, no nuance).  The idea of the hyphenated \"Italian-American\" is worth nothing more than an insult to real Italians. To them, we are American, act, look and think only American, and should stay in our territory and not scuff their good name.\n\nOn one hand, I do understand where they're coming from---- yes, I am American and I am not Italian(-born), and I do think I should be very careful with my language. But the idea that I should completely scrub any Italian identity from myself seems extreme. Completely disregard my Italian blood because that's a nationalist idea? Okay.... fine, I can play that game. But I still have an Italian name. I still have my father's and grandfather's face. I look Italian. I still grew up with Italian-speaking relatives. My family will always have come from Naples, ITALY.\n\nWhat am I \"supposed\" to do? Learn Italian completely as a foreigner, and when thinking to myself why I'm doing it, say it's because Italy is awesome and completely disgregard that, sorry, I'm gonna say it, that I have Italian roots?\n\nAn honest question: If a Japanese person was born in Italy and spoke and acted only Italian (with memories of Japanese family when they came from Hiroshima), would they be you're average Italian guy, and only a racist would mention that he's.... dun dun dun... JAPANESE?",
        "created_utc": 1674413483,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it really that bad to have a strong accent?",
        "author": "Head-Piglet8536",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iqfo6/is_it_really_that_bad_to_have_a_strong_accent/",
        "text": "As long as your easy understandable, is it a problem to have a strong accent? (and you pronounce some tones wrong)",
        "created_utc": 1674412125,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need a partner for learning bulagrian. Is anyone wants to join?",
        "author": "prashantjdrew",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iq6ar/need_a_partner_for_learning_bulagrian_is_anyone/",
        "text": "",
        "created_utc": 1674411465,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for proofreaders for a Language Journal - hope this it allowed!",
        "author": "languageloungestore",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iq65x/looking_for_proofreaders_for_a_language_journal/",
        "text": "[removed]",
        "created_utc": 1674411455,
        "upvote_ratio": 1.0
    },
    {
        "title": "It Pays Off",
        "author": "eatmoreicecream",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iq2fe/it_pays_off/",
        "text": "Over the last 7 years I’ve been studying Spanish. And since 2020 I’ve tried to be hardcore about it and really pack in lots of exposure to the language throughout the day. I’ve even logged all my hours using Toggle. In 2020 I got about 2200 hours total of reading/listening/watching/speaking/anki in. I put similar hours in during 2021 and 2022.  \n\nAnd what’s awesome is that all that time with the language has really paid off. This semester, for example, two new students from El Salvador and Ecuador were added to my Economics class. Both of them are extremely limited in their English. But that’s just fine, I’ve just switched to teaching it bilingually. I frequently switch between English and Spanish as I teach, and the students will often answer my questions in Spanish, and I’ll translate for the rest of the class to understand. Those two students know I’m not a native speaker, and while I’ve listened to a lot of Spanish podcasts about Economics, I’ll occasionally ask them for feedback about whether I said something correctly and sometimes they’ll ask me how to say something in English. It’s a nice dynamic where everyone feels comfortable making mistakes.  \n\nEven this morning was a win. I took my car in to get the windows tinted. The guy who ran the shop was struggling explaining things in English, so I asked if he wanted to speak in Spanish. He looked incredibly relieved and we worked out the details of the job in Spanish with both parties feeling comfortable.  \n\nI’m not saying I’ve mastered the language, or I don’t have room to improve, or that I don’t still occasionally make stupid little mistakes or run into words/phrases that I’m not sure how to express in Spanish, but I do know that overall exposing myself to the language every day, looking for the gaps in my comprehension/speaking and working to fix them, has made me a much more confident Spanish speaker.",
        "created_utc": 1674411192,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it worth to make Anki decks by own?",
        "author": "Head-Piglet8536",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iptm3/is_it_worth_to_make_anki_decks_by_own/",
        "text": "I am not sure about it. Actually I need new Spanish Anki decks which fit to my need. But it takes a lot of afford to make Anki decks und I don’t know if it’s more worth just download them. Even though they are sometimes not that good.",
        "created_utc": 1674410593,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m studying abroad in Switzerland, what language do I learn?!",
        "author": "Even_Disk_2751",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ip4s1/im_studying_abroad_in_switzerland_what_language/",
        "text": "The map of spoken languages in Switzerland is intimidating, as they speak mostly German, French, and Italian. Which one should I learn?",
        "created_utc": 1674408871,
        "upvote_ratio": 1.0
    },
    {
        "title": "Benefits of word counting?",
        "author": "seungles",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ip3zs/benefits_of_word_counting/",
        "text": "I want to know if there's actually a benefit of tracking your word counts and how y'all do it. I'm learning russian by sentence mining and isn't too easy to track by it as i use phrases for learning, not words.",
        "created_utc": 1674408814,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm learning German through insults and memes and it's going great",
        "author": "Samk9632",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iovf6/im_learning_german_through_insults_and_memes_and/",
        "text": "",
        "created_utc": 1674408213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Very short linguistics survey",
        "author": "Beneficial_Entry_835",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ioqux/very_short_linguistics_survey/",
        "text": "Hi everyone!\n\nMe and my friend are conducting a survey for our sociolinguistics class. We would really appreciate you taking the time to do it. It is for native Dutch or native English speakers.\n\nHere is the link: [https://uva.fra1.qualtrics.com/jfe/form/SV\\_erGINMPASAL4RLM](https://uva.fra1.qualtrics.com/jfe/form/SV_erGINMPASAL4RLM)\n\nThank you a lot &lt;33",
        "created_utc": 1674407900,
        "upvote_ratio": 1.0
    },
    {
        "title": "Raising bilingual kids in language I learned.",
        "author": "dexterthehexer",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iod56/raising_bilingual_kids_in_language_i_learned/",
        "text": "Hello all. I have a while before I have kids; however, I have a question for all of you as I have been pondering it for a while. I am an active language learner, currently have 3 under my belt and I will continue to improve on them :) I do not have any familial connections to any of these languages, as I grew up in a monolingual american household. I thought that it would be a shame to put all this time into these languages and not pass at least one onto my kids. Now... the problem is that I am not C2/native fluent in any of them (I'm looking at all you crazy people out there! keep up the good work) . I am probably high B2/ low C1 at best. For example, I watch all my tv/documentaries in my best language. Now I do have 5-7 years before my first hell-raiser, so I will have time to improve. I would try to take my kids to some sort of cultural center so they can speak with native speakers and attempt to enroll them in a bilingual school.\n\nI would really like to raise my kids bilingual, is it possible? Have any of you done it? Thoughts?",
        "created_utc": 1674406955,
        "upvote_ratio": 1.0
    },
    {
        "title": "How's my study routine &amp; how long can I expect to take from A2 to B1?",
        "author": "GreenTang",
        "url": "https://www.reddit.com/r/languagelearning/comments/10inrtz/hows_my_study_routine_how_long_can_i_expect_to/",
        "text": "Yesterday I did:\n\n- 1 hour of Mango Languages\n- 45 minutes of Dreaming Spanish\n- 30 minutes of Anki\n- 30 minutes of Language Transfer\n\nWould you tinker with that routine at all? This is reasonably typical for me, but I've rounded the numbers down a little bit because I'm on holidays.\n\nI'm currently in the middle of A2. How long would it normally take to get to B1? In some conversations with natives (or, my Colombian girlfriend), I feel like I'm on the precipice of having a conversation without having to think too hard to reach for Google Translate (for individual words, not whole phrases). Othertimes I feel like I sound like \"hola... Me... Llamo.... Anonymous....\".",
        "created_utc": 1674405447,
        "upvote_ratio": 1.0
    },
    {
        "title": "are you supposed to Google translate textbooks?",
        "author": "anxietyistoomuch0",
        "url": "https://www.reddit.com/r/languagelearning/comments/10imonx/are_you_supposed_to_google_translate_textbooks/",
        "text": "[removed]",
        "created_utc": 1674402702,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you use Discord?",
        "author": "heyshopful",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iltpl/do_you_use_discord/",
        "text": "Curious if the majority of people here use Discord for language learning or just in general.\n\n[View Poll](https://www.reddit.com/poll/10iltpl)",
        "created_utc": 1674400378,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking advice for beginners learning French - any tips or resources to help me get started? (Spanish, Catalan, and English background)",
        "author": "thenotoriousdoblea",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ikdbh/seeking_advice_for_beginners_learning_french_any/",
        "text": "I want to learn how to communicate (speak and read at a decent level) in French. I am getting married to a woman whose primary language is French, and her whole family speaks it as well. I want to learn the language in the medium to long term with these goals in mind. How much time should I dedicate to learning French per day and what tools would be the best for this goal? Additionally, I speak Spanish and Catalan fluently as I am from Barcelona and have a good level of English. What would you recommend for me?",
        "created_utc": 1674396231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interesting approach to vocabulary learning",
        "author": "midmodmood",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ikbwb/interesting_approach_to_vocabulary_learning/",
        "text": "Hi all, \n\nI am currently learning Spanish and I want to have your opinion on what I believe to be a new method of vocabulary learning. \n\nSince I already speak English, German and French, I want to drastically fasten my vocabulary learning in Spanish by ONLY learning words that sound very similar to their counterpart in on of my three other languages. \n\nThis means I wont be able to understand most input perfectly, but at least I can get a big portion of vocabulary done in a few weeks time.\n\nThink its worth a try?",
        "created_utc": 1674396114,
        "upvote_ratio": 1.0
    },
    {
        "title": "We know about false friends, but what are some words with absolutely contrasting meanings in different languages?",
        "author": "LunarLeopard67",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ik2re/we_know_about_false_friends_but_what_are_some/",
        "text": "E.g. 'Je' means 'I' in French, but 'you' in Dutch\n\n'Jeden' means 'every' in German, but 'one' in Polish and Slovak\n\n'Tak' means 'yes' in Polish, but 'no' in Indonesian\n\n'Mama' is how you address your mother in many languages, but in Georgian, it's how you address your father (yes, I swear that's true!)",
        "created_utc": 1674395380,
        "upvote_ratio": 0.99
    },
    {
        "title": "Countries language programs",
        "author": "xerraina",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ijzr4/countries_language_programs/",
        "text": "",
        "created_utc": 1674395109,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips for my first job interview in English?",
        "author": "LegalJunkie_LJ",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ijwg4/any_tips_for_my_first_job_interview_in_english/",
        "text": "Hi and apologies if this doesn't fit the sub. I have a job interview scheduled for Tuesday and I'm a bit nervous as this is the first interview I will ever have with a native English speaker.\n\nI usually have zero issues with interviews in my native language, however the last time I spoke with a native English speaker was 10+ years ago and I'm worried I'll sound funny to them.\n\nI don't know if I should try to imitate an accent, I don't even know how to sharpen my speaking/hearing (I thought of trying omegle), or if I should have a speech prepared beforehand (I don't ever do this but right now I'm a bit lost).\n\nAny help would be appreciated!",
        "created_utc": 1674394812,
        "upvote_ratio": 1.0
    },
    {
        "title": "C1/C2 speakers of any language, how much does it bug you when you make a mistake in your target language? And does it annoy you when you don't happen to know something?",
        "author": "No_Cloud_8727",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ijt0b/c1c2_speakers_of_any_language_how_much_does_it/",
        "text": "Hello everyone, I am a 20-year-old native Hungarian speaker and I have a C2 both in English and German, and yet I still botch up things at times. This really grinds my gears despite being aware of the fact that even native speakers are fallible. I feel like a mistake is enough to negate my overall fluency in my target languages. The same goes for words that I am not familiar with. I have an extensive vocabulary in both languages (but the one in English is much bigger) and whenever I come across a new word, I feel genuinely stupid. I know that even if I lived forever, I still couldn't learn all the words in the English language or in any other language for that matter. Plus, the fact that native speakers don't know every single word, idiom, phrase, and what have you either is known to me too. Yet, words, idioms, phrases that are unknown to me just get a rise out of me. The main reason for that is that I always extensively search for new words, idioms, etc. when learning a language and after I have reached my desired level of fluency, I just feel like I wasn't hardworking enough when encountering a new expression or word. In a nutshell, I feel like I am the laziest person on the planet.\n\n&amp;#x200B;\n\nDoes anyone else feel the same way about making mistakes and finding new words despite already having a high level?",
        "created_utc": 1674394508,
        "upvote_ratio": 1.0
    },
    {
        "title": "iOS Thesaurus dictionary",
        "author": "The_Rizzard",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ijaim/ios_thesaurus_dictionary/",
        "text": "Did you know you can enable the Thesaurus dictionaries on your apple device for easy English synonyms? \n\nGeneral/dictionary\n\n* You can choose American or English(UK).\n\nThen select a word and got lookup. \n\nI find better then the standard dictionary since it provides highly technical definitions sometimes.",
        "created_utc": 1674392880,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learn English Through Story | The Last Leaf | English Learning Ideas",
        "author": "EnglishLearningIdeas",
        "url": "https://youtube.com/watch?v=2sEFGwdIhAE&amp;feature=share",
        "text": "",
        "created_utc": 1674391754,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the best way to learn a language?",
        "author": "Kokoska998",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iiugn/whats_the_best_way_to_learn_a_language/",
        "text": "I am learning german at the moment, but i still cant find a way to efficiently learn the language, i have a teacher, but that itself isn't going to be enough. \nHow did you learn Ianguages? Is there any way i could learn fast &amp; efficient at the same time? Thanks ;)",
        "created_utc": 1674391400,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips/Methods for learning two (or more) languages at the same time?",
        "author": "iishadowsii_",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iiqqf/tipsmethods_for_learning_two_or_more_languages_at/",
        "text": "I am an English second language tutor who enjoys me job very much. I've been teaching students of all ages how to speak or simply improve their existing English language skills for over a year now. However in recent times I've found it more and more frustrating when I am unable to convey a lesson to a student. The bulk of my students come from one of Spain, Italy or France, I've been able to pick up a couple of words and phrases over the year I've taught but I would really like to be able to switch between languages to make my points clearer where students are stuck. I've seen and heard of people learning two languages at once in the past, I already have some fairly solid foundational French knowledge is it realistic to pursue this goal? If so how would I go about it.",
        "created_utc": 1674391020,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it a bad idea to have private language lessons as a complete beginner?",
        "author": "LukasA20",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iict6/is_it_a_bad_idea_to_have_private_language_lessons/",
        "text": "So I currently want to learn german, I basically know nothing besides some basic sentences/words. I have self-studied for one week only, this consists of watching German media, listening to music, YouTube, Podcasts, Apps, Flashcards etc. I think I have a good foundation for starting out. \n\nBut the thing is, I would love to complement this with private lessons. Mainly for giving structure, having someone to practise German with as well as learning the correct pronunciations from the start. \n\nI was discussing with my brother and he argues it's a total waste to do private lessons until I am at a basic level like A1-A2, otherwise it's just a waste of money. Since I won't be able to talk to the teacher in the targeted language he argues it's a waste as I will only learn things that I could easily learn by self-studying. \n\nNow I would like to ask you guys. Is private teacher not worth it when just starting off as a complete beginner? What is your experience with private teachers? Wat should I expect? \n\nAppreciate all answers in advance, thanks!",
        "created_utc": 1674389657,
        "upvote_ratio": 1.0
    },
    {
        "title": "The unanswered question: Should you study grammar when learning a language?",
        "author": "MrHenriquez",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iibde/the_unanswered_question_should_you_study_grammar/",
        "text": "I wonder what you think about this topic. I made a video and article ([link](https://youtu.be/AgJShScTfik)) but I want to know some real-world experiences besides mine on grammar teaching and grammar.\n\nShould you study grammar when you're trying to learn English?",
        "created_utc": 1674389505,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm not sure which lingoda level I should be on...",
        "author": "iamamazing-",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iiayp/im_not_sure_which_lingoda_level_i_should_be_on/",
        "text": "I started the sprint with A1.1 and recently have been doing A1.2 mostly. However sometimes I find it too easy. The lessons are ok however I struggle sometimes with the excersises afterwards. \n\nIn lessons I seem to be a similar level to others and also attended an A2.1 class. I did the placement test and got A1.2. any ideas on how to know the level I should take and also if I should finish the whole block before moving on?",
        "created_utc": 1674389465,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any phrases from your language that makes no sense in others?",
        "author": "shizanuti_arm",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iia5j/any_phrases_from_your_language_that_makes_no/",
        "text": "For example - In Armenia we can say \"I'm gonna die on your body\" or \"I'll eat your face\" in order to say \"I really like you\"",
        "created_utc": 1674389380,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm looking for a better option than Quizlet to learn new words",
        "author": "Yupno25",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ii009/im_looking_for_a_better_option_than_quizlet_to/",
        "text": "I really liked the Quizlet learn function but now it’s premium and I can’t seem to find a similar function anywhere else. I also want to be able to input the words I learn myself (so no Duolingo or the like)",
        "created_utc": 1674388372,
        "upvote_ratio": 1.0
    },
    {
        "title": "Repeated question in c1 speaking exam…",
        "author": "Moonoverahill",
        "url": "https://www.reddit.com/r/languagelearning/comments/10iho1p/repeated_question_in_c1_speaking_exam/",
        "text": "[removed]",
        "created_utc": 1674387123,
        "upvote_ratio": 1.0
    },
    {
        "title": "Movies for A1 level",
        "author": "misha_sun",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ihi8m/movies_for_a1_level/",
        "text": "Please advise movies for the most basic level of language proficiency. I want something with the most simple vocabulary.",
        "created_utc": 1674386523,
        "upvote_ratio": 1.0
    },
    {
        "title": "learning german through chatting, anyone down to help me?",
        "author": "poophead29",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ih88j/learning_german_through_chatting_anyone_down_to/",
        "text": "",
        "created_utc": 1674385453,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you learn a language?",
        "author": "Head-Piglet8536",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ih5ve/how_do_you_learn_a_language/",
        "text": "I am a Spanish learner (A2-B1) and I use following tools:\n\nKwiziq\nAnki\nDuolingo\n\nWhat about you?",
        "created_utc": 1674385219,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice: Taking two different language exams 1 hour apart?",
        "author": "vanillle",
        "url": "https://www.reddit.com/r/languagelearning/comments/10igzco/advice_taking_two_different_language_exams_1_hour/",
        "text": "In March, I have two exams planned in a single day — French written exam (beginner to intermediate) and Dutch oral exam (fluent; native tongue). They are spaced out 1 hour from each other, Dutch following *after* French.\n\nMy one concern with this arrangement is; I'm afraid my brain will go haywire, and I'll end up unleashing my French demons during the Dutch oral exam.\n\nDoes anyone have a similar experience? If so, would you say it's a valid concern or likely do-able? (I have the option to adjust the planning, but due to lack of time and transportation resources, this arrangement would be ideal for me.) Please advise.",
        "created_utc": 1674384570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do you add \"da\" after numbers? For example \"happyaku rokuju nana da\" ? I don't understand (Japanese)",
        "author": "ElijaKrz",
        "url": "https://www.reddit.com/r/languagelearning/comments/10igdlq/why_do_you_add_da_after_numbers_for_example/",
        "text": "",
        "created_utc": 1674382247,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mam diaclect?",
        "author": "ButteringButters",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ifab4/mam_diaclect/",
        "text": "I wish to learn the Mam form of the Mayan language due to personal reasons. Also, coincidentally due to personal reasons, I can't go down to México or Guatemala to speak with natives at the moment. I can't find many resources online for Mam (more specifically Central and Western) however I've heard that Tektitek is a great substitute and is mutually intelligible by natives.  \n\n\nDue to the geopolitical nature of the treatment natives and their culture I'd imagine there would be limited resources to even start such a journey into the language, however I know that there is enough to get me to A1 at least.  \n\n\nIf it helps I'm a Native English speaker and a Heritage Spanish Speaker (roughly B1), so anything in either of those languages is appreciated.",
        "created_utc": 1674377826,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you guys think the answers are? I think 1. D and 2. B",
        "author": "boxxeddinn",
        "url": "https://i.redd.it/nladmve1olda1.jpg",
        "text": "",
        "created_utc": 1674377525,
        "upvote_ratio": 1.0
    },
    {
        "title": "Had to repeat question twice during speaking exam…",
        "author": "Desert_Moon_",
        "url": "https://www.reddit.com/r/languagelearning/comments/10if109/had_to_repeat_question_twice_during_speaking_exam/",
        "text": "[removed]",
        "created_utc": 1674376723,
        "upvote_ratio": 0.99
    },
    {
        "title": "Had to repeat question twice during speaking exam…",
        "author": "Desert_Moon_",
        "url": "https://www.reddit.com/r/languagelearning/comments/10if108/had_to_repeat_question_twice_during_speaking_exam/",
        "text": "[removed]",
        "created_utc": 1674376723,
        "upvote_ratio": 1.0
    },
    {
        "title": "what's up with all the AI posts lately?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1674376524,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is anybody here fluent or native in Uzbek?",
        "author": "NerdyNinja-Education",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ie0s2/is_anybody_here_fluent_or_native_in_uzbek/",
        "text": "Basically the title, I want to learn Uzbek!",
        "created_utc": 1674372756,
        "upvote_ratio": 1.0
    },
    {
        "title": "App to learn language by speaking only(top to down) ?",
        "author": "WholeTraditional6778",
        "url": "https://www.reddit.com/r/languagelearning/comments/10idvf5/app_to_learn_language_by_speaking_onlytop_to_down/",
        "text": "[removed]",
        "created_utc": 1674372192,
        "upvote_ratio": 1.0
    },
    {
        "title": "moke practice for scam",
        "author": "scamastra",
        "url": "https://youtu.be/nOxp1_227mA",
        "text": "",
        "created_utc": 1674371456,
        "upvote_ratio": 1.0
    },
    {
        "title": "Native English Speaker looking to teach English to Spanish Speakers through website - Hablante nativo de Inglés que quiere enseñar Inglés a hablantes de Español por el web.",
        "author": "hennessytitties",
        "url": "https://www.reddit.com/r/languagelearning/comments/10idjhh/native_english_speaker_looking_to_teach_english/",
        "text": "I am an american native English speaker interested in teaching and tutoring speakers of Spanish to further improve their english. I have been teaching myself languages for my whole life and I am able to deeply convey the rules and culture surrounding the english language (American). Does anyone know any good language tutoring websites or programs where I can tutor people through online sessions through Zoom, Skype etc.? Any help would be deeply appreciated!\n\nSoy un hablante nativo de inglés estadounidense interesado en enseñar y dar tutoría a hablantes de español para mejorar su inglés. He estado aprendiendo idiomas por mi cuenta por toda mi vida y soy capaz de transmitir profundamente las reglas y la cultura que rodea el idioma inglés (americano). ¿Alguien conoce algún buen sitio web o programa de tutoría de idiomas donde pueda enseñar a las personas a través de sesiones en línea a través de Zoom, Skype, etc.? ¡Toda ayuda sería muy apreciada!",
        "created_utc": 1674370887,
        "upvote_ratio": 1.0
    },
    {
        "title": "Poetic licence and language learning",
        "author": "Hemeralopic",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ichav/poetic_licence_and_language_learning/",
        "text": "Hi! French (native), English (B2/C1, but I feel a linguistic insecurity), Italian (A2/B1), notions of Esperanto, Spanish, and Latin. Maybe I will learn Yiddish. \n\nI have a question/reflexion about language learning and didactics. Can poetry mislead learners? There would be two reasons of that: diachrony (if the poem is old) and poetic licence (to make a long story short, I don't talk in daily life like in a poem). Even though I think that missing poetry is a shame for cultural reasons, it can teach \"false\" things (correct syntax for a poetic context but not for the standard language). Even if I *kno*w that people don't talk like a poem, I can memorize some \"strange\" syntax when I learn and being misleaded.\n\nMy first approach with Italian was the opera because I am a singer (not professional). \n\nAnd as an informal French teacher, I have a choice to do: can I present some popular songs in a culture lesson (by popular I mean folkloric) even if the text is not standard? Of course I will say the standard way to say the thing but is there a risk that the learners memorize a form which is never used nowadays (I am thinking about \"j'avions\", in the countryside of Normandy and Brittany for example, some centuries ago)? \n\nI discussed this topic with a polyglot friend: he said that a child hears songs when they learns the language (but  fisrt and second language acquisition are not the same thing). He also told me that in some culture there is less distance between poetry and daily language than in others. (In French I think that there is a true difference). \n\nSo : how do you regard poetic licence in language learning? Is it a trap or way to learn thanks to culture (and a poem or a song can be remembered easier)?",
        "created_utc": 1674366991,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to learn french?",
        "author": "averyksol",
        "url": "https://www.reddit.com/r/languagelearning/comments/10icbz2/how_to_learn_french/",
        "text": "[removed]",
        "created_utc": 1674366437,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do we call the dialect of…high(?) English?",
        "author": "dredfy",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ibvkj/what_do_we_call_the_dialect_ofhigh_english/",
        "text": "Ok so we’ve got AAVE, we’ve got like common english(does this dialect have a name too!?) which is what I’m typing in now. We’ve got Old English which has fallen out of use and will probably be incomprehensible soon to future generations. But when I speak AAVE, people yell at me and tell me that I must “speak white” by using longer words, enunciate everything, and to say the whole word. It’s not natural to speak like that. I am uncomfortable speaking like that. It comes off as pretentious and elitist. But…I was wondering…is this it’s own specific dialect? If so, what is it called?",
        "created_utc": 1674364813,
        "upvote_ratio": 1.0
    },
    {
        "title": "trying to learn a new language, installed anki for starters now I'm unable to scroll down to change the UI Size i accidentally set.🥲",
        "author": "Murky-Ruin2014",
        "url": "https://i.redd.it/lu6qlqyhkkda1.png",
        "text": "",
        "created_utc": 1674364230,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does learning math differ from learning second foreign languages (L2)?",
        "author": "3cana",
        "url": "https://www.reddit.com/r/languagelearning/comments/10i9dvo/how_does_learning_math_differ_from_learning/",
        "text": "#### [Peer-reviewed publications](https://en.wikipedia.org/wiki/Language_of_mathematics) analogize learning math to learning a L2. But what are the DisAnalogies and CounterArguments?  How can you distinguish learning math from learning L2? \n\n\nLuciana Oliveira, Marta Civil. *Teaching Mathematics to English Language Learners* (2020), p. 75\n\n&gt;[Algebra, first and foremost, is another foreign language and, as such, has to be understood, transcoded, and treated as one.](https://www.google.com/books/edition/Teaching_Mathematics_to_English_Language/kTkCEAAAQBAJ?hl=en&amp;gbpv=1&amp;dq=math+is+a+foreign+language&amp;pg=PA75&amp;printsec=frontcover)\n\nLinda Pound, Trisha Lee. *Teaching Mathematics Creatively* (2021). [No page number listed.](https://www.google.com/books/edition/Teaching_Mathematics_Creatively/R3g-EAAAQBAJ?hl=en&amp;gbpv=1&amp;dq=mathematics+%22foreign+language%22&amp;pg=PT62&amp;printsec=frontcover)\n\n&gt;• Learning to talk mathematically has been likened to learning a foreign language (Worthington and Carruthers 2006): Lee (2006:2) confirms this analogy: \n&gt;\n&gt;For many pupils learning to use language to express mathematical ideas will be similar to learning a foreign language. Unless the pupils know about the way that language is used in \nmathematics they may think that they do not understand a certain concept when what they cannot do is express the idea in language.\n\nPaul D. Nolting, *Winning at Math*, [p. 24](https://www.google.com/books/edition/Winning_at_Math/ACem4L9U1L4C?hl=en&amp;gbpv=1&amp;dq=math+is+a+foreign+language&amp;pg=PA24&amp;printsec=frontcover)  includes a cartoon referring to Spanish, French, Latin, Chinese! [Nolting holds a Ph.D. degree in Education in Curriculum Instruction from the University of South Florida. His Ph.D. dissertation was \"The Effects of Counseling and Study Skills Training on Mathematics Academic Achievement.\"](https://www.academicsuccessblog.com/about.html)\n\n&gt;### Math as a Foreign Language\n&gt;\n&gt;&amp;nbsp;  &amp;nbsp;  &amp;nbsp;  Another way to understand studying math is to consider it as a foreign language. Looking at math as a foreign language can improve your study procedures. Learning how to speak math as a language is the key to math success. Currently, most universities consider computer and statistics (a form of math) courses as foreign language courses. Some universities have now gone so far as to actually classify math as foreign language. In the case of a foreign language, if you \ndo not practice the language, what happens? You forget it. If you do not practice math, what happens? You are likely to forget it, too. Students who excel in a foreign language must practice it every day. The same study skills apply to math, because it is considered a foreign language. \n&amp;nbsp; &amp;nbsp;  &amp;nbsp;   Like a foreign language, math has unfamiliar vocabulary words or terms, which must be put in sentences called expressions or equations. Understanding and solving a math equation is similar to speaking and understanding a sentence in a foreign language. Listen to yourself or others as they explain a math equation. They are taking mathematical symbols and translating them into words and sentences. \n\n\n![]( https://i.stack.imgur.com/UX6Zb.jpg)\n\nIn 1987, [Joseph Newmark](https://www.cs.bham.ac.uk/~mmk/Teaching/MathLogic/index.html) and Frances Lake published [*Mathematics as a Second Language (4th ed)*.](https://catalogue.nla.gov.au/Record/2631519) [Newmark received his BS and MS degrees in mathematics from Brooklyn College, and his PhD in Operations Research from New York University.](http://webcache.googleusercontent.com/search?q=cache:JYtf9cfWUKUJ:https://www.math.csi.cuny.edu/Faculty/Newmark_/&amp;hl=en&amp;strip=0&amp;vwsrc=1)\n\n## https://languagelearning.stackexchange.com/q/5894",
        "created_utc": 1674356614,
        "upvote_ratio": 1.0
    },
    {
        "title": "i would like to found some girl for chat and improve my english communication skills. some one here?",
        "author": "theclimbing-",
        "url": "https://www.reddit.com/r/languagelearning/comments/10i94zz/i_would_like_to_found_some_girl_for_chat_and/",
        "text": "",
        "created_utc": 1674355865,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to raise trilingual kids?",
        "author": "halpert_pp",
        "url": "https://www.reddit.com/r/languagelearning/comments/10i8265/how_to_raise_trilingual_kids/",
        "text": "My partner and I have been planning about having children soon. Because we come from different countries, both of us are bilingual. He speaks English and Dutch and I speak English and Filipino. As much as possible, despite living in Europe, I still want my children to have a connection with my culture at least through language. How can I raise my children to become trilingual? Thank you very much !",
        "created_utc": 1674352630,
        "upvote_ratio": 1.0
    },
    {
        "title": "Practicing German with the AI version of Otto von Bismarck! App is “Historical Figures” they can answer anything.",
        "author": "rMKuRizMa",
        "url": "https://www.reddit.com/gallery/10i7u87",
        "text": "",
        "created_utc": 1674351964,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just finished my 2022 language goals",
        "author": "FarProduct6522",
        "url": "https://www.reddit.com/r/languagelearning/comments/10i6pfj/just_finished_my_2022_language_goals/",
        "text": "I finished my 2022 language goals this morning.  I completed the French 1 and French 2 courses (normal) on Lingodeer.  It’s almost a month past the original timeline, but I was ahead of the timeline in other ways. I had completed Saison 1-3 of Alice Ayel’s youtube series French the Natural Way prior to the new year.  My original goal was season 1-4 but I found the InnerFrench series to be more productive at my level and switched series.  I also underestimated the number of pronunciation video’s, I needed to watch.  French writing is very different from its speech, and I have had/still have trouble associating the writing with the appropriate sounds.  \n\nMy heavy emphasis on input and the format of LingoDeer, means that I can recognize grammar patterns and understand them fairly well, but struggle with reproducing them.  My comprehension feels at a lower intermediate level but my speech and writing skills are lagging.  \n\nOverall, I feel super accomplished to have finished what I have, since I just started learning French in July.  Right now, I’m halfway through reading the first Harry Potter book in French.  I have the La Grammaire des Premiers Temps A1-A2 and B1-B2 books on my desk to revisit grammar with a stronger emphasis on production.  I, also, plan to book some italki classes soon so that I can start practicing speaking in a meaningful way.",
        "created_utc": 1674348691,
        "upvote_ratio": 1.0
    },
    {
        "title": "Language Institutes in Phoenix Arizona?",
        "author": "Darthbeaner",
        "url": "https://www.reddit.com/r/languagelearning/comments/10i57e1/language_institutes_in_phoenix_arizona/",
        "text": "Hey all,\n\nI'm a person who as much as I value independent and free learning, the most success I have had is through classes either online and in person. \n\nI just moved to Phoenix AZ and I'm wondering if any body here knows good/accredited institutes in Phoenix?\n\nI am specifically looking for Spanish classes and Interlingua is a good fit but 6-800 dollar classes is a hard sell.\n\nAny help would be great thank you!",
        "created_utc": 1674344487,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is considered “business level Japanese”?",
        "author": "ArtistanBread",
        "url": "https://www.reddit.com/r/languagelearning/comments/10i4nkt/what_is_considered_business_level_japanese/",
        "text": "",
        "created_utc": 1674342975,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much languages and what languages would I have to learn to make 150k+ as a polyglot?",
        "author": "StackYourFunds2023",
        "url": "https://www.reddit.com/r/languagelearning/comments/10i48pz/how_much_languages_and_what_languages_would_i/",
        "text": "[removed]",
        "created_utc": 1674341902,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for feedback about my YouTube Shorts videos",
        "author": "Ok_Acanthisitta8387",
        "url": "https://www.reddit.com/r/languagelearning/comments/10i48cb/looking_for_feedback_about_my_youtube_shorts/",
        "text": "Greetings,\n\nI recently joined this group and I was wondering if anyone can take a look at the format of my and give me their honest opinion. The YouTube channel is about learning English phrases from various movie contexts. Please let me know if you have any questions. I’m adding more and more short videos everyday. Is this something you might find interesting?\n\nHere is the link to my channel: https://youtube.com/@films4english469\n\nThank you",
        "created_utc": 1674341873,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi. I'm a colombian med student who is interested in learn English, because I want to improve in my career. Have a nice day :).",
        "author": "jp_valon",
        "url": "https://www.reddit.com/r/languagelearning/comments/10i3fbp/hi_im_a_colombian_med_student_who_is_interested/",
        "text": "",
        "created_utc": 1674339726,
        "upvote_ratio": 1.0
    },
    {
        "title": "frustrated with lack of progress",
        "author": "FrenchPro",
        "url": "https://www.reddit.com/r/languagelearning/comments/10i1jpx/frustrated_with_lack_of_progress/",
        "text": "How can I effectively study french and become c1 in 3 years without having to move to a french speaking country?\n\nI started duolingo last month, completed 13 units so far, and switched to grammar progressive a0/a1 this week and did 5 lessons as well 1 lesson of assimil and im doing anki to learn the top 1000 words spoken in french but it feels like im not much different from where I started. I can't even understand basic podcasts after listening to them twice (coffee break french (10 episodes) and inner french (1 episode))\n\nWhat do I need to do to move forward? Am I missing any resources? I'm in my early 20s, I'm I just too old to learn a language?",
        "created_utc": 1674334875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I the only one who finds learning languages that are different from my native language easier than languages that are similar?",
        "author": "leahpayton22",
        "url": "https://www.reddit.com/r/languagelearning/comments/10i0dqb/am_i_the_only_one_who_finds_learning_languages/",
        "text": "I don’t know why that is because it’s apparently supposed to be easier to learn languages that are somewhat similar to your native language. At least that’s what I learned in college and heard in general. Like most French speakers say it’s easy for them to learn Spanish and vice versa. \n\nMy native language is Slovak and it was quite easy for me to learn English, French and German. However when I tried learning Polish (which is another Slavic language), it was super difficult as some words were the same but had a different meaning and it sounded confusing. I couldn’t *not* mix in Slovak even after a year of learning it when I never had a problem with mixing Slovak into English, French or German. So I gave up on learning Polish a few years ago and recently I tried learning Ukrainian but I had the same problem. I don’t get it. \n\nSo I was wondering, does anyone else have this problem?",
        "created_utc": 1674331933,
        "upvote_ratio": 1.0
    },
    {
        "title": "Generating reading material in my target language with chatGPT",
        "author": "drumorgan",
        "url": "https://www.reddit.com/r/languagelearning/comments/10i0de2/generating_reading_material_in_my_target_language/",
        "text": "1. type a prompt into your translator - \"Write a short blogpost about best places to eat in Rio de Janeiro\"\n2. translate into your target language - \"Escreva um pequeno post sobre os melhores lugares para comer no Rio de Janeiro\n3. Copy/paste that into chatGPT\n4. Enjoy reading in your target language",
        "created_utc": 1674331908,
        "upvote_ratio": 1.0
    },
    {
        "title": "Salvēte! Anyone want to have a conversation in Latin?",
        "author": "BillyMedicine",
        "url": "https://www.reddit.com/r/languagelearning/comments/10i0a6t/salvēte_anyone_want_to_have_a_conversation_in/",
        "text": "I am still a beginner,  though I have a fairly good grasp of cases and conjugating verbs. DM me if interested!",
        "created_utc": 1674331686,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having a hard time choosing",
        "author": "TulipsLeaves",
        "url": "https://www.reddit.com/r/languagelearning/comments/10i00iz/having_a_hard_time_choosing/",
        "text": "[removed]",
        "created_utc": 1674331023,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fat progress",
        "author": "Lemons005",
        "url": "https://www.reddit.com/r/languagelearning/comments/10hzt4b/fat_progress/",
        "text": "Just felt like sharing my progress ☺️. Recently I've started talking to natives on Tandem and writing a lot more in German (before I did maybe 20-40 minutes of writing per week, excluding the writing I do in my textbook which is a lot to be fair), and I have no clue how much I do now, but a lot more I guess.\n\nBecause I'm writing constantly, my writing I stg has improved a lot in an incredibly short space of time. For reference I'm about a low B1 and for a while I didn't really feel that B1 feeling ig (like people talk about consuming native content and it being more enjoyable) but honestly I feel like I'm getting there now. Writing feels a lot easier to do &amp; whilst I can't fully express everything I want to say, I have noticed writing does definitely feel more fluid and easier to do. For reference, maybe 1-2 weeks ago, writing 160-175 words took like 20-25 minutes but I wrote 174 words to my uncle today and it took me 15 minutes :D.\n\nAnd another thing that's made me really happy is I just did a voice message mostly in German for 18 minutes ☺️. This really fucking surprised me because this was maybe my second or third time speaking? And the other times were for like 2-5 minutes perhaps. So I just feel really good about that and surprised myself I can actually talk mostly in German for a whole 18 minutes! Sure, my sentences were ridiculously complex &amp; I was pretty much just talking about my day &amp; future plans, but still feel very happy with that &amp; boosted my confidence a lot (not just in terms of speaking but in general).\n\nListening &amp; reading though is pretty much the same atm. I'd say my reading has always been ok anyway so I'm fine with that (perhaps I do 30-90 minutes of reading a week in German, it varies quite a lot). And I've been slacking on my listening a lot because I've been talking to natives so much, as well as doing some shadowing and stuff, so I guess it's been harder to focus on my listening now. But I'm really trying to make listening a priority again but it's a struggle with all this German on my plate aha. I'm also trying to prioritise my textbook too but having two priorities is actually really hard soo :(\n\nAnyway, sorry this post is long but just wanted to share my progress :) I feel a lot more confident now and that I'm finally getting there :D",
        "created_utc": 1674330499,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you find Turkish with Istanbul dialect harmonious to listen? Which languages do you think it mostly sounds alike?",
        "author": "Local-Dance9923",
        "url": "https://www.reddit.com/r/languagelearning/comments/10hzj08/do_you_find_turkish_with_istanbul_dialect/",
        "text": "Here is a diction exercise as an example: https://youtu.be/e6LXit_q5uo\n\n[View Poll](https://www.reddit.com/poll/10hzj08)",
        "created_utc": 1674329788,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does this mean? (Japanese)",
        "author": "InteractionOk1635",
        "url": "https://i.redd.it/h4e9w083ghda1.jpg",
        "text": "",
        "created_utc": 1674326426,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which langauge I should learn from b/m languages?",
        "author": "Avogadro-A",
        "url": "https://www.reddit.com/r/languagelearning/comments/10hwa11/which_langauge_i_should_learn_from_bm_languages/",
        "text": "I have studied italian for 3 years and was good at speaking, writing, reading and listening. \n\nbut I haven't practised it for 7 years and know I need to learn a new language besides english. \n\nSo, I got 3 preferences:\n\n1. French \n2. German\n3. Italian \n4. Spanish\n\nSo any advice on which will be the best language to start with?",
        "created_utc": 1674321609,
        "upvote_ratio": 1.0
    },
    {
        "title": "[eng] I had been trying to improve my pronunciation for 4 months. Do you see any result?",
        "author": "AngelesMenaC",
        "url": "https://v.redd.it/qgn62qchxgda1",
        "text": "",
        "created_utc": 1674320220,
        "upvote_ratio": 1.0
    },
    {
        "title": "Preserving Endangered Languages: Understanding the Importance, Strategies, and Challenges of Saving our Linguistic Heritage",
        "author": "alixme",
        "url": "http://www.howsources.com/2023/01/Preserving%20Endangered%20Languages.html",
        "text": "",
        "created_utc": 1674318772,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else love having a foreign accent?",
        "author": "FietserInDeVS",
        "url": "https://www.reddit.com/r/languagelearning/comments/10hv3t0/does_anyone_else_love_having_a_foreign_accent/",
        "text": "I see a lot of comments from people who want to get rid of their foreign accent, does anyone else not want to do that? I want to be easily understood, but still foreign sounding. I always loved encountering people with foreign accents in my own country, it's fun talking to people from all over the world and it makes them interesting. Now I get to be the person with a foreign accent when speaking another language in another country. People often strike up conversations about where I'm from and that has lead to some very pleasant chats with people.",
        "created_utc": 1674318585,
        "upvote_ratio": 1.0
    },
    {
        "title": "Story of the Chinese 12 Zodiac Animals",
        "author": "hsinchiehliu",
        "url": "https://youtu.be/IU9UwVbAF6s",
        "text": "",
        "created_utc": 1674318186,
        "upvote_ratio": 1.0
    },
    {
        "title": "Story of Nian",
        "author": "hsinchiehliu",
        "url": "https://youtu.be/kc1dui_chsc",
        "text": "",
        "created_utc": 1674318051,
        "upvote_ratio": 1.0
    }
]