[
    {
        "title": "Apps/websites for learning English seriously?",
        "author": "SharDkx",
        "url": "https://www.reddit.com/r/languagelearning/comments/10m22a0/appswebsites_for_learning_english_seriously/",
        "text": "I am trying to find a good website or an app which would work well for my mom. She speaks a bit of English at a beginner level, and she obviously needs a lot more vocabulary and speaking practice. She has been using Duolingo for a while, which in my opinion is a bad idea, because it is too simple, not strict enough and the courses are fairly limited. From what i see, she hasn’t made much progress using it\n\nIdeally i need a website that could provide a wider vocabulary selection, vocabulary which could then be practiced in a variety of exercises. Different grammar rules and tenses not as important but would be welcome too. Speaking exercises are also needed (will convince her to watch videos and films in English as well x).\n\nThank you in advance for providing quality resources! If the website costs money, that is fine as well",
        "created_utc": 1674766073,
        "upvote_ratio": 1.0
    },
    {
        "title": "Assimil Using French - Discontinued?",
        "author": "MrDC89",
        "url": "https://www.reddit.com/r/languagelearning/comments/10m1no6/assimil_using_french_discontinued/",
        "text": "I've had a copy of using French for years and now I've got my level of French up to a level to use it it seems like it's been discontinued...arghh so I have the book with no audio. Does anyone have it?\n\nAre assimil no longer interested in advanced courses?",
        "created_utc": 1674765039,
        "upvote_ratio": 1.0
    },
    {
        "title": "What app",
        "author": "Feniye",
        "url": "https://www.reddit.com/r/languagelearning/comments/10m14pq/what_app/",
        "text": "Hello, i just started learning French and german on Duolingo but is there any better apps then Duolingo?",
        "created_utc": 1674763696,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice pls",
        "author": "Pokemonfannumber2",
        "url": "https://www.reddit.com/r/languagelearning/comments/10m0zr7/advice_pls/",
        "text": "I am trying to learn Spanish as a second foreign language. I am not in the level of actively understanding day-to-day conversations yet. \nShould I listen to Spanish Media, convos etc? \nWill it improve my Spanish if done consistently?\nShould I dedicate a portion of time daily into this, if so how long on average?\nIf I should, should it be just regular Spanish content or easier-to-understand beginner Convo stuff?",
        "created_utc": 1674763351,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am trying to learn Spanish. I am not in the level of understanding it actively yet. Should I put time into listening Spanish Media, convos, videos, and other similar stuff? I use duolingo as well.",
        "author": "Pokemonfannumber2",
        "url": "https://www.reddit.com/r/languagelearning/comments/10m0vdi/i_am_trying_to_learn_spanish_i_am_not_in_the/",
        "text": "",
        "created_utc": 1674763067,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reading The First Page of Harry Potter in Italian as A0 - My Experience",
        "author": "melmcgee",
        "url": "https://www.reddit.com/r/languagelearning/comments/10m0uf8/reading_the_first_page_of_harry_potter_in_italian/",
        "text": "Hi everyone. :) I bought the first Harry Potter book on Kindle in my target language, which is Italian. \n\n**My background:** My native language is English. I took 2 semesters of Italian way back in high school, around 15 years ago, and have only just gotten back into it (I'm talking about a week or so). I also learned French in school from kindergarten to grade 10, although I never used it at home. Specifically, I took French immersion until Grade 5 and then core French (much easier level) until grade 10. I also have memory issues due to some past brain procedures, so I have no idea how much knowledge I've retained. I consider myself A0, although I am not starting completely from the beginning.\n\nI decided to calculate what percentage of words I needed to look up from the first page, just out of curiosity. Out of 132 words, I looked up 26. This amounts to about 19.6%, but I will round up to 20% to simplify things. I honestly expected the number to be much higher. However, I think my past knowledge of the Harry Potter books in English was a huge help. Being semi-familiar with French also allowed me to guess some words based on their similarities. \n\nFor those of you out there with far more language learning expertise than me, is 20% a reasonable number of words to look up for a beginner? I don't mind the work of translating words (I've created a Google doc to write down the translations of all the words I didn't know, and may create flashcards afterwards). I actually found it kind of fun, like solving a puzzle. :) What do you think of this method?",
        "created_utc": 1674763000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dog names",
        "author": "donutstove",
        "url": "https://www.reddit.com/r/languagelearning/comments/10m0rqd/dog_names/",
        "text": "Hi! I’m looking for name ideas for a dark/black dog, male or female. Is there anything in a different language meaning dark, shadow, night, etc., that would make a cool name?",
        "created_utc": 1674762805,
        "upvote_ratio": 1.0
    },
    {
        "title": "unsure if giving up is the right choice",
        "author": "MasterGamut",
        "url": "https://www.reddit.com/r/languagelearning/comments/10m0fau/unsure_if_giving_up_is_the_right_choice/",
        "text": "I’m latino fluent in both spanish and english. I want to be different. Not be just another bilingual latino. I’ve found myself day dreaming being able to speak the main  Romance languages (Italian, French, Portuguese) and going on an epic Southern Europe adventure. But then reality strikes me. I literally have no use for those languages like at all in my life. I don’t know a single French or Italian  speaker nor do I consume their media or culture unless you want to count the Olive Garden and Emily in Paris lol. I barely use my Spanish in the states and that’s the second most spoken language here. I’ve dabbled a bit with Duolingo but it just feels like I’m going to waste a bunch of time and forget everything I learned. It’s not like I really enjoy learning languages either. I rather play video games or watch tv. I guess what all I’m interested in is the aesthetic of being a polyglot and the bragging rights. But my pragmatic personality just isn’t okay investing huge amounts time for something I may use like once a year or never at all.",
        "created_utc": 1674761933,
        "upvote_ratio": 1.0
    },
    {
        "title": "Language Courses - have a teacher ever got fussy because of your chosen accent/dialect",
        "author": "Prestigious_Winner80",
        "url": "https://www.reddit.com/r/languagelearning/comments/10m0be0/language_courses_have_a_teacher_ever_got_fussy/",
        "text": "[removed]",
        "created_utc": 1674761658,
        "upvote_ratio": 1.0
    },
    {
        "title": "Freshening up grammatical knowledge of one's own native language?",
        "author": "Dazzling_Sea6015",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lzqtv/freshening_up_grammatical_knowledge_of_ones_own/",
        "text": "Hello\n\n\nI want to learn French and I have read that the grammar is a bit complex. Is it a good idea to freshen up the the knowledge and the terms regarding my native language's grammar in the initial phase of learning the target language?",
        "created_utc": 1674760239,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it a great idea to freshen up the knowledge of one's native language before learning the",
        "author": "Dazzling_Sea6015",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lzlih/is_it_a_great_idea_to_freshen_up_the_knowledge_of/",
        "text": "So I am starting to learn French and to my ubderstanding,",
        "created_utc": 1674759870,
        "upvote_ratio": 1.0
    },
    {
        "title": "Basic Info of Hindi language | Listen via Hubhopper",
        "author": "thelanguageera",
        "url": "https://hubhopper.com/episode/the-basic-information-of-hindi-language-1642160474",
        "text": "[removed]",
        "created_utc": 1674757456,
        "upvote_ratio": 1.0
    },
    {
        "title": "I really like Lingbe for conversation practice! Anyone else use this app?",
        "author": "spooky-cat-",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lybxm/i_really_like_lingbe_for_conversation_practice/",
        "text": "At least for my TL (Italian), I’ve been able to find a native speaker to talk with for 10 mins anytime of the day. It connects you with someone in under 2 mins for a voice call. \n\nIt’s great for me because it’s as anonymous as you want it to be, I don’t use my real name or my picture. I just prefer it that way, it removes all the awkwardness that can come along with talking to strangers.\n\nThe main downside is the app’s interface and connection speed can be a bit clunky unfortunately. The other downside is I would not recommend this app if you aren’t at least somewhat conversational. I wouldn’t have gotten much out of it when I was a beginner.",
        "created_utc": 1674756697,
        "upvote_ratio": 1.0
    },
    {
        "title": "so… what is my native language",
        "author": "poetinstern",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ly5ku/so_what_is_my_native_language/",
        "text": "i know that this thread probably sounds extremely stupid because most people, even bilingual ones, know that, right? well, i darn do **not** *and that is* because i grew up between two cultures and it feels exhausting somehow\n\n&amp;#x200B;\n\ni always struggled with identity and things like. i am sure that most people identify in a language / nationality , whether they like it or not, but they do, i really do not, this is my background:\n\n&amp;#x200B;\n\nso i am born and i grew up in italy (never went out of the country ) but i am not ethnically italian. my family comes from the southeast of china (think shanghai, wenzhou, hangzhou, hokkien etc) and you might think hey this is weird, well i assure you this is not, since there are big chinese-ethnicity communities in prato and milan and rimini, etc (one of the cities where i live) since at least the start of the 20 century. i have met many italian kids with chinese descent and there is even a novel about an chinese-italian girl named rossana who struggles with identity issues. there is a huge diaspora here\n\n&amp;#x200B;\n\nsince my grandparents emigrated here with my parents (both of them came to italy before the age of six) my parents do not know chinese much. my mom does not know chinese mandarin **at all** since she had a lot of things to study at the normal italian school (which only taught italian, mostly) since first grade + she spoke a wu dialect at home, not mandarin chinese (the parents of my mom do not really know mandarin) and while for my dad, he speaks basic chinese but at home he just spoke the dialect as well and spoke italian out of the home\n\n&amp;#x200B;\n\ni am fluent in chinese mandarin  (took the HSK 5, for example and i am able to read many chinese novels / tv shows / chat with natives online or not and i think my level is very good!) because:\n\n&amp;#x200B;\n\n\\- i lived with my grandparents in my childhood, around age 1-7 and anyways i went to their home every summer\n\n\\- my parents paid a “nanny / 阿嬤”  when they were at work to take care of me and she spoke to me in chinese, because she was a chinese immigrant, she also taught me how to write\n\n\\- i was kind of forced by them to attend saturday morning chinese school which used chinese language textbooks and also native content qvq\n\n&amp;#x200B;\n\nhowever, i spoke italian only with my parents, and i recall since my childhood that i always spoke both languages in family (with grandparents and nanny) and parents, i attended normal italian school and the chinese school, i had friends who spoke. italian and chinese, and i have italian novels and chinese novels at home\n\n&amp;#x200B;\n\nand i feel like my italian is not perfect, but my chinese is not either, they are kind of the same level sometimes one gets better and sometimes one gets not.\n\n&amp;#x200B;\n\nhelp please 🙏🏻",
        "created_utc": 1674756260,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exactly why do people here not like Duolingo?",
        "author": "rascian038",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lxra4/exactly_why_do_people_here_not_like_duolingo/",
        "text": "I don't like it either, but specifically because:\n\n\\- it teaches through passive learning instead of much more efficient active recall\n\n\\- because it doesn't really offer Spaced repetition studying\n\n\\- it teaches and tests you by showing the foreign words, instead of native ones, thus giving you false confidence for words you wouldn't have translated as easily if you translated them yourself from your language, especially cognates and other easily recognizeable words\n\n\\- unmemorable and generic sentences that you easily forget\n\n\\- complete lack of sentence&amp;context personalization\n\nI use Anki to create my own sentences and verify them with DeepL, and doing so I eliminate all of these problems, however most people here seem to just switch to another passive learning app that works almost exactly like Duo, but with different graphics.\n\nSo...what is the point then, you don't like Duo's graphics? If you don't use it, then at least use an alternative that fixes all or at least some of these problems, don't just switch to something equally as ineffective. Duo is not the problem, the problem is passive learning it uses and the lack of SRS and context that it doesn't use, any other app regardless of its name that works in this way will be equally ineffective.",
        "created_utc": 1674755253,
        "upvote_ratio": 1.0
    },
    {
        "title": "Challenges people could do, and have you done them?",
        "author": "mejomonster",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lxqdw/challenges_people_could_do_and_have_you_done_them/",
        "text": "Every so often there's questions like 'can I learn from duolingo' or 'I plan to just watch shows in TL' or 'can I learn a language by listening' or 'can I study without grammar' and then asking if it will work. \n\nIt would be cool to hear from people who have actually done those things, to hear how they did it and what the result was in terms of language skill improvement through it. I'm the type to think something like that and then go 'why don't I just do it and find out' but that could mean years of dedication to find out, and I'm not sure some people are up for that if they aren't even sure if the method they suggest will work. \n\nSo I suggest: Activity Challenges. Doing the activity for 3 months (or less) and seeing if it is working for you or not based on the progress you make. I'll try to give some links if I've seen anyone actually go through with studying using that method, in case they shared some details about what they did and how it worked for them and their results. Please if you've done any of these, or your own study methods, mention if it worked and what your progress was.\n\nActivity Challenges:\n* Learn a Language with Duolingo (try to complete the Duolingo course as far as you can) [Evan Edinger, Fluent in German with Duolingo](https://youtu.be/ht-w2JriwSw) - he says he got conversationally fluent, he mentions how much he grinded Duolingo, and from other language videos it looks like he got to A2 or low B1. He studied 2 years so that gives you an idea of how long that progress may take with Duolingo unless you study more than him.\n* Learn 2000 common words, then learn by reading with a Reader app or tool (such as Lingq, Pleco, Readibu, LanguageCrush, Kindle, free eReader apps, On Google Chrome/Mozilla/Edge with a click-translation tool or even google translate or translator of your choice). [This article](https://ppalme.wordpress.com/2015/01/08/the-fastest-way-to-learn-to-read-chinese/) goes over a person's experience studying a lot of common words quickly, then jumping right into reading. They describe what they did in steps. I actually followed their study plan, with a couple additions, and was reading graded readers within 3 months and webnovels with a click-translation tool within 6 months. [techno_julique](https://www.reddit.com/r/ChineseLanguage/comments/vlcywg/how_i_was_able_to_read_8_native_novels_within_a/?ref=share&amp;ref_source=link) is another example of someone who moved into reading within the first year of study.\n* Try Listening Reading Method. This is the big [L R explanation page](http://users.bestweb.net/~siom/martian_mountain/!%20L-R%20the%20most%20important%20passages.htm#What_you_expetct_if) and the person describes there how much progress they made in X hours and what the study steps were. [Yuurei](https://forum.language-learners.org/viewtopic.php?f=15&amp;t=1721&amp;p=99415#p99415) did a log of trying the method with results. And [Volte](http://how-to-learn-any-language.com/forum/forum_posts.asp?TID=38593) on HTLAL also did a short experiment with the method for Mandarin.\n* Refold method. Lots of people have shared stories about how Refold, Mass Immersion Approach, AJATT etc worked for them and what specifically they did for a study routine. This [youtube playlist](https://youtube.com/playlist?list=PLWMnoa845pbSE4rOTkj9012qe4o1P4aLs) has a big collection of people who have shared their progress and study methods. These [interviews](https://youtube.com/playlist?list=PLT9cfjU1ykbPfQL-woF8obgeagK1b_1Op) from Matt v Japan also have people sharing their study methods they used and progress. Some people spoke early and some waited years to output, some people studied grammar explicitly and some did not.\n* Learn just by watching TV (without caring if the material is comprehensible). I can't find the article at the moment (it was shared on this sub ages ago), but someone did watch 2000 hours of french shows with no consideration on if the content was comprehensible, and got to around a low B1. So it was very slow, probably not an ideal method.\n* Learn by Comprehensible Input. So study with input you can understand and comprehend. Several people have been sharing progress using this method. [throwthrow9090903](https://www.reddit.com/r/languagelearning/comments/102xlk7/end_of_year_goal_reached_700_hours_of/?ref=share&amp;ref_source=link), [earthgrasshopperlog](https://www.reddit.com/r/languagelearning/comments/ylc228/update_500_hours_learning_spanish_through_anki/), [Froggerbotrom](https://www.reddit.com/r/languagelearning/comments/zyp9nw/comprehensible_inputci_review_600_hours_in_review/?ref=share&amp;ref_source=link). I've utilized some CI resources like [French by the Nature Method](https://youtube.com/playlist?list=PLf8XN5kNFkhdIS7NMcdUdxibD1UyzNFTP), and for me personally it took me from A2/low B1 enough to read novels for native speakers.\n*Learn a Language by playing video games. [Game Gengo](https://youtu.be/OT5l4_erQpo) describes his process here. He also has [this video](https://youtu.be/5AJEJ-wNL8o) about his study method. I have tried this one and done the even lower-tech version where you don't look up a script, and just pause and look up words by typing them in your phone which also worked fine for me. The suggestion of scripts/text games before moving onto faster games is nice, I'd also add as with all immersion playing something you've played before and have context for can also make it slightly easier. Game Gengo also shared a [video game rec list](https://youtu.be/w_QrcROWKmA) for games to study with.\n* Study the language with audio only resources. There's a plethora of options here, and if it works for you then whichever one suits you best is the one to use. From people's experiences, audio flashcards seem to have decent usefulness (audio that plays TL audio of a sentence then a language you know then TL audio again). The old glossika courses are exactly this format, including with repetition built in, so an option is to just pick glossika up and do it for a few months and see if it works for you. Alternatives are endless. Youtube has many videos in this format, so the difficulty is in picking a video with enough sentences and vocabulary to be useful to you. Many people make audio flashcard format audio files of anki sentence decks, which has the benefit of potentially more vocabulary (like 6k-10k words). [Japaneseaudiolessons.com](https://www.japaneseaudiolessons.com/) is a free resource with 30 lessons if you wanted to try this method with japanese, and they explain the study method as being similar to Michael Thomas/Pimsleur/Glossika etc. In one way this method is a little like textbooks since the english translations make all input comprehensible, in another way its like anki since repetition and review is built in, except unlike those 2 methods this one only requires ability to listen so you can look at other things. Not audio flashcard options would include: using any language learning podcast and seeing how far you get like Coffee Break Languages podcasts, Russian Made Easy type stuff, or Language Transfer (or some combination). \n* Do Re-reading method. [polýMATHY](https://youtu.be/JTWKpNy96EM) goes through the steps, they'd be compatible with a lot of other methods listed here that include reading. The steps are a bit intense so I've never done them all, but it'd be cool to see if they work great for someone.\n\nFeel free to share other methods you've seen asked about, or study methods you've done and what the experience was.",
        "created_utc": 1674755191,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I use a native speaker to the best of my advantage?",
        "author": "Taetig4191839",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lxp2c/how_can_i_use_a_native_speaker_to_the_best_of_my/",
        "text": "I currently live with my best friend who is a native speaker of my TL. We only speak in my TL (except occasionally she wants to practice english).\n\nI don’t struggle speaking or communicating with her, so I was wondering if there’s anything I could do or could ask her to do to help me learn more?\n\nMy idea was to google a random topic generator and set a 10 minute timer and have a conversation with her about a random topic to see which words I want to use but don’t know.\n\nlet me know any other ideas! &lt;3",
        "created_utc": 1674755100,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which language learning app has, in your opinion, the most worth it pro version?",
        "author": "MrKonaBitte",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lwpnq/which_language_learning_app_has_in_your_opinion/",
        "text": "",
        "created_utc": 1674752633,
        "upvote_ratio": 1.0
    },
    {
        "title": "Language learning with social anxiety and asocial personality.",
        "author": "_Kenose_",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lw3a8/language_learning_with_social_anxiety_and_asocial/",
        "text": "[removed]",
        "created_utc": 1674751125,
        "upvote_ratio": 1.0
    },
    {
        "title": "What next after Paul Noble Next Steps French?",
        "author": "Intelligent-Theme-27",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lvt1t/what_next_after_paul_noble_next_steps_french/",
        "text": "I'm looking for an audio only French course to follow on from Paul Noble next steps which covers using all the major tenses albeit relatively briefly.\n\nI'm spending a month in France in July/August (Annecy since you ask), and living with a local family. I'd like to improve my French before then, particularly my spoken French. I can read OK, but it takes me a lifetime, or so it feels, to construct a sentence of my own. I've got on well with the Paul Noble courses on Audible and am coming up to finishing the Next Steps course. I like that I can listen when walking, cooking, on the train etc, although goodness knows what fellow train passengers think of my mumbling. I'd like to follow another course of a similar style, hands free audio only. \n\nI've listened to clips of Michel Thomas and I'm not in love with it. I can hear his lips smacking and it's weirdly off putting, also the students seems to make irritating mistakes. \n\nIf I were to go for Michel Thomas what level would be best?  \n\nAre there any alternatives to Michel Thomas and if they do exist what level should I be considering if I can use, in a basic fashion, all the major tenses?\n\nMany thanks",
        "created_utc": 1674750422,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spanish (Castilian) and Catalan at the same time?",
        "author": "walrussss987",
        "url": "https://www.reddit.com/r/languagelearning/comments/10luw3e/spanish_castilian_and_catalan_at_the_same_time/",
        "text": "I wouldn't be starting from scratch, I'm A2+/B1 in Castilian, but do I risk messing up vocab, pronunciation? At least grammar is the same from my understanding. I've wondered something similar about studying Spanish and Portuguese at the same time. Has anybody had any success doing this or any tips?",
        "created_utc": 1674748150,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Plan to Learn Greek From Scratch",
        "author": "mumubird",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lts3j/my_plan_to_learn_greek_from_scratch/",
        "text": "During the process of learning Russian I already came to understand that context is king and that passive assimilation just works. But the most important realization for me personally was how powerful the combination novel+audiobook actually is.   \nIt's in fact so powerful that I said to myself that for my next language I will want to make sure that whenever I read something in the target language, I will always want to have the corresponding audio (recorded by natives) for what I'm reading.\n\nBut this is easier said than done. Requiring 100% text+audio already excludes a big chunk of the existing language learning materials. \nAnd while audiobooks exist for most popular novels nowadays, there are almost no audiobooks for graded readers (that I'm aware of). \n\nSo why not use videos/movies then? Most of them have audio with subtitles after all. Well the thing is, and you may disagree with me here, videos/movies are IMHO not very suitable for experienced learners: only written text allows for quality pauses and fast lookups and serious annotation and only written text has the density required to pick up vocabulary efficiently. \n\nBut I need to start simple. I cannot read a novel right away. I know that Assimil has what I'm looking for (dialogs + audio), so this is my plan (I already got it from my local library), but the question is, will Assimil alone be enough to bridge the gap until I can read the first real novel? Greek Assimil claims that it will get you to B2, which is of course horseshit, but it also states that it will teach you 1500 Greek words in total. I knew probably slightly more words when I read my first novel in Russian, but we'll see.\n\nSo my plan is to complete the Assimil course using manual spaced repetition (rereading chapters x-&gt;x pages back) and if confidence is high, I will then begin to read my first Greek novel. Otherwise I will have to contend with normal textbooks and only pick out the dialogs+audio from them.\n\nBut wait, what if the text+audio method used by Assimil isn't the best way to go about things? Shouldn't I at least complete the Greek Duolingo tree first? Or what if the Anki bros actually have a point? Maybe I should also be doing the 1000 most frequent words on Memrise?! I will definitely search all of reddit to read every comment about learning Greek and about language learning in general. There is also this Youtube playlist called \"Greek in 80 days\"...   \n\n**NO!! Fuck all that bullshit.**   \nI will spend *zero* time on Reddit, Youtube or the Internet in general trying to find learning materials, or trying to find out 'anything about the Greek language' or trying to find 'the best way' how to learn a language, etc.   \nThe Assimil course will be the only thing I will be using before I (hopefully) start to read my first Greek novel. Once I am actually reading Greek novels, I already know the tried and tested process -&gt; [see here](https://www.reddit.com/r/languagelearning/comments/rbvc0e/comment/hnqhgh1/).   \n\nI will be doing my two hours of Greek Assimil every day and I will report back when I have finished the course. See you then!",
        "created_utc": 1674745300,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to learn 3 languages at once",
        "author": "handicuska",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lt9o8/how_to_learn_3_languages_at_once/",
        "text": "I want to learn Telugu, Hindi and Arabic what’s are good some good strategies for learning these 3 languages at the same time",
        "created_utc": 1674743959,
        "upvote_ratio": 0.99
    },
    {
        "title": "How do language exchange partnership actually work?",
        "author": "rinili",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lszl2/how_do_language_exchange_partnership_actually_work/",
        "text": "Would appreciate people's personal experiences establishing the relationship and setting up rules and schedules.  I tried using tandem but I find it awkward to bring up the logistics. I'm not sure what to expect of them or what they of me.  Seems like everyone just wants to practice their English (understandable) but even when I reach out in my target language (Chinese) they keep speaking in English.\n\n\nSo any advice starting those relationships and what expectations should be would be appreciated!",
        "created_utc": 1674743190,
        "upvote_ratio": 1.0
    },
    {
        "title": "Usefulness of grammar concepts to language study?",
        "author": "Ok_Hope_8507",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lslb2/usefulness_of_grammar_concepts_to_language_study/",
        "text": "My underlying question I am trying to answer is \"how valuable is roaming around this sub for progressing my Thai language skills?\" I have no desire to be a polygot. But if grammatical concept understanding helps things along even in the context of other languages, in the same way language immersion does I can then mentally justify heavier browsing",
        "created_utc": 1674742047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two bird with one stone (duolingo)",
        "author": "urruskidad",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lrsnx/two_bird_with_one_stone_duolingo/",
        "text": "So I'm learning german and my 3rd language is russian(from my parents) and so I'm currently taking german lessons but \"as a russian\" which improves/exercise both languages simultaneously. Highly recommended method!",
        "created_utc": 1674739708,
        "upvote_ratio": 1.0
    },
    {
        "title": "Swedish",
        "author": "Rich_Sky_6632",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lrqc0/swedish/",
        "text": "Can you suggest the best materials to learn swedish language",
        "created_utc": 1674739507,
        "upvote_ratio": 1.0
    },
    {
        "title": "The \"competition\" conundrum",
        "author": "myanmeiswha",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lrk99/the_competition_conundrum/",
        "text": "So here in Scotland the favourite foreign language seems to be German, a lot of my colleagues and acquaintances were exposed to it in HS and even for those bad at languages it's the one they're most skilled at. Now for me my foreign language was French, top of my class and everything, and barely anyone here is very good with French.\n\nI've been considering German on and off for a while, and with this in mind I thought \"if I learned German there would prob be much more competition in the job market, meanwhile, from my experience, French is less popular thus giving me less competition\"\n\nI was discouraged from learning Mandarin for the same reason, because \"everyone is learning it\"",
        "created_utc": 1674738997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which language is easier to learn?",
        "author": "Future_Astronaut_820",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lr8h6/which_language_is_easier_to_learn/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/10lr8h6)",
        "created_utc": 1674737988,
        "upvote_ratio": 1.0
    },
    {
        "title": "What language am I reading?",
        "author": "Enough_Television142",
        "url": "https://i.redd.it/zvbaern0udea1.jpg",
        "text": "",
        "created_utc": 1674736534,
        "upvote_ratio": 1.0
    },
    {
        "title": "Improving one language while learning another?",
        "author": "dieweinnachtsmarkte",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lqpsn/improving_one_language_while_learning_another/",
        "text": "I speak some Spanish, but still plan to improve. I’m also trying to learn German from scratch. I’ve seen a lot of resources that mention to learn one language at a time. Thoughts?",
        "created_utc": 1674736231,
        "upvote_ratio": 1.0
    },
    {
        "title": "I thought of a (maybe obvious?) idea that's made me way more productive on flashcards.",
        "author": "justkeepbreathing94",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lqc6z/i_thought_of_a_maybe_obvious_idea_thats_made_me/",
        "text": "I use Anki for flashcards but maybe this can work for any flashcard system, even physical cards.\n\nLet's say my Maximize reviews/day is 200. (It could be any number. This is just an example.) If 18 of the first 20 cards are really challenging, then Anki will have me go over those ones again and again, but because they're mostly going in order, by the time I re-review that 18th card, I've forgotten the 1'st cards answer again because I reviewed 18 cards, all challenging on their own. Doing this takes an eternity it get 200 done.\n\nHere's my simple solution that helped a ton:\n\nIf I plan on reviewing 200 cards, I'll only review them in intervals of 10. Give me 10 cards, a limited amount of information I can manage to keep in mind and remember, then when those ten are remembered good enough, move on to the next 10, cards 11-20. And repeat that process 20 times, studying that cards as small chunks of 10 instead of what gives me, which can be a lot at once, slowing my progress.\n\nTLDR: Breaking my flashcards into chunks of 10 made me much more productive.\n\n(Bonus tip: when studying the cards, I'll talk out loud to my stuffed animals as if I'm teaching/quizzing them. It makes me look crazy but it's also a lot of fun.)",
        "created_utc": 1674734901,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does translating your second language in your head help in learning it?",
        "author": "MooseNo69",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lqb1v/does_translating_your_second_language_in_your/",
        "text": "For the past few months I've been learning German. I can understand what say but only the general idea. If I were to try, to intensively understand each word I wouldn't be able to do it. So I heard somewhere that translating the language to your preferred language (English for me) would greatly help in understanding the German language well. Is that true?",
        "created_utc": 1674734785,
        "upvote_ratio": 1.0
    },
    {
        "title": "Translation of 214 in Mandarin",
        "author": "Naaaysuuu",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lq0u5/translation_of_214_in_mandarin/",
        "text": "[removed]",
        "created_utc": 1674733753,
        "upvote_ratio": 1.0
    },
    {
        "title": "can someone give me an ipa transcription of أنا أتحدث العربية? I have a vague idea on the phonetics of arabic bc i am yet to start learning.",
        "author": "yvugtuvcdh67v",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lpvr5/can_someone_give_me_an_ipa_transcription_of_أنا/",
        "text": "",
        "created_utc": 1674733206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips for me?",
        "author": "valentin200606",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lprvx/any_tips_for_me/",
        "text": "Hey there fellow language learners! Thank you if you're taking your time to read this and answering:\nI speak 9 languages, Romanian (native), Italian English German and French fluently (over B1-B2 level).\nI am learning Russian and Dutch together, I have a level around A2 in both of them right now, and I have learnt Swedish until A2 (or maybe even less), ended up getting bored of it.\nI also speak a bit of Spanish but I understand basically everything in it since I know the romance languages listed above :).\nWhat would you suggest me to learn next? Obviously after finishing the Russian and Dutch books that I have.\n\nPeace!",
        "created_utc": 1674732782,
        "upvote_ratio": 1.0
    },
    {
        "title": "Language exchange",
        "author": "dxariannj",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lpbg9/language_exchange/",
        "text": "Hello, I'm a Japanese absolute beginner learner (i already know hiragana katakana and sone kanjis, many vocabularies and grammar), is anyone interested in speaking / fix mistakes / increase motivation?\nIt would be great even if someone of an higher level was intrested in helping me!!\nI'm italian so I can only help in learning italian / italian culture (and cuisine!!)",
        "created_utc": 1674730990,
        "upvote_ratio": 1.0
    },
    {
        "title": "what does it mean to \"write a Speech\"?",
        "author": "Fire_storming",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lojlv/what_does_it_mean_to_write_a_speech/",
        "text": "I have to write a speech for English class.\n\nEnglish is not my first language. \n\nThis is the first time I encounter this. It's just something like a brief description of the topic or something else.  \n\nI don't know if this is the right place to ask this but maybe someone can help.",
        "created_utc": 1674727719,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m having problems with my second language",
        "author": "Glass_Whereas8028",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lo43y/im_having_problems_with_my_second_language/",
        "text": "I’m Serbian-Norwegian, but I grew up in Norway. Because my mom is the only one in my close family that I speak Serbian with, and i can only see her everyday other week my Serbian isn’t too good, and my grammar is very lacking. I have problems reading cyrilic, and when I speak Serbian my accent is a thick, heavy Norwegian one something which i find embarrassing. Besides reading, what is some stuff i can do to better my second language? PS: sorry about the bad grammar, English isn’t my first language",
        "created_utc": 1674725756,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bilingual eBooks",
        "author": "David_AnkiDroid",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lmhpd/bilingual_ebooks/",
        "text": "I have a large collection of bilingual texts in [Manx](https://en.wikipedia.org/wiki/Manx_language), and I'd like to look into converting these to PDFs &amp; eBooks for learners.\n\nIf you're using bilingual eBooks to learn:\n* Do you have an example of what 'good' formatting looks like?\n* In general, what works well and what doesn't? What would you like to see more of?\n\nThanks in advance!",
        "created_utc": 1674718572,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the EF SET a reliable test for the Cambridge exam?",
        "author": "4ndesite",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lm10y/is_the_ef_set_a_reliable_test_for_the_cambridge/",
        "text": "Hi,\n\nI‘ve recently finished the long EF SET and I got a C2 certificate, which I can use for job applications, etc. However, is it about the same level as the Cambridge exam would be? I‘m very interested in doing it.\n\nAny help is appreciated!",
        "created_utc": 1674716632,
        "upvote_ratio": 1.0
    },
    {
        "title": "Emoji as a language",
        "author": "GorgeousGiraffe6191",
        "url": "https://www.reddit.com/r/languagelearning/comments/10llo2g/emoji_as_a_language/",
        "text": "[removed]",
        "created_utc": 1674715243,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you sometimes experience “bad language days”?",
        "author": "Hot_Corgi_6560",
        "url": "https://www.reddit.com/r/languagelearning/comments/10llk7j/do_you_sometimes_experience_bad_language_days/",
        "text": "Even though I use English daily and I would says my understanding of it is nearly on an native-like level, I still sometimes have those days when I make mistakes with the simplest grammar. It’s nothing major, just tiny mistakes, but they nonetheless annoy me a lot. Then a few days, or even just a day, pass and then everything is back to normal. I’m confident in my speech and this incident is long forgotten. Have you experienced this with your second language?",
        "created_utc": 1674714829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two questions about language learning",
        "author": "Fit-Emu-9880",
        "url": "https://www.reddit.com/r/languagelearning/comments/10llaje/two_questions_about_language_learning/",
        "text": "[removed]",
        "created_utc": 1674713836,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone help me with a language puzzle?",
        "author": "ItsjustBruno24",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ljyh1/can_anyone_help_me_with_a_language_puzzle/",
        "text": "[removed]",
        "created_utc": 1674709144,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone take the JLPT N4 exam without taking the N5 exam?",
        "author": "saltexum",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lj9xt/has_anyone_take_the_jlpt_n4_exam_without_taking/",
        "text": "[removed]",
        "created_utc": 1674706874,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why can I understand conversation but not the individual words?",
        "author": "Smiggos",
        "url": "https://www.reddit.com/r/languagelearning/comments/10li03u/why_can_i_understand_conversation_but_not_the/",
        "text": "My partner can speak Nepali conversationally with family, particularly his mother who is fluent. After 5 years, I haven't really tried to learn as there aren't a ton of resources and my partner can only speak, not write - and he doesn't know the full alphabet anymore. Also, my partner likes learning random languages for a little bit so we've had more fun brushing up on French (as Canadians) and Esperanto (which has honestly been a ton of fun)\n\nAnyhoo, I have been responding to their conversations in English. They look at me like I'm crazy because I couldn't even tell them a single word they had said but somehow I knew the gist of what they were saying. I honestly didn't even realize I was doing this as I was almost always have busy fiddling around with something else and not really paying attention to them. \n\nApparently, I've been doing this for awhile. Is this normal? Are there any strategies I can employ to better translate what they are saying?",
        "created_utc": 1674702908,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your \"Achilles word\" in your TL?",
        "author": "Master-of-Ceremony",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lhwpv/whats_your_achilles_word_in_your_tl/",
        "text": "I was doing my Anki deck today, and for the millionth time in a row, I couldn't remember the translation of \"to practice (as a doctor/lawyer etc.)\" (ejercer). This word has been in my deck for around 3 months now, I think I've seen it at least 30 times, and still I can't get it right!!! It's not even a super useful word for my level, but I've developed a grudge against it to the point that I'm refusing to let it win. It's swimming around in my head at the moment taunting me - if this doesn't make it stick I don't know what will\n\nAnyway, I decided to share my pain in the hopes that others would share their pain so we can all suffer together.",
        "created_utc": 1674702620,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Don’t learn Modern Standard Arabic, learn a dialect”…dotou agree?",
        "author": "Triceratops9998",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lhffd/dont_learn_modern_standard_arabic_learn_a/",
        "text": "I’ve been considering learn Arabic and have thus been doing some initial research.\n\nI read https://talkinarabic.com/learn-modern-standard-arabic-or-a-dialect/ which makes the case that one should not bother learning Modern Standard Arabic. I’m a little disheartened as I was under the impression that Modern Standard Arabic was a widely spoken language that would allow and individual to converse with a variety of individuals across the Arabic world. However, that doesn’t seem to be the case.\n\nDo you agree with that article? Does one really have to learn Modern Standard Arabic **and** a bunch of dialects to be understood across Arabic countries? I’m not sure I have that kind of time haha.",
        "created_utc": 1674701194,
        "upvote_ratio": 1.0
    },
    {
        "title": "TEMI Personal Robot",
        "author": "JuggernautBitter200",
        "url": "https://www.techaudioreviws.com/2023/01/temi-personal-robot.html",
        "text": "",
        "created_utc": 1674699158,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning French with SpongeBob",
        "author": "ShawnSlayerofKings",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lgq7v/learning_french_with_spongebob/",
        "text": "[removed]",
        "created_utc": 1674699119,
        "upvote_ratio": 1.0
    },
    {
        "title": "2023 Buyer's Guide: Top 5 Dolby Atmos Soundbars",
        "author": "JuggernautBitter200",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lgnm7/2023_buyers_guide_top_5_dolby_atmos_soundbars/",
        "text": "[removed]",
        "created_utc": 1674698908,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help on learning spanish when I fell behind in class?",
        "author": "ThatGuyNamed_Chris",
        "url": "https://www.reddit.com/r/languagelearning/comments/10leyz6/help_on_learning_spanish_when_i_fell_behind_in/",
        "text": "This is probably a dumb question but I dont want to just sit and do nothing. Im in 8th grade, and I've fallen behind in spanish quite a lot, thing is, Im not failing, if I remember correctly it is the class Im performing the best in. However, that is because I've had family members help me (and google translate). I actually want to know how to get to the point where I should be for spanish, I want to be able to translate a sentence myself and write one myself.\n\nFor example, right now we are learning about past tense/preterite, My homework asks me to answer about myself\n\n\"Ayer, viste un video en la clase de espanol?\" I cant understand this sentence, and dont know how to answer it, I can understand some words, clase, espanol, ayer, video. I've tried duolingo, but it dosent help specifically for what we are learning, and my teacher did not recommend it, I dont think I can pass by just doing good on homework and doing pretty bad on tests.",
        "created_utc": 1674694101,
        "upvote_ratio": 1.0
    },
    {
        "title": "Japanese books for studying",
        "author": "Eyymsnap",
        "url": "https://www.reddit.com/r/languagelearning/comments/10leby7/japanese_books_for_studying/",
        "text": "Are there any books for studying Japanese? \nI’ve mastered hiragana and I’m ok with understanding katakana. I want to form and structure my sentences. Mainly with particles and knowing how and when to place them. I can read a little Japanese just not any kanji characters.",
        "created_utc": 1674692347,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best way to speak a bit of Korean in 6-7 months?",
        "author": "Syzygiously",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lebh0/what_is_the_best_way_to_speak_a_bit_of_korean_in/",
        "text": "Me and some friends are going to South Korea this summer, and I would like to be able to speak a little Korean (ordering food, greetings, simple / common phrases, etc.) when we get there. I have been using Duolingo to learn Spanish for about two months now, and so I started the Korean course. I've learned most of the letters and their pronunciations on Duolingo, and completed the first 2 units of Korean. So far it seems that using Duolingo will allow me to read Korean pretty well and speak decently, but I was wondering if this is the best tool for me to get to the point I want to be at, or if there are other resources that would get me there quicker.",
        "created_utc": 1674692313,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend is accidentally putting me off learning Spanish",
        "author": "ok_pepsi",
        "url": "https://www.reddit.com/r/languagelearning/comments/10le7nd/my_boyfriend_is_accidentally_putting_me_off/",
        "text": "My boyfriend's first language is Spanish and some of his family only speak Spanish so he asked me to consider learning it. I was excited at first and have started learning basic vocabulary and simple sentences, I'm not taking it too seriously as I'm also working towards my degree and working full time. \n\nThe problem is this, whenever I've tried to tell him what I've learnt he was quite negative and would tell me my pronunciation is bad and pick it apart. I'm English and I wasn't expecting my pronunciation to be good, I know its not perfect but it's really put me off to only have negative feedback - especially from the person who wanted me to learn it in the first place. It also feels like he's expecting my pronunciation to be perfect which I think is unrealistic for a language I've only started learning in the past month. \n\nI've continued learning it anyway but now refuse to speak Spanish with him as every time I've done it before it's just ended up making me feel deflated, sad and embarrassed. He's noticed and it seems to upset him that I refuse to say anything in Spanish to him, which is making me feel guilty. \n\nThe whole thing is causing me a lot of anxiety and I was wondering if anyone has had any similar experiences with their partner and if they got through it or just stopped learning? I'm finding it hard to be honest with him about how I feel because I'm embarrassed.",
        "created_utc": 1674692038,
        "upvote_ratio": 1.0
    },
    {
        "title": "Language Learning without phone apps?",
        "author": "Jaded-Stretch-5089",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ldgx1/language_learning_without_phone_apps/",
        "text": "what do y’all recommend to learn without using a phone app? Computers/books/podcasts are fine but i find myself too easily distracted if using an app on my phone. I’m attempting to relearn french due to my family natively speaking it but my last family member that is fluent is close to passing and suffering from memory loss. \n\nFurther, is there any online courses or software in order to learn ASL as well?\n\nAny recommendations are greatly appreciated 🫶🏻",
        "created_utc": 1674690071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Norwegian Horror Novels",
        "author": "if_eleswhere",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ld82w/norwegian_horror_novels/",
        "text": "I'm trying to learn Norwegian, and I figured that It'd be easier to learn if I read some books written in Norwegian. Does anyone know some good horror books that are written in Norwegian? I prefer a book that was originally written in Norwegian, not translated from another language.",
        "created_utc": 1674689436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Language learning hours \"For free\"?",
        "author": "exa_4U",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ld361/language_learning_hours_for_free/",
        "text": "I recall a while ago reading about a study stating that after learning a 2nd language, learning a 3rd one is easier and you save X amount of hours or percentage due to your brain gets better at acquiring languages.\n\nDo you guys know anything about the study or statistics about it?",
        "created_utc": 1674689095,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the most difficult sounds you had to learn in your TL?",
        "author": "guyoncrack",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lcfqy/what_are_the_most_difficult_sounds_you_had_to/",
        "text": "Learning new sounds in languages has always actually been a very fun part for me and it feels very rewarding when you actually manage to do it. Toughest ones I've encountered for me were the Dutch hard 'g', the Arabic q (ق) and ayin (ع) but the special mention goes to the British English non-rhotic 'r' such as in 'car', which is extremely hard to do for me when I actually speak.",
        "created_utc": 1674687489,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think I should do it?",
        "author": "No_Cloud_8727",
        "url": "https://www.reddit.com/r/languagelearning/comments/10lbhum/do_you_think_i_should_do_it/",
        "text": "**Warning: A pretty long read ahead**\n\nHey everyone. I am twenty years old and speak 2 languages (English and German) other than my mother tongue (Hungarian) at a high level (C2). I believe many people who speak several languages can relate to this: I have been feeling this urge to pick up new languages, more specifically French, Spanish, Italian, Portuguese, and Mandarin, and learn them to a C2 level or an equivalent thereof. My dream is to become a conference interpreter and a horror, thriller, crime, and mystery writer. I would love to work full-time as a freelance conference interpreter while doing writing as a sideline. But there is a problem: The deterioration of skills. I have spent years to master English and German to such a high level and I am really concerned that while in the process of acquiring all those five languages, my English level may drop. \n\n(To be honest, I don't really care about German.  On a slightly different note, I wouldn't have learned German in the first place if we hadn't moved to Germany. Back in Hungary, when I was in fourth grade, I had to choose between learning English and learning German. I wanted to pick English because I had had previous exposure to the language by watching Boomerang, Cartoon Network, Animal Planet, and National Geographic where not many programs were dubbed into Hungarian back then, so I had to watch Scooby doo, Tom and Jerry, and various other programs in English and I immediately fell in love with the language but my mom talked me out of it, saying that we would move to Germany soon and it would be useful for me to have at least a basic knowledge of how the language works. And when I came here, I started learning German intensively because I already had my heart set on learning English. I thought that the sooner I'd learn German to a high level the sooner I could start learning the language I truly adored and adore to this day.)\n\nI have plans to move to Canada or to the USA as soon as possible but that's going to happen a couple of years down the line. But anyway enough with the rambling. The point is that now I want to learn those Romance languages and Mandarin to a native-like level as well without losing my English. I really don't want that to happen because I've put a lot of effort and several years into learning English to such a high level. So I'd work with English, Mandarin, French, Spanish, Hungarian, Italian, and Portuguese as a conference interpreter if having a native-like command of six foreign languages and maintaining it in all of them is possible. \n\nShould that be beyond the realm of possibility, then I will choose only English, Mandarin, French, and Spanish (plus Hungarian). Is it possible to achieve a native-like level in four foreign languages and maintain it?\n\nOr, should I stick with English and keep learning it? I wouldn't mind that at all because maintaining my English will always be the ultimate priority for me. I really love this language. (As a side note, native English speakers, don't take your mother tongue for granted.:-) It's an amazing language.) Of all the six foreign languages,  no offense to native speakers of the other five languages, English is the most important to me. Moreover, I believe that if you speak English you can communicate with pretty much anyone regardless of where they are from (provided they speak English, of course.) \n\nBut on the other hand, I love how French,  Italian, Spanish and Portuguese sound. They are so beautiful and mesmerizing. As for Mandarin, I think it's a super cute language. Besides, not everyone speaks English, thus I am of the opinion that learning these languages to a high level as well would come in handy. \n\n&amp;#x200B;\n\nI have been flip-flopping for quite a while. I'd really appreciate it if you could help out here.\n\n&amp;#x200B;\n\nP.S. I am sorry for the way too frequent digression throughout the text.",
        "created_utc": 1674685101,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many new words do you learn in a typical day?",
        "author": "_velvetthunderr",
        "url": "https://www.reddit.com/r/languagelearning/comments/10l91ss/how_many_new_words_do_you_learn_in_a_typical_day/",
        "text": "Those who do new vocab most/every day how many words will you typically do? I’ve seen some go as high as 50-60 and then others preferring 5-10. I personally do somewhere between 20-30. What about you?",
        "created_utc": 1674679140,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've read my first 50 books in Russian",
        "author": "Street-Studio-4434",
        "url": "https://i.redd.it/vt9yfftnv8ea1.png",
        "text": "",
        "created_utc": 1674676554,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any apps/sites like Duolingo?",
        "author": "Salted-Honey",
        "url": "https://www.reddit.com/r/languagelearning/comments/10l7wx4/any_appssites_like_duolingo/",
        "text": "Hi all! So I was learning French on Duolingo for almost a year before they updated everything in an odd way and began paywalling a bunch of their previously free features like their podcasts, and now I need something similar to how Duolingo used to be. I really miss practicing French daily, and my skills are starting to slip from me a little, but I got the most of the interactive podcasts and now I can’t use them without paying for it. Anything similar but for free? Thanks sm!",
        "created_utc": 1674676419,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to REALLY improve French language level??",
        "author": "oatmilklattefan",
        "url": "https://www.reddit.com/r/languagelearning/comments/10l7maq/how_to_really_improve_french_language_level/",
        "text": "[removed]",
        "created_utc": 1674675736,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I lose my accent?",
        "author": "No_Definition_5935",
        "url": "https://www.reddit.com/r/languagelearning/comments/10l72t6/can_i_lose_my_accent/",
        "text": "I have lived in the US for a while now and I would say I was able to master a pretty good American accent. Over the summer I will go back to my home country to visit my parents for about two months. Mind that NO ONE there speaks English. Do you think I will lose a bit of the American accent after not speaking English for a while?",
        "created_utc": 1674674465,
        "upvote_ratio": 1.0
    },
    {
        "title": "ABSURD LANGUAGE italian",
        "author": "Enough-Citron-3931",
        "url": "https://www.reddit.com/r/languagelearning/comments/10l6u99/absurd_language_italian/",
        "text": "\n\n\nAlthough italian language sounds shitty as if two person fighting with each other talking loud and showing absurd gestures but what amuses me 😀 is that the stereotype saying the language is beautiful but for me its shit please share the thoughts",
        "created_utc": 1674673917,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much time do you guys spend learning a language per day?",
        "author": "icecream5516",
        "url": "https://www.reddit.com/r/languagelearning/comments/10l6gu8/how_much_time_do_you_guys_spend_learning_a/",
        "text": "",
        "created_utc": 1674673065,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it too late to back out/take a break",
        "author": "MrRozo",
        "url": "https://www.reddit.com/r/languagelearning/comments/10l6f42/is_it_too_late_to_back_outtake_a_break/",
        "text": "I have been learning German for 2 months ( not including my like 2 week - 3 week break ) vocabulary-wise and pronunciation-wise it’s what I would say “easy” , and spelling and reading , basically all parts other than grammar , that’s what I find difficult I have been feeling very demotivated to learn German lately and I lost my free subscription on germanpod ( they give you a free trial ) , I basically just feel really demotivated to learn lately , I feel like starting to take French outside of school and then come back to German later , the reason I didn’t do that earlier , my brain feels like it’s too late to back out , wasting 2 months of my work , what do you think? \n\nThank you in advance.",
        "created_utc": 1674672953,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this weird ?",
        "author": "MrRozo",
        "url": "https://www.reddit.com/r/languagelearning/comments/10l63gu/is_this_weird/",
        "text": "Some background: I have been going to English schools since preschool ( I went to an English teaching preschool. ) , yes I am Egyptian my first language is Arabic , but when I’m talking with my brother we use English most of the time , with my parents I don’t speak to them in English but teach them a bit , I still use Arabic with my brother obviously , and when I’m hanging out or with my friends at school we speak English and Arabic interchangeably. \n\nIs it normal to have English as like a second “home-language”? \n\nThank you in advance.",
        "created_utc": 1674672194,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve found the best way to read my TL— Facebook.",
        "author": "mrbenten",
        "url": "https://www.reddit.com/r/languagelearning/comments/10l55jk/ive_found_the_best_way_to_read_my_tl_facebook/",
        "text": "A while ago I started reading as a way to learn more of my TL. The amount of vocabulary I was coming across really skyrocketed— books/articles are just much more vocabulary dense than people tend to be in conversation. The only issue with this is that (at least in my TL) a lot of the written language is very different from the spoken language. The structure is overall a lot more formal, and a lot of the vocabulary just isn’t used in normal conversation— think about how often you talking about how “the glittering moonlight beamed a radiant glow,” for example. \n\nThe other day I came across a public Facebook group in my TL, and it actually seems like the best of both worlds. I’m just reading through the posts and the comments and I’m picking up so much vocabulary, but this time it includes slang, expressions, and vocabulary that would feel totally normal in conversation. And since I’m just reading I can move at my own pace too and never feel overwhelmed.\n\nI’m also picking stuff up that I’m pretty sure I’d never learn unless I moved to my TL’s country, like how to say dickpicks and dog parks, which is great.",
        "created_utc": 1674669993,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you could study your target language 8 hours every single day, what would you do/how would you organise your time?",
        "author": "ChocolateOrange22",
        "url": "https://www.reddit.com/r/languagelearning/comments/10l4suf/if_you_could_study_your_target_language_8_hours/",
        "text": "",
        "created_utc": 1674669169,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made a regular sprint mistake on lingoda, what do you think?",
        "author": "iamamazing-",
        "url": "https://www.reddit.com/r/languagelearning/comments/10l3p0d/i_made_a_regular_sprint_mistake_on_lingoda_what/",
        "text": "So I'm doing regular lingoda sprint and have to say I am enjoying it so far. However you need to take 15 classes in month one and 15 in month two. Month two begins on a Tuesday!\n\nI thought it began on a Monday so I've taken 16 classes in month one. Will I get disqualified for this? If yes I think it's super sneaky for lingoda to do this because common logic would suggest that month two should start on a Monday!\n\nWhat do you think?",
        "created_utc": 1674666497,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there an easy way to tell when someone is speaking Mandarin versus Cantonese or another Chinese language?",
        "author": "sparkysparky333",
        "url": "https://www.reddit.com/r/languagelearning/comments/10l39t6/is_there_an_easy_way_to_tell_when_someone_is/",
        "text": "Super beginner here trying to learn Mandarin. I'm such a beginner that I have trouble telling if the video or resource I'm looking at is in Mandarin or Cantonese (not to mention mainland mandarin versus Taiwanese mandarin). Are there some characters or words that are frequently used in one or not the other?\n\nFor example, when I was first learning Spanish, I knew right away *ç* meant it was actually Portuguese. Honestly, I didn't get those two ever really confused, but hopefully that illustrates what I mean.\n\nIt seems like one thing I could use is  我  is pronounced significantly different in Cantonese (ngo5) versus Mandarin (Wo). Are there any characters that aren't used by one or the other?\n\nA lot of things are listed as \"Chinese\" without further clarification. \n\nThanks in advance!",
        "created_utc": 1674665481,
        "upvote_ratio": 1.0
    },
    {
        "title": "How useful Lingoda would be for a person with a B2+ level?",
        "author": "gweenmarsh",
        "url": "https://www.reddit.com/r/languagelearning/comments/10l311z/how_useful_lingoda_would_be_for_a_person_with_a/",
        "text": "I currently am sitting somewhere between B2 and C1 and wondering if it’s any use taking Lingoda lessons. I’m completely self taught so i’ve never had any lessons with a teacher before. Do you think iTalki is more useful at the level i’m at? I’m not looking to learn anything specific really. Maybe just go over what i’ve already learned over the years. I’m considering Lingoda due to their sprints possibly being a way to motivate me to actively use the language again (and for review).\nIf you’ve taken either Lingoda or iTalki lessons and are at a similar level please let me know your experience.",
        "created_utc": 1674664878,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tandem App: notification badges glitch",
        "author": "RobVizVal",
        "url": "https://www.reddit.com/r/languagelearning/comments/10l2sym/tandem_app_notification_badges_glitch/",
        "text": "For those using the Tandem language-learning app frequently, have others found the notifications to be unreliable? The icon on my phone will sometimes say there’s one message waiting, sometimes six, sometimes two, and it never corresponds to the number of actual messages I get. I suspect this is a glitch just with my installed app, but I’d be interested to hear others’ experience.\n\nFWIW, I do recommend the app for finding language practice partners (with the usual caveat about needing to weed through the weirdos).",
        "created_utc": 1674664303,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to become more eloquent in your TL?",
        "author": "Artgor",
        "url": "https://www.reddit.com/r/languagelearning/comments/10l2fp9/how_to_become_more_eloquent_in_your_tl/",
        "text": "TL;DR: How to become more eloquent?\n\nRecently I have been using chatGPT, and with time, I realized that it is better than me at writing blog posts or notes in English (English is my second language).\n\nI have no problems formulating thoughts, making a sensible text structure, generating ideas, and expanding on them. But I can't manage to write a text that has a flow in it and that \"feels good.\n\nAs a result, my process of writing long texts looks like this nowadays: at first, I write the whole text by myself, then I split it into pieces and write different prompts to chatGPT asking to rewrite it, then I mix the results and try to improve them (by myself and by using Grammarly). I like the results, but I'm sad that I can't write like this on my own.\n\nI will give you an example so that you can see it yourself.\n\nFirst version:\n\n&gt;English is taught in most Russian schools since the first classes, so there was no option not to study it for me.  \n&gt;  \n&gt;In the early school years, English lessons were simply terrible. I still remember how we were taught pronunciation in the beginning classes of school. Let's take the word \"knight\"; its pronunciation is \\`/nʌɪt/\\`; however, we were taught to pronounce each letter in it, and as a result, it sounded like \\`/kniːɡht/\\`. In the later classes, the quality of the English lessons improved, but still, there were some problems (like an absurdly strict teacher, who at random moments of the lesson could stop teaching and launch a random story for half a lesson).\n\nСтало:\n\n&gt;English is a language that is taught in most schools in Russia, and for me, it was no exception.  \n&gt;  \n&gt;  \n&gt;  \n&gt;In the early years of school, my English lessons were nothing short of terrible. I still remember the way we were taught pronunciation in the beginning classes.  For example, the word \"knight\" is pronounced \\`/nʌɪt/\\`, but we were taught to pronounce each letter individually, which resulted in it sounding like \\`/kniːɡht/\\`. It's funny to think about now, but at the time, it was just confusing. As I moved on to later classes, the quality of the English lessons improved, but there were still some issues - like a strict teacher who would randomly stop teaching and tell stories for half the lesson.\n\n&amp;#x200B;\n\nThus, the question is how to learn to write better. Some of the obvious ideas:\n\n* read more. I already read 40+ books (20-30k pages) in English each year. But, considering these books are mostly fantasy, I could try to read something with better prose;\n* write more and get feedback. This is reasonable, but getting good feedback could be complicated;\n\nOn the other hand, maybe I shouldn't do anything regarding it - I could just continue using chatGPT, analyze its suggestions and try incorporating them into my writing.",
        "created_utc": 1674663415,
        "upvote_ratio": 1.0
    },
    {
        "title": "Try out ALG without going to Thailand, in 10 hours",
        "author": "joelthomastr",
        "url": "/r/tokipona/comments/10ivb88/tell_a_friend_30day_comprehensible_input_challenge/",
        "text": "",
        "created_utc": 1674662888,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have the refold French deck?",
        "author": "matteg0nz",
        "url": "https://www.reddit.com/r/languagelearning/comments/10l1wfd/does_anyone_have_the_refold_french_deck/",
        "text": "[removed]",
        "created_utc": 1674662145,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling like a failure with speaking after every lesson. How do you stay positive when learning a new language, and the struggles of discouragement?",
        "author": "Chicken-Inspector",
        "url": "https://www.reddit.com/r/languagelearning/comments/10l0xqd/feeling_like_a_failure_with_speaking_after_every/",
        "text": "I've been studying Japanese for just under 4 years now, and I've slowly increased the amount of lessons I take and variety of studying I do.  My biggest struggles are speaking and listening.  I just finished a lesson that was mainly conversation based, but the whole hour was such a struggle. Lot's of \"ummmmm\" and \"can you repeat that again? slower?\"  The thing is though, it's nowhere near as hard when I listen to audio at home, or speak out loud alone.  My brain goes blank when you throw in a native speaker into the mix (or a teacher).  I can write the sentence down, I can see it in my head, but I cannot get it out, and if I do, I forget what the second half was going to be after I manage to get out the first.  \n\n\nLanguage learning is hard as hell, and I walk away from lessons feel like I failed, rather than with something that I learned.  My expectations may be too high...  \n\n\nSo how do you keep your expectations in check?  How do you know what's realistically doable for you, and when you know you're out of your skill level?  When you reach that plateau, when you struggle to get those sentences out, or you just cannot understand what it is you're reading, how do you manage to keep your heads up and not get frustrated and discouraged?\n\n&amp;#x200B;\n\n(i meant to ask about pushing through the hard times when learning, but it kinda came off as a vent, so I apologize if this isn't appropriate for this sub, everyone!)",
        "created_utc": 1674659712,
        "upvote_ratio": 1.0
    },
    {
        "title": "More and more countries are becoming more proficient in English",
        "author": "mariska888",
        "url": "https://www.reddit.com/r/languagelearning/comments/10l0tzj/more_and_more_countries_are_becoming_more/",
        "text": "Many people probably already know this anecdotally, but not many of you probably have looked at the trend in EF's English Proficiency Index (EPI). Before we jump in, as we all know, the higher the English proficiency, the more likely its speakers are gonna switch to English on you. In other words, the higher your proficiency in that language needs to be before you can technically hold a conversation in that language. In some extreme cases, any less than \"native\" (not even native-like) is gonna be switched on to English, and since theoretically we can't be \"native\" (especially if we learn the language later into adulthood), this reduces the opportunity to use the language down to 0 lol.\n\nWe all know in this sub that Dutch and Scandinavian learners are suffering from this, but some of us may have gotten the sense that German is creeping up there as well -- well, they're not wrong. Let's compare EF EPI from 2012 and 2022:\n\n[https://www.ef.com/assetscdn/WIBIwq6RdJvcD9bc8RMd/cefcom-epi-site/reports/2012/ef-epi-2012-report-en.pdf](https://www.ef.com/assetscdn/WIBIwq6RdJvcD9bc8RMd/cefcom-epi-site/reports/2012/ef-epi-2012-report-en.pdf)\n\n[https://www.ef.com/assetscdn/WIBIwq6RdJvcD9bc8RMd/cefcom-epi-site/reports/2022/ef-epi-2022-english.pdf?\\_ga=2.37571235.2046719367.1674658210-1846379147.1674658210&amp;\\_gl=1\\*bv1wn8\\*\\_ga\\*MTg0NjM3OTE0Ny4xNjc0NjU4MjEw\\*\\_ga\\_25YNHDZQQP\\*MTY3NDY1ODIxMC4xLjAuMTY3NDY1ODIxMC4wLjAuMA](https://www.ef.com/assetscdn/WIBIwq6RdJvcD9bc8RMd/cefcom-epi-site/reports/2022/ef-epi-2022-english.pdf?_ga=2.37571235.2046719367.1674658210-1846379147.1674658210&amp;_gl=1*bv1wn8*_ga*MTg0NjM3OTE0Ny4xNjc0NjU4MjEw*_ga_25YNHDZQQP*MTY3NDY1ODIxMC4xLjAuMTY3NDY1ODIxMC4wLjAuMA)\n\nVery High Proficiency comparisons:\n\n\\- 2012: Norway, Netherlands, Denmark, Sweden, Finland\n\n\\- 2022: Netherlands, Singapore, Austria, Norway, Denmark, Belgium, Sweden, Finland, Portugal, Germany, Croatia, South Africa, Poland\n\nAs you can see, Very High Proficiency countries have grown considerably in the past 12 years. These languages have now also joined the rank of Dutch and Scandinavian languages: German, Croatian, Polish, European Portuguese.\n\nIf you look into the 2022 High Proficiency languages, the ones above 570 are probably not \"safe\" (especially in the next 5 years or so).\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nI'd feel safe on languages in countries who seem to stay in Low / Very Low proficiency between 2012 and 2022. Some of these are: Spanish (various countries), Arabic (various countries), Russian (various countries), Chinese Mandarin, Thai, Turkish, Indonesian, etc.\n\nBe careful also of countries which seem to be on the rise. For example, Brazil was Low Proficiency in 2012. But in 2022 it's Moderate Proficiency. I wouldn't be surprised if it becomes High Proficiency in 2032. There may be other examples.",
        "created_utc": 1674659440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there an auto captions generator?",
        "author": "Cekan14",
        "url": "https://www.reddit.com/r/languagelearning/comments/10l0owb/is_there_an_auto_captions_generator/",
        "text": "Hi there, dear community!\n\nSo, in the continuous journey of language learning, I find watching series as a great way to get to practice listening skills. However, it does not always happen that wherever it is that I am watching such series has an option to turn the subtitles on. This is critical, specially when studying a language phonetically different from your own, where the ability to discern the correct spelling of a word can mean the difference between understanding it all, or understanding nothing.\n\nHence, I was wondering: \"is there such a thing as a captions generator?\". I know YouTube has this option for most of its videos, but it obviously only works on YouTube. I'm thinking something like an app that would be on while the video is playing on whatever other platform, browser, or app. What I am thinking about is closer to the [feature](https://support.microsoft.com/en-us/windows/use-live-captions-to-better-understand-audio-b52da59c-14b8-4031-aeeb-f6a47e6055df) Microsoft has launched for Windows 11. Something like that would be great, but it is unfortunately only available for English as of now. \n\nI am asking in a broader sense so the possible answers can help different language learners no matter what language someone is learning. In my case, I am learning French, Portuguese and Italian, in case you have specific recommendations for these.\n\n&amp;#x200B;\n\nMerci beaucoup !",
        "created_utc": 1674659072,
        "upvote_ratio": 1.0
    },
    {
        "title": "Potential problems with learning similar languages after one another.",
        "author": "JemoIncognitoMode",
        "url": "https://www.reddit.com/r/languagelearning/comments/10kyfl6/potential_problems_with_learning_similar/",
        "text": "Howdy, my goal for the next few years is to learn 3 languages to basic conversational fluency in 4 years. To do this I will devote one year to each language and the final year I would use as a buffer.\n\nI am currently learning Italian, I've been studying it since 5months and it's going pretty well. What I started out doing was luodingo, a textbook &amp; anki. Now I've moved on to consuming media (watching series in Italian), Anki and finishing up the duobingo course. Part of why Italian was pretty easily started for me was my knowledge of French, I'm no expert in French but I'm from Belgium so I got taught French for 8ish years in school.\n\nNext year I'm going to learn Spanish, hoping to use my knowledge of 2 other similar languages to help. However, I am afraid that I will start mixing up Italian and Spanish. I'm saying this, because on occasion I jumbled my words between Italian and French. Given I've known French for a longer time I'd expect this to be even more common for Spanish and Italian.\n\nAny tips or tricks I can do now, and once I start, to not have these languages become one giant mess in my head?",
        "created_utc": 1674652721,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you also experienced a big self-development in your personality as you were learning a second language?",
        "author": "piskachiu",
        "url": "https://www.reddit.com/r/languagelearning/comments/10kxz2a/have_you_also_experienced_a_big_selfdevelopment/",
        "text": "I didn’t feel it for a long time, but I realized after some time that learning a second language, and using it in a daily basis has really changed the way I look at myself. \n\nI can see crystal clear that I have two different personalities.\n\nOne is in my mother language, and another in the foreign one.\n\nThis showed me the power my mind has, or the power I have over my mind.\n\nI can flexibilize my personality.\n\nAs each language, also, carry the weight of their culture, I believe that you make your “new linguistic personality” to grow into that specific environment giving you a lot of material to compare with your “native sociocultural personality” \n\nI can see it very well and discussed that with a friend who was also learning a second language.\n\nHow much he was able to discover about himself.\n\nI am able to adjust behaviors (in my “native personality”) that sometimes I achieved in a foreign language.\n\nThis could go both ways, for better or for worse.\nLet’s say, where I live at now, people over apologize for every thing.\n\nNow I’m doing the same in my native language. (Which is not that common)\n\n\n\n\nWhat about you guys?",
        "created_utc": 1674651288,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does your brain ever lose focus on your second language and just say “sod you, I’m only gonna listen to my native language”?",
        "author": "Unique-Whereas-9209",
        "url": "https://www.reddit.com/r/languagelearning/comments/10kxvdk/does_your_brain_ever_lose_focus_on_your_second/",
        "text": "A few months ago, I was able to communicate relatively well with a Russian speaking friend, I travelled Kyrgyzstan using only Russian, I’ve continued learning and practicing. But today I could barely understand someone say that they’re going to bring me orange juice? \n\nI don’t understand how my listening skills could have gotten worse but I seem to have been struggling in the past few weeks with things I wouldn’t usually struggle with. \n\nIs it normal for the brain to just reject input in second language?\n\nThanks",
        "created_utc": 1674650953,
        "upvote_ratio": 1.0
    },
    {
        "title": "Surprised by Spain tbh",
        "author": "Icy_Assist_1564",
        "url": "https://i.redd.it/ncved19cp6ea1.png",
        "text": "",
        "created_utc": 1674650212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Did You Learn Esperanto? Interviews during the Esperanto Youth Congress 2022 in the Netherlands",
        "author": "stergro",
        "url": "https://www.youtube.com/watch?v=LgFoSJ4Z6pw",
        "text": "",
        "created_utc": 1674647512,
        "upvote_ratio": 1.0
    },
    {
        "title": "My German School Experience! (GLS Berlin)",
        "author": "HadarN",
        "url": "https://www.reddit.com/r/languagelearning/comments/10kwuts/my_german_school_experience_gls_berlin/",
        "text": "This December (2022) I was forced by my workplace to take some time off, and I decided to use it for the best possible cause- to learn some German!\n\nAfter a lot of thought, I ended up choosing to go to GLS in Berlin for a 2-week program, right before the holidays.\n\nThis is the 2nd time I participated in a program of this sort- the first time was in a Chinese school back in summer of 2019. The two schools were extremely different and the programs I participated in were not the same. Each had their pros and cons, but here I’d like to overview a bit of my Berlin experience to help you choose whether you want to do that as well!\n\nI’ll start with a conclusion: GLS is a great school! I really enjoyed it there and learned A LOT.\n\nBut now for the details:\n\n—\n\n**What is my German level to begin with?**\n\nBefore going to Germany, The only background I had was some Duolingo and podcasts, so I really didn’t know what my level was. I was even a little scared to get classified into an A1 class and learn everything anew. In the end I got into an “A2” class- which was a tad too difficult for me- and that was perfect.\n\n**Why did I choose GLS specifically?**\n\nWhen I looked for German schools in Germany, many wrote there might be no class if there aren’t enough students, or that they don’t start A1 classes every week like they do for other levels, so overall I was terrified to go all that way, and end up finding out all classes had been cancelled.\n\nGLS, On the other hand, wrote that if not enough students sign up- each class will be a bit shorter (which was kind of ideal for me).\n\nComparing to other schools I’ve seen online- all schools at had mostly group classes, and the GLS classroom didn’t seem much different- the classrooms were written to be pretty small (up to 8 people), and the textbook they use (Netzwerk Neu) is one of the more popular options I’ve found online. Overall, It seemed like quite a fair school, so I went for it!\n\n**How was my level assessed?**\n\nAfter I signed up, I was asked to do a home-test. This test was pretty short and it tested different aspects of the language separately (vocabulary, listening, reading…). The score was visible for me to watch, but not the actual mistakes I made. On this test I received a score that was mixed between level A1 and A2.\n\nLater, on the first day of school, I was called out for a very short conversation with a teacher (before classes started) to be assessed once again, and ended up being put into an A2 classroom.\n\n**Check-in + pre-studies:**\n\nI first arrived at the school to check into the dormitories on a Sunday evening. The place was pretty easy to find, and there were nice workers at the front desk who helped me check-in. The school seemed a bit deserted but I guessed it was just because it’s a Sunday.\n\nOne thing that annoyed me is the extra fees. I paid what I believed to be the full price in advance, but as I came there I was asked to make 2 extra payments: cleaning fees and a deposit (which had to be in cash). Sadly I had no cash so I had to use the ATM next to the bank which charges INSANE conversion rates.\n\nBut once this was all done, it was time for the first day of school! As the day started, all new students were assembled together. At this point I was taken to do the extra interview as I wrote before, then some messages were read (in both German and English) and we were called by our names and led to our new classroom!:)\n\n**The Classes:**\n\nI entered an A2 classroom (we were overall 6 students, 4 of which are new), and then the teacher came in, distributed our new textbooks, and started talking… in German. ONLY in German. Later I found out some of the students in the class didn’t speak English at all (but all the teachers did). So the first hour was A LOT to handle but I got the hang of it quite fast.\n\nEach day was made of 2 different classes, each was 90 minutes (with 30 minutes break in between) and the classes had different teachers who taught different chapters in the book. I think the classes were balanced quite well, for example there wouldn’t be more than 1 grammatical lesson in 1 day, but I guess it’s for each independent person to decide:).\n\nAt the end of the first day, one classmate asked to move to an easier level, which was no problem for the school, and so the classes continued!\n\nOverall, the classes took about 3.5 hours of my day, always at the same time, plus homework of about 30 minutes at night. I wouldn’t say it was too demanding, definitely can be done while combining other things in your day:)\n\n**Accommodations:**\n\nThe on-campus dorms are very quiet- each room is equipped with it’s own kitchen (which was quite useful) so there aren’t many common areas. If you live there, don’t expect to meet many new people in the dorms.\n\nThe rooms themselves are quite convenient, the bed was wayy to soft for me, but overall I really liked it. The pricing though is quite high, so I do understand why most students choose living in their own apartments while they go there.\n\n**The Extra-curriculum:**\n\nEach week there are multiple events for us students. On mondays, we begin with a “Stammtisch” which is basically a socializing event to meet other students. Not all students come, but it is a great opportunity to meet people from other classes.\n\nOther than those, there are some lectures and going-out to restaurants/markets around (I heard some of those events are for a fee though). Honestly, since most of my friends didn’t sign up for those, I felt kinda awkward to go alone because I didn’t know how many people were joining, so I ended up not going to most… I would say there was a nice variety in those though, so if you’re braver than me, it could be nice😂\n\nOther than that, one thing I heard from my teacher (and could definitely sense in the campus) is that, in December, the school is… quite empty. One person I met told me how all of her friends left one-by-one lately, and the teacher said the school usually empties up around winter vacation, and fills up again little-by-little once it is over. They claim the peak is usually at summer vacation, where all the classes are at 100% full capacity.\n\nFor me, the school felt very quiet, but then we had this christmas event (it was actually really nice) and I realized there are still probably over 100 students at the school, so I really wonder how much it fills up during the summer and being there feels like.\n\n—\n\n**Cons (when comparing to my previous experience):**\n\nFor me, the main con of the school is how untrivial it is to socialize in it.\n\nIn here, we had events to meet all the students every week (and breaks in between classes where we could talk, but we all did other stuff during it), but in China, there was a common-area-canteen for us to eat in each meal of the day- so you would meet most students about 3 times a day. The Chinese school was much smaller and I came there during peak-time (around sept-oct) so I guess my impressions were affected by it as well, but overall it was much easier to communicate with other students there and find people to hand out with (though it might be just the fact I’m not a very social person😅)\n\n—\n\n**Conclusion:**\n\nAs I said before, I really liked this school. The level of teaching was quite high and everyone were really nice and polite. I do think the material could have been taught a bit faster, but when I compared out course to friends in other schools, I realized other schools might be even faster than others. I guess it is the overall style of teaching the language, can fit one or not, I’m just not sure the competition will be better in this aspect.\n\nOne thing I wasn’t a fan of is feeling like I have to pay for anything out of the ordinary. Cleaning fees, a cup of hot water, some of the tours… Just felt like whatever I want, there might be an extra fee for. Kinda annoying as a student. I already paid so much, kinda felt like nothing is enough:/\n\nFor me, the thing that is lacking the most is socializing. As I said, once a week there’s the Stammtisch, but other than that, it didn’t feel like you have a lot of opportunities to meet other people…",
        "created_utc": 1674647406,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the best app to learn English?",
        "author": "Dokayn",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ku9y6/whats_the_best_app_to_learn_english/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/10ku9y6)",
        "created_utc": 1674636804,
        "upvote_ratio": 1.0
    },
    {
        "title": "Flatmate keeps switching to English",
        "author": "Immediate-Fishing-37",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ktyde/flatmate_keeps_switching_to_english/",
        "text": "I recently moved to Austria and my flatmate is from Germany. I’m originally from the US, but have lived in Europe for several years. For the first month or so, we only spoke in German. But then we had a housewarming party, in which I invited some English speaking friends who aren’t as comfortable in German, and since then he’s started trying to speak to me in English, to which I still just reply in German.\n\nA bit after that, we had a slight miscommunication about how often we need to open the windows to let in fresh air (it wasn’t even due to language really, I’m just new to the importance of Stoßlüften). He then said, “I’m going to speak to you in English more from now on.” and explained that he doesn’t feel he can have deep conversations with me in German and doesn’t always know if I understand everything he says. He also said he’s not being paid to be my language teacher, that he doesn’t always have time to explain things, and that it’s inconvenient for him to have to speak a bit slower occasionally or put things into simpler terms. (Note: he speaks very fast and in his own mouth and is one of the toughest German speakers I’ve had to understand)\n\nHe also mentioned “you had no problem speaking with your friends in English, I don’t see why we need to speak German all the time in the flat.” Obviously I have friends that I know different contexts and with different levels of German, but as much as possible, I prefer to speak with German speakers in German - and that includes him.\n\nAs a note, I have previously lived in Austria, and have had German-speaking flatmates, with whom I only spoke in German. I’ve also made friends and gone on dates and done many other things only in German. A few years ago I passed a C1 German test, so it’s not like I’m a beginner struggling to get through a sentence. I would honestly say my German is much better than his English.\n\nSo whenever he speaks to me in English, I honestly feel insulted. It’s not a matter of expecting him to be my language teacher, but I know that my German is good enough to not need English. And it’s important to me in general that people respect that I would rather speak German. After all, I’m the one who’s an ocean away from my home country and has made the effort to put myself in a position to improve my language skills. I should also note that if he were in the US, he would certainly not have the issue of everyone speaking to him in German. And if a German speaker came to my country and really preferred to speak English, I’d respect that and be patient with them.\n\nI can honestly say that when he switches to English, it really bothers me and makes me not really want to engage in a deep conversation. And I understand that beginners shouldn’t expect locals to be their language teachers, but I’m not a beginner and haven’t ever asked much beyond the odd word or two (which I’ve stopped doing at this point). I just want to be treated like anyone else that speaks German. Am I overreacting here?",
        "created_utc": 1674635428,
        "upvote_ratio": 1.0
    },
    {
        "title": "omg i hate this",
        "author": "Chickem_Sammich",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ktgy8/omg_i_hate_this/",
        "text": "I swear to god rolling r's is impossible. I have been practicing for at least 2 years now (yes it really took that long) and I STILL can't do it. I practice for an hour every day and the closest I've gotten was sounding like I was about to have a stroke. I've been doing everything right... except for sounding right.",
        "created_utc": 1674633418,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s better, listening or speaking?",
        "author": "Robbie1815",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ksdcg/whats_better_listening_or_speaking/",
        "text": "So as the title suggests, I would like everybody’s opinion on what might be better, listening or speaking, when learning a new language. For all intensive purposes, this question shouldn’t be taken too seriously.\n\nI understand that there’s many different factors that go into language learning such as learning abilities, preferences, opportunities, etc. - but I would just like to get a general idea, playing the devil’s advocate for both sides possibly.\n\nThe long version of the question should be more like - if you could only learn a language in one fashion, would you rather try to listen to everything for a year and try to speak what you’ve listened to, or only speak for a year and listen to what you’ve spoken?\n\nIt may be a difficult question to ask bc many times you are doing both, listening and speaking, very obviously during a conversation. But I guess what I mean is, if you’re attempting to learn a language from scratch and don’t have a speaking partner, which would be more beneficial. Languages like Spanish may be easier to acquire a speaking partner in places like the United States, but what if you’re attempting to learn a lesser known language.\n\nSo the most basic premise for this is, would you rather sit in front of videos soaking up entire conversations and never saying a word? Or use translation services to speak sentences only and then try to interpret what others are saying from the sentences you spoke?\n\nTo sum it up, like I said before, it’s not an entirely serious question as I know that both speaking and listening are equally important. Just a fun question to take a few seconds to throw an answer out there",
        "created_utc": 1674629011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which language should I pick?",
        "author": "perlatacoffee",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ks22y/which_language_should_i_pick/",
        "text": "I have a bit of an issue.\n\nYou see, at my high school you can choose to take 1 of 3 language classes; English, Spanish, or ASL. Personally, I want to choose either Spanish or ASL, but I'm having a hard time choosing because I want to choose the language that looks the most impressive on a resume/college application.\n\nI am not sure if ASL will look as good as Spanish (according to Google lol).\n\nWhich one do I pick?",
        "created_utc": 1674627853,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning Malayalam - Need Help!!!",
        "author": "Internal-Diver8348",
        "url": "https://www.reddit.com/r/languagelearning/comments/10krqij/learning_malayalam_need_help/",
        "text": "Sugamano, Learned basic Phrases and Consonants, but need to learn more words and letters I'm in the verge of becoming a malayali , I need guidance for Accents, letters Writing, Meaning Etc... I know English and Tamil .",
        "created_utc": 1674626723,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your reward System?",
        "author": "SnooPeppers8957",
        "url": "https://www.reddit.com/r/languagelearning/comments/10kre94/what_is_your_reward_system/",
        "text": "I was looking for a reward system for myself that isn't too distracting (game time would make me want to play the game rather than study), and not too unhealthy (i'd love to treat myself to some candy, for the first few days)\n\nAlso, WHEN do you reward yourself? after each day? after an intense session? after a week of learning a specific aspect of the language?",
        "created_utc": 1674625540,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips to become fluent in spanish ? I was born and raised in spanish culture but when I speak it, it doesn’t sound fluent, I understand it better than I speak it any help would be appreciated",
        "author": "BrodieSzn0",
        "url": "https://www.reddit.com/r/languagelearning/comments/10kr594/any_tips_to_become_fluent_in_spanish_i_was_born/",
        "text": "",
        "created_utc": 1674624668,
        "upvote_ratio": 1.0
    },
    {
        "title": "British English vs. American English",
        "author": "Illustrious-Law6719",
        "url": "https://i.redd.it/ii6l585w14ea1.jpg",
        "text": "",
        "created_utc": 1674618112,
        "upvote_ratio": 1.0
    },
    {
        "title": "learning langauge",
        "author": "Haider_Abdauljabbar",
        "url": "https://www.reddit.com/r/languagelearning/comments/10ko820/learning_langauge/",
        "text": "[removed]",
        "created_utc": 1674615434,
        "upvote_ratio": 1.0
    },
    {
        "title": "Articles in Russian",
        "author": "M0rph0ne",
        "url": "https://i.redd.it/s756rs3ghxda1.jpg",
        "text": "",
        "created_utc": 1674614125,
        "upvote_ratio": 1.0
    }
]