[
    {
        "title": "When is the game coming out?",
        "author": "Outrageous-Estate-75",
        "url": "https://www.reddit.com/r/languagelearning/comments/103jfy7/when_is_the_game_coming_out/",
        "text": "I've been having trouble finding updates. Is the game gonna come out soon? :)",
        "created_utc": 1672876643,
        "upvote_ratio": 0.99
    },
    {
        "title": "Do language certificates really mean something?",
        "author": "PalomaInutilizada",
        "url": "https://www.reddit.com/r/languagelearning/comments/103izur/do_language_certificates_really_mean_something/",
        "text": "Hi everyone, \n\nI'm a normal guy. And I have some hobbies, like all of us do. I always liked to read but since I began learning languages at university, I started to read in different languages until I reached what I believe are B2 or C1 grades.\nIt was never intended to be so, but I reached a point where I was relatively confident with my English and German, so I decided to take an examination for each of them. Even though I have literally never spoken to real people in English.\n\nI always heard about how difficult this examinations were and so on, so I decided to do a multilevel examination for both of the lanfuages since I didn't know my level and didn't want to waste my money. One is called IELTS and the other one is the TestDaF and I achieved what technically is supposed to be C1 on each of them.\n\nBut here is my question: What does it really mean? People are always complaining about these exams, and once they obtain their certification, they instantly think they are some kind of God.\nBut I don't feel so. I don't believe my English or German are that good. With all that expectations I even start to think I don't deserve them.\n\nI'm aware of my lack of knowledge when it comes to certain grammar or vocabulary. To be honest, I don't think that these papers mean something in real life. It is just paper and nothing else.",
        "created_utc": 1672875547,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does it seem like my oral skills are vastly behind my writing/reading?",
        "author": "Raiderofthelostark81",
        "url": "https://www.reddit.com/r/languagelearning/comments/103inv9/why_does_it_seem_like_my_oral_skills_are_vastly/",
        "text": "[removed]",
        "created_utc": 1672874739,
        "upvote_ratio": 1.0
    },
    {
        "title": "Audio in Apps?",
        "author": "mars82missing",
        "url": "https://www.reddit.com/r/languagelearning/comments/103imux/audio_in_apps/",
        "text": "I’ve found in several occasions the audio of some speakers in different language learning apps is muffled or of poor sound quality.\n\nCan’t they revamp it a bit? Duolingo has been okay, except for their Latin… and I’m not sure what else of there’s is like that. I liked Drops, yet that one has low quality audio for Japanese. Same with Memrise, something I could of recorded off my dsi. I guess it’s not that popular with them.\n\nAre there any other recommended services? I’ve tried Rocket but like with Memrise lessons are longer, there’s a good amount of Korean options (but I’m burnt out 😅). For a proper language learning experience, this is the kind of thing I’d expect higher quality.",
        "created_utc": 1672874671,
        "upvote_ratio": 1.0
    },
    {
        "title": "Preventing Motivation Loss after the Honeymoon Phase",
        "author": "moopstown",
        "url": "https://www.reddit.com/r/languagelearning/comments/103ikvg/preventing_motivation_loss_after_the_honeymoon/",
        "text": "I've decided to start in on learning Turkish, for a variety of reasons: there's a Turkish-speaking community nearby, top notch TV shows, \"cats of Istanbul\" IG accounts to follow, fascinating history, and a pretty cool potential travel destination if I ever start traveling again. However, I feel like I've had these types of motivations before for other languages, only for the motivation to fizzle out several months into the process. Part of the problem for me is that I think I get \\*too\\* into it... I start listening to music, following sports, etc., to the point where I feel over-saturated. When that happens, I feel like I start purposefully looking for reasons to stop: human rights abuses in countries where the language is spoken (like that's not happening everywhere), specific language features that I thought were cool are now annoying, they make better tea somewhere else, etc. My logical mind can grasp that every culture has its negative aspects, but once I get into this spiral it sorta feels like nothing can stop it. I'd really like to avoid going down the same slippery slope this time around. Maybe instead of putting all of my attention on the language and culture right at the start, I can sort of take bite-sized chunks at the beginning and then ramp up the immersion later? Or maybe I should just focus on the \"work-like\" process of learning the language without getting into the culture stuff at all? idk, I've never really been proactive at the start of the process before, sorta hoping I can put something in place to stop the pattern. Thanks for any advice!",
        "created_utc": 1672874536,
        "upvote_ratio": 1.0
    },
    {
        "title": "AI Chat Bot for realistic conversations",
        "author": "howdypm",
        "url": "https://www.reddit.com/r/languagelearning/comments/103ik11/ai_chat_bot_for_realistic_conversations/",
        "text": "[removed]",
        "created_utc": 1672874480,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for learning!",
        "author": "ciaracv",
        "url": "https://www.reddit.com/r/languagelearning/comments/103hwk1/advice_for_learning/",
        "text": "I desperately want to learn a new language but I feel I am too stupid and… lazy. I also just feel like I’ll never be able to be fluent. I am half Italian but my dad never taught me Italian, so I really want to learn it but I also REALLY want to learn French. Because my best friend is French I’ve become obsessed with France, it’s also just a very beautiful language. Advice? How do people motivate themselves? Side note: I also get stage fright I feel stupid when speaking a different language, except when i speak Spanish (I understand reasonably well and I can talk basics)",
        "created_utc": 1672872989,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for learning…",
        "author": "ciaracv",
        "url": "https://www.reddit.com/r/languagelearning/comments/103hl76/advice_for_learning/",
        "text": "I desperately want to learn a new language but I feel I am too stupid and… lazy. I also just feel like I’ll never be able to be fluent. I am half Italian but my dad never taught me Italian, so I really want to learn it but I also REALLY want to learn French. Because my best friend is French I’ve become obsessed with France, it’s also just a very beautiful language. Advice? How do people motivate themselves? Side note: I also get stage fright I feel stupid when speaking a different language, except when i speak Spanish (I understand reasonably well and I can talk basics)",
        "created_utc": 1672872241,
        "upvote_ratio": 1.0
    },
    {
        "title": "Codes uTalk",
        "author": "grzegorz0",
        "url": "https://www.reddit.com/r/languagelearning/comments/103gspe/codes_utalk/",
        "text": "U talk 25% discount\n\n UDN45cqaNrqS3f  \n \n\n#### uTalk Language Learning Essentials\n\n JPK6FVM75J",
        "created_utc": 1672870403,
        "upvote_ratio": 1.0
    },
    {
        "title": "My rant about subjunctive mood/tense (as a native French speaker)",
        "author": "paremi02",
        "url": "https://www.reddit.com/r/languagelearning/comments/103gbj5/my_rant_about_subjunctive_moodtense_as_a_native/",
        "text": "I don’t really know where to start… I’ll say this: the subjunctive is the most useless and random linguistic feature I’m aware of. If you don’t speak any language with subjunctive moods or tense (English has them but they’re usually not used even when needed), here’s how it works. \n\nYou have a different conjugation for the present, sometimes past and even future (in Portuguese) when expressing ideas a certain way. These ways include \n\nExhortation or command, Concession, Wish, Question of doubt, Possibility or contingency, Condition, Purpose, Characteristic, Result, Time, Indirect questions.\n\nIn latin languages only. I’m not aware of how this subjunctive mood acts in other languages or if it’s even present, but in latin languages that’s how it is. Let me give you some examples.\n\nHe has to go to the grocery store. In French: Il faut qu’il *aille* à l’épicerie. Note that the present tense of the verb aller when not subjunctive is “va”\n\nI won’t stop reminding you until you do it.\nIn French: Je n’arrêterai pas de te le rappeler jusqu’à temps que tu le *fasses*. The present tense here would be fais. \n\nThese are tricky, and this is just the tip of the iceberg. The real monster in Portuguese, which uses the subjunctive future. \n\nIf I go, will you go with me? In Portuguese: Se eu *for*, você vai comigo? The present tense here would be “vou”. You can see how different these conjugations are, even though in English you use the present tense without loosing any meaning. \n\nIn my opinion, this might be even more of a challenge to completely master than grammatical gender. I just cannot imagine how hard it would be for a native English speaker. For me, most of my knowledge on that feature transfers from french to Spanish and Portuguese, so it’s not that hard.\n\nRant minimized to not be too long to read… so rant over. If you want to rant about this useless tense too, please do so in the replies, I would love to see people sharing my frustrations.\n\nWhy I’m saying it’s useless: you literally don’t lose any meaning if you use the tense without subjunctive.",
        "created_utc": 1672869334,
        "upvote_ratio": 1.0
    },
    {
        "title": "Really need help remembering this program!",
        "author": "youmomas",
        "url": "https://www.reddit.com/r/languagelearning/comments/103fpdu/really_need_help_remembering_this_program/",
        "text": "I remember doing this fun week-long language learning challenge where they would send you a random language and links to resources you could use and you got to go on a language learning sprint of that language. I know that this was an annual thing, and the website was really pretty. I believe either a youtuber or someone on instagram started this challenge. I just for the life of me cannot remember what this was called. Does anyone know what I'm talking about?",
        "created_utc": 1672867900,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should i learn??",
        "author": "strange-man-15",
        "url": "https://www.reddit.com/r/languagelearning/comments/103fepv/what_should_i_learn/",
        "text": "So i speak arabic and i am quite decent in french and English and i want to “learn” (since i only learn via duolingo) another language from : spanish italian german\n\n\n\n\n\nSpanish is nice and i feel like i have some potential to get pretty good at it but things related to spain or spanish speaking countries don’t always pick my interest\n\n\n\n\n\nGerman: i spent a bit of time to learn about it in duolingo but i get a bit bored of it sometimes \nItalian: things related to italy are pretty interesting like food and the language seems pretty easy\n\n\nThanks for reading",
        "created_utc": 1672867228,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finished Portuguese on Duolingo… now what ?",
        "author": "entrepeneur888",
        "url": "https://www.reddit.com/r/languagelearning/comments/103f7gz/finished_portuguese_on_duolingo_now_what/",
        "text": "I finished the Portuguese course of Duolingo to keep learning now where do I go ? I like the structure it provided",
        "created_utc": 1672866757,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Not sponsored) I saw this ad for a game that Incorporates language learning with with gameplay. Do you guys know any other games like this?",
        "author": "bigahkchad",
        "url": "https://i.redd.it/8gxdvaidu4aa1.jpg",
        "text": "",
        "created_utc": 1672866295,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you write \"haha\" in different languages?",
        "author": "asandscarab",
        "url": "https://www.reddit.com/r/languagelearning/comments/103egfb/how_do_you_write_haha_in_different_languages/",
        "text": "So I know that in English you'd write haha, and in Spanish it'd be jaja. But what about in French or Polish or something? Do certain types of languages (Germanic, Romantic, etc) share similar ways of writing this, for instance?",
        "created_utc": 1672865026,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't try to incorporate activities that you normally wouldn't do in your native language!",
        "author": "justwannalook12",
        "url": "https://www.reddit.com/r/languagelearning/comments/103e9ea/dont_try_to_incorporate_activities_that_you/",
        "text": "I have seen posts suggesting that people start writing in a journal  or play this or that game to get more contact time with the language. I feel that if you are a person who doesn't write normally or plays video games as an activity that you enjoy and come back to often, then it doesn't work.\n\nYou are basically, at that point, trying to start **two** habits: learning a language and a daily writing habit or whatever! Don't make it harder than it already is. Do what you know. If after work, all you do is plop down on the couch and hit play on netflix, then that is what you need to do in your target language.\n\nFor example, before I started learning spanish, I would spend hours reading manga and manwha and chinese fantasy novels. And now I read them in spanish!",
        "created_utc": 1672864574,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finding motivation to learn a language while studying",
        "author": "Idonotlikewaffles",
        "url": "https://www.reddit.com/r/languagelearning/comments/103e1zj/finding_motivation_to_learn_a_language_while/",
        "text": "I'm not sure if this subreddit is the right place for this post, but I suppose it's worth a try. \n\nI (17) am currently in high school studying a music program. I am a person who cares about my grades and I try to do all my assignments on time. I started studying Japanese on my own maybe a year or so ago, and I really liked it, but I quit after about 6 months because it was tiring to learn a lot of different things in school while attempting to learn an entirely new language on my own. There's no way for me to have access to a coach or classes, so I stocked up on books. They were helpful, but once again, I found it very tiring to learn a language on top of everything else and I didn't know how to find time for both rest and sessions to practice. \n\nNow that I've stopped studying Japanese, I miss it and it's something I want to pick up again. How do you find time and energy to master a new language while studying/working full time? Any advice is appreciated.",
        "created_utc": 1672864121,
        "upvote_ratio": 1.0
    },
    {
        "title": "Brazilian Portuguese vs European Portuguese",
        "author": "allrightlad",
        "url": "https://www.reddit.com/r/languagelearning/comments/103dujt/brazilian_portuguese_vs_european_portuguese/",
        "text": "Hey, all\n\nI'm planning a trip to Portugal in the summer. I'm learning Brazilian Portuguese with RS and since I'm originally from Argentina, a lot of the vocabulary is pretty accessible. However, I'm aware of the differences and I'd like to tackle them with enough time. Can you recommend any YT channel or online resources to, say, make the transfer between the two variants? Thanks",
        "created_utc": 1672863618,
        "upvote_ratio": 1.0
    },
    {
        "title": "Langotalk - AI Bot to practice a second language",
        "author": "oopiex",
        "url": "https://www.reddit.com/r/languagelearning/comments/103dt89/langotalk_ai_bot_to_practice_a_second_language/",
        "text": "Hi everyone!\n\nI'm Ariel, a designer &amp; developer working on an AI service to help with language learning.\n\nFor a while, I've been experimenting with creating different AI Bots based on OpenAI's API, I started just a moment before ChatGPT was announced. I was very hyped about what GPT-3 can do.\n\nAfter talking to many people who are learning a new language, I realized people are really looking to practice a language they're learning, and many feel intimidated speaking to strangers.\n\nThat made me create Langotalk, which is a companion that can speak the language you're learning (currently supports French, Spanish, German, Dutch, English, and Italian).\n\nWhile my goal is to help learn a language, it's currently mostly helpful to practice it - the bots can speak the language you choose about whatever you'd like, and you can translate anything you don't understand, there are also suggested topics to choose from and direct the conversation. So I'm trying to help with supplying fun language pals for people with some social anxiety, not replace teachers :)\n\nPersonally, I'm still taking 1:1 classes to learn Spanish with a teacher, but looking for ways to integrate some of the stuff I learn there into Langotalk.\n\nWould be interested in hearing any thoughts or feedback.  \n\n\n[Langotalk](https://www.langotalk.org)",
        "created_utc": 1672863535,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would studying Latin increase the ease to learn other European Languages?",
        "author": "Just_Velvet",
        "url": "https://www.reddit.com/r/languagelearning/comments/103dsq5/would_studying_latin_increase_the_ease_to_learn/",
        "text": "I keep making connections between ingles y español and I keep wondering if just learning Latin first would be an immediate gateway to learning most European Languages such as German and French.",
        "created_utc": 1672863500,
        "upvote_ratio": 1.0
    },
    {
        "title": "Persian? Arabic? Please help with translate on this ancient piece",
        "author": "SnooWords328",
        "url": "https://www.reddit.com/gallery/103dj23",
        "text": "",
        "created_utc": 1672862882,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are most of your friends native English speakers? Do you have many ESL friends?",
        "author": "AdorableFluffy123",
        "url": "https://www.reddit.com/r/languagelearning/comments/103cu00/are_most_of_your_friends_native_english_speakers/",
        "text": "This is a question for the native English speakers. Do you have a lot of ESL friends or are most of your friends native English speakers? Just kinda curious about that.",
        "created_utc": 1672861253,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I take a danish certification?",
        "author": "cldnpl",
        "url": "https://www.reddit.com/r/languagelearning/comments/103cs6p/how_can_i_take_a_danish_certification/",
        "text": "I’ve been studying danish since 6 months and I’d like to take a certification (don’t know the level yet) in the future, since I’d like to move to Denmark and work there.\nI live in Italy and in the nearby Universities there are no Danish courses where I can take the certification.\nCan anyone help me?",
        "created_utc": 1672861139,
        "upvote_ratio": 1.0
    },
    {
        "title": "Language (comic by Sarah Andersen)",
        "author": "Bot_Victor",
        "url": "https://i.redd.it/9y7m8urgu0aa1.jpg",
        "text": "",
        "created_utc": 1672861079,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best way of learning a new language?",
        "author": "Tobeezz",
        "url": "https://www.reddit.com/r/languagelearning/comments/103ce4d/what_is_the_best_way_of_learning_a_new_language/",
        "text": "Hello! \n\nI am interested in learning spanish and would like to hear what method(s) you find best for learning a new language. I have considered mobile apps due to it having an easy to understand UI and being flexible, but was immediately hesitant when they promted me with billing info to continue further learning. Is it worth the cost?\n\nThank you!",
        "created_utc": 1672860242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Language exchange with partner, where to start?",
        "author": "-ahoySexy-",
        "url": "https://www.reddit.com/r/languagelearning/comments/103cafa/language_exchange_with_partner_where_to_start/",
        "text": "I'm a native Brazilian Portuguese speaker and my partner is a native Tagalog speaker. We communicate through English, and we've been wanting to learn each other's languages, with no rush to get fluent quickly. We are complete zeros in the other's language and I was wondering what would be the best way to start learning. Should we start studying separately to learn the basics and such before trying to communicate, or is there a way we could exchange from the very start?  Any insights and alternative ways would be much appreciated.",
        "created_utc": 1672860010,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to learn hungarian vocabulary",
        "author": "beuwkypoxptqttrsyq",
        "url": "https://www.reddit.com/r/languagelearning/comments/103bt3d/how_to_learn_hungarian_vocabulary/",
        "text": "Back when I studied latin, I had to memorize the genitive case, the grammatical gender and (of course) the translation for every noun in my vocabulary list. (The idea being that almost all information about a given noun's declension is revealed when knowing its genitive case and its grammatical gender.) A vocabulary flashcard for a noun would look something like this:\n\n&gt;**Front**: factum *(nominative case singular)*  \n&gt;  \n&gt;**Back**: facti *(genetive case singular)*, n. *(grammatical gender)*, fact *(translation)*\n\nFor verbs, one needs to memorize a variety of conjugations to reveal almost all information about a verb's conjugation:\n\n&gt;**Front**: dare *(infinitive)*  \n&gt;  \n&gt;**Back**: do *(present tense indicative actice 1. person singular)*, dedi *(perfect tense indicative active 1. person singular)*, datum *(participle perfect)*, to give (*translation*)\n\n&amp;#x200B;\n\nI was wondering how flashcards for learning hungarian words would look like. I read that hungarian nouns don't have a grammatical gender and almost all information about an hungarian noun is revealed when knowing its plural. My flashcards could look something like this:\n\n&gt;**Front**: nap *(nominative case singular)*  \n&gt;  \n&gt;**Back**: napok *(nominative case plural)*, day *(translation)*\n\nAlso, I read that an hungarian verb's stem is identical to the present tense 3. person singular indefinite form. Other than the conjugation of some irregular verbs, I guess that there's not much more to be memorized. A flashcard may look something like this:\n\n&gt;**Front**: kíván *(present tense 3. person singular indefinite form)*  \n&gt;  \n&gt;**Back**: to wish *(translation)*\n\n&amp;#x200B;\n\nI was wondering if I'm on the right track with all of this. Maybe I am overthinking things and maybe my experience from learning latin doesn't transfer as well as I thought it would. I would like to hear your thoughts on how to make good flashcards on hungarian words.",
        "created_utc": 1672858910,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone suggest any online language courses that involve a lot of socializing (i.e. making new friends *and* learning a new language)?",
        "author": "MystaED",
        "url": "https://www.reddit.com/r/languagelearning/comments/103bpgf/can_anyone_suggest_any_online_language_courses/",
        "text": "Hey everyone. This is a bit of an awkward question, but can anyone recommend online language classes where there is a lot of emphasis on socializing with others? I feel like my mother could expand her social circle cuz she doesnt go out much. Its not easy to make new friends when youre older, especially when there isnt really anywhere to go around your home to do so. But she has always expressed an interest in learning another language. So I imagine I'm looking for live classes where students interact with each other. I know a lot of people prefer the learn-at-you-own pace programs (Pimsleur, Duolingo etc.), but if anyone can suggest something live and social-based, I'd be appreciative. Thanks!",
        "created_utc": 1672858690,
        "upvote_ratio": 1.0
    },
    {
        "title": "New language learner",
        "author": "King_Kyle99",
        "url": "https://www.reddit.com/r/languagelearning/comments/103a7ky/new_language_learner/",
        "text": "Hello everyone, I am new to learning a language. I have been researching the best ways to learn. I read that Duolingo and  Rosetta Stone is the best way to learn. What are everyone's best practices?",
        "created_utc": 1672855241,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which mobile language learning app worked for you?",
        "author": "ceezspeaks",
        "url": "https://www.reddit.com/r/languagelearning/comments/1039rnt/which_mobile_language_learning_app_worked_for_you/",
        "text": "Which mobile language learning app worked for you and why?",
        "created_utc": 1672854244,
        "upvote_ratio": 1.0
    },
    {
        "title": "For students of rare languages",
        "author": "coding_marshmallow",
        "url": "https://www.reddit.com/r/languagelearning/comments/1039oui/for_students_of_rare_languages/",
        "text": "[r/uncommonlanguages](https://www.reddit.com/r/uncommonlanguages/) is a new subreddit dedicated to passionate learners and speakers of rare languages.\n\nFeel free to join.",
        "created_utc": 1672854062,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for english spanish learners to make a wsp comunity",
        "author": "666ab0",
        "url": "https://www.reddit.com/r/languagelearning/comments/10398o9/looking_for_english_spanish_learners_to_make_a/",
        "text": "",
        "created_utc": 1672853002,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hot Take Alert 🚨- Duolingo is one of the best resources out there for even advanced language learners, but most of you are using it wrong.",
        "author": "miika2121",
        "url": "https://www.reddit.com/r/languagelearning/comments/1038o26/hot_take_alert_duolingo_is_one_of_the_best/",
        "text": "Let me get straight to the point. If you are an advanced language learner then the lower levels of each unit in Duo are useless, even the “advanced” units further down the tree. You get almost nothing out of simply matching words to their meaning or constructing sentences when you are already the vocabulary, conjugations, and sentence structure. HOWEVER, at the legendary levels of a given unit (to reach the gold/purple color), you have to complete exclusively translation/grammar/listening exercises. The translation exercises you do at the legendary levels on Duo are unmatched. No book, youtube channel, or tutor can provide you with the same level of consistent, immediate, crowdsourced grammar corrections as Duolingo.\n\nFor this reason, if you’re an advanced student you should be testing out of the lower levels of every unit and going straight to the legendary levels. \n\nAlso want to note that I’m not saying Duo is all you need to learn a language. But I do think it is the best tool for practicing grammar based on my own anecdotal evidence. I’ve worked my way through entire grammar workbooks and I just don’t think they’re as useful. I find that repetition and autocorrection are the most important parts of improving grammar, and Duolingo does both of those thing so well at the legendary levels. I’ve been using it myself for the past 1.5 years to achieve B2 in spanish, along with daily Anki review and weekly conversational italki lessons. \n\nSorry for the clickbaity title… But I’m Interested to hear your thoughts!",
        "created_utc": 1672851688,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should I learn",
        "author": "Potentially-allone",
        "url": "https://www.reddit.com/r/languagelearning/comments/1038hik/what_should_i_learn/",
        "text": "[removed]",
        "created_utc": 1672851290,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yet to rip the band-aid, advice on any sources to help speech and listening?",
        "author": "ocFerg",
        "url": "https://www.reddit.com/r/languagelearning/comments/1037wpw/yet_to_rip_the_bandaid_advice_on_any_sources_to/",
        "text": "I've exhausted using Duolingo, Memrise and others when expecting to itch the scratch for practicing speaking and listening.\n\nI'm doing the low-fi method of watching TV, Listening to music and more in my TL but wondered if anyone has come across a similar/gamified platform (like Duolingo) that would work to improve these areas?\n\nI can't afford a tutor, not yet confident to speak with a partner (I will rip that band-aid off soon) and struggling to find cases to use it.\n\nAnyone in a similar problem to me and if so what's your advice?",
        "created_utc": 1672849888,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you mix hobbies and language learning?",
        "author": "inkfade",
        "url": "https://www.reddit.com/r/languagelearning/comments/1037lr9/do_you_mix_hobbies_and_language_learning/",
        "text": "My only hobby I'd say is fountain pens, and I use them to take notes when I study Spanish. The past couple of days I've been transcribing a podcast and having a blast because I was using one of my favorite pens and inks, while also learning Spanish lol. Sometimes it makes studying a lot more fun, and can even be an incentive when I don't feel like studying.\n\nHow do you guys mix hobbies and language learning?",
        "created_utc": 1672849174,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feedback on my new game for learning song lyrics, Lyric Puzzle",
        "author": "draft0",
        "url": "https://www.reddit.com/r/languagelearning/comments/1036voc/feedback_on_my_new_game_for_learning_song_lyrics/",
        "text": "Happy New Year, everybody!\n\nA couple months we [posted about our app Roxxem here](https://www.reddit.com/r/languagelearning/comments/yd3hpn/my_friend_and_i_built_an_app_to_learn_french/), which was pretty well received.\n\n(Recap: Learn Spanish, French, and Chinese through music. We have a [web app](https://www.roxxem.com/), an [iOS app](https://apps.apple.com/us/app/roxxem/id1611665128), and an [Android app](https://play.google.com/store/apps/details?id=com.roxxem.peaksay). Try it out for free.)\n\nI just added a new game mode to Roxxem called Lyric Puzzle which I'm really excited about, and would love to get feedback from y'all on.\n\nLyric Puzzle is a puzzle game where you match words and lyrics together. Listen to the lyric you need to complete, then build the lyric, word-by-word, before your moves run out.\n\nThink Candy Crush Saga meets Concentration.\n\nCheck out [this video of me playing Lyric Puzzle](https://www.youtube.com/watch?v=c2J7SQSNMj0), or [read my blog post about it](https://www.roxxem.com/blog/introducing-lyric-puzzle).\n\nIt's a whole new way to learn song lyrics, and unique in this space, as far as I know. I've been using it to learn \"Despacito\" myself and I think it's pretty fun and effective :)\n\nTry it out and let me know what you think! This is only the first version of the game, so with your help it will continue to get better.\n\nHugo",
        "created_utc": 1672847439,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Video Game Map Theory of Language Learning",
        "author": "the_real_gunkorn",
        "url": "https://www.youtube.com/watch?v=3i1lNJPY-4Q&amp;ab_channel=JohnnyHarris",
        "text": "",
        "created_utc": 1672847176,
        "upvote_ratio": 1.0
    },
    {
        "title": "People who speak natively 2 languages (since birth), is it weird when you switch language while talking to a friend who shares exactly the same native bilinguality?",
        "author": "Lge24",
        "url": "https://www.reddit.com/r/languagelearning/comments/1036o3a/people_who_speak_natively_2_languages_since_birth/",
        "text": "Suppose your parents both raised you in their respective native language, and your fluency is equal in both languages. Your best friend grew up with you in the same context - do you casually switch from one language to another?\n\nI'm wondering this because my friend and myself speak French natively, however his girlfriend is from Spanish and mine is Greek, so the common language is English for everyone. As soon as ladies leave the conversation, we switch back to our native language (which makes sense), it would be too weird to keep it in English. How is it when you share a second native language?",
        "created_utc": 1672846912,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does Preply market itself like a cam site ? do they think language learners will book more lessons based on the teacher's attractiveness?",
        "author": "AdministrationNew319",
        "url": "https://i.redd.it/2wybrhduq1aa1.jpg",
        "text": "",
        "created_utc": 1672846790,
        "upvote_ratio": 1.0
    },
    {
        "title": "Machine Speak",
        "author": "KhaosCXI",
        "url": "https://www.reddit.com/gallery/1035xxm",
        "text": "",
        "created_utc": 1672845095,
        "upvote_ratio": 1.0
    },
    {
        "title": "A typing game where you can add your own words",
        "author": "MajorasMaks13",
        "url": "https://www.reddit.com/r/languagelearning/comments/1035x21/a_typing_game_where_you_can_add_your_own_words/",
        "text": "I'm going to have mock exams next week and one of them is German, so I wanted to use a typing game for learning vocabulary and I know game like typing of the dead overkill but I dont know how to add my own words in there. Does anyone know a game that fits the description? It can be a browser game or an actual game it doesn't matter. Thanks in advance.",
        "created_utc": 1672845033,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the best places to find definitions of odd and rare English words and phrases?",
        "author": "very_large_ears",
        "url": "https://www.reddit.com/r/languagelearning/comments/1035llt/what_are_the_best_places_to_find_definitions_of/",
        "text": "I'm doing literary research related to the author Annie Proulx who likes exotic vocabulary. Most recent example: 'she-var needles,' a product or thing that cleared out a character's bowels and the definition of which cannot seemingly be found.",
        "created_utc": 1672844242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for multilingual books for adults!",
        "author": "christophfi",
        "url": "https://www.reddit.com/r/languagelearning/comments/1034sc2/looking_for_multilingual_books_for_adults/",
        "text": "Hi everyone!\n\n*Upfront: I'm sorry if this question has been raised before. I went through the Wiki &amp; the resource section but could not find what I was looking for. Refrain from jumping on somebody asking for help. Please be nice. :)* \n\n*So here it goes.*\n\nGrowing up a native German speaker, I combined my love for reading books with language learning. To improve my school grades in English &amp; French, I started reading multilingual children's books. Those books told the story in two languages. Each page was translated in German (my mother tongue) and English or French respectively. Hence, I was able to switch back and forth, whenever I did not understand the English/French wording or concept. The story was identical. \n\nNow. 20 years later, I am learning Spanish and am researching multilingual books in Spanish/English. Unfortunately, I was not able to find interesting multilingual books for adults. \n\nAs a move of last despair, I am turning to you, to ask if you came across any interesting/ exciting multilingual books for adults (Spanish/English).\n\nThank you and have a lovely day!\n\n&amp;#x200B;\n\nCheers\n\nChris",
        "created_utc": 1672841997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Anki Deck To Study Norwegian (Bokmål)?",
        "author": "Chrismaniak",
        "url": "https://www.reddit.com/r/languagelearning/comments/1034s04/best_anki_deck_to_study_norwegian_bokmål/",
        "text": "[removed]",
        "created_utc": 1672841968,
        "upvote_ratio": 1.0
    },
    {
        "title": "The New, Most Interactive Language Learning Game, Fluyo will be released soon, Sign up now!",
        "author": "Agreeable_Network_36",
        "url": "https://www.reddit.com/r/languagelearning/comments/1034jes/the_new_most_interactive_language_learning_game/",
        "text": "[https://fluyoapp.com/?kid=2JJHKK](https://fluyoapp.com/?kid=2JJHKK)",
        "created_utc": 1672841315,
        "upvote_ratio": 1.0
    },
    {
        "title": "I built an OpenAI Whisper powered audio translation service",
        "author": "Electrical-Web4856",
        "url": "https://www.reddit.com/r/languagelearning/comments/1034ihp/i_built_an_openai_whisper_powered_audio/",
        "text": "OpenAI Whisper has impressive translation performance from over 50 languages to English. I spent my holiday building an affordable service which is powered by whisper.\n\nIt's called [BearScribe.com](https://BearScribe.com) and if you want to test it out, you get a free preview if you upload some audio with your email (but we won't send you any emails!). Hopefully folks will find it useful if you want to translate and learn from audio or video you have.\n\nExcited to hear peoples' feedback!",
        "created_utc": 1672841243,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much easier to learn korean after japanese?",
        "author": "BloomSoft",
        "url": "https://www.reddit.com/r/languagelearning/comments/1033o7d/how_much_easier_to_learn_korean_after_japanese/",
        "text": "I know the amount it takes to learn a different language is how similar it is to a language you already know. \n\nLet's say you are a native English speaker and learn Japanese to a pretty fluent level in 3 years maybe N2 or something. \n\nHow would long would it take to learn korean to a similar level? The grammar is very similar from what I understand but the vocabulary I guess is different. Anyone have any experience learning both?",
        "created_utc": 1672838794,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gaining emotion in 2nd language",
        "author": "Bobspen66",
        "url": "https://www.reddit.com/r/languagelearning/comments/1032xm6/gaining_emotion_in_2nd_language/",
        "text": "So it is pretty well-known that youre not gonnna have the same emotional connection to your second language isn't as to your first language. Do you think there is any way to  ´gain´ some sort of emotionality in a 2nd language? Is there any way to 'solve' this? I would really like to *feel* the same emotional richness in my 2nd language.",
        "created_utc": 1672836622,
        "upvote_ratio": 1.0
    },
    {
        "title": "Survey for learners of uncommon languages",
        "author": "coding_marshmallow",
        "url": "https://www.reddit.com/r/languagelearning/comments/103297v/survey_for_learners_of_uncommon_languages/",
        "text": "Hello, I'm conducting survey for learners of rare languages (think Celtic, Maltese, Tiv, Hebrew, ...).  \nI understand there's a lack of quality teaching materials for rare languages (recordings for shadowing, exercises for developing listening skills through dictation etc).  \nWe have a way of fixing this problem however we need to establish  \nsustainability of the project.  \n\n\nSpeaking of rare language of your choosing how much would you be willing to invest into learning it  \nevery month ?  \n\n\nOnly seriously. Leave a comment below.",
        "created_utc": 1672834602,
        "upvote_ratio": 1.0
    },
    {
        "title": "The best French courses online to take?",
        "author": "NotMarilynMonroeXO",
        "url": "https://www.reddit.com/r/languagelearning/comments/1030x39/the_best_french_courses_online_to_take/",
        "text": "Really want to go to France soon and thought it would be a fantastic idea to learn some",
        "created_utc": 1672830342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone here wants to learn Tagalog? Will teach for free, I'm just bored lol",
        "author": "icebear_salad",
        "url": "https://www.reddit.com/r/languagelearning/comments/1030uri/anyone_here_wants_to_learn_tagalog_will_teach_for/",
        "text": "",
        "created_utc": 1672830134,
        "upvote_ratio": 1.0
    },
    {
        "title": "talking to people in the language you’re learning",
        "author": "rollo4fuenfer",
        "url": "https://www.reddit.com/r/languagelearning/comments/1030i2l/talking_to_people_in_the_language_youre_learning/",
        "text": "Recently I’ve been getting really frustrated because I dont have anyone to actually practice the languages I‘m learning (spanish and russian) and therefore can’t really improve my conversation skills. How do you find people to talk to in the language you’re learning (without travelling to that country)?",
        "created_utc": 1672829027,
        "upvote_ratio": 1.0
    },
    {
        "title": "French R",
        "author": "Front-Locksmith-8453",
        "url": "https://www.reddit.com/r/languagelearning/comments/102zwbk/french_r/",
        "text": "[removed]",
        "created_utc": 1672827040,
        "upvote_ratio": 1.0
    },
    {
        "title": "Biological limit to the amount of languages one can really master?",
        "author": "Snowiich",
        "url": "https://www.reddit.com/r/languagelearning/comments/102z93a/biological_limit_to_the_amount_of_languages_one/",
        "text": "I just feel like there is some kind of limit we have as far as our memory goes about how many languages one can truly master at a really high level (so after years of learning).\n\nI found out 2 different ways of what \"to truly master a language\" means:\n1. Mastering the input, this takes much less memory space than output since one doesn't have to look for words and stuff, just being exposed. Hence, one can have more active languages of that \"input only\" type.\n2. Mastering input &amp; output, this takes much more memory space as one needs to look for words, expressions etc.\n\nAlso, I need to add the limited supply of daily energy and time to the equation. Which makes it hard to maintain multiple languages and what got me thinking of that biological limit. Obviously, it is hard to put any number to that as it depends on too many factors. (language family, motivation, learning capacity, discipline, etc.)\n\nI'm talking about really high level skills and not intermediate and below as I'm interested in them but there's surely also a limit to them.\n\nHave you ever come to such a limit? Has it bothered you? Do you think there is a limit at all? Personally, learning too many languages (in a rather short period of time) has confused me to the point where I couldn't find the juicy advanced words I once knew, which is why I'm not interested in learning too many languages during this life.",
        "created_utc": 1672824758,
        "upvote_ratio": 1.0
    },
    {
        "title": "tilt/bend/lean/incline difference",
        "author": "NurYanov",
        "url": "https://www.reddit.com/r/languagelearning/comments/102z030/tiltbendleanincline_difference/",
        "text": "",
        "created_utc": 1672823858,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for learning languages!",
        "author": "RooxWasTaken",
        "url": "https://www.reddit.com/r/languagelearning/comments/102ybw6/tips_for_learning_languages/",
        "text": "[removed]",
        "created_utc": 1672821294,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the most \"niche\" language you know and why did you pick it up?",
        "author": "vulcantrixter97",
        "url": "https://www.reddit.com/r/languagelearning/comments/102xhv5/what_is_the_most_niche_language_you_know_and_why/",
        "text": "",
        "created_utc": 1672818217,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Tone Deafness Affect Tonal Languages?",
        "author": "Front-Locksmith-8453",
        "url": "https://www.reddit.com/r/languagelearning/comments/102wr4n/does_tone_deafness_affect_tonal_languages/",
        "text": "This may be a really stupid question but I was curious if tone deafness affected how u heard tonal languages",
        "created_utc": 1672815645,
        "upvote_ratio": 1.0
    },
    {
        "title": "Babylonian Chaos - Where all languages are allowed - January 04, 2023",
        "author": "kungming2",
        "url": "https://www.reddit.com/r/languagelearning/comments/102vnuk/babylonian_chaos_where_all_languages_are_allowed/",
        "text": "Welcome to Babylonian Chaos. Every other week on Wednesday 06:00 UTC we host a thread for learners to get a chance to write any language they're learning and find people who are doing the same. Native speakers are welcome to join in.\n\nYou can pick whatever topic you want. Introduce yourself, ask a question, or anything!\n\nPlease consider sorting by new.",
        "created_utc": 1672812011,
        "upvote_ratio": 1.0
    },
    {
        "title": "What language did you invest a lot of time in then suddenly drop?",
        "author": "vulcantrixter97",
        "url": "https://www.reddit.com/r/languagelearning/comments/102vk0j/what_language_did_you_invest_a_lot_of_time_in/",
        "text": "[removed]",
        "created_utc": 1672811667,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to begin learning Spanish?",
        "author": "rjneltron",
        "url": "https://www.reddit.com/r/languagelearning/comments/102v84d/how_to_begin_learning_spanish/",
        "text": "Hey everyone. I am a native English speaker and have always wanted to learn a new language. Since I already know some basic Spanish from two years of high school, I thought that would be a good one to learn. I want to know where should I start? I remember some of the basic words and grammar rules so I don’t have to completely start over but I want to know what’s the best option for me. I’m a college student as well and would like to keep it as free as possible. \n\nIf anyone could give me any tips to help since I’m at square one, that would be very helpful. I’ve used Duolingo a little bit but not the biggest fan of how slow the learning process is. I know there are many resources for Spanish learners so I’m hoping to gather those as well.\n\nPlease comment or feel free to PM me! Thank you in advance!",
        "created_utc": 1672810596,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does saying Domo Arigato have to mean you’re very happy?",
        "author": "Songojames",
        "url": "https://www.reddit.com/r/languagelearning/comments/102ur3k/does_saying_domo_arigato_have_to_mean_youre_very/",
        "text": "The voices in my head said “Domo R.E Arigato” if this has to mean it’s very happy then I’m going to be ruined because it’s witchcraft and it’s only happy through ruining my life.\n\nDoes saying Domo Arigato have to mean you’re happy with what you’re saying Domo Arigato to? Can you say make sense if you say Domo Arigato to something or someone you’re unhappy with? \n\nAlso I heard the Kanji meaning of Arigato means difficult but thanks, does this mean saying Domo Arigato can mean difficult but big thanks or something like that?",
        "created_utc": 1672809153,
        "upvote_ratio": 1.0
    },
    {
        "title": "Flashcards",
        "author": "illuso07",
        "url": "https://www.reddit.com/r/languagelearning/comments/102uh6e/flashcards/",
        "text": "Is it better to do flashcards with translations into your native language or with synonyms and definitions in your target language.",
        "created_utc": 1672808337,
        "upvote_ratio": 1.0
    },
    {
        "title": "E-reader application/websites with default audio dictionary",
        "author": "Y709",
        "url": "/r/ereader/comments/102rr8r/ereader_application_with_default_audio_dictionary/",
        "text": "",
        "created_utc": 1672801147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why can’t I stop language attrition?",
        "author": "partitive",
        "url": "https://www.reddit.com/r/languagelearning/comments/102rnz3/why_cant_i_stop_language_attrition/",
        "text": "From earliest childhood, I have been speaking Russian and continue speaking it my family. From age 2, I have been traveling between the US and Russia yearly, so I was pretty much equally proficient in both languages by around age 7(?), even though Russian was my native language, I guess English would be my second native language in this case, although I typically mark it as “L2.” I never had any problems expressing myself clearly in Russian until recently. Losing this language is a big fear of mine, as language is part of my perception of the world. When I speak a different language, I experience a completely different way of thinking, and different types of emotions, that I would simply not able to experience being monolingual. When speaking in Russian, I very often make grammatical errors now, and I often have to direct myself to the internet to know if the sentence I structured was grammatically correct. A bit ago on Reddit, I asked how to stop this process of attrition (which I wrote in Russian), and I was told that I have to constantly be immersed in the Russian sphere (e.g. reading books, watching films, etc.) Since then, I have been reading and watching Russian films daily, but I still feel as if my language isn’t as strong enough as it was before, maybe even weaker now than when I originally asked the question. I can feel my Russian fading away more and more every day the more I speak to people. I even took the time to relearn most of the grammatical rules, as I was always cautious of making grammatical mistakes in Russian and fearing that it would make other, more proficient, native speakers look down on me, but I feel as if learning the rules of the language made me lose some of my intuitive grammatical abilities. To sum it up, everything I do pretty much doesn’t feel like it’s working. How should I go about this?",
        "created_utc": 1672800223,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you “dabble” in languages?",
        "author": "sargassum624",
        "url": "https://www.reddit.com/r/languagelearning/comments/102rb3v/how_do_you_dabble_in_languages/",
        "text": "I am focusing my efforts on Korean and Spanish right now for career/personal reasons, but there’s so many languages I want to dabble in without necessarily heavily studying them (at least for now, since Korean and Spanish are taking all my efforts). I was curious — is anyone in the same situation and actively dabbling in other languages for fun? How do you do that without confusing your main target languages? For example, I really want to study a bit of French, Chinese, and Japanese, but those are similar enough to my main languages that I’m worried about mixing up the words. (I already do from what little knowledge I do have hahaha.) I’ve played with Duolingo in the past, but want to know if anyone has different ways of dabbling. TIA!",
        "created_utc": 1672799239,
        "upvote_ratio": 1.0
    },
    {
        "title": "Babbel, Duolingo or LingoDeer",
        "author": "Absolutely-Epic",
        "url": "https://www.reddit.com/r/languagelearning/comments/102qx35/babbel_duolingo_or_lingodeer/",
        "text": "[removed]",
        "created_utc": 1672798186,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning two Languages the same time/Language Recovery",
        "author": "magerize1",
        "url": "https://www.reddit.com/r/languagelearning/comments/102pv8t/learning_two_languages_the_same_timelanguage/",
        "text": "Hey guys. My 2nd language is Brazilian Portuguese which I started learning back in Summer of 2019. I was relatively consistent with it for about 2 years or so, but then gained an interest in other things. Now I've been on and off with the language for about 2 years now and want to get back into it. However, recently I've gotten serious with a girlfriend who is Cuban and the majority of the family does not speak English, so I have to learn Spanish. What do you guys recommend I do. I decided in the new year that I would learn Spanish, which I have started doing but I also want to recover my Portuguse. Does anyone have any advice for how to go about this?",
        "created_utc": 1672795363,
        "upvote_ratio": 1.0
    },
    {
        "title": "Emptiness from starting language learning",
        "author": "greyslopp",
        "url": "https://www.reddit.com/r/languagelearning/comments/102olyn/emptiness_from_starting_language_learning/",
        "text": "Around 2 years ago I played a lot of online video games like any young chap and I met some French folks. I romanticized the idea of learning French to communicate with them because their English wasn’t the bet and I thought it would be fun. I was right. It’s an absolute ton of fun and one of my favorite things to do. I’ve met a lot of French people and even had many French friends where we only talked in French and English was never really a language used too often unless they wanted to practice with me (which I love helping). However over time people drift away and I don’t know any of those people anymore. It makes me happy to think and reminisce but as well it makes me feel empty inside. Because at the end of the day I learned the language to communicate and now I simply have no one to communicate with anymore. Anyone else feel have a similar experience?",
        "created_utc": 1672792139,
        "upvote_ratio": 1.0
    },
    {
        "title": "doubts...",
        "author": "Adventurous-Cold-308",
        "url": "https://www.reddit.com/r/languagelearning/comments/102n1d6/doubts/",
        "text": " If I wrote an original Quenya or Sindarin grammarbook, not using any of Tolkien's works inside of it, just a pure grammar... would I be able to sell it or would it be illegal?",
        "created_utc": 1672788268,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Why am I learning Ukrainian? Because language is political for the country I’ve grown to love\"",
        "author": "2punto0",
        "url": "https://www.theguardian.com/commentisfree/2023/jan/02/learning-ukrainian-language-political-solidarity-victims-vladimir-putin",
        "text": "",
        "created_utc": 1672786730,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are phrases in a language you speak that seem positive but are only said in negative contexts?",
        "author": "abdo1231997",
        "url": "https://www.reddit.com/r/languagelearning/comments/102l8iy/what_are_phrases_in_a_language_you_speak_that/",
        "text": "So everyone can understand what I mean, in English if you tell someone ‘Thanks a lot’ it means you made the situation worse instead of helping.\n\nAnd if someone says ‘I’m fine’ that person is not fine at all.",
        "created_utc": 1672784058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this accurate? the scripture?",
        "author": "Able-Introduction-43",
        "url": "https://i.redd.it/egomwfchzx9a1.jpg",
        "text": "",
        "created_utc": 1672783270,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to learn Turkish without it interfering with my Kurdish?",
        "author": "mary_languages",
        "url": "https://www.reddit.com/r/languagelearning/comments/102jxww/how_to_learn_turkish_without_it_interfering_with/",
        "text": "Hello everybody, \n\nas some of you may already know I'm learning Kurdish. Right now I want to learn how to read in Turkish. Therefore I've booked a lesson on Italki with a teacher that offer \"literature classes\", but I am still A1, so I'll probably have to get some general lessons before diving in a deeper subject like Orhan Pamuk's books. \n\nSo, my question is as follows: how can I keep my Kurdish \"safe\" while learning Turkish. I'm already taking weekly Kurdish lessons and now I'm taking part in a challenge where we receive a Kurdish text everyday in January. But I'm afraid that the more I'll progress in Turkish, the worse will my Kurdish become because usually, this is what happened and happens to Kurds in Turkey. So, I'm afraid that if I go too deep into Turkish, this may become so comfortable that I'd no longer need Kurdish. \n\n&amp;#x200B;\n\nDo you have any advice? \n\nThanks",
        "created_utc": 1672781137,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for community feedback on how I can achieve a B1 in Spanish by the end of 2023",
        "author": "langlearner1",
        "url": "https://www.reddit.com/r/languagelearning/comments/102j74q/looking_for_community_feedback_on_how_i_can/",
        "text": "Hello all. Looking to see if anyone had any advice or opinions on how I can maximize my time in 2023 to achieve a B1 in Spanish by the end of the year. I'm currently at around 134 hours of CI. In early 2024, I'll be going to a Spanish speaking country (likely Spain, Mexico, or Colombia) for around 10 days with the intent of not using English at all during my trip.\n\n*CI w/ Visuals I'm Utilizing:* DreamingSpanish, YouTubers such as Español con Juan, Spanish with Antonio, Spanish After Hours, and Easy Spanish, as well as native content (mostly reality TV shows). Occasionally I will watch a documentary in Spanish. \n\n*Audio w/out Visuals I'm utilizing:* Mostly the same YouTubers just played via other means. I typically only listen without visual aids when I'm driving or laying in bed. \n\n*Reading I'm doing:* Mostly news articles on major media sites. \n\n*Speaking Output:* Little to none. Occasionally a voice message on WhatsApp.\n\n*Writing Output:* Minimal. Maybe once a day some light conversation on WhatsApp.\n\n*Grammar Study:* I do grammar study when I run into repeated concepts I don't think I'm quite getting. For example, uses of \"Haber\", pronouns like \"Lo\" &amp; \"Le\", etc. \n\n*Flashcards:* At this point I'm mostly still stacking my deck with verbs and definitions. I do study them occasionally, but I spend far more time inputting than studying.\n\nI typically only log CI hours if they have a visual component attached to them. \n\nFor my daily routine:\n\n- News article with breakfast or in the sauna at the gym\n\n- Passive listening to a podcast or video while commuting\n\n- Beginner DreamingSpanish video to \"warm-up\"\n\n- An hour or so worth of YouTube content or an episode of native content\n\n- Grammar study on concepts for the day\n\n- Light messaging between my Lang Exchange partner on WhatsApp \n\n- Active listening to the first few minutes of a podcast while winding down\n\nAlthough most of the CI methodologies say to hold off on outputting, I feel it helps me to find holes in my knowledge, especially as it relates to minor function words in everyday conversation (ex: either, just, though, did you, will you, mostly, whatever, etc.). I don't feel like I'm quite ready to speak, but I think trying to put the thoughts on paper when they arise in real life conversations helps.\n\nI tried a tutor on iTalki when I was at zero and didn't feel like I got a whole lot out of it. I felt like I needed at least some knowledge to maximize the cost/time I was putting in. I may try to get another tutor when I'm at around 300 hours or so or feel more comfortable outputting.",
        "created_utc": 1672779452,
        "upvote_ratio": 1.0
    },
    {
        "title": "Memorizing a Speech in Foreign Language",
        "author": "MathemagicianG",
        "url": "https://www.reddit.com/r/languagelearning/comments/102j1bu/memorizing_a_speech_in_foreign_language/",
        "text": "I have to do a 15 minute speech for my French class in a week and I have written the script already (we were required to write it and turn it in, so I cant improvise) but I am having an extremely hard time memorizing it. \n\nI have experience with languages but this is becoming ridiculously difficult, no matter how much I repeat the text and practise. \n\nDoes anyone have any advice for preparing a speech in a language that I'm not super comfortable with? Or even in general fir memorizing the speech?\n\nThank you for any pointers!!",
        "created_utc": 1672779075,
        "upvote_ratio": 1.0
    },
    {
        "title": "bought a French book, where do I start?",
        "author": "icebeing13",
        "url": "https://www.reddit.com/r/languagelearning/comments/102iyot/bought_a_french_book_where_do_i_start/",
        "text": "[removed]",
        "created_utc": 1672778907,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Duolingo a good tool for learning German",
        "author": "Sangwoosconfidant",
        "url": "https://www.reddit.com/r/languagelearning/comments/102imne/is_duolingo_a_good_tool_for_learning_german/",
        "text": "I, like many other people, used Duolingo for learning a language when I was in middle-school and high-school (senior now). We never dove too deep into it, but it was very easy to start learning. Is this a good tool for *seriously* learning a language? I miss learning German, and I'd love to pick it up again! But I can't afford an expensive program, and I love how simple Kahoot is. Is there anything similar that's better, or should I use Duolingo?",
        "created_utc": 1672778103,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Kahoot a good tool to learn?",
        "author": "Sangwoosconfidant",
        "url": "https://www.reddit.com/r/languagelearning/comments/102ikxa/is_kahoot_a_good_tool_to_learn/",
        "text": "I, like many other people, used Kahoot for learning a language when I was in middle-school and high-school (senior now). We never dove too deep into it, but it was very easy to start learning. Is this a good tool for *seriously* learning a language? I miss learning German, and I'd love to pick it up again! But I can't afford an expensive program, and I love how simple Kahoot is. Is there anything similar that's better, or should I use Kahoot?",
        "created_utc": 1672777984,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recourses for learning Czech?",
        "author": "Sharp_Technology_189",
        "url": "https://www.reddit.com/r/languagelearning/comments/102ihb7/recourses_for_learning_czech/",
        "text": "Hi, I started learning Czech exactly 2 weeks ago today. Progress is pretty slow and I'm working on it pretty casually (barely 7 hours of learning up until now). What I'm doing is listening to the Pimsleur lessons, then studying words from a list of 1000 most common czech words, in addition to classes off of youtube. And so far I'm okay with this strategy because it's not too difficult to stick to. However, I want to speed up the process. If anyone with experience in this language or just language learning in general can suggest more sources to speed things along, it'd be great. I have some time off currently and most days I'm pretty bored. So i want to take this chance to learn as much of it as possible. :DD",
        "created_utc": 1672777745,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did you guys get used to dropping pronouns?",
        "author": "Crazy_Primary_3365",
        "url": "https://www.reddit.com/r/languagelearning/comments/102hb8m/how_did_you_guys_get_used_to_dropping_pronouns/",
        "text": "I started learning French first and I feel like I've become accustomed to using pronouns to help me with understanding the grammar and structure of sentences. Now that I'm dipping into the other romance languages, i feel like I have developed a very bad habit. 🥴",
        "created_utc": 1672774939,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would you expect to be in a short beginners' course?",
        "author": "Big_Red12",
        "url": "https://www.reddit.com/r/languagelearning/comments/102grsl/what_would_you_expect_to_be_in_a_short_beginners/",
        "text": "I'm starting an 8-session Greek course with my local council. It's 2 hours a week plus homework. However this is Beginners' 2 and I didn't do Beginners' 1. So I have a few weeks to catch up before the course begins and could do with some topics and constructs that would likely be found in such a course. Hopefully the tutor will reply and tell me but you never know.\n\nI've already learned the letters and pronunciation, some bizarre duolingo sentences, greetings and personal information, the names of some languages and countries. But tbh they have mostly been things that sound similar to English and I'm struggling a bit with further vocab.",
        "created_utc": 1672773649,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think is the future of Comprehensible Input?",
        "author": "justwannalook12",
        "url": "https://www.reddit.com/r/languagelearning/comments/102g9pm/what_do_you_think_is_the_future_of_comprehensible/",
        "text": "It has been fascinating being a part of the language learning community for the past half a decade or so. The discovery of Comprehensible Input has given me a vision of myself as a language learner that Duolingo or Traditional Institutional learning have never allowed me to glimpse. But what do you think about the ideas of CI? Is the methodology strong enough to persist in the face of gamified apps and youtube snake oil salesman? I'd really like to know what the sub thinks!\n\n[View Poll](https://www.reddit.com/poll/102g9pm)",
        "created_utc": 1672772470,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does the term ‘Saxon’ conjure up in your mind in your language? Did you know it before?",
        "author": "theunfinishedletter",
        "url": "https://www.reddit.com/r/languagelearning/comments/102g9g3/what_does_the_term_saxon_conjure_up_in_your_mind/",
        "text": "",
        "created_utc": 1672772454,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does learning two new languages, both as an adult, cause confusion? I recently learned Spanish (B1/B2) and interested to learn French. Any experiences with this? Thanks!",
        "author": "bd3851",
        "url": "https://www.reddit.com/r/languagelearning/comments/102fvmy/does_learning_two_new_languages_both_as_an_adult/",
        "text": "",
        "created_utc": 1672771563,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you say ‘Saxon’ in your native language (presuming it isn’t English) and did you know the term before you provided it? What does the term conjure up in your mind?",
        "author": "theunfinishedletter",
        "url": "https://www.reddit.com/r/languagelearning/comments/102fc2f/how_do_you_say_saxon_in_your_native_language/",
        "text": "",
        "created_utc": 1672770305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can somebody please check my writing for errors please? (Deutsch, German)",
        "author": "calumlong07",
        "url": "https://i.redd.it/82pgxfpgrw9a1.jpg",
        "text": "",
        "created_utc": 1672768462,
        "upvote_ratio": 1.0
    },
    {
        "title": "Languages Spoken by European/North American Leaders",
        "author": "WestEst101",
        "url": "https://i.redd.it/65kkgd023u9a1.png",
        "text": "",
        "created_utc": 1672768442,
        "upvote_ratio": 1.0
    },
    {
        "title": "Structure to achieving DELE B2 Spanish",
        "author": "ElBritanico",
        "url": "https://www.reddit.com/r/languagelearning/comments/102ed1g/structure_to_achieving_dele_b2_spanish/",
        "text": "Hi guys, \n\nI will be taking a B2 Spanish exam at the end of the year but having never taken a DELE exam I am unsure how to structure my learning. \n\nI have lived/travelled in latin america for a fair while and also had some chunks of classroom learning while at university and various occasions in Mexico and Peru. My conversational skills are very good as they are the only element I have used for a couple years. The other elements are weaker... I would suspect I am at B1 currently. \n\nI have a full-time job as well as many other hobbies, so realistically, I could only dedicate 30 minutes a day across a 11 month period. Any suggestions on strategy, literature, resources etc etc. \n\nWould love to hear back with some recommendations.",
        "created_utc": 1672768087,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to / Learning Plan(s) / Ideas and recommendations",
        "author": "Millennialgurupu",
        "url": "https://www.reddit.com/r/languagelearning/comments/102e3di/how_to_learning_plans_ideas_and_recommendations/",
        "text": "Hello good people,\n\nWish you all the best in '23 - Can someone recommend where to look for information on 'how to setup a learning plan'? My goal for '23 (12 months) is to learn Spanish, Business Spanish to be precise.  I want to acquire language skills that are useful in an office/business environment. I am willing to spend 30min up to 1 hr per day for studying but don't know where to start I was thinking to use one of these popular apps and read business news and make notes, not sure if this is the best way, so any ideas /recommendations very much appreciated - thanks!",
        "created_utc": 1672767452,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m 5 months into learning Norwegian and I haven’t made an Anki deck yet, where do I start?",
        "author": "AidanTNTyt",
        "url": "https://www.reddit.com/r/languagelearning/comments/102dtoq/im_5_months_into_learning_norwegian_and_i_havent/",
        "text": "Title essentially says it all. I already know a lot of vocabulary and putting it all in would take a stupid amount of time. But I will do it if I have to.\n\nHow should I divide it up? Should I make multiple decks for verbs and such and catagorise them? How should I approach this?",
        "created_utc": 1672766811,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's enjo (援助) feudal slang for sex?",
        "author": "Bowspecialist",
        "url": "https://www.reddit.com/r/languagelearning/comments/102drqk/its_enjo_援助_feudal_slang_for_sex/",
        "text": "or what words are used in feudal mangas to mean having sex as slang?",
        "created_utc": 1672766680,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for transitioning into in person learning at an advanced level",
        "author": "zoeleigh13",
        "url": "https://www.reddit.com/r/languagelearning/comments/102c5uh/advice_for_transitioning_into_in_person_learning/",
        "text": "best advice/resources for transitioning learning into a classroom? (at an advanced level)\n\nHello friends\nSo up until this point, all of my Spanish classes have been online because covid. I will be starting advanced Spanish this upcoming semester and I fear I’m about to have my brain fried. Not only have I been slacking off this past semester, but  I haven’t had any in person Spanish instruction since late 2019. (And that instruction was shotty at best.)\n\nI even emailed my professor and asked for tips directly from the source but he never answered 🙃\n\nI’m currently using clozemaster, duolingo, listening to spanish music, the duolingo podcast, and I’m rewriting all my notes from my elementary and intermediate classes. \n\nI’d really like to not spend too much money so free resources are preferable, but if you know of a really good one that costs money I still want to know just in case lol. I also don’t really want to do any virtual tutoring/conversation although I know it would be beneficial because I’ve done it before. I just don’t have a stable enough internet connection sometimes and it makes me a little bit anxious. \n\nAlso ngl I am almost definitely not ready for advanced level Spanish but I’m minoring in Spanish and I need to stay on course. I’m also hoping that throwing myself into it might just help it click more. \n\nI really appreciate any help (because I’m lowkey starting to panic lol)",
        "created_utc": 1672762794,
        "upvote_ratio": 1.0
    },
    {
        "title": "वेदों में प्रमाण है कि परमात्मा अपने भक्तों के संकट निवारण करता है यदि मृत्यु भी आ जाए तो भी उसको डालकर जीवित करके 100 वर्ष जीवन प्रदान कर देता है। बंदी छोड़ सतगुरु रामपाल जी महाराज जी सद्भक्ति प्रदान करते हैं। उन से नाम उपदेश लेकर अपना कल्याण करायें।",
        "author": "Genius82230",
        "url": "https://i.redd.it/7av5aze65w9a1.jpg",
        "text": "",
        "created_utc": 1672760968,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resources for teaching babies a second language?",
        "author": "ToxiccCookie",
        "url": "https://www.reddit.com/r/languagelearning/comments/1029pm6/resources_for_teaching_babies_a_second_language/",
        "text": "I swear this exists I feel like when I was younger I used to see a commercial for a program that taught your babies new languages but I can’t find it.\n\nI’m around like a B1 in French. I can do like basic sentences, talk about my day, order food, etc.. we are planning on having a baby in the near future and I would like to raise them bilingual and learn more French as they learn it.\n\nI was looking for a show like Ms.Rachel or Language Learners Espagnol but I see that doesn’t exist for French (at least not at the moment from what I can find). Since we are also worried about the continued research that has been going on regarding how kids brains develop when exposed to cartoons that have rapidly changing pictures (ie: coco melon, baby Einstein, etc..) I’m kind of leaning away from letting them watch cartoons at least while still very young.\n\nSo I was wondering what your suggestions are in regards to teaching a language to a baby when you are not fluent in it?",
        "created_utc": 1672756492,
        "upvote_ratio": 1.0
    },
    {
        "title": "What happens when I leave my TL country?",
        "author": "MustheMartian",
        "url": "https://www.reddit.com/r/languagelearning/comments/1028mmm/what_happens_when_i_leave_my_tl_country/",
        "text": "Hi everyone. 👋🏼  Tldr; when I leave my TL country should I continue studying it, or just let it go? (Short term or permanently) looking for experiences from others.\n\nCurrently I am living in the country of my TL. I didn't travel here for the language, but rather have tried to pick up enough now that I live here.\n\nI got to a basic level, then stopped studying and just used whatever I needed to buy groceries and get a cab. Now I'm back to studying in classes and hope to develop my skills some more. While I'm here, I'm very excited to learn as much as I can, convey my ideas better, and maybe dip into the books scene here too.\n\nBut the more I think about it I don't actually know if I will wanna keep studying it after I leave (maybe in 6-12 months), and it is no longer a matter of survival. At least, I will probably take an extended break.\n\nMy TL is probably the most prominent in a non-indo European family. I feel like native speakers always ask; \"why study our language?\". There are some diaspora communities in my home town, and I have been able to use a bit of the language in other countries too.\n\nI guess I just want to hear from anyone with similar experiences. After a study program or stint abroad...did you continue the language? Or did you just seal the language up with the whole travel experience?",
        "created_utc": 1672753514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting back after a break",
        "author": "PM_ME_CUTE_FRIENDS",
        "url": "https://www.reddit.com/r/languagelearning/comments/1028kge/getting_back_after_a_break/",
        "text": "I'm still a beginner in my TL but I took a break in learning during the holidays in the past month because I was away from home and it was easier for me to stick to my routines when I'm at home.\n\nI'm back to learning now and I'm ramping up my study. I do feel that I forgot things but not everything is completely gone. I'm thinking to start a few lessons back in my main course material and revisit my flashcards while being more critical in my use of it. Is this the way to go or are there anything more effective you would suggest?",
        "created_utc": 1672753355,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning a language completely from zero, with zero money.",
        "author": "LucasDosReis024",
        "url": "https://www.reddit.com/r/languagelearning/comments/1028fgf/learning_a_language_completely_from_zero_with/",
        "text": "I have a decent level good level in English and a decent Spanish, I started to study those in paid courses but I am currently not working and thinking about effective ways to learn a new language. German, French, Italian and Korean are the options I like the most. Is there any method to learn any of this effectively? \n\nAnd just to let you know, I'm not expecting to learn a new language in half a month or non real things like this, just a way to learn for free, and effectively.\n\nThanks!",
        "created_utc": 1672752978,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best app for advanced English learning in 2023?",
        "author": "amelia_gaga",
        "url": "https://www.reddit.com/r/languagelearning/comments/102673x/what_is_the_best_app_for_advanced_english/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/102673x)",
        "created_utc": 1672746821,
        "upvote_ratio": 1.0
    }
]