[
    {
        "title": "Best way to learn 3 languages at the same time",
        "author": "RamboRibero",
        "url": "https://www.reddit.com/r/languagelearning/comments/11h73m8/best_way_to_learn_3_languages_at_the_same_time/",
        "text": "I have started to learn Mandarin, Russian, and Japanese all at once and would like to hear opinions from people who have experience learning multiple languages the best way to go about this. Would it be better to alternate a language every day to avoid fatigue on one language and keep things interesting? Or do you find it more effective to switch every few days or every week? What would be the best way to go about this?",
        "created_utc": 1677864252,
        "upvote_ratio": 1.0
    },
    {
        "title": "r/languagelearning's perfect app?",
        "author": "NextdoorShaman",
        "url": "https://www.reddit.com/r/languagelearning/comments/11h6m9d/rlanguagelearnings_perfect_app/",
        "text": "\\*Attention all language learning redditors!\\*\n\nI know everyone asks '*what app should I use?'* or something similar, but I want to ask everyone a different question:\n\nWith everything you know about the theory of language learning (\"comprehensible input\", etc.), what features would you like to see on an android/iphone language app? How would you want to use it to supplement your learning?",
        "created_utc": 1677863714,
        "upvote_ratio": 1.0
    },
    {
        "title": "What scripts do you think are the coolest visually? Also, what features of your target language 's script do you find cool, if any?",
        "author": "UsualDazzlingu",
        "url": "https://www.reddit.com/r/languagelearning/comments/11h6dpk/what_scripts_do_you_think_are_the_coolest/",
        "text": "",
        "created_utc": 1677863456,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this common?",
        "author": "moonaligator",
        "url": "https://www.reddit.com/r/languagelearning/comments/11h5kr8/is_this_common/",
        "text": "I'm not a native English speaker.\n\nI can write English quite well and trust myself enoght to do it without hesitating, however when I need to speak, i feel so insecure and just struggle with it, not because i don't know how to pronounce, but because i feel so scared of saying something wrong that even my grammar gets destroyed by this fear.",
        "created_utc": 1677862293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good videos for studying intermediate Vietnamese",
        "author": "walkatarian1",
        "url": "https://www.reddit.com/r/languagelearning/comments/11h5juo/good_videos_for_studying_intermediate_vietnamese/",
        "text": "",
        "created_utc": 1677862235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does your language have a word for that?",
        "author": "J4V4C4T",
        "url": "https://www.reddit.com/r/languagelearning/comments/11h5g6c/does_your_language_have_a_word_for_that/",
        "text": "Hi fellow redditors,\n\nI'm originally from Germany, I proudly speak very decent English and currently learning russian, czech, dutch and making my first baby steps in japanese. \nI've always had this little question triggering me and making me think.\n\nImagine a situation: there are 3 people in one room/whatever talking. One of them is a really close friend, the other one is your boss (very important person) and you are the third. Naturally, you use a rather informal slang language with your friend and address your boss very formally. Now try to refer to both at the same time in a sentence like \"It seems like *you* are enjoying the conversation\".\nDo you use formal or informal?\nIn English it's easy: you would just say \"you\" (informal and formal) \nIn german you'd have the choice between: \"ihr\" (informal) or \"Sie\" (formal) for both\n\nSo you either address both formal or both informal.\nIs there a language that has a formal-informal word to use when referring to both which sounds neither rude to your boss nor awkwardly formal to your friend?\n\nThanks in advance",
        "created_utc": 1677862001,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clip - Doraemon Movie 11 · Nobita and the Animal Planet (哆啦A梦电影11 · 大雄与惑星之谜) (1990) - Chinese Hakka Dub (AAC 2.0-48kHz) (Hakka TV)",
        "author": "Maleficent-Mixture19",
        "url": "https://www.reddit.com/r/languagelearning/comments/11h58ct/clip_doraemon_movie_11_nobita_and_the_animal/",
        "text": "[removed]",
        "created_utc": 1677861509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Intermediate level with bad grammar",
        "author": "lunsolo",
        "url": "https://www.reddit.com/r/languagelearning/comments/11h4ttt/intermediate_level_with_bad_grammar/",
        "text": "In my TL, I can speak quite naturally with natives and engage in most media without too much of a problem. I'm self-taught and most of how I've learned has been through immersion and engagement.\n\nHowever, my grammar is really bad in comparison and I feel ashamed whenever I have to do something more academic and make simple mistakes. I'm currently attending university in my TL and I know my written assignments aren't up to the quality they should be for my overall language level. Sometimes I'm jealous of those who learned this language the \"traditional\" way where they built this strong foundation of grammar and come across as much more intellectual even if their overall ability is less than mine.\n\nI'm trying to review grammar whenever I have the chance but it can be discouraging to review A2 level material that I should already know. Does anyone relate or have any advice?",
        "created_utc": 1677860579,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't learn new vocab because I'll immediately forget a word after hearing it in conversation for the first time",
        "author": "Economy_Ability_6190",
        "url": "https://www.reddit.com/r/languagelearning/comments/11h45ju/i_cant_learn_new_vocab_because_ill_immediately/",
        "text": "Going over flashcards can be effective for memorizing vocab, but often times the new words I encounter are here or there in conversation. Many times I'll hear the new word and its meaning/translation, but then immediately forget it and end up looking like an ass when I can't understand the conversation.\n\nSure going over the word in my head a bunch of times is a good option, but unfortunately I don't have the mental bandwidth for that while also participating in conversation. This is frustrating because it severely limits my learning and my ability to talk about new topics.\n\nAnyone have any tips for this? Admittedly I have been having overall memory issues recently (both short and long term), but this is my weakest point - retrieval and learning after hearing the word only once or twice.",
        "created_utc": 1677859002,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spanish-language resources for learning Yucatec Mayan?",
        "author": "Economy_Ability_6190",
        "url": "https://www.reddit.com/r/languagelearning/comments/11h40l9/spanishlanguage_resources_for_learning_yucatec/",
        "text": "I decided I want to learn Yucatec Mayan (yes, I did just see Black Panther lol) but there aren't many resources available in English. I've heard there are more resources in Spanish, which I know pretty well, but I don't know where to look for them.",
        "created_utc": 1677858647,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does their native languages increase or decrease your interest in them?",
        "author": "psyhi7840",
        "url": "https://www.reddit.com/r/languagelearning/comments/11h3q10/does_their_native_languages_increase_or_decrease/",
        "text": "A very random and kinda silly question, it might sound odd but I'm really curious.\n\nWhat I mean is;  if a potential someone speaks your target language or a language that you love would you feel more interested in them?\n\nAnd what if they speak a language that you aren't interested it at all and you know they will not master your native language anytime soon either. How would you feel about it?\n\nPersonally, a nice voice tone is my weak spot and if they speak one of my favorite/target languages I would kinda feel more excited about talking to them frequently, Idk if I would be as excited to date someone who I share the same language with unless he is a really good one.\n\ndo you have any experience like these?",
        "created_utc": 1677857891,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any sources for learning Occitan",
        "author": "rabidz7",
        "url": "https://www.reddit.com/r/languagelearning/comments/11h3os7/any_sources_for_learning_occitan/",
        "text": "",
        "created_utc": 1677857802,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the language(s) you've learned, what's something supposedly easy that you found difficult, or vice versa?",
        "author": "droim",
        "url": "https://www.reddit.com/r/languagelearning/comments/11h2w4i/in_the_languages_youve_learned_whats_something/",
        "text": "So for example I found German cases and articles to be quite logical and predictable, I don't really get why people are so freaked out about it.",
        "created_utc": 1677855709,
        "upvote_ratio": 1.0
    },
    {
        "title": "English grammar for hindi medium students.",
        "author": "asdrhyme",
        "url": "https://www.reddit.com/r/languagelearning/comments/11h102r/english_grammar_for_hindi_medium_students/",
        "text": " Hi All,\n\nLost my father starting of last month who was English teacher and found near about 18 years old language teaching videos of size 40GB which I am now upscaling and uploading to youtube.\n\nPlease free to use and share it with your friends.\n\n[https://www.youtube.com/@balbirsinghsawhney/featured](https://www.youtube.com/@balbirsinghsawhney/featured)\n\nIt will take next 20-25 days to upload all videos.\n\nRegards,",
        "created_utc": 1677850716,
        "upvote_ratio": 1.0
    },
    {
        "title": "help with alveolar tap?",
        "author": "Henry_Hoover17",
        "url": "https://www.reddit.com/r/languagelearning/comments/11h0tmx/help_with_alveolar_tap/",
        "text": "I believe that's the right one I'm on about^\n\nI have Scottish family and my towns accent is slightly Scottish. So I was sure I was doing it right, but then I started learning another language.\n\nIdk if it's just my mind hearing it differently than I'm actually saying it but with some words it starts to sound almost like an 'L' sound, and it's harder for me to say the full words without tripping over myself.\n\nAnyone know what am I doing wrong? Or is it probably just me hearing myself wrong? \n\n\nAnd sorry If this is a stupid question, it's just bothering me",
        "created_utc": 1677850213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Relation between non-native languages",
        "author": "ur9ce",
        "url": "https://www.reddit.com/r/languagelearning/comments/11h0pdh/relation_between_nonnative_languages/",
        "text": "Hello there! I couldn't find a proper way to search this online, but basically, when learning a third or fourth language, is it required that you learn how to work each between the other? This sounds confusing so an example might be better: I'm a non native english speaker and I'm currently learning a third language (latin), do/should I learn how to work english-latin as well? Rather than just L1-latin?\n\nThe question might make more sense for someone who speaks more languages, like 6 or more; is it required that you understand how to work each language with all others you already know, or keep everything tied to L1?",
        "created_utc": 1677849877,
        "upvote_ratio": 1.0
    },
    {
        "title": "HELP!",
        "author": "MotorSearch",
        "url": "https://www.reddit.com/r/languagelearning/comments/11h07up/help/",
        "text": "السلام عليكم و رحمة الله،\n\nI'm aiming to form a chat room where, natives or experts of Fusha and Yemeni dialect and students who want to learn the language can come together over a call to practice and improve thier language via talking to each other.\n\nWe'll select a topic everyday that'll be discussed amongst us including a book reading session on alternative days.\n\nIf anyone is interested dm with your details or msg at +92334 4487280.\n\nNote: \n\nFor these collaborations I aim to keep all participation voluntary, but I personally as a student would like maximum participation from everyone. Do dm all your details and whatever is on your mind.",
        "created_utc": 1677848520,
        "upvote_ratio": 1.0
    },
    {
        "title": "dds",
        "author": "Yosuruki",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gzpk1/dds/",
        "text": "Użyj mojego kodu polecającego: ZOWTBWEX lub po prostu wejdż w ten link: https://bs.nanobitgames.com/referralCode/ZOWTBWEX",
        "created_utc": 1677847066,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning Korean, Feedback is welcomed.",
        "author": "Str8SavaJ",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gyotv/learning_korean_feedback_is_welcomed/",
        "text": "So I learned Spanish and Lebanese Arabic off the street, among friends and in real life situations. I thought I could do the same with Korean. lol.. absolutely not. I've lived in South Korea for about 2 and a half years now and I am nearly useless when it comes to Korean language. My girlfriends here always have spoken English good enough and my Korean friends all speak English. At this point I'm just going to listen to YouTube instructional videos with Korean and English language so I will read and listen in both languages. I'm going to watch these videos so many times until I can't forget what the instructor is teaching. To get to the point. Any methods that have helped you learn Korean? all idea welcomed! Thank you Reddit!",
        "created_utc": 1677844007,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Bulgarian Language - Slavic but DIFFERENT",
        "author": "chutneyglazefan",
        "url": "https://youtu.be/og2XTxFwIBY",
        "text": "",
        "created_utc": 1677841617,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I try to test out of French 101 and Spanish 101?",
        "author": "SailorAries1996",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gx8qx/should_i_try_to_test_out_of_french_101_and/",
        "text": "I believe the university I am going to allows you to test out of certain courses. I would like to test out of French 101. I don’t attend until August- so that’s plenty of time to study up on my French. I can save money and time if I test out of a few classes like French 101 and Spanish 101. I have taken French (three semesters in high school) and am learning Spanish. I am also learning six other languages. The university offers French, Spanish, and German classes. What should I do?",
        "created_utc": 1677838886,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are children's stories and programs a good way to start learning languages?",
        "author": "rainbow_happyone",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gwytd/are_childrens_stories_and_programs_a_good_way_to/",
        "text": "Reading through posts, I see it recommended a lot, so I wanted to ask this question to find out what most members here think. \n\n[View Poll](https://www.reddit.com/poll/11gwytd)",
        "created_utc": 1677837841,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you know any songs with English versions?",
        "author": "pls_letmerest",
        "url": "https://www.reddit.com/r/languagelearning/comments/11guqon/do_you_know_any_songs_with_english_versions/",
        "text": "[removed]",
        "created_utc": 1677829237,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using AI to Improve Writing in my TL?",
        "author": "mnop98748",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gt66r/using_ai_to_improve_writing_in_my_tl/",
        "text": "I'm currently at C1 in my TL (German) and recently I've been trying to reach C2 in my writing. Something I've been using to proofread is [the DeepL Write feature](https://www.deepl.com/write), which is an AI model still in beta. It corrects grammatical errors, but it also makes the tone more consistent and it can fix my word choice when I'm using a word in the wrong way. \n\nWhat I'm wondering is, *essentially*, whether using this AI is a wise decision. The proofreader function seems *quite practical*, but sometimes I wonder whether the stylistic assistance is correcting things which were already fine to begin with. For example, when I *plugged* these sentences into the English correction, it suggested a bunch of changes which I don't find necessary, like saying \"basically\" instead of \"*essentially*\", \"pretty handy\" instead of \"*quite practical*\", and \"put into\" instead of \"*plugged* into\". \n\nAs a native speaker, I stand by what I said and I don't need a robot to tell me how to talk. However, as a German learner, I get very anxious when the AI corrects my language, because I can't tell whether I'm actually using a word incorrectly or not. Am I choosing words which express what I want to say, even if they're maybe a little incongruous? Or am I saying something which makes absolutely no sense? \n\nI have two competing anxieties: \n\n* On the one hand, if I use this AI in the long term, I could develop a robotic and uninspired writing style in my TL. Sometimes being a nonnative speaker enables me to say things in unexpected and fresh ways, and I want to develop a native-level style which still reflects that perspective. Also, does this thing even accurately reflect how native speakers write?\n* On the other hand, if I don't use the AI, I might never develop a style which could pass for native. If I double down on the incongruities in my writing, rather than trying to conform to the linguistic norms, will my choices only ever be (viewed as) mistakes?\n\nI am a creative writer, so developing a strong, native-level writing style is very important to my goal of someday writing a novel in my TL. \n\nWhat do you guys think? Is AI useful in my writing journey? What do you think about AI's role in  language learning generally?",
        "created_utc": 1677823766,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"To tase a man\"; Anybody know what the guy getting tased is saying?",
        "author": "44calibers",
        "url": "https://v.redd.it/v6n4zmhf9gla1",
        "text": "",
        "created_utc": 1677819458,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning Arabic",
        "author": "Comfortable_Factor87",
        "url": "https://www.reddit.com/r/languagelearning/comments/11grhe6/learning_arabic/",
        "text": "Hi everyone, \n\nI'm in a  situation and would really appreciate all the advice I can get. I'm arab and my family speaks arabic but I didn't grow up in the middle east. I have a good understanding of spoken arabic but I fall short when it comes to speaking, reading, and writing. One of my main goals in life is to become completely fluent. If anyone has been able to become fluent in their ethnic language please let me know how I can do this.",
        "created_utc": 1677818532,
        "upvote_ratio": 1.0
    },
    {
        "title": "does your native language determined how you gonna speak another language with good accent",
        "author": "yassineee3",
        "url": "https://www.reddit.com/r/languagelearning/comments/11grcps/does_your_native_language_determined_how_you/",
        "text": "",
        "created_utc": 1677818143,
        "upvote_ratio": 1.0
    },
    {
        "title": "How should I translate a stereotypical Chinese accent in a Japanese visual novel?",
        "author": "Serebii99",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gr4zs/how_should_i_translate_a_stereotypical_chinese/",
        "text": "Hi everyone,\n\nI'm currently working on a translation project for a Japanese visual novel, and I've come across a Chinese character who speaks with a stereotypical Chinese accent (ending sentences with \"aru\"). I'm having trouble deciding the best way to translate her dialogue into English, and I was hoping to get some input from the community.\n\nHere are the options I'm considering:\n\n1. Ignore the accent: Should I simply translate her dialogue without including the \"aru\" at the end of her sentences? This would make her dialogue sound more natural in English, but it \n\n2. Add \"aru\" to the end of sentences: Alternatively, I could include \"aru\" at the end of each of her sentences to convey her accent. However, I'm not sure if this would come across as too gimmicky or make her dialogue hard to read.\n\n1. Write her dialogue in a stereotypical Chinese accent: Another option would be to write her dialogue with a stereotypical Chinese accent in English (e.g. \"Me so solly\"), but I'm worried this could come across as offensive or insensitive.\n\n1. Add appropriate Chinese words and phrases: Finally, I could add appropriate Chinese words and phrases to her dialogue to emphasize her ethnicity and cultural background. However, this could also make the dialogue harder to read for English-speaking audiences who aren't familiar with Chinese.\n\nWhat do you think would be the best approach? I'm open to any suggestions or advice. Thanks in advance for your help!",
        "created_utc": 1677817520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do Puerto Rico and Hong Kong mean similar things? My basic level understanding of Spanish is that rico/rica can mean rich or describe food as delicious/rich/tasty. Given that puerto means port and Kong/港 means harbor/port and Hong/香 means fragrant/aromatic, couldn’t one argue such?",
        "author": "billt2last",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gqk1j/do_puerto_rico_and_hong_kong_mean_similar_things/",
        "text": "",
        "created_utc": 1677815832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any benefit to prioritizing my heritage language over a more useful language?",
        "author": "willysjeeps",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gpx57/is_there_any_benefit_to_prioritizing_my_heritage/",
        "text": "I'm torn between learning Spanish or Portuguese. I was born in Brazil and moved to the states when I was 6. My first language was Portuguese, but I can't speak a word of it now. My native language was a victim of my parents' divorce. My mom was an American with full custody who wanted to put Brazil in the past. I don't blame her. I really wanted to speak English once I got to the states and I became fluent in six weeks because I was in sponge-mode. \n\nThis began to bother me when I was in high school. There is a part of me that never left Brazil and will mourn my life and family there forever. It hurts every time I tell someone that I'm Brazilian and they start speaking Portuguese to me. \n\nOn the other hand- I really want to learn a language. In fact, this thought process came from me wanting to learn Spanish. My best friend is hispanic with a huge Spanish speaking family that I can't communicate with well. I work for a small company that takes its employees on trips every year and next year we're going to Los Cabos in Mexico. I've also been discerning religious life (that's what we catholics call becoming a nun or a friar) and the order I'm discerning with ministers to hispanic communities and requires postulants to begin studying Spanish). I also live in a part of the U.S. with a huge Spanish speaking population. \n\nBasically I have 1,000 great reasons to learn Spanish. But I wish I spoke Portuguese. I just have no good reason to. &lt;1% of my local population speaks it, I'm only in touch with one family member in Brazil and she's an english teacher so that works out great. I guess I just have this sense that learning Portuguese would somehow heal the wounds of my parents' incredibly messy divorce, which I know it wouldn't. But immersing myself in Spanish feels like walking to my neighbors house, sitting down at the dinner table and pretending I grew up there when my real family is right next door. \n\nSorry if this isn't a good language learning question! Just wanted to see if anyone has a similar background or any insights to share.",
        "created_utc": 1677814019,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your daily routine for learning?",
        "author": "bedifferentitsokay",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gpnt9/what_is_your_daily_routine_for_learning/",
        "text": "",
        "created_utc": 1677813302,
        "upvote_ratio": 1.0
    },
    {
        "title": "It makes me sad that I’ll probably never reach fluency with all my target languages.",
        "author": "KalinaOliver",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gp5my/it_makes_me_sad_that_ill_probably_never_reach/",
        "text": "I’m already bilingual, and I’m focused on 3 languages, with a major focus on just one. The problem is life is a busy thing. I’m confident I could become fluent in one, maybe roughly in two. But how would I sustain it? Life is too busy for immersive travel. Unless you’re rich. The fact is no matter how much I want it, I’ll likely only succeed in 1 of the languages. \n\nIt just makes me sad how limited we are as humans, thanks to time and societal working norms etc. maybe I’m too depressed to post here.",
        "created_utc": 1677811914,
        "upvote_ratio": 1.0
    },
    {
        "title": "German game ROM downloads?",
        "author": "MajorBadTime",
        "url": "https://www.reddit.com/r/languagelearning/comments/11goyov/german_game_rom_downloads/",
        "text": "I've been trying on and off for a couple of years now to learn german, and recently I figured it'd be a good idea to start playing games in german. Does anyone know where I can find german language ROMs of games (Particularly older pokemon games and other games with text-based dialogue)? All the european ROM sites I checked out seemed to have english or french versions but not german, so if anyone knows somewhere I can go to find what I'm looking for I'd be grateful",
        "created_utc": 1677811391,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did you ever study a language so much you started hearing it in your sleep, constantly and nonstop?",
        "author": "Aldynor",
        "url": "https://www.reddit.com/r/languagelearning/comments/11goxu4/did_you_ever_study_a_language_so_much_you_started/",
        "text": "Relax, it's not schizophrenia, I think.\n\nWhat I feel is like is if I study in excess, my thoughts start simulating the language I'm studying, like that same feeling when you play Tetris and you can play it in your head. The words start repeating in my subconscious and I can't stop thinking about the language, sometimes I might even dream of it.\n\nDid you ever experience it? Tell me about it. Do you guys have any scientific theories on why it happens?",
        "created_utc": 1677811323,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to learn Spanish",
        "author": "Then_Frosting_1087",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gost0/how_to_learn_spanish/",
        "text": "I’ve been on Duolingo for three days, and I’m on the start of Spanish Foundations II. I have some small Spanish knowledge already but I’ve heard Duolingo isn’t great for long term language learning. If my goal is to translate some Spanish-language music, should I stay on Duolingo or find other methods or resources?",
        "created_utc": 1677810929,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is -14 LUFS in Dbs? How do we determine this accurately? How do we calculate LUFS and convert them to DBs and vice versa?",
        "author": "-Zarkosen-",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gof9d/what_is_14_lufs_in_dbs_how_do_we_determine_this/",
        "text": "I'm just curious why streaming platforms such as Youtube and Spotify and Apple etc use LUFS as opposed to Dbs? \n\nI would like to know how to calculate and convert LUFS into Dbs and vice versa",
        "created_utc": 1677809914,
        "upvote_ratio": 1.0
    },
    {
        "title": "B2 Language test (German)",
        "author": "lordofcats12",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gno0u/b2_language_test_german/",
        "text": "Hello!! I am a native english speaker who has a B2 English test by the end of the month (March). I really badly need the qualifications but I don’t think my speaking and writing are up to par. My reading and listening are definitely high enough to pass, but I am still concerned about my writing and speaking, are there any ways I can boost them before the exam?",
        "created_utc": 1677807899,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is learning Romance language verbs hard for speakers of other Romance languages too?",
        "author": "Digitalmodernism",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gng9p/is_learning_romance_language_verbs_hard_for/",
        "text": "Just curious if anyone here has learned a Romance language while being native of speaking one already. Were verbs as hard for you as they usually are for non romance speakers?",
        "created_utc": 1677807325,
        "upvote_ratio": 1.0
    },
    {
        "title": "M28, Oklahoma: English Native, learning Spanish and ASL",
        "author": "After_Weird_1580",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gmm3r/m28_oklahoma_english_native_learning_spanish_and/",
        "text": "Hello! I’m conversational in ASL, and am beginning to learn Spanish. I’m starting to get where I understand written Spanish fairly well. Can anyone recommend Spanish books to help progress? Also, just looking for language learning friends if anyone is interested in ASL or Spanish. Hit me up!",
        "created_utc": 1677805132,
        "upvote_ratio": 1.0
    },
    {
        "title": "I decided to spruce up the eBook I'm reading with additional functionality (more info in comments)",
        "author": "TardyAnt",
        "url": "https://youtu.be/-K4xsdvKl_M",
        "text": "",
        "created_utc": 1677802769,
        "upvote_ratio": 1.0
    },
    {
        "title": "I lost the ability to pronounce words well",
        "author": "daydream49133",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gl58k/i_lost_the_ability_to_pronounce_words_well/",
        "text": "It's been a few months since I noticed this problem. People think it's just because I'm not a native speaker of English, but I feel it's a little different. My English is not good, but I've been exposed to English on and off since 4, so my pronunciation used to be much better than my actually English skill.\n\nI stutter so much just so I can get the sound right. Before, I would just mispronounce words, but now, I sometimes just can’t get the sound out. What I noticed is that my larynx goes up a lot whenever I have the problem. And when this happens, it affects the following words because of the wrong position of my larynx\n\nI have mild rhinitis and septal deviation, and I think this is the root cause seeing that my pronunciation gets better right after I blow my nose. But it comes back not long after.\n\nNot sure how credible it is, but ChatGTP suggested that your larynx can go up when having a stuffy nose because of the lack of air pressure. I think this makes sense because when I do bracing breathing where I can produce a lot of air pressure, my pronunciation gets better as well. But doing this is exhausting and works in certain postures\n\nWhat do you suggest I do? I could get surgery to address septal deviation, but I feel like it's too much since apart from this issue, I don’t have any other issues regarding this",
        "created_utc": 1677801441,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your Guy’s favorite time where you forgot a word or didn’t know it so you try to describe it?",
        "author": "theshinyspacelord",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gkzvn/what_are_your_guys_favorite_time_where_you_forgot/",
        "text": "I’m studying abroad in Ecuador right now and am staying with a host family and talk with them everyday in Spanish. I came here with no Spanish so I’ve improved quite quickly and was having a conversation within a week. Here are my favorite times when I described a word I forgot or didn’t know.\n\nI was trying to say my mom is Jewish but I didn’t know the word for Jew in Spanish so I just called it she is the prequel to Christians.\n\nI didn’t know the word for Muslim so I said these people pray to allah and they told me the word.\n\nI was speaking with Mormon missionaries that were walking around the street and asked them if they were wearing magic underwear at the moment because eu didn’t know what it was called.\n\nI would love to hear your guy’s favorite times of describing a word using beginner or intermediate vocabulary or how you funnily described it!",
        "created_utc": 1677801088,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best ways to improve English vocabulary?",
        "author": "slayerofsophistry",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gksjo/best_ways_to_improve_english_vocabulary/",
        "text": "I’m a native English speaker and want to improve my vocabulary. I’ve been using Anki and adding new words that I’m not familiar with. \n\nI’ve noticed that while I can define it upon exposure, it doesn’t come naturally to me in conversation to use the word(s). \n\nAny recommendations to use them in conversation more? Perhaps purposefully plan words in? Thank you all for your time!",
        "created_utc": 1677800649,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to forget your mother language as a adult?",
        "author": "GoodFighting",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gkbz7/is_it_possible_to_forget_your_mother_language_as/",
        "text": "Say you are 25-30 and only speak English even know you are born in another country where no one knows English. Then move to UK or USA and no one speaker your mother language and you have no family at home. Do you just forget it after so many years of not using it or is it always going to be in you?",
        "created_utc": 1677799770,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning Arabic",
        "author": "Picknade2",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gjr2s/learning_arabic/",
        "text": "Hello. I am currently wanting to learn Arabic as a native English speaker. I have read through the guides but felt a bit unsure on where to start. Most paid things aren't an option for me. I understand duolingo can work well when compliments something. And I was looking at flashcards (I use anki for school all ready) but was not sure on where to start for learning the Modern Arabic(the non dialect one)",
        "created_utc": 1677798942,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unpopular opinion: being able to speak a foreign language generally isn't very impressive",
        "author": "ExquisiteTerra",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gjlta/unpopular_opinion_being_able_to_speak_a_foreign/",
        "text": "I assume most people here on this sub would immediately disagree with the title, but in all honesty, knowing how to speak a foreign language, in of itself, isn't that impressive. Especially if it's a closely-related language (e.g. Spanish and Portuguese).\nI can immediately foresee your dismissive responses. \"But learning to speak a foreign tongue is a remarkable achievement that can only be reached by extensive study and immersion!!!\". Well yes, but actually no.\n\nYou realize, it doesn't really take that much effort to become conversational in another language. Let's consider the soldiers back then in WW2. They were required to learn foreign languages in mere weeks. Those soldiers simply didn't have endless hours to sink with \"techniques\" such as immersion and vocabulary mass memorization. They had to do actually important stuff, like combatting the Germans.\n\nAnyhow, it doesn't take a genius or years of study to learn how to make yourself understood in a non-native tongue. If you think learning a language to a conversational level is a remarkable accomplishment, then you have to be consistent and start thinking of NOT failing classes in school as something truly remarkable. Which, of course, sounds ridiculous. But, after all, both require a similar level of commitment: just the bare minimum to succeed (or at least, to not fail): in the language learning case, that involves learning a *sliver* of the language, just enough so you can understand and make yourself understood (\"failing\" in this case = being unable to communicate). Similarly, in school, you only have to score the minimum grade in your tests just to NOT fail your classes. Neither situation demands a lot of persistence and willpower.\n\nWhat people don't realize, is that not all communication is created equal, and, on top of that, not all foreign languages are equally different from each other. For one, conversing about trivial topics like work and family isn't very complex. You only have to learn the 1-2k most common words in a language to be able to have a decent conversation with someone. You might think 1,000 or 2,000 words is a lot of work, but trust me, it's a total *joke* compared to the estimated 10,000+ words you absolutely need to know to read normal books in a TL within a reasonable timeframe.\n\nContinuing, not all languages are created equal. Learning to speak Spanish/Portuguese if your native language is one of those 2 definitely isn't impressive. Both are really similar, and, if you apply a few morphological tricks, you can basically automatically translate the most common sentences between them.\n\nOn the other hand, learning to speak a *really* foreign language (i.e. a language which does not share a language family with your mother tongue) to perfection (or near-perfection) is ACTUALLY impressive. For example, if your native language is Spanish and your English is free of odd grammatical/pronunciation/vocabulary mistakes, and you can express *all* your ideas coherently in it. Then you get my respect. (Bonus points if you master the use of idiomatic expressions in your TL).",
        "created_utc": 1677798776,
        "upvote_ratio": 1.0
    },
    {
        "title": "Watching shows - check words or not?",
        "author": "TwinkForAHairyBear",
        "url": "https://www.reddit.com/r/languagelearning/comments/11giqmt/watching_shows_check_words_or_not/",
        "text": "Hi!\n\nI'm learning Spanish and I'm still at the beginner level. Recently I decided to start watching children shows in Spanish with Spanish subtitles.\n\nThere are two ways I can do that:\n1. Start the show, sit and watch without interruptions, do my best to understand what's going on.\n2. Pause every time there's a word I don't understand and check it in the dictionary.\n\nI'm not sure what option is better. Option 1 lets me to just get with the flow of the show and pay more attention to audio (audio track slightly differs from subtitles and I'm counting on different wording being more clear to me), while option 2 exposes me to more vocabulary (after checking same word 20th time I'll finally remember it).",
        "created_utc": 1677797830,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else have an SO that is native in your TL but you still struggle to practice with them?",
        "author": "Unknownentity7",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gikr5/does_anyone_else_have_an_so_that_is_native_in/",
        "text": "My wife is a native Spanish speaker, and when we met my Spanish was extremely weak while her English was already at C1 level. When we started seriously dating I put a lot more effort into my Spanish, but I found that even after I had reached conversational level it's been really difficult to break the habit of talking to her in English. \n\nWe've been together for 5 years now, and for the first couple years we spoke almost exclusively in English. We've tried over and over again to create a speaking schedule but we always fall back into old habits. Many of her friends and family aren't very good in English, so I still have plenty of opportunity to practice my Spanish, and after almost a year and a half of languishing in B1/B2 hell I feel like I've finally broken through. I feel really good about my Spanish now, but I'm still not getting much practice with the wife. It's not that it never happens, but I definitely feel like I'm not taking advantage of it. \n\nI was listening to an episode of one of my favorite Spanish podcasts (No Hay Tos) and they were interviewing an American woman who was married to a Puerto Rican. Her Spanish was very good, but she mentioned that she had the same struggles as I did in practicing with her husband. Anyone else have the same issue?\n\nWhat makes it a little more frustrating is that dating is exactly how I got to such a good level in Russian, because at first that was the only way I could communicate with my ex. But for whatever reason, I am unable to repeat that process now with Spanish.",
        "created_utc": 1677797648,
        "upvote_ratio": 1.0
    },
    {
        "title": "Duome has deleted Danish notes for the old course, any way to still look at them?",
        "author": "davidmca12345",
        "url": "/r/duolingo/comments/11ghpy2/duome_has_deleted_danish_notes_for_the_old_course/",
        "text": "",
        "created_utc": 1677796723,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it stupid to learn another language if you don't even have a social life in your first one?",
        "author": "BoyMeetsWorldx",
        "url": "https://www.reddit.com/r/languagelearning/comments/11ghlii/is_it_stupid_to_learn_another_language_if_you/",
        "text": "",
        "created_utc": 1677796567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it stupid to learn another language if you don't even have a social life in your first one?",
        "author": "BoyMeetsWorldx",
        "url": "https://www.reddit.com/r/languagelearning/comments/11ghgw8/is_it_stupid_to_learn_another_language_if_you/",
        "text": "",
        "created_utc": 1677796432,
        "upvote_ratio": 1.0
    },
    {
        "title": "List of sentences in order of difficulty for various languages",
        "author": "Impossible_Fox7622",
        "url": "https://www.reddit.com/r/languagelearning/comments/11ggcqs/list_of_sentences_in_order_of_difficulty_for/",
        "text": "There is a website which has put the sentences from Tatoeba into lists according to complexity: \n\nhttp://www.manythings.org/bilingual/\n\nHere they are as downloadable files: \n\nhttp://www.manythings.org/anki/\n\nThis might be useful for you!",
        "created_utc": 1677795242,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am passive bilingual, how to SPEAK your native language?",
        "author": "Own_Cauliflower8609",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gfo7d/i_am_passive_bilingual_how_to_speak_your_native/",
        "text": "Hi,\n\nso, I am able to understand my language of my parents fluently, though I have hard times speaking it? How long does it take to pick it up? and how is one able to pick it up? Thank you, guys!",
        "created_utc": 1677794506,
        "upvote_ratio": 1.0
    },
    {
        "title": "ɔ and ɑ sound completely the same. What is the difference?",
        "author": "OrangeCat05",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gfmpx/ɔ_and_ɑ_sound_completely_the_same_what_is_the/",
        "text": "Hi, I am a native Japanese speaker and learning American English pronunciation.  I came across ɔ and ɑ today and they sound the same. If I mix up those two, do people still understand what I'm saying?\n\nThank you (\\^ \\^)/",
        "created_utc": 1677794466,
        "upvote_ratio": 1.0
    },
    {
        "title": "AI Language Learner",
        "author": "Ok_Fig_382",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gfi8t/ai_language_learner/",
        "text": "[removed]",
        "created_utc": 1677794343,
        "upvote_ratio": 1.0
    },
    {
        "title": "Varsity Tutors",
        "author": "logiejg",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gf8ox/varsity_tutors/",
        "text": "Hello all! I’m learning italian, and I just got off the phone with these guys. For $140 a month they offer 2 classes (per month) with a tutor and can attend unlimited live lessons with the subscription. Have any of you inquired in this program? If so, is it worth it?",
        "created_utc": 1677793959,
        "upvote_ratio": 1.0
    },
    {
        "title": "English tv shows with a dub for language input",
        "author": "FinDune1",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gf59d/english_tv_shows_with_a_dub_for_language_input/",
        "text": "Learning mandarin and have heard from many sources that input is very important for learning a language and that tv is a good was to do this. But I have not been watching Chinese shows but rather English show with a Chinese dub over them. Will this be as effective? If not any tips on finding Chinese shows?",
        "created_utc": 1677793737,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kouri-Vini: It was born from the horrors of the trans-Atlantic slave trade and then slowly disappeared. Now, its speakers are reclaiming it as part of their identity.",
        "author": "whatatwit",
        "url": "https://www.bbc.com/travel/article/20230228-kouri-vini-the-return-of-the-us-lost-language",
        "text": "",
        "created_utc": 1677792246,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm trying to learn Arabic but can't find any good resources",
        "author": "puglord35",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gdve1/im_trying_to_learn_arabic_but_cant_find_any_good/",
        "text": "I'm trying to learn Arabic because half of the place I work at speaks Arabic, and I want to atleast be some what conversational at it, but u have a problem. I can't find any good resources to learn the language, I'm willing to pay for a course but I don't know what's worth it or what's good, I apologize for asking but does anyone here know a good course I could take?",
        "created_utc": 1677790808,
        "upvote_ratio": 1.0
    },
    {
        "title": "Those who have learned all Romance languages (or the main 5) what kept you from getting bored?",
        "author": "ExceedsTheCharacterL",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gbuji/those_who_have_learned_all_romance_languages_or/",
        "text": "I’ve been learning Spanish for over a year, and I’m proud to say that I now know what it feels like to have a second language. I feel like moving on to French, but it’s hard when I still feel like I’m not done with Spanish. I’ve tried learning some Portuguese and Italian, but I get bored. Just feels like I’m learning Spanish all over again. There’s also Romanian. It’s kind of the odd man out, and seems harder, but it has some neat little surprises like the word for already is “deja” just like in French, I wonder how that happened, they both stray from the other 3 (ya/ja/gia). I suppose I should also ask, if you’ve learned all the Slavic languages how did you not get bored? Because damn, there’s a lot of them.",
        "created_utc": 1677786121,
        "upvote_ratio": 1.0
    },
    {
        "title": "do you think English gets the value it deserves?",
        "author": "psyhi7840",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gbttt/do_you_think_english_gets_the_value_it_deserves/",
        "text": "I'm not talking about being forced to learn it, its being used all the time everywhere or being a dominant language.\n\nI'm talking about how amazing of a language it is. I truly adore it. Its phonetics, simple yet quite interesting grammar tules, a ton of phrasal verbs. \nAs people usually learn it just because they have to it doesn't get the \"yayy I'm learning this amazing foreign language\" reputation.\n\nTo the native speakers of English, you should feel lucky and proud, not only because it is the dominant business, communication and Internet language but also it is super cool, rich, poetic, mesmerizing lol. I'd truly love to have a brain thinking in English all the time lol, even tho there are many other foreign languages I do love they still go nowhere near to beat this baby one",
        "created_utc": 1677786074,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm Filipino and would love to teach my 1yr old some Tagalog. How do I even begin?",
        "author": "Filipino_Buddha",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gbh5z/im_filipino_and_would_love_to_teach_my_1yr_old/",
        "text": "I'm a 1st generation Filipino immigrant born in the US. English is my first language and second is Tagalog. \n\nMy mom's English is terrible, so by default, Tagalog was the primary language spoken at home. I'm very fluent in terms of socializing, but when it comes to deep rooted words, I'll struggle a bit until I figure out what it means. I never grew up in the Philippines, but I occasionally travel when I was younger up until I was 16. \n\nI have plenty Filipino friends whom I strictly and I preferably speak Tagalog to them since I'm more comfortable like that. \n\nNow that I have a child, I never realized the teaching aspect can be so hard. My wife is Mexican/Chamorro who's first and only language is English. \n\nWe speak English in our household and my wife has been begging me to teach our child Tagalog because my wife never had the opportunity to learn Spanish from her father. \n\nHow do I go on about teaching my one year old Tagalog and English at the same time without confusing my little one?",
        "created_utc": 1677785261,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anybody know any discounts for the \"WordUp\" app?",
        "author": "ZipperL",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gbcr3/does_anybody_know_any_discounts_for_the_wordup_app/",
        "text": "",
        "created_utc": 1677784974,
        "upvote_ratio": 1.0
    },
    {
        "title": "Online language schools and classes? Looking for live group sessions",
        "author": "seakisser",
        "url": "https://www.reddit.com/r/languagelearning/comments/11gamuz/online_language_schools_and_classes_looking_for/",
        "text": "I am a terrible self-motivator and have learned languages best in the past in a school setting, with a teacher assigning homework, other students to practice with and work on homework together, and strict deadlines and grading. I need the pressure and accountability to focus. \n\nTo that end, I have done lots of scrolling through google and have read through the FAQ and Resources on this subreddit, as well as on the subreddit for my target language, and have found very few options. I will inquire through Berlitz to see their prices. My local language school occasionally offers weekly online classes in my target language. But these are very limited options and I am hoping to crowdsource more resources and ideas from you all about regular group language lessons that can be enrolled in online. What are other similar language schools with virtual group classes?",
        "created_utc": 1677783297,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best way to learn a dialect after MSA?",
        "author": "ConiglioCaro",
        "url": "https://www.reddit.com/r/languagelearning/comments/11g9xvt/what_is_the_best_way_to_learn_a_dialect_after_msa/",
        "text": "Hi. I've been learning MSA and trying to learn Masri for a while now. I'd say my MSA is probably around a B1 level? I've read a few suras from the Quran and as practice I read an al-jazeera article (which usually contains around 10-20 new words, though some of these are easily recognisable owing to the root system and derivational affixes) and I have begun reading Harry Potter, though this contains more new vocabulary and hence the B1 assessment.  \n\n\nI also have been trying to learn Egyptian for a while. However, I am having a much harder time. The grammar is easy and I worked through the first 3 Kallimni Arabi books with ease. I also picked up quite a bit of vocabulary through those and since a lot of MSA vocabulary is the same, I don't think this would be the crux. If I can learn MSA then why not a dialect?  \n\n\nThe problem is that absolutely nothing has subtitles. I don't know how I should try to improve my listening skills since there is nothing like e.g Podcast Italiano for Italian or similar content made for learners which has a slower but not unnaturally slow speech and subtitles which exponentially increase in difficulty. The common advise I saw on here and elsewhere while browsing for an answer is \"just watch shows lol\" but since I do not understand anything beyond a few individual words I hear, I feel like this does nothing and would just be a waste of time. I feel like the people who say this are most likely native Arabic speakers who never learnt a dialect from scratch in the first place.  \n\n\nAnyways, I am really in need of advice and would greatly appreciate advice from learners or teachers alike.",
        "created_utc": 1677781596,
        "upvote_ratio": 1.0
    },
    {
        "title": "After successfully learning English, I'm incredibly frustrated with how uncomfortable picking up a new language is! How do I deal with that?",
        "author": "KillyourselfMaxxing1",
        "url": "https://www.reddit.com/r/languagelearning/comments/11g9x2s/after_successfully_learning_english_im_incredibly/",
        "text": "I am a confident English user, down to nuances. Obviously far from perfect, but I'm content enough with my level. \n\nNow I have to pick up two languages at the same time, as a bonus one of them is not European (sorry for casual Eurocentrism). I am not shy of speaking and writing poorly and making mistakes, no! But, GOD, it feels like learning to walk again, and it demotivates me.\n\nOn top of that, my brain keeps nagging me: why bother studying new languages, if you will never be able to use them as proficiently as your native one or English? Consciously, I acknowledge this is ridiculous. But how do I battle this stupid train of thought as well as lack of motivation due to having to start over again? Again, I am no stranger to putting my head down and grinding through studies, but I'd really like to be happier about those baby steps.",
        "created_utc": 1677781539,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for german learning partner",
        "author": "poorva_singhal",
        "url": "https://www.reddit.com/r/languagelearning/comments/11g9u7l/looking_for_german_learning_partner/",
        "text": "Need the german a1 learning partner. \nLearning from online coaching class: henry harvin, also from youtube playlist: learn german, &amp; making my own notes. \nReply if interested!",
        "created_utc": 1677781345,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm going to learn the Chinese language",
        "author": "Parasaurolophus190",
        "url": "https://www.reddit.com/r/languagelearning/comments/11g9ps3/im_going_to_learn_the_chinese_language/",
        "text": "I gave up the Uzbek language and now I'm going to learn the Chinese language because it's useful and beautiful, but I'm not sure if I will continue until I become fluent in Chinese.",
        "created_utc": 1677781048,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lists of sentences",
        "author": "Impossible_Fox7622",
        "url": "https://www.reddit.com/r/languagelearning/comments/11g98it/lists_of_sentences/",
        "text": "There is a website with the sentences from Tatoeba in order of complexity: \n\nhttp://www.manythings.org/bilingual/\n\nHere they are as files for importing into Anki: \n\nhttp://www.manythings.org/anki/\n\n\nMaybe this could be useful for you!",
        "created_utc": 1677779881,
        "upvote_ratio": 1.0
    },
    {
        "title": "Literal Translation/Interlinear Gloss Resources",
        "author": "eggcracked2wice",
        "url": "https://www.reddit.com/r/languagelearning/comments/11g83d9/literal_translationinterlinear_gloss_resources/",
        "text": "I find that looking at some literal translations when trying to get my head around a new grammatical concept in my target language is the most efficient way for me to understand. I've struggled to find a specific resource for this, does anybody know of one? (Have already searched this sub and wiki also)",
        "created_utc": 1677777107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone learned Portuguese and Spanish at the same time",
        "author": "starshopped",
        "url": "https://www.reddit.com/r/languagelearning/comments/11g82po/has_anyone_learned_portuguese_and_spanish_at_the/",
        "text": "I have been learning Brazilian Portuguese since June 2022 and I interact with it every day. I’m in an A2 class but it is a bit too easy for me and could pass the exam with ease so I suppose my level is A2/B1. Now this year I started dating my boyfriend who is Mexican. I was not at all planning to learn Spanish at least not now but I hear him speak Spanish a lot and I know many random phrases and words because of him. If I ever meet/call his family I would like to say something as well (obviously). Has anyone learned them a bit simultaneously? I’m not planning to but it kind of goes automatically, however I don’t want it to stall my Portuguese. \nPS I speak Dutch native and French B1/B2 as well",
        "created_utc": 1677777062,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone having problems getting past A2?",
        "author": "Hypengie",
        "url": "https://www.reddit.com/r/languagelearning/comments/11g708y/anyone_having_problems_getting_past_a2/",
        "text": "I have been learning English for a long time and it felt somehow easy to find resources. After that I was interested in German and tried to study but after some time I have decided to go on with French which I am still learning. But after some time my improvement has stopped again. The thing was that English was nearly everywhere on the internet. But when it comes to other languages, you have to search for material. My method for learning English, which simply focuses on practice rather than hard work, was actually very beneficial for me but I could not find a similar one for the other languages because this time the content did not show up on its own. I would like to hear if you have faced and overcome this problem and how you could achieve that.",
        "created_utc": 1677774529,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to improve writing?",
        "author": "Theta_is_my_friend",
        "url": "https://www.reddit.com/r/languagelearning/comments/11g6zoo/how_to_improve_writing/",
        "text": "My Spanish reading (B1/B2) is trailblazing past my Spanish speaking (A2) and writing (A2).\n\nI know for speaking, I just need to engage more in conversation with other Spanish speakers, …\n\nBut, how do y’all go about improving your writing in a language? Journaling, writing short essays? Also, am I suppose to practice writing without a dictionary? Or does looking up words/conjugations, etc, help?\n\nThanks!",
        "created_utc": 1677774490,
        "upvote_ratio": 1.0
    },
    {
        "title": "Teenager to adult...fluency?",
        "author": "KayaTheRetriever",
        "url": "https://www.reddit.com/r/languagelearning/comments/11g6wbm/teenager_to_adultfluency/",
        "text": "If a person begins learning a language at 15 years old, and they study consistently almost every day in all areas, what the chances that they will be fluent/at a high-level by 18-20? \n\nI know this may seem like a dumb question, but I know that babies/toddlers pick up languages natively growing up. I also believe that adults cannot acquire another native language at their age. Are teenagers in the same camp, or is it different?\n\nRegardless of that, do you think that 3-5 years of hard work enough to make a teenager to adult fluent?",
        "created_utc": 1677774258,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resources for learners of German",
        "author": "Impossible_Fox7622",
        "url": "https://www.reddit.com/r/languagelearning/comments/11g6rkd/resources_for_learners_of_german/",
        "text": "Here is a list of resources for people learning German. There are many more but I think there are useful: \n\nDictionary: https://dict.leo.org/englisch-deutsch/\n\nDeutsche Welle: https://www.dw.com/de/deutsch-lernen/s-2055 \n\n\nNicos Weg: https://www.youtube.com/watch?v=abFz6JgOMCk&amp;list=PLs7zUO7VPyJ5DV1iBRgSw2uDl832n0bLg\n\n\nJojo sucht das Glück (B1/B2): https://www.youtube.com/watch?v=IBeYiSVt_T4&amp;list=PLB92CD6B288E5DB61 \n\n\nExtra (comedy series): https://www.youtube.com/watch?v=F6khA8eZaD4&amp;list=PLM45RE_YsqS5-S58HSmYOhu2m-tRul9jW\n\n\nLanguage Reactor (extension for chrome and netflix): https://www.languagereactor.com/ \n\n\nQuizlet: A1: https://quizlet.com/join/GWCdSRkQe \nA2: https://quizlet.com/join/s4tV8hKm4 \nB1: https://quizlet.com/join/dGJvMHPxr \n\n\nNews articles with translations: https://de.globalvoices.org/ \n\n\nEuronews: https://de.euronews.com/ \n\n\nFlashcards: A1: https://www.brainscape.com/p/456JI-LH-B9TBP \nA2: https://www.brainscape.com/p/456JI-LH-B9ZIT \nB1: https://www.brainscape.com/p/456JI-LH-B9ZIV \n\n\nGame with lots of sentences: https://www.clozemaster.com/ \n\n\nPodcast with texts: https://www.learninglanguageswithtexts.com/ \nCorresponding Youtube channel: https://www.youtube.com/channel/UC6x4LdOFTOYDUh10kFR-VyA \n\n\n\nPodcast in Slow German with transcripts: https://slowgerman.com/ \n\nI hope these are helpful!!!!",
        "created_utc": 1677773934,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you guys deal with wanting to learn another language that isn't what you're learning now?",
        "author": "Guguinhas",
        "url": "https://www.reddit.com/r/languagelearning/comments/11g6k8p/how_do_you_guys_deal_with_wanting_to_learn/",
        "text": "I'm currently learning french (roughly since January everyday) and I like the language but I don't find it almost anywhere, just if I search it on purpose, like on tv shows, movies, etc. \nThe other language I want to learn is japanese, and since I'm into anime, manga and visual novels I had and still have a lot of contact with the language almost everyday, there's some games that are not translated that I would love to play, but I don't know almost anything of japanese... So it would be a very useful language.\nI started french because I see myself interested in living at France or Canada in a distant future, and I started french first because its easier, since I speak Portuguese, so there's the connection.\nYou guys have any advice?",
        "created_utc": 1677773440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fast ways To learn a language?",
        "author": "explodeswithmind",
        "url": "https://www.reddit.com/r/languagelearning/comments/11g3jtq/fast_ways_to_learn_a_language/",
        "text": "Hi, I'm a native English speaker, I know a little German (B1) and Spanish (A2) and want to learn Italian because I'm going on a week long trip to Italy for school. \n\nI only have around 10 days to learn it (Procrastination am i right? 😭) I know the very basics but is there any methods I can use to learn it quickly? Even just to order something or ask for directions lmao",
        "created_utc": 1677765777,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ideas for language learning app",
        "author": "Noobletpig",
        "url": "https://www.reddit.com/r/languagelearning/comments/11g34h6/ideas_for_language_learning_app/",
        "text": "Need ideas on what can be improved in language learning apps like Duolingo, memrise , etc. Would really appreciate the responses.",
        "created_utc": 1677764662,
        "upvote_ratio": 1.0
    },
    {
        "title": "English",
        "author": "Immediate-Bench2474",
        "url": "https://www.reddit.com/r/languagelearning/comments/11g1js1/english/",
        "text": "",
        "created_utc": 1677760093,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for german learning partner",
        "author": "poorva_singhal",
        "url": "https://www.reddit.com/r/languagelearning/comments/11g1814/looking_for_german_learning_partner/",
        "text": "Need the german a1 learning partner. \nLearning from online coaching class: henry harvin, also from youtube playlist: learn german, &amp; making my own notes. \nReply if interested!",
        "created_utc": 1677759051,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm overwhelmed",
        "author": "trtldove",
        "url": "https://www.reddit.com/r/languagelearning/comments/11g13gd/im_overwhelmed/",
        "text": " Short introduction:  \nI'm 24 and I'm polish native speaker (I was born in Poland and I live in that country).  \nI've been learning English since I was a child (My parents forced me to do that but now I'm glad they did it). My English's level is something between A2 and B1/B2. I'm fully aware that I could improve it more but for daily usage and learning other languages is enough. I can easily watch movies and read books in English.   \n\n\nI've been learning Korean for about 6 months and... it's getting more and more difficult. I'm able to read and understand simple and longer sentences but when it comes to listening... I understand nothing. I guess I need more time to understand what they actually say but it's so frustrating. When I create a sentence, I have a feelling that I keep using the same vocabulary over and over...   \n\n\nGerman... My nightmare from primary/high school. I learnt it for about 10 years and as soon as I gratuated I wanted to forget about that language. But something has changed and I finally see the sense in it. (Yeah, it took me 10 years to realize it haha). I have a book \"Short stories for beginners\" and when I read it, I understand the plot and the story in general but there is a lot of vocabulary I haven't seen before.   \n\n\nI don't want to start learning German from the very basic level, because I think my brain just needs time to realize that \"Hey brain, you know it but you just forgot some words and gramma\". With Korean situation is a little bit different, because it's totally oposite language.   \n\n\nI just have a feeling that I don't have enough time for all three languages. I love Korean language and it gives me enough motivation to learn it but I don't want to waste my \"German ability\".",
        "created_utc": 1677758653,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm overwhelmed",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677757235,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm really unmotivated about learning Uzbek",
        "author": "Parasaurolophus190",
        "url": "https://www.reddit.com/r/languagelearning/comments/11g0n5x/im_really_unmotivated_about_learning_uzbek/",
        "text": "On other posts on this sub, I said that I'd learn Uzbek after posting a meme here, and after reading the FAQ, I became less motivated about learning Uzbek. Is it useful to learn it? Should I continue to learn it? Or should I stop?",
        "created_utc": 1677757135,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there days when you don't want to study at all and want just relax or game? Can I still learn efficiently while having these days?",
        "author": "dontgetmewrongonthis",
        "url": "https://www.reddit.com/r/languagelearning/comments/11fzpb2/are_there_days_when_you_dont_want_to_study_at_all/",
        "text": "[FRUSTRATION]\n\nI am getting too little sleep lastly plus I'm fasting and eating 30% less calories all while intensively exercising. And my damn work PC won't have internet as of yesterday. Studying from phone is annoying, I'm tired and my focus is minimal, I want to study but I also don't, all I want is play some videogame that I have on my PC and leave studying for evening or tomorrow.\n\nI'm trying to learn at least 30-50 words on lazy days when I don't want to read books or study grammar, which is sustainable, makes me feel I'm doing at least something. However today I have no desire even to do that.\n\nWondering if I can still succeed in my goal of achieving A2.5-B1 in a month if I keep making these breaks from time to time.",
        "created_utc": 1677753771,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help required with humorous French names. In English we might prepopulate a form in a training session with silly names such as 'D Vine' or 'C Nothing'. Are there some French equivalent? Nothing rude, please.",
        "author": "Tee10823",
        "url": "https://www.reddit.com/r/languagelearning/comments/11fyhko/help_required_with_humorous_french_names_in/",
        "text": "",
        "created_utc": 1677749356,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best resources for learning Greek from scratch?",
        "author": "Insidious-Black",
        "url": "https://www.reddit.com/r/languagelearning/comments/11fyca2/best_resources_for_learning_greek_from_scratch/",
        "text": "I visited Greece in November 2022, and I would love nothing more than to visit Greece again in late 2024 (tentative); using English only as a last resort option to communicate locally.\n\nI started learning on Duolingo about 2 months back, but I find the learning process there is not really as structured as I'd want. I've never taught myself a language before, I learnt English and French in school with Hindi being my mother tongue.\n\nAlso, is late 2024 a suitable timeline for my goal or should I possibly push it further?",
        "created_utc": 1677748814,
        "upvote_ratio": 1.0
    },
    {
        "title": "I live in Germany, and have been learning German intensiv since 5 years. I can also speak English. (Both are not my native language. )And in my work I’m using the both, which isn’t so simple for me. Sometimes I’m mixing them. What would you recommend me to develop my both language at the same time?",
        "author": "Oemer97",
        "url": "https://www.reddit.com/r/languagelearning/comments/11fy92j/i_live_in_germany_and_have_been_learning_german/",
        "text": "",
        "created_utc": 1677748496,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pig Latin?",
        "author": "HeartSh1nes",
        "url": "https://www.reddit.com/r/languagelearning/comments/11fy1vb/pig_latin/",
        "text": "Im just wondering if there are any other types of \"language\" games like pig Latin in English?",
        "created_utc": 1677747779,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this pronunciation description right?",
        "author": "planet_721",
        "url": "https://www.reddit.com/r/languagelearning/comments/11fxxvk/is_this_pronunciation_description_right/",
        "text": "the spanish 'd', pronounced as English d, between vowels and at the end of a word, like th in they. \n\ndonde, sed, pared, todo, vender, vida, madre",
        "created_utc": 1677747405,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Pimsuler a good app for learning languages?",
        "author": "SailorAries1996",
        "url": "https://www.reddit.com/r/languagelearning/comments/11fxna2/is_pimsuler_a_good_app_for_learning_languages/",
        "text": "I was thinking of buying Pimsuler for myself and my dad this April or May so I may have some more instruction in learning languages. Has anyone with instruction with learning languages know if it’s worth it’s price tag? Right now I use free textbooks, free lessons on YouTube, Duolingo, Memrise, Drops, LingoDeer, and the app Cake, and a few other apps.",
        "created_utc": 1677746323,
        "upvote_ratio": 1.0
    },
    {
        "title": "People talk about certain things happening as bilinguals but I've never experienced them.",
        "author": "negative_visuals",
        "url": "https://www.reddit.com/r/languagelearning/comments/11fwos2/people_talk_about_certain_things_happening_as/",
        "text": "I've heard a lot of bilingual people say for example that they inadvertently translate numbers in their head into their second language, but that's never happened to me. I know all the Spanish numbers, could say read them aloud, could know what number was said in conversation, but I never subconsciously think of numbers in Spanish. Another thing that people say happens to them is they don't notice what lang they're reading sometimes, but I've never had that problem, either. I can read \"Te echan de menos\" the same as \"They miss you\" but I would never not be aware of what language the phrase was in. Is there anyone else for whom these things just don't happen? The only traditionally \"bilingual\" thing that happens to me is dreaming in Spanish, really. Is it just that I don't actually know Spanish well enough?",
        "created_utc": 1677743030,
        "upvote_ratio": 1.0
    },
    {
        "title": "Problem with listening",
        "author": "polifonikosuruk",
        "url": "https://www.reddit.com/r/languagelearning/comments/11fv4r7/problem_with_listening/",
        "text": "I have studied Swedish for three years and got a C1 certificate from Folkuniversitetet which is regarded among harder ones. But i have a problem with spoken Swedish. \n\ni understand all if i direct my attention to the speech which is the case with examinations. I expect to hear a speech, bing goes the record and everything is smooth.\n\nUnder the daily life things are completely different with spontaneous speech. During almost %80 of my daily interactions i ask \"sorry can you repeat that?. i become more anxious and things go even worse.\n\nHow can i overcome this? Thanks",
        "created_utc": 1677737991,
        "upvote_ratio": 1.0
    },
    {
        "title": "getting real tired of starting over",
        "author": "LemonSeltzerPontiki",
        "url": "https://www.reddit.com/r/languagelearning/comments/11fuy8y/getting_real_tired_of_starting_over/",
        "text": "OK.  I've been \"learning\" Greek for years.  Years and years.  I can say a bunch and sometimes understand a bunch but when I test I am A1 beginner.  Here's my frustration: \n1 don't know exactly what to do.  Like,  I get bored with everything bc I feel anxious that I'm not doing the most effective thing. \n2. Comprehensible input. How do you know what you're going to comprehend? I can listen to one story and instance the gist, another story and I'm completely lost\n3. I want to set goals but how do you judge a goal? Like i can say \"have a conversation in Greek\" but sometimes I can do that now.  Often i can't.  \nI feel like language learning is a lottery.  Everyone trying a bunch of stuff and every now and again someone becomes conversational and we're all impressed but they can't say specifically what they did. \nI'm not putting anyone down,  I'm feeling down and hoping to find hope and guidance.  Thanks!",
        "created_utc": 1677737423,
        "upvote_ratio": 1.0
    },
    {
        "title": "12 Book Challenge March",
        "author": "Vonvanz",
        "url": "https://www.reddit.com/r/languagelearning/comments/11fueqb/12_book_challenge_march/",
        "text": "Hello all! I hope everything is going gravy for everyone. Today marks our 3rd month in the book challenge. I unfortunately missed the mark by a couple of chapters but I’ll be sure to bounce back this month! Everyone please give a brief summary of your book from last month and the book you plan on reading for March! Feel free to add any tidbits or cool things about your book as well! 加油 everyone)",
        "created_utc": 1677735797,
        "upvote_ratio": 1.0
    },
    {
        "title": "Korean or Japanese more useful for translation?",
        "author": "mochibebe_",
        "url": "https://www.reddit.com/r/languagelearning/comments/11fu2j2/korean_or_japanese_more_useful_for_translation/",
        "text": "I’m aspiring to be a translator one day, and I want to try prioritizing an Asian language besides Spanish, French, and ASL. I know people say Chinese but I didn’t that it had its similarities with Japanese. And I’ve slightly touched on Korean. I find both languages very interesting, I’ve done more Japanese than Korean.. \n\nWhich one would be more useful in my career one day?",
        "created_utc": 1677734793,
        "upvote_ratio": 1.0
    },
    {
        "title": "Raising Tri-Lingual Children",
        "author": "aspiringacademic1990",
        "url": "https://www.reddit.com/r/languagelearning/comments/11ftesk/raising_trilingual_children/",
        "text": "Would love advice from others.  I have 3 young children all 4-years old and younger.  I have full professional proficiency in Spanish and am approaching similar proficiency in Portuguese (probably about a year away, more than anything it just acquiring more vocabulary and speaking it more at this point).  What would be the best way to raise them so they become tri-lingual?  \n\nMy initial idea is to rotate speaking to them everyday and just letting them know which language it is in the morning.  My wife is worried that this will confuse them.  Any suggestions from those that have successfully raised tri-lingual children?\n\nThank you in advance!",
        "created_utc": 1677732846,
        "upvote_ratio": 1.0
    },
    {
        "title": "PSA: Pimsleur's Ukrainian course is free through March 31st!",
        "author": "QuantumErection17",
        "url": "https://www.pimsleur.com/c/free-ukrainian",
        "text": "",
        "created_utc": 1677731619,
        "upvote_ratio": 1.0
    },
    {
        "title": "As an English speaker what language should I learn/would be the easiest",
        "author": "frontierFinale",
        "url": "https://www.reddit.com/r/languagelearning/comments/11fs3cb/as_an_english_speaker_what_language_should_i/",
        "text": "Should I learn Spanish or some European language or middle eastern language?",
        "created_utc": 1677729148,
        "upvote_ratio": 1.0
    },
    {
        "title": "Similarities Between Bulgarian and Russian",
        "author": "chutneyglazefan",
        "url": "https://www.youtube.com/watch?v=lv9bgJe05dY",
        "text": "",
        "created_utc": 1677728938,
        "upvote_ratio": 1.0
    },
    {
        "title": "Offering: Spanish /Seeking: English (Mostly spoken)",
        "author": "Remote_Back145",
        "url": "https://www.reddit.com/r/languagelearning/comments/11frhr4/offering_spanish_seeking_english_mostly_spoken/",
        "text": "In four months I will travel to Hungary for a university world cup, I would like to improve my English and be able to communicate better there. \nI really want to learn and practice listening and speaking.",
        "created_utc": 1677727554,
        "upvote_ratio": 1.0
    }
]