[
    {
        "title": "Is there an app where you can learn what you want whenever? for example, duolingo makes you complete 9 units before you learn about numbers.",
        "author": "TerraWhoo",
        "url": "https://www.reddit.com/r/languagelearning/comments/111maxi/is_there_an_app_where_you_can_learn_what_you_want/",
        "text": "",
        "created_utc": 1676327936,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to learn Romanian, I’ve never learnt a language before",
        "author": "LowerTime693",
        "url": "https://www.reddit.com/r/languagelearning/comments/111m371/i_want_to_learn_romanian_ive_never_learnt_a/",
        "text": "I want to learn it because a lot of my colleagues are Romanian and would like to connect with them and help them on their end on understanding them on instructions wise. As they speak little English and I just want to help them out. I wouldn’t know where to start, like learning basic phrases and how to pronounce them correctly.",
        "created_utc": 1676327421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need some advice with my language routine (Egyptian Arabic)",
        "author": "PoopOnAPole",
        "url": "https://www.reddit.com/r/languagelearning/comments/111lstc/need_some_advice_with_my_language_routine/",
        "text": "Hey everybody! So I started learning Egyptian Arabic about a month ago now and my daily routine has consisted of 30 mins on Pimsleur a day and 1 hour italki sessions every other day. I also have been building anki decks with the words im learning from my tutor on italki. Well, I’m about to finish the Pimsleur level 1 on Arabic and I just realized that they only offer 1 level unlike the other languages which have 3-5. So I was wondering if anyone can recommend me another conversation based practice or any other materials that they found useful after Pimsleur. Thanks to anyone who can help!",
        "created_utc": 1676326726,
        "upvote_ratio": 1.0
    },
    {
        "title": "What websites do you use to study a second language?",
        "author": "asm-us",
        "url": "https://www.reddit.com/r/languagelearning/comments/111kzmk/what_websites_do_you_use_to_study_a_second/",
        "text": "I am looking for some resources on where I can go to improve my second language skills. Especially I am interested in applications where I can talk to other people as I want to improve my speaking skills.  \nWhat are my options?",
        "created_utc": 1676324777,
        "upvote_ratio": 1.0
    },
    {
        "title": "European Portuguese",
        "author": "Vasiliychaomian123",
        "url": "https://www.reddit.com/r/languagelearning/comments/111imlw/european_portuguese/",
        "text": "I’m learning Portuguese at the moment but I’m trying to speak with an accent from Portugal. Every word I look up on Google translate has a Brazilian pronunciation for text to speech. Does anyone know of anywhere I can reliable look up European Portuguese pronunciation and grammar?",
        "created_utc": 1676318980,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using video games as a way to pick up vocab/learn more of a language",
        "author": "Top_Dig_6469",
        "url": "https://www.reddit.com/r/languagelearning/comments/111h5th/using_video_games_as_a_way_to_pick_up_vocablearn/",
        "text": "Hey guys I am trying to find more fun ways to incorporate learning Italian and there's a bunch of games out now that I was thinking of changing the language and subtitles to Italian to see if I can pick up on some new words etc.  In particular I was looking at these games:\n\n&amp;#x200B;\n\nGod of War Ragnarok\n\nDead Space\n\nFire Emblem Engage \n\nResident Evil 4\n\n&amp;#x200B;\n\nThey all have a decent amount of dialogue.  Are there any other modern releases you think would be good to try to practice with?",
        "created_utc": 1676315334,
        "upvote_ratio": 1.0
    },
    {
        "title": "10 TIPS &amp; TRICKS to learn ANY language faster, easier, and more effectively. The author shares her own strategies and hopes to help anyone to progress on their language-learning journey.",
        "author": "fluffy-phd",
        "url": "https://youtu.be/RrDnfa-SNRM",
        "text": "",
        "created_utc": 1676315011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello &amp; Salut, I kinda need help ☠️",
        "author": "djabloo",
        "url": "https://www.reddit.com/r/languagelearning/comments/111g0sa/hello_salut_i_kinda_need_help/",
        "text": "I'm doing a school thesis and doing a bit of research. I would immensely appreciate if you'd answer these 10 questions in case you're a student of French. It won't take long, promise. https://www.surveymonkey.com/r/5P2CP3T",
        "created_utc": 1676312536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Voice dictionary?",
        "author": "28nov2022",
        "url": "https://www.reddit.com/r/languagelearning/comments/111elt0/voice_dictionary/",
        "text": "It would save me so much time if i had a voice dictionary rather than always typing words.\n\nI'm trying to learn spanish vocabulary.\n\nThanks! :)",
        "created_utc": 1676308982,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there some kind of voice assistant i can ask for word meanings in Spanish?",
        "author": "28nov2022",
        "url": "https://www.reddit.com/r/languagelearning/comments/111dczk/is_there_some_kind_of_voice_assistant_i_can_ask/",
        "text": "To learn spanish i play games in Spanihs,  i  alt-tab to google the meaning of words, which is often because im still beginner. It would save me a LOT of time if theres a voice assistant i can ask for word meanings.\n\nFor ex: \"What does (despues) means in spanish?\" Etc.",
        "created_utc": 1676305875,
        "upvote_ratio": 1.0
    },
    {
        "title": "I know we can be self conscious and shy when speaking a foreign language, but the best way to get better is to dive in and talk to someone!",
        "author": "sendstories",
        "url": "https://www.youtube.com/watch?v=W9k-vqVAx-U",
        "text": "",
        "created_utc": 1676305540,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Storm by Kate Chopin [Learn English Through Listening]",
        "author": "saleham5",
        "url": "https://www.reddit.com/r/languagelearning/comments/111c9c4/the_storm_by_kate_chopin_learn_english_through/",
        "text": "New Audiobook and this time with **The Storm by Kate Chopin** I hope you guys like it. please give me your thoughts and opinions about it. Grab a hot drink while you listen and close your eyes to go into the world of imagination. Happy listening :)\n\nYou can find it [HERE](https://youtu.be/4waiKwIafbo)",
        "created_utc": 1676303181,
        "upvote_ratio": 1.0
    },
    {
        "title": "Apps for Teaching",
        "author": "iteachptpt",
        "url": "https://www.reddit.com/r/languagelearning/comments/111b6kv/apps_for_teaching/",
        "text": "Hi there,\n\nI have a student who is learning Portuguese through Duolingo. That is their preference. However, they want to learn European Portuguese, which Duolingo doesn't teach.\n\nWhat is the best app in which I can create vocabulary lists that they can easily access and listen to?\n\nI'm trying Memrise, but I don't see an option to \"skip levels\" to listen to how certain words in more advanced levels are pronounced.\n\nI'd like to give them access to that, but I'm not sure about where to do that because I don't have much experience with language apps apart from Duolingo.",
        "created_utc": 1676300434,
        "upvote_ratio": 1.0
    },
    {
        "title": "How people learned languages before the 19th century",
        "author": "Lydianeko2",
        "url": "https://www.reddit.com/r/languagelearning/comments/111b6bp/how_people_learned_languages_before_the_19th/",
        "text": "I enjoy learning languages but I end up spending years to gain the basics then being totally overwhelmed when in the native country at first.  Although later able to naturally pick up the language my self to a very high level.    \nAlthough I have heard of people being stranded in other countries and then somehow picking up the language to a proficient level without any kind of learning,  maybe just a dictionary for help.  Apparently an German  Hans Staden ended up being captured by Tupinamba in South America, somehow learned the language or how to communicate then managed to convince these people to let him go.  There is an interesting video about his experiences!   \nAnother example  William Adams landed in Japan, learned Japanese and communicated with the Shogun at court.   Marco Polo probably knew the Mongol language and Persian.   \nI wonder were people just better at learning things fast back then or is our modern way of learning languages just not effective?",
        "created_utc": 1676300417,
        "upvote_ratio": 1.0
    },
    {
        "title": "People over 50 are some of the most passionate language learners there are!",
        "author": "justwannalook12",
        "url": "https://www.reddit.com/r/languagelearning/comments/111anug/people_over_50_are_some_of_the_most_passionate/",
        "text": "It's interesting to see daily posts here about if it is possible to learn a language over a certain age. In my experience, outside of forums and social media in general, older people are one of the most dedicated and passionate learners out there!\n\nWhat's your experience like, outside of the internet, about the people who learn languages?",
        "created_utc": 1676299533,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a multi language dictionary to search instantly in few languages?",
        "author": "weneedhugs",
        "url": "https://www.reddit.com/r/languagelearning/comments/11199p4/is_there_a_multi_language_dictionary_to_search/",
        "text": "I wish to start typing and see the matching words in say 5 different languages. Without having to go to a specific language pair section.\n\nHas anyone seen one? \n\ne.g I type “Area” and it brings up the spanish definition, beside any other language where Area has a meaning. \n\nDeepL sort of does this, but still detects one language at a time, and with single words it randomly picks one language. I’m looking for a side by side result of the meaning of that word in multiple languages.",
        "created_utc": 1676297825,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's not just you - movies are oddly hard to understand",
        "author": "Itdoesntmatteronebit",
        "url": "https://www.youtube.com/watch?v=VYJtb2YXae8",
        "text": "",
        "created_utc": 1676293570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Understanding The IELTS Format:Secrets of IELTS Success",
        "author": "mdajman",
        "url": "https://youtube.com/watch?v=Mx6hpuGLrCQ&amp;feature=share",
        "text": "",
        "created_utc": 1676293320,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is an easy language to learn that I can learn quick",
        "author": "BananaCheese01",
        "url": "https://www.reddit.com/r/languagelearning/comments/1117gx0/what_is_an_easy_language_to_learn_that_i_can/",
        "text": "I really want to show up to school one day and speak only a different language fluently all day and then never speak it again, and gaslight everyone",
        "created_utc": 1676292611,
        "upvote_ratio": 1.0
    },
    {
        "title": "Language Learners Community On Whatsapp",
        "author": "ken505000",
        "url": "https://chat.whatsapp.com/HSfSR8tReI12dU7dFhcufr",
        "text": "",
        "created_utc": 1676291156,
        "upvote_ratio": 1.0
    },
    {
        "title": "New to this area of Reddit, but help if you can!",
        "author": "Parvindie",
        "url": "https://www.reddit.com/r/languagelearning/comments/1116tah/new_to_this_area_of_reddit_but_help_if_you_can/",
        "text": "So I have recently started doing travel nursing in California, I really do love it here but we do have a large Spanish speaking population. I always wanted to learn another language and it would be so much better for my patients if I was able to communicate more effectively with them. My question is…\n\nDo apps like Duolingo work? I downloaded it and felt like the modules were paced nicely but didn’t know if anyone had any other recommendations. \n\nI don’t expect to learn a language in 3 months but want to have something to practice at and begin to grow. Thanks! 😊",
        "created_utc": 1676290437,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to maximise a month in country of TL",
        "author": "zeroicey",
        "url": "https://www.reddit.com/r/languagelearning/comments/1116lwh/how_to_maximise_a_month_in_country_of_tl/",
        "text": "I'm learning Brasilian Portuguese - I've only been taking it seriously a few months and not as advanced as I would like to be, but committed to getting to a basic level of comprehension and conversational ability in the next year. \n\nI'm in Rio for the next 5 weeks. I'll be with some English speaking friends and ill also be working remotely (in English) but I do plan to go out and socialise regularly with locals. \n\nDoes anyone have any advice/tips on how I can maximise learning during my time here. Compared to the first time I visited (a year ago)  when I didnt know a single word of the language,  I am recognising  basic words, greetings etc.    \n\n\nBut not sure if it's a dyslexic thing but I would get this freeze in exams where I know how to calculate the answer but my brain would stop me from remembering in the moment. It's that same feeling in these conversation. First trying to comprehend the individual words, then pick out the ones I know, then remember them accurately,  then try and guess what the sentence is, and then attempt to reply in Portuguese - by this point my brain is in overdrive and I end up blank on a basic sentense that actually I would understand if it was written down and said much slower x 3 lol   \n\n\nIs that something that happens when you learn a language? (This is my first experience I only speak English)  It almost feels more frustrating to recognise a word, rack my brain for the translation but still not understand. Oh also my reading is much better than my speaking or listening but it's not so useful here when its the speaking and listening I want to improve on.   \n\n\n  \nAnyway any advice would be appreciated, obrigadaaa",
        "created_utc": 1676289714,
        "upvote_ratio": 1.0
    },
    {
        "title": "App for reading bilingual books",
        "author": "reepush",
        "url": "https://www.reddit.com/r/languagelearning/comments/1116ir7/app_for_reading_bilingual_books/",
        "text": "I want to share with you the app called Language Flower. Here you can read books with parallel translation, translate words individually and listen to pronunciation. The app can be useful for both beginners and more experienced learners to increase their vocabulary and just enjoy reading. Books are translated in 8 languages.\n\nAlso worth noting that I'm the creator of Language Flower. The app is free and I hope you will like it. Please share your feedback in comments.\n\nApp Store:\nhttps://apps.apple.com/app/id1419671135\n\nGoogle Play:\nhttps://play.google.com/store/apps/details?id=com.duoreading",
        "created_utc": 1676289429,
        "upvote_ratio": 1.0
    },
    {
        "title": "New **Arabic** lesson added",
        "author": "Organic_Bumblebee740",
        "url": "https://youtu.be/NC819b53hFE",
        "text": "",
        "created_utc": 1676288966,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to learn German? Is there a book recording the best way to learn a language?",
        "author": "Congrats8086",
        "url": "https://www.reddit.com/r/languagelearning/comments/1111v6z/how_to_learn_german_is_there_a_book_recording_the/",
        "text": "So, I have been learning German for a while now and it's been a few years and I don't think I took the right path when I first started, I know many words, but don't know their pronunciation, so I was wondering if there were any books/documentaries which explained how our brains work when we learn languages and more importantly, give me a more efficient way of learning a language as I plan on learning more languages in the future. \n\nWhat I am talking about: If you have ever noticed it, you learn words in German/any other language faster if they sound similar to the ones in your language, for example the German word for Apple is Apfel and spater(a with an umlaut) for later, this helps me learn some words faster, so I was thinking If I was conscious of what's happening in my brain when I learn new languages, I would be more efficient in learning them, and hey, more efficient techniques won't hurt. \n\nShould I learn Grammar first, Vocabulary second, or should I first focus on pronounciation, etc etc...\n\nAlso, I am looking for a new book not one which was written 20 years ago before the advent of duolingo and online language learning, because they would be outdated. \n\nThank you!",
        "created_utc": 1676271213,
        "upvote_ratio": 1.0
    },
    {
        "title": "i bought a second hand watch in santiago, chile, and cannot figure out the language/meaning engraved on the bezel, help would be much appreciated!",
        "author": "WillhelmGrigger",
        "url": "https://i.redd.it/92rkibd0vxha1.jpg",
        "text": "",
        "created_utc": 1676268551,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to stay motivated to learn Spanish? (and how to not get stressed?)",
        "author": "DakoSuwi",
        "url": "https://www.reddit.com/r/languagelearning/comments/1110awy/how_to_stay_motivated_to_learn_spanish_and_how_to/",
        "text": "I started taking it seriously about 2 months ago, and now I can understand some bits of Spanish. however I tried to intensely focus on it to try to understand it. Now I just watch some videos in Spanish and just don't focus as hard as I used to lol. I am usually really hard on myself for not understanding the language, so I now have feelings of anxiety and stress, so that now I struggle to watch a 10 minute in Spanish. It's really difficult. I actually want to learn and understand the language, and it is fun but I just get stressed about it.",
        "created_utc": 1676265606,
        "upvote_ratio": 1.0
    },
    {
        "title": "What has overcoming a language barrier or learning a new language taught you (other than the language ofc)",
        "author": "jananananananahahaha",
        "url": "https://www.reddit.com/r/languagelearning/comments/110z37u/what_has_overcoming_a_language_barrier_or/",
        "text": "Doing a school project on language barriers and would appreciate it if you commented!",
        "created_utc": 1676261673,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can extensive reading help return native accent after attrition?",
        "author": "partitive",
        "url": "https://www.reddit.com/r/languagelearning/comments/110z0jg/can_extensive_reading_help_return_native_accent/",
        "text": "",
        "created_utc": 1676261431,
        "upvote_ratio": 1.0
    },
    {
        "title": "Offering: Mandarin (Native), Teochew dialect (Native) Cantonese (Conversational) English (Fluent) | Seeking: English",
        "author": "Hi_Lynnyan",
        "url": "https://www.reddit.com/r/languagelearning/comments/110yrnv/offering_mandarin_native_teochew_dialect_native/",
        "text": "[removed]",
        "created_utc": 1676260685,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I crazy or is this German Duolingo translation just wrong?",
        "author": "Soggy-Pouch",
        "url": "https://i.redd.it/gq5k9ucaowha1.jpg",
        "text": "",
        "created_utc": 1676254177,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many languages do you speak?",
        "author": "Sea_Rutabaga3823",
        "url": "https://www.reddit.com/r/languagelearning/comments/110vt0j/how_many_languages_do_you_speak/",
        "text": "",
        "created_utc": 1676251345,
        "upvote_ratio": 1.0
    },
    {
        "title": "Site for learning",
        "author": "Dry_Air_2000",
        "url": "https://www.reddit.com/r/languagelearning/comments/110txb3/site_for_learning/",
        "text": " \n\nDear Visitors,\n\nWelcome to our Preply site, where we focus on creating an effective and enjoyable platform for language learning.\n\nIf you have ever wanted to learn a new language or improve your existing knowledge, you have come to the right place. Our expert and experienced tutors are here to help you achieve your goals, whether you want to learn a language for personal or professional reasons.\n\nWith a wide range of languages to choose from, including English, Spanish, French, German, Italian, and many more, you are sure to find the perfect course to meet your needs. Our flexible and customizable classes allow you to choose the schedule and pace that works best for you, so you can learn at your own convenience.\n\nSo why wait? Start your language learning journey today and join the thousands of people who have already benefited from our platform. Sign up now and experience the joy of speaking a new language with confidence!  \n\n\n[https://preply.com/en/?pref=Njg0NDM3NA==&amp;id=1676245446.843637](https://preply.com/en/?pref=Njg0NDM3NA==&amp;id=1676245446.843637)",
        "created_utc": 1676245691,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long to retain a language as a baby?",
        "author": "Financial-Cherry8074",
        "url": "https://www.reddit.com/r/languagelearning/comments/110tr9f/how_long_to_retain_a_language_as_a_baby/",
        "text": "We are English speakers in the home  but we moved to Mexico for our son at age 4 to learn Spanish. He is now fluent. While here our daughter was born. She is now15 months. We’d like her to acquire Spanish too but intend to move to France for both to also learn French. What is the earliest we can move without losing her Spanish?",
        "created_utc": 1676245215,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any app/site to (text) chat with a teacher?",
        "author": "weneedhugs",
        "url": "https://www.reddit.com/r/languagelearning/comments/110t4ma/any_appsite_to_text_chat_with_a_teacher/",
        "text": "There’s Tandem to talk with strangers. And italki for video calling a teacher. What if all I need is texting a teacher for 15 minutes?",
        "created_utc": 1676243448,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clozemaster progress so far this year",
        "author": "Kantmzk",
        "url": "https://i.redd.it/jgfx7dwkirha1.png",
        "text": "",
        "created_utc": 1676242650,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning Through Input - 140 Hours Report",
        "author": "Menathraas",
        "url": "/r/French/comments/110sq8s/learning_through_input_140_hours_report/",
        "text": "",
        "created_utc": 1676242455,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning two languages at once",
        "author": "M3m3r0n1",
        "url": "https://www.reddit.com/r/languagelearning/comments/110rui9/learning_two_languages_at_once/",
        "text": "\n\nI have been studying German for half a year now and I have been wanting to learn Russian as well. I know they are both completely different languages and I’m sure learning them at the same time is possible but what would be the best way to do so? Would you even recommend this?",
        "created_utc": 1676240039,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your “rules” for daily writing streaks?",
        "author": "lingualLeprechaun",
        "url": "https://www.reddit.com/r/languagelearning/comments/110pfll/what_are_your_rules_for_daily_writing_streaks/",
        "text": "Do you use a dictionary and grammar charts or do you only allow yourself to write “naturally” without any aides?",
        "created_utc": 1676233818,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mochi Cards’ AI feature is a game changer",
        "author": "enjolrs",
        "url": "https://www.reddit.com/r/languagelearning/comments/110pbq1/mochi_cards_ai_feature_is_a_game_changer/",
        "text": "I’ve been aware of Mochi as an alternative to Anki for a while, but never committed because I couldn’t find a reason to justify the change from an established open-source app, especially after finding some pretty Anki templates. However, their new (?) pro AI feature has changed things for me. \n\nI’ve been using the AI to generate examples and definitions for words in my target language and this has not only sped up the process, but also showed me definitions and use cases that I wasn’t necessarily aware of just from the word list I’m pulling from. \n\nFor example, my German cards template includes the prompts:\n\n```\n&gt; &lt;ai&gt;Search an example sentence in German using the word &lt;&lt; word &gt;&gt;, then translate this sentence to British English while replacing the translation for the word &lt;&lt;word&gt;&gt; with \"﹍﹍﹍\"&lt;/ai&gt;\n\n&lt;ai&gt; List the definitions for the German word &lt;&lt; word &gt;&gt; in British English and list the source between parenthesis&lt;/ai&gt;\n```\n\nThe examples are pulled from Linguee, and the definitions are pulled from dictionaries like Oxford and Cambridge. The great thing is that it also obscures the translated word, so I can use both sides of the card. It’s obviously not as foolproof as taking native-proofed sentences, but I haven’t come across any issues so far.\n\nThe caveat is that the generated text is not exportable (instead, only the prompt shows up). This personally doesn’t bother me as my end goal is to not depend on flashcards at all, but I understand it’s an issue for some. \n\nMochi can also automatically pull images from a word or prompt, which I don’t use because I prefer choosing my icons while studying, but another feature that I do use is selectively formatting based on a checkbox. I don’t have to go through each card formatting based on gender, because the template does it for me. And something I never bothered to do with Anki, but now every one of my cards include it because of AI: automatic speech. \n\nThese aren’t free features, but their usefulness has more than justified the price of the subscription for me. \n\n(Disclaimer: this isn’t sponsored by the app and I don’t know the creator at all. Just wanted to share because it’s a great feature.)",
        "created_utc": 1676233536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Online RPG language learning simulator in virtual worlds",
        "author": "Formal_Sand_5456",
        "url": "https://www.reddit.com/r/languagelearning/comments/110oqrn/online_rpg_language_learning_simulator_in_virtual/",
        "text": "[removed]",
        "created_utc": 1676232071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should you practice words until you completely understand them before moving on?",
        "author": "elmy00",
        "url": "https://www.reddit.com/r/languagelearning/comments/110o70d/should_you_practice_words_until_you_completely/",
        "text": "Hey, basically I've started reading a lot in my target language recently. My routine goes something like this: \n\n- I see an unknown word, \n- I write it down with the translation,\n- Depending if I think it's interesting, I look it up in a couple of sentences to get a better grasp of it in context\n\nAnd I move on from it. The issue with this is most likely I will have to look it up again, and again since it doesn't usually stick after the 1st, 2nd or 10th time I come across it.\n\nDo most people do this? Seems wildly inefficient. But I just can't seem to get it to stick in my memory. \n\nI tried Anki, but I get bored by just going through a list of words and I slowly lose interest and concentration. Which doesn't happen when I'm reading a story or listening.\n\nI would like to know what you guys do or think of this! Cheers.",
        "created_utc": 1676230654,
        "upvote_ratio": 1.0
    },
    {
        "title": "Farsi for a Native Hindi Speaker",
        "author": "picky-penguin",
        "url": "https://www.reddit.com/r/languagelearning/comments/110nk15/farsi_for_a_native_hindi_speaker/",
        "text": "My wife is a native Hindi speaker and wants to learn Farsi. I am a native English speaker learning Spanish and have had great luck with comprehensible input available on YouTube. We are having trouble finding comprehensible input for Farsi for my wife. Can anyone recommend video/audio resources for a native Hindi speaker (also fluent in English, Telugu, and Tamil) to start to learn Farsi?",
        "created_utc": 1676229011,
        "upvote_ratio": 1.0
    },
    {
        "title": "structural mistakes?",
        "author": "Aromatic_Ad_7035",
        "url": "https://www.reddit.com/r/languagelearning/comments/110n7vj/structural_mistakes/",
        "text": "\\----------\n\ni k ne k\\`udr am sih t\n\naw aw uh ruk t\\`amai t\n\nso ahc\n\nruk k\\`udr am\n\nk\\`udr am \n\nt\\`amai t\n\nso ahc\n\nkak ka s ka i\n\nug ni\\`k ka i\n\nka i, rutsax ka i, ba ra ggin hs i, aw aw uh ka i, aubaza ka i, gaza ka i\n\nulut uk\n\n\\----------\n\n1 - k\\`udr am ag gud\n\n2 - ak kur am\n\n3 - uk kutur am arra\n\n4 - u hs u ka hs arab u rud laab\n\n5 - aiknaremmid laggul so ahc, so i, ruk k\\`udr am t\\`amai t\n\n6 - aiknaremmid laggul, i ran, i ka nunna, i gi gi, u hs i, bar na b\n\n7 - ud ulu rasa miksam na b\n\n8 - uk allitman uk kutuk uk utu na b\n\n9 - urman umalaka ka b\n\n10 - u rasa uk ir p laab\n\n11 - mila u rasa ut ara mrra b\n\n12 - annum mila u rasa k\\`udr am ut ata na b\n\n13 - utut mig u gur rud\n\n14 - annikku iz unna lib big\n\n15 - uk iz apnaga miggig\n\n16 - uk aga anna zrag hs am\n\n17 - uk ut i t hs am ma hs hs am so ruk k\\`udr am\n\n18 - u za hs annana hs hs am\n\n19 - isiz annanni hs am\n\n20 - mir hus mir hus lagrena hs hs am\n\n21 - mir ug hus mir hus rada hs hs am\n\n22 - mir haz unn ara ga hs hs am\n\n23 - mir ug haz mir ug haz mir haz udda hs it hs am\n\n24 - ulu lib ne ub bena hs hs am\n\n25 - nudape apna kanignuye\n\n26 - lagug ulu lib ne ahgga\n\n27 - lageh u hs i drub\n\n28 - risris t\\`amai t apna kuzuzadababukiripa\n\n29 - hal am aggud ahc ahc ab\n\n30 - lig rat hs i lab agga\n\n31 - am lig ru lab akka\n\n32 - am lig a arrugeya hs hs am\n\n33 - muluz laab abba\n\n34 - ummum t\\`amai t k\\`udr am laab ala lala\n\n35 - ram muluz t\\`amai t laab aradnna\n\n36 - rubud ba lagul ulut uk t\\`amai t htoht-gaza laab inga\n\n37 - anne ug lagap laab ab arra\n\n38 - hamrud lagul lab raga at ara\n\n39 - annun ara ig nnam ara\n\n40 - uk ud um ud ig ig at ara\n\n41 - anna lagul uh kid lab\n\n42 - aggu lagul rudiz\n\n43 - ugnik ir k\\`udr am ugnik u mir er ab\n\n44 - amnik iagiagne\n\n45 - ruk zise iageginen\n\n46 - libig arra tinga laab\n\n47 - udda i gi gi ummad o kak\n\n48 - urra hs a lab adna t\\`x ab\n\n49 - uriben k\\`udr am irigrigrid\n\n50 - maunnin k\\`udr am gid hs ag\n\n\\----------",
        "created_utc": 1676228141,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a good app for learning through long passages of text?",
        "author": "tunngasugit",
        "url": "https://www.reddit.com/r/languagelearning/comments/110ml8x/is_there_a_good_app_for_learning_through_long/",
        "text": "I’m a compulsive memoriser, and I’d like to chew on long paragraphs rather than learn phrases. Does anyone know of a convenient iOS app that would cater to me particularly?",
        "created_utc": 1676226540,
        "upvote_ratio": 1.0
    },
    {
        "title": "What languages are most beneficial to learn",
        "author": "supersafecloset",
        "url": "https://www.reddit.com/r/languagelearning/comments/110ml4x/what_languages_are_most_beneficial_to_learn/",
        "text": "What languages are most beneficial to learn, i believe that english is the most important language because most content reside with in it, but what are some other languages that if you learn will open new paths for you in terms of knowledge and carrier opportunities.",
        "created_utc": 1676226530,
        "upvote_ratio": 1.0
    },
    {
        "title": "is tandem dead ?",
        "author": "MasterGamut",
        "url": "https://www.reddit.com/r/languagelearning/comments/110mktt/is_tandem_dead/",
        "text": "Native in Spanish and English. Target language is Polish. I haven’t had a single person contact me. The handful of people I’ve texted haven’t replied back. Am I missing something ?",
        "created_utc": 1676226507,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't know what should i do",
        "author": "nekisdrah",
        "url": "https://www.reddit.com/r/languagelearning/comments/110l7s3/i_dont_know_what_should_i_do/",
        "text": "Few months ago i wanted to make my english fluent. I changed my phones language, started using(or tried) english apps like duolingo (which is not helpful because of its ease) anki (i didn't use that one much), watching yt channels about my personal interests, trying to talk by myself or friends at the same level as me for be exposed to language. The thing is i just can't sit and study for English (or anything) so i tried to experience it more to learn.\nActually i reached somewhere that i can't describe accurate with CEFR levels. I can read news, reddit posts, comments or short stories and i can understand 70-80% of what i read if isn't there lots of words that i dont know. I can watch TV shows if dialogues isn't too fast for me. I can speak and write okay/understandable but pretty slow.\nHowever the problem is my level is almost same as before these stuff i did. I feel like i stuck and don't know what should i do. Also i think my vocabulary is poor, i know 2000 words or smth i guess. My grammar has some problems too as you can see in this post. According the efset i am c1 but i don't think i am. I thought i was b2 but recently started to think that im b1.\n\nLong story short, i want to be fluent, at least strong b2 but i don't know what to do, i just stuck at somewhere even i dont know where is. I feel like whatever i do i just can't step forward. So i need help, what should i do?",
        "created_utc": 1676223125,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone plz tell me language or what she is saying",
        "author": "Elwood_lady",
        "url": "https://v.redd.it/tr4ryaasxtha1",
        "text": "Trying to find song",
        "created_utc": 1676221077,
        "upvote_ratio": 1.0
    },
    {
        "title": "IELTS",
        "author": "TeflNdango",
        "url": "https://www.reddit.com/r/languagelearning/comments/110k9m3/ielts/",
        "text": "Except for the UK, what other countries are exempt from writing the IELTS?",
        "created_utc": 1676220788,
        "upvote_ratio": 1.0
    },
    {
        "title": "Polyglot Group on Whatsapp",
        "author": "ken505000",
        "url": "https://chat.whatsapp.com/G3xvtNFsSVu3eIX28F31y7",
        "text": "",
        "created_utc": 1676219170,
        "upvote_ratio": 1.0
    },
    {
        "title": "No natives have a small vocabulary or use grammar incorrectly",
        "author": "mrbenten",
        "url": "https://www.reddit.com/r/languagelearning/comments/110ip85/no_natives_have_a_small_vocabulary_or_use_grammar/",
        "text": "I often see people insist that uneducated natives would have “a smaller vocabulary” than a well motivated B2 learner, or that they “don’t know anything” about their own language’s grammar. Both of these claims are false.\n\nAs language learners, we have a very narrow perception of the language. The things that are correct *to us* are what we read out of a textbook. *To us* that may be all the language is, and if someone doesn’t follow the rules *that we learned*, well, they must be wrong. If they don’t know the words *that we memorized*, then they must have a small vocabulary. The funny thing is we only think that because *we* have a small vocabulary and *we* don’t know all the rules.\n\nI used to be a high school teacher in an NYC public school for 5 years. From an academic standpoint, many of my students had “small vocabularies.” But if “small vocabulary” means that they only had a few ways to express certain things, then that was completely false. They had *dozens* of ways to express just about any multisyllabic word or complex phrase I might use. In fact, much of the vocabulary that they used were things that I was completely unfamiliar with, so from their perspective *I had the small vocabulary*. Sure, maybe they didn’t say “this is not a fabrication“ or “your behavior displeases me”, but to say their vocabulary was limited is just not true.\n\nNow over the years I was, by and large, able to understand them in these instances, but if I tried to repeat anything they said, I would sound strange. Why? *Because I wasn’t familiar with the grammar they were using.* They *did* have grammar rules that all of them used. And the amount of grammar rules they follow is probably no different than the amount of grammar rules you’re learning, they’re just different.\n\nI’m sure there’s also *a lot* of dialogue that they knew that they just never used in front of me. My last year I remember a student called himself a don. I said, “like Al Capone?” The entire class looked at me like I was crazy. Turns out, it means *Depend On Nobody.*\n\nNow maybe an educated *native speaker* would have a larger vocabulary than an uneducated one, because they’d be familiar with the formal rules &amp; their local dialects. But someone who just memorized some grammar rules out of a textbook? Not a chance.",
        "created_utc": 1676216788,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do you improve in speaking english? where can I find people that I can surround myself with and practice speaking english?",
        "author": "rkleigh",
        "url": "https://www.reddit.com/r/languagelearning/comments/110ik49/how_do_you_improve_in_speaking_english_where_can/",
        "text": "",
        "created_utc": 1676216412,
        "upvote_ratio": 0.99
    },
    {
        "title": "hi!",
        "author": "rkleigh",
        "url": "https://www.reddit.com/r/languagelearning/comments/110ifr7/hi/",
        "text": "",
        "created_utc": 1676216083,
        "upvote_ratio": 1.0
    },
    {
        "title": "IELTS",
        "author": "TeflNdango",
        "url": "https://www.reddit.com/r/languagelearning/comments/110i0ra/ielts/",
        "text": "Do native English speakers from UK have to take IELTS exams when they are moving to another country for work or study?",
        "created_utc": 1676215000,
        "upvote_ratio": 1.0
    },
    {
        "title": "What series or movies have helped you with your English / German?",
        "author": "speaxerNicole",
        "url": "/r/speaxlab/comments/110hpn0/what_series_or_movies_have_helped_you_with_your/",
        "text": "",
        "created_utc": 1676214392,
        "upvote_ratio": 1.0
    },
    {
        "title": "FUN and Easy English lessons",
        "author": "TeflNdango",
        "url": "https://www.reddit.com/r/languagelearning/comments/110hqkp/fun_and_easy_english_lessons/",
        "text": "I offer courses in: 📚\n👨‍👩‍👧‍👦Adult conversational English - All levels Beginner to Advanced\n👫English Speaking for Social purposes\n⛴️Travel English\n💻English for Work\n🎒English for Academic\n🤓English Reading skills\n👂English Listening skills + Comprehension\n📖Reading Comprehension\nDay to Day activity lessons \nAnd so much more... \n\nhttps://preply.com/en/?pref=NTIxMDM0NA==&amp;id=1676212174.724822",
        "created_utc": 1676214236,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to manage anger at the concept of grammatical gender",
        "author": "Maleficent_Bid917",
        "url": "https://www.reddit.com/r/languagelearning/comments/110ha5f/how_to_manage_anger_at_the_concept_of_grammatical/",
        "text": "Hello there fellow language enthusiasts.\n\nI am from hungary, and have fluency only in english. When a child, I was forced to try and learn german, since the town I grew up in was in majority a german place before the marxist-leninists forced people into gulags or forbidden the rest from speaking german. So when I started learning it, the language wasn't acively spoken by about three generations of my family already. I wasn't intrested in learning it then, since it was obligatory in school. Even then the concept and practice of grammatical gender drove me crazy. This anger and frustration didn't bother me for a long time, since I could learn english, which didn't have this grammatical category. But in college I had to give up latin, which I really wanted to learn, but I kept getting so so angry at having to memorise the gender of every noun. I know that these do not have a direct correlation to either biological s3x, neither social gender, and I know that there are rules of pronunciation which can help with memorisation, but the this angry feeling still remains, preventing me from being able to engage with learning. It always alienates me from the language. Did any of you have this specific problem? Not just frustration at not understanding something new, but a deep hatred for a grammatical concept you couldn't shake? If do, how did you overcome it?",
        "created_utc": 1676213010,
        "upvote_ratio": 1.0
    },
    {
        "title": "If I had near unlimited time and resources, what is the best and most efficient way to learn a language?",
        "author": "StrategyOrganic5265",
        "url": "https://www.reddit.com/r/languagelearning/comments/110gxy9/if_i_had_near_unlimited_time_and_resources_what/",
        "text": "[removed]",
        "created_utc": 1676212068,
        "upvote_ratio": 1.0
    },
    {
        "title": "I created an app to translate your WhatsApp messages",
        "author": "abhiank",
        "url": "https://www.reddit.com/r/languagelearning/comments/110gsr7/i_created_an_app_to_translate_your_whatsapp/",
        "text": "Hi all,   \n\n\nA couple of days earlier, someone created [a post](https://www.reddit.com/r/androidapps/comments/10yc8yb/whatsapp_for_android_is_it_possible_to_copy_a/?sort=new) asking for an easy way to translate his WhatsApp messages. He was copying each message and pasting it in Google Translate which was too many taps and inconvenient to constantly switch between apps. I was feeling a little adventurous so I quickly made a simple app to make it easier for them.   \n\n\nThe app reads all your notifications from WhatsApp and stores in a local database. Once you open the app, you see all your saved notifications and can click on any message to translate it. It sends the text to Google Translate where it gets translated to your selected language. Please check it out -   \n\n\n[https://github.com/kuwapa/NotificationTranslate/releases/download/1.1/app-release.apk](https://github.com/kuwapa/NotificationTranslate/releases/download/1.1/app-release.apk)  \n\n\nI hope you find this useful. I'm happy to take requests and make changes. Its an open source app and you can read the code here - [https://github.com/kuwapa/NotificationTranslate](https://github.com/kuwapa/NotificationTranslate).",
        "created_utc": 1676211647,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone tried Language Lords' technique?",
        "author": "Existential_Alasdair",
        "url": "https://www.reddit.com/r/languagelearning/comments/110g6c2/has_anyone_tried_language_lords_technique/",
        "text": "I am curious if anyone has tried his technique of memorizing a transcript of a 10 minute video. I have no issue memorizing text verbatim - it was actually required to pass some tests for my current job. I would really like to attempt to memorize a 10 minute video in Dutch for my 60 Day Dutch Challenge...kind of for the fun of it. Is this technique crazy? Has anyone had results doing it?\n\nLink for reference: [https://www.youtube.com/watch?v=jBNp4Zp1tok](https://www.youtube.com/watch?v=jBNp4Zp1tok)",
        "created_utc": 1676209846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning online",
        "author": "CyprienFME",
        "url": "https://www.reddit.com/r/languagelearning/comments/110fhmi/learning_online/",
        "text": "Hi everyone.\n\n&amp;#x200B;\n\nCan you tell me how you learn languages online, using which tools/websites and what are the pro and cons of each ?\n\n&amp;#x200B;\n\nThank you very much !",
        "created_utc": 1676207741,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello everyone, here is a discord link for anyone learning Turkish. I noticed there are servers for German and English but not Turkish.",
        "author": "Dry-Raspberry-3608",
        "url": "https://www.reddit.com/r/languagelearning/comments/110evx5/hello_everyone_here_is_a_discord_link_for_anyone/",
        "text": "[https://discord.gg/tXBM7War](https://discord.gg/tXBM7War)",
        "created_utc": 1676205808,
        "upvote_ratio": 1.0
    },
    {
        "title": "Check it out",
        "author": "Sensitive_Age_2284",
        "url": "https://youtu.be/36J4e_lBi7w",
        "text": "",
        "created_utc": 1676205237,
        "upvote_ratio": 1.0
    },
    {
        "title": "LEARN GERMAN LANGUAGE NOW!!!",
        "author": "Longjumping-March736",
        "url": "https://www.reddit.com/r/languagelearning/comments/110ejv5/learn_german_language_now/",
        "text": "[removed]",
        "created_utc": 1676204680,
        "upvote_ratio": 1.0
    },
    {
        "title": "How difficult would it be learning russian as a polish person?",
        "author": "zakiteru",
        "url": "https://www.reddit.com/r/languagelearning/comments/110dqb2/how_difficult_would_it_be_learning_russian_as_a/",
        "text": "",
        "created_utc": 1676201698,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who can I learn how to learn language effectively from?",
        "author": "EasyLifeLazyLife",
        "url": "https://www.reddit.com/r/languagelearning/comments/110ddin/who_can_i_learn_how_to_learn_language_effectively/",
        "text": "I’ve been watching Steve Kaufmann’s videos on YouTube recently. I realized I was making a lot of language learning mistakes, and I was fascinated by his theory, and even started using his app LingQ.\nI want to learn more about how to learn language effectively. Is there anyone you recommend to learn about it from?",
        "created_utc": 1676200327,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning multiple languages simultaneously?",
        "author": "Past_Cartoonist5081",
        "url": "https://www.reddit.com/r/languagelearning/comments/110d1f0/learning_multiple_languages_simultaneously/",
        "text": "Hey folks!\nAs you predicted from the title, I could not decide whether I should learn Russian or French. I am a student of International Relationships and I believe I have some ability to learn other languages. Instead of learning them one by one, I believe I can learn them simultaneously, because they are distinct languages and there is a low chance to mix them together. I am able to use freely a handful of tongues and maybe they can help.\nSo the languages I am able to: \nTurkish - Native Language\nEnglish - Advanced and Certified\nGerman - Advanced and Certified\nLatin - Advanced\nPersian - Intermediate\n\nSo, is it possible?",
        "created_utc": 1676199087,
        "upvote_ratio": 1.0
    },
    {
        "title": "Understanding words but not the sentence?",
        "author": "norfra",
        "url": "https://www.reddit.com/r/languagelearning/comments/110crx5/understanding_words_but_not_the_sentence/",
        "text": "Basically, when I read sometimes my brain knows each individual word in a sentence but not what they mean all together. It's really frustrating because I don't know how to improve this. My vocabulary is clearly not the problem but the grammar. This is a struggle when I speak too, I know all the words in my head but pulling them together is more difficult. \n\nHow should I work to improve this? I'm currently trying to read a bit every day, but should I be doing grammar exercises? The problem is that I don't even know which aspects of grammar to study, and it's frustrating. I feel stuck even though my vocabulary is pretty advanced.",
        "created_utc": 1676198099,
        "upvote_ratio": 1.0
    },
    {
        "title": "Language certificates",
        "author": "Negative-Athlete-86",
        "url": "https://www.reddit.com/r/languagelearning/comments/110ck6i/language_certificates/",
        "text": "Does anyone of you have language proficiency certificates proving that you know 3 languages at the C2 level ?",
        "created_utc": 1676197304,
        "upvote_ratio": 1.0
    },
    {
        "title": "Language proficiency certificates",
        "author": "Negative-Athlete-86",
        "url": "https://www.reddit.com/r/languagelearning/comments/110c343/language_proficiency_certificates/",
        "text": "Does someone of you have three languages proficiency certificates, proving that you know 3 languages at C2 level ?",
        "created_utc": 1676195501,
        "upvote_ratio": 1.0
    },
    {
        "title": "How some teachers discourage language study",
        "author": "evaskem",
        "url": "https://www.reddit.com/r/languagelearning/comments/110c0v7/how_some_teachers_discourage_language_study/",
        "text": "I'm studying French at university. For the most part, lessons with a teacher are not helpful to me, and especially not helpful in my first year of French, and I will explain why.\n\nMaybe you have encountered teachers of any subject with a God complex? This is exactly the kind of person. In my first year I was very bad at reading French, of course I had a strong accent. The teacher, apparently, thought that if you didn't learn to speak French in a short time, you were worthless as a student. She compared my accent (slurs and coarse words omitted) to \"black people in African countries\". Yes, she wasn't just saying that I don't speak/read French well, she was comparing my accent in this horribly racist way.\n\nEvery time I mispronounced something or stumbled when reading, she said that if I ever met a French person they wouldn't want to talk to me because I was a terrible speaker. That's why in my first year I started to slowly dislike the French language. I had no motivation, the constant criticism was exhausting. The only thing that saved me was that I started to study with a tutor. And then I realized how much praise and approval accelerate progress in learning French.\n\nUnfortunately, other students were completely discouraged from learning French because of this attitude. Some people even began to dislike the French language because of the attitude of the teacher, who not only criticized the students, but also created an image of the French native speakers as something horrible and rude. \n\nApparently, by constantly describing the French as prudes and people who can't stand mistakes in French from foreigners, she wanted to encourage careful study of the language, but it had the opposite effect.\n\nAs for me, thanks to the independent study of the language and the help of a tutor, by the end of the study I am very satisfied with my French, although a couple of years ago I literally cried over the textbook and did not want to study French, because I was afraid of the teacher.",
        "created_utc": 1676195271,
        "upvote_ratio": 1.0
    },
    {
        "title": "Locating specialist language learning materials used by graduate students?",
        "author": "SignificantCricket",
        "url": "https://www.reddit.com/r/languagelearning/comments/110bxkh/locating_specialist_language_learning_materials/",
        "text": "I've seen it mentioned before that some people have managed to find materials to learn a language focused on a particular academic subject, the way (post)graduate students may do to read research material and documents for their subject, with very little prior knowledge of the language. They end up with a very specialised vocabulary. I want to do this with German. I am usually good at locating reading lists and curriculum PDFs, but this is eluding me although the language I am after is German, not an unusual one. Can anyone point to which universities are good at putting this stuff online, or other useful sources?",
        "created_utc": 1676194915,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interesting",
        "author": "Ok-Seaweed8177",
        "url": "https://i.redd.it/arp81q521qha1.jpg",
        "text": "",
        "created_utc": 1676191728,
        "upvote_ratio": 1.0
    },
    {
        "title": "any advices or technics to learn Japanese ?",
        "author": "Myachyy",
        "url": "https://www.reddit.com/r/languagelearning/comments/110aisu/any_advices_or_technics_to_learn_japanese/",
        "text": "",
        "created_utc": 1676189188,
        "upvote_ratio": 1.0
    },
    {
        "title": "Polyglot bot for Telegram that rephrases your sentences and explains your mistakes",
        "author": "va1en0k",
        "url": "https://t.me/EveryLanguageGrammarBot",
        "text": "",
        "created_utc": 1676188842,
        "upvote_ratio": 1.0
    },
    {
        "title": "Teaching my children a language I am still actively learning…?",
        "author": "lchels88",
        "url": "https://www.reddit.com/r/languagelearning/comments/1108odp/teaching_my_children_a_language_i_am_still/",
        "text": "Hi, so here’s my story. I am half Korean, half American. My mother never taught my older sister and I Korean because we were living in the states. My Mom is still fluent in her native language, so I learned the basics from her when I became interested and still ask her some things from time to time. But during my high school and college years, I learned Spanish and Japanese. Had my community college offered Korean I would have take it. Had my high school offered Japanese, I would have taken it. But no, they were not offered. I took Spanish in High School instead of French or German because Spanish is one of the common languages here in the U.S. It was more useful. I learned Japanese out of interest and I am happy I did. I studied abroad to Japan and then visited again 8 years later, navigating on my own using my elementary Japanese skills. I wish to visit Japan time and time again. Now that I have two young kids, the oldest entering pre school this year, and 3 years of Japanese under my belt, I thought of maybe teaching my boys Japanese as their second language just to help me use it daily, to become more comfortable speaking it. Plus, it’ll be cool to have my boys be able to understand and use Japanese whenever we go to Japan someday. \n\nI know my Mom would probably be appalled by this, but I honestly find it hard to pronounce a lot of Korean words. I need to sit in a class setting to learn the language, and I wouldn’t know when I’d have time for that now.",
        "created_utc": 1676182012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mixing up two languages",
        "author": "nullaval_oszthato",
        "url": "https://www.reddit.com/r/languagelearning/comments/1108ah1/mixing_up_two_languages/",
        "text": "When I was younger I started learning Hungarian and German around the same time, and nowadays I mix up the words of the two languages which harms my fluency in both of them. So far the only way for me to remedy this situation is to avoid exposure to German so my Hungarian stays fluent (that is the more important one to me). But I don’t want this to be a permanent solution because it causes my German to weaken. There are also people in my life learning German and they want someone to practice with. Is there a way I can fix this issue of mine or do I just have to abstain from German for the rest of my life if I want to remain fluent in Hungarian?",
        "created_utc": 1676180639,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello everybody! I’m 19yo, I’m from Russia and I study english. I’m looking for people who can help me with learning english through internet communication. I can help with learning russian(if you want)! Thanks for your attention! And as a thank you, here are my cats:",
        "author": "cybermargina",
        "url": "https://www.reddit.com/gallery/110605u",
        "text": "",
        "created_utc": 1676172713,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Flirt in German lol",
        "author": "AsphaltStealer74",
        "url": "https://youtu.be/NbLumb-CuF8",
        "text": "",
        "created_utc": 1676170737,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone want to review our self-made French syllabus?",
        "author": "SFLADC2",
        "url": "https://www.reddit.com/r/languagelearning/comments/1104s66/anyone_want_to_review_our_selfmade_french_syllabus/",
        "text": "Hi all,\n\nWe're 2 (aspiring) language learners attempting the self-teaching route. We built a 10-week syllabus for ourselves to start to learn some French (we both know 0% right now). We both work full time fairly intense jobs so it wasn't possible for us to sign up for night classes, so we thought this method might be the next best thing to give us some balance between structure and flexibility.\n\n\n\nWe know we won't know much at the end of the 10 weeks, but I figure it's a good start and will let us get more in depth in the 10 weeks after that. Any notes from anyone familiar w/ french or the general language learning process would be greatly appreciated!\n\nhttps://drive.google.com/file/d/14jjknupaZ66TOTZCmNWO7ytl4KlL-b1S/view?usp=sharing\n\nthx!",
        "created_utc": 1676168815,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone want to review our self made French syllabus?",
        "author": "FrenchWantaBe",
        "url": "https://www.reddit.com/r/languagelearning/comments/1104pu3/anyone_want_to_review_our_self_made_french/",
        "text": "[removed]",
        "created_utc": 1676168605,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just moved down to the Rio Grande Valley in Texas, I decided I better take my shot at being bilingual because I got the immersion part down already. My biggest insecurity is the American accent when speaking. Should I focus on words and grammar first and not hyper fixate on my accent?",
        "author": "Severe_Ad4138",
        "url": "https://www.reddit.com/r/languagelearning/comments/1104ll9/just_moved_down_to_the_rio_grande_valley_in_texas/",
        "text": "Shit makes me break a sweat mid sentence if I Americanize a word too much lol I’d do much better if I didn’t do that. Part of it is also that I’m in a Nursing Assistant program, and I’m one of the 2 guys in there. So I’m being taught Spanish by a bunch of Latinas some of which are pretty attractive, so slightly intimidating… but it’s fun😂\n\nI know since I’m surrounded by Mexican Spanish on a daily basis I should pick up a Mexican accent quicker than if I still lived in Ohio. So there’s that. Excited to learn thus far!",
        "created_utc": 1676168244,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got my first ad in Korean!",
        "author": "Thartperson",
        "url": "https://i.redd.it/183e2rm5jpha1.jpg",
        "text": "",
        "created_utc": 1676167704,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is busuu premium worth it?",
        "author": "Ranamiau",
        "url": "https://www.reddit.com/r/languagelearning/comments/1103twf/is_busuu_premium_worth_it/",
        "text": "I've been learning polish in busuu for like a month now, I finished all the A1 lessons and I really felt like I progressed, but when I wanted to continue, all the other levels are premium, I'm considering to buy it, is it worth it?",
        "created_utc": 1676165835,
        "upvote_ratio": 1.0
    },
    {
        "title": "should I Learn a second language if i'm bad at my native language? should I just focus on getting better at my native language?",
        "author": "Late_Mountain3041",
        "url": "https://www.reddit.com/r/languagelearning/comments/1103j1i/should_i_learn_a_second_language_if_im_bad_at_my/",
        "text": "",
        "created_utc": 1676164944,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on \"speakspanishfaster.com\"?",
        "author": "nickbox441",
        "url": "https://www.reddit.com/r/languagelearning/comments/11035lo/thoughts_on_speakspanishfastercom/",
        "text": "I came across rocky of \"speakspanishfaster\" from his youtube and was interested because his reasons for learning Spanish are similar to mine (My family moved from the Island to mainland and my mother never taught me Spanish or spoke it around the house). I'm interested in learning Spanish with a Puerto Rican accent which I believe he could provide much insight into. My pause is that every time I go to the site to sign up it reads like some old internet scheme or infomercial designed to scam you out of money. \n\nHas anyone used his lessons before or have any insight on how legitimate it is?",
        "created_utc": 1676163841,
        "upvote_ratio": 1.0
    },
    {
        "title": "Language test",
        "author": "idkopm",
        "url": "https://www.reddit.com/r/languagelearning/comments/11035e3/language_test/",
        "text": "Hello Everyone,\n\nI was wondering what governing bodies for language comprehension test exist. Kinda of how like med students have the AAMC with their MCAT or college board has there SAT/ACT. If I wanted to have a certificate that proves I know a language to some level. What would organization/ test be.\n\nI’m mainly looking into to this to see if there is any practice test so I can get a diagnostic on my current Spanish level.",
        "created_utc": 1676163826,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking participants for a survey on ChatGPT for foreign language learning (Final call for participants; Please help!)",
        "author": "doctoralstudent206",
        "url": "https://www.reddit.com/r/languagelearning/comments/1102ulp/seeking_participants_for_a_survey_on_chatgpt_for/",
        "text": "Hi everyone,\n\nI shared this survey a few weeks ago and got a handful of responses (thank you to those who completed it🙏) . I'm hoping to get at least 100 respondents (currently around 50) before the survey closes next week and would greatly appreciate your help. Understandably, the use of ChatGPT for foreign language learning is a controversial topic, and I'd like to hear learners' opinions on the issue. \n\nOne of the main reasons why I'm requesting participants from Reddit is because self-directed/informal language learners are underrepresented in foreign language research compared to those learning a TL at a formal school or institution. I know that this doesn't reflect all the learners in this sub, but I suspect many of you are studying a TL independently without the guidance of a formal language instructor.  It is important to note that both independent language learners and those who are taking formal language classes are eligible to participate. The only requirements are that participants must be at least 18 years of age and must have experience using ChatGPT to learn a foreign language. Experience using ChatGPT in this context is fairly broad. I'd be happy to hear your responses even if you've only used it a few times to evaluate its potenital as a language learning resource.  \n\nPlease click on the link below if you are interested in completing the survey. Based on previous responses, it should only take about 5 minutes to complete. Data will be collected anonymously and I will share the results with this sub when they are ready. Thanks for your time and help!! \n\n[https://iu.co1.qualtrics.com/jfe/form/SV\\_a3LmZMMD5aGEo86](https://iu.co1.qualtrics.com/jfe/form/SV_a3LmZMMD5aGEo86)",
        "created_utc": 1676162961,
        "upvote_ratio": 0.99
    },
    {
        "title": "Any Hawaiian speakers? Question about pronunciation of word “maliu”",
        "author": "SignorAlberto2022",
        "url": "https://www.reddit.com/r/languagelearning/comments/1102j2f/any_hawaiian_speakers_question_about/",
        "text": "I’m wondering if in this word the stress goes on the “a” or on the “i”? Thank you in advance. \n\nFor those wondering btw, the word means “To heed, give attention, listen, look upon with favor, turn toward.” — \n\nhttps://wehewehe.org/gsdl2.85/cgi-bin/hdict?e=q-11000-00---off-0hdict--00-1----0-10-0---0---0direct-10-ED--4--textpukuielbert%2ctextmamaka-----0-1l--11-en-Zz-1---Zz-1-home-maliu+--00-4-1-00-0--4----0-0-11-00-0utfZz-8-00&amp;a=d&amp;d=D12628#hero-bottom-banner",
        "created_utc": 1676162030,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am an absolute beginner to foreign language learning and I am finding it quite daunting",
        "author": "araiderofthelostark",
        "url": "https://www.reddit.com/r/languagelearning/comments/1102gt4/i_am_an_absolute_beginner_to_foreign_language/",
        "text": "Hello. I am a native Polish speaker. I have grown up in Poland and am pursuing a college degree in said country.\n\nThis is my very first time learning a foreign language, and I am finding it quite daunting.\n\nI am attempting to learn Italian, but I don't really know how to do it.\n\nI am trying to converse with ChatGPT, but unfortunately, I am not able to come up with a lot say yet.\n\nWhat should I do.",
        "created_utc": 1676161854,
        "upvote_ratio": 1.0
    },
    {
        "title": "The importance of taking breaks with immersion",
        "author": "harsh-brown",
        "url": "https://www.reddit.com/r/languagelearning/comments/1102e6n/the_importance_of_taking_breaks_with_immersion/",
        "text": "I live in Sweden and I’ve been learning Swedish for almost two years now. After the first 9 months, I could read and write quite okay because of its relatively similar logic to English grammar. I could watch tv shows without any problem if I had Swedish subtitles on. But I struggled a lot with listening. So I started listening to podcasts everyday for probably 3 hours or sometimes more and only allowed myself to watch Swedish shows. So that went on for 6 months. Then Christmas came, I was hoping I could understand at least half of what my partner’s Swedish family said at dinner. But no, that didn’t happen. I could understand perhaps 20% at best. I then went back to my home town for holiday so basically took a break from Swedish completely for 2 weeks. After I came back to sweden, instead of doing intense listening, I only used Drop to expand my vocabulary which has been very enjoyable actually. Just now I was at dinner again with all the swedes and I found myself all of a sudden could understand probably 70% of the conversations. So what I’m trying to say is, if you feel like you are hitting a plateau, perhaps a break could be a good idea. Your brain probably needs time to digest what you’ve absorbed and what you’ve been studying isn’t going to slip away just because you take a break for 2 weeks. \n\nDoes anyone have similar experience?",
        "created_utc": 1676161651,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long was it before your brain switched from “I don’t know that language” to actively trying to understand without forcing it?",
        "author": "thedarklord176",
        "url": "https://www.reddit.com/r/languagelearning/comments/1101ckv/how_long_was_it_before_your_brain_switched_from_i/",
        "text": "Quite often now if I pay close attention to what I’m listening to or watching I will understand some of it, but unless I intentionally try to do so my brain defaults to “we don’t understand Japanese” mode and treats it like I’ve never even studied the language. It’s quite annoying.",
        "created_utc": 1676158720,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi guys, can you rate my speaking from 1-10 and tell me what should I improve?",
        "author": "ShadowPanda6",
        "url": "https://www.reddit.com/r/languagelearning/comments/1100bqe/hi_guys_can_you_rate_my_speaking_from_110_and/",
        "text": "&amp;#x200B;\n\n*Processing video f6a6c45e2nha1...*",
        "created_utc": 1676155872,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I learn any language",
        "author": "Familiar-Horror5341",
        "url": "https://www.reddit.com/r/languagelearning/comments/110095c/how_do_i_learn_any_language/",
        "text": "How do I learn a new language? I’ve tried 26 times to learn a new language but none of the resources I’ve used have worked ever. I’m worried I’ll never be able to learn a new language. Please help me if you can.",
        "created_utc": 1676155679,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning Spanish, but my basic level French is getting in the way",
        "author": "momprof99",
        "url": "https://www.reddit.com/r/languagelearning/comments/11007zp/learning_spanish_but_my_basic_level_french_is/",
        "text": "Native English speaker here. I took French in high school and have traveled to France in my twenties. I speak a very basic level of tourist French, but have had very little to do with French in decades. Now I am trying to learn Spanish for a summer trip and my brain keeps going to French. I have to make a serious effort with pronunciation etc. The cognates are a nightmare. For example, \"perdon\" comes out of my mouth in a French accent!!  Seems like languages learned when younger just stay stuck in your head somewhere. Is this common?  It's hard enough learning a new language in your fifties without this extra baggage. Any ideas how to get around it? Thanks!",
        "created_utc": 1676155593,
        "upvote_ratio": 1.0
    },
    {
        "title": "A new language",
        "author": "Familiar-Horror5341",
        "url": "https://www.reddit.com/r/languagelearning/comments/11006iy/a_new_language/",
        "text": "How do I learn a new language? I’ve tired everything and I still gave up. This is my 27th try",
        "created_utc": 1676155482,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you pay $200/week for language coaching?",
        "author": "languagecheckhigh",
        "url": "https://www.reddit.com/r/languagelearning/comments/10zz752/would_you_pay_200week_for_language_coaching/",
        "text": "[removed]",
        "created_utc": 1676152874,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anybody know of any websites that have free books in french?",
        "author": "Large_Chair_",
        "url": "https://www.reddit.com/r/languagelearning/comments/10zyho4/does_anybody_know_of_any_websites_that_have_free/",
        "text": "",
        "created_utc": 1676151013,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking too learn Spanish.",
        "author": "Trane8890",
        "url": "https://www.reddit.com/r/languagelearning/comments/10zycs3/looking_too_learn_spanish/",
        "text": "[removed]",
        "created_utc": 1676150641,
        "upvote_ratio": 1.0
    }
]