[
    {
        "title": "Audio immersion software testers",
        "author": "stackdynamicsam",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kwbck/audio_immersion_software_testers/",
        "text": " Hello, I’m a software engineer based in the UK. \n\nI was frustrated that I couldn’t find enough spoken word content about the things that really interest me when learning Spanish. So I’ve built a platform for intermediate language learners which generates audio content which interests them in their target language.\n\nTo give you an example, a friend has been using it to do a deep dive in French on the Particular Music Production software he uses in his work as a Sound Engineer, having emigrated to Brussels; he's found it invaluable for improving his communication with clients and other engineers. But really you get audio to listen to about anything you want from Kpop to Krusty the Clown.\n\nCurrently it supports Spanish, English, French, German, Korean, Italian and Japanese. \n\nIt’s very early days (and I’m working completely on my own) but it would be great if people were interested in testing it for me and giving me feedback. \n\nIt’s currently live but in a controlled state, so I’d have to add you to a whitelist.\n\nPlease let me know if this sounds interesting to anyone.",
        "created_utc": 1678187114,
        "upvote_ratio": 1.0
    },
    {
        "title": "do you want to learn the Somali language?",
        "author": "SaciidTheWriter",
        "url": "https://i.redd.it/yyzkd2tcpama1.png",
        "text": "",
        "created_utc": 1678185452,
        "upvote_ratio": 1.0
    },
    {
        "title": "Storylearning program Japanese",
        "author": "LOL_Meister_97",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kv247/storylearning_program_japanese/",
        "text": "I am interested in the program by Olly Richards but I am wondering if it is legit?\nAnd there are different sites that come up on a google search [like this](https://courses.storylearning.com/courses/category/Japanese) and also that](https://learn.storylearning.com/japanese-uncovered-level-1-order-form1674243186589).\nHas anyone bought it? Is there a difference between thise links?",
        "created_utc": 1678183130,
        "upvote_ratio": 1.0
    },
    {
        "title": "2 Chinese Tutorial 每天学习一句中文之签证&amp;使馆 Visa &amp; Embassy in Chinese",
        "author": "Hello_Irene",
        "url": "https://youtube.com/shorts/vrvuvxEdXTU?feature=share",
        "text": "",
        "created_utc": 1678180299,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tip for Dutch practice: Flemish Government Officials are mostly obliged to only respond in Flemish/Dutch, no matter what language you speak to them",
        "author": "ProjectPrestigious56",
        "url": "https://www.reddit.com/r/languagelearning/comments/11ku26m/tip_for_dutch_practice_flemish_government/",
        "text": "I know, Flemish and Dutch aren't identical, but it is close enough I think to practice with, as most officials have to respond in Flemish. \n(Based on many people complaining about many Dutch switching to English)\n\nIn general, Flemish people are much less inclined to switch to English, in comparison with Dutch people.\n\nThe majority of government offices in Flanders are obligated to converse only in Flemish. Even if they understand you when you speak French/English to them, they'll have to respond in Flemish.\nThis is really frustrating if you've moved there and don't speak the language yet, but a dream for those who want immersion and practice of the language. \n\nSo the next time you think of going to the Netherlands just to practice your Dutch, maybe consider Flanders, Belgium instead;\n\nHope this might help some people :) \n\n\n(in practice, a few officials just don't care or will speak English/French to you in some backroom, but majority of times only Flemish)\n(Some offices are special multilingual facilities, where the officials are allowed to and should also speak French, English, etc. to you, try avoiding those if you want practice)",
        "created_utc": 1678179450,
        "upvote_ratio": 1.0
    },
    {
        "title": "I swear i will make you proud!!",
        "author": "pettyaf52",
        "url": "https://www.reddit.com/r/languagelearning/comments/11ktt7b/i_swear_i_will_make_you_proud/",
        "text": "\nGuys, guys! Lookin to find anyone who speaks arabic. I want to learn the language but idk where to start. Im from eritrea, so maybe i will teach you tigrigña   (yes it’s a language not a kinda of bread)  or maybe you will convince me to switch to russia to get rid of me later on, and then i will make another post and meet a beautiful russian man and fall in love… idk time will tell!!",
        "created_utc": 1678178508,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are some language schools that accept international students and are relatively affordable ?",
        "author": "Abdullah_88",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kts1u/what_are_some_language_schools_that_accept/",
        "text": "",
        "created_utc": 1678178391,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning through reading is great",
        "author": "msawrlz",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kronq/learning_through_reading_is_great/",
        "text": "I never really believed in it, but since I fought myself to a level where I can read a novel with relative ease, I realized it's a game changer.\n\nTrick is you have to fight to get to that level.",
        "created_utc": 1678170988,
        "upvote_ratio": 1.0
    },
    {
        "title": "I passed the French DALF C2 exam! Might you have any questions?",
        "author": "Same-Bookkeeper-1936",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kqoyh/i_passed_the_french_dalf_c2_exam_might_you_have/",
        "text": "\\[cross-posted from r/French (link [here](https://www.reddit.com/r/French/comments/11jrbix/jai_réussi_au_dalf_c2_d_avezvous_des_questions/))\\]\n\n&amp;#x200B;\n\n[French exam \\(DALF C2 certificate\\)](https://preview.redd.it/geq2btnq69ma1.png?width=2388&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=12e4f35c5b8ecb6aca710eff2da6ef1d66a0ad1d)\n\n&amp;#x200B;\n\n**Some thoughts &amp; reflections:**   \n\n\n* Profile: Singaporean, exposed to English and Mandarin from young. Never lived in France though I would not be opposed to the idea.\n* It took me three years to arrive at C2. I did two exams in total; I also took B2 about a year before C2. An approximation of my journey is as follows:\n* Year 1—Earlier levels (A2 and B1): I found \"*Grammaire progressive du français (Livre intermediaire)*\" by Maïa Grégoire and Odile Thievenaz to be really helpful. It really drilled in me the basics of French grammar. Initially I did more grammar than vocabulary. Listening to [https://www.francetvinfo.fr/en-direct/radio.html](https://www.francetvinfo.fr/en-direct/radio.html) was quite helpful, too.  \nDuring this phase I probably spent at least 10 hours on French per week.\n* Year 2—Mid-way point onwards (from B2): I started exposing myself to a range of authentic resources in French. I enjoy reading random but free things like [http://www.inegalites.fr](http://www.inegalites.fr/) and if I get lucky some free content on *Le Monde*, etc. I love texts and literature in the French language. I've read *Retour à Reims* by Didier Eribon and *Le Dernier Ami* by Tahar Ben Jelloun. I started to take vocabulary more seriously and kept a notebook containing new words. Additionally I began doing a lot more language exchanges with others to train my speaking. I found my holidays in France to be very precious as I got to practise ***a lot***.\n* Year 3—Later levels (C1 and C2): a lot of self-studying, practising mock papers, etc. I watched a ton of films in French and read more widely, ranging from literature to non-fiction like politics, economics, sociology, history and other humanities/social science topics. This was really mostly independent learning and the occasional checking in with native and highly advanced speakers of the language.",
        "created_utc": 1678167948,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone here successfully managed to become fluent in Estonian as a second language?",
        "author": "firetonian99",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kq17p/has_anyone_here_successfully_managed_to_become/",
        "text": "Just kinda discouraged at my lack of progress even with all my exposure…",
        "created_utc": 1678166008,
        "upvote_ratio": 1.0
    },
    {
        "title": "I passed the French DALF C2 exam! Might you have any questions?",
        "author": "Same-Bookkeeper-1936",
        "url": "https://i.redd.it/5vulx7abh2ma1.png",
        "text": "",
        "created_utc": 1678165540,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I supplement my tutoring lesson?",
        "author": "findzahra",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kox0u/how_do_i_supplement_my_tutoring_lesson/",
        "text": "I decided to sign up for Urdu lessons on Preply and my goal is to get 2 hours a day of Urdu practice in. Practice being composed of either my lesson (1 hour) or self-study. I have four 1-hour lessons a week. I'm having trouble with the self study portion because I'm not sure what is the best way to compliment what I'm learning from my tutor. I've asked my tutor and she said that I don't need to worry about that but if my goal is to be as close to C1 as possible, then I need to get a move on things. \n\nTDLR: What resources do you use to compliment your language lessons?",
        "created_utc": 1678162882,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to learn Italian in preparation for a move there any tips?",
        "author": "barlbootyeat",
        "url": "https://www.reddit.com/r/languagelearning/comments/11ko8vt/want_to_learn_italian_in_preparation_for_a_move/",
        "text": "",
        "created_utc": 1678161045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning spanish/russian",
        "author": "Jester_Mask27",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kndvz/learning_spanishrussian/",
        "text": "Hello guys, my goal is to learn spanish and a little russian in the next 6 months. I've been screwing around with spanish on Duolingo but I feel like its a bit tedious and I'm here to get some ideas on better ways to learn. Anybody have any tips in general for me or these 2 langauges in particular?",
        "created_utc": 1678158683,
        "upvote_ratio": 1.0
    },
    {
        "title": "Non-Arabs trying to Pronounce the most Difficult Arabic Words. How did they do??",
        "author": "Abu_Asher",
        "url": "https://youtube.com/shorts/1U1efVrLrRU",
        "text": "",
        "created_utc": 1678158253,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning languages by speaking extremely simple",
        "author": "IsakOldton",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kmlo1/learning_languages_by_speaking_extremely_simple/",
        "text": "I was wondering to what extent it could be useful to learn a language in a very simple way. For example, if I want to learn English, I would just make super simple (and weird) sentences:\n\ne.g. I want eat, I name Isak, I work tomorrow, Work you yesterday?\n\nNo conjugation, just some time markers. Almost no grammar. Obviously, speaking any languages like this could quickly help during a trip. But I was wondering if this method would be interesting to start with a language, just to be able to learn more words, keep motivation, start to speak. And on this basis, learning more and more the full language.\n\nDid someone try such a path?",
        "created_utc": 1678156637,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im working on a project and would love some feedback about your experience with language learning!",
        "author": "yangxin666",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kkx78/im_working_on_a_project_and_would_love_some/",
        "text": "\n\nWhat are your current pain points with language learning?\n\nWhat language learning apps or games are you currently using, and what do you like or dislike about them?\n\nIf you could design your ideal language learning app or game, what features would it have?\n\nHow important is regular practice and feedback to your language learning process?\n\nHow do you feel about incorporating AR/VR technology and gamification into language learning?",
        "created_utc": 1678152486,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you rather have access to 1 hour of professionally translated content (with explanations of slang/nuances), or access to 48 hours of machine translated content (Google, DeepL, etc)?",
        "author": "falafelsatchel",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kkj0k/would_you_rather_have_access_to_1_hour_of/",
        "text": "In both cases:\n\nthe content is real world content directly from native speakers\n\nthe translations and grammar rules are displayed in a manner which makes the native content easy to consume\n\n[View Poll](https://www.reddit.com/poll/11kkj0k)",
        "created_utc": 1678151499,
        "upvote_ratio": 1.0
    },
    {
        "title": "Latin And Irish Have No Words For Yes Or No.",
        "author": "Healthy-Ad7983",
        "url": "https://avecfacts.com/2023/03/07/latin-and-irish-have-no-words-for-yes-or-no/",
        "text": "",
        "created_utc": 1678149315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Perfectionism",
        "author": "Hateshinay",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kizih/perfectionism/",
        "text": "I was never a paranoid, perfectionist person. But when it came to the language I'd been studying for almost a decade, it definitely turned into a wild mix of emotions. \n\nWhenever I made a slight mistake either it be while listening, talking or writing, I would get extremely upset as to how the hell that could happen considering the amount of effort I have put into learning the language.\n\nBut then as years go by I realize that mistakes are a part of the journey, and will always happen even on our native language. There's absolutely no need to be perfect, even when talking to natives. Most of em will be impressed that you've dedicated so much time into it.\n\nTo this day, I still make lots of mistakes. But that's the secret, these tiny mistakes will keep boosting the learning process endlessly.\n\nStay strong my fellow learners, you are already many steps ahead of yourself when compared to your younger version!",
        "created_utc": 1678147783,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone have experience practicing your target TL with AI chat bots?",
        "author": "nordlundze",
        "url": "https://www.reddit.com/r/languagelearning/comments/11khf1n/anyone_have_experience_practicing_your_target_tl/",
        "text": "",
        "created_utc": 1678144222,
        "upvote_ratio": 1.0
    },
    {
        "title": "How likely is it to go from being able to pass the B1 DELF exam to being able to pass the C1 one in 3.5 months?",
        "author": "leZickzack",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kgq5m/how_likely_is_it_to_go_from_being_able_to_pass/",
        "text": "I started learning French in mid-December. Over the last two months, I have put 90 hours into studying and passed the B1 exam in early February. FWIW, since I had a couple of important law school exams in the past few months, the 90 hours I was able to put then isn't representative of how much time I'll be able to put into studying French over the next few months.\n\nI know that passing the C1 exam in such a short time frame is a very ambitious (perhaps even delusional) goal but my thought process is the following:Most guidebooks/websites/forum posts say that it usually takes 250-500 hours to reach B1 level. I have done it in around 90 hours. IMost people also say that reaching C1 generally takes 700-1000 hours. I'm wondering whether I can apply the B1-multiplier to the C1 study time, meaning I would need something like 200-300 hours to get to C1. \n\nSmall note: I am mainly concerned with being able to pass the C1 exam. I am well aware that passing the exam and actually acquiring the competencies described by the CEFR are two different things! But my main goal is passing the exam--I'm pretty sure I'll achieve the language level in the next two years anyway since I'll be studying in France for two semesters starting in September.",
        "created_utc": 1678142684,
        "upvote_ratio": 1.0
    },
    {
        "title": "How mutually intelligible are Saudi, Yemeni, and Standard Arabic with each other?",
        "author": "NeverBefore800",
        "url": "/r/learnarabic/comments/11kftkp/how_mutually_intelligible_are_saudi_yemeni_and/",
        "text": "",
        "created_utc": 1678140738,
        "upvote_ratio": 0.99
    },
    {
        "title": "How mutually intelligible are Saudi and Yemeni Arabic?",
        "author": "NeverBefore800",
        "url": "/r/learnarabic/comments/11kfnnt/how_mutually_intelligible_are_saudi_and_yemeni/",
        "text": "",
        "created_utc": 1678140361,
        "upvote_ratio": 0.99
    },
    {
        "title": "What are some countries in Europe where the people usually don't (or are not able to) switch to English when you try speaking to them in their language?",
        "author": "Digitalmodernism",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kef6s/what_are_some_countries_in_europe_where_the/",
        "text": "This is a common problem for a lot of languages spoken in countries where most people can speak English. Places like the Netherlands and Scandinavia are natorious for this and it makes it hard for those who are trying to learn their languages. What are some countries where this is either the opposite(even if they know you speak English they won't switch),they prefer not to switch, or most people aren't able to since they don't know much English?",
        "created_utc": 1678137656,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do people learn two languages at a time?",
        "author": "Degstoll",
        "url": "https://www.reddit.com/r/languagelearning/comments/11ke1pd/how_do_people_learn_two_languages_at_a_time/",
        "text": "So, I know a bit of French, have been learning it for over a year and my goal is to become fluent in it, but I've also been interested in learning Greek (I already know the alphabet and how to kind of read in Greek, though I still have work to do) since I find classic culture, Greek mythology and etymology interesting and like to use scientific terminology, but due to school, I don't have too much time to learn, luckily, I learn French at school so I will focus more on Greek at home.\n\nSo, if you've ever learnt two languages at time and reached conversational fluency, may I know what methods you used and how you managed your time and language resources?",
        "created_utc": 1678136861,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could have been me lol",
        "author": "FiaDay",
        "url": "https://i.redd.it/fjc9254n48ma1.jpg",
        "text": "",
        "created_utc": 1678136245,
        "upvote_ratio": 1.0
    },
    {
        "title": "Poliespo?",
        "author": "Extronic90",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kd28n/poliespo/",
        "text": "Hello! I am an intermediate Esperanto speaker. Does anybody have any resources for learning Poliespo? Thank you",
        "created_utc": 1678134812,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you have any material recommendations for Tagalog, Taiwanese, and Vietnamese?",
        "author": "Vy_Passos",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kcjoe/do_you_have_any_material_recommendations_for/",
        "text": "It's been a while since I decided I would like to start learning Tagalog, Taiwanese, and Vietnamese. I know there is Viet in Duolingo, but I wouldn't say I like using Duolingo, even as a plus for my study sessions. And I know there are a lot of books about these languages out there, but after trying a few ones in other languages, I know there is a huge possibility of them not being any good.\n\nSo, does anyone who studies any of these languages know some good material, especially websites, and books?",
        "created_utc": 1678133728,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to fall back in love with a language?",
        "author": "lunsolo",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kcd5v/how_to_fall_back_in_love_with_a_language/",
        "text": "I've been studying French for the past two years and currently live in a country where it's spoken. This experience has been something I've dreamt of for years. And yet I feel completely burnt out, and most of the time, I only study because I \"should\" and not out of enjoyment. Watching French media or reading French books either bores me or reminds me of how much further I need to work before I'm at my target level. I feel so stuck and demotivated, nostalgic for when I pursued the language out of genuine love. \n\nHave you ever had a similar experience? What did you do to fall back in love with the language?",
        "created_utc": 1678133339,
        "upvote_ratio": 1.0
    },
    {
        "title": "Google extension for better English",
        "author": "Elizabeth_Tuz",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kc3yz/google_extension_for_better_english/",
        "text": "[removed]\n\n[View Poll](https://www.reddit.com/poll/11kc3yz)",
        "created_utc": 1678132811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Output ideas",
        "author": "sunfoxshine",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kbonv/output_ideas/",
        "text": "Hello, sweet people!\n\nI've come to realize that I spend most of my learning through input, and I think I do lose a lot because of it since expressing myself more would help make communication less awkward when I have to be the one doing the talking.\n\nAnd so, I would like to learn how to properly do more \\`output\\` activities and have more quality in my learning.\n\nSo please let me know how to become best friends with it and make some good use, whether is by writing, talking or etc, from your own experience or just suggestions.\n\nThanks! \\^\\^",
        "created_utc": 1678131898,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone speak Jerriais?",
        "author": "peeefaitch",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kbmu3/anyone_speak_jerriais/",
        "text": "I know very little about it. Is it still taught in Jersey?\nAnyone information would be interesting.",
        "created_utc": 1678131787,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the difference between Вы and Ты? For example in polish it’s Ty (for one person) and Wy(for multiple people). So is it interchangeable in Russian?",
        "author": "KalinaOliver",
        "url": "https://i.redd.it/9ypm38wyn7ma1.jpg",
        "text": "",
        "created_utc": 1678130638,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you have any advice that you could give to people who want to learn another language, but have never learned any languages other than their native language?",
        "author": "NaturePhotographer10",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kar2x/do_you_have_any_advice_that_you_could_give_to/",
        "text": "I want to learn a second and maybe a third language eventually. The one that I want to start with uses the same alphabet as English plus a few that English doesn't use. It also has some similar words with similar definitions as the English version and some words that are similar to English words that have different definitions than the English words. The other language that I would eventually want to learn uses a different alphabet and would be very different from English beyond that. \n\n&amp;#x200B;\n\nIs there any advice that you can give to someone who is  just starting out with trying to learn a new language?",
        "created_utc": 1678129898,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't seem to retain new words, and I don't know how to deal with it",
        "author": "Due_Understanding626",
        "url": "https://www.reddit.com/r/languagelearning/comments/11kactw/i_cant_seem_to_retain_new_words_and_i_dont_know/",
        "text": "Hey guys. I have difficulty memorizing new words in English, even though a put a lot of effort into memorizing them. My process is as follows: I start by reading the definition and after that if I understood it properly I will be writing around 5-10 sentences do make sure that I have a good grasp over this word and to deepen my understanding about it. Even though I manage to get through all these steps and actually understand the respective word, the next day I will barely even remember what I learned about. Like all my efforts were in vain and nothing has been consolidated.\n\nSo my question whether there is something wrong during my learning process, or maybe is something wrong with my brain ? What do you think ?",
        "created_utc": 1678129189,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question on learning both Italian and Spanish",
        "author": "FBISquad",
        "url": "https://www.reddit.com/r/languagelearning/comments/11k9nhu/question_on_learning_both_italian_and_spanish/",
        "text": "I am currently learning Spanish and in the later half of this year I have the opportunity to live in Italy for 3 months. With the languages being so similar, I wanted to know how challenging it would be for a non native of both languages to learn both and to keep them separate. Would my Spanish need to be B1, B2, or higher for it to not cause as much friction?",
        "created_utc": 1678128082,
        "upvote_ratio": 1.0
    },
    {
        "title": "Favorite Tools: Spill the Beans! ISO comprehensive + grammar.",
        "author": "moscowm0use",
        "url": "https://www.reddit.com/r/languagelearning/comments/11k8y6d/favorite_tools_spill_the_beans_iso_comprehensive/",
        "text": "Hello! Привет всем! I’m learning Russian, or rather brushing up and trying to expand my skills. I have a pretty good language foundation, and lived in-country for a bit. But that was 10+ years ago, so I’m doing a lot of review and rededicating myself to language study. \n\nIn the process, I’m trying a lot of different apps that didn’t exist my first go-around. \nBut I’ve come across a few irritations that I’m hoping you might be able to help me solve. \n\n1. Duolingo seems to be popular but (from my experience) is very limited and repetitive in both vocabulary and forms. (It doesn’t teach all the ways a verb can be conjugated, nor will I learn specific declension rules or exceptions.) It feels like I can only learn what they decide is worth learning, and it leaves me wondering what I *don’t* know or remember. \n \n2. Repetition methods irritate me for similar reasons. They’re often too slow for my liking and if I don’t understand the grammar behind a certain phrase, I feel claustrophobic in only being able to repeat it exactly as it was presented. I like to know *why* I’m repeating what I am, so I have the ability to correctly alter it as needed.\n\nHope that makes sense. \nSo: which methods/apps/programs do you recommend for both increasing vocabulary while comprehensively reviewing grammatical rules?\n\n(I do have the opportunity to occasionally practice with a native speaker, but they’re an acquaintance, and I don’t like to make them feel like my ONE true source or tutor. :))",
        "created_utc": 1678127207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ancestor or descendant?",
        "author": "UsualDazzlingu",
        "url": "https://www.reddit.com/r/languagelearning/comments/11k8jur/ancestor_or_descendant/",
        "text": "Say the TLs are French, Portuguese and Latin. Is it easier to learn a word in Latin and it's descendants or vice versa?",
        "created_utc": 1678126750,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning Gujrati",
        "author": "jayrock80612",
        "url": "https://www.reddit.com/r/languagelearning/comments/11k6oli/learning_gujrati/",
        "text": "I plan on going to India in one year and was struggling to find places to learn gujrati from English. I was wondering if anyone had any good ideas or websites that could help me learn how to speak it",
        "created_utc": 1678124640,
        "upvote_ratio": 1.0
    },
    {
        "title": "trying to get better at italian",
        "author": "globglog",
        "url": "https://www.reddit.com/r/languagelearning/comments/11k6ljd/trying_to_get_better_at_italian/",
        "text": "I have had italian courses at school for a year and a half, my italian isn't very good, but i know the basics. As you all probably know, the way schools usually teach languages is very slow and, in my opinion, not optimal. I want to try and learn the language on my own outside of the school textbook, but I am not too sure where and how to start, any suggestions?",
        "created_utc": 1678124536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Steam Games for beginner-intermediate language exchanges recomendation",
        "author": "lindsaylbb",
        "url": "https://www.reddit.com/r/languagelearning/comments/11k46fd/steam_games_for_beginnerintermediate_language/",
        "text": "Last week I played we were here with my German language partners and it felt great.\n\nWe were here is an asymmetric co-op game where we needed to talk to each other to figure out puzzles and escape rooms. We first played the games in English, the stronger language of us both, to figure out the game mechanism first. Then we switched to German. It feels great! It definitely put the languages I have learned into spontaneous use, which is valuable. \n\nI'm looking for more games like We were here. In my opinion, games that are suitable for language exchanges, rather than learning languages by one's self, must fit below criteria: \n\n1. **Is not action based.** There must be adequate time to explain and clarify words and concepts. \n2. **Is** **Assymmetric - players play at different scenes.** So even if you are your partners live across the globe, the pings and delays won't be an issue.\n3. **Is Co-op game that needs constant communication.** That's what language exchanges are for! Maximize the time for languages. \n4. **Is not too long** A lot of multiplayer base-building games are suitable to play together as well, but one might feel pressured to commit to the game and it may hinder finding more partners. \n\n&amp;#x200B;\n\nSo I have chosen a few games that fit the above criteria. I didn't play all of them, but I do intend to try them all out with my partners. \n\n1. **We were here series** We were here (THIS IS FREE), We were here too, We were here together, We were here forever. For 2. You and your partner are in different rooms of a dungeon. You must talk to each other via walkie-talkie to figure out puzzles and escape. \n2.  **Keep Talking and Nobody Explodes.** One player must defuse the bomb but they don't know how. The other player(s) has the manual but they can't see the bomb. They must work together to survive. Only one person needs to buy the game. The other can play by downloading the manual. \n3.  **Operation: Tango** Similar to We were here, you work together to solve puzzles. Only one person needs to buy the game. The other can play via friend pass. \n4.  **Clandestine** One spy operating on the ground and a hacker monitoring four screens and provides intelligence for the operation. \n\nBelow are not assymmetrical but also looks good for co-op with lots of communication. \n\n**Trine (1-4), Portal 2,  It Takes Two (with friend pass), A way out (remote play together), Unravel, 39 Days to Mars**\n\nFeel free to recommend more! \n\nAlso looking for German/French/Japanese/Korean partners! DM me if you are interested!",
        "created_utc": 1678121693,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which language do you think is the most badass and why?",
        "author": "Less-Wind-8270",
        "url": "https://www.reddit.com/r/languagelearning/comments/11k3i1h/which_language_do_you_think_is_the_most_badass/",
        "text": "",
        "created_utc": 1678120173,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dark German immersion on Netflix",
        "author": "LyricalLanguages",
        "url": "https://www.reddit.com/r/languagelearning/comments/11k36p3/dark_german_immersion_on_netflix/",
        "text": "Rewatching Dark for extended immersion in German and with the intention of finally finishing season 3 (no spoilers please). At the end of season 2, I finally understood who is who and what's going on (except Charlotte's husband - still no clue how he fits into all this). On season 3 now and feeling like I need an IQ of 150 to enjoy this show!",
        "created_utc": 1678119474,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could you in theory learn any dialect of English while in a place that spoke different English?",
        "author": "ElightenIdoit",
        "url": "https://www.reddit.com/r/languagelearning/comments/11k2yse/could_you_in_theory_learn_any_dialect_of_english/",
        "text": "Everyone knows it's possible and suggested that one should learn a particular accent while learning Spanish. Mexican, Colombian, Cuban, etc. However, when it comes to English, it's kinda similar, as most people can understand other English speakers from the UK or Australia, or other places. However, I wanted to know, if someone was learning English for the first time, and wasn't exposed much to the language. Could they in theory sound Irish even if they were learning while in America or Australia? Could someone sound British if they even stepped on in the UK?",
        "created_utc": 1678118985,
        "upvote_ratio": 1.0
    },
    {
        "title": "For those of you who learned a language, what did it feel like when you were finally fluent? How did you know?",
        "author": "Wetcartographer",
        "url": "https://www.reddit.com/r/languagelearning/comments/11k2mv9/for_those_of_you_who_learned_a_language_what_did/",
        "text": "Currently learning hindi, just curious to see how it feels when you are finally successful.",
        "created_utc": 1678118260,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to learn (from beginner) two languages at once? [Japanese/Korean]",
        "author": "omidissupereffective",
        "url": "https://www.reddit.com/r/languagelearning/comments/11k1q9f/is_it_possible_to_learn_from_beginner_two/",
        "text": "Visiting Japan and Korea in a couple months and don't want to get around purely with English (and be seen as a silly gaijin/waeguk lmao). I've been learning Japanese for a couple weeks now with good progress (Pimsleur method), and have just started learning Korean. Is this a stupid idea? \n\nWould love to hear any tips and advice if you have attempted an endeavour like this. I am fluent in English and Persian and have a fair amount of free time until I go so I thought why not?  I'm not expecting to reach anything near fluency obviously, but would like to know enough to have basic conversations with people. Ofcourse, I know that I could spend all day learning Japanese and Korea and yet my French would probably still be stronger by the time I leave. Still, I would love to hear everyone's thoughts on this and any dos and don'ts! Thank you!",
        "created_utc": 1678116200,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else use Thaipod101, if so how do you study with it?",
        "author": "BrothaManBen",
        "url": "/r/learnthai/comments/11k1150/does_anyone_else_use_thaipod101_if_so_how_do_you/",
        "text": "",
        "created_utc": 1678115173,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learn memes in Afrikaans",
        "author": "Houses666",
        "url": "https://youtu.be/ibs2WGWS6MM",
        "text": "",
        "created_utc": 1678113661,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dream Job",
        "author": "Hungry_Donkey_1368",
        "url": "https://www.reddit.com/r/languagelearning/comments/11k0hsp/dream_job/",
        "text": "If there was a job where I could just learn languages all day, that would be a dream! 🥰",
        "created_utc": 1678113236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dream Job",
        "author": "Hungry_Donkey_1368",
        "url": "https://www.reddit.com/r/languagelearning/comments/11k0af2/dream_job/",
        "text": "If there was a job where I could just learn languages all day, that would be a dream! 🥰",
        "created_utc": 1678112715,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think it's a good idea?",
        "author": "EtruscaTheSeedrian",
        "url": "https://www.reddit.com/r/languagelearning/comments/11k0a53/do_you_think_its_a_good_idea/",
        "text": "So... I've been learning swedish since december of 2021, recently I've finished the swedish course in Duolingo and I really want to start learning hungarian\n\nMy plan to study both languages is to focus entirely on swedish in one day and focus entirely on hungarian in the next day\n\nBasically: One day I do swedish, the other day I do hungarian, and then repeat this cycle\n\nDo you think it's a good idea? Has anyone here already tried this?",
        "created_utc": 1678112696,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are English speakers so dictated to?",
        "author": "linguistictravel",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jzsrz/why_are_english_speakers_so_dictated_to/",
        "text": "For example, we have to say \"Beijing\" in English, while in pretty much every other language it is still \"Peking\", the old name.\n\nSame goes for Turkey, we are now expected to write \"Turkiye\", as ordered by the Turkish government, but only in English. In pretty much every other language they still use their old name.\n\nIt often seems to me that English speakers are more pressured to comply with the whims and current sensibilities of other countries than speakers of other languages, who just carry on with their traditions.",
        "created_utc": 1678111418,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I abandon a language and maybe return to it at a later time? Even if I enjoy it.",
        "author": "Lonliestlonelyloner",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jz8w3/should_i_abandon_a_language_and_maybe_return_to/",
        "text": "I visited Israel and brushed up on Hebrew before going. I knew I didn’t understand the culture or the linked religion so it gave me much more encouragement to learn about it. Bumped into someone and they said סליחה. I understood them immediately and I was fascinated and have continued it ever since. I would love to visit Israel again but it won’t happen in the near future. The practicality is gone now. I’ve tried language exchange but the people stop replying when they find out I’m not female (kind of hilarious btw). I just wanted to know about their everyday culture and language and immerse myself in it. \n\nEvery Hebrew speaking person knows English, I didn’t care about that, but they kind of have no reason to talk to me. Should I start over elsewhere? A language where perhaps they’re interested in learning my language (English/Spanish) as well, to encourage them to speak to me? In actuality there is no language that is practical to me, because I’m from Texas and I already know them both. I’m hoping someone has been in a similar circumstance as me and can help guide me. I guess I’m a little lost. God bless guys thank you",
        "created_utc": 1678110034,
        "upvote_ratio": 1.0
    },
    {
        "title": "Turkish learners be like",
        "author": "zCaptainBr0",
        "url": "https://i.redd.it/l6o65e5we4ma1.jpg",
        "text": "",
        "created_utc": 1678109285,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help ASAP!!!",
        "author": "joyhaHAA",
        "url": "/r/turkishlearning/comments/11jy4os/i_need_help_asap/",
        "text": "",
        "created_utc": 1678108782,
        "upvote_ratio": 1.0
    },
    {
        "title": "French learning materials for a complete beginner",
        "author": "UCanOnlyUse20Letters",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jyogq/french_learning_materials_for_a_complete_beginner/",
        "text": "I would like to learn to read french, primarily for classic literature. I am currently fluent in Danish and English, and perhaps B2 level in German. I would like to study 1 hour every day, and I do not have any budget limit. Currently I am thinking of buying a handful of self-study books and completing them in succession. Perhaps these:\n\nAssimil French Without Toil\n\n70's Assimil French With Ease\n\nBerlitz Self-Teacher \n\nCortina Method\n\nDoes this sound like a sound first step? Do you think I would then be able to moving on to bilingual texts after completing these courses? I have had a lot of success with english/german bilingial texts, but that was on the basis of seven years of german in school.\n\nThanks for the advice in advance (:",
        "created_utc": 1678108592,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best age for a child to move to a foreign country to become bilingual",
        "author": "Throwaway0123434",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jxzsu/best_age_for_a_child_to_move_to_a_foreign_country/",
        "text": "It seems that usually when a child moves to a new country/language environment too early, such as 3-5 years old, what usually happens is that they forget a lot or completely forgets their native language.  Usually when they move at an older age, such as teenage years, they sometimes don't eventually develop native-like proficiency or accent in their new language.  Would the best age to do it be between approximately 6-12 years old?",
        "created_utc": 1678106883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Read this blog post before you start learning languages.",
        "author": "bilgehanov",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jxuhl/read_this_blog_post_before_you_start_learning/",
        "text": "[removed]",
        "created_utc": 1678106489,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ai Translator",
        "author": "Correct_Drawer_1158",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jx2xl/ai_translator/",
        "text": "Hello, dont know if this is okay to post here but im looking for a ai translator. Im gonna be joining an online information meeting about a upcoming working oppertunity thats in finnish, and i was wondering if there is any ai translator that can directly translate to english.",
        "created_utc": 1678104420,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pronouns in gendered languages",
        "author": "tikitakre",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jwiec/pronouns_in_gendered_languages/",
        "text": "I am Norwegian and in my western Norwegian dialect (and in Nynorsk) we use gendered pronouns to refer to nouns. \n\nAlthough, in some parts of western Norway, and almost across the rest of the country (except the inner-most parts of Eastern Norway (towards the central mountainous areas), they have completely assimilated the common gendered Danish \"den\" for both masculine and feminine object and subject. \n\nMy question is, do you have gendered pronouns for nouns like described above case in f.ex. Spanish, German and French?\n\nExamples in Norwegian:\n\n\"Eg tok med meg flaska, men ho var tung å bera på, so eg gav henne frå meg\"\n\n\"I brought with me the bottle, but she was heavy to carry, so I gave her away\"\n\nFeel free to translate in your language! Thanks!",
        "created_utc": 1678102787,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to best divide up study time?",
        "author": "lunsolo",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jwffn/how_to_best_divide_up_study_time/",
        "text": "I aim to dedicate 10 hours every week to studying my target language and am trying to determine how to structure this time. I’ve never really had a study routine in the past and have worked more sporadically, but I think I would really benefit from one, especially at my level. In your opinion, is it more beneficial to have certain days of the week dedicated to certain skills or focus every day on each skill for a shorter amount of time? What has been your experience?",
        "created_utc": 1678102530,
        "upvote_ratio": 1.0
    },
    {
        "title": "It bothers me so much that social media is made by monolinguals.",
        "author": "abdo1231997",
        "url": "https://www.reddit.com/r/languagelearning/comments/11juyp5/it_bothers_me_so_much_that_social_media_is_made/",
        "text": "Like I want to make a profile in Linked-in every language I speak without actually making three different profiles with three different links.\n\nI shared a picture on Facebook? I want to have different tabs with each tab including the caption in a particular language.\n\nI shared a video on Tik-Tok? would rather that I can make a different video for every language but they all fall under the same entry and depending on the language that the audience speaks the correct video is shown to the person. \n\nAm I the only one that feels a bit frustrated with Silicone Valley being in a mostly monolingual country and is ran by monolinguals?",
        "created_utc": 1678097984,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which should I learn: Mandarin or Cantonese",
        "author": "Z4itam",
        "url": "https://www.reddit.com/r/languagelearning/comments/11juh25/which_should_i_learn_mandarin_or_cantonese/",
        "text": "I wanted to learn one language from the following: Cantonese or Mandarin Chinese. I was doubting which as Cantonese is harder because of the tones and slang involved, but it also had more history, poems, historical books/text and was spoken in HK. Instead Mandarin is easier, more spoken and is more similar to the written Chinese. I am sure I want to learn the tradicional characters more than the simplified ones, but sill unsure which of these to learn.   \nI should mention I would be using mostly online resources and textbooks. And I might later learn the other language, so it would also be grate to know which sets the way easier for me to learn the second.",
        "created_utc": 1678096406,
        "upvote_ratio": 1.0
    },
    {
        "title": "Similarities Between Maltese and Arabic (Tunisian Dialect)",
        "author": "Naderium",
        "url": "https://v.redd.it/kp4infuea3ma1",
        "text": "",
        "created_utc": 1678095732,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Latin American Spanish different to European Spanish?",
        "author": "Master_Deer_8861",
        "url": "https://www.reddit.com/r/languagelearning/comments/11js6nt/is_latin_american_spanish_different_to_european/",
        "text": "This might sound like a stupid question, but since American English has different words to British English (e.g. eggplant vs aubergine, cilantro vs coriander, etc), is the same for those who live in Latin America and Spain?",
        "created_utc": 1678088635,
        "upvote_ratio": 1.0
    },
    {
        "title": "a",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1678081209,
        "upvote_ratio": 1.0
    },
    {
        "title": "Eurotalk Best company to learn a language",
        "author": "Dry-Lie-7476",
        "url": "https://eurotalk.com/en/",
        "text": "",
        "created_utc": 1678081180,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning German",
        "author": "emma3789",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jp5v2/learning_german/",
        "text": "I am trying to learn German. I am in the early stages if anyone would be interested in helping me learn I would greatly appreciate it I can help teach English in return. I am 16 years old would love to learn a lot of languages",
        "created_utc": 1678079305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Speak Announces $27M Series B Led by OpenAI Startup Fund",
        "author": "cornucopea",
        "url": "https://www.speak.com/blog/speak-announces-27m-series-b-led-by-openai-startup-fund",
        "text": "",
        "created_utc": 1678078864,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to master this pronunciation?",
        "author": "hethical_ecker",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jnfhr/how_to_master_this_pronunciation/",
        "text": " \n\nIf you have heard languages like Arabic, Somalian, Afar, Tigrigna they have this really deep throat sound they make for the letter A'\n\nhere is a sample [https://www.vibby.com/v/m1X4K9DFR](https://www.vibby.com/v/m1X4K9DFR)\n\nI am wondering if it's possible for a non native speaker of those languages say someone who's 30 years old to master that sound? I have seen some non native speakers who have practices one of these languages for decades but they still struggle in making this sound and when they do it semi correctly, you can tell they are really putting the effort in\n\nalso try to pronounce it and tell me how it went lol.",
        "created_utc": 1678074399,
        "upvote_ratio": 1.0
    },
    {
        "title": "pariya",
        "author": "Pariya_19918",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jmaip/pariya/",
        "text": "[removed]",
        "created_utc": 1678071287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reading a book as a total beginner: experience",
        "author": "NaJaEgal",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jm4ui/reading_a_book_as_a_total_beginner_experience/",
        "text": "What is the earliest level at which one can read a book in a target language? \n\nThis question appears regularly on this sub and a lot of comments advise against starting too early, or insist on reading graded readers only at first, so I finally decided to make a write up of my experience of reading a children's book written for native speakers intensively from day one. I'm not saying it's the best time to start, I'm not saying it's the most effective method there is. All I'm saying is, it's possible. Here's how it went:\n\n***What language:*** German\n\n***At what level:*** From the very first day of learning (true beginner).\n\n***Why:*** I had been learning English for ten years before I finally read my first book in it. I wanted to try if it was possible to start reading books from the get go. Or in short: *just because I can*.\n\n***Which book:*** James Krüss - \"Timm Thaler oder das verkaufte Lachen\". It was the only children's book in German I knew of, and I remembered enjoying the story as a child.\n\n***How:*** By meticulously looking up every word in an online dictionary and at [forvo.com](https://forvo.com). I listened to pronunciation of every word, trying to repeat what I hear as closely as possible 10-20 times before adding the word to a slowly growing string of a current sentence that I read out loud. All new words went into my notebook (+gender,+genitive,+plural). I used an elaborate system of manual SRS to keep them fresh in my memory. I always re-read some of the text from previous days before starting to work on new sentences.\n\nIt's worth noting that the online dictionary I used recognised declined and conjugated forms, unlike me.  It would have been a rather frustrating experience if I had to use a paper dictionary with my zero grammar knowledge.\n\n***Was intensive reading the only thing I did to learn German at that time*****:** No, by no means. My most important activity was learning from a self-study textbook (with proper grammar foundation and all), along with learning a ton of vocabulary from the official Memrise course. I treated reading as a nice bonus that added diversity to my routine and gave me a huge moral boost by being a real life application of a language.\n\n***Some stats:*** \n\n* I did intensive reading for 40-60 minutes a day almost every day for 5-6 months. That time included re-reading, focused work on pronunciation of individual words, learning and revising vocabulary.\n* It took me one day to read the title and the first sentence, two weeks to read the first page, half a year to read 30 pages. (*^(\"...To move a pen would take all night, (This poem took fourteen years to write — 'Cause I'm just one inch tall). \")*)\n* I went from writing down 200 unknown words from the first page (every single word except prepositions, articles, proper names and repetitions), to writing down 15-20 words a page by page 30. (90-95% lexical coverage)\n* I learned a little bit over 1000 words from the first 30 pages. At the same time I learned around 3500 cards on Memrise, which I would estimate included ≈1500-2000 individual words, so ≈ 2500-3000 words total over the course of 6 months.\n\n***What my reading comprehension was like after half a year:*** At that point I was able to follow the plot of \"Timm Thaler\" without a dictionary and theoretically could have continued to read it extensively if I wanted to. In that case I would have finished it in two or three weeks. But as much as I like this book, half a year is enough time to be fed up with anything. I just dropped it and started learning from other sources.\n\n***Is it effective:*** It certainly *works.* I have no control group, so I don't know how time efficient it is compared to other methods.\n\n***Would I recommend it:*** The biggest issue I see is motivation. In my case being able to read a real native book from day one felt exhilarating, but I see how spending whole two weeks to get though one page of a text can be soul crushing for somebody else. Ultimately it comes down to reaching a point when you are able to read extensively and there's certainly more than one way to do that. I'd say if it motivates you, do it, if it demotivates you, don't.\n\n***Aftermath:*** I re-read those 30 pages three or four years later. It felt completely different this time, even though it was the same text with the same meaning (on the surface). The atmosphere, the tone, the emotions, the general feeling, and most noticeably, the pace, changed dramatically. It made me appreciate how much more there is to understanding a language than just knowing individual words and grammar.",
        "created_utc": 1678070843,
        "upvote_ratio": 1.0
    },
    {
        "title": "The importance of writing in your TL",
        "author": "treesrkoo1",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jlgn6/the_importance_of_writing_in_your_tl/",
        "text": "[removed]",
        "created_utc": 1678069041,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello everyone, can you help me with something? Below is an image. Basically I mark the things I don't know, and there are two categories: words and expressions. I'm doing this with the entire book. What do you think? Is there anything that could be better? Some tips?",
        "author": "Intrepid-Ad-7213",
        "url": "https://i.redd.it/bcg9j57ee2ma1.jpg",
        "text": "",
        "created_utc": 1678066884,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello everyone, can you help me with something? Below is an image about a light novel I'm reading, it's called Re:Zero. Well, I would like to make some comments about the system I use, basically I mark the things I don't know, and there are two categories: words and expressions. The purple are the w",
        "author": "Intrepid-Ad-7213",
        "url": "https://i.redd.it/0smi5zmed2ma1.jpg",
        "text": "",
        "created_utc": 1678066551,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it better to watch in native language with foreign CC or the opposite?",
        "author": "yehuda_edelstein",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jk1p3/is_it_better_to_watch_in_native_language_with/",
        "text": "I watch a lot of TV and I like to put closed captions in different languages. I was just wondering if that could sublimely or subtly help pick up the language? I really am just watching the shows and occasionally reading the captions. Although I have seen a small improvement.",
        "created_utc": 1678065318,
        "upvote_ratio": 1.0
    },
    {
        "title": "Flashcard App with Image and Audio",
        "author": "AlexanderMasonBowser",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jj5av/flashcard_app_with_image_and_audio/",
        "text": "Anybody know of a Flashcard App for Windows that allows image and audio, an adjustable timer between the image and audio, and does not restrict how much you can study?\n\nI've already tried Anki, Anki App, Brainscape, and Quizlet, and a few others I don't remember the name of.",
        "created_utc": 1678062977,
        "upvote_ratio": 0.99
    },
    {
        "title": "Europeans Of Reddit: How many and/or how much of your neighboring country's language do you need to know?",
        "author": "KazukiSendo",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jiqky/europeans_of_reddit_how_many_andor_how_much_of/",
        "text": "To put a finer point on it, those who live in European countries like France, Spain, Portugal, Germany, and other countries that are close by, how much of your neighboring country's languages do you need to learn to be able to communicate in their countries?",
        "created_utc": 1678061930,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the dialect of American English sound more like English from Europe a few hundred years ago?",
        "author": "DirtyTussy",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jh2wp/does_the_dialect_of_american_english_sound_more/",
        "text": "",
        "created_utc": 1678057852,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best use for this technology? (advice needed)",
        "author": "SecureRoom8324",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jh1lf/what_is_the_best_use_for_this_technology_advice/",
        "text": "Hey guys \n\nI'm a software developer and over the last few months, I've built a grammatical error correction system for Spanish that works quite well. Here's a screenshot of a typical output: \n\n&amp;#x200B;\n\nhttps://preview.redd.it/utn8zt6950ma1.png?width=812&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=077c339cf6bf89f190f218edcad1a82f6ea1e2f3\n\nNow that I've built it, I am finding it quite useful for personal use and my personal journey in learning Spanish, but I'm not totally sure what to do with it!\n\nI'm thinking it could work as a kind of grammarly-for-spanish (i.e. a chrome extension that plugs into every text field in the browser and makes suggestions), or maybe something more gamified? What would you find most useful?\n\n[View Poll](https://www.reddit.com/poll/11jh1lf)",
        "created_utc": 1678057773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good learning resources for tourist visiting Norway?",
        "author": "Pcful_Citizen",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jg0m7/good_learning_resources_for_tourist_visiting/",
        "text": "Is there any kind of resource/website/app for a tourist who is visiting Norway? I have been using Duolingo but it doesn’t really teach phrases that would be useful for tourists, like ordering food, buying things, everyday phrases etc.",
        "created_utc": 1678055367,
        "upvote_ratio": 1.0
    },
    {
        "title": "2days without study English help me!!",
        "author": "Centralcee_20",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jfu9q/2days_without_study_english_help_me/",
        "text": "I'm sad and Giving myself up to quick pleasures, so I'm feeling weak and waste my time in TikTok and others things instead of studying what I most like at the moment, which is English language, I feel powerless. Any tips?",
        "created_utc": 1678054937,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some good mobile offline resources?",
        "author": "FrankTheTank107",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jfiz4/what_are_some_good_mobile_offline_resources/",
        "text": "(to learn Japanese btw)\nI know this sub lists some great recourses, but offline capabilities isn’t often talked about in reviews.\n\nMy work takes me offline for more than a month at a time, so subscription models won’t work since they stop working after 30 days so I’m looking at resources that also offer to let you download full courses to keep permanently.\n\nAssimil looks like the popular well known resource in general and they offer to let you download a full Japanese course you can use on their mobile app for £60 which seems reasonable, but then I look at the app and it’s got 2 stars from 6 reviews and seems sketch all of a sudden. \n\nPimsleur looks like good quality, but damn £560 for a full course 😬\n(lowkey considering saving up for it if it’s truly the best option)\n\nMicheal Thomas maybe?\n\nAnyone got any experience offline learning and got recommendations or advice. Anything is appreciated, thanks :)",
        "created_utc": 1678054200,
        "upvote_ratio": 1.0
    },
    {
        "title": "Slothlike language learner building and app",
        "author": "Subject-Magazine-495",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jeyei/slothlike_language_learner_building_and_app/",
        "text": "Hello all, \n\nI love learning Korean and Spanish, but I take things super slow. I recently decided that I wanted to take it more seriously. So I decided to join some communities to help me maintain my passion and interest instead ADHDing my way through language learning (I am diagnosed with ADHD). I will also pick up a little programming project I started years ago to make a flashcard app to help me with my Korean. I would love some input on the app from anyone interested in using flashcard and translation apps. I started a Discord server, so please feel free to join. \n\nTo be clear, I am currently narrowly focused on an MVP for this phone app (English to Korean translations and flashcard decks) and doing this as a personal project. I would love to engage with folks who are similarly interested in something like this and are kind and respectful. I look forward to getting to know people who enjoy language learning on all levels. \n\nThanks, everyone!\n\n[https://discord.gg/7JXGftgY](https://discord.gg/7JXGftgY)",
        "created_utc": 1678052890,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self studying asl. Wanted to ask this here as well :)",
        "author": "Signature_1878",
        "url": "/r/asl/comments/11jeg7q/what_fluency_level_can_you_reach_after_completing/",
        "text": "",
        "created_utc": 1678051912,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dog commands in other languages?",
        "author": "SelectionNo7336",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jdofe/dog_commands_in_other_languages/",
        "text": "1. Sit \n2. Down \n3. Stand  \n4. Come \n5. Stay \n6. Take it  \n7. Bring it \n8. Drop it \n9. Leave it \n10. Left / Right \n11. Search \n12. Bark \n13. Growl \n14. Yes / No \n15. [command that releases dog from a command] \n16. [command for free running]\n17. ...",
        "created_utc": 1678050092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which app /platform have you found best for learning a new language ?",
        "author": "VirtualTopaz",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jcurc/which_app_platform_have_you_found_best_for/",
        "text": "Hi ! I am looking for an app ,website or platform where I can start learning\n 1- French\n  2-Arabic \n\nI speak English and I will be starting from a beginner level and aim for fluent speaking and writing. It doesn't matter if I have to pay/subscribe to such app or website.I just want to have a fruitful learning experience and get the desired result of becoming a fluent speaker in the languages mentioned above.\n\nThanks in advance for your advice.",
        "created_utc": 1678048663,
        "upvote_ratio": 1.0
    },
    {
        "title": "How easy it to lose progress?",
        "author": "nmusicdude",
        "url": "https://www.reddit.com/r/languagelearning/comments/11jbfzr/how_easy_it_to_lose_progress/",
        "text": "[removed]",
        "created_utc": 1678047006,
        "upvote_ratio": 1.0
    },
    {
        "title": "help am I using this word correctly?",
        "author": "Sad_Boysenberry_7297",
        "url": "https://www.reddit.com/r/languagelearning/comments/11j8wm6/help_am_i_using_this_word_correctly/",
        "text": "My mind is entropy with all these thoughts.\n\n\n\nFrom what I've read, entropy means disorder or chaos. So I'm basically saying my mind is chaotic from overthinking. It's like there are many definitions of this word, but I couldn't really understand it, and I want to know if I'm using it correctly in this sentence. I've seen this word used in many ways.",
        "created_utc": 1678044239,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I get from A2 (close to B1) to B2 German in 6 months?",
        "author": "Throwawaymkdons",
        "url": "https://www.reddit.com/r/languagelearning/comments/11j8b5r/can_i_get_from_a2_close_to_b1_to_b2_german_in_6/",
        "text": "",
        "created_utc": 1678043604,
        "upvote_ratio": 1.0
    },
    {
        "title": "It is just me, or \"lol\" is boring as fuck",
        "author": "VenoirQueen",
        "url": "https://www.reddit.com/r/languagelearning/comments/11j7tzy/it_is_just_me_or_lol_is_boring_as_fuck/",
        "text": "[removed]",
        "created_utc": 1678042984,
        "upvote_ratio": 1.0
    },
    {
        "title": "What methods did you use to start learning languages?",
        "author": "TheBoreder",
        "url": "https://www.reddit.com/r/languagelearning/comments/11j7n6a/what_methods_did_you_use_to_start_learning/",
        "text": "At the moment i’m trying to learn french but i’m not really sure how, the way i learned english was with the stuff at school and with that i was able to learn the rest on my own, i also used to watch videos with subtitles and i could kinda tell which word was the person saying, with french i can’t tell what word is what, i know when someone says “Je” or “ça va” but that’s about it, perhaps i’m trying to learn it faster than i should, i only started learning it about a month ago",
        "created_utc": 1678042561,
        "upvote_ratio": 1.0
    },
    {
        "title": "I lost my interest and passion for English.",
        "author": "Nori_o_redditeiro",
        "url": "https://www.reddit.com/r/languagelearning/comments/11j2pro/i_lost_my_interest_and_passion_for_english/",
        "text": "I used to not have any dreams when I was younger, or expectations to how my future would look like. This started bothering me deeply at the age of 16-ish. After some inner research I decided to start learning English thanks to a great advice that a friend of mine gave me around 3 years ago. I began my journey with this language at the beginning of 2020, right before the pandemic. And by the beginning of 2022 I had reached what I call \"conversational fluency\". This language became a part of me, and now I realize how much my English still needs to get better. But the truth of the matter is that that passion I once had and that interest is now almost completely gone. I'm barely able to do something in the language, like watching or listening to something. I think it's because I realized that knowing English actually isn't making any impact in my life AT ALL. All I get is some surprised faces when people say \"Wait, you know English? That's awesome! How do you say...\" Not lots of people know English in my country btw. But anyways, I lost my passion for this language, I can't study it, and I don't even feel like keeping it alive. I feel like knowing English and fighting to learn this language doesn't actually do a significant change in my life now that I stop to look back on everything. I don't even know what career I wanna follow (I don't think English teaching is for me, I already tried.) I still care about this language, and I want to find new reasons to keep improving, but it just doesn't work anymore. Any advice?",
        "created_utc": 1678036217,
        "upvote_ratio": 1.0
    },
    {
        "title": "How this video made me speak French",
        "author": "NSJack",
        "url": "https://youtu.be/nbyF9PFu-aQ",
        "text": "",
        "created_utc": 1678036140,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it weird that I find languages close to my native one harder to learn?",
        "author": "Chifuyuyu",
        "url": "https://www.reddit.com/r/languagelearning/comments/11j1r42/is_it_weird_that_i_find_languages_close_to_my/",
        "text": "My native language is german and I'd say i'm pretty decent at english. I've been trying several languages that are considered \"easier to learn\" for german/english speaker. Languages I tried are dutch,danish,norwegian, spanish. (french in school for a short period of time. I love french but for the life of me I can't pronounce words xd)\n\nSomehow I'm having a harder time learning these and memorizing vocabulary etc. than I do with korean. \n\nMost of the words are so difficult to pronounce for me compared to korean words.\n\nDoes anyone have similar experiences while learning languages?",
        "created_utc": 1678034885,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for weekly online courses",
        "author": "WeirdWanderingWitch",
        "url": "https://www.reddit.com/r/languagelearning/comments/11izuuj/looking_for_weekly_online_courses/",
        "text": "So I really want to start learning Hindi. However, I know myself and I think I would benefit most from a weekly course. Do any of you know online resources that offer something like that? \nMoney is no issue here, I'm obviously willing to pay for quality classes.",
        "created_utc": 1678030430,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much time do we need to learn basic Spanish? 3 months ? 6 months ?",
        "author": "Ghazi_S_Haddad",
        "url": "https://www.reddit.com/r/languagelearning/comments/11izny8/how_much_time_do_we_need_to_learn_basic_spanish_3/",
        "text": "",
        "created_utc": 1678029935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any way to get the subtitles of Youtube videos without one?",
        "author": "psyhi7840",
        "url": "https://www.reddit.com/r/languagelearning/comments/11izmis/is_there_any_way_to_get_the_subtitles_of_youtube/",
        "text": "there is tv show I really like watching but has no subtitles in Spanish (its original language). I don't know what to do (I didn't mean to sound desperate lol). I'd appreciate any help :)",
        "created_utc": 1678029835,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am gonna begin teaching people dutch,",
        "author": "Left-Education-8798",
        "url": "https://www.reddit.com/r/languagelearning/comments/11iysq5/i_am_gonna_begin_teaching_people_dutch/",
        "text": "Hello, If you wanted to learn dutch for any reason. (As a hobby or going to a dutch country and such)\n\nThen i will learn you dutch for free with a group of other people. The only necesitties is having discord.\n\nBrenticos#9942\n\nHave a great day! (Also reply if you use something else then discord. I will try and figure something out)",
        "created_utc": 1678027578,
        "upvote_ratio": 1.0
    }
]