[
    {
        "title": "Casebook editions",
        "author": "onerousar",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpcrca/casebook_editions/",
        "text": "What's the earliest edition you'd go with if you're trying to save some money? e.g. edition #5 goes for $300, #4 for $170, #3 for $120, etc.",
        "created_utc": 1671409222,
        "upvote_ratio": 1.0
    },
    {
        "title": "Future Advice",
        "author": "breatrice_18",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpcesn/future_advice/",
        "text": "I’m a 3L who will be taking the July bar in TN (UBE). I know this sounds silly, but how in the world do I go about starting to find a job? When should I start looking? Do I just cold send resumes? Apply through things like LinkedIn or other sources and give ‘em a call a week later like every other job I’ve had? Is it even too late for me to find a job? I desperately need to find something by the exam. Do a lot of firms and opportunities still hire with a passing the bar contingency or is that mostly a “if you worked for me before and I liked you I’ll give you an offer” kind of deal? My school hasn’t been the best so far at helping with navigating us through all this and I would like to do as much prep work as I can before May comes and I’m studying all day every day. TIA!",
        "created_utc": 1671408250,
        "upvote_ratio": 1.0
    },
    {
        "title": "Commerce/Computer Science to Law/Computer Science?",
        "author": "unifan464",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpca0w/commercecomputer_science_to_lawcomputer_science/",
        "text": "Hey,\n\nI am a university student who finished their first year studying Commerce/Computer Science at a Go8 university in Australia. Initially, I planned to use this as an avenue to get into Investment Banking (or other finance positions) as a career. However, after doing some finance courses, I have realised that there may be too much maths in these roles, and this is something I don't think I would do well in. Hence, I decided to switch to software engineering as a career but, during university, law has also piqued my interest. I have a few questions.\n\n1. How much maths is in a finance major? And also, how much actual maths/calculations is involved in the finance industry?\n2. Would switching to a law/cs double degree be a good move? The only reason I am considering this is because I definitely want a second degree with CS, and could use law/cs to go into IP law or be a patent attorney if I desire?\n\nSince this is a law subreddit, I am mainly concerned about the answer to the second question.",
        "created_utc": 1671407916,
        "upvote_ratio": 1.0
    },
    {
        "title": "3Lol-ing to the max",
        "author": "TQ_Throwaway",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpc9b8/3loling_to_the_max/",
        "text": "Anyone else find themselves out of fucks to give? I'm writing 10k worth of essays the night before they're due 🤡 Mostly just paraphasring chunks of cases and texts that I'll chop up later into  semicoherent theses. Tallyho!",
        "created_utc": 1671407858,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got a B+ in Fed Courts",
        "author": "ItzLeoo",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpc04x/i_got_a_b_in_fed_courts/",
        "text": "This is a celebratory post. Don’t ask me anything about the course.",
        "created_utc": 1671407126,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got a B+ I’m Fed Courts",
        "author": "ItzLeoo",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpbzm3/i_got_a_b_im_fed_courts/",
        "text": "This is a celebratory post. Don’t ask me anything about the course.",
        "created_utc": 1671407093,
        "upvote_ratio": 1.0
    },
    {
        "title": "Post-Exam Anxiety",
        "author": "Ambitious-Kiwi-1079",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpb21i/postexam_anxiety/",
        "text": "Does anyone have any advice with dealing with post exam anxiety?  I am a 1L I feel like I did very well, but speaking to some classmates I may have gotten one or two multiple choice answers wrong, although I feel like I wrote a very good essay.  My ranking class is small as I am in a part time program, roughly 50-60 people.  I am aiming for (like I’m sure, everyone else) to be in top 10%.  I feel like those one or two wrong answers may affect my status within that.  I know I should just enjoy my time off, but this could possibly affect my job prospects and I can’t stop thinking about it.  Help me mellow out!",
        "created_utc": 1671404558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Evidence Question",
        "author": "LawNdOtherLawyerings",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpak7b/evidence_question/",
        "text": "In a criminal case, say the victim is on the stand and has been questioned on direct about the crime he was a victim of (assault resulting in serious bodily injury). Defense counsel gets up and wants to question the victim about the civil suit for a large amount of money that the victim has filed against the defendant. May defense counsel do this? Why or why not?",
        "created_utc": 1671403250,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any bits of Civ Pro Advice before I Throw in the Towel?",
        "author": "So_Ill_Continue",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpa8r8/any_bits_of_civ_pro_advice_before_i_throw_in_the/",
        "text": "I'm exhausted and absolutely burnt out. After studying for nearly a week and a half straight, between 4-8 hours a day for four finals, I cannot bring myself to study another minute for my civ pro exam tomorrow (Please don't comment about how much harder/longer you studied. I did what I could, and I'm sure there are many who did more). Do I feel ready? Fuck no. Do I care? Not even a little.\n\nAnyone have any key civ pro concepts that I should slap on my outline before quitting for the night? Any tricky gotchas professors like to throw? Anything short and sweet that helped them?\n\nThanks in advance. And if nothing comes out of this, I'm fine with that too. Cs get degrees.",
        "created_utc": 1671402396,
        "upvote_ratio": 1.0
    },
    {
        "title": "Piercings/tattoos OK in law firms?",
        "author": "heylook4830",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpa4hg/piercingstattoos_ok_in_law_firms/",
        "text": "This is kind of a random question, but do you guys know how OK most law firms are with piercings &amp; visible tattoos?\n\nI have three piercings per earlobe and one cartilage piercing. I usually wear really small studs or hoops, nothing big or flashy. But would that # of piercings still be considered inappropriate?\n\nI don’t have any tattoos (yet) but I’m wondering if there’s a cultural stigma against tattoos in the professional legal world, or if it’s loosening up to be more like tech, where tattoos are fine &amp; no one really cares.\n\nThoughts?",
        "created_utc": 1671402071,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want nothing more than to be holly jolly but I'm still in Contracts hell until Wednesday",
        "author": "nonwaivabledefense",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpa15x/i_want_nothing_more_than_to_be_holly_jolly_but_im/",
        "text": "When will the UCC be done with me",
        "created_utc": 1671401822,
        "upvote_ratio": 1.0
    },
    {
        "title": "Difference between inherent and apparent authority?",
        "author": "samsa29",
        "url": "https://www.reddit.com/r/LawSchool/comments/zp9ode/difference_between_inherent_and_apparent_authority/",
        "text": "I understand what apparent authority is. Authority that a reasonable person believes an agent possesses, traceable to the principal's manifestations. I cannot for the life of me understand what inherent authority is, and how it's different from apparent authority.",
        "created_utc": 1671400876,
        "upvote_ratio": 1.0
    },
    {
        "title": "shadowing as a high schooler",
        "author": "lol123shiv",
        "url": "https://www.reddit.com/r/LawSchool/comments/zp9h6a/shadowing_as_a_high_schooler/",
        "text": "im shadowing a criminal defense attorney in a couple of days a s a sophomore in high school and i need to know what i should i be aware of. what do i need to wear and is it weird to shadowing something like this a sophomore in high school?",
        "created_utc": 1671400360,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hearsay Rules Rap",
        "author": "glorpsworld",
        "url": "https://youtu.be/ZjLkl0ZgOiY",
        "text": "In case any of y’all haven’t taken that exam yet 😂\n\nI wrote this in 2009 tho so add in asterisks for what May or may not have changed :)",
        "created_utc": 1671400027,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L Diversity Fellowships- Looking for advice!",
        "author": "virgohvenus",
        "url": "https://www.reddit.com/r/LawSchool/comments/zp92na/1l_diversity_fellowships_looking_for_advice/",
        "text": "what has been the timeline people have genuinely followed? I know that 1L SA positions are generally highly competitive, does that translate to these DEI opportunities as well? I’d love to hear some stories about people who have been successful in landing one, what you did, etc. \n\nI don’t have my grades yet and a lot of them state that we can apply and send the transcripts later. I’m trying to work on my personal statements for these- some are limited to 500 words and others to like 2 pages. I’m just not sure how to go about writing one! \n\nI’m a south asian woman and my law school personal/diversity statement was centered around being an immigrant, overcoming the language barrier, and how my family and I overcame financial issues while settling here. I have held leadership positions in ugrad, and am trilingual. \n\nAny advice on how to frame myself? how do we go about these sorts of statements? any general advice about these DEI initiatives will be greatly, greatly, appreciated. Thank you!!",
        "created_utc": 1671399300,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am i late for biglaw 1L SA apps?",
        "author": "bodhidharma007",
        "url": "https://www.reddit.com/r/LawSchool/comments/zp8175/am_i_late_for_biglaw_1l_sa_apps/",
        "text": "Trying to get apps out over the next week, am I too late for big law 1L SA? Been focusing on exams until now…",
        "created_utc": 1671396614,
        "upvote_ratio": 1.0
    },
    {
        "title": "Job posting for multiple virtual attorney positions with federal government",
        "author": "DaniChicago",
        "url": "https://www.reddit.com/r/LawSchool/comments/zp64xy/job_posting_for_multiple_virtual_attorney/",
        "text": "There is a job posting on [www.usajobs.gov](https://www.usajobs.gov/) for \" Attorney-Advisor (Veterans) for the Board of Veterans' Appeals\" position. The position appears to be totally virtual so that any qualified lawyers in the US could fill the position. This is huge! I applaud the VA for taking this step. Highlights from the job posting are listed below.\n\nOpen &amp; closing dates\n\n* 11/09/2022 to 01/04/2023\n* **Salary**  \n$66,214 - $86,074 per year  \nSalary listed is Rest of the US locality rate, actual compensation will be based on final duty location.\n* **Pay scale &amp; grade**  \nGS 11\n* **Location**  \nMany vacancies in the following location:  \n\n   * **Anywhere in the U.S. (remote job)**\n* **Remote job**  \nYes\n\n\" Practice of law includes private, state, or Federal practice in any field of law.\n\n1. Other legal experience of a responsible nature is experience in any one or a combination of the following performed in a law office, government office, or in the legal department of a business establishment, in the armed forces, or other Federal service:\n\n* Conducting legal research, analyzing statutes, writing legal opinions;\n* Writing authoritative or advisory legal opinions involving interpretation of state or Federal laws, regulations, and orders, or the drafting of such regulations or orders; or\n* Drafting, analyzing, and other legal activities with respect to bills, regulations, Executive Orders, proclamations, or statutory provisions.\"\n\n\" **Grade Determination:** In addition to the Basic Requirements for employment identified, the following criteria are the minimum qualifications for the **GS-11 level:**  \n(a) Possess one year of experience or less in the practice of law as described in the **Quality of Experience**; or  \n(b) Meet the qualification through the **Superior Qualification Program**.\n\nYou will be rated on the following Competencies for this position:\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\"\n\nThis is a link to the actual job announcement: [https://www.usajobs.gov/job/688298000](https://www.usajobs.gov/job/688298000)",
        "created_utc": 1671391629,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accounting practice abroad or law school?",
        "author": "littlemisshmm",
        "url": "https://www.reddit.com/r/LawSchool/comments/zp5t5l/accounting_practice_abroad_or_law_school/",
        "text": "[removed]",
        "created_utc": 1671390752,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a Law or something about Children rights that supports my situation ?",
        "author": "I-am-broke_747",
        "url": "https://www.reddit.com/r/LawSchool/comments/zp5o7m/is_there_a_law_or_something_about_children_rights/",
        "text": "So, what should I do?\nI have a younger brother as well as two older sisters.\nMy father is not a normal person; my mother died of a brain tumour two years ago, and she also got a brain tumour as a result of the tension and stress my father was putting on her.\nMy father is like a child, he doesn't know how to make decisions; for my mother's treatments, we got into debt; my father had a normal salary; if he had used that salary to cover the debt, we wouldn't be in this situation right now.\n\nHe left his job and sold our house to cover up debt. We even told him not to sell the house, but he did it anyways, saying that I'm your father, not you. After that, he got us into his friend's house on rent (the rent of this house is too high and we also said that we couldn't afford, but still he didn't listen) after paying off all the debt, he started a business (which we also said wouldn't work)\n\nBut, in any case, he started it and made a loss for 6 months straight before falling back into debt, leaving me and my sisters as our only source of income in our home.\n\nHe won't let us keep a single penny of our salary, and we have no idea where it all goes because he won't tell us what the problem is.\n\nAfter all of this, he began selling items from our home, including my laptop (which I was using for work, so I also lost my job), my brother's phone, and our television.\n\nHe won't even listen to us once, and we haven't eaten well for 7 or 8 months. During the entire month of Ramadan, we only had water for iftaar, and on Eid, we didn't even have new clothes. One thing is certain: if my mother had been alive, we would not have been starving on EID.\n\nI'm not sure what to do, is it really abnormal, or are we all overreacting?\nHe has never even looked at us the way a father looks at his children, if we say something, he says it's all your dead mother's fault or I'm your father you're not, he sometimes threatens us with death and curses us.\n\nRight now, we are living on my sister's salary; he doesn't even give my sisters money for the bus to school; he is also a psychopath who wants to control us; and he is the meanest person we've ever seen; whenever he wants something from someone, he'll be nice to them, but when his job is done, he won't even see their face again.",
        "created_utc": 1671390389,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else find Criminal Law rather ‘intuitive’?",
        "author": "easyeerie",
        "url": "https://www.reddit.com/r/LawSchool/comments/zp57mt/does_anyone_else_find_criminal_law_rather/",
        "text": "As in, it reads like Harry Potter?\n\nLike, every page of the outline is a page-turner, filled with grisly details of heinous crimes.\n\nI originally was interested in M&amp;A but after finishing my first semester, I think Criminal Law is what grabbed my interest.",
        "created_utc": 1671389144,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anxiety After Submitting Law Review Note?",
        "author": "InformationDouble273",
        "url": "https://www.reddit.com/r/LawSchool/comments/zp4l9h/anxiety_after_submitting_law_review_note/",
        "text": "Does anyone feel anxious or scared after submitting their articles? It doesn’t matter to me if I am chosen for publication but that someone will be reading it is terrifying to me.",
        "created_utc": 1671387446,
        "upvote_ratio": 1.0
    },
    {
        "title": "That World Cup Final tho",
        "author": "SoMuchCaseLaw",
        "url": "https://www.reddit.com/r/LawSchool/comments/zp4jjk/that_world_cup_final_tho/",
        "text": "Forget finals, that WC Final was the REAL final of the semester. I’m not even that big of a soccer fan, I don’t really care about either team, but that game still had me yelling at the screen.",
        "created_utc": 1671387315,
        "upvote_ratio": 1.0
    },
    {
        "title": "who else still making up finals?",
        "author": "bigolhamsalad",
        "url": "https://www.reddit.com/r/LawSchool/comments/zp421y/who_else_still_making_up_finals/",
        "text": "Who else out here still fucking dying? I tested positive for covid the day of my civ pro exam. had to cancel it and my torts exam. I'm supposed to make them up tomorrow and tuesday, but guess who still is testing positive? this fucker. i still have two exams in the air, i haven't left my apartment in 8 days, i am still studying for this shit even though i don't give a shit anymore and all i fucking want to do is eat oysters and drink 12 bottles of wine and have a holly jolly fucking holiday and not think about torts or 12b6 motions till next semester. I can do zero of these things. plus you know, i have covid.\n\nThe school has no idea what to do with me, somehow. Like, are we not in year 40 of this fucking shit? do you not have some protocol? anyone else in a similar boat? or am i the unluckiest bitch in this unending hellscape? feeling mad sorry for myself. please share your sob story bc this miserable bitch needs company.",
        "created_utc": 1671385913,
        "upvote_ratio": 1.0
    },
    {
        "title": "E-Discovery question",
        "author": "lilligant_valor",
        "url": "https://www.reddit.com/r/LawSchool/comments/zp40h9/ediscovery_question/",
        "text": "I'm low-key panicking and I literally hate asking for help but I'm at the end of my rope. I'm in an e-discovery class and our final paper is gigantic. I've written close to 25 pages and I've covered 8 out of the 12 issues (that I was able to spot). We only had one week to write this and it's due tomorrow. \n\nI'm stuck on one issue. The assignment says we are allowed to collaborate so I'm not violating any honesty code by asking for help. \n\nThe issue is whether a U.S. subsidiary, who is the e-discovery vendor for a few other U.S. subsidiaries as well as the parent corp (in Germany), will be able to protect the other subsidiaries and parent's documents from discovery. \n\nAll the case law I've read says they can't. If they have possession of the documents (which they would because they're the e-discovery vendor), then they have to produce them if they're relevant.  But the second part of that issue is \"What steps should they take to minimize the risk?\" which leads me to believe that they can minimize the risk. The prof wants us to point to case law to answer the question (there is no specific jurisdiction). We didn't cover anything like this during the semester so I'm not even sure where to start. \n\nThe only answer I'm coming up with is that the e-discovery vendor subsidiary would have possession, custody, and control over all the documents, so of course they would have to produce them if they're relevant. That seems too easy but maybe I'm overthinking. I'm just looking for a keyword or issue to point me in the right direction because I'm very lost.\n\nSorry if this is confusing, I'm tired.",
        "created_utc": 1671385773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is anyone else playing God of War Ragnorok right now?",
        "author": "Plenty-Ad3939",
        "url": "https://www.reddit.com/r/LawSchool/comments/zp3ndc/is_anyone_else_playing_god_of_war_ragnorok_right/",
        "text": "Title. Thought I’d treat myself",
        "created_utc": 1671384631,
        "upvote_ratio": 1.0
    },
    {
        "title": "Legal writing",
        "author": "One-Caterpillar3903",
        "url": "https://www.reddit.com/r/LawSchool/comments/zp336s/legal_writing/",
        "text": "I’ve always been a good writer, but legal writing is a different beast. If seems as though the more effort and hard work I put into my research memos- it’s actually counterintuitive and a waste of my time, effort, time to do work for other classes and honestly distressing for my mental health! I don’t think I’ve ever hated a class more (especially Bc I don’t see me efforts being worth it.) Besides the fact that my prof is New, HORRIBLE, not a good instructor, insecure and unhelpful in every way. When I implement her suggestions- she says “wait is should have been like xyz” I do that and she said no do “abc.” Someone pls help me, I am so concerned, confused and burnt out from this course and I have another semester of it!! Any suggestions??! What should I do, how am I suppose to improve my writing and write RM that SHE approves of (that is very unique to her and not what other profs want) what outside sources can I use to get better?? How could I make researching easier and less time consuming?",
        "created_utc": 1671383019,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please suggest me some hilarious UK contract law cases for my assignment.",
        "author": "The_Meme_Guy69",
        "url": "https://www.reddit.com/r/LawSchool/comments/zp08jz/please_suggest_me_some_hilarious_uk_contract_law/",
        "text": "",
        "created_utc": 1671374872,
        "upvote_ratio": 1.0
    },
    {
        "title": "Civ Pro Erie Clarification",
        "author": "Ok-Interest7141",
        "url": "https://www.reddit.com/r/LawSchool/comments/zozwul/civ_pro_erie_clarification/",
        "text": "I have looked over several erie flowcharts online and they seem inconsistent or unclear compared to my class notes on some issues. Could I please get feedback on anywhere my analysis is wrong or in the wrong order? Just confused on the basic steps prior to the Hanna analysis. \n\nFrom what I understand: Once we are in the grey area between substantive and procedural law, and in federal court under diversity jurisdiction, we are considering whether to apply state law or federal (law?). \n\nThen some sources mention that any federal provision such as statute, treaty, or constitution that is on point with state law will be applied over state law due to the supremacy clause.\n\nMost sources distinguish FRCP from \"federal statutes\" as their own category, and that if there is an FRCP \"on point\" for the issue, we split off from the erie analysis and apply FRCP if it conflicts with state law, or apply both FRCP and state law if they don't conflict. \n\nIf there is an \"uncodified\" federal policy on point that does not conflict with a state law, then we just follow the federal policy?? However, if there is a federal practice in conflict with state law on the issue, we proceed to Hanna part 1. \n\nAt this point we check for any supreme court precedent on the issue and resolve it using the precedent if it fits closely to facts of issue.",
        "created_utc": 1671373909,
        "upvote_ratio": 1.0
    },
    {
        "title": "can you keep this kind of hair in length but little better kept with all styling and stuff in corporate law jobs",
        "author": "InfiniteSky5738",
        "url": "https://i.redd.it/cfm98pylgp6a1.jpg",
        "text": "",
        "created_utc": 1671372521,
        "upvote_ratio": 1.0
    },
    {
        "title": "How badly am I screwed?",
        "author": "Far_Communication_81",
        "url": "https://www.reddit.com/r/LawSchool/comments/zoybmh/how_badly_am_i_screwed/",
        "text": "I’m a 3L who just finished their last semester. While I’m glad to finally be done with school. My problem is that I have no job lined up. My work experience includes several volunteer opportunities (law related) and a semester spent working in at a Veteran’s disability clinic. \n\nAm I screwed in hopes of ever finding any sort of work? Should I even be considering a job while I’m trying to study for the bar?",
        "created_utc": 1671369118,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone explain the adequacy of representation prong of class actions?",
        "author": "a20171",
        "url": "https://www.reddit.com/r/LawSchool/comments/zos3fs/can_someone_explain_the_adequacy_of/",
        "text": "I’ve tried to ask this question 100000 times and get conflicting answers. One TA told me it was about the attorney, another told me it “rarely has anything to do with that” and now I’m reading my professors book and he says it’s the freaking attorney. I’m so lost. If at the very least if it’s not the attorney what are we considering?",
        "created_utc": 1671345308,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me myself",
        "author": "sanju_baba1",
        "url": "https://www.reddit.com/gallery/zos335",
        "text": "",
        "created_utc": 1671345269,
        "upvote_ratio": 1.0
    },
    {
        "title": "I heard you can not get a passport on probation or parole but i always see people on probation or parole traveling out of country",
        "author": "Ok_Link_5624",
        "url": "https://www.reddit.com/r/LawSchool/comments/zory0g/i_heard_you_can_not_get_a_passport_on_probation/",
        "text": "",
        "created_utc": 1671344746,
        "upvote_ratio": 1.0
    },
    {
        "title": "Waiting for grades",
        "author": "anxious_prelaw",
        "url": "https://www.reddit.com/r/LawSchool/comments/zor9bp/waiting_for_grades/",
        "text": "Why is the anxiety of waiting for grades to come out worse than the anxiety before taking the final? 😭 i think the feeling of having no control is so unsettling, how is everyone else doing?",
        "created_utc": 1671342243,
        "upvote_ratio": 1.0
    },
    {
        "title": "(LinkedIn) Attorney Connections are messaging me after my first semester - Help Needed",
        "author": "moonrabbi-t",
        "url": "https://www.reddit.com/r/LawSchool/comments/zor5gm/linkedin_attorney_connections_are_messaging_me/",
        "text": "Just finished my 1L Fall and a few attorneys I connected with randomly due to mutual connections have messaged me and I’m not sure what to do… I haven’t opened any messages yet but I’m very anxious because I’m not sure what I say and/or if there’s anything I need to be wary about before opening these messages. Any advice?",
        "created_utc": 1671341863,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does big law care about cumulative GPA or just 1L GPA?",
        "author": "anonymouspwrson10002",
        "url": "https://www.reddit.com/r/LawSchool/comments/zoqzja/does_big_law_care_about_cumulative_gpa_or_just_1l/",
        "text": "",
        "created_utc": 1671341290,
        "upvote_ratio": 1.0
    },
    {
        "title": "Graduated, but unsure that I passed.",
        "author": "angie3-141592",
        "url": "https://www.reddit.com/r/LawSchool/comments/zop8rw/graduated_but_unsure_that_i_passed/",
        "text": "So the last three exams of this 12-month LLM course were about as tough as it could get.  I was almost crying after one of them was over. Not tears of joy, but tears of utter fear that I flunked for the whole year. They let  the cohort go through with winter commencement, however, it’s possible that we didn’t actually pass.  I’m not sure when we find out, but it better be soon because I’m registered for the February bar.  I’m pretty sure the law school doesn’t give a crap about LLM bar stats, so if we fail they wouldn’t care as much as if we were JDs.  ANyhow, I’m wondering if anyone else is in the same position?",
        "created_utc": 1671335575,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to tell if it's a \"Responsive Pleading\" or not?",
        "author": "So_Ill_Continue",
        "url": "https://www.reddit.com/r/LawSchool/comments/zooxdl/how_to_tell_if_its_a_responsive_pleading_or_not/",
        "text": "Everywhere I look in the FRCP I see qualifications about needing to do something differently if the pleading is a responsive pleading/requires a response. Maybe I'm just dumb as bricks, but how can you tell if a response is required? \n\nI've googled it to no avail, and it's not anywhere in my notes. \n\nObviously, I know some specific pleadings need a response (like a complaint), but how can you tell otherwise? What am I missing?\n\nAny and all insight is highly appreciated.",
        "created_utc": 1671334529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone in the State of Florida been able to reclassify as an in-state resident for tuition purposes their 2L/3L year (particularly UF, FSU, etc.)",
        "author": "Terrible-Swordfish-9",
        "url": "https://www.reddit.com/r/LawSchool/comments/zoo4ek/has_anyone_in_the_state_of_florida_been_able_to/",
        "text": "I am getting very mixed responses online, and most of them are the information I am reading for undergraduate students. I, of course, am referring to out-of-state residents who enroll as out-of-state students for tuition purposes during their 1L year, and then are able to reclassify as residents (for cheaper tuition) before the start of their 2L year. I am also curious about how that would affect any outstanding scholarship awards. \n\nI've seen things like applying for an application within the Florida Bar during 1L be helpful, and obviously common things like a driver's license, voting card, etc., and getting ahead of this before classes even start 1L. It seems the main thing that has garnered positive results is buying a house in Florida but of course, that is unrealistic for most.  \n\nHas anyone succeeded or failed?",
        "created_utc": 1671332054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grades",
        "author": "Imaginary-Impact5413",
        "url": "https://www.reddit.com/r/LawSchool/comments/zonctn/grades/",
        "text": "First semester of law school. I got two grades back and scored a 78% exactly in two classes. I’m feeling so disappointed in myself because I really thought I’d do better. My school put us on academic probation if our cumulative GPA is below a 75%. I’m still awaiting two grades and feeling absolutely riddled with anxiety. \n\nIn brutal honesty, how bad is a 78% for first law school class scores? I have nothing to compare myself too and my professors doesn’t release the curve. I know comparison doesn’t change anything, but some conversation around the topic would be comforting.",
        "created_utc": 1671329708,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me post-finals during the holidays...",
        "author": "Vast-Passenger-3035",
        "url": "https://i.redd.it/u2kuu7kovl6a1.jpg",
        "text": "",
        "created_utc": 1671329163,
        "upvote_ratio": 1.0
    },
    {
        "title": "miserable being hard on myself",
        "author": "suffering1l",
        "url": "https://www.reddit.com/r/LawSchool/comments/zon3ut/miserable_being_hard_on_myself/",
        "text": "[removed]",
        "created_utc": 1671328966,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I choose a law school based on ranking or employment statistics?",
        "author": "Massive-Ad3220",
        "url": "https://www.reddit.com/r/LawSchool/comments/zomm0e/should_i_choose_a_law_school_based_on_ranking_or/",
        "text": "I'm hearing conflicting answers on this. Some say don't go to McGeorge, for example, because of its horrible employment numbers. A school like USD doesn't have great employment numbers either but it has a decent ranking. What advice would you guys give?",
        "created_utc": 1671327489,
        "upvote_ratio": 1.0
    },
    {
        "title": "Down so bad that I looked up what Richard freer looked like when he was young",
        "author": "ParticularSilver2438",
        "url": "https://i.redd.it/k000xl9qml6a1.jpg",
        "text": "",
        "created_utc": 1671326150,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ethics violation",
        "author": "knoxyvelle",
        "url": "https://www.reddit.com/r/LawSchool/comments/zols2i/ethics_violation/",
        "text": "Has anybody faced an investigation for an alleged ethics violation? If so, what can be done if the allegations were false?",
        "created_utc": 1671325144,
        "upvote_ratio": 1.0
    },
    {
        "title": "If a Bailee takes the whole bag, are they guilty of larceny?",
        "author": "Ok-Gene5007",
        "url": "https://www.reddit.com/r/LawSchool/comments/zokxk5/if_a_bailee_takes_the_whole_bag_are_they_guilty/",
        "text": "I understand the rule but not the concept. I don't get the bag vs. contents stuff. if the bailee takes the bag and puts it in their closet without breaking its bulk, then it's not larceny??",
        "created_utc": 1671323090,
        "upvote_ratio": 1.0
    },
    {
        "title": "Canceling my Quimbee subscription after taking my last ever law school exam",
        "author": "ImpressionPlanet",
        "url": "https://i.redd.it/quzj9p1vuj6a1.gif",
        "text": "",
        "created_utc": 1671322750,
        "upvote_ratio": 1.0
    },
    {
        "title": "Examples of cases where the SCOTUS has used public policy to justify its decisions",
        "author": "Afraid-Case-4317",
        "url": "https://www.reddit.com/r/LawSchool/comments/zokepo/examples_of_cases_where_the_scotus_has_used/",
        "text": "primarily public policy concerns justifying its decisions",
        "created_utc": 1671321893,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ya'll think my professor will dock me for not putting written responses in different question sections?",
        "author": "Jacob819mg",
        "url": "https://www.reddit.com/r/LawSchool/comments/zokbpk/yall_think_my_professor_will_dock_me_for_not/",
        "text": "My professor had 2 questions for the written portion, but both questions had 2 sub-parts. He made 4 question slots available for our responses. But since the first 2 sub-parts were labeled under the same question I just lumped them together in the first question slot. I did the same thing for the second question's 2 sub-parts since they were both labeled under that question as question 2. Thus, I did not use questions slots 3 and 4.\n\n&amp;#x200B;\n\nI'm sure this sounds dumb but damn I hope I don't get docked over that lol",
        "created_utc": 1671321690,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anxiety over feeling like you didn't write enough on certain exam questions",
        "author": "HappyBlueKnight",
        "url": "https://www.reddit.com/r/LawSchool/comments/zok4r4/anxiety_over_feeling_like_you_didnt_write_enough/",
        "text": "We just had our crim final, and it ended up having more subparts than past exams have had. Some past exams only had three really long questions, but this exam was much more divided. Some of my answers to certain sub parts were quite massive, but others looked pitifully small. Those that I wrote less for were questions which tended to have a lower \"recommended time\" stated, but I can't help but worry that my peers wrote some massive wall of cutting-edge analysis with points that I might have missed. Fortunately, I don't think that anything I wrote was blatantly incorrect at least.\n\nDo you commonly worry that your answers were too short compared to your classmates' on the final exam?",
        "created_utc": 1671321208,
        "upvote_ratio": 1.0
    },
    {
        "title": "Laughter breaks out when attorney keeps confusing Supreme Court Justices",
        "author": "scotusreacts",
        "url": "https://www.reddit.com/r/LawSchool/comments/zoj33j/laughter_breaks_out_when_attorney_keeps_confusing/",
        "text": "[https://www.youtube.com/watch?v=NI0Pwqu0eL4](https://www.youtube.com/watch?v=NI0Pwqu0eL4)",
        "created_utc": 1671318468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about admission",
        "author": "glossdino",
        "url": "https://www.reddit.com/r/LawSchool/comments/zoiybn/question_about_admission/",
        "text": "So I’m not a law school student or know much about the law school field in general so I was hoping someone here can give me some insight as to if this is possible.\n\nSo one of my best friends is allegedly attending Stanford Law school. They work under someone who works at law school (not sure if he’s a professor, or what exactly he does). So her boss was able to get her into law school. This is what i’m not understanding and seems odd to me. She didn’t take the LSAT for admissions, she took the baby bar instead (which a long time ago she said was so she could skip her first year of law school, but as of recently she told me she was a 1L and the baby bar was so she could be at the same level as her peers. I’m in the process of applying to graduate school (not related to law at all) and all my programs require 3 LOR. I was asking her some questions and she told me she only needed 1 LOR and that the one from her boss sufficed. I thought that was odd, especially since stanford is considered a prestigious school. \n\nI also saw you can look at stanford profiles, but i did not see her name when searching her up. But idk if they include all their students on there. I also have her location and she turned it off the week before school started, which is what made me become skeptical. As of yesterday one of my other friends mentioned that our friend told her she was a 2L, but told me she was a 1L which now has me questioning everything.  \n\nI guess my question is- is it possible to even enroll in a school this way?? Seems way too easy to get into law school this way but she has always had good luck.\n\nIt seems extremely weird to lie about something like this, but everything seems off and doesn’t add up for me. Hoping someone can clarify before i confront them. \n\nTLDR: bestfriend might be lying about being a law student",
        "created_utc": 1671318112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sigh",
        "author": "Traditional-Wave-724",
        "url": "https://www.reddit.com/r/LawSchool/comments/zoiu1e/sigh/",
        "text": "Pretty sure I did really bad in my con law &amp; property exam……just trying to study more &amp; hoping to do better in my last two finals this week",
        "created_utc": 1671317814,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am working on a free citation generator for the Bluebook, anyone interested? Companies are charging way too much for something that should be free. Any pertinent features you would want included? Specific state rules? Unpublished (already done now along with website, statute, book, etc).",
        "author": "sailorprogearslim",
        "url": "https://i.redd.it/j5mrz6sofj6a1.png",
        "text": "",
        "created_utc": 1671317623,
        "upvote_ratio": 1.0
    },
    {
        "title": "Curious about your interpretations on this",
        "author": "maddieinretrograde",
        "url": "https://www.reddit.com/r/LawSchool/comments/zohc4h/curious_about_your_interpretations_on_this/",
        "text": "Rent is insanity and I notice more and more landlords trying to charge a wild amount for deposits along with general move in fees. I’m curious what you guys think about the hypothetical scenario compared to what the statutes say \n\nLocation and statutes: In Washington State, specifically Pierce County - the statutes are [RCW 59.18.610](https://app.leg.wa.gov/rcw/default.aspx?cite=59.18.610) and [RCW 59.18.253](https://app.leg.wa.gov/RCW/default.aspx?cite=59.18.253) that discuss the matters of deposits. \n\nAn example of a rental matter: landlord wants first and last month’s rent along with a $1,500 deposit up front. Rent is $2,000 so you’re looking at $5,500 up front. \n\nPursuant to the statutes, how would you interpret this if someone was asking for more than 25% of the monthly rental value for the security deposit?",
        "created_utc": 1671313975,
        "upvote_ratio": 1.0
    },
    {
        "title": "AIBE 2022-2023 Dates, Exam pattern and subjects!!!",
        "author": "RSawadia71",
        "url": "https://youtube.com/shorts/Gcdew87Gb24?feature=share",
        "text": "",
        "created_utc": 1671313883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ethics of reaching out to a professor for a lawyer reccomendation?",
        "author": "Cool-Huckleberry-782",
        "url": "https://www.reddit.com/r/LawSchool/comments/zoh1q1/ethics_of_reaching_out_to_a_professor_for_a/",
        "text": "[removed]",
        "created_utc": 1671313230,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you are anxious about grades, click here",
        "author": "AndrewLWebber1986",
        "url": "https://www.reddit.com/r/LawSchool/comments/zog5uc/if_you_are_anxious_about_grades_click_here/",
        "text": "You probably got a B.",
        "created_utc": 1671310990,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question About NCBEX 'The Everything Value Pack'",
        "author": "Gragdor_Velhad",
        "url": "https://www.reddit.com/r/LawSchool/comments/zofm95/question_about_ncbex_the_everything_value_pack/",
        "text": "Hi!\n\nHas anyone here purchased the 'The Everything Value Pack' from NCBEX before? The one that has tons of MBE, MEE, and MPT exams from past administrations.\n\nIf so, are you able to download all of that material and save it to your computer? Rather than keep having to access it via the website/app.\n\nThanks!",
        "created_utc": 1671309572,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally done with exams but my anxiety has me in a death grip",
        "author": "Too_CompliKated",
        "url": "https://www.reddit.com/r/LawSchool/comments/zofezt/finally_done_with_exams_but_my_anxiety_has_me_in/",
        "text": "When you finish your last exam and print out the confirmation number for your submission but that tiny voice in the back of your mind keeps going “are you sure you submitted it properly” 😖",
        "created_utc": 1671309038,
        "upvote_ratio": 1.0
    },
    {
        "title": "11th Amendment",
        "author": "StoneJackBaller1",
        "url": "https://www.reddit.com/r/LawSchool/comments/zof8fu/11th_amendment/",
        "text": "I understand that the 11th Amendment gives states sovereign immunity so that a state cannot be sued by a citizen of another state. However, can a citizen sue his own state?",
        "created_utc": 1671308571,
        "upvote_ratio": 1.0
    },
    {
        "title": "Misconduct case",
        "author": "Needleworker-Shoddy",
        "url": "https://www.reddit.com/r/LawSchool/comments/zoesye/misconduct_case/",
        "text": "Hi everyone, I am involved in the integrity academic case, and I have the Agreement Solution, in the Agreement stated that I have 10 days to respond, but they miscalculation the date and it’s only 9 days, can I consider this as a due process rights violated and repeal the case.",
        "created_utc": 1671307457,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone overcame super poor 1L Fall grades",
        "author": "RequirementDouble988",
        "url": "https://www.reddit.com/r/LawSchool/comments/zoeldl/anyone_overcame_super_poor_1l_fall_grades/",
        "text": "Also if i improve my grades for the gpa cut off for bl jobs, would bad grades from particular semester matter a lot?\nI need some hope rn…",
        "created_utc": 1671306913,
        "upvote_ratio": 1.0
    },
    {
        "title": "And now we wait",
        "author": "garrettgravley",
        "url": "https://i.redd.it/yg0wibroei6a1.png",
        "text": "",
        "created_utc": 1671305137,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I doing it right?",
        "author": "Stock_Tea_7619",
        "url": "https://www.reddit.com/r/LawSchool/comments/zodbda/am_i_doing_it_right/",
        "text": "Is it better to make sure to answer all of the questions or go a little slower, allowing myself more time to think on a question, sacrificing a few for more time?\n\nOur tests moved from in-person and closed book, to remote and open book at the last minute. Some professors didn’t like that and made their tests so hard we wouldn’t have enough time to even look at our outlines. \n\nMost of us weren’t able to answer all of the questions. I managed to get through them all, but may have hurt myself by not allowing more time to think on the question and weigh the answers more thoroughly. \n\nShould I have sacrificed a few questions for a better chance of getting more right? I feel pretty awful about finals and I think I may have hurt my chances for a decent grade.",
        "created_utc": 1671303545,
        "upvote_ratio": 1.0
    },
    {
        "title": "Explain torts to me like I’m 5.",
        "author": "SarkastikWorlock",
        "url": "https://www.reddit.com/r/LawSchool/comments/zoccki/explain_torts_to_me_like_im_5/",
        "text": "What do I *absolutely* need to know. Got a final on Monday.",
        "created_utc": 1671300967,
        "upvote_ratio": 1.0
    },
    {
        "title": "attack outline for civ pro",
        "author": "Superb-Contract8750",
        "url": "https://www.reddit.com/r/LawSchool/comments/zobij2/attack_outline_for_civ_pro/",
        "text": "my exam is in two days and im soooooo unprepared. does anyone have a good outline or attack outline? or any general tips on how to study best for the next two days?",
        "created_utc": 1671298708,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any recommendations for Spanish-English legal dictionaries?",
        "author": "Embarrassed_Sun_9864",
        "url": "https://www.reddit.com/r/LawSchool/comments/zoaxwp/any_recommendations_for_spanishenglish_legal/",
        "text": "Seeing mixed reviews on a lot of books and wondering if anyone has used any that they’ve liked",
        "created_utc": 1671297145,
        "upvote_ratio": 1.0
    },
    {
        "title": "AMA BigLaw Transactional Midlevel",
        "author": "Haiyaky",
        "url": "https://www.reddit.com/r/LawSchool/comments/zoaviz/ama_biglaw_transactional_midlevel/",
        "text": "Did one of these a while ago as a junior. Now I’m a mid. Fire away if interested",
        "created_utc": 1671296970,
        "upvote_ratio": 1.0
    },
    {
        "title": "So i just failed calc 2",
        "author": "reborngirl24",
        "url": "https://www.reddit.com/r/LawSchool/comments/zoalo7/so_i_just_failed_calc_2/",
        "text": "\nI’m an economics major and calc 2 is requirement so i’ll have to take it again. I kinda upset because my advisor asked me if i wanted to drop the class and i thought i could improve so i said i’ll keep going on. Now that i failed it one of my worries is that i won’t be able to get into law school or get a good internship since it’s on my transcript. I just want to know if there’s a way out of it cuz i really want to go to law school",
        "created_utc": 1671296234,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question regarding majorities in the 12th amendment",
        "author": "aliosha-karamazov",
        "url": "https://www.reddit.com/r/LawSchool/comments/zoaany/question_regarding_majorities_in_the_12th/",
        "text": "If no candidate for the presidency obtains an absolute majority of votes in the electoral college the house of representatives chooses the future president among the three contenders who have received the most votes. The members of the house of representatives no longer vote individually, as they usually do, but gather in \"delegations\" from the states they are from so there are 50 delegations in total, am I right?   A candidate in order to win needs an absolute majority of votes in the House of representatives. Additionally, the 12th amendment imposes a quorum of 2/3 of state delegations. So there are 50 delegations but 33 delegations must be present for the votes to be valid and the candidate who will win the presidency is the one who obtains 26 votes. Am I right?\n\nThanks!",
        "created_utc": 1671295390,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mentally defeated 3L",
        "author": "SnooMarzipans9781",
        "url": "https://www.reddit.com/r/LawSchool/comments/zoaadw/mentally_defeated_3l/",
        "text": "Law school has mentally and physically ruined me. That’s it. #vent",
        "created_utc": 1671295369,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finals. . .",
        "author": "agirlhere22",
        "url": "https://www.reddit.com/r/LawSchool/comments/zoa79n/finals/",
        "text": "Just a thread to laugh about how off professor expectations are. Had multiple exams where the prof told us they’d give us an extra hour and it “wasn’t time-pressured” and then ALSO, here’s five complex essay questions with multiple parts… and “short-answers.” 😅Am I the only one who can never finish these in time?!\n\nAlso, whenever we see sample answers it’s like 25 pages of perfection. How do people do this in three hours?!!",
        "created_utc": 1671295134,
        "upvote_ratio": 1.0
    },
    {
        "title": "Final Paper Late",
        "author": "Signal-Discussion-90",
        "url": "https://www.reddit.com/r/LawSchool/comments/zo9j3n/final_paper_late/",
        "text": "Hey everyone I am a 3l. I have a final paper that is due today for a seminar and I am just nowhere near being done. I could probably turn it in tomorrow. This has been an extremely difficult semester for me and I don't know what to do. I know you're not at my school but is it an automatic failure to turn in a paper like this a day late? Any comments would be appreciated.",
        "created_utc": 1671293359,
        "upvote_ratio": 1.0
    },
    {
        "title": "PW Summer 2023 Contract?",
        "author": "DeerDiscombobulated1",
        "url": "https://www.reddit.com/r/LawSchool/comments/zo9idk/pw_summer_2023_contract/",
        "text": "Have any incoming 2023 summer associates at PW received their contracts yet? Its been radio silence since I accepted my offer. Wondering when we can expect to hear back. Some friends at other firms already know their dates.",
        "created_utc": 1671293302,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Police during my crim pro final.",
        "author": "adsbydalton",
        "url": "https://i.redd.it/8aqa5xw0ni6a1.jpg",
        "text": "",
        "created_utc": 1671289927,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about Wachtell/Cravath/Skadden",
        "author": "MBA2021Hopeful",
        "url": "https://www.reddit.com/r/LawSchool/comments/zo7oyc/question_about_wachtellcravathskadden/",
        "text": "Just curious, what GPA would you normally need for Wachtell, Cravath, or Skadden? Would they only take 3.8 and above? What other things do they mainly look at besides GPA?",
        "created_utc": 1671288152,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone explain Labor law to me like I'm 5",
        "author": "Yrweallhur",
        "url": "https://www.reddit.com/r/LawSchool/comments/zo6wu9/can_someone_explain_labor_law_to_me_like_im_5/",
        "text": "Exam in 3 hours, what issues are most likely to pop up?",
        "created_utc": 1671285727,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anybody ever got investigated for an ethics complaint?",
        "author": "Concentrate_Rich",
        "url": "https://www.reddit.com/r/LawSchool/comments/zo47iv/has_anybody_ever_got_investigated_for_an_ethics/",
        "text": "How does it affect your moral character app? Doesn’t matter if you were found non-guilty. We’re just talking about the fact if u were investigated.",
        "created_utc": 1671275719,
        "upvote_ratio": 1.0
    },
    {
        "title": "a couple simple questions I think I'm over thinking",
        "author": "Free-people101",
        "url": "https://www.reddit.com/r/LawSchool/comments/zo2nzi/a_couple_simple_questions_i_think_im_over_thinking/",
        "text": "[removed]",
        "created_utc": 1671269321,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are the courts/corrections really like that as it is depicted in shameless season 4, ep 6?",
        "author": "Bugaboo411",
        "url": "https://www.reddit.com/r/LawSchool/comments/zo22j1/are_the_courtscorrections_really_like_that_as_it/",
        "text": "In that episode Fiona gets arrested, booked, charged, had her arraignment, and her prelim hearing and for a lot of the time my mouth was agape because of how harsh some of the c.o. Was and and how the pd and judged moved. I understand how the pd was like because im pretty well versed on how pds are treated in courts but jeez even the judge was an ahole???? Whole process just disgusted me tbh",
        "created_utc": 1671266780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finished my last law school exam by typing 1500 words in the 2.5 hours we were given.",
        "author": "nvrsmr1",
        "url": "https://www.reddit.com/r/LawSchool/comments/zo1bj9/finished_my_last_law_school_exam_by_typing_1500/",
        "text": "Set the low end up the curve for my fellow classmates. \n\nBefore anyone asks… No, it was not quality work",
        "created_utc": 1671263647,
        "upvote_ratio": 1.0
    },
    {
        "title": "Backpack",
        "author": "Eastern_Trainer_5964",
        "url": "https://www.reddit.com/r/LawSchool/comments/zo018w/backpack/",
        "text": "How big of a backpack should I get for lawschool? Will I be carrying around multiple case books every day? Looking for a Christmas gift for myself for when I start!",
        "created_utc": 1671258553,
        "upvote_ratio": 1.0
    },
    {
        "title": "3L finals",
        "author": "kyogreat",
        "url": "https://www.reddit.com/r/LawSchool/comments/znzhk2/3l_finals/",
        "text": "…. ohhh boy.",
        "created_utc": 1671256508,
        "upvote_ratio": 1.0
    },
    {
        "title": "Last final",
        "author": "isthatadare",
        "url": "https://www.reddit.com/r/LawSchool/comments/znzbok/last_final/",
        "text": "Tomorrow is my last final and I feel fine about it, but I can’t sleep. Having nothing to do is weird, I have been going going all semester with due dates and managing my time… but now there is nothing to manage or panic about… how do normal people live in the nothingness?",
        "created_utc": 1671255902,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accounting grad, should I go to law school?",
        "author": "applepie128",
        "url": "https://www.reddit.com/r/LawSchool/comments/znz274/accounting_grad_should_i_go_to_law_school/",
        "text": "I’m 27 and graduated from university with an accounting degree 4 years ago. I did pretty well in university and had a good GPA. The problem is I never really enjoyed accounting and I’m not great with numbers (I’ll never know how I manage to graduate with a solid GPA). \n\nFast forward to my first accounting job at a public accounting firm, I was fired for lacking “technical knowledge” because I had trouble applying my accounting knowledge to the job. I also hated working with numbers. If anyone is familiar with the accounting field, you’ll know that if you don’t have enough accounting experience, getting your CPA designation is worthless. Without a CPA designation, you’re stuck with low paying bookkeeping jobs. I was even told by my employers to try a different field. \n\nI want to go to law school as I have always been interested in law. I also generally enjoying reading, writing, and research more than I enjoy math and numbers. In university, I took my electives in history, law, politics and human rights and I greatly enjoyed those courses. \n\nDo you think it would be wise for me to go to law school? \n\nOr do you think that if I can’t cut it in the accounting field, I shouldn’t try law because it is much harder than accounting (even though it requires a different skill set). \n\nSorry for the long post!",
        "created_utc": 1671254969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Easy Classes ? Or Classes helpful for firms?",
        "author": "InformationDouble273",
        "url": "https://www.reddit.com/r/LawSchool/comments/znyw6z/easy_classes_or_classes_helpful_for_firms/",
        "text": "2L SA. I’m not sure which classes to take but I either want something easy or classes for someone going the firm path. I appreciate any advice!",
        "created_utc": 1671254356,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just finished the last final exam yesterday, and my blood pressure went down lol",
        "author": "chromiole",
        "url": "https://www.reddit.com/r/LawSchool/comments/znyc6i/just_finished_the_last_final_exam_yesterday_and/",
        "text": "Out of nowhere, my blood pressure skyrocketed at the beginning of the semester to around 150/120\n\nI didn't have a history and got worried, started taking blood pressure meds and monitoring twice daily. Even after taking meds, it would be around 110/80 in the morning and 125/115 at night. \n\nMy last exam was yesterday. I woke up at like 11 am today, so I decided to skip medication and monitoring. \n\nJust checked my blood pressure before bed, and it reads 94/62, 109/69, and 100/69. Couldn't believe my eyes, so I had to check it three times. \n\nNever in my life had I gone through something like this... felt like this... this is so weird...\n\nI can't wait til the next semester to see my numbers skyrocket again. Will prove my theory that it's law school... but seriously... I really hope it won't...",
        "created_utc": 1671252362,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is Law &amp; Economics all about?",
        "author": "js001232",
        "url": "https://www.reddit.com/r/LawSchool/comments/znxtiu/what_is_law_economics_all_about/",
        "text": "And should I take this class?",
        "created_utc": 1671250491,
        "upvote_ratio": 1.0
    },
    {
        "title": "What the biggest pros and cons to being a lawyer?",
        "author": "RiPiLiQi",
        "url": "https://www.reddit.com/r/LawSchool/comments/znxkpc/what_the_biggest_pros_and_cons_to_being_a_lawyer/",
        "text": "",
        "created_utc": 1671249653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a career in law worth it if you’re in it more for the money then fulfillment?",
        "author": "Solid_Conference2905",
        "url": "https://www.reddit.com/r/LawSchool/comments/znwzwd/is_a_career_in_law_worth_it_if_youre_in_it_more/",
        "text": "So, I’m a junior accounting major. 4.0/4.0 GPA, 2 internships in tax completed, and participating in Beta Alpha Psi (Accounting and Finance “Fraternity”(it’s just a club).\n\nMy goal has been to get my masters and become a CPA. Hopefully work up partner/start my own firm. I’m largely driven by financial compensation, and accounting firm hours average somewhere around 45-55 already when you factor in busy season and slow times.\n\nI obviously am a very hard working student and have a great aptitude for learning. I’m confident I could put the work in and get a sufficient LSAT score and get into a good school. Idk tho you tell me maybe I couldn’t get a good score . Not trying to be cocky, but I’m very driven and work hard. \n\nI have had my entire undergrad paid for by my grand parents 529k they made for me years ago, but law school would for sure mean loans.\n\nAnyway, I enjoy accounting, but it’s still ya know… a job. I feel like I would feel the same about law, but I really don’t know.\n\nCan anyone speak on my situation. I have done a lot of research, but really just don’t know.",
        "created_utc": 1671247664,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me during my 5 exams",
        "author": "ramen-slut-",
        "url": "https://i.redd.it/6htfwcvire6a1.jpg",
        "text": "",
        "created_utc": 1671243013,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finals and dumb fucking typos",
        "author": "jmhc123",
        "url": "https://www.reddit.com/r/LawSchool/comments/znuk0x/finals_and_dumb_fucking_typos/",
        "text": "What’s everyone’s hot take on if you accidentally failed to negate an important statement which runs contrary to your entire argument. But earlier in the argument you did stated it correctly? To professors show grace on small, but impactful, typos like that?",
        "created_utc": 1671239810,
        "upvote_ratio": 1.0
    },
    {
        "title": "If I’m from Trinidad &amp; Tobago am I Hispanic?",
        "author": "saantiaago",
        "url": "https://www.reddit.com/r/LawSchool/comments/znui99/if_im_from_trinidad_tobago_am_i_hispanic/",
        "text": "This job says Hispanic means someone from “regardless of race, South America, Cuba, Mexico” etc. Trinidad is apparently part of South America. I am indo caribbean. Will this work?",
        "created_utc": 1671239656,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is an all MC exam curved?",
        "author": "Then-Grapefruit-2430",
        "url": "https://www.reddit.com/r/LawSchool/comments/zntbki/how_is_an_all_mc_exam_curved/",
        "text": "In a big, upper level course (50+ students), how is an all MC exam curved? Because you only get the question right or wrong, unlike an essay in which you can justify your answer, is it possible to fail a multiple choice exam after grades are curved?",
        "created_utc": 1671236089,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got a B+ in legal writing, don't know my other classes yet: how screwed am I?",
        "author": "saantiaago",
        "url": "https://www.reddit.com/r/LawSchool/comments/znt9ao/got_a_b_in_legal_writing_dont_know_my_other/",
        "text": "Like is this a good predictor of how my other classes will go LOL? Has anyone else done poorly in Legal Writing but well in doctrinals?",
        "created_utc": 1671235904,
        "upvote_ratio": 1.0
    },
    {
        "title": "Leg Reg - where do I put the constitutional analysis in Chevron/the major questions analysis in terms of steps? Still confused by this",
        "author": "randyerthanyou1",
        "url": "https://www.reddit.com/r/LawSchool/comments/znsh1c/leg_reg_where_do_i_put_the_constitutional/",
        "text": "Thank you!",
        "created_utc": 1671233698,
        "upvote_ratio": 1.0
    },
    {
        "title": "Failing a class and Big Law SA",
        "author": "Weary-Ad3296",
        "url": "https://www.reddit.com/r/LawSchool/comments/znr2bi/failing_a_class_and_big_law_sa/",
        "text": "Hey everyone. Hypothetically wondering if I failed one class 2L if that would mean my big law Summer SA would be revoked?",
        "created_utc": 1671229903,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on Elon Law?",
        "author": "Repulsive_Carrot1354",
        "url": "https://www.reddit.com/r/LawSchool/comments/znq894/thoughts_on_elon_law/",
        "text": "",
        "created_utc": 1671227750,
        "upvote_ratio": 1.0
    },
    {
        "title": "NYLE Control F mistake!!!!!",
        "author": "Realistic-Put-8014",
        "url": "https://www.reddit.com/r/LawSchool/comments/znq0wk/nyle_control_f_mistake/",
        "text": "Im very nervous! Took the NYLE today, and 70% of the way through forgot the rule against and accidentally clicked Control F once on my outline (LITERALLY ONCE). \n\nIt’s second nature to me when looking through my outlines and hours into the exam I forgot. Am I screwed? Are they going to invalidate my score? \n\nExemplify didn’t close out my computer. And we were allowed to have electronic outline just not use the Control F. I closed out my outlines and just used my printed version right after so that I didn’t accidentally do it again",
        "created_utc": 1671227207,
        "upvote_ratio": 1.0
    }
]