[
    {
        "title": "Hey anyone have any used construction law books they want to give away or sale? Before I pay $500 for one book smh.",
        "author": "Fun_Area5949",
        "url": "https://www.reddit.com/r/LawSchool/comments/zvb7gb/hey_anyone_have_any_used_construction_law_books/",
        "text": "",
        "created_utc": 1672016206,
        "upvote_ratio": 1.0
    },
    {
        "title": "how is the americorps award disbursed if used for law school?",
        "author": "mysticvic21",
        "url": "https://www.reddit.com/r/LawSchool/comments/zvb1j3/how_is_the_americorps_award_disbursed_if_used_for/",
        "text": "for anyone who has completed an americorps service and used it to finance law school, how was the award disbursed? i have a 12K award &amp; i’m wondering if it’ll be disbursed in 6 installments over 6 semesters of law school, all at once, or in 2 installments over the course of the first two semesters. \nI’m trying to plan how i will finance living expenses for the first year.\n\nthank you!",
        "created_utc": 1672015679,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questionable torts teaching method",
        "author": "AcceptableArgument9",
        "url": "https://www.reddit.com/r/LawSchool/comments/zvawha/questionable_torts_teaching_method/",
        "text": "1L here. I have a quick question. My torts professor doesn't lecture per se, instead, we go over something like 18-23 briefs per class. He instead instructs us to utilize the lectures on Bar Bri. Is this normal? On top of this, he doesn't give concrete rule statements but wants us to have \"workable\" rule statements. I failed miserably on his midterm and I'm trying to figure out if the issue is with me or his teaching style.\n\nOk, not such a quick question.\n\nThanks!",
        "created_utc": 1672015239,
        "upvote_ratio": 1.0
    },
    {
        "title": "where to find bar pass rate",
        "author": "Plastic-Part",
        "url": "https://www.reddit.com/r/LawSchool/comments/zva1xn/where_to_find_bar_pass_rate/",
        "text": "Hi everyone! Does anyone know the most reliable source to find a school's bar passage rate among its students? I'm not sure which website is most accurate/the one most people use to figure out the percentage. Thanks in advance",
        "created_utc": 1672012559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone here who's joining nlsiu through clat 23?",
        "author": "BillyBoy357",
        "url": "https://www.reddit.com/r/LawSchool/comments/zv7v2w/anyone_here_whos_joining_nlsiu_through_clat_23/",
        "text": "Pretty much the title, i scored a rank of 54 so nlsiu is more or less guaranteed. Just want to make friends",
        "created_utc": 1672005885,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some questions regarding Fall grades and updating recruiters",
        "author": "tiethatyarn",
        "url": "https://www.reddit.com/r/LawSchool/comments/zv7flb/some_questions_regarding_fall_grades_and_updating/",
        "text": "First, do we send updates after each grade is posted? Or after all are posted? \n\nSecond, how do we update the recruiters? It seems like some provide direct links to upload them, but most seemingly do not. \n\nThanks!",
        "created_utc": 1672004604,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resources to learn how to read/write briefs",
        "author": "ViolinistBrave11",
        "url": "https://www.reddit.com/r/LawSchool/comments/zv7d59/resources_to_learn_how_to_readwrite_briefs/",
        "text": "What are good resources for an undergraduate student to learn how to read/understand/write briefs?",
        "created_utc": 1672004406,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have no idea what to do after graduating and being unemployed",
        "author": "AdAdventurous8406",
        "url": "https://www.reddit.com/r/LawSchool/comments/zv6kcb/have_no_idea_what_to_do_after_graduating_and/",
        "text": "I'm just generally wondering if anyone has any ideas or advice on how to get back on my feet. I don't really want to write too many details on my background, but I guess I can respond if I'm being too vague. I graduated from a T10 school a few years ago and struck out of OCI. I think there were many reasons why I struck out, most of which have resolved. I feel like a much better interviewer now, but it doesn't seem like there is much of a chance to even interview for the jobs people got out of my school. I'm struggling to figure out what jobs are even realistic for someone like me. I was in a field not associated with law for the last few years that may allow me to sell myself in unique ways to big firms, so I am experimenting with that too. Do firms really hire new associates who have graduated a few years ago, or is it pretty much a lost cause? I am a member of my state's bar if that's worth anything.\n\nAt this point, I left what I was doing in my other career and am back looking for lob jobs while unemployed. I'm running out of money and just generally lonely and unhappy. I feel like I blew a lot of potential in many different areas, but I also feel like I didn't do any of this intentionally. It's just a lot of mistakes that I didn't really know about until after they happened. I'm the first person in my family to go to law school, and at least I can say I'm happy I just was able to graduate.\n\nWhat jobs can I get employed in relatively quickly? It seems like insurance defense and public defender are the only options people are suggesting. And while I am open to anything, what's concerning to me is that accepting these jobs may forever impede my ability to work at a large firm or otherwise advance in the legal profession. I feel like the advice of \"working your way up\" is almost counterintuitive in law because certain positions in law signal that someone couldn't get other positions initially.\n\nI guess I'm just lost and confused and feel like I am wasting time. I don't feel productive and am honestly frustrated that I let myself get to where I am now. It's also hard not to blame myself because I graduated from a good school with decent grades. So I often think \"I'm in this position because people don't like me\" or something like that.",
        "created_utc": 1672002012,
        "upvote_ratio": 1.0
    },
    {
        "title": "helpful impeachment chart--FRE impeachment by prior crime conviction",
        "author": "Fun_Difficulty_4368",
        "url": "/r/barexam/comments/zv6i40/helpful_impeachment_chartfre_impeachment_by_prior/",
        "text": "",
        "created_utc": 1672001909,
        "upvote_ratio": 1.0
    },
    {
        "title": "It’s been a blast but I’m deleting my account",
        "author": "ItzLeoo",
        "url": "https://www.reddit.com/r/LawSchool/comments/zv6fvf/its_been_a_blast_but_im_deleting_my_account/",
        "text": "If y’all recognize my username, great. If not, I still hope that y’all saw the funny posts I’ve made throughout the years.\n\nThe past few months have been rough for me. I’ve gone through a breakup that I’m still not over. I don’t even have a job lined up for post graduation. I don’t even really know what I’m doing with my life but I know that staying on social media can’t help and hopefully eliminating distractions will help me get better.\n\nThis community has been a big part of my identity for the last few years. I got a lot of karma for posting shitty memes and resources for other students to use. I hope that my previous posts stay because it’d be a shame for them to go.\n\nUltimately, I hope y’all enjoyed at least a little bit of the content I posted on here over the years. You’ll all make great attorneys, if you’re not already one as is :)",
        "created_utc": 1672001633,
        "upvote_ratio": 1.0
    },
    {
        "title": "Focus playlist of ambient music. Very minimal droning synths. Something to listen to without being distracting. Best of luck with your studies!",
        "author": "AnAccountForNews",
        "url": "https://www.reddit.com/r/LawSchool/comments/zv6ag7/focus_playlist_of_ambient_music_very_minimal/",
        "text": "https://open.spotify.com/playlist/5BcX6balUfSWC4kACugj7g \n\n https://music.apple.com/ca/playlist/ambient-focus/pl.u-PDb4zlBFemxD6dj",
        "created_utc": 1672001174,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L taking classes with 2L and 3L",
        "author": "ImmediateServe9397",
        "url": "https://www.reddit.com/r/LawSchool/comments/zv1o9p/1l_taking_classes_with_2l_and_3l/",
        "text": "Is being in a class with 2Ls/3Ls going to destroy your 1L GPA since they are more experience exam takers?",
        "created_utc": 1671987102,
        "upvote_ratio": 1.0
    },
    {
        "title": "A survey for students about their usage of apps to aid their schooling.",
        "author": "Khryotic23",
        "url": "https://www.reddit.com/r/LawSchool/comments/zv1ggh/a_survey_for_students_about_their_usage_of_apps/",
        "text": "In this survey we aim to learn more about students' usage of mobile apps and computer apps in their education. This includes your usage of apps usually downloaded from Appstore/google play but also your usage of websites on your phone/computer (known as web apps). This means that it could be simple thing like a study group on social media such as facebook to a very specific app for calculating advanced math or just a simple drawing app to help you express yourself better in your educational work and so on. \n\nThe survey consists of 20 questions and takes around 5-10 minutes to finish. \n\nYour opinion is very important to us and your choices matter for creating a better future for all students!  \n\nYour identity will remain anonymous.   \n\nLink: [https://forms.gle/fkKcrCpCE7aC1iPj6](https://forms.gle/fkKcrCpCE7aC1iPj6)",
        "created_utc": 1671986409,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thank god this isn’t in the tort final",
        "author": "Cougarismybrother",
        "url": "https://v.redd.it/ybz8c9w7fz7a1",
        "text": "",
        "created_utc": 1671984275,
        "upvote_ratio": 1.0
    },
    {
        "title": "C in Legal Writing",
        "author": "LivingSingleMaxine96",
        "url": "https://www.reddit.com/r/LawSchool/comments/zuzsau/c_in_legal_writing/",
        "text": "I feel like even though it was 2 credit hours, my GPA will suffer. I don’t know how to come back from this. I’m shocked because I got a C on my first memo and so I doubled down worked harder, even got accommodations and I had great feedback. I am lost and can’t apply to job applications with this writing sample. \n\nAm I doomed? How bad is this and what should I do for next semester when I walked away from this one feeling great?",
        "created_utc": 1671980919,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s with these law students doing law out of spite?",
        "author": "RiPiLiQi",
        "url": "https://www.reddit.com/r/LawSchool/comments/zuyphm/whats_with_these_law_students_doing_law_out_of/",
        "text": "",
        "created_utc": 1671977091,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the most interesting thing you’ve read from a law book?",
        "author": "RiPiLiQi",
        "url": "https://www.reddit.com/r/LawSchool/comments/zuvt53/whats_the_most_interesting_thing_youve_read_from/",
        "text": "",
        "created_utc": 1671964943,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good nonfiction legal books that aren't overly academic or dense? Looking for some suggestions for the break.",
        "author": "throwawaygagagaga",
        "url": "https://www.reddit.com/r/LawSchool/comments/zumqqs/good_nonfiction_legal_books_that_arent_overly/",
        "text": "",
        "created_utc": 1671928472,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone spending Christmas alone?",
        "author": "deepintoabyss",
        "url": "https://www.reddit.com/r/LawSchool/comments/zukyjr/anyone_spending_christmas_alone/",
        "text": "Phone calls with parents quickly turn into shouting matches.\n\nSo sad.",
        "created_utc": 1671922668,
        "upvote_ratio": 1.0
    },
    {
        "title": "can you rsvp to &amp; attend multiple 1l holiday receptions that happen in similar timeframes on the same day, or do you have to pick one and stay the whole time?",
        "author": "Competitive-Swim8507",
        "url": "https://www.reddit.com/r/LawSchool/comments/zukglb/can_you_rsvp_to_attend_multiple_1l_holiday/",
        "text": "",
        "created_utc": 1671921065,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hot Take: Rankings are B.S. anyway so who cares which schools drop out or not?",
        "author": "anonymouspwrson10002",
        "url": "https://www.reddit.com/r/LawSchool/comments/zujyn9/hot_take_rankings_are_bs_anyway_so_who_cares/",
        "text": "\nWell, well. Here we are towards the end of 2022 and most of the prestigious law schools have finally opted out of reporting data to U.S. News Rankings. Law Schools claim the reason for this is that rankings put too much emphasis on encouraging merit-based scholarships, GPA/LSATs, school expenditures and not enough focus on prioritizing students who demonstrate financial need or have an intent to pursue a career in P.I. They are certainly justified in these positions but let's be real about this. Does anyone REALLY value the rankings that much anyway? Or better yet, even if they do, should they?\n\nI know what you are thinking: Of course people should value the rankings because the rankings means students have a greater shot at BL/Federal Clerkships. Sure, on average that is true.But actually that is not the full story. And, is it the rankings themselves that confer these outcomes or the schools?\n\nLet me give you an example. One that is statistically relevant: Some of the higher ranked schools DON'T EVEN have superior employment outcomes than their lower-ranked counterparts. Take a look at Fordham Law. It is ranked #37, yet a whopping 38% of its graduates end up in BL (firms with 500+ associates). Meanwhile, 36% of students at WashU Law (ranked #16) end up in BL. \n\nBut thats not the only example. 20% of St. John's Law (ranked #84) end up in BL, while 18% of Cardozo Law (ranked #52) grads end up in BL. 8.6% of Pepperdine Law (also ranked #52) grads go into big law. Countless examples of this exist. Perhaps the most extreme example, Only 6.4% of ASU grads get into BL, and it is ranked #30!\n\nWhy this discrepancy? Sure there are other factors that go into these rankings, but as prospective lawyers we all value this one the most. In addition, bar passage rates account for only 3% of these rankings!\n\nThere are plenty of other reasons to hate on the rankings and I am not going to sit here and say they don't have any value. That being said, it seems as if the prestige of these rankings comes from the perception of rankings themselves, and not always the outcomes and value of said schools.\n\nTL;DR: The rankings aren't everything so don't focus too much on them or the news of schools dropping out. Do your own reserach based on your career ambitions, and the let the rest play itself out. That is my rant. Happy Holidays and to a successful admissions cycle everyone!",
        "created_utc": 1671919512,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going from Part time law school to Big law",
        "author": "throwaway97890642",
        "url": "https://www.reddit.com/r/LawSchool/comments/zujb1n/going_from_part_time_law_school_to_big_law/",
        "text": "Anyone on this sub going to law school part time and planning to change careers and go into Big Law after law school? I never really hear any stories about this.",
        "created_utc": 1671917526,
        "upvote_ratio": 1.0
    },
    {
        "title": "JD+CPA+CFA",
        "author": "Possible-Nectarine58",
        "url": "https://www.reddit.com/r/LawSchool/comments/zuj3c6/jdcpacfa/",
        "text": "Just out of curiousity, do you guys think getting CFA (Chartered Financial Analyst) during law school is worth it? I am now CFA lv2 and has 3+ years of WE as a CPA, and attending T6, but do not have any experience in finance sector. \n\nSince OCI happens next year, I will not be a CFA by then. What would be the impression of you meeting someone at work who is a lawyer/CPA and CFA?",
        "created_utc": 1671916880,
        "upvote_ratio": 1.0
    },
    {
        "title": "Supreme Court Humor: \"Someone's got to be first, right?\"",
        "author": "scotusreacts",
        "url": "https://youtube.com/watch?v=GsNmcmrdEWE&amp;feature=share",
        "text": "",
        "created_utc": 1671915498,
        "upvote_ratio": 1.0
    },
    {
        "title": "1-Hell Midterms/Review",
        "author": "ALegal-IllEagle",
        "url": "https://www.reddit.com/r/LawSchool/comments/zuii8e/1hell_midtermsreview/",
        "text": "What a.. ride.\n\nFunny enough, the two classes I though to be most boring turned out to be the two I felt best about for exams, there was a method to the madness (Constitution and Legislation).\n\nTorts, which I loved, managed to wrap my brain around a wire during the exam and I’m just hoping it turns out on the curve.\n\nCrime, barely touched the second of two questions (worth 50%) Most miserable I’ve felt after an exam. Honestly terrified it’s fail worthy considering, sounds like a reasonable amount of other students got stuff out for it. Just got too sucked into the first question.\n\nOverall, 1L is what you’d expect. Lots of reading, lots of compiling, lots of learning. I did my condensing and practice exams quite early, comparatively, and honestly felt reasonably comfortable for all my exams. Really only Crime I’m fearing for my life, other than that I’m hoping to have atleast hit the curve - I think the early practicing perhaps helped? To be determined mid January. \n\n5 midterms and a final in 10 days is fucked no matter which way ya slice it and thought that part was ridiculous, but overall thoughts, eh it’s law school. Worked full time through the semester, and found a way to remain sane (depends who you ask I suppose haha). \n\nHere’s to praying for a blessed B wave for all!",
        "created_utc": 1671915113,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hopeful encouragement from a formerly super anxious 1L",
        "author": "creed-bratton-esq",
        "url": "https://www.reddit.com/r/LawSchool/comments/zui1km/hopeful_encouragement_from_a_formerly_super/",
        "text": "I’ve seen a lot of posts on here about bad first semester grades, ability to bounce back, and general anxiety so I thought I’d try to share a little encouragement, especially to the 1Ls. I’m currently a 3L at a T20 for reference. \n\nLike many of you I entered law school pretty confident in my academic abilities but still unsure of what to expect with grades. I had never gotten “bad” grades my entire life and always did well in school.  Then came 1L. \n\nI had a fairly turbulent first semester. I was married (still am thankfully) with a 2 year old. The pressure of law school put a lot of stress on our marriage. My step dad also unexpectedly died weeks before finals started so I had to fly home to finish up the semester/finals (thankfully we were hybrid). \n\nFast forward a few weeks after finals and my wife and I were driving back home for the holidays. I got a message from our section Groupme that our first grade (property) was posted. I quickly checked my grade. It was a B-. Our curve is a B+ so this was well below the median. Emotions flooded my mind. I’m a grown man but felt like I could cry. I felt like a failure to myself and my family. Was law school a mistake? Did I drag my family down a fruitless path?\n\nThankfully my wife is incredibly supportive and tried to cheer me up. My other grades took another 2 weeks to come in (which was pretty agonizing) and thankfully my other grades pulled me up to a B+ (3.30) average. \n\nThe next semester I knew I had to change things up. I got a 3.85 the next semester and a 4.0 after that. I also got onto law review (pretty sure by writing on). I posted my new approach to law school [here](https://www.reddit.com/r/LawSchool/comments/o6k6zg/33_to_385_gpa_increase_at_a_t20/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf). \n\nI ended up getting a BL offer at my top choice (firm, geographic location, etc.). \n\nWe now have a second child, and I’m happily coasting through 3L. \n\nPoint is, law school is mad stressful, but it doesn’t necessarily all come down to one semester. It’s nuts how much stress and pressure there is, especially in the first year, but there’s still time to stay positive and make changes if things don’t initially go your way. \n\nI hope this helps give some encouragement, and I’m happy to chat with anyone more.",
        "created_utc": 1671913698,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any good books/materials on internal investigations?",
        "author": "js001232",
        "url": "https://www.reddit.com/r/LawSchool/comments/zuhv3f/any_good_booksmaterials_on_internal_investigations/",
        "text": "I’m interested in seeing if I want to pursue this path after law school and would love any materials (outside, of course, talking to attorneys in this field).",
        "created_utc": 1671913160,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anxiety and Fear of Exam Failure Screwing with Break",
        "author": "Biglawslut",
        "url": "https://www.reddit.com/r/LawSchool/comments/zuh1qx/anxiety_and_fear_of_exam_failure_screwing_with/",
        "text": "I have some things I need to get off my chest because they're preventing me from fully enjoying this break. While I've always had *some* stress over life events, college grades, law school apps, and all the rest, I've never had such persistent anxiety issues until now, as a 1L. \n\nI felt at least okay on 2 of my exams, but for the third one, I wouldn't be surprised if I bombed it. It was (in my opinion) a difficult 8-hour take home, and we never got comparable practice exams; in any case, my time management sucked, I felt rushed, missed issues, and straight up didn't get to a question worth 6-7% of the exam. I talked to my (very intelligent) section friend about it, and he did substantially better. \n\nMy worst fear isn't employment-related (though it's a close second); I'm fortunate to be at a good enough school where I can probably land *something* even with non-stellar grades. But I'm even more worried about becoming the outsider looking in, i.e. underperforming and falling behind while my friends experience success, go on to do law review, etc. I know it's stupid and irrational, but my brain does what it does. \n\nI would be lying if I said all this anxiety hasn't permeated my break. It definitely has. And at times I feel like I can't control it. Even when I distract myself with other activities and try to enjoy the time off, it's still sort of there, radiating in the background, with varying intensity.",
        "created_utc": 1671910698,
        "upvote_ratio": 1.0
    },
    {
        "title": "I realized about halfway into my application process that I forgot to include a job I held for only a couple of months a few years ago. Do I need to contact the admissions committees of each school I’ve already applied to in order to update this information?",
        "author": "tired-dreams",
        "url": "https://www.reddit.com/r/LawSchool/comments/zugxd2/i_realized_about_halfway_into_my_application/",
        "text": "Will this affect the bar’s review of my application? (posting this for a friend)",
        "created_utc": 1671910322,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is displaying a top grade award cringe?",
        "author": "Rude-Telephone2802",
        "url": "https://www.reddit.com/r/LawSchool/comments/zufhtd/is_displaying_a_top_grade_award_cringe/",
        "text": "I know this literally doesn’t matter at all, but I have found the top grade award discussion of what is taboo and what is not hard to navigate. Our school prints out certificates out in a diploma size to be framed, is it weird to frame it and display that is an office/future place of employment or too much? Thanks!!",
        "created_utc": 1671906128,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible for a student with a Master of Law diploma to work in another country for example the USA?",
        "author": "IceCloud69",
        "url": "https://www.reddit.com/r/LawSchool/comments/zudz63/is_it_possible_for_a_student_with_a_master_of_law/",
        "text": "",
        "created_utc": 1671901653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone please tell me that everyone in my section is probably not as smart as I think they are?",
        "author": "saantiaago",
        "url": "https://www.reddit.com/r/LawSchool/comments/zudikn/can_someone_please_tell_me_that_everyone_in_my/",
        "text": "All these people in my section keep going on and on about how everyone in my section is a genius and how our curve is “screwed” …I really don’t want to believe it but everyone is so self righteous and pretentious that it’s starting to get to me too",
        "created_utc": 1671900295,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dress code/work attire expectation for articling students, in-house financial institution downtown Toronto (female)",
        "author": "Mean_Locksmith_3196",
        "url": "https://www.reddit.com/r/LawSchool/comments/zucvrw/dress_codework_attire_expectation_for_articling/",
        "text": "I'm going to be articling at one of the big banks downtown Toronto, starting in January, and I need advice about what I should have in my wardrobe. I've never worked in this type of setting before so I'm starting from scratch. I know that it will be \"business attire\" but I need some concrete examples of what that means for females. Does that mean I can wear dresses, if so what is an appropriate style and length, what kind of shoes should I buy, what kind of tops and pants do I need? Should I wear jewellery? What hair styles are appropriate? \n\nI'm totally overwhelmed and I don't even know where to start. If anyone has tips or has worked in this type of setting before and can suggest a few \"must haves/go-to\" looks I would really appreciate it. Also, since it's winter and I will be taking TTC what is the expectation regarding footwear? Is it okay for me to wear boots and then switch shoes when I get to the office? Sorry if these are dumb questions and TIA for the help.",
        "created_utc": 1671898350,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alternative Routes to Success Other Than Top Grades",
        "author": "OddDuck007",
        "url": "https://www.reddit.com/r/LawSchool/comments/zucpeb/alternative_routes_to_success_other_than_top/",
        "text": "I see so much angst over grades in this community.  I get it.  I was once a 1L and disappointed by my first semester grades.  I didn't graduate at the top of my class, although I did go to one of the T-14 schools.  However, as a law professor for many years and reflecting on my own career, I have learned there are many routes to success besides top grades.  \n\nFor me it was through \"writing onto\" an *International Law Journal*, where I worked extremely hard, published my note and was Editor-in-Chief.  I learned I love scholarly and professional writing, and so as an attorney I kept publishing in local bar journals, in a nationally recognized Tax Law Journal, for major Tax publications, and even a local newspaper column.  Later, in my career, I was told I got an academic position because my boss believed I could get tenure through publication (which I did).\n\nBut there are many routes to success.  I have observed the success of graduates from clinics (one of the best things you can do).  I have seen the networking and skill that trial court and moot court competitions gives (often coaches are adjunct professors with connections to the bar in the local community).  Negotiating competitions can be another way.  Some succeed by going into law librarianship (a well kept secret--that was my route).  Others find legal technology.\n\nWhat I am saying is look around you at the programs your school offers.  You may find that you fit into them quite well.  Maybe you are like me and have a talent for writing.   Whatever resonates with you--use it, and you will find your way to success, despite not having the grades you want.",
        "created_utc": 1671897801,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trust Fraud?",
        "author": "throwaway4563269",
        "url": "https://www.reddit.com/r/LawSchool/comments/zuchct/trust_fraud/",
        "text": "Hello Smart People, \n\nBasically me and my family need my advice. My uncle died few years back with approx 500k in a trust with beneficiaries of me my dad and a few charities. Basically my dad the trustee wants to fully ignore the charities like the trust says and basically keep the money for himself. How much trouble would we get in if we were to do this.",
        "created_utc": 1671897117,
        "upvote_ratio": 1.0
    },
    {
        "title": "Santa gave me an A+ in Tax",
        "author": "MlLFTANK",
        "url": "https://www.reddit.com/r/LawSchool/comments/zuc9fg/santa_gave_me_an_a_in_tax/",
        "text": "I’ve never gotten higher than an A- in a class before.  It’s a Christmas miracle!",
        "created_utc": 1671896422,
        "upvote_ratio": 1.0
    },
    {
        "title": "MPRE prep?",
        "author": "InformationDouble273",
        "url": "https://www.reddit.com/r/LawSchool/comments/zubua8/mpre_prep/",
        "text": "Which prep courses would you recommend for taking the MPRE?",
        "created_utc": 1671895114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Business Law - Free Online Course",
        "author": "MDLearning",
        "url": "https://www.reddit.com/r/LawSchool/comments/zubh3p/business_law_free_online_course/",
        "text": "Free online course\n\nBusiness Law\n\nThis course will introduce you to the laws and ethical standards that managers must abide by in the course of conducting business.\n\n[https://formationgratuite.net/Business-Law/](https://formationgratuite.net/Business-Law/)",
        "created_utc": 1671893989,
        "upvote_ratio": 1.0
    },
    {
        "title": "does anyone know whether i should take a level law and which is the best uni to go to after my alevels or law?",
        "author": "Traditional_Ant_7091",
        "url": "https://www.reddit.com/r/LawSchool/comments/zu7592/does_anyone_know_whether_i_should_take_a_level/",
        "text": "",
        "created_utc": 1671877404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Losing friends",
        "author": "Fosheezy2",
        "url": "https://www.reddit.com/r/LawSchool/comments/zu6g16/losing_friends/",
        "text": "Hi all , not sure if this is just a me thing so I wanted to post.\n\nWith the holiday szn upon us there is lots of time to reflect. I look back at my first semester and I fear that it is killing friendships I have outside of school.\n\nIk the workload is necessary but it just makes me sad. I recently turned 28 and I moved from NYC to philly for school. \n\nI went back to NYC for a weekend right after finals and got a lot of people together. It was amazing but I fear it is one of those things that will become less and less eventful as I have friends moving out of the city, getting into serious relationships, etc. \n\nI have plenty of friends in Philly and used to visit them frequently. However now that I live here it feels like most of us are in different places and it’s harder to relate than it was before.\n\nI’ve always been an affable guy and haven’t had issues making friends, but it makes me genuinely sad to see myself losing touch w friends and there isn’t much I can do about it. \n\nI feel like for months out of the year I can’t make myself available to hang out and by the time I do ppl I’m missing out on people living the last of their single lives or the lives  lived before I started school.\n\nI know I sound whiny, but maybe it’s the holidays or also that starting law school at 27 is a challenging age.\n\nIdk just needed to vent!",
        "created_utc": 1671874327,
        "upvote_ratio": 1.0
    },
    {
        "title": "CS50 for lawyers",
        "author": "Gutz___",
        "url": "https://www.reddit.com/r/LawSchool/comments/zu4thi/cs50_for_lawyers/",
        "text": "Hey redditors, \nHow's CS50 for lawyers - Harvard, has anyone done the course and did it helped you professionally?",
        "created_utc": 1671867675,
        "upvote_ratio": 1.0
    },
    {
        "title": "2L job search with bad grades",
        "author": "peanutbutternjellie",
        "url": "https://www.reddit.com/r/LawSchool/comments/zu4eab/2l_job_search_with_bad_grades/",
        "text": "Title says it all. Fall 2L was not kind to me, and I’m stressing out about how I wasn’t able to find a summer job in the fall and now it’s going to be even harder with another semester of shit… any tips are appreciated! (And this is not me being humble, I swear lmao)",
        "created_utc": 1671866001,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clerkships",
        "author": "Spiritual-Research18",
        "url": "https://www.reddit.com/r/LawSchool/comments/zu32l2/clerkships/",
        "text": "What should I do now as a 1L if my goal is to get a clerkship at one of the top courts in Canada. Which courses do I take or extracurriculars? What are they looking for? Any advice is welcome!!",
        "created_utc": 1671861025,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much does your graduation GPA matter after 3 years vs just your 1L GPA?",
        "author": "anonymouspwrson10002",
        "url": "https://www.reddit.com/r/LawSchool/comments/zu2y9o/how_much_does_your_graduation_gpa_matter_after_3/",
        "text": "",
        "created_utc": 1671860603,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you recommend Any useful books that brief major cases and have helped you for exams /in class?",
        "author": "anonymouspwrson10002",
        "url": "https://www.reddit.com/r/LawSchool/comments/zu2x2h/do_you_recommend_any_useful_books_that_brief/",
        "text": "",
        "created_utc": 1671860474,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any insight into Spivey Consulting or Angela Vorpahl for Pre-1L prep?",
        "author": "anonymouspwrson10002",
        "url": "https://www.reddit.com/r/LawSchool/comments/zu2m72/any_insight_into_spivey_consulting_or_angela/",
        "text": "Were they worth it? What was the cost like? Benefits/Drawbacks?",
        "created_utc": 1671859380,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on letting go of grades?",
        "author": "Rude-Cup-5185",
        "url": "https://www.reddit.com/r/LawSchool/comments/zu2i6e/advice_on_letting_go_of_grades/",
        "text": "[removed]",
        "created_utc": 1671858995,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L Diversity Summer Positions",
        "author": "1Lburner25",
        "url": "https://www.reddit.com/r/LawSchool/comments/zu0v5k/1l_diversity_summer_positions/",
        "text": "[removed]",
        "created_utc": 1671853426,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L Diversity Summer Positions",
        "author": "1Lburner25",
        "url": "https://www.reddit.com/r/LawSchool/comments/zu0bqy/1l_diversity_summer_positions/",
        "text": "[removed]",
        "created_utc": 1671851693,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the etiquette of reaching out to a recruiter about potentially unlisted jobs?",
        "author": "throwawayobvs33",
        "url": "https://www.reddit.com/r/LawSchool/comments/zu08bl/whats_the_etiquette_of_reaching_out_to_a/",
        "text": "I went to a mixer at a large firm in NYC and really hit it off with the manager of their recruiting and professional development team. But they don’t have any 1L SA positions posted anywhere. I wanted to know if it was bad etiquette to reach out and ask if they had any positions and if not, if I should reach out via email or Linkedin (where we’ve already connected)",
        "created_utc": 1671851389,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would any upperclassmen be willing to take a look at my resume for a 1L SA posiitoin?",
        "author": "Comfortable-Ninja508",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztzlsw/would_any_upperclassmen_be_willing_to_take_a_look/",
        "text": "My school's OCS was so backed up (and now closed) that I never got the chance to get my resume looked at bc I prioritized studying for finals :/ Looking to get in apps over the break so wondering if anyone who was successful in landing one of these positions wouldn't mind taking a look for me?",
        "created_utc": 1671849396,
        "upvote_ratio": 1.0
    },
    {
        "title": "What about mercy for a young mother who freaked out looking for her kids at Miami Airport before her Christmas flight after airport staff failed to help and maybe she just saw too many Walmart freakout videos here?",
        "author": "doxie10",
        "url": "https://www.local10.com/news/local/2022/12/21/mother-asking-for-help-to-find-kids-at-miami-airport-injures-airline-employee-police-say/",
        "text": "",
        "created_utc": 1671848803,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parents in Law School: Advice Needed",
        "author": "chaotic_quixotic",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztzbx1/parents_in_law_school_advice_needed/",
        "text": "I'll be a 1L next fall at a T50. My child will be 17 months by the time I start. I plan to have my son in daycare at the start of May. I have to work remotely for 10 hours/week during law school as my job is footing the tuition/will still pay full-time salary, but I get to make my own hours. My husband is active duty. I do not have family support here; friends can maybe help out here and there, but not relying on that. My mother only agreed to come help during the summer after 1L if I get an internship.\n\nI'm starting to worry on the feasibility of all this because I found out that kids apparently get sick A LOT during their first year in daycare? I'm relying on daycare so that I can attend my classes and do the readings/study (it's a full-time program). But if he will constantly get sick and requires home stay, then it's kind of like he's not even in daycare. **Are there any parents that currently have or had little ones in daycare while in law school? Were you able to rely on daycare while attending law school? For how many days did you have them in daycare?** I heard kids particularly get sick a lot - hand-foot mouth, RSV, flu - during the fall-winter months, which is a super important time for finals.\n\nRight now, my husband is in a special duty position where he runs the office without leadership supervision, so he can do as he please (like pick up and look after our son in the office if there's an emergency), but that position will end in February 2024. He then will most likely get deployed that spring, so it'll only be me for at least 6 months while he's away.\n\nI searched a bit for similar posts but couldn't find too many on advice with this. How much could you rely on daycare to be able to do what you have to do for law school? This is my main concern; I plan to hire a housekeeper to help clean/cook once a week for the other responsibilities.",
        "created_utc": 1671848527,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parents in Law School: Advice Needed",
        "author": "chaotic_quixotic",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztzb8c/parents_in_law_school_advice_needed/",
        "text": "I'll be a 1L next fall at a T50. My child will be 17 months by the time I start. I plan to have my son in daycare at the start of May. I have to work remotely for 10 hours/week during law school as my job is footing the tuition/will still pay full-time salary, but I get to make my own hours. My husband is active duty. I do not have family support here; friends can maybe help out here and there, but not relying on that. My mother only agreed to come help during the summer after 1L if I get an internship. \n\nI'm starting to worry on the feasibility of all this because I found out that kids apparently get sick A LOT during their first year in daycare? I'm relying on daycare so that I can attend my classes and do the readings/study (it's a full-time program). But if he will constantly get sick and requires home stay, then it's kind of like he's not even in daycare. **Are there any parents that currently have or had little ones in daycare while in law school? Were you able to rely on daycare while attending law school? For how many days did you have them in daycare?** I heard kids particularly get sick a lot - hand-foot mouth, RSV, flu - during the fall-winter months, which is a super important time for finals. \n\nRight now, my husband is in a special duty position where he runs the office without leadership supervision, so he can do as he please (like pick up and look after our son in the office if there's an emergency), but that position will end in February 2024. He then will most likely get deployed that spring, so it'll only be me for at least 6 months while he's away. \n\nI searched a bit for similar posts but couldn't find too many on advice with this. How much could you rely on daycare to be able to do what you have to do for law school? This is my main concern; I plan to hire a housekeeper to help clean/cook once a week for the other responsibilities.",
        "created_utc": 1671848465,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got my first A of law school (2L)! (Message to 1Ls; see below)",
        "author": "softball1298",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztxsd0/i_got_my_first_a_of_law_school_2l_message_to_1ls/",
        "text": "I got my first A of law school, in my favorite class of this past semester. I’m not the type to talk about grades with my law school friends, but needed to share with someone, so here I am. \n\nTO 1LS ABOUT TO GET THEIR FIRST LAW SCHOOL GRADES: I know you’ve all heard this a billion of times, but your. grades. do. not. define. you. I went all of 1L without getting an A (a few A- here and there), but I got a rewarding and meaningful 1L summer position and am working BL next summer. Do not be too hard on yourself. Seriously.",
        "created_utc": 1671843806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do we get loan refunds for both spring too?",
        "author": "fuckboybebop",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztxbk6/do_we_get_loan_refunds_for_both_spring_too/",
        "text": "My student aid came with a loan refund for fall semester. Was wondering if I get the same thing at beginning of spring semester as well. Thanks 😘",
        "created_utc": 1671842414,
        "upvote_ratio": 1.0
    },
    {
        "title": "Patent attorney with BS in Biology?",
        "author": "Charlied211",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztwyw2/patent_attorney_with_bs_in_biology/",
        "text": "I’m curious— I have my BS in biology (thought I was gonna be a physician) and I now am graduated from a T100 law school in the top 5% of my class. \n\nI’m interested in patent law but saw a lot of positions request a PhD in biology/engineering to enter the field. Is this true? Wondering if it’d not be worth it to pursue further. Thanks in advance for any insight!",
        "created_utc": 1671841373,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know where to find these books as a free pdf online?",
        "author": "MidnightFit5450",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztwlvx/does_anyone_know_where_to_find_these_books_as_a/",
        "text": "PROPERTY LAW: Rules, Policies, and Practices, 8th Edition ISBN: 9781543838534\n\nCIVIL PROCEDURE, A Modern Approach (American Casebook Series) 7th Edition ISBN: 9781640201859\n\nFEDERAL CIVIL RULES SUPPLEMENT 2022-2023 ISBN: 9781636599298\n\nADVOCATE PERSUADES, 2nd Edition ISBN: 9781531019105\n\nThank you in advance (:",
        "created_utc": 1671840329,
        "upvote_ratio": 1.0
    },
    {
        "title": "Congress revises Electoral Count Act that Trump used to pressure Pence on Jan. 6",
        "author": "BrightEconomics",
        "url": "https://www.usatoday.com/story/news/politics/elections/2022/12/23/electoral-count-act-jan-6-congress-trump-biden/10949465002/",
        "text": "Is this enough to prevent another Jan. 6 situation?",
        "created_utc": 1671839058,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the consensus on adding class rank to your resume?",
        "author": "played-myself",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztuubd/whats_the_consensus_on_adding_class_rank_to_your/",
        "text": "(I’m on a trimester system so I already have grades back since I ended my first term earlier than most.)\n\nThe school put out class rankings today and I’m between major percentage groups (top 23%), so I was wondering if it’s generally accepted to put something like “GPA: 3.XX (Class Rank: 23/100)” on my resume for when I start applying to internships.",
        "created_utc": 1671835423,
        "upvote_ratio": 1.0
    },
    {
        "title": "Xmas gift to the job searchers: I will review your cover letter and advise",
        "author": "Apprehensive-Theme38",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztub0g/xmas_gift_to_the_job_searchers_i_will_review_your/",
        "text": "I have applied to and gotten summer offers for private firms, federal and state government roles, nonprofit, and clerkships. (I cast a broad net, especially for my 1L summer lol) Please email me at katlake57@gmail.com if you’d like a second pair of eyes and my advice.",
        "created_utc": 1671833932,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L grade results....",
        "author": "dont-get",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztu7js/1l_grade_results/",
        "text": "T30. \n\n4 As.... and one A-.... two awards for highest scores the class. What should i do next summer lol",
        "created_utc": 1671833694,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L SA diversity positions",
        "author": "thrwnaway948474272",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztswwi/1l_sa_diversity_positions/",
        "text": "is there a centralized place online that lists all available diversity BL opportunities? is this the same thing as the LCLD 1L Scholars page?",
        "created_utc": 1671830330,
        "upvote_ratio": 1.0
    },
    {
        "title": "The search function and your refusal to use it",
        "author": "1st_time_caller_",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztsaej/the_search_function_and_your_refusal_to_use_it/",
        "text": "Please. I am begging here. I too am a 1L very stressed about my impending grades but can we PLEASE just search, or even scroll through previous posts before adding an identical one. \n\nThere are several posts every day asking variations of the exact same question: “my school curves to X, my GPA is Y, where do I fall in my class rank?”.\n\nBaby. Darling. Sweetheart. \n\nThe answer is we don’t know. \n\nThe posts rarely have enough information for anyone to even guess. Babes, if YOU attend the school, have access to the intranet, student life, the handbook etc. and YOU cannot figure it out…what do you want the other stressed out strangers on this sub to do?\n\nThis sounds so much snarkier than I want it to be but please. I am so tired. School was/is so stressful these posts are not even helpful and half of them are just humblebrags.  Love- if you have two A+’s and an A you are top of any class. You are good on any MLK Blvd you are GOOD. \n\nThis is my humble request.",
        "created_utc": 1671828632,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice? Recent grad looking to pursue nontraditional options",
        "author": "uhmmmm_hi",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztrsic/advice_recent_grad_looking_to_pursue/",
        "text": "Hey everyone,\n\nLike the title says, I recently graduated law school and am in a bit of a weird place. I took the bar this past July and didn't do so great, and honestly I've thought of just pursuing a different direction. \n\nFor context, I was a finance major in undergrad so I've considered entering that sphere in a \"JD-advantage\" type of role if possible. But I'm leaning towards legal consulting. Does anyone have any experience with this situation in general or know what employers look for in a legal consultant role? Any insight would be helpful and appreciated.",
        "created_utc": 1671827296,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Supreme Court Decisions and Worst Supreme Court Decisions of all time?",
        "author": "ZebraEducational137",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztrq99/best_supreme_court_decisions_and_worst_supreme/",
        "text": "",
        "created_utc": 1671827122,
        "upvote_ratio": 1.0
    },
    {
        "title": "Watching you guys discuss grades",
        "author": "Secure-Bluebird57",
        "url": "https://i.redd.it/kz90e13xwq7a1.jpg",
        "text": "Our fall grades usually come back first week of spring semester and the wait is killer",
        "created_utc": 1671825958,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling lost on Job Apps",
        "author": "Thevulgarcommander",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztqo5h/feeling_lost_on_job_apps/",
        "text": "Hey all, hope y'all are enjoying your break!\n\nI'm feeling a little lost on what I should be doing now in regards to job searching for the summer. I'm not sure what kind of law firm I should be applying to. One that's in a field I may want to practice? Or one that will make me write a lot to get that sort of experience in? \n\nIs there a practical difference through getting a job by searching online/ through my CDO or by just working for a family friend's firm/a networking connection?\n\nI guess I'm also just trying to understand how to approach the whole process as I'm sure there are things I probably don't even know I don't know. Any guidance on this would be greatly appreciated.",
        "created_utc": 1671824329,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there an upside to only having one exam?",
        "author": "Jasmotron3k",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztqmrf/is_there_an_upside_to_only_having_one_exam/",
        "text": "I’m a 1L and I go to a tier one school. All semester, my friends at other schools had midterms, papers, quizzes, little assignments, etc., but aside from legal writing, I’ve had nothing to check in and see how I’m doing. I nail all the cold calls but aside from that and whatever I can glean from interactions with my professor and practice exams, I have had no idea how I’ve been doing all semester. I felt good, but my whole grade for every doctrinal rides on the final. It feels really cruel to do things that way. \n\nSo I guess, for some insight and perspective, is there an upside to grading his way? Aside from not having extra stuff to do during the semester? Or is this just a “welcome to law school, chump” situation and I need to just suck it up and accept that it sucks as much as it seems?",
        "created_utc": 1671824228,
        "upvote_ratio": 1.0
    },
    {
        "title": "So beyond terrified about final grades",
        "author": "beaprior",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztqarm/so_beyond_terrified_about_final_grades/",
        "text": "I've been performing slightly below average since I got to law school- I did okay on a couple legal writing memos but I also got one of the lower (not lowest) scores on two midterms (that didn't actually count as grades, just an opportunity to gauge where you are.) I've gone to the academic support offices to see where I can improve. I really really invested into my finals. I put tons of hours into studying, creating outlines, reading supplements, etc and I feel like I really knew the material for the three doctrinal finals I did have. \n\nThe problem is that I'm fearful that I poorly articulated my answers, especially under stress (which is where I lose points on midterms... thin analysis) I practiced writing and articulation before my exams but the more I think, the more I think my analysis may have been weak).  \n\n&amp;#x200B;\n\nAnyways...\n\n&amp;#x200B;\n\nI'm living my dream. I actually really do love law school, I have great friends, I enjoy learning because I grew up in really poor, underfunded learning environments and I really am just following this life long dream. I'm terrified of it being cut short. I am so scared grades are going to come back and it's going to be bad. I would love any advice anyone has on how to manage this stress of waiting, It's truly paralyzing. I do feel like I need to give myself more credit because I think there is a difference between a midterm where I partially knew the content vs. a final where I feel confident that I knew the material, but right now I'm feeling like I'm toast.",
        "created_utc": 1671823357,
        "upvote_ratio": 1.0
    },
    {
        "title": "Supreme Court Humor: \"We should use that word in our opinion\"",
        "author": "scotusreacts",
        "url": "https://youtube.com/watch?v=_CrREUoMfo8&amp;feature=share",
        "text": "",
        "created_utc": 1671820016,
        "upvote_ratio": 1.0
    },
    {
        "title": "Induction Request at 39 weeks if my due date is 3 days away.",
        "author": "Many-Assignment8533",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztox76/induction_request_at_39_weeks_if_my_due_date_is_3/",
        "text": "Can I request a labor induction while having a cold and does the hospital have the right to turn away my request?\nThis is my first pregnancy, I have never dealt with a cold during pregnancy. I’ve had this cold for over a week and it seems to be getting worse. I tested positive for rhinovirus. I have a cough that is constant and does not allow me to have a proper sleep. I’m going on my second week today exhausted from not being able to sleep and My ribs are sore from so much coughing. It’s gotten to a point where I cough so much that I end up throwing up food that I had ate moments ago. I’ve only been able to succeed 3 hours of sleep and that is with coughing in between. I’m afraid that I am hurting my ribs, and straining my body. And it is very hard to breath. When I went to the hospital to get tested they said I have a high pulse pressure. The hospital checked my baby and said the baby is healthy and unaffected by my cold. But I fear that I may have complications delivering the longer I wait. I feel that the reason I have not gotten better from this cold is due to my immune system because I am pregnant. I’m getting very stressed that my hospital won’t do a labor induction upon my request. For my cold I have been using Tylenol, Flonas, Halls, and rubbing vicks. The hospital also prescribed me Benadryl. I have a medical history of psoriasis caused my by immune system. I’m afraid of taking too many pills at once like the hospital wanted me to while pregnant. I’ve tried home remedies as well but no help. This is the first time that I have not been able to fight off my sickness fast. I just keep getting symptoms after symptoms and I feel like part of the reason why I’m getting worse is because my body cannot rest with the constant coughing. When I cough now I can feel a lot of pressure on my head and it causes me to have a headache. I tried asking the hospital to induce me and they said they only induce if it’s a medical reason or something like that. But I feel this is one. Even though they said my baby is unaffected and healthy, I am not. I need the strength to be able to deliver and im afraid the longer I wait till im due, the more weaker im going to be. Someone please tell me if I have a right to get induced when I want to. My due date is Dec. 26. I really want to get induced today if I can. Someone please help me find my rights.",
        "created_utc": 1671819726,
        "upvote_ratio": 0.5
    },
    {
        "title": "Big Law doomed?",
        "author": "royalspecter",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztoro9/big_law_doomed/",
        "text": "If I get in the bottom half or bottom for all three of my first semester classes at a T10 school, and then I get towards the top or top of my classes for next semester, am I doomed for a 2L summer big law associate job? Not sure if I’d have to explain or if it would help that I dealt with significant medical issues this semester.",
        "created_utc": 1671819332,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mom of two , 10yr boy and 4 yr girl. Filing for divorce. Could I lease a 2 bed 2 bath? To show the court I have a home for me and my kids? Or do I need a 3 bed 2 bath? Meditation\\finalizing divorce would be mid February 2023.",
        "author": "NoahJakecryben",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztoee2/mom_of_two_10yr_boy_and_4_yr_girl_filing_for/",
        "text": "[removed]",
        "created_utc": 1671818407,
        "upvote_ratio": 1.0
    },
    {
        "title": "applying to 1L SA positions w/ no grades",
        "author": "Humble_Duck_316",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztnzz4/applying_to_1l_sa_positions_w_no_grades/",
        "text": "i don’t have my grades yet (like a lot of others) and some of the places i’m sending SA apps to say that they’d like a date that they should expect out grades/transcripts by.\n\ni honestly have no idea because some 2Ls/3Ls at my school say it’s ranged from the first few days of january to closer to the end of the month. i don’t want to give an ambiguous answers on my apps, but what would be appropriate to put? and, if my grades aren’t back by whichever day i said on my app, would it be inappropriate/too much to contact them to let them know so that i don’t appear as if i’ve forgotten? sorry if this is is a dumb question lol",
        "created_utc": 1671817573,
        "upvote_ratio": 1.0
    },
    {
        "title": "stamps",
        "author": "km131248",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztms1i/stamps/",
        "text": "am i good with 1 forever stamp for a manilla envelope with 5 pages total inside? mailing for judges",
        "created_utc": 1671815668,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Stanford Hates Fun’: Students Revolt (I can assure you that fun is NOT a problem at UVA!!!)",
        "author": "kobethecat2",
        "url": "https://www.wsj.com/articles/stanford-tree-mascot-suspended-11671720777?mod=trending_now_news_2",
        "text": "",
        "created_utc": 1671815619,
        "upvote_ratio": 1.0
    },
    {
        "title": "Brooklyn Law School",
        "author": "JellyCat98",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztmkw3/brooklyn_law_school/",
        "text": "I was just admitted and am considering BLS, do any current/former students have some insight into the school culture, general experience? I'm out of state and would be moving across the country to attend. I'm a low income student and did not receive a full ride scholarship, so not sure if it is worth it, but East Coast is where I want to eventually practice",
        "created_utc": 1671815238,
        "upvote_ratio": 1.0
    },
    {
        "title": "2 Years and Waiting: a C&amp;F Grievance",
        "author": "CantGetAdmitted",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztmauh/2_years_and_waiting_a_cf_grievance/",
        "text": "I made a throwaway account for this post. I need to get this off my chest. I passed the bar two years ago and I’ve been waiting for my license since. Pending admission to NJ and NY, but NY won’t make a decision until NJ does, and they haven’t made one yet.\n\nI had testicular cancer when I was 19, in the middle of finals right before Christmas. I was a real shit and developed a nihilistic streak for a while that never completely went away. By 23, I was mostly over it, but with some underlying resentment towards existence. Not the central issue but I only realized recently how much it led to anger, depression, and coping with alcohol.\n\nI was a headhunter between undergrad and law school. Started out at a crappy 3rd tier school but transferred to a good (but not great) State school after 1L. I developed issues with insomnia and drinking gradually during the summer before 2L that didn’t explode until over a year later. I had to withdraw during what would have been my final year. I ended up giving up alcohol, but not before getting a public urination violation (this was over 5 years ago now). This was the only criminal conviction and I explained that I was still struggling at the time during my C&amp;F interview.\n\nI didn’t pass until my fourth attempt: the October 2020 New Jersey Bar Exam. I got my results letter on the day before the anniversary (December 23) of my cancer diagnosis. I passed with a score of 286.\n\nI’ve had a great deal to disclose and since the school was aware of my struggles (accommodations and such), I’ve disclosed everything and hid nothing.\n\nI’ve had to do work for my application beyond the parts filled out online. I explained in a narrative document (I had to draft myself) how I’ve grown and what I would do differently through my troubles. Since I had issues with alcohol abuse and depression and I disclosed that I was in detox, I had to undergo a psych eval. \n\nMonths of waiting occurred before this and months of waiting came after the eval. Lots of back and forth with at least 3 people from the bar. Requests for more information or further documentation of stuff. \n\nSome requests were understandable but some were just pedantic. A couple mixups happened but were resolved. For example, I got my fingerprints done in January 2021, but someone from the board of bar examiners didn’t know this till around April. Maybe that delayed things but maybe not.\n\nThere was basically nothing until November 2021, when my reviewing attorney told me there would be an informal RG302 interview or a more formal RG303 hearing. However, she told me that it would not happen until January or February. Well, it ended up not happening till March.\n\nI had an RG302 interview with two panelists. When I was informed that I would be interviewed, I decided I should hire an attorney, because why not? I found one and she did a fine job of preparing me and walking me through it all. Easy enough? We should hear something soon, right?\n\nThere has been only one thing I learned from the committee on character since then. In May, I was told it would take at least 6 months from the interview to get a decision. However, there would be no RG303 hearing. \n\nThe way this works, based off what my attorney told me, is that an RG303 hearing happens if the reviewing attorneys can’t agree after their investigation, which can include an interview. The next level is a statewide panel and their decision is eventually reviewed by the Supreme Court of New Jersey. My attorney tells me it’s simply a matter of waiting but cannot say when it will happen. She predicts that I will be admitted with conditions of some kind, like no solo practice for 2 years or somethin\n\nBut hey, that sounds okay, doesn’t it? I can wait till September, right? Sure, I can do that! But now it’s almost 2023. I’m seriously hurting here. My confidence is gone. I don’t even care to try to stay positive. Everyday, I wake up and think “I bet there’s nothing in my inbox about admission today,” and there never is. I do some per diem jobs here and there, and I live with my parents so it’s not like I’m financially struggling. However, I can’t exactly save either.\n\nMy boyfriend and I intend to get married after we move out of our parents’ houses. He’s an attorney and had some admissions snags but nothing quite like mine. He just got a ballin’ job and I’m very happy for him, but I obviously can’t jump up and down for him. \n\nMy depression and resentment towards existence burn. I’m not entirely consumed but I’m in deeper than I was before. I can have genuine reactions of “I am happy for you” or “this is a wonderful thing.” My brain knows these things and I know that this low point will pass because of course it will. \n\nHowever, I don’t feel good really ever. I can laugh. I can make jokes. I can talk. I can forget by cracking off and playing vidya with my friends. Most of the time, I don’t rage or mope. I can have some bad days, though.\n\nBut I always know what’s waiting for me after. I feel like less of a man. I feel like a failure. \n\nIf they truly cared about the mental health of attorneys, why would they drag this out for so long? You disclose your troubles and take responsibility. While there was a loss of volitional control for me, I still had some control and I messed up. Had I not been drinking problematically before this happened, a little more drinking and stress wouldn’t have tipped me over. I’ve had to take responsibility for that because I messed up.\n\nBut why am I suffering like this? This serves no function for the bar and I highly doubt it’s improving my character or making me more resilient. There’s a recent case here in Jersey regarding Wayne Rohde, a Big Law attorney who crippled a woman during a felony DWI hit and run. SCONJ recently decided to suspend him for only 6 months.\n\nI’m not saying “the board of bar examiners is evil and punishing me for no reason!” There’s a completely reasonable explanation for having delays with an application like mine. I suppose I just want to make sense of this because it feels unfair and wrong to me with no real justification for the duration of the wait and being kept in the dark.\n\nI can’t start my life and I’ve had job offers withdrawn because I can’t give anyone a timeline on admission.",
        "created_utc": 1671814611,
        "upvote_ratio": 1.0
    },
    {
        "title": "Internship for a labor union in house v labor law firm?",
        "author": "One-Effective743",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztm7ub/internship_for_a_labor_union_in_house_v_labor_law/",
        "text": "If anyone with experience, similar experience, or just an opinion and like to share their thoughts, I’d be grateful.",
        "created_utc": 1671814394,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does X GPA mean for me at TY?",
        "author": "strawblip",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztm2oi/what_does_x_gpa_mean_for_me_at_ty/",
        "text": "Unless you are in a T6 in which case the answer is “you’ll be fine,” this is an unanswerable question. I know nerves are high but you will not get a useful answer from these posts. Your school’s career office has the numbers you are looking for. Ask them 🫶🏻",
        "created_utc": 1671814020,
        "upvote_ratio": 1.0
    },
    {
        "title": "Class Rank",
        "author": "Cold_Attention6101",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztl9bk/class_rank/",
        "text": "Where the hell do I find it? How do I know? This magic number that is supposed to determine my worth is strangely hard to locate.\n\nSincerely,\n\nConfused 1L",
        "created_utc": 1671812573,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dear 1Ls: Stop Letting Grades Let You Gauge the Wisdom of Your Career Path",
        "author": "iamtheclaudius",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztkx70/dear_1ls_stop_letting_grades_let_you_gauge_the/",
        "text": "I've seen a lot of this already from the few schools that have released grades. From people that do well, it's \"I'm so glad going to law school was the right decision,\" and vice versa for those with poor grades.\n\nGrades and law school exams don't measure how good of an attorney you can or will be.\n\nRead that again until you accept it. If you don't, you're putting an unbelievable amount of pressure on yourself and your grades *for no reason.*\n\nYes, it is true that 1L grades are really important for 2L summer hiring. There will be some pressure there that is real. But whether you have what it takes to be an attorney will not be determined by your grades. \n\nUnless you're absolutely failing everything, and that won't be at least 99% of you, just chill out. Focus on getting rest now so that you can kick next semester's ass. You'll need to either replicate your fall performance or improve upon it. In either case, your approach now should be the same.",
        "created_utc": 1671812017,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me when I'm asked what the Texas citation guide is called",
        "author": "garrettgravley",
        "url": "https://i.redd.it/2ch1s74v0o7a1.png",
        "text": "",
        "created_utc": 1671809011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about SBF Prosecution",
        "author": "jjjjjjjjabs13",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztir67/question_about_sbf_prosecution/",
        "text": "I have heard some commentators saying that the prosecution screwed up by getting the plea deals from Caroline Ellison and Gary Wang this quickly. Why do you think they are saying that? In my opinion, it seems better to get cooperation from these two people, especially early on.",
        "created_utc": 1671808320,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L Summer Jobs",
        "author": "Cold_Attention6101",
        "url": "https://www.reddit.com/r/LawSchool/comments/ztdpth/1l_summer_jobs/",
        "text": "First Gen student here. Haven’t gotten my grades back but now that it’s break I’m starting the process of searching for my summer employment. However, I feel completely out of my depth. I have zero experience that is even remotely legal or office related (I grew up on a farm in a rural area so most of my job experience is various farm work and a farm related business I used to pay for school). My school’s career office has resume and CV resources I plan on using but I’m worried about how my employment history will affect my ability to get a decent job. Will 7 years of farm work really be something that’ll jump out to employers?",
        "created_utc": 1671797256,
        "upvote_ratio": 1.0
    },
    {
        "title": "LCLD Interview",
        "author": "BarReview420",
        "url": "https://www.reddit.com/r/LawSchool/comments/zt8um9/lcld_interview/",
        "text": "Anyone know where I can find resources about what to expect/questions? Have an interview tomorrow and am pretty worried because I have no work experience to talk about.",
        "created_utc": 1671778624,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asking whether/when a job listing will be posted?",
        "author": "geminigrrl",
        "url": "https://www.reddit.com/r/LawSchool/comments/zt8ful/asking_whetherwhen_a_job_listing_will_be_posted/",
        "text": "I am a 3L applying for post-grad jobs like mad, and one of my absolute top-choice first jobs would be with the non-profit I interned with my 1L summer. It’s a 2-year fellowship that is due to renew the fall after I graduate (as long as their plans haven’t changed), and I know the listing is supposed to come out sometime between November-January but I have yet to see anything. The summer internship listings are already up for this org. I have a really good relationship with the attorneys there, but I’m not sure whether it would be innappropriate/unprofessional/presumptuous to reach out and ask if they will be hiring for the position and, if so, approximately when. I guess I just don’t want to end up taking another job and potentially reneging or discounting this opportunity altogether, but I also feel a lil crazy for wanting to reach out about it lol. Would it be okay for me to do so or should I just silently keep an eye out? I appreciate any and all insights!!",
        "created_utc": 1671777081,
        "upvote_ratio": 1.0
    },
    {
        "title": "got first grade back",
        "author": "anxious_prelaw",
        "url": "https://www.reddit.com/r/LawSchool/comments/zt7lmd/got_first_grade_back/",
        "text": "Got my first grade back, it was a B in property. I’m so disappointed and it feels irrational. I know a B isn’t bad but I feel like I could have done so much better. Here’s to eating waiting until January to find out the other grades.",
        "created_utc": 1671774051,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I sell books here?",
        "author": "jackwatson21",
        "url": "https://i.redd.it/dq5erpxzfm7a1.jpg",
        "text": "If so I got Con Law by Chemerinsky 6th edition - see pic- that’s what I paid. \n\nAnd\n\nSoftware Patents by Eric Sutton \n\nAny takers?  I’ll take reasonable offers.  Also putting on eBay. Thanks. Delete if not allowed.",
        "created_utc": 1671771840,
        "upvote_ratio": 1.0
    },
    {
        "title": "curve and class rank",
        "author": "whiteclaws9",
        "url": "https://www.reddit.com/r/LawSchool/comments/zt6kdd/curve_and_class_rank/",
        "text": "I attend one of the very few schools that have posted grades already. My school curves at 2.9-3.1 (I believe) which is a B. I had an A, A-, B+, B+. What would this mean in terms of an estimated class rank? I am a confused 1L and don't understand the curve and how I rank versus the curve so any comments would be helpful!",
        "created_utc": 1671770445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Barbri Lawyering Fundamentals",
        "author": "abigailddiamond",
        "url": "https://www.reddit.com/r/LawSchool/comments/zt61m9/barbri_lawyering_fundamentals/",
        "text": "Just curious, do all law schools require you to take the the Barbri Lawyering Fundamentals course before starting, or is it just mine?",
        "created_utc": 1671768713,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can totally relate…#lawstudent #law #lsatprep",
        "author": "Inevitable_Meet_7628",
        "url": "https://v.redd.it/o3bxyvfh1m7a1",
        "text": "",
        "created_utc": 1671767029,
        "upvote_ratio": 1.0
    },
    {
        "title": "LOANS! Do federal loans really cover EVERYTHING? Or do students that need more money due to having a family need to request additional private loans? How does this work",
        "author": "GenericDishwasher",
        "url": "https://www.reddit.com/r/LawSchool/comments/zt5d1j/loans_do_federal_loans_really_cover_everything_or/",
        "text": "",
        "created_utc": 1671766523,
        "upvote_ratio": 1.0
    },
    {
        "title": "Criminal Procedure Supplements",
        "author": "DanzAlyGrigori",
        "url": "https://www.reddit.com/r/LawSchool/comments/zt580u/criminal_procedure_supplements/",
        "text": "I need a criminal procedure supplement. Has anyone used either Acing Criminal Procedure, Glannon Guide to Criminal Procedure, or Criminal Procedure: Examples and Explanations?",
        "created_utc": 1671766077,
        "upvote_ratio": 0.99
    },
    {
        "title": "SA application",
        "author": "Organic_Connection58",
        "url": "https://www.reddit.com/r/LawSchool/comments/zt4zla/sa_application/",
        "text": "Wait to apply until grades/transcript come in?  Noticing several firms have the transcript as a mandatory part of the app, such that I can’t submit unless I upload it. Advice?",
        "created_utc": 1671765317,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cover letter",
        "author": "New_Clue_2126",
        "url": "https://www.reddit.com/r/LawSchool/comments/zt4ea0/cover_letter/",
        "text": "Can anyone share their 1L SA cover letter with me? Would be much appreciated :)",
        "created_utc": 1671763430,
        "upvote_ratio": 1.0
    },
    {
        "title": "summer prospects and beyond",
        "author": "Confident-Night-5836",
        "url": "https://www.reddit.com/r/LawSchool/comments/zt4aq3/summer_prospects_and_beyond/",
        "text": "just finished exams at a T6, don’t feel like i did bad, don’t feel like i did great, i feel like i did somewhere in the average to okay range. Although, I could be off base in either direction. but, assuming i’m correct, what would that mean for summer job prospects?",
        "created_utc": 1671763115,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ole miss law",
        "author": "IngenuityFull1950",
        "url": "https://www.reddit.com/r/LawSchool/comments/zt3wqg/ole_miss_law/",
        "text": "Opinions on Ole Miss Law?",
        "created_utc": 1671761873,
        "upvote_ratio": 1.0
    },
    {
        "title": "St. Mary’s Law",
        "author": "IngenuityFull1950",
        "url": "https://www.reddit.com/r/LawSchool/comments/zt3wdd/st_marys_law/",
        "text": "Opinions on St. Mary’s Law in San Antonio?",
        "created_utc": 1671761838,
        "upvote_ratio": 1.0
    }
]