[
    {
        "title": "What is the best way to get a pdf of Microsoft word file for a law from nysenate.gov",
        "author": "I-am-ocean",
        "url": "https://www.reddit.com/r/LawSchool/comments/11f7m8v/what_is_the_best_way_to_get_a_pdf_of_microsoft/",
        "text": "For instance, I want a pdf or Microsoft word file to take notes/highlight of this law, \n\n [Legislation | NY State Senate (nysenate.gov)](https://www.nysenate.gov/legislation/laws/RPT/A11T3) \n\nwithout needing to manually copy paste section by section",
        "created_utc": 1677686827,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lexis+ Answer 03/01/23",
        "author": "Ostentatious_",
        "url": "https://www.reddit.com/r/LawSchool/comments/11f7lp2/lexis_answer_030123/",
        "text": "**Interview Prep – Video**\n\n*What event did they host for their offices nationwide to create innovations for their work problems?*\n\n– *Hackathon*\n\n*Enjoy your 200 points!*",
        "created_utc": 1677686793,
        "upvote_ratio": 1.0
    },
    {
        "title": "Loyola Chicago vs Kent",
        "author": "Ok-Tea885",
        "url": "https://www.reddit.com/r/LawSchool/comments/11f6ch2/loyola_chicago_vs_kent/",
        "text": "[removed]",
        "created_utc": 1677683840,
        "upvote_ratio": 0.5
    },
    {
        "title": "Spring Internship as 2L",
        "author": "Ill_Signature3342",
        "url": "https://www.reddit.com/r/LawSchool/comments/11f5sfe/spring_internship_as_2l/",
        "text": "I know this is probably early (since I'm a 1L), but I'm curious about how feasible it is to intern as a 2L while still keeping up with school. Does anyone have experience? Really could use a few extra bucks. Thanks!",
        "created_utc": 1677682499,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who to write the follow up email too?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677680757,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help a french student",
        "author": "choupinette92",
        "url": "https://www.reddit.com/r/LawSchool/comments/11f4hot/help_a_french_student/",
        "text": "[removed]",
        "created_utc": 1677679227,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Bluebook Cite an Audited Financial Statement",
        "author": "HeroLeo14",
        "url": "https://www.reddit.com/r/LawSchool/comments/11f4e31/how_to_bluebook_cite_an_audited_financial/",
        "text": "Hello! I'm hoping someone can help me with a citation question. I'm trying to cite a college's audited annual financial report using bluebook.\n\nFor example, I'm trying to cite to Harvard's fiscal year 2022 financial report that includes PwC-audited financial statements.\n\n[https://finance.harvard.edu/files/fad/files/fy22\\_harvard\\_financial\\_report.pdf](https://finance.harvard.edu/files/fad/files/fy22_harvard_financial_report.pdf)\n\nAny help at all would be greatly appreciated!!",
        "created_utc": 1677678963,
        "upvote_ratio": 0.86
    },
    {
        "title": "Advise",
        "author": "Temlic",
        "url": "https://www.reddit.com/r/LawSchool/comments/11f1zgb/advise/",
        "text": "[removed]\n\n[View Poll](https://www.reddit.com/poll/11f1zgb)",
        "created_utc": 1677672072,
        "upvote_ratio": 1.0
    },
    {
        "title": "Top 20 Fully Funded Scholarships Programs",
        "author": "androidwalahon",
        "url": "https://fullyscholarship.com/funded-scholarships-programs/",
        "text": "",
        "created_utc": 1677668225,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any immigration lawyer experienced with Canadian study permit with a medical history. Please help.",
        "author": "DisastrousDriver9380",
        "url": "/r/immigration/comments/11ezynq/any_immigration_lawyer_experienced_with_canadian/",
        "text": "",
        "created_utc": 1677665445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are law school professors not always fully invested in their students’ learning, due to misalignment of goals?",
        "author": "Witty_Temperature_87",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ezsu8/are_law_school_professors_not_always_fully/",
        "text": "I notice that my law school professors (and maybe Teachers in general) are not always fully invested with helping students excel. For example, I realize that some of the professors have not been providing the sources for their teaching material, or have been providing the less direct sources, indirectly misleading students. It is almost like gatekeeping knowledge. Once you discover the real source of their teaching material, you realize that you can learn so much faster because all the explanations are on there.\n\nI’m guessing the reasons for it is that some professors want to appear smarter than their students, and are afraid that students become more knowledgeable than them in class, or ask the difficult questions? They want control over their classes and gain favour by demonstrating academic superiority. Some even intentionally make their classes challenging, by going beyond the reading list, etc? I’m not sure how many professors will admit this, or if there is some underlying rationale which they themselves might not realize.\n\nAnother obvious reason which I can think of, is that marking papers is a chore, and professors want to make it easy to differentiate between the average and excellent student. Hence, they provide only the most basic knowledge to students, while those students at the top may have access to further know-how’s due to family connections, private tutors, etc. \n\nprofessors are perfectly content with allowing the average student to stay average because it makes their job easier as long as you don’t fail. I’ve also noticed that some professors tell us “it’s okay to be average”, etc, because it essentially serves them well. It doesn’t do professors good for students to be ambitious, demand a lot in consultations, etc, and make it difficult to grade papers. Professors get graded by students in my school so keeping student expectations low serves them well?\n\nHence, I believe that professors are often good at providing the most basic knowledge, but beyond that, it requires a lot of student initiative to break those barriers especially if one does not have connections and resources?\n\nOf course, there are great professors around but as a student who used to hold my Teachers and professors with the highest respect, this realisation has come to be quite a shocker. Anyone else can relate or provide a different perspective? Is the system less than ideal in that sense?",
        "created_utc": 1677664455,
        "upvote_ratio": 0.33
    },
    {
        "title": "Bar exam application",
        "author": "ohthatjenny",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ey8mk/bar_exam_application/",
        "text": "Hi all, since the NY bar exam registration for July is coming up soon (April), I was wondering if there is anything I need to do beforehand. I already have a bole account. Is that all I need to register for the July exam? Do I need anything else to sign up for the exam either before or during the registration process? I don’t know why but I feel like I’m missing something. Thanks!!",
        "created_utc": 1677658411,
        "upvote_ratio": 1.0
    },
    {
        "title": "'Shadowing' a judge later this week: what's the best way to prepare?",
        "author": "GlassFloorNoCeiling",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ev508/shadowing_a_judge_later_this_week_whats_the_best/",
        "text": "Received a last minute opportunity to spend the day shadowing a state SC judge later this week. There is the potential it could lead to a summer role. It feels rather informal but I want to leave a good impression - was hoping to get some ideas of questions or things to talk about? General experience also welcome . . . TYIA",
        "created_utc": 1677647895,
        "upvote_ratio": 0.99
    },
    {
        "title": "Part time/ online law school?",
        "author": "Acrobatic_Bad3256",
        "url": "https://www.reddit.com/r/LawSchool/comments/11eurhe/part_time_online_law_school/",
        "text": "[removed]",
        "created_utc": 1677646754,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do firms consider undergraduate GPA for 1L diversity positions? I had an interviewer ask me what my undergrad gpa is",
        "author": "roomlightdesklamp",
        "url": "https://www.reddit.com/r/LawSchool/comments/11eullq/do_firms_consider_undergraduate_gpa_for_1l/",
        "text": "",
        "created_utc": 1677646229,
        "upvote_ratio": 0.6
    },
    {
        "title": "What percentage of law students do you think uses this forum?",
        "author": "lawschool0316",
        "url": "https://www.reddit.com/r/LawSchool/comments/11eukgy/what_percentage_of_law_students_do_you_think_uses/",
        "text": "",
        "created_utc": 1677646134,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling to find a summer internship",
        "author": "wonderwolfyt",
        "url": "https://www.reddit.com/r/LawSchool/comments/11euiwv/struggling_to_find_a_summer_internship/",
        "text": "Just wondering from the other people out there when did you finally get your summer position if you are a 2L or 3L/ if you have one as a 1L. I have had a few interviews but all have led to rejections so far. Just stressed :(",
        "created_utc": 1677645992,
        "upvote_ratio": 1.0
    },
    {
        "title": "Political stance",
        "author": "WelshBITES",
        "url": "https://www.reddit.com/r/LawSchool/comments/11eu5qf/political_stance/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/11eu5qf)",
        "created_utc": 1677644868,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do firms look at undergraduate GPA for 1L diversity positions? I had an interviewer ask me how my grades were in undergrad",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677643805,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mental health crisis question",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677642272,
        "upvote_ratio": 1.0
    },
    {
        "title": "Part-Time Students / Full-Time workers?",
        "author": "BreukelenMadMan",
        "url": "https://www.reddit.com/r/LawSchool/comments/11eswpm/parttime_students_fulltime_workers/",
        "text": "[removed]",
        "created_utc": 1677641209,
        "upvote_ratio": 0.83
    },
    {
        "title": "state court clerkship",
        "author": "serenam98",
        "url": "https://www.reddit.com/r/LawSchool/comments/11eswkp/state_court_clerkship/",
        "text": "hey all! i got a call today abt interviewing for a judge i never applied to work for. i sent my first clerkship app out yesterday to a totally different judge! i had no idea judges could contact you even if you didn't apply to them? not mad abt it or anything just wasn't expecting it plus its a little farther out of my geographical range. i said yes to an interview but now i don't really know how to approach it. any advice would be helpful!",
        "created_utc": 1677641196,
        "upvote_ratio": 0.8
    },
    {
        "title": "Anyone ever do a clerkship with a Corporation Counsel?",
        "author": "areasonableperson92",
        "url": "https://www.reddit.com/r/LawSchool/comments/11esvl6/anyone_ever_do_a_clerkship_with_a_corporation/",
        "text": "Just wondering what to expect if I accept a position as a law clerk with a corporation counsel office. I know not every state has these offices, or they are called different things depending on where you are. \n\nI worked in a small private firm (6 lawyers) last summer, and have some offers for the same firm as last summer and some smaller ones as well. I liked the firm, but it’s not the location I want to live in, and the corporation counsel job is in the city I want to live in after school. \n\nI just have no clue how government type jobs are.\n\nThanks.",
        "created_utc": 1677641117,
        "upvote_ratio": 0.67
    },
    {
        "title": "I can't bring myself to study/do any of my work",
        "author": "dankdurianduchess",
        "url": "https://www.reddit.com/r/LawSchool/comments/11esmbp/i_cant_bring_myself_to_studydo_any_of_my_work/",
        "text": "Title pretty much says it all. My whole life I've been a hardworking, diligent, motivated, straight-A student, all in the goal of getting into law school. Now I've become the complete opposite. I have a shitload of work to do, a fuck ton of lecture recordings to catch up on, but I literally cannot make myself do any of it - and I very often end up wasting entire days just sitting in front of my laptop mindlessly scrolling on webpages/watching random YouTube videos. My grades aren't bad (currently in 2L, and my grades have actually improved quite dramatically from 1L), but has that been enough of a catalyst/motivating factor to change the way I act? Nope. With the way it's going I fear that I won't make it to the end of my degree. What in tarnation is wrong with me I fcking hate this.\n\nSorry for the rant.",
        "created_utc": 1677640400,
        "upvote_ratio": 0.96
    },
    {
        "title": "How to find free law books?",
        "author": "LycheeFruit2020",
        "url": "https://www.reddit.com/r/LawSchool/comments/11eryqa/how_to_find_free_law_books/",
        "text": "I'm a Chinese student studying law in China. Currently, I'm having trouble preparing my undergraduate thesis. I don't know how to get free law books, e.g., *Jeroen Kortman, Altruism in Private Law: Liability for Nonfeasance and Gestio, Oxford University Press, 2005*. Normally I would search it on Google, Zilbrary, and certain Databases like Westlaw, Lexis, and Heinoline, but this time with no luck. So I'm wondering if I could get free law books somewhere?",
        "created_utc": 1677638604,
        "upvote_ratio": 0.44
    },
    {
        "title": "Is dependency override a thing for law school financial aid?",
        "author": "Haunting-Mulberry734",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ert0o/is_dependency_override_a_thing_for_law_school/",
        "text": "[removed]",
        "created_utc": 1677638171,
        "upvote_ratio": 0.83
    },
    {
        "title": "GRE Score for UofA Law School",
        "author": "SaylorTwift98",
        "url": "https://www.reddit.com/r/LawSchool/comments/11erf6f/gre_score_for_uofa_law_school/",
        "text": "[removed]",
        "created_utc": 1677637097,
        "upvote_ratio": 0.5
    },
    {
        "title": "Got a Summer Internship!",
        "author": "HuskyCriminologist",
        "url": "https://www.reddit.com/r/LawSchool/comments/11er5n2/got_a_summer_internship/",
        "text": "I don't want to talk it up at school because I don't want to be \"that guy\" so I'm just gonna toot my own horn here. God alone knows how, but through the power of a mediocre GPA I ended up actually being able to choose between *two* unpaid internships this summer. Ya boi gon have something to put on his resume! Talk about stress relief.",
        "created_utc": 1677636363,
        "upvote_ratio": 0.94
    },
    {
        "title": "need advice",
        "author": "lawfairyy",
        "url": "https://www.reddit.com/r/LawSchool/comments/11er41j/need_advice/",
        "text": "hi, i am usually the worst at decision making (super bad) but i wanted to come on here and get fellow student opinions. i am currently in the spring of my 1L in an evening program in big city. (i live an hour away from this city btw) my first semester i worked full time while i took 12 credits, which was doable since i worked remote but once the spring semester started the work amped up a lot so i ended up having to leave my FT job to work part time as a clerk w significantly low pay at a local firm on the days i have class (3 days a week) except now i am required to work in person. my work day starts at 9 ends around 4 where i need to find time to eat in the area usually at a shitty cafe and then i have to hop on a train and sit in class until 10 and i don’t get home until 11. i’m exhausted + afraid i’m gonna burn out by final-  i’m thinking about just starting school full time and giving up on working for now + maybe just looking in the summer to work instead. but i don’t know if it’s the right choice. any tips or thoughts?",
        "created_utc": 1677636243,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reneging an SA offer after background check",
        "author": "East-Kale-5217",
        "url": "https://www.reddit.com/r/LawSchool/comments/11eqizt/reneging_an_sa_offer_after_background_check/",
        "text": "2L. Yep I know this is immoral, but not sure how immoral this can be. Is it like suicidal?",
        "created_utc": 1677634643,
        "upvote_ratio": 0.38
    },
    {
        "title": "California v. Greenwood (1988)",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677633353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vinson &amp; Elkins 1L SA",
        "author": "Specialist-Dog-500",
        "url": "https://www.reddit.com/r/LawSchool/comments/11epzs3/vinson_elkins_1l_sa/",
        "text": "Has anyone been rejected for a 1L SA with V&amp;E? Or does anyone know how long it takes from callback to offer/rejection? Specifically for NY office bc I know the TX office moved fast",
        "created_utc": 1677633220,
        "upvote_ratio": 0.67
    },
    {
        "title": "/r/Lawschool summer 2023 sublet thread",
        "author": "magicmagininja",
        "url": "https://www.reddit.com/r/LawSchool/comments/11epup5/rlawschool_summer_2023_sublet_thread/",
        "text": "Hello,\n\nI've heard your murmurings and decided to make a post for finding housing this summer. I would like to have a big disclaimer that we will not be monitoring, verifying, etc., any of the housing arrangements posted.\n\nHow This Works\n\nIf you want to be a sublessor, fill out the [google form](https://docs.google.com/forms/d/e/1FAIpQLSdB0LXqDFfzFiW_M7m-YjFgqdwZKfgz8TANkp64rLTHoNhvbw/viewform?usp=sf_link). We do not collect your emails.\n\nIf you would like to be a sublessee, go to the [excel sheet](https://docs.google.com/spreadsheets/d/1YUvHWfoT7ROfrttU1_MDmD5mWpCuj2XJ0LQ4B6W9zPk/edit?usp=sharing) to look for posted housing arrangements.\n\n**Info Needed**\n\nthere are fields for what city or market; what neighborhood; price of the apartment; etc.\n\nHope this is helpful for you all.",
        "created_utc": 1677632834,
        "upvote_ratio": 0.92
    },
    {
        "title": "Summer Opportunity Advice",
        "author": "zoyadi",
        "url": "https://www.reddit.com/r/LawSchool/comments/11eplu5/summer_opportunity_advice/",
        "text": "I could use some opinions and advice regarding my current options for my 1L summer.  I have received two offers so far; one is from an in-house department at a well-known company where I will be doing highly substantive corporate work as the only intern (which could be a great mentorship opportunity considering the close working relationship); the other is from a federal district court judge, where I'll have the opportunity to create a writing sample with feedback and editing from the judge, which will be eventually published on Lexis/WestLaw (not sure how that works).  Both are unpaid.\n\nI love both opportunities and am torn between them.  One is fully remote, the other is hybrid; in theory, I am open to working both concurrently (I am aware of how intense it will be to do both) but I am not sure how that will look going into OCI (I would like to pursue BigLaw).  My deadline to decide is on Friday for the judicial position.\n\nAlso, I am waiting to hear back from over a dozen BigLaw 1L diversity SA positions, so I am not sure what the proper etiquette is re: finding out if I will get a decision soon given the impending deadline.  There was one firm in particular I was interested in and made good connections with; I sent a tracked email last week before I got these offers asking for an update to the correct person which was left opened.\n\nI would love some feedback from those who have experience regarding: 1) which of the two positions is more prestigious and productive given my career goals, 2), if I can do both at the same time without it looking bad going into OCI (and how I would even broach such a topic with these two employers without looking unappreciative for their kind offers), and 3), what typical correspondence etiquette looks like when contacting recruiters about impending offer deadlines.\n\nThanks so much in advance!",
        "created_utc": 1677632218,
        "upvote_ratio": 0.5
    },
    {
        "title": "Do I need a bachelors degree to get into law school in Belgium?",
        "author": "antk1ng1",
        "url": "https://www.reddit.com/r/LawSchool/comments/11epim1/do_i_need_a_bachelors_degree_to_get_into_law/",
        "text": "[removed]",
        "created_utc": 1677631977,
        "upvote_ratio": 1.0
    },
    {
        "title": "Worth going to law school?",
        "author": "Ok-Package-435",
        "url": "https://www.reddit.com/r/LawSchool/comments/11eph9u/worth_going_to_law_school/",
        "text": "[removed]",
        "created_utc": 1677631872,
        "upvote_ratio": 0.29
    },
    {
        "title": "Housing swap",
        "author": "Snoo70091",
        "url": "https://www.reddit.com/r/LawSchool/comments/11eojp3/housing_swap/",
        "text": "I remember there was an excel sheet last summer for summer associate housing swaps. Does anyone know when that typically gets started ?",
        "created_utc": 1677629417,
        "upvote_ratio": 0.86
    },
    {
        "title": "Vibes Today in NY",
        "author": "CartographerCheap884",
        "url": "https://i.redd.it/s1ca63bj72la1.jpg",
        "text": "",
        "created_utc": 1677628728,
        "upvote_ratio": 0.86
    },
    {
        "title": "pet peeve",
        "author": "zeroglimpse63",
        "url": "https://www.reddit.com/r/LawSchool/comments/11enzcw/pet_peeve/",
        "text": "Professors who give reading assignments a day or two before the class. This prof gave us the syllabus in the beginning of the semester, and now is not following it at all. We get the reading assignment for the next class a few hours after class ends. I like to finish my readings for the next week over the weekend, and especially this week since we have oral arguments on Thursday, but noooooo I wasted my time finishing the cases on the topic for today because he decided to skip two classes worth of readings. Is there a nice way to ask him to plan ahead, even just a teensy bit?",
        "created_utc": 1677628014,
        "upvote_ratio": 0.94
    },
    {
        "title": "NYLC error preventing me from registering for the NYLE (seeking help)",
        "author": "Dangerouslygiggly",
        "url": "https://www.reddit.com/r/LawSchool/comments/11enf1y/nylc_error_preventing_me_from_registering_for_the/",
        "text": "I have completed all of the NYLC videos prior to today's registration deadline. However, it says that i've completed 17/18 courses even though i've completed every single video. Ive attached a picture.\n\nHas this happened to anyone? The office is closed and im just so worried that this will prevent me from registration and taking the exam, even though i've finished everything before the deadline. If anyone has advice, it would be greatly appreciated.\n\n&amp;#x200B;\n\nFYI the photo is low quality after redacting my personal info. Thank you. \n\nhttps://preview.redd.it/lcj8zjdlj0la1.png?width=1150&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=221a0409f321a9ce77a64a4b4710923f079fbebe",
        "created_utc": 1677626592,
        "upvote_ratio": 0.5
    },
    {
        "title": "it’s really that simple",
        "author": "RemovePuzzleheaded75",
        "url": "https://i.redd.it/ekgkjpwez1la1.jpg",
        "text": "",
        "created_utc": 1677625997,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L SA interview follow up email?",
        "author": "chicothecat69",
        "url": "https://www.reddit.com/r/LawSchool/comments/11elphm/1l_sa_interview_follow_up_email/",
        "text": "Spent hours preparing for an interview because my career counselor told me to. The interview was so casual, there was never a single reference to my resume or past work experience, just what I was interested in, and how law school was going.\n\nWould you guys recommend sending follow up emails to the attorneys I interviewed with? or what is the best way to proceed from here? \n\nThank u all &lt;3",
        "created_utc": 1677622486,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wtf why is law school so hard",
        "author": "throwaway001232",
        "url": "https://www.reddit.com/r/LawSchool/comments/11elgjg/wtf_why_is_law_school_so_hard/",
        "text": "/s/ A struggling, below-median 1L",
        "created_utc": 1677621906,
        "upvote_ratio": 1.0
    },
    {
        "title": "2L Summer Associateship Offer through 1L Diversity Program",
        "author": "panda20212",
        "url": "https://www.reddit.com/r/LawSchool/comments/11eldf9/2l_summer_associateship_offer_through_1l/",
        "text": "hey y’all, second semester 1L here at a non-T-14 school in NYC. I was recently offered a two summer internship through a diversity program — this summer will be at a corporation and the next summer will be a 2L summer associateship at a V20 firm. i’m probably being paranoid, but i’m curious whether it makes a difference that I got the 2L summer associateship through a diversity program with respect to my prospect of securing a post-grad offer. would appreciate any insight, ty in advance!!",
        "created_utc": 1677621712,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a point of going to law school without taking the bar?",
        "author": "Routine-Lychee-3257",
        "url": "https://www.reddit.com/r/LawSchool/comments/11el6ua/is_there_a_point_of_going_to_law_school_without/",
        "text": "[removed]",
        "created_utc": 1677621299,
        "upvote_ratio": 1.0
    },
    {
        "title": "2L offer without interview?",
        "author": "champagnekasi",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ektxi/2l_offer_without_interview/",
        "text": "Had a callback with Milbank NY for their diversity fellowship position and was rejected. Received a few emails about my 2L app being expedited. Today they reached out and said I would only have to upload my complete 1L transcript and they’ll decide on my candidacy from there. \n\nAnyone else hired through this process either at Milbank or at another firm?",
        "created_utc": 1677620473,
        "upvote_ratio": 1.0
    },
    {
        "title": "What legal magazines/journals would you recommend?",
        "author": "Turdboggin01",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ejjpt/what_legal_magazinesjournals_would_you_recommend/",
        "text": "Of course, there's the ABA Journal, but I'd like to read something, preferably in print, that's published a little more often.",
        "created_utc": 1677617494,
        "upvote_ratio": 1.0
    },
    {
        "title": "ED Question",
        "author": "InimitableSloth",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ejaeq/ed_question/",
        "text": "[removed]",
        "created_utc": 1677616922,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best BAR Prep Course?",
        "author": "hgcallander",
        "url": "https://www.reddit.com/r/LawSchool/comments/11eja19/best_bar_prep_course/",
        "text": "I know that this question is probably asked often, but I'm curious if you had a preference between Themis/Barbri/Other prep courses? I'm a 2L but Themis is offering nearly $1,000 off if we purchase NOW. (I love that all of law school is a money-making enterprise).\n\nWhat are the differences, and anything you prefer about a certain program? \n\nThank you in advance.",
        "created_utc": 1677616880,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shopping business professional",
        "author": "AbilitySure4768",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ej8jh/shopping_business_professional/",
        "text": "I'm starting to get ready for my summer internship and I desperately need to go shopping for business professional clothing. Was wondering if anyone had suggestions for places to look that won't totally break the bank. For context, I'm a male looking for suits but feel free to drop suggestions for anyone! Thanks!",
        "created_utc": 1677616749,
        "upvote_ratio": 1.0
    },
    {
        "title": "My apartment was robbed and the emotional mess i am being put through with the constant contact with police and detectives because they can’t understand what happened is really taking a toll on my mental health. can i have them drop the case?",
        "author": "Standard_Internet114",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ej786/my_apartment_was_robbed_and_the_emotional_mess_i/",
        "text": "",
        "created_utc": 1677616594,
        "upvote_ratio": 0.5
    },
    {
        "title": "s. 7 CATILINE APPLICATION TOMORROW AT THE VANCOUVER COURTHOUSE 10 AM! PRESS EVENT FOR ATTENDEES. QUESTIONS PERMISSIBLE. DREAMCATCHER LAW for FREEDOM OF DREAMS. Because you shouldn't have to pay for an Imagination, or an education. https://dreamcatcherlaw.com/womens-heritage-fund",
        "author": "Coysteverino123",
        "url": "https://youtu.be/2hQ1apArRaw",
        "text": "",
        "created_utc": 1677615979,
        "upvote_ratio": 1.0
    },
    {
        "title": "Value of a \"Specialization in International Legal Affairs?\"",
        "author": "Uncle_Oogie",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ehta7/value_of_a_specialization_in_international_legal/",
        "text": "I am a 1L with the long-term goal of practicing transactional law in Japan. My T14 law school offers a degree option called \"J.D. with Specialization in International Legal Affairs.\" It basically looks like an extra 16 credits of (mostly litigation &amp; public-law focused) international law courses in exchange for the designation.  \n\n\nNiche question, but I'm interested to hear if anybody knows anything / has any thoughts about the value of the specialization in pursuing a career in private international law. I suspect my goals would be better furthered if I spent my time on undergrad Japanese language courses + transactional courses instead of the courses required for this specialization (e.g. International Human Rights, Conflict of Laws, etc.). Some of the requirements for the specialization can be fulfilled by a semester abroad and/or participation in the international law journal, both of which I hope to do whether I apply for the specialization or not.",
        "created_utc": 1677613370,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm doing two summer associate positions, at the same time",
        "author": "icespicycoochie",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ehn41/im_doing_two_summer_associate_positions_at_the/",
        "text": "full time 10 weeks each",
        "created_utc": 1677612960,
        "upvote_ratio": 1.0
    },
    {
        "title": "How should I prepare for 1L?",
        "author": "Tackle_Willing",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ehli0/how_should_i_prepare_for_1l/",
        "text": "I’m a kjd starting at a t14 in the fall. I have a learning disability and have always struggled taking the same course load (20 classes a semester) as my peers. I know law school is going to be hard, much harder than undergrad so I want to take some of the load off my plate for the first semester. I want to learn a good bit of the material from at least one class before classes actually start. Is there like a law school jump start summer class? Or a list of a few books to read over the summer so I don’t have to spend as much time reading them during the year? I want to give myself a set up of “some of this is review”. Anyway, if anyone has any advice on the best way to prepare, I’d really appreciate it! Thanks so much.",
        "created_utc": 1677612850,
        "upvote_ratio": 1.0
    },
    {
        "title": "No summer internship lined up and I’ve applied to almost 100 places at this point. Law firms, legal externships (paid and unpaid), and in house…",
        "author": "Any_Summer_9415",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ehbim/no_summer_internship_lined_up_and_ive_applied_to/",
        "text": "I’m getting more and more worried and have zero clue what to do. Any advice?",
        "created_utc": 1677612206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lexis+ Answer 02/28/23",
        "author": "Ostentatious_",
        "url": "https://www.reddit.com/r/LawSchool/comments/11egtsd/lexis_answer_022823/",
        "text": "**Did You Know Week 7**\n\n*\"Who is listed as an author of this Practice Note?\"*\n\n*– Patrick J. Lamparello*\n\n*Enjoy your 100 points!*",
        "created_utc": 1677611047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Big Law Summer Associates?",
        "author": "warrenpeacestan",
        "url": "https://www.reddit.com/r/LawSchool/comments/11egct2/big_law_summer_associates/",
        "text": "I've heard people in conversations mention that big law summer associates will often get wined and dined and taken out to dinners and stuff like that, but since so many people are braggy about their big law summer associate positions I don't know how much of that to take at face value. Is it actually like that? Or is it being exaggerated?",
        "created_utc": 1677609937,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unemployed JD, sent over 200 applications, need advice!",
        "author": "Ilegitneedsleep1",
        "url": "https://www.reddit.com/r/LawSchool/comments/11egce3/unemployed_jd_sent_over_200_applications_need/",
        "text": "[removed]",
        "created_utc": 1677609911,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I find treasury regulations/proposed regulations?",
        "author": "lawfultraveler",
        "url": "https://www.reddit.com/r/LawSchool/comments/11efwuo/where_can_i_find_treasury_regulationsproposed/",
        "text": "I can find the exact statute I want in Westlaw by searching e.g., \"IRC 1223\" in Westlaw, but I can't figure out how I'm supposed to search for treasury regulations. I tried Westlaw, Google, etc. Please help, thank you!",
        "created_utc": 1677608887,
        "upvote_ratio": 1.0
    },
    {
        "title": "Take an internship that's more directly related to my field of interest, or one that would allow for more networking ( and $)",
        "author": "kcaj140",
        "url": "https://www.reddit.com/r/LawSchool/comments/11eft4y/take_an_internship_thats_more_directly_related_to/",
        "text": "I went from not hearing anything back from the various places I'd applied to, to possibly having to make a decision between two internships. \n\nOne is for a local medical malpractice and personal injury firm (my area of interest), pays ok enough for the summer and would want me to stay on and continue working from 1L summer through 3L \n\n\nThe other option (not yet confirmed) is a summer clerkship for a federal circuit court judge. While I'm not as immediately interested in Criminal Law (what I would be mostly working with) the position pays nearly $10/hr more (with about 6 hours less of work a week)  and I feel as though it would be a great way to meet many attorneys working in criminal law within the area \n\n\nWhile I'm tempted to take the offer with more $, the consistency of working with a firm in my area of interest sounds very appealing and as though it could open more doors for me after graduation.\n\n\nAny advice/ thoughts?",
        "created_utc": 1677608634,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there as Much Emphasis on Cases in Practice?",
        "author": "Glass_Resolution_307",
        "url": "https://www.reddit.com/r/LawSchool/comments/11edo0y/is_there_as_much_emphasis_on_cases_in_practice/",
        "text": "I'm a 1L in law school and the readings and class times are like 70% devoted to cases and 30% to the general rules. The exams seem to invert this focus with more on the rules than the cases. I've wrote exams where I have cited one or less cases and done well. Many of the cases seem to be exceptions to the rule or border cases; there are few slam dunks. I'm starting to feel like the cases don't matter that much.\n\nIn practice, how important are cases?",
        "created_utc": 1677603459,
        "upvote_ratio": 1.0
    },
    {
        "title": "The CDO is Useless At My School",
        "author": "Ozzy_HV",
        "url": "https://www.reddit.com/r/LawSchool/comments/11edlqi/the_cdo_is_useless_at_my_school/",
        "text": "That is all.\n\nAnybody else?",
        "created_utc": 1677603296,
        "upvote_ratio": 1.0
    },
    {
        "title": "LSAT study app",
        "author": "CactusToday",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ede1f/lsat_study_app/",
        "text": "Does anyone know of a good study app for me to download on my phone? I already use the Lawhub LSAT prep online to take practice tests, but I want an app that I can also use to do practice questions in my free time-- like at lunch or before class starts. I've looked through the play store and there are a bunch of apps, so I figured I'd ask here to see if one is superior. Thanks!",
        "created_utc": 1677602771,
        "upvote_ratio": 1.0
    },
    {
        "title": "Internship Conundrum",
        "author": "oceanmlx",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ecy2r/internship_conundrum/",
        "text": "I was offered a remote internship in an area of law that I am semi-interested in. I accepted this offer verbally over the phone. No documentation has been filled out and I have not signed anything committing to this internship. They previously mentioned having my intern this summer and fall. I would be interested in doing the internship in the fall, but not sure how to explain that or even if that's a plausible idea if I am not doing the summer session.\n\nHowever, yesterday I was offered my dream internship. I have wanted to intern at this particular place my entire law school career and I feel that it will really boost my chances of getting into the particular area of law that I am interested in. I have interviewed several times here and finally got the offer this time around. \n\nLong story short, how should I let the first internship know that I would like to rescind my acceptance of their offer?",
        "created_utc": 1677601698,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are non-answer Rule 12 motions allowed to be amended as a matter of course within 21 days too, or does that only apply to complaints and answers?",
        "author": "garrettgravley",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ecmyj/are_nonanswer_rule_12_motions_allowed_to_be/",
        "text": "",
        "created_utc": 1677600993,
        "upvote_ratio": 1.0
    },
    {
        "title": "Federal Honors Hiring?",
        "author": "solomonjsolomon",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ecmv0/federal_honors_hiring/",
        "text": "Does anybody have experience with a Federal Honors Attorney hiring process?\n\nI was referred for an interview with a few field offices for an agency over a week ago after hearing nothing for six months. I immediately reached out to the listed contact to ask if I could update my application packet (again, it’s been about six months…) and heard nothing from her either. \n\nObviously I have other irons on the fire. I would really like this position though. Anybody know what the timelines are like? Also if there might be a better sub for this please let me know!",
        "created_utc": 1677600986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Taking food from FedSoc events",
        "author": "remembermefrombefore",
        "url": "https://www.reddit.com/r/LawSchool/comments/11eciyq/taking_food_from_fedsoc_events/",
        "text": "Is it morally bankrupt of me to go to FedSoc events to eat their food even if I am against everything they stand for? And should I care?",
        "created_utc": 1677600723,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wrote a poem about my favorite contracts case",
        "author": "diner_coffee",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ecie7/i_wrote_a_poem_about_my_favorite_contracts_case/",
        "text": "Replevin for a cow named Rose\n\nfor she’s the one that Sherwood chose.\n\nThe Walkers said she would not breed;  \n\nsupposedly Sherwood agreed! \n\nBut wait! Twas learned she was with calf, \n\nthe Walkers gave a nervous laugh - \n\n“we thought she’d sell for butcher’s steak; \n\nrescind the deal! Invoke **mistake**!”\n\nBut did this lapse go to the *root*,\n\nwas it enough to win the suit? \n\nOr was it but a minor thing \n\nthat sanction-laden lawyers bring? \n\nWas Rose the cow defendants sold? \n\nThat Sherwood bought? Would Morse uphold? \n\nDid what was sold in fact exist? \n\nThe cow for sure had been dismissed\n\nto what it could *produce*, or make, \n\nbut Rose was Rose, forget mistake, \n\nfor you know how the saying goes: \n\nA Rose is a rose is a rose.",
        "created_utc": 1677600684,
        "upvote_ratio": 1.0
    },
    {
        "title": "NYLE",
        "author": "Fresh_Advance6094",
        "url": "https://www.reddit.com/r/LawSchool/comments/11eb8s3/nyle/",
        "text": "Anyone else wait too long to do the NYLC videos and the course videos won’t load today?",
        "created_utc": 1677598223,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for Crim outlines (University at Buffalo, Binder)",
        "author": "contemplativemustard",
        "url": "https://www.reddit.com/r/LawSchool/comments/11eb79w/looking_for_crim_outlines_university_at_buffalo/",
        "text": "Professor Guyora Binder is visiting my law school this semester and is teaching 1L Crim law. He normally teaches at University at Buffalo School of Law. If you have taken his crim law class, could you send me an outline? Thanks in advance!",
        "created_utc": 1677598164,
        "upvote_ratio": 0.99
    },
    {
        "title": "is morality a social construct",
        "author": "franticmaniac",
        "url": "https://www.reddit.com/r/LawSchool/comments/11eb0s4/is_morality_a_social_construct/",
        "text": "Or do we have an innate sense of what is right or not as humans...\n\nIf you think that we do have an innate sense,how are sure that its not from being told whats \"right or wrong\" as a kid by your guardians?",
        "created_utc": 1677597905,
        "upvote_ratio": 1.0
    },
    {
        "title": "Studicata Videos for Evidence",
        "author": "jjjjjjjjabs13",
        "url": "https://www.reddit.com/r/LawSchool/comments/11eaeez/studicata_videos_for_evidence/",
        "text": "Are they accurate?",
        "created_utc": 1677597158,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I take this internship?",
        "author": "burnaboy3685",
        "url": "https://www.reddit.com/r/LawSchool/comments/11eabq1/should_i_take_this_internship/",
        "text": "So I have a 1L summer internship lined up with this notable lawyer who graduated from one of the top business schools and law schools in my country and he is a notable alumnus turned politician. Currently his firms deals with immigration, business and civil matters.\n\nThe problem is he’s currently facing finance related charges from his political career. Should I take it or would this look poor on my résumé?\n\nI want to add that yes he is innocent until proven guilty but I’m worried potential employers will look down on this during OCIs.",
        "created_utc": 1677597067,
        "upvote_ratio": 1.0
    },
    {
        "title": "Odds I get 1L offer revoked/C+F Problems?",
        "author": "IndependentKool",
        "url": "https://www.reddit.com/r/LawSchool/comments/11e997h/odds_i_get_1l_offer_revokedcf_problems/",
        "text": "For employment forms, I have to list all jobs from the last 10 years.\n\nTwo years ago, I resigned after I was caught high at work. I'm worried if I disclose that fully here that my summer offer will get revoked, but I also worry that if I'm not honest/too vague that I'll have C+F problems.\n\nThoughts on how to handle this? Should I be worried?",
        "created_utc": 1677595788,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I give up my goal of securing a job by graduation?",
        "author": "Artistic_Art_425",
        "url": "https://www.reddit.com/r/LawSchool/comments/11e98wy/should_i_give_up_my_goal_of_securing_a_job_by/",
        "text": "3L here. I've been applying to jobs like crazy since November (whatever jobs come up, there really hasn't been anything out there unless I just suck at searching). I had one interview 2 weeks ago for a job I don't really want in public interest and seems like they are ghosting me now. My goal was to secure a position before graduation, but it is growing more unlikely as the weeks pass. My advisor told me if I don't have a job by March/April, I should be worried. So that's fun :)\n\nShould I give up my goal? What are you doing to search for jobs? I am having an internal crisis HELP",
        "created_utc": 1677595777,
        "upvote_ratio": 1.0
    },
    {
        "title": "International and Comparative Law",
        "author": "jennybcatz",
        "url": "https://www.reddit.com/r/LawSchool/comments/11e935j/international_and_comparative_law/",
        "text": "I'm looking to study international and comparative law. Is anyone here currently on that track? Do you love it as much as you thought you would? Does anything surprise you now that you're in the thick of it? I'm looking to learn a little more. Things you wish you'd known?",
        "created_utc": 1677595582,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I stay in my law school city to study for the bar? I'll spend 3k in rent (total) and have no distractions",
        "author": "urmcycle21",
        "url": "https://www.reddit.com/r/LawSchool/comments/11e8lgl/should_i_stay_in_my_law_school_city_to_study_for/",
        "text": "",
        "created_utc": 1677594989,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crim Pro question: Can someone explain the difference between Brady and Giglio to me like I'm 5?",
        "author": "lemur_queen7",
        "url": "https://www.reddit.com/r/LawSchool/comments/11e8jfl/crim_pro_question_can_someone_explain_the/",
        "text": "My entire class is confused, and our professor has given us a different answer every time we ask. My most recent class notes say Brady = Bias in the case itself, so exculpatory evidence to poke holes in what a person said in a specific case, whereas Giglio = information separate from the case, like someone lied in the past. \n\nI initially thought that Giglio was basically an extension of Brady and that they go hand in hand, but my professor wants us to be able to identify the different in a fact pattern.",
        "created_utc": 1677594922,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I stay in my distraction free law school city to study for the bar? I'll be taking the bar a few states away but im worried about summer distractions. Is distraction free studying worth $2500",
        "author": "Prior_Map2531",
        "url": "https://www.reddit.com/r/LawSchool/comments/11e7xhd/should_i_stay_in_my_distraction_free_law_school/",
        "text": "",
        "created_utc": 1677594191,
        "upvote_ratio": 1.0
    },
    {
        "title": "Online News King - Catch Up The Uppermost News Around World",
        "author": "charlottethurre",
        "url": "https://onlinenewsking.com/new-mexico-car-accident-laws-3-things-to-know/+N1:N66",
        "text": "",
        "created_utc": 1677593065,
        "upvote_ratio": 1.0
    },
    {
        "title": "MPRE",
        "author": "No_Butterscotch9528",
        "url": "https://www.reddit.com/r/LawSchool/comments/11e5jnr/mpre/",
        "text": "How much time should I actually study for the MPRE? I'm taking it in March, and was planning on doing the majority of my studying over spring break. Will one week be enough? Too much? I absolutely want to pass, but I also have other things I need to do so I don't want to put in more time than I have to. \n\nIf you passed - how much did you study?\nIf you failed - what do you wish you did differently?\nHaven't taken yet - what's your plan?",
        "created_utc": 1677589417,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Australia does constitutional law fall under civil law?",
        "author": "Theorem465",
        "url": "https://www.reddit.com/r/LawSchool/comments/11e58xg/in_australia_does_constitutional_law_fall_under/",
        "text": "",
        "created_utc": 1677588547,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Australia does consumer law fall under civil law?",
        "author": "Theorem465",
        "url": "https://www.reddit.com/r/LawSchool/comments/11e4pe2/in_australia_does_consumer_law_fall_under_civil/",
        "text": "",
        "created_utc": 1677586870,
        "upvote_ratio": 1.0
    },
    {
        "title": "0L Tuesday Thread",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/LawSchool/comments/11e3a5e/0l_tuesday_thread/",
        "text": " \n\nWelcome to the 0L Tuesday thread. Please ask pre-law questions here (such as admissions, which school to pick, what law school/practice is like etc.)\n\nRead the [FAQ](http://www.reddit.com/r/lawschool/wiki/faq/). Use the search function. Make sure to list as much pertinent information as possible (financial situation, where your family is, what you want to do with a law degree, etc.). If you have questions about jargon, check out the [abbreviations glossary](https://www.reddit.com/r/LawSchool/wiki/abbreviations).\n\nIf you have any pre-law questions, feel free join our [**Discord Server**](https://discord.gg/Qhxy4sF) and ask questions in the 0L channel.\n\n**Related Links:**\n\n* [Official LSAC Admissions Calculator](https://officialguide.lsac.org/release/ugpalsat/ugpalsat.aspx) (self explanatory, presumably sources data from previous admissions cycles, likely larger pool of data too. Useful for non-splitters).\n* [Unofficial LSN Admissions Calculator](http://mylsn.info/) (uses crowdsourced LSN data to calculate % admissions chances).\n* [Law School Numbers](http://www.lawschoolnumbers.com/) (for admissions graphs and crowdsourced admissions data).\n* [LST Score Reports](https://www.lstreports.com/) (for jobs data for individual schools)\n* [List of Guides and Other Useful Content for Rising 1Ls](https://www.reddit.com/r/LawSchool/comments/95mxgz/aggregated_content_for_1ls_from_around_the_forums/)\n* [TLS Biglaw Placement Class of 2016](http://www.top-law-schools.com/forums/viewtopic.php?f=1&amp;t=276222) | [TLS Biglaw Placement Class of 2015](http://top-law-schools.com/forums/viewtopic.php?f=1&amp;t=262376) | [NLJ250 Class of 2010](http://pdfserver.amlaw.com/nlj/goto%20law%20schools_main.pdf) | [NLJ250 Class of 2009](http://pdfserver.amlaw.com/nlj/law%20schools_charts_page12.pdf) | [NLJ250 Class of 2008](http://www.law.com/img/nlj/charts/20090223gotoschools.jpg) | [NLJ250 Class of 2007](http://www.law.com/img/nlj/charts/20080414gotoschools.jpg) | [NLJ250 Class of 2005](http://pdfserver.amlaw.com/nlj/20080414employment_trends.pdf)\n* [/r/LawSchoolAdmissions 2016 Biglaw and Employment Data](https://www.reddit.com/r/lawschooladmissions/comments/643pwm/2016_aba_employment_reports/) (includes 200 law schools)\n* [TLS School Medians Class of 2020](https://docs.google.com/spreadsheets/d/1XfblJqji8wlaCbc9cUTAheOsZPRRaP_hyWafn3NEYQE/edit#gid=299903710).\n\n**Related Subreddits:**\n\n* [r/LawschoolAdmissions](https://www.reddit.com/r/LawschoolAdmissions/)\n* [r/LSAT](https://www.reddit.com/r/LSAT/)",
        "created_utc": 1677582036,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you gave up a T14 to attend a T30 or T50… do you regret it?",
        "author": "pickle-bimbo",
        "url": "https://www.reddit.com/r/LawSchool/comments/11e2r3w/if_you_gave_up_a_t14_to_attend_a_t30_or_t50_do/",
        "text": "[removed]",
        "created_utc": 1677580033,
        "upvote_ratio": 1.0
    },
    {
        "title": "Supreme Court Humor: Is marriage a financial or liberty interest?",
        "author": "scotusreacts",
        "url": "https://youtube.com/watch?v=LgB8apk7Pa4&amp;feature=share",
        "text": "",
        "created_utc": 1677565256,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I start small in a small firm and work my way up, or start in a big firm immediately?",
        "author": "MirrorBane",
        "url": "https://www.reddit.com/r/LawSchool/comments/11dy8wk/should_i_start_small_in_a_small_firm_and_work_my/",
        "text": "Hi all, I'm a fresh graduate of Bar School. \n\nI am currently doing a paralegal job in a small law firm and have the option to convert it to a 1-2 year permanent contract. My boss is a great mentor - he's supportive, gives good feedback and treats his staff well. The working hours are manageable, I'm home at 8pm and am not harassed on weekends. It sounds great but there's a nagging thought at the back of my head I'm 'taking the easy way out.' In particular, I'm questioning if my decision not to apply to bigger corporate-commercial law firms is a bad one. \n\nSome context: between 2019-2021, I suffered terrible depression. I started balding, getting bad headaches and couldn't get out of bed at all and almost dropped out of Bar School (but I didn't and pushed on and finished it!). After 2 years of therapy, meds and lifestyle changes I am much better. I am not the same person as I was before - competitive, jealous of my peers and constantly stressed. I like the new me a lot more. However, I also want to earn a decent living and of course, learn more about the law because I do find it fascinating. I do want to work in a big law firm one day because some of the deals they do can be really exciting. \n\nSo that brings me to the question - should I accept this offer at this small firm where my mental health is protected, get some experience and learn from my great boss for a while and then try for bigger firms? Or should I shoot immediately for the bigger ones and start big and go up from there as they say? The bigger firms of course have much better pay and exposure - I'll be exposed to complex M&amp;A transactions, IPOs, capital market stuff etc whereas in this firm it's smaller M&amp;A deals and conveyancing. I went to a relatively good university (the London School of Economics) and have decent extracurriculars and grades (I was a perfectionist Type-A workaholic in uni which is what made me so depressed) so I think I have a good shot of getting into these bigger firms, but as I said - there tends to be a culture of overworking juniors in these firms and poor work life balance. And nowadays there's a culture in these bigger firms of \"home grown partners\" - they're reluctant to hire people from the outside and would rather recruit people straight from university and mold them into partners. \n\nAnyway, I'm really sorry for this essay but I'd appreciate any insights from people who have worked in smaller firms and in biglaw. In short, I value my mental health, friendships and hobbies and would like to start small and build my way up into a bigger law firm slow and steady, but there is a fear that if I don't join a big firm and get grinding immediately, I'll be left behind in terms of exposure and experience because law is a competitive field and when I try to join a bigger firm down the road I'll be beaten out by more talented people.",
        "created_utc": 1677563169,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question",
        "author": "VeterinarianJumpy620",
        "url": "https://www.reddit.com/r/LawSchool/comments/11dy3vu/question/",
        "text": "During OCI for 2L summer employment, will some big law firms &amp; mid law firms overlook GPA due to 1L summer associate experience at a somewhat big firm (not necessarily a biglaw firm but still big)? Or is GPA still the major determining factor of hiring decisions?",
        "created_utc": 1677562700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here's another one: how do you say \"I think you're an idiot/ what you said made no sense\" in legalese? 😁",
        "author": "Glittering_Pasta",
        "url": "https://www.reddit.com/r/LawSchool/comments/11dxscc/heres_another_one_how_do_you_say_i_think_youre_an/",
        "text": "",
        "created_utc": 1677561653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here’s another one: how do you say “I think you’re an idiot/ what you said made no sense” in legalese? 😁",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677561596,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tired and burnt out from studying for Midterms so let’s play a little DND. If you were doing a one shot where you have to fight your way thru the current Supreme Court, which justice or judge would you choose to be your character and what would their special ability be?",
        "author": "rasputinBBQ",
        "url": "https://www.reddit.com/r/LawSchool/comments/11dx279/tired_and_burnt_out_from_studying_for_midterms_so/",
        "text": "",
        "created_utc": 1677559306,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did I blow my chances?",
        "author": "Goji_berry97",
        "url": "https://www.reddit.com/r/LawSchool/comments/11dwlim/did_i_blow_my_chances/",
        "text": "I made a mistake in my summer job application. I recognized it pretty quickly after submitting it. I uploaded the wrong resume which had a formatting error. I didn’t know what to do so I sent another application correcting the mistake. Should I reach out to let the recruiter that they should refer to the second application? Have I blown my chances? I’m spiraling because this is a job I really wanted and I worked really hard on my application.",
        "created_utc": 1677557828,
        "upvote_ratio": 0.99
    },
    {
        "title": "Should I Expect My Big Law Firm to Pay for Bar Prep Classes?",
        "author": "tntuszynski",
        "url": "https://www.reddit.com/r/LawSchool/comments/11dwi2u/should_i_expect_my_big_law_firm_to_pay_for_bar/",
        "text": "Hi, 2L here (T20). I’ve been getting emails from Bar Prep companies advertising deals for buying the package as a 2L. However, I have a SA job lined up this summer at a Big Law firm (not the biggest firm but multinational) and have heard they can often pay for Bar Prep Courses. What have been your experiences with firms offering this as an option after your SA position? Should I expect it?",
        "created_utc": 1677557534,
        "upvote_ratio": 1.0
    },
    {
        "title": "Federal Magistrate Judicial Externship",
        "author": "Imp_Thot",
        "url": "https://www.reddit.com/r/LawSchool/comments/11dwakj/federal_magistrate_judicial_externship/",
        "text": "I was hoping to get some advice on my situation. I’m a 1L at a T50. I was offered a judicial externship with a federal magistrate judge. It’s unpaid and has a 1hr commute each way. I can make that work, but it isn’t ideal.\n\nI also have an interview later this week for a really interesting summer job that would pay (not a lot, but above minimum wage) in a practice area I’m interested in. I am interested in both positions and don’t know which I would rather do if given the choice.\n\nI have 24 hours to give the judge a response. Assuming that I am not given more time to consider the position, should I just accept it?",
        "created_utc": 1677556885,
        "upvote_ratio": 1.0
    },
    {
        "title": "top 100 gk questions in hindi",
        "author": "hindi839",
        "url": "https://youtu.be/D7lgh9SDlAw",
        "text": "",
        "created_utc": 1677555255,
        "upvote_ratio": 1.0
    },
    {
        "title": "law review",
        "author": "IllustriousTheme6276",
        "url": "https://www.reddit.com/r/LawSchool/comments/11dvqtl/law_review/",
        "text": "for those who did not get on but got on as a 2L if your school provides an open-note competition, any tips?",
        "created_utc": 1677555233,
        "upvote_ratio": 1.0
    },
    {
        "title": "Proof of income for summer associate housing lease",
        "author": "flabbergastpenguin",
        "url": "https://www.reddit.com/r/LawSchool/comments/11dvqqs/proof_of_income_for_summer_associate_housing_lease/",
        "text": "Hello I cannot convince my partner that it would be totally normal to ask his big law firm for a letter serving S proof of employment and income for the purpose of securing housing this summer.\n\nPlease confirm or deny.",
        "created_utc": 1677555226,
        "upvote_ratio": 1.0
    },
    {
        "title": "Missed deadlines - help/advice needed :(",
        "author": "always_appealing",
        "url": "https://www.reddit.com/r/LawSchool/comments/11dvq55/missed_deadlines_helpadvice_needed/",
        "text": "My anxiety &amp; depression peaked for the last week (the worst I've felt in years), and I could not complete my papers. I tried, but mental health got the best of me. I also made the mistake of feeling ashamed and not contacting the professor. I'm slowly picking myself back up and coming back to reality. I received an e-mail asking if I've submitted my paper. Any advice on how to draft an e-mail asking for an extension now that it is past the deadline?",
        "created_utc": 1677555175,
        "upvote_ratio": 1.0
    },
    {
        "title": "Popular law school influencers?",
        "author": "nil226",
        "url": "https://www.reddit.com/r/LawSchool/comments/11dvkbf/popular_law_school_influencers/",
        "text": "Are there any Instagram pages that give insight into what  life is like at their school?",
        "created_utc": 1677554704,
        "upvote_ratio": 1.0
    }
]