[
    {
        "title": "Waiting on Fall 1L grades…",
        "author": "Previous_Ladder_3799",
        "url": "https://www.reddit.com/r/LawSchool/comments/107085b/waiting_on_fall_1l_grades/",
        "text": "",
        "created_utc": 1673226421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Patents exemptions",
        "author": "Senddarkmemes",
        "url": "https://www.reddit.com/r/LawSchool/comments/10700s7/patents_exemptions/",
        "text": "What new patent exemptions would you introduce? \n\nFor example, ones dealing with new technology...",
        "created_utc": 1673225888,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking Resume Advice",
        "author": "person0088",
        "url": "https://www.reddit.com/r/LawSchool/comments/106zncr/seeking_resume_advice/",
        "text": "I’m a 3L putting together job applications for post-grad employment. \n\nMy grades are average (right at the median), but I did well in evidence. I’m applying to firms that do civil litigation.\n\nShould I put on my resume that I received a transcript notation for best exam in Evidence? It does say this on my transcript, but it’s one line and can be easily overlooked when skimming through it.",
        "created_utc": 1673224905,
        "upvote_ratio": 1.0
    },
    {
        "title": "Make up date for bar exam?",
        "author": "lssr94",
        "url": "https://www.reddit.com/r/LawSchool/comments/106zisf/make_up_date_for_bar_exam/",
        "text": "The July bar exam falls out on a major fast day for religious Jews and I'm wondering if I should ask for a make up date? I've never heard of a make up date for the bar, but it's a 25-hour complete fast so I really don't want to sit for it on those days. Would it be worthwhile to ask or am I wasting my time?",
        "created_utc": 1673224573,
        "upvote_ratio": 1.0
    },
    {
        "title": "I completely turned things around . . . but I don't know how to convince myself that things are going to be okay.",
        "author": "goobing1",
        "url": "https://www.reddit.com/r/LawSchool/comments/106yt6h/i_completely_turned_things_around_but_i_dont_know/",
        "text": "This is a throw-away account because I need to vent. I don't really know what I'm looking for, but I know I'll feel better even just writing this down. \n\nI am feeling so melancholy now that winter break is coming to an end. I did absolutely terrible my 1L year, receiving three C+'s, and some B's and B+'s. I was devastated when I got my grades back, and I ended up being one spot above the bottom 20% of the class, which would have required me to enroll in the academic success program. The program director tried to make me enroll in the courses anyways, but I negotiated my way out of it, took some summer courses, and have brought up my GPA substantially. Since then, I have gotten all A's and one B+, and I even got the highest grade in a summer class which was not eligible for a CALI award at my school. I ended my first semester of my 2L year with all A's, made Dean's List, and really turned things around.\n\nEven though I made some huge changes, the imposter syndrome is so real. I go to a small school and because of the class sizes and the way things are curved, somewhere between 2-4 people received A's in my courses. I took classes with 3L's in the top 15 of their class, and I literally cannot comprehend *how* I got one of the best grades. I asked my professors for copies of my exam to compare with the model answers, and all of my professors congratulated me for doing great work on the final, but I still don't feel better about things. I know I understood things and I felt good and confident during the exams, but I'm feeling so anxious about the start of the new semester, maintaining my stride and continuing to redeem myself. I'm dreading receiving my rank in a week because I don't know if I'll ever be able to overcome my 1L GPA.\n\nHow can I get over this feeling? I've been depressed in the past, but I don't feel that way now. At first I was really excited about doing well, but my family isn't super supportive and have said things like \"I'm not surprised,\" or \"didn't you expect to do well?\" etc., rather than celebrating the accomplishment. I'm embarrassed to tell anyone how poorly I did last year, so maybe that has something to do with it. Genuinely, I just feel so anxious and like this was a fluke and I'll flop again in the spring, and I'm worried about my anxiety sabotaging my performance when classes start again. Someone snap me out of this - roast me, give it to my straight, whatever I need to hear, I'm open to it.",
        "created_utc": 1673222731,
        "upvote_ratio": 1.0
    },
    {
        "title": "Drug testing for summer legal internship at US Attorney's Office?",
        "author": "biglawbigdream",
        "url": "https://www.reddit.com/r/LawSchool/comments/106ycxs/drug_testing_for_summer_legal_internship_at_us/",
        "text": "[removed]",
        "created_utc": 1673221595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where did most of ur debt come from?",
        "author": "wlmwlc",
        "url": "https://www.reddit.com/r/LawSchool/comments/106y108/where_did_most_of_ur_debt_come_from/",
        "text": "I’m going to try to work through college and major in poli Sci debt free.\n\nIs most of ur debt from Law School, college or a mix",
        "created_utc": 1673220773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lowest grade of law school in a non-bar tested elective",
        "author": "Pretend-Battle2280",
        "url": "https://www.reddit.com/r/LawSchool/comments/106xdge/lowest_grade_of_law_school_in_a_nonbar_tested/",
        "text": "I did pretty well in my other classes around or above my schools curve. But got a freaking C minus in an elective I took for fun, as it’s not on the bar. I know I’m not stupid, but wow am I feeling a little upset right now. I had a death in the family, was adjusting to work/school, and focusing on my other harder courses, and definitely put less focus on this class which was clearly my mistake. Has this happened to anyone else? Just praying I don’t do this poorly in another course.",
        "created_utc": 1673219212,
        "upvote_ratio": 1.0
    },
    {
        "title": "For Anyone Considering Dropping Out",
        "author": "Adorable-Volume2247",
        "url": "https://www.reddit.com/r/LawSchool/comments/106wvh8/for_anyone_considering_dropping_out/",
        "text": "\"A\" Students have the most opportunity, especially those at the top schools. And what do they use it for? To get OUT of practicing ASAP (Professors, judges, work in business, etc.).",
        "created_utc": 1673218014,
        "upvote_ratio": 1.0
    },
    {
        "title": "Berkeley study abroad?",
        "author": "hopelessJD69",
        "url": "https://www.reddit.com/r/LawSchool/comments/106weol/berkeley_study_abroad/",
        "text": "Hey guys, I’d love to talk to a Berkeley law student and would greatly appreciate if someone could PM me (preferably someone doing IL). About to submit my last app of the cycle to Berkeley, but I’m wondering if Berk really has no study abroad or if I’m just missing something. The field placement do look incredible though. Thanks!",
        "created_utc": 1673216908,
        "upvote_ratio": 1.0
    },
    {
        "title": "Retaking 1L Course?",
        "author": "blckv0",
        "url": "https://www.reddit.com/r/LawSchool/comments/106wed5/retaking_1l_course/",
        "text": "I did horribly for one of the 1L courses, which I ended up with C-. This brought down my gpa to 2.7-2.8 ish and I’m devastated. I don’t even know if I’m allowed to retake the course because I technically didn’t failed. But I don’t think I can secure a internship in government/prosecution related. I feel so lost right now.",
        "created_utc": 1673216887,
        "upvote_ratio": 1.0
    },
    {
        "title": "Berkeley 0L questions",
        "author": "hopelessJD69",
        "url": "https://www.reddit.com/r/LawSchool/comments/106wcc0/berkeley_0l_questions/",
        "text": "Hey guys I’m a 0L and about to submit my last app of the cycle to Berkeley. I’d appreciate immensely if a Berkeley student could PM me (preferably someone studying int’l law). I just have a few Q’s - specifically about the apparent lack of study abroad. The field placements look amazing but I’m wondering if there is really NO study abroad",
        "created_utc": 1673216746,
        "upvote_ratio": 1.0
    },
    {
        "title": "Berkeley study abroad",
        "author": "hopelessJD69",
        "url": "https://www.reddit.com/r/LawSchool/comments/106wb2h/berkeley_study_abroad/",
        "text": "Hey guys I’m a 0L and about to submit my last app of the cycle to Berkeley. I’d appreciate immensely if a Berkeley student could PM me (preferably someone studying int’l law). I just have a few Q’s. Thanks!",
        "created_utc": 1673216661,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I suck at criminal law?",
        "author": "usernamedoentwork",
        "url": "https://www.reddit.com/r/LawSchool/comments/106vlha/why_do_i_suck_at_criminal_law/",
        "text": "Somehow I always have my lowest score in criminal law class. I am a hard-working student, I usually pass all of the subjects with an A(90-100) and rarely B1(85-90). But I pass Criminal law always from the border and tbh I have no idea what am I doing wrong.\n\nWe review the subject with my friends before exams and I feel confident but when it comes to exams and we are solving cases, I know I give the right answers but when the results are out it is usually 1/2 points above the passing score.\n\nI have always talked with the professor and she tells me where I lack on my paper but somehow I still barely pass. I know that the professor does not have any problem with me, she is a great woman and she doesn't give even one point less or more to anyone. I don't want an A but I want to get at least a score higher than 70. I know I might sound greedy but I am in a really competitive class. Even though it is our hardest subject somehow everyone gets min 80 on the exam. Most people have around a 3.9+ Gpa and I feel like I am lacking and wanna do better.\n\nCan anybody give me some tips to give a better answer for criminal law cases?",
        "created_utc": 1673215019,
        "upvote_ratio": 1.0
    },
    {
        "title": "In what ways war is a legal institution?",
        "author": "usernamedoentwork",
        "url": "https://www.reddit.com/r/LawSchool/comments/106v77n/in_what_ways_war_is_a_legal_institution/",
        "text": "",
        "created_utc": 1673214088,
        "upvote_ratio": 1.0
    },
    {
        "title": "Notre Dame 1L AMA",
        "author": "lsquestionthrowaway5",
        "url": "https://www.reddit.com/r/LawSchool/comments/106uza2/notre_dame_1l_ama/",
        "text": "[removed]",
        "created_utc": 1673213583,
        "upvote_ratio": 1.0
    },
    {
        "title": "4 years ago I was facing 5 years in state prison and I have two felonies because of it. Finished my first semester with a 3.6 gpa.",
        "author": "JeffreyEpstein0331",
        "url": "https://www.reddit.com/r/LawSchool/comments/106uukc/4_years_ago_i_was_facing_5_years_in_state_prison/",
        "text": "Just wanted to share without it sounding like I’m bragging to someone in real life. But I was brought to tears when I got my grades back. I actually have what it takes to be a lawyer with felonies who can finally help people who are living the hell that I lived. Fuck your money, I know pain, and people deserve second chances.",
        "created_utc": 1673213288,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confusion over criminal responsibility",
        "author": "Slug_Philosopher",
        "url": "https://www.reddit.com/r/LawSchool/comments/106uazc/confusion_over_criminal_responsibility/",
        "text": "I know there is not a set rule for the age of criminal responsibility but I thought 7 and under were completely barred from criminal intent and criminal responsibility.",
        "created_utc": 1673212024,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L diversity summer associate application tips",
        "author": "faisal-a",
        "url": "https://www.reddit.com/r/LawSchool/comments/106u9xc/1l_diversity_summer_associate_application_tips/",
        "text": "I'm a racially diverse 1L at a T25 law school and I planned on sending my applications now, given that most of my grades just came out (they're all B+s with one more grade pending). When I was researching positions, I noticed that they opened up way earlier in December before the fall semester even ended. Am I too late to start applying now, and are my grades even good enough? Thanks",
        "created_utc": 1673211952,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have Critical pass flash cards 2021–only some written on otherwise in amazing condition—major discount if anyone interested. Big help for the bar exam and for law school in general",
        "author": "Born_Unit3635",
        "url": "https://www.reddit.com/r/LawSchool/comments/106t102/i_have_critical_pass_flash_cards_2021only_some/",
        "text": "",
        "created_utc": 1673208983,
        "upvote_ratio": 1.0
    },
    {
        "title": "Transfer",
        "author": "SunTasty9232",
        "url": "https://www.reddit.com/r/LawSchool/comments/106raml/transfer/",
        "text": "Just finished 1st semester 1L: 3.48 GPA and ranked 17 (about top 12.5%) at a T3. What rank of schools would I realistically have a chance to transfer to? Any advice would be appreciated!",
        "created_utc": 1673204844,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m in the top half!!..",
        "author": "No_Distribution_5238",
        "url": "https://www.reddit.com/r/LawSchool/comments/106qs5b/im_in_the_top_half/",
        "text": "Of the bottom half in my class. Sort of expected that so I’m actually happy! Cheers to all the people out there that also barely evaded academic probation. We made it!",
        "created_utc": 1673203627,
        "upvote_ratio": 1.0
    },
    {
        "title": "C- in Contract",
        "author": "blckv0",
        "url": "https://www.reddit.com/r/LawSchool/comments/106qpvo/c_in_contract/",
        "text": "help what do I do.. I simply cannot process that I did that bad when I walked out of there pretty confident. I have avg of 2.757 gpa now. Would I still be able to get an government internships. Looking for advice.",
        "created_utc": 1673203481,
        "upvote_ratio": 1.0
    },
    {
        "title": "Course selection advice for someone interested in Government Contract Law?",
        "author": "peacherino1",
        "url": "https://www.reddit.com/r/LawSchool/comments/106qbui/course_selection_advice_for_someone_interested_in/",
        "text": "I'm a 2L interested in getting into government contract work. I have a choice between secured transactions and land use. \n\nFor a little background, I did well in and enjoyed contracts, property, T&amp;E, and admin law. \n\nThank you!",
        "created_utc": 1673202537,
        "upvote_ratio": 1.0
    },
    {
        "title": "LLM degree",
        "author": "naomicali",
        "url": "https://www.reddit.com/r/LawSchool/comments/106p3i3/llm_degree/",
        "text": "Hi there! Is there anyone on here who is currently enrolled in an LLM program or who has completed one? I’m a law school graduate from the Netherlands and admitted to an LLM program in the US for the 2023-24 academic year and would love to connect with someone who can answer some of my questions :)",
        "created_utc": 1673199612,
        "upvote_ratio": 1.0
    },
    {
        "title": "is reporting false information of someone possesssing a gun on campus a criminal act? will it fall under the Federal Court system? The campus did said the case was close because no gun was found. what should I do about it?",
        "author": "Any_Improvement3852",
        "url": "https://www.reddit.com/r/LawSchool/comments/106mwiw/is_reporting_false_information_of_someone/",
        "text": "",
        "created_utc": 1673194303,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L Summer: US In-House or Foreign Law Firm?",
        "author": "lawschoolcandidate",
        "url": "https://www.reddit.com/r/LawSchool/comments/106ma6s/1l_summer_us_inhouse_or_foreign_law_firm/",
        "text": "Goal is BigLaw in 2L summer and post-graduation. Would it be better to do a legal/compliance internship at a large US company or a transactional/litigation internship in a foreign city that doesn’t have a big name but is elite nationally?\n\n[View Poll](https://www.reddit.com/poll/106ma6s)",
        "created_utc": 1673192762,
        "upvote_ratio": 1.0
    },
    {
        "title": "40+ incoming 1L PT’er…",
        "author": "Jasonusf",
        "url": "https://www.reddit.com/r/LawSchool/comments/106lxxd/40_incoming_1l_pter/",
        "text": "I know this will vary some, but I’ll be starting a night PT program in August and work a full time job. I’m curious how much the PT’ers study outside of class?",
        "created_utc": 1673191868,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone willing to share their 2L cover letter?",
        "author": "lawschoollongshot",
        "url": "https://www.reddit.com/r/LawSchool/comments/106ls5e/anyone_willing_to_share_their_2l_cover_letter/",
        "text": "I’d really appreciate it. I’m applying to mid sized and small firms. Thanks.",
        "created_utc": 1673191464,
        "upvote_ratio": 1.0
    },
    {
        "title": "At my school, professors are free to give out grades of D and F as much as they want despite the B average curve. Does that make the school predatory?",
        "author": "WriteOrDie1997",
        "url": "https://www.reddit.com/r/LawSchool/comments/106kmzg/at_my_school_professors_are_free_to_give_out/",
        "text": "",
        "created_utc": 1673188406,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have y'all ever had to appeal grades?",
        "author": "garrettgravley",
        "url": "https://www.reddit.com/r/LawSchool/comments/106k5wg/have_yall_ever_had_to_appeal_grades/",
        "text": "I'm in a situation where I have to appeal. Not because I'm so dissatisfied with my performance on my final and other assignments. I actually did super well, and I'm never going to be one of those students that makes it a professor's problem that I fucked up. \n\nI just don't see how my final grade is mathematically correct given the weight of all the assignments and how I actually scored on those respective assignments. \n\nHave any of y'all been in this position before? What was the outcome?",
        "created_utc": 1673187102,
        "upvote_ratio": 1.0
    },
    {
        "title": "i got a c in y legal writing/process class, i worked hard an am a bit ashamed of it. any advice for a 1l",
        "author": "onepokemanz",
        "url": "https://www.reddit.com/r/LawSchool/comments/106jh6y/i_got_a_c_in_y_legal_writingprocess_class_i/",
        "text": "i put a tremendous amount if hours into that class, it was a time sink, the class was very hard everyone complained. but im not making that an excuse, only 1 peerson got an a mostly B a few c+, but for me to flop on a C completely destroys my avg. in under grad i never got a c.\n\nwhat can i do ?",
        "created_utc": 1673185119,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi everyone! I was wondering if anyone has completed their LLM at UCL and/or LSE.",
        "author": "Smooth-Count-5666",
        "url": "https://www.reddit.com/r/LawSchool/comments/106jead/hi_everyone_i_was_wondering_if_anyone_has/",
        "text": "I have offers from both institutions and I’m trying to decide which one would be better.\n\nUCL has a better ranking as an institution  (8th) and it’s doing pretty well in terms of its ranking for law whereas LSE has a better ranking for law (not by much) but ranks quite low as an institution.\n\nMy focus would be on Financial Law so I was wondering if anyone on here could speak about their experiences at either one or both institutions.\n\nMy brain is on fire. \n\nThank you.",
        "created_utc": 1673184873,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quimbee very very out of context",
        "author": "Middle-Pride4304",
        "url": "https://i.redd.it/kbk4daeyntaa1.jpg",
        "text": "",
        "created_utc": 1673184823,
        "upvote_ratio": 1.0
    },
    {
        "title": "3.17 GPA - chances for a solid 1L summer job?",
        "author": "greatsuccess881",
        "url": "https://www.reddit.com/r/LawSchool/comments/106h3jm/317_gpa_chances_for_a_solid_1l_summer_job/",
        "text": "At BC/USC/ND. Curve’s between 3.25-3.30. Could I realistically get a paid internship in house or somewhere else? I know BL is out of the picture.",
        "created_utc": 1673177499,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Hiring]",
        "author": "Newutilities22",
        "url": "https://i.redd.it/6e9oip5ghsaa1.png",
        "text": "",
        "created_utc": 1673170518,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have Critical pass flash cards 2021 if anyone wants at a major discount!! Passed the bar in February and no longer need them. Please message me if your interested",
        "author": "Born_Unit3635",
        "url": "https://www.reddit.com/r/LawSchool/comments/106epvo/i_have_critical_pass_flash_cards_2021_if_anyone/",
        "text": "",
        "created_utc": 1673168861,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to expect from law firm screener for 1L SA?",
        "author": "randyerthanyou1",
        "url": "https://www.reddit.com/r/LawSchool/comments/106e4s2/what_to_expect_from_law_firm_screener_for_1l_sa/",
        "text": "Have my first one this week! Thank you &lt;3",
        "created_utc": 1673166738,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Do I Get Over the B Hump?",
        "author": "Competitive_Cup8079",
        "url": "https://www.reddit.com/r/LawSchool/comments/106degy/how_do_i_get_over_the_b_hump/",
        "text": "I got some B+s, Bs, and B-s. Any tips on how to turn B+s into an A? Is it much more effort? This last semester I did better than 1L. But still Bs!\n\nAverage is typically a B- or B, depending on the class.",
        "created_utc": 1673164145,
        "upvote_ratio": 1.0
    },
    {
        "title": "Taking the bar exam while pregnant",
        "author": "Electrical_Clue_6423",
        "url": "https://www.reddit.com/r/LawSchool/comments/106btop/taking_the_bar_exam_while_pregnant/",
        "text": "[removed]",
        "created_utc": 1673158691,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cover letter",
        "author": "New_Clue_2126",
        "url": "https://www.reddit.com/r/LawSchool/comments/106bfde/cover_letter/",
        "text": "How much of a cover letter should be about the firm? I’d say mines is 20% firm and the rest why I’m interested in that area of law, etc. should I be talking about the firm more?",
        "created_utc": 1673157437,
        "upvote_ratio": 1.0
    },
    {
        "title": "Amjuring classes",
        "author": "ShameMakers",
        "url": "https://www.reddit.com/r/LawSchool/comments/106bdft/amjuring_classes/",
        "text": "Do professors have discretion on awarding these?\n\nI’m a middle of the road 3L\n\nMy gpa is slightly above a 3.0\n\nI found out that I may have the highest grade in my education law class this semester based on the published grades for our assignments. \n\nI made an A+ in the class\n\nBut I looked at previous semesters and haven’t found an amjur for education law at my school. \n\nDoes anyone know how amjur works or what kind of discretion the professor/school has?\n\nThanks.",
        "created_utc": 1673157266,
        "upvote_ratio": 1.0
    },
    {
        "title": "Continue 2nd semester of 1L or start over?",
        "author": "rhema_word",
        "url": "https://www.reddit.com/r/LawSchool/comments/106avlb/continue_2nd_semester_of_1l_or_start_over/",
        "text": "I applied to multiple law schools. I received scholarships offers from all of them but I was most interested in two. I was offered a scholarship covering most of the tuition at one school in the fall and a scholarship for a minimal amount at one in the spring (yes a few law schools have spring starts). I started at the first school in the fall. But I do not like my grades and I know that I could have done better. I had health issues but I am better, now. \nI can still attend the second school without transferring my current grades because I would need a full year of credits to do a transfer. So I would be considered a new 1L. I like this option because I get to start over. This would give me a second chance at a higher GPA. However, I don’t know if it’ll be worth it. Retaking mostly the same classes, starting at a new school, living in a completely new environment, and getting more debt (less scholarship and more tuition). Those are a lot of important factors that I must consider. \nMy other option is stay at my current school and bring my GPA up, which I know that I can do. But most of the comments here state that the first semester is make or break. \nAdvice from law school graduates.  \n(Please be respectful.)",
        "created_utc": 1673155713,
        "upvote_ratio": 1.0
    },
    {
        "title": "Terrible 1L fall grades @T20, are my hopes dashed?",
        "author": "FemmeDe-LaFemme",
        "url": "https://www.reddit.com/r/LawSchool/comments/1069sxa/terrible_1l_fall_grades_t20_are_my_hopes_dashed/",
        "text": "Bottom 10%ile grades this fall, thought I did well.",
        "created_utc": 1673152465,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tax LLM as an avenue into BL?",
        "author": "Bearnye",
        "url": "https://www.reddit.com/r/LawSchool/comments/1069od0/tax_llm_as_an_avenue_into_bl/",
        "text": "Hi all,\n\nI’m a 2L at a lower ranked school but I’m towards the top of my class and enrolled in Federal Income Tax this semester. \n\nMy uncle encouraged me to pursue a tax llm to work with him at his (1-lawyer) firm where he does estate planning, tax, etc. \n\nI’ve been looking more into it and was wondering what career opportunities are available if I get into a top Tax LLM program like NYU or UF. Do they serve as a pipeline into BL? Or is my JD from a lower ranked school a deal breaker? Thanks",
        "created_utc": 1673152093,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m writing a research paper on corporate veil",
        "author": "SirProsecutor",
        "url": "https://www.reddit.com/r/LawSchool/comments/10695ul/im_writing_a_research_paper_on_corporate_veil/",
        "text": "Basically what the title says. I don’t really like writing research papers because I find them boring lmao but I have to write one for a class and it carries a grade so I want to put my best foot forward. Could anyone please suggest how I should go on about it?\n\nAny titles and sub-titles.\n\n(I’m Indian so not the best at English/phrasing)",
        "created_utc": 1673150540,
        "upvote_ratio": 1.0
    },
    {
        "title": "Excuse me but what the fuck",
        "author": "227sclark",
        "url": "https://i.redd.it/bz6bc1gaoqaa1.png",
        "text": "",
        "created_utc": 1673148616,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going through a tough breakup. Would love some advice on how to get through it in law school",
        "author": "lexthelawyer",
        "url": "https://www.reddit.com/r/LawSchool/comments/10682a6/going_through_a_tough_breakup_would_love_some/",
        "text": "Looking for advice from those who’ve been through a breakup in law school. . I didn’t post this on a relationship subreddit because I felt like a law students perspective would be the most valuable. Law students realize the time commitment and stress law school requires, and would understand why the conventional advice of “pick up a hobby” or “focus on something else” may not be practical right now. \n\nI just recently got dumped and I’m having a hard time because I had spent all my free time when not studying or in class giving into the relationship (which I enjoyed because it brought me happiness). Looking forward to seeing and talking to my ex really got me through the tough parts of law school. They were truly my stress release. Now that that’s gone, I’m unsure how to replace that feeling to get me through this semester \n\nI don’t really have time to start any hobbies immediately because my journal note draft is due at the end of this month so all my free time will now go to that. But what can I do in the meantime to replace the feeling of having something to look forward to? What can I do to help me get through the tough parts and stress now that my person is gone?",
        "created_utc": 1673147371,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone explain the difference between a unilateral, option, and offer contract?",
        "author": "Desperate_Sector_810",
        "url": "https://www.reddit.com/r/LawSchool/comments/10679t5/can_anyone_explain_the_difference_between_a/",
        "text": "they run together in my mind sorry I’m an idiot",
        "created_utc": 1673145157,
        "upvote_ratio": 1.0
    },
    {
        "title": "3.7 with a 3.0 curve?",
        "author": "Bright-March5802",
        "url": "https://www.reddit.com/r/LawSchool/comments/1065ywr/37_with_a_30_curve/",
        "text": "Can't see my rank and curious how this might make me look in terms of internships at a lower ranked school, thanks for any help!",
        "created_utc": 1673141520,
        "upvote_ratio": 1.0
    },
    {
        "title": "BOOKED MY FIRST CLASS - don’t give up!!!!!!",
        "author": "hydrangeasaremyfave",
        "url": "https://www.reddit.com/r/LawSchool/comments/1065e4w/booked_my_first_class_dont_give_up/",
        "text": "I did it! I booked my first class!!!!!!\n&amp; if you’re reading this, and you feel discouraged by grades, do not give up!!! I am currently a 2L. I finished 1L first semester in the bottom 50% of my class. I clawed my way up 1L spring but still only made one A-. I truly gave it all I had this past fall and booked a class: A+!!!!!! I’m over the moon ecstatic, but know the pain of feeling like you’re not capable. You ARE capable, you ARE smart, do NOT give up, keep trying!!!! I needed someone to believe in me and I just want to say I believe in you🫶🏻",
        "created_utc": 1673139944,
        "upvote_ratio": 1.0
    },
    {
        "title": "2-207 FlowChart/Parol Evidence",
        "author": "Desperate_Sector_810",
        "url": "https://www.reddit.com/r/LawSchool/comments/10652eb/2207_flowchartparol_evidence/",
        "text": "Hey so my contracts exam was delayed due to a family emergency that occurred right before its originally scheduled date. I know Battle of the Forms and Parol Evidence will likely be on the exam. I have an outline but I was wondering if anyone has a great flowchart for these topics? Or any advice on how to best learn them",
        "created_utc": 1673139090,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L grades failure",
        "author": "flowerrrss12",
        "url": "https://www.reddit.com/r/LawSchool/comments/1064uwz/1l_grades_failure/",
        "text": "I received my first semester grades and let’s just say I ended up on academic probation with a 2.15 gpa. 2 As 2Cs and 1D (passing at my school) being disappointed is an understatement of how I’ve felt for the last 4 days. I put so much work into my first semester clearly I did something wrong. I need to gain a 2.25 to be removed from academic probation and I have only 1 semester and the summer to do that or I will be dismissed from the law school. How did you overcome this disappointment if this happened to you. I will take any advice or words of encouragement truly so very disappointed in myself.",
        "created_utc": 1673138537,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I say that I’m median if I got a 3.15 with a 3.2 curve?",
        "author": "Toopatheticformymain",
        "url": "https://www.reddit.com/r/LawSchool/comments/1064ttk/can_i_say_that_im_median_if_i_got_a_315_with_a_32/",
        "text": "I know that I’m technically below, but my ego wants to round up so bad",
        "created_utc": 1673138456,
        "upvote_ratio": 1.0
    },
    {
        "title": "If a curve only requires that 25% of a class get a B (or grade worse than a B), why would a professor give a grade of B-, C etc? Why not just give the 25% of the class who performed the worst a B?",
        "author": "FormalFearless1491",
        "url": "https://www.reddit.com/r/LawSchool/comments/1064o1s/if_a_curve_only_requires_that_25_of_a_class_get_a/",
        "text": "I hope I am explaining this in a way that makes sense. My school curves to a B+. It mandates that \\~at least\\~ 25% of the class must get a grade worse than a B+. So, if that's the case, why would a professor give a B-? Instead of just giving everyone in the bottom 25% a B? Just to signal that this person did terribly? \n\n&amp;#x200B;\n\nFWIW I don't have grades back yet; just curious about this",
        "created_utc": 1673138022,
        "upvote_ratio": 1.0
    },
    {
        "title": "GRADUATION",
        "author": "Important-Shift5238",
        "url": "https://www.reddit.com/r/LawSchool/comments/1063xm8/graduation/",
        "text": "Since graduation is around the corner for me, I find myself nervous about the ceremony and the future. Nervous about the future because I don’t have a job offer AND nervous about the ceremony because I made 0 friends at law school - only acquaintances. So the thought it showing to grad events alone and feeling lonely stresses me out. \n\nNot posting here for sympathy or advice. Just wanted to post this incase others would resonate.",
        "created_utc": 1673136147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about requesting Law School to reconsider merit based scholarship",
        "author": "Schozenheimer",
        "url": "https://www.reddit.com/r/LawSchool/comments/1063rv5/question_about_requesting_law_school_to/",
        "text": "[removed]",
        "created_utc": 1673135756,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone attend Tulane? I have a few qs.",
        "author": "Due_Fuel299",
        "url": "https://www.reddit.com/r/LawSchool/comments/1063lxn/anyone_attend_tulane_i_have_a_few_qs/",
        "text": "",
        "created_utc": 1673135353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starting next semester classes without previous semester grades is a whole new level of wtf",
        "author": "atx9999",
        "url": "https://www.reddit.com/r/LawSchool/comments/106320t/starting_next_semester_classes_without_previous/",
        "text": "",
        "created_utc": 1673133986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Say what you will about Kevin McCarthy, anybody who's waited on an OCI offer after six rejections knows exactly the same wishful tense anxiety that he underwent this past week.",
        "author": "HAWKiLAW",
        "url": "https://www.reddit.com/r/LawSchool/comments/10630gg/say_what_you_will_about_kevin_mccarthy_anybody/",
        "text": "",
        "created_utc": 1673133874,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lawyers vs Law Students",
        "author": "Weary_Somewhere_1487",
        "url": "https://www.reddit.com/r/LawSchool/comments/1062o6f/lawyers_vs_law_students/",
        "text": "Simple question: are lawyers as insufferable as law students? \n\nI consider myself a fairly “chill” individual. I can talk to many different types of people, about a variety of things not revolving around law school. I haven’t found this to be true with law students who, in my experience, are rather self and career obsessed and extremely uptight.",
        "created_utc": 1673133024,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommendations for NY Bar Tutor?",
        "author": "evergreenbay",
        "url": "https://www.reddit.com/r/LawSchool/comments/1061yx8/recommendations_for_ny_bar_tutor/",
        "text": "Looking for a good tutor for the NY bar exam because I really want to pass the first time... What do you guys recommend? Anyone find that tutors really make a lot of difference? If it helps, I'm using Themis for test prep.",
        "created_utc": 1673131296,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does OCI hiring in the 1L summer look at fall, spring, and summer grades?",
        "author": "Desperate_Sector_810",
        "url": "https://www.reddit.com/r/LawSchool/comments/1060ye8/does_oci_hiring_in_the_1l_summer_look_at_fall/",
        "text": "I’m in a dual JD/LLM program that has grades over the summer for study abroad",
        "created_utc": 1673128790,
        "upvote_ratio": 1.0
    },
    {
        "title": "Well, after first semester I’m officially a loser. Is anybody out there someone who finished at the bottom in the beginning and was able to make it through?",
        "author": "aquilus-noctua",
        "url": "https://www.reddit.com/r/LawSchool/comments/1060hvx/well_after_first_semester_im_officially_a_loser/",
        "text": "I really wanna die rn and I need to hear positive things.",
        "created_utc": 1673127615,
        "upvote_ratio": 1.0
    },
    {
        "title": "Law School is fake",
        "author": "No_Wrap_2694",
        "url": "https://www.reddit.com/r/LawSchool/comments/10605u2/law_school_is_fake/",
        "text": "I believe Law school is not real. Here is why. \n\nMy school gives us a Pass/Fail to use once over the three years. I was a 2L who had 4 exams, so I decided to pass-fail my business corporations class and focus on doing well on my 3 exams and a written brief for my 5th class. I completely stopped going to class for the last 6 weeks. Skipped almost every one. I did not attend the review session, I did not do a practice test nor even a singular practice problem. I studied for about 7-8 hours the day before the test and that is it. I'm being completely serious and not exaggerating at all. \n\nI got an A-. I had to do a double take when I saw the grade (and even better... my school always us to select a target grade when we declare a class pass/fail so that if we hit the target grade or higher we actually get to keep the grade rather than a \"P\" being on our transcript, and the target I declared was A-. )\n\nFurthermore, an Appellate Brief for an advanced legal writing class that I spent 2-3 weeks grinding on got a B+. Funny how things shake out. \n\nThanks for listening, and remember... law school is not real\n\n(Also I hope not to be coming off like a dick, would never complain about getting an A- and after a shaky 1L spring I'm super appreciative of my grades 2L fall.. just honestly thought how ridiculous the system could be that I truly did no work for this class and ended up with a higher grade then classes I busted my butt for)",
        "created_utc": 1673126768,
        "upvote_ratio": 1.0
    },
    {
        "title": "3L at the bottom of the curve with no job and lots of anxiety 🙃",
        "author": "Ok-Value-3957",
        "url": "https://www.reddit.com/r/LawSchool/comments/105zwp4/3l_at_the_bottom_of_the_curve_with_no_job_and/",
        "text": "I’m currently heading into my last semester of law school with a 2.xx GPA at a T-30 school in the Mid-Atlantic. It’s not really a “had a horrible 1L year, but improved” story either - I basically have gotten B-minuses and C’s consistently throughout my three years. What’s the reason - I don’t know. Probably could’ve exerted myself more, could’ve taken better classes - all I know is that these three years have been overwhelming, anxiety-ridden, a little lonely, and depressing as hell. \n\nIt’s not all bad things - I’m on law review (although I absolutely hate it) and I’m in a clinic this semester. And I’m seriously trying to stay positive and keep myself encouraged. But I’m got going to lie and say the hopelessness is pretty overwhelming. I’ve kind of held myself back from networking harder than I can just of fear. I’m trying to ramp up a bit, but cold emailing someone with my resume and writing sample and getting the response of “please send me your transcript” is like a knife to heart (and it literally just happened to me). I know public interest prioritizes grades less, and theoretically (and ideologically) public interest would be great, but I want to stay in the DC-area when I graduate (which has an expensive cost-of-living) and, on top of loan payments, the financial uncertainty of living on a sub-$60,000 salary scare me just as much (not saying I’m against it at all, just that it is another point of anxiety about the future). I’m also not against JD-advantage at all (I actually came into law school with a real interest in policy work).\n\nIf anyone has any advice on how to move forward, how to go about networking, explaining bad grades, or even mental health tips and tricks to overcome the despair lol - I’ll take anything. Also would love to hear success stories from grads who were able to overcome their grades in the job search process.\n\nThanks in advance, and happy new year!",
        "created_utc": 1673126148,
        "upvote_ratio": 1.0
    },
    {
        "title": "i go to a school ranked around 150, i tried really hard for my first semester, got 5/6 grades back and am sitting at a 3.6. my plan was to transfer after my 1L year but since you apply based only on fall grades, are my chances of transferring over?",
        "author": "AdeptnessNo7706",
        "url": "https://www.reddit.com/r/LawSchool/comments/105zl30/i_go_to_a_school_ranked_around_150_i_tried_really/",
        "text": "",
        "created_utc": 1673125340,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does any one else's school separate Crim Pro into Investigations and Trial?",
        "author": "ShyMarth",
        "url": "https://www.reddit.com/r/LawSchool/comments/105z9p0/does_any_one_elses_school_separate_crim_pro_into/",
        "text": "I'm looking for a class to add during add/drop (going into my 2L Spring), and I was leaning towards Crim Pro Trial since I thought it was one of the two bar classes (along with Evidence) that everyone treats as basically mandatory. Then my advisor tells me Crim Pro *Investigations* is the one covered by the bar, but *Trial* is recommended for federal clerkships. Neither are prereqs for the other.\n\nNow, I do plan on applying to federal clerkships, but am not interested enough in Crim law to see myself taking both. Would I be screwing myself over for the bar by taking Trial but not Investigations?",
        "created_utc": 1673124567,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to handle BAD grade in area of interest?",
        "author": "LeahTh",
        "url": "https://www.reddit.com/r/LawSchool/comments/105z99w/how_to_handle_bad_grade_in_area_of_interest/",
        "text": "I'm not someone who puts my worth in grades, very much was a \"Cs get degrees\" person in undergrad because of extenuating circumstances. Shifted that mentality for law school because there were many reasons I need better than Cs. Even with that in mind, this is a really hard post to write. The only grade I've gotten back is property, which I got a C- in. I'm trying not to be absolutely devastated but: \n\n1) I felt really good after the test. Like I was able to logic through my answers again with my friends and we all either answered the same or, if we answered different, my answers made sense.\n\n2) Property is super important to what I want to go into and genuinely I thought I understood it.\n\nLike forget that I'm on a conditional scholarship. I'm really scared I messed up any chance I had at working in my area. And the professor is such a great teacher so I know this is completely on me. I don't know if anyone has tips or words of advice or encouragement but anything would help.",
        "created_utc": 1673124538,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lawyers that failed the first semester of law school, how did you make it to where you are now?",
        "author": "AreiaMage",
        "url": "https://www.reddit.com/r/LawSchool/comments/105yzma/lawyers_that_failed_the_first_semester_of_law/",
        "text": "",
        "created_utc": 1673123851,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any non law vocabulary list that boosts legal writing, like really pushes it down the throat, or adds like a few hundred pounds to the content?",
        "author": "hasnatkabir307",
        "url": "https://www.reddit.com/r/LawSchool/comments/105yfkw/any_non_law_vocabulary_list_that_boosts_legal/",
        "text": "Thanks.",
        "created_utc": 1673122431,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to handle jealousy/envy during post-semester grades?",
        "author": "Tetsuyasoneandonly",
        "url": "https://www.reddit.com/r/LawSchool/comments/105xw76/how_to_handle_jealousyenvy_during_postsemester/",
        "text": "Law school is an inherently competitive environment. I’m normally not that competitive and I don’t let others know about my grade or ask about other people’s grades. Sure I may feel a little jealousy of those who are at the top of the class, but only from time to time, as I normally focus on myself. \n\nI noticed myself getting a little more competitive now, because I am trying to get back my full scholarship (if I am ranked at the top 50% of my class by the end of the year) that I lost after my first year due to personal obstacles. Just heard from a friend that she got an A in a class that I worked quite hard on to get an A but I didn’t. \n\nAnd Part of me feels threatened because I am trying get back into the top 50% train.",
        "created_utc": 1673121076,
        "upvote_ratio": 1.0
    },
    {
        "title": "C+ in Property...",
        "author": "Traditional-Wave-724",
        "url": "https://www.reddit.com/r/LawSchool/comments/105xsus/c_in_property/",
        "text": "2L... currently my GPA is a 2.5 I haven't gotten below a C+ ever but I received 2 C+'s last year. I am praying this is my last one. Really worried about my gpa effecting my job chances.",
        "created_utc": 1673120847,
        "upvote_ratio": 1.0
    },
    {
        "title": "DOJ Honors Program Process 2022-2023",
        "author": "LegalTalk917",
        "url": "https://www.reddit.com/r/LawSchool/comments/105xpj5/doj_honors_program_process_20222023/",
        "text": "Has anyone been a finalist in ATR but never got a rejection or acceptance letter? I know Diane posted like a month ago that finalists for ATR have been identified and regrets letters have been sent but I never received anything. At this point I'm not really holding out hope that I got it but I just want to receive some type of confirmation lol. Lmk if anyone is in this position or would know what's up",
        "created_utc": 1673120618,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will it be hard to get accepted into an undergrad program for a second bachelor's degree after being dismissed from law school?",
        "author": "WriteOrDie1997",
        "url": "https://www.reddit.com/r/LawSchool/comments/105x318/will_it_be_hard_to_get_accepted_into_an_undergrad/",
        "text": "About a month into my first semester of law school, I realized i hated law school and wanted to drop out. My mental health was suffering, but I finished out the semester since I was already paying for it. Having been dismissed after the first semester, I honestly feel relieved. Law school wasn't for me, and I realized my passions lie elsewhere. I'd like to earn a second bachelor's degree, but I'm worried I won't get accepted due to failing out of law school after being too stubborn to drop out earlier. I know grad school would likely be difficult to get into, but what about undergrad?",
        "created_utc": 1673119073,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best UK law school?",
        "author": "One_Strategy_55",
        "url": "https://www.reddit.com/r/LawSchool/comments/105wrme/best_uk_law_school/",
        "text": "I have a degree from Oxford, and I want to go to law school in the UK, despite not living there. What is the best law school to target? Obviously not Oxford. Has anyone had a similar dilemma?",
        "created_utc": 1673118275,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Supplemental for Constitutional Law, Property, and Contracts?",
        "author": "Perfect_Inspection34",
        "url": "https://www.reddit.com/r/LawSchool/comments/105wm2f/best_supplemental_for_constitutional_law_property/",
        "text": "Hello! For 1L constitutional law my final exam will consist of bar-exam styled questions so I need a supplemental with questions that are similar or text that would be helpful. I am also unsure of what the best supplements are for property and contracts as a 1L? Any advice is appreciated on what books are worth it.",
        "created_utc": 1673117888,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the best grade you have ever gotten in law school?",
        "author": "iamtheclaudius",
        "url": "https://www.reddit.com/r/LawSchool/comments/105w33k/whats_the_best_grade_you_have_ever_gotten_in_law/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/105w33k)",
        "created_utc": 1673116544,
        "upvote_ratio": 1.0
    },
    {
        "title": "3LOL",
        "author": "jokesonbottom",
        "url": "https://www.reddit.com/r/LawSchool/comments/105w0eo/3lol/",
        "text": "I’ve got my job lined up so I decided to 3LOL a class on a topic I hated (did it for bar prep, not related to job) and do the 2Ls in the class a solid while giving myself less stress. Prof early on said he didn’t give out less than C- so really no risk.\n\nI basically just showed up for (most) classes during the semester and more often than not zoned out. Didn’t prepare/read or go to review sessions. Studied one day (at most 8 hours) for the open code book multiple choice final, where we were allowed to write our notes/outlines in the code book but I didn’t because 3LOL. Exam was remote and if anyone watched the video of me taking it they’d see there’s for some reason a *literal* concert outside my apartment window for the first half and during the last half I’m laughing periodically out of sheer “wtf am I doing” moments. \n\nGot an A. Law school grades can be random as hell man.",
        "created_utc": 1673116357,
        "upvote_ratio": 1.0
    },
    {
        "title": "Civ Pro Readings",
        "author": "Fancy-Body4050",
        "url": "https://www.reddit.com/r/LawSchool/comments/105voyk/civ_pro_readings/",
        "text": "It takes me 25 minutes to read 5 pages of my civ pro while typing notes as I read. Is this slow?",
        "created_utc": 1673115565,
        "upvote_ratio": 1.0
    },
    {
        "title": "I go to a bottom 100 school w/average grades and had 9 job interviews this week...",
        "author": "xochipilliaz",
        "url": "https://www.reddit.com/r/LawSchool/comments/105vk1j/i_go_to_a_bottom_100_school_waverage_grades_and/",
        "text": "This post serves no other purpose other than to encourage anyone that going to the \"right\" school and having \\~perfect\\~ grades aren't everything. Granted, I took time off between undergrad and law school to work and get real experience. \n\nThis week I had 9 summer job interviews. It's definitely not because I go to Harvard or because my grades are straight A's. I have all B's except for one C. \n\nI think being older has been to my advantage, but what I really think helped is that I narrowed my job applications to a very specific area of the law and talked extensively about that in my cover letters and applications. \n\nSo if you're struggling, try to get more clear about what law you want to do so you seem more focused about your goals. \n\nJust some encouragement for anyone feeling not adequate enough.",
        "created_utc": 1673115218,
        "upvote_ratio": 1.0
    },
    {
        "title": "Medical Debate HOSA",
        "author": "Cool_beans_yeah",
        "url": "https://www.reddit.com/r/LawSchool/comments/105vjtd/medical_debate_hosa/",
        "text": "Should medical errors be considered criminal offenses?",
        "created_utc": 1673115201,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to say in Email when asking for a job?",
        "author": "jamesavage",
        "url": "https://www.reddit.com/r/LawSchool/comments/105vcb5/what_to_say_in_email_when_asking_for_a_job/",
        "text": "I will be applying to family law firms and I don’t know what to say. I was going to go with, “I am a 2L at “insert law school” and I am interested in pursuing a career in family law. I would love to speak with you about a possible internship this summer. My resume is attached below.” I feel like it’s not enough but I also don’t know how much I should say.",
        "created_utc": 1673114700,
        "upvote_ratio": 1.0
    },
    {
        "title": "A break from the grade posts – Law Review EIC?",
        "author": "chococrackies",
        "url": "https://www.reddit.com/r/LawSchool/comments/105urb5/a_break_from_the_grade_posts_law_review_eic/",
        "text": "Has anyone here acted as EIC, or is currently acting as EIC for their school's Law Review? I would really appreciate hearing the pros and cons. I already have a job offer, so I would mostly be doing this for the street cred and potentially going into academia later on in life. Would love to hear some thoughts, thanks!",
        "created_utc": 1673113270,
        "upvote_ratio": 1.0
    },
    {
        "title": "where them grades at doe",
        "author": "lemmilam",
        "url": "https://i.redd.it/hoayto3xonaa1.jpg",
        "text": "",
        "created_utc": 1673112497,
        "upvote_ratio": 1.0
    },
    {
        "title": "For 2L Pre-OCI + 2L OCI, can diversity make up for being top 50% instead of top third",
        "author": "saantiaago",
        "url": "https://www.reddit.com/r/LawSchool/comments/105uccq/for_2l_preoci_2l_oci_can_diversity_make_up_for/",
        "text": "the only way i get to top third is if i get a 4.0 next semester lol. do i have a little bit of leeway at a t25?",
        "created_utc": 1673112245,
        "upvote_ratio": 1.0
    },
    {
        "title": "When to purchase bar prep?",
        "author": "Iwasmuave",
        "url": "https://www.reddit.com/r/LawSchool/comments/105ub75/when_to_purchase_bar_prep/",
        "text": "Graduating in May, when should I purchase my bar prep for July?",
        "created_utc": 1673112163,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I to old &amp; broke for Law School?",
        "author": "Great_Dame_Gold",
        "url": "https://www.reddit.com/r/LawSchool/comments/105u5jt/am_i_to_old_broke_for_law_school/",
        "text": "I’ll be 43 in July. I was a cop for 12 years and LOVED my job. I hurt my neck and it ended that. I’ve always wanted to go to Law School bc I love everything about practicing law. But, I’m broke and can’t afford a loan, I don’t want to be forced to work where I don’t want to just to pay off my loans. I’m worried no legitimate Law School would accept an old lady AND where would I even practice with no experience at my age? \nIs it worth it?",
        "created_utc": 1673111770,
        "upvote_ratio": 1.0
    },
    {
        "title": "y’all need to learn how to find self worth beyond grades",
        "author": "Capital-Froyo4348",
        "url": "https://www.reddit.com/r/LawSchool/comments/105t299/yall_need_to_learn_how_to_find_self_worth_beyond/",
        "text": "this is not meant to be taken in a condescending or “jealous” way, i’m a 3L perfectly content with my transcript or whatever.\n\nbut seriously, losing your mind over an A or a B is like nutso. learn to find self worth in other places! it’ll help you in the long run if you do it early.",
        "created_utc": 1673108999,
        "upvote_ratio": 1.0
    },
    {
        "title": "In dying need for an academic paper from HeinOnline",
        "author": "Upper_Direction_7866",
        "url": "https://www.reddit.com/r/LawSchool/comments/105sjhs/in_dying_need_for_an_academic_paper_from/",
        "text": "Hi reader,   \n\n\nRight now I'm doing research on the Russian-Ukrainian war and I've found after hours and hours of searching only one paper that is useful for me. But it's behind a paywall on [HeinOnline.org](https://HeinOnline.org). Is there someone that can help get a copy of this document? Thank you so much in advance.",
        "created_utc": 1673107675,
        "upvote_ratio": 1.0
    },
    {
        "title": "while trying to figure out how to edit my flair (I still don't know) I noticed that this subreddit is making a transfer guide so I decided to post this",
        "author": "Johnny6767g",
        "url": "https://www.reddit.com/r/LawSchool/comments/105shua/while_trying_to_figure_out_how_to_edit_my_flair_i/",
        "text": "I ended my 1L year at a law school around t100, with a 3.7 gpa and a Cali award. I asked my advisor about how I would go about transferring schools and she told me that if I transferred schools it is impossible to get a scholarship as a transfer, so I would lose my full ride. This took transferring off the table because I couldn't afford the tuition at the higher ranked law schools in my area. I later learned that this was all BS and I could have transferred schools! \n\nTldr: this is a very good subreddit and don't trust your advisors at law school. Also, how do I edit flair on mobile?",
        "created_utc": 1673107557,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some encouragement for stressing 1Ls",
        "author": "foreay",
        "url": "https://www.reddit.com/r/LawSchool/comments/105sd99/some_encouragement_for_stressing_1ls/",
        "text": "I promise you, soon enough, you'll be a nihilistic 3L making actual shitposts all over Reddit, all day long, because you either 1) have nothing to do or 2) do not care that you have stuff to do or 3) \"LOL I'll take the C if it means I don't have to do anything.\" That, in and of itself, makes the journey worth it. I believe in you.",
        "created_utc": 1673107226,
        "upvote_ratio": 1.0
    },
    {
        "title": "I failed my first semester of law school, but I still want to be a lawyer. Any advice?",
        "author": "AreiaMage",
        "url": "https://www.reddit.com/r/LawSchool/comments/105s8ls/i_failed_my_first_semester_of_law_school_but_i/",
        "text": "",
        "created_utc": 1673106903,
        "upvote_ratio": 1.0
    },
    {
        "title": "Academic Help",
        "author": "Capital-Tale-2781",
        "url": "https://www.reddit.com/r/LawSchool/comments/105s269/academic_help/",
        "text": "[removed]",
        "created_utc": 1673106420,
        "upvote_ratio": 1.0
    },
    {
        "title": "Applying to Diversity 1L SAs when not Diverse?",
        "author": "justgoaway0801",
        "url": "https://www.reddit.com/r/LawSchool/comments/105rqsw/applying_to_diversity_1l_sas_when_not_diverse/",
        "text": "It seems like every firm I look at specifies their SA position is for Diversity and Inclusion. That's great and all for the workforce, but is it super frowned upon to apply still when not diverse? Some firms have two separate applications, but others don't. Any advice?",
        "created_utc": 1673105597,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is war articulated and conducted through law?",
        "author": "usernamedoentwork",
        "url": "https://www.reddit.com/r/LawSchool/comments/105rid2/how_is_war_articulated_and_conducted_through_law/",
        "text": "",
        "created_utc": 1673104989,
        "upvote_ratio": 1.0
    },
    {
        "title": "Copyright issues Help 🙏🏻",
        "author": "_chaoticDneutral_",
        "url": "https://www.reddit.com/r/LawSchool/comments/105r6qa/copyright_issues_help/",
        "text": "I am thinking of creating a famous TV show into a comic book series. Would like to understand any legal/copyright points or repercussions in this regard. \n\nThank you.",
        "created_utc": 1673104140,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are you on adderall or other amphets",
        "author": "glutenfreejutsu",
        "url": "https://www.reddit.com/r/LawSchool/comments/105qegy/are_you_on_adderall_or_other_amphets/",
        "text": "And do you need it to function properly in law school or not?\n\n[View Poll](https://www.reddit.com/poll/105qegy)",
        "created_utc": 1673102038,
        "upvote_ratio": 1.0
    }
]