[
    {
        "title": "Big Law Summer Stipends",
        "author": "Dismyusername101",
        "url": "https://www.reddit.com/r/LawSchool/comments/10967nk/big_law_summer_stipends/",
        "text": "Just learned my firm only offers limited salary advances, not a summer stipend to support students as they study for the bar. As a first generation student I am feeling pretty disheartened as I try to figure out finances for the year, as I did not know this was a thing to ask about or consider during OCI. \n\nUnfortunately, Above the Law seems to only have a list of firm offerings from 2014. For those who are comfortable sharing, it would be immensely helpful to know your firm and the amount of summer stipend being offered separate from or in addition to amount of salary advance that can be requested.",
        "created_utc": 1673447763,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question for Entrepreneurs / Aspiring Solo Practitioners",
        "author": "standforsomething33",
        "url": "https://www.reddit.com/r/LawSchool/comments/1095zo8/question_for_entrepreneurs_aspiring_solo/",
        "text": "I have a question for current law school students that is going to be very niche, but I'm putting it out there anyways. \n\nI know (more or less) what I want to do with my degree and my specialty/concentration will be Environmental Law. \n\nI have zero interest in working for an established law firm.  I am going to law school to learn about land use, land conservation, land trusts, municipal regulations, real estate law and environmental regulations in an effort to protect trees and forests. I have short term and long term goals that I want to do with that knowledge once I graduate and for me it isn't about a huge paycheck or finding a top law firm, business or non-profit to work for. \n\n I have heard quite a few people on reddit say that the concentration doesn't matter, that what you study doesn't matter. For so many it seems to be about that end result of getting their JD and getting into a top law firm. Nothing wrong with that, but it isn't my end game.\n\nSo my question is... do you feel that you are learning enough in law school to start your own practice if you wanted to?  Do you feel you are learning enough about your chosen concentration/specialty to make an impact in that particular area? Do you feel you do that on your own if you chose to?  Are there entrepreneurs out there like me that are using law school to actually learn about their area of concentration in a specific way that doesn't involve becoming more attractive to other law firms?   Before I get thousands upon thousands of dollars in debt, I want to ask these big questions of myself and others.",
        "created_utc": 1673447177,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I screwed if I don’t get an offer after my 2L summer with my below average GPA?",
        "author": "lexthelawyer",
        "url": "https://www.reddit.com/r/LawSchool/comments/1095jnq/am_i_screwed_if_i_dont_get_an_offer_after_my_2l/",
        "text": "2L here with below average grades at a T25. My school curves at 3.3 and I have a 3.2 (hoping it bumps up to average after this semester)I didn’t care much about my grades initially because my desired field of law is very niche/boutique and therefore, the firms are usually pretty small and tend to care more about passion and experience. I’m doing a split summer with two firms in my desired field, but neither firm has said I would have a guaranteed offer after graduation. \n\nIf neither of them offered, how screwed would I be with a 3.2 GPA applying as a 3L? I don’t care about big law at all. And I would like to work in real estate transactions/closing preferably if my desired field doesn’t work out. Would any mid-law real estate firms even look at me? Do I need to humble myself and not be so picky about the field of law?\n\nThanks!",
        "created_utc": 1673446002,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is John Finnis &amp; Fuller neoclassical natural legal theory?",
        "author": "henchladyart",
        "url": "https://www.reddit.com/r/LawSchool/comments/1095hv9/is_john_finnis_fuller_neoclassical_natural_legal/",
        "text": "I realise I’m probably being dumb but I don’t care. I have exams and I spent the last 2 days studying about natural law theory only to find a past paper asking me about neo-classical natural theory. People who have done jurisprudence, would Finnis and Fuller’s thoughts constitute as neoclassical natural theory?",
        "created_utc": 1673445870,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question- I’m a transfer student so I don’t have my class ranking or GPA on my resume. I got my grades back yesterday and I’m in top 15%! Should I add this to my resume? I already have a job for this summer so not sure if it would make a difference to add.",
        "author": "DanzAlyGrigori",
        "url": "https://www.reddit.com/r/LawSchool/comments/10954tk/question_im_a_transfer_student_so_i_dont_have_my/",
        "text": "Also, unrelated, but my summer job starts in June, and I have my sister’s wedding during the second week of work. How and when should I email my boss to ask for the day off?",
        "created_utc": 1673444898,
        "upvote_ratio": 0.99
    },
    {
        "title": "Big Law/ Firm confusion",
        "author": "No-Structure1254",
        "url": "https://www.reddit.com/r/LawSchool/comments/1094hdv/big_law_firm_confusion/",
        "text": "At first glance, all the firms seem the same to me. I don't know which firms have \"name recognition\" b/c they're all just last names lol + looking at the V100 is, well..... looking at 100 firms. Does anyone have a list of factors about each of the firms that set them apart from each other? Apart from the practice area, what should I be looking at? \n\n\\*Background- I am a 1L thinking about OCI in August\\*",
        "created_utc": 1673443086,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question for 3Ls.",
        "author": "AdPerfect1766",
        "url": "https://www.reddit.com/r/LawSchool/comments/109462a/question_for_3ls/",
        "text": "Is anyone in this group over the school? Like so over it, you are counting down the days until you graduate? What are your feelings this late in the process? \n\n&amp;#x200B;\n\nAlso, where do you plan on doing bar prep? In your hometown or at school, if your school is away from home?",
        "created_utc": 1673442169,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting a private sector or biglaw job 1L summer?",
        "author": "Usual-Opinion8458",
        "url": "https://www.reddit.com/r/LawSchool/comments/10945pk/getting_a_private_sector_or_biglaw_job_1l_summer/",
        "text": "I'm currently a 1L waiting for grades to come out. I am interested in applying for some private sector/biglaw jobs for my 1L summer in addition to the PI jobs to which I have already applied. \n\nI know it is extremely difficult to get 1L biglaw, and as a white woman I won't be applying for the diversity positions. \n\nHas anyone had experience successfully securing a 1L associate position? If so, do you have any advice?",
        "created_utc": 1673442137,
        "upvote_ratio": 1.0
    },
    {
        "title": "bumble",
        "author": "keikoli",
        "url": "https://www.reddit.com/r/LawSchool/comments/108xqew/bumble/",
        "text": "3l here (woman) casually using bumble, bump into a class mate (male). We have never exchanged more than omg this class sucks good luck. Saw he's in. My class this semester, he came up in my bumble. Part of me wants to swipe right for the hell of it. Feel it's safer to just swipe left. \n\nAdvice? Lol",
        "created_utc": 1673418506,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I avoid mentioning this on my cover letter",
        "author": "PoetryPositive5617",
        "url": "https://www.reddit.com/r/LawSchool/comments/108wtgi/should_i_avoid_mentioning_this_on_my_cover_letter/",
        "text": "My parents donated/built a school in a poor part of my country (not US) and I frequently visited there when I was younger. I was thinking about writing about what I've learned from that experience in my cover letter (especially the ones for public interest internships) but I'm not sure if it would come off badly (showing off, etc). Any thoughts?",
        "created_utc": 1673415557,
        "upvote_ratio": 1.0
    },
    {
        "title": "CALI-equivalent in Evidence, Celine Dion song ruined",
        "author": "Joly_v_Pelletier",
        "url": "https://www.reddit.com/r/LawSchool/comments/108wism/caliequivalent_in_evidence_celine_dion_song_ruined/",
        "text": "My school does not do CALIs but I got the equivalent in Evidence. \n\nBut Celine Dion's \"My Heart Will Go On\" is ruined for me because of the line \"once more, you open the door\" always has me thinking back to admitting previously inadmissible evidence.\n\nAlways consider the consequences of taking a class because once you take Evidence you'll stay forever this way.",
        "created_utc": 1673414624,
        "upvote_ratio": 1.0
    },
    {
        "title": "God Bless The Curve",
        "author": "2LChump",
        "url": "https://www.reddit.com/r/LawSchool/comments/108v13b/god_bless_the_curve/",
        "text": "Literally only made it through 60% of the issues on my Article 9 / Secured Trans exam because I spent 2+ hours convincing myself the red herring was a red herring. Spent the last month wondering if my offer would get pulled if I got a D. Ended up with an A. \n\nAll Hail our Lord and Savior, the Curve.",
        "created_utc": 1673410096,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got a 4.0 gpa overall for fall semester and feel so crappy",
        "author": "Professional_Time648",
        "url": "https://www.reddit.com/r/LawSchool/comments/108v0xy/i_got_a_40_gpa_overall_for_fall_semester_and_feel/",
        "text": "Title says it all. Has anyone else been in this situation? I did so much better than everyone else in my class that I actually feel bad for them, which is making me feel like a crappy human. \n\nI am starting to wish I had done worse so that I could have more in common with the other people in my class. Does anyone have any advice or insight? This really sucks. I mean, it’s not my fault I did so well, or that others did so poorly…",
        "created_utc": 1673410083,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t be discouraged!",
        "author": "Pleasant_Ad_6943",
        "url": "https://www.reddit.com/r/LawSchool/comments/108uuk6/dont_be_discouraged/",
        "text": "Everyone is scaring people on this app by saying you’re too late for BL SA positions because firms have already stayed interviewing.. I just sent an application last week and updated with my transcript today and got a callback invite today. \n\nstop letting people discourage you because EVERYONES PROCESS, TIMELINE, STORY etc. is different. There is not universal answer. Apply and try.",
        "created_utc": 1673409599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I screwed if I don’t get an offer after my 2L summer with my low GPA?",
        "author": "materialgworl223",
        "url": "https://www.reddit.com/r/LawSchool/comments/108uo6q/am_i_screwed_if_i_dont_get_an_offer_after_my_2l/",
        "text": "[removed]",
        "created_utc": 1673409076,
        "upvote_ratio": 1.0
    },
    {
        "title": "3L final semester and I just found out that in one of my classes I am the only student enrolled, the professor is “committed to teaching in person,” and we share the same first name.",
        "author": "billybates1933",
        "url": "https://www.reddit.com/r/LawSchool/comments/108udzr/3l_final_semester_and_i_just_found_out_that_in/",
        "text": "I guess law school just had to get in one last jab.",
        "created_utc": 1673408230,
        "upvote_ratio": 1.0
    },
    {
        "title": "All A’s this semester - 2L (read)",
        "author": "hydrangeasaremyfave",
        "url": "https://www.reddit.com/r/LawSchool/comments/108uc1c/all_as_this_semester_2l_read/",
        "text": "Well, I did it. After making straight B+s my entire first year of law school, I have finished this semester with a 4.00, 1 A+, 2 As, and an A-. After being in the bottom 50% of my class in 1L, I have clawed my way out of it and I could not be more proud of myself. \n\nTo all the people reading here upset with your grades, don’t give up. Don’t listen to people who say you have a low chance of moving on the curve after 1L. This time last year, I was manically searching this sub looking for posts like this ones. And I found them, ones that read, “I’m now in the top 20%” of my class, etc. I never dreamed that could be me. Especially after getting another round of B+s in the spring. I read all of the posts about what to do to make good grades and the best study habits. I tried everything and did all the things I didn’t do first semester, then I made straight B+s again. \n\nMy point is, there is no magic solution to making As or pulling your grades up. The best way to study is the way you learn best. This semester, other people thought I was crazy for making flashcards for an open book exam instead of prewriting, but I was done trying to study the way other people said was “right,” and I made my best grades yet. I don’t want to give specific study tips, but by far the best advice I have is to keep track of your time as if you’re billing hours. This semester, 1 month before the date of each final, I started to keep track of my time using an app on my computer. I stopped the timer any time I wasn’t working (looking at phone, talking, bathroom break) and ran it only when I was studying (outlining, practice exams, making flashcards, etc.) By doing so, I held myself accountable for how much time I was actually studying. It’s easy to feel like you have studied all day after spending 6 hours in the library, but sometimes you might have only spent 2 hour studying and the other time procrastinating. I set a goal to have studied for at least 40 hours for each subject by the time I took the exam. I accomplished this goal and I definitely think it paid off. \n\nThat said, do what works for you. There is no perfect way to study. Find what works for you and don’t give up.",
        "created_utc": 1673408076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have a good secondary source for Law and Econ?",
        "author": "The_Lorax_Lawyer",
        "url": "https://www.reddit.com/r/LawSchool/comments/108u7oy/does_anyone_have_a_good_secondary_source_for_law/",
        "text": "The last time I took an Econ class was my very first semester of undergrad. I remember that I was able to understand all the concepts back then by 6/7 years ago is a long fucking time. \n\nReally it doesn’t even have to be law related. If someone knows a good crash course in Econ 101 that will help me be on top this class it would be much appreciated.",
        "created_utc": 1673407748,
        "upvote_ratio": 1.0
    },
    {
        "title": "Academic Dismissal Advice",
        "author": "yeetyboi6996",
        "url": "https://www.reddit.com/r/LawSchool/comments/108txxb/academic_dismissal_advice/",
        "text": "Hey y’all, so I had a massive capitulation at the end of the semester: COVID and horrendous brain fog as a result. Which I feel really killed my ability to max my efficiency for finals. All in all my lackluster grades caused me to miss the minimum gpa by .18 and I’m just wondering if any of y’all have advice. I had huge aspirations to go back to my community and work positively as a prosecutor, so this is all a really huge heart ripping moment for me. Thanks for anything y’all can give me. :)",
        "created_utc": 1673406954,
        "upvote_ratio": 1.0
    },
    {
        "title": "No rank",
        "author": "Plastic_Brilliant428",
        "url": "https://www.reddit.com/r/LawSchool/comments/108tex1/no_rank/",
        "text": "[removed]",
        "created_utc": 1673405456,
        "upvote_ratio": 1.0
    },
    {
        "title": "Callback without screener",
        "author": "josh02135",
        "url": "https://www.reddit.com/r/LawSchool/comments/108stx9/callback_without_screener/",
        "text": "Just got a callback without a screener from a biglaw firm.\n\nIs this a mistake or does it happen?",
        "created_utc": 1673403878,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mentioning people in cover letter",
        "author": "New_Clue_2126",
        "url": "https://www.reddit.com/r/LawSchool/comments/108stdz/mentioning_people_in_cover_letter/",
        "text": "Would it be okay if I mentioned an attorneys work in my cover letter I found interesting from a different office than the one I am applying to for a SA position for?",
        "created_utc": 1673403837,
        "upvote_ratio": 1.0
    },
    {
        "title": "AILA’s asylum primer: a practical guide to U.S. asylum law and procedure by Dree K. Collopy",
        "author": "PK8130",
        "url": "https://www.reddit.com/r/LawSchool/comments/108sqal/ailas_asylum_primer_a_practical_guide_to_us/",
        "text": "Can a nice human being help me get this book? It’s available free at Berkeley Law library and some other law schools but will cost me $250 to buy lol \n\nThanks!!",
        "created_utc": 1673403608,
        "upvote_ratio": 1.0
    },
    {
        "title": "Submitted my Writing Sample without a cover note?",
        "author": "AFortescue",
        "url": "https://www.reddit.com/r/LawSchool/comments/108s36z/submitted_my_writing_sample_without_a_cover_note/",
        "text": "Career services hasn't been the most helpful in the 1L process, but essentially I only realized after submitting over two dozen apps that I should have added a cover note for the writing sample. In maybe two-thirds of my cover letters, I did include a note about what my writing sample addresses, but I'm not sure if that's enough. \n\nAre employers going to see that as bad form? Is that a death knell? I've edited my writing sample to include a cover note moving forward, but I'm just feeling slightly ill about this ...",
        "created_utc": 1673401924,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it worth of my time to network when I have below median grades at T50 trying to break into biglaw",
        "author": "Excellent-Emu-1070",
        "url": "https://www.reddit.com/r/LawSchool/comments/108s2pd/is_it_worth_of_my_time_to_network_when_i_have/",
        "text": "Just want to know how likely I'll be getting a job in biglaw by networking when I don't have good grades and attending a mediocre school. I networked heavily during my 1L summer but haven't had any luck getting 2L summer job. Some of partners I networked with even passed my resume over to the managing partner but I never heard back from any of them. I'm now pretty exhausted and ran out of all the energy to network having to say the same thing over and over. Should I give up thinking. that biglaw is out of the game for me and just focus on boosting my grades in 2L or would you say that I keep networking.",
        "created_utc": 1673401887,
        "upvote_ratio": 1.0
    },
    {
        "title": "Failing Law School",
        "author": "trippinlp",
        "url": "https://www.reddit.com/r/LawSchool/comments/108rqrl/failing_law_school/",
        "text": "I enrolled law school last year not because it’s something I like but because I didn’t really had any idea of what I wanted to do with my life (I still don’t). The problem started soon. I didn’t make friends and I didn’t get good grades. Until now I had some friends during high school and became top of my class despite not having to study a lot to achieve my goals, but instead of a blessing it was a curse because I didn’t develop a studying method since I just read things and they stayed in my head (which doesn’t work in college).\nIn the beginning I went to classes and tried to talk to people despite being quite shy, but didn’t end well and started to miss classes (not obligatory attendance) because I was ashamed of going alone. I stayed at home most days just crying, playing videogames and not eating. I already had depression, anxiety and adhd and went through really bad times worse than last year but I was still pretty miserable. I managed to pass 4/5 midterms but then failed 4/5 finals which means I left 5 courses and well I have to do them eventually (I’m sorry English is not my first language, so I’m not sure I said courses right).\nNow I’m in my second year and I’m having my midterms right now and I’m kinda down because of a “breakup” with a situationship, the fact that I still barely have friends and the pressure my parents are putting on me. I was always their golden girl and now they’re disappointed because of my terrible performance at school (something they always put a lot of pressure on).\nCan you give me some study tips? share your study method? Tell me how to be less shy and make some friends? How y’all are handling it? Motivate me even?",
        "created_utc": 1673401013,
        "upvote_ratio": 1.0
    },
    {
        "title": "It be like that sometimes, folks.",
        "author": "povidiusnaso",
        "url": "https://i.redd.it/nmarbokdgbba1.png",
        "text": "",
        "created_utc": 1673400197,
        "upvote_ratio": 1.0
    },
    {
        "title": "It be like that sometimes, folks.",
        "author": "povidiusnaso",
        "url": "https://www.reddit.com/r/LawSchool/comments/108rewp/it_be_like_that_sometimes_folks/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/hqw9wng5gbba1.png?width=944&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=85dfc137884c68f3ecbb9f962d2f9e311e81c1e1",
        "created_utc": 1673400139,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meme",
        "author": "Fragrant-Calendar-87",
        "url": "https://i.redd.it/pvypa7g8vcba1.jpg",
        "text": "",
        "created_utc": 1673399287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I do a master of law if I have a bachelor of International relations? (also is it possible to become a lawyer or international lawyer with a law master degree?",
        "author": "Carthagian_dude",
        "url": "https://www.reddit.com/r/LawSchool/comments/108qpkz/can_i_do_a_master_of_law_if_i_have_a_bachelor_of/",
        "text": "I finished my bachelor degree 2 years ago in International relations but I am very keen on studying law, is it possible to study master in Law and can you become an actual lawyer with a law master degree?",
        "created_utc": 1673398277,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interview question/help from a stresses 1L",
        "author": "Artistic_bat_",
        "url": "https://www.reddit.com/r/LawSchool/comments/108qmow/interview_questionhelp_from_a_stresses_1l/",
        "text": "I did pretty poorly with grades despite working really hard (around bottom 30-40%) but I got an initial interview with a big firm who hasn’t seen my grades yet. Of course I am going to put my best foot forward, but is it basically hopeless once they see my gpa? It’s a 30 minute zoom interview with a couple of attorneys. I am going to do the interview no matter what but I don’t want to get my hopes up.\n\nAlso, if anyone has experience being in this situation and was able to impress attorneys despite your grades or if you have any initial interview tips, please let me know! I’m kind of panicking about a summer job and this is my first law interview.",
        "created_utc": 1673398064,
        "upvote_ratio": 1.0
    },
    {
        "title": "ideas for an academic paper",
        "author": "187username",
        "url": "https://www.reddit.com/r/LawSchool/comments/108qitk/ideas_for_an_academic_paper/",
        "text": "Hello everyone!\nCan someone help me brainstorm, please? I need to submit an academic paper about GDPR and data protection. However, I'm out of ideas.\n\nIs there some theme or controversy that someone thinks that could be interesting to research?\n\nThank you for help",
        "created_utc": 1673397775,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to gain trial/practical skills if...",
        "author": "zybrp20238",
        "url": "https://www.reddit.com/r/LawSchool/comments/108qe1x/how_to_gain_trialpractical_skills_if/",
        "text": "all of those types of classes are full at your school and you're a 3L? I didn't realize how quickly trial advocacy fills up at my school (it literally took 15 mins) and lost any chance to take it. I guess just learn on the job?",
        "created_utc": 1673397427,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question regarding 1L SA timeline and other things",
        "author": "AaronRodgers4thMVP",
        "url": "https://www.reddit.com/r/LawSchool/comments/108q22p/question_regarding_1l_sa_timeline_and_other_things/",
        "text": "1L Student who made pretty good grades at a T20 (\\~top 30%). Sent in apps to big law in early December and got interviews at 7 big law firms before grades came out - presumably b/c my resume is somewhat impressive as I worked at two very well-regarded litigation boutiques and probably one of the best big law firms in the world for litigation. Sent my grades in yesterday to all the firms I applied to and got an offer from one of the firms earlier today and still waiting to hear back from the others. How long does it usually take to hear back from firms once they have already interviewed you and have been sent your grades? \n\nAlso, one of the firms I have previously interned at has never taken 1L SA's in the past but is taking 1L SA'S this year. However, this firm is notorious for being picky. I am below their GPA cut-off (not by a lot) but have been told I still \"have a good chance\" by an associate who works at that same firm but at their HQ in a different city. My internship at this firm was incredible as I got to do summer associate-level work and am still extremely close with a lot of their attorneys (formed a close relationship w/ their managing partner who became a mentor to me).  I ended up applying (only sent in grades because that's all they asked for.... presumably because they already have my resume and know me well) because their recruiting person reached out to me (I would've applied there but didn't know they were taking 1L's this year). This firm is my dream firm and I am wondering what can I do to make my odds better in this scenario?\n\n&amp;#x200B;\n\nP.S. For further context the school I attend places extremely well in the market and I want to be in. Also, my father is very prominent in the political sphere  (holds high office - think level Mayor/Congress, etc )- only relevant for my \"reach\" firm as he is the one who made the introduction with the person who hired me last year and think this may help a bit as this is definitely how I got the internship at this firm in the past.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nSorry for throwing around parentheticals with information am just quite nervous now that I know my dream firm is hiring 1L's.",
        "created_utc": 1673396595,
        "upvote_ratio": 1.0
    },
    {
        "title": "CA PTLS certification delay",
        "author": "appropriate_owl",
        "url": "https://www.reddit.com/r/LawSchool/comments/108pz2f/ca_ptls_certification_delay/",
        "text": "Filled out the PTLS extention app a week ago (not a new approval). Three previous semesters, it has taken less than an hour to approve. However this time, its just sitting there with \"submitted\" status. Anyone else's app taking unusually long?",
        "created_utc": 1673396385,
        "upvote_ratio": 1.0
    },
    {
        "title": "WOAHHHHHHHH",
        "author": "definitize",
        "url": "https://www.reddit.com/r/LawSchool/comments/108pwr5/woahhhhhhhh/",
        "text": "I just got my first semester 1L grades back and it's two A's and a B+.. This is the first time I've pushed myself so hard academically before and it paid off. All those breaks spent reading instead of relaxing, all that time spent doing work at night instead of going out.. It all paid off. I literally screamed all over my apartment, I'm sure my neighbors hate me right now holy shitballs",
        "created_utc": 1673396221,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do you get lexis points?",
        "author": "ledollarbian",
        "url": "https://www.reddit.com/r/LawSchool/comments/108p8lr/how_do_you_get_lexis_points/",
        "text": "i know you get points by opting in and completing their little lessons/tasks, but how do you get points from just using lexis? is it x amount of points per search, a flat number per day of research, or do you just need to log in to get your daily points?",
        "created_utc": 1673394615,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L diversity SA",
        "author": "New_Clue_2126",
        "url": "https://www.reddit.com/r/LawSchool/comments/108p6uy/1l_diversity_sa/",
        "text": "Did you get an offer?\n\n[View Poll](https://www.reddit.com/poll/108p6uy)",
        "created_utc": 1673394495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Classes to take in anticipation for 2L SA position?",
        "author": "joeThumper",
        "url": "https://www.reddit.com/r/LawSchool/comments/108oofd/classes_to_take_in_anticipation_for_2l_sa_position/",
        "text": "Did not work at a firm this past summer and it’s been a while since 1L LRW. \n\nAnyone recommend taking LRW 3 or any specific classes to help make the transition smooth/ somewhat be prepared?",
        "created_utc": 1673393284,
        "upvote_ratio": 1.0
    },
    {
        "title": "Most challenging writing assignment for 1L writing class?",
        "author": "BreadfruitTall7774",
        "url": "https://www.reddit.com/r/LawSchool/comments/108oc65/most_challenging_writing_assignment_for_1l/",
        "text": "Just curious which writing assignment would you say was both the most time-consuming and challenging assignment to complete? For my first semester, we just did a closed memo and then an open memo. This semester we have to draft a motion to dismiss, motion for summary judgement, and then an appellate brief. I was also curious if any of these are any more challenging to create than your normal memorandum?",
        "created_utc": 1673392456,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to be a decently good lawyer with average writing skills?",
        "author": "Classy_Lady97",
        "url": "https://www.reddit.com/r/LawSchool/comments/108nlem/is_it_possible_to_be_a_decently_good_lawyer_with/",
        "text": "Asking because my fall LRW grade disappointed me, as did my professors notes about my writing. I’d like to know if there’s still hope for me. 🥲",
        "created_utc": 1673390770,
        "upvote_ratio": 1.0
    },
    {
        "title": "Civ pro practice exam(s)?",
        "author": "PhilistineAu",
        "url": "https://www.reddit.com/r/LawSchool/comments/108n9ni/civ_pro_practice_exams/",
        "text": "Anyone got one or more they are willing to share or they found useful in preparing? \n\nIdeally would like a marking guide or model answer to go with them.",
        "created_utc": 1673390034,
        "upvote_ratio": 1.0
    },
    {
        "title": "Professors really need to stop saying your grades don't matter. It's irresponsible and dangerous.",
        "author": "throwaway9982742",
        "url": "https://www.reddit.com/r/LawSchool/comments/108n7zm/professors_really_need_to_stop_saying_your_grades/",
        "text": "For some of us, our grades are everything. We have too much on the line to make \"mistakes.\" We don't have connections or generational wealth to fall back on. For some of us, our grades open most doors, if not all doors.\n\nI get it though- most people in this industry grew up privileged. Due to that they are a tad tone deaf.\n\nIf you received your grades this semester, and you reach out to your professor and they say your grades don't matter, please don't allow that sentiment to discount your feelings.",
        "created_utc": 1673389927,
        "upvote_ratio": 1.0
    },
    {
        "title": "Police ripped out my cameras, internet modem and router then my property came up missing",
        "author": "freecased",
        "url": "https://www.reddit.com/r/LawSchool/comments/108n4mf/police_ripped_out_my_cameras_internet_modem_and/",
        "text": "[removed]",
        "created_utc": 1673389722,
        "upvote_ratio": 1.0
    },
    {
        "title": "3L - Easy boring class OR Hard interesting class?",
        "author": "oysterslonker",
        "url": "https://www.reddit.com/r/LawSchool/comments/108mogm/3l_easy_boring_class_or_hard_interesting_class/",
        "text": "3L(OL) just started last semester. Job already lined up and contract is signed. GPA is good. \n\nI'm currently taking forensics with an excellent professor. It focuses on using experts in litigation. The class is a lot of work - a 35 minute presentation, a 10 page paper, and seven(!) 3 page papers. It is interesting but time consuming. Should I drop the forensics class and take a bar prep skills and strategies class which is much easier and laid back?  \n\nTLDR-  3LOLing. Easy class with meh professor or difficult class with great professor. plz advise tia",
        "created_utc": 1673388688,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mfw my first grade is an A",
        "author": "Empty_Economist",
        "url": "https://i.redd.it/5x9dk9curbba1.gif",
        "text": "",
        "created_utc": 1673386052,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why don't all schools name their flagship journal \"Law Review\"?",
        "author": "ShyMarth",
        "url": "https://www.reddit.com/r/LawSchool/comments/108lc5t/why_dont_all_schools_name_their_flagship_journal/",
        "text": "I realize there probably isn't any answer other than \"just because\"\n\nBut with the amount of people on here saying \"pick Law Review, other journals don't matter,\" I'm getting mildly paranoid that an out-of-state employer/judge that's unfamiliar with my school will toss my application because the journal I'm on isn't called \"\\_\\_\\_\\_\\_ Law Review\"",
        "created_utc": 1673385596,
        "upvote_ratio": 1.0
    },
    {
        "title": "Black suit for women",
        "author": "imscared5747",
        "url": "https://www.reddit.com/r/LawSchool/comments/108l4yh/black_suit_for_women/",
        "text": "Is a black suit for women too formal for interviews, or business professional in the office?",
        "created_utc": 1673385133,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best 1L extracurriculars",
        "author": "Limp-Investment6189",
        "url": "https://www.reddit.com/r/LawSchool/comments/108ku61/best_1l_extracurriculars/",
        "text": "To start: YES I searched and looked at old posts. They weren’t helpful. \n\nHere’s the thing. I know that people always say that grades are the most important thing. Yeah I get that. But let’s assume in this specific scenario that a student can get good grades and also do some extracurricular stuff— perhaps even that they need that level of engagement and stimulation to stay interested in law school. Also that I already have a 1L job locked in but may need to really start out in a sea of excellent students down the line. I can’t stress enough that I *can only function* when my workload is full. It’s a brain thing. I am neurodivergent. \n\nIf I want to maximize my remaining 1L, what should I be focused on **besides grades**?\n\nI’m a 1L editor on a journal this semester, I’m doing moot court, and I’m doing two very low-demand officer positions in clubs that represent my interests. My work for moot court is basically already done, the two clubs are not going to get more demanding, and the journal asks are basically tailored to 1L, so they don’t look very demanding either. That will most likely be my greatest time suck. \n\nIs that good? Is there anything else fun, challenging and engaging (and that could possibly teach me useful skills) that I could be doing to make myself stand out from all the other grade-getters? Pro bono stuff? Research?",
        "created_utc": 1673384425,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mid Size Firm Summer Associate",
        "author": "Silver-Army8586",
        "url": "https://www.reddit.com/r/LawSchool/comments/108k7hj/mid_size_firm_summer_associate/",
        "text": "2L here. Kinda bombed 1L so struck out on Big Law OCI now have gotten my grades up to the point where I will have a chance at some of the firms I would like to work at but don't really know where to start. Obviously all big law filled up after Fall OCI but I was hoping/expecting to see some postings/OCI opportunities for some mid sized firms but have not seen anything really. I go to all the websites for the mid sized firms I am interested in and either see nothing about a summer program or a generic email to send my resume and transcript to. Does anyone know what the process/timeline for getting a summer associate spot at a mid sized corporate firm is? Worried that I already missed the boat.",
        "created_utc": 1673382941,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to find sense of belonging?",
        "author": "ramentrvsh",
        "url": "https://www.reddit.com/r/LawSchool/comments/108jcuw/how_to_find_sense_of_belonging/",
        "text": "I feel like in law school it’s relatively hard for me to find sense of belonging other than clubs / organization.. How to find it?",
        "created_utc": 1673380983,
        "upvote_ratio": 1.0
    },
    {
        "title": "can you get a summer internship with a gpa below 3.0",
        "author": "clementine77616171",
        "url": "https://www.reddit.com/r/LawSchool/comments/108jcnf/can_you_get_a_summer_internship_with_a_gpa_below/",
        "text": "my gpa is below 3.0 and like a fair bit not tryna doxx myself but anyway. Can you? or shld i work at mcdonald’s this summer",
        "created_utc": 1673380969,
        "upvote_ratio": 1.0
    },
    {
        "title": "I gained 20 lbs in 1L",
        "author": "asmallsoftvoice",
        "url": "https://www.reddit.com/r/LawSchool/comments/108j43f/i_gained_20_lbs_in_1l/",
        "text": "For some reason in my mind the weight slowly crept on, which I suppose it has. I just didn't realize how much of it was front-loaded. I had gained a total of 36.5 from July 2020 to September 2022. I'm 5'4\" so this is pretty drastic for me.  I was 20 lbs. heavier than my before law school weight by May 2021, gained another 6 pounds over 1L summer, 5.5 over 2L. and 5 over 2L summer.  I guess I didn't really realize what that year of quarantine did because it made 1L not even memorable for me. It was just a bunch of zoom. I hardly left my apartment except for groceries. I met maybe 5 classmates but made no friends. It's not that it doesn't make sense that most of the weight came from being a hermit listlessly reading casebooks in my pajamas, it's just that my different weight records tend to be from when I get back on the exercise wagon and today I went through the records and finally noted the chronology. I am down 17 pounds and was curious when I was last at this weight - May 2021. Moving toward the end of law school, but already in the process of rewinding the law school weight gain. It would be pretty neat if I could come out of law school looking how I did when I went in.",
        "created_utc": 1673380422,
        "upvote_ratio": 1.0
    },
    {
        "title": "A- in torts",
        "author": "DCTechnocrat",
        "url": "https://www.reddit.com/r/LawSchool/comments/108iuw3/a_in_torts/",
        "text": "and shedding tears. is this normal behavior?",
        "created_utc": 1673379809,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling Guilty for Making Dean's List",
        "author": "AndrewLWebber1986",
        "url": "https://www.reddit.com/r/LawSchool/comments/108i28c/feeling_guilty_for_making_deans_list/",
        "text": "I got an email today saying I made Dean's List due to my percentile, but I feel that the percentile is not accurate. I had accomodation for mild autism (Level 1, not noticeable most of the time now) and a few other issues that included 50% extra time on finals. So I'm not sure if I should be compared to my peers, the majority of whom did not have extra time.",
        "created_utc": 1673377894,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L Reception Attire",
        "author": "Nearby-Ad4242",
        "url": "https://www.reddit.com/r/LawSchool/comments/108hd9c/1l_reception_attire/",
        "text": "Quick Question:\nFor the plethora of law firm “1L Winter Receptions,” what is the correct attire? I’d assumed I should just wear a suit, but just wanted to confirm.",
        "created_utc": 1673376188,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you mark a book you rent from ecampus?",
        "author": "Cautious_Guess_6026",
        "url": "https://www.reddit.com/r/LawSchool/comments/108gd6s/can_you_mark_a_book_you_rent_from_ecampus/",
        "text": "",
        "created_utc": 1673373789,
        "upvote_ratio": 1.0
    },
    {
        "title": "At what point should I give up on 1L Diversity SA apps?",
        "author": "SkiNerd246",
        "url": "https://www.reddit.com/r/LawSchool/comments/108ga55/at_what_point_should_i_give_up_on_1l_diversity_sa/",
        "text": "I goofed and didn't send apps until the last week of December. I haven't received any callbacks or interviews. A couple firms have sent emails asking for transcripts, but those seem to be automated; and I don't even have grades yet. **Should I give up on 1L SA opportunities and start pivoting to other kinds of 1L job apps?** I'd ask my career services office but they are still out of the office :(",
        "created_utc": 1673373609,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else a 1L feeling discouraged after getting their fall semester grades?",
        "author": "Classy_Lady97",
        "url": "https://www.reddit.com/r/LawSchool/comments/108g1wk/anyone_else_a_1l_feeling_discouraged_after/",
        "text": "",
        "created_utc": 1673373059,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aspen Publishing Coupon Codes?",
        "author": "foreskin-deficit",
        "url": "https://www.reddit.com/r/LawSchool/comments/108fpra/aspen_publishing_coupon_codes/",
        "text": "Does anyone know of any discount codes for Aspen? I haven't been able to find anything current.",
        "created_utc": 1673372254,
        "upvote_ratio": 1.0
    },
    {
        "title": "Job ideas for median t50 student that pays",
        "author": "Brusselsprouthead",
        "url": "https://www.reddit.com/r/LawSchool/comments/108f12f/job_ideas_for_median_t50_student_that_pays/",
        "text": "Hi! So we got grades back and I’m literally right smack at median GPA, and I have been looking for jobs that pay but most of them seem to want the top 0.00001% of the class (I am exaggerating). Any tips on where to look for jobs that pay? Or suggestions for what types of jobs to look for? \n\nI am not looking for a summer associate big law type of pay but I am low income and can’t afford to work without earning money this summer. So something like clerking for a judge in Big City won’t be feasible. My school really pushes for jobs that don’t pay so I need some advice because they aren’t giving any.",
        "created_utc": 1673370633,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you afford to live?",
        "author": "Valuable_Magazine326",
        "url": "https://www.reddit.com/r/LawSchool/comments/108exn0/how_do_you_afford_to_live/",
        "text": "Hey guys, I’m heading to law school in the fall. I’m concerned because the COA at almost all law schools are veryyy low, like UCLA is 29k and it would be difficult to survive on that little. I do not have a spouse/partner or parents who will support me. Is it common to take out private loans or do you just suffer the three years? Thanks all!",
        "created_utc": 1673370408,
        "upvote_ratio": 1.0
    },
    {
        "title": "Damn insta, why you gotta do me dirty like that",
        "author": "TheWorkingAnt",
        "url": "https://i.redd.it/ld5mrd3sfaba1.jpg",
        "text": "",
        "created_utc": 1673369876,
        "upvote_ratio": 1.0
    },
    {
        "title": "Summer 1L job help",
        "author": "No-Math5440",
        "url": "https://www.reddit.com/r/LawSchool/comments/108dh14/summer_1l_job_help/",
        "text": "How many jobs/internships should I apply to for my 1L summer? I'm limited in where I can work (one larger city, one smaller city). So far I've applied to about 9 jobs (I think), pretty much all of the ones in my area. I'm ranked pretty high and have a good GPA, so I'm hoping that will help, but I also don't want to shoot myself in the foot by not applying to a lot of jobs and then not \\*getting\\* a job. Help!",
        "created_utc": 1673366839,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grades Megathread Fall 2022",
        "author": "Isentrope",
        "url": "https://www.reddit.com/r/LawSchool/comments/108d7rd/grades_megathread_fall_2022/",
        "text": "With many 1Ls and also upperclassmen now getting their grades and in the interest of keeping the sub from being flooded by these posts, we've set up this megathread as we've done in the past to consolidate those discussions. \n\nTo folks who did well - congratulations! Your hard work paid off and you've figured out how to do well in law school. Some people pull this off because of natural talent, but most people earned every bit of their grades with hard work and determination, which will set you up well for legal practice. There are also a lot of opportunities that are available to you that may not be as accessible for the rest of your classmates, such as transferring, getting good or better biglaw, and appellate clerkships. Law school is a race and not a sprint, though, so while you may have done extremely well in one semester, you may or may not have a few more semesters to go through in your law school career. Still, you have every reason to be proud of your achievements, just do that in this thread instead of the sub. \n\nTo folks who wish they had done better, the law school curve is infamous for making most of the class feel that way. If you're a 1L, you do have a chance to fix your grades still and a bad first semester does not mean you will do poorly again, though the typical gain you can expect on your grades will not be miraculous (aka going from a 2.0 to a 3.5). Talk to your professors, especially the ones that gave you poor grades, and see what it is that you missed, and see if there are better resources that you didn't take advantage of [here is a [thread](https://www.reddit.com/r/LawSchool/comments/7olu6x/grades_megathread/) about grades I made a few years back). It's also important to figure out if there are mental health reasons for your performance as well and talk to professionals to help address them. Law school is notoriously extremely stressful, so if you have underlying issues with depression and anxiety, the situation can easily spiral and be beyond your ability to just cope without professional help. \n\nTo those who did, in their estimation or based on where they stand in the rankings/curve (like bottom third), poorly, there is still a chance to do well. People have bounced back from bad performances before, and it is especially possible if there was something that just didn't click in the first semester or previous years. Some people who did well or even meh may also slack off, which is your opportunity to try and get a good grade. All that being said, you may also want to be realistic about your prospects. If you go to a high ranked school, it's possible that clerking or the best biglaw firms are not in the cards, and you should be looking more at how to competitively bid for biglaw or even other options such as midlaw or something else. If you go to a lower ranked school, you may want to assess whether it's worth finishing out your degree if job prospects were never very good to begin with and the school, based on its 509 report, has historically flunked a large number of students after their first year. Law school is not meant for everyone, and there are also many predatory law schools out there that take advantage of the profession's reputation (the good one anyways) to lure people in. While being determined to tough it out is a good general life trait to have and people have absolutely bounced back from bad grades before, you also want to be honest about the chances for doing so and whether the cost is worth it to you.\n\n***\n\nPlease keep grades discussions in here. If you have questions, you can try [checking out our discord](https://discord.gg/lawschool) and also asking in this thread. Good luck to everyone on their Spring semesters!",
        "created_utc": 1673366225,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I take Crim pro or a non-bar class I’m very interested in?",
        "author": "rtidwell",
        "url": "https://www.reddit.com/r/LawSchool/comments/108d3ik/should_i_take_crim_pro_or_a_nonbar_class_im_very/",
        "text": "Will I be screwed for the bar this summer if I haven’t taken Crim pro?",
        "created_utc": 1673365921,
        "upvote_ratio": 1.0
    },
    {
        "title": "MBA Or Doctorate For Someone With A LL.B And LL.M (Working In IP Law)",
        "author": "According_Plum4142",
        "url": "https://www.reddit.com/r/LawSchool/comments/108csot/mba_or_doctorate_for_someone_with_a_llb_and_llm/",
        "text": "[removed]",
        "created_utc": 1673365147,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L and slept through class for the first time ever",
        "author": "yeahsheseemsnice",
        "url": "https://www.reddit.com/r/LawSchool/comments/108cm76/1l_and_slept_through_class_for_the_first_time_ever/",
        "text": "I’ve never done this and I’m sick with anxiety over the whole thing. Any tips, advice, perspective?",
        "created_utc": 1673364694,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Answer to a Final Exam Question is the Model Answer!",
        "author": "Law_is_lol",
        "url": "https://www.reddit.com/r/LawSchool/comments/108cbco/my_answer_to_a_final_exam_question_is_the_model/",
        "text": "As a preface, I didn't kill my first semester. In fact, on a B+ curve, I got a B- (3 credit course), B (5 credits), A- (4 credits), and A+ (4 credits). \n\nAs one might assume, this post is in relation to an answer for the A+ course. The professor was kind enough to post Final Exam answer notes and gave us (private) access to our exam responses to compare. I start from the bottom-up (for some reason), and I see the last answer is \"borrowed\" from a student answer. I begin reading it, and it looks oddly familiar. \n\nI check my own exam answer and IT IS \"LITERALLY\" THE SAME (with some superficial word switching)! the one word I italicized and underlined (\"not\") is even there! Notably, this is the *only* part of the exam that incorporates a student answer. May have been an OK semester, but I'm thrilled at this discovery!",
        "created_utc": 1673363941,
        "upvote_ratio": 1.0
    },
    {
        "title": "When the Prof's exam feedback memo has you wondering if you even took the same exam",
        "author": "SuperLoris",
        "url": "https://www.reddit.com/r/LawSchool/comments/108c99a/when_the_profs_exam_feedback_memo_has_you/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/9cpbhnj5g8ba1.jpg?width=500&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=aee84cc4d2acff7d38ecaf2c58358aa3aca31dc3",
        "created_utc": 1673363793,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone here who’s at a T50-100 school headed to BL or already at a BL firm (preferably New York)",
        "author": "Interesting-Star-767",
        "url": "https://www.reddit.com/r/LawSchool/comments/108byyg/anyone_here_whos_at_a_t50100_school_headed_to_bl/",
        "text": "Need some advice; and also some inspiration.",
        "created_utc": 1673363058,
        "upvote_ratio": 1.0
    },
    {
        "title": "NYS law just states that both plates be conspicuously displayed, one on the front and one on the rear of such vehicle… so technically legally I can display my front license plate in my front window?",
        "author": "Fablesdad",
        "url": "https://www.reddit.com/r/LawSchool/comments/108bup9/nys_law_just_states_that_both_plates_be/",
        "text": "",
        "created_utc": 1673362776,
        "upvote_ratio": 1.0
    },
    {
        "title": "Law clerk to Associate",
        "author": "WeirdEnvironmental79",
        "url": "https://www.reddit.com/r/LawSchool/comments/108btw4/law_clerk_to_associate/",
        "text": "[removed]",
        "created_utc": 1673362716,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L diversity interview tips?!",
        "author": "Specific-Promotion65",
        "url": "https://www.reddit.com/r/LawSchool/comments/108bfsg/1l_diversity_interview_tips/",
        "text": "Anyone have any tips that you can share? Really nervous for my interview!",
        "created_utc": 1673361677,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books for Sale 📚⚖️",
        "author": "cbrownst",
        "url": "https://www.reddit.com/r/LawSchool/comments/108b254/books_for_sale/",
        "text": "** Case books: $70 each**\n\nFirst Amendment Law, 4th Edition — Hellman, Araiza, Baker and Bhagwat\n\nWriting for Legal Practice, 3rd Edition — Fajans\n\nContacts and Sales: Contemporary Cases and Problems, 3rd Edition — McGovern, Lawrence, Hull \n\nCivil Procedure, 4th Edition — Freer (Treatise)\n\nBusiness Organizations, 3rd Edition — Palmiter, Partnoy, Pollman op\n\nProperty, 3rd Edition — Merrill, Smith \n\nAdministrative Law, 8th Edition — Koch, Jordan, Murphy, Virelli \n\n\n**E&amp;Es: $20 each**\n\nCon Law\nWills Trusts and Estates. \n\n✨PRICES ARE NEGOTIABLE!✨  DM me",
        "created_utc": 1673360658,
        "upvote_ratio": 1.0
    },
    {
        "title": "Raise your hand",
        "author": "Weekly-Quantity6435",
        "url": "https://i.redd.it/ssp39nto89ba1.jpg",
        "text": "",
        "created_utc": 1673355385,
        "upvote_ratio": 1.0
    },
    {
        "title": "Raise your hand",
        "author": "Weekly-Quantity6435",
        "url": "https://i.redd.it/mnkvlne389ba1.jpg",
        "text": "",
        "created_utc": 1673355184,
        "upvote_ratio": 1.0
    },
    {
        "title": "Searching for French Family Law Textbooks",
        "author": "JustCheers",
        "url": "https://www.reddit.com/r/LawSchool/comments/10880sf/searching_for_french_family_law_textbooks/",
        "text": "My English isn't very good, please forgive me if I make any errors.\n\nI'm a law school student from Taiwan. I'm searching for French family law textbooks in French to read. Any recommendations?\n\nThanks!",
        "created_utc": 1673351705,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm not sure I want to do law anymore",
        "author": "tya_the_Lawyer",
        "url": "https://www.reddit.com/r/LawSchool/comments/1087esp/im_not_sure_i_want_to_do_law_anymore/",
        "text": "As the name suggests, I am starting to consider other avenues in life.  I have an undergrad and master's in law (UK), and have not really thought of any other career since i was a kid.  But, I'm starting to realise that there is more to the world than that, and I want to look further out, but I'm not sure where to start",
        "created_utc": 1673349541,
        "upvote_ratio": 1.0
    },
    {
        "title": "0L Tuesday Thread",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/LawSchool/comments/10872w6/0l_tuesday_thread/",
        "text": " \n\nWelcome to the 0L Tuesday thread. Please ask pre-law questions here (such as admissions, which school to pick, what law school/practice is like etc.)\n\nRead the [FAQ](http://www.reddit.com/r/lawschool/wiki/faq/). Use the search function. Make sure to list as much pertinent information as possible (financial situation, where your family is, what you want to do with a law degree, etc.). If you have questions about jargon, check out the [abbreviations glossary](https://www.reddit.com/r/LawSchool/wiki/abbreviations).\n\nIf you have any pre-law questions, feel free join our [**Discord Server**](https://discord.gg/Qhxy4sF) and ask questions in the 0L channel.\n\n**Related Links:**\n\n* [Official LSAC Admissions Calculator](https://officialguide.lsac.org/release/ugpalsat/ugpalsat.aspx) (self explanatory, presumably sources data from previous admissions cycles, likely larger pool of data too. Useful for non-splitters).\n* [Unofficial LSN Admissions Calculator](http://mylsn.info/) (uses crowdsourced LSN data to calculate % admissions chances).\n* [Law School Numbers](http://www.lawschoolnumbers.com/) (for admissions graphs and crowdsourced admissions data).\n* [LST Score Reports](https://www.lstreports.com/) (for jobs data for individual schools)\n* [List of Guides and Other Useful Content for Rising 1Ls](https://www.reddit.com/r/LawSchool/comments/95mxgz/aggregated_content_for_1ls_from_around_the_forums/)\n* [TLS Biglaw Placement Class of 2016](http://www.top-law-schools.com/forums/viewtopic.php?f=1&amp;t=276222) | [TLS Biglaw Placement Class of 2015](http://top-law-schools.com/forums/viewtopic.php?f=1&amp;t=262376) | [NLJ250 Class of 2010](http://pdfserver.amlaw.com/nlj/goto%20law%20schools_main.pdf) | [NLJ250 Class of 2009](http://pdfserver.amlaw.com/nlj/law%20schools_charts_page12.pdf) | [NLJ250 Class of 2008](http://www.law.com/img/nlj/charts/20090223gotoschools.jpg) | [NLJ250 Class of 2007](http://www.law.com/img/nlj/charts/20080414gotoschools.jpg) | [NLJ250 Class of 2005](http://pdfserver.amlaw.com/nlj/20080414employment_trends.pdf)\n* [/r/LawSchoolAdmissions 2016 Biglaw and Employment Data](https://www.reddit.com/r/lawschooladmissions/comments/643pwm/2016_aba_employment_reports/) (includes 200 law schools)\n* [TLS School Medians Class of 2020](https://docs.google.com/spreadsheets/d/1XfblJqji8wlaCbc9cUTAheOsZPRRaP_hyWafn3NEYQE/edit#gid=299903710).\n\n**Related Subreddits:**\n\n* [r/LawschoolAdmissions](https://www.reddit.com/r/LawschoolAdmissions/)\n* [r/LSAT](https://www.reddit.com/r/LSAT/)",
        "created_utc": 1673348411,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using Nepotism to get a job",
        "author": "Humble_Strength_4866",
        "url": "https://www.reddit.com/r/LawSchool/comments/108546e/using_nepotism_to_get_a_job/",
        "text": "I was just wondering what the moral implications are of using nepotism to get employment. I’m good at networking and stuff, no problem with that and it’s worked out. I have an uncle who is a managing partner in BL and he always hinted that I’d do great there and said he could help me out with a job.\n\nI know grades aren’t everything, but I’m probably the bottom quarter of my class. I’ve faced a fair amount of personal adversity affecting my grades, but I know I’m not a top tier student and would feel bad taking a spot from someone else who is more capable than me, or someone who worked their ass off.\n\nI come from a background where stressing success on merit is very important and don’t know how I would feel if I lost a spot by someone with an inside track because I’ve been in that situation before.",
        "created_utc": 1673340910,
        "upvote_ratio": 1.0
    },
    {
        "title": "me: thrilled about B+ for 2-unit class I spent 2 days on writing 35 page paper final. classmate: bummed out about B+ because he pulled an all-nighter. it's all about perspective I guess",
        "author": "Tight_Put_5684",
        "url": "https://www.reddit.com/r/LawSchool/comments/1083evw/me_thrilled_about_b_for_2unit_class_i_spent_2/",
        "text": "",
        "created_utc": 1673334541,
        "upvote_ratio": 1.0
    },
    {
        "title": "me: thrilled about B+ about 2-unit class I spent 2 days on writing 35 pg paper. classmate: bummed out about B+ because he pulled an all-nighter. it's all about perspective I guess",
        "author": "Tight_Put_5684",
        "url": "https://www.reddit.com/r/LawSchool/comments/1083ehp/me_thrilled_about_b_about_2unit_class_i_spent_2/",
        "text": "",
        "created_utc": 1673334500,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many 1L Big Law SA/Diversity Fellowships are you guys applying to?",
        "author": "doctrinalking",
        "url": "https://www.reddit.com/r/LawSchool/comments/1082e2l/how_many_1l_big_law_sadiversity_fellowships_are/",
        "text": "I've done around 30 so far. Did anybody already get offers or get interviews? Is there anyone who applied to more than 50 firms?",
        "created_utc": 1673330987,
        "upvote_ratio": 1.0
    },
    {
        "title": "Journal Question",
        "author": "InformationDouble273",
        "url": "https://www.reddit.com/r/LawSchool/comments/1082alb/journal_question/",
        "text": "What happens when your piece gets published? Students aren’t experts and typically we write under pressured circumstances. Is it worth the hype?\n\nSincerely,\n\nA person whose piece was selected.",
        "created_utc": 1673330657,
        "upvote_ratio": 1.0
    },
    {
        "title": "0L looking for something to do",
        "author": "tlstmdgus",
        "url": "https://www.reddit.com/r/LawSchool/comments/1081zn5/0l_looking_for_something_to_do/",
        "text": "I am a rising 1L for the fall of 2023 and I was wondering if anyone had any tips on how to prepare for the first semester. I am 2 years out of school from undergrad and worried that I might not be ready for the workload. Are there any books, habits, or brain exercises(?) anyone can recommend so I can effectively hit the ground running in the fall? I will absolutely make sure to take advantage of the time I have  by resting, traveling, working on my physical and mental health but I wanted to see if there was something I could do that is more academically stimulating.   \n\n\nAlong those same lines, is there anything that you would recommend to help find what you specifically want to do in the legal field that you wish you had done prior to starting law school? Please share your wisdom!",
        "created_utc": 1673329669,
        "upvote_ratio": 1.0
    },
    {
        "title": "Excited proud shocked and relieved.",
        "author": "GratefulMaple-16",
        "url": "https://www.reddit.com/r/LawSchool/comments/10813hh/excited_proud_shocked_and_relieved/",
        "text": "[removed]",
        "created_utc": 1673326823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do the top ten percent 1Ls usually all have 4.0s?",
        "author": "Low-Virus8213",
        "url": "https://www.reddit.com/r/LawSchool/comments/1080xky/do_the_top_ten_percent_1ls_usually_all_have_40s/",
        "text": "I got a 3.925 and am wondering whether that may put me in the running for being in the top 10 percent of my class... Is it common for people with less than a 4.0 to be in the top ten? Ranks haven't been release yet (obviously), but I'm just curious what ya'll's take is.",
        "created_utc": 1673326327,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the most annoying thing your grade was lowered for?",
        "author": "thethefirstman",
        "url": "https://www.reddit.com/r/LawSchool/comments/1080sdw/what_is_the_most_annoying_thing_your_grade_was/",
        "text": "Just trying to see what seemingly silly things others have been marked down for, and if you learned something from it.",
        "created_utc": 1673325884,
        "upvote_ratio": 1.0
    },
    {
        "title": "What it is likely I'll do after law school:",
        "author": "Law_Guy_Why",
        "url": "https://www.reddit.com/r/LawSchool/comments/1080og5/what_it_is_likely_ill_do_after_law_school/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/1080og5)",
        "created_utc": 1673325554,
        "upvote_ratio": 1.0
    },
    {
        "title": "No one in my life will fully appreciate this (and I won't share with my classmates) but needed to get it out... I GOT A 3.7 IN MY FIRST SEMESTER OF LAW SCHOOL",
        "author": "FormalFearless1491",
        "url": "https://www.reddit.com/r/LawSchool/comments/1080kvx/no_one_in_my_life_will_fully_appreciate_this_and/",
        "text": "I have been consumed by imposter syndrome so many times in the last few months. I go to a T50 law school and I was losing my mind because I felt like everyone worked harder and was smarter than me. I hated myself for not reading Getting to Maybe, being unable to spend 60+ hours a week on law school, not having a tight study group (or any really study group) etc. \n\nI just feel really happy and proud and like my dreams might actually come true rn. : ' )",
        "created_utc": 1673325254,
        "upvote_ratio": 1.0
    },
    {
        "title": "Proud of myself",
        "author": "dragonborn_23",
        "url": "https://www.reddit.com/r/LawSchool/comments/1080ki4/proud_of_myself/",
        "text": "Grades dropped tonight. I finished Fall semester of 1L with a 3.4 gpa. I am extremely proud of myself. Firstly, I scored a 152 on my LSAT. I didn't think I'd get into a T-50 school, but I worked my butt off on my application and thankfully I got into my top choice. I remember a lot of people telling me that my LSAT was horrible, and that I'd struggle in my 1L especially. But I kept working my butt off and believing in myself. And it paid off! Hopefully I can keep it going this semester. Proud of everyone!",
        "created_utc": 1673325222,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best things to ask firm partner to form relationship?",
        "author": "randyerthanyou1",
        "url": "https://www.reddit.com/r/LawSchool/comments/1080jaq/best_things_to_ask_firm_partner_to_form/",
        "text": "Managed to set up a call with one at a firm I’m really interested in, would love thoughts",
        "created_utc": 1673325121,
        "upvote_ratio": 1.0
    },
    {
        "title": "Federal Judicial Internship says to Apply through Symplicity but it's missing the drop down menu?",
        "author": "AFortescue",
        "url": "https://www.reddit.com/r/LawSchool/comments/10807cz/federal_judicial_internship_says_to_apply_through/",
        "text": "I've been refreshing the page all day, but when I click 'Apply,' all I'm seeing is a note telling me to apply through Symplicity instead of the usual drop-down menu allowing you to attach the relevant documents. I'm really interested in interning for this judge, as I've been following his work for a while, so I am considering calling his chambers to inquire about where/how to submit my application otherwise. \n\nI can't find an email, but I do have the judge's chambers phone number and phone numbers for his court room deputy and law clerks. Who should I call, or should I even call/is it in bad form?\n\nThanks, and any advice is much appreciated.",
        "created_utc": 1673324131,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a 40 minute interview with 2 partners a screener? 1L SA",
        "author": "Dangerous-Rough-3849",
        "url": "https://www.reddit.com/r/LawSchool/comments/107zszp/is_a_40_minute_interview_with_2_partners_a/",
        "text": "I've been invited to interview with 2 partners but the interview is only 40 minutes. This would be the first time interviewing/talking to the firm. It is with a big law firm",
        "created_utc": 1673322980,
        "upvote_ratio": 1.0
    },
    {
        "title": "UF 1L Bombed the fall (2.9), any reccomendations to find a place in the summer?",
        "author": "Specific_Inquiries",
        "url": "https://www.reddit.com/r/LawSchool/comments/107zjuq/uf_1l_bombed_the_fall_29_any_reccomendations_to/",
        "text": "DACA, hispanic, male\n\nReally upset of the situation, but there is nothing more I can change of it.\n\nShould I even bother and just quit at this point? I doubt any firm diversity programs will want me now.",
        "created_utc": 1673322231,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L diversity positions",
        "author": "km131248",
        "url": "https://www.reddit.com/r/LawSchool/comments/107zjor/1l_diversity_positions/",
        "text": "possible to get with a 3.2 gpa? top 45% of class so pretty average. i applied to a bunch but is it worth it to keep my hopes up or nah",
        "created_utc": 1673322216,
        "upvote_ratio": 1.0
    },
    {
        "title": "Relatable",
        "author": "JayTongue",
        "url": "https://i.redd.it/v3xpeacrd2ba1.jpg",
        "text": "",
        "created_utc": 1673321873,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will clerking for a federal judge my 2L summer help me find a big/midsize law job my 3L??? I’m so gutted that I wasn’t able to secure a 2L job this summer 😭😭",
        "author": "Gullible-Panda1250",
        "url": "https://www.reddit.com/r/LawSchool/comments/107zfh9/will_clerking_for_a_federal_judge_my_2l_summer/",
        "text": "",
        "created_utc": 1673321868,
        "upvote_ratio": 1.0
    }
]