[
    {
        "title": "Torn between an offer from a previous employer and a new offer",
        "author": "Tetsuyasoneandonly",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ovmd8/torn_between_an_offer_from_a_previous_employer/",
        "text": "I am mainly interested in family law. \nI did intern at this law firm last summer that represented prospective parolees. It was a rewarding experience and the staff really liked me and even invited me to return this summer. \n\nHowever I have another offer for an internship at the local public defenders office, for the juvenile division. It’s an in-person job. \n\nI still have yet to decide, but I need to decide soon.\n\nPro of returning to the last firm: I’ll have  a great sense of familiarity with the work and it will b remote.\n\nHowever, the public defender’s internship will b in-person and while I will b driving 45 min to and from everyday, I feel like I should take it because it’s an in-person experience.",
        "created_utc": 1678570020,
        "upvote_ratio": 1.0
    },
    {
        "title": "what the hell does “deference” mean",
        "author": "saantiaago",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ovki1/what_the_hell_does_deference_mean/",
        "text": "thanks!",
        "created_utc": 1678569889,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why bother asking a witness if they can identify the defendant while the defendant is sitting where the defendant is supposed to sit? What’s the point?",
        "author": "Rats_for_sale",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ov3ol/why_bother_asking_a_witness_if_they_can_identify/",
        "text": "",
        "created_utc": 1678568745,
        "upvote_ratio": 1.0
    },
    {
        "title": "Affordable housing for U Minnesota Law Admits!",
        "author": "HollyFlax2lawschool",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ouhbq/affordable_housing_for_u_minnesota_law_admits/",
        "text": "Hey everyone! I’m throwing this into the ether for anyone it may benefit. I live at the law house in Minneapolis, which is affiliated with U Minnesota Law. It’s a very chill, 12-bedroom Victorian house less than a mile from the law school. It’s filled and ran by law students, and each of us pay between $300 and $500/mo. There are massive common spaces and it’s a great community! Shared kitchen appliances, common area furniture, etc. We do our own applicant recruitment for the open rooms, so lmk if you would like me to send you the interest form! I’m also happy to answer any questions about living in a house of law students 😊",
        "created_utc": 1678567218,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Social Game at Law School",
        "author": "throwawaylaw12345678",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ot3fq/the_social_game_at_law_school/",
        "text": "[removed]",
        "created_utc": 1678563790,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm a liberal, but I think we should let racists and people who encourage death against LGBTQs have free rein over society",
        "author": "Latter-Echidna-9972",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ot25c/im_a_liberal_but_i_think_we_should_let_racists/",
        "text": "I'm totally liberal and whatever, but I don't see anything wrong with what these people are saying. It's a free country after all, and free speech is especially important to protect for racists and would-be killers. If anything, the right to free speech should be curtailed specifically for minorities; after all, when have they ever had anything important to contribute to the conversations around civil rights that decent, progressive white folk are already having for them?\n\nI'm just saying, I'm a liberal, but maybe the minorities should just let the big boys handle the public conversations surrounding their rights to exist. And maybe, just maybe, the people who want them dead actually have a point, and should be enshrined in our most influential judicial and political positions so that they can do exactly what they want with them.",
        "created_utc": 1678563697,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L at a lower T14, mediocre grades, aiming for transactional biglaw — how much would a leadership position in an extracurricular help me?",
        "author": "marimomossball_",
        "url": "https://www.reddit.com/r/LawSchool/comments/11oszey/1l_at_a_lower_t14_mediocre_grades_aiming_for/",
        "text": "Election season for affinity groups and journals is happening and I’m pretty conflicted about whether I should run or not. I have mediocre grades but interesting pro bono work and I’m on a secondary journal/a couple affinity clubs. I’m also considering write on for law review but that’s no guarantee. \n\nI don’t have a strong desire to join the boards of any. To be honest, the only reason I’d do it is for a resume boost, but I wouldn’t even start the position until after OCI anyway. I guess the only benefit would come from me briefly mentioning it in an interview. Would it be worth it?",
        "created_utc": 1678563518,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to summon a law student 101",
        "author": "Fabulous_Ad_2768",
        "url": "https://i.redd.it/64g0x0otd7na1.jpg",
        "text": "",
        "created_utc": 1678563074,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best way to figure out how federal judges prefer clerkship applications to be submitted?",
        "author": "Natural_Rock7786",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ospvp/best_way_to_figure_out_how_federal_judges_prefer/",
        "text": "I’ve been attempting to call chambers or direct to a judicial assistant, but frequently am unable to get a hold of anyone. The two judges I have gotten into contact with in this particular district have preferred to receive applications through email. I have the email format so I could just recreate it and send my applications that way. I’m aware of OSCAR and my documents will be submitted that way as well, though I’ve been told it’s a good idea to try to apply direct to chambers.\n\nShould I just fire out applications? Keep trying to call? Any other options?",
        "created_utc": 1678562883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Made Mistake on Moral Character Application",
        "author": "Valleyofthesun13",
        "url": "https://www.reddit.com/r/LawSchool/comments/11oslqm/made_mistake_on_moral_character_application/",
        "text": "I submitted my application about a month ago, only found out yesterday that I mistakenly put a yes on an answer I should have put no. I found out because I got an email saying I had to add follow up documents as a result of putting yes. What should I do and could this end up being a problem for my application? I got the email late yesterday so didn’t have time to reach out to my schools dean but freaking out a bit about what could happen.",
        "created_utc": 1678562606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tattoos/body mods? Are they becoming more accepted?",
        "author": "psy-pants",
        "url": "https://www.reddit.com/r/LawSchool/comments/11osgfs/tattoosbody_mods_are_they_becoming_more_accepted/",
        "text": "I’ll be attending law school next year and am wondering what the general consensus is when it comes to tattoos and piercings. \n\nI have stretched ear ear lobes, a couple facial piercings, and a lot of tattoos (I currently don’t have any on my arms, everything is either on my stomach, back, or legs, so they are all very concealable). \n\nI’m considering getting arm tattoos soon, but would like to know if this would harm my chances of getting internships, jobs, or being liked by my professors. \n\nIf it matters I’m a woman. \n\nTIA",
        "created_utc": 1678562246,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do any of your law schools have a chess club?",
        "author": "KingKongDoom",
        "url": "https://www.reddit.com/r/LawSchool/comments/11os8yb/do_any_of_your_law_schools_have_a_chess_club/",
        "text": "Me and my buddy just founded one at our school and we were looking to play other schools but I was struggling to find any active ones. If you do let me know!",
        "created_utc": 1678561740,
        "upvote_ratio": 1.0
    },
    {
        "title": "3Ls going to Dentons: have you heard anything about the Dentons Discover program?",
        "author": "hihellowassupbye",
        "url": "https://www.reddit.com/r/LawSchool/comments/11opfmz/3ls_going_to_dentons_have_you_heard_anything/",
        "text": "I was told we would hear about it in February and well, it's March...",
        "created_utc": 1678554871,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best day/time to send cold emails for info interview?",
        "author": "Gnaeus-Philosophy351",
        "url": "https://www.reddit.com/r/LawSchool/comments/11oox0l/best_daytime_to_send_cold_emails_for_info/",
        "text": "Pretty self explanatory, wondering what the best day/time was to send information interview requests to associates at firms im interested in working at, who either went to my undergrad or law school?",
        "created_utc": 1678553605,
        "upvote_ratio": 1.0
    },
    {
        "title": "How “cliquey” is your law school? Do people say hi or acknowledge you even if you’re not in the friend group?",
        "author": "chargingstation12",
        "url": "https://www.reddit.com/r/LawSchool/comments/11oluu3/how_cliquey_is_your_law_school_do_people_say_hi/",
        "text": "I go to a school that’s supposed to be very “liberal.”\nPeople act like they’re “woke” and “progressive,” whatever that means.\n\nBut when I recently asked one of the cleaning staffs “hi, how you doing?” she acted real surprised.\n\n“No student at *** says hi to us,” the cleaning staff said. “They always pretend to look at the walls when they pass by us.”\n\nSchools may admit a diverse student but does “diversity” actually happen at yours? Or do people mostly congregate with those who look and speak like themselves — to the painful exclusion of others?\n\nI’ve never been at a place where people never looked so “good” on paper — various leadership titles, amazing achievements — but so judgmental and unforgiving in real life.\n\nIf you’re not one of “them,” they do not even acknowledge your existence or say hi if you’re outside the friend group. They sneer and jeer at you when you speak up in class. \n\nWhen I first learned about the mass incarceration problem, I wondered how judges could levy such long punishments to a select group of people for so long a period. \n\nBut I get it now.\n\nThey don’t see you as one of “them.” To their eyes, you’re something less, and they make sure you see that. So why would it matter if you’re locked away for 30 years, 50 years?\n\nAnyways, how’s the social situation at your schools?",
        "created_utc": 1678545771,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is scope of pursuing LL.M in Australia after doing an bachelors in law?",
        "author": "ken_kaneki07",
        "url": "https://www.reddit.com/r/LawSchool/comments/11oh2h4/what_is_scope_of_pursuing_llm_in_australia_after/",
        "text": "",
        "created_utc": 1678531376,
        "upvote_ratio": 1.0
    },
    {
        "title": "Informal Lunch Interview",
        "author": "harcra16",
        "url": "https://www.reddit.com/r/LawSchool/comments/11od08a/informal_lunch_interview/",
        "text": "3L graduating in a few months. Been clerking for a district court judge for the past year. I’ve got an informal lunch interview with a partner at a firm I want to work at next week. What are some good conversational topics/questions to ask so that it’s not inevitably awkward?",
        "created_utc": 1678516808,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L internship",
        "author": "Alert_Lingonberry_79",
        "url": "https://www.reddit.com/r/LawSchool/comments/11oc785/1l_internship/",
        "text": "Question. What’s some adequate hourly pay form 1L internships, is 25-30 an hour average for 40 hour work weeks ?",
        "created_utc": 1678513975,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it bad to take a year off after the Bar ?",
        "author": "InternationalTone598",
        "url": "https://www.reddit.com/r/LawSchool/comments/11obhxh/is_it_bad_to_take_a_year_off_after_the_bar/",
        "text": "Hey everyone. So I’m a 3L and graduating (hopefully ) in May. The bar is in July and assuming I pass that, I was gonna take a year off and get my mental and physical health in order before jumping into my legal career \n\nI’m worried that taking a year off after the bar will be a red flag to employers and do more harm than good. Any thoughts ?",
        "created_utc": 1678511615,
        "upvote_ratio": 1.0
    },
    {
        "title": "a huge “i’m proud of myself” moment from a burnt out 1L",
        "author": "Ok_Profile_2574",
        "url": "https://www.reddit.com/r/LawSchool/comments/11oasmp/a_huge_im_proud_of_myself_moment_from_a_burnt_out/",
        "text": "40+ applications later…I LANDED A FIRM CLERKSHIP I REALLY WANTED!!! it’s from the summer into the fall (so i can get credit for it later on), in the field i’m really interested in, has semi-flexible hours, and is PAID!!!\n\ni honestly just had to tell someone this bc   i didn’t want to stress out my law school friends still working on finding summer jobs. since this semester started, i have been the most burnt out i’ve ever been in my whole life. i’ve been so down on myself lately and been trying to get out of a rut while staying on top of 5 classes and applying to every summer position i could find. so it feels so so so freaking amazing that my hard work may actually be paying off :)\n\nside note: i received a call with the offer a few minutes before my class started and was so shell shocked that i probably sounded like an idiot on the phone LOL",
        "created_utc": 1678509322,
        "upvote_ratio": 1.0
    },
    {
        "title": "What makes a good law expert/student?",
        "author": "beeh1995",
        "url": "https://www.reddit.com/r/LawSchool/comments/11o9lrg/what_makes_a_good_law_expertstudent/",
        "text": "Reading is a key trait a law student should embrace. With the changing policies, amendments and data, law students should keep updated at all cost. I learnt this in a hard way. Went for a gig in a specific law firm during last summer. I was asked about a certain law I was taught in school about two years ago. I was so confident to answer but little did I know it was amended. I lost it. Just reminding you guys and have a good weekend. :)",
        "created_utc": 1678505559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Long shot… what kind of highlighter is this? Got it at a presentation and it is the best one I’ve ever used. Desperate to buy more 😭😭",
        "author": "anxious_prelaw",
        "url": "https://i.redd.it/c8dvswumf2na1.jpg",
        "text": "",
        "created_utc": 1678503151,
        "upvote_ratio": 1.0
    },
    {
        "title": "Public Defender Summer Internship. Any advice?",
        "author": "passiveaggressive08",
        "url": "https://www.reddit.com/r/LawSchool/comments/11o8ri8/public_defender_summer_internship_any_advice/",
        "text": "I recently received an offer to work at my county’s public defender’s office. I’m curious what doors open if I take this position during 1L summer. \n\nWhat has everyone done after doing this for summer? Did you specialize in criminal law? Is there a chance I’d get pigeonholed to stay in the public interest side?",
        "created_utc": 1678502995,
        "upvote_ratio": 1.0
    },
    {
        "title": "when do incoming 1Ls get their first semester schedules?",
        "author": "BagOriginal3550",
        "url": "https://www.reddit.com/r/LawSchool/comments/11o7nui/when_do_incoming_1ls_get_their_first_semester/",
        "text": "",
        "created_utc": 1678499750,
        "upvote_ratio": 1.0
    },
    {
        "title": "when do incoming 1Ls get there schedule?",
        "author": "BagOriginal3550",
        "url": "https://www.reddit.com/r/LawSchool/comments/11o7n06/when_do_incoming_1ls_get_there_schedule/",
        "text": "",
        "created_utc": 1678499687,
        "upvote_ratio": 1.0
    },
    {
        "title": "White collar criminal defense is basically the same as being a public defender, right?",
        "author": "PostModernBaseball",
        "url": "https://i.redd.it/4itkpyg5n0na1.jpg",
        "text": "",
        "created_utc": 1678499607,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L Summer Internship offer from cold email.",
        "author": "gimi-c180",
        "url": "https://www.reddit.com/r/LawSchool/comments/11o45of/1l_summer_internship_offer_from_cold_email/",
        "text": "I wanted to share that I was offered an internship at my county prosecutor’s office after an interview that I asked for in a cold email to them. \n\nIt’s a smaller county, adjacent to the county with the big city where my school is located. But I live here so my commute is going to be an hour and a half shorter this summer than it has been going to school.\n\nI just wanted to share in case there is anybody like me that just wants to get legal experience this summer and is okay with working somewhere more rural. Cold emails work sometimes and are definitely worth a shot!",
        "created_utc": 1678490357,
        "upvote_ratio": 1.0
    },
    {
        "title": "7sage Predictor vs LSAC predictor",
        "author": "jxhiz",
        "url": "https://www.reddit.com/r/LawSchool/comments/11o442r/7sage_predictor_vs_lsac_predictor/",
        "text": "Hey guys, which do you think is more accurate, the 7sage law school predictor or the LSAC likelihood of admission?\nTIA",
        "created_utc": 1678490240,
        "upvote_ratio": 1.0
    },
    {
        "title": "What happens when someone gets arrested and refuses to give their name?",
        "author": "Double_Race3057",
        "url": "https://www.reddit.com/r/LawSchool/comments/11o38zb/what_happens_when_someone_gets_arrested_and/",
        "text": "Heres the context. A friend of mine immigrated from India to the US. He claims he robbed a bank in Germany and served 5 years in a German prison. I called BS because I figured that would have prevented him from being able to immigrate to the US. However, he is saying he never gave them his name or country of origin. Normally they deport people who committ serious crimes. But what if the person refuses to give their name or home country? Do they just release them anyway?",
        "created_utc": 1678488107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Despicable Behavior at Stanford Law School",
        "author": "applesandbananana",
        "url": "https://www.reddit.com/r/LawSchool/comments/11o2res/despicable_behavior_at_stanford_law_school/",
        "text": "At a recent SLS event, Judge Duncan of the 5th Circuit was invited to speak. After being heckled the entire time by student activists (heckling a federal judge), the DEI dean gave a pre-written speech attacking the Judge. Although the dean did say that he was allowed to speak due to the uni’s free speech principles, she seemingly called the students to challenge these policies once they graduate.\n\nThe law profession is fucked with kids like these getting a degree from friken Stanford of all places, lol. The kids at my regional university would never threatened free speech or heckle a federal judge haha.",
        "created_utc": 1678486926,
        "upvote_ratio": 1.0
    },
    {
        "title": "Outlines",
        "author": "AbjectLanguage7743",
        "url": "https://www.reddit.com/r/LawSchool/comments/11o2jmn/outlines/",
        "text": "Any Wisconsin law school student have outlines that are specific for Wisconsin law: civ pro, evidence, etc.?",
        "created_utc": 1678486411,
        "upvote_ratio": 1.0
    },
    {
        "title": "Maybe I can catch up on sleep over spring break",
        "author": "etibbs91",
        "url": "https://i.redd.it/jx1y9xp5m0na1.jpg",
        "text": "",
        "created_utc": 1678481128,
        "upvote_ratio": 1.0
    },
    {
        "title": "maybe this was not for me after all",
        "author": "Nervous-Chocolate",
        "url": "https://www.reddit.com/r/LawSchool/comments/11o09vm/maybe_this_was_not_for_me_after_all/",
        "text": "Context: I'm not studying in America so I am able to study law straight out of high school. I just turned 19 and I'm in my second semester. I'm studying in a language I am proficient in, but not native. \n\nI was very ambitious throughout high school and I have wanted to get into the law school I am in since 9th grade. But now I don't even know why I came. I was interested in the subject and the first semester classes were interesting enough, but now going to lectures is almost unbearable. \n\nThe first semester was an incredibly hard adjustment. I came out of a small high school, where I was top of my class and got high marks in international exams, got invited to the president's banquet and everything. Then I landed into my huge university cohort, where professors would raise their voice if you didn't know something or took longer than 0.5 seconds to come up with an answer. It was incredibly lonely with no clubs group activities to join on the tiny campus (classes are very big but since the campus is just law students, there is only ELSA and the student council representative). \n\nIt didn't help that I was still in my home town, with my parents making me stay at home for university. So I was physically stuck in the same place that I was in high school, which didn't help me move on from it. \n\nI was never a bad student but I spend the first semester praying that I would get the bare minimum of 15 credits just to not be kicked out of the university. Everyone kept telling me that the first semester is always the hardest and that it will get better as I keep going. I just had to push through, and it's alright to not be getting top marks anymore. I ended up passing, somehow. \n\nBut tell me why. I am in the exact same position I was in during autumn. Exhausted, sick and unable to force myself to do my work. It was supposed to get better. I tried so hard in the first few weeks. Did all the reading, prepared for lectures, tried a new note-taking technique. Then, very suddenly I lost all my interest in everything. I don't know what is wrong with me, but studying has become so overwhelming and I can't focus. I don't even want anything anymore. I think of anything I want from life. I don't know why I chose this field, but there is nothing else I want to do. Giving up is not an option because \"you're a girl you can't drop out\". My brain is foggy. I used to make puns all the time, I was able to think quickly. now it seems that I have to think through starchy water. \n\nEverything feels too difficult. I have been sick for a few weeks, but even doing things to relieve the symptoms (bad cough and nosebleeds) feels like too much work. I don't even want to paint anymore. Everything is very tiring. \n\nAnd it's very stupid because there is nothing actually wrong. My life is fine, I just can't deal with it. I will get out of this, I have done it every time so far. I just hate being here. Can't catch a break.",
        "created_utc": 1678480995,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self defence",
        "author": "VancescoLeone",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nzanw/self_defence/",
        "text": "I have always perplexed on how the law works in self defence scenario.\n\nLet say I, or me and my wife, are attacked by one or handful of man on a night street.\nLet say I won the fight. \n\nI must hurt the offender beyond the degree of pain, I must make sure that at least one leg or two arms etc., from them cannot function within 10 mins to prevent vengeful forces, because they are likely to be criminals with explicit violent tendency.\n\nNormally the offenders will just run away because a trial usually won't end well for them \nBut if they accuse me of being the attacker, what is my evidence against such claim? Install a bodycam? A bit too much?\n\nWhat is the best preparation against such offence? A spray? A melee weapon?\nAnd what would be my best preparation when I travel to countries where people might have firearm? It seems quite impossible other than staying in safe crowded places to reduce the probability of being hit?",
        "created_utc": 1678478706,
        "upvote_ratio": 1.0
    },
    {
        "title": "SA or In-House?",
        "author": "lawschoolpain1998",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nyvqu/sa_or_inhouse/",
        "text": "1L choosing between SA at a smaller firm or an in-house internship at a massive company. I am so torn between the two. Comp is similar and I am more interested in the type of law I would be able to see at the company, but my school really emphasizes SA positions so I am unsure. Honestly, I was overjoyed to even get a job I know that I am lucky to be in this position.",
        "created_utc": 1678477762,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boutique Firm or Unpaid In-House Position? [Summer Internship Poll] (More details below)",
        "author": "SergeantBenton",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nynfx/boutique_firm_or_unpaid_inhouse_position_summer/",
        "text": "**DIFFERENCES**:   \n\\- **The boutique firm** is paid but will not offer employment after graduation. Very well known in the state. Most of the partners went to top law schools. I am interested in this practice as it is a tax boutique firm. I am interested in tax law and LLM.\n\n\\- **In-house** is at a major national insurance company. Is unpaid. Will not offer employment after graduation. I am not sure I am interested but I did extremely well in classes relating to health law.   \n\n\nNo need to comment unless you want to, voting is just fine. Thanks!\n\n[View Poll](https://www.reddit.com/poll/11nynfx)",
        "created_utc": 1678477207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone go to baylor and can give me some advice on how the school is?",
        "author": "Ordinary_Effort_6647",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nymy8/anyone_go_to_baylor_and_can_give_me_some_advice/",
        "text": "Hi, sorry if this isn’t the right thread to post this on but someone suggested posting this here! I got admitted to Baylor a while ago and at first I wasn’t really sure I wanted to go there, but now I’m really considering it. I’ve heard from a few current Baylor students they regret going there bcs it’s extremely competitive and there moot court takes up a lot of time. Can anyone who goes to Baylor let me know how they enjoy/enjoyed it?",
        "created_utc": 1678477174,
        "upvote_ratio": 1.0
    },
    {
        "title": "Giving away outlines",
        "author": "risteriera",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nym89/giving_away_outlines/",
        "text": "[removed]",
        "created_utc": 1678477128,
        "upvote_ratio": 1.0
    },
    {
        "title": "ask edna",
        "author": "Tiny_Value_3875",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nx5vt/ask_edna/",
        "text": "hi does anyone have the codes for crypto basics and financial planning for law students they’d be willing to share? if not, it’s ok!",
        "created_utc": 1678473759,
        "upvote_ratio": 1.0
    },
    {
        "title": "Failed a midterm. Can I still pass?",
        "author": "FarPolicy970",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nw9wx/failed_a_midterm_can_i_still_pass/",
        "text": "I am currently a 1L and just got my midterm grade back for one of my classes. I will admit I was a bit unprepared for it–partly my own fault by not studying hard enough but also partly the professor kept repeatedly canceling class and does not keep the the class assignment schedule, which made it difficult to keep track of assignments. \n\nOur midterm was 20 questions, 1hr in-class, closed test, and is worth 30% of my grade. I failed horribly getting 8/20. Participation is 15% and our final is the remaining 55%. We do have a curve that applies to our final grade as well. \n\nIs there a chance I could pass or should I just drop out now??? I have no idea what to do and any advice would be appreciated. I’ve tried doing final grade calculators too but they’re difficult to apply to law school \n\nP.s. I haven’t been blowing off this class either!! the professor genuinely isn’t that great and the class average was barely passing (14/20)",
        "created_utc": 1678471721,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pissed off a new connection",
        "author": "RadiantInfluence8",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nvu6f/pissed_off_a_new_connection/",
        "text": "I am interviewing for a post-grad position at an agency I am currently interning for. My supervisor connected me with a new connection in the division that I am interested in. After I set up the time of the call with this new connection, I realized that I have a meeting at the same time. Since I was not expected to talk on that meeting, I figured I would just join the meeting while talking with the new connection. Unfortunately, when I joined the meeting during the call with the new connection, the new connection heard the meeting because I forgot to mute the software like an idiot. I quickly ran to another quiet room to talk, but the new connection changed his tone right away and started giving me one-word answers to my questions. He was obviously pissed off. I am very upset because I did not mean to disrespect him, and I am afraid it is going to screw my job prospect at this agency and in this particular division. I think it's possible that he will talk negatively about me. Should I send him an email to apologize, or should I just let it go and not making it a bigger deal than it is?",
        "created_utc": 1678470724,
        "upvote_ratio": 1.0
    },
    {
        "title": "Working during or before starting law school as a paralegal",
        "author": "1jxxehxxxxxn",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nvrks/working_during_or_before_starting_law_school_as_a/",
        "text": "Recently I was accepted into law school and I am set to start this September. Currently, I am in a paralegal program which ends in May and I will be a licensed paralegal if I pass the licensing exam in July (if I decide to take it). However, I am questioning whether or not it's even worth it to write the licensing exam and work as a licensed paralegal in that short time frame in between July and September... There's no guarantee that I will be able to even get a job, and on top of that I would have to pay annual licensing fees. I was thinking if I become licensed it may help me find jobs later down the line when I become a lawyer, and I could also do some notary work while in law school. Other than that though, I have a feeling that it's not worth it and maybe I should do something more productive starting right after I complete this paralegal program such as finding a job off the bat, or doing some volunteer work... Looking for advice, any help is appreciated!",
        "created_utc": 1678470545,
        "upvote_ratio": 1.0
    },
    {
        "title": "Salaries for large oil and gas companies",
        "author": "rezeng",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nvnkw/salaries_for_large_oil_and_gas_companies/",
        "text": "Hope this is the right place - curious to hear any information on salaries for being counsel at large oil companies? Typically I see they do big law or transactional work before jumping over the corporate… what’s the pay?",
        "created_utc": 1678470272,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m so damn terrified",
        "author": "Own_Relation_8189",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nvhtx/im_so_damn_terrified/",
        "text": "[removed]",
        "created_utc": 1678469897,
        "upvote_ratio": 1.0
    },
    {
        "title": "Syracuse Law and Cleveland State Law School Admissions and Scholarship",
        "author": "Cool_Asparagus_1074",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nv76n/syracuse_law_and_cleveland_state_law_school/",
        "text": "Hi Everyone, \n\nNon traditional law school applicant. \n\nI’ve applied to SeattleU, Syracuse JDi, and Cleveland State’s part time hybrid program. \n\nI’ve been accepted at Syracuse, waitlisted at SeattleU, and my application is still under review at Cleveland (applied beginning of January). \n\nI really, really want to go to Cleveland State’s part time hybrid program. I’ve been in contact with the admissions office and my application is still under review. \n\nSyracuse JDi program is my second choice because of how expensive it is. I was only offered a 10% merit scholarship there. I’ve applied for reconsideration. \n\nI’ve applied to so many private scholarships as well. \n\nStats: \n\n- Age: 35 \n\n- Arabic female \n\n- GRE: verbal 170, Quant 169, Writing 79\n- Did not take LSAT \n\n- Undergrad GPA: can’t remember but isn’t stellar maybe 3.2?, I graduated college in 2013. I did have to retake microbiology. \n\n- I’m a Registered Nurse who has had a successful career as a Director \n\n- For the past year have been working as a Nurse Paralegal \n\nGiven my track record do I have any chance of getting a better scholarship award? When will CSU make a decision?  I’m going crazy because this seems so out of reach! My financial aide award at Syracuse isn’t even enough to cover tuition! Any advice would be helpful",
        "created_utc": 1678469203,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you ever wish that you majored in something different when you were an undergrad?",
        "author": "Fair-Perception47210",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nut19/do_you_ever_wish_that_you_majored_in_something/",
        "text": "",
        "created_utc": 1678468275,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips on how to make Evidence click?",
        "author": "kennedymt13",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nruve/any_tips_on_how_to_make_evidence_click/",
        "text": "I am getting absolutely wrecked on practice quizzes, especially the last one, which my professor said everyone “improved substantially.”",
        "created_utc": 1678461473,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips on making Evidence click!",
        "author": "kennedymt13",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nrtfw/any_tips_on_making_evidence_click/",
        "text": "I am getting absolutely wrecked on practice quizzes, especially the last one, which my professor said everyone “improved substantially.”",
        "created_utc": 1678461377,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you recover your balance in 2L?",
        "author": "BobBaratheon123",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nraxd/how_do_you_recover_your_balance_in_2l/",
        "text": "I’m a decent way through my 2L year and safe to say it’s been a hard and busy year. It hasn’t necessarily even been fulfilling. Even though I’ve found success I’m starting to see that I do things just to get them done rather than because I’m passionate about the work. \n\nI recently finished a stretch where I was busy at work, had a midterm, and a competition. I gave it my all and got through it but I feel different than I have before coming out of it. \n\nI haven’t been able to see many of my friends lately and the ones I have seen it’s been for school/work stuff. I look around and I feel like I don’t really have much of a life right now outside of school.\n\nI feel like I need it back and I need to find a balance again. For you, how have you found it/got it back?",
        "created_utc": 1678460131,
        "upvote_ratio": 1.0
    },
    {
        "title": "Become a lawyer",
        "author": "laral93",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nrawg/become_a_lawyer/",
        "text": "[removed]",
        "created_utc": 1678460129,
        "upvote_ratio": 1.0
    },
    {
        "title": "Critical Legal Skills in Fall or Spring?",
        "author": "loupgarou1234",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nr7tw/critical_legal_skills_in_fall_or_spring/",
        "text": "2L registering for 3L year soon and trying to decide if I should take the bar prep class in Fall or Spring. I think spring so it will be fresh in my head but some 3Ls say Fall is better because I will be less motivated in the spring. Advice?",
        "created_utc": 1678459901,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone who has successfully completed a judicial internship interview provide some advice? What kinds of questions are often asked and what questions can I ask the judge/clerks?",
        "author": "roomlightdesklamp",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nr0xn/can_anyone_who_has_successfully_completed_a/",
        "text": "",
        "created_utc": 1678459410,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best laptop for law school?",
        "author": "Intelligent_Berry289",
        "url": "https://www.reddit.com/r/LawSchool/comments/11npnlq/best_laptop_for_law_school/",
        "text": "What is the best kind of laptop for law school that is not super expensive?",
        "created_utc": 1678455989,
        "upvote_ratio": 1.0
    },
    {
        "title": "TW: violence, abuse | I need help finding data",
        "author": "venerebirbona",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nnc4j/tw_violence_abuse_i_need_help_finding_data/",
        "text": "Hi, I'm an Italian PhD student in sociolinguistics.\n\nMy research project object is to study if, and how, secondary victimization, victim blaming and institutional abuse are carried out towards women during cross-examination in trials for rape, sexual assault, sexual violence and abuse.\n\nIn order to do so I have to work on trial transcripts regarding the aforementioned crimes, but here in Italy Courts are not that much keen to help me recover them, even if it is in my rights to access the transcripts for motivated reasons of research.\n\nI was wondering if any of you had complete transcripts of these kinds of trials, or could help me find them in some way.\n\nI am not constrained to the Italian law system, so any type of law system would be OK, as long as the transcripts are in English.\n\nThank you in advance ♥",
        "created_utc": 1678449882,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are you on the spectrum?",
        "author": "capriciousfrigate01",
        "url": "/r/biglaw/comments/11nli61/are_you_on_the_spectrum/",
        "text": "",
        "created_utc": 1678444393,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I’m going to fail out and I’m panicking.",
        "author": "BoxedCake",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nj31c/i_think_im_going_to_fail_out_and_im_panicking/",
        "text": "I was diagnosed with a brain tumor 2 weeks before my 1L midterms and got Cs/Bs the rest of the year because I was suffering with such crippling depression. I went back to my 2L year at the encouragement of my parents after having surgery, because I still of course want to be an attorney — I just honestly feel so completely set up for failure. I am still absolutely struggling because of depression, medication that gives me intense brain fog, and of course the closed book exams. I do not have the energy to continue anymore because I just was notified I am now on academic probation and have a 2.3 GPA, despite having of course never “failed” a class. I’m just at a total loss and my parents keep telling me to give it my all but I’m afraid I have and now am completely overwhelmed that I’m very very likely not going to be able to raise my GPA enough. My school has given me accommodations but I just feel like with all of my medical stuff I was kind of set up for failure to begin with. And now I’ll of course be stuck with a loan the price of a house for some people. I don’t know what to do.",
        "created_utc": 1678436060,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L summer DA internship.",
        "author": "ameriguy99",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nj0zr/1l_summer_da_internship/",
        "text": "I am just wondering if anyone has ever done a 1L DA internship. \n\nWhat kind of work do they have 1Ls do?\nWhat should someone expect or do to prepare?\nIf you have done a similar program, did you find it worth while? \n\nThank you for your opinions....",
        "created_utc": 1678435858,
        "upvote_ratio": 1.0
    },
    {
        "title": "Incoming 1L this fall- How does BL recruitment actually work in law school?",
        "author": "Wooden_Blueberry_723",
        "url": "https://www.reddit.com/r/LawSchool/comments/11niixh/incoming_1l_this_fall_how_does_bl_recruitment/",
        "text": "i'm an incoming 1L this fall hoping to go into biglaw in NYC. i'm still waiting on a couple of more schools in NY, but my first choice as of right now is probably Cornell. i was just wondering how biglaw recruitment works in law school because i pretty much don't know anything about this...like is it just purely based on your 1L GPA and campus involvement? is it mostly through referrals/connections? and do you usually start recruitment during your 1L fall semester?",
        "created_utc": 1678434201,
        "upvote_ratio": 1.0
    },
    {
        "title": "For those considering University of Florida Levin College of Law, how do you feel about the Dean leaving? Or alumni? The Dean’s main focus was to raise the ranking which she certainly did. I wonder if the ranking will fall without her.",
        "author": "Hotpocket305",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nii0i/for_those_considering_university_of_florida_levin/",
        "text": "",
        "created_utc": 1678434112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Happiness Is Under A Good Roof And In Secure Home &amp;ndash; Macho Vibes",
        "author": "jeffreyeereclae",
        "url": "https://www.machovibes.com/happiness-under-good-roof-and-secure-home/",
        "text": "",
        "created_utc": 1678420523,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which Criminal Offences Will Go On A Criminal Record? - Myvuhub.com",
        "author": "AmyWoodforde4",
        "url": "https://myvuhub.com/which-criminal-offences-will-go-on-a-criminal-record/",
        "text": "",
        "created_utc": 1678420411,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ironic Hatred towards Prosecutors?",
        "author": "InformationDouble273",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ndtmi/ironic_hatred_towards_prosecutors/",
        "text": "As a POC, I am curious to understand why an overwhelming majority of law students, particularly those who are not POC, stigmatize being a prosecutor? There are plenty of POC prosecutors, they are not a monolith? and wouldn’t having more POC prosecutors be a good thing for society? \n\nI see the same with biglaw? It doesn’t make sense to me to say we want people to overcome barriers but then make the career paths that would allow them to do that seem terrible.",
        "created_utc": 1678420224,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many hours of schoolwork do you do each week? (including in-class time)",
        "author": "oolongmilkteaboba",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ndln7/how_many_hours_of_schoolwork_do_you_do_each_week/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/11ndln7)",
        "created_utc": 1678419607,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interviewing w/ the DOJ tomorrow for a 1L Summer Internship. Any tips or advice?",
        "author": "ImBooped",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nd8ij/interviewing_w_the_doj_tomorrow_for_a_1l_summer/",
        "text": "The interview is with the USAO in my hometown, so I'm hoping to hammer away that personal connection to the city. Does anyone have any particular tips or pieces of advice for the interview?",
        "created_utc": 1678418635,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are Law students hot",
        "author": "StupidSexyLawyer",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nbzjl/are_law_students_hot/",
        "text": "Are law students hotter than the average person",
        "created_utc": 1678415372,
        "upvote_ratio": 1.0
    },
    {
        "title": "What the heck are you people putting in your Stanley cups that you keep sipping from all day? 😭",
        "author": "Glittering_Pasta",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nbj5b/what_the_heck_are_you_people_putting_in_your/",
        "text": "Like I’d hate to be sipping tea from it all day or apple juice and dragging the cup with me everywhere 🤣",
        "created_utc": 1678414198,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L job search been rough but I hit 405 today.",
        "author": "movin4call",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nb9aq/1l_job_search_been_rough_but_i_hit_405_today/",
        "text": "Been taking lots of L’s this job search season but I hit a 405 squat today. Feels good man. \n\nI may be getting rejected but at least my ass and quads are fucking massive.\n\nThat’s all.",
        "created_utc": 1678413524,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you do 2 clinics at Georgetown Law?",
        "author": "slimjim69696969",
        "url": "https://www.reddit.com/r/LawSchool/comments/11nb3xe/can_you_do_2_clinics_at_georgetown_law/",
        "text": "0L writing a LOCI and 2 clinics look super appealing to me so I want to mention my interest in them, but I don't want to look like a dumbass if you can only do one.",
        "created_utc": 1678413138,
        "upvote_ratio": 1.0
    },
    {
        "title": "Freer audio recording?",
        "author": "Highlighted_hill",
        "url": "https://www.reddit.com/r/LawSchool/comments/11n8cza/freer_audio_recording/",
        "text": "I’m a recent graduate, but had gotten Freer audio recordings for Civ Pro from this sub my 1L year and they helped tremendously. My brother is starting his 1L in the fall and I wanted to get them for him, but my school email is disabled and when I found them on this sub, the google drive required a permission request which hasn’t worked for me yet. Does anyone happen to have the audio files? Thanks so much!",
        "created_utc": 1678406295,
        "upvote_ratio": 1.0
    },
    {
        "title": "Offering outlines! Hmu at katlake57@gmail.com",
        "author": "seraneillle",
        "url": "https://www.reddit.com/r/LawSchool/comments/11n6mao/offering_outlines_hmu_at_katlake57gmailcom/",
        "text": "",
        "created_utc": 1678402263,
        "upvote_ratio": 1.0
    },
    {
        "title": "2L Judicial Internships",
        "author": "marco-polo-scuza",
        "url": "https://www.reddit.com/r/LawSchool/comments/11n61be/2l_judicial_internships/",
        "text": "So I have a bit of a dilemma here.  I accepted a summer offer at a small law firm about a month ago.  Yesterday, I (surprisingly, despite my low GPA) received an email from a state trial court judge offering an interview for a summer judicial internship.  I usually see 1Ls taking these but heard that judicial internships are highly sought after.  However, I don't see a lot of info about this at the state court (county courthouse) level.  As far as I know, I shouldn't reject a judge's offer to intern or clerk for them, so if I interview and get it, I likely should say yes.\n\n&amp;#x200B;\n\nAt this point, what should I do?\n\n[View Poll](https://www.reddit.com/poll/11n61be)",
        "created_utc": 1678400977,
        "upvote_ratio": 1.0
    },
    {
        "title": "2L Judicial Internship?",
        "author": "marco-polo-scuza",
        "url": "https://www.reddit.com/r/LawSchool/comments/11n6023/2l_judicial_internship/",
        "text": "So I have a bit of a dilemma here.  I accepted a summer offer at a small law firm about a month ago.  Yesterday, I (surprisingly, despite my low GPA) received an email from a state trial court judge offering an interview for a summer judicial internship.  I usually see 1L's taking these but heard that judicial internships are highly sought after.  However, I don't see a lot of info about this at the state court (county courthouse) level.  As far as I know, I shouldn't reject a judge's offer to intern or clerk for them, so if I interview and get it, I likely should say yes.  \n\n&amp;#x200B;\n\nAt this point, what should I do?\n\n[View Poll](https://www.reddit.com/poll/11n6023)",
        "created_utc": 1678400901,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which job should I take: Remote Law Clerk for Administrative Hearing Company or Career Law Clerk for a Large City Court?",
        "author": "angie3-141592",
        "url": "https://www.reddit.com/r/LawSchool/comments/11n4x1v/which_job_should_i_take_remote_law_clerk_for/",
        "text": "Background: Just took the bar. LLM student with foreign law degree but American citizenship.\n\nRemote Law Clerk - pays, I think ($40-45K).  Requires 5 days of training  at a location 3-4 hours away. Otherwise job is completely remote.  Job involves research and writing, listening to appeals on SNAP benefits / medical benefits etc and making a preliminary decision in accordance with the law.  Also involves Passing decision over to he hearing officer  for approval.\n\nCareer Law Clerk - Pays $55K - job is an hour drive each way to a major city.  Parking - nightmare. Train is possible but only 1 train every 90 min.  Job will be clerking for 3 different senior judges involving mass tort cases.  Office is low key but formal. City has residency requirement which would require me to relocate within 1 year. (Not crazy about pulling kids out of their current nice suburban school and moving them to a major city.\n\nI’ve been working from home since late 2019 and feeling reluctant to go to an office. But maybe I should push myself out of my comfort zone and try to get some great experience with this city clerkship.",
        "created_utc": 1678398506,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Anyone @ UF Know Anything About Dean Rosenbury Leaving?",
        "author": "rami2216",
        "url": "https://www.reddit.com/r/LawSchool/comments/11n3jx3/does_anyone_uf_know_anything_about_dean_rosenbury/",
        "text": "Saw this [article](https://www.nytimes.com/2023/03/09/nyregion/barnard-college-laura-rosenbury.html) today and wanted to see if anyone has any info. Was accepted to UF and am leaning towards attending, but I've heard there's been a lot of turnover, and now there's this too.\n\nHere's screenshots of the article if you don't have access: [https://imgur.com/a/VyFCxaH](https://imgur.com/a/VyFCxaH)",
        "created_utc": 1678395443,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to find housing for law school?",
        "author": "chemreligious",
        "url": "https://www.reddit.com/r/LawSchool/comments/11n2yuq/how_to_find_housing_for_law_school/",
        "text": "Hey friends! I was wondering how people usually go about finding housing for law school - do you find roommates and then find a place? Find a room available in a house/apartment with random roommates already there? Are there any good sites to check out (apartments.com, Zillow, whatever else?) Tips for avoiding scams or bad situations?\nI lived on campus all 4 years of undergrad and I’m a K-JD so this is my first ever apartment search lol.\nI’m most likely going to Catholic U Law but I haven’t made my deposit yet so I’m open to housing advice for any area!",
        "created_utc": 1678394075,
        "upvote_ratio": 1.0
    },
    {
        "title": "2023 1L Summer, what are you doing?",
        "author": "Law_Guy_Why",
        "url": "https://www.reddit.com/r/LawSchool/comments/11n1xge/2023_1l_summer_what_are_you_doing/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/11n1xge)",
        "created_utc": 1678391695,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bad idea, physical thank you notes?",
        "author": "educated_shrimp",
        "url": "https://www.reddit.com/r/LawSchool/comments/11n13h1/bad_idea_physical_thank_you_notes/",
        "text": "May be a dumb question but are physical thank you notes a bad idea after a callback? The firm told me it would be about a week as they’re still interviewing. I’m really interested in working there and would like to try to increase my odds. It’s personalized letterhead so I feel like it could help. I know any email I send is just going to get a boilerplate response if I do that.",
        "created_utc": 1678389759,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just saw my law schools dean at…",
        "author": "Open-Eggplant7426",
        "url": "https://www.reddit.com/r/LawSchool/comments/11n0z29/i_just_saw_my_law_schools_dean_at/",
        "text": "The strip club. It was a truly eye-opening experience. I walked in sat down at a table to wallow in my own sorrow while Bethany was throwing that ass back at me when out of the corner of my eye I see my dean. We made eye contact briefly and I decided it was a good idea to go talk to him. So I did. And there I was at 1am on a Tuesday night getting absolutely hammered with my LS dean… at the strip club. So yesterday I wake up to an email from his personal email offering me a summer job at a firm he has close connections to. Needless to say, I am thrilled.",
        "created_utc": 1678389484,
        "upvote_ratio": 0.99
    },
    {
        "title": "Best part of working in my law firm (my favorite co worker)",
        "author": "Aggressive-Switch380",
        "url": "https://i.redd.it/unki34o2ssma1.jpg",
        "text": "",
        "created_utc": 1678386265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questioning my ability to practice law...",
        "author": "milkofdaybreak",
        "url": "https://www.reddit.com/r/LawSchool/comments/11mzjgp/questioning_my_ability_to_practice_law/",
        "text": "Is this normal? I'm a 2L and I feel completely unprepared for actual practice. Is one year really going to change anything?",
        "created_utc": 1678386185,
        "upvote_ratio": 1.0
    },
    {
        "title": "Odds of getting a return offer from your 1L big law summer associate position?",
        "author": "Turbulent_Ad9941",
        "url": "https://www.reddit.com/r/LawSchool/comments/11my0q8/odds_of_getting_a_return_offer_from_your_1l_big/",
        "text": "",
        "created_utc": 1678382695,
        "upvote_ratio": 1.0
    },
    {
        "title": "CHAT GPT &amp; ACADEMIC INTEGRITY",
        "author": "Ill_Appearance_4522",
        "url": "https://www.reddit.com/r/LawSchool/comments/11mxz34/chat_gpt_academic_integrity/",
        "text": "I'm prone to overthinking shit soo if this sounds crazy just downvote it and I'll delete haha. But, are there any academic integrity concerns when using Chat GPT? I have been using it to edit some of my papers and I also have it sketch a general outline that I follow to guide me in some of my writings. Is this \"illegal\" should I stop? LMK thank you.",
        "created_utc": 1678382587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Discouraged because of my stats",
        "author": "lilsie",
        "url": "https://www.reddit.com/r/LawSchool/comments/11mxodj/discouraged_because_of_my_stats/",
        "text": "Hi guys,\n\nI really want to go to law school. I've been working full-time as a paralegal since I graduated December 2021, and have been studying for a month, PTing around 165. I'm aiming for above 170 by the time I take it in June. \n\nI went to a top 3 public university, but my GPA is slightly below 3. I didn't take college seriously at all, and I'm worried about how much this will hurt my chances. I want to try to make it up with my LSAT/recommendations/extracurriculars, but I also want to be realistic and not be too let down when I can't get into any good law schools. I'm looking for fit and to go to the best law school I can get into, but am feeling pretty discouraged right now.\n\nJust give it to me straight, is there any chance for me to get into a T-2 law school? Did anyone here overcome a low GPA with other parts of their application?",
        "created_utc": 1678381885,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does a Low Income student afford Law School?",
        "author": "Traditional-County-2",
        "url": "https://www.reddit.com/r/LawSchool/comments/11mxcri/how_does_a_low_income_student_afford_law_school/",
        "text": "I'm a Junior in University and while I am currently working and saving money at the moment, I highly doubt I'll have enough money to even afford two years of school. I can barely even afford my current university right now.",
        "created_utc": 1678381152,
        "upvote_ratio": 1.0
    },
    {
        "title": "Apparel design contest at Northwestern",
        "author": "Ad_vocatus",
        "url": "https://i.redd.it/jo5ewqbqasma1.jpg",
        "text": "",
        "created_utc": 1678380430,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello. I'm a masters student and I have to write a paper for Civil Responsibility. Do you know of any interesting themes?",
        "author": "Slow-Project-9724",
        "url": "https://www.reddit.com/r/LawSchool/comments/11mwtck/hello_im_a_masters_student_and_i_have_to_write_a/",
        "text": "",
        "created_utc": 1678379874,
        "upvote_ratio": 1.0
    },
    {
        "title": "Civil Responsability",
        "author": "Slow-Project-9724",
        "url": "https://www.reddit.com/r/LawSchool/comments/11mw5mo/civil_responsability/",
        "text": "Hello.\nI'm a masters student and I have to write a paper for Civil Responsability. Do you know of any interesting themes?",
        "created_utc": 1678378277,
        "upvote_ratio": 1.0
    },
    {
        "title": "COVID during the bar?",
        "author": "JimThomeHitsDingers",
        "url": "https://www.reddit.com/r/LawSchool/comments/11mvzqo/covid_during_the_bar/",
        "text": "What happens if you get COVID right before the bar? Is there any make up dates? \n\n- Sincerely a 3L who is currently sick and irrational",
        "created_utc": 1678377911,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone please tell me what is ODR",
        "author": "ireadstuffff",
        "url": "https://www.reddit.com/r/LawSchool/comments/11mvgha/can_anyone_please_tell_me_what_is_odr/",
        "text": "I am applying for an internship, and the form includes a box asking for details like Rank, Vocation and ODR.\n\nSo what is ODR ?",
        "created_utc": 1678376651,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can any man answer this question for Case Law? Explain its significance to the development of law",
        "author": "Mixyyz",
        "url": "https://www.reddit.com/r/LawSchool/comments/11mtgcs/can_any_man_answer_this_question_for_case_law/",
        "text": "",
        "created_utc": 1678371723,
        "upvote_ratio": 1.0
    },
    {
        "title": "Needing to be unpissed",
        "author": "SebastianJF",
        "url": "https://www.reddit.com/r/LawSchool/comments/11msdzn/needing_to_be_unpissed/",
        "text": "For those of you who didn’t get into their desired law school, how did you manage your frustration?\n\nI am a 2L and I continue to harbor a lot of anger and resentment for not landing in the T-14. I ended up landing in the T-30 instead. My school’s reach is regional and I have no summer job prospects. I can’t help but think that my career will be perpetually impacted because of my decision to come here. \n\nSo I am curious, how did you manage?",
        "created_utc": 1678369040,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you write about in a journal comp personal &amp; diversity statements?",
        "author": "BepisKing",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ms812/what_do_you_write_about_in_a_journal_comp/",
        "text": "My school released info on journal comp, and requests personal statements as well as diversity if you want. What do you write about? It seems weird to me, a bit. I feel like my personal statement should address diversity, and that a second statement just for diversity seems a little much.  advice?",
        "created_utc": 1678368606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else deeply questioning why they came to law school in the first place?",
        "author": "js001232",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ms6ss/anyone_else_deeply_questioning_why_they_came_to/",
        "text": "",
        "created_utc": 1678368513,
        "upvote_ratio": 1.0
    },
    {
        "title": "3Ls, how we feeling about graduation?",
        "author": "brownbag5443",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ms166/3ls_how_we_feeling_about_graduation/",
        "text": "I'm also a 3L. Fortunate to have a job lined up. K-JD. Weirdly scared, but excited",
        "created_utc": 1678368071,
        "upvote_ratio": 1.0
    },
    {
        "title": "William Thomas Berkowitz sr on TikTok",
        "author": "SexTnine9",
        "url": "https://www.tiktok.com/t/ZTRWnyWYj/",
        "text": "",
        "created_utc": 1678363885,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are you looking for some to write a law research paper for school or court proceedings?",
        "author": "beeh1995",
        "url": "https://www.reddit.com/r/LawSchool/comments/11mns2z/are_you_looking_for_some_to_write_a_law_research/",
        "text": "Hello, are you looking to hire a law expert research writer?\n\nAt one point, we are in a dilemma to conduct certain activities like starting a business, handling a case, and  school research papers. And you want a written explanation research papers relating to your interested activities. I can write a research paper of any length and prices are low and negotiable. DM me. My discord: Tutorsheryl#1371",
        "created_utc": 1678353665,
        "upvote_ratio": 1.0
    },
    {
        "title": "really want to do appellate work after graduation but struggled with moot court …",
        "author": "Throwaway20372628392",
        "url": "https://www.reddit.com/r/LawSchool/comments/11mly0q/really_want_to_do_appellate_work_after_graduation/",
        "text": "very discouraged and depressed about this. it felt like judges were struggling to give me even the slightest bit of positive feedback. all I get is “you seem nervous” and “I didn’t understand your argument but you knew the facts and the law well.” on top of that my partner left me to fend for myself with the tougher of the two issues and I just felt like a fucking fool. I wanted this to be a good learning experience that would empower and encourage me but it did the absolute opposite.\n\nI don’t want to give up on the idea of appellate work but I’m REALLY having a tough time here. what can I do to get better at this?",
        "created_utc": 1678346788,
        "upvote_ratio": 1.0
    }
]