[
    {
        "title": "Dreading next semester",
        "author": "Uncle_Oogie",
        "url": "https://www.reddit.com/r/LawSchool/comments/105qbox/dreading_next_semester/",
        "text": "Just got my grades back for my first semester yesterday and I did considerably better than I had expected. A little bit above average, which is more or less where I'd like to be.\n\nMy problem is that finals were so miserable and stressful that I still feel drained. Halfway through finals I was so stressed that I basically said fuck it, I'm not gonna kill myself with studying over this, I'll half-ass it and deal with whatever happens. Part of me even hoped I did poorly enough that I could justify dropping out to myself.\n\nI'm having trouble getting over that attitude now that I have my grades back and dropping out doesn't seem like a reasonable decision. I don't think I hate law school, because most of the semester was challenging but manageable. But finals were the most stressful thing I've ever done, and break feels like it's going by too quickly for me to recuperate.\n\nI have almost no motivation for the summer job search, but the worse feeling is how much I don't want to go back for another semester of this. Everyone says it gets easier, but I still feel that post-finals brain fog from last semester and worry that I won't be able to concentrate on studying again.\n\nMy classes start in about a week and a half. Does anyone else feel similarly / have gone through the same thing?",
        "created_utc": 1673101837,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a legal research a good alternative to do over the summer instead of an internship for a 1L or should I only apply to internships?",
        "author": "BlueLightGalaxy-",
        "url": "https://www.reddit.com/r/LawSchool/comments/105prji/is_a_legal_research_a_good_alternative_to_do_over/",
        "text": "Many thanks!",
        "created_utc": 1673100258,
        "upvote_ratio": 1.0
    },
    {
        "title": "Keep Pressing, 1Ls!",
        "author": "SadAdvantage6505",
        "url": "https://www.reddit.com/r/LawSchool/comments/105pe87/keep_pressing_1ls/",
        "text": "Writing this because I didn’t do so well my first semester of law school and know how awful it can feel. I am a first-gen college and law student and, for various reasons, I finished my first semester of 1L in the bottom 1/3 of my class at my t30. In response, I committed myself to learning from my mistakes, spent more time studying the “art” of writing a good law school exam, and experimenting with study methods that I found worked for me (as opposed to what others recommended me). Managed to improve my grades for the spring semester of 1L to the top 30%. Recently, I received my grades for fall of 2L and ended up finishing  in the top 5% of my class despite it being so far my hardest semester of law school (most of my classes had the same curve as 1L plus I had to do a bunch of ungraded journal work). \n\nThe takeaway is to resist the urge to stop caring! I know how discouraging it can be, but if you’re committed to improving then where you’re at is not where you’ll always be! Not everyone starts on a perfect note, but how we respond to our shortcomings is far more valuable in the long run. In a way, I’ve come to be proud of my trajectory because it reminds me that when faced with immense disappointment, I decided to do something about it. Never forget that you can too!",
        "created_utc": 1673099193,
        "upvote_ratio": 1.0
    },
    {
        "title": "honestly, just relieved to know my study system works",
        "author": "sydsjackal23",
        "url": "https://www.reddit.com/r/LawSchool/comments/105nirl/honestly_just_relieved_to_know_my_study_system/",
        "text": "Just got my 1L grades back - very happy and proud of myself. The biggest fear I had prior to grade release was the idea of finding out my approach to law school didn't work - so the biggest relief was learning that it did and I'm on the right track. I'm glad I went with my gut and found a system that worked for me and stopped comparing my study habits to those of my fellow classmates. Long-term goal: stop comparing, period.",
        "created_utc": 1673093090,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will I be asked for my grades again before starting my 2L summer position?",
        "author": "Throwaway12543218",
        "url": "https://www.reddit.com/r/LawSchool/comments/105mj7j/will_i_be_asked_for_my_grades_again_before/",
        "text": "[removed]",
        "created_utc": 1673089588,
        "upvote_ratio": 1.0
    },
    {
        "title": "where can i find rule 7 of rules on appeal (for California)?",
        "author": "chiotic",
        "url": "https://www.reddit.com/r/LawSchool/comments/105lpwg/where_can_i_find_rule_7_of_rules_on_appeal_for/",
        "text": "i was looking at the Stevens v. Superior Court of SF. there's a quote that was written\n\n&gt;Under the Rules on Appeal the appellant may select the method by which the record shall be prepared — the judgment roll, full reporter's transcript, agreed statement or settled statement. Rule 7 confers the legal right to proceed on a settled statement. That rule provides for the filing by appellant, in lieu of a reporter's transcript, of a proposed narrative statement. The respondent is then given the opportunity to file proposed amendments. Rule 7(d) then provides for a hearing on the settlement of the statement. The judge is then required to \"settle the statement and fix the time within which the appellant shall engross it as settled.\" When the appellant files the engrossed statement, with time given to respondent to object, it is \"presented by the clerk to the judge for certification.\" The rules do not provide for a motion to strike the narrative statement except in rule 7(c) where it is provided that the appellant, if he has had an entire or partial transcript of the oral proceedings prepared and refuses to comply with a court order to allow its use by respondent, a motion to strike the proposed statement may be granted\n\ni tried searching up rules on appeal, rule 7 but i'm getting stuff about bonds for appellants. i'm not in law school but am doing a legal internship and this is related to it. if anyone could link me or point me in the right direction to find this rule would be helpful, thank you.",
        "created_utc": 1673086481,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do people develop relationships with law professors?",
        "author": "movin4call",
        "url": "https://www.reddit.com/r/LawSchool/comments/105jdf7/how_do_people_develop_relationships_with_law/",
        "text": "I never did this for undergrad so I have zero clue.\n\nAll my professors are cool. Some of them are quite approachable and I'd love to get to know them better.\n\nYes, I won't deny that it'd be helpful to have them as a reference in the future. So just being honest.\n\nBut I also don't want to risk coming off as someone trying to suck up to the teacher.\n\nSo how do you build that bond and later have someone as a reference in the future?",
        "created_utc": 1673077737,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does a specific curve mean the average or median GPA?",
        "author": "RachelL2001",
        "url": "https://www.reddit.com/r/LawSchool/comments/105j23v/does_a_specific_curve_mean_the_average_or_median/",
        "text": "So if my 1L classes are curved to a 3.2, that doesn’t necessarily mean the average GPA will be a 3.2 right? Or am I thinking incorrectly?\nFor reference, I got a 3.0 this semester. I don’t know what type of law I wish to go into (government maybe? Something with decent work/life balance). Any advice?",
        "created_utc": 1673076584,
        "upvote_ratio": 1.0
    },
    {
        "title": "For anyone feeling deflated with 1L Grades like me, read this for some encouragement and hope.",
        "author": "movin4call",
        "url": "https://www.reddit.com/r/LawSchool/comments/105j076/for_anyone_feeling_deflated_with_1l_grades_like/",
        "text": "[https://www.nytimes.com/2010/05/25/us/politics/25kagan.html#:\\~:text=Kagan%20received%20two%20letter%20grades,a%20B%2Dminus%20in%20torts](https://www.nytimes.com/2010/05/25/us/politics/25kagan.html#:~:text=Kagan%20received%20two%20letter%20grades,a%20B%2Dminus%20in%20torts).\n\n&amp;#x200B;\n\nObviously, Justice Kagan is the exception and not the norm. But it shows you that you can improve upon your first semester in law school. Let's not throw in the towel and despair. We got more time to improve and get better.\n\nBest of luck everyone!",
        "created_utc": 1673076386,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rant",
        "author": "ugh_imleaving",
        "url": "https://www.reddit.com/r/LawSchool/comments/105ixda/rant/",
        "text": "Does any other school have a group chat for your class and people text there and won’t stfu. Like they use the gc to talk about stupid irrelevant stuff, completely unrelated to anything about school. They obviously have their own outside group chats but use the class one because they thinks it’s funny or something \nI might just be annoyed but cheers to starting another semester-_-*",
        "created_utc": 1673076094,
        "upvote_ratio": 1.0
    },
    {
        "title": "Flunked out of law school after first semester. Advice?",
        "author": "_fabiola1",
        "url": "https://www.reddit.com/r/LawSchool/comments/105ipfv/flunked_out_of_law_school_after_first_semester/",
        "text": "So, it’s been a couple of days since I found out that I was being academically expelled from my school because I got a 1.54 GPA. Students at my school are expelled if GPA is below 1.8 after any semester, whether its the first or second of 1L or at any time after the first year. I had no idea that my school did not have academic probation. I did not read the Handbook, but even if I had I never thought i’d be in this position. Before y’all bash me for not having what it takes. Here are some things I think led me to this point:\n\n1. I suffer from a progressive eye disease called keratoconus. My case is bad enough that it can’t be corrected by either glasses or soft contacts. Miraculously, a new eye specialists was able to correct my vision in one eye to 20/20 and the other to 20/25, but this just happened on Dec 20 and I never got a chance to be in law school with this improved vision. Obviously, I went the whole semester having to suffer through squinting and headaches both in class and during studying. Yes, I got accommodations but not until October because the accommodations office took forever to process.\n\n2. Financial struggles have a way of affecting law school. I applied for GRAD plus loans the June before law school and due to some old debt, they wouldn’t approve me until I paid over $2,000 to pay it off. I scrambled to get that money and paid it within a week. Still, my case worker was being very meticulous and annoying trying to match the debt’s old account number to the account number the collection agency had for that same debt claiming they didn’t match, which they wouldn’t because the debt had been assigned to a collection agency which creates a different account number for their purposes. Long story short, I did not receive any money until October…well into the first semester. I had to ask for page scans for the Contracts casebook from a “friend” that quickly got annoyed and claimed her laptop memory was full. I had all the other books, which I paid with the only money I had after paying that old debt I mentioned. However, this meant I had to borrow a laptop and a backpack from my sister, which she kindly allowed. Even for\norientation I had to buy nice shoes, wear them, and return them. I had to ask for food stamps and the whole thing.\n\n3. A lot of my family didn’t respect my studying/time boundaries. I recently became an aunt and I would come home to have my mom expecting me to take care of my niece until 6PM because my sister was working from home and would leave here to my\nMom, who in turn claimed to have to leave to work and would be mad when I said I needed to study. Also, my siter and brother in law would come late to pick their daughter up and it wouldn’t be from work because they had already taken the time to go home, shower, and THEN come pick her up. By the time they left I was forced to study with a headache on too of my regular vision induced headaches.\n\n\nAll in all, I feel like the world aligned for me to fail and now I don’t know what to do with my life. Should I re-apply in one year, should I settle for a paralegal job. Should I switch gears completely to another career?\n\nHelp. 😣 i am embarrassed to admit my failures to my family and I feel lost about what career to choose in life. I come from a family of low income immigrants and don’t want to continue to live a life of financial insecurity  in the future.",
        "created_utc": 1673075317,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s my class rank?",
        "author": "slatt132124",
        "url": "https://www.reddit.com/r/LawSchool/comments/105hnri/whats_my_class_rank/",
        "text": "[removed]",
        "created_utc": 1673071763,
        "upvote_ratio": 1.0
    },
    {
        "title": "COMMUNITY COLLEGE AND LAW SCHOOL ADMISSIONS",
        "author": "Reasonable_Manager32",
        "url": "https://www.reddit.com/r/LawSchool/comments/105hkbz/community_college_and_law_school_admissions/",
        "text": "My community college transcript is awful. My gpa was okay but I had to retake multiple classes and withdrew from many courses. I transferred to Penn State. I’m a Senior now and I have a near perfect gpa at penn state. Am I screwed for law school admissions? My grades didn’t transfer to Penn State but I assume community college grades will be considered. I have big aspirations and want to go to a top law school, but it seems unlikely that i’ll be considered now.",
        "created_utc": 1673071459,
        "upvote_ratio": 1.0
    },
    {
        "title": "What type of job experience would you recommend to someone pre law school?",
        "author": "_sinja",
        "url": "https://www.reddit.com/r/LawSchool/comments/105gkdq/what_type_of_job_experience_would_you_recommend/",
        "text": "",
        "created_utc": 1673068321,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grades!",
        "author": "mts-molehills-etc",
        "url": "https://www.reddit.com/r/LawSchool/comments/105g0y9/grades/",
        "text": "Another \"I'm saying this here bc if I told law students I know in real life it would be an asshole move\" post - my first semester grades released today and I ended up with a 3.77 - definitely top 25% and probably higher. I was so worried all semester bc my school's LSAT median was crazy high - higher than my score (which I thought was a fluke anyway). I was also surrounded by a bunch of people who went to ivy league undergrads etc, and some who got super into the competitive aspect of law school, while I have a far less elite background and don't do well with that kind of adversarial mindset.\n\nWhen I was making my school decision last year, there were a few weeks where I was terrified that I was about to ruin my life and go into major debt over what would turn out to be a huge mistake, so more than anything it's nice to have that decision validated - I know this is only the beginning, but I think I'm doing what I'm supposed to be doing. \n\nCongrats to fellow 1Ls for making it through this semester, and remember to just keep your head up and run your own race.",
        "created_utc": 1673066676,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got a B+ in Civ Pro!",
        "author": "Difficult_Taste_2544",
        "url": "https://www.reddit.com/r/LawSchool/comments/105f19v/i_got_a_b_in_civ_pro/",
        "text": "I thought I bombed the final and assumed the best I could hope for was a B-. I honestly couldn't believe it when I saw the grade",
        "created_utc": 1673063679,
        "upvote_ratio": 1.0
    },
    {
        "title": "I GOT INTO LAW SCHOOL!",
        "author": "sandeecheekz",
        "url": "https://www.reddit.com/r/LawSchool/comments/105ev7t/i_got_into_law_school/",
        "text": "I got into law school! Me, the person who had to drop out of school at 14 to raise my sister’s baby, me, the person who was born homeless with one parent addicted to meth and another one in prison. I never ever thought I was capable of anything. Now I’m starting to wonder if I am. They gave me a 50% scholarship as well. When I saw that box in the mail, I nearly fainted. I just needed to share with people who understand my excitement. This can’t be real. It just can’t.",
        "created_utc": 1673063154,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much does a Lawyer make a year?",
        "author": "Expensive-Order-5123",
        "url": "https://www.reddit.com/r/LawSchool/comments/105enpa/how_much_does_a_lawyer_make_a_year/",
        "text": " It is not clear to me how much money lawyers make. Some supposedly make around a million dollars per year, while others make only 100,000 dollars per year, and some are not financially successful. I am interested in pursuing a career in law because it involves logic and argumentation, which are skills I enjoy using. I used to participate in debates and still enjoy doing so. However, I am concerned about the pay in this field because I want to achieve financial independence and am currently not financially well off. Can I expect to make a good income as a lawyer if I am skilled at the job? I am 17 years old and want to make a decision about my future career as soon as possible so that I can start developing the necessary skills.",
        "created_utc": 1673062530,
        "upvote_ratio": 1.0
    },
    {
        "title": "Open Book Exam Hacks",
        "author": "New_Clue_2126",
        "url": "https://www.reddit.com/r/LawSchool/comments/105ekae/open_book_exam_hacks/",
        "text": "Any tips or hacks you learned for open book exams, this is my first semester with open book exams and I plan to approach them the same as closed book with memorization and tabbing, is there anything I should bring with or add to my outline to help during the exams?",
        "created_utc": 1673062253,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need thoughts on this - is it bad to say I’m a close friend of an attorney who left a firm in a cover letter?",
        "author": "randyerthanyou1",
        "url": "https://www.reddit.com/r/LawSchool/comments/105egwy/need_thoughts_on_this_is_it_bad_to_say_im_a_close/",
        "text": "I’m familiar with a firm because two friends of mine worked there as associates but they both left. Assuming it’s bad to mention, even though that’s why I’m familiar with their work?",
        "created_utc": 1673061971,
        "upvote_ratio": 1.0
    },
    {
        "title": "question",
        "author": "SongPositive6317",
        "url": "https://www.reddit.com/r/LawSchool/comments/105e1iq/question/",
        "text": "[removed]",
        "created_utc": 1673060720,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finding out I might have ADHD after first semester",
        "author": "PrincessTilly15",
        "url": "https://www.reddit.com/r/LawSchool/comments/105dn5u/finding_out_i_might_have_adhd_after_first_semester/",
        "text": "I completely chocked on my finals. I was super anxious and could not concentrate during exams. Im on academic probation. As I was talking to my therapist things started clicking. She thinks I have ADHD and now I need to get tested. Everything that I thought was normal is not and now I feel terrified for this next semester. I have to take the stupid remedial class and I just feel like a failure even though I know it really wasn’t my fault. I just needed to get this off my chest.",
        "created_utc": 1673059567,
        "upvote_ratio": 1.0
    },
    {
        "title": "I THINK, I FAIL.",
        "author": "AgcoolTorista_djk",
        "url": "https://www.reddit.com/r/LawSchool/comments/105d5gv/i_think_i_fail/",
        "text": "Should I continue Law School after failing a few subject in my first year?",
        "created_utc": 1673058160,
        "upvote_ratio": 1.0
    },
    {
        "title": "Part-time student so I don't get a rank! What does this mean for summer jobs?",
        "author": "Unlikely_Hornet9655",
        "url": "https://www.reddit.com/r/LawSchool/comments/105chux/parttime_student_so_i_dont_get_a_rank_what_does/",
        "text": "I'm a part-time student. My academic advisor emailed me today to explain that I would remain unranked until I reached 12 credits hrs. He also said that if I was ranked I would have been well in the top half. \n\nOf course I'll include my GPA on my apps but most places care more about ranks since the curve is different at every school. Any ideas how to get around this? Or has anyone else dealt with this ?",
        "created_utc": 1673056381,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grades Released--satisfied",
        "author": "Law_is_lol",
        "url": "https://www.reddit.com/r/LawSchool/comments/105bzva/grades_releasedsatisfied/",
        "text": "That's pretty much it. Met my GPA goal for first semester. 2/4 classes surprised me (both good and not-so-good), and the other 2 were exactly what I thought they'd be. At or above median was the goal, and I achieved it.",
        "created_utc": 1673055033,
        "upvote_ratio": 1.0
    },
    {
        "title": "What types of jobs would be possible for an introverted, mild person who loves routine tasks?",
        "author": "Any_Strawberry_131",
        "url": "https://www.reddit.com/r/LawSchool/comments/105bxai/what_types_of_jobs_would_be_possible_for_an/",
        "text": "I'm a 3L at a lower T-14 (current GPA 3.74) and haven't found a job yet. I plan to apply for a master program in library science after graduation but open to other options (find a job in document review, legal editing, etc.). I have some clear disadvantages as listed below. I would greatly appreciate if anyone could advise me on what types of jobs would be possible despite my disadvantages. Thank you so much!\n\nDisadvantages:\n\n* no off-campus legal experience (worked as research assistant and library aide in previous two summers). No law review. \n* physically unable to work long hours (&gt;40 hrs/week). I was seriously ill and was sent to ER several times during 1L because of physical exhaustion and lack of sleep from studying long hours. I try to avoid that in the future. \n* I'm a slow learner and slow worker. I need longer time than most of my peers to read, digest, and understand new materials. \n* I have trouble interacting with clients (and with people in general). I enrolled in two clinics before and performed terribly because I was taciturn and unable to overcome my fear of interacting with clients.\n* I'm afraid of assertive and talkative people. I was in group projects with some assertive, aggressive, and talkative classmates during 2L and was very scared and felt terrible about myself. \n* I'm introverted and lead a very retired and solitary lifestyle. I'm quiet and deferential and never want to be in a leadership/management role. \n* I love routine tasks such as formatting a document, proofreading, bluebooking, filling out forms, etc. \n\nThank you again for reading . I would appreciate any advice.",
        "created_utc": 1673054844,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L When to Apply for Summer Positions?",
        "author": "innocentlullaby",
        "url": "https://www.reddit.com/r/LawSchool/comments/105bx78/1l_when_to_apply_for_summer_positions/",
        "text": "I’ve been told to start applying now while others have told me wait closer to the end of the spring term.",
        "created_utc": 1673054838,
        "upvote_ratio": 1.0
    },
    {
        "title": "How important on 1L exams is it to cite a case/the Restatements whenever you can?",
        "author": "Desperate_Sector_810",
        "url": "https://www.reddit.com/r/LawSchool/comments/105bt3k/how_important_on_1l_exams_is_it_to_cite_a_casethe/",
        "text": "I cited a ton of cases at the end of sentences when stating rules or comparing scenarios. Are these details the difference between a B and a B+ for example? Or did I waste my time by citing too many cases.",
        "created_utc": 1673054539,
        "upvote_ratio": 1.0
    },
    {
        "title": "I saw a rainbow, a pony, and a puppy...",
        "author": "Successfulbeast2013",
        "url": "https://www.reddit.com/r/LawSchool/comments/105bduf/i_saw_a_rainbow_a_pony_and_a_puppy/",
        "text": "And I just got straight A+++'s! I have a 4.35 GPA now. How lucky am I?",
        "created_utc": 1673053389,
        "upvote_ratio": 1.0
    },
    {
        "title": "I saw a rainbow, a pony, and a puppy!",
        "author": "Successfulbeast2013",
        "url": "https://www.reddit.com/r/LawSchool/comments/105b7zg/i_saw_a_rainbow_a_pony_and_a_puppy/",
        "text": "",
        "created_utc": 1673052974,
        "upvote_ratio": 1.0
    },
    {
        "title": "Another 1L grade post: non-traditional student, second career, single mother having doubts after getting Bs and Cs.",
        "author": "dibbiluncan",
        "url": "https://www.reddit.com/r/LawSchool/comments/105ad97/another_1l_grade_post_nontraditional_student/",
        "text": "I started the semester strong. I didn’t miss class, did all the readings, briefed cases by hand. I rocked all of my cold calls and frequently raised my hand to contribute answers. In October, things went downhill. My daughter’s nanny moved to a new state. I had to switch to daycare. Cue six weeks of near-constant sickness. My car had a flat tire. Then my car battery died. Then my car was stolen on Veteran’s Day. Finally, the nail in the coffin: the week before finals, I went through a bad breakup (he left me for his female best friend and lied about it for three days) that extended into finals. He (another law student) even threatened me twice, both the day before a final. I think he did it intentionally to mess with my head. \n\nI missed enough class that I could’ve been barred from taking my finals, but since most of it was excused due to my daughter being sick and unable to attend daycare, all of my professors understood and allowed me to continue. Still, I was so behind I mostly relied on Quimbee at this point. I barely finished my outlines and did zero practice problems.\n\nI made an A- on my only graded midterm, but I did not do well on finals. The two finals I did worst on—Criminal Law: C+, and Contracts, C—were the ones where I was threatened the night before and had trouble sleeping. I guess it could be worse. I did better on my last final, a B in Property, and best in my Legal Research and Writing class, B+. My gpa is 2.6, so my full tuition scholarship isn’t at risk and I’m still in good standing. But median is 3.3, so obviously I’m not in a good place.\n\nMy student mentor says that since I did best in the writing class (I submitted my final memo before the breakup) that I likely would’ve done better if not for that event. That I can come back from it. Another of my friends graduated in the top 30% of her class after starting about where I am. She has a great job, and she passed the bar on the first attempt. \n\nBut I don’t know. I’m doubting my decision to switch careers. I feel like I will probably go ahead with this semester since I’ve already gotten my books and financial aid package, but am I wrong to consider withdrawing if my grades don’t improve? Maybe I just can’t do this as a single parent. \n\nI’m 36, and I wanted to make a better life for my daughter. It was difficult to make ends meet as a teacher, and my scholarship means I can continue without incurring massive debt (still some though). But with these grades, will I be able to get a decent job? I never planned on BigLaw, but I’d like to make more than I can as a teacher ($55k in my city). I’m thinking employment, education, or environmental law. \n\nI feel like things will be easier this semester, but who knows? Life happens, and it’s difficult for me to handle things as a single parent. I don’t have family to help with childcare. What if it’s just as hard from now on? What would you do?",
        "created_utc": 1673050782,
        "upvote_ratio": 1.0
    },
    {
        "title": "Another 1L grade post: single mom style.",
        "author": "dibbiluncan",
        "url": "https://www.reddit.com/r/LawSchool/comments/105ab4w/another_1l_grade_post_single_mom_style/",
        "text": "I started the semester strong. I didn’t miss class, did all the readings, briefed cases by hand. I rocked all of my cold calls and frequently raised my hand to contribute answers. In October, things went downhill. My daughter’s nanny moved to a new state. I had to switch to daycare. Cue six weeks of near-constant sickness. My car had a flat tire. Then my car battery died. Then my car was stolen on Veteran’s Day. Finally, the nail in the coffin: the week before finals, I went through a bad breakup (he left me for his female best friend and lied about it for three days) that extended into finals. He (another law student) even threatened me twice, both the day before a final. I think he did it intentionally to mess with my head. \n\nI missed enough class that I could’ve been barred from taking my finals, but since most of it was excused due to my daughter being sick and unable to attend daycare, all of my professors understood and allowed me to continue. Still, I was so behind I mostly relied on Quimbee at this point. I barely finished my outlines and did zero practice problems.\n\nI made an A- on my only graded midterm, but I did not do well on finals. The two finals I did worst on—Criminal Law: C+, and Contracts, C—were the ones where I was threatened the night before and had trouble sleeping. I guess it could be worse. I did better on my last final, a B in Property, and best in my Legal Research and Writing class, B+. My gpa is 2.6, so my full tuition scholarship isn’t at risk and I’m still in good standing. But median is 3.3, so obviously I’m not in a good place.\n\nMy student mentor says that since I did best in the writing class (I submitted my final memo before the breakup) that I likely would’ve done better if not for that event. That I can come back from it. Another of my friends graduated in the top 30% of her class after starting about where I am. She has a great job, and she passed the bar on the first attempt. \n\nBut I don’t know. I’m doubting my decision to switch careers. I feel like I will probably go ahead with this semester since I’ve already gotten my books and financial aid package, but am I wrong to consider withdrawing if my grades don’t improve? Maybe I just can’t do this as a single parent. \n\nI’m 36, and I wanted to make a better life for my daughter. It was difficult to make ends meet as a teacher, and my scholarship means I can continue without incurring massive debt (still some though). But with these grades, will I be able to get a decent job? I never planned on BigLaw, but I’d like to make more than I can as a teacher ($55k in my city). I’m thinking employment, education, or environmental law. \n\nI feel like things will be easier this semester, but who knows? Life happens, and it’s difficult for me to handle things as a single parent. I don’t have family to help with childcare. What if it’s just as hard from now on? What would you do?",
        "created_utc": 1673050631,
        "upvote_ratio": 1.0
    },
    {
        "title": "iPad Storage",
        "author": "ElleHail",
        "url": "https://www.reddit.com/r/LawSchool/comments/105a4yy/ipad_storage/",
        "text": "For those who have an iPad (more specifically an iPad Air) is 64GB enough storage? I’m mainly getting it for notes and school related things. If not, then I’ll most likely I’ll get the 256GB one. Please let me know your thoughts.",
        "created_utc": 1673050196,
        "upvote_ratio": 1.0
    },
    {
        "title": "Callback LCLD tips?",
        "author": "BarReview420",
        "url": "https://www.reddit.com/r/LawSchool/comments/105a49b/callback_lcld_tips/",
        "text": "Hi, \n\nI have some callbacks coming up and I have no idea how to do a good job. I don’t know any  lawyers besides my professors and have never even been in a law firm. If anyone knows of good resources, or can share their experiences about what to expect, I would really appreciate it! I really am terrible at interviewing and get super nervous. I also don’t know whether I’m repeating myself (have they read my personal statement? should I say it again)? \n\nBackground: KJD without legal work experience (just stuff like waitressing jobs in college) and am at HYSCC.",
        "created_utc": 1673050144,
        "upvote_ratio": 1.0
    },
    {
        "title": "So many “I’m done for/Am I screwed” posts….",
        "author": "BreadfruitTall7774",
        "url": "https://www.reddit.com/r/LawSchool/comments/1059mid/so_many_im_done_foram_i_screwed_posts/",
        "text": "The sheer number of people asking if they should drop out for getting median grades or one little C is insane on here. More than likely you are fine. If somehow you aren’t and you actually did bomb your courses, weigh your options and make the best choice for you. You know the next step you have to take better than random people you do not know here on Reddit. In the end, we are all going to be attorneys. More than likely you are good though, so chill out please",
        "created_utc": 1673048940,
        "upvote_ratio": 1.0
    },
    {
        "title": "SEC Scholars Program?",
        "author": "Famous-Tadpole-2255",
        "url": "https://www.reddit.com/r/LawSchool/comments/1059gao/sec_scholars_program/",
        "text": "I applied and have not yet heard back. Has anyone heard back from the SEC Scholars Program?\n\n[https://www.sec.gov/scholars-program](https://www.sec.gov/scholars-program)",
        "created_utc": 1673048506,
        "upvote_ratio": 1.0
    },
    {
        "title": "C+ at T-14: Am I Doomed?",
        "author": "butinacoolway",
        "url": "https://www.reddit.com/r/LawSchool/comments/1059fmm/c_at_t14_am_i_doomed/",
        "text": "Just got 1L grades back and got a C+.\nI'm at a lower (although I guess i don't know how rankings are being referenced nowadays) T-14. \nMy other grades are good. An A, A-, and two B+. My GPA is at the median, if a tiny bit higher. \nI'm scared because I know getting a C+ is basically unheard of in the T-14. Like, you have to bomb your exam for them to even consider it. My C+ wasn't from not understanding the material, but because I went over the word count (and panicked a bit about not knowing how to check the word count during the exam). It's totally my fault.\n\nMy question is: am I doomed? I'm not interested in big law. My plan is to go into public interest, but I know that public interest is just as competitive nowadays. Will jobs/internships look at my individual grades more than my overall GPA? Is there a way to salvage this?",
        "created_utc": 1673048461,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help please 1L fall grades and job",
        "author": "ExplorerAlive7952",
        "url": "https://www.reddit.com/r/LawSchool/comments/1059a0s/help_please_1l_fall_grades_and_job/",
        "text": "So I just got my grades back and received a 2.5 GPA. I go to a top 20 law school. I know it’s not the end of the world and there’s always improvement. But not sure what to think of it and I am devastated. Rethinking my future now. Advice on summer jobs please. Thanks appreciate it the feedback ! 😔",
        "created_utc": 1673048079,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any advice for second semester?",
        "author": "Consistent-Fee3099",
        "url": "https://www.reddit.com/r/LawSchool/comments/1058cqz/any_advice_for_second_semester/",
        "text": "I got my Fall grades already with Cs. I’m not trying to get the best grades because I’m not a traditional law student with working experience in the field. I just want to get my JD diploma and pass the Bar. I’m looking for keeping 2.5 to stay in the good-standing category. \n\nAny advice on improving my Cs for next semester? I’ve 5 new classes and 17 credits pending for Spring 2023.",
        "created_utc": 1673045853,
        "upvote_ratio": 1.0
    },
    {
        "title": "Textbooks",
        "author": "gallifreyan_overlord",
        "url": "https://www.reddit.com/r/LawSchool/comments/10587ea/textbooks/",
        "text": "Does anyone have a good source for free textbook pdfs?",
        "created_utc": 1673045495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just got my grades, now apps",
        "author": "chooseYourUsernmae",
        "url": "https://www.reddit.com/r/LawSchool/comments/10586oo/just_got_my_grades_now_apps/",
        "text": "[removed]",
        "created_utc": 1673045452,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finished 1L first semester, feeling defeated.",
        "author": "lawschool20",
        "url": "https://www.reddit.com/r/LawSchool/comments/105866g/finished_1l_first_semester_feeling_defeated/",
        "text": "I was used to having a perfect GPA all throughout undergrad, and while I knew it was unreasonable for me to expect that now, I was shocked to see that I wasn’t anywhere near a 4.0. I ended this semester with a 3.3, which I know is not downright terrible, but I was shocked to see that I didn’t get what I expected. I’m worried about summer opportunities now, and although I’m at a T20 and all, I still feel like that doesn’t really make up for what I feel is poor performance on my finals. I know I can always improve in the future, and I have no doubt I can bring it up, but I feel like all hope is lost for the summer. Just hoping to hear similar stories from people who were in the same boat who made it out okay on the other side.",
        "created_utc": 1673045417,
        "upvote_ratio": 0.5
    },
    {
        "title": "Advice on informational interviews?",
        "author": "dm7tc7dc",
        "url": "https://www.reddit.com/r/LawSchool/comments/10582ia/advice_on_informational_interviews/",
        "text": "Seriously considering law school, as I have a niche interest in a transactional practice area. To get a better idea of what I’m getting myself into, I’ve been reaching out to family/friends in hopes of getting in touch with a few lawyers. It would be amazing to hear about their experiences and day-to-day. \n\nMy family actually referred me to some family-friend, NYC-based associates/partners to reach out to. Even though I know they are likely approachable (and I had the fortunate privilege of an introduction), I’m still having trouble wording the initial ask. \n\nOther than being generally polite and considerate, is there any sort of etiquette to be aware of? For instance, how long are these types of calls typically? \n\nI know I’m probably just in my head, but any advice would be greatly appreciated!",
        "created_utc": 1673045169,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting my grades back slowly and the first one is a B. Thought I did really really well on the exam so I’m feeling pretty nervous about the last two I’m waiting on.",
        "author": "Less_Ad3670",
        "url": "https://www.reddit.com/r/LawSchool/comments/105809o/getting_my_grades_back_slowly_and_the_first_one/",
        "text": "",
        "created_utc": 1673045020,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does BL care about B- in Torts when I got straights As in all other courses?",
        "author": "CookieMonsterPlus",
        "url": "https://www.reddit.com/r/LawSchool/comments/1057egd/does_bl_care_about_b_in_torts_when_i_got/",
        "text": "[removed]",
        "created_utc": 1673043595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Maybe dumb c&amp;f question",
        "author": "Successful-Skill6651",
        "url": "https://www.reddit.com/r/LawSchool/comments/1056nty/maybe_dumb_cf_question/",
        "text": "[removed]",
        "created_utc": 1673041862,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pro Bono Hours",
        "author": "CacoethesCarpendi",
        "url": "https://www.reddit.com/r/LawSchool/comments/10564a5/pro_bono_hours/",
        "text": "Hi all - does anyone have recommendations for organizations accepting student volunteers? My school has a pro bono requirement (and I am happy to help/volunteer), but all organizations I have reached out to either haven’t gotten back to me or only take full time externs. I appreciate any leads! Thanks",
        "created_utc": 1673040583,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Can’t Stop Looking At My Grades!!!",
        "author": "jazziefey",
        "url": "https://www.reddit.com/r/LawSchool/comments/1055n1w/i_cant_stop_looking_at_my_grades/",
        "text": "I just had to share with someone! Grades came out a couple of days ago and at first I was super nervous to check them. I finally worked up the courage and was so proud of myself and the hard work I put in for this semester. After a tumultuous first year and a crazy semester I finished the term with a 3.2 gpa and my first A! This was the confidence boost I needed as I’ve been going through terrible imposter syndrome since I started law school last year and I missed most of September due to COVID and other personal ailments. Thank you for reading ❤️",
        "created_utc": 1673039450,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shoutout to everyone who's already exhausted from applying for a million summer jobs",
        "author": "NotEyesButMind",
        "url": "https://www.reddit.com/r/LawSchool/comments/1054s52/shoutout_to_everyone_whos_already_exhausted_from/",
        "text": "And classes haven't even started yet. Yay.\n\nMy school's PSRP is coming up in a couple weeks, and we had deadlines Wednesday and today. 19 bids (applications) submitted Wednesday, 9 more today. Then a million more non-PSRP job applications to submit over the next week. And then it's time for the semester to start!",
        "created_utc": 1673037423,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L SA Callback w/o Screener",
        "author": "champagnekasi",
        "url": "https://www.reddit.com/r/LawSchool/comments/1054nel/1l_sa_callback_wo_screener/",
        "text": "Applied for a 1L diversity SA in mid-December. Received a callback invite without a screener earlier this week. Is there any significance to getting a callback invite without a screener?",
        "created_utc": 1673037117,
        "upvote_ratio": 1.0
    },
    {
        "title": "paper advice?",
        "author": "rex-ipsa",
        "url": "https://www.reddit.com/r/LawSchool/comments/1054brd/paper_advice/",
        "text": "[removed]",
        "created_utc": 1673036342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I study for the LSAT",
        "author": "humanhand27288",
        "url": "https://www.reddit.com/r/LawSchool/comments/1053zhq/should_i_study_for_the_lsat/",
        "text": "I am currently a year into a job with a consulting firm, working primarily with government clients. The work is decent but I’ve always been interested in law, particularly international arbitration work. An initial thought I had is to study for the lsat for ~6 months and then apply to law schools if my scores are in the range that I want (t14). Can anyone shed light on if this is a worthwhile approach?",
        "created_utc": 1673035539,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do 1L SA/LCLD Programs actually care about resumes/a tailored cover letter",
        "author": "InternalPanicCelexa",
        "url": "https://www.reddit.com/r/LawSchool/comments/1053qqh/do_1l_salcld_programs_actually_care_about/",
        "text": "How big of a deal are these aspects, really? It seems like firms are mostly focused on grades unless your resume is absolutely stellar and perfectly suited for the job. I'm really just asking because my cover letter is generic AF, because I genuinely could not tell you the major differences between McGuire Woods and Katten. I figure the diversity statement matters for LCLD stuff, but otherwise, is it just grades to focus on?",
        "created_utc": 1673034989,
        "upvote_ratio": 1.0
    },
    {
        "title": "Performance in Law School, Grades In Particular, Does Not Really Matter",
        "author": "PalatableAnthropy",
        "url": "https://www.reddit.com/r/LawSchool/comments/1053nvy/performance_in_law_school_grades_in_particular/",
        "text": "Just a short semi-rant after seeing all the posts about people freaking out about grades...\n\nLaw school is just a hazing ritual intended to gate-keep the complete dumbasses from being attorneys and screwing up the entire system. As long as you get a JD, and subsequently pass the bar, then your grades don't really matter.\n\nThere is a drastic shortage of licensed attorneys throughout the entire country. The shortage is so great, in most places - even big cities - you can literally hang a shingle on a cardboard box and have a full client schedule within a week or two. There are old attorneys begging new grads to come work with them and take over their book. You could easily be making 6 figures year one and double it by year 2 while still having a great work-life balance. Unless you're one of those twats that want to sell your soul to big law and give up all your time to work just to make a hundred thousand more, then stop worrying.\n\nOne last note, if you are a person that is so anxious you can't function or have panic attacks thinking about your grades, then the practice of law probably isn't for you.",
        "created_utc": 1673034799,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got above median...!",
        "author": "Cromus",
        "url": "https://www.reddit.com/r/LawSchool/comments/1053mgd/i_got_above_median/",
        "text": "I really was not expecting this. My sister died in November so that entire month was missing classes, visiting family, going to the funeral, then spending Thanksgiving break and the reading period catching up on recordings and cases. I had no time or energy to take practice exams. I used old outlines and just organized them with a table of contents and highlighting. \n\nI was content with getting just B-/C+. Sorry for the humblebrag. My wife is gonna say my ego did not need this.",
        "created_utc": 1673034702,
        "upvote_ratio": 1.0
    },
    {
        "title": "5 page writing sample - too short for 1L positions?",
        "author": "beaprior",
        "url": "https://www.reddit.com/r/LawSchool/comments/10538un/5_page_writing_sample_too_short_for_1l_positions/",
        "text": "Title says it all - I reworked my open memo based on my instructor comments and it went from 7 pages to barely 6. Essentially 5.5 pages. Since I'm applying to 1L diversity positions, I presume a short sample is okay since we have so little to work with, but I'm not sure.",
        "created_utc": 1673033802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paolo Banchman-Fried: Brothers Bound by Magic and Blood",
        "author": "NoMoreVermicelli",
        "url": "https://i.redd.it/gnp7tmnn5haa1.png",
        "text": "",
        "created_utc": 1673033595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do any schools offer academic scholarships to transfers?",
        "author": "Bright-March5802",
        "url": "https://www.reddit.com/r/LawSchool/comments/10530g2/do_any_schools_offer_academic_scholarships_to/",
        "text": "Just curious if anyone has experience with this, specifically in Boston area.",
        "created_utc": 1673033243,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wills &amp; Trusts Question",
        "author": "Ordinary-Kiwi9695",
        "url": "https://www.reddit.com/r/LawSchool/comments/1052xkq/wills_trusts_question/",
        "text": "Hi, I am just about to start my wills &amp; trust class (California law) and have a few questions: \n\n(1) Is there a difference between a Pretermitted Heir and an Omitted Heir?\n\n(2) Under exception (b) below, does the decedent have to have one or more children with the same \"other parent\" or could they have multiple children with multiple people?\n\nOn one hand, I was told that omitted and pretermitted heirs are used interchangeably, but I also heard they differ.\n\nFrom my understanding, an Omitted Heir (also referred to as a Pretermitted Heir?) is a child that was born (or adopted) after the execution of a testator's will (or trust).\n\nI understand that under California law, Probate provides that omitted heirs born or adopted after a will is executed, subject to some exceptions such as:\n\n(a) the decedent's failure to provide for the child in the testamentary instruments was intentional and that intention appears from the testamentary instruments;\n\n(b) The decedent had one or more children and devised a substantial amount (or all) of his/her estate to the other parent of the omitted child;\n\n(c) The decedent provided for the child by transfer outside of the estate passing by the testamentary instrument and the intention that the transfer be in lieu of a provision in the testamentary instrument is shown by statements of the decedent or from the amount of the transfer or other evidence.\n\n&amp;#x200B;\n\n\\*Thank you so much!",
        "created_utc": 1673033060,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sending new transcripts to employers I’ve already applied to after Fall semester?",
        "author": "AyBeeTV",
        "url": "https://www.reddit.com/r/LawSchool/comments/1052cim/sending_new_transcripts_to_employers_ive_already/",
        "text": "Hello! I got a solid GPA bump this fall, coming from courses that are pretty integral to the line of work I’m looking at. I already submitted some applications during fall semester, but would like to send along my updated transcript to those employers. Is that good practice, or might it seem bothersome?",
        "created_utc": 1673031647,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who fucking takes a yacht to sea and only brings canned turnips?",
        "author": "garrettgravley",
        "url": "https://www.reddit.com/r/LawSchool/comments/1051moh/who_fucking_takes_a_yacht_to_sea_and_only_brings/",
        "text": "",
        "created_utc": 1673029967,
        "upvote_ratio": 1.0
    },
    {
        "title": "GOT STRAIGHT As AS A 3L FIRST GEN STUDENT",
        "author": "LawHer2023",
        "url": "https://www.reddit.com/r/LawSchool/comments/1051id9/got_straight_as_as_a_3l_first_gen_student/",
        "text": "First generation student who thought this semester was going to break her.. but somehow managed to pull off three As and one A(-).\n\n  \nNobody in my family or friend groups get it so I'm posting here.....\n\nAnd for 1Ls reading this, my first semester of law school I received NO As at all... hard work, asking for help, stopped beating myself up, and perseverance!",
        "created_utc": 1673029692,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for Evidence",
        "author": "Mysterious_Bank9415",
        "url": "https://www.reddit.com/r/LawSchool/comments/1051b03/tips_for_evidence/",
        "text": "Seen some people ask about Evidence and here’s what I mostly used to get an A:\n\n1) Law School Legends Audio on Evidence by Ric Simmons (OSU Law professor)\n\n2) Examples and Explanations on Evidence, and \n\n3) Federal Rules of Evidence (Treatise) on Westlaw by Paul F. Rothstein (Georgetown Law Professor). \n\nI used the assigned supplement we had a little too but never read the textbook. \n\nIf you are good at rule based classes than you’ll be good at evidence. Civ Pro and Evidence have been my highest doctrinal grades in law school.",
        "created_utc": 1673029198,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bad grade in subject area of interest",
        "author": "800813man69",
        "url": "https://www.reddit.com/r/LawSchool/comments/1051ape/bad_grade_in_subject_area_of_interest/",
        "text": "Hey all,\n\nComing into school, I really thought I wanted to do something within the environmental sphere. As a 3L, I just took the class and got a B-. It was the only exam I had this semester and I reread all the cases and really but hours into studying for the exam. It really makes me feel like I’m going to be a shitty lawyer. \n\nAnyone have any stories about getting a bad grade in a subject but then working in that area successfully after school? \n\nThanks",
        "created_utc": 1673029177,
        "upvote_ratio": 1.0
    },
    {
        "title": "3Ls: How are you feeling going into your last semester?",
        "author": "OurFrankWhoArtInLA",
        "url": "https://www.reddit.com/r/LawSchool/comments/10511cf/3ls_how_are_you_feeling_going_into_your_last/",
        "text": "",
        "created_utc": 1673028563,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stuck on proximate cause for homework regarding two independent parties and one victim",
        "author": "InformationOk6257",
        "url": "https://www.reddit.com/r/LawSchool/comments/1050nmw/stuck_on_proximate_cause_for_homework_regarding/",
        "text": "[removed]",
        "created_utc": 1673027680,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning that grades will be released 15 mins before spring classes start up",
        "author": "KookyAfternoon7780",
        "url": "https://i.redd.it/88iqvzugogaa1.jpg",
        "text": "",
        "created_utc": 1673027623,
        "upvote_ratio": 1.0
    },
    {
        "title": "2L who still has no idea what kind of law they want to practice",
        "author": "ApprehensiveStart940",
        "url": "https://www.reddit.com/r/LawSchool/comments/1050i1u/2l_who_still_has_no_idea_what_kind_of_law_they/",
        "text": "Title pretty much sums it up. I am feeling pretty lost but at the same time I am not too worried about it because I know nothing is set in stone and career paths can always change later on down the line. \n\nMy career counselor on the other hand has a way of making me feel guilty for being unsure. I try to avoid her at all costs but she emailed me today and I am not sure what to say.",
        "created_utc": 1673027309,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good undergrad minor for law school?",
        "author": "Pepperedseeds",
        "url": "https://www.reddit.com/r/LawSchool/comments/1050g87/good_undergrad_minor_for_law_school/",
        "text": "Not sure if this is the right sub for this question but I am a undergraduate student and I need to pick a minor but I’m not sure what I should pick. If anyone knows what law schools look for or if anyone has any advice that would be appreciated.",
        "created_utc": 1673027188,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do people always say “just be above the curve?”",
        "author": "movin4call",
        "url": "https://www.reddit.com/r/LawSchool/comments/10504tz/why_do_people_always_say_just_be_above_the_curve/",
        "text": "1L asking.\n\nJust got back my first semester grades. Definitely humbled because I never worked so hard in school but also wondering if I’m still in decent shape?\n\nAt a T25 school that curves to a B+ average (3.3). Historically, the top 50% of the class hovers around 3.35 or so.\n\nI finished with a 3.4 (an A, a B, and two B+’s) so right now I think I am just barely above the median? But they don’t rank until after spring, so this just an estimate.\n\nBut why do people say just be above the curve? And if so, am I in decent shape?",
        "created_utc": 1673026436,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you make sense of law school employment statistics?",
        "author": "alexandros2877",
        "url": "https://www.reddit.com/r/LawSchool/comments/104zumq/how_do_you_make_sense_of_law_school_employment/",
        "text": "I've seen enough posts begging not to talk about grades or \"am I screwed\", and instead asking students to research their school's employment statistics. I wanted to check in with you all to see what you all focus on, and what those numbers mean to you. I thought I had seen somewhere that a 95% was median, and you want higher numbers to be safe, but I'm not sure.\n\nFor reference, I'm at ASU, and from a quick search, they say that for the 2019 class, 89% of graduates found a job within 1-10 months, and the ABA disclosures for the class of 2021 had 3 unemployed and seeking, 3 unknown, 1 in graduate studies, 3 part time employed (1 long, 2 short), and the remaining 270 employed full time long term out of a class of 280.\n\nI want to work in the public sector, specifically in non-profit orgs in immigration primarily, but could be open to others. From the 2021 data, I saw there were only 4 employed in public interest; most of employment seems to have gone into firms and government (firms are constantly sponsoring events and come spring I'm sure I'll see tons of OCIs pop up).\n\nSo, bottom line, knowing the overwhelming majority are employed, but very few in my general field of interest, how do you all suggest going about putting myself in the best place? I've already started networking with some local orgs I used to volunteer at to find internships for the summer, and I'll be applying to the big one in AZ, Florence, but I'm unsure as to if I should be more focusing on standing myself out from the other firm-oriented students (and how), or keeping my grades at where I am.\n\nAgain, terribly sorry if this is an annoying post, but I appreciate any advice you all can provide!",
        "created_utc": 1673025785,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using team work product as a writing sample?",
        "author": "The_Lorax_Lawyer",
        "url": "https://www.reddit.com/r/LawSchool/comments/104zjf1/using_team_work_product_as_a_writing_sample/",
        "text": "So I’m applying for summer public interest positions and I found that one employer that is hiring in my area is also the same employer that partnered with one of my professors this past semester. As part of that partnership our class drafted hypothetical legal analysis on why the state legislature should adopt a specific environmental policy. The project itself was done in pairs and graded. \n\nCan I use this document as my writing sample? I have other written work that I usually use but since this one is specifically within the employer’s practice I feel it would be much stronger.",
        "created_utc": 1673025048,
        "upvote_ratio": 1.0
    },
    {
        "title": "Professor sent out a vague email about grades coming out *sometime* today",
        "author": "Tyquente",
        "url": "https://www.reddit.com/r/LawSchool/comments/104zafp/professor_sent_out_a_vague_email_about_grades/",
        "text": "That’s it. No extra info in the email and now my belly hurts and I’m compulsively refreshing the grade page at work.",
        "created_utc": 1673024476,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got my first A in law school (without the -)!",
        "author": "Right-Perspective-96",
        "url": "https://www.reddit.com/r/LawSchool/comments/104z5s3/got_my_first_a_in_law_school_without_the/",
        "text": "Feels good. That’s all.",
        "created_utc": 1673024196,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did good I think for this semester as a 1L.",
        "author": "Killer6977",
        "url": "https://www.reddit.com/r/LawSchool/comments/104z1iq/did_good_i_think_for_this_semester_as_a_1l/",
        "text": "I got 2 b minus grades, 1 b plus, and an A. Curves at my school are at (or around for 1L classes) b minus. Honestly didn't think I'd do this well. Not because I'm dumb, but because everyone at my school are also very smart as well. So hot damn, looks like a reason to finally kick back and relax!",
        "created_utc": 1673023912,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any PSU law students?",
        "author": "tennisplayer63",
        "url": "https://www.reddit.com/r/LawSchool/comments/104ya1c/any_psu_law_students/",
        "text": "[removed]",
        "created_utc": 1673022068,
        "upvote_ratio": 1.0
    },
    {
        "title": "Another 1L asking about grades",
        "author": "CalmSkeletonIndigo",
        "url": "https://www.reddit.com/r/LawSchool/comments/104y6ig/another_1l_asking_about_grades/",
        "text": "I feel sick. I got 3 B-‘s and 2 B’s. I don’t want to do big law. How bad is this for first semester? I feel so bad not getting any A’s.",
        "created_utc": 1673021842,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone help me understand what document an employer is asking for?",
        "author": "Fortheloveofe",
        "url": "https://www.reddit.com/r/LawSchool/comments/104y1km/can_someone_help_me_understand_what_document_an/",
        "text": "I’m applying for a 1L Diversity Associate position. The instructions ask for a 500 word “How have you demonstrated DEI” essay. However, the application only has one upload button for a “writing sample”. \n\nAre they asking for my writing sample... as in my legal writing memo, or the 500 word essay they referenced in the instructions? I understand if this is a dumb question, I just don’t want to submit the wrong document. Thanks!",
        "created_utc": 1673021514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Second day of orientation, I don’t understand anything being talked about. Should I dropout?",
        "author": "MayorofSodom",
        "url": "https://www.reddit.com/r/LawSchool/comments/104xzvr/second_day_of_orientation_i_dont_understand/",
        "text": "",
        "created_utc": 1673021405,
        "upvote_ratio": 1.0
    },
    {
        "title": "GUNS IN IL! someone want to help me understand this?",
        "author": "sinlessjade",
        "url": "https://www.ilga.gov/legislation/102/HB/10200HB5522.htm",
        "text": "",
        "created_utc": 1673020806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Typical turnaround time between callback and offer for 1L SA position?",
        "author": "southernsnow26",
        "url": "https://www.reddit.com/r/LawSchool/comments/104xa7j/typical_turnaround_time_between_callback_and/",
        "text": "Thanks!",
        "created_utc": 1673019713,
        "upvote_ratio": 1.0
    },
    {
        "title": "“High academic achievement” and “strong academic performance” and other ambiguities that make my head spin",
        "author": "DriftingGator",
        "url": "https://www.reddit.com/r/LawSchool/comments/104wyps/high_academic_achievement_and_strong_academic/",
        "text": "I know it’s because they don’t want to give an appearance of elitism and want to encourage more applicants than just top X percentage, but how am I supposed to know if I’m just wasting my time and their time if that’s all they say?\n\nThank you for coming to my TedTalk.",
        "created_utc": 1673018923,
        "upvote_ratio": 1.0
    },
    {
        "title": "Forgive me if this makes no sense, but I need help with understanding what law actually is?",
        "author": "Idefkaiawtkms",
        "url": "https://www.reddit.com/r/LawSchool/comments/104wawa/forgive_me_if_this_makes_no_sense_but_i_need_help/",
        "text": "Doing a foundation Criminology course at my uni, and for some reason there is a module on law. Kind of stuck as I've never done any of it before. So I have some questions and would appreciate any answers? \n\n1. What is actus reus? I've googled it and tried to look into it but I just cannot understand what it is and what context the phrase is used in? \n2. What is substantive criminal law and what does it have to do with actus reus? \n3. Any other bits of information about law and the basics of it you can explain that you think might be helpful? \n\nAppreciate any help, thanks",
        "created_utc": 1673017267,
        "upvote_ratio": 1.0
    },
    {
        "title": "highlighter recommendations for casebooks?",
        "author": "lilbiddylay",
        "url": "https://www.reddit.com/r/LawSchool/comments/104vyfy/highlighter_recommendations_for_casebooks/",
        "text": "hi! my torts case book for this upcoming semester has super thin paper. I already know I won't be able to use the same highlighters as last semester because it'll bleed straight through. \n\nany recs for highlighters that don't bleed through? like the paper is so thin I'm scared to even turn the pages for fear of them ripping.",
        "created_utc": 1673016397,
        "upvote_ratio": 1.0
    },
    {
        "title": "You silly, silly fools who said that I had to do the readings for Evidence.",
        "author": "mufffinnns",
        "url": "https://i.redd.it/m8t0pxqbpfaa1.jpg",
        "text": "",
        "created_utc": 1673015859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I need to provide my law school transcripts to a different university for a second bachelor's degree?",
        "author": "WriteOrDie1997",
        "url": "https://www.reddit.com/r/LawSchool/comments/104vjje/do_i_need_to_provide_my_law_school_transcripts_to/",
        "text": "I failed out of a law school and got academically dismissed, which was honestly for the best, since I've realized I wasn't passionate about the law, and the school itself was predatory, toxic,  and ranked somewhere between 100-110. I've decided to go back to school to pursue a second bachelor's degree at a  different university, and I'd rather not disclose the fact that I attended law school due to the low gpa I received during the one semester I was there. I plan on eventually pursuing a Master's, and I don't want admissions officers to think I'm not cut out for graduate courses. Will I have to disclose the grades for a BS or MS?",
        "created_utc": 1673015323,
        "upvote_ratio": 1.0
    },
    {
        "title": "I didn’t know it was possible to get a Z until I saw my Fall grades",
        "author": "legallyindenial",
        "url": "https://www.reddit.com/r/LawSchool/comments/104v790/i_didnt_know_it_was_possible_to_get_a_z_until_i/",
        "text": "",
        "created_utc": 1673014422,
        "upvote_ratio": 1.0
    },
    {
        "title": "Academic Probation after first semester 1L",
        "author": "Fosheezy2",
        "url": "https://www.reddit.com/r/LawSchool/comments/104v54g/academic_probation_after_first_semester_1l/",
        "text": "Hi all - I had a rough couple of days after receiving my grades back. My school doesn’t give out below a C- (or so I believe) and I ended up with 3 B-‘s and a C. Giving me a 2.49 GPA\n\nThe class I got received a C in, Contracts, took me most by surprise. I got a B- on the Midterm and did everything in my power to meet with the professor and improve upon my writing skills, what she was looking for, etc. I walked out of the exam feeling great so seeing a C has been especially deflating.\n\nWe start school again next week and I received an email stating that I am required to go to all dean scholar sessions , office hours, meet w the professor in charge of academic success and attend academic workshops. I personally was planning on doing this anyways but to be required to go to every single one sounds burdensome.\n\nRegardless, I really need to bounce back this semester. Is there any advice anyone has?",
        "created_utc": 1673014263,
        "upvote_ratio": 1.0
    },
    {
        "title": "Written Assignment due over Winter Break for 2L Elective Course- Is this a red flag ?",
        "author": "Big_Environment7193",
        "url": "https://www.reddit.com/r/LawSchool/comments/104uvq1/written_assignment_due_over_winter_break_for_2l/",
        "text": "I’m enrolled in an elective course for the Spring Semester, I’m really interested in the topic and it is only taught by one professor. But the professor assigned a significant amount of reading over winter break and is requiring a written assignment also due over break. Should I drop the class?",
        "created_utc": 1673013586,
        "upvote_ratio": 1.0
    },
    {
        "title": "My school releases upper level grades on a rolling basis and first year grades at one time. Waiting for these grades and not knowing when they’re going to drop is killing me. This is intentional infliction of emotional distress 🥲",
        "author": "OrphanInABatCostume",
        "url": "https://www.reddit.com/r/LawSchool/comments/104s6g6/my_school_releases_upper_level_grades_on_a/",
        "text": "",
        "created_utc": 1673005536,
        "upvote_ratio": 1.0
    },
    {
        "title": "How bad is it?",
        "author": "Foodie473",
        "url": "https://www.reddit.com/r/LawSchool/comments/104q3u7/how_bad_is_it/",
        "text": "My school curves to a 3.25 and my gpa is 2.54. I feel terrible about this! While I am sad that my dreams of big law have been crushed. I am determined to make a turn around for the rest of my law school career. I really thought I did better and I believe my struggle is the analysis and application. Any tips on how I can do better. Or words of motivation.",
        "created_utc": 1672998142,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bachelor's in Computer Science, Master's LLM in Tech, what roles would I get?",
        "author": "Dean-Pearce",
        "url": "https://www.reddit.com/r/LawSchool/comments/104pr0b/bachelors_in_computer_science_masters_llm_in_tech/",
        "text": "As the title says,\n\nI graduated in CS, but I want to **enter the Corpo world,** because I am bored of having to code everyday, and I want to get a more decision-making/managerial role in Corp.\n\nWould getting a LLM in Tech help? If yes, what roles can I find with these 2 degrees?\n\n  \nThanks.",
        "created_utc": 1672996817,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is why I don't take controversial law classes anymore.",
        "author": "HythlodaeusHuxley",
        "url": "https://youtube.com/watch?v=uU7nzwbJ-Hk&amp;si=EnSIkaIECMiOmarE",
        "text": "",
        "created_utc": 1672994676,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I on the right track?",
        "author": "consciouskeys",
        "url": "https://www.reddit.com/r/LawSchool/comments/104ob6b/am_i_on_the_right_track/",
        "text": "[removed]",
        "created_utc": 1672991342,
        "upvote_ratio": 1.0
    },
    {
        "title": "no, it is not just you, everyone is waiting on grades. yes, this is normal.",
        "author": "strawblip",
        "url": "https://www.reddit.com/r/LawSchool/comments/104n9r5/no_it_is_not_just_you_everyone_is_waiting_on/",
        "text": "there I answered 85% of the posts this week &lt;3 you’re welcome",
        "created_utc": 1672987576,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would a 3.7gpa at a school that curves to 3.25 be enough to get into the top 10%?",
        "author": "chicothecat69",
        "url": "https://www.reddit.com/r/LawSchool/comments/104n9fp/would_a_37gpa_at_a_school_that_curves_to_325_be/",
        "text": "Title",
        "created_utc": 1672987542,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grades releasing",
        "author": "Nigel_Trumpberry",
        "url": "https://www.reddit.com/r/LawSchool/comments/104myhi/grades_releasing/",
        "text": "At around 10am, today I’ll be getting my grades. To those still waiting like me… May the power of Joseph E. Glannon flow through us",
        "created_utc": 1672986482,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rant",
        "author": "aubierrockz",
        "url": "https://www.reddit.com/r/LawSchool/comments/104mvhk/rant/",
        "text": "I want to be an author. I love learning what I’m learning but I have no idea what job I want to do in the legal field and I just want to write books. Not really asking for advice I just need to throw it somewhere because I could never admit this to anyone in my real life. Thanks for listening.",
        "created_utc": 1672986198,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are section markers for the same exact Federal Acts not the same across the source?",
        "author": "ULRICHCHULTHEISS",
        "url": "https://www.reddit.com/r/LawSchool/comments/104mlj1/why_are_section_markers_for_the_same_exact/",
        "text": "I'm looking at the Securities Act of 1933. \n\nIn one online version, it says \"15 U.S. Code § 77l - Civil liabilities arising in connection with prospectuses and communications\" [https://www.law.cornell.edu/uscode/text/15/77l](https://www.law.cornell.edu/uscode/text/15/77l)\n\nIn my Statutory supplement for class, it says \"Section 12 – Civil Liabilities Arising in Connection with Prospectuses and Communications.\" It also says that in [https://www.law.cornell.edu/wex/securities\\_act\\_of\\_1933#:\\~:text=Section%2012(a)](https://www.law.cornell.edu/wex/securities_act_of_1933#:~:text=Section%2012(a))(2,about%20the%20misstatement%20or%20omission\n\n&amp;#x200B;\n\nI know I probably sound dumb, and that this is common and I know there's got to be a really obvious reason but could someone please help me lol.",
        "created_utc": 1672985282,
        "upvote_ratio": 1.0
    }
]