[
    {
        "title": "What's your burden of proof for determining if someone's flirting with you?",
        "author": "ClassicalGrey",
        "url": "https://www.reddit.com/r/LawSchool/comments/115k1t1/whats_your_burden_of_proof_for_determining_if/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/115k1t1)",
        "created_utc": 1676740279,
        "upvote_ratio": 1.0
    },
    {
        "title": "CA COVID PAY QUESTION",
        "author": "DeBosa6",
        "url": "https://www.reddit.com/r/LawSchool/comments/115juo3/ca_covid_pay_question/",
        "text": "I requested Covid pay in December of 2022 but my problem is Covid pay ended December 31st was the last day. I requested it before that but the week I was off went into the new year, so I’m expecting my full week of pay since I requested it before the deadline. But my manager says “they might decline my request or only pay me for the days that were before the 31st that I was on leave”. Which I think is wrong because the CA government website states\n“The requirement to provide 2022 COVID-19 Supplemental Paid Sick Leave will end on December 31, 2022.  If the law expires while a covered employee is taking this leave, the employee can finish taking the amount of 2022 COVID-19 Supplemental Paid Sick Leave they are entitled to receive.”\nAm I correct? Thanks",
        "created_utc": 1676739747,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is studying for a masters worth it?",
        "author": "Imaginarymoney2004",
        "url": "https://www.reddit.com/r/LawSchool/comments/115isqp/is_studying_for_a_masters_worth_it/",
        "text": "[removed]",
        "created_utc": 1676736900,
        "upvote_ratio": 1.0
    },
    {
        "title": "Judicial Internship Time Commitment",
        "author": "blckv0",
        "url": "https://www.reddit.com/r/LawSchool/comments/115fgmu/judicial_internship_time_commitment/",
        "text": "I will be interning for a judge for this summer, however during the interview, they did not specified the time commitment. They talked about how they had to stay until 9pm for a case, which they expect me to do the same. So like 8am-9pm or something. Other than that, they did provide me specific time commitment. Is this normal?? I’m 1L, and I have no idea how federal internship works.",
        "created_utc": 1676727340,
        "upvote_ratio": 1.0
    },
    {
        "title": "Outline and bar supplement giveaway!!!",
        "author": "modummalum",
        "url": "https://www.reddit.com/r/LawSchool/comments/115f9um/outline_and_bar_supplement_giveaway/",
        "text": "[removed]",
        "created_utc": 1676726745,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anybody come across an MD/JD in their school?",
        "author": "SnowboardSasquatch",
        "url": "https://www.reddit.com/r/LawSchool/comments/115ee6b/anybody_come_across_an_mdjd_in_their_school/",
        "text": "Curious about what these people are like.",
        "created_utc": 1676723807,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question: Low Level Transfer?",
        "author": "Agrippa3154",
        "url": "https://www.reddit.com/r/LawSchool/comments/115d1cw/question_low_level_transfer/",
        "text": "Hello! Currently a rising 2L at Cleveland State, finished 1L ranked in the top 1%, and have a summer BL offer lined up. However, I am considering transferring to Case Western for the following reasons:\n\n1) I want to stay in Cleveland, and CWRU is slightly more “prestigious” than Cleveland State. \n\n2) I have clerking and political ambitions, and am worried that having Cleveland State on my resume (versus CWRU) is slightly embarrassing. \n\n3) If I want to leave Cleveland someday, CWRU’s rep travels slightly better then Cleveland State. \n\nTo sum it up: is it even worth transferring if I already have BL, law review, moot court, etc. lined up at my current school? Does jumping the rankings only marginally have any long term impact? Am I being insecure over the school I am attending? \n\nThank you for all your help.",
        "created_utc": 1676718597,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you charge your laptop at a Court",
        "author": "MuffinKing369",
        "url": "https://www.reddit.com/r/LawSchool/comments/115c86t/can_you_charge_your_laptop_at_a_court/",
        "text": "Hi all, I am about to watch several court cases to write reflections on court processes. I am wondering if there is a place to charge my laptop as I wilk be there for the whole day. It might vary from place to place, but how do people (eg court script writers) charge their laptops?\n\nMany thanks",
        "created_utc": 1676715350,
        "upvote_ratio": 1.0
    },
    {
        "title": "going to join law school in some months need some advice and things are to keep in mind for a good career.",
        "author": "lauda-ka-sarkar-hai",
        "url": "https://www.reddit.com/r/LawSchool/comments/1159evb/going_to_join_law_school_in_some_months_need_some/",
        "text": "",
        "created_utc": 1676704060,
        "upvote_ratio": 1.0
    },
    {
        "title": "University of alabama law",
        "author": "anon1524738",
        "url": "https://www.reddit.com/r/LawSchool/comments/11588p6/university_of_alabama_law/",
        "text": "[removed]",
        "created_utc": 1676699631,
        "upvote_ratio": 1.0
    },
    {
        "title": "HUD Legal Honors Program Update?",
        "author": "tacakhsok",
        "url": "https://www.reddit.com/r/LawSchool/comments/1157wq9/hud_legal_honors_program_update/",
        "text": "Does anyone know if offers have been sent out for HUD's legal honors program? Thank you!",
        "created_utc": 1676698421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can my internship offer be rescinded?",
        "author": "Fearless_Jellyfish39",
        "url": "https://www.reddit.com/r/LawSchool/comments/1157ac5/can_my_internship_offer_be_rescinded/",
        "text": "I went through the process of getting an internship (which did not include submitting transcripts or grades) and received an offer that I’ve accepted.  Now I’m being asked to send in a transcript but my grades are terrible.  Can my offer be rescinded because of my grades even though there was no indication of them being part of the evaluation process?",
        "created_utc": 1676696275,
        "upvote_ratio": 1.0
    },
    {
        "title": "Visiting Student for one-year or Study Abroad for one-semester?",
        "author": "SebastianJF",
        "url": "https://www.reddit.com/r/LawSchool/comments/11570mt/visiting_student_for_oneyear_or_study_abroad_for/",
        "text": "I am currently at a T-40 school on the west coast. Before coming to law school, I didn't realize how regional my university's reach is. As such, I am considering how best to expand the opportunities available to me.\n\nDo you think there are more opportunities to be had by serving as a visiting student at a T-14 or by serving as an exchange student at a renown international legal institution?\n\nAlthough I don't know  exactly what I want to do with my life, I am very aspirational. I can see myself working my way up in politics, in an NGO, or in an IGO.\n\nAny information you have will be much appreciated.",
        "created_utc": 1676695293,
        "upvote_ratio": 0.99
    },
    {
        "title": "why does fasfa tell me I should answer questions about your parents if you are in law school?",
        "author": "icespicycoochie",
        "url": "https://www.reddit.com/r/LawSchool/comments/1156v2y/why_does_fasfa_tell_me_i_should_answer_questions/",
        "text": "",
        "created_utc": 1676694769,
        "upvote_ratio": 1.0
    },
    {
        "title": "For a 1L SA for someone wanting to work in NYC post grad with ties to NYC..",
        "author": "lapanda18",
        "url": "https://www.reddit.com/r/LawSchool/comments/1156qfk/for_a_1l_sa_for_someone_wanting_to_work_in_nyc/",
        "text": "Boston firm does have a NYC office I’d be very interested in for the long run, but no chance they’ll let me switch for the summer. Thanks!\n\n[View Poll](https://www.reddit.com/poll/1156qfk)",
        "created_utc": 1676694313,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m a fuck-up and I feel like everyone hates me now",
        "author": "maximus_1080",
        "url": "https://www.reddit.com/r/LawSchool/comments/1155a4y/im_a_fuckup_and_i_feel_like_everyone_hates_me_now/",
        "text": "I’m a complete mess of person, consistently over promise, and am really neurotic when interacting with other law students.\n\n I can’t handle how isolated I feel around them and how I feel like my entire life hangs on my interactions at law school. I have a great life outside of law school, and I’m doing okay on my current professional path. \n\nBut I come across as an incredibly weird person in law school and I think I’ve pushed people away. The legal world is so small - I feel like I’m basically fucked now.",
        "created_utc": 1676689518,
        "upvote_ratio": 1.0
    },
    {
        "title": "TITLE",
        "author": "Icy-Fig7331",
        "url": "https://i.redd.it/z7dks0jglwia1.jpg",
        "text": "",
        "created_utc": 1676689074,
        "upvote_ratio": 1.0
    },
    {
        "title": "secure transactions is wild",
        "author": "Icy-Fig7331",
        "url": "https://i.redd.it/6hn4jad5lwia1.jpg",
        "text": "",
        "created_utc": 1676688970,
        "upvote_ratio": 1.0
    },
    {
        "title": "Law question on subpoena procedures",
        "author": "Tricky_Spinach_6011",
        "url": "https://www.reddit.com/r/LawSchool/comments/11552f1/law_question_on_subpoena_procedures/",
        "text": "I am a convicted sex offender on the sex offender registry and need to get a copy of my registration records from the time I lived in Illinois. The circuit court of Cook County's probation department told me the only way to  get those records is through a subpoena from a lawyer. Can anyone help? I tried the Illinois Bar association, the public defenders office and google. Can anyone help?",
        "created_utc": 1676688811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tax LLM Chances",
        "author": "Alexsan2000",
        "url": "https://www.reddit.com/r/LawSchool/comments/115425k/tax_llm_chances/",
        "text": "Hi everyone, just wanted to get some insight regarding my chances of admission to some of the reputable tax LLM programs.\n\nI am currently a 2L at a T3 with about median grades.  I have taken the one possible tax course offered at my school, federal income tax, and received an A-.  \n\nMy passion is definitely tax. I completed an in-house tax accounting internship at a large international company prior to law school and currently intern at a top 10 tax-only accounting firm (where I have been for over a year).  The firm offers to pay my LLM in full at a lower ranked school and will pay up to a certain amount at any other school.  \n\nAlso, I was a founding member of my school’s TLS organization where I am currently the treasurer and will be president of TLS next year. I have attended multiple VITA events, and I am an executive board member at my school’s law review as well. \n\nI plan to receive a recommendation from the only tax law professor at my school and another from the managing partner at my current internship.\n\nThank you for your comments and help!",
        "created_utc": 1676685671,
        "upvote_ratio": 1.0
    },
    {
        "title": "Backing out of a 1L SA offer after accepting?",
        "author": "Mission-Dragonfly432",
        "url": "https://www.reddit.com/r/LawSchool/comments/1153m7u/backing_out_of_a_1l_sa_offer_after_accepting/",
        "text": "Hi all! This is entirely hypothetical for the time being, but I would appreciate some advice or insight anyways. \n\nI got an offer at Firm A today - mid/small sized firm, but locally respected and, most importantly, paid. Not a BL salary, but paid nonetheless. They only gave me two days to make the decision about whether or not I will accept...which seems shitty. I don't love the practice area, it is nothing I would want to work in after graduation, or even for 2L summer. \n\nI also had a callback interview Firm B today. Firm B is an AmLaw50 firm. The interview went incredibly well, and each attorney said they would love to have me there and thought I would be a great fit. I know this does not necessarily translate to an offer though, so I am not getting my hopes up. However,  I'd love to work at Firm B for the foreseeable future if I got the job.\n\nI didn't know I got the job at Firm A until after I finished my interviews at Firm B, so I did not tell them about a competing offer or deadline.\n\nSo let's say hypothetically, I get the job offer from Firm B after I have accepted the job at Firm A. Would I have any options available? I hate the idea of burning a bridge with a local firm...but I also would really want to accept the other offer. \n\nAlternatively, would it be in bad taste to email the hiring manager at Firm B explaining the situation and letting them know of my deadline regardless? I just really do not want them to think I am being impatient or trying to rush them. \n\nThank you all in advance!",
        "created_utc": 1676684345,
        "upvote_ratio": 1.0
    },
    {
        "title": "C&amp;F Question (Employment Dates)",
        "author": "Ok-Cycle9187",
        "url": "https://www.reddit.com/r/LawSchool/comments/1153lvl/cf_question_employment_dates/",
        "text": "I am sitting for the bar in July 2023 and I am a current 3L. I am currently putting everything together in preparation for my C&amp;F application and I am realizing there was an error in my employment dates.\n\nI am an older law student who graduated undergrad over 10 years ago. I am realizing that on my law school application I put that I was a Research Assistant from September 2012 to May 2013 (the entire school year). After doing some more diligence today I now realize that I was only a research assistant for one semester that year instead of two.. so from January 2013 to May 2013.\n\nI reached out to my law school and they said that employment dates are not something that are typically a big deal if its accurate on your bar exam application and said an amendment is likely not necessary but if I wanted to I can.\n\nWhat are people's thoughts on this? Do I need to do an amendment for a job during college that is off by four months? The rest of my employment dates for the 10+ years I worked are spot on.",
        "created_utc": 1676684315,
        "upvote_ratio": 1.0
    },
    {
        "title": "How often do you have lazy days?",
        "author": "movin4call",
        "url": "https://www.reddit.com/r/LawSchool/comments/11534qp/how_often_do_you_have_lazy_days/",
        "text": "Today was just one of those days.\n\nI was planning to do job search, catch up on outlines, do readings for Monday....\n\nAfter class ended today, the library was empty and motivation and drive just faded. Depressing as hell when you're the only one there.\n\nDid not get much done and relatively unproductive today.\n\nHow often do you have these kinds of days when in school? lol",
        "created_utc": 1676682872,
        "upvote_ratio": 1.0
    },
    {
        "title": "WWYD: 1L Summer",
        "author": "thrwy1111111111",
        "url": "https://www.reddit.com/r/LawSchool/comments/1151ozu/wwyd_1l_summer/",
        "text": "Disregarding pay (obviously a big caveat), which one better sets you up for success?\n\n[View Poll](https://www.reddit.com/poll/1151ozu)",
        "created_utc": 1676678719,
        "upvote_ratio": 1.0
    },
    {
        "title": "NYS Commercial Division internship",
        "author": "dtcfdm1",
        "url": "https://www.reddit.com/r/LawSchool/comments/1151lny/nys_commercial_division_internship/",
        "text": "Has anyone worked in this division before or had exposure to it? I have an interview next week. It’s state trial court level position with a judge. Would this be a good way to spend the summer? I’d appreciate some insights. Thanks!",
        "created_utc": 1676678471,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L ConLaw",
        "author": "ANerd22",
        "url": "https://i.redd.it/765bktly3uia1.jpg",
        "text": "",
        "created_utc": 1676676999,
        "upvote_ratio": 1.0
    },
    {
        "title": "need help thinking of an ig caption for barrister’s ball",
        "author": "sneepsnoop69",
        "url": "https://www.reddit.com/r/LawSchool/comments/11505kq/need_help_thinking_of_an_ig_caption_for/",
        "text": "i was thinking of something to the effect of “fuck it, we (barrister’s) ball",
        "created_utc": 1676674518,
        "upvote_ratio": 1.0
    },
    {
        "title": "WWYD? Odd situation with journals",
        "author": "Fair_Perception3504",
        "url": "https://www.reddit.com/r/LawSchool/comments/114zhny/wwyd_odd_situation_with_journals/",
        "text": "[removed]\n\n[View Poll](https://www.reddit.com/poll/114zhny)",
        "created_utc": 1676672768,
        "upvote_ratio": 1.0
    },
    {
        "title": "My happy meter at the moment I read this is:",
        "author": "jackolantern991689",
        "url": "https://www.reddit.com/r/LawSchool/comments/114z32g/my_happy_meter_at_the_moment_i_read_this_is/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/114z32g)",
        "created_utc": 1676671728,
        "upvote_ratio": 1.0
    },
    {
        "title": "Annoying classmate",
        "author": "CoolKat7890",
        "url": "https://www.reddit.com/r/LawSchool/comments/114yrx7/annoying_classmate/",
        "text": "I got an annoying classmate who always announce to us he doesn’t read or didn’t study for finals. He said he ended up doing fine last semester, even when I didn’t ask. Constantly telling others they are trying to hard…homie if you don’t care then why are you being nosy about others doing with themselves. Does anyone deal with the same thing at their school?",
        "created_utc": 1676670941,
        "upvote_ratio": 1.0
    },
    {
        "title": "CA C&amp;F App Question",
        "author": "jimmydoresgirl",
        "url": "https://www.reddit.com/r/LawSchool/comments/114yflw/ca_cf_app_question/",
        "text": "CA C&amp;F requires all old driver's license numbers. I do not have one of my old driver's licenses --it's  from over 15 years ago. I submitted a records request to the CA DMV and they stated they wipe license  number records from their system after 4 years. What am I supposed to do? Have called the CA Bar thousands of times and no one ever answers.",
        "created_utc": 1676670054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Prosecutor/ADA’s paperwork",
        "author": "Fickle-Negotiation76",
        "url": "https://www.reddit.com/r/LawSchool/comments/114xzfz/prosecutoradas_paperwork/",
        "text": "What kind of paperwork does a prosecutor have to regularly submit to their bosses etc? Reports?",
        "created_utc": 1676668898,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do people prefer to work in federal court over state court? Or vice versa",
        "author": "throwsauceaway",
        "url": "https://www.reddit.com/r/LawSchool/comments/114x3fr/why_do_people_prefer_to_work_in_federal_court/",
        "text": "I just got wind of a summer internship opportunity for my state's District Court. The person who told me of the position said the judge likes to hear from people (either in the interview or in the cover letter) about why they prefer to get experience at the federal level rather than state level. I have enjoyed all my federal law related classes the most, like Con Law and Fed Courts, but tbh I am not sure I can actually answer why other than because the opinions are usually more interesting and better written. \n\nThis is kinda last minute and I am in a bit of panic, would anyone mind giving me some pointers or insight for a response to this?",
        "created_utc": 1676666657,
        "upvote_ratio": 1.0
    },
    {
        "title": "Too much Crim Law experience?",
        "author": "michiamoGoffredo",
        "url": "https://www.reddit.com/r/LawSchool/comments/114wyx1/too_much_crim_law_experience/",
        "text": "Long story short, I am a 2L and I want to work for the govt (any level) after graduation. I do not know exactly what field I want to go to though.\n\nLast summer, I did a general counsel internship at the local level and loved it. This school year I’ve been in a crim law clinic. I also accepted a Fed PD internship for this summer. I got offered a local level PD internship and a fed agency internship for the fall or spring. So hypothetically, I could do both (one each semester).  \n\nIn terms of my long-term career goals, I am starting to heavily lean more transactional govt. work than crim law/defense. I just find the work more interesting and I do not think the PD work life balance is doable for me. \n\nIf I do not think that I want to do crim law as a career, then would it be silly to accept the local PD internship for the fall? Should I look for another one in a field I can see myself doing forever? Or is any (govt) experience good experience?",
        "created_utc": 1676666343,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any other Canadians on this Sub out of curiosity?",
        "author": "Plenty-Ad3939",
        "url": "https://www.reddit.com/r/LawSchool/comments/114w779/are_there_any_other_canadians_on_this_sub_out_of/",
        "text": "There aren’t a lot of law school advice subreddits for Canadians and I wanted to see if there any Canadians here.",
        "created_utc": 1676664387,
        "upvote_ratio": 1.0
    },
    {
        "title": "NYU Law Revue New Music Video - Cold Call Me Maybe!",
        "author": "NYULawRevue",
        "url": "https://www.reddit.com/r/LawSchool/comments/114vo93/nyu_law_revue_new_music_video_cold_call_me_maybe/",
        "text": "**TLDR:** NYU Law Revue's newest music video, \"Cold Call Me Maybe\" is now on youtube! Find it [here](https://www.youtube.com/watch?v=kCH9GCuSvqs)!\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nNYULaw Revuepheus is sitting in one of those new chairs they added in the second floor hallway, leather jacket and dark sunglasses a bright contrast against the ebullient yellow of Vanderbilt Hall. He leans back, staring Neo down.\n\n\"Unfortunately, no one can be told what 3L is. You have to see it for yourself.\"\n\nHe hands Neo this url from NYU Law Revue: [https://www.youtube.com/watch?v=kCH9GCuSvqs](https://www.youtube.com/watch?v=kCH9GCuSvqs)\n\n\"This is your last chance. There's no turning back.\"\n\nHe holds out his left hand. \"You take the blue pill... the story ends. You wake up and keep trying to get rec letters. A Supreme Court clerkship. A US Attorney position. You believe whatever you want to believe.\"\n\nHe holds out his right hand. \"You take the red pill, become content with returning to your 2L position, stay in the back of the classroom doing Solitaire, and I show you how deep your apathy can get.\"\n\n\"What if I'm a public interest student?\" asks Neo.\n\nRevuepheus pauses for a second, taking a deep breath in. He takes off his sunglasses, a single tear running down his left cheek as he leans forward, grasping Neo's hand gently in his own. \"Then I am so, so sorry.\" They both cry, together.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nWant to see more Law Revue? Check out our last video, \"[Before He Speaks](https://www.youtube.com/watch?v=6a2VX2axYgg&amp;t=1s)\"!",
        "created_utc": 1676663086,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just got my first offer :) now what?",
        "author": "Sick__Fish",
        "url": "https://www.reddit.com/r/LawSchool/comments/114vfbh/just_got_my_first_offer_now_what/",
        "text": "Now that I know I'll be going to law school this September, what can I do in the meantime? I'm currently working, but I was thinking of doing some reading ahead of time as well. I live in Canada if that matters. Any advice would be appreciated!",
        "created_utc": 1676662447,
        "upvote_ratio": 1.0
    },
    {
        "title": "If I were to apply for a Judicial externship or Fed internship, around when do they drug test?",
        "author": "Dangerous-Art-2915",
        "url": "https://www.reddit.com/r/LawSchool/comments/114ve59/if_i_were_to_apply_for_a_judicial_externship_or/",
        "text": "[removed]",
        "created_utc": 1676662366,
        "upvote_ratio": 1.0
    },
    {
        "title": "Those that have completed a summer internship at the district attorney's office of the Bronx, what was your experience like?",
        "author": "jabz4u",
        "url": "https://www.reddit.com/r/LawSchool/comments/114urdf/those_that_have_completed_a_summer_internship_at/",
        "text": "",
        "created_utc": 1676660734,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I have to accept an admissions offer before the deadline?",
        "author": "BBBNNNLLL",
        "url": "https://www.reddit.com/r/LawSchool/comments/114u7hz/do_i_have_to_accept_an_admissions_offer_before/",
        "text": "So my parents are telling me that I have to accept a law school admissions offer as soon as possible so I don't get booted out of my seat before the deadline. I wanted to wait until April at the latest to see if any other law schools take me. Once you're accepted, it isn't first come first serve right? Anyone can accept up to that deadline and be fine? They're pushing me super hard on this and I seriously want to wait which is annoying the shit out of me.",
        "created_utc": 1676659350,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Circus that is Law Review Articles Selection",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1676658639,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reneging an acceptance?",
        "author": "bussalosauce",
        "url": "https://www.reddit.com/r/LawSchool/comments/114to90/reneging_an_acceptance/",
        "text": "I just got an offer for a fellowship and they are asking for an answer in the next two days. But I just did an interview with a company as in house that I REALLY want and it went very well and it’s likely they could offer the position to me. I am a 2L and I won’t be staying in the city that I’m in. Would it be bad if I accept this fellowship (that’s paid with a stipend) and then renege that acceptance if I get an offer elsewhere??",
        "created_utc": 1676657997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Write my cover letters!",
        "author": "Sl0shua",
        "url": "https://abovethelaw.com/2023/02/chatgpt-is-scarily-good-at-answering-legal-questions/",
        "text": "Chatgpt is scarily good at answering legal questions",
        "created_utc": 1676656785,
        "upvote_ratio": 1.0
    },
    {
        "title": "It says it all.",
        "author": "coffeeadaydoctoraway",
        "url": "https://v.redd.it/0wimx5gafsia1",
        "text": "",
        "created_utc": 1676656586,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are legal issues or equitable issues decided first?",
        "author": "SK8TINGBLIND",
        "url": "https://www.reddit.com/r/LawSchool/comments/114sk7r/are_legal_issues_or_equitable_issues_decided_first/",
        "text": "I know that legal issues are decided by the jury, and that equitable issues are decided by a judge.\n\nBut which is decided first. Equitable issues are decided first then the jury decides the remaining legal issues?",
        "created_utc": 1676655215,
        "upvote_ratio": 1.0
    },
    {
        "title": "International criminal background checks in Character and Fitness investigations",
        "author": "Lonely-River-8728",
        "url": "https://www.reddit.com/r/LawSchool/comments/114savq/international_criminal_background_checks_in/",
        "text": "I'm seeking more detailed insights into how C&amp;F investigations are conducted as part of the lawyer bar admission process. Specifically, I'm curious about the extent to which criminal background checks include records from **foreign** countries.\n\nIf foreign records are included, can someone explain how the international background check process works? Are foreign governments or law enforcement agencies involved, or do FBI/private U.S. companies have access to such records?\n\nI'm particularly curious about the logistics of conducting a C&amp;F investigation that requires applicants to list all the places they've lived or worked in the past X years. Given that this could involve a significant number of locations, does the investigating agency typically research every single one, or do they focus on certain areas or types of locations? That sounds resource-intensive and expensive.\n\nI'm interested in any information anyone may have about how these investigations are conducted; any resources would be appreciated.",
        "created_utc": 1676654560,
        "upvote_ratio": 1.0
    },
    {
        "title": "j'ai besoin un quelq'un connais bien les loi santé et sécurité au travail",
        "author": "Icy-Purchase4927",
        "url": "https://www.reddit.com/r/LawSchool/comments/114s0jh/jai_besoin_un_quelqun_connais_bien_les_loi_santé/",
        "text": "",
        "created_utc": 1676653835,
        "upvote_ratio": 1.0
    },
    {
        "title": "Messaging Random Linkedin Attorneys who Connect?",
        "author": "31November",
        "url": "https://www.reddit.com/r/LawSchool/comments/114r8pf/messaging_random_linkedin_attorneys_who_connect/",
        "text": "Hi all,\n\nI'm a 2L in my 4th semester. I've started getting a ton of partners at our region's small or mid-sized firms (from 5–10ish attorneys to 50ish attorneys) adding me randomly on LinkedIn. I get the feeling that it's about the time that firms looking to hire new associates would start looking at who the next batch of students are for 3L year recruiting, so I get why they're doing it. I just am curious about if I'm missing some sort of social or business norm by not messaging these attorneys, and if so, what I should be messaging them.\n\nMy question is: Should I be messaging them or something? Or am I just overthinking this.",
        "created_utc": 1676652039,
        "upvote_ratio": 1.0
    },
    {
        "title": "you might be entitled to compensation",
        "author": "joshhirsxh",
        "url": "https://i.redd.it/24emmrsbysia1.jpg",
        "text": "",
        "created_utc": 1676651842,
        "upvote_ratio": 1.0
    },
    {
        "title": "Students with accommodations for separate testing area: does your school allow you to test in individual rooms, or in a room with other students with accommodations?",
        "author": "heerewegoagain",
        "url": "https://www.reddit.com/r/LawSchool/comments/114qot1/students_with_accommodations_for_separate_testing/",
        "text": "My school just changed policy for students who need reduced distraction spaces for testing, moving from the previous model of individual testing rooms to now accommodated students testing in a room together. The school stated that they consulted with other law schools who are also moving to that model. What does your school do? Doesn't making students with accommodations test together unnecessarily breach anonymity?\n\n[View Poll](https://www.reddit.com/poll/114qot1)",
        "created_utc": 1676650930,
        "upvote_ratio": 1.0
    },
    {
        "title": "What have you done to make law school more bearable or a \"happier\" existence?",
        "author": "movin4call",
        "url": "https://www.reddit.com/r/LawSchool/comments/114qcps/what_have_you_done_to_make_law_school_more/",
        "text": "They say law school can be an incredibly miserable experience so I do my best to keep things optimistic.\n\nOne thing I've adopted that I've got advice from others is \"Never talk about grades. Ever.\"\n\nI have a study group and some friends but I know absolutely nothing about their grades. I have a rough idea how some of them did based on the jobs they got for the summer but other than that, I keep a tight lid over what I got and never ask what they got for grades.\n\nIt's made me happier overall because now I'm not comparing myself with peers. I just focus on getting the best grades I can get.\n\nWhat have you done to make this law school experience more tolerable?",
        "created_utc": 1676650365,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible for part time law students to get big law jobs?",
        "author": "jonenderjr",
        "url": "https://www.reddit.com/r/LawSchool/comments/114o0g6/is_it_possible_for_part_time_law_students_to_get/",
        "text": "I have to go to school part time, but my goal is big law. I have to do part time because I have a family and a current career that I’m leaving for law. I could be wrong about this but I hear that part time students kind of get treated like stepchildren. Do they get passed over by big firms, or miss out on opportunities that full time students get?",
        "created_utc": 1676647077,
        "upvote_ratio": 1.0
    },
    {
        "title": "Outline and bar material giveaway",
        "author": "modummalum",
        "url": "https://www.reddit.com/r/LawSchool/comments/114m9nb/outline_and_bar_material_giveaway/",
        "text": "[removed]",
        "created_utc": 1676644618,
        "upvote_ratio": 1.0
    },
    {
        "title": "why does fasfa tell me I should answer questions about your parents if you are a law school?",
        "author": "icespicycoochie",
        "url": "https://www.reddit.com/r/LawSchool/comments/114kv9n/why_does_fasfa_tell_me_i_should_answer_questions/",
        "text": "",
        "created_utc": 1676642188,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I Cancel job interview I KNOW I’m unqualified for??",
        "author": "Unhappy-Ad-1747",
        "url": "https://www.reddit.com/r/LawSchool/comments/114khrq/should_i_cancel_job_interview_i_know_im/",
        "text": "I applied for a felony trial division job for a local government agency. I surprisingly got an a interview and am considering cancelling it because I feel incredibly unqualified. \n\nI graduated law school this last May and am recently licensed. I’ve never done a trial in my life. I was not in mock trial/moot court. I’m actually a pretty shy person. \n\nThe most I did was intern at that very agency’s felony trial division for a few months. I have no idea why they are even considering me to handle felony cases fresh out of law school. Btw they do not have misdemeanor divisions here. \n\nAny advice?",
        "created_utc": 1676641070,
        "upvote_ratio": 1.0
    },
    {
        "title": "Job interview",
        "author": "PlatformSad8010",
        "url": "https://www.reddit.com/r/LawSchool/comments/114ieui/job_interview/",
        "text": "So I have a job interview tomorrow for an entry level lawyer position. I’ve been unemployed for the last 2 years and it’s been 3 years since I graduated from law school. I don’t really remember much of what I learned in law school and I haven’t been keeping up with legal developments during my unemployment. What questions should I be prepared to answer during the interview? Thanks!",
        "created_utc": 1676634202,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I find the passing score?",
        "author": "Kobaroni",
        "url": "https://www.reddit.com/r/LawSchool/comments/114d54j/where_can_i_find_the_passing_score/",
        "text": "I should know this…. But I was just looking at all the states passing bar requirements and see conflicting info. \n\nI see some sites say I need a 274 and others say i need a 270. Specifically for Oregon. \n\nIs there a trusted source that has the passing score for each state?",
        "created_utc": 1676617163,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fun job or serious job before law school? Details below",
        "author": "LothricKnight753",
        "url": "https://www.reddit.com/r/LawSchool/comments/114cqw3/fun_job_or_serious_job_before_law_school_details/",
        "text": "I got accepted to UNM law for the fall and plan to move to ABQ next month. I am going to have some time to kill before Law School starts and plan on just working and learning the city. I got accepted for a job as a TSA agent, but am wondering if I should just take a waiter or store clerk job to not be in a stressful position before I go into a stressful schooling. For those that have experience in Law School, which would you choose?\n\n[View Poll](https://www.reddit.com/poll/114cqw3)",
        "created_utc": 1676615658,
        "upvote_ratio": 1.0
    },
    {
        "title": "Most unhinged thing another attorney has said to you?",
        "author": "TheLittlestRed",
        "url": "https://www.reddit.com/r/LawSchool/comments/114bvnk/most_unhinged_thing_another_attorney_has_said_to/",
        "text": "Here's mine. Me, my supervisor, and opposing counsel were in judge's chambers waiting to reschedule. Opposing counsel also happened to be married to the judge's clerk. My supervisor's upcoming wedding was brought up in small talk, and this attorney went, \"Don't ever get married. You'll end up like me and want to kill yourself. I'd get a cop to do it but the DA would probably give him a medal\" I was speechless.",
        "created_utc": 1676612505,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would you rank top legal markets by competitiveness?",
        "author": "calumondo",
        "url": "https://www.reddit.com/r/LawSchool/comments/114bijz/how_would_you_rank_top_legal_markets_by/",
        "text": "Inspired by a similar post on Biglaw markets. Using the same cities as the previous post for simplicity.\n\n1. New York\n\n2. Washington D.C.\n\n3. Chicago\n\n4. Los Angeles\n\n5. Boston\n\n6. San Francisco\n\n7. Atlanta\n\n8. Philadelphia\n\n9. Houston\n\n10. Dallas\n\n11. Miami\n\nHow would you rank these cities in terms of competitiveness for obtaining full time employment as a lawyer?",
        "created_utc": 1676611223,
        "upvote_ratio": 1.0
    },
    {
        "title": "Section 3 Hindu Marriage Act 1955- Definitions",
        "author": "myvkeel",
        "url": "https://i.redd.it/e9gq4bi7noia1.jpg",
        "text": "[removed]",
        "created_utc": 1676610808,
        "upvote_ratio": 1.0
    },
    {
        "title": "about what method of questioning, answering, that seeks to develop in you the ability to analyze vast complex of facts were mentioned in ''Paper chase'' movie?",
        "author": "Killuminati696",
        "url": "https://www.reddit.com/r/LawSchool/comments/114au5t/about_what_method_of_questioning_answering_that/",
        "text": "Some information about this method",
        "created_utc": 1676608983,
        "upvote_ratio": 0.99
    },
    {
        "title": "Questions for those who graduated from law school but chose to take a J.D. advantage or non-legal job:",
        "author": "discussionoise",
        "url": "https://www.reddit.com/r/LawSchool/comments/114aju9/questions_for_those_who_graduated_from_law_school/",
        "text": "What was the reasoning behind your decision to not/no longer be an attorney? Do you regret it? For those who chose not to take the bar or failed and chose not to retake it: Why did you make that choice?\n\nThank you to anyone who responds.",
        "created_utc": 1676608010,
        "upvote_ratio": 1.0
    },
    {
        "title": "A question for those who (1) graduated from law school, (2) passed or failed but chose not to retake the bar, and (3) currently have a J.D. advantage or non-legal job:",
        "author": "discussionoise",
        "url": "https://www.reddit.com/r/LawSchool/comments/114adln/a_question_for_those_who_1_graduated_from_law/",
        "text": "What was the reasoning behind your decision to not become/no longer be an attorney, and do you regret it?\n\nThank you to anyone who responds.",
        "created_utc": 1676607442,
        "upvote_ratio": 1.0
    },
    {
        "title": "Summer job suggestion",
        "author": "Artistic_bat_",
        "url": "https://www.reddit.com/r/LawSchool/comments/1149ws3/summer_job_suggestion/",
        "text": "I’ve applied to almost 50 summer jobs, ranging from firms to government jobs and have been denied from almost every one. I’m right below median so I knew it would be hard to find a job, but I’ve been working so hard with no leads. There are dozens of people interviewing for every position and I’ve run out of jobs to apply to. I’ve looked on my schools job board, LinkedIn, google, etc. and I am feeling hopeless because I don’t know where else to turn. I check everyday for new jobs but can’t find any (of course I will keep looking though). Does anyone have any suggestions on where to turn? Or jobs that you wouldn’t ordinarily think of applying for? I go to a T40 school and I’m a 1L and I’m willing to do just about anything that will pay me (I literally can’t afford food if I don’t get paid so unpaid is not an option). Any suggestions will be greatly appreciated! I’m starting to panic",
        "created_utc": 1676605911,
        "upvote_ratio": 1.0
    },
    {
        "title": "Notarial Deed of Servitude supporting documents",
        "author": "SquareTemporary3433",
        "url": "https://www.reddit.com/r/LawSchool/comments/1149mqc/notarial_deed_of_servitude_supporting_documents/",
        "text": "TL;DR: Which documents (e.g Powers of Attorney) should accompany a Notarial Deed of Seevitude in order for it to be registered by a deeds office?\n\nDETAILED QUESTION:\n\nI need help tackling a hypothetical case in which a Trust is seeking a servitude over the adjacent property which belongs to a company. The company is willing to have a servitude registered in favour of the trust.\n\nMy question is, as a Notary responsible for lodging the servitude and relevant supporting documents with the Deeds Registration office, which documents should accompany the Notarial Deed of Servitude?\n\nThe documents I can think of are the Resolutions by the company and trust showing willingness to have the Servitude registered and the Special Powers of Attorney for their representatives. I'm thinking there are others but don't know what they might be. For instance does the Notary have to lodge the title deeds for the dominant and servient tenements as well?\n\nProcedures relevant to any country are welcome; I just need a general idea, I couldn't find answers in my country or any other actually. Our lecturer needs is to do the heavy lifting.",
        "created_utc": 1676604994,
        "upvote_ratio": 1.0
    },
    {
        "title": "Property Question",
        "author": "raspberrysparkles11",
        "url": "https://www.reddit.com/r/LawSchool/comments/1149h01/property_question/",
        "text": "So the grant is different from the will. I know that for a will you need the grantor dead first before going to the present poss or future interest holders but for a grant how do you differentiate or must the grantor be dead for this also?",
        "created_utc": 1676604500,
        "upvote_ratio": 1.0
    },
    {
        "title": "Property Question",
        "author": "raspberrysparkles11",
        "url": "https://www.reddit.com/r/LawSchool/comments/1149gu1/property_question/",
        "text": "So the grant is different from the will. I know that for a will you need the grantor dead first before going to the present poss or future interest holders but for a grant how do you differentiate or must the grantor be dead for this also?",
        "created_utc": 1676604485,
        "upvote_ratio": 1.0
    },
    {
        "title": "My text book is confusing me about fee simple can someone explain this please?",
        "author": "Plenty-Ad3939",
        "url": "https://www.reddit.com/r/LawSchool/comments/11495v3/my_text_book_is_confusing_me_about_fee_simple_can/",
        "text": "So my textbook is saying that if you give something in fee simple, you have nothing left to give. \n\nBut what if I have this scenario. Say I grant my house in fee simple to my friend but my business in fee simple to my wife. Would this not be possible? \n\nThank you!",
        "created_utc": 1676603533,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pros/Cons of GSU Law",
        "author": "AuthorHistorical424",
        "url": "https://www.reddit.com/r/LawSchool/comments/1147j6m/proscons_of_gsu_law/",
        "text": "Hey folks. GSU is my top choice for law school right now. I'm taking the LSAT in April and feeling good about it. Wondering if any current students have some considerations or general advice to give me. Would love to hear any and all thoughts. I also have a dog that I'd be bringing with me. Naturally, I'm a bit nervous about that part. Any thoughts would be much appreciated! Thanks",
        "created_utc": 1676598664,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are the thousand-dollar LSAT prep courses worth it?",
        "author": "KittyLord0824",
        "url": "https://www.reddit.com/r/LawSchool/comments/11477kr/are_the_thousanddollar_lsat_prep_courses_worth_it/",
        "text": "I'm in Ontario, if that makes a difference. I'm considering law school but I'm worried I won't score well on the LSAT. An articling student I spoke to recently said he did the LSAT without any expensive prep courses, then took it again after taking some prep courses and only scored a point or two higher. I figure the expensive prep courses must exist for a reason, though, right?\n\nSo would you say it was/would be worth it to take those courses?",
        "created_utc": 1676597706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being a lawyer is such a scam",
        "author": "extraordinary456",
        "url": "https://www.reddit.com/r/LawSchool/comments/1146yy6/being_a_lawyer_is_such_a_scam/",
        "text": "There are so many ways where you could make 70k without having to spend your whole day actually, actively working.",
        "created_utc": 1676596998,
        "upvote_ratio": 1.0
    },
    {
        "title": "Upvote this if casebook connect made you bomb a cold call today",
        "author": "4phn",
        "url": "https://www.reddit.com/r/LawSchool/comments/1146gdc/upvote_this_if_casebook_connect_made_you_bomb_a/",
        "text": "",
        "created_utc": 1676595515,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does it matter what I do for 1L Summer?",
        "author": "Cold-coffee-57",
        "url": "https://www.reddit.com/r/LawSchool/comments/1146dw8/does_it_matter_what_i_do_for_1l_summer/",
        "text": "Have an offer with a DA, there's a firm deadline for the offer. Don't really want to work as a DA or in criminal law, but it's an offer and I'm sure I'd get tons of writing and research experience working with a lot of attorneys. \n\nWhen looking forward to 2L summer, would any real weight be placed in the area of law compared to the experience?",
        "created_utc": 1676595310,
        "upvote_ratio": 1.0
    },
    {
        "title": "how competitive is bay area big law?",
        "author": "SmoothDesigner6066",
        "url": "https://www.reddit.com/r/LawSchool/comments/1146ajc/how_competitive_is_bay_area_big_law/",
        "text": "what type of grades would I need from a t6? ties to the state",
        "created_utc": 1676595037,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this grant even valid (property law textbook exercise)",
        "author": "Plenty-Ad3939",
        "url": "https://www.reddit.com/r/LawSchool/comments/1145q07/is_this_grant_even_valid_property_law_textbook/",
        "text": "“X grants to A for her natural life. One month later X grants to B and his heirs”. \n\nAssuming they’re talking about the same property that was given to A this doesn’t look valid to me because what if A doesn’t die before the end of the month? How can you grant the property to B in fee simple?",
        "created_utc": 1676593391,
        "upvote_ratio": 1.0
    },
    {
        "title": "How bad is it really for a 3L to accept a job offer, then cancel to take another?",
        "author": "LordRevan5Ever",
        "url": "https://www.reddit.com/r/LawSchool/comments/11453dv/how_bad_is_it_really_for_a_3l_to_accept_a_job/",
        "text": "My law school would have you believe that it’s an immediate death penalty, but if I’m leaving bc I already have another job offer… is it really the end of the world?",
        "created_utc": 1676591702,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would you rank the top Biglaw markets by competitiveness?",
        "author": "kstew4eva",
        "url": "https://www.reddit.com/r/LawSchool/comments/1144zz8/how_would_you_rank_the_top_biglaw_markets_by/",
        "text": "The cities with the most Biglaw attorneys are:\n\n1. New York\n\n2. Washington D.C.\n\n3. Chicago\n\n4. Los Angeles\n\n5. Boston\n\n6. San Francisco\n\n7. Atlanta\n\n8. Philadelphia\n\n9. Houston\n\n10. Dallas\n\n11. Miami\n\nHow would you rank these cities in terms of competitiveness for obtaining a BL job?",
        "created_utc": 1676591442,
        "upvote_ratio": 1.0
    },
    {
        "title": "a classmate told me that i only did well on an exam because of my accommodation…?",
        "author": "Ok_Profile_2574",
        "url": "https://www.reddit.com/r/LawSchool/comments/1144kn0/a_classmate_told_me_that_i_only_did_well_on_an/",
        "text": "some context: i was diagnosed with ADHD two years ago when i was 21 despite struggling with symptoms all of my life. in all the time before i was diagnosed, i often overcompensated for my symptoms to do well academically (which made my physical and mental health suffer) while having no accommodations in high school or undergrad\n\nmy testing accommodation is just that i get to sit in a room with less people while i take exams (due to the fact that i get very distracted when taking exams in rooms with a lot of people). due to scheduling issues, i sometimes take it at a different time than the rest of the class (which is completely out of my control- my school’s disability office schedules everything and tries their best to make it at the same time that the rest of the class takes it).\n\nbut basically someone in my class noticed i wasn’t in the room during the exam and asked me about it then asked if i did well. when i told them, they responded “well, of course you did well because you have accommodations. i’m sure anyone would get an A with those.” i kinda froze in that moment and didn’t stand up for myself, but i wish i did. i already have raging imposter syndrome despite working and studying just as hard as other people, so this didn’t help\n\nwondering if anyone else has experienced something like this and how they handled it bc it was honestly so disheartening to hear that. law school is hard enough already, don’t get why people have to be so mean to each other",
        "created_utc": 1676590315,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L Constitution Law Tutor Wanted!!! Urgent!!!",
        "author": "GooseSharkBear",
        "url": "https://www.reddit.com/r/LawSchool/comments/1143lcm/1l_constitution_law_tutor_wanted_urgent/",
        "text": "[removed]",
        "created_utc": 1676587803,
        "upvote_ratio": 1.0
    },
    {
        "title": "Legal AI startup looking for beta testers or something",
        "author": "another-like-this",
        "url": "https://www.reddit.com/r/LawSchool/comments/11424gq/legal_ai_startup_looking_for_beta_testers_or/",
        "text": "From a founder community I'm part of:\n\nA startup called Legalese is looking for early career law professionals to give feedback on their AI-for-law prototype and potentially join up. This was their intro:\n\n\"Please refer brilliant early career law folks that are hating the grind and want to make it better for future lawyers\"\n\nI think they're working on something like Github Copilot for legal writing or document review. Email them at [info@legalese.app](mailto:info@legalese.app)",
        "created_utc": 1676584122,
        "upvote_ratio": 1.0
    },
    {
        "title": "help",
        "author": "future-milf-janne",
        "url": "https://www.reddit.com/r/LawSchool/comments/11422gu/help/",
        "text": "Okay so im currently a student and i wann prepare my self for the future , univerity ect  and i wanna study law. What are in your opinion the best books shows or litrally any advice you can give or recomend me?",
        "created_utc": 1676583982,
        "upvote_ratio": 1.0
    },
    {
        "title": "HOW am I supposed to finance post-grad life until I start work?",
        "author": "Fun-Interview-8403",
        "url": "https://www.reddit.com/r/LawSchool/comments/1140q0k/how_am_i_supposed_to_finance_postgrad_life_until/",
        "text": "Between graduating, studying for the bar, sitting for the bar, and moving states to start a new job, I have no idea how I am going to afford everything. Like... how am I supposed to afford moving costs, apartment deposits, and the first few months of rent? On top of the routine bills I already have? Not to mention financing the time between sitting for the bar and the actual start date for my job. \n\nI am truly baffled. I keep hearing classmates talking about extravagant bar trips and I just don't understand how they are affording all this. \n\nHow do people survive the financial burden of the bar and all the expenses that just pile up? What am I missing? How are ya'll doing this?",
        "created_utc": 1676580621,
        "upvote_ratio": 1.0
    },
    {
        "title": "Constant SA rejections are undermining my confidence",
        "author": "No-Addendum-9645",
        "url": "https://www.reddit.com/r/LawSchool/comments/11408hx/constant_sa_rejections_are_undermining_my/",
        "text": "I need to vent a little bit. I am a 1L at a T14, and I ended first semester just under a 4.0. I thought I would be able to bag at least one 1L SA offer, but I am getting nothing but rejections.\n\nHonestly, it’s beginning to undermine my confidence and affect my studies. I know the positions are competitive, but like, come on. My GPA probably puts me in the top 10%? Top 5%? Every rejection email talks about how many “qualified applicants” applied for the job, but given the numer of apps I put out, I’m really beginning to think that something is wrong with me. And seeing all of the irritating Linkedin posts from others in my class who landed these same positions is really not helping.\n\nIt would be one thing if I understood why things have gone so bad. At least if I knew , I could take steps to correct it, but nothing comes to mind. Every interview seems to go great, and there are no glaring errors in my apps or anything. Anyone else in the same boat? I really do not know what to do at this point.",
        "created_utc": 1676579380,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rant: Just had my first experience with an asshole attorney",
        "author": "douchemagoosh101",
        "url": "https://www.reddit.com/r/LawSchool/comments/113zub8/rant_just_had_my_first_experience_with_an_asshole/",
        "text": "(Using an old throwaway account) \n\nI just started clerking at the public defender’s office in district court. My boss asked me to talk to a victim in a careless driving case that was going to trial. The victim’s personal injury attorney was there and got in my face, loudly telling me to go read the police report yada yada, telling his client not to talk to me.\n\nI’m so pissed at myself for not clapping back saying you actually aren’t the attorney in this case, it’s the prosecutor and we have a right to speak to the victim who is about to testify. \n\nDefinitely a learning experience but just needed to rant. Hope he feels good bullying a law student, fucking prick. \n\nAnyone else have similar experiences/good advice on what to say in these situations?",
        "created_utc": 1676578343,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Supplements for 1) International Human Rights and 2) Income Tax?",
        "author": "LovingLifeToday88",
        "url": "https://www.reddit.com/r/LawSchool/comments/113zgl5/best_supplements_for_1_international_human_rights/",
        "text": "That's all, folks! Thank you!",
        "created_utc": 1676577368,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fingerprint Question - Reason Fingerprinted",
        "author": "fatheryeet",
        "url": "https://www.reddit.com/r/LawSchool/comments/113zdg5/fingerprint_question_reason_fingerprinted/",
        "text": " So I'm taking the bar in Texas, I'm an out of state student though so I'm submitting a paper fingerprint card. I got the fingerprints taken but on the card there's a space for \"reason fingerprinted.\" Does anybody know if there's anything in particular I need to write there or do I just put \"Bar Exam\"?",
        "created_utc": 1676577132,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got bad grades 1L fall. How do I get a summer job?",
        "author": "collective98",
        "url": "https://www.reddit.com/r/LawSchool/comments/113yy8y/i_got_bad_grades_1l_fall_how_do_i_get_a_summer_job/",
        "text": "[removed]",
        "created_utc": 1676576036,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I screwed due to my GPA?",
        "author": "Ourael",
        "url": "https://www.reddit.com/r/LawSchool/comments/113yjwa/am_i_screwed_due_to_my_gpa/",
        "text": "3L here and I'm most likely graduating at a 2.9 GPA and I want to work in either government (local, state, or fed) or document review.  Do these employers generally hire based on GPA?  Do they ask for transcript?  I plan to get bar membership via UBE.  Any help is appreciated.",
        "created_utc": 1676575013,
        "upvote_ratio": 1.0
    },
    {
        "title": "It’s happening… should AI be banned from law school?",
        "author": "Medium_Echo_1017",
        "url": "https://i.redd.it/vk40qbmz3nia1.jpg",
        "text": "Just got this email from my professor regarding AI/CHATGPT. I don’t know if it is regarding someone getting caught or just a warning before midterms. \n\nWhat do you think of this and how do you think professors will be catching people using AI?",
        "created_utc": 1676574237,
        "upvote_ratio": 1.0
    },
    {
        "title": "As a Respondent in Moot Court, how do you gain an advantage without the opportunity to rebut the Plaintiff?",
        "author": "dragonfly609",
        "url": "https://www.reddit.com/r/LawSchool/comments/113y54j/as_a_respondent_in_moot_court_how_do_you_gain_an/",
        "text": "Going into my first moot court competition and representing the respondent. I'm prohibited from discussing the details of the case per the rules. What are some tips for destroying my opposing counsel without the advantage of getting the last word?",
        "created_utc": 1676573983,
        "upvote_ratio": 1.0
    },
    {
        "title": "MPRE study material?",
        "author": "Attackondeeznutz",
        "url": "https://www.reddit.com/r/LawSchool/comments/113y4rn/mpre_study_material/",
        "text": "My fiancé is taking the MPRE and he wanted to start studying today. However, the free study material on Barbri and Themis were both unavailable. Does anyone know why this is? When will it be available?",
        "created_utc": 1676573954,
        "upvote_ratio": 1.0
    },
    {
        "title": "Civ Pro (Rowe) &amp; Torts (Witt &amp; Tani-Cali Book) Outlines?",
        "author": "Stunning_Ship5313",
        "url": "https://www.reddit.com/r/LawSchool/comments/113y3bi/civ_pro_rowe_torts_witt_tanicali_book_outlines/",
        "text": "Hey y’all,\n\nI’ve tried finding outlines online and in my schools outline bank keyed to my textbooks but can’t find anything. I was wondering if anyone had any outlines (their own or from online) they’d be willing to share for the following books:\n\nTorts\nCases Principles and Institutions \nJohn Fabian Witt &amp; Karen M. Tani \n6th Edition\n(It’s from Cali)\n\nCivil Procedure \nRowe, Sherry,&amp; Tidmarsh\n5th Edition 2020\n\nAnything for those books would be really appreciated as I start creating my outlines ☺️",
        "created_utc": 1676573852,
        "upvote_ratio": 1.0
    },
    {
        "title": "10 Hour Bar Prep Days?",
        "author": "ejes823",
        "url": "https://www.reddit.com/r/LawSchool/comments/113xvfg/10_hour_bar_prep_days/",
        "text": "Trying to figure out my schedule for bar prep. Has anyone done 10hrs a day 5 days a week? if so any tips or tricks to stay focused and not burn out? my school graduates only 9 weeks before the bar. (I am also using themis)",
        "created_utc": 1676573295,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is CaseBook Connect not loading for Anyone else?",
        "author": "Switch-of-the-wyld",
        "url": "https://www.reddit.com/r/LawSchool/comments/113x1eq/is_casebook_connect_not_loading_for_anyone_else/",
        "text": "Every other website I try works just fine, but Casebook Connect is slow. Currently in Wills and Can't open my book. Can't even log in, the wheel has been spinning for 5 minutes now.\n\nTried both Google and Safari.",
        "created_utc": 1676571158,
        "upvote_ratio": 1.0
    },
    {
        "title": "Neat website thats helped me with dense material",
        "author": "bnkc",
        "url": "https://www.ghostextension.com/",
        "text": "",
        "created_utc": 1676570898,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will I succeed in law school if I’m socially awkward and have bad speaking skills?",
        "author": "colorfulcarebear101",
        "url": "https://www.reddit.com/r/LawSchool/comments/113wsap/will_i_succeed_in_law_school_if_im_socially/",
        "text": "",
        "created_utc": 1676570496,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any Knowledge on Callback -&gt; Result Time for Nutter or Proskauer? (1L)",
        "author": "TheOddWire",
        "url": "https://www.reddit.com/r/LawSchool/comments/113wgof/any_knowledge_on_callback_result_time_for_nutter/",
        "text": "I got interviews at a small handful of firms that are starting to send out results, but I want to hold out for one of these two (I really liked them). Anyone know how long it might take or have experience with how long it took for you?",
        "created_utc": 1676569673,
        "upvote_ratio": 1.0
    },
    {
        "title": "It’s moral.. right?",
        "author": "mhf_IHTMT",
        "url": "https://i.redd.it/pp827fkw7iia1.jpg",
        "text": "",
        "created_utc": 1676567942,
        "upvote_ratio": 1.0
    }
]