[
    {
        "title": "Decision help",
        "author": "chemreligious",
        "url": "https://www.reddit.com/r/LawSchool/comments/11quhot/decision_help/",
        "text": "I was accepted to a school with a significant scholarship and was super excited to attend, until I went to their ASD last weekend and kind of hated it. \n\nFinancially it’s definitely my best offer and I’m not sure others will be willing to match it bc they’re not super well-ranked, but they do have decent bar passage/employment outlooks.\n\nWould it be a mistake to attend if I didn’t like it at the ASD? Has anyone had a similar experience/gone to a school they didn’t like at first/gone to a more expensive school that they liked better and regretted the debt?",
        "created_utc": 1678762154,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the chance for lower T14 3.90 to HLS",
        "author": "singinthestreet",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qsxm3/what_is_the_chance_for_lower_t14_390_to_hls/",
        "text": "I know it’s below the median but will t14 bump it up a bit since it’s above 25%?",
        "created_utc": 1678758071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone done the Pitt Law School Dentons Cohen &amp; Grigsby program?",
        "author": "LegallyLoan",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qslq5/has_anyone_done_the_pitt_law_school_dentons_cohen/",
        "text": "if you have what was the whole thing like from the application to the summer internship Etc.",
        "created_utc": 1678757240,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do law firms in summer jobs treat vacations?",
        "author": "Tetsuyasoneandonly",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qsl48/how_do_law_firms_in_summer_jobs_treat_vacations/",
        "text": "My family has already planned and paid for an out of the country trip that’s three weeks from end of May to mid-June: \n\nI’m about to accept an offer for this summer but also planning to let them know of this trip. \n\nHow bad will it look if I take this vacation?",
        "created_utc": 1678757195,
        "upvote_ratio": 1.0
    },
    {
        "title": "Difficulty of getting a job at FTC",
        "author": "yipkickyipdodge",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qsam4/difficulty_of_getting_a_job_at_ftc/",
        "text": "I just read a comment that indicated getting a job at the FTC (i.e Bureau of Competition) is harder to achieve than landing a biglaw gig. Is this true? Can anyone speak to the level of difficulty/success stories they’ve experienced or heard from others.",
        "created_utc": 1678756469,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone tell me why is it so hard to find a law firm... Who's willing to sue Apple , google and big tech I see 500 million class act",
        "author": "Big-Face-8151",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qs86t/can_anyone_tell_me_why_is_it_so_hard_to_find_a/",
        "text": "[removed]",
        "created_utc": 1678756303,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi! I'm a Harvard Law grad, ex-lawyer, ex-BCG management consultant and legal strategist. Ask me anything about getting into or navigating these worlds!",
        "author": "ComprehensiveAd1456",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qrnwd/hi_im_a_harvard_law_grad_exlawyer_exbcg/",
        "text": "A bit about me - graduated from HLS, ended up specializing in intellectual property law at a New York law firm, hated it, so moved into management consulting at the MBA level at the Boston Consulting Group. Have worked in strategy roles since for companies of all sizes. Also, I doodle! (Hence the avatar)\n\nDidn't have many folks to talk to when going through my own process of entering/pivoting into these worlds. Happy to field any questions you have.",
        "created_utc": 1678754909,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scholarship Reconsideration",
        "author": "Rangel0712",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qrlzq/scholarship_reconsideration/",
        "text": "Hey everyone! I am requesting a reconsideration in scholarship amount from my top choice. I am asking for $20,000 more and would love your advice. \n\nSome things to keep in mind is this is the same offer they offered me my first acceptance, some stuff happened and I ended up taking a year off. However, their tuition has went up. My scores are exactly the same, and they made sure to mention that when they responded to my email asking for more information. I have two other acceptances. \n\nSchool 1 is my top choice that I’m requesting more from. \n\nSchool 2 and 3 both awarded me scholarships that are lower than what school 1 originally offered me, however there COA is overall lower by a few thousand. \n\nThe difference is my work experience is way more impressive now and my new letter of rec should have carried more weight at this school. \n\nAdvice?",
        "created_utc": 1678754772,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conflict check question",
        "author": "Existing_Cry_8295",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qqz1k/conflict_check_question/",
        "text": "My firm just sent out a conflicts form. I worked as a legal assistant at a personal injury firm for a bit. I mainly wrote demands for insurance companies (looked at medical records, police reports, etc.). I wrote a ton of these demands, and obviously don’t remember any client names. I’m going to reach out to my employer to see if they could give me the info, but I’m fairly certain that the software we used never indicated when I worked on a particular demand. \n\nSo my main question is: what is the result if I’m unable to deliver to my firm the names of clients’ cases I worked on? What would you do in this situation?",
        "created_utc": 1678753207,
        "upvote_ratio": 1.0
    },
    {
        "title": "how are 3Ls surviving the next couple of months?",
        "author": "exhausted0L",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qqsut/how_are_3ls_surviving_the_next_couple_of_months/",
        "text": "fellow 3Ls -- how are we getting through the coming 2ish months until graduation without completely checking out? I'm having more trouble than ever keeping focused and marshaling any motivation whatsoever to go to class or care about anything. anybody else in the same boat have any advice or insight?",
        "created_utc": 1678752779,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bankruptcy Tips, Outlines, or Anything!",
        "author": "icyhot1993",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qq181/bankruptcy_tips_outlines_or_anything/",
        "text": "Really struggling in my Bankruptcy class, and cannot follow my professor. I'm too deep down the rabbit hole now to just ask him for help.\n\n&amp;#x200B;\n\nCasebook is \"The Law of Debtors and Creditors\" (Warren, Eighth Edition). Wondering if anyone has an outline or other resources. I'm planning on doing the Quimbee course. Thanks!",
        "created_utc": 1678750972,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m a felon; Law school, Bar exams, practicing law, etc.",
        "author": "AwwSnapItsBrad",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qpia3/im_a_felon_law_school_bar_exams_practicing_law_etc/",
        "text": "Tl;dr: I’m a felon. What can I expect as far as being admitted to law school, passing the bar exam, and Moral character test? State of Kentucky.\n\nNot too long; I did read this actually: I’m felon. Two indictments, 17 total counts. All are “criminal possession of a forged instrument, 2nd degree.” All are class D felonies in the state of Kentucky. I spent a great deal of my early 20s as a very low bottom heroin addict. Homeless, panhandling, the whole deal. In the grip of my addiction, I had forged and cashed some checks that were not mine. I was convicted in 2016, plead guilty, and got out on felony probation. I got sober in 2016 and have been sober since then in a 12 step fellowship in which I am a very active member and spend a lot of time volunteering. I’ve made reparations and made amends both through the courts and just on my personal journey through recovery. I’ve walked out probation successfully and maintained gainful employment full time for the last almost 7 years now, while simultaneously working my way through undergrad as well. Working full time 40-45 hours a week, taking 12 credit hours a semester, managed to earn my associate degree with a 3.7 and transferred to a 4 year university for my bachelors and currently have a 3.89.\n\nI’m saying all of these things just as evidence that I no longer live the way I used to live and have worked my ass off to be a productive member of society. I’m going to go to law school. I’ve wanted to be an attorney since I was a small kid. I’ve done a fair bit of research but the information regarding felons and law are not super clear. Just wondering what maybe I should expect when applying to law school and what comes after. I’ve got 3 semesters left in undergrad and I just want to be fully prepared for the next leg of the journey.",
        "created_utc": 1678749746,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Paradox of an miserable Criminal",
        "author": "glucklos",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qpdbx/the_paradox_of_an_miserable_criminal/",
        "text": " Hello there. I have a friend who lost her father like 5 months ago. She's been struggled with mental and financial problems. She got a job at the stationery at her university. Then a worker tried to take advantage of absence of her father, and bullied her. It's got far, he wanted her to talk him by force. Didn't worked. Then the semester came in.\n\nWhile the semester, a big earthquake happened in Turkey. Its so massive that nearly 10 cities has been destroyed. Hundreds of thousands of people died. All the schools turned to online due to it. So she is staying in her city and not coming to the university. The abuser keeps writing her, so she banned her from all the possible apps and messaging services.\n\nBut, he started to sending so called ''gifts'' from a mobile game. Her mother called him and told him to leave her alone, delete her number and game id, and everything. So did he. After a week his whatsapp pp came back(you can see while he's blocked), and he started to sending gifts again.\n\n&amp;#x200B;\n\nWe have screenshots that he says ''something surprising will happen to you'', ''either way we will see eachother, the world is small'' etc. Other female workers of stationery are also aware of he is kinda creepy, keeps telling them ''don't call me big brother'' which means don't take me out of your interest league because of my age, i might want to hook up with you too.\n\n&amp;#x200B;\n\nWhatsoever, even with we get to the Judge with those evidence and witnesses, all we could have is a basic ''suspension decision''. Like; ''you can't go xx meters close to her, or you will be punished for that''. Which is super useless. A man who is 30 without a job, family, friends; totally into disgrace who bothers 20yo kids wouldn't be bothered by a criminal record.   \n\n\nOr even if he gets jailed for breaking the suspension, he will just got angrier because he is that kind of uneducated being, will get out and try something crazier. At least this is how it works in Turkey.\n\n&amp;#x200B;\n\nWhat do you think about this paradox. Punishing the criminal makes the criminal enlarge his crime by a little delay due to time in the jail. What should be done?",
        "created_utc": 1678749435,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some things you wish you knew about law (school or the career) before pursuing it?",
        "author": "camoxxxxx",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qp2c8/what_are_some_things_you_wish_you_knew_about_law/",
        "text": "Title\n\nLooking for insight. Any comments appreciated!",
        "created_utc": 1678748734,
        "upvote_ratio": 1.0
    },
    {
        "title": "For those who went from troubled youth to successful adults, is it safe to share your story as a law student / lawyer?",
        "author": "pro-nuance",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qnvd4/for_those_who_went_from_troubled_youth_to/",
        "text": "I had a really rough upbringing, and it was honestly by pure luck that I graduated high school, avoided any criminal convictions, etc. I engaged in a lot of behaviors that could've gotten me locked up on any given day, which obviously would've changed my future entirely. I was a few years into adulthood before I figured out how to be a normal person. I'm quite a bit older than most of my classmates, but here I am.\n\nI don't know where I'd be now if I'd found my way into the criminal justice system as a kid or young adult. I would love to be able to share my story with other lawyers as a reminder that young people can change in tremendous ways, and that we should bear that in mind when we make decisions that will permanently alter their future opportunities.\n\nMy problem is that I don't know if it's safe for me to share my backstory in a legal setting. I thought there would be more people like me here, but I haven't run into anyone sharing stories similar to mine yet. Are there any openly reformed lawyers out there? Should I keep my story under wraps? Are there potential landmines here?",
        "created_utc": 1678746100,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about leftist orgs?",
        "author": "InformationDouble273",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qnukt/question_about_leftist_orgs/",
        "text": "As a POC, I feel like I come across many “leftist orgs” who ally with POC people and yet not a single POC is present at their events? \n\nI feel like the events come across very performative and tone deaf too? They reflect the views of college-educated white students but step outside of those college spaces, the reality of our lives are very different. Why not center affinity groups, invite them to the events, ask for their input, and discuss policy goals to help marginalized people?",
        "created_utc": 1678746058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good supplements for substantive crim law?",
        "author": "anongirlll1990",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qncna/good_supplements_for_substantive_crim_law/",
        "text": "Hi all. I’m currently struggling in substantive criminal law. I’m in my last semester and this is probably the most difficult class I’ve taken…yes, more difficult than evidence, property, and contracts. The problem is that my professor is highly theoretical. Rather than going through each crime and elements thereof, we are focusing on theoretical concepts and statutory interpretation of weirdly drafted crimes (as opposed to common law crimes like manslaughter). \n\nAnyway—anyone know of good supplements? Barbri 2L/3L mastery doesn’t provide crim law videos. Quimbee is too basic. E&amp;E has been the most helpful but I’m still confused.",
        "created_utc": 1678744976,
        "upvote_ratio": 0.99
    },
    {
        "title": "Can a California barred attorney live in NYC?",
        "author": "sadnisolated",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qnaca/can_a_california_barred_attorney_live_in_nyc/",
        "text": "Or am I locked into CA forever? I get that I could take the NY bar but that would be farther down the line for me as someone taking the CA bar this year lol. \n\nAny stories of attorneys physically working in NY but barred in CA? Idk I just want to be able to travel and live in my old stomping grounds but I do see California as my home base.",
        "created_utc": 1678744848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Studicata? Thoughts?",
        "author": "jojozuniga",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qmeps/studicata_thoughts/",
        "text": "Currently a 1L and I have the free Studicata, which I like but I didn't test as well as I wanted to on my Midterms. \n\nI know my school offers a lot of free resources, and I already pay for Quimbee. \n\nWould it be worth it to pay for the Studicata Subscription too? What are your thoughts?",
        "created_utc": 1678742983,
        "upvote_ratio": 1.0
    },
    {
        "title": "Impossibility defense for Attempts",
        "author": "Amazing_War_3418",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qlwg8/impossibility_defense_for_attempts/",
        "text": "Can someone explain this to me please, our professor has given us multiple different answers including that it’s generally not a defense, it is the only defense, and it’s impossible to differentiate between factual impossibility and legal impossibility….any clarification would help!",
        "created_utc": 1678741893,
        "upvote_ratio": 1.0
    },
    {
        "title": "Living Costs for Lewis and Clark",
        "author": "Bigasianpap1",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qlh34/living_costs_for_lewis_and_clark/",
        "text": "Currently makinng final decisions for law school, and money is a big factor for me. I got into L&amp;C, and I remember a representative from L&amp;C saying that I could find housing for students for $600-$800, and I don't beleive it. I live in CA so anything below 900 for rent seems ludicrous, which is probably why I don't believe it. Can any Lewis and Clark students verify?",
        "created_utc": 1678740980,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just found out Learned Hand was a judge and not some sort of principle of the law",
        "author": "wahoowa2023",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qlb9v/just_found_out_learned_hand_was_a_judge_and_not/",
        "text": "I’m a fourth year going to law school in the fall and I see the name all the time on this sub not having any idea what it means. Thanks to my antitrust class i can be in on the jokes now!",
        "created_utc": 1678740637,
        "upvote_ratio": 1.0
    },
    {
        "title": "Currently at a crossroads after graduation. Should I enroll in Law School?",
        "author": "ThrowAwayYourFuture8",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ql2ih/currently_at_a_crossroads_after_graduation_should/",
        "text": "Hey guys,\n\nRecently I had a talk with my relative who is a Lawyer, and I informed him that I recently graduated University with my Bachelors of Business Administration in Management (With no debt! Thank God.). He told me that \"If he were in my shoes\", he would immediately take the LSAT to be able to go to a Law School, take the classes throughout the year (Summers included) and graduate within about 3 years attaining a \"JD\" or something like that (I forgot what he called it). He told me that this would open so many doors for me and boost my appeal to employers, as well as my earning potential.\n\nBut here's the thing.... I took one business law course as an undergrad, and that is my only experience with that particular subject. So I Want to ask a few questions:\n\n* Should I go ahead and go with his law school advice even if I don't have any experience with law or even have that much interest? Or should I just get a masters degree for Business administration?\n* Is it possible to juggle law school with a full time job?\n* If I did decide to do this, it would have to specifically be \"Business Law\"... right?\n* I am a big \"cost\" guy... so lay it on me thick, how expensive would this be? Lmao.",
        "created_utc": 1678740112,
        "upvote_ratio": 1.0
    },
    {
        "title": "What space do you feel you do your best studying/schoolwork in?",
        "author": "Vast-Passenger-3035",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qj5ox/what_space_do_you_feel_you_do_your_best/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/11qj5ox)",
        "created_utc": 1678736014,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rename the DMV to the Department of Commercial Vehicles.",
        "author": "ChuckBnf",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qj48i/rename_the_dmv_to_the_department_of_commercial/",
        "text": "[removed]",
        "created_utc": 1678735927,
        "upvote_ratio": 1.0
    },
    {
        "title": "Senate judiciary committee interview advice",
        "author": "Ok_Bit_3152",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qiz7f/senate_judiciary_committee_interview_advice/",
        "text": "I have an interview coming up next week for a summer position for a senator on the judiciary committee. Does anyone have any advice about what to expect and what kinds of questions are asked?",
        "created_utc": 1678735630,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book Recommendations for an incoming 1L?",
        "author": "need-more-atmosphere",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qi8v4/book_recommendations_for_an_incoming_1l/",
        "text": "Title says it all. I've read \"Legal Writing in Plain English\" as well as one of those \"Law School Survival Guides\" that outline the law school experience on a basic level. Any other recommendations that anyone could give to help prepare?",
        "created_utc": 1678734042,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much if at all are overweight people looked down upon in biglaw?",
        "author": "capriciousfrigate01",
        "url": "/r/biglaw/comments/11qgp21/how_much_if_at_all_are_overweight_people_looked/",
        "text": "",
        "created_utc": 1678732275,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which looks better on a resume?",
        "author": "Infamous-Bother-7541",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qhbzx/which_looks_better_on_a_resume/",
        "text": "I am coming to the end of my 1l year and have offers to work this summer at the DA office and the PD office in my law schools geographical area, and for Air Force JAG. I originally wanted to do something in corporate law but I haven’t had any luck this summer. Which out of the three would look best on a resume for a summer 1L job. I feel pretty much equal about all of the opportunities I currently have so I am having a hard time choosing.",
        "created_utc": 1678732016,
        "upvote_ratio": 1.0
    },
    {
        "title": "How important is choosing a law school to how far you will go in a legal career?",
        "author": "cornerstoreBread_",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qg7so/how_important_is_choosing_a_law_school_to_how_far/",
        "text": "",
        "created_utc": 1678729426,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using Friends as References for C&amp;F?",
        "author": "Throwawayagain15789",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qfm2k/using_friends_as_references_for_cf/",
        "text": "[removed]",
        "created_utc": 1678728045,
        "upvote_ratio": 1.0
    },
    {
        "title": "How bad of a recession are we facing in 2023-2025?",
        "author": "capriciousfrigate01",
        "url": "/r/biglaw/comments/11q86ic/how_bad_of_a_recession_are_we_facing_in_20232025/",
        "text": "",
        "created_utc": 1678727415,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is like studying IP? Is it fun doing patent law etc? Do you regret your choice?",
        "author": "aquilus-noctua",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qf9mn/what_is_like_studying_ip_is_it_fun_doing_patent/",
        "text": "Apparently IP is hot right now and my school has a good program.\nThat said, how is it? \nMy prior passion was labor and employment, but I’m thinking about shifting gears.\nAny feedback from those who have bravely gone before?",
        "created_utc": 1678727167,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone escaped poverty/the hood through this profession, only to feel misunderstood by both worlds or not fully belonging to either?",
        "author": "vroombandicoot",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qf6a0/anyone_escaped_povertythe_hood_through_this/",
        "text": "I am currently feeling like an outsider around a bunch of people who grew up wealthy or had more conventional family units/support systems, notable only since I come from a family unit broken by way of inner-city poverty, particularly from its violation on relationships between men and women and the children born from their strife as well as it’s pervasive toll on mental health. \n\nThough with my family, particularly my siblings, I can feel like myself, which provides some amount of comfort and respite from loneliness. This is at the cost of the stress incurred from re-entering spaces of dysfunction and witnessing the cyclical nature of trauma and poverty diligently sweep my siblings along so that they now resemble the adults I’ve known as a kid—perhaps also reminding me that I am not too far away from being recaptured by this terrible machine. \n\nI’m just not sure where I stand in either world. I support my family as best as I can, which puts a financial burden on me heavy enough to draw me down from the rank of my peers, but bearable enough to keep me in a very fortunate position compared to the circumstances I had known before the education and career decisions and abundance of luck had pushed me past circumstance’s current.",
        "created_utc": 1678726955,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lexis \"Did You Know\" Week 9",
        "author": "Flannel_Channel",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qeotq/lexis_did_you_know_week_9/",
        "text": "Answer: 3",
        "created_utc": 1678725830,
        "upvote_ratio": 1.0
    },
    {
        "title": "How are you tested in law school abroad?",
        "author": "doucheiusmaximus",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qe4fx/how_are_you_tested_in_law_school_abroad/",
        "text": "Hi guys. I'm a fourth year student studying law in southern Africa and I have a problem with how law is being taught. Basically I don't like having to memorise an entire case and write problem type questions. I'm barely able to keep up with the reading load and I get overwhelmed pretty quickly. Not to mention we're thrown into an exam paper without any materials  (besides statutes in special cases) but when you start working you have access to all of this and don't have to memorise them \n\nSo I'm wondering if when you're studying abroad, do you do papers like this? Do you have to memorise a lot of information and just regurgitate them? Are they open book exams? I'd like to know if it's just a problem in my country or it's abroad because I don't think memorisation is a good test of a lawyer but rather procedure, drafting documents and dealing with clients.",
        "created_utc": 1678724502,
        "upvote_ratio": 1.0
    },
    {
        "title": "WWYD? Partner's career vs. my career",
        "author": "even-in-these-chains",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qe3y7/wwyd_partners_career_vs_my_career/",
        "text": "Hey everyone. I have a question about juggling starting a legal career with my personal life and my partner's needs.\n\nHow would you all with long-term partners approach a situation where you're pursuing a certain job or a certain type of job, but that requires you to move? I know a lot of law students move before and/or after law school, but wondering how you work it out with your partners.\n\nMy partner is currently feeling anxious about the idea of having to move after law school (which isn't 100% yet but I need to decide my strategy). She started a job recently which has a much better work environment than her previous, toxic jobs, so she doesn't want to be locked in to leaving. Working remote isn't an option for her and isn't something I can count on for myself. We could do long-distance but we'd like to avoid it as much as possible.",
        "created_utc": 1678724471,
        "upvote_ratio": 1.0
    },
    {
        "title": "family law in usa",
        "author": "Bubbly-Pea5631",
        "url": "https://newsphilosopher.topshetkari.com/2023/03/family-law-in-usa.html",
        "text": "",
        "created_utc": 1678723906,
        "upvote_ratio": 1.0
    },
    {
        "title": "travel insurance in usa",
        "author": "Bubbly-Pea5631",
        "url": "https://newsphilosopher.topshetkari.com/2023/03/travel-insurance-in-usa.html",
        "text": "",
        "created_utc": 1678723344,
        "upvote_ratio": 1.0
    },
    {
        "title": "home equity loan in usa",
        "author": "Bubbly-Pea5631",
        "url": "https://newsphilosopher.topshetkari.com/2023/03/home-equity-loan-in-usa.html",
        "text": "",
        "created_utc": 1678722432,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it illegal to record a teacher who is screaming and shouting racist slurs?",
        "author": "Confident_Action_266",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qcvj1/is_it_illegal_to_record_a_teacher_who_is/",
        "text": "Im from Ontario, Canada. I had a teacher who screamed and bullied me everyday in class. Turns out he’s a criminal. He raped an 14 year old and tried to make out with one of the kid in our school too. He got fired.\nIn my recording, he said that he wants to shoot Indian people. If recording this is legal, I want to publicly upload the recording that I have so he could never find a job again. If I do this, can the school or the teacher do anything to me?",
        "created_utc": 1678721603,
        "upvote_ratio": 1.0
    },
    {
        "title": "A new doctrine within pubic policy",
        "author": "estherstein",
        "url": "https://i.redd.it/jaqxojzxxina1.png",
        "text": "",
        "created_utc": 1678721019,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who is your favorite person in your law school?",
        "author": "OurFrankWhoArtInLA",
        "url": "https://www.reddit.com/r/LawSchool/comments/11qaouw/who_is_your_favorite_person_in_your_law_school/",
        "text": "",
        "created_utc": 1678716431,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'd Better Call Saul!",
        "author": "bistec-SD71",
        "url": "https://i.redd.it/qkcgtp3jxdna1.gif",
        "text": "",
        "created_utc": 1678713088,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parent death in law school",
        "author": "summertimegg",
        "url": "https://www.reddit.com/r/LawSchool/comments/11q8lwr/parent_death_in_law_school/",
        "text": "Has anyone had a parent die while you were in school? What did you do/did the school do anything to help you",
        "created_utc": 1678711231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spilled coffee",
        "author": "MarkSnickerberg2",
        "url": "https://www.reddit.com/r/LawSchool/comments/11q7gda/spilled_coffee/",
        "text": "[removed]",
        "created_utc": 1678707999,
        "upvote_ratio": 1.0
    },
    {
        "title": "can you send criminals to...",
        "author": "Anne2825",
        "url": "https://www.reddit.com/r/LawSchool/comments/11q6kql/can_you_send_criminals_to/",
        "text": "\nCan you transfer criminal from a country which doesn't have death penalty to a country which has death penalty?",
        "created_utc": 1678705214,
        "upvote_ratio": 1.0
    },
    {
        "title": "From community college to law school",
        "author": "Canadianiceberg25",
        "url": "https://www.reddit.com/r/LawSchool/comments/11q1elo/from_community_college_to_law_school/",
        "text": "I would like to ask for your career/school advice as I’m planning to apply for law school in the future.\n\nMy current situation: \n\n-Just completed my three-year diploma program (non-degree) from community college in Toronto. \n\nMy goal: \n\n-Going to a Canadian Law school\n\nMy plans/options:\n\n1.  Complete a diploma to degree pathway in the same community college (honours Bachelor of Commerce) in 1 year.\n\n2.  Degree completion program at Toronto Metropolitan University, (formally known as Ryerson University) Bcomm in law and business in 2 years.\n\nQuestions:\n\n1. Would law schools consider undergraduate degrees from Colleges (community college) in Canada when assessing the application?\n\n2. Considering the time, and quality of credentials, what would be the most strategic option to consider among the two I mentioned above? \n\nI would appreciate any thoughts or advice you can provide.",
        "created_utc": 1678686305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Law School while working full time changed my personality",
        "author": "AnswerMeThis49",
        "url": "https://www.reddit.com/r/LawSchool/comments/11q0oza/law_school_while_working_full_time_changed_my/",
        "text": "[removed]",
        "created_utc": 1678683814,
        "upvote_ratio": 1.0
    },
    {
        "title": "What factors did you considered considered when choosing a law school?",
        "author": "LegallyLoan",
        "url": "https://www.reddit.com/r/LawSchool/comments/11q0e98/what_factors_did_you_considered_considered_when/",
        "text": "What did you look for in a law school?\n\nIf you are currently a 1L-Post 3L: what do you think You should have considered?\n\nWhat do you think is the most important factor to look at after money?\n\nIf you are a current law school Student or a recent grad, what school did you go to and what was or has been your experience (thus far)?\n\nIf this is not where I should be posting this please let me know so I can delete it.",
        "created_utc": 1678682870,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone an Open Meetings Act expert?",
        "author": "throwlefty",
        "url": "https://www.reddit.com/r/LawSchool/comments/11pyy2j/anyone_an_open_meetings_act_expert/",
        "text": "Wondering about automated email / texting as it relates to OMA. \n\nFor example, locally elected officials can't send group emails to their colleagues. Each email must be sent individually to comply with oma. What if I automate that process and send those individual email at once?",
        "created_utc": 1678678421,
        "upvote_ratio": 1.0
    },
    {
        "title": "graduation",
        "author": "Important-Shift5238",
        "url": "https://www.reddit.com/r/LawSchool/comments/11pyqwg/graduation/",
        "text": "don’t feel like attending my graduation ceremony because of stress about bar prep and not having any friends at school. would i regret not going to my graduation? hmm",
        "created_utc": 1678677839,
        "upvote_ratio": 1.0
    },
    {
        "title": "Big Law SA question",
        "author": "Steak-and-Egggggs",
        "url": "https://www.reddit.com/r/LawSchool/comments/11pykfj/big_law_sa_question/",
        "text": "Hi! Quick question for y’all. I missed all the deadlines for applying to 1L Big Law SAs (I’m a first gen law student and my school’s CDO didn’t give a heads up about how early it was). I’m hoping to apply for 2L SAs when the time is right and was hoping to know (1) when I should plan to start doing that and (2) how to know which firms to apply to and how to apply to them if my school’s OCI is lacking. \n\nAlso (and I know it’s impossible to say) but I was wondering how good my shot is at the best firms if I’m ranked in the top 5% of a school ranked around 50. \n\nThanks in advance for the help!",
        "created_utc": 1678677329,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does the ip law work in terms of apps! For example if I have an app called X and have the trade lmark for it in UK. What do i do if someone else has the trademark for the same n US.",
        "author": "Elliot-C",
        "url": "https://www.reddit.com/r/LawSchool/comments/11pxu9l/how_does_the_ip_law_work_in_terms_of_apps_for/",
        "text": "",
        "created_utc": 1678675336,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where should I go on a bar trip?",
        "author": "doglovernyc",
        "url": "https://www.reddit.com/r/LawSchool/comments/11pxpae/where_should_i_go_on_a_bar_trip/",
        "text": "[removed]\n\n[View Poll](https://www.reddit.com/poll/11pxpae)",
        "created_utc": 1678674948,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone else's misery to make you feel better about your own shortcomings",
        "author": "papanurgle098",
        "url": "https://www.reddit.com/r/LawSchool/comments/11pxh34/someone_elses_misery_to_make_you_feel_better/",
        "text": "Recently had a memo due. About 20 pages in one week, but really a handful of nights when you account for other classes/work. I spent about 40 hours on it, including the research, and ended up clicking submit with 90 seconds to spare. \n\nNo strict page limit, but it was several pages longer than I know my prof will expect, had missing citations (think placeholders from a working draft, like \"Sadge pg 1111 2016\"), and some minor grammatical mishaps. Not to mention some pretty iffy cases and analogical sections. If history is any indication, prof will absolutely eviscerate the whole thing. Just remember, when you're feeling like you're insufficient, someone in your class is likely doing worse!",
        "created_utc": 1678674322,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s harder: MPRE or Bar Exam?",
        "author": "Letstalkabtit14",
        "url": "https://www.reddit.com/r/LawSchool/comments/11pvz98/whats_harder_mpre_or_bar_exam/",
        "text": "",
        "created_utc": 1678670273,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does nys dealer have to have all inspection monitors complete or can they have 1 incomplete?",
        "author": "daddymattress",
        "url": "https://www.reddit.com/r/LawSchool/comments/11pv55x/does_nys_dealer_have_to_have_all_inspection/",
        "text": "",
        "created_utc": 1678668070,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L federal clerkships",
        "author": "CourtNo2804",
        "url": "https://www.reddit.com/r/LawSchool/comments/11pu0nj/1l_federal_clerkships/",
        "text": "Hi all,\n\nOne of my classmates recently got a federal clerkship with a judge after 1st semester 1L (I attend a T30 Law School). I'm really happy for them, but how do you apply for federal clerkships so early? Is there something I'm not doing that I should be, as someone who wants to also be a clerk? Having major imposter syndrome atm, could use some reassurance more than advice tbh.",
        "created_utc": 1678665117,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good issue spotters for DGCL (Business Organizations)",
        "author": "el_fuelle",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ptxim/good_issue_spotters_for_dgcl_business/",
        "text": "Hi all. I am looking for some issue spotters for the Delaware Corporations Code. It seems like most of the Barbri and E&amp;E is the MBCA. Any resources would be appreciated!",
        "created_utc": 1678664896,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone please explain how the docket system works for a courtroom? Are all cases in the docket ongoing cases?",
        "author": "roomlightdesklamp",
        "url": "https://www.reddit.com/r/LawSchool/comments/11pt2ux/can_someone_please_explain_how_the_docket_system/",
        "text": "",
        "created_utc": 1678662772,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is wanting to be an FBI agent after a few years as a prosecutor dumb?",
        "author": "Aspottedcheetah",
        "url": "https://www.reddit.com/r/LawSchool/comments/11pt1j7/is_wanting_to_be_an_fbi_agent_after_a_few_years/",
        "text": "I’m working as a prosecutor after graduation and planning to apply to the FBI in a few years once my work experience meets their two year requirement. Im graduating from a T14 with top 25% grades and a few federal government internships +other prosecution related work. I am thinking that being a special agent would fit my personality, and I like that physical fitness is part of the job. \n\nBut I do have a girlfriend and it seems that being an FBI agent can make starting a family hard. It also seems like I would be taking a massive pay cut (like 100k+ down to 60k), and potentially wasting my law degree (although the FBI does say agents with a JD get to use it? Not sure how, obviously not practicing). But I do know being an agent has great fed gov benefits too. \n\nThe thing is, I also think I’ll find a lot of enjoyment in being a prosecutor, pay is better, and it seems that it’s generally safer and more friendly work life balance. \n\nThoughts? Is this even worth considering? I feel maybe the obvious decision is staying as a prosecutor and not “wasting” my 200k law degree.\n\n[View Poll](https://www.reddit.com/poll/11pt1j7)",
        "created_utc": 1678662683,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fordham Transfer - is it worth it?",
        "author": "LSATenthusiast",
        "url": "https://www.reddit.com/r/LawSchool/comments/11psmbv/fordham_transfer_is_it_worth_it/",
        "text": "Any people who transferred to Fordham? How was the experience and how hard was it to land BL as a transfer? Especially, in view of how I have heard you can’t do their early OCI program\n\nP.S. Posted this on r/LawSchoolTransfer yesterday but didn’t receive any responses so posting here",
        "created_utc": 1678661674,
        "upvote_ratio": 1.0
    },
    {
        "title": "How “cliquish” is your law school? Do people acknowledge each other or say hi even if you don’t belong in the friend group?",
        "author": "chargingstation12",
        "url": "https://www.reddit.com/r/LawSchool/comments/11prfku/how_cliquish_is_your_law_school_do_people/",
        "text": "I go to a school that’s known to be very liberal.\n\nYet, when I say hi and talk to the cleaning staff, they often act surprised. “*** Law Students don’t really talk to us. They pretend to look at the walls when they walk past us.”\n\nThis is the essence of the hypocrisy I see at my law school: people looking real good on paper. Progressive. Woke. But all of it to get into a good law school or to get a good job.\n\nSocially? It still feels like it’s segregation era.\n\nPeople don’t acknowledge you or even say hi if you don’t look, speak and think like them. \n\nDiversity is a concept that exists only on paper. In reality, people frown upon those who think differently. It’s all about excluding others — and the people who are at the forefront are precisely the ones who act like they’re “woke.”\n\nThey sneer at you and text among each other when you’ve done the readings and speak out in class.\n\nPeople take what you’ve said in class out of context to spread malicious rumors about you.\n\nIf you honestly share about your mental health struggles, people will talk and talk — and then avoid you because you’ve had “mental health issues.”\n\nIt seems like when students aren’t studying, they spend most of their talking crap about other students, shooting them down with whatever weakness they can find.\n\nI used to not understand how federal judges could send so many African American men to jail for so long a time for non-violent crimes.\n\nBut after observing my classmates, I get it.\n\nIf you don’t look and talk like them, what are you to them? \n\nNothing.\n\nI bet they’ll not even blink an eye in sentencing someone to 30 or 50 years in prison for non-violent crimes. Because you’re not one of “them” — why should they consider your story in full? You’re not one of “us” — therefore you’re not even human.\n\nJust like how people say they’ll do public interest just to get into law school, then immediately start considering BigLaw options, the same is with how students say they’ll treat those who are different or come from different backgrounds before getting into law: complete BS.\n\nOnce they’re in — it’s all about making fun of students who don’t look, speak or think like them.\n\nIt’s all about excluding your classmates so your group feels tighter.\n\nI’ve never such a concentrated group of sociopathic narcissists who can be so cruel to each other.\n\nWhat’s your experience like?",
        "created_utc": 1678658877,
        "upvote_ratio": 1.0
    },
    {
        "title": "Evidence casebook mentioned an area of the law I don’t know much about. Anyone familiar?",
        "author": "Constellations94",
        "url": "https://i.redd.it/4moxaf036fna1.jpg",
        "text": "",
        "created_utc": 1678657331,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about laptop and the bar",
        "author": "JimThomeHitsDingers",
        "url": "https://www.reddit.com/r/LawSchool/comments/11pptao/question_about_laptop_and_the_bar/",
        "text": "Does anyone know if they provide you with a laptop when you pay the extra fee to type your answers for the bar? Taking the PA bar if that matters. \n\nThanks",
        "created_utc": 1678655068,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anybody experienced this…",
        "author": "Traditional-Wave-724",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ppnwu/has_anybody_experienced_this/",
        "text": "wrote on here a few days ago and received amazing advice. I would like to know if im alone. This semester I have been completely disassociated &amp; disengaged. Thankfully, I still have been going to class. But I literally cannot tell you one thing ive learned in evidence, corporation &amp; partnerships, &amp; commerical sales. Like literally not ONE thing. Finals are 6 weeks away and Im trying my best to literally just exist. Has anybody had a semester they literally learned nothing and were able to still succeed in the end? Im starting to watch review videos from the beginning and getting on quimbee today. I hate being in such a stagnant state.",
        "created_utc": 1678654721,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t have the “lawyer personality”",
        "author": "Fabulous-Marketing-5",
        "url": "https://www.reddit.com/r/LawSchool/comments/11pp95p/i_dont_have_the_lawyer_personality/",
        "text": "I’m currently an undergraduate student in my 3rd year, I’m studying psychology &amp; my initial plan was to become a therapist but I’ve recently fell in love with the law. I love learning about the law, about cases, I feel myself incredibly interested in all things law &amp; have grown a strong passion for it. Not only that, but I also love writing &amp; reading. &amp; I know how much I’ll be doing it as a lawyer. \nMy only issue is that I don’t think I have a lawyer personality, I’m incredibly soft, gentle, kind, bubbly. I don’t have an incredibly strong personality, i don’t even think I’d be too good at debating someone. \nDoes this matter? Someone recently kinda told me if I don’t grow a tougher personality I’m gonna be eaten alive, because the law environment is toxic &amp; harsh.",
        "created_utc": 1678653728,
        "upvote_ratio": 1.0
    },
    {
        "title": "University of Toronto law school prospects.",
        "author": "FARRAMlR",
        "url": "https://www.reddit.com/r/LawSchool/comments/11po27a/university_of_toronto_law_school_prospects/",
        "text": "Hey fellow prospective law students and current law students. I am considering the University of Toronto  for my law degree, but I have some concerns and was hoping to get feedback from anyone, especially graduates and current students at the University of Toronto. \n\nLet me get some preamble out of the way first. First, I am aware that the UofT gives out considerable financial assistance. Furthermore, they are the best school in Canada in probably the city with the best employment for lawyers in Canada (not verified, but guessing). However, I am concerned that even with all of these factors, one may not secure a position AFTER articling which will lead to issues even given the aforementioned positive factors. I know UofT boasts impressive articling numbers, but when you’re paying student debt, that time spent articling is not the deciding factor, in my opinion. It’s whether you can secure a decently paying position after articling. So to graduates who can speak on this, what has your experience been like?  After attending UofT, and practicing, do you feel like your education at UofT was truly worth it? Were you and your colleagues able to secure jobs after taking the bar exam? If you’re living in Toronto, are you in a comfortable financial position that you can pay the ever increasing rents? Or is the pressure that is accrued by going to the University of Toronto only get worse once you are finished and living in Toronto?\n\nFinally, I also just wanted to get a gist of the student life in law school. Are clubs active and were you able to enjoy yourself when you were attending law school?\n\nI also welcome opinions from students in other universities or who attended other universities who are in a similar position.",
        "created_utc": 1678650938,
        "upvote_ratio": 1.0
    },
    {
        "title": "What types of questions are good to ask during a regulatory/negotiation law interview?",
        "author": "machly12",
        "url": "https://www.reddit.com/r/LawSchool/comments/11pnb2g/what_types_of_questions_are_good_to_ask_during_a/",
        "text": "I have a summer internship interview coming up and am looking for some advice on this. I want questions that demonstrate my interest more than “what’s a normal day look like for you”, “what’s your favorite/least favorite part of working for this firm”, etc. I’m hoping to show my interest and understanding through the questions I ask, but am not sure how. Any help/sharing of questions that you normally ask at legal interviews/general interview tips would be welcomed and appreciated!",
        "created_utc": 1678649172,
        "upvote_ratio": 1.0
    },
    {
        "title": "MPRE in 2 weeks and I haven’t started studying",
        "author": "Fluffy_Air_3682",
        "url": "https://www.reddit.com/r/LawSchool/comments/11pmtf8/mpre_in_2_weeks_and_i_havent_started_studying/",
        "text": "Am I screwed? Or have other people been able to just cram their studying in a week is so. I did take ethics last semester so hopefully the material will be familiar.",
        "created_utc": 1678648040,
        "upvote_ratio": 1.0
    },
    {
        "title": "Impact of university on law school admissions",
        "author": "shadowreaf",
        "url": "https://www.reddit.com/r/LawSchool/comments/11pmq8e/impact_of_university_on_law_school_admissions/",
        "text": "I’m currently a freshman at University of Florida (UF) which is a top 5 public university in the United States but am considering transferring to Florida Atlantic University for personal reasons. My dream law school is the law school at UF, however I’m unsure how much impact going to a academically ‘worse’ university would have on my admission there. Any feedback would be very appreciated as I’m still undecided on whether this transfer may hurt my future significantly.",
        "created_utc": 1678647836,
        "upvote_ratio": 1.0
    },
    {
        "title": "The philosophy of Beccaria is relevant to understand the current mental health crisis. The idealistic abstractions of the legal system are akin to the ones used in psychiatric discourse.",
        "author": "carrero33",
        "url": "https://www.essentiafoundation.org/a-cure-to-all-mental-illnesses/reading/",
        "text": "",
        "created_utc": 1678645083,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will a family member’s criminal history (sibling) affect my ability to work in government after law school?",
        "author": "Turbulent_Offer9462",
        "url": "https://www.reddit.com/r/LawSchool/comments/11pkjew/will_a_family_members_criminal_history_sibling/",
        "text": "This may be a silly question, but I am curious.",
        "created_utc": 1678642769,
        "upvote_ratio": 1.0
    },
    {
        "title": "Masters degree in Law",
        "author": "kaaangarooo",
        "url": "https://www.reddit.com/r/LawSchool/comments/11pjp5g/masters_degree_in_law/",
        "text": "Being an Indian law graduate, is it worth doing a masters from UK/USA in order to try and get a job there or is it a waste?",
        "created_utc": 1678640799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally took medical leave (2L)",
        "author": "befermy",
        "url": "https://www.reddit.com/r/LawSchool/comments/11pix1m/finally_took_medical_leave_2l/",
        "text": "Here to say don’t feel forced into rushing though law school. For you and your grades. \n\nI was super upset at first for needing this. I felt really behind all of my classmates, but it’s honestly been the best choice I’ve made. The burnout and my mental health, that I wasn’t addressing, was plummeting my gpa. I spoke with the Dean and they told me to restart this summer. I’m feeling much better and it’s my second week off. Even starting to feel the push I felt when I first entered school (when I was all doe-eyed, pre- the 1L hazing). Maybe I’ll finish up my resume and start looking at fall and winter internships. \n\nIf anyone want to just talk or rant about their burnout or loss of passion or whatever negativity their feeling as a result of law school, feel free to talk with me. I definitely get it, to an extent based on my personal experience. :)",
        "created_utc": 1678639001,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Way to Outline For Ethics Class?",
        "author": "FormerJackfruit2099",
        "url": "https://www.reddit.com/r/LawSchool/comments/11pi967/best_way_to_outline_for_ethics_class/",
        "text": "A little lost on what I should focus on putting in an outline for a law school MPRE prep course. Any recs on what has worked well or a sample outline would be much appreciated. Looks like most of our testing will involve a hypo where we are issue-spotting, explaining what you're average silly lawyer should do in a pickle. \n\nThanks!",
        "created_utc": 1678637424,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wow just when I thought the legal field wasn't affected 😳 🤦🏽‍♀️",
        "author": "Brebre234",
        "url": "https://i.redd.it/zo301n6ohdna1.png",
        "text": "",
        "created_utc": 1678637011,
        "upvote_ratio": 1.0
    },
    {
        "title": "loans for bad credit in usa",
        "author": "Bubbly-Pea5631",
        "url": "https://newsphilosopher.topshetkari.com/2023/03/loans-for-bad-credit-in-usa.html",
        "text": "",
        "created_utc": 1678636983,
        "upvote_ratio": 1.0
    },
    {
        "title": "bcbs in usa",
        "author": "Bubbly-Pea5631",
        "url": "https://newsphilosopher.topshetkari.com/2023/03/bcbs-in-usa.html",
        "text": "",
        "created_utc": 1678636493,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Scalia’ Review: The Supreme Court’s Constitutional Caretaker. In the first volume of his biography, Antonin Scalia, the son of an immigrant, ascends to the heights of the legal profession.",
        "author": "Obi-Cat",
        "url": "https://www.wsj.com/articles/scalia-review-constitutional-caretaker-e710c6c9?mod=article_inline",
        "text": "",
        "created_utc": 1678635916,
        "upvote_ratio": 1.0
    },
    {
        "title": "mogo stock in usa",
        "author": "Bubbly-Pea5631",
        "url": "https://newsphilosopher.topshetkari.com/2023/03/mogo-stock-in-usa.html",
        "text": "",
        "created_utc": 1678634615,
        "upvote_ratio": 1.0
    },
    {
        "title": "solicitor in usa",
        "author": "Bubbly-Pea5631",
        "url": "https://newsphilosopher.topshetkari.com/2023/03/solicitor-in-usa.html",
        "text": "",
        "created_utc": 1678632988,
        "upvote_ratio": 1.0
    },
    {
        "title": "Foss v Harbottle",
        "author": "KobuinUg",
        "url": "https://www.reddit.com/r/LawSchool/comments/11p85n7/foss_v_harbottle/",
        "text": "We should all know the rule in Foss v Harbottle, not be the force without a bottle! Force her bottle off!",
        "created_utc": 1678605009,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does this constitute misconduct?",
        "author": "Sea_Geologist_5123",
        "url": "https://www.reddit.com/r/LawSchool/comments/11p6htq/does_this_constitute_misconduct/",
        "text": "1L. I took my non-law student to the Barrister's Ball. A 3L was in line in front of us. A group of 3L women recognized the 3L already in line. This group then cut us in line. One girl in particular deliberately shoved my girlfriend out of the way. The 3L who was already in line then leaned over to my girlfriend and said, \"Tell your boyfriend he needs to get used to get used to women putting themselves where they don't belong.\"\n\nI am fucking furious. The occurrence was both overtly sexist and overtly disrespectful. (Turns out the 3L was a Princeton undergrad frat bro). My girlfriend didn't tell me what happened until later, and it honestly took a lot of strength for me to refrain from returning to the location and raising a fucking shitstorm. I want consequences for everyone involved. I expect better from my institution and its student body. Should I report the incident to the university?",
        "created_utc": 1678599401,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Peculiar Way Of Dealing With Criminal Prosecution",
        "author": "nikiattseufertt",
        "url": "https://www.chiangraitimes.com/legal/a-peculiar-way-of-dealing-with-criminal-prosecution/",
        "text": "",
        "created_utc": 1678587379,
        "upvote_ratio": 1.0
    },
    {
        "title": "8 Reasons To Never Make A Pain And Suffering Claim Without A Lawyer - World Magazine 2023",
        "author": "madietmdavidsen",
        "url": "https://www.dewassoc.com/never-make-pain-and-suffering-claim-without-lawyer/",
        "text": "",
        "created_utc": 1678587303,
        "upvote_ratio": 1.0
    },
    {
        "title": "About 2 Graduate: Possible to be a lawyer and be creative?!",
        "author": "sadnisolated",
        "url": "https://www.reddit.com/r/LawSchool/comments/11p2at5/about_2_graduate_possible_to_be_a_lawyer_and_be/",
        "text": "Im about to graduate law school. The burnout has been REAL. Once an excited and passionate girly, I barely recognize myself anymore. As graduation approaches, I'm starting to seriously worry about this path I have chosen and dare I say......I'm approaching the island of regret.....lol\n\nI am a logical person that really does enjoy the law and I am passionate about this world that I have entered. I want to make that clear before I get some bully saying \"wHY diD u EvEn gO tO LaW ScHoOL\" or something like that. That said, I'm also someone who does not feel whole without consuming/surrounding myself with art, comedy, pop culture, music, film, shows, fashion, etc. I spent my younger college days dreaming of a career in fashion/tv etc. but shrugging that off because who hasn't dreamt of that!? Plus, I did not think that was attainable or feasible, nor did I feel talented enough for that to be a sustainable, secure option for me. \n\nNow, with law school graduation around the corner, I just worry that it all ends here (as in, my life). I keep entering this dark place where I am flooded with concern/anxiety about the fact that I'm going to have this grey blob of a life while those that were braver, smarter, hotter, and more talented enough show off their creative projects etc. I know I am simplifying and romanticizing a whole field that also involves tireless work BUT idk - I just want to know if it is possible to get through this feeling. I am so filled with anxiety and sadness and hopelessness over all of this that I can't even focus on what's left of law school. I also can't picture myself being able to dive in deep and rediscover my love for law/being a lawyer. How can I excel and be great and prove myself when I kick off my career if I can't find that love and passion?! \n\nIs there a way to merge all of these things together? To have a career as a lawyer and be surrounded by creativity and art and excitement?! Like, does anyone know a lawyer who is also a comedy writer?! lawl. obviously I am not in a great place - dont be mean to me please :(",
        "created_utc": 1678586966,
        "upvote_ratio": 1.0
    },
    {
        "title": "In-house position summer 2L questions",
        "author": "Environmental-Emu911",
        "url": "https://www.reddit.com/r/LawSchool/comments/11p1nhs/inhouse_position_summer_2l_questions/",
        "text": "So, I struck during the OCI and have been interviewing ever since. After multiple refusals  and interviews, I finally got an offer for an in-house summer position for one of the largest insurance companies (work is on the corporate/commercial side (some mediation, litigation and interpretation of the language and drafting). I was given a week to decide. The pay is better than some of the pay that small/boutique law firms offer. However, few weeks after the whole process (background check etc) was finalized, I started to get interviews, one of which was for a midsized firm but an SA position with good pay ( I received the email after a month from the day of my application). Granted, I notified them that I cannot interview. Ever since that happened, I kept thinking if I made too quick decision in accepting. My fear took over that I may be left without a job given that we were entering March and I still did not have a job. I also was confident that I would like my internship because it offered great perks and good potential prospect after graduation but now I am thinking that I may have made a mistake. I am also worried for what will happen upon graduation next year. I currently stand on 3.54 GPA and hoping of getting better next semester/year.\n\nI would really appreciate some thoughtful advice from anyone that has decided to do in-house as 2L and did not regret it either because they were offered permanent position upon graduation or were able to find a law firm that liked their 2L experience there.\nIf anyone has worked for insurance company in-house that will be also appreciated.",
        "created_utc": 1678585140,
        "upvote_ratio": 1.0
    },
    {
        "title": "Barbri Mini-MBA",
        "author": "angie3-141592",
        "url": "https://www.reddit.com/r/LawSchool/comments/11p13rx/barbri_minimba/",
        "text": "So many questions here.  Because I got the 10-month Barbri plan, I am getting quite a few unexpected freebies from them including: Adaptibar, Critical Pass, NY Bar membership fees paid for 2 years and access to the Mini-MBA.  \n\nHas anyone used the Mini MBA?  Why do they even offer it?  I had a quick look through it.  I'm not sure how or if it will ever come in handy.  Has anyone been through the entire course? Mini-MBA course?",
        "created_utc": 1678583595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone be a defendant and a plaintiff at the same time in two separate cases?",
        "author": "Fun_Map_5420",
        "url": "https://www.reddit.com/r/LawSchool/comments/11p0erc/can_someone_be_a_defendant_and_a_plaintiff_at_the/",
        "text": "As the title states, is it possible for someone to say, kill someone and be up for murder as a defendant, but at the same time, take someone else to court for a completely different reason? (For example, their mother had physically abused them) Can this happen, and if so, would the cases be tried at the same time? (but separately of course, as they are separate cases) \n\nSo, to be clear - person A is being taken to court as a defendant and they’re up for trial for murder, and at the same time, person A who’s up for trial for murder takes their mother to court in a separate case, where their mother is now the defendant. These are just random examples, but I hope my wording makes sense. I really can’t seem to find an answer to this.",
        "created_utc": 1678581743,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lawschool has really female energy/vibe?",
        "author": "viviennewoods",
        "url": "https://www.reddit.com/r/LawSchool/comments/11p0ac5/lawschool_has_really_female_energyvibe/",
        "text": "First off, I had no clue lawschool had more women than men for some reason every single one of my poli sci class in undergrad had visibly less women than guys so I just assumed that would be the case. And maybe its just my school but does anyone else find the vibe just REALLY draining??? Like the cliqueyness, gossip, pickmes, fighting over the dearth of male classmates like theyre the prize when theyre obviously not if I knew it was going to be like nursing or art school I honestly dont think I wouldve come here. My sister did CS and went straight into the work force and she has always said how much she loves being the only girl in the room from undergrad to work and she never has to work with women and Im starting to see why and wish I had chosen a more male dominated field.",
        "created_utc": 1678581422,
        "upvote_ratio": 1.0
    },
    {
        "title": "Criminal Law Bar Prep: Multiple Choice",
        "author": "generalgaochicken",
        "url": "https://www.reddit.com/r/LawSchool/comments/11p00m7/criminal_law_bar_prep_multiple_choice/",
        "text": "Hi! Does anyone know a really good resource for Crim Law Bar multiple choice? I don't need the rest of the subjects (for now), I just need to practice specifically on the MCQs for Crim Law. If they're from real bar questions and have explanations, it'd be better. Thank you!",
        "created_utc": 1678580723,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bluebook Question",
        "author": "Floopy4512",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ozxen/bluebook_question/",
        "text": "[removed]",
        "created_utc": 1678580488,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who was the craziest person you ever met in Law School",
        "author": "StupidSexyLawyer",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ozurm/who_was_the_craziest_person_you_ever_met_in_law/",
        "text": "",
        "created_utc": 1678580301,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone know when Themis bar prep opens in California?",
        "author": "laney_luck",
        "url": "https://www.reddit.com/r/LawSchool/comments/11oxrso/anyone_know_when_themis_bar_prep_opens_in/",
        "text": "",
        "created_utc": 1678575230,
        "upvote_ratio": 1.0
    },
    {
        "title": "Canada JD+US TAX LLM？",
        "author": "Spiritual-End-5355",
        "url": "https://www.reddit.com/r/LawSchool/comments/11oxax0/canada_jdus_tax_llm/",
        "text": "I have an engineering degree（5 years of work experience）\n \n…of my background, I am interested in tax law and intellectual property.\n\nThis led me to the idea of going to law school！\n\nBut US law school is really expensive, so I would like to finish my JD in Canada and then go to TAX LLM in the US（wages are really high）\n\nDo you have any suggestions?",
        "created_utc": 1678574100,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal to have hit over 200+ apps for 1L jobs and no offers still in mid March?",
        "author": "Any_Summer_9415",
        "url": "https://www.reddit.com/r/LawSchool/comments/11owpd1/is_it_normal_to_have_hit_over_200_apps_for_1l/",
        "text": "At a T30, middle of the pack, and significant law firm WE. What’s going on?",
        "created_utc": 1678572647,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dropped Out After First Semester in 2015. Looking to Return",
        "author": "hellsgateboi",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ow4ja/dropped_out_after_first_semester_in_2015_looking/",
        "text": "I dropped out due to family issues back in 2015 and had to put my education on hold until recently.\n\nAm I able to return to law school? I been googling a lot and a couple forums say that I probably have to retake the LSAT and reapply again.\n\nThanks.",
        "created_utc": 1678571253,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does FedSoc really give you a boost for clerkships?",
        "author": "periwinklejellyfish",
        "url": "https://www.reddit.com/r/LawSchool/comments/11ovy5t/does_fedsoc_really_give_you_a_boost_for_clerkships/",
        "text": "I always hear that it’s easier to get a clerkship if you’re in FedSoc, is that actually true though? What if the judge is a Democrat?",
        "created_utc": 1678570818,
        "upvote_ratio": 1.0
    }
]