[
    {
        "title": "Civ Pro Outline Request- Myles Lynk",
        "author": "SurpriseFull9580",
        "url": "https://www.reddit.com/r/LawSchool/comments/102nkj0/civ_pro_outline_request_myles_lynk/",
        "text": "Have Myles Lynk as a visiting(?) professor for civ pro this year. I believe he was previously at ASU, anyone have an old outline they would be willing to share? \n\nMy goal is to use the outline as a starting point for my own.",
        "created_utc": 1672789547,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tax LLM worth it?",
        "author": "harisbgin",
        "url": "https://www.reddit.com/r/LawSchool/comments/102n5oq/tax_llm_worth_it/",
        "text": "I mentioned to my employer that i’d be interested in a tax llm and they offered to pay half the cost while i take classes part time. So, it’s like 10k out-of-pocket for me (in state at Temple). i like tax, but i mostly do m&amp;a - tax is a relatively small part. will it increase my marketability/value down the line? should i do it?",
        "created_utc": 1672788557,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help from fellow law students on this...",
        "author": "strwbrry7",
        "url": "https://www.reddit.com/r/LawSchool/comments/102n1p4/help_from_fellow_law_students_on_this/",
        "text": "",
        "created_utc": 1672788291,
        "upvote_ratio": 1.0
    },
    {
        "title": "Investment Management Practice",
        "author": "JimThomeHitsDingers",
        "url": "https://www.reddit.com/r/LawSchool/comments/102n0lq/investment_management_practice/",
        "text": "Hi all- I took an investment management class last semester and really enjoyed it. We learned about the  Investment company act of 1940 and the 1933 act. The class dealt with regulatory concerns and compliance.\n\nWas wondering if anyone has experience in these areas and if they have insight or recommendations  on how to break into this practice area?",
        "created_utc": 1672788215,
        "upvote_ratio": 1.0
    },
    {
        "title": "what am I supposed to do for 1L summer?",
        "author": "witzj18",
        "url": "https://www.reddit.com/r/LawSchool/comments/102mftx/what_am_i_supposed_to_do_for_1l_summer/",
        "text": " What are typical summer jobs for students after finishing their 1L year?",
        "created_utc": 1672786833,
        "upvote_ratio": 1.0
    },
    {
        "title": "Full ride scholarship at New England School of Law vs. $$$ merit scholarship at Syracuse Law?",
        "author": "Ordinary_Quail_1208",
        "url": "https://www.reddit.com/r/LawSchool/comments/102mc6w/full_ride_scholarship_at_new_england_school_of/",
        "text": "",
        "created_utc": 1672786617,
        "upvote_ratio": 1.0
    },
    {
        "title": "To study paralegal certificate or to not?",
        "author": "CielDec",
        "url": "https://www.reddit.com/r/LawSchool/comments/102m5od/to_study_paralegal_certificate_or_to_not/",
        "text": "I'm considering applying to law school in the future and I'm trying to gain some experience in the field and build up my application. As of now, my background is as follows: B.A. in Creative Writing and Languages (English, Spanish, Portuguese and German) and work experience as a data analyst for an insurance company. \n\nTo try and gain experience in the field, I'm considering applying to some local paralegal certificates offered by some reputable universities in my area. The thing is, no matter which one I choose, all of these certificates are very centered around state laws and procedures which may not apply in the future since I plan on studying out-of-state for a J.D. program. Also, these programs aren't accredited by ABA, if that truly matters.\n\nWith this said, should I go for these paralegal certificates? Are there particular classes I should be searching for or any additional aspects I need to consider when choosing a certificate? Any advice or feedback would be greatly appreciated.",
        "created_utc": 1672786197,
        "upvote_ratio": 1.0
    },
    {
        "title": "grades",
        "author": "km131248",
        "url": "https://www.reddit.com/r/LawSchool/comments/102ljpn/grades/",
        "text": "curve is 3.0-3.1, my gpa was a 3.2. B’s in everything and an A in legal writing. should i be satisfied?",
        "created_utc": 1672784770,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to understand laws (mainly US codes)",
        "author": "SUSAMRIID",
        "url": "https://www.reddit.com/r/LawSchool/comments/102lh7o/how_to_understand_laws_mainly_us_codes/",
        "text": "How do I understand law codes and changes made to federal codes from laws. Im not a law student and I have no background. Im just wondering if there is a site or resource which will show me what the law was before and after a law went into effect.",
        "created_utc": 1672784610,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L Winter Reception",
        "author": "pkstennis",
        "url": "https://www.reddit.com/r/LawSchool/comments/102ldnd/1l_winter_reception/",
        "text": "On behalf of my 1L Mentee (male)\n\n“I’m going to a winter reception tomorrow night, but just realized it’s at a bbq restaurant. I’m assuming I could wear a suit but it sounds a little out of place. Do you think a quarter zip nice pants and a collared shirt would be fine?” \n\nI never went to one of the receptions so I was wondering if anyone had any advice I could pass over to him. Thank you all!",
        "created_utc": 1672784388,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for judgment from the ECHR where a tax authority sold a taxpayers house because they had a debt of less than a 1,000 euros and it was a violation of article 1 First Protocol of the ECHR",
        "author": "knopsi",
        "url": "https://www.reddit.com/r/LawSchool/comments/102kv1r/looking_for_judgment_from_the_echr_where_a_tax/",
        "text": "I heard about this case a few years ago and was wondering what the exact details were but I can't seem to find it. I think it was about 850 euros to be precise and set in Scandinavia. Thanks in advance.",
        "created_utc": 1672783233,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do prosecutors work with detectives on serial killer cases?",
        "author": "iriaasteria",
        "url": "https://www.reddit.com/r/LawSchool/comments/102kju2/do_prosecutors_work_with_detectives_on_serial/",
        "text": "[removed]",
        "created_utc": 1672782538,
        "upvote_ratio": 1.0
    },
    {
        "title": "Road to In House- Counsel",
        "author": "No-Professional-5633",
        "url": "https://www.reddit.com/r/LawSchool/comments/102jvbt/road_to_in_house_counsel/",
        "text": "Hello everyone, \n\nI am currently a 0L still deciding on what school looking for some insight. \n\nMy dream job would be to be a corporate in-house lawyer/general counsel (ex. amazon, Paramount Global, ABC, etc.) or working for a consulting firm (KPMG, Deloitte, RSM, etc.). \n\nAny tips or advice on the best route to get into roles like those?",
        "created_utc": 1672780974,
        "upvote_ratio": 1.0
    },
    {
        "title": "All B’s… good or bad?",
        "author": "TheGreyVicinity",
        "url": "https://www.reddit.com/r/LawSchool/comments/102jm73/all_bs_good_or_bad/",
        "text": "not sure how to feel right now??",
        "created_utc": 1672780403,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you tailor your cover letter to each firm to increase your chances of getting selected for an interview?",
        "author": "roomlightdesklamp",
        "url": "https://www.reddit.com/r/LawSchool/comments/102izgt/how_do_you_tailor_your_cover_letter_to_each_firm/",
        "text": "",
        "created_utc": 1672778956,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the LSAT taken at home?",
        "author": "ExcellentFault6862",
        "url": "https://www.reddit.com/r/LawSchool/comments/102iq01/is_the_lsat_taken_at_home/",
        "text": "",
        "created_utc": 1672778325,
        "upvote_ratio": 1.0
    },
    {
        "title": "is partnership tax going to ruin my life?",
        "author": "fractaltide",
        "url": "https://www.reddit.com/r/LawSchool/comments/102igot/is_partnership_tax_going_to_ruin_my_life/",
        "text": "2nd semester 3L w a job lined up at a corp &amp; securities firm. ppl there have recommended that I take tax classes beyond fed income, incl partnership. i liked and did really well in FIT, but i've heard PT is particularly challenging and most ppl who take it do so bc they are planning on joining a tax group (I'm not, but it seems having a working knowledge of PT would be helpful for my practice area). the other option would be admin law, which sounds good to know as general background and would perhaps be a bit easier. is it worth taking PT given my firm's recommendations v. how hard it's prob going to be?",
        "created_utc": 1672777701,
        "upvote_ratio": 1.0
    },
    {
        "title": "anyone else apply to 1L Summer Firm positions? Have any started moving/interviewing?",
        "author": "howisyourdaybro",
        "url": "https://www.reddit.com/r/LawSchool/comments/102h8ry/anyone_else_apply_to_1l_summer_firm_positions/",
        "text": "anyone else apply to 1L Summer Firm positions? Have any started moving/interviewing?",
        "created_utc": 1672774783,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L Job Cover Letters",
        "author": "LegalBing",
        "url": "https://www.reddit.com/r/LawSchool/comments/102h5v3/1l_job_cover_letters/",
        "text": "Do most people change much in their cover letters aside from the employer when they are applying places? Like do you have a template for BigLaw, PI, and Judicial internships then just fill in the blank and send them out by the masses? I just feel it’s hard to be specific with most of these apps because I don’t really know what I want to do/haven’t experienced enough yet.",
        "created_utc": 1672774588,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone here looking to get in shape for the new year?",
        "author": "movin4call",
        "url": "https://www.reddit.com/r/LawSchool/comments/102g7hj/anyone_here_looking_to_get_in_shape_for_the_new/",
        "text": "I let myself go my first semester as a 1L. Added about 10 pounds between thanksgiving to now.\n\nBought an Apple Watch to force me to workout. Going to try to get in shape this semester.\n\nAnyone else also? Lol",
        "created_utc": 1672772337,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone ever applied to law school in late April and actually get in?",
        "author": "ExcellentFault6862",
        "url": "https://www.reddit.com/r/LawSchool/comments/102fmcj/has_anyone_ever_applied_to_law_school_in_late/",
        "text": "",
        "created_utc": 1672770959,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommended classes to take as a 2L?",
        "author": "valley_made303",
        "url": "https://www.reddit.com/r/LawSchool/comments/102fh2j/recommended_classes_to_take_as_a_2l/",
        "text": "Trying to finalize my spring schedule and conflicted on whether I should take Fed Income or Bankruptcy. I'm mildly interested in both subject areas, but I'm curious as to what others think regarding their respective difficulties or future value in a career as a general transactional attorney.\n\nAnd what are other classes offered at most schools that people would recommend taking before graduating law school. Obviously very specific as to each person but curious to hear some suggestions.",
        "created_utc": 1672770619,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you are/were a 1L applying to SA positions, how many did you apply to?",
        "author": "keret35",
        "url": "https://www.reddit.com/r/LawSchool/comments/102f8xo/if_you_arewere_a_1l_applying_to_sa_positions_how/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/102f8xo)",
        "created_utc": 1672770101,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to say in a 1L SA callback when you never networked with the firm",
        "author": "Mindless-Agent803",
        "url": "https://www.reddit.com/r/LawSchool/comments/102f76q/what_to_say_in_a_1l_sa_callback_when_you_never/",
        "text": "Very luckily, I got invited to a callback with a firm for a 1L SA position.  I've never networked with or attended any event related to the firm and honestly don't know much about it.  I applied simply bc I knew the firm's name from somewhere and googled whether it offered 1L SA opportunity out of curiosity.  If I get asked why I'm interested in the firm in the callback, what should I say besides what I could read from online (google, firm website, reddit)?\n\nThank you!",
        "created_utc": 1672769996,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions you wish you would’ve asked in summer job interviews?",
        "author": "DriftingGator",
        "url": "https://www.reddit.com/r/LawSchool/comments/102f158/questions_you_wish_you_wouldve_asked_in_summer/",
        "text": "Got a callback or two in the coming days and I’ve got most of my generic questions (why this firm, what do you like/dislike, etc.) but I’m wondering if anyone has any questions someone might not think of ahead of time.",
        "created_utc": 1672769607,
        "upvote_ratio": 1.0
    },
    {
        "title": "second semester 1L",
        "author": "abbeyxmae",
        "url": "https://www.reddit.com/r/LawSchool/comments/102exdr/second_semester_1l/",
        "text": "I start my second semester of law school in about a week. I’ve had all my grades back for a bit and they weren’t great but they weren’t terrible (B’s and C’s). I definitely feel like I started slacking after midterms (winter is hard and I fell into old coping techniques). I’m wanting to start up this semester strong and pull up my GPA a bit more. Any tips on things I can do prior to classes to help set that tone for the semester that may help keep me from drowning?",
        "created_utc": 1672769379,
        "upvote_ratio": 1.0
    },
    {
        "title": "SD BL",
        "author": "LetterheadBeginning1",
        "url": "https://www.reddit.com/r/LawSchool/comments/102e9f4/sd_bl/",
        "text": "I expect I will have great options this cycle and would like to work in SD BL post-grad. Would I want to go to a school like UCLA/USC, more regional? Or a t6+? Not sure, given how niche the SD market is, I'd love some insight!",
        "created_utc": 1672767853,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me seeing my ConLaw final grade",
        "author": "replicant4522",
        "url": "https://v.redd.it/n43nya2uow9a1",
        "text": "",
        "created_utc": 1672767593,
        "upvote_ratio": 1.0
    },
    {
        "title": "You ever notice a typo on ur apps after they're sent",
        "author": "NoCommonSense_98",
        "url": "https://www.reddit.com/r/LawSchool/comments/102dqpp/you_ever_notice_a_typo_on_ur_apps_after_theyre/",
        "text": "RIP 2 me",
        "created_utc": 1672766606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asked ChatGPT to \"write an essay about the risks of the legal field not adapting to new technologies, specifically AI and include a catchy title.\" The following is its response:",
        "author": "insert-name94832",
        "url": "https://www.reddit.com/r/LawSchool/comments/102djmg/asked_chatgpt_to_write_an_essay_about_the_risks/",
        "text": "[removed]",
        "created_utc": 1672766136,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L SA callback to offer rate?",
        "author": "PM_me_ur_digressions",
        "url": "https://www.reddit.com/r/LawSchool/comments/102d7ua/1l_sa_callback_to_offer_rate/",
        "text": "Title. Anyone got any data on conversion rates for 1L SA callbacks?",
        "created_utc": 1672765339,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions about GPA",
        "author": "Weary_Somewhere_1487",
        "url": "https://www.reddit.com/r/LawSchool/comments/102cz9q/questions_about_gpa/",
        "text": "So for some context: the school I attend curves to a 3.3. It is not T-14 but is T-30 (think Emory, Georgia, Iowa).\n\nAfter my 1L fall semester I’ve gotten what I believe are decent grades. So far A in Legal Writing, A- in contracts, and B+ in prop. Still waiting on torts. This brings my gpa to a 3.64. \n\nIn regard to 1L summer opps, what is on the table? Is it worth applying to 1L SA regular or diversity positions (I’m white but lgbtq)? Also, on the fairly large  assumption I maintain this throughout, is BL/fed clerk on the table? I just don’t know where I stand.",
        "created_utc": 1672764788,
        "upvote_ratio": 1.0
    },
    {
        "title": "THE ESSAY BELOW WAS NOT WRITTEN BY A HUMAN! I asked ChatGPT to \"write an essay about the risks of the legal field not adapting to new technologies, specifically AI and include a catchy title.\" The following is its response:",
        "author": "insert-name94832",
        "url": "https://www.reddit.com/r/LawSchool/comments/102cvdu/the_essay_below_was_not_written_by_a_human_i/",
        "text": "[removed]",
        "created_utc": 1672764529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bar Application Question",
        "author": "law-throwy",
        "url": "https://www.reddit.com/r/LawSchool/comments/102cpza/bar_application_question/",
        "text": "[removed]",
        "created_utc": 1672764168,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to approach paper or assignment-based class and get good grades?",
        "author": "Any_Strawberry_131",
        "url": "https://www.reddit.com/r/LawSchool/comments/102cn3t/how_to_approach_paper_or_assignmentbased_class/",
        "text": "I'm going to take two paper/assignment-based classes next semester. The study strategies of taking doctrinal classes (doing practice exams, typing speed, etc.) seem not apply to paper/assignment-based classes. How should I study for those classes? What types of students will get good grades?\n\nThank you so much for your help.",
        "created_utc": 1672763975,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some thoughts on doing well, yet hating law school",
        "author": "Greedy_Professor_439",
        "url": "https://www.reddit.com/r/LawSchool/comments/102cdc5/some_thoughts_on_doing_well_yet_hating_law_school/",
        "text": "I see a lot of posts here about people trying to do better in school and very good supportive comments motivating others. Just wanted to share my two cents about succeeding but hating law school. Anyone else feel this way? Am I really that out of touch? Am I ungrateful? Should I just suck it up? \n\nI’m a 2L that’s half-way done. I’m first generation. I have a big law Summer Associateship lined up. High GPA. On Law Review, doing Moot Court. Taking substantial courses and doing well. On a very good scholarship, so no loans. Obviously thankful. \n\nBut I hate law school — like, I’m miserable — and I’m afraid that will translate to hating working as an attorney.\n\nI don’t enjoy the competitive nature of law school, the grief of exams, the way professors and text books hide the ball.\n\nI worked for a judge 1L summer and really enjoyed that but it was very stressful. It was rewarding but also felt very solitary. \n\nI’ve made a couple more mature friends, but found a vast majority of people (not just KJDs) to be very immature/in a clique at my school.\n\nAny type of litigation would likely burn me out. Thinking I’ll like regulatory/compliance and transactional more. \n\nBut I’m just not happy in law school. I’ve wanted to drop out every single semester.\n\nDoes it get better after school? If I’m doing well should I just finish? Should I save my time and quit now? Should I just take easy classes, get the JD, skip the bar, and find some other job?",
        "created_utc": 1672763315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book Recommendations",
        "author": "Additional-Pay-3886",
        "url": "https://www.reddit.com/r/LawSchool/comments/102cbk5/book_recommendations/",
        "text": "Hi all! Happy New Year. I anticipate starting law school this fall and as I wait for decisions, I’d like to start reading books that can prepare me in any capacity for law school. Any recommendations? \n\nThank you.",
        "created_utc": 1672763187,
        "upvote_ratio": 1.0
    },
    {
        "title": "Character and Fitness Mistake",
        "author": "Left_Razzmatazz5441",
        "url": "https://www.reddit.com/r/LawSchool/comments/102blsl/character_and_fitness_mistake/",
        "text": "[removed]",
        "created_utc": 1672761459,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do what the recruiters think of you even matter after you receive an interview invite?",
        "author": "yeahowdy",
        "url": "https://www.reddit.com/r/LawSchool/comments/102bhs6/do_what_the_recruiters_think_of_you_even_matter/",
        "text": "",
        "created_utc": 1672761173,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m about to graduate and do not wanna be a lawyer anymore…",
        "author": "InternationalTone598",
        "url": "https://www.reddit.com/r/LawSchool/comments/102bayv/im_about_to_graduate_and_do_not_wanna_be_a_lawyer/",
        "text": "I’m about to start my last semester of law school. It’s been a great journey in all honesty. I’ve made great friends, learned a tremendous amount, cultivated valuable skills and I did it all with absolutely no debt (90% scholly ). \n\nHowever, the brutal truth is that I did it mostly for my parents and partly for me. They really wanted me to be a lawyer my whole life. Tbh I enjoy many aspects of the law. I’m even good at it and I’m the captain of my trial team. But as I’m starting my last semester idk if I’m burnt out or just slightly depressed but I don’t want to lead a 40 year career of constant stress, pressure, and long hours of work. \n\nFor context I own a couple businesses that do well and I very much enjoy the business side of life. Part of me wants to take a year off after passing the bar and figure out my life. Am I crazy ? Am I being a little wimp ? \n\nAll I know is, life shouldn’t be 60 hour work weeks and constant stress. But that’s what a law career sounds like at this point ? \n\nWho can relate",
        "created_utc": 1672760689,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have to retake a research exam",
        "author": "raspberrysparkles11",
        "url": "https://www.reddit.com/r/LawSchool/comments/102azkb/have_to_retake_a_research_exam/",
        "text": "I have to retake a research exam next week in January when the winter module starts before classes. I would like to meet with the professor one more time before then, possibly Friday. Would it be ok to email her today and see if she can meet or are professors on break still?",
        "created_utc": 1672759885,
        "upvote_ratio": 1.0
    },
    {
        "title": "Summer before 1L year",
        "author": "CallsignLightning418",
        "url": "https://www.reddit.com/r/LawSchool/comments/102anwj/summer_before_1l_year/",
        "text": "I’m graduating undergrad this semester and starting law school in the fall. I’m trying to figure out what to do this summer.\n\nFrom my own googling and what I’ve heard from some people is that the main goal the summer before starting is to not get burnt out. They said either aim for an easy job (unrelated to law) or, ideally, don’t work at all.\n\nThat’s great for people that can do that, but I need to pay rent and living expenses and don’t have anyone helping me to do so. I need some sort of paying job.\n\nFrom what I’ve seen, most legal internships are unpaid. Would you suggest doing something legal (likely unpaid, thus needing another paid job) or just getting a random paid job to get me through the summer? \n\nAny advice and tips are welcome. Thank you :)",
        "created_utc": 1672759040,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is higher base salary or total compensation more lucrative/important? (in-house role)",
        "author": "Leather_Room8646",
        "url": "https://www.reddit.com/r/LawSchool/comments/102a5dv/is_higher_base_salary_or_total_compensation_more/",
        "text": "Total compensation includes RSU and bonus.",
        "created_utc": 1672757693,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to navigate the NYC 3L job market?",
        "author": "kstew4eva",
        "url": "https://www.reddit.com/r/LawSchool/comments/102a0r5/how_to_navigate_the_nyc_3l_job_market/",
        "text": "I'm a 3L at a T-50 in CA and currently have an offer from the LA office of a national litigation firm that has ~300 attorneys. It's a good offer that I'm pleased with and would have no problem accepting, but recently I've gotten tired of LA and would prefer to be in NYC if possible. My resume doesn't show any ties to NYC, but I do have a family member that lives there, and I've always wanted to live in the city for at least a couple years.\n\nDoes anyone have any tips or advice for navigating the 3L NYC job market? Is it realistic to think I could get BL (or at least well-paid midlaw) as a 3L or post-grad, or should I just wait to lateral after 1-2 years? For reference purposes I'm in the top third of my class and on law review with a published article.",
        "created_utc": 1672757349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't work if you don't have to!",
        "author": "Ideal_Chaos_Theory",
        "url": "https://www.reddit.com/r/LawSchool/comments/1029abk/dont_work_if_you_dont_have_to/",
        "text": "For me, I would actually be indignant at this kind of post because I have to work. My student loan refunds aren't enough to survive on. Even with my job I'm still struggling, but staying afloat. Nevertheless, I still feel like I should warn 1L students. Don't take a part-time job unless you absolutely have to!\n\nMy job has completely ruined my law school experience. I can't study as much. Forget always going to office hours or taking practice tests. My job sometimes has to take priority because it deals with real clients and lives. The stress level is insane. There are only so many hours in the day. I always feel torn between law school and my work files. Neither of the hours I have to contribute to both are enough and they both suffer. I perform better at work than at school because again, these are real clients and I can't just skip out on the work. Unfortunately, having to decide between doing the reading and working on a motion is a common choice I have to make.\n\nAm I getting valuable experience? Yes. Am I getting the grades that will enable me to actually get a decent job post-graduation and use my experience? Hell no. I'm genuinely scared about my future. And yet, I'm stuck in a Catch-22 because I can't survive without the job.\n\nSo, when you get a shiny, tempting offer from a law firm for a job during the school year...don't take it unless one of two conditions exists: 1) You need it to survive; or 2) You are the type of student who doesn't need to study as much as others to succeed. Otherwise, just say no. Take the traditional internships during break, don't work during the year, and enjoy your school experience as much as possible.\n\nAs a side note, law schools desperately need to increase their costs of living standards to avoid this situation. Most of us don't live as we did when we were undergrads. We are actual adults with bills and other responsibilities.",
        "created_utc": 1672755326,
        "upvote_ratio": 1.0
    },
    {
        "title": "0L Tuesday Thread",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/LawSchool/comments/1025757/0l_tuesday_thread/",
        "text": " \n\nWelcome to the 0L Tuesday thread. Please ask pre-law questions here (such as admissions, which school to pick, what law school/practice is like etc.)\n\nRead the [FAQ](http://www.reddit.com/r/lawschool/wiki/faq/). Use the search function. Make sure to list as much pertinent information as possible (financial situation, where your family is, what you want to do with a law degree, etc.). If you have questions about jargon, check out the [abbreviations glossary](https://www.reddit.com/r/LawSchool/wiki/abbreviations).\n\nIf you have any pre-law questions, feel free join our [**Discord Server**](https://discord.gg/Qhxy4sF) and ask questions in the 0L channel.\n\n**Related Links:**\n\n* [Official LSAC Admissions Calculator](https://officialguide.lsac.org/release/ugpalsat/ugpalsat.aspx) (self explanatory, presumably sources data from previous admissions cycles, likely larger pool of data too. Useful for non-splitters).\n* [Unofficial LSN Admissions Calculator](http://mylsn.info/) (uses crowdsourced LSN data to calculate % admissions chances).\n* [Law School Numbers](http://www.lawschoolnumbers.com/) (for admissions graphs and crowdsourced admissions data).\n* [LST Score Reports](https://www.lstreports.com/) (for jobs data for individual schools)\n* [List of Guides and Other Useful Content for Rising 1Ls](https://www.reddit.com/r/LawSchool/comments/95mxgz/aggregated_content_for_1ls_from_around_the_forums/)\n* [TLS Biglaw Placement Class of 2016](http://www.top-law-schools.com/forums/viewtopic.php?f=1&amp;t=276222) | [TLS Biglaw Placement Class of 2015](http://top-law-schools.com/forums/viewtopic.php?f=1&amp;t=262376) | [NLJ250 Class of 2010](http://pdfserver.amlaw.com/nlj/goto%20law%20schools_main.pdf) | [NLJ250 Class of 2009](http://pdfserver.amlaw.com/nlj/law%20schools_charts_page12.pdf) | [NLJ250 Class of 2008](http://www.law.com/img/nlj/charts/20090223gotoschools.jpg) | [NLJ250 Class of 2007](http://www.law.com/img/nlj/charts/20080414gotoschools.jpg) | [NLJ250 Class of 2005](http://pdfserver.amlaw.com/nlj/20080414employment_trends.pdf)\n* [/r/LawSchoolAdmissions 2016 Biglaw and Employment Data](https://www.reddit.com/r/lawschooladmissions/comments/643pwm/2016_aba_employment_reports/) (includes 200 law schools)\n* [TLS School Medians Class of 2020](https://docs.google.com/spreadsheets/d/1XfblJqji8wlaCbc9cUTAheOsZPRRaP_hyWafn3NEYQE/edit#gid=299903710).\n\n**Related Subreddits:**\n\n* [r/LawschoolAdmissions](https://www.reddit.com/r/LawschoolAdmissions/)\n* [r/LSAT](https://www.reddit.com/r/LSAT/)",
        "created_utc": 1672743612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nostalgia!✨",
        "author": "ZealousidealBowler14",
        "url": "https://www.reddit.com/r/LawSchool/comments/1023htr/nostalgia/",
        "text": "Hi everyone! My mom just sent me a picture of 7 year old me all dressed up in Lawyer attire for elementary school career day and I’m so emotional right now. It’s the little things like keep me motivated and never give up! I hope I realise this dream in the end!🥹✨",
        "created_utc": 1672737890,
        "upvote_ratio": 1.0
    },
    {
        "title": "How the hell do people pull straight A's in law school?",
        "author": "movin4call",
        "url": "https://www.reddit.com/r/LawSchool/comments/1023bii/how_the_hell_do_people_pull_straight_as_in_law/",
        "text": "Law school brings together some of the smartest, anxious, and ambitious students in the country into a singular space. Most of them are pulling to do well in school.\n\nWith how arbitrary and random law school grading can feel, how the hell do these people pull straight A's?\n\nMan, just impressed and bewildered. \n\nSigned - struggling law student",
        "created_utc": 1672737265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fuck law school.",
        "author": "boringwhitecollar",
        "url": "https://www.reddit.com/r/LawSchool/comments/101z3dt/fuck_law_school/",
        "text": "I’d rather drink a bottle of wine a day, smoke, a pack of cigarettes a day, and talk like a Teamster that have to be a lawyer every day for 50+ years. \n\nSorry not sorry.",
        "created_utc": 1672723097,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having so summer associate offer in hand, what should I do now?",
        "author": "Excellent-Emu-1070",
        "url": "https://www.reddit.com/r/LawSchool/comments/101yds5/having_so_summer_associate_offer_in_hand_what/",
        "text": "My strength is that I have a stellar resume. Every attorney I met or asked for an informational interview genuinely complimented how well achieved it looks. I'm also doing a law review. But my grades are...just awful. Not that I'm failing but certainly not even in the top 30 or 40% (not in T14 or T30 either). Some of the hiring attorneys who looked into my resume and were really polite and approachable to take time out to talk with me (or even tell me that I'm a very strong candidate for summer associate) would shut me off after looking into my transcript. I think I applied nearly every Vault/AmLaw200 firms out there - yet no offer in my hand and it's January now. What should I do now? Feeling very lost.",
        "created_utc": 1672721004,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal to feel like I wasted three years of my life?",
        "author": "TemplarKnightXII",
        "url": "https://www.reddit.com/r/LawSchool/comments/101x67o/is_it_normal_to_feel_like_i_wasted_three_years_of/",
        "text": "I graduated from a bottom tier law school, where I was bottom 10% of my class and had a horrible gpa of 2.5. Even after studying 140+ on Barbri, I still failed the Bar Exam. Now that I have a full time job that makes me less than if I had just not gone to law school at all, with no hope of passing the second time since I don’t have time to study anymore, I feel like I wasted three years of my life and don’t know what to do now.",
        "created_utc": 1672717496,
        "upvote_ratio": 1.0
    },
    {
        "title": "working abroad",
        "author": "dog-enthusiast10",
        "url": "https://www.reddit.com/r/LawSchool/comments/101w8h8/working_abroad/",
        "text": "Hi all! \n\nI am a senior in undergrad right now and will be applying to law school for the fall 2023 semester.\n\nMy question is about living and working abroad post-law school. What are the options? What kinds of jobs are available to US lawyers abroad? Are there firms that operate internationally? If so, is it possible to work abroad with a J.D.? What countries would be best? \n\nI lived in Paris for a semester in undergrad which I loved but I would be open to basically anywhere in Europe (but I do speak French). \n\nI understand that law is a pretty location specific thing, but I was thinking about specializations like international trade and whether there are opportunities for that abroad. Honestly, I’m not 100% sure where to even start with these questions or whether I’m asking the right ones, so if you are a US-educated lawyer working abroad, please weigh in.",
        "created_utc": 1672714864,
        "upvote_ratio": 1.0
    },
    {
        "title": "What area of big law could align with my past experiences?",
        "author": "throwawayobvs33",
        "url": "https://www.reddit.com/r/LawSchool/comments/101vo2g/what_area_of_big_law_could_align_with_my_past/",
        "text": "Ok please don't drag me but as of rn I really have no idea what area of big law I would be interested in, but I'm writing cover letters for positions and they all ask for departmental interests. \n\nI would like to find some area that I can tie into my last job so it makes sense and so I actually have something to write about. I worked as a claims specialist for a home health company, basically making sure home health claims were submitted and paid for by insurance companies to make sure that patients services could resume. I would resolve claim issues and collaborate w the insurance companies to resolve any issues. Healthcare/insurance is a pretty regulated industry so it required a lot of attention to detail and whatnot.\n\nI should point out I'm not too interested in litigation so leaning towards something transactional but open to suggestions regardless. Thank you.",
        "created_utc": 1672713285,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are y'all just applying with whatever you got?",
        "author": "movin4call",
        "url": "https://www.reddit.com/r/LawSchool/comments/101vnrj/are_yall_just_applying_with_whatever_you_got/",
        "text": "Resume is in good shape but my cover letter is not.\n\nBut my career development office is slow to respond and was closed for the holidays.\n\nDo you guys wait for them to review? Or just start applying with what you got?",
        "created_utc": 1672713259,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you write a cover letter???",
        "author": "a20171",
        "url": "https://www.reddit.com/r/LawSchool/comments/101vkj3/how_do_you_write_a_cover_letter/",
        "text": "Struggling SOS. 1L, basically a KJD (no corporate work experience). Do I just play up soft skills?? I also don't have any specific practice area I'm interested in so I feel stuck",
        "created_utc": 1672713014,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to include in a cover letter if you did nothing in college or first semester of law school",
        "author": "PleaseHelpMeREEE",
        "url": "https://www.reddit.com/r/LawSchool/comments/101vja3/what_to_include_in_a_cover_letter_if_you_did/",
        "text": "I never did extracurriculars/clubs in college and went straight to law school afterward. I spent the entirety of this semester focused on getting assignments and outlines done early and devoted 0 time to clubs or other activities. Essentially- I have nothing on my resume... except a paid internship I did the summer after I graduated HS... \n\nAt most, I wrote about my geographic ties to the area. The location I want to practice in doesn't really get a whole lot of new blood, so... I guess that's a step up... But what else, man. I'm even undecided about what kind of law to pursue.",
        "created_utc": 1672712924,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got a B- in the class. I'll take it.",
        "author": "garrettgravley",
        "url": "https://i.redd.it/yg0wibroei6a1.png",
        "text": "",
        "created_utc": 1672712427,
        "upvote_ratio": 1.0
    },
    {
        "title": "CV or Resume",
        "author": "RememberingTortuga33",
        "url": "https://www.reddit.com/r/LawSchool/comments/101v7ac/cv_or_resume/",
        "text": "In my application to Lewis and Clark it asks for a resume to be uploaded. This may be a silly question, but are they asking for my CV or a resume like I would give to an employer? I only ask because of how much I was told I need to make a CV for law school.",
        "created_utc": 1672712010,
        "upvote_ratio": 1.0
    },
    {
        "title": "Financial aid",
        "author": "Sea_Star2016",
        "url": "https://www.reddit.com/r/LawSchool/comments/101v4qp/financial_aid/",
        "text": "I’m curious how smooth (or not) the financial aid process is for other current law students at private schools. I say private schools because I went to a UC in California for undergrad and the financial aid process couldn’t have been smoother. I never had to track down the fin aid office or go in person to find out where my money was. They also processed the funds about a month before classes started so I never worried if they were going to be late, and they were one hundred percent transparent with where each loan went and how much is left over etc. So the fact I even need to interact with fin aid at my law school is a little sus to me. Maybe public law schools operate differently so please share if you have a story! \n\nMy financial aid office never processes anything on time. Some of my friends have had to go in person to get them to disperse their funds so they could pay rent. School starts on Monday and I haven’t received a notice of disbursement (email they send notifying you that in five days he leftover of your loans will be in your account), I assume it will not be processed until next Friday at the earliest. Many of us relying on fin aid have had to contact professors to post readings for the first week because funds had not been sent out, and we couldn’t buy the $300 books yet. Also when we look on our student accounts they do not clearly state where or to what our loans were applied to before giving us the refund.For many semesters I don’t know how much money I’m going to have for the semester until about two weeks in. \n\nCurious to see how your school’s operate, feel free to comment anything related.",
        "created_utc": 1672711821,
        "upvote_ratio": 1.0
    },
    {
        "title": "Note taking that records video",
        "author": "ExtensionOpening2657",
        "url": "https://www.reddit.com/r/LawSchool/comments/101ux4k/note_taking_that_records_video/",
        "text": "Several of my professors encourage us to record the classes if we like. I used one note which lets me record video and take notes at the same time. The video quality sucks. Anybody use anything similar For IPad? I’ve looked and nothing so far. OneNote for IPad doesn’t allow video recording.",
        "created_utc": 1672711261,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why we get bad grades despite working hard",
        "author": "Dr_Raymond2023",
        "url": "https://www.reddit.com/r/LawSchool/comments/101t9vl/why_we_get_bad_grades_despite_working_hard/",
        "text": "[removed]",
        "created_utc": 1672706984,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fellow 1L's, how is everyone's job search coming along?",
        "author": "movin4call",
        "url": "https://www.reddit.com/r/LawSchool/comments/101su5i/fellow_1ls_how_is_everyones_job_search_coming/",
        "text": "",
        "created_utc": 1672705844,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am a JD working at a big4 accounting firm in M&amp;A tax, AMA!",
        "author": "spoookyvision",
        "url": "https://www.reddit.com/r/LawSchool/comments/101s78r/i_am_a_jd_working_at_a_big4_accounting_firm_in_ma/",
        "text": "Happy to answer any questions about my work or jd preferred jobs in general.",
        "created_utc": 1672704264,
        "upvote_ratio": 1.0
    },
    {
        "title": "Filing Bar Application Late",
        "author": "_killa_freak_",
        "url": "https://www.reddit.com/r/LawSchool/comments/101r9b8/filing_bar_application_late/",
        "text": "Are there any consequences to doing this other than having to pay a late fee? Anything I should consider before deciding to file late?",
        "created_utc": 1672701949,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does the court determine who gets full custody",
        "author": "External_Wealth1725",
        "url": "https://www.reddit.com/r/LawSchool/comments/101qs0a/how_does_the_court_determine_who_gets_full_custody/",
        "text": "Let’s say the mom is in her teens and lives with her parents who help her moneywise but she doesn’t have a job.The father works full time and lives by himself .Both want custody.",
        "created_utc": 1672700794,
        "upvote_ratio": 1.0
    },
    {
        "title": "NYU tax llm odds",
        "author": "llmhopeful",
        "url": "https://www.reddit.com/r/LawSchool/comments/101pbf8/nyu_tax_llm_odds/",
        "text": "[removed]",
        "created_utc": 1672697315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Setting yourself up for a judicial clerkship as a 1L?",
        "author": "Admirable_Dig2794",
        "url": "https://www.reddit.com/r/LawSchool/comments/101ni6p/setting_yourself_up_for_a_judicial_clerkship_as_a/",
        "text": "My main question is what kind of working experience might I need to make me a competitive clerk applicant?\n\nI just finished my 1L fall at a T2 school and would love to clerk after graduation. I’m in a smaller state with two T2 schools and two federal districts. I would prefer to go for federal, but I’d be happy if I got state. I’ve only gotten one grade back, but it was the top grade. I also made an A in legal writing.\n\nThat being said, I feel pretty good about being competitive grade-wise, and we have OCIs coming up in a month. Assuming I even get to choose between offers, should I aim for a public service position or private firm? At our school, quite a few students work during the school year as well. I would rather not work during school because I would like to do law review. Plus I have a scholarship to keep.\n\nSide note: if anyone is familiar with Texas, I would love to get a spot there (my home state). However, I’m sure it’s much more competitive and probably preferential toward Texas law school grads. Would I even have a shot?\n\nAny advice is welcome, thanks for your time!",
        "created_utc": 1672693136,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any other sites like Library Genesis that might have my ConLaw Book?",
        "author": "BigbyWolf343",
        "url": "https://www.reddit.com/r/LawSchool/comments/101myxf/any_other_sites_like_library_genesis_that_might/",
        "text": "Hey guys,\n\n&amp;#x200B;\n\nI've done really great at finding all my other books, but I'm struggling to find my ConLaw book for anywhere under $200. I only learned about Library Genesis recently, so now I'm wondering if there are any other similar sites that I haven't heard of where I can check? The book is Massey &amp; Denning, American Constitutional Law (6th Edition). \n\nAny suggestions are greatly appreciated!",
        "created_utc": 1672691882,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best/worst law school facilities?",
        "author": "reprobaddie614",
        "url": "https://www.reddit.com/r/LawSchool/comments/101mubx/bestworst_law_school_facilities/",
        "text": "Inspired by a recent post about the most beautiful law library, I’m curious about opinions on law school facilities in general. Which US law schools have the best and worst facilities (classrooms, libraries, etc.)?\n\nI’m reposting this from r/LSA!",
        "created_utc": 1672691580,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interesting news...",
        "author": "andi2A",
        "url": "https://www.reddit.com/r/LawSchool/comments/101mls4/interesting_news/",
        "text": "U.S. News &amp; World Report to Revamp Parts of Its Law-School Ranking https://www.wsj.com/articles/u-s-news-world-report-to-revamp-parts-of-its-law-school-ranking-11672667620",
        "created_utc": 1672691028,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does socializing matter for law school/ big law offers",
        "author": "jen112299",
        "url": "https://www.reddit.com/r/LawSchool/comments/101mipj/does_socializing_matter_for_law_school_big_law/",
        "text": "Hi, this might be a stupid question, but I really would like to know the answer. I'm an incoming student at T20 law school. I'm trying to figure out what to expect socially from law school. I'm not a social person, I don't really enjoy making friends/ spending time with other people. I usually only hang out with friends once a month. \n\nI have heard and read about all the law schools social events, bar reviews etc., and I'm worried that my lifestyle will be a problem once I'm in law school. How do y'all feel about all the social events in law school? Are they helpful for job search/ academic purposes? What would you say is the minimum time one should spend socializing with peers and legal professionals? Thank you!",
        "created_utc": 1672690831,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to find out when grades will be posted?",
        "author": "harveyspectacular17",
        "url": "https://www.reddit.com/r/LawSchool/comments/101mhzr/how_to_find_out_when_grades_will_be_posted/",
        "text": "My classmate heard it’s after classes start (Jan 17) but wasn’t sure and I can’t find the info anywhere? Even my professor didn’t know",
        "created_utc": 1672690786,
        "upvote_ratio": 1.0
    },
    {
        "title": "class b trespassing *first offense*",
        "author": "Excellent_Youth6969",
        "url": "/r/legaladvice/comments/101lhpp/class_b_trespassing_first_offense/",
        "text": "",
        "created_utc": 1672690582,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions about waiting for exam results and whether what I am feeling is normal",
        "author": "AaronRodgers4thMVP",
        "url": "https://www.reddit.com/r/LawSchool/comments/101mcwz/questions_about_waiting_for_exam_results_and/",
        "text": "Some background -&gt; I am a current 1L at T20 and we receive grades in about a week. During the summer before my 1L year I worked with a very close mentor and family friend who is about to graduate from my same law school w/ a 4.0 and he would craft mini fact patterns and provide rules of law in an effort to teach me how to issue spot, analyze, see the pertinent nuances and argue both sides on these pertinent nuances. Other than this I read everything relating to law school exams I could my hands on before starting law school - GTM, LEEWS, the Delaney series books, the Alex Schimel book as well as others. In starting law school I focused on being two weeks ahead on all of my readings and spending the majority of my time working with practice problems, hypos, outlining, and practice exams. I did very well on my practice exams and midterms (midterms are graded to show us how we did but do not count for anything). With this being said I feel like my exams went well after I took them meaning they felt like the practice exams I took and most everything I saw felt like I had done it before and knew how to handle it at a high level. However, as I have been waiting for these exam grades I have thought about other issues in the fact patterns which I may not have talked about as deeply as I would have liked to OR mistakes I may have made in parts of my analysis. Is this normal? I have tried to keep my mind of the exams by doing other things but my mind just shifts back to these problems. Moreover, there are parts of the exams in which I do not remember whether I brought up a certain point in my analysis and it is just driving me crazy not knowing whether or not I did. So basically I am wondering whether or not it is normal to feel like this and whether or not it is normal to not remember how I responded to certain parts of the exam? I am sure I did fine but my goal is to get a clerkship on a federal circuit court which requires very good grades so all of this waiting is driving me crazy. For example, there was a Personal jurisdiction problem on my civil procedure exam and I do not recall if I properly addressed the \"arises out of\" portion but do remember addressing the \"relates to\" portion, I had pre-written canned answers that my teacher said were really good and used these on this question and these canned answers addressed an \"arises out of\" nuance that was strikingly similar to the one on the exam but like I said I have no memory of and it is driving me crazy. One thing I did that helped out a tad bit was to write out the things that were stressing me out about each exam after I had taken it and there were about 3 things for each of my exams. Sorry for the rant but I would love to know if this is normal and how people have delt with this in the past.",
        "created_utc": 1672690448,
        "upvote_ratio": 1.0
    },
    {
        "title": "Big Law: Boston vs NYC",
        "author": "Plastic_Brilliant428",
        "url": "https://www.reddit.com/r/LawSchool/comments/101lr9e/big_law_boston_vs_nyc/",
        "text": "[removed]",
        "created_utc": 1672689030,
        "upvote_ratio": 1.0
    },
    {
        "title": "Summer Associate and Advance Pay",
        "author": "Specific_Youth_2267",
        "url": "https://www.reddit.com/r/LawSchool/comments/101k7iw/summer_associate_and_advance_pay/",
        "text": "For big law summer jobs, can you request a pay advance to help with the moving costs for the summer?",
        "created_utc": 1672685356,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best way to get my career back on track?!",
        "author": "AerieAdventurous2080",
        "url": "https://www.reddit.com/r/LawSchool/comments/101jvpn/best_way_to_get_my_career_back_on_track/",
        "text": "[removed]",
        "created_utc": 1672684543,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you gotten final grades back?",
        "author": "DjarumWhite",
        "url": "https://www.reddit.com/r/LawSchool/comments/101j4v3/have_you_gotten_final_grades_back/",
        "text": "Curious because i see a lot in this sub talking about grades they received and i have never gotten them this early. Curious what the average looks like\n\n[View Poll](https://www.reddit.com/poll/101j4v3)",
        "created_utc": 1672682755,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it weird if a white/east asian 1L apply for biglaw diversity summer because they're LGBT",
        "author": "PoetryPositive5617",
        "url": "https://www.reddit.com/r/LawSchool/comments/101itny/is_it_weird_if_a_whiteeast_asian_1l_apply_for/",
        "text": "I'm East Asian and 1L and am asking to see if this is common. I do want to apply to a few biglaw summer positions but even though I'm LGBT I haven't necessarily struggled because of it so I'm not sure if I'm even eligible. Any thoughts?",
        "created_utc": 1672682044,
        "upvote_ratio": 1.0
    },
    {
        "title": "CISG - Remedy",
        "author": "Fluid5566",
        "url": "https://www.reddit.com/r/LawSchool/comments/101iocp/cisg_remedy/",
        "text": "[removed]",
        "created_utc": 1672681694,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did you know you want to practice in a certain state (at least right after law school?)",
        "author": "Complete_Read",
        "url": "https://www.reddit.com/r/LawSchool/comments/101ikwx/how_did_you_know_you_want_to_practice_in_a/",
        "text": "I haven't found much info on this topic, surprisingly. I know there are also a lot of people in the same boat at my school who have no idea where they want to practice. I'm curious to see why people would like to practice in a certain state over the other 49.",
        "created_utc": 1672681466,
        "upvote_ratio": 1.0
    },
    {
        "title": "Well, fuk it!",
        "author": "8Pandemonium8",
        "url": "https://i.redd.it/hvppv1plmn9a1.png",
        "text": "",
        "created_utc": 1672678173,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does working in a secondary biglaw market hurt your career long-term?",
        "author": "LargeLawOrBust",
        "url": "https://www.reddit.com/r/LawSchool/comments/101ghov/does_working_in_a_secondary_biglaw_market_hurt/",
        "text": "Hi all, currently a 1L at a lower T14 and trying to decide where I want to move after school. My gf and I like smaller cities and I've been looking into secondary markets. \n\nCharlotte, NC seems pretty interesting because it has a few market-paying firms and relatively low COL. Not from there but I have some ties that I think would be sufficient. A few people have told me it would be bad for my career long-term to go to Charlotte instead of a V10 or other higher ranked firm somewhere like NY/Chi/LA. \n\nI'm worried that if we don't end up liking Charlotte it would be difficult to lateral to a larger market or higher ranked firm. I'd love to hear everyone's thoughts. Thanks!",
        "created_utc": 1672676369,
        "upvote_ratio": 1.0
    },
    {
        "title": "Personal advice?",
        "author": "Flordia863",
        "url": "https://www.reddit.com/r/LawSchool/comments/101ggu0/personal_advice/",
        "text": "Hey everyone , so I am not in law school yet, but I am in \"pre law\". I am getting close to being done my bachelor's of legal studies with my concentration being \"criminal law support\" \nHow do I go about studying for the LSAT and trying to get accepted into law school? \nI am active duty military and will be dropping a Fleb packet (the military pays for my law school) but I have to be accepted. \n\nI want to go to school in the Houston TX area. \n\nAnyone have any personal experience with the process of applying? \n\nGPA 3.6700",
        "created_utc": 1672676305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on OP’s UP:Lawyers should not be able to represent people they know personally.",
        "author": "Mangoes123456789",
        "url": "/r/unpopularopinion/comments/101b8am/lawyers_should_not_be_able_to_represent_people/",
        "text": "",
        "created_utc": 1672675623,
        "upvote_ratio": 1.0
    },
    {
        "title": "GPA Quality??",
        "author": "Weary_Somewhere_1487",
        "url": "https://www.reddit.com/r/LawSchool/comments/101fwmw/gpa_quality/",
        "text": "[removed]",
        "created_utc": 1672674899,
        "upvote_ratio": 1.0
    },
    {
        "title": "I dropped med school for law.",
        "author": "BambySplishSplash",
        "url": "https://www.reddit.com/r/LawSchool/comments/101face/i_dropped_med_school_for_law/",
        "text": "And my happiness is bittersweet because I’m 23 years old and law school here is five years (+3 years until the state exam) People my age often finish law school by this time. I’m so angry at myself I didn’t know earlier that this is my path… Any advice about that?",
        "created_utc": 1672673308,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blind Ukrainian. How can I become a lawyer in the UK or Canada?",
        "author": "Jonikster",
        "url": "https://www.reddit.com/r/LawSchool/comments/101f86m/blind_ukrainian_how_can_i_become_a_lawyer_in_the/",
        "text": "Well, my story.\n\nI'm a blind Ukrainian.\n\nNow I have a residence permit in both Britain and Canada for 3 years.\n\nI'm a student of two universities in Ukraine. Next year I will get 2 degrees, bachelor of computer engineering and bachelor of laws.\n\nI can work as a programmer. Moreover, it may allow me to obtain a permanent residence permit. In Canada it is a faster process as I could become a Canadian citizen in 4 years. In Britain, it may take about 10 years to do this.\n\nBut I would like to do what I like. I like law, I like defending people's rights. In Ukraine, I have already worked with authorities and courts, and even participated in cases in the Supreme Court.\n\nAs I know, my education, even if I get a master's degree in law in Ukraine, will not be enough. In Britain and Canada, I should get a local education.\n\nBut 2 things fit me. I don't have a lot of money and I'm not a genius.\n\nWell, as far as I know, in Scotland there is the possibility of free higher education for Ukrainians. But for that, I have to live in Scotland.\n\nMy visa was originally sponsored by the Scottish government. But now I live in South East England.\n\nPerhaps the best way for me would be to obtain British or Canadian citizenship, because in this case, I would be able to pay less for my education.\n\nAs far as I know, in the UK it will be enough for me to get Ll.M., but I have heard some opinions that if I want to become a good lawyer in the UK, I should get both a bachelor's degree and a master's degree.\n\nIn Canada, I hear the best way is J.D.\n\nHowever, now my english level is about pre-intermediate (a2). It will take me some time to get my IELTS 7.5.\n\nBut I would like to be clear about my plan, what I'm going to do and how to get there.\n\nIf someone could help me with advice, I would be glad!\n\nThanks in advance.",
        "created_utc": 1672673147,
        "upvote_ratio": 1.0
    },
    {
        "title": "U.S. News &amp; World Report to Revamp Parts of Its Law-School Ranking",
        "author": "PotentialWestern129",
        "url": "https://www.wsj.com/articles/u-s-news-world-report-to-revamp-parts-of-its-law-school-ranking-11672667620",
        "text": "",
        "created_utc": 1672670865,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do biglaw equity partners have secure position within firm during recessions, when they’re bringing in less business along with all other partners?",
        "author": "Leather_Room8646",
        "url": "https://www.reddit.com/r/LawSchool/comments/101d6ud/do_biglaw_equity_partners_have_secure_position/",
        "text": "",
        "created_utc": 1672667802,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the work-life balance in biglaw (or their equivalents) in secondary legal markets?",
        "author": "Ok-Conference-5351",
        "url": "https://www.reddit.com/r/LawSchool/comments/101cn6i/what_is_the_worklife_balance_in_biglaw_or_their/",
        "text": "",
        "created_utc": 1672666156,
        "upvote_ratio": 1.0
    },
    {
        "title": "Possibility?",
        "author": "InformationDouble273",
        "url": "https://www.reddit.com/r/LawSchool/comments/101ch76/possibility/",
        "text": "I have a 2L SA And I am wondering if it’s possible to apply to firms in a different city during 3L recruitment. Has anyone done this before?",
        "created_utc": 1672665644,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many of you grew up under neglectful parents?",
        "author": "bigdreambiglaw",
        "url": "https://www.reddit.com/r/LawSchool/comments/101ccjc/how_many_of_you_grew_up_under_neglectful_parents/",
        "text": "I’m talking about visiting home for the holidays for the first time in years and your father not inquiring how you’re doing, what was the first semester of law school like.\n\nInstead, all you see is neglect because he himself was neglected as a child and he never got over it.\n\nA narcissistic son of a bitch. That’s who I think my father is. \n\nI used to be forgiving of my father but the older I get, the more I realize the ‘mens rea’ behind his neglect and it makes me really sick.\n\nBecause he didn’t grow up under a loving father, he himself refused to be a loving father, which has led to the development of serious mental health problems for me.\n\nAny of you also have sociopathic/narcissistic fathers who don’t ask how you’re doing in school but rather just see you as a nuisance?",
        "created_utc": 1672665265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else fail the NYLE?",
        "author": "nbeudert",
        "url": "https://www.reddit.com/r/LawSchool/comments/101680h/anyone_else_fail_the_nyle/",
        "text": "Failed by two points, got 28/30 right",
        "created_utc": 1672643432,
        "upvote_ratio": 1.0
    },
    {
        "title": "What educational services are offered by the top law school in Jaipur? - DiggiWeb",
        "author": "diggiweb",
        "url": "https://diggiweb.com/what-educational-services-are-offered-by-the-top-law-school-in-jaipur/",
        "text": "",
        "created_utc": 1672643031,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book Editions",
        "author": "luckyscars",
        "url": "https://www.reddit.com/r/LawSchool/comments/1015ypj/book_editions/",
        "text": "1L here, second semester about to start. I am feeling rather peeved about the amount spent on textbooks last year. For my upcoming classes I noticed older editions of case books fin more than a few years old) are available for like $20 compared to close to $300.\n\nMy professor book lists do specify editions somewhat, but a couple of times note that older editions “can work”. \n\nAs a general rule, I am curious what there is to lose by getting an older edition of a casebook? I do my reading but feel like I wouldn’t suffer much if the odd footnote was different, but if we are talking entire sections obviously that is another thing. Surely 1L books don’t change a ton over a few years?",
        "created_utc": 1672642565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ranking",
        "author": "New_Clue_2126",
        "url": "https://www.reddit.com/r/LawSchool/comments/1015j14/ranking/",
        "text": "How much does school ranking matter at AmLaw100 firms? I attend a T100 and have casted a wide net and applied to the lower ranked AmLaw 100 firms, does my school rank prevent from getting a diversity 1L SA? Any success stories are appreciated",
        "created_utc": 1672641065,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ableism in this sub",
        "author": "AceroTheDragon",
        "url": "https://www.reddit.com/r/LawSchool/comments/10143er/ableism_in_this_sub/",
        "text": "Just a reminder that many of us need academic accommodations and would not be here without them. I get that having a system that pits students against each other for rankings isn’t a healthy way to measure academic success. If you have a problem with that, take it up with the system itself rather than students who take tests differently than you do. Also, the notion that diagnoses are easy to obtain is complete BS. Yes, sometimes, people abuse the system for their own selfish gain (and that harms people that actually need accommodations too). However, this is not the default. My diagnoses took a lot of time and money to receive. The stigma that comes from being neurodivergent has caused me a lot of anguish and pain throughout my life. Dealing with imposter syndrome in law school is already hard enough as is, and hurtful comments about people with disabilities makes it even worse. Please just try to focus on your own grades instead of tearing others down.",
        "created_utc": 1672636385,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a list somewhere of all the large firms which offer SA?",
        "author": "SnooPickles8744",
        "url": "https://www.reddit.com/r/LawSchool/comments/10134p6/is_there_a_list_somewhere_of_all_the_large_firms/",
        "text": "My career office didn't post that many, worked through google and linkedin, but having a hard time coming up with a decent amount of hits. Thank you in advance!",
        "created_utc": 1672633379,
        "upvote_ratio": 1.0
    }
]