[
    {
        "title": "CIPP/US Exam Resources",
        "author": "OMQLykeCanYouNaught",
        "url": "https://www.reddit.com/r/LawSchool/comments/10nl901/cippus_exam_resources/",
        "text": "Hi!\n\nMy summer employer is offering a pay bump if I pass the CIPP/US exam. I have access to the LinkedIn Learning videos and Mike Chapple's study guide (in addition to all of the free resources from the IAPP).\n\nDoes anyone have recommendations for other study aids? THANK ALL!! xx",
        "created_utc": 1674928993,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would this be breaking the law",
        "author": "unlawfulgreedyman",
        "url": "https://www.reddit.com/r/LawSchool/comments/10nl6nl/would_this_be_breaking_the_law/",
        "text": "[removed]",
        "created_utc": 1674928834,
        "upvote_ratio": 1.0
    },
    {
        "title": "Virtual callback",
        "author": "scottyjetpax",
        "url": "https://www.reddit.com/r/LawSchool/comments/10nktx2/virtual_callback/",
        "text": "I just got a callback for a firm I'm REALLY interested in but they're only offering virtual interviews. What are the best ways to excel in a 2 hour interview where I'm sitting at my desk the whole time?",
        "created_utc": 1674927940,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bell Atlantic Corp. v. Twombly, 2007, (colorized)",
        "author": "ece_enginerd2018",
        "url": "https://i.redd.it/a05wj04cmtea1.jpg",
        "text": "",
        "created_utc": 1674927668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Opinions on Law school",
        "author": "jaxbeth",
        "url": "https://www.reddit.com/r/LawSchool/comments/10nknva/opinions_on_law_school/",
        "text": "I know everyone here is already in law school but I’m an undergrad and have a question for you all. I grew up in a family of lawyers that graduated from Yale and do contract law. I could never, ever ever get into any school like Yale or any Ivy for that matter. (3.3 gpa, 175 lsat). My two main goals have been either to get a Psy.D/Ph.D or JD. Maybe even a joint degree? I have a psychology internship with the public defender and they have all worked in both public and private practice. Every. Single. One. Tells me not to go to law school but they almost can never provide good reasons. Enlighten me. I want to hear your opinions on the type of person that should go to law school and what it is/isn’t!!",
        "created_utc": 1674927507,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bell Atlantic Corp. v. Twombly, 2002, (colorized)",
        "author": "ece_enginerd2018",
        "url": "https://i.redd.it/5ojt91vlltea1.jpg",
        "text": "",
        "created_utc": 1674927440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Family Law that bad?",
        "author": "saltynstony",
        "url": "https://www.reddit.com/r/LawSchool/comments/10nke52/is_family_law_that_bad/",
        "text": "Considering family law after law school. From what I’ve seen many people say on the internet, there’s a lot of hesitance due to the level of potential contention within cases. I’m somewhat of an older student and have an interest in opening up a practice as soon as feasible after graduation. I’d assume family law would be a decent area to break in to considering most in search of that type of attorney haven’t used one before. I suppose some situations would become messy, but I do a nice job of separating work from my personal life. \nThoughts? Good potential salary in private practice family law? Any other areas good for individuals who want to hang their own shingle? \nOpinions welcomed!",
        "created_utc": 1674926787,
        "upvote_ratio": 1.0
    },
    {
        "title": "UK Law LLB, but i want to be a US Attorney. How?",
        "author": "2slowlol",
        "url": "https://www.reddit.com/r/LawSchool/comments/10njryo/uk_law_llb_but_i_want_to_be_a_us_attorney_how/",
        "text": "Hey,\n\nSo I am currently a first year Law student doing the LLB. However, I've looked ahead and already know what career I'd like to pursue. I am from the UK and studying in the UK, however want to be an Attorney either in the US (preferred) or Canada. Is this fairly easy to do? \n\nI know it depends on the state, but for example let's say I'd like to work in NYC or Texas.\n\nMany thanks!",
        "created_utc": 1674925195,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any pros to being on the masthead of a non law review journal before EIP??",
        "author": "singingctownly",
        "url": "https://www.reddit.com/r/LawSchool/comments/10nj6jd/any_pros_to_being_on_the_masthead_of_a_non_law/",
        "text": "Already a submissions editor for one journal but not on the masthead of anything - currently a 1L. Editor for another journal too.",
        "created_utc": 1674923672,
        "upvote_ratio": 1.0
    },
    {
        "title": "Really regret not doing a moot in 3L.",
        "author": "Coconut_Rhubarb",
        "url": "https://www.reddit.com/r/LawSchool/comments/10nj69v/really_regret_not_doing_a_moot_in_3l/",
        "text": "I am in my last year of law school and I turned down an opportunity to be on a competitive moot out of fear that it would be too stressful and now I am having such intense FOMO about it because I know it would have been an amazing once-in-a-lifetime experience. I am so mad at myself! \n\nNot sure what I am looking for here… just really upset at myself and want to post about it.",
        "created_utc": 1674923653,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Reddit Advantage",
        "author": "keret35",
        "url": "https://www.reddit.com/r/LawSchool/comments/10nhprk/the_reddit_advantage/",
        "text": "Hello everyone, i'm a 1L who did well first semester. I've been reflecting recently on how much help and advice i've gotten from this sub, and also lawschooladmissions. I've never heard anyone talk about this before, but do you all think there is a huge advantage for law students who are on this reddit and other forums, versus students who are not on reddit? \n\nFrom reddit alone, I went into 1L having read about:\n\n**Quimbee**\n\n**All of the guides on the 1L sticky**\n\n**The lesser importance of cases, and greater importance of practice tests**\n\n**Cold Calls don't matter**\n\n**The ability to negotiate your scholarship with your school**\n\n**What kinds of internships are available to 1L's and when I should be applying**\n\n**The importance of HOW to take exams, and how to write your exam the exact way your professor wants it**\n\n**Pretty much every other tip I used to do well** \n\nWhile I realize that most of these things can be learned from an older student, I had some great 2L mentees this year and they didn't tell me any of these things. Sure, they told me to practice with the rules and gave me an old outline, but they didn't stress just HOW IMPORTANT practice exams were.\n\nMy peers who are not on reddit spent the whole semester doing 5 different color highlighting in their textbooks and obsessing over cases. No older student told them either, and if they did, they didn't believe them. The amount of guides here on reddit ALL saying the same thing and ALL giving the same advice convinced me -- even though it's counterintuitive to de-prioritize the readings for other things. Had I not been on reddit, even if an older student would have told me, i'm not sure I would've listened.\n\nHow do you all feel about this?",
        "created_utc": 1674919877,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rental Refunds and E-Book",
        "author": "LegalBing",
        "url": "https://www.reddit.com/r/LawSchool/comments/10nh86i/rental_refunds_and_ebook/",
        "text": "I rent all of my books from Amazon, and they sometimes have the aspen e-book code (although it's never guaranteed). If I return the physical copy early for a refund, will I get to keep the E-Book? I think I would because I still have access to my E-Book from last semester. But I wonder if my returning the book early and getting a refund would make a difference. Any insight would be great.",
        "created_utc": 1674918591,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long does it take for states attorney to read long police report in Illinois",
        "author": "Any_Membership9031",
        "url": "https://www.reddit.com/r/LawSchool/comments/10ng7bn/how_long_does_it_take_for_states_attorney_to_read/",
        "text": "I’ve been going through the process of taking my ex to court for domestic violence. I’ve talked with states attorney, police, &amp; did my police video interview. The police report is 106 pages, over 8 years of information. I called states attorney office 3 weeks ago. They said the states attorney was half way through the report but he had to consult with another attorney about certain things. \nI’m wondering if anyone knows how much longer it’ll take for states attorney to finish reading report &amp; press charges for arrest. I’m thinking most likely by February but things move so slow in the judicial system. \nThank you in advance!",
        "created_utc": 1674915744,
        "upvote_ratio": 1.0
    },
    {
        "title": "GPA for LLM",
        "author": "New-Mood-9805",
        "url": "https://www.reddit.com/r/LawSchool/comments/10necgt/gpa_for_llm/",
        "text": "What is an ideal gpa to get into a LLM degree in the US?",
        "created_utc": 1674910251,
        "upvote_ratio": 1.0
    },
    {
        "title": "LLM in the US",
        "author": "oguzalpsamli",
        "url": "https://www.reddit.com/r/LawSchool/comments/10ncivl/llm_in_the_us/",
        "text": "Hi everyone,\n\nI hold an LLB degree from one of the most reputable institutions in Turkey. I have 2-years of full time and 1-year of part-time legal work experience. My English level is good (IELTS 7.5). My main areas of interest are intellectual property law and contract law. I want to pursue an LLM degree in the US, with a good possibility of staying there afterwards. I am not confident that I can get accepted to top colleges like Harvard. \n\nCan you please suggest me some reputable programs that are easier to get accepted. Thank you in advance.",
        "created_utc": 1674903581,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey! What’s the avg starting salary (first year associate) at a private firm in US post JD?",
        "author": "Interesting-Star-767",
        "url": "https://www.reddit.com/r/LawSchool/comments/10nav4s/hey_whats_the_avg_starting_salary_first_year/",
        "text": "",
        "created_utc": 1674897259,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to ask questions for tort law mock trial",
        "author": "Mahad8885",
        "url": "https://www.reddit.com/r/LawSchool/comments/10n7gkb/how_to_ask_questions_for_tort_law_mock_trial/",
        "text": "",
        "created_utc": 1674884582,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stupid question",
        "author": "zeroglimpse63",
        "url": "https://www.reddit.com/r/LawSchool/comments/10n61kc/stupid_question/",
        "text": "Is there a way to see our answers in Exam4 after we've submitted? My profs want us to review our answers before we meet with them but like...how?",
        "created_utc": 1674879959,
        "upvote_ratio": 1.0
    },
    {
        "title": "Federal Judicial Law Clerk-AMA",
        "author": "882345",
        "url": "https://www.reddit.com/r/LawSchool/comments/10n5e09/federal_judicial_law_clerkama/",
        "text": "This is my second clerkship. I’ve also worked at a biglaw firm in between the clerkships. \n\nBored on a Friday.",
        "created_utc": 1674877982,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jobs available after state Supreme Court Clerk?",
        "author": "pacpaxtoy",
        "url": "https://www.reddit.com/r/LawSchool/comments/10n5buu/jobs_available_after_state_supreme_court_clerk/",
        "text": "I’ve been offered a job as a clerk for a state Supreme Court Justice for two years following law school. The pay is shit, but the career services department keeps telling me that it opens up virtually any door I want after two years. Is that true? Two years is a long commitment for shit pay, and while I get that it’s good on a resume, is it worth it in the long run?",
        "created_utc": 1674877799,
        "upvote_ratio": 1.0
    },
    {
        "title": "I asked my professor for feedback on my final and they told me I got the lowest grade in the class",
        "author": "Difficult-Ad-147",
        "url": "https://www.reddit.com/r/LawSchool/comments/10n56bi/i_asked_my_professor_for_feedback_on_my_final_and/",
        "text": "I asked to get feedback because I wanted to learn from my mistakes and see where I can improve. She started by telling me I got the lowest grade in the class. On the final I guess I was very disorganized and missed good points, because I felt like my mind was all over the place. She said she has family who has adhd and asked if I ever thought if I have that. I was diagnosed with adhd, but it kind of threw me off guard because she said the paper came off that it did seem very adhd like (in better words). I feel super disheartened because i didn't know I did that bad or no one got the same grade as me, so the rest of my class can't relate with it. I have lower self esteem going into writing for finals this semester, but I guess i did see where i went wrong and where I can improve.",
        "created_utc": 1674877318,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moral quandary about BL? How do I psych myself in",
        "author": "deadinside451",
        "url": "https://www.reddit.com/r/LawSchool/comments/10n52wj/moral_quandary_about_bl_how_do_i_psych_myself_in/",
        "text": "Currently a 3L at a school ranked in the 70s. I am in the bottom 20% of my class. Monday I have a final round interview for a BL position. No idea how I made it this far—I’m not a nepo baby or anything and I didn’t bribe anybody. \n\nAll of the attorneys I’ve met seem like genuinely thoughtful, well-adjusted people to work with. I’d make more money in one year than I had in my entire life. But if I get offered, I don’t think I can take the job. I’ve been told I’d be put in the environmental practice group. Reading some of the attorneys’ recent cases has been excruciating. I don’t think I could sleep at night defending companies that poison water and kill off biodiversity. \n\nIs there any way I can psych myself in to this? BL money would change my life and would let me change my parents’ lives but I don’t know if I can live with the cost.",
        "created_utc": 1674877017,
        "upvote_ratio": 1.0
    },
    {
        "title": "Joining a frat?",
        "author": "Potential_Wealth_605",
        "url": "https://www.reddit.com/r/LawSchool/comments/10n51fc/joining_a_frat/",
        "text": "This might be a long shot but does anyone have experience with rushing and joining a fraternity while in law school? I have a somewhat unique situation as I am a KJD and live close to campus. I know that I could balance the workload but I'm curious if this is a somewhat common thing to do or if it is a no-no for employers?",
        "created_utc": 1674876892,
        "upvote_ratio": 1.0
    },
    {
        "title": "First Amendment: Can schools prohibit students from displaying signs pro...",
        "author": "scotusreacts",
        "url": "https://youtube.com/watch?v=r8X-uUOvlJk&amp;feature=share",
        "text": "",
        "created_utc": 1674873136,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gift Ideas for a mentor/good friend starting 1L in the fall?",
        "author": "TrenchKidT14",
        "url": "https://www.reddit.com/r/LawSchool/comments/10n2zfl/gift_ideas_for_a_mentorgood_friend_starting_1l_in/",
        "text": "Hey everyone, I hope you all are well! Recently, my mentor was accepted into a couple T6 law schools and will start 1L (most likely on the east coast). He graduated from the same undergrad I am currently attending. He has been mentoring me since the summer and I’ve benefitted significantly from it. I hope to gift him something nice before he leaves for law school. Budget: $400\n\nMay I please ask for any gift ideas?(could be law related or not) Thank you for your time!😃",
        "created_utc": 1674870989,
        "upvote_ratio": 1.0
    },
    {
        "title": "Welcome to law school",
        "author": "MisshapenCookie",
        "url": "https://i.redd.it/ruadwtwa7qea1.jpg",
        "text": "",
        "created_utc": 1674868280,
        "upvote_ratio": 1.0
    },
    {
        "title": "If it’s been almost 3 weeks now since I’ve interviewed at a mid-big firm and I haven’t heard back… does this mean I’m on their waiting list?",
        "author": "yeahowdy",
        "url": "https://www.reddit.com/r/LawSchool/comments/10n1iyb/if_its_been_almost_3_weeks_now_since_ive/",
        "text": "",
        "created_utc": 1674867059,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are tips and suggestions for writing a persuasive appellate brief? Thanks!",
        "author": "pizzadoe101",
        "url": "https://www.reddit.com/r/LawSchool/comments/10n1iqp/what_are_tips_and_suggestions_for_writing_a/",
        "text": "",
        "created_utc": 1674867044,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tyre Nichols Bodycam Footage",
        "author": "brow47627",
        "url": "https://www.reddit.com/r/LawSchool/comments/10n1g68/tyre_nichols_bodycam_footage/",
        "text": "Jesus those videos are horrifying. No other words really come to mind. Really hoping these officers are held accountable to the full extent of the law or else what is the point of all this...",
        "created_utc": 1674866848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wachtell movement",
        "author": "Natural-Database5942",
        "url": "https://www.reddit.com/r/LawSchool/comments/10n11lj/wachtell_movement/",
        "text": "Anyone get movement from Wachtell?",
        "created_utc": 1674865789,
        "upvote_ratio": 1.0
    },
    {
        "title": "AF JAG questions",
        "author": "ItzLeoo",
        "url": "https://www.reddit.com/r/LawSchool/comments/10n0xyy/af_jag_questions/",
        "text": "I have no job lined up for post-grad. I applied for a few positions at the public interest law fair, and have an AF JAG interview next week.\n\nI won’t lie, I’m going into this completely blind. I read that Air Force JAGs have a better quality of life than other branches, but I don’t know what I’d be getting myself into if accepted. \n\nHelp, please 🫠",
        "created_utc": 1674865518,
        "upvote_ratio": 1.0
    },
    {
        "title": "A law student brings their service dog to final. Professor asks why he has a dog with him. The law student says, “She’s my seeing-issue dog!”",
        "author": "Baldingeagle63",
        "url": "https://www.reddit.com/r/LawSchool/comments/10n0u3l/a_law_student_brings_their_service_dog_to_final/",
        "text": "[removed]",
        "created_utc": 1674865247,
        "upvote_ratio": 1.0
    },
    {
        "title": "Short decision period - urgent",
        "author": "law-and-horsdoeuvres",
        "url": "https://www.reddit.com/r/LawSchool/comments/10n0lms/short_decision_period_urgent/",
        "text": "2L here. I interviewed for a summer job at OCI last Friday. Received an offer on Wednesday towards the end of the day. After a few emails back and forth about logistics (expected start date, pay, etc.), I asked today for a few days to think about it, and was told, essentially, no. They were deciding this week and I was \"free to get in touch next week and see if they still had an opening.\" \n\nI'm not sure what to do. I'm a second career JD and I have never encountered this before. It seems like a red flag, and frankly I wasn't super excited about the job to start with and wanted the time to see if another offer came in. But I need a summer job, and don't want to turn this down, get no other offers, and be fucked! Thoughts?",
        "created_utc": 1674864661,
        "upvote_ratio": 1.0
    },
    {
        "title": "does the prosecutor and detective investigate a rape victim together the first time the detective meets the victim?",
        "author": "Substantial_State652",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mzl31/does_the_prosecutor_and_detective_investigate_a/",
        "text": "",
        "created_utc": 1674862159,
        "upvote_ratio": 1.0
    },
    {
        "title": "Justice Kennedy Story",
        "author": "holypuck77",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mz4rh/justice_kennedy_story/",
        "text": "I've always wanted to tell this story, this seems like the perfect sub to do so.\n\nI will never live this story from law school down 😂\n\n1L year, Justice Kennedy came to our Con Law class to guest lecture. Topic of the day was Commerce Clause. We were discussing Wickard v. Filburn. I was trying to be a gunner though so I read ahead to Gonzalez v. Raich 😂. And it came back to bite me.\n\nHe cold called me when we were discussing Wickard v. Filburn, and I gave an answer that he liked, so I was feeling confident.\n\nLater in the lecture, we were still on Wickard v. Filburn, and he kept saying \"wheat,\" obviously, as that was at issue in the case. But I didn't hear \"wheat,\" I heard \"WEED,\" so I thought we had moved on to Gonzalez v. Raich. So, feeling confident from the earlier interaction, I raised my hand and made a point about \"marijuana\" in interstate commerce. Kennedy goes \"who's talking about about marijuana? we're talking about WHEAT. I can tell what your mind is on - I'm going to need to speak with you after class!\"\n\nThe whole class laughed. My professor was staring daggers at me 😂. And I was mortified.\n\nAt least I'll never forget the holdings in Wickard v. Filburn and Gonzalez v. Raich 😂",
        "created_utc": 1674861068,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does law school get easier after doctrinals?",
        "author": "throwaway368902",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mz0w2/does_law_school_get_easier_after_doctrinals/",
        "text": "Scored in the median after first semester 1L. I really don't like the way these doctrinal classes are set up/taught... Does it get better 2L/3L, given that I'll have more opportunities to pick classes that I'm interested in?",
        "created_utc": 1674860802,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L summer",
        "author": "Top-Butterfly4344",
        "url": "https://www.reddit.com/r/LawSchool/comments/10myvnu/1l_summer/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/10myvnu)",
        "created_utc": 1674860431,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clerkship Question: I’m a 2L looking to apply to clerkships starting fall 2024. I go to a Boston Law school but want to do a clerkship out of state. Does anyone have thoughts on whether doing a state court clerkship someplace out of state would make it harder to come back to MA for work afterwards?",
        "author": "JuniorProfessional",
        "url": "https://www.reddit.com/r/LawSchool/comments/10myrmq/clerkship_question_im_a_2l_looking_to_apply_to/",
        "text": "",
        "created_utc": 1674860168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do lawyers at criminal defense firms have some say in cases that they don't want to defend?",
        "author": "iwasthreatened",
        "url": "https://www.reddit.com/r/LawSchool/comments/10myrhb/do_lawyers_at_criminal_defense_firms_have_some/",
        "text": "My plan has been to go to a DAs office after grad for a few years to get trial experience then move to a firm to do criminal defense. I have a variety of reasons on why I am not interested in public defense (mostly being the issues surrounding caseloads and often not having adequate time to work on and defend each case) but my biggest concern is that there are some crimes that I will not defend (SA and CA cases). If you go to a firm for general criminal defense, is there the ability to deny certain cases or should I just aim to go into white collar defense instead?",
        "created_utc": 1674860156,
        "upvote_ratio": 1.0
    },
    {
        "title": "People with GPA slightly over 3, what kind of a job did you get?",
        "author": "extraordinary456",
        "url": "https://www.reddit.com/r/LawSchool/comments/10myk9b/people_with_gpa_slightly_over_3_what_kind_of_a/",
        "text": "Would prefer info from people outside T-14.",
        "created_utc": 1674859656,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the top dream company for law students",
        "author": "MuffinKing369",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mygls/whats_the_top_dream_company_for_law_students/",
        "text": "Interested to know this",
        "created_utc": 1674859403,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unfriendly vibes from Law school",
        "author": "ZealousidealBowler14",
        "url": "https://www.reddit.com/r/LawSchool/comments/10myflo/unfriendly_vibes_from_law_school/",
        "text": "I feel negative vibes from everything Law school related and it’s very discouraging. I’ve heard several horror stories, students in an unhealthy competition with each other, many students seriously considering dropping out in 1L, creepy and racist tenured professors, students who don’t give an f about the people around them…very unwelcoming vibes in general! Now I’m hearing about professors pulling chairs when students want to sit. Does/Did anyone else feel this way before entering Law school? or am I overthinking it? I understand people are there to receive their education, advance their careers and head out but still.",
        "created_utc": 1674859328,
        "upvote_ratio": 1.0
    },
    {
        "title": "Federal District Clerkship Success Stories With Not So Stellar Grades?",
        "author": "inskypinksypoo",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mybr6/federal_district_clerkship_success_stories_with/",
        "text": "[removed]",
        "created_utc": 1674859057,
        "upvote_ratio": 1.0
    },
    {
        "title": "Big 4 vs Biglaw",
        "author": "Dingus_001",
        "url": "https://www.reddit.com/r/LawSchool/comments/10my3a9/big_4_vs_biglaw/",
        "text": "[removed]",
        "created_utc": 1674858488,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reasonable salary for summer clerkship?",
        "author": "FieldofSchemes",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mxzcc/reasonable_salary_for_summer_clerkship/",
        "text": "I work in-house for a multinational corporation. I have been given approval to hire a law clerk for the summer. It has been some time since I was a law student. What is a reasonable hourly rate we should offer for a rising 2L or 3L? Our US manufacturing headquarters is located in a smaller city in Louisiana. What are people paying these days for summer clerkships? I am sure my idea of an appropriate range is out of date.",
        "created_utc": 1674858216,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bad social skills",
        "author": "ChetMasteen",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mx9rm/bad_social_skills/",
        "text": "I feel like many many many lawyers have very poor social skills. Just me or do other people with lives outside of law school kinda feel like most law students are basically autistic?",
        "created_utc": 1674856508,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quick Crim Law and Civ Pro Question",
        "author": "peruserneveruser",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mx5vc/quick_crim_law_and_civ_pro_question/",
        "text": "&amp;#x200B;\n\nOkay so real quick (or maybe not looking at the length of this post lol), I'd really appreciate some help on these issues! \n\nCrim Law/Crim Pro:\n\nI. Merger\n\n*Imagine a scenario where D enters into a store intending to rob the store clerk for money. D walks up to the clerk, takes out a gun, points it at his head and says, \"Give me all the money in the register or i'll blow your head off!\" The store clerk (like many of us) is numbed to his daily existence due to the monotony of his rote and pedantic life and therefore apathetic to threat. He feels no fear yet, nevertheless, decides to give the money in the register to the D, solely so that the clerk can get on with his uninspired existence.*\n\n*D is later caught and charged with the crimes of Armed Robbery and Aggravated Assault. At trial, D's only defense is that he cannot be charged with Aggravated Assault because of the merger doctrine.*\n\n**My Questions**\n\nA. Is D's assertion correct?\n\nB. If yes, would it still be correct if he was tried for Robbery and Aggravated Assault?\n\nC. If an actual Assault/Battery takes places to effectuate a Robbery does it always merge with Robbery?\n\n\\------------------------------------\n\nCiv Pro\n\nI. Issue Preclusion/Claim Preclusion (Specifically Non Mutual Collateral Estoppel (i think these are the same things right???))\n\n*Imagine a scenario where a lawyer, a psychiatrist and 70 1Ls, all from State A, are in fact not engaged in a group therapy session, but instead are riding a bus through State B, for the heart warming purpose of visiting America's greatest bureaucratic achievement of America to date, the NAIC headquarters, located in State C.The bus is owned by Bus Company X domiciled in State C. The driver of the bus, a former insurance agent from State B, suddenly experiences extreme PTSD while driving and swerves off the road causing injuries to the everyone on board. The psychiatrist brings a proper diversity suit against both the Driver and the Bus Company for negligence in the amount 200K, which he wins. A month later, the lawyer also brings suit against both the Driver and Bus Company for 150K.*\n\n**My Questions**\n\nA. Can the Defendant assert non mutual collateral estoppel against the lawyer?\n\n\\- If so, what is the relationship the potential Plaintiff must have with the previous Plaintiff/or  \nany plaintiff/ for the Defendant to assert this defense.\n\nB. Would the 70 1Ls still be able to bring a claim as a class action?\n\nC. Back to Claim Preclusion/Issue Preclusion/Non Mutual Collateral Estoppel. Correct me if i'm wrong but:\n\n* Claim Preclusion is specifically about two Parties who previously have fully litigated a cause of action, preventing those same two parties from re litigating the same claim arising from the same set of facts or circumstances. (aka I bring a proper diversity against you in fed court for Negligence bc your dog bit me, I win, and then i sue you again in state court for negligence bc your dog bit me but my claim is precluded)\n* Issue Preclusion is specifically about two parties who have previously fully litigated an issue in a cause, of action, preventing those same two parties from re litigating the same issue arising from the same set of facts or circumstances. (aka I still bring a diversity suit against you in fed court for asserting negligence per se because you were speeding, ran a red light and hit me while walking through an intersection car. Negligence because you hit me with your car. Court finds negligence per se and based on that finding holds for me. At his criminal trial for aggravated assault, Defendant tries to argue that he wasn't driving but is precluded from doing so (right?))\n\nD. Can both of the above can be used in a non mutual offensive and defensive situations (aka by both the Plaintiff and Defendants?",
        "created_utc": 1674856239,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this illegal or normal?",
        "author": "generalgaochicken",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mx38z/is_this_illegal_or_normal/",
        "text": "Hi, so I have a few disabilities (including visual-impairment) that require me to use extended-time accommodations for my exams. For some background, my school has an anonymous grading system where professors aren't able know the name of the person that they're grading. In addition, there is a school policy that says that students with test accommodations are not allowed to disclose that information to the professors so that they don't develop any bias. \n\nWe recently got our grades back, and I requested to review my final exam for one of my courses. \n\nOn my exam (essay) answer, I saw that my professor marked my paper with numbers in the margin and made a few comments for himself. To my surprise, there was a cover sheet in front of my paper, generated by Exam4, and there was a TIME STAMP printed on it -- (along with the word count, etc.) -- e.g., \"9:01 AM - 2:02 PM.\"  \n\nSo in short, **my professor was able to see that the paper he was grading had extended time**, although he probably didn't know my name because only my Anonymous ID was printed there. I worry that professors would develop a bias towards any paper that had extended time even before grading the exams. \n\nIs this normal? Or should I need to bring this up to someone? \n\nThanks!",
        "created_utc": 1674856058,
        "upvote_ratio": 1.0
    },
    {
        "title": "anyone aware of caselaw on the effects of CBD/legality of it in food additives",
        "author": "Afraid-Case-4317",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mwvi5/anyone_aware_of_caselaw_on_the_effects_of/",
        "text": "",
        "created_utc": 1674855543,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L Summer State Judicial Internship?",
        "author": "AnonNYCLawStudent",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mwkoy/1l_summer_state_judicial_internship/",
        "text": "[removed]",
        "created_utc": 1674854814,
        "upvote_ratio": 1.0
    },
    {
        "title": "Forgot to add volunteer experiences and one work experience to my C&amp;F application",
        "author": "rtidwell",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mwiwa/forgot_to_add_volunteer_experiences_and_one_work/",
        "text": "How screwed am I?",
        "created_utc": 1674854687,
        "upvote_ratio": 1.0
    },
    {
        "title": "do you guys remember that person who posted about pooping their pants during an exam and then let the dry poop pellets fall to the ground and kick them around so no one would pick up on the smell?",
        "author": "fractaltide",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mvdjf/do_you_guys_remember_that_person_who_posted_about/",
        "text": "i think about them a lot &amp; hope that they’re ok",
        "created_utc": 1674851882,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the State Bar review all of a candidate's law school applications or only the application to the school one attended?",
        "author": "LeftOnBraves",
        "url": "https://www.reddit.com/r/LawSchool/comments/10muzqx/does_the_state_bar_review_all_of_a_candidates_law/",
        "text": "Title",
        "created_utc": 1674850938,
        "upvote_ratio": 1.0
    },
    {
        "title": "Legal Writing professor goes on problematic rant during class, doesn't understand why it's offensive, blames all of us",
        "author": "SketchyShelf",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mutn7/legal_writing_professor_goes_on_problematic_rant/",
        "text": "[removed]",
        "created_utc": 1674850529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Working for a DA with biglaw goals",
        "author": "squeezemyrook",
        "url": "https://www.reddit.com/r/LawSchool/comments/10msyg9/working_for_a_da_with_biglaw_goals/",
        "text": "At a t14, have a few county DA offers for 1L summer. Ik common wisdom is that it doesn’t matter much what you do as long as it’s legal, but do you think that it makes any sense to do this sort of thing if you just wanna do generic corporate biglaw after?",
        "created_utc": 1674846168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Emailing other firms who haven't reached out yet after getting an offer?",
        "author": "Sea_Cupcake_868",
        "url": "https://www.reddit.com/r/LawSchool/comments/10msxha/emailing_other_firms_who_havent_reached_out_yet/",
        "text": "I received an offer from a big law firm for 1L summer, though there are a few firms I am still interested in based on their practice area emphases and culture... should I reach out to the recruiters at those firms and let them know of my deadline but interest in their firm?",
        "created_utc": 1674846107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aging attorney population? Thoughts?",
        "author": "StrongManufacturer51",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mslhi/aging_attorney_population_thoughts/",
        "text": "Take a look at the Texas State Bar demographics [here](https://www.texasbar.com/AM/Template.cfm?Section=demographic_and_economic_trends&amp;Template=/CM/ContentDisplay.cfm&amp;ContentID=56197) \n\n29% of attorneys are over the age of 60. It would certainly appear there are too many attorneys in the market currently, but is it possible there is a shortage of attorneys once the 60+ demographic retires? Possibly within the next 10 years?",
        "created_utc": 1674845344,
        "upvote_ratio": 1.0
    },
    {
        "title": "Legal and compliance internship",
        "author": "billythekid890",
        "url": "https://www.reddit.com/r/LawSchool/comments/10msc8d/legal_and_compliance_internship/",
        "text": "Had an interview with the legal and compliance team of a company for my 2L summer internship. It sounds like it’s a decent amount of legal work and they work hand in hand with the in house team but it’s not a strictly legal job. \n\nIf I get it, would it be bad to take it? I’m not sure how it would look on a resume when applying to law firms next year but some of my mentors have told me I can only list the legal parts of it on my resume and make it look good. Others have told me I need to find an actual legal job. Just don’t want to restrict myself for future employment because of what I did for an internship in law school.",
        "created_utc": 1674844732,
        "upvote_ratio": 1.0
    },
    {
        "title": "You are called on to present this example to the class. How do you go about it?",
        "author": "beggun22",
        "url": "https://i.redd.it/5vkyjnuotnea1.jpg",
        "text": "",
        "created_utc": 1674839489,
        "upvote_ratio": 1.0
    },
    {
        "title": "Requesting LOCI",
        "author": "BayofSexcriminalboat",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mpt7m/requesting_loci/",
        "text": "I completely understand this post might fit in better at r/lawschooladmissions, but considering that everyone over there is competing with one another, it seems unlikely to receive a genuine response. I’m just looking for an example of a good LOCI, so that I can model my own and increase my chances. I’ve been WL at a couple t14’s and am really desperate to get an A. Still waiting on responses from Michigan, Berkeley, and UVA. \n\nPlease help if you can, it would be greatly appreciated.",
        "created_utc": 1674838725,
        "upvote_ratio": 1.0
    },
    {
        "title": "When to expect rejections for 1L SA?",
        "author": "PM_me_ur_digressions",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mpl22/when_to_expect_rejections_for_1l_sa/",
        "text": "Grades are submitted and there's just been an eerie silence since. I got a few R's before submitting grades (Cooley, King &amp; Spalding, etc) but... No post-grade R's (yet). Yes, I know ghosting is a thing, but how long will it take for firms to decide they don't want me?",
        "created_utc": 1674838197,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kei Komuro",
        "author": "New-Mood-9805",
        "url": "https://www.reddit.com/r/LawSchool/comments/10moba7/kei_komuro/",
        "text": "How was Kei Komuro able to secure visa sponsorship at a US law firm despite being a non-US citizen? I thought getting visa sponsorships is extremely difficult.",
        "created_utc": 1674835109,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I [1L] accept the first internship offer I get?",
        "author": "marimomossball_",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mo6uj/should_i_1l_accept_the_first_internship_offer_i/",
        "text": "Today is my last day to accept an offer I got earlier this week and though I was initially excited, I’m having some second thoughts. It’s an in-house internship at a big insurance firm, the pay is ok, it’s close to home (so I can live at home), and the team seems really nice, but I don’t plan on going into insurance law and the role seems more litigation heavy — my ideal internship would be transactional focused work at a tech company. I’m happy to explore both litigation and transactional work but I’m worried I won’t have much to talk about in regards to transactional work during OCI.\n\nI’m KJD, I don’t have much faith in my interview skills, and this summer is looking really competitive so I’m really afraid that if I reject this offer, I won’t get any other offers. I’m still in the early stages with other companies so it’s not like I’m expecting any other offers yet. I’ve been told repeatedly that 1L summer internships don’t *really* matter as long as they’re law related, and I’m at a T14, so hopefully it shouldn’t affect my career trajectory too much?\n\nThere’s a lot of perks to this role that I like…it’s just not exactly what I want to do in the future. I’m leaning toward accepting but I’m afraid I’m closing myself off from better opportunities. Thoughts?",
        "created_utc": 1674834805,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any meaningful difference in how interning for a magistrate judge vs. a district judge looks on a resume?",
        "author": "Unclocked_Orange",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mmxu3/any_meaningful_difference_in_how_interning_for_a/",
        "text": "Pure curiosity question",
        "created_utc": 1674831726,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am spending tens of thousands of dollars to find out in property the rule \"finders keepers; losers weepers\" is pretty much the common law",
        "author": "William_the_redditor",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mmmsw/i_am_spending_tens_of_thousands_of_dollars_to/",
        "text": "",
        "created_utc": 1674830955,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help- in a career dilemma of sorts.",
        "author": "kraken_enrager",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mmetm/help_in_a_career_dilemma_of_sorts/",
        "text": "\n\nSo I’ll be completing schooling in like 1.5 months and am gonna pursue law as a profession(in my country law can be done straight outta school)\n\nI have 3 broad options, but don’t know what to choose. I’d really really appreciate it If any lawyers or someone knowledgeable about the field can help me out. \n\n1. I’ll get into NLU Jodhpur or Kolkota with NRI quota, take that and study there.(both tier 1 law schools)\n\n2. Go for Jindal Law School(private law school, rich ppl go in when they don’t get in any good place)\n\n3. Get into GLC/random uni(no attendance required), but work right under a senior partner at Khaitan(one of the best law firms in India) for 5 years full time(we know someone). \n\n———\n\nI think it’s important to note that as far as internships are concerned, we have quite a few good connections so I can get pretty good internships in india and abroad as well— I plan on doing 10 in 5 years if I don’t go with the 3rd plan above. \n\n——— \n\nWith that out of the way, I want to do MBA post law or LLM in a super niche field(corporate fs), is that a wise option? I’m presuming my resume will be good enough to be accepted into any Ivy/Oxbridge/tier 1 uni. \n\n———\n\nNow for my actual career path, \n\nI have 2 things in mind,\n\n1. The normal law path— I’ll likely make partner in 8-10 years, and start a boutique firm a few years post that. \n\n2. My own business, my parents have excellent industry connections in the heavy industry and finance world(f500 level), so with their knowledge and help I will likely be able to start my own industry and stuff. \n\nIdeally I’d want to start a heavy Industry—something in shipping, mining, chemicals, metals etc. stuff I have family background in. \n\n———\n\nCould y’all please please help me out with this. Thanks!!",
        "created_utc": 1674830374,
        "upvote_ratio": 1.0
    },
    {
        "title": "What steps would u take if you were me?",
        "author": "Findingbalance3378",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mksyl/what_steps_would_u_take_if_you_were_me/",
        "text": "Hi! So I’ve been a criminal defense private investigator for about 5 years now. I’m starting school and am not sure what route to take!!\n\nI have 3 careers in mind; criminal psychologist, forensic psychologist or crime scene investigator. \n\nAs of now I’m pursuing a criminal justice degree and taking CJ classes. Should I stay on this route? Should I switch my major to psychology? Or will it be sufficient if I just also add some psychology classes into my schedule",
        "created_utc": 1674826100,
        "upvote_ratio": 1.0
    },
    {
        "title": "sat",
        "author": "Extension-Tune-8392",
        "url": "https://v.redd.it/cmwp82aa4lea1",
        "text": "",
        "created_utc": 1674824811,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would you choose? 1L summer job search.",
        "author": "thrwy1111111111",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mj0wg/what_would_you_choose_1l_summer_job_search/",
        "text": "Received an offer from a federal judge but 90% of my 1L SA apps are outstanding. Im at a T14, 3.7-3.9 gpa from first semester. Should I take the risk of waiting for firms for an unlikely 1L SA? Or just take the unpaid judicial internship?\n\n[View Poll](https://www.reddit.com/poll/10mj0wg)",
        "created_utc": 1674820428,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is standard procedure in personal injury law for submitting a demand to the insurance company? Would the attorney first discuss it with their client to make sure they understand and hopefully agree with the amount?",
        "author": "Ok-Cheesecake4279",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mhd6d/what_is_standard_procedure_in_personal_injury_law/",
        "text": "",
        "created_utc": 1674813936,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question regarding error in persona",
        "author": "aliosha-karamazov",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mg502/question_regarding_error_in_persona/",
        "text": "Hey folks,\n\nImagine that I buy a painting from an artist thinking that he is another artist (he doesn't know that I am mistaken about his identity). Is that *error in persona*?  Does that invalidate the contract so I can get my money back?",
        "created_utc": 1674808709,
        "upvote_ratio": 1.0
    },
    {
        "title": "Callback - Informal Group Chat?",
        "author": "britawaterbottles",
        "url": "https://www.reddit.com/r/LawSchool/comments/10meak3/callback_informal_group_chat/",
        "text": "1L here doing the SA recruitment process. i’ve had callbacks that were purely one-on-one interviews, but what should i expect during a 30 minute “informal group chat with junior associates”? is it truly informal, or am i meant to ask them about why the firm, their job, etc.? i’m assuming the former but just want to make sure i don’t make a fool out of myself. thank you!!",
        "created_utc": 1674801340,
        "upvote_ratio": 1.0
    },
    {
        "title": "To appeal or not appeal",
        "author": "belowthebar_26",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mdtal/to_appeal_or_not_appeal/",
        "text": "Finally got to meet my professor to review my low grade on a final paper (the paper was 100% of our grade). I went in open minded but the professor was not able to justify the grade other than saying he may have been overly harsh.\n\nMy school has an appeals process. I currently have a B-, and by appealing I risk getting a lower grade. Does anyone have any experience/thoughts on appealing a grade?",
        "created_utc": 1674799584,
        "upvote_ratio": 1.0
    },
    {
        "title": "DOJ 1L Internship hiring timeline",
        "author": "chiefsfana2",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mdgk6/doj_1l_internship_hiring_timeline/",
        "text": "I know some sections have finished 1L recruitment already, but I was wondering when the lion's share of interviews and offers are made for, e.g, Crim, Civil, and Tax. Is it Feb. or March?",
        "created_utc": 1674798358,
        "upvote_ratio": 1.0
    },
    {
        "title": "What career options are there for bio-law? (as in going to law school with a degree in biology)",
        "author": "kellbell107",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mco3z/what_career_options_are_there_for_biolaw_as_in/",
        "text": "",
        "created_utc": 1674795665,
        "upvote_ratio": 1.0
    },
    {
        "title": "Professors making up ABA rules? Why do they hate us so much",
        "author": "fuzzylittlemannpeach",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mclc8/professors_making_up_aba_rules_why_do_they_hate/",
        "text": "We have an add drop period of two weeks. One of the courses I wanted to take was full and someone droppedit  like a week in to the semester, so I added it to my course load. Emailed the professor that night and got a response “welcome to the class” and all that. Did everything I could to catch up and worked my ass off to get an email from the registrar today that I have almost reached my allowed absences lol. The professor counted the four classes I missed during add/drop against me even though I wasn’t actually registered for the course. Like thanks for telling me in your welcome email. He said it was an ABA rule - could someone point me to that rule, I am not seeing it? 😂",
        "created_utc": 1674795440,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to connect with smaller firms?",
        "author": "Artistic_bat_",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mbz5d/how_to_connect_with_smaller_firms/",
        "text": "I am striking out at OCI and really want to work at a firm this summer. There’s lots of small firms in my city that look interesting, but I don’t know the appropriate way to reach out about a summer job. Lots of alumni from my law school work there, so is it appropriate to message them, introduce myself and ask if there is a summer position open? Or just email my resume and cover letter? I feel brown nosey for asking to meet with them and talk about their career when I feel like it’s very obvious I am interested in a summer job. I’m starting to panic after OCI not going well for me so any tips on networking with small firms will be greatly appreciated. I’m not from this area and have no connections I can use so I’m starting from scratch",
        "created_utc": 1674793405,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pivoting in 1L Job Search",
        "author": "EquivalentAlfalfa416",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mbnig/pivoting_in_1l_job_search/",
        "text": "[removed]",
        "created_utc": 1674792388,
        "upvote_ratio": 1.0
    },
    {
        "title": "Screener for firm after submitting average grades. Good sign?",
        "author": "Fortheloveofe",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mbdn0/screener_for_firm_after_submitting_average_grades/",
        "text": "Submitted a pretty passionate application to a firm I really like for the 1L Diversity program. They were responsive and asked for my transcript over email (wasn’t ready until mid Jan)\n\nA week later they sent me a screener (still learning the lingo, but essentially just a one way video Interview). \n\nSad thing is my grades aren’t exactly the classic bit law competitive type - B’s. But I feel hopeful knowing I wasn’t an auto reject. Does this screener mean much or just a standard practice?",
        "created_utc": 1674791553,
        "upvote_ratio": 1.0
    },
    {
        "title": "need a bit of guidance",
        "author": "No-Bee8720",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mb32j/need_a_bit_of_guidance/",
        "text": "I'll try to keep this nice and short.\n\nI want to go to law school except I have a few problems. \nI was never an A's student, rather average one. I feel on so many levels stupid. I know that most of the students in law school are people who were the smart ones in class. I hate how I feel about this. I don't think I'm good at anything, but I found paralegal classes interesting and engaging. I don't really feel much support to follow through. People say the generic, \" I know you'll make it, I believe in you.\" Somehow sounds empty, so I just stop talking about it.\n\nI don't have skills like typing fast, nor am I a great debater. Overall, I don't like the pity party I thrown. How was you guys journey to law school \n\n Realistically, should I go for it, because the debt isn't exactly cheap.",
        "created_utc": 1674790626,
        "upvote_ratio": 1.0
    },
    {
        "title": "A at Gonzaga University Law School with $69k Scholarship! 3.8 + Reverse Splitter (151 LSAT)",
        "author": "maejay_",
        "url": "https://www.reddit.com/r/LawSchool/comments/10mar4t/a_at_gonzaga_university_law_school_with_69k/",
        "text": "Gonzaga had been radio silent since I applied Oct 7th...So a few days ago I gave them a call and the admissions officer accidentally let it slip that I had been admitted with scholarship! They then realized they had told me before any official offers had been sent out, and that I should be expecting a formal offer in a couple days. The official offer of admission was posted this evening and I am over the moon!",
        "created_utc": 1674789643,
        "upvote_ratio": 0.99
    },
    {
        "title": "Free ride to FIU Stetson and UM",
        "author": "Downtown_Marsupial63",
        "url": "https://www.reddit.com/r/LawSchool/comments/10maiyz/free_ride_to_fiu_stetson_and_um/",
        "text": "Debating on where to attend for 1L. I have a free ride at all the schools listed above and am having trouble deciding. I like the location of Stetson but I want to practice in South Florida and don't know how that would impact me doing so. Thanks",
        "created_utc": 1674788988,
        "upvote_ratio": 1.0
    },
    {
        "title": "law school admissions question!!",
        "author": "hazy_head",
        "url": "https://www.reddit.com/r/LawSchool/comments/10ma3sn/law_school_admissions_question/",
        "text": "[removed]",
        "created_utc": 1674787726,
        "upvote_ratio": 1.0
    },
    {
        "title": "thanks Amazon",
        "author": "culverhibbs14",
        "url": "https://www.reddit.com/r/LawSchool/comments/10m9sf0/thanks_amazon/",
        "text": "thanks Amazon for remembering everywhere I've lived for the past 10 years for me!",
        "created_utc": 1674786770,
        "upvote_ratio": 1.0
    },
    {
        "title": "Somewhat unorthodox, but I made an EP of songs after 1L year about law school! It’s available on streaming under “Treasure Trove,” but this post isn’t self-promotion: there’s a shocking lack of law school songs, and I’d love to hear ideas for future songs! PM me if you want to make a tune together!",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1674783210,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recieved callback interview and all of them are partners?",
        "author": "ChiiChi333",
        "url": "https://www.reddit.com/r/LawSchool/comments/10m87n4/recieved_callback_interview_and_all_of_them_are/",
        "text": "Should I read into this? I’ve heard they’re usually a mix of partners and associates. Thanks in advance!",
        "created_utc": 1674782108,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was your Property Law class utterly disorganized?",
        "author": "HappyBlueKnight",
        "url": "https://www.reddit.com/r/LawSchool/comments/10m7w7s/was_your_property_law_class_utterly_disorganized/",
        "text": "We'll move from three completely different subjects in property law within the span of a single class period. It has quickly become the most hated class of many of the people in my section. Part of the blame could reasonably go to the textbook, to be fair.",
        "created_utc": 1674781208,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is law school necessary for me to be a sports agent?",
        "author": "marmogawd",
        "url": "https://www.reddit.com/r/LawSchool/comments/10m7s9b/is_law_school_necessary_for_me_to_be_a_sports/",
        "text": "\nIm currently studying Communications and Digital Media. I’ll graduate this december, and i finally decided where to go with my career: be a sports agent.\n\nIm considering entertainment too, but sports is a stronger possibility. Do i need a law background to be a better agent? I honestly dont want to spend another 4 years in college, but if that means ill be more prepared to enter the sports/entertainment agent business, im willing to do it",
        "created_utc": 1674780879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are the majority of you guys in law school, graduated law school, or just interested in law school?",
        "author": "Which-Style-3832",
        "url": "https://www.reddit.com/r/LawSchool/comments/10m7hzf/are_the_majority_of_you_guys_in_law_school/",
        "text": "Also, if you’re in law school where are you currently at, or where did you graduate from?\n\n[View Poll](https://www.reddit.com/poll/10m7hzf)",
        "created_utc": 1674780041,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the majority of people in here in law school, graduates, or interested in law school?",
        "author": "Which-Style-3832",
        "url": "https://www.reddit.com/r/LawSchool/comments/10m7gjg/is_the_majority_of_people_in_here_in_law_school/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/10m7gjg)",
        "created_utc": 1674779925,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was there something wrong with my application? Ghosted by 1L SA",
        "author": "Plastic_Brilliant428",
        "url": "https://www.reddit.com/r/LawSchool/comments/10m6z3e/was_there_something_wrong_with_my_application/",
        "text": "[removed]",
        "created_utc": 1674778582,
        "upvote_ratio": 1.0
    },
    {
        "title": "anyone have experience/knowledge of receiving accommodations related to anxiety for trial classes and similar classes where you have to make extensive presentations, etc.?",
        "author": "sodidos",
        "url": "https://www.reddit.com/r/LawSchool/comments/10m6sq4/anyone_have_experienceknowledge_of_receiving/",
        "text": "Hi all,   \n\nI have a history of pretty bad social/generalized/performance anxiety.  I have never sought accommodations because I have been able to get through cold calls and the like by extensive preparation, etc.  However, I am now in a trial advocacy class, which is required by my school, and I am really, really struggling with the class due to its extensive requirements for oral presentations in front of the class (and anticipate a similar thing happening with another required course this semester where I must give a 20+ minute long presentation as a final project) to the point of having panic attacks, which I haven't had in years.  I've never sought accommodations for anything in college, but was just wondering if this was something even worth pursuing, because I fear my school might not offer an accommodation re: oral speaking, especially for a required class.  For what it's worth, I already work in a federal office where I do very similar work as the attorneys, and I chose that job in part because I knew I wouldn't need to give presentations and the like, and when I graduate, I intend to simply transition to an attorney position doing pretty much identical work to the work I do now.  I appreciate any input.",
        "created_utc": 1674778113,
        "upvote_ratio": 1.0
    },
    {
        "title": "Graduation Dress",
        "author": "NegativeAd3110",
        "url": "https://www.reddit.com/r/LawSchool/comments/10m6kuk/graduation_dress/",
        "text": "Is this appropriate to wear to graduation? At a t-25. \n\njust want cute pics 😂 plan to be zipped up for everything except my family pics",
        "created_utc": 1674777540,
        "upvote_ratio": 1.0
    },
    {
        "title": "Graduation Attire",
        "author": "NegativeAd3110",
        "url": "https://www.reddit.com/r/LawSchool/comments/10m6e6t/graduation_attire/",
        "text": "Am I supposed to wear a professional dress? I’m trying to take cute instagrammable pics lol",
        "created_utc": 1674777012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Talking with non-legal industry friends and relatives",
        "author": "extraordinary456",
        "url": "https://www.reddit.com/r/LawSchool/comments/10m67hr/talking_with_nonlegal_industry_friends_and/",
        "text": "Bro just because I am in law school doesn’t mean that I know every law in USA lol \n\nPeople just be asking the most obscure thing and expecting that you know the answer. When you say you don’t know the answer it is meant with a sarcastic reply. \n\nEven worse are people who know about something because they have personal experience in that topic and when you say that you don’t know about the law in that topic they are like “I thought you were in law school.”",
        "created_utc": 1674776498,
        "upvote_ratio": 1.0
    },
    {
        "title": "CFPB Interview -&gt; Answer?",
        "author": "SillyHalf971",
        "url": "/r/LawSchool/comments/10h7848/cfpb_interview_answer/",
        "text": "",
        "created_utc": 1674775575,
        "upvote_ratio": 1.0
    },
    {
        "title": "When do I give up on hearing back on callbacks?",
        "author": "No_Opinion_7185",
        "url": "https://www.reddit.com/r/LawSchool/comments/10m5lxc/when_do_i_give_up_on_hearing_back_on_callbacks/",
        "text": "Had a couple call backs, ranging from two weeks to a week ago and haven’t heard anything, though I thought the interviews went well. Should I assume it’s a no? They are both BL.",
        "created_utc": 1674774905,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sophomore in undergrad seeking advice",
        "author": "sussylogussy",
        "url": "https://www.reddit.com/r/LawSchool/comments/10m56ot/sophomore_in_undergrad_seeking_advice/",
        "text": "Im currently a sophomore in undergrad at Western Washington University and I'm looking for advice about what I should do from this point forward to have a good chance of getting into a top law school. I currently have a 3.46 GPA, which isn't terrible, but it fills me with anxiety when I think of applying to a top law school. However, it's a significant improvement from the 2.5 I had when I graduated high school. I haven't started my major, which I've almost certainly decided will be history, which I've absolutely loved since I was a  kid. I'm not currently participating in any extracurriculars, as I'm trying to see how comfortable I am with working 20 hours a week and doing 45 hours of school. While I'm even fortunate enough to attend a college, I want to go somewhere with a good history program. I've been looking to transfer somewhere else, but the GPA kinda makes that difficult. Anyways, despite the fact I'm killing myself with stress over applying to law school when I'm only a sophomore, I know I have two more years. Instead of stressing and doing nothing I'm looking for advice about things that can really boost a future law school application.\n\nWhat things should I be doing in my remaining years in undergrad to become a serious candidate for the top law schools in the country?",
        "created_utc": 1674773810,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inexpensive or free online law programs?",
        "author": "prettybadengineer",
        "url": "https://www.reddit.com/r/LawSchool/comments/10m3ywx/inexpensive_or_free_online_law_programs/",
        "text": "Might be an odd post; I’m just looking for inexpensive or free online law school programs. I don’t care about the degree (as I’m not trying to append more letters to the end of my name), but I do care about the information. I’m hoping it will be valuable professionally. \n\nFor reference, I’m thinking of something similar to the Quantic School of Business and Technology where they’re tuition-free for admitted students (MBA). I don’t necessarily want to sacrifice anything so I’m amendable to paying for classes, just don’t feel the need to spend a significant portion. \n\nLet me know if you’ve seen anything like this, degree program or not. Thanks.",
        "created_utc": 1674770752,
        "upvote_ratio": 1.0
    }
]