[
    {
        "title": "Seeking Advice: Deciding Between a Full Time Job and Law School (Already Accepted)",
        "author": "Ambitious-Ostrich-28",
        "url": "https://www.reddit.com/r/LawSchool/comments/zraltn/seeking_advice_deciding_between_a_full_time_job/",
        "text": "[removed]",
        "created_utc": 1671598002,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is having significant experience as a paralegal something worth putting in a law school application, or is there any reason it would be best to avoid it? Please explain your reason(s).",
        "author": "PristineLegalShits",
        "url": "https://www.reddit.com/r/LawSchool/comments/zr91ix/is_having_significant_experience_as_a_paralegal/",
        "text": "",
        "created_utc": 1671593405,
        "upvote_ratio": 1.0
    },
    {
        "title": "Creative name for a law school mentorship program?",
        "author": "Afraid-Case-4317",
        "url": "https://www.reddit.com/r/LawSchool/comments/zr8spz/creative_name_for_a_law_school_mentorship_program/",
        "text": "",
        "created_utc": 1671592683,
        "upvote_ratio": 1.0
    },
    {
        "title": "2022 509 reports are out",
        "author": "inthekeyof_life",
        "url": "https://www.reddit.com/r/LawSchool/comments/zr8ccg/2022_509_reports_are_out/",
        "text": "Just in case anyone else has also been stalking ABA to see when the new reports would drop\n\n[Linked here](https://www.abarequireddisclosures.org/Disclosure509.aspx)",
        "created_utc": 1671591397,
        "upvote_ratio": 1.0
    },
    {
        "title": "I tried to rescue my pet and I regret it",
        "author": "feaear",
        "url": "https://www.reddit.com/r/LawSchool/comments/zr7yec/i_tried_to_rescue_my_pet_and_i_regret_it/",
        "text": "My parrot flew off to a neighbor's house and landed on a roof that I could reach if I climbed on her fence, I did and got it back but the neighbor next door has a camera that may or may not have seen me, Can i have legal problems for this?",
        "created_utc": 1671590288,
        "upvote_ratio": 1.0
    },
    {
        "title": "considering law school",
        "author": "yellow0194",
        "url": "https://www.reddit.com/r/LawSchool/comments/zr77ls/considering_law_school/",
        "text": "I’m almost 20, freaking out about my career planning, and I’m seriously considering a career in law. I just have a lot of questions and I hope someone in law school/has graduated can answer them\n\n1. Are you happy? Happy meaning, do you genuinely love to be a lawyer? Has it affected your mental health? Do you still get to do activities you normally did before?\n2. I know the job is going to be difficult, but what are the pros and cons of law school? What am I going to expect?\n3. What made you decide you want to go into law\nThank you for reading! Happy holidays",
        "created_utc": 1671588228,
        "upvote_ratio": 1.0
    },
    {
        "title": "My cousin had paid the full balance to the lawyer for his cases. The lawyer is now asking for the payments that have been paid. This lawyer is being dropped due to the neglect and a lack of communication and asked to partially reimburse the money for the case that he misrepresented. He wrote",
        "author": "Voltvix",
        "url": "https://i.redd.it/9at7ewid677a1.jpg",
        "text": "",
        "created_utc": 1671587000,
        "upvote_ratio": 1.0
    },
    {
        "title": "SCOTUS Clerk -- How to Succeed at Law School",
        "author": "Grouchy_Kale4999",
        "url": "https://www.reddit.com/r/LawSchool/comments/zr6lm8/scotus_clerk_how_to_succeed_at_law_school/",
        "text": "[removed]",
        "created_utc": 1671586600,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any suggestions for securing interships?",
        "author": "Traditional-Wave-724",
        "url": "https://www.reddit.com/r/LawSchool/comments/zr6i73/any_suggestions_for_securing_interships/",
        "text": "I’m a 2L who had a rather rough patch during 1L as I had to work fulltime to support myself. My gpa is a 2.8 &amp; aim at tier 3 school. Any tips or suggestions in obtaining an internship in corporate law? Specifically litigation.",
        "created_utc": 1671586333,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L SA from Regional School with no Diversity",
        "author": "PsychologicalKnee874",
        "url": "https://www.reddit.com/r/LawSchool/comments/zr6am1/1l_sa_from_regional_school_with_no_diversity/",
        "text": "I'm a 1L at a T30 that places ok, but not great, in biglaw. I'm also white and don't really have anything about me that would qualify for a diversity position. I felt good about finals, but don't have grades back yet -- although I do know that I will be getting an A or A- in legal writing because they give us back the grades and the medians throughout the semester. Finally, i'm a KJD. I served/bartended in college, and wrote a cool legal related senior thesis, but I don't have any significant legal work experience that would set me apart.\n\nShould I mass apply for 1L summer associate positions? I don't know if it's worth the time and effort, since i'm not T14 and not diverse. Does anyone here have an experience getting a 1L SA with nothing special about them? I'd be ok working in pretty much any state.",
        "created_utc": 1671585757,
        "upvote_ratio": 1.0
    },
    {
        "title": "Penn State professors, students raise concerns about a proposal to merge its law schools",
        "author": "Ok_Turnover_7739",
        "url": "https://www.inquirer.com/news/penn-state-law-schools-merge-dickinson-20221220.html",
        "text": "",
        "created_utc": 1671580868,
        "upvote_ratio": 1.0
    },
    {
        "title": "law review topic",
        "author": "rlsathrowaway899",
        "url": "https://www.reddit.com/r/LawSchool/comments/zr27p2/law_review_topic/",
        "text": "I literally have not used reddit since my admissions cycle last year which tells you how down bad I am ... I am at a complete loss when it comes to selecting a law review topic to write on in the spring. I feel like any time I come across something I'm interested in, I go down a research rabbit hole and then end up at square 1 feeling like the topic is inadequate.... Any suggestions are greatly appreciated!",
        "created_utc": 1671576403,
        "upvote_ratio": 1.0
    },
    {
        "title": "Present for brother in law school!! Ideas??",
        "author": "steponitpatrick",
        "url": "https://www.reddit.com/r/LawSchool/comments/zr0xv3/present_for_brother_in_law_school_ideas/",
        "text": "Hi yall! My super-smart brother is in his first year of law school at one of the top 20 law schools. I wanted to get him a gift for the holidays but didn't know what would be the best gift for a law student. So I wanted to ask this subreddit-- what would be a gift related to law school that you guys would LOVE to get ?? Tangible or not tangible-- it could be a subscription to a good study platform, law decor,  super cool historic law reference, a law-related shirt, a reference to an inside joke amongst the law community, or something he might use in class. My brother is someone that can buy anything so I'm really looking for something thoughtful, something that he'd be like \"how'd you know about this!\" \n\nAbout him-- first he wanted to go into politics, then he was thinking more hollywood/comedy legal issues (idk?), and now I think he wants to eventually be governer. (I know nothing about law, I'm a med student lol) he's big into reading philosophy and abstract thinking. he likes tech gadgets and really efficient note-taking apps. he's going to go on a trip with other law student friends on spring break.\n\nIf tangible, preferably something on amazon (so that it ships fast) or something I could find at a mall, but if not I could just say its coming in the mail! Anything helps! good luck with your studies! \n\nFor budget, ideally, like 50 bucks, but nothing more than 100 bucks, please! (he's not getting me anything lol)",
        "created_utc": 1671573356,
        "upvote_ratio": 1.0
    },
    {
        "title": "Penn State professors, students raise concerns about a proposal to merge its law schools",
        "author": "Ok_Turnover_7739",
        "url": "https://www.inquirer.com/news/penn-state-law-schools-merge-dickinson-20221220.html",
        "text": "",
        "created_utc": 1671568717,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on dating a girl you met in undergrad but both of you are now in law school? How to ask her out?",
        "author": "24ktgoldfish",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqykpj/thoughts_on_dating_a_girl_you_met_in_undergrad/",
        "text": "We just graduated so its not like 5 years later. I really liked her in undergrad and still do and view her LinkedIn like everyday. Maybe she likes me back as she is one of the few females in my life that would say Hi to me and smile at me etc back in undergrad. But we were never close (thanks COVID). How should I approach her? We're both 1Ls at different schools, but what holds me back is that she is in a much better school than me that she now has way better guy options (she's in like a t14 and I am like a t22 and she's super hot and cute). I was talking to friends about maybe DMing her crim hypos as an excuse to ask her out but another friend said that is downright creepy. I could also apply to transfer to her school if her t14 would take me or to an unranked school closer to her location so there's a greater chance of running into her. She's way out of my league and if she likes me back I would be the luckiest guy ever but I also think maybe she will never like me anymore since she has way better options and guys closer to her league **Also is it normal to date people you met in undergrad but never dated in undergrad. PS. I CALI'd contracts and have a 3.9 gpa if you guys think that will impress her**",
        "created_utc": 1671567716,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dealing with a disappointing grade",
        "author": "Fast-Introduction-83",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqxody/dealing_with_a_disappointing_grade/",
        "text": "I, a 2L, just received my final grade from a class and received a \"C\" in said class. I am typically a B+ average student, and everyone else was boasting about how they received A, A-, B+, etc. in this class in our class groupme. I truly do not know where I went wrong, but this is frustrating me to no end and I can't seem to shake it. I don't know what is worse, the fact that I got this grade when I truly felt like I gave it my all or the fact that people are bragging about their grades, making me feel more and more inadequate. I'd love some advice about how to deal with this, and if anyone else has gone through this. Thanks and Happy Holidays",
        "created_utc": 1671565557,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best classes for “dinner party questions”?",
        "author": "dm7tc7dc",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqxfln/best_classes_for_dinner_party_questions/",
        "text": "I frequently hear that there are some electives in 2L and 3L that are good to take for general life/social purposes. I hear of them being referred to as “dinner party topics” (as friends and family seem to casually solicit legal advice during social gatherings). What do you get asked about most? Wills and estates, tort law, etc.? I’m curious as to what I should look into, in addition to 1L courses and traditional transactional law areas. \n\nThanks guys!",
        "created_utc": 1671564965,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on dating a girl you met in law school but both of you already graduated? How to ask her out?",
        "author": "pinetreeomo",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqxf7f/thoughts_on_dating_a_girl_you_met_in_law_school/",
        "text": "We just graduated so its not like 5 years later. I really liked her in law school and still do and view her Instagram like everyday. Maybe she likes me back as she is one of the few females in my life that would say Hi to me and smile at me etc back in law school. But we were never close (thanks COVID). How should I approach her? We work in the same city in BL, but what holds me back is that she is in a much better firm than me that she now has way better guy options (she's in like a V10 and I am like a V50 and she's super hot and cute). I was talking to friends to maybe do a networking coffee chat as an excuse to ask her out but another friend said that is downright creepy. I could also apply to lateral to her firm if her V10 would take me or to a firm closer to her level so there's a greater chance of working together on opposite sides.",
        "created_utc": 1671564936,
        "upvote_ratio": 1.0
    },
    {
        "title": "1L Summer Jobs - I know nothing about them",
        "author": "Cromus",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqxcgf/1l_summer_jobs_i_know_nothing_about_them/",
        "text": "1L at Cornell. I feel like I'm totally out of the loop. My grades are probably going to be average, and I'm not looking for anything prestigious. Just something to get a little experience. I don't really care what it is.\n\nWhere can I look to find out what my options are? Are there many remote summer jobs?",
        "created_utc": 1671564756,
        "upvote_ratio": 1.0
    },
    {
        "title": "Protocol for following up with judicial externship",
        "author": "prick_lypears",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqwjku/protocol_for_following_up_with_judicial_externship/",
        "text": "Hey! So I got everything set up on my end to begin my externship with a federal magistrate judge. I was extended the offer in the spring. Whatever correspondence I have done has been directly with the judge. However, after setting up the last little bits in November, I haven’t heard anything about onboarding. This worries me since I’m supposed to start 01/02. Should I send an email to the judge as a reminder, or should I wait to hear something? I don’t want to wait too long since the holidays are coming up. Any recommendations?\n\nThanks in advance.",
        "created_utc": 1671562848,
        "upvote_ratio": 1.0
    },
    {
        "title": "UGA Culture",
        "author": "Legal_Pay2421",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqwg7v/uga_culture/",
        "text": "How would any UGA students classify UGA culture? Is it a good environment for KJD’s???",
        "created_utc": 1671562647,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with navigating my tiger mom",
        "author": "Rude-Telephone2802",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqw3gf/help_with_navigating_my_tiger_mom/",
        "text": "Once I graduated from Princeton (4.0) and got into YLS, I thought my problems were over. My mom is obsessed with me being #1 at everything I do, and up to this point in my life, I always have been (valedictorian/good looking). That all changed when I told my mom I had accepted SA position at a AmLaw1 firm. At first, my mom couldn’t have been more pleased with me, and I finally felt like I had brought honor to my family. Then, my mom discovered the Vault rankings. When she realized I hadn’t accepted a job at Cravath and only Kirkland, she told me I shouldn’t bother coming home for Christmas. Thoughts?",
        "created_utc": 1671561797,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lemon Law",
        "author": "Evening_Activity1499",
        "url": "https://californialemonlawcenter.com/lemon-law/",
        "text": "",
        "created_utc": 1671560406,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sup cuties",
        "author": "ButterscotchOk8322",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqu5f9/sup_cuties/",
        "text": "Anyone else a 3L who genuinely hates law school / doesn’t care about being a lawyer anymore but just stuck with the trajectory in life bc of ego :-) (——:",
        "created_utc": 1671557120,
        "upvote_ratio": 1.0
    },
    {
        "title": "OCI References",
        "author": "Creative-Shine-5002",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqssxx/oci_references/",
        "text": "do you need professional references for OCI? if so, how many? could you use professors from college if your professional work experience is limited? or a volunteer org?",
        "created_utc": 1671553837,
        "upvote_ratio": 1.0
    },
    {
        "title": "If my gf’s house burned down, would that be a good excuse to delay taking exams?",
        "author": "easyeerie",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqsn68/if_my_gfs_house_burned_down_would_that_be_a_good/",
        "text": "On a claim of emotional distress?",
        "created_utc": 1671553443,
        "upvote_ratio": 1.0
    },
    {
        "title": "Appealing to the Faculty After a Missed Exam",
        "author": "ikebrofloski",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqs7c5/appealing_to_the_faculty_after_a_missed_exam/",
        "text": "Hello All, \n\nI'm looking for some guidance. I misread our finals schedule and missed an exam. The school had me take a makeup a week later, but I have to appeal my incomplete to the school in order for them to apply the grade and let me keep the credits. \n\nFor the record, my first kid was born on October 26th, and she's a lazy eater. Basically, for the 6 weeks between baby being born and the final I missed, we had to feed her every hour. I was so tired and disoriented that I misread a section number on the school's finals schedule, and therefor fucked up making my own finals schedule.\n\nDoes anyone have experience with this kind of thing? Any incite is welcome. Thanks.",
        "created_utc": 1671552349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Giving a bullshit answer to your professor’s bullshit question &gt;&gt;",
        "author": "SnooMarzipans9781",
        "url": "https://i.redd.it/xwn1myx7b47a1.jpg",
        "text": "",
        "created_utc": 1671552326,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did everyone start prepping for the LSAT?",
        "author": "toanewbeginningwithu",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqrqc9/when_did_everyone_start_prepping_for_the_lsat/",
        "text": "",
        "created_utc": 1671551180,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does it mean when a inmate requires a coordinated release from jail after a motion to dismiss?",
        "author": "JTcards76",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqrg9q/what_does_it_mean_when_a_inmate_requires_a/",
        "text": "",
        "created_utc": 1671550472,
        "upvote_ratio": 1.0
    },
    {
        "title": "What bachelor degree would work for a paralegal but also as prelaw?",
        "author": "emaji33",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqreju/what_bachelor_degree_would_work_for_a_paralegal/",
        "text": "So quick background.  College dropout.  Checked and I have 79 credits at my old college (I know, I should've just finished).  I'm flirting with the idea of going back to school with the eventual intention of going to law school. I thankfully have free time for summer and fall classes.    \nAfter consulting with a friend, they put the idea of working as a paralegal under a lawyer for some time while I finish school.  From what I see, paralegal degrees tend to be associates, which would make no sense as I'm already at 79 credits (though I would expect a few classes may not transfer).  Are there any 4 year degrees that would allow me to become a paralegal?  My prefrence would be to study at a CUNY or SUNY school if at all possible.",
        "created_utc": 1671550349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for inexpensive legal attire",
        "author": "TheShakyPlayer",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqqj7e/looking_for_inexpensive_legal_attire/",
        "text": "Good news, I've passed the bar!\n\nI'm looking for a court gown for my clerkship and they seem to be mad expensive. I've asked around and there seems to be only 3 stores in my area and I can't afford the cheapest one. \n\nI've been thinking about buying a black graduation gown until I have more money. They are a bit different and I don't want to look like a fool in court.\n\nIf any Canadian or even French law students here know where to get a cheap gown I'd really appreciate it.",
        "created_utc": 1671548124,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you need a works cited page for bluebook",
        "author": "aaavvvvv",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqqbr6/do_you_need_a_works_cited_page_for_bluebook/",
        "text": "Writing an essay for a class that’s mostly secondary sources &amp; using bluebook footnotes. Do I need to make any kind of works cited page?? I opted out of doing any journal and am clueless thank you 🙏",
        "created_utc": 1671547552,
        "upvote_ratio": 1.0
    },
    {
        "title": "Negotiating a salary as a 3L",
        "author": "MidnightOutrageous38",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqp26z/negotiating_a_salary_as_a_3l/",
        "text": "I'll keep it brief and give you the details:\n\n* Trial attorney, personal injury insurance defense for a major insurance company\n* Philadephia, PA\n* $98,000 salary\n* 24 days PTO\n* After I am sworn in, reimbursement for bar prep and bar exam\n* Starts paying me the week after graduation, but my only job duty is studying for the bar\n* Medical, dental, vision, 401k - the usual for a large company\n* I have been law clerking for a direct competitor but in a different state, so this job aligns with my experience.  I \n* I honestly **do not care** what kind of law work I do as long as it pays well, but would prefer a better work/life balance than a big law firm would offer.\n\nI know all the benefits surrounding this job are excellent (especially the bar prep pay and reimbursement).  I was a public school teacher before going to law school, so salary negotiation is completely new to me.\n\nAm I expected to negotiate this salary?  Or is it a good offer that I should accept immediately?\n\nI don't know what my insecurity is.  As a Hispanic female I am always worried about getting screwed for salary because people think my expectations are low (and to be honest, they are).  But I want to get what I'm worth.  I keep googling salary comparisons, but depending on the source $98k is under, over, or exactly average.\n\n(If this is not a good topic for r/lawschool, sorry!)",
        "created_utc": 1671544286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do uGPA matter for 1L diversity fellowships?",
        "author": "rowtrieslaw",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqnomj/do_ugpa_matter_for_1l_diversity_fellowships/",
        "text": "For the firms that lets you apply without fall grades (at least for the time being) still requires an undergrad transcript. My GPA is okay but not competitive and my unofficial transcript doesn’t say my ranking (just my GPA and various semester honors such as deans list). I feel like most people applying to these big law positions have at least a 3.8 uGPA. So am I just panicking about nothing? I just feel like besides my personal/diversity statement and resume, there’s not a lot to review.",
        "created_utc": 1671540752,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any way to find a list of ALL law firms in specific city?",
        "author": "comfylaser",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqlzwk/any_way_to_find_a_list_of_all_law_firms_in/",
        "text": "Does the government not have to register law firms separately somehow, than other businesses?",
        "created_utc": 1671535602,
        "upvote_ratio": 1.0
    },
    {
        "title": "0L Tuesday Thread",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqlj7y/0l_tuesday_thread/",
        "text": " \n\nWelcome to the 0L Tuesday thread. Please ask pre-law questions here (such as admissions, which school to pick, what law school/practice is like etc.)\n\nRead the [FAQ](http://www.reddit.com/r/lawschool/wiki/faq/). Use the search function. Make sure to list as much pertinent information as possible (financial situation, where your family is, what you want to do with a law degree, etc.). If you have questions about jargon, check out the [abbreviations glossary](https://www.reddit.com/r/LawSchool/wiki/abbreviations).\n\nIf you have any pre-law questions, feel free join our [**Discord Server**](https://discord.gg/Qhxy4sF) and ask questions in the 0L channel.\n\n**Related Links:**\n\n* [Official LSAC Admissions Calculator](https://officialguide.lsac.org/release/ugpalsat/ugpalsat.aspx) (self explanatory, presumably sources data from previous admissions cycles, likely larger pool of data too. Useful for non-splitters).\n* [Unofficial LSN Admissions Calculator](http://mylsn.info/) (uses crowdsourced LSN data to calculate % admissions chances).\n* [Law School Numbers](http://www.lawschoolnumbers.com/) (for admissions graphs and crowdsourced admissions data).\n* [LST Score Reports](https://www.lstreports.com/) (for jobs data for individual schools)\n* [List of Guides and Other Useful Content for Rising 1Ls](https://www.reddit.com/r/LawSchool/comments/95mxgz/aggregated_content_for_1ls_from_around_the_forums/)\n* [TLS Biglaw Placement Class of 2016](http://www.top-law-schools.com/forums/viewtopic.php?f=1&amp;t=276222) | [TLS Biglaw Placement Class of 2015](http://top-law-schools.com/forums/viewtopic.php?f=1&amp;t=262376) | [NLJ250 Class of 2010](http://pdfserver.amlaw.com/nlj/goto%20law%20schools_main.pdf) | [NLJ250 Class of 2009](http://pdfserver.amlaw.com/nlj/law%20schools_charts_page12.pdf) | [NLJ250 Class of 2008](http://www.law.com/img/nlj/charts/20090223gotoschools.jpg) | [NLJ250 Class of 2007](http://www.law.com/img/nlj/charts/20080414gotoschools.jpg) | [NLJ250 Class of 2005](http://pdfserver.amlaw.com/nlj/20080414employment_trends.pdf)\n* [/r/LawSchoolAdmissions 2016 Biglaw and Employment Data](https://www.reddit.com/r/lawschooladmissions/comments/643pwm/2016_aba_employment_reports/) (includes 200 law schools)\n* [TLS School Medians Class of 2020](https://docs.google.com/spreadsheets/d/1XfblJqji8wlaCbc9cUTAheOsZPRRaP_hyWafn3NEYQE/edit#gid=299903710).\n\n**Related Subreddits:**\n\n* [r/LawschoolAdmissions](https://www.reddit.com/r/LawschoolAdmissions/)\n* [r/LSAT](https://www.reddit.com/r/LSAT/)",
        "created_utc": 1671534012,
        "upvote_ratio": 1.0
    },
    {
        "title": "3L submitting assignment late",
        "author": "saltpork29",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqhpfz/3l_submitting_assignment_late/",
        "text": "Alright. I am 3L with an articling job lined up. \n\nI just submitted a final paper worth 60% of my mark today. It has a 5% late penalty on it already. After a busy 2L summer I really took my foot off the pedal at the end of this semester due to a lack of motivation. \n\nAfter submitting tonight I noticed a few spelling errors. Overall the paper could be better and I’ve done much better work. I generally do well on papers but I am not very confident of this one.\n\nThe question: Do I bang out a strong draft and take another 5% late penalty, or pray for curve to bless me with a B?",
        "created_utc": 1671520668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bs/B- and school curves on B+",
        "author": "Big-Storage-2060",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqg04z/bsb_and_school_curves_on_b/",
        "text": "I got a B in all my first-semester doctrinal, and a B- in legal writing, how fucked am I? My law school curves at a B+ so am I below average in my doctrinals?",
        "created_utc": 1671515394,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Closely do Law Schools look at Academic Performance?",
        "author": "Revanish",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqe6x7/how_closely_do_law_schools_look_at_academic/",
        "text": "I'm 27 and have been highly successful in my work (software). If we equate success to money $5mil. The issue is that I dropped out of college twice to pursue 2 startups. I never withdraw and was academically disqualified. I eventually got my degree in computer science by taking courses after work. I did okay \\~3.34 gpa. Assume my LSAT is 90th percentile or 165+. Do you think I can get into a good/following law schools?   \n\n\n1) Columbia  \n2) NYU  \n3) Northwestern  \n4) UC San Diego  \n\n\nI am extremely passionate about reforming the legal system and aspire to become a judge.",
        "created_utc": 1671510142,
        "upvote_ratio": 1.0
    },
    {
        "title": "BPA undergrad for law school?",
        "author": "Ok-Boysenberry8718",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqcy9u/bpa_undergrad_for_law_school/",
        "text": "Currently exploring my undergrad options and I am intrigued by a bachelor of public administration. Would this prepare me for law school?",
        "created_utc": 1671506797,
        "upvote_ratio": 1.0
    },
    {
        "title": "Letters of Recommendation vs. References",
        "author": "Rustadk",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqcvrz/letters_of_recommendation_vs_references/",
        "text": "When you were applying for summer, did many firms require a letter of rec? Or was it predominantly references?",
        "created_utc": 1671506617,
        "upvote_ratio": 1.0
    },
    {
        "title": "Considering applying to law school",
        "author": "gabigail70",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqc982/considering_applying_to_law_school/",
        "text": "I’m 30 and received my undergrad degree earlier this year. My GPA is not the best due to serious health issues during my time in undergrad, but I’m intelligent, ambitious, and test well. Do I still have a chance? Also, since I’m an adult who fully supports herself and has no option but to work full-time, I’m considering the night class track. Is this a recipe for failure or is it doable? \n\nAdditionally, any general tips?",
        "created_utc": 1671504922,
        "upvote_ratio": 1.0
    },
    {
        "title": "Class curve with multiple assignments",
        "author": "Abject_Luck_9283",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqbfl5/class_curve_with_multiple_assignments/",
        "text": "Hi all, one of my classes had many other assignments throughout the semester so the final was only worth 40%. How would the class curve work in this situation if it doesn't really come down to just the final? (most people have earned high grades on the mini assignments as he graded them pretty leniently)",
        "created_utc": 1671502839,
        "upvote_ratio": 1.0
    },
    {
        "title": "102.6 degree fever",
        "author": "EmbroideredTurtle",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqb891/1026_degree_fever/",
        "text": "I have a paper due Wednesday (already got an extension from being sick). I also have a 102.6 degree fever and am not feeling too coherent. Valid to ask my prof for an extra day or two? Or should I see if it gets worse/wait until I actually have to go to the ER?",
        "created_utc": 1671502304,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scholarship program for law student",
        "author": "No-Option4232",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqb2n4/scholarship_program_for_law_student/",
        "text": " \n\nHi, I am a third year law student from Central America and I have heard from older students and alumnis of my university that there are several scholarship programs for law students that provide financial aid for the tuition of their career and mentorship.\n\nDoes anyone know any international scholarship program directed to law students to which I could apply? If you could also explain me the application process in a general way I would appreciate it.\n\nThank you in advance.",
        "created_utc": 1671501919,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Law Library printer couldn't handle finals",
        "author": "Brosbrawls",
        "url": "https://i.redd.it/bumzqln6107a1.jpg",
        "text": "",
        "created_utc": 1671500510,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did you determine law school was worth it?",
        "author": "dm7tc7dc",
        "url": "https://www.reddit.com/r/LawSchool/comments/zqa6u8/how_did_you_determine_law_school_was_worth_it/",
        "text": "Of course, “worth it” is subjective... But other than lurking subs, researching the field, and reaching out to family friends, I don’t know how else to make damn sure this is something I want to get myself into. I want to go with my gut, based off everything I’ve learned thus far. But dude that is risky! Does anyone ever *really* know what they’re getting themselves into? Especially having never tried it? \n\nFor context: Currently finishing my masters (MBA), have minimal work experience, but living in a major city. Should I look into legal-related internships? I’m worried they would not exactly give me a taste of the realistic transactional field of law. \n\nAny thoughts are appreciated! Thanks guys.",
        "created_utc": 1671499721,
        "upvote_ratio": 1.0
    },
    {
        "title": "best inexpensive law school in mississippi?",
        "author": "Alarmed-Account494",
        "url": "https://www.reddit.com/r/LawSchool/comments/zq8za5/best_inexpensive_law_school_in_mississippi/",
        "text": "i'm in hs and plan to be a lawyer but i'm poor so i wanted to ask what's the best cheap law school in ms",
        "created_utc": 1671496739,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mesures taken by the UN Security Counsil",
        "author": "Odjikaya",
        "url": "https://www.reddit.com/r/LawSchool/comments/zq8gut/mesures_taken_by_the_un_security_counsil/",
        "text": "Does a member of the UN have an obligation to uphold the decisions and coercive mesures taken by the SC in the case of a menace to the peace? These decisions are obligations or only recommandations?",
        "created_utc": 1671495543,
        "upvote_ratio": 1.0
    },
    {
        "title": "Professor posted the syllabus for a spring class",
        "author": "strawblip",
        "url": "https://www.reddit.com/r/LawSchool/comments/zq80i2/professor_posted_the_syllabus_for_a_spring_class/",
        "text": "him: …. this class has a closed book exam…\nme, a 3L: nope, goodbye I was never here farewell",
        "created_utc": 1671494421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Law Clerk Position - Baltimore City SOA",
        "author": "PowerfulEast6585",
        "url": "https://www.reddit.com/r/LawSchool/comments/zq7ozx/law_clerk_position_baltimore_city_soa/",
        "text": "Does anyone have any experience with the Baltimore City State’s Attorney Office? I’m currently a first-year evening student and looking for a new day job. I have an interview this week for a Law Clerk position and I’m curious if anyone has any experience with their hiring process or work culture.\n\nTYIA!",
        "created_utc": 1671493640,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lawsuit?",
        "author": "No-Beat861",
        "url": "https://www.reddit.com/r/LawSchool/comments/zq77mh/lawsuit/",
        "text": "okay so, my friend works at mcdonald’s and another employee walked up to him talking abt how my friend has beef with one of his friends. my friend told them they have no beef it’s settled and the guy just kept talking. My friends manager ( who is 17 idk if that’s illegal or not) was tryin to insinuate the fight which i don’t think is right for a manager. one of the other managers walked up and then told my friend to leave and clock out.. so my friend did just that , clocked out and left. my friend then mentioned to me how the guy was going to pull up on him so my friend waited outside for 30 mins , went back inside and said what happened to your friend coming ? is he not coming? mind you he’s clocked out so i don’t know if that matters or not since technically he’s not working and clocked in i figured he can go in there. then the manager walked up and then told him he’s fired ??? is that even aloud ? can he be fired for no apparent reason ? or notice ? my friend on top of that was working to pay stuff and now he can’t ? all i’m wanting to know is can he file for a lawsuit or even for emotional distress as well",
        "created_utc": 1671492527,
        "upvote_ratio": 1.0
    },
    {
        "title": "applying to federal judges",
        "author": "km131248",
        "url": "https://www.reddit.com/r/LawSchool/comments/zq69k7/applying_to_federal_judges/",
        "text": "do most federal judges want 1L grades when you send in the application materials? ive heard conflicting things here and am wondering. specifically looking into eastern district of pa",
        "created_utc": 1671490299,
        "upvote_ratio": 1.0
    },
    {
        "title": "When do y’all start and finish ur readings for next semester?",
        "author": "Primary-Force-405",
        "url": "https://www.reddit.com/r/LawSchool/comments/zq604s/when_do_yall_start_and_finish_ur_readings_for/",
        "text": "I haven’t gotten any of my books yet am I behind?!?!? Be honest pls 😭😵‍💫🤢🤮 \n\n/s",
        "created_utc": 1671489670,
        "upvote_ratio": 1.0
    },
    {
        "title": "judge political party",
        "author": "km131248",
        "url": "https://www.reddit.com/r/LawSchool/comments/zq4dkj/judge_political_party/",
        "text": "is it worth applying to judges nominated by democratic presidents or judges that are democrats if i have work on my resume with republican party/candidates? I’m currently an independent but i left these items on my resume because it is essentially all my experience from undergrad and im kjd. im wondering if its a dealbreaker for these judges making it not worth applying",
        "created_utc": 1671485913,
        "upvote_ratio": 1.0
    },
    {
        "title": "BLUEBOOK IS HELL",
        "author": "Simple_Reveal_9594",
        "url": "https://www.reddit.com/r/LawSchool/comments/zq48ls/bluebook_is_hell/",
        "text": "1L - exhausted - and having to learn citation, with all the resources out there, seems dumb as fuck. Is everyone learning citation old school style - that damn Blue Book - or is there a source out there that takes makes this a cinch? If going old school - I’m open to hearing why it’s best. Absolutely not seeing it however. If have sites, sources, PLEASE share.",
        "created_utc": 1671485593,
        "upvote_ratio": 1.0
    },
    {
        "title": "Professor enabled an option that let us see our raw multiple choice score after submitted our final exam.",
        "author": "Far_Regret8870",
        "url": "https://www.reddit.com/r/LawSchool/comments/zq43it/professor_enabled_an_option_that_let_us_see_our/",
        "text": "That is all. Pain.",
        "created_utc": 1671485263,
        "upvote_ratio": 1.0
    },
    {
        "title": "The three worst words on Symplicity",
        "author": "angie3-141592",
        "url": "https://www.reddit.com/r/LawSchool/comments/zq3l10/the_three_worst_words_on_symplicity/",
        "text": "\"Apply on website\"",
        "created_utc": 1671484049,
        "upvote_ratio": 1.0
    },
    {
        "title": "Closed book torts exam and have to cite to cases we read",
        "author": "Pink_Guppy",
        "url": "https://www.reddit.com/r/LawSchool/comments/zq3ezp/closed_book_torts_exam_and_have_to_cite_to_cases/",
        "text": "My outline is done and my exam is on Thursday. How do I memorize all this stuff before then?",
        "created_utc": 1671483667,
        "upvote_ratio": 1.0
    },
    {
        "title": "Under UCC § 2-207, if conflicting terms are *material* what does this mean?",
        "author": "Weekly-Quantity6435",
        "url": "https://www.reddit.com/r/LawSchool/comments/zq32yj/under_ucc_2207_if_conflicting_terms_are_material/",
        "text": "Failure of mutual assent? \n\nFor example, if there are additional terms (that would alter the price of contract) stated between offer and acceptance, the offeror does nothing about the terms, later comes acceptance... is this a binding contract? Or would there be failure of mutual assent \n\n\nThanks",
        "created_utc": 1671482899,
        "upvote_ratio": 1.0
    },
    {
        "title": "Winter break?",
        "author": "Fluffy_Air_3682",
        "url": "https://www.reddit.com/r/LawSchool/comments/zq2pwm/winter_break/",
        "text": "Now that I’m done with finals and caught up on sleep, I’m realizing that I don’t know how to fill my days. For the last few months, my life has revolved around law school and I don’t know what to do in my free time. Have other people dealt with this? Does anyone have suggestions?",
        "created_utc": 1671482031,
        "upvote_ratio": 1.0
    },
    {
        "title": "MPRE on resume?",
        "author": "Pretend-Battle2280",
        "url": "https://www.reddit.com/r/LawSchool/comments/zq26q3/mpre_on_resume/",
        "text": "Hi all, 2L here. Do people usually put they passed the MPRE on their resume? I know it's not as serious as the bar lol, but since we're students still and I'm applying for summer jobs, I'm unsure what the etiquette is. Thanks!",
        "created_utc": 1671480759,
        "upvote_ratio": 1.0
    },
    {
        "title": "A motion I wrote over the summer finally got argued and the attorney I wrote it for won! This is my first win, and I’m thrilled! ⚖️",
        "author": "OrphanInABatCostume",
        "url": "https://www.reddit.com/r/LawSchool/comments/zq1z8o/a_motion_i_wrote_over_the_summer_finally_got/",
        "text": "",
        "created_utc": 1671480286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Didn't Finish Crim Law Final",
        "author": "apple3089",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpzunl/didnt_finish_crim_law_final/",
        "text": "[removed]",
        "created_utc": 1671475498,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just finished my 1L semester and I owe my life to CALI",
        "author": "akechicat",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpz8rx/just_finished_my_1l_semester_and_i_owe_my_life_to/",
        "text": "I was like a lost puppy before I saw someone on reddit suggest CALI. If I hadn't done this study resource I don't think I woulda made it. \nI won't be donating to any institutions in the future but boy I would give CALI so much money to show my gratitude.",
        "created_utc": 1671474161,
        "upvote_ratio": 1.0
    },
    {
        "title": "I may be at the bottom of my class.... but I got an A in Evidence and Conflicts of Law.",
        "author": "lemur_queen7",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpz4pi/i_may_be_at_the_bottom_of_my_class_but_i_got_an_a/",
        "text": "That's all. Just bragging :,)",
        "created_utc": 1671473912,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Biglaw doable from UIowa?",
        "author": "LegEnvironmental3715",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpz46f/is_biglaw_doable_from_uiowa/",
        "text": "Got accepted to UIowa(my safety), if I don't get in anywhere else is biglaw doable from UIowa? More specifically, how would UIowa go over with V20 firms? I'm thinking specifically K&amp;E in Chicago.",
        "created_utc": 1671473879,
        "upvote_ratio": 1.0
    },
    {
        "title": "making students take exams before 10:00 a.m. is homophobic",
        "author": "fractaltide",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpxqt3/making_students_take_exams_before_1000_am_is/",
        "text": "iykyk 😤",
        "created_utc": 1671470868,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dress code for big law holiday receptions?",
        "author": "Gnaeus-Philosophy351",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpxe0z/dress_code_for_big_law_holiday_receptions/",
        "text": "Idk if I should wear a suit or not?",
        "created_utc": 1671470072,
        "upvote_ratio": 1.0
    },
    {
        "title": "2L public interest summer job",
        "author": "iwasthreatened",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpxdmt/2l_public_interest_summer_job/",
        "text": "Hi all, I am reaching out here because my career advisor is not answering any emails. I have some summer public interest jobs I want to apply to but I was not sure whether to send them in now, or to wait for my fall semester grades so I wanted to get a sense of any consensus on how PI generally works. I don't want to wait and have the job fill up, but also I feel like they would want my fall 2L grades.",
        "created_utc": 1671470047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me at Cornell",
        "author": "Cromus",
        "url": "https://i.redd.it/rhfx3zhevv6a1.png",
        "text": "",
        "created_utc": 1671468144,
        "upvote_ratio": 1.0
    },
    {
        "title": "If braindead legal takes were albums, this would be Revolver or Pet Sounds.",
        "author": "garrettgravley",
        "url": "https://i.redd.it/hxe3q048uv6a1.png",
        "text": "",
        "created_utc": 1671467792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Making studying fun!",
        "author": "JasjePaktJe",
        "url": "https://i.redd.it/i72ipm19ax6a1.jpg",
        "text": "Hi everyone! I had to drop out of lawschool last year mainly because of my ADHD, now I’m trying to turn my biggest flaw into an idea to help others with the same problem. That’s why I decided to make a free mobile game that combines studying with gaming so productivity will be fun ( hopefully ). The game is called study buddies and the beta is now on the play store. You collect cute and cool monsters by staying away from your phone while you’re being productive :) If you decide to try it out, please give me some feedback so I can improve the game, I want it to be multiplayer in the future so you can study together with friends.",
        "created_utc": 1671467238,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone notice a striking similarity between 60 Minutes Havana Syndrome and Voices at Lourdes? Modern Day witchcraft plain and simple. Is this common among people's enemies?",
        "author": "Alternative-Pen-639",
        "url": "https://www.cbsnews.com/video/sanctuary-of-our-lady-of-lourdes-miracles-cures-video-2022-12-18/",
        "text": "",
        "created_utc": 1671467135,
        "upvote_ratio": 1.0
    },
    {
        "title": "USAO interview",
        "author": "km131248",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpupqt/usao_interview/",
        "text": "any tips for interview for usao for 1L summer positions?",
        "created_utc": 1671464068,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a police report with the answers to a defendant's police interview questions hearsay?",
        "author": "LawNdOtherLawyerings",
        "url": "https://www.reddit.com/r/LawSchool/comments/zptthx/is_a_police_report_with_the_answers_to_a/",
        "text": "Say the officer who wrote the report and conducted the interview is on the stand but cannot remember the contents of the report. The prosecution seeks to enter the report into evidence. Can defense counsel make a successful hearsay objection and bar the report from getting into evidence?\n\n&amp;#x200B;\n\nI think the answer is no because the defendant's statements to police are admissions. But I am wondering if the fact that it is all in a report changes things? Is the declarant no longer the defendant but the officer who wrote the report? Not sure.",
        "created_utc": 1671461981,
        "upvote_ratio": 1.0
    },
    {
        "title": "Law professors, how did you get your start as a law professor?",
        "author": "LivingTheDream_10000",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpt40o/law_professors_how_did_you_get_your_start_as_a/",
        "text": "[removed]",
        "created_utc": 1671460244,
        "upvote_ratio": 1.0
    },
    {
        "title": "How common is it to get a C in law school?",
        "author": "Bright-March5802",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpshrw/how_common_is_it_to_get_a_c_in_law_school/",
        "text": "Is this a universal experience? Trying to mentally prepare myself just in case.",
        "created_utc": 1671458761,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips/ideas/help for someone going to law school in the US who will likely need to move abroad?",
        "author": "nedcurlux",
        "url": "https://www.reddit.com/r/LawSchool/comments/zps87w/tipsideashelp_for_someone_going_to_law_school_in/",
        "text": "Figured I would ask here while also doing my own research, but I’m hoping someone will have some advice or experience for my situation. \n\nI’m a 1L and looking at clerkships for for this summer but I’m hesitating on what area of law to get some experience in, knowing I will most likely move abroad relatively soon after finishing law school. My husband is active duty military so we don’t get much of a choice in where or when we move, we’ve just been promised we can stay until I finish my degree. \n\nI feel like it’s not a great idea for me to go into something like criminal or family law because that’s very US and even state specific. But I also feel like corporate is so broad that’s it’s too vague for me to get actually helpful relevant experience. But I could also be totally wrong because I only have like 12 weeks of law school experience. \n\nAny help or advice is appreciated!",
        "created_utc": 1671458136,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are y’all reading/playing over the winter break?",
        "author": "ItzLeoo",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpq0kp/what_are_yall_readingplaying_over_the_winter_break/",
        "text": "We all deserve some rest. What’s something you’re reading or playing? If that doesn’t apply to you, are you traveling? What are your plans. In part, I want ideas on what to do but I’m also curious to see how much overlap we all have.\n\nI’m playing Elden Ring and looking for book recommendations.",
        "created_utc": 1671452142,
        "upvote_ratio": 1.0
    },
    {
        "title": "Travelling with a Canadian Criminal Record",
        "author": "Legitimate_Insect617",
        "url": "https://www.reddit.com/r/LawSchool/comments/zppvmj/travelling_with_a_canadian_criminal_record/",
        "text": "Not sure where to post this, but does anyone know if it’s possible to travel to the Caribbean, specifically Punta Cana, with a criminal record from Canada?\nI know it’s not possible to go to the United States to some degree.",
        "created_utc": 1671451764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Familiar, guys? ⚖️",
        "author": "No-Airport4782",
        "url": "https://v.redd.it/2zrbqzou5u6a1",
        "text": "",
        "created_utc": 1671448501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice",
        "author": "masked925",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpnhk0/advice/",
        "text": "[removed]",
        "created_utc": 1671443831,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I have any chance at a 1L diversity position at a big law firm from a t25?",
        "author": "saantiaago",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpmsl0/do_i_have_any_chance_at_a_1l_diversity_position/",
        "text": "What're the odds of getting a 1L diversity position in D.C. as a queer asian person?",
        "created_utc": 1671441158,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips on how to find jobs for the summer after 2L year?",
        "author": "Sakara_vvv",
        "url": "https://www.reddit.com/r/LawSchool/comments/zplza0/tips_on_how_to_find_jobs_for_the_summer_after_2l/",
        "text": "Hello! I am currently a 2L, and, because of the hellish semester I just finished, I have not set out trying to find a summer job yet. I am most interested in criminal law, and the job bank my school runs only really caters to big law/private niche firms. Any tips would be appreciated!",
        "created_utc": 1671438021,
        "upvote_ratio": 1.0
    },
    {
        "title": "For these 1L diversity positions, what do I do if I don't get grades till Jan 10 and the dropbox application requires a law school transcript? Can I still apply?",
        "author": "saantiaago",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpltry/for_these_1l_diversity_positions_what_do_i_do_if/",
        "text": "",
        "created_utc": 1671437437,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long are applications kept on file with a school?",
        "author": "Anxious-Anarchist19",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpkx93/how_long_are_applications_kept_on_file_with_a/",
        "text": "Graduate 10 years ago and am looking to retain a copy of my application. Will schools keep application materials for admitted students indefinitely or do they purge after a certain time?",
        "created_utc": 1671434132,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I still take the bar exam with a record of the unpaid medical bills?",
        "author": "PuzzleheadedShow7716",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpkgv5/can_i_still_take_the_bar_exam_with_a_record_of/",
        "text": "Hi all, I hope you guys are surviving the dreadful law school amidst this festive time of the year. About 6 years ago, I went to ER at a local hospital to get medical attention (I nearly passed out due to pain) and was billed approx. $10k after the treatment. I told them I was broke and could not pay that much money, but that did not really persuade the representative at the hospital. About a few months after, I left the U.S., moved overseas, and have been living here for the past 6 years. Fast forward, now I am 3L in a law school and about to take the bar exam in the U.S., I am mortified at the thought that what if I was criminally charged after my absence from the country and I cannot take the bar exam even if I pay the overdue as soon as possible (before the time of the exam). Did anyone have similar cases like that or know someone who had a similar experience?? Any help would be appreciated honestly.",
        "created_utc": 1671432536,
        "upvote_ratio": 1.0
    },
    {
        "title": "How bad does an ethics allegation look on your moral character app?",
        "author": "knoxyvelle",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpkaz7/how_bad_does_an_ethics_allegation_look_on_your/",
        "text": "I’m referring only to an ethics allegation, not a violation. Any help would be appreciated.",
        "created_utc": 1671431955,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the benefits of bigger or smaller incoming classes?",
        "author": "AerialCoterie",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpjesz/what_are_the_benefits_of_bigger_or_smaller/",
        "text": "I'm trying to figure out how to judge schools on what will best serve me beyond their rankings. All help appreciated!",
        "created_utc": 1671428986,
        "upvote_ratio": 1.0
    },
    {
        "title": "practicing attorneys in this, please respond",
        "author": "DenseCoast1427",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpik16/practicing_attorneys_in_this_please_respond/",
        "text": "Is this hell even fucking worth it? Does anyone actually enjoy practicing? I am struggling to find the will to continue.",
        "created_utc": 1671426224,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interview advice for US attorneys office for Federal District Court",
        "author": "km131248",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpidff/interview_advice_for_us_attorneys_office_for/",
        "text": "hi, i have an interview tomorrow for the us attorney’s office for a federal district court (keeping anonymous here). For the attorney’s office not a judge. anyone have any interview advice/what type of questions will be asked? for 1L summer",
        "created_utc": 1671425676,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone used the Open AI bot to help them study?",
        "author": "IAmUber",
        "url": "https://i.redd.it/3123dtu76s6a1.png",
        "text": "",
        "created_utc": 1671423374,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do law schools publisher who got what grades or who finished where in the class?",
        "author": "anonymouspwrson10002",
        "url": "https://www.reddit.com/r/LawSchool/comments/zphivx/do_law_schools_publisher_who_got_what_grades_or/",
        "text": "",
        "created_utc": 1671423016,
        "upvote_ratio": 1.0
    },
    {
        "title": "Totally forgot to buy my bf a Christmas gift because of 1L finals please give recs on what to get someone I can’t think anymore",
        "author": "randyerthanyou1",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpgsgj/totally_forgot_to_buy_my_bf_a_christmas_gift/",
        "text": "Thank you!!!",
        "created_utc": 1671420848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Diversity SA/Fellowship",
        "author": "New_Clue_2126",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpfmwi/diversity_safellowship/",
        "text": "I’m a 1L and I’m trying to start writing my diversity statement. I have no previous legal experience, what angle should I take for this statement? I joined campus orgs but 1Ls can’t have leadership positions so what should I be trying to convey without just giving a Debby downer statement since I have no experience to draw parallels about why I fit in x role? I’ve only ever had normal serving jobs",
        "created_utc": 1671417501,
        "upvote_ratio": 1.0
    },
    {
        "title": "What shows are you starting post-finals?",
        "author": "notalegalkat",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpfha8/what_shows_are_you_starting_postfinals/",
        "text": "Need some recs 👇",
        "created_utc": 1671417057,
        "upvote_ratio": 1.0
    },
    {
        "title": "About to start law school… IPad or Macbook?",
        "author": "Ok_Egg1668",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpd8o8/about_to_start_law_school_ipad_or_macbook/",
        "text": "For reference, I have a computer that works but is old and slow. I like handwritten notes so I’m leaning towards IPad. Thoughts? \n\nThanks in advance.",
        "created_utc": 1671410551,
        "upvote_ratio": 1.0
    },
    {
        "title": "Big Law Firm Tours",
        "author": "Own_Significance_616",
        "url": "https://www.reddit.com/r/LawSchool/comments/zpd291/big_law_firm_tours/",
        "text": "I’m touring a bunch of big law firms tomorrow, so can you guys drops some dos and donts. And some questions I should ask or just some conversation pointers. Basically give me some tips on how to network tomorrow. (Please don’t say “just be yourself”)\n\nSigned a very awkward 1L with social anxiety:)",
        "created_utc": 1671410057,
        "upvote_ratio": 1.0
    }
]