[
    {
        "title": "what is this \"cchatte\" conjugation??",
        "author": "yismelikethis",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1073v01/what_is_this_cchatte_conjugation/",
        "text": "There's a line in a song I like \"  遣 っちゃって \", but I can't figure out what kind of conjugation it is for the life of me. I thought it was the te form, but that came up as  遣って **.** \n\nWhat kind of tense is it supposed to be?",
        "created_utc": 1673236412,
        "upvote_ratio": 1.0
    },
    {
        "title": "what's the difference between 胸糞悪い and 胸糞が悪い?",
        "author": "yismelikethis",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1073gf8/whats_the_difference_between_胸糞悪い_and_胸糞が悪い/",
        "text": "",
        "created_utc": 1673235234,
        "upvote_ratio": 1.0
    },
    {
        "title": "An interesting, legal and (almost) free collection of over 200 classic Japanese PC games and visual novels to practice on!",
        "author": "nintrader",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1073fua/an_interesting_legal_and_almost_free_collection/",
        "text": "&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; So someone recently made me aware of [Project EGG](https://www.amusement-center.com/project/egg/) which is sort of a Japanese equivalent to GOG except it's actually been around since *2001*. They have a lot of games from Oldschool Japanese computers like the MSX and PC-98 and what's more is once you've signed up they have a collection of [over 200 free games](https://www.amusement-center.com/project/egg/freegames/) with *a lot* of visual novels represented and they add a new one every month! There's an absolutely massive amount of material at different levels and I think it's a great resource for practice material. The site is apparently at least partially run in conjunction with a Japanese game preservation group which is pretty cool.\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;The *catch* though, is that in order to download these free games and be able to purchase the non-free ones, you have to pay a monthly 500 yen subscription fee (though if you stop subscribing you still keep your stuff). Frankly it's weird and seems needlessly complex, but apparantly the games are pretty close to DRM-free. That said, if you can only \"officially\" have them installed to one PC at a time or something and have to do some weird license transfer thing if you want \n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Their game launcher is a bit... oldschool, it looks like an early 2000's MP3 player, but supposedly they're reworking it soon. I'm hoping that will also entail a rework with their weird licensing system but overall the experience has been largely painfree aside from Malwarebytes flagging some games (so I had to whitelist the install folder). \n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Weirdly they also have a separate english website [with english versions of some games](https://www.amusement-center.com/en/project/egg/memberpage/index.shtml) but it's clearly had a lot less love  and the selection is far smaller, but you're not here for english games, you're hear to read some japanese! The switcher lets you swap to your english library which also switches to the english UI, but since the english and japanese \n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; I'm currently checking out a game called [Apple Sauce 7](http://www.amusement-center.com/project/egg/game/?product_id=799) which is extremely cute and so far I've been able to read the text presented in it. Anyway this post probably reads a bit like an ad but even though I don't love some decisions they make with their setup the selection's pretty insane and registration wasn't hard. They do ask for your name in both Kana and Kanji but it didn't care when I wrote it in English and paypal works for payments. The only signup issue I had is that the passwrod field doesn't let you use Symbols like ! or @ but once I realized that I was good.\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Really I mostly just thought it was fascinating that Japan's had their own Steam since before Gaben and a lot of these are obscure games by popular companies that people might be interested in digging into, since part of language learning is getting that good shit you can't find anywhere else.",
        "created_utc": 1673235186,
        "upvote_ratio": 1.0
    },
    {
        "title": "If I offer something to someone and the person says: 「いいです」, this means yes or means not?",
        "author": "Juan01010101",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1073clk/if_i_offer_something_to_someone_and_the_person/",
        "text": "What about 「大丈夫です」? I'm so confuse.\n\nはい、いいえ、どっし？",
        "created_utc": 1673234935,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are some good visual novels for beginner learners?",
        "author": "toadthetoadsmm2",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/10715yr/what_are_some_good_visual_novels_for_beginner/",
        "text": "I would like to find some visual novels that are pretty easy to play as a beginner learner",
        "created_utc": 1673228946,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Review] I finished the Duolingo japanese course",
        "author": "Tobio-Star",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/10715m1/review_i_finished_the_duolingo_japanese_course/",
        "text": "#  --&gt;[TLDR at the end 😉]&lt;--\n\nWarning: this review is about the former most recent version of Duolingo, between January 2021 and July 2022 (so the new path version from August is not included). I wanted to post this since august when I finished the course but I had other priorities\n\n**My experience**\n\nAfter about 1 and ½ year, I finished the entire course of Duolingo and got every single unit to gold. Upon finishing the course, I knew between 2,5 and 3k words, and grammar up to early N3 (I just finished N4). During that time period, Duolingo has been my main study tool and I estimate I owed about 90% of my Japanese knowledge to it.\n\n**Shortcomings**\n\nSo does it work? Short answer, yes. Duolingo does a good job covering all the very basics of Japanese. Would I recommend it? Definitely not. Let me explain. The Japanese course on Duolingo is mainly a word learning course. Each unit will introduce you to a couple new words (between 15 and 30), then it will incorporate some of those words into sentences, and finally those sentences will try to teach a couple grammar points as well. Assuming, you get each unit to max level, most words are gonna stick. But Duolingo has some serious problems:\n\n1- The word review system is ineffective\n\nI had to put the entire course on a separate review app (Anki) to be really able to say that I \"know\" the vocab. Since Duolingo relies so heavily on sentences and only rarely drill individual words, it seems like they haven’t found a way to make the user review previous words effectively and consistently. \n\nI kinda get it since creating sentences that a) teach words and grammar, and b) review previously learned material while not being overly complex is pretty difficult. Furthermore, for a word study app, it is not very effective. I estimate that I learned about 4-5 words a day and that’s very very slow. In order to have good results in a reasonable amount of time, I feel like one should be aiming for at least 10-15 a day.\n\n2- The grammar teaching side is really bad.\n\nDuolingo barely provides any grammar explanation. They just throw grammar into different sentences and hope you will figure out the grammar point inside them by seeing the same pattern over and over again. The problem is, Japanese is way too different from English for that to be effective.\n\nSo in order for me to teach myself grammar, I had to abuse of the “discuss” forum. Under each question, there is a button for discussion. Inside that discussion, 90% of the time,  some advanced users usually give a clear explanation about the grammar point used. This is the way I learned grammar for the vast majority of cases. While that worked, it will obviously never fair to explanations given by teachers or professionals. You will get basic explanations for grammar points, but getting in-depth explanations is rare (and there is also the small but notable risk of errors or contradictions from users).\n\n3- It doesn’t teach kanji. At all.\n\nDuolingo pretty much doesn’t explain anything about radicals, kanji meanings or pronunciations. They teach the words and hope you will miraculously learn the kanji inside by sheer repetition. A crazy amount of kanji looked identical to me before I started using a specialized kanji book on the side (“Remembering The Kanji” by James Heisig).\n\n**It’s not effective … but it works**\n\nStill, I want to make it clear: if you don’t have a dollar for language learning and aren’t interested in other methods, you should definitely consider Duolingo because it works and it’s free. Duolingo is fun, pretty and gives motivation to study. It’s also an “all-in-one” way to learn Japanese since it teaches words and grammar, and how to construct sentences from basic to reasonably complex. However, pretty much any other study method will be more efficient than Duolingo. Its biggest strength, vocab learning, is actually very weak and should be supplemented by a review system like Anki.\n\n**TIPS**\n\nIf you still want to use Duolingo (that’s okay), I have a couple tips I think could help\n\n*1- Use and re-use the “Discuss” section*\n\nThis is probably the most important thing to remember. When using Duolingo, you should basically spam the “Discuss” button under each question. Every time you have a doubt about what a sentence means or some weird grammar you’ve never seen before, see what others said about it on that tab. Without the “discuss” section, Duolingo would be almost unusable\n\n*2- Make your own review system for every word and piece of grammar*\n\nLike I said, Duolingo’s review system is atrocious. I recommend using a separate review app like “Anki” and writing down every information you understood from the app. Let’s see concrete examples for reviewing vocabulary and grammar\n\na) For vocab, it’s pretty easy. On the question side (the “front”), I put the word in kanji or hiragana. On the back, I put the pronunciation and up to 2 possible meanings of the word. Here is an example for the word 出る\n\nFront:出る\n\nBack: Pronunciation = “deru”, meaning = “to leave, to participate”\n\nb) For grammar, it’s not as simple. On the front, I try to put the grammar pattern using general terms (like “X, Y”). On the back, I put the meaning and, if necessary, a concrete application of that grammar. Here are 2 examples\n\nExample 1\n\nFront: お金のかかるX\n\nBack: meaning = “an expensive X”, application = “お金のかかるご飯-&gt; an expensive meal »\n\nExample 2\n\nFront: Xに水をやる\n\nBack:meaning = “to water up X”, application = “庭に水をやる-&gt; to water up the garden”\n\nI took very simple examples to be clear, but for more complicated grammar pattern, you will have to get creative and find a way to make yourself remember how to use those patterns.\n\n*3- Double-check the meaning of every word on jisho*\n\nI recommend not relying on the built-in dictionary on Duolingo since it contains many errors. Jisho is one of the best free Japanese dictionary.\n\n*4- Don’t be ashamed of copying the answer when needed.*\n\nI did that for 3 reasons:\n\na) I was certain that my answer was correct. Since Duolingo is based on volunteers adding all the possible answers, it’s very likely they might miss a correct translation.\n\nb) I knew the answer but had no idea what to type in (the required answers can be either unnatural or archaic English).\n\nc)the sentence was too complex and included notions I had never seen before.\n\nTrust me on this: if you are too strict about typing in exactly what they want you to type, you are in for hours of frustrations. It's okay to \"\"cheat\"\" sometimes as long as you made an effort to understand the question.\n\n*5- Keep virtual or real notes about harder notions*\n\nAfter reading a big explanation about a complicated grammar point (like the role of the particle はin Japanese for example) on the “discuss” forum, I recommend writing it down in your own words to make sure you understood what you read. That way, you can come back to it if needed. I also liked to break down complicated sentences that I repeatedly failed and put them in my notes. That way, I would be prepared for when they appear again on the next study sessions.\n\n**Resources I recommend over Duolingo**\n\nDuolingo makes me believe that looking for a resource that teaches every aspect of Japanese might not be the best way to deal with a language this complex. Making a resource that is good enough at teaching vocab, grammar and kanji at the same time is extremely hard. So I recommend instead using resources that focus on one aspect of Japanese at a time.\n\nFor vocabulary, I recommend getting a large vocab pack with between 6k and 10k words. One of “Anki core 10k, Torii-srs, or Anki core 2k/6k” should do the job. You could also make your own vocab pack but I personally think it’s too time consuming. \n\nFor grammar, I recommend using a specialized grammar website like Bunpro. Bunpro (with an r, not “Bunpo”) teaches the important grammar points from N5 to N1 and features a built-in SRS system to review everything learned.\n\nFor kanji, I recommend RTK (remembering the kanji 1) or Wanikani. Those resources are going to teach you the shapes of the 2000 most important kanji as well as their basic meaning. Since Wanikani also tries to teach vocab, I would prefer to use RTK and let the vocab part to something like core 10k.\n\nUse one resource per category and that’s it. Using too many resources at the same time is probably less efficient than just using Duolingo and focusing on it.\n\n\\-------------\n\n**TLDR**: While Duolingo definitely works, it’s one of the worst resources you can use for learning Japanese. However if you have no other choices, then there is absolutely no shame in using it! Duolingo will still get the job done: you will learn about 2.5k words and most beginner grammar points (especially if you use my tips). It’s just super slow alongside having a very weak review system.",
        "created_utc": 1673228919,
        "upvote_ratio": 1.0
    },
    {
        "title": "the name of a word flashcard site i used to use... a long time ago...",
        "author": "HereIsACasualAsker",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1070p61/the_name_of_a_word_flashcard_site_i_used_to_use_a/",
        "text": "it had an interface where you typed in romaji,  it had  a similar structure to nowadays duolingo, it had a rocket, it was named something like remember in japanese mixed in,  something similar. any ideas as to what was the name of this website?",
        "created_utc": 1673227691,
        "upvote_ratio": 1.0
    },
    {
        "title": "Immersion Purpose + Time to Do?",
        "author": "AngelusLapsus333",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1070hdi/immersion_purpose_time_to_do/",
        "text": "So for background knowledge: I’m still a beginner, only a few weeks in. Going through RTK and Core 2.3k every day (20 new cards a day) and watching Cure Dolly grammar videos.\n\n**Immersion**. People seem very back and forth about this and I’m not sure what direction I should be going. Some say to immerse immediately and others say to wait until you’ve learned 7,000+ words.\n\nSo, what is the deal here? I’ve been using “Learning with Shun” podcasts and vlogs, mainly to hear the language and occasionally pick out words that I know but it’s not like I really understand much of anything. What is the benefit to this aside from hearing the language? Now in no way am I saying that hearing the language isn’t beneficial, I love hearing it and it’s definitely helped! It’s more the other part: me not understand anything.\n\nDo I just continue with this? I mean I enjoy how Shun speaks and everything but I don’t want to be doing anything that may not be efficient.\n\nありがとうございます!",
        "created_utc": 1673227102,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for learning Japanese",
        "author": "Commercial-Meat-603",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106z6x4/tips_for_learning_japanese/",
        "text": "I need tips for learning this language. Anything will help cuz duolingo is uhhh. Well it's not helping much. It's helping a little but not much.",
        "created_utc": 1673223714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daily Thread: simple questions, comments that don't need their own posts, and first time posters go here (January 09, 2023)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106yocv/daily_thread_simple_questions_comments_that_dont/",
        "text": "This thread is for all simple questions, beginner questions, and comments that don't need their own post.\n\n# Welcome to /r/LearnJapanese!\n\n* New to Japanese? Read our [Starter's Guide](https://www.reddit.com/r/LearnJapanese/wiki/index/startersguide) and [FAQ](https://www.reddit.com/r/LearnJapanese/wiki/index/faq)\n\n* New to the subreddit? Read the [rules](https://www.reddit.com/r/LearnJapanese/wiki/subredditrules)!\n\nPlease make sure if your post has been addressed by checking the wiki or searching the subreddit before posting or it might get removed. \n\nIf you have any simple questions, please comment them here instead of making a post. \n\n**This does not include translation requests, which belong in /r/translator.**\n\nIf you are looking for a study buddy or would just like to introduce yourself, please join and use the *\\# introductions* channel in [the Discord here!](https://discord.gg/yZQKZYdBSw) \n\n\\---\n\n\\---\n\n[Seven Day Archive](https://www.reddit.com/r/LearnJapanese/search?q=Daily+thread%3A&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=week) of previous threads.  Consider browsing the previous day or two for unanswered questions.",
        "created_utc": 1673222412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Helpful listening source from Instagram",
        "author": "wigmachine",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106xobj/helpful_listening_source_from_instagram/",
        "text": "N4 here. Just wanted to share the Instagram account of T Sensei, a Japanese teacher and author who frequently posts ~20 min+ Instagram Live videos where he takes questions and just talks about his life. I usually watch the recordings afterwards so I can rewind then if needed. Even though they are above my level, I find them really helpful because:\n\n- As a teacher, he often speaks and gestures at the same time, which helps me establish context clues to what he's saying (e.g. if he's comparing something to something else, if he's listing ideas or concepts, etc).\n\n- He often speaks about daily life, answering questions about clothes and books, food, family, kids and school, etc. This is all vocab that shows up in N5 and N4 material, so even if the grammar is more complex and/or he speaks too quickly, I benefit from encountering common vocab and, over time, can piece together more of what he's saying. \n\n- He sometimes speaks very quickly, and other times very slowly. I find this helpful for getting used to different rhythms of speech. \n\nHe also posts Instagram Stories with lots of text, so can be a good source for reading comprehension too. \n\nHere's his profile: https://instagram.com/tsenseidayo?igshid=YmMyMTA2M2Y= \n\nRelatedly, looking up popular hashtags from Japanese Instagram and then seeking out content from native speakers who use the hashtags has been really useful for me. That's how I found him and some other creators that I just follow and watch occasionally, or try to read their posts.",
        "created_utc": 1673219924,
        "upvote_ratio": 1.0
    },
    {
        "title": "Japanese lack of original vocab for some colors",
        "author": "GamerG_20",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106wy12/japanese_lack_of_original_vocab_for_some_colors/",
        "text": "So, what's the deal with colors in japanese? Why are colors like pink, orange, and green in katakana?\n\nThe language didn't have vocabs for these colors?",
        "created_utc": 1673218194,
        "upvote_ratio": 1.0
    },
    {
        "title": "Post-surgery, one month of isolation - How to structure studying",
        "author": "Tomato-Tomato-Tomato",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106wlhn/postsurgery_one_month_of_isolation_how_to/",
        "text": "Hey, yall.\n\nI have an upcoming surgery that will have me largely secluded in a room with little else to do but recover and lay around. I would like to be productive during this time and thought it would be a great opportunity to cram Japanese. I'll be doing a lot to maintain mental health, walking when able, sitting out on the patio, and video calling with friends, but besides that, I will have absolutely nothing to do. I've got some prior Japanese learning experience (1 yr of study abroad in Tokyo 4 years ago), and I'm returning later this year semi-permanently.\n\nI'm interested to hear if you were in my position, how would you go about structuring your studies for one month with almost no other demands on your time? What forms of media would you utilize to break up the monotony, and which forms of study would you prioritize (video lessons, textbooks, apps, anki, etc)? \n\nAfter the month, I'll be happy to report back on the experience.",
        "created_utc": 1673217345,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does \"mon\" mean in a name?",
        "author": "Zorubark",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106vu9w/what_does_mon_mean_in_a_name/",
        "text": "I have learned about \"mon\" in phrases, like for example I saw this post but I've seen mon be used in names for fictional characters like [Zundamon](https://vocalsynth.fandom.com/wiki/Zundamon), I'm assuming this trend comes from monster but I still wanna know",
        "created_utc": 1673215567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lingopie",
        "author": "leoqjnicholas",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106rcil/lingopie/",
        "text": "Hello Japanese learners,\nHas anyone tried Lingopie to learn Japanese ? Is the content enough? Do you like it?",
        "created_utc": 1673204979,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lingopie",
        "author": "leoqjnicholas",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106r7oy/lingopie/",
        "text": "",
        "created_utc": 1673204649,
        "upvote_ratio": 1.0
    },
    {
        "title": "To those who are learning Japanese in a class (either online or physical), what are your experiences, both good and bad?",
        "author": "shoshinsha00",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106qyy1/to_those_who_are_learning_japanese_in_a_class/",
        "text": "As per the title. Some interesting questions would be:  \n\n\n***Are you the teacher's pet, or is there a teacher's pet in your class?***  \n***Are you the overly-passionate one, or is there someone else who is more passionate than anyone else?***  \n***Do you face any issues with your classmates?***  \n***Do you face any issues with your teacher?***",
        "created_utc": 1673204080,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know how to get \"Windows 10 Speech recognition\" app to work with Japanese?",
        "author": "destinyl3gacy",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106qc89/does_anyone_know_how_to_get_windows_10_speech/",
        "text": "I have a broken arm and am in a cast. I'm using voice commands now to study to make it easier rather then using 1 hand. For example when I'm studying with anki, I say \"Press 1\" for the again button and \"press 3\" for the good button etc etc. Before I broke my hand I really enjoyed using the memrise app for their typing tests. For example it would give the word \"Good morning\" and you would get a bunch of hiragana randomized that you can click on to answer or you could just type おはよう as the answer. This is where I am having an issue with using voice recognition built into windows 10. I have the Japanese language pack downloaded into my computer but cant figure out how to get it to work. When doing these typing tests, I want to be able to just say おはよう instead of typing it. I know this works if you use English because I tested it in the \"Learning English\" section of memrise and just said \"hello\" into the mic and it worked. Any help would be appreciated. Thank you!",
        "created_utc": 1673202565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone used lingopie to learn Japanese ? Is the content sufficient ?",
        "author": "leoqjnicholas",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106p9y5/has_anyone_used_lingopie_to_learn_japanese_is_the/",
        "text": "",
        "created_utc": 1673200045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grammar Confusion",
        "author": "MrCalmissimo",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106neog/grammar_confusion/",
        "text": " What’s the difference between と、たら、ば and なら and when is more appropriate to use them in sentences? Im confused especially in the last three ones. If you could explain it to me I’d be really grateful since I find this topic particularly difficult to understand",
        "created_utc": 1673195550,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beginner Here",
        "author": "quitetheoddity",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106neek/beginner_here/",
        "text": "19, and a hell of a lot of free time. Learning Japanese from scratch. Starting with Genki, and this looks hella daunting. I know it’s gonna take a while to actually learn another language, but can I just learn the spoken language or should I stop being lazy and learn written too?",
        "created_utc": 1673195529,
        "upvote_ratio": 0.99
    },
    {
        "title": "What’s the difference between と、たら、ば and なら and when is more appropriate to use them in sentences? Im confused especially in the last three ones. If you could explain it to me I’d be really grateful since I find this topic particularly difficult to understand",
        "author": "MrCalmissimo",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106nec9/whats_the_difference_between_とたらば_and_なら_and_when/",
        "text": "",
        "created_utc": 1673195525,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the difference between と、たら、ば and なら and when is more appropriate to use them in sentences? Im confused especially in the last three ones. If you could explain it to me I’d be really grateful since I find this topic particularly difficult to understand",
        "author": "MrCalmissimo",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106ndxi/whats_the_difference_between_とたらば_and_なら_and_when/",
        "text": "",
        "created_utc": 1673195497,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to buy kindle version of japanese books from abroad ?",
        "author": "offensive_bill_",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106m10g/how_to_buy_kindle_version_of_japanese_books_from/",
        "text": "I don't want to buy physical books because of the huge delivery cost, but when I try to buy an online book (see for that example : [https://www.amazon.co.jp/-/en/%E7%B4%B0%E7%94%B0-%E5%AE%88/dp/4046312483?crid=1CZXGNLK5F5YY&amp;keywords=%E3%82%B8%E3%83%96%E3%83%AA%E3%83%8E%E3%83%99%E3%83%A9%E3%82%A4%E3%82%BA&amp;qid=1652360433&amp;sprefix=%E3%82%B8%E3%83%96%E3%83%AA%E3%83%8E%E3%83%99%E3%83%A9%E3%82%A4%E3%82%BA,aps,258&amp;sr=8-3&amp;linkCode=sl1&amp;tag=dokushoclub-22&amp;linkId=267591893efe82ace036a34cf5f4aef7&amp;language=en\\_US&amp;ref\\_=as\\_li\\_ss\\_tl](https://www.amazon.co.jp/-/en/%E7%B4%B0%E7%94%B0-%E5%AE%88/dp/4046312483?crid=1CZXGNLK5F5YY&amp;keywords=%E3%82%B8%E3%83%96%E3%83%AA%E3%83%8E%E3%83%99%E3%83%A9%E3%82%A4%E3%82%BA&amp;qid=1652360433&amp;sprefix=%E3%82%B8%E3%83%96%E3%83%AA%E3%83%8E%E3%83%99%E3%83%A9%E3%82%A4%E3%82%BA,aps,258&amp;sr=8-3&amp;linkCode=sl1&amp;tag=dokushoclub-22&amp;linkId=267591893efe82ace036a34cf5f4aef7&amp;language=en_US&amp;ref_=as_li_ss_tl)) I can't get the possibility to buy it, there's a kind of error and I think it's because amazon knows I'm outside of Japan\n\nAny ideas on how to buy kindle books to practice reading ? Btw I'm not only interested in the book I've linked, so if you have recommandations for novels that contain furigana for N3 level that'd be cool.",
        "created_utc": 1673192092,
        "upvote_ratio": 1.0
    },
    {
        "title": "自慢じゃないが、俺はギャンブルにだけは手を染めていないのだ。need help breaking this sentence down",
        "author": "CrackBabyCSGO",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106lo5w/自慢じゃないが俺はギャンブルにだけは手を染めていないのだneed_help_breaking/",
        "text": "自慢じゃないが、俺はギャンブルにだけは手を染めていないのだ。もっとも、ネトゲには１０万以上使ってるがね。\n\nThis is the context. The preface to the sentence, 自慢じゃないが, is something along the lines of \"not trying to boast\". The part im having trouble with is the rest. In particular, originally I thought this sentence was saying \"I have only not participated in gambling\". As in gambling is the ONLY thing he had not participated in, as the だけ comes directly after ギャンブル. The following sentence however, clearly states that he HAD gambled in the past. \n\nSo following that logic, this sentence is trying to say he DID gamble. As far as I know だけ does not follow the same rule as しか that when followed by a negative indicates positive and exclusivity. I am completely stuck trying to decipher this. Can anyone help me out and explain why this sentence means what it does?",
        "created_utc": 1673191180,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good books/resources for learning JLPT N4 and N3",
        "author": "OwO_boi69",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106lbu5/good_booksresources_for_learning_jlpt_n4_and_n3/",
        "text": "This year in June/July, I’m going to Japan for a little under two weeks with my school and a teacher who can speak N3~. At this point in time I could pass N5, and I am able to understand some N4 content but not enough to pass the JLPT N4 test. \n\n\nCan you please recommend me some resources to study with, as I want to be able to communicate better than I currently can so I don’t have to rely as much on my teacher as they will have to be helping 10+ students and I want to try to take some of the pressure off of them. I also want to just get better at Japanese especially with my speaking, but I’m not entirely sure where to start in terms of resources. \n\n\nThank you so much in advance, I greatly appreciate it!",
        "created_utc": 1673190279,
        "upvote_ratio": 1.0
    },
    {
        "title": "Japanese school with output learning system in Tokyo",
        "author": "Additional-Text-9747",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106kkpe/japanese_school_with_output_learning_system_in/",
        "text": "I’m planning to move to Tokyo next July, currently I consider my Japanese level in N4 (didn’t present a JLPT but I’m taking a conversational course between N4-N3 and feel comfortable).\n\nThe thing is, looked for a Japanese school I researched a few of they and almost all have a lot of complaints about the methodology, the main focus is the input excessive use, the students almost never have opportunity to practice the speaking.\n\nSchools like Akamonkai, ISI, Tokyo Galaxy, ARC, ECC, KAI etc. are the most famous but at my understanding have the same issue.\n\nI would like to know if existe some good school which focuses on output practice.\nI do not know if the input problem is a systematic issue in the Japanese school teachings method or we have another alternative to learn Japanese in a Japanese school. \n\nThe course that I mentioned before 70% is conversational and the other 30% is grammar and JLPT exercises and I love it however I have the strong intention of study in Japan. \n\nIn my current school options list the first one is Akamonkai because spite of they have the same issues, is intensive, use old methods etc. is the one how have more good comments had by former students.\n\nIf do not exists this kind of school in Japan, Which one do you consider to be the best? Or at least the least worst. \nI know that if you are in Japan should have a lot of opportunities to practice but being honest, If you will pay almost one million yen for a tuition (one year), Why do you have to settle on just going to school to have teachers read the grammar books page by page? \n\nPS: I’m not English native speaker, sorry for the writing mistakes in advance.",
        "created_utc": 1673188238,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there anything (where) you can give Japanese letters and get words made only by those letters?",
        "author": "bornanew123",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106jr6d/is_there_anything_where_you_can_give_japanese/",
        "text": "Hello. I'm starting japanese and well, it is quite a long road till you would be able to read words, or is it?\n\nIf there is such thing, such resource, or something similar, I think it may help in remembering the words better, along with the letters themselves.",
        "created_utc": 1673185951,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learn Japanese through JPOP part 3!",
        "author": "Spider9gaming",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106jg3b/learn_japanese_through_jpop_part_3/",
        "text": "I started a youtube channel 6 months ago called \"JPOPify\" with the vision to teach Japanese through JPOP and I have just uploaded the third episode to my channel\n\nPlease tell me what you think of it, thank you.\n\n&amp;#x200B;\n\n[https://www.youtube.com/watch?v=LN8GPTQdJv0&amp;t=210s](https://www.youtube.com/watch?v=LN8GPTQdJv0&amp;t=210s)",
        "created_utc": 1673185019,
        "upvote_ratio": 1.0
    },
    {
        "title": "After doing anki for 2 weeks I can safely say that I hate the kanji for morning...",
        "author": "RandomValue134",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106eyy1/after_doing_anki_for_2_weeks_i_can_safely_say/",
        "text": "This mfer: 朝(あさ)\n\n#Why do I hate it?\n\nThe kanji is made out of two radicals\n\nThe kanji for car 車(くるま)\n\nAnd the AMOGU- I mean... the kanji for moon 月(つき)\n\n#So what?\n\nWelp, whenever I look at 朝, *the first thing I think of are cars*",
        "created_utc": 1673169765,
        "upvote_ratio": 1.0
    },
    {
        "title": "WaniKani + Torii SRS. Should I exclude the WK vocab?",
        "author": "ZenKB",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106e1ay/wanikani_torii_srs_should_i_exclude_the_wk_vocab/",
        "text": "I studied Japanese years ago and want to pick it up again. I've forgotten a lot so I decide to start from scratch. \n\nI'm using WaniKani and I've just discovered Torii. I wanted to ask if it would be best to use Torii in \"WaniKani mode\" which essentially excludes vocab taught in WK. \n\nI am concerned that I'll miss important vocab, but I would imagine that doing it this way is the most efficient method and will eliminate tedious doubling up. \n\nI am extremely busy with work, life, family, etc. I don't really have time for setting up Anki to sentence mine yet. I just want to jump in using resources that are 'off the shelf' that I don't need to customise. \n\nI plan on also using bunpro and watching YouTube videos.\n\nAny advice would be appreciated 🙏",
        "created_utc": 1673166399,
        "upvote_ratio": 1.0
    },
    {
        "title": "Genki book 1",
        "author": "Loveshinty",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106c8kn/genki_book_1/",
        "text": "So I ordered a genki book, which was the textbook and workbook 1. May I ask if it's a good book for beginners? Haha.",
        "created_utc": 1673160058,
        "upvote_ratio": 1.0
    },
    {
        "title": "App for learning on IPhone, under 10 dollars",
        "author": "KidEater9000",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106ahxl/app_for_learning_on_iphone_under_10_dollars/",
        "text": "I found an app called “Japanese!” And I’d like to know if it is a good method of learning elementary or starter Japanese. If not, a recommendation that has a similar price range would be appreciated. Thank you!",
        "created_utc": 1673154547,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s next after learning Japanese?",
        "author": "chocolatebarthecat",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106ae5g/whats_next_after_learning_japanese/",
        "text": "I’ve learned enough to be at N3 level, and I’m happy with that. My question is, what comes next? I don’t plan on moving to/working in Japan, and I don’t know many people who speak Japanese in my city. I enjoyed the journey of learning, and it’s definitely satisfying to be able to read things I previously couldn’t.\n\nSo my question for all of you here is, if you’ve reached a point of being satisfied with your Japanese skill level, what comes next?",
        "created_utc": 1673154222,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s next after learning Japanese?",
        "author": "catcatcat83738",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106acd8/whats_next_after_learning_japanese/",
        "text": "[removed]",
        "created_utc": 1673154067,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does つかんだら mean ?",
        "author": "haidoooo",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/10696ma/what_does_つかんだら_mean/",
        "text": "I’m translating the song love space by Tatsuro Yamashita, and I’m struggling with this sentence : つかんだら離れないよ\nI understand that it comes from the verb つかむ which most likely means \"to hold\" here. What I don’t understand is what this んだら form is.",
        "created_utc": 1673150603,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kanji",
        "author": "Ok_Low5153",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/106862q/kanji/",
        "text": "Will knowing mandarin chinese help me with studying kanji?",
        "created_utc": 1673147666,
        "upvote_ratio": 1.0
    },
    {
        "title": "beginner looking to learn Japanese",
        "author": "SigmaXG",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1067z5q/beginner_looking_to_learn_japanese/",
        "text": "Hello!\n\nIm looking to learn Japanese and wanted some opinions on where to start. I have struggled to find a resource that is both affordable and effective to my learning styles. I have always disliked language learning apps that insist on only teaching conversational words and phrases and instead want to learn the language in a bit more analytical way.\n\nI looked into actually enrolling in a japanese language school but after a quick preview i did not like the idea of “learn half the hiragana alphabet, count to 100 and learn these 50 words in the next 3 hours and then we move on” style. You might learn the language quick but I see myself losing the details at a pace like that.\n\nBetween books, subscriptions etc. i would like to get a good language learning “suite” for about $300 if i can. Any suggestions?",
        "created_utc": 1673147116,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about ending of a sentence",
        "author": "lucario-95",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1066uhz/question_about_ending_of_a_sentence/",
        "text": "Hi I'm starting to work through Japanese Quartet 1 and had a question about a sentence I read.\n\nThere was a main article on Hayao Miyazaki which was fine but then directly beneath it in a separate section called プロフィール紹介 I came across a sentence that goes like this:\n\n大学卒業後、アニメ作家になるためにアニメ会社に就職。\n\nWhy does the sentence end with 就職 and not 就職した?\n\nIs this common? because I haven't really encountered this way of ending a sentence\n\nHow are you supposed to know the tense when you encounter this kind of sentence?\n\n\nAlso there was this sentence: 1941年東京生まれ。\n\nWhy isn't there a だ at the end?\n\n\nThank you for your time",
        "created_utc": 1673143956,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any free videos that follow along the textbook みんなの日本語？",
        "author": "Misty-Falls",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1065wp1/are_there_any_free_videos_that_follow_along_the/",
        "text": "Hi, I tried scrolling through YouTube but didn’t find anything. Does anyone know a video that can help me go through mina no nihongo? Thanks!!",
        "created_utc": 1673141357,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you have or plan on getting job where you regulary make use of your Japanese?",
        "author": "WiteXDan",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1065nbk/do_you_have_or_plan_on_getting_job_where_you/",
        "text": "We all start learning Japanese for different reasons, but I think most people do it as a hobby and it's very interesting to make use of your hobby in career. I'd also want to do this someday, so if you did this, how difficult it was to find such job?",
        "created_utc": 1673140647,
        "upvote_ratio": 1.0
    },
    {
        "title": "Subtle Guide to Mastering Japanese",
        "author": "TokyoSurfer",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1065ee2/subtle_guide_to_mastering_japanese/",
        "text": "Hi all,   \nI'm in the process of creating a master excel spreadsheet of all vocab, grammar, and kanji needed to pass the N2 (including previous N3, N4, N5 contents). I am almost finished creating this study guide in preparation for the N2.   \nContents included:   \n**1. Vocab** (kanji, furigana, English, い・な, う・る・する, N level, conjugations, notes)  \n**2. Grammar** (N level, Grammar lesson, Additional expression of Grammar lesson, English example sentence 1 &amp; 2, notes)  \n**3. Kanji** (Kanji character, Onyomi reading, Kunyomi reading, Primitive reading, English translation, \tKanji mnemonic story, ON vocab examples, KUN vocab examples)  \nI am curious how valuable this would be to each of you, or if you have any additional contents you would recommend adding. If you see this as valuable to your studying, please upvote this post, or post any questions and suggestions in the comments.  \n\n\nThanks and 頑張りましょう！",
        "created_utc": 1673139963,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Japan, there is an onomatopoeic word specifically for when a peach flows down a river.",
        "author": "resignater",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1064yuo/in_japan_there_is_an_onomatopoeic_word/",
        "text": "Sometimes it becomes a topic on SNS, but I'm curious how people outside of Japan feel about it.",
        "created_utc": 1673138834,
        "upvote_ratio": 1.0
    },
    {
        "title": "ONLINE Conversational Japanese Class",
        "author": "Japaneseconversation",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1064uvs/online_conversational_japanese_class/",
        "text": "University of Hawaii Outreach College offers ONLINE Japanese classes focus on the conversation skills.  It is 2 hr 45min long  class and students will practice the conversation with the native speakers for at least one hour in the breakout room (one on one to one on three) supervised by your instructor.  The class will start on Jan.21st ( ten classes ) with eight different level classes form absolute beginner to N1 level.   Please check [https://www.outreach.hawaii.edu/areas-of-study/language-arts-humanities/](https://www.outreach.hawaii.edu/areas-of-study/language-arts-humanities/)  to register.  If you have any question, please write to me.  We had about one hundred Japanese helped our conversation practice last term and the students were very happy.",
        "created_utc": 1673138535,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to learn kanji properly?",
        "author": "ShinyRedditorEver",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1064msi/how_to_learn_kanji_properly/",
        "text": "Hi! Ive been learning kanji by using WaniKani and while it has been good, Im about to reach the maxim level you can reach without paying subscription, and Im not sure  if Ill be able to afford it. So I was wondering, is there a good way for learning kanji without spending money in a proper way? I was thinking on using Anki but Im not sure.",
        "created_utc": 1673137924,
        "upvote_ratio": 0.99
    },
    {
        "title": "Anybody know good Japanese movies to help learn?",
        "author": "Txduu",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/10643dy/anybody_know_good_japanese_movies_to_help_learn/",
        "text": "Not necessarily have the movie be about learning, rather intriguing or interesting movies. I just want to hear the language be spoken.",
        "created_utc": 1673136556,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is it called when a consonant gains a dakuten or handakuten when paired with another kanji?",
        "author": "oralquest54",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1063zam/what_is_it_called_when_a_consonant_gains_a/",
        "text": "Like in 人々 or 一発 (hito changes to bito, hatsu changes to patsu)\n\nI'm trying to find and learn about how this works, since I think I saw a video about it in my youtube recommendations too, but I have no clue what to search for\n\nIf someone could help me, I'd be glad",
        "created_utc": 1673136267,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is it called whena consonant gains a dakuten or handakuten when paired with another kanji?",
        "author": "oralquest54",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1063y3u/what_is_it_called_whena_consonant_gains_a_dakuten/",
        "text": "Like in 人々 or 一発 (hito changes to bito, and hatsu changes to patsu)\n\nI'm trying to find and learn about how this works, since I think I saw a video about it in my youtube recommendations too, but I have no clue what to search for\n\nIf someone could help me, I'd be glad",
        "created_utc": 1673136182,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daily Thread: simple questions, comments that don't need their own posts, and first time posters go here (January 08, 2023)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1063vi0/daily_thread_simple_questions_comments_that_dont/",
        "text": "This thread is for all simple questions, beginner questions, and comments that don't need their own post.\n\n# Welcome to /r/LearnJapanese!\n\n* New to Japanese? Read our [Starter's Guide](https://www.reddit.com/r/LearnJapanese/wiki/index/startersguide) and [FAQ](https://www.reddit.com/r/LearnJapanese/wiki/index/faq)\n\n* New to the subreddit? Read the [rules](https://www.reddit.com/r/LearnJapanese/wiki/subredditrules)!\n\nPlease make sure if your post has been addressed by checking the wiki or searching the subreddit before posting or it might get removed. \n\nIf you have any simple questions, please comment them here instead of making a post. \n\n**This does not include translation requests, which belong in /r/translator.**\n\nIf you are looking for a study buddy or would just like to introduce yourself, please join and use the *\\# introductions* channel in [the Discord here!](https://discord.gg/yZQKZYdBSw) \n\n\\---\n\n\\---\n\n[Seven Day Archive](https://www.reddit.com/r/LearnJapanese/search?q=Daily+thread%3A&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=week) of previous threads.  Consider browsing the previous day or two for unanswered questions.",
        "created_utc": 1673136012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here is my first try of 写経(shakyo), copying, or in this case tracing, Buddhist sutras.",
        "author": "Kladias",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1061zoh/here_is_my_first_try_of_写経shakyo_copying_or_in/",
        "text": "[https://imgur.com/a/KWB7E4E](https://imgur.com/a/KWB7E4E)\n\nI do not practice Buddhism but it was included in the gift exchange I had with my Japanese language exchange buddy. Had fun! Was reminded once again that calligraphy is no joke. Hard to make lines look as elegant as the printed text.\n\nAnd as undying traditional of anything written anywhere near the start of the year, I miswrote the year. To 2003 of all things lol",
        "created_utc": 1673131351,
        "upvote_ratio": 1.0
    },
    {
        "title": "Japanese New Years Resolution Feedback Request",
        "author": "Xefjord",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1060o3n/japanese_new_years_resolution_feedback_request/",
        "text": " Hello Everyone!\n\n\\------------------------------\n\n**Some Background**\n\nI am Xefjord, and I have been a fan of language learning for 11 years now, and Japanese was kind of my first love when it came to languages. I started studying in my final year of middle school because of anime and manga (familiar story I am sure) but continued to study intermittently for 7 years with the end goal of teaching English in Japan. I went to college for IT because my parents agreed to pay for my degree (Despite wanting to go for English or Japanese) and with the coronavirus and some health anxiety, I slowly kind of gave up on those dreams and went on a 4 year hiatus of the language. I have worked in IT for 2 years now, and while it is a good job, my anxieties and overall health has improved substantially, and I have been thinking about Japan again. So I made studying JP my new years resolution.\n\nI have read the entirety of Genki 1 roughly 4 times over during my 7 year study, and gotten a couple chapters into Genki 2. I was very good about talking with Japanese natives locally and on HiNative/Tandem, and I also talked to myself frequently. I finished the entire Lingodeer Japanese course (Which is supposedly about all of Genki 1 and half of Genki 2), I also kept a journal which I had going for half a year in only Japanese.\n\nThe first 4 years of studying Japanese were so intermittent because I was a young kid who had no idea how to study, this was before Japanese Duolingo. The last 3 years were so intermittent because I kept getting distracted by studying Korean and Chinese which was more locally relevant to where I lived in Midwestern America. So I am in a weird position where I have studied a long time, but very intermittently, and made a lot of progress in random areas, but unaware of what all those areas are.\n\n\\-----------------------------------\n\n**New Years Resolution**\n\nI want to try to reach at least the beginnings of a JLPT N2 level by the end of the year. I understand that to be roughly 1k Kanji and 6k vocab. I have split my study into daily checkboxes that go something like this:\n\n**○ JP Grammar Study** \\- This will involve daily progress in a grammar course, I am using the new app YuSpeak made by a friend of mine to review all the JLPT N5 content in a new way before I tackle the same old Genki 1 review for a 5th time. I hope to finish both YuSpeak and Genki 1 by or shortly after the end of this month, because it is all technically review. After that I plan to read Genki 2, then Tobira, and I own the Shin Kanzen Master Series JLPT N2 books. I am going to shoot to get as far as I can, but I am confident I can at least finish Tobira by the end of the year.\n\n**○ JP Vocab Study** \\- This almost universally takes place on Anki, where I have three primary decks I am progressing. The first one is the Kodansha Kanji Learners Course deck, where I am (for right now) doing 8 new kanji a day. It teaches the core 2300 main Kanji. And with each flashcard I am practicing writing the character, understanding the meanings, as well as memorizing at least one related word's meanings and readings so I know how to use the Kanji in at least one instance. I also have the Core 6k deck which I am going about 20 cards through a day. and I have a personal deck where I take words I encounter in reading, writing, listening, and speaking practice that I want to learn and memorize sooner, and I add them in the natural context I encountered them to a personal deck which I do 10 cards of a day. These study numbers may go up or down based upon the workload/demand.\n\n**○ JP Writing Study** \\- I have a google doc where I am journaling every day in only Japanese. I don't allow myself to use google translate at all except for translating for Japanese -&gt; English to double check my work. I will use Jisho for some words I don't know, but when I do I will add them to my personal Anki Deck.\n\n**○ JP Speaking Study** \\- For right now I have this set to 3 times per week dedicated, but it will likely increase as I get further into my study. I spend at least 30 minutes on Tandem/Discord talking in only Japanese with natives or other learners of a similar or higher level. Especially if I can get some Japanese friends or a static study group, I expect this number to go up substantially. I also practice speaking to myself in Japanese daily.\n\n**○ JP Content Study** \\- I am not doing this as much until I get to the end of Genki 2, but this is essentially where I am going to just force myself to sit down and read a LOT more. I have numerous physical volumes of Yotsubato, Chii's Sweet Home, Nisekoi, Golden Kamuy, and an assorted range of light novels. As well as over 50 visual novels that support Japanese. There is of course free resources like NHK News Easy and more that I can rely upon as well. I will be dedicating myself by hopefully at least 1/3rd to halfway through the year to spending a good chunk of time on just reading native content. I also have a large amount of Japanese Youtubers I can follow as well. I will likely switch to a full immersion environment halfway to 2/3rds through the year by only allowing myself to do things in Japanese.\n\n\\----------------\n\n**Conclusion**\n\nIf this sounds like a lot, that is because it is. I am looking at at least 3-5 hours of study every day. I am being a little more relaxed this first month as it is all mostly review, but I plan to pick up the pace considerably after I have kept a solid streak and start getting into newer content. I have previously done months of 8 hours of Korean study a day (which I ultimately burned out from, but I don't plan on going that intense if at all until near the end) so I know how to put in the hours on daily study.\n\nI think motivation is a huge factor in regards to language learning success, part of what made studying Japanese difficult in the past was not seeing a near term use for the language and conflicting thoughts on where I might want to go teach English after college. But I have set a very specific goal and intention for this year:\n\nI am interested in teaching English in Japan in 2024, so my desire is to reach the highest level of Japanese possible this year, so that my time spent in Japan next year can be enjoyed as fruitfully as possible. I have a bachelors IT degree, a decent history of working with language learning app companies, my own language teaching website, and a passion for educating others (Plus I am a native English speaker). So I think I can be an attractive candidate.\n\nI am using this goal as mid term motivation to succeed and at least thus far have a week long unbroken streak.\n\nIf anyone has any feedback on how to improve my study, or just general advice on reaching my goals and going to Japan in general, it is all appreciated :) I am definitely not *new* to Japanese per say, but I still have a lot to learn and plan to take it seriously.",
        "created_utc": 1673128062,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question on flashcards?",
        "author": "lieinking1",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/10606jr/question_on_flashcards/",
        "text": "So I'm doing japanese flashcards. I tried learning cards with the word on the front in kanji and the English meaning on the back. However I struggle to recognize the kanji. Then I have to remember the reading for the ones that don't contain kanji as well, and the meaning. So I decided to learn kanji individually and a few key words with them. It makes learning a words reading in kanji much easier if I know the form and meaning of a kanji already. \n\nOther than that I'm learning vocabulary. I started learning them so English is on the front then when I flip it the kanji with furigana is on the back with the kanji being small but i barely look at it. I can either do that or have it so kanji is on the front with furigana on top, then they'll be kana and english when I flip the card. Which one should I do? Having only kanji on the front is too difficult when I don't know the individual kanjis.",
        "created_utc": 1673126823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Took a break from studying and looking for tips on good ways to start studying again and getting back to my old comprehension level?",
        "author": "Bluekiller18",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105ynha/took_a_break_from_studying_and_looking_for_tips/",
        "text": "After a year straight of studying not missing a day I stopped, it’s been 5 months since I stopped. I was about intermediate level, I could Watch Japanese youtube videos and podcasts and would read Japanese books too and could understand almost 80-90% of it. I wanna get back to studying but lack the same motivation I used to have, my old motivation was because I was planning to go move there but due to some changes in my life I decided I won’t be. My anki deck has over 2000 reviews so whenever I try to get back into it I get kinda overwhelmed and just give up esp when I forgot the meaning to old cards I used to know easily. Not really sure on a good way to get back into it so just looking for tips on good ways to start studying again and getting back to my old level? Should I start little by little, reset my anki deck and start with like 50 cards a day?",
        "created_utc": 1673122998,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jisho's common tag for Yomichan",
        "author": "Swepah",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105y6w9/jishos_common_tag_for_yomichan/",
        "text": "Hello!\n\nI came up with a study method a few months, which essentially consists of going through all of Jisho's list of words tagged as common, kanji by kanji. In other words, I go down the list of kanji sorted by grade level(in the same order as japanese kids learn at school), look them up in jisho and only add the ones tagged as common to my Anki deck. I've found that this avoids the confusion of essentially guessing kanji's and their readings by how they look, and it grants me the assurance of tangibly knowing whether I know a word or not. For example, if I see a word starting with the kanji 大, and I've already gone through the common words starting with it in Jisho, unless it is a very uncommon word or a compound of some sort, I know that I've already learnt it. Also, since I'm studying kanji's individually, I also learn their readings along with the words.\n\n&amp;#x200B;\n\nBut, making the cards and reviewing is all but fun, so I decided to also watch anime to make my days a little brighter. But, while I'm at it, I thought I might as well mine some sentences I don't know from these anime. However, I don't want to have any duplicate between the deck in which I learn common words in Jisho, and the one for sentence mining. That's why, I would really appreciate if someone could guide me to a resource which would allow me to have a tag next to the word on the Yomichan popup saying whether it's classified as a common word in Jisho or not. That way, if a word is not common, I know that I won't go over it during my study, and I'll be able to mine it without having any duplicates.\n\n&amp;#x200B;\n\nI'm not sure if I explained my issue in the most clear manner, so I'll clarify confusions if there are any, and thanks in advance.",
        "created_utc": 1673121810,
        "upvote_ratio": 1.0
    },
    {
        "title": "Found this amazing tool to for who just ended Genki books (or is starting immersion)",
        "author": "Juan01010101",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105y1yj/found_this_amazing_tool_to_for_who_just_ended/",
        "text": "Satori Reader. This website let you sort their stories by difficult, all wrote and recorded by native speakers, also translation is available in a click of the mouse. They allow you to see 2 chapters of each story for free. I will try use spaced repetition with those, until I can understand at least 90% just by listening. Any similar tools available?\n\n[https://www.satorireader.com/series/grouped/difficulty](https://www.satorireader.com/series/grouped/difficulty)",
        "created_utc": 1673121481,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got to an intermediate level, but skipped over simple vocabulary by accident",
        "author": "Beatboxamateur",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105y1wg/got_to_an_intermediate_level_but_skipped_over/",
        "text": "I've been unconsciously acquiring Japanese for years when I watched anime, and in the past couple months I've finally started to take it seriously and actually learn the language. \n\nBut here's the interesting thing: while I already know a lot of more  intermediate words like 求める, 憧れる, 怪しい, at the same time, I realized that I know barely any vocabulary. I don't know the names of basically any food, I don't know the names of the months, I don't know the exact way to say the time, there are just so many simple things that I skipped over. My grammar and sentence structure is pretty good, and I'm able to comprehend a good amount of what I hear. But I also know barely any basic vocabulary. \n\nIn your opinion, what would be the fastest/best way to just learn a lot of basic vocab that beginners would be learning?  Should I even learn them right now? Or should I try to pick them up once I'm at a more advanced level?",
        "created_utc": 1673121477,
        "upvote_ratio": 1.0
    },
    {
        "title": "is there a way to know what person said when you hear 振られる「ふられる」vs 降られる「ふられる」",
        "author": "ThrowCheeseASAP",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105vkm0/is_there_a_way_to_know_what_person_said_when_you/",
        "text": "So i'm doing anki deck with minimal pairs.  \n 振られる「ふられる」 \\[ɸu͍ɽaɽeɽu͍\\]  to be dumped   \n 降られる「ふられる」 \\[ɸu͍ɽaɽe↓ɽu͍\\]  to be rained on   \n\n\nThey are two words with really different meaning, and there's so little difference that you can't even read it(?). I mean, last sylabel is where we hear the difference and reading the hiragana between the two words you won't be able to spot it, they are the same. So I'd guess the only way is trough kanji that's at the beginning? But we are hearing the change at the end of the word, not beginning. Thanks in advance for help &lt;3",
        "created_utc": 1673115258,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to ask for vegetarian options",
        "author": "deliit_di_hazura",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105v4z5/how_to_ask_for_vegetarian_options/",
        "text": "皆さん、こんにちは！\nI will be traveling to Japan later this month and know enough Japanese to get around. I also speak Chinese, so that helps with Kanji😅.\nOne thing I want to make sure of before I go is how to ask for vegetarian options at a restaurant. In addition, I’d like to know the correct way to ask if something is vegetarian.\nThis is what I’ve come up with, let me know if there is a better/more natural way to say it:\n\n“Is this vegetarian?”\n「これはベジタリアンですか？」\n\n“Do you have vegetarian options?”\n「菜食がありますか？」\n「ベジタリアン食がありますか？」\n\n助けてくれてありがとう〜",
        "created_utc": 1673114214,
        "upvote_ratio": 1.0
    },
    {
        "title": "Japanese grammar lessons in japanese",
        "author": "laurakkkjj",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105uvxo/japanese_grammar_lessons_in_japanese/",
        "text": "Here are some playlists of Japanese grammar videos in Japanese on YouTube. It's great for learning how things are explained in Japanese and also to get more in touch with the language\n\nMost complete N5-N3 playlists: \n\nN5\n•Minori Education\n[ https://youtube.com/playlist?list=PLmrns23EUQtPNu80heuf1_rngp9AbyqYw ]\nJapanese, English, Indonesian and Vietnamese subtitles.\n\n\nN4\n•Minori Education \n[ https://youtube.com/playlist?list=PLmrns23EUQtPqrLR1B-fyalBfOWzo0V-o ]\nJapanese, English and Vietnamese subtitles. \n\n•日本語.COM\n[ https://youtube.com/playlist?list=PLo1v0gulO0hDnqiIKXbbumAW_Bz6BGA8h ]\nShort videos. Japanese subtitles.\n\n\nN3\n•日本語.COM\n[ https://youtube.com/playlist?list=PLo1v0gulO0hAKO1Sg0nOA95zXbglErP7J ]\nShort videos. Japanese subtitles. \n\n•日本語の森\n[ https://youtube.com/playlist?list=PLINFE8v4DOhtEDGM22q0GQj7K8Os9c0ZQ ]\nJapanese subtitles. \n\n•Nihongo no Tabi\n[ https://youtube.com/playlist?list=PLCLBHbUvkRGrkA7_-DquG6g3KZSBSFVA7 ] \n\n•出口日語\n[ https://youtube.com/playlist?list=PLynCeSdpMqxDS6EC0L7vXYUAVCstRHcQR ]\n\n\n*For N2 and N1 it's easier to find playlists in Japanese, just put on the search bar \"N2 文法\"/\"N1文法\" and filter the type for \"playlists\"* \n\nN2\n出口日語\n[ https://youtube.com/playlist?list=PLynCeSdpMqxD6LeS82vp39kQP8mw_JxlY ] \n\n日本語の森\n[ https://youtube.com/playlist?list=PLINFE8v4DOhvV5tJT77oF92vIwLLl6wAA ] \n\n日本語.COM\n[ https://youtube.com/playlist?list=PLo1v0gulO0hDfwFLj7y_bspWySNAtFP6e ] \n\nNihongo no tabi\n[ https://youtube.com/playlist?list=PLCLBHbUvkRGp8sO_kydYNhUoxMlKxjZfY ] \n\nRiki\n[ https://youtube.com/playlist?list=PLP_AG3822jrmTaPFIKHXptvd0zbBpAmWW ]\n\n\nN1\n出口日語\n[ https://youtube.com/playlist?list=PLynCeSdpMqxCBtZzRikWkdbRGS9csjDYT ] \n\n日本語の森\n[ https://youtu.be/GRmHoGeFBjA ] \n\nAsada school\n[ https://youtube.com/playlist?list=PL-BKXm34J3LmhwJtvYKpCcYWpdhoEYf-f ] \n\n________________________________\nMore N4 playlists:\nhttps://youtube.com/playlist?list=PLPJr5IqHprSHSY-N2sFoNYn4-nO41nCYR \n\nhttps://youtube.com/playlist?list=PLPJr5IqHprSHSY-N2sFoNYn4-nO41nCYR\n_________________________________\nMore N3 playlists:\nhttps://youtube.com/playlist?list=PLlpVIbtDLEPXRUWzDyr5vsycg7WQubc85 \n\nhttps://youtube.com/playlist?list=PLuo2nlCAW4mMdEEbdlmOS-DKn70yOld0J \n\nhttps://youtube.com/playlist?list=PLPJr5IqHprSHqETrouRkaKhhLMgyMMeDa \n\nhttps://youtube.com/playlist?list=PLi-ct1QFL5iO1XWFNLybDwrDTXY5rkLRK",
        "created_utc": 1673113591,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fun Kanji Practice Recommendations",
        "author": "Sci-music",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105us88/fun_kanji_practice_recommendations/",
        "text": "I would love to hear your favorite ways to learn/drill kanji.\n\nI'll go first- After much trial and error I just discovered a new favorite way to drill Kanji. These books are made for kids, but they provide lots of simple sentences in Japanese so you get reading practice too. If I remember correctly there is also a version for learning hiragana/katakana. Ive been learning for 2 years, and have had trouble finding ones that keep my attention, but I already enjoyed the Rilakkuma series on netflix so these were a fun little find! \n\n[https://united-states.kinokuniya.com/bw/9784391140064?no\\_flag=true](https://united-states.kinokuniya.com/bw/9784391140064?no_flag=true)",
        "created_utc": 1673113334,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dragon Quest Builder 2 - North American version support Japanese language?",
        "author": "CoffeeOverdosed",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105teci/dragon_quest_builder_2_north_american_version/",
        "text": "Hi All,  \nlooking to purchase the digital copy of this game through the American Estore, But looking through the support languages, I wanted to confirm with those who purchased it this way, if the japanese language is supported? It does not include it when looking through the Nintendo website, but I find that a bit unusual. Really appreciate your responses",
        "created_utc": 1673109862,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does \"ぬしさま\" mean? Master? How is this different from \"ごしうじんさま\"?",
        "author": "KripperinoArcherino",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105t27n/what_does_ぬしさま_mean_master_how_is_this_different/",
        "text": "In the game I am playing, one character often says ぬしさま, and the translation text says this is \"master.\" There was no subtext or original text option so I couldn't be sure if it was indeed ぬしさま. I only knew ごしうじんさま as \"master,\" so what is the difference between them and when should I use one compared to the other?",
        "created_utc": 1673108996,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning vocab in context",
        "author": "thedarklord176",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105saxb/learning_vocab_in_context/",
        "text": "What’s the best method for learning vocab in context? I feel like my method of a ton of SRS then reading could be improved upon. It takes ages for words to actually stick in my mind. But I have also noticed that if I learn a new word with strong context, like in a game, it sticks instantly. Considering wanikani but it’s pricey",
        "created_utc": 1673107074,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a list of graded secondary school kanji?",
        "author": "BlueLensFlares",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105s97m/is_there_a_list_of_graded_secondary_school_kanji/",
        "text": "Hi,\n\nI see that for kyouiku kanji, all the kanji are listed by grade. So I’m assuming this means that the students for example in grade 4 focus on the kanji in grade 4, maybe even tested on them, even though they probably learn other kanji too.\n\nI see in Shirabe Jisho that the secondary school Kanji also have grades, but then Wikipedia lists them all with an S. Is there a list of graded secondary school kanji? \n\nThanks.",
        "created_utc": 1673106944,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"is\"は \"=\"と、 同等の 作用ですか？",
        "author": "Nouble01",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105q6hg/isは_と_同等の_作用ですか/",
        "text": "\"is\"は　\"=\"と、\n同等の　作用ですか？",
        "created_utc": 1673101420,
        "upvote_ratio": 1.0
    },
    {
        "title": "Subtitles for newly released anime",
        "author": "NooCake",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105pr2a/subtitles_for_newly_released_anime/",
        "text": "Does anybody know where to find japanese subtitles for animes that are currently airing?\n\nOn that note: Is there a subtitle option on japanese television and/or streaming services?",
        "created_utc": 1673100219,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does this kanji 攀 have such a strange stroke order?",
        "author": "0_0Tatsuki0_0",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105povd/why_does_this_kanji_攀_have_such_a_strange_stroke/",
        "text": "The top element does not seem to be following the usual stroke order rules(or following some kind of rule I don’t know)",
        "created_utc": 1673100050,
        "upvote_ratio": 1.0
    },
    {
        "title": "MochiMochi app opinions?",
        "author": "Zbigini",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105nrq2/mochimochi_app_opinions/",
        "text": "Do any of you use MochiMochi app?\n\n&amp;#x200B;\n\nI've tried couple free lessons and kinda liked it.\n\nIt looks alright overall but I didn't like when it pronounced some words by each character separately, instead just the whole word like you normally speak. But some words it was normal.\n\nSo I'm not sure if I want to buy the premium.\n\n&amp;#x200B;\n\nWhich is why I'm asking if anyone can recommend this? \n\nDo you think is has enough content? Is it a good app to learn kanji and vocab?",
        "created_utc": 1673093938,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any (good) resources for grinding grammar practices?",
        "author": "TheChingerChanger",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105n8vh/any_good_resources_for_grinding_grammar_practices/",
        "text": "I mean something like this\n\nhttps://test-english.com/grammar-points/b1/present-simple-present-continuous/\n\nBut for Japanese. Just raw strings of exercises for various subjects, preferably with corrections. \n\nSomehow, between all the recommended resources, I've never seen one like it. Thanks!",
        "created_utc": 1673092160,
        "upvote_ratio": 1.0
    },
    {
        "title": "JLPT Grammar List for Anki",
        "author": "apparentlyineedaname",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105mrb3/jlpt_grammar_list_for_anki/",
        "text": "So I‘ve been using https://jlptgrammarlist.neocities.org/ as a reference for a while now. I like it because it‘s concise and well designed.\n\nI figured iId make an anki deck from it which I’d like to share here: https://ankiweb.net/shared/info/1330799363\n\nPlease enjoy (or don‘t).",
        "created_utc": 1673090413,
        "upvote_ratio": 1.0
    },
    {
        "title": "Before you got the ball rolling, what part of learning Japanese was the hardest for you to jumpstart?",
        "author": "Joshua_dun",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105iqk8/before_you_got_the_ball_rolling_what_part_of/",
        "text": "Began learning about a week ago, was just curious what was the biggest roadblock for people in their beginning process (and how they overcame it)",
        "created_utc": 1673075427,
        "upvote_ratio": 1.0
    },
    {
        "title": "When/How to use こちらこそ",
        "author": "jijiro21",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105ioeo/whenhow_to_use_こちらこそ/",
        "text": "Hey guys, my boyfriends recently started learning Japanese on Duolingo and he learnt that こちらこそ means ‘likewise’ and questioned why I corrected him to say わたしも instead of that. for context i said 疲れた and he wanted to say “me too”. I’ve been learning Japanese for a while and currently reside in Japan but haven’t really heard こちらこそ being used so his question stumped me.",
        "created_utc": 1673075212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any similar books or even the Japanese version of English for Everyone: English Vocabulary Builder?",
        "author": "Common_Egg_7522",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105h832/is_there_any_similar_books_or_even_the_japanese/",
        "text": "*English for Everyone: English Vocabulary Builder* is my favorite vocabulary builder and I used it to memorize English words. Now I wonder whether there is any Japanese version of it too. I tried to search it in amazon.jp, but nothing found.",
        "created_utc": 1673070378,
        "upvote_ratio": 1.0
    },
    {
        "title": "Personal Kanji Dictionary Software",
        "author": "BoundlessFate1",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105gebx/personal_kanji_dictionary_software/",
        "text": "Im new to learning Japanese, and was wondering if there was any software I could log the Kanji I learn in. I feel like that could be an easy way to keep track of everything I'm learning.",
        "created_utc": 1673067806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Found out a way to Wanikani slightly less time consuming.",
        "author": "RaffDelima",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105g9x2/found_out_a_way_to_wanikani_slightly_less_time/",
        "text": "If you connect the free companion app Tsurukame go to settings &gt; reviews &gt; Anki mode you can just select “My answer was correct”, “My answer was incorrect”’ or “Ask again” later instead of typing. \n\nOr if you’d prefer to getting some writing practice in you can use the Japanese keyboard on your phone. \n\nThere were a few other settings I changed in the app too to make things easier but I forgot off the top of my head. Thought this info would be useful because they still have their lifetime discount until Jan 9th. I did this last year but I never got around to doing wanikani because it takes up so much time. Hopefully now I can use it a bit more and if this helps anyone here I’m glad. \n\nIt still takes a while because wanikani really makes you repeat things over and over and over. But it’s nowhere as time consuming and I’ve finally actually remembered some tricky readings I just wasn’t getting otherwise. \n\nOf anyone has any other suggestions please post them here.",
        "created_utc": 1673067444,
        "upvote_ratio": 1.0
    },
    {
        "title": "KANJI Master N5 - Introduction to Kanji",
        "author": "Ancient_Ad_2230",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105cpzl/kanji_master_n5_introduction_to_kanji/",
        "text": "Hello there!\n\nReally dumb question...\n\nso a friend gave me 漢字マスターN5 改訂版 / KANJI Master N5 - Introduction to Kanji (Revised edition) , however, i have no idea how to use it.\n\nJust opened the book and its all in Japanese as you might already guess I'm a total beginner so its really confusing to me how to use it.\n\nAny help is welcome.",
        "created_utc": 1673056975,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whiny, entitled question about podcasts",
        "author": "yilmephooo",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/105bmxa/whiny_entitled_question_about_podcasts/",
        "text": "This is probably reaching and it is definitely whiny and entitled but are there any interesting Japanese learning podcasts to listen to? I have tried the regular ones where they go over the basic daily routine, run of the mill stuff but I always get super bored and just turn on true crime or paranormal pods, (I can’t help who I am, it’s what I like). \n\nWhile I’m sure there is a pretty simple, “You want the good stuff ??? You gotta do the work” answer to my problem, I thought I’d reach out just in case.",
        "created_utc": 1673054081,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daily Thread: simple questions, comments that don't need their own posts, and first time posters go here (January 07, 2023)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1059w6d/daily_thread_simple_questions_comments_that_dont/",
        "text": "This thread is for all simple questions, beginner questions, and comments that don't need their own post.\n\n# Welcome to /r/LearnJapanese!\n\n* New to Japanese? Read our [Starter's Guide](https://www.reddit.com/r/LearnJapanese/wiki/index/startersguide) and [FAQ](https://www.reddit.com/r/LearnJapanese/wiki/index/faq)\n\n* New to the subreddit? Read the [rules](https://www.reddit.com/r/LearnJapanese/wiki/subredditrules)!\n\nPlease make sure if your post has been addressed by checking the wiki or searching the subreddit before posting or it might get removed. \n\nIf you have any simple questions, please comment them here instead of making a post. \n\n**This does not include translation requests, which belong in /r/translator.**\n\nIf you are looking for a study buddy or would just like to introduce yourself, please join and use the *\\# introductions* channel in [the Discord here!](https://discord.gg/yZQKZYdBSw) \n\n\\---\n\n\\---\n\n[Seven Day Archive](https://www.reddit.com/r/LearnJapanese/search?q=Daily+thread%3A&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=week) of previous threads.  Consider browsing the previous day or two for unanswered questions.",
        "created_utc": 1673049612,
        "upvote_ratio": 1.0
    },
    {
        "title": "What level do you think is good for reading JoJo Part 7 (with moderate difficulty)?",
        "author": "BoSsManSnAKe",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1058kbo/what_level_do_you_think_is_good_for_reading_jojo/",
        "text": "I know that answers are subjective and that it will most likely be a difficult thing to do. But I have an interest in reading Jojo’s Bizarre Adventure. \n\nI searched the sub and saw someone made a post who studied for 3 months. In comparison, I read/listen/study grammar for around 30-60+ min in a mostly consistent manner for about 2 years. I estimate my vocabulary (words that I would at least recognize) to be around 3500 words. \n\nI expect to struggle, but I would like the perspective of advanced people here. My interest in it being a learning exercise is about equal to my interest in knowing where the story goes, so I don’t mind spend spending a long time on a single volume.",
        "created_utc": 1673046340,
        "upvote_ratio": 1.0
    },
    {
        "title": "Online Japanese Conversational Classes (University of Hawai'i - Spring 2023)",
        "author": "syogakusya",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1057ivh/online_japanese_conversational_classes_university/",
        "text": "[removed]",
        "created_utc": 1673043881,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help finding a book to help learn, but one that doesn’t involve too much Kanji",
        "author": "thetrustysteed",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1057b29/need_help_finding_a_book_to_help_learn_but_one/",
        "text": "I’m a beginner, tried my hand at Korean, bought a book and everything, and ended up failing miserably because of the teaching method used in the book. It taught me the alphabet of Hangul and a lot of the different rules involved. Then the book went on to be ENTIRELY in the Korean alphabet. The problem with me is, I’m trying to learn while at work where I get a lot of free time, and at my job I am NOT allowed to have my phone. At all. No computers, nothing. So no auditory help whatsoever.\n\nI ended up learning a lot of the pronunciation of Hangul characters completely wrong (even though the book made it sound like I was pronouncing them right.) and there was no way of me knowing until I got home and looked up what I learned that day. \nI need a book that will remedy this problem. One that sounds statements out phonetically. I’d like to learn kanji too. But not if Kanji is all I’m gonna get.",
        "created_utc": 1673043369,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does small よ before ち change it?",
        "author": "ThrowCheeseASAP",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1054vnt/does_small_よ_before_ち_change_it/",
        "text": "So if:\nきよ is now pronounced as [kyo]\nぎよ is now pronounced as [gyo]\nによ is now pronounced as [nyo]\n\nAND ち\"よ is now pronounced as [jo]\n\nI'm just on my third day of learning hiragana and i'm using NukeMarines lessons. \n\nhere's video: https://youtu.be/5zn3_fwShR0?t=944\n(if time stamp doesn't work it's 3rd video 15:44)\n\nhere's playlist\nhttps://youtube.com/playlist?list=PL2A25F7399E8805ED",
        "created_utc": 1673037668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experiences of Renshuu Pro - is it worth it?",
        "author": "fae_bee",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1054be5/experiences_of_renshuu_pro_is_it_worth_it/",
        "text": "I started using Renshuu last week and I'm finding it pretty helpful so far! I'm thinking of paying for pro, especially with the current new year discount, however I want to hear if people have found it helpful in the long term first. Particularly experiences of pro vs regular!",
        "created_utc": 1673036318,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cure Dolly Complete Script (in editing)",
        "author": "Juan01010101",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/10540l4/cure_dolly_complete_script_in_editing/",
        "text": "It's not mine, credits to Mordraug. I found this yesterday, it's a transcript of the videos of Cure Dolly for who prefers to read, don't like her voice or if you just want to go through things faster.\n\n[https://docs.google.com/document/d/1XpuXerkGU8waJ4DPDNJA4bGeqOvM-csXjTe57iHARHc/edit?usp=sharing](https://docs.google.com/document/d/1XpuXerkGU8waJ4DPDNJA4bGeqOvM-csXjTe57iHARHc/edit?usp=sharing)",
        "created_utc": 1673035609,
        "upvote_ratio": 1.0
    },
    {
        "title": "あなたか",
        "author": "HentaiHardOn69",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1052i4m/あなたか/",
        "text": "I have watched a lot of anime, and in my studies of Japanese I have as to yet to figure out why \"Anata\" can be used as either a disrespectful \"YOU\" or a term of endearment meaning \"Darling\" or something the the effect of \"Sweetie\" and so on. Could someone please explain the difference? Resource material has not listed anything comprehensive.",
        "created_utc": 1673032029,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about how translations can be drastically different",
        "author": "madlink01",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1050tn5/question_about_how_translations_can_be/",
        "text": "I found a wikipedia article for Japanese language that I can't find (it's fine if nobody can find it, I'm mostly looking for the terminology for it and the understanding of it) where one of the example sentences were translated from (literally: \"my neighbor was playing an instrument.\") to (true translation: \"I was in a grumpy mood because my neighbor was playing his instrument so loudly I couldn't get any sleep.\")\n\nI understand that translations can never be 1:1 direct with just the words, and that japanese is more context heavy than English is, but im trying to understand how a simple sentence can mean something where even additional context can't explain how this works.\n\nAny help would be greatly appreciated.",
        "created_utc": 1673028061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to find light novels in Japanese",
        "author": "arib510",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/104z2sb/where_to_find_light_novels_in_japanese/",
        "text": "I need to find a light novel in the original Japanese for an independent study I'm doing. What would be the best place to look?",
        "created_utc": 1673024000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you relate missing a job opportunity just coz you don't know Japanese🥲, hope this sub takes me close to Japanese🙃",
        "author": "Puzzleheaded_Lie9409",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/104xbd2/can_you_relate_missing_a_job_opportunity_just_coz/",
        "text": "",
        "created_utc": 1673019793,
        "upvote_ratio": 1.0
    },
    {
        "title": "what's the difference between Handakuten and Dakuten?",
        "author": "Former_Leather8917",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/104v6u8/whats_the_difference_between_handakuten_and/",
        "text": "",
        "created_utc": 1673014390,
        "upvote_ratio": 1.0
    },
    {
        "title": "A sample of AI-generated kanji for words like Pikachu and Youtube",
        "author": "sakeuon",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/104uv05/a_sample_of_aigenerated_kanji_for_words_like/",
        "text": "Crosspost from https://reddit.com/r/StableDiffusion/comments/104mb34/a_stable_diffusion_model_trained_on_images_of/ .\n\nJust thought it'd be interesting to share. A lot of the kanji don't make sense but I hadn't really thought about how new kanji could get invented, and getting an AI to do it seems like an interesting way to get candidates.",
        "created_utc": 1673013527,
        "upvote_ratio": 1.0
    },
    {
        "title": "From those who learned Japanese in Japan, what's the most effective way to learn quickly?",
        "author": "ilikemathuiuc",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/104u6dm/from_those_who_learned_japanese_in_japan_whats/",
        "text": "I just moved to Japan last month. I've been studying Japanese for about a year on my own. I have a lot of friends in Japan who want to teach me Japanese, and I am also starting weekly tutoring next week. The only problem with learning from my friends is that they don't know English, so we have to rely on Google Translate. It's not always super effective.\n\nI also started watching Japanese television because I have cable but I don't have Wi-Fi. I feel like television is one of the most useful things because I have a full immersive experience as there are no subtitles. Because my job doesn't allow me to speak Japanese at work, I am unable to have a fully immersive experience in Japan 24/7.\n\nIf anyone has any tips from their own personal experiences, I'd love to hear it. Life in Japan is really rough when you don't speak Japanese, so I'm trying to reach fluency as quick as possible. I'm fully prepared to study 1.5+ hours a day if that's what it takes.\n\nThanks in advance! 😃",
        "created_utc": 1673011621,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any good books that cover informal Japanese abbreviations and slang?",
        "author": "foxwithtea",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/104rh8h/any_good_books_that_cover_informal_japanese/",
        "text": "Prompted by the recent post \n\nhttps://www.reddit.com/r/LearnJapanese/comments/104euic/ending_a_spoken_sentence_in_%E3%81%A7\n\nFor example, a dictionary/handbook that one can look up that would explain the original, formal Japanese version of the colloquial shortcut.",
        "created_utc": 1673003102,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to say 'defined abs' in Japanese? Is 定義済み腹筋 correct?",
        "author": "titannnns",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/104qvma/how_to_say_defined_abs_in_japanese_is_定義済み腹筋/",
        "text": "Hi I'm trying to see how to write 'defined abs' in Japanese, and through google searches I came to the conclusion of, 定義済み腹筋. But I'm pretty sure I'm incorrect, so I wanted to ask what the actual writing for 'defined abs' would be?\n\nThank you for the help!",
        "created_utc": 1673000940,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book recommendation",
        "author": "kevinnykolas",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/104p2so/book_recommendation/",
        "text": "[removed]",
        "created_utc": 1672994236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone else tried YuSpeak?",
        "author": "TyMH789",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/104nu44/has_anyone_else_tried_yuspeak/",
        "text": "I've gone through all of their free content (10 different subject lessons) and I really like it and find it engaging. I rarely feel lost when using this app over others I've tried. However I really don't see anyone else talking about it.\n\nHas anyone else used it? Did you pay for it? How far did you get? Was it useful? Most importantly, is what it teaches correct?",
        "created_utc": 1672989570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are animated (stroke order) Flash Cards distracting when learning kanji/kana?",
        "author": "radiotechca",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/104mtol/are_animated_stroke_order_flash_cards_distracting/",
        "text": "I suspect that animated flashcards for learning kanji and/or hiragana/katakana are actually more distracting when they're animated when you're just trying to learn the characters on site, thoughts?",
        "created_utc": 1672986028,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a source for direct translation Japanese subtitles?",
        "author": "Amazinks",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/104mfp1/is_there_a_source_for_direct_translation_japanese/",
        "text": "I was thinking it might be beneficial to watch Japanese media with direct translations. It would be jibber jabber sentences, but would work well for adapting to the sentence structure.",
        "created_utc": 1672984780,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to answer in Japanese when someone knocks on the bathroom door?",
        "author": "oceanmaango",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/104lcyl/how_to_answer_in_japanese_when_someone_knocks_on/",
        "text": "This might sound a little weird, but I have an irrational fear that someone will knock on the bathroom door while i’m using it to see if it’s occupied. If this occurs, what would be the most appropriate response in Japanese?",
        "created_utc": 1672981371,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self Study Textbook Recommendations after finishing a beginner course",
        "author": "LowEducator6240",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/104l3g3/self_study_textbook_recommendations_after/",
        "text": "Hello! Im currently a college student and will be taking my second semester of japanese this spring. While I have really enjoyed the class and feel ive learend a lot of japanese, it doesnt apply to any major requirements so I cant take any more classes after the next one due to unit capacity. I want to continue learning japanese after im not taking a class anymore but I dont know which textbook is right for self study after 2 semesters of a japanese language class. \n\nFor a refrence to what Ive covered Im pretty much able to hold a conversation with someone about easy topics like family, weather, school, interests, and travelling and will be taking an aditional course with more content in the spring. \n\nSo after a year of japanese language classes, what are some good self study books? Probably enetering at the iintermediate level? Ive been looking at genki and みんなの日本語 but other than that im in the dark. \n\nAny recommendations would be greatly appreciated!\n\nありがとうございました！",
        "created_utc": 1672980579,
        "upvote_ratio": 1.0
    },
    {
        "title": "Papago Japanese voice",
        "author": "Zenijiro",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/104jiyn/papago_japanese_voice/",
        "text": "Do you guys think the Papago voice for Japanse sounds good or accurate? I was considering embedding the audio from there into my Anki cards. [https://papago.naver.com/](https://papago.naver.com/)",
        "created_utc": 1672976002,
        "upvote_ratio": 1.0
    }
]