[
    {
        "title": "How do I proceed further?",
        "author": "Hour_Woodpecker_906",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zbif9d/how_do_i_proceed_further/",
        "text": "Hi,\n\nSo started studying Japanese in mid-2019, and had planned to attempt N5 in July 2020, but that plan kept getting cancelled and postponed due to the COVID-19 lockdown. Now it's been 2 years, and I had also started a bit on N4. Tomorrow is my N5 exam. \n\nI was wondering if I should just keep studying and attempt N3 in December next year, or should I go step by step and attempt N4 in July 2023? \n\nI have heard that N3 can need a bit more time for studying so wanted to see more opinions on this.",
        "created_utc": 1670080237,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dumb question about tomorrow's JLPT exam.",
        "author": "shallow-waterer",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zbi6hc/dumb_question_about_tomorrows_jlpt_exam/",
        "text": "Hi, just reading the JLPT test guide for tomorrow's JLPT test in London and I'm a little confused.\n\nThere's a lot of talk of filling out the application form...is this another application form we do in person? Obviously we have all applied already, given we have test vouchers and are attending the test in the first place.\n\nIt just looks a little overwhelming given the time constraints, and I was wondering if it's a case of just turning up, signing in, and attending the relevant tests, or if this giant application form is part of the process that you have to do in person again before signing in? **The questions were all online when I applied, and many are repeated here, if not all of them.** \n\nSorry for how dumb a question it might seem, but I've never done a JLPT test in person, and I'm really stressed about it. \n\nThanks to anybody that replies - know this will undoubtedly prompt eye-rolling and groans from veteran JLPT folk, but please just take into account that this is my first time and I'm simply asking a question.\n\n  \nCheers and good luck tomorrow!",
        "created_utc": 1670079581,
        "upvote_ratio": 1.0
    },
    {
        "title": "From what JLPT level could I start to read very easy manga?",
        "author": "personalrhesus",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zbdukl/from_what_jlpt_level_could_i_start_to_read_very/",
        "text": "Hello. I've been learning japanese for the last 5 months. I've studied and (so-so) assimilated the half syllabus (grammar points + vocab + kanji) for JLPT 5 level. \n\nI'm curious about when I could start reading some very easy manga (like Yotsuba&amp;!) or story books or elementary school textbooks. A JLPT 5 level with a dictionary would be enough for that or I would wait until get, at least, a JLPT 4 level?\n\nFrom your experience, when did you start reading manga since you started to learn Japanese? \n\nDo you recommend any specific manga por beginners (besides Yotsuba&amp;!)?",
        "created_utc": 1670065410,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a Japanese-Japanese dictionary with Furigana above all Kanji in definitions/example sentences?",
        "author": "qwlea",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zbas0v/is_there_a_japanesejapanese_dictionary_with/",
        "text": "Hi, I've been watching anime without subs and conversing in Japanese for a little over a year at this point, but have yet to rack my brain around learning to fully read Kanji. I can understand the large majority of spoken Japanese, but have made very little progress with regards to reading. I would like to naturally learn through reading manga and what not rather than using rote memory applications. I've tried searching in English and in Japanese, but I can't seem to find an online Japanese -&gt; Japanese dictionary that has Furigana over all of the Kanji. I know some people say \"you shouldn't rely on furigana,\" but unless you learn the kunyomi and onyomi of every common kanji, there's no good starting point, and even then, in some cases you' have to guess the pronunciation of certain words. If anyone knows of anything like this, I feel it would be very helpful. Thank you.",
        "created_utc": 1670052984,
        "upvote_ratio": 1.0
    },
    {
        "title": "Next Step After Hiragana and Katakana",
        "author": "Accomplished_Step_21",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zb835v/next_step_after_hiragana_and_katakana/",
        "text": "I just finished memorizing hiragana and katakana. What would be the next step? Start memorizing kanji? Learn grammar? Do recommend what you think is the best. Thanks!",
        "created_utc": 1670043422,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have any supplementary resources geared towards travelers/ conversations who know some Japanese? I've done Genki 1 and 2.",
        "author": "Shufflenite",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zb7jn9/does_anyone_have_any_supplementary_resources/",
        "text": "I finally finished Genki 2 a week ago and have memorized most of the sentence structures and conjugations and I've been Doing Anki for months for vocab. Albeit I'm no expert, but I can read some Kanji sentences comfortably/ understand some conversations or at the very least get an idea of what they are trying to say. \n\nI do have trouble making sentences/conversations since I don't have many people in my life that I can practice with (most forgot how to speak it). So I end up just randomly saying conversational phrases aloud. \n\nI was wondering if anyone knew any resources for travelers/tourists emphasizing on conversation? or helpful Kanji to know as a tourist?\n\nI'm going to be traveling in 2 weeks and was looking for something casual to read/do during the plane/train rides. \n\nThanks!",
        "created_utc": 1670041619,
        "upvote_ratio": 1.0
    },
    {
        "title": "American traveling to Tokyo in 6 months. What is the single most effective language-learning tool to make the trip more enjoyable?",
        "author": "oxfordarms",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zb3dt6/american_traveling_to_tokyo_in_6_months_what_is/",
        "text": "I was up to level 18 on Wanikani before taking a break when it became more stressful than fun. I am at level 9 on DuoLingo now and learning some basic grammar. I also have the Genki 1 book. I want to make the most of my trip: read signs and menus, ask for basic directions, shop etc. So should I get back into Wanikani to learn as many kanji as I can? Or  focus on DuoLingo to just drill some basic phrases and grammar constructions? Or should I just watch a lot of Japanese language YouTube for 'immersion'? Or is there some other method? What do you guys say?",
        "created_utc": 1670028983,
        "upvote_ratio": 1.0
    },
    {
        "title": "Probably overthinking but im very confused on how to actually learn Vocabulary.",
        "author": "DiscoKeule",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zb3d6f/probably_overthinking_but_im_very_confused_on_how/",
        "text": "So i will just get straight to the point, i dont know how im supposed to learn new words with kanji in them. Im probably just scared to make a mistake but i still want to ask.\nI realize that there are probably many diffrent approaches to this but i just need a general direction if thats all you people can tell me. So of im learning a new word with kanji in it how am i supposed to learn to write that? At the beginning i thought you learn the kanji before you learn words containing them but i was told that your not supposed to 'just' learn kanji but to leaen them with Vocabulary. I guess my question is what kind of meaning should i attach to the writing to remember the kanji? The word as a whole or maybe connect the writing to one of the readings or meanings? Im confused because you have to remeber stroke order and such but i need something so i can recall that informarion under something\n\nIm terribly sorry if this is repetive ore to beginner level but i couldnt really find a post that answered my question, especially with the really good reddit search.\n\nIm really struggling because i want to continue to learn bjt im stuck and scared of making mistakes.\n\nThank you for taking the time.",
        "created_utc": 1670028934,
        "upvote_ratio": 1.0
    },
    {
        "title": "Japan trip coming up in 6 months. Which single language-learning tool will provide the most benefit for an American tourist in Tokyo?",
        "author": "oxfordarms",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zb2n96/japan_trip_coming_up_in_6_months_which_single/",
        "text": "",
        "created_utc": 1670026866,
        "upvote_ratio": 1.0
    },
    {
        "title": "Private instructor who will actually correct my mistakes",
        "author": "kisslizards",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zb29g4/private_instructor_who_will_actually_correct_my/",
        "text": "I can listen to native level podcasts and understand 80-90% of the material, but my speaking is garbage (grammar problems mostly).\n\nI've tried private lessons but I can't find a teacher who will 1) correct my grammar or 2) offer better, more natural ways of saying things.\n\nDoes anyone have a private instructor they trust/recommend?",
        "created_utc": 1670025775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daily Thread: simple questions, comments that don't need their own posts, and first time posters go here (December 03, 2022)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zb26vp/daily_thread_simple_questions_comments_that_dont/",
        "text": "This thread is for all simple questions, beginner questions, and comments that don't need their own post.\n\n# Welcome to /r/LearnJapanese!\n\n* New to Japanese? Read our [Starter's Guide](https://www.reddit.com/r/LearnJapanese/wiki/index/startersguide) and [FAQ](https://www.reddit.com/r/LearnJapanese/wiki/index/faq)\n\n* New to the subreddit? Read the [rules](https://www.reddit.com/r/LearnJapanese/wiki/subredditrules)!\n\nPlease make sure if your post has been addressed by checking the wiki or searching the subreddit before posting or it might get removed. \n\nIf you have any simple questions, please comment them here instead of making a post. \n\n**This does not include translation requests, which belong in /r/translator.**\n\nIf you are looking for a study buddy or would just like to introduce yourself, please join and use the *\\# introductions* channel in [the Discord here!](https://discord.gg/yZQKZYdBSw) \n\n\\---\n\n\\---\n\n[Seven Day Archive](https://www.reddit.com/r/LearnJapanese/search?q=Daily+thread%3A&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=week) of previous threads.  Consider browsing the previous day or two for unanswered questions.",
        "created_utc": 1670025611,
        "upvote_ratio": 1.0
    },
    {
        "title": "are there recommended apps/websites for watching Japanese channels on your computer/TV",
        "author": "gabremon",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zb017i/are_there_recommended_appswebsites_for_watching/",
        "text": "Years ago I learned Spanish and watching Spanish channels on tv helped immensely because I got an easy mix of sports, news, ads, and television shows.\n\nIs there an easy way to do this with Japanese? Like for example, watch an anime channel that has ads inbetween so I get a variety of content?",
        "created_utc": 1670020250,
        "upvote_ratio": 1.0
    },
    {
        "title": "N5-N3 Japanese with Shun experience.",
        "author": "hakulus",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zb001m/n5n3_japanese_with_shun_experience/",
        "text": "So I just wanted to share my experience of watching Shun on YouTube. When I started Japanese 11 months ago I had quite a bit of difficulty understanding even the Easy podcast of course.  5 months ago I could handle those and started watching his vlog of travels in New Zealand. Now I can understand all of his posts and I'm darned excited about it. I just wanted to recommend to anyone in the first year of study to give it a try for comprehensible input. \n\nIn addition he has started a Patreon where you can get the raw unedited videos he's doing that later he edits and puts up on YT. There are no subtitles and this is REALLY great since it challenges me to listen well but he still holds the conversation level below N3.  \n\nAnyhow just my 2 cents worth and a way to give a thumbs up to all the work Shun has done.  He doesn't have nearly the followers he should.",
        "created_utc": 1670020183,
        "upvote_ratio": 1.0
    },
    {
        "title": "Download my recently made Anki flash card (Itachi lines)",
        "author": "Djameljimo",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zawziy/download_my_recently_made_anki_flash_card_itachi/",
        "text": "Hi\n\nI'd like to share with you my Anki deck which I made from a Youtube. Using Anki flash cards will make the content of the educational videos you watch more memorable and easy to revise. \n\nI hope the admin accept this. The link is in my new Facebook group. I also would love to hear your feedback. \n\nhttps://m.facebook.com/groups/536161791711583/permalink/536220891705673/?sfnsn=mo&amp;ref=share&amp;mibextid=VhDh1V",
        "created_utc": 1670013683,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a way to type loud in Japanese?",
        "author": "Unovaisbetter",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zaww2y/is_there_a_way_to_type_loud_in_japanese/",
        "text": "In English we USE FULL UPPERCASE TO DO THAT but what do the Japanese do?",
        "created_utc": 1670013437,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can somebody help me with this grammar point?",
        "author": "leckmeinyarrak",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zawp63/can_somebody_help_me_with_this_grammar_point/",
        "text": "https://jlptsensei.com/learn-japanese-grammar/%E3%81%A0%E3%81%AE%EF%BD%9E%E3%81%A0%E3%81%AE-dano-dano-meaning/\n\nJlpt sensei says that the conjugation for nouns and na-adjectives need a (だった) but the example sentences with nouns and na-adjectives don't have the だった？？？？ I'm suuuuper confused now:(\n\nDoes somebody know how to use this grammar point?",
        "created_utc": 1670012986,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with daily growing amount of stuff to learn?",
        "author": "Cycode",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zaureh/how_to_deal_with_daily_growing_amount_of_stuff_to/",
        "text": "Hey, so i'm now 6-7 months deep learning Daily Japanese.. and my progress slowed down rapidly after the first 3-4 months. it now feels like i'm a snail.. but i have currently another issue.  \n  \nthe daily growing amount of stuff i have to repeat and learn to keep it memorized. i currently have around 70-100 words i need to repeat (i currently use memrise + additional sources), and it this amount is growing daily more and more. if i would repeat older courses from the 6-8 available, i wouldn't get anymore.  \n  \nso.. how do you deal with the steady growing amount of material you have to learn? i learn daily 1-2 hours, and feel like i'm not being able to do enough. alone to repeat already learned things, i need a lot of time each day so i have almost no time to learn new things.. so my progress slowed down a lot. and this frustrates me a lot.  \n  \nhow do you deal with this? i tried learning more hours, but even with breaks i get headaches after a while.. so doing even more feels like too much for me.",
        "created_utc": 1670008552,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the best apps/websites to learn japanese grammar?",
        "author": "Puzzleheaded-Fly2436",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zasjti/whats_the_best_appswebsites_to_learn_japanese/",
        "text": "",
        "created_utc": 1670003434,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need feedback on ASO foreign language college in Fukuoka",
        "author": "LeeeOhn",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zasi9n/need_feedback_on_aso_foreign_language_college_in/",
        "text": "Would appreciate any feedback from people who study/studied there on a japanese language program.",
        "created_utc": 1670003333,
        "upvote_ratio": 1.0
    },
    {
        "title": "How should I plan to study after Heisig if I already have some background in Japanese and I have good access to immersion?",
        "author": "2PoopOrNot2Poop",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zaqmsa/how_should_i_plan_to_study_after_heisig_if_i/",
        "text": "Hi!\n\nSo as the title suggests, I am at about frame 1200 out of 2200 in the Heisig Anki deck, and I'm thinking about how I should proceed after I get through it all.\n\n&amp;#x200B;\n\nHowever, I'm in a unique situation with my background in Japanese, which is why I'm making a post.\n\n&amp;#x200B;\n\nA lot of post-Heisig guide articles assume that Heisig is the first thing you do when studying Japanese. However, for me, I had studied Japanese up to the advanced university level prior. Albeit, I was always behind the other students (there were a lot of Chinese and Koreans with familiarity with East Asian languages), my last year of it was during COVID, and I didn't study it for a year after.\n\n&amp;#x200B;\n\nI should also mention that I have access to a lot of Japanese immersion, as the company I work for is the American headquarters for a Japanese corporation, and so most of my coworkers are Japanese expats.\n\n&amp;#x200B;\n\nGiven my situation, do any of you happen to have advice for where I should go after I finish Heisig?",
        "created_utc": 1669998824,
        "upvote_ratio": 1.0
    },
    {
        "title": "New Nelson",
        "author": "daringdaniel7",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zaq8xb/new_nelson/",
        "text": "I love using it. Ever since i got it finding and understanding kanji as been made a lit simpler. but the Romaji kills me. Is there anyway I could find a version with at least hiragana?",
        "created_utc": 1669997852,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is better? are both correct?",
        "author": "Matt7531",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zaoq6v/what_is_better_are_both_correct/",
        "text": "いつぐらい\nｖｓ\nどのくらい\n\nCan I use either?",
        "created_utc": 1669994007,
        "upvote_ratio": 1.0
    },
    {
        "title": "Search by grammar and get example sentences?",
        "author": "level_2_kobold",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zao829/search_by_grammar_and_get_example_sentences/",
        "text": "Is there a website that allows you to search by grammar and get example sentences? I like to see it lots of examples and hammer on the basics so that I can get a good recall rate. I cannot make these myself because my hands are injured. Thank you for your suggestions.",
        "created_utc": 1669992743,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kun-yomi or On-yomi",
        "author": "daskou_",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zajmuz/kunyomi_or_onyomi/",
        "text": "I had a conversation with a Japanese guy and we talked about the mountain (やま)\nAnd then i asked him when is it appropriate to use the on-yomi which is さん. He told me that さん doesn’t mean mountain. But the resources i use to learn they mention it as San. When do i use the kun-yomi and when the on-yomi? Do i have to learn both?",
        "created_utc": 1669980851,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Meta] Let's address the elephant in the room: way too many wrong answers",
        "author": "morgawr_",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zaj3a5/meta_lets_address_the_elephant_in_the_room_way/",
        "text": "It's honestly been weighing on my chest for some time now, and even if it's just a \"let it out\" cathartic moment I want to rant about this for a bit because it's gotten really bad especially lately.\n\nI've been in this sub for a few years now, I have my periods of daily answering questions and helping people, and then months of radio silence as I move on with my life. For the last few months I've been mostly away but recently I came back and... I'm honestly surprised at how bad it's gotten. \n\nBefore you get upset about this, let me clarify a couple of things:\n\n * There's a lot of extremely skilled, friendly, and welcoming people in this subreddit who are always providing amazing high-quality answers and helping others completely for free. This thread is **definitely not** about them. You probably know who those people are. I'm not talking about them. \n\n * I absolutely love the **discussions**. Even the opinionated posts and the occasional \"flame war\" that happen between different camps (immersion vs textbooks, pitch accent vs no pitch accent, etc). I've gotten my fair share of downvotes, and given some too. It's just part of the discourse. **I am not talking about subjective posts here**. Everyone has different opinions, especially when it comes to language learning\n\n * I absolutely love the daily question thread. The quality of answers there is always extremely high, I rarely see wrong answers (ignoring mine), and there's a good amount of native speakers who help a lot. It's really high quality.\n\nThis said, it's a bit sad to see the difference in quality when it comes to the main sub page. A lot of \"simple\" questions that should be posted in the simple question thread often just float around with 1 or 2 answers on the front page and don't get deleted until maybe a day later (I've seen posts up for like 16 hours before they get deleted). And more often than not those answers are very low quality or incorrect (talking objectively here, like wrong grammar, etc) and sometimes even get a few upvotes too. **The fact that both the thread and the wrong answers stay up for so long with positive upvotes is what is actually bad for other people lurking and learning.**\n\nThere's usually even 2-3 longer threads (I can spot at least one right now on the front page, although I won't link to it) with like hundreds of upvotes, 20-30+ replies, and a probably a good 70-80% are just flat out wrong (again, not talking about opinions, I'm talking about actual objectively wrong answers). Often these wrong answers will even be top of the thread (most upvoted) and you'll sometimes see a native speaker answer later and still not make it anywhere close to being the top answer.\n\nWhat's the solution? I honestly don't know, but as it is right now it's **really** bad for beginners. Most people in JP learning communities are at beginner (more than half) or intermediate level [(Here is the data if you're curious)](https://i.imgur.com/bVar0uj.png) [\\*] and this can explain both the existence of wrong answers and why they might get upvoted so much.\n\nOne of the subreddit rules is:\n\n&gt; **Do not guess or attempt to answer questions beyond your own knowledge.** Remember that answers you receive are never guaranteed to be 100% correct.\n\nOn the one hand obviously there's always some leeway for answers, there's sometimes subjectivity at play (\"I hear X all the time\" vs \"I never heard X being used\" which is common) and people do make mistakes and it's totally normal and acceptable for it to happen. However on the other hand, a lot of people are well aware that they should not be answering certain questions and yet they do it anyway, and there doesn't seem to be enough moderation to recognize, call out, and delete these posts. Especially when they make it to the most upvoted post in that thread.\n\nIs it just me? Am I an old bitter man? I probably expect to get a lot of flack from this post here but it's just my complete honest opinion as someone who spends an unhealthy amount of time helping others with Japanese. It honestly hurts me to see people get wrong answers and be none the wiser because of it. Especially when it happens on a weekly if not daily basis.\n\n[\\*] Data is sourced from a past survey (700+ responders)",
        "created_utc": 1669979347,
        "upvote_ratio": 1.0
    },
    {
        "title": "What books have you found that are great for learners?",
        "author": "MinecrafterJPN",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zahukf/what_books_have_you_found_that_are_great_for/",
        "text": "I have a few. But one that comes to mind right now is 魔女の宅急便. You know, Kiki's Delivery Service, but there is more to the story. Totally more! I read the first volume about 3 or 4 year ago and just picked up the second volume. It's just a cute story written in very clean and easy to understand Japanese. I'm a little advanced and reading this for pleasure, but I think a high level beginner to indeterminate could like it and learn a lot of new grammar and words along the way if they take it slow. The writing is never anything too complex.",
        "created_utc": 1669975826,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cram-able listening comprehension material? Advice for gaining comprehension?",
        "author": "Euphoric_Awareness72",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zahinu/cramable_listening_comprehension_material_advice/",
        "text": "I have a test coming up, but I don't have any cram-able listening comprehension study materials. Happy to pay money, and I am at N3 level.\n\n&amp;#x200B;\n\nFor stuff like grammar, or vocabulary I feel its very straight forward, but listening feels so wishy washy.\n\n&amp;#x200B;\n\nAny ideas to help?",
        "created_utc": 1669974888,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question for people who can talk comfortably in Japanese. Did you study pitch accent?",
        "author": "kyeopmuda",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zafaxv/question_for_people_who_can_talk_comfortably_in/",
        "text": "Did you study pitch accent? How? Did you memorize every vocab's pitch?\n\nIf you didn't, do you regret it? Would you do anything differently? Do you think immersion is enough to learn it?\n\nI am on Wanikani lvl 5, just finished Genki 1 and realized I pronounce words differently every time, haven't attached any pitch to any word.\n3 days ago, I decided I'd memorize every vocab's (on Genki 1) pitch accent, have not been able to get through the vocab on lesson 1, yet. I can repeat after the audio but I surely can not remember it after that.\nAs a native portuguese speaker, it sounds like there is pitch accent and more than one stress  syllable in each word, does Japanese have stress syllables?\n\n**TL;DR**: read paragraphs 1 and 2, only.",
        "created_utc": 1669967159,
        "upvote_ratio": 1.0
    },
    {
        "title": "Materials for getting up to speed quickly with business reading in Japanese",
        "author": "Weird-Dot170",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zac545/materials_for_getting_up_to_speed_quickly_with/",
        "text": "Hi, \n\n I've been in Japan for a few years and can speak fairly fluently but was just hired at an all-Japanese firm and need to have at least basic business-Japanese reading skills down pretty well in the next 4 months. I can read about 1/2 of what's on nightly tv but when I go to read work emails it's impossible. Study materials anyone can recommend? Thank you!!",
        "created_utc": 1669957342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electric Boogaloo Anki Deck twice amount of cards",
        "author": "suhaeiou",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/zabzmd/electric_boogaloo_anki_deck_twice_amount_of_cards/",
        "text": "Hi, i was checking on how many cards i have seen with my decks and i noticed that I have twice the amount of cards in my deck as compared to the number of cards in the ankiweb link of electric boogaloo. I have 17,311 cards on my stats total, and the deck has  \"8897 notes\" as it says on the ankiweb shared deck. Is the 17,311 number correct on my anki stats? or did i mess up something..",
        "created_utc": 1669956978,
        "upvote_ratio": 1.0
    },
    {
        "title": "Your personal favorite Japanese websites or blogs that reside in your kokoro and will never leave your side",
        "author": "JPN_Gamer",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/za9oxs/your_personal_favorite_japanese_websites_or_blogs/",
        "text": "こんにちは! Long time lurker but I finally garnered up some yuuki and made an account. お邪魔します (@w@)\n\nI know there are many resource lists out there buuuuuut (I know, this question again TToTT) what are some learning websites or blogs that really stuck with you over the years? For example, if you have a question or if the site only came up 7th in the search engine, you're on your away, dashing to that coveted url no matter how many clicks it takes. Clickity click click you go. You will go to combat for this blog.\n\nOR a better question would be what makes you love a site? In the wee hours of the night when you really should be doing something else, what pulls your kokoro to endless scroll on those sweet delicious Japanese tips &amp; tricks?\n\nFor me, I love the Japanese Language Stack Exchange. Also this subreddit has always been a guilty pleasure of mind when it comes to endless scrolling I shall admit. I guess I tend to gravitate to more community based sites. I wish I knew about more blogs though. Another resource I like for grammar is the 日本語の森 youtube channel. How about you?\n\nNice to finally meet you all!",
        "created_utc": 1669951027,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the difference between WA and GA.",
        "author": "battlemonkey69",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/za7tqi/whats_the_difference_between_wa_and_ga/",
        "text": "They both seems to do the samething and yet you can't use wa instead of ga and vise versa.Please I lost some scores in writing test because of those two.",
        "created_utc": 1669946600,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the difference between WA. and GA and how are they used?",
        "author": "battlemonkey69",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/za7oyq/whats_the_difference_between_wa_and_ga_and_how/",
        "text": "",
        "created_utc": 1669946307,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daily Thread: simple questions, comments that don't need their own posts, and first time posters go here (December 02, 2022)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/za4ndp/daily_thread_simple_questions_comments_that_dont/",
        "text": "This thread is for all simple questions, beginner questions, and comments that don't need their own post.\n\n# Welcome to /r/LearnJapanese!\n\n* New to Japanese? Read our [Starter's Guide](https://www.reddit.com/r/LearnJapanese/wiki/index/startersguide) and [FAQ](https://www.reddit.com/r/LearnJapanese/wiki/index/faq)\n\n* New to the subreddit? Read the [rules](https://www.reddit.com/r/LearnJapanese/wiki/subredditrules)!\n\nPlease make sure if your post has been addressed by checking the wiki or searching the subreddit before posting or it might get removed. \n\nIf you have any simple questions, please comment them here instead of making a post. \n\n**This does not include translation requests, which belong in /r/translator.**\n\nIf you are looking for a study buddy or would just like to introduce yourself, please join and use the *\\# introductions* channel in [the Discord here!](https://discord.gg/yZQKZYdBSw) \n\n\\---\n\n\\---\n\n[Seven Day Archive](https://www.reddit.com/r/LearnJapanese/search?q=Daily+thread%3A&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=week) of previous threads.  Consider browsing the previous day or two for unanswered questions.",
        "created_utc": 1669939209,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do you say cringe?",
        "author": "angelofxcost",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/za4el4/how_do_you_say_cringe/",
        "text": "",
        "created_utc": 1669938644,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning resources when hitting a plateau?",
        "author": "KyleR9173",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/za4ap8/learning_resources_when_hitting_a_plateau/",
        "text": "I've been learning Japanese for about 4 years. I learned how to read kana and a few hundred kanji in the first year, and due to overwork from my career I took about two years off and have been going strong for the last year, however I'm beginning to hit a plateau where I'm having difficulty retaining my knowledge of kanji and vocabulary. \n\nI primarily study using Wanikani, and I'm a little over 50% of that, so I can accurately read around 1000 kanji. \n\nThe issue is that I have very little knowledge of grammar, sentence structure, how different particles modify and connect words, etc. Basically, I can't read a damn thing and so I'm hitting an issue now where I can see, recognize, and read plenty of different words but can't read the majority of full sentences. \n\nWhat would be the best way to address this? Just pick up a copy of Genki I and go at it? Read through Tae Kim's? Or does someone here have a better recommendation for textbook or resource?",
        "created_utc": 1669938395,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else think the JLPT is too long? (Time-wise)",
        "author": "Sea_Phrase_Loch",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/za38sn/anyone_else_think_the_jlpt_is_too_long_timewise/",
        "text": "Whenever I take practice tests I get incredibly bored waiting for the section to end. Would that be the same for the real test? Do other people feel the same way? Are we supposed to look over our answers? I don’t think I read super fast (about 2-3 minutes to an average book page, 4 if I can’t read the kanji well) so you’d think most people would also spend a good amount of time just sitting there. In general I think most standardized tests involve a lot of sitting around doing nothing, though.\n\nBut also I just kind of worry I’ll start to need to pee while sitting there since the test is so long (do you get a bathroom break?). Or my chronic illness will flare and I’ll be stuck there for longer with nothing to do but wait and endure. Although maybe 2.5 hours isn’t as long as I think it is? It does seem very long",
        "created_utc": 1669936026,
        "upvote_ratio": 1.0
    },
    {
        "title": "which hiragana should be used here?",
        "author": "MazeRaven",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/za2asn/which_hiragana_should_be_used_here/",
        "text": "父はお酒をたくさん飲んだので、赤い顔（　）しています。\n\nI need to pass a Japanese exam at my university and this was an example of possible questions in the particles part, I think が is probably the right answer but a friend of mine said  を and since I don't wanna fail I'll ask the general public XD",
        "created_utc": 1669934014,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much is the JLPT in your country?",
        "author": "mla999",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/za0i57/how_much_is_the_jlpt_in_your_country/",
        "text": "US here. Paid $100 (We also get one exam per year). \n\nI thought it would be around the same price for other countries as well but learned that it’s a lot cheaper in some places. How much is the JLPT in your country?",
        "created_utc": 1669930308,
        "upvote_ratio": 1.0
    },
    {
        "title": "N1 is intermediate level",
        "author": "NacL250",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z9yaqm/n1_is_intermediate_level/",
        "text": "I passed the N1 this summer (54/60 Grammar, 51/60 Reading, 42/60 Listening, 147/180 TOTAL, so it wasn't even ギリギリ or anything, I passed it alright). But guess what, I'm still nowhere close to native level. Ok, I can read books without too much problem, but not with the speed a native speaker could. I can hold a conversation, but still stutter and stop to think about what I want to say next every other sentence. Everyday I still come across new words or just entire phrases whose meanings I just don't get and have to machine translate. Also I scored 2/3 points in the listening section but can barely watch even the simplest of anime without subtitles for 1 or 2 minutes before pausing and rewinding to take another listen for a sentence I didn't understand; and during a conversation I have to ask the other party to repeat themselves quite often.\n\nJLPT does an awful job at grading one's japanese ability. I know even before people were saying that N1 ≠ fluent, but like, it's more than that, it's not even CLOSE to fluency... How can this be the hardest test and why can you pass it with only 100 out of 180 points...\n\nBeen studying for 2 years by the way, so still a long journey ahead of me",
        "created_utc": 1669925526,
        "upvote_ratio": 1.0
    },
    {
        "title": "Well, I am screwed...",
        "author": "SmeatSmeamen",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z9x0yz/well_i_am_screwed/",
        "text": "N4 exam is this Sunday. Listening skills are utterly atrocious, feel like my brain just doesn't work fast enough to ever get any better at listening, and my vocabulary is missing a lot of the N4 words. Even for some words I've learned already I struggle recognise them when they are spoken. I probably get on average about 3/10 listening questions correct on the sample exam papers.\n\nHas anybody ever successfully crammed for the listening part? I've pretty much resigned to failure at this point. But after that, I guess I need to get serious about practicing listening. Right now I just feel dumb and slow and like this is an unsurmountable hurdle",
        "created_utc": 1669922734,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the accepted japanese word for 'unsee', as a verb?",
        "author": "Indrigis",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z9vx1j/what_is_the_accepted_japanese_word_for_unsee_as_a/",
        "text": "As in \"make me unsee it\".\n\nI have searched the Googles, but they almost exclusively lead to \"unseen\" as an adjective.",
        "created_utc": 1669920356,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you recommend MIGII?",
        "author": "Fulminacion",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z9v57m/would_you_recommend_migii/",
        "text": "Hi. I’m studying for N2.\nSome girl I follow uses an app called MIGII (she is studying for N1) but I wanted to know more opinions before buying it. Is it useful?",
        "created_utc": 1669918710,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why can't I find Japanese news in Japanese anymore on YouTube?",
        "author": "UnitedWolverine5501",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z9uium/why_cant_i_find_japanese_news_in_japanese_anymore/",
        "text": "I thought NHK used to broadcast on YT in Japanese, but it's all English now. :( Very disappointed. Are there any other channels on YT I can find Japanese news in Japanese? So, far I haven't been able to find anything else.",
        "created_utc": 1669917423,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pitch accent",
        "author": "VIR-SUM",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z9u7m1/pitch_accent/",
        "text": "Of all the problems people have when learning japanese, such as kanji or grammar, my biggest challenge when it comes to learning any language will always be pronunciation. And although many features of japanese phonology are hard to grasp, such as the voiceless vowels or some sound qualities unkown to linguists themselves, pitch accent is the one thing that seems hard but should actually be very easy.\n\n\n\n\n\nTokyo japanese pitch accent is basically a feature of vowels(sonorants) in the japanese language, where vowels will sometimes be pronounced higher(somewhat \"feminine\" or \"young\") and sometimes lower(somewhat \"masculine\" and \"old\").\n\n\n\n\n\nAfter looking at a few transcríptions of japanese pitch accent, it seems to me the \"low\" pitch is actually the \"default\" pitch among japanese vowels, while the \"high\" pitch seems to be the \"accent\", somewhat alike to english stress accent.\n\n\n\n\n\n\nWhat is your take on this interpretation?",
        "created_utc": 1669916769,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help translating my school's anime club sweatshirt design.",
        "author": "KlammantheKlam",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z9u3tg/need_help_translating_my_schools_anime_club/",
        "text": "Hey, I'm wondering if anyone on here can translate 'Lancer Anime Club' into Katakana. Any advice is welcome.",
        "created_utc": 1669916542,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where do i start?",
        "author": "Takaharu7",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z9sctp/where_do_i_start/",
        "text": "Hey there im very motivated to learn japanese as a hobby. I love japans traditions and culture.\n\nAre there good programs thatl help me learn? \nWhat are the first steps everyone takes learning japanese?",
        "created_utc": 1669912457,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where do i start? Is there a good software out there to learn? I am new and very motivated to learn japanese!",
        "author": "Takaharu7",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z9sayu/where_do_i_start_is_there_a_good_software_out/",
        "text": "",
        "created_utc": 1669912329,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fun Basic Kanji and Review Apps?",
        "author": "Nwiebz",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z9r4dk/fun_basic_kanji_and_review_apps/",
        "text": "I’m sorry in advance if this question has been asked before but does anyone have any suggestions for learning and reviewing practical kanji pronunciation and N5 material?\n I’m in a strange situation. I understand roughly 60-70% of what’s being said when watching the weather channel and YouTube in Japanese but I took an N5 practice test and only scored 54/100. \nHere’s where I think my problems stem from: I’ve been self-studying for just over a year now by using mainly Duolingo and some from the Genki books. Without much long-term review. Duo and media consumption provides me with context so it’s easier to understand what I’m taking in, whereas the N5 test only gives me hiragana and katakana. I find it much easier to read kanji, which a lot of the time, isn’t on the tests I’ve taken. It’s sort of backwards. I also find myself hearing or reading words that I’ve studied but I cannot remember. \nI do most of my studying at work so bringing my Genki book isn’t very practical. In Duo, I’m at the stage where I’m learning about bank accounts which is too far past my goal of getting my N5 certificate, I would think. I’d like to get back to the basics without learning from scratch. Does anyone have any suggestions?",
        "created_utc": 1669909503,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kanji Kentei (漢字検定)",
        "author": "Lalinolal",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z9qt1q/kanji_kentei_漢字検定/",
        "text": "A question for those who have or will taken the  Kanji Kentei test.\n\nAt what JLPT lvl (roughly) did/will you start study for the Kentei and what lvl did you start with?",
        "created_utc": 1669908743,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any book recommendations?",
        "author": "assailent78",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z9qq0o/any_book_recommendations/",
        "text": "Hi I have been doing wanikani and I'm at level 11. Is there any good books with lots of furigana I can read?",
        "created_utc": 1669908551,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resources for deeper understanding of Kanji",
        "author": "AkkiMyl",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z9otld/resources_for_deeper_understanding_of_kanji/",
        "text": "Hello, sorry if this has been asked before. While learning Kanji, our teacher sometimes makes a mention of some part of the kanji that is related to a certain meaning, and when looking stuff up online I've often seen people describe parts of the kanji as \"associated with X or Y\", either phonetically or referring to their meaning. For example, I saw a post where someone was saying that the roof radical appears as the \"kan\" phonetic component. Knowing things like this would be immensely useful and interesting to me while learning kanji, so I was wondering if there are any resources I could look at that would explain things such as this, or provide context as for the meaning of certain radicals, their purpose in certain parts of the kanji and so on. Thank you in advance!",
        "created_utc": 1669903818,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can i get corrected exercises?",
        "author": "MrDimitry_",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z9odam/where_can_i_get_corrected_exercises/",
        "text": "So, i've been studying for myself for 2 weeks or so, and i think i made some progress. The thing is i don't have anything to actually practice. Do you guys know where can i get some exercises? If they were free it would be great",
        "created_utc": 1669902617,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can you watch American TV shows with japanese subs",
        "author": "InucrowCorporation",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z9l5y5/where_can_you_watch_american_tv_shows_with/",
        "text": "こんにちはみなさん。英語のシリーズと日本語言葉どこがありますか\n\nたとえば「ハウアイメットユアマザー」か「ビグバンテオリ」とか\n\n皆ありがとう",
        "created_utc": 1669893008,
        "upvote_ratio": 0.5
    },
    {
        "title": "What exactly do I need to be fluent?",
        "author": "InjuredHands",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z9ktyk/what_exactly_do_i_need_to_be_fluent/",
        "text": "This might sound dumb, but what do I have to learn to be fluent?\nThousand of Kanji and thousands of words.\nAnd gramma. \nAnd I should be able to just talk, without thinking about it. Making it a normal thing.\n\nDon’t get me wrong, just that is so much work.\nBut I feel like I’m missing something.\nIf I learn Vocabulary and gramma for 5 years and also talk the language often, I might get fluent? \nI feel like there’s gotta be something to make this harder.\nI want to be completely fluent I should mention. I want to make this language my Job in the future.",
        "created_utc": 1669891814,
        "upvote_ratio": 0.4
    },
    {
        "title": "Learn Osaka-ben and slang with my channel",
        "author": "chocmonj",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z9joq5/learn_osakaben_and_slang_with_my_channel/",
        "text": "My Japanese friends and I recently revived an old youtube channel, with English subtitles! \n\nThe channel is generally about catching (and returning!) living things in Japan such as insects and fish, but in true Osaka style it's just an excuse to make jokes and have good times.\n\nhttps://www.youtube.com/watch?v=MCYXQCrGLYY - わくわく探検隊\n\nSince we're friends, most of the conversation is in casual form, with some \"polite casual\"  and some regular です/ます.\n\nPolite casual may be something learner are unfamiliar with. It's easy to make just by adding っす or んっす on the end of casual sentences, and is used to speak to friends who may be higher status than you at work and so on. \n\n\nExample from the video: 今回はホンマっす！\nホンマ is Osaka-ben for 本当 so the meaning is \"This time is for real\"\n\nMore video examples:\n\n別に女にかまけたりしてへんから -\nしてへん would be していない in regular Japanese\n\nそれしかないやないか - ないやない changes to ないじゃない\n\nなんやねん - this is Osaka expression like なんだよ\n\nInterestingly, よ can become で or ねん depending on the phrase.\n\nええ迷惑やな - becomes いい迷惑だね in regular Japanese\n\nIf you are interested I can explain more about the slang used, but I'm not sure if these videos are useful to people who are still learning Japanese.\n\nPlease let me know your opinions! フカヒレ",
        "created_utc": 1669887537,
        "upvote_ratio": 0.91
    },
    {
        "title": "What does \"なしんせいかつ\" mean?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1669881092,
        "upvote_ratio": 0.67
    },
    {
        "title": "Japanese Typing Test？",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1669868128,
        "upvote_ratio": 0.57
    },
    {
        "title": "JLPT N3",
        "author": "MindWonderful8727",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z9dlzn/jlpt_n3/",
        "text": "Is minna no nihongo enough to clear N3? Both parts.",
        "created_utc": 1669867199,
        "upvote_ratio": 0.25
    },
    {
        "title": "やればできるさ",
        "author": "hau4300",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z9ci2e/やればできるさ/",
        "text": "やればできるさ is a sentence that is found everywhere, especially in lyrics. I have seen it translated as:\n\n1. You can do it (which actually means You are able to do it successfully or You can achieve it). \n2. You can do it if you try.\n\nHere is my interpretation:\n\nやれ is from やれる which is from やる. やる means \"to do\". やれる means \"to be able to do\". ば means something like \"if so\". So, my interpretation of やれば is \"If you can (make yourself) do it\". \n\nできる is 出来る which means \"to be able to do it (successfully)\". \n\nSo, my interpretation of やればできる is \"If you can make yourself do it, you will be able to do it (successfully).\" Sometimes, you just have to do something, so it is not up to you to \"try\" it or not. In other words, neither of the above translations is precise. \n\nAnd さ is just an emphasis that it will happen. \n\nAlso, I have seen 成功できる. But in this particularly case, it will be redundant to add \"成功\" because できる already means you will do it successfully. Will it be different if I write やれば成功できるさ？\n\nAny thoughts? Thank you.",
        "created_utc": 1669864343,
        "upvote_ratio": 0.46
    },
    {
        "title": "I want to compliment someones drawing that looks nearky-indentical to the \"real thing\" but how do I do that?",
        "author": "tinysuccesses",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z9azxh/i_want_to_compliment_someones_drawing_that_looks/",
        "text": "What is \"the real thing\" in Japanese? They drew a picture of Howl and Sophie and it looked nearly identifical to the actual scene in the movie. So, it looks like the \"real thing.\" \n\nHow do I say that...?",
        "created_utc": 1669860577,
        "upvote_ratio": 0.63
    },
    {
        "title": "Japanese Final Exam",
        "author": "sih100",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z99qej/japanese_final_exam/",
        "text": "Hello, I have a final in Japanese 101 coming up and am wondering if anyone has any tips for how to study and how to plan my studying to spread it out. I am really stressed and any help is very appreciated",
        "created_utc": 1669857399,
        "upvote_ratio": 0.39
    },
    {
        "title": "Hello, I have a final in Japanese 101 coming up and am wondering if anyone has any tips for how to study and how to plan my studying to spread it out. I am really stressed and any help is very appreciated",
        "author": "sih100",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z99ova/hello_i_have_a_final_in_japanese_101_coming_up/",
        "text": "",
        "created_utc": 1669857291,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kindle Scribe / Remarkable for learning Japanese?",
        "author": "_mr_stabby_",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z98hiz/kindle_scribe_remarkable_for_learning_japanese/",
        "text": "I take a weekly Japanese class, and write my notes in a notebook. I have messy writing in English (being left handed is my excuse), but my Japanese is much better. \n\nI'm thinking about getting an e-ink tablet like the new Kindle Scribe or a ReMarkable, so I can better organise my written notes, and can practice writing in Japanese without going through tons of paper. \n\nDoes anyone have any experience using devices like this to support their Japanese learning? Any advice or recommendations?\n\nありがとうございます。",
        "created_utc": 1669854272,
        "upvote_ratio": 0.56
    },
    {
        "title": "Daily Thread: simple questions, comments that don't need their own posts, and first time posters go here (December 01, 2022)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z97v78/daily_thread_simple_questions_comments_that_dont/",
        "text": "This thread is for all simple questions, beginner questions, and comments that don't need their own post.\n\n# Welcome to /r/LearnJapanese!\n\n* New to Japanese? Read our [Starter's Guide](https://www.reddit.com/r/LearnJapanese/wiki/index/startersguide) and [FAQ](https://www.reddit.com/r/LearnJapanese/wiki/index/faq)\n\n* New to the subreddit? Read the [rules](https://www.reddit.com/r/LearnJapanese/wiki/subredditrules)!\n\nPlease make sure if your post has been addressed by checking the wiki or searching the subreddit before posting or it might get removed. \n\nIf you have any simple questions, please comment them here instead of making a post. \n\n**This does not include translation requests, which belong in /r/translator.**\n\nIf you are looking for a study buddy or would just like to introduce yourself, please join and use the *\\# introductions* channel in [the Discord here!](https://discord.gg/yZQKZYdBSw) \n\n\\---\n\n\\---\n\n[Seven Day Archive](https://www.reddit.com/r/LearnJapanese/search?q=Daily+thread%3A&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=week) of previous threads.  Consider browsing the previous day or two for unanswered questions.",
        "created_utc": 1669852811,
        "upvote_ratio": 0.83
    },
    {
        "title": "Test voucher is 1 page?",
        "author": "jjroblo",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z961ar/test_voucher_is_1_page/",
        "text": "I just got my JLPT N2 test voucher. I am taking it in America and thought it would be multiple pages or a booklet.\nInstead my voucher is just 1 page. It just has a small purple square with my name, level, and registration number on it and so on.\nIs the test voucher usually just 1 page or am I looking at the wrong page?",
        "created_utc": 1669848514,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I apologize for NOT replying sooner? (in chat)",
        "author": "tinysuccesses",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z95jmn/how_do_i_apologize_for_not_replying_sooner_in_chat/",
        "text": "We were having a conversation and my phone was I think 3% I didn't have a decent connector for the charger so the battery stayed red... I want to continue (it's the next day) the convo but I'm not sure how exactly...\n\n\n早くテキスが出せなくてすいません。\n\nI'm sorry I couldn't text you sooner. \n\n\nis this correct? \n\n\nWe're on HelloTalk. Not polite enough or is this the right \"sorry\" for me to use? Should I be more formal?",
        "created_utc": 1669847405,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the difference between 何時ごろ and 何時ぐらい? Thanks!",
        "author": "Aur0ha",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z95gmt/whats_the_difference_between_何時ごろ_and_何時ぐらい_thanks/",
        "text": "",
        "created_utc": 1669847212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone made a kanji learning system using Japanese keywords?",
        "author": "rdfox",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z93thy/has_anyone_made_a_kanji_learning_system_using/",
        "text": "There are several kanji learning systems that assign keywords to kanji (Kanji Damage, Wani Kani, etc). The ones I've seen use English keywords. \n\nFor example, when you see 窓 you're supposed to think Window is made of Hole, Moo Cow and Heart.\n\nIt seems kind of obvious to use Japanese keywords instead. So I'm sure someone's tried it, but it's hard to Google.\n\nFor example, remember 窓 as Mado made of Ana, Mu Ushi and Kokoro.\n\nDo you know of any projects like that on the Internet?",
        "created_utc": 1669843663,
        "upvote_ratio": 1.0
    },
    {
        "title": "の Particle to Request/Provide Explanations",
        "author": "AndrewCreator",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z93nk2/の_particle_to_requestprovide_explanations/",
        "text": "1. What are the differences between conjugating の and using it with different conjugations?  \n2. What does each of them actually mean? Does **じゃなかったんだ** mean 'it was not, is not it?', can we just add the 'is not it?' part to the expression?\n\n||「んだ」 with different conjugations|「んだ」 is conjugated|\n|:-|:-|:-|\n|Negative|学生**じゃないんだ**|学生**なんじゃない**|\n|Past|学生**だったんだ**|学生**なんだった**|\n|Past-Neg|学生**じゃなかったんだ**|学生**なんじゃなかった**|\n\n3. I know that 今、授業がないんじゃない？ = Don’t you not have class now? (Expecting that there is no class),  \nBut how can I understand it that complex?  \nWhy does combining negative (がない) + negative (じゃない) we still have negative as translation (*Expecting that there is no class*)?  \nIs not it like in math: - (minus) \\* - (minus) = + (plus)\n\n4. The source of this grammar is [TaeKim Grammar Guide](https://guidetojapanese.org/learn/grammar/nounparticles). Are there any other sources especially for this part?",
        "created_utc": 1669843301,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with a translation",
        "author": "WeezleFinder69",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z93dyb/help_with_a_translation/",
        "text": "Hi, I know this probably isn’t the usual request but can anyone help me translate ‘peace amidst my chaos’ into Japanese? I’ve tried several translators and they don’t give the same answer so I don’t know which one to trust. If anyone could help that would be great. Thanks for any help guys :)",
        "created_utc": 1669842719,
        "upvote_ratio": 1.0
    },
    {
        "title": "JLPT NYC question for any previous takers",
        "author": "71619997a",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z90mjd/jlpt_nyc_question_for_any_previous_takers/",
        "text": "In the test information PDF online, it seems like they want us to get there from 11:30-12:00, but the ID check is listed as 12:30-1:00? Is there some kind of mistake here? When should I actually get there?",
        "created_utc": 1669836452,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am constantly frustrated at my horrible vocab. What advice do you have for improving this?",
        "author": "RashBandiscoot69",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z903ck/i_am_constantly_frustrated_at_my_horrible_vocab/",
        "text": "I feel like overall, I have become pretty decent in thinking in Japanese. But one thing always frustrates me so much, and thats the thought of \"I know I could have expressed my thought in Japanese if only i'd know the correct words.\"  \nI have been doing Anki for a while, but I always end up taking sometimes month long breaks from it. Anki is one of the most fun-killing activities I have ever done in my entire life.  \nI tried reading as well, I was enjoying it but I eventually gave up due to how long a page was taking to read (I tried 鏡の孤城)  \n\n\nDoes anyone have any ways that they were efficiently able to learn their vocab? If it turns out Anki is the most effective I'll just have to force myself through it, but if there are any other methods I would really appreciate it if you share them!  \nThank you in advance!",
        "created_utc": 1669835301,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best way to relearn content",
        "author": "Matt7531",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z8z20v/best_way_to_relearn_content/",
        "text": "After taking a break from a textbook like genki or nakama for a while, what would be the best way to quickly make sure you remember the content and continue with the book without having to reread literally everything and redo all the activities in the workbook I've already filled out.",
        "created_utc": 1669833108,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hoping to learn more vocabulary for the jlpt N3 test next July.",
        "author": "daringdaniel7",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z8z1t5/hoping_to_learn_more_vocabulary_for_the_jlpt_n3/",
        "text": "How should I Traverse vocabulary in the way that I don't learn a bunch of words I don't need to actually know and or would make me look like a tool if I used them?",
        "created_utc": 1669833095,
        "upvote_ratio": 1.0
    },
    {
        "title": "Started to look into 尊敬語 and 謙譲語. How do I know which conjugation form to use?",
        "author": "dontsaltmyfries",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z8wa1a/started_to_look_into_尊敬語_and_謙譲語_how_do_i_know/",
        "text": "Started to look into 尊敬語 and 謙譲語. How do I know which conjugation form to use? \n\nHi, maybe stupid question but I was starting to look into 尊敬語 and 謙譲語. Okay I watched some vids and the chapter of Tae Kims guide mostly on 尊敬語 so far and I am already a bit confused. \n\nOkay so there are set expressions like 見る becomes ご覧になります。する becomes なさいます.\n\nBut then as it seems there seem to be several conjugation possibilites to make verbs honorific that do not have a set expression. \n\nLike using the 受け身 form. One example of a video was 思いますか to 思われますか。\n\nAnother possible conjugation seems to be お+V+になります\n決まりましたか  to お決まりになりましたか\n\nYet another seems to be お+V+です\nもうお帰りですか example from Tae Kim's guide. \n\nOkay my question is how do I know which conjugation form to use with which verb?\n\nExample: If I have the verb 読む which doesn't seem to have a set expression in 尊敬語. How would I figure out if \nもう新しい本を読みましたか。becomes \n\nもう新しい本を読まれましたか. \n\nOr もう新しい本をお読みになりましたか.\n\nOr もう新しい本をお読みでしたか。? \n\n Is it something you have to learn and memorize for each individual verb what form to use or are there any rules that makes it easier?",
        "created_utc": 1669826720,
        "upvote_ratio": 1.0
    },
    {
        "title": "can you work part time as a short term student?",
        "author": "1ammidnight",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z8thbh/can_you_work_part_time_as_a_short_term_student/",
        "text": "If you are a language student for less than a year, maybe 3-6 months are you allowed to work part time? Can you get a student visa that way?\n\nI cant afford a full year but what I can do is pay short term and work a part time job (if possible) I know for most people a part time job is not enough to support yourself in a foreign country but accommodation isnt a problem for me because I have relatives that live here.",
        "created_utc": 1669820022,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone have resources similar to Benjiro-san Beginner Japanese or Japanese with Shun",
        "author": "ouaisouais2_2",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z8s1q5/anyone_have_resources_similar_to_benjirosan/",
        "text": "I'm learning so much from their videos, but it gets a bit boring to watch the same two channels over and over. Many others resources I've looked are either too unnatural (JapanesePod101) or too difficult (Miku real Japanese's conversations, YUYUnoPodcast or native content).\n\npls help",
        "created_utc": 1669816348,
        "upvote_ratio": 1.0
    },
    {
        "title": "do i need textbooks to learn japanese?",
        "author": "boredandreddicted",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z8qzdd/do_i_need_textbooks_to_learn_japanese/",
        "text": "i’ve been learning for a year now in december, i’ve never used a textbook do i need to use a textbook?",
        "created_utc": 1669813448,
        "upvote_ratio": 1.0
    },
    {
        "title": "ji or dzi?",
        "author": "beansandwich",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z8nzws/ji_or_dzi/",
        "text": "I have using this web app for hirgana and katagana however I decided to download an app for my phone to practice in bed and it says the ten ten for chi was dzi?",
        "created_utc": 1669803770,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with 小学校三年生 kanji study…",
        "author": "PM_MAJESTIC_PICS",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z8nmlj/help_with_小学校三年生_kanji_study/",
        "text": "My daughter is in 3rd grade in a Japanese elementary school. We are struggling with how to best help her learn kanji. We came from America with very little Japanese knowledge and she’s been in a Japanese school since May. School is going really well, she’s making friends, and her speaking/listening is coming along great… but we are struggling a bit with how to jump in to kanji. \n\nWhat we have to work with: a kanji drill book, a reading book, and a copy of the upcoming kanji test. See below:\n\nhttps://ibb.co/09qXmGz\n\nhttps://ibb.co/Ph79PG5\n\nhttps://ibb.co/VBQZV0p\n\nShe really wants to start learning the material and taking/passing the tests. Just wondering if there are any suggested methods for studying… how to make flash cards/what to include, for instance? She made cards with hiragana/English on one side and kanji on the other, but she said it’s not helping her learn the kanji because so many have similar readings and then the English word gives it away… but there’s no English on the test, so she needs another strategy.\n\nCompound this with the fact that I can’t read/speak Japanese either… however, I’m good with Google, with kanji apps, and with helping to study/make flash cards, so I’m ready and willing to help her tackle this!\n\nShe has some daily language help from a volunteer at school, but it’s more along the lines of translating for her rather than actual Japanese language instruction. She also is doing italki lessons but it’s more for conversation, not so much helping with kanji/reading.\n\nThanks for your pointers and study tips/strategies!! Side note: We are here for at least the next few years for work, so suggestions along the lines of “go back to America” or “put her in international school” are not helpful 😆",
        "created_utc": 1669802556,
        "upvote_ratio": 1.0
    },
    {
        "title": "does it make sense to just learn the meaning of kanji characters and then learn them through vocabulary?",
        "author": "jashawnroland",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z8ku7x/does_it_make_sense_to_just_learn_the_meaning_of/",
        "text": "こんにちは！i just started studying japanese a couple of weeks ago, and i noticed that that kanji / vocabulary uses a lot of different pronunciations, etc. for a character and it's confusing.",
        "created_utc": 1669792974,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to ask if soy/soy product is in a food item",
        "author": "nyibbut_",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z8im5k/how_to_ask_if_soysoy_product_is_in_a_food_item/",
        "text": "Sort of an odd question to ask in an asian country, I know, but I am traveling to Japan with some friends next year and am allergic to soy, so I would like to learn to ask to avoid it. I am not deathly allergic but it does make me very sick, so I would prefer to avoid it when at all possible. Thank you in advance!",
        "created_utc": 1669786431,
        "upvote_ratio": 1.0
    },
    {
        "title": "My sister-in-law studied Japanese in Japan back in the early 2000s",
        "author": "alanisgirl2022",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z8g3wg/my_sisterinlaw_studied_japanese_in_japan_back_in/",
        "text": "[removed]",
        "created_utc": 1669779561,
        "upvote_ratio": 1.0
    },
    {
        "title": "甘い usage?",
        "author": "tarafarrago",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z8fhkh/甘い_usage/",
        "text": "I'm hoping for some insight about how the word \"sweet\" is used differently (or similarly) in English vs Japanese.\n\nTLDR, can 甘い be used to compliment a person in Japanese or is there another better word?\n\nIn English we'd say of a person \"oh they're so sweet!\" And that's usually a compliment.\n\nIn Japanese I have only seen 甘い used to describe food/etc and not people. When I did some digging, I did find some sample sentences describing people, but they all seem to be kind of negative? For instance this one 甘いなあ。is translated as \"he's a pushover\". Another one is 彼の考えはどうもあまい。\"his views seem overly optimistic\"  (These are both sample phrases in takoboto, I have no idea where they're from or if they're decent translations or what their original context was)\n\nThanks so much for your help with this!",
        "created_utc": 1669777966,
        "upvote_ratio": 1.0
    },
    {
        "title": "停電しながらどう勉強しますか。",
        "author": "Chezni19",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z8ei3i/停電しながらどう勉強しますか/",
        "text": "雪を振ると停電になります。\n\nテキサスに住んでいますから。\n\nみんなさん、停電しながらどう勉強しますか。",
        "created_utc": 1669775525,
        "upvote_ratio": 1.0
    },
    {
        "title": "くつした thread: post words that were instantly understandable to you thanks to their word roots (any level is okay)",
        "author": "CitizenPremier",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z8dzn4/くつした_thread_post_words_that_were_instantly/",
        "text": "The purpose of this thread is to learn new words easily.\n\nIt doesn't have to be the real word root, even if it sounds like an English word, for example 不可能 means \"impossible\" and sounds a bit like \"fuck no\" and that's good for this thread.  \n\nI said I wanted to keep doing this type of thread and I'm keeping my word, here's the last one: https://www.reddit.com/r/LearnJapanese/comments/hb97cp/%E9%9D%B4%E4%B8%8B_thread_post_words_that_were_instantly",
        "created_utc": 1669774269,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daily Thread: simple questions, comments that don't need their own posts, and first time posters go here (November 30, 2022)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z8aq19/daily_thread_simple_questions_comments_that_dont/",
        "text": "This thread is for all simple questions, beginner questions, and comments that don't need their own post.\n\n# Welcome to /r/LearnJapanese!\n\n* New to Japanese? Read our [Starter's Guide](https://www.reddit.com/r/LearnJapanese/wiki/index/startersguide) and [FAQ](https://www.reddit.com/r/LearnJapanese/wiki/index/faq)\n\n* New to the subreddit? Read the [rules](https://www.reddit.com/r/LearnJapanese/wiki/subredditrules)!\n\nPlease make sure if your post has been addressed by checking the wiki or searching the subreddit before posting or it might get removed. \n\nIf you have any simple questions, please comment them here instead of making a post. \n\n**This does not include translation requests, which belong in /r/translator.**\n\nIf you are looking for a study buddy or would just like to introduce yourself, please join and use the *\\# introductions* channel in [the Discord here!](https://discord.gg/yZQKZYdBSw) \n\n\\---\n\n\\---\n\n[Seven Day Archive](https://www.reddit.com/r/LearnJapanese/search?q=Daily+thread%3A&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=week) of previous threads.  Consider browsing the previous day or two for unanswered questions.",
        "created_utc": 1669766411,
        "upvote_ratio": 1.0
    },
    {
        "title": "For JLPT N5, which item-counters should I be familiar with?",
        "author": "AdBulky2366",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z8aeaf/for_jlpt_n5_which_itemcounters_should_i_be/",
        "text": "",
        "created_utc": 1669765666,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the difference between ーましょうか and ーませんか ?",
        "author": "zxchcrxig",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z8ac6l/whats_the_difference_between_ーましょうか_and_ーませんか/",
        "text": "",
        "created_utc": 1669765530,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the iTalki website somewhat spotty for you guys?",
        "author": "Chezni19",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z8a8dh/is_the_italki_website_somewhat_spotty_for_you_guys/",
        "text": "It seems to load a blank page a lot, and then 5 minutes later it comes back.",
        "created_utc": 1669765286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with JLPT \"Selecting Grammar Form\" Questions",
        "author": "Sushiearl",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z8974r/help_with_jlpt_selecting_grammar_form_questions/",
        "text": "I'm taking the N5 Sunday and I'm good for the most part, but whenever I take practice tests the ones where you have to pick the right particle or verb tense are basically impossible for me. Any tips? I believe that these are officially called \"Sentential grammar 1 (selecting grammar form).\" Link to a couple of questions like what I mean [https://imgur.com/a/qgCjcpw](https://imgur.com/a/qgCjcpw)",
        "created_utc": 1669762901,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the first steps as a new learner",
        "author": "HumanNedNotAply",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z85myx/what_are_the_first_steps_as_a_new_learner/",
        "text": "I started learning Japanese on Duolingo just over 3 months ago, and it's leaving much to be desired. I want to learn Japanese semi-flunently, and I just want some guidance on how or where to really start. I've seen posts about Genki books and other resources, should I start there, or is this too advanced? So far, I know all the hiragana and katakana characters and around 10 kanji words.",
        "created_utc": 1669754814,
        "upvote_ratio": 1.0
    },
    {
        "title": "Speech vs comprehension",
        "author": "jumptooconclusions",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z85852/speech_vs_comprehension/",
        "text": "I'm sure we've all heard stories of people who've studied Japanese day in and out, thought they had could engage in full in discussions during their visit to Osaka, only to freeze up when someone asks them their name or to keep asking the person to repeat themselves because of how hard it is to understand speech at a normal conversational pace vs slower annunciated speech they learned with. \n\nSo what was your experience with speech and comprehension after leaving a classroom setting? Did you have one of those \"I forgot everything I learned\" moments during your first convo with a native? Which one did you struggle with, was one more difficult for you than the other? Not looking for a \"right answer\",by the way, just looking to hear some stories of my fellow  japanese learners and their experiences.",
        "created_utc": 1669753931,
        "upvote_ratio": 1.0
    },
    {
        "title": "Study in Japan during the summer",
        "author": "JaKris_96",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z7zpr9/study_in_japan_during_the_summer/",
        "text": "Hi all!\n\nHave you ever gone to study japanese in Japan during the summer? If so, which academy or school do you recommend?\n\nI've been thinking recently of going to Japan next summer to visit the country and learn japanese. I'm a total beginner and I've got zero experience with japanese. \n\nI would like to study in a academy during the morning and do some activities/visit places on the afternoon. \n\nAlso, if I need to ask for directions or something similar, will I be able to communicate with japanese people in English? I don't know if they will have a good English level to communicate with them.\n\nFinally, I would like to be able to read the signs on the streets in order to know which place is a restaurant or a coffee shop, etc. Should I learn Kanji for this or Hiragana/Katakana?\n\nThanks in advanced.",
        "created_utc": 1669741726,
        "upvote_ratio": 1.0
    },
    {
        "title": "一人でもやります",
        "author": "ikatako38",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z7yypp/一人でもやります/",
        "text": "I’m trying to translate this line of Japanese, and I’m not quite sure what the も particle is doing there. I know でも means “but,” but the で is already working with the 一人, so is the も separate? What does it mean?\n\nThank you!",
        "created_utc": 1669740000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Those self taught who got far in japanese... how did you study grammar / speaking?",
        "author": "Alberthor350",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z7wu51/those_self_taught_who_got_far_in_japanese_how_did/",
        "text": "Hi all, like many on this sub im learning japanese at my own pace mainly with SRSS systems and some apps like duolingo or bunpro. For writing and learning kanji and kana im using Skritter which is awesome.\n\n&amp;#x200B;\n\nIm wondering how did you guys (those of you who have actually gotten far as in N2-N1) levels in terms of resources to study grammar, practice speaking and so on?\n\n&amp;#x200B;\n\nI find it VERY hard to find japanese tutors in my area of the world, which is why im kinda limited in that sense.\n\n&amp;#x200B;\n\nThanks a lot",
        "created_utc": 1669735063,
        "upvote_ratio": 1.0
    },
    {
        "title": "Customizable Vocab Game",
        "author": "Painter3016",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z7wh6k/customizable_vocab_game/",
        "text": "I’m hunting around for a gamified version of vocab study where you make your own lists. I wish i liked Anki, but I hate it; it feels like a slog, so I never do it. \n\nOnce upon a time I used “drops,” which I liked the set up, but you couldn’t make your own lists, so I stopped using it. \n\nAny recommendations?",
        "created_utc": 1669734219,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it necessary to learn the stroke order of each kanji or are there some rules to prevent that ?",
        "author": "GarlicGuitar",
        "url": "https://www.reddit.com/r/LearnJapanese/comments/z7weg0/is_it_necessary_to_learn_the_stroke_order_of_each/",
        "text": "title",
        "created_utc": 1669734042,
        "upvote_ratio": 1.0
    }
]