[
    {
        "title": "I cried at my birthday cake",
        "author": "PofPafPefPifPuf",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6jzig1/i_cried_at_my_birthday_cake/",
        "text": "I (43M) cried at my birthday cake. A more or less random Tinderella went to the supermarket, bought ingredients, came to my place and baked a birthday cake for me. No one has ever done that for me before. Nexwife used to get \"sick\" or throw tantrums or whatever during my birthday to make it all about her.",
        "created_utc": 1498642654,
        "upvote_ratio": ""
    },
    {
        "title": "Help me handle my nFamily, nParents and my aunt's 14-year-old baby.",
        "author": "justNOthrowaway09",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6jx08q/help_me_handle_my_nfamily_nparents_and_my_aunts/",
        "text": "[removed]",
        "created_utc": 1498609753,
        "upvote_ratio": ""
    },
    {
        "title": "Those who didn't invite their parents to their wedding, how did you make it go smoothly?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6jwnbj/those_who_didnt_invite_their_parents_to_their/",
        "text": "[deleted]",
        "created_utc": 1498605970,
        "upvote_ratio": ""
    },
    {
        "title": "[vent] seeing my Narc-Ex fancy new life makes me even happier I left.",
        "author": "PiscesMermaid87",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6jw6ze/vent_seeing_my_narcex_fancy_new_life_makes_me/",
        "text": "4 Years ago I made the decision to leave my 3 year long relationship with a guy who looked good on paper. Tons of money in the bank and Soon to be A&amp;M graduate. So on and so forth. We met through mutual friends and hit it off pretty well. We ended up dating for three years, living together for 2 of those three. Once I moved into his place his true colors showed. He was horrendously Narcissistic, only cared about money, and extremely emotionally abusive.\n\nWhen I left I had nothing. Not even a bed to sleep on. I fit everything I owned including my two dearest pets I had long before I met him in the back of my very small hatch back and left. Had I stayed, I would have had everything I wanted, a brand new car, I would have been graduated by now with my Masters Degree making good money, I would be living a very nice house. Yadda Yadda Blah Yadda. But I didn't want a shitty loveless marriage based around 'stuff'. I spent all my life get away from my Narc family. I wasn't going to spend the rest of my life married to one. So I left. (Side note: we were never married. But it was going that direction had I stayed).\n\nFast forward to present day. He messaged me on facebook and asked me if I had a certain item still. I said yes, and he poliety asked me if I could bring it by his house. I said sure, as he was never violent towards me. I sent my friends the address and told them if they didn't hear from me in an hour that this is where I was, and who i was with.\n\nI showed up and it was actually a really great encounter. But it just made me happy I left. The only real reason he invited me over was to show me, in some way or another, what I was missing. Showing off his brand new Cadillac, he brand new custom built house filled very expensive art pieces.\n\nI'm happy he's 'happy'. But seeing him just re-affirmed i made the right choice by leaving and I'm really not missing anything.\n\nI've been in a relationship now for 3 years that makes me happier than I ever thought possible.\n\nSeeing my Ex didn't make me regret anything. And that's the happiest feeling of all sometimes.",
        "created_utc": 1498601522,
        "upvote_ratio": ""
    },
    {
        "title": "Kris O' Connell Pod Cast to help you feel better",
        "author": "PiscesMermaid87",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6jsxf8/kris_o_connell_pod_cast_to_help_you_feel_better/",
        "text": "http://habithacked.com/episode20/\n\n\"A challenging upbringing in life is always a difficult thing to confront, especially while trying to live a life that requires overcoming the habits and patterns that accompanied that upbringing. Kris is an inspiring role model in how she has made the decision that she would not live the life of her childhood role models. She has made the decision to break through the noise and live a life of fulfillment and achievement. We asked her to share her story and what she has been able to do to keep pushing forward. It is a must hear.\"",
        "created_utc": 1498572724,
        "upvote_ratio": ""
    },
    {
        "title": "I'm a human, and hence...",
        "author": "throwawayforrealuh",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6jr60c/im_a_human_and_hence/",
        "text": "I want to let myself know that I am worth it. I want to tell myself, it's okay to live with wounds and scars, it's not a shame to live with wounds in your heart. It's not a matter of shame. Having wounds don't make one person anyway inferior or weak. \n\nI would get hurt, and I will cry. It's inevitable for me to feel sad or hurt if someone twist my will and force *their* own will on me. When mother distorted my will and turn it into her own version of what *she* wants, it makes me feel hurt. I felt as if I were not allowed to have a will, I thought I must be too stupid to have a will. \n\nI couldn't stop the codependency between me and my mother --- at the back of my mind, I thought I couldn't survive without my mother. This very thought was planted in my earlier life, when I was just so young. I wasn't able to understand what survival means, even until this day, I couldn't fully feel the 'concept' of survival.  Survival means providing for oneself, means being able to pay bills, rent, pay what you need, including food... If so, what do I not understand about survival? \n\nOne time, I thought only weak people need to be nurtured and protected. I misunderstood 'protection'. Protection is a form of love, not the imprisonment I have gone through... \n",
        "created_utc": 1498548794,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for advice-Aging into your abuser, how do you cope?",
        "author": "PiscesMermaid87",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6jlb1u/looking_for_adviceaging_into_your_abuser_how_do/",
        "text": "The older I get, the more I am looking like my mother who is the main source of my abuse. I feel like my face changes. Some days I look in the mirror and immediately see her. Most days I don't see her at all in my face. This may be due to my general mental health on any given day, how I wear my hair, if my face is puffy from eating bad the night before, or how i do my make-up.\n\nEither way, I am genetically related to my abuser. And I know, as I age, I may begin to look more and more like her. Which is something I'm not ready to deal with and may never be ready to deal with. This is a topic I plan to explore more in counseling.\n\nI have known people of abusive parents who go as far to get plastic surgery to not look like their egg or sperm donors. Sometimes its minimal such as a nose job, or just tasteful general botox to keep  certain features at bay. I'm not oppose to these ideas as a whole. But i'm also not quite there yet myself.\n\nHas anyone faced this? How do you deal with it? How did you deal with it? Thanks in advance for comments.",
        "created_utc": 1498486307,
        "upvote_ratio": ""
    },
    {
        "title": "He is being abused",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6jl7of/he_is_being_abused/",
        "text": "[deleted]",
        "created_utc": 1498485299,
        "upvote_ratio": ""
    },
    {
        "title": "At women-only salon in Brooklyn, Muslim-Americans prepare for Eid",
        "author": "Wesbruer",
        "url": "http://www.reuters.com/article/us-religion-eid-usa-salon-idUSKBN19E2NP",
        "text": "",
        "created_utc": 1498475821,
        "upvote_ratio": ""
    },
    {
        "title": "Have had a really rough few months but I made the A!!",
        "author": "Paisleybabe",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6jj27j/have_had_a_really_rough_few_months_but_i_made_the/",
        "text": "holy shit I got an A in my math class. I was dreading checking it but just went for it tonight and I GOT THE FUCKING GRADE!!\n\n I went through so much this semester: experienced a death in my family, broke up with my ex, moved out of my ex's house, cut out my friends, quit using drugs, and I started a new job. Through the midst of all of these things I was on the bus for 6 hours a day commuting for half the semester until I finally got a car. For about 12 hours a day I'd be an hour away from my home and against literally all of the odds I made it and I cant believe it and I just needed to share with you guys because I dont have very many people to share with. Idk im just very excited and proud of myself and enjoying the hell out of it before I go back to my default of depression and horrible anxiety lol ",
        "created_utc": 1498452581,
        "upvote_ratio": ""
    },
    {
        "title": "Struggling to rebuild my life after narc abuse?",
        "author": "Fake_Name90",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6ji8ii/struggling_to_rebuild_my_life_after_narc_abuse/",
        "text": "I came out of a 6 year emotionally/ verbally leading to physical abusive relationship 4 months ago. It was the toughest thing I have ever done, and the withdrawal, depression, despair, hate for myself was so intense, it was horrendous. I ended up doing my best to pick up the pieces which involved me putting myself through counselling for months. I didn't feel the counselor wanted to get too in depth with things, and was very pushy with me at times, saying I either do something or nothing a few times was harsh but true I guess, there are just so many more factors to that. The problem is my negative thoughts overtake everything all the time, I pushed myself to go into a social setting last week, where there was a talk on narcissism, which I am interested in since I was with one for 6 years. The whole time my head is beating myself up saying you look like a weirdo, you have no friends, you think your going to make friends here, your sweating, your a failure, your an embarassment, this constant negative voice won't shutup. I always had a negative voice, but after the abusive relationship it went times 50. It definitely helped having that support and person to talk openly to, when I was ashamed to speak to my family about things that happened. \n\nI took that time off for myself, and now am coming out of that hole I was in, thinking crap, look at my life! I have no friends, no job, failed a year in college as a result of the end of that abusive relationship and have financial debt. I live at home with younger siblings, so lack of independence. What is keeping me afloat is knowing that I am free from an abuser, but I am not in anyway fulfilled in my life, and struggle socially, which makes me avoid situations. I have this image in my head of me being a confident, happy person, but am not sure how to get there. I want to get to a much better place in my life, and look back at this one as something I had to overcome, but I feel stuck in where to begin, I don't want to become too overwhelmed, but know I need to make happier life for myself? I am on a low dose of antidepressant for 7 years and am considering going to the doctor to change it, because it does not seem to be doing what it should be. ",
        "created_utc": 1498441563,
        "upvote_ratio": ""
    },
    {
        "title": "Introduction- The narcissistic crazy makers",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6jhz16/introduction_the_narcissistic_crazy_makers/",
        "text": "[deleted]",
        "created_utc": 1498438655,
        "upvote_ratio": ""
    },
    {
        "title": "My mom is trying to guilt me for calling her an abusive parent by claiming she was raped as a child by her parents so I don't know abuse.",
        "author": "kielera714",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6jgz0e/my_mom_is_trying_to_guilt_me_for_calling_her_an/",
        "text": "My problem is is that after faking heart attacks,faking being diagnosed with cancer, I just don't believe her.SO now I feel bad because its a 50/50 is she telling the truth at anytime.Its also rather convenient her parents have been dead for over a decade.Edit: she admitted she lied to me (sigh)",
        "created_utc": 1498427183,
        "upvote_ratio": ""
    },
    {
        "title": "Missing Pieces",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6jdggp/missing_pieces/",
        "text": "[deleted]",
        "created_utc": 1498381926,
        "upvote_ratio": ""
    },
    {
        "title": "Relationship bill of rights",
        "author": "schizopathy",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6j9aqu/relationship_bill_of_rights/",
        "text": "About 2 years ago, I had a very bad falling out with a \"friend\" who showed many of the signs of NPD. During the same 6-month period, I fell out with 2 other friends and 2 family members who also showed some of the same behaviour patterns.\n\nThe emotional fallout lasted much longer than I expected, and so then I've spent a lot of time doing self-analysis and introspection. A year later the grief and anger seemed to keep flaring up, and it felt like the fallout would never end. Two years later I can now say I'm mostly calm and stable again. There is a light at the end of the tunnel!\n\nOne thing that's helped a ton is writing tons of notes-to-self and analyses of my experience in Evernote. Evaluating my own thoughts and beliefs has given me a ton of perspective, and has helped my emotional conflicts disperse and dissolve.\n\nToday I was inspired to open Evernote and write the following. It's based on many niggling encounters with my former NFriend -- things that seemed \"trivial\", but nevertheless gave me much suffering and frustration. (I now realise that this is because these behaviours all showed a fundamental lack of respect and concern). I hope it's helpful for other people here.\n\n* I have a right to basic respect.\n* I have a right to have my skills, knowledge and experience taken into account by the people I collaborate with.\n* I have a right to expect basic consistency from the people I deal with.\n* I have a right to refuse demands. In particular, I have the right to refuse arbitrary, ad-hoc demands, without facing endless pushiness or to have uninvolved third parties weigh in regarding what I should do.\n* I have the right to have my effort and contributions acknowledged.\n* I have the right to know in advance if a prior engagement will be cancelled.\n* I have the right to basic clarity and honesty. In particular, I have the right to know if the other person agrees or disagrees with any of my thoughts or plans — rather than the pretence of agreement, followed by covert attempts to undermine me.\n* I have the right to have my concerns about the relationship acknowledged — not necessarily agreed with, but at least acknowledged as problems — and not simply dismissed, minimised, or portrayed as trivial in relation to other people’s problems. Additionally, I have the right not to have my concerns face the pretence of acknowledgement, while no action is taken regarding them.\n* I have the right to be told about issues people I deal with have with me. In particular, I have the right to not encounter false pleasantness and friendliness, while being denigrated behind my back.\n* I have the right to not be lectured on what my values or goals are or should be. In particular, if someone wants to give me life advice, they should first acknowledge my current context and plans, and not simply assume that my plans are mistaken and ill-informed.\n* I have the right to expect basic courtesy and consideration, such as when planning engagements. In particular, I have the right not to be treated discourteously while third parties receive the red-carpet treatment — especially if this is rubbed in my face.\n* I have the right not to be patronised. In particular, if someone wants to give advice regarding a purported weakness of mine, they should be objective over whether it is actually a weakness I possess. Furthermore, they should not imply I am defensive when I reply that the advice is not true or irrelevant.\n* I have the right to have my values respected. In particular, if someone goes out of their way to encourage me to pursue a particular value, I have the right to expect that they not later denigrate or insult my attempts to pursue that value.\n* I have the right to know where I stand with regards to the relationship. In particular, I have the right not to be praised to the skies one day, while being ignored, belittled and patronised the next.\n* The foundation of all these rights is this: I have the right to walk away from anyone who mistreats me. In particular, I have the right to walk away from anyone who consistently mistreats me and refuses to change their behaviour. Additionally, after I walk away from a relationship — I have the right to regard anyone who rewrites reality to create the pretence that they walked away from me, as extremely deluded and messed-up in the head!",
        "created_utc": 1498324551,
        "upvote_ratio": ""
    },
    {
        "title": "I had an epiphany at work that has resulted in my finally changing my life for the better. I can and should trust my emotions/reactions!",
        "author": "biologynerd3",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6j8pp7/i_had_an_epiphany_at_work_that_has_resulted_in_my/",
        "text": "I'm a graduate student and have been in this lab for six months. My boss and I have had a difficult relationship from the start. It's been very up and down, some weeks are okay, and some are very stressful where I am constantly anxious about making any kind of mistake or upsetting him. Huh, sounds a lot like my home life with my NDad, very interesting! But that's not my point.\n\nI've been struggling with considering leaving this lab and changing to another one. I haven't been because I really do enjoy the research I do in this lab and because I've kept convincing myself that my reactions to difficult moments with my boss are just overreactions. It's not that bad. It's not like it's happening constantly. I'm just way too sensitive. \n\nAgain, SOUNDS LIKE MY RELATIONSHIP WITH MY NDAD.\n\nYesterday, I had a complete and utter breakdown in the lab because my boss was blaming me for an incident that honestly had no blame (a lid was stuck on something). I just felt so beaten down and scared and tired of being anxious all the time. I called my (non-N, wonderful) mother and talked to her about the situation.\n\nAnd during, while I was asking her \"Am I overreacting?\" and having SO much anxiety about whether or not I was blowing my situation out of proportion, I realized something. \n\nMY EMOTIONS ARE VALID. PERIOD.\n\nI don't care if it's \"right\" or not. My boss and my work environment make me feel anxious and unsafe. His reactions to things make me scared and make it very difficult for me to work well and to enjoy my work. And that is TRUE because it IS. It doesn't *matter* how somebody else would react to the situation or if somebody else would handle it better, because this IS how I'm reacting, this IS how I'm handling it, and that is REAL and VALID!\n\nThat afternoon, I went to the graduate coordinator to talk about changing labs. And my new boss (coincidentally also the grad coordinator) is so relaxed, so supportive, and so willing to let me learn through trial and error and to accept those mistakes as what you have to do to learn. \n\nI'm so excited about my new lab and I'm actually excited about doing research again, which I haven't been for the last few months. But most of all, I'm excited that I've finally realized that it's okay for me to trust myself and my emotions! It's a good day, y'all!",
        "created_utc": 1498318033,
        "upvote_ratio": ""
    },
    {
        "title": "[Update][Closure] I was thinking about contacting one of my cousins but I don't think I will",
        "author": "ShojiAn",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6j82hd/updateclosure_i_was_thinking_about_contacting_one/",
        "text": "[original](https://www.reddit.com/r/LifeAfterNarcissism/comments/49ul7z/i_was_thinking_about_trying_to_contact_one_of_my/) and [update](https://www.reddit.com/r/LifeAfterNarcissism/comments/5hvl95/update_i_was_thinking_about_contacting_one_of_my/)\n\nSo I decided that I need a closure of some kind because after I gave up doing art stuff after depression in 8th grade in my mother's eyes I stopped existing. And my cousin had plans to go to art school. After 8th grade she focused on my cousin and his talent. For me there were only forced visits to theaters because it was cheaper and easier to go with me with one of her friends.\n\nWhenever I tried to do art I compared myself to him and always felt inadequate. So I decided to see my cousin's exhibit. I missed the opening couple of weeks ago and went today. I was able to find the gallery on the edge of a town 2.5 hours away closed (It is supposed to be open only on Saturday and Sunday).\n\nSo I haven't seen any of my cousins paintings and I am fucking happy because he makes art mostly for his friends and hangs them in an obscure gallery. There is no need for comparing myself to him. He isn't as great artist as my mother let me believe.\n\n(Also I have couple of friends who like my stuff when I choose to share it. Time to make more.)",
        "created_utc": 1498309685,
        "upvote_ratio": ""
    },
    {
        "title": "What i[22f] realised about my abusive ex[27m]",
        "author": "iar_vineozi",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6j7yps/what_i22f_realised_about_my_abusive_ex27m/",
        "text": "Its my first time posting, even through i've been lurking for some time. I want to start with the fact that english is not my first language, so please excuse my mistakes.\n\nI stayed in a relationship with what i can now call a narcissist for 3 years. He fits into al the descripstions of a narcissist: manipulative, love-bombing and after that discarding me, gaslighting, hovering. \n\nIt ended badly, but it was even worse when we were together. I felt like i always needed to prove myself to him, to prove him that i am worthy of his affection, all my time and energy were put into proving this, i needed that validation but i dont understand how have i become so needy, i was never that needy. We had  a rocky relationship, we broke up more than 20+ times in 3 years, all the time we was dumping me, and everytime he came back. I used to think that maybe he has some problems and i should understand our on-and-off relationship but this wasn't the case. \n\nEverytime he would come back and act like im an the world to him, like he missed me and that we should get back together, but now i've realised he never, NEVER, said he is sorry for dumping me out of the blue.\n\nNow we are broken up, and for good. But i soon realised some things about me, some shoking things that i have forgot. \n\nHe made me a shell of the girl i once was. I was always doubting myself, making myself look small so i dont bother people around me. he was always saying that his cool friends ( his friends are cool but mine were 'douchebags that dont give a shit about me') dont want to see me and dont like me, that i should never try to talk to them again. And after that, if we were to meet with them and i would act anxious because of what he told me he would start to blame me that 'im incapable of socialising and being funny and easy-going'.\n\nHe got in my head so bad. I thought that i should lose weight, even though im pretty thin as it is, he would shame me if i wear make-up but make fun of me that i look tired if i dont. When i received a good grade in a very hard class at uni, the first in my project group he said 'your generation its pretty dump then'.I started questioning my sanity, my reasoning. \n\nAt one point when we were in vacation he insisted in keeping my money (not our money, my money) because i \"will lose it like you always do\" and then he proceeded to go and buy shrooms with the last money we had to come back without asking or telling me. I got mad but he got even madder and kicked a table and shouted that i shouldnt 'question him reasoning' and that its so me to get mad at him. He left me at the beach side alone and after that HE DUMPED me, because i am 'unreasonable, selfish, crazy girlfriend and doesnt understand his ways'. I was a bitch because i didnt want my money stolen to buy drugs.\n\nAt another time we went to a party together and when we got back he told me that he doesnt want to go together to parties because i am too 'clingy and he wants to have fun but cant if he has to take care for me permanently'. But, after 2 days, when he was mad at something else he proceeded to tell me that i 'didnt care about him, left him at the party and only talked and danced with his friends, and he felt unappreciated', but it was the same fucking party, but he changed 180 degrees, he just changed all the parametres of the story so he will be the one hurt. When i tried to reason with him and tell him that 2 days ago he said the exact opposite he would just ignore me. It was like talking to a wall, my words were not taking into account if they are not favorable for him. he would just straight ignore my words.\n\nOur last break up was the worst, it really hurt me like nothing did. We were in vacantion again in a big group and he left my hotel room and just disappeared in the night. We met again in the morning at the beach where he was with a random girl from the group we didnt know before . I have to say that they were pretty fucked up (lots of alchool and drugs were involved in this mess) and were acting strange but we had to come back home and we got in the same car in the backseats. Then they procedeed to laugh and  to tell me that he left my room because he didnt feel that i care about him, so he went to sleep with her, that they got drunk and saw the sunrise and talked about things and that i wont get it, i never do. He said things so hurtful even that girl told him that he's too mean to me. In that moment i felt that i went mad, not crying and yelling, but i actually started drinking nerviously and laughting and joking. And they were touching each other and at some point they fucking kissed. Something in my brain just clicked, it felt surreal, i got drunk as fuck just because everything looked like out of a strange russian comedy. And i was in the car with them, on the highway, i couldnt get out, i couldnt leave. I just stayed there, looked at them and laughed.\n\nAfter i got home i packed my bags, i went to my best friend and stayed for some time there. I was a fucking mess. I didnt go to university, i missed a lot of classes, i missed a lot of things. he contacted me again and i was dumb enough to try and talk to him. \n\nHe was the one mad at me for 'making him feel like he should drink with her'. he told me that he didnt touch her and when i told him about kissing he straight up called me crazy, that i am super jealous and i just made that up, that i was drinking and that i hallucinated. \n\nThats my break up story. What i wanted to say after all this time and bad memories is that i've realised that i am now in the best state i can be. two months have passed and i've realised what a nice person i am. I met so many people and i realised not just that everybody is nice and has a nice story to tell, but that people actually like me. I was just too blinded to see that i am worthy of everything if i only would cut all the toxicity from my life.\n\nI think about all the things that he would accuse me of and i realised that he was projecting all his insecurities on me. He told me that i cannot socialise with his friends but he would leave before he would have time to see a friend of mine because he 'doesnt want to talk to people he doesnt know'. He called me jealous but at some point he visited me at work and thought that a coworker is looking at me so he FUCKING DUMPED me (called me a slut, accused me of fucking that guy in the changing rooms).\n\nI've come to the conclussion that i need some narcissism of my own. I was ashamed to talk to my friends because of the guilt of accepting this abuse. I felt alone, even though i was in a 3 year relationship, it was the loneliest time of my life, always wanted to be accepted, wanted to be loved, always trying to prove that i am 'good, hot, smart, cool enough' for him.\n\nAnd you know what? I am too good for him, and he knew that, that was his way of keeping me around, he exploited my insecurities so he`ll get his supply. When i was happy, when something good happened, when i was doing somethihng cool with my friends, he would just come and drop the 'dumping' bomb and just mess me up again. He even sabotaged a job i had at some point. I had a gig as a hostess at a super nice event and i would make some extra money but he didnt let me do it because 'they will be a lot of douchbags that will hit on me and he isnt confortable with me dressed nice and talking to strangers at that event, even through i was just greeting people at the entrance).\n\nLast year he dumped me at some point, and after 3 weeks of crying i decided to go with my friends to a music festival. I met new people, i was having fun, i started healing. But he found out i am going and even if we were broken up he showed up unannounced to the festival to 'have fun with me'. He just got in, searched for me, and when he saw me just came and kissed me, telling me he missed me. I gave in, but deep inside i was so mad at that. he just came to keep me controlled, he didnt respect that he dumped me, that i was hurt, and that im trying to heal, he just buldged in and i was his property wihtout saying anything. He made me leave my group of friends and go with him.\n\nI have realised how better i am without him. I have the best friends in the world, friends that listen to me crying and hurting all this time, friends that took me home with then just so i won't be alone. Friends that had to endure seeing me always hurt again and again and again and never getting out.\n\nI got past the suffering stage because i did that so many times before and i now im so happy with my life. I just got a very cool designer job, i've realised that i have forgotten about my passions, about the things i loved, about the people beside me. I realised that I am worthy of everything he wouldnt give me. I am afraid of sounding like a narcissist myself but  i cannot comprehend how have i forgotten in this time about ME. \n\nHe started hovering right now. He called me at some point to accuse me of 'cursing him' . At first i thought he was messing with me, but he wasn't. He kept yelling in the phone that i will go to hell, that i am a witch ( we are talking about a 27 year old man with a masters degree and an urban upbringing, thats ridiculous) and after that he said that he is now in the hospital and just hanged up the phone, without answering anything. In that moment i started panicking, i was worried, started calling him like crazy because you cant just say that you are in the hospital and then not say what the fuck happened to you. I called a friend of his and sent him to his house and i found out a car hit him while nn bicycle. I would have been the first person to take care of him, even after all this time, but he kept messaging me that 'its my fault, that he hates me, that i will go to hell for messing with witchcraft, that he will block me on every social media so i cant get to him'. I calmed down after that friend brought him to the hospital and after i found out he is fine. I also was told that a dog bit him 3 days earlier, so he thought that he is really cursed. \n\nAnd then i downed on me. Even after breaking up and no contact, he still blamed me for everything in his life. He blamed me for a dog biting him and for a fucking bicycle accident. And i also realised that he, deep down, knows he is a bad person. A normal person after something bad happened doesnt just call an ex to accuse him of something if he doesnt feel guilty.\n\nNow he unblocked my number to give him a hoodie back. I am afraid of talking to him again, and i can feel that he is waiting for me to call him. We would get back together after this time, usually, and he doesnt know that i dont want to hear from him ever again.\n\nThe was the most toxic, abusive person in my life and he knew that, he even told me that at some point that he doesnt like the way he is with me, that all his friends think he is a good person and its probably my fault for him abusing me emotionally because i 'dont get him'. There is nothing to get about him, i was the only person close enough to see what a bad person he truly is, all his relationships are shallow, all he wants is to have more money, to have nicer and cooler clothes, to go to cooler parties, do get better drugs. He just want to be the cool pretentious always happy hipster so much and i kept reminding him that he is a bad person. He comes from a very religious background and even keeps a book about 'being a better person for Jesus' around his bed and brag about his morality but he never, in 3 fucking years, even opened it. Its there just for show.\n\n\nSorry for the long post and for all the nonsense, i just felt like getting it out.",
        "created_utc": 1498308146,
        "upvote_ratio": ""
    },
    {
        "title": "Hotel ZaZa reveals luxurious suite plans, Dec. 1 opening date",
        "author": "Stevealm",
        "url": "http://www.chron.com/life/features/article/Hotel-ZaZa-reveals-luxurious-suite-plans-Dec-1-11242522.php",
        "text": "",
        "created_utc": 1498288846,
        "upvote_ratio": ""
    },
    {
        "title": "Any advice for how to respond to a narc's tantrum?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6j5jv7/any_advice_for_how_to_respond_to_a_narcs_tantrum/",
        "text": "[deleted]",
        "created_utc": 1498268732,
        "upvote_ratio": ""
    },
    {
        "title": "Eradicate Narcissism By Creating Healthy Boundaries",
        "author": "pinnacleofman1",
        "url": "https://www.youtube.com/watch?v=3KolkodO3nc",
        "text": "",
        "created_utc": 1498256528,
        "upvote_ratio": ""
    },
    {
        "title": "Online comforts other than LAN?",
        "author": "BabbitandBromide",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6j3so2/online_comforts_other_than_lan/",
        "text": "Where else do you go online for NC support?  LAN is certainly my numero uno but I have other little corners... a support forum for adult children of alcoholics who have gone NC on a site called sober recovery, and another NC-specific forum called out of the storm.  A few Facebook pages as well, so some relevant memes show up in my feed sometimes.  What about you guys?",
        "created_utc": 1498249304,
        "upvote_ratio": ""
    },
    {
        "title": "Maybe it's just Society, and not me, that's totally broken.",
        "author": "PiscesMermaid87",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6j1tdx/maybe_its_just_society_and_not_me_thats_totally/",
        "text": "Western Culture, and make no mistake I've lived here my entire life. But, Western culture, is so very strange to me because accomplishments are celebrated, really and truly, only when they're in a physical form, such as degrees, for example. We don't consider the act of enrolling and staying enrolled in school an accomplishment, we only consider it an accomplishment if you finish. We consider the new car an accomplishment, and we go as far to consider marriages whether they fall apart or not accomplishments. We even consider having KIDS an accomplishment.\n\nThis leaves people like me feeling out of place most of their life, and largely inadequate. Western Cultures measures of success is odd at best. Because my greatest accomplishments to date are in fact my preservence in the face of adversity, never quitting, and my emotional and physical strength. These things are by and large not seen as accomplishments in american culture. America celebrates the leased Bentley over the paid off beater car.\n\nWestern Culture doesn't see seeking therapy as an accomplishment. If we did, people wouldn't feel so much shame around mental illness and drug abuse. There's a slow moving shift regarding mental health and seeking help. But usually, seeking help is only celebrated when the problem has spiraled into what seems like an insurmountable issue (hard core drug abuse, attempted suicide, etc). Rarely, if ever, is seeking counseling as preventative maintenance seen as an accomplishment. I've only ever seen counseling celebrated after a massive mental break in someone resulting in an intervention of sorts.\n\nAmerica celebrates consumerism. It celebrates the physical manifestation of doing something rather than internal struggles that got you there. And when your greater accomplishments are quite literally a result of your perseverance, it makes you feel lost and isolated. When your greatest accomplishment is \"I got away from my abuser and did it all my own\" and then you log into social media and see your friends buying houses and being celebrated for it - well, you can imagine how lonely one would probably feel always being left in the shade of other peoples material manifestations. And that's not to say the people buying the house didn't work hard, but their hard work resulted in a physical manifestation of something that western culture idolizes. You get no gold stickers in America for winning an internal battle and over coming your circumstances unless that battle produces something for people to ooo and ahhh over.\n\nMaybe one day this will change. But for now, this is where we are as a society, and it's really really lonely.",
        "created_utc": 1498230980,
        "upvote_ratio": ""
    },
    {
        "title": "I seem to have lost/outgrown a major source of comfort, and now I don't know what to think",
        "author": "rbnthrowmefaraway",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6izwo8/i_seem_to_have_lostoutgrown_a_major_source_of/",
        "text": "Since about 2005 (also, not coincidentally when some serious trauma was happening in my life), I have been listening to podcasts pretty rabidly. For 12 years, I obsessively had my earbuds in anywhere I could. I enjoyed searching for new podcasts I might like in many topics, and would rearrange my lists and downloads often as a mindless and comforting activity. I've even leaned towards jobs that allowed me headphones so that I could have this self soothing mechanism at work, which is something that I have at my current job.\n\nBecause I listened so much, I'd often run out of new podcasts that interested me, so I'd find archives of podcasts to listen to. (There is one podcast series of about 60 episodes, about an hour each, that I've probably listened to, in its entirety, over a dozen times.)\n\nBut, for some reason, this week, I'm discovering that listening to podcasts no longer soothes me, or has the same emotional resonance that it used to. I tried looking for new podcasts, and found many, but they just don't do anything for me anymore. \n\nDon't get me wrong, there are still podcasts that I \"like\", but I'm not attaching emotionally like I used to. I enjoy listening to a podcast that has relevant or interesting information for me, but the constant hum of people incessantly talking all my waking hours, honestly, is starting to give me a headache.\n\nI'm finding myself listening to an episode of a show I like, and then just stopping my podcast app. No jumping around trying to find something new. No pulling up an old favorite of a podcast episode that I've listened to 10 times just for fun. I just.... stop. \n\nI feel like there's something wrong, but it's probably the opposite. I've made a lot of huge changes over the past few years, and especially in the last year, and I think it's possible that I've simply outgrown this habit. I'm turning into a regular person who maybe will listen to a good show every now and then to pass the time, but isn't an addict who needs to be constantly pumping the sound of people talking into her veins 24/7. \n\nI don't know what more to say. I'm sort of sad, and not sad at the same time. I think I might enjoy just being someplace rather than tuning it out all the time. And maybe I'll listen to something more goal oriented, like language learning CDs. The whole thing just sort of makes me shrug. But it's undeniable that something deep has changed and will not go back to being the same. \n\n**Edit: I haven't had the chance to respond to everyone yet, but I am LOVING hearing your own stories about things that you once found comforting and soothing, and then, eventually, just outgrew them. Thanks to everyone who responded and will respond, I will be replying when I have the free time to do so.**",
        "created_utc": 1498206130,
        "upvote_ratio": ""
    },
    {
        "title": "Accomplishments",
        "author": "PiscesMermaid87",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6ix0cn/accomplishments/",
        "text": "What's something or several somethings that you are proud of since you dumped your Narcissist? Be it parent, spouse, significant other, or sibling, what's something you've done that's made you proud of you.",
        "created_utc": 1498170181,
        "upvote_ratio": ""
    },
    {
        "title": "shot in the dark - anyone in Seattle?",
        "author": "BabbitandBromide",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6iwk40/shot_in_the_dark_anyone_in_seattle/",
        "text": "In-person support groups have been really valuable in my recovery/upkeep, like Coda, Al Anon, etc.  But there's no organization for the stuff we talk about here *knowing look around the table*\n\nI was wondering if anyone here is NC, in Seattle, and interested in an in-person group of some form.  I'm asking in a few other online spots where very lucky people like us talk to each other.  :)\n\nIt would be a room with some people sitting in a circle who each get to share, if they want.  We could all talk about books and other resources that have helped us, and just be in a room with people who get it.  \n\nI have a few so far!  :)",
        "created_utc": 1498165979,
        "upvote_ratio": ""
    },
    {
        "title": "Nightmares?",
        "author": "BabbitandBromide",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6ircl8/nightmares/",
        "text": "You guys I CAN'T SLEEP.  At best it's just waking up every few hours, or it's having a bad dream and kicking a little so my partner wakes me up - at worst I just wake up screaming like a banshee.  The dreams of course all feature Nmom or a related theme.\n\nIdeas?  I've tried acupuncture and that's helping some I think.  And melatonin.  I'm trying to avoid actual sleeping pills because I'm already on so many meds.  Prazosin makes me super dizzy.\n\nThank you, hugs all around.  ",
        "created_utc": 1498107148,
        "upvote_ratio": ""
    },
    {
        "title": "Saw my dad for Father's Day and it went well.",
        "author": "--cunt",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6iqffd/saw_my_dad_for_fathers_day_and_it_went_well/",
        "text": "To preface, sorry if this is a bit of an underwhelming story. I've shared this with my fiancé &amp; therapist but I'm just really happy about how well things went.\nMy mother was an abusive, neglectful alcoholic so as an adult I don't like to see her or talk to her often, I guess you'd call it \"low contact.\" She just sits at home feeling sorry for herself all day and doesn't do much else, so it's been easy to never see her except on holidays, which doesn't bother me that much. My dad ignored everything mostly, and while I feel some resentment towards him, I can forgive him as an adult. He had an abusive childhood as well, not to excuse his parenting, but I do believe he loves my siblings and me, and tried the best he could. \n\nSo it was Father's Day, and I worked so I called him and told him I'd come to visit the following day. I immediately regretted this, because going to visit him also meant going to visit my mother. She's not awful to me now that I'm an adult and rarely see her, I'd just rather not bring up painful memories. Plus she's just a negative, miserable person to my dad and sister, and in general, even if it's not directed towards me anymore.\n\nSo I talked to my fiancé about how much I was dreading going to my parents' house. Usually he isn't one for emotional conversations, but he gave me great advice. To paraphrase, he told me that I shouldn't have to put my needs second, or worry about making other people uncomfortable just to please them. That I shouldn't let people directly or indirectly pressure me into neglecting my needs. So I texted my dad and told him I'd rather just the two of us go out for dinner.\n\nAnd we had a nice time! I was worried that he would ask me why I didn't want to visit their house. He didn't ask, but my mother did come up. He invited me to go somewhere with the two of them the following day. I told him I wouldn't go if she would be there, because she gives me awful anxiety. He said yeah, I get it, and that was that. I was just shocked, because (likely because of my dad's past) he has always been \"That is your family and those bonds are sacred and you own them your undying respect and loyalty no matter what!\" We used to fight about that a LOT, during my teenage years. I would scream at him that he and my mother were shit parents, and he would give me that line. \n\nHe called the next day to invite me out again, and let me know that if I wanted to join him, my mom wasn't going to be there. (I ended up not going because I wasn't home, and he likes to call last minute.) But it just feels really good to actually tell people in my family that I'd rather not be around her and have them respect that. I've been avoiding my dad for 2 years (since I moved out of their house) because I didn't want to see her, or have an awkward conversation with him, but it wasn't as bad as I thought at all.",
        "created_utc": 1498096150,
        "upvote_ratio": ""
    },
    {
        "title": "Therapy Question",
        "author": "modecat",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6io4t5/therapy_question/",
        "text": "Hi guys!\n\nI really, really need to finally get some therapy, now that I have a young one....\n\nMy husband has been in therapy now for almost 3 years (!!!) for narcissistic tendencies. His therapist seems to be excellent as I can really, really feel a change....\n\nMy husband suggested me just using the same therapist--he really does seem extremely effective. But I thought that seeing the same person is a no-no.....\n\nAny thoughts on this?? It would be so awesome to just use this person.....\n\nthanks! &lt;3",
        "created_utc": 1498073049,
        "upvote_ratio": ""
    },
    {
        "title": "I need advice about NC. I'm getting confused as to whether I should do NC or continue VLC.",
        "author": "Kitty_Clark",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6iez5h/i_need_advice_about_nc_im_getting_confused_as_to/",
        "text": "Last weekend I posted this:\n\n (Rant/story) Well the bough finally broke and NC is in order.\nhttps://www.reddit.com/r/raisedbynarcissists/comments/6i1obt/rantstory_well_the_bough_finally_broke_and_nc_is/\n\nOn the RBN sub. \n\nIn a nutshell I feel that it is futile to even attempt to explain myself or give them any explanation as to why I'm not reaching out or trying to see or talk to them.\n\nIn the past, even when I was trying to be a \"good\" daughter and call them every couple of weeks and give them information about my life, it was never enough. I'd still get the \"we don't see you/talk enough because you don't call/come to our house.\" They never make attempts to drive the 1.5 hours to my house, even though they expect it from me. \n\nIf you look at my posting history and comments from RBN there are tales of my alcoholic mother there as well. To summarize: she's turned up at family events wasted off her ass, yelling at people and neither her or my father see a problem with it because it keeps happening. Family members have addressed it long ago when I was a kid and I remember the lashing out that happened. I am very afraid of the smear campaign that would come if I tell them I want nothing to do with them anymore and will only be in the same room as them if it's at family gatherings where others know they are dysfunctional and can have my back. My mother has been emotionally unavailable and had a dysfunctional household as well. My dad was a drunk rager when I was young. He fully stands behind my mom now no matter how aggressive she gets to his family members (including his OWN mother/ my grandma).\n\nI have been doing alot of researching and am not sure what I should do. It would be very easy for me to go NC, however, I keep hearing people say that I should just tell them what my boundaries are and enforce them while still maintaining contact. I want to be the adult and the better person in this situation and the stigma that NC carries is freaking me out. I feel that I'm at the point where I don't trust them at all and I don't like to share any part of my life with them and have been Gray Rocking for about 6 months now.\n\nCan anyone give me some advice or pointers? If you need more info, I can definitely provide it. Thank you!\n\nEdit: for reference, I've been out of their house for 13 years and noticed my mother's Nbehavior and alcoholism has worsened in the last 3 years.",
        "created_utc": 1497974655,
        "upvote_ratio": ""
    },
    {
        "title": "Narcissist boss part 2: don't know what to do",
        "author": "HollyLongstockings",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6idpwz/narcissist_boss_part_2_dont_know_what_to_do/",
        "text": "My therapist has been out of town, and I really need to deal with this situation as it's causing major anxiety.\n\nI posted a couple of weeks ago about my boss's narcissistic tendencies causing my to feel trapped and hopeless. Well it's only getting worse. Now she's not responding to my emails, and I don't know what to do. Maybe she's just trying to make the environment so uncomfortable that I just quit. \n\nThe only way I get information is through other people at work who she does share things with. This is basically how it works with her: Either act like her friend and hang out with her after work and get rewarded with being in the loop; or be completely ignored, get talked about behind your back, and not receive necessary information to get work done.\n\nIt's driving me crazy.\n\nOther people at work seem to be able to navigate around this just fine. But I can see the red flags of her personality clear as day, and have a harder time overlooking them than other people do. It's an ACoN thing. The way she acts sets me on edge. And I can't bring myself to act fake and pretend to be her friend just to smooth things over. I've worked too hard in therapy to be an honest version of myself, and to avoid being a people-pleaser or doormat. She's always digging for personal information, and I'm not comfortable telling her these things. Trading details of my personal life for normalcy is not okay. So instead, I get left out in the cold.\n\nI was ill last week (pretty sure work anxiety isn't helping with physical health problems) and she told other employees details I told her about my health. That's just downright illegal. The problem is, I don't have the strength right now to deal with this. She's either intimidating and confrontational or goes completely emotionless and brings on the silent treatment, and I wouldn't even know how to bring any of this up with her. \n\nI have a therapy appointment in two days to talk about this, but in the meantime...any advice? At this point I'm thinking that quitting is the only way to go, but I want to try and find another solution because runnng away from situations doesn't seem healthy...and I've been doing that most of my life.\n\nBackground: My boss got her job through family connections, and going above her head wouldn't do any good because everyone worships the ground she walks on because of who her parents are.",
        "created_utc": 1497961863,
        "upvote_ratio": ""
    },
    {
        "title": "Benefits of Volunteering",
        "author": "Quorothyer",
        "url": "https://www.youtube.com/watch?v=BIzXRUm_ovc",
        "text": "",
        "created_utc": 1497931525,
        "upvote_ratio": ""
    },
    {
        "title": "Life is not fair – get used to it !",
        "author": "DaleCarnegievn",
        "url": "http://www.dacnhantam.tk/",
        "text": "",
        "created_utc": 1497897686,
        "upvote_ratio": ""
    },
    {
        "title": "One of those days..",
        "author": "BearyConfused",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6i7tyz/one_of_those_days/",
        "text": "\n\nI'm scared. Scared of bumping into you, scared of seeing you and crying. Scared of your life crossing my path and sending me into a spiral of anger and tears. But do you know what I'm most scared about? \n\n\nI'm scared that you were right. \n\n\nThat I *was* a terrible girlfriend. That I really did screw you up. That I really was embarrassing and clingy and weird and that I destroyed your mental health. That I stripped away the you that you loved, and that you were scared you'd never get back. \n\n\nI'm scared that *I* was the abuser. Not you. \n\n\nNobody is perfect - and I have never claimed to be. I have issues, I know. And if I did do all of those things, then I will learn from them and never do them again. But it's hard to see what the truth is. \n\n\nMy worst days are when I feel like the unlovable woman you insinuated I was. And when your words ring in my ears that I should never be in a relationship ever again, because I would destroy them like I destroyed you. \n\n\nI don't want to destroy anyone. I NEVER want to hurt anyone, and I certainly never wanted to hurt you, despite how many times you dumped me and called me names. \n\n\nToday is just one of those days. I will carry on doing all of the things I wasn't allowed to do before. I will carry on living my life and trying to forget you. And I will carry on trying to stop your words making me second guess everything I do. Because I have to believe you were at least partly responsible for this mess. That it wasn't all my fault. And I'm not such a bad person after all. \n\n\n",
        "created_utc": 1497892556,
        "upvote_ratio": ""
    },
    {
        "title": "I don't talk to my dad anymore but he sends texts to me about how he's going to get Alzheimer's to guilt trip me.",
        "author": "bdjournosaur",
        "url": "https://i.redd.it/v8sx5zyqwl4z.png",
        "text": "",
        "created_utc": 1497879997,
        "upvote_ratio": ""
    },
    {
        "title": "Why did I have dreams about my former Toxic \"friend\"?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6i69wa/why_did_i_have_dreams_about_my_former_toxic_friend/",
        "text": "Almost 2 years ago I [M] went NC with my [\"best friend\"](https://m.imgur.com/a/Zd6Tt) [M]. We were flatmates for 3 years and friends 1 year before that.\n\nNothing positive happened in the last 2 years of our friendship. He was a drug/alcohol abuser most of the time and I was sick of that. Because of that we only had contact when he was sober. He couldnt handle business himself so our relationship became me helping him with his troubles (which were a result of drugs/alcohol or other bad decisions). Ofcourse I didn't like that and started setting boundaries. Thats when shit hit the fan...\n\nHe tried to isolate me from my other friends and gf, talking behind my back, dropped all responsibilities on me, put people up against me, lied his ass off to me, put all the blame on me, waking me up middle of the night (usually drunk) just to fuck with me, laughing and ofcourse saying its just a joke... He also attacked me twice when drunk, luckily I am physically way stronger so I could easily pin him down. I wish I was mentally as strong as I am physically, because when he couldnt do it physically, the mental abuse became only more and me trying to be an adult I didnt want to resolve it physically. When he started using cocaine and amphetamine's I moved out as quick as possible and went NC with him, I knew nothing good could come out of that. That was about 2 years ago.\n\nAnyway.... (end of rant haha) Lately I've been having dreams of our good times together. Mostly about chilling together and playing videogames. Truly feeling like friends. And I dont know what it means and what to do with those dreams. I moved on, living together with my gf now, graduated, building a future together, made new friends, new hobby, but still these dreams... What do they mean?",
        "created_utc": 1497877597,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone ever have a narcissistic therapist?",
        "author": "kielera714",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6i4xjw/anyone_ever_have_a_narcissistic_therapist/",
        "text": "I'm convinced my last therapist was a narcissist.Besides her robotic mannerisms and constantly zoning out she one time yelled at me after I told her I was being psychologically  abused by my boyfriend(ex now) and claimed that I was being selfish for thinking of leaving him.After that I quit psychotherapy for a while until recently.Edit: I'd add she was overly friendly the first few sessions until I started talking about my ex being a potential narcissist then randomly she was annoyed and then angry",
        "created_utc": 1497857477,
        "upvote_ratio": ""
    },
    {
        "title": "Not Sure How to Heal",
        "author": "Embracing_life",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6i3yxl/not_sure_how_to_heal/",
        "text": "I tried to leave him multiple times and he drew me back. Each time it was harder to get over him. Now he's discarded me, and I have no idea how to heal. I am trying to everything I can think of, and nothing seems to help more than just a bit. Even therapy. I feel broken, and I just want to be happy. ",
        "created_utc": 1497843044,
        "upvote_ratio": ""
    },
    {
        "title": "Shitty Father's Day",
        "author": "sesameplexer",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6i3j2s/shitty_fathers_day/",
        "text": "Happy Father's Day to the man who, when I was in middle school, tried to revoke my right to having opinions and desires because I didn't get good enough grades. Fuck you.",
        "created_utc": 1497837383,
        "upvote_ratio": ""
    },
    {
        "title": "I am new here.come from China. want to make friends with you.and learn about foreign knowledge",
        "author": "Fiona1126",
        "url": "https://i.redd.it/opysd7h06i4z.jpg",
        "text": "",
        "created_utc": 1497834915,
        "upvote_ratio": ""
    },
    {
        "title": "How do most (\"normal\") people learn about 'boundaries' from their parents?",
        "author": "chickacherrycolaa",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6i3b8j/how_do_most_normal_people_learn_about_boundaries/",
        "text": "So it's been becoming clearer to me that part of my susceptibility to N abuse at work and in romantic relationships is related to having weak/nonexistent boundaries…I do think I may have experienced 'enmeshment' with my parents…it sounds a little exhausting/challenging/daunting, etc. to figure out how to have boundaries now as an adult…has anyone else been successful at doing this? How? Are there any books I should read? How do most people learn this from their parents growing up? How does it all work?",
        "created_utc": 1497834674,
        "upvote_ratio": ""
    },
    {
        "title": "I Asked For The Channel I Wanted.",
        "author": "drdeadringer",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6i39d9/i_asked_for_the_channel_i_wanted/",
        "text": "There was a ball game I wanted to watch. My home team vs a team I like the name of, I'm not sure if I've ever seen them face off before though they must have. I walk in and it's golf. I mislike golf. I came for the ball game.\n\nBar is dead. They know me. \"Can I get ESPN on either one of these TVs? I don't care which.\" \"Yeah, sure.\" She dials it in. \"That what you want?\" \"Yes it is, thank you.\"\n\nNow I get a whole TV to myself and no one cares but me. Because I asked. I know they get paid for that, but still. Practice.",
        "created_utc": 1497834056,
        "upvote_ratio": ""
    },
    {
        "title": "NC w Nmom for 4 years, should I attempt to reconnect w my siblings?",
        "author": "hello_world97",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6i24tv/nc_w_nmom_for_4_years_should_i_attempt_to/",
        "text": "First time poster, long time follower here.\n\nI've been NC with my mom for four years, and in the process, also lost contact with my three older brothers who I believe still have a relationship with her. She was very good at manipulating and positioning us against each other, but they have reached out to me over the years and I do believe they still care about me/ want to have a relationship with me.\n\nI still fear coming into contact with my mother, but am considering reaching out to my siblings. Part of it is missing them and part of it is not wanting to carry around the emotional burden of losing touch with my family.\n\nDoes anyone have any advice on how I should handle this or things I should consider that I haven't though of?\n\nThank you.",
        "created_utc": 1497820940,
        "upvote_ratio": ""
    },
    {
        "title": "I don't want to stay with you because when I stay it makes mommy cry, and when mommy cries, it makes me cry and that is why I don't want to stay with you",
        "author": "Potochoco",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6i1q9q/i_dont_want_to_stay_with_you_because_when_i_stay/",
        "text": "Former Edad here, left Nexwife about two years ago. Two daughters of primary school age. Shared custody, almost 50/50. Older child scapegoat, little one golden child. I need help with the little one. \n\n\n\nShe is completely enmeshed with her NMother, and I am afraid she is turning N right before my eyes. Her mother gives her massive preferential treatment vs her sister: designer clothes for NMother and GC but second hand clothes for SG. At handover SG daughter gets to carry the bags and NMother carries GC daughter in her back. And so on. Every now and then the little one won't be happy to stay overnight with me, say once every couple of months or so. Tonight is one of those nights, I stayed with her in her bed until she calmed herself. While she was crying she said \"I don't want to stay with you because when I stay it makes mommy cry, and when mommy cries, it makes me cry and that is why I don't want to stay with you\". \n\n\n\nYesterday we had a big party to honour her older sister, a \"coming of age\" ceremony in our culture. We got extended family visiting, lots of presents and attention for her sister and not that much for her. She got some little presents as well but it was her sister's day, definitely not hers. I think this has triggered her \"I need NMommy now\" feeling as she also was very hurt that her sister got a cool teddy bear with several outfits and shoes and stuff and she didn't get one. \n\n\n\nShe was truly, deeply hurt, like 'how can be the world so unfair to give my sister a teddy bear and not me, ME\". While this can be a normal reaction for a child her age, I find it very scary, as I can see her mother in her, it's the same attitude and feelings. \n\n\n\nI don't know how to help her grow up into a normal person with good mental health. I need help stopping her into growing up like this. All suggestions welcome, how do I deal with this, please? ",
        "created_utc": 1497816502,
        "upvote_ratio": ""
    },
    {
        "title": "So has anyone learnt to love themselves yet?",
        "author": "m_eye_nd",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6i1jqp/so_has_anyone_learnt_to_love_themselves_yet/",
        "text": "After trauma/abuse and any kind of pain really, I think we always try to seek out how to love ourselves. I want to do that, but in all honesty I have absolutely no idea how to or where to start. I feel like when people speak about this subject they just use blanket statements and buzzwords. \n\nI'm not sure what it feels like to love yourself, I can't say I ever have I don't think. So, I have nothing to compare it to. I'm not even entirely sure what it means. I'm sure it would be a lovely thing to and I want it. ",
        "created_utc": 1497814583,
        "upvote_ratio": ""
    },
    {
        "title": "My girlfriend (18/F) is tired of proving herself to me (20/M) that her intentions are good. How do I stop myself from doubting the intentions of others?",
        "author": "ModernKamikaze",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6hxoft/my_girlfriend_18f_is_tired_of_proving_herself_to/",
        "text": "Recently, I've been in awe in how I behave because I see myself as my mom and my girlfriend as me. I noticed how she behaves is how I react when my mom tells me that I'm wrong and that what I say is not what I meant.\nMy girlfriend is the best, you couldn't find someone who is nicer than her. My problem is I've been insecure that I constantly doubt what she says. She's been honest, but I'm afraid that she may hide things from me, and I honestly don't like the idea that things changed since we first dated.\nIt's been so bad, that she jokingly says to our friends that whenever I jokingly argue with them, she would tell them that to not argue since I will just make it longer. She says she doesn't intend to hurt me, she says its okay since we both know that I'm like that which she has a point but it still hurts to hear.\nEvery conversation we have is carefully crafted from what I've noticed and she admittedly said she's just scared of fighting/arguing again over nothing because we've been doing that for nearly 4 months.\nWhat I want to know is how do I stop becoming like my mother. I know that if I don't she would leave me because she would get tired.\nEverytime we argue she keeps saying like \" are you going to fight (argue) me again\" when in fact we're just talking and it's sad to see the state of which she thinks I'm always wanting to fight. I know fully well it's not her fault and that I behave like that similar to my mom.\nShe says she's tired of proving herself to me that I always make her words mean another.\nPlease help me, I don't want to lose her and it's very hard to break of this habit that I just recently learned was from my mother.",
        "created_utc": 1497757194,
        "upvote_ratio": ""
    },
    {
        "title": "Threats of violence - has your Narc done this?",
        "author": "Mcginty74",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6hws6z/threats_of_violence_has_your_narc_done_this/",
        "text": "I am severely trauma bonded to my ex Narc/sociopath boyfriend, which means that, while the relationship was miserable due to his emotional and psychological abuse, going No Contact is hell. It gives me an idea of what junkies must go through if they run out of heroin. \n\nFor this reason, I've struggled sticking with it, and have relapsed many times. I broke No Contact again a month ago, and have been in Low Contact with him ever since. He has been running hot and cold, and engaging in a lot of push-pull manipulation, of which he is a master. Since breaking NC a month ago, I never know when I contact him if I am going to get Mr. Nice or Mr. Nasty. \n\nToday was a wake-up call. The last couple times we spoke, he was running hot, and talking about how much I mean to him, how much he loves me, etc. He said that I should feel free to call or text him anytime. Today he pulled the rug out from under me, which I should have seen coming. \n\nI called him in the morning, and his tone was cold and indifferent, which should have tipped me off that I was dealing with Mr. Hyde, and that nothing good would come of being on the phone with him. Instead, I let him hook me into an hours long verbal brawl - he is absolutely brilliant at jamming on my emotional buttons and getting me to react, to the point that I am totally controlled by my anger and upset, and am unable to disengage. \n\nTowards the end he started to become scary, telling me in a normal voice (no ranting or rage) that he was glad that we were on the phone and not in the same room, because he would most certainly hurt me (which was of course my fault because I pushed him to this point). He also told me that he was going to drive to my house and kill me. Again, this wasn't said in a state of rage, but was almost worse because he was calm. Several times during the argument he made reference to physical violence, and even said flat out that yes, he was threatening me. He said that it would be worth it, because then he wouldn't have to deal with me anymore, or any of the stress associated with me. \n\nThis isn't the first time that I've seen his evil side, but it's the first time he's made such direct threats. It was a painful wake-up call on who exactly I am dealing with. \n\nNeedless to say, I've had to once again go No Contact. [No, I don't think he would actually hurt me. I think part of his disorder involves fighting off and managing sadistic/dark urges, so that he can fit into society and be accepted as normal. Like all Narcs, he has a Jekyll &amp; Hyde personality, and he has Jekyll so perfected that most everyone in his life thinks he's charming and adorable. I am the only one who has met Hyde, that I know of].\n\nI am wondering if any of you have seen similar behavior from your Narc? Have you gotten the feeling that they are capable of bad things? Have they ever been violent with you, or made threats of violence?",
        "created_utc": 1497744969,
        "upvote_ratio": ""
    },
    {
        "title": "\"He was always jealous if you were happy...\"",
        "author": "25limes",
        "url": "https://www.theguardian.com/society/2017/jun/17/we-didnt-recognise-that-he-was-dangerous-our-father-killed-our-mother-and-sister",
        "text": "",
        "created_utc": 1497705114,
        "upvote_ratio": ""
    },
    {
        "title": "I. An article. II. My emotional note",
        "author": "brokenkidofheart",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6ht5uk/i_an_article_ii_my_emotional_note/",
        "text": "http://gettinbetter.com/dance.html\n\nI'm reading this while awake (At 4:30 AM) .... I'm feeling so 'emotional' right now. Listening to a song that pulls up the string in my heart. It's a model of my mother and dad. I don't want to acknowledge them, but I don't know who else I could call a mother or a father in this world.  The deepest wounds in my heart.  Craved , encoded inside me when I was young.  \n\nI wanted to get a look, a touch, even a smile from my parents. I wanted to follow them wherever they go --- please, just don't leave me. I don't know who can I rely in this great big, wandering , drifting.  \n\nFather, when you left the door , when your back gone smaller and smaller, I wondered... a sigh, a disappointed look from my side, leaning myself by the door. \n\nI wish you could follow me..... to play, to laugh together. Just don't leave me alone.  Sit beside my bed and watch me sleep. Tell me a bedtime story, and see me falling asleep. Please don't be impatient with me. It hurts me when you felt annoyed with my needs. \n\nPlease hold me tight, as if I am a precious girl to you.  Please don't forget me, that I am a precious girl.  \n\nMid-year, after my 20th birth day, my ceremony of mourning ",
        "created_utc": 1497702802,
        "upvote_ratio": ""
    },
    {
        "title": "How does one get over the anxiety that they are doing something foolish, financially at least?",
        "author": "VirginiaPlain1",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6hszn7/how_does_one_get_over_the_anxiety_that_they_are/",
        "text": "In the spirit of the user that referred to their tormentors by names such as LadyBaby, Creeper etc, I am going to call my n mom The Prophet.  The Prophet has always fancied herself an oracle, that God gives her messages directly and curses her enemies on her behalf.  After 2008, she has taken it upon herself to predict the next financial collapse.  She has predicted one nearly every year, and from 2012 onwards, her predictions became even more dire.  Not only would she predict financial collapse, but she started to predict the collapse of civilization.  Peak oil, electromagnetic storms that knock out the power grid, and mass starvation.  She got into prepping, although because she is a hoarder, there wasn't much room to put extra stores of food.  There is still no room to put extra stores of food, in my house.  \n\nFor years, she has been pressuring to sell my house and live in a shotgun shack.  She paid $50,000 towards down payment and home improvements and wants that money back desperately.  Nevermind some of that money is accounted for as a gift and legally she can't get that back.  Today, she sends this lovely gem: http://imgur.com/laWfzNQ\n\nSeriously, I'm so over her apocalyptic rhetoric.  But deep inside me is anxiety that I am making a bad decision by not selling my house.  And that I will get burned when there is a collapse like there was in 2008.  How does one learn to trust themselves, and be okay with whatever decision they make? ",
        "created_utc": 1497699936,
        "upvote_ratio": ""
    },
    {
        "title": "is my mom creating incestuous relationship/have i been sexually abused...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6hs4jc/is_my_mom_creating_incestuous_relationshiphave_i/",
        "text": "[deleted]",
        "created_utc": 1497683366,
        "upvote_ratio": ""
    },
    {
        "title": "Can't relax or relate to my very nice MIL [Advice]",
        "author": "Goosegirl23",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6hoakj/cant_relax_or_relate_to_my_very_nice_mil_advice/",
        "text": "Sorry for the formatting, on mobile. Some background, My parents are both narcissistic and live in an alternate reality. I can't trust them to have my best interests at heart in any way, shape, or form. The lack of trust in my parents has been weirdly transposed onto my mother in law, and I don't know how navigate our relationship. \n\nMy husband is an amazing only child, adopted later (40's) in his parents life, and loves his parents. We've been married for 4 years, and we're childfree. I get along great with his father, he's a man of simple pleasures and has made me feel wonderfully welcome in his life. As long as he's got the cows, land, and his family, there's not a day that goes by that isn't a beautiful day. My mother in law.... Confuses me. She's from a upper class background and is very proper, and doesn't speak her mind freely. Everything is calculated, but not maliciously. She just choses her words like she's tiptoing through a tack factory. I tend to be very cautious and I put up walls when I talk to her, and my speech patterns can come off as overly blunt. We've butted heads on a few things, more from lack of understanding than differences in opinion. \n\nWe live next door to her, rent free, with the only stipulation being my husband comes to help her around the house one day a week for a few hours. Recently, she has expressed to my husband that she wishes she and I were better friends. She's been making an effort to try to get to know me better, wants to chat, and genuinely wants to know what's going on with my life. My husband talks with her at least once a day, but I'm so unsociable and leery that I have a hard time responding to her texts and talking to her. I don't know how to learn to talk and interact with her without coming across as though I don't trust her, or that I'm not friendly. Any suggestions would be appreciated. \n\nTl;Dr how do I to talk to my MIL without sounding like a untrusting awkward spaz? ",
        "created_utc": 1497636764,
        "upvote_ratio": ""
    },
    {
        "title": "Fear of vulnerability after narcissistic abuse?",
        "author": "peacockpartypants",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6hnwzj/fear_of_vulnerability_after_narcissistic_abuse/",
        "text": "To make a long story short(if you want the long, feel free to look into my post history) I was emotionally abused by a covert narc for about 3 years.\n\nIt's been a while, over 6 months. I'm doing fucking GREAT!\n\nReally, my life is beautiful. All things considered, last night.... for the first time in a long time I felt genuine happiness. \n\nAnyways, I'm starting to explore my sexuality and date again...\n\nBut I'm finding I'm uncomfortable talking about my sexuality in ways I wasn't before. At first I thought it was shame, but that didn't feel right. I think it's more fear of being vulnerable after every single vulnerability I ever shared was used to hurt me intentionally. \n\nThoughts? Feels? Advice? Just felt good to get it out, maybe might help someone else know they're not alone. ",
        "created_utc": 1497633363,
        "upvote_ratio": ""
    },
    {
        "title": "DAE notice they seem to process emotions better when slightly sleep deprived?",
        "author": "rbnthrowmefaraway",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6hl724/dae_notice_they_seem_to_process_emotions_better/",
        "text": "This is a weird thing that I've never really talked about. I've noticed a pattern since I started recovering in 2014. I seem to process emotions and thoughts better when I'm slightly sleep deprived. For reference, I usually get a good 8 hours of sleep, and I'm talking about nights when I get ~6 hours of sleep. \n\nSure, I might yawn more than usually and feel tired during the day, but I also seem to feel slightly happier, and, when I do get angry, it passes more quickly and I can sort of laugh it off. \n\nI also seem to just generally enjoy things a bit more. I don't try to take the whole day at once. I let myself like things and enjoy things a bit better, even things that my intellectual brain thinks is sort of \"stupid\" or \"lame\".\n\nI've also noticed that a lot of my breakthroughs in terms of processing my abuse seem to come on days when I'm a bit sleep deprived. I have to write it down because they can be easy to forget, but it's often amazing to me how much more clearly I see some things when I'm not really fully awake all day. \n\nI think this phenomenon is just simply stemming from my tendency to overthink everything and have way too much self control for my own good. I think only getting 6 hours of sleep puts me in a more relaxed state. \n\nI'm currently going through a couple days when I only got 6 hours of sleep, and I'll be able to sleep fully again after today, but I kind of wish I could retain this sort of loopy/relaxed state I'm in. (Just without all the sleepiness.)\n\nCan anyone relate?\n\n",
        "created_utc": 1497600465,
        "upvote_ratio": ""
    },
    {
        "title": "Going on a trip with narc mom",
        "author": "fleethenarcs",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6hkkkn/going_on_a_trip_with_narc_mom/",
        "text": "So I've been on a trip to see relatives in my home country with my narc mom, my sister and my husband. It's becoming unbearable to deal with my mom's narcissism and anxiety. We have to spend every day with her because we are being taken around by relatives since we don't know the country well and it can be dangerous in certain areas. She is super mean, impulsive rude and constantly lying. \n\nDoes anyone have any tips for dealing with an insane person for a week? I'm not sure how to get away from her and still get to see the sights in the country. She's making me so anxious that I can't sleep but I really want to see my extended family here.",
        "created_utc": 1497590541,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone else had the experience of losing a lot of very close friends due to being in an N relationship? Did you ever manage to get them back? How?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6hk5iv/has_anyone_else_had_the_experience_of_losing_a/",
        "text": "[deleted]",
        "created_utc": 1497584861,
        "upvote_ratio": ""
    },
    {
        "title": "Some good NPD detection methods.",
        "author": "gudachi",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6hjnp5/some_good_npd_detection_methods/",
        "text": "[removed]",
        "created_utc": 1497578718,
        "upvote_ratio": ""
    },
    {
        "title": "When you are stressed, do you start reliving nparent abuse?",
        "author": "mat1776",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6hj4rp/when_you_are_stressed_do_you_start_reliving/",
        "text": "I was thinking today that when I hit a big bump in life that I tend to regress mentally back to the time when I think about nparents, and the torture that they and GC sister put me through. I tend to relive it, and wish it didn't happen while still missing \"what might/should have been.\" \nDoes anyone else have this happen to them?",
        "created_utc": 1497573002,
        "upvote_ratio": ""
    },
    {
        "title": "Why do people raised by Narc parents fall for it again in romantic relationships even if they are self-aware about the Narc parent?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6hhyej/why_do_people_raised_by_narc_parents_fall_for_it/",
        "text": "[deleted]",
        "created_utc": 1497560733,
        "upvote_ratio": ""
    },
    {
        "title": "EX is suddenly obsessed with art and creativity with his new gf?",
        "author": "Fake_Name90",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6hhuy4/ex_is_suddenly_obsessed_with_art_and_creativity/",
        "text": "He dumped me out of the blue 4 months ago, told me he was moving country at the end of summer, I said I didn't want to go and could we work things out. He refused and discarded me after 6 years of giving him my all.\n\nI have gone through 3 months of depression after leaving my narc. It was the toughest thing in the world I have ever done. For the first time I am starting to see the beauty of life, and how lucky I am to be away from that black hole, even though he looks and feels beautiful on the outside. \n\nHe moved on a month later with this french girl. It is so weird that I can see what he is doing from afar without actually being involved. He is the most boring person I have ever met. He is acting all interesting on social media, like he suddenly has this amazing artistic mind, it is laughable really. He constantly tags her in these artsy posts, for example all these creative cinema scenes, art galleries around the world etc...he didn't have one creative bone in his body when I was with him, he was not one bit interested in paintings or cinema art or galleries etc...she is an art student, now he is obsessed with art. He was only ever interested in zombie movies, and gaming and being a complete jerk when I was with him. Part of me is thinking has she brought out the best in him, and tapped into something I didn't? \n\nThe weird thing is she actually looks like a really nice cool person, someone I would be friends with type of thing. I feel so bad that she is probably over the moon that the \"right person\" has come into her life. Also I noticed he got rid of his mom on his social media, because that was the one thing that constantly caused problems was his overbearing mother, she is no longer on the scene, so he is doing everything in his power to hook her. It is amazing how real the love felt though when I was with him, that I stayed for 6 years!!! \n\nI was just going to ask you, they say narcissists always come back, why is it that he never tried in 4 months? do you think it is because he knows I have him sussed out, and his games won't work anymore? In a way I am kind of offended he never tried, not that I would go back of course!!",
        "created_utc": 1497559824,
        "upvote_ratio": ""
    },
    {
        "title": "EX has suddenly got obsessed with art and creativity with his new gf?",
        "author": "Fake_Name90",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6hhpr6/ex_has_suddenly_got_obsessed_with_art_and/",
        "text": "He dumped me out of the blue 4 months ago, told me he was moving country at the end of summer, I said I didn't want to go and could we work things out. He refused and discarded me after 6 years of giving him my all.\n\nI have gone through 3 months of depression after leaving my narc. It was the toughest thing in the world I have ever done. For the first time I am starting to see the beauty of life, and how lucky I am to be away from that black hole, even though he looks and feels beautiful on the outside. \n\nHe moved on a month later with this french girl. It is so weird that I can see what he is doing from afar without actually being involved. He is the most boring person I have ever met. He is acting all interesting on social media, like he suddenly has this amazing artistic mind, it is laughable really. He constantly tags her in these artsy posts, for example all these creative cinema scenes, art galleries around the world etc...he didn't have one creative bone in his body when I was with him, he was not one bit interested in paintings or cinema art or galleries etc...she is an art student, now he is obsessed with art. He was only ever interested in zombie movies, and gaming and being a complete jerk when I was with him. Part of me is thinking has she brought out the best in him, and tapped into something I didn't? \n\nThe weird thing is she actually looks like a really nice cool person, someone I would be friends with type of thing. I feel so bad that she is probably over the moon that the \"right person\" has come into her life. Also I noticed he got rid of his mom on his social media, because that was the one thing that constantly caused problems was his overbearing mother, she is no longer on the scene, so he is doing everything in his power to hook her. It is amazing how real the love felt though when I was with him, that I stayed for 6 years!!! \n\nI was just going to ask you, they say narcissists always come back, why is it that he never tried in 4 months? do you think it is because he knows I have him sussed out, and his games won't work anymore? In a way I am kind of offended he never tried, not that I would go back of course!!",
        "created_utc": 1497558502,
        "upvote_ratio": ""
    },
    {
        "title": "Ex pretending to be something he is not with his new gf?",
        "author": "Fake_Name90",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6hhews/ex_pretending_to_be_something_he_is_not_with_his/",
        "text": "He dumped me out of the blue 4 months ago, told me he was moving country at the end of summer, I said I didn't want to go and could we work things out. He discarded me after 6 years of giving him my all. \n\nHe moved on a month later with this french girl, anyway I can see his posts on the facebook feed and what he comments on or likes. He constantly tags her in these artsy posts, for example the most stunning cinema scenes, all these creative cinema scenes, art galleries around the world etc...he didn't have one creative bone in his body when I was with him, he was not one bit interested in paintings or cinema art etc...she is an art student, how odd that all of a sudden he is obsessed with art and creativity and tagging her in all these posts, is it to get her hooked, to show that they have something in common? I find it so fake.\n\n It actually creeps me out, he was only ever interested in zombie movies, and gaming, I doubt one person in his life has suddenly made him into this creative genius he is pretending to be?",
        "created_utc": 1497555773,
        "upvote_ratio": ""
    },
    {
        "title": "For those who went LC/VLC/NC with their N family members: Did people notice a significant change in you?",
        "author": "VirginiaPlain1",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6hgo0z/for_those_who_went_lcvlcnc_with_their_n_family/",
        "text": "So I'm on campus as part of my doctorate program.  One week every semester I have to meet in person, and that's when I see classmates.  We only see each other in person once every semester, but I've been getting a lot of remarks that I've changed.  People that only see me once every few months have noticed something.\n\nExternally I have made some changes.  I cut my very long hair, I have lost weight, I look like I have a bit more muscle, and I've been dressing differently.  But I don't know if I've really made any internal changes.  Or maybe it hasn't registered.  Is there an aura or energy I'm putting out that is noticeably different? Has anyone approached you after you cut off all or some n family members and said something?",
        "created_utc": 1497549092,
        "upvote_ratio": ""
    },
    {
        "title": "Will I ever stop being pissed at Nex?",
        "author": "thelatestlatebloomer",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6hg10q/will_i_ever_stop_being_pissed_at_nex/",
        "text": "It's been 1.5 years since he abruptly turned on me and ghosted. I went through so much, but I've been getting better. I even started dating a new guy, who actually HELPED me through a panic attack instead of telling me it was the reason I was broken.\n\nBut yesterday I spotted my ex's LinkedIn and found myself getting angry that he has just been buzzing along in life, no consequences, found a new girl 2 months later and is still with her. It makes me angry to think about it, kind of.\n\nWhen will this be over? I really am moving up and doing better, but I still have these moments.",
        "created_utc": 1497543407,
        "upvote_ratio": ""
    },
    {
        "title": "Feeling like I've made a little progress from where I used to be with some nexfriends.",
        "author": "MotivationComeForth",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6hfz3t/feeling_like_ive_made_a_little_progress_from/",
        "text": "I've been lurking here for a while and thought I might try sharing-  I had a horrifying realization the other day, \"past me\" was a beaten dog.  I didn't know any better.  I saw my 'friends' hurting or frustrated, and not knowing any better I would roll over and literally tell them they could beat on me if it'd help them feel better.  It's taken years of introspection and some friends who actually seem to care to finally realize how insanely fucked-up those actions were, and to realize that *no-one* even batted an eye at it; some even took me up on it willingly;  and some just took open season and would punch or kick whenever they felt even mild displeasure (most commonly at puns).  I feel like I've come a long way from there but that was a mind fuck to think about where I was then compared to now.",
        "created_utc": 1497542910,
        "upvote_ratio": ""
    },
    {
        "title": "Does change makes you weaker? or the opposite?",
        "author": "Awesome858",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6heooa/does_change_makes_you_weaker_or_the_opposite/",
        "text": "If you change yourself for the better...\nDoesnt that mean youre running away from the current problems?\nOr does it mean something else?",
        "created_utc": 1497529634,
        "upvote_ratio": ""
    },
    {
        "title": "When will he get out of my head?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6haspp/when_will_he_get_out_of_my_head/",
        "text": "[deleted]",
        "created_utc": 1497477700,
        "upvote_ratio": ""
    },
    {
        "title": "Anger and Fury",
        "author": "ZombMonster",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6h96lp/anger_and_fury/",
        "text": "I'm going to keep this as brief as possible because I need to leave for work:\nI've moved out from the Nparents. \n\nThing is, I realized that the anger and fury at them and my siblings is beginning to rear its head. I know this a normal part of the process, but how do I begin to deal with it? After countless years of being forced to suppress my emotions and being punished when I do, I'm baffled as to how to handle these emotions in a healthy, non-destructive manner. And I don't want to bitch to My SO about it because I don't want that to become an issue in the relationship. He's aware of what I'm feeling with/what I endured. \n\nTherapy is not an option right now because my insurance through the temp agency is kinda shitty. Any advice or ideas would be greatly appreciated. ",
        "created_utc": 1497462791,
        "upvote_ratio": ""
    },
    {
        "title": "I cheated on my N(ex)spouse. Now what?",
        "author": "azurille",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6h8xg6/i_cheated_on_my_nexspouse_now_what/",
        "text": "I'm just wondering whether anyone else has been in the same position as me. I spent 6 years with my Nspouse (married for 3), and I somehow kept ignoring, excusing, and/or taking the blame for his controlling and manipulative behavior.\n\nHe was incredibly possessive, did not want me talking to any other guys except his own friends. I was not allowed to go out at night with my friends, or ever meet a male friend or coworker one on one. He went out freely of course, sometimes he didn't even come home until the next day, still totally wasted. I was not allowed to have a conversation privately, in fact he was the only one allowed to have secrets. When he saw me texting, he would demand to read the messages, then always accuse me of cheating (if I showed him, he would find some \"evidence\" in the conversation that I was cheating with that person, and if I refused to show him it must be because I was cheating). \n\nHe didn't seem to see my emotions as real emotions. Only his feelings counted. He liked to scare me while I was watching shows because he thought it was funny to see me jump and scream. And if he wanted to touch me or grab me or have sex with me, \"no\" was not an acceptable answer. He would rage at me for denying him my body, which was wrong of me because he was my husband and I belonged to him. His anger was scary to me so usually I would just give in. Sadly I'm sure this sounds familiar to many of you.\n\nDuring all of this I told myself that I loved my Nspouse and that he needed my support. He had trouble keeping a job and he had a drinking problem that got worse throughout our relationship. I also have my own struggles with mental health, so I tried to sympathize with him even though he was hurting me.\n\nWhen I finally started to see him for who he really was, I desperately wanted to talk to someone about it, but it was hard because I wasn't allowed to meet anyone privately or have a private text conversation. The only place I was free from him was at work, so I confided in a coworker who I trusted. This coworker was the only person who knew what I was going through and offered me compassion and tenderness. We got very close over just a few weeks, until one day we kissed. I knew I had to tell my Nspouse what happened even though I knew he would rage and probably decide to divorce me. \n\nThe discard and the smear campaign were way more brutal than I imagined, but I'm actually glad about it in a way because it erased all my doubts about whether my Nspouse was really that bad. He threw me out with my overnight bag and told everyone who would listen that I ruined our marriage with my affairs (it turned into multiple affairs in his story) plus other very personal info. At this point I just feel lucky that I didn't lose my true friends over it, and I look forward to getting divorced and going on with my life. Yeah it feels bad to be given a black mark on my reputation for being A Cheater, but I'm more concerned with being a good and ethical person in reality, as I think my truth will outlast Nex's tall tales given some time and distance.\n\nI guess I'm mainly wondering if the twisted and destructive relationship with your N(partner, friend, family) has pushed you to do anything that seems way out of character for you, and whether time/introspection/therapy/etc has restored your faith in yourself to do the right thing in your current and future relationships. I'm now dating my confidant and he says he trusts me completely, but I don't know if I trust myself after basically justifying my Nex's paranoia. I am working with a therapist since my separation from my Nex, with the goal of having healthier, happier relationships in the future. But I'd also be grateful to hear from anyone who has been in a similar situation.\n\nThanks for reading!",
        "created_utc": 1497460543,
        "upvote_ratio": ""
    },
    {
        "title": "Do we progress further if we do thins alone?",
        "author": "Awesome858",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6h6yvc/do_we_progress_further_if_we_do_thins_alone/",
        "text": "Does teamwork hinders or slows down your self-progress?\nif we do things independently,does it make you grow more?\nor relying on other people,helps you progress further?\n",
        "created_utc": 1497440843,
        "upvote_ratio": ""
    },
    {
        "title": "Marriage After Being RBN",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6h2sbe/marriage_after_being_rbn/",
        "text": "[deleted]",
        "created_utc": 1497387181,
        "upvote_ratio": ""
    },
    {
        "title": "I moved out over a year ago, but today I finally deleted my N-ex's Netflix profile in the account paid only by me. Progress (a baby step) or petty? I'm not sure...",
        "author": "HerTheHeron",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6h2jbu/i_moved_out_over_a_year_ago_but_today_i_finally/",
        "text": "...but it feels good to not be paying for his access to Netflix. Plus, when I get home and turn on my TV it will be *great* to not see his avatar. \n\nHe can still access what's on Netflix by using one of our kids' accounts (we share custody) so I haven't even taken anything away from him. \n\nAnd yet, I still feel like it's petty. Which is probably why I waited so long.",
        "created_utc": 1497384907,
        "upvote_ratio": ""
    },
    {
        "title": "My grandparents may be allies? Or may be Flying Monkeys?",
        "author": "theChristinaStory",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6h286b/my_grandparents_may_be_allies_or_may_be_flying/",
        "text": "I am NC with my Nmother and Edad. I have three younger siblings--brother, sister, brother--whom I also do not speak to often. My brothers do not want anything to do with me since they believe that I am a crazed egotistical maniac that my mother says I am who is \"just trying to make everyone suffer\" and my sister tries to stay on neutral ground, but is really struggling right now with being drawn back into my Nmom's thrall. \n\nOne phrase that my mom used to use often when we fought was \"Do you not want to be part of this family?\" and my answer on the tip of my tongue was ALWAYS \"No! No, I really don't want to be here with you\" but I was always terrified of the consequences. She once dared me to call CPS; then I would be placed in a foster home and it could be even worse than it was with her. \nNow I'm not part of the family, and it has been the happiest 4 years of my life. I've got a successful job, I'm on the road to healing, and I'm treating my depression and PTSD. \n\nThe only people I really miss that got caught up in the cut off are my grandparents. They are my maternal grandparents- and my grandfather is actually my step-grandfather. My grandmother remarried twice after divorcing my maternal grandfather, who is now deceased, and her second husband died. My step-grandfather is her third. My paternal grandparents are also deceased. Meema and Bapa were always on my side growing up. Meema always rolled her eyes at her daughter when she was trying to get pity out of her. Bapa always pulled me aside and said: \"MissaBeana, you're my favorite!\" and give me a little raspberry on my cheek. Bapa had no time for my brother's GC antics that my mother allowed him to get away with. Things she blamed on me because I was the oldest were properly attributed to the actual culprit at Meema and Bapa's house (to be fair, it was sometimes me--I'm not saying I couldn't be a naughty child). When I first told Meema and Bapa about what I had realized while I was away at college: that they way that my mom and dad treat me is not normal or right, they backed me up. \"We never quite agreed with their raising of you, but we're the grandparents. We can't say too much. Your mother wouldn't listen anyways.\" they said. I told them that I believed that what she was doing was actual abuse, that emotional abuse is a real thing and that I was going to ask her to stop. My grandma took a deep breath and said \"Good luck.\"\n\nWhen I went NC, it was like that conversation didn't happen. My grandma was suddenly uncomfortable with all the strife that was going on...how nothing was seamless anymore and the dirty laundry was being aired. She constantly told me to \"Get over it, apologize, make it better.\" She just wanted to make the bad feelings stop, to put a band-aid over it all. She couldn't handle the conflict. I tried talking to my grandpa about it, and he basically told me that he supported me and what I was doing, but to continue to try and be in contact with them would stress my grandmother out a lot. \n\nI made the executive decison that I was not going to be the contributing factor to her stress. I told her that I would stop bothering her and leave her alone. She replied with \"just apologize!\" and I said \"For what? What did I do?\" and she just sighed frustratedly and said \"Nevermind\"--because she knows I didn't do anything wrong. She just wants it to be better.\n\nI've called them a few times since, visited them maybe three times in the past four years. I saw them for my great-grandmother's funeral. I called my grandma on her birthday, and instead of thank you she immediatly said \"Why didn't you call your mother?\" (whose birthday is two days before my grandma's) and I said \"You know full well why.\" and she said \"Just APOLOGIZE!\" and stated that I would hang up if she could not hold a conversation.\n\nI called my grandpa on his birthday this past May 31st, and he said they had just moved back up from the Southern part of the state (which is two hours away from me) to about 25 minutes away from me since there was no need for my grandma to take care of my great-grandmother anymore. I asked if I could visit, and he said he would like that. I knew he would- but would my grandma?\n\nToday I called and asked her if she wanted to go out to dinner tonight--a local drum corps is hosting a fundraiser at Chipotle between our two locations, and I thought that would be nice. She said \"I'll pass tonight because it's too hot to leave and I don't like Chipotle. But we're free Friday and Saturday.\" I stated that I am free for dinner on both days, as well as lunch on Saturday. She replied that she would talk to my grandpa and get back to me. That was five hours ago. I am not sure, but I think she has probably called my Nmom and asked what to do. What if she's planning an ambush? What if she's just going to ghost on me? What if she's just talking shit about me right now to everyone in her phone book? I don't care if my mom/dad/brothers talk shit about me. But please not my grandparents too.  \n\nThis makes me really sad. My grandparents may not have a lot of time left. My grandpa has arthritis and has already had like, 6 knee surgeries and 2 back surgeries. My grandma is an ex-smoker who smoked for like, 40 years. I would at least like to see my grandpa a little bit. My Bapa. \n\nI'm just sitting at work. Worried. Should I call my grandpa's cell phone separately? Should I call her back tonight? ",
        "created_utc": 1497382079,
        "upvote_ratio": ""
    },
    {
        "title": "My brother broke NC and he and N Mom are participating in their own email exchange. How do I get him to stop?",
        "author": "VirginiaPlain1",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6gz3fk/my_brother_broke_nc_and_he_and_n_mom_are/",
        "text": "Since I gave a ultimatum to my n mom about no longer wanting to steal money for her and wanting her out of my house, I reconnected with my estranged brother.  He has been NC with her for the most part since 2007, with occasional nasty email exchanges between them.  What started this nasty exchange was when I forwarded my email to her and her (equally nasty) responses.  He clearly has unfinished business with her.  I thought he had overcome the trauma of our abusive childhood.  He was in therapy longer than I was.  But he clearly hasn't.  He's spewing his own abuse towards her right now.  I'm afraid it will hurt my case to get a harassment restraining order against her.  She can and will use his emails against me.  \n\nI swear it's like watching someone in the mirror argue with themselves.  They both have similar ranting styles, except he uses all CAPS and bold.  They have always been the most alike.  I have told him to stop emailing her several times but he can't resist.  How do I get him to stop?",
        "created_utc": 1497350972,
        "upvote_ratio": ""
    },
    {
        "title": "How do I tell my kids that I've cut off contact with their grandmother?",
        "author": "totally_rocks",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6gwa7t/how_do_i_tell_my_kids_that_ive_cut_off_contact/",
        "text": "Some shit went down between me and my mother last week and I finally cut off contact.  This is something I've considered doing for close to a year now.  In that time I'd been reducing her contact with me and my kids more and more but until recently it was still pretty seamless for the kids.  I haven't said anything to the kids yet, but they asked about her on the weekend.  \n\nWhat should I tell a 5 and 7 year old about this?  How do I tell them that I've changed my mind about my relationship with my mother without confusing them or starting a smear campaign?  I've already had to explain to my oldest a few times that \"my father isn't dead, he just isn't a nice person.\"  But they've never met my father.  They believe their grandmother is a nice person.\n\nThis is the only reason I didn't cut off contact a year ago.  I don't want my kids feeling trapped in the middle, or feeling like they have to take sides.  I've been torn between healing myself and maintaining supervised visits so my kids aren't caught up in this.  My mother pushed my hand on this, now I don't know what to do.  Any advice would be welcome.\n\nThanks.",
        "created_utc": 1497312854,
        "upvote_ratio": ""
    },
    {
        "title": "Broken, lost, thrown away (RANT)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6gur0f/broken_lost_thrown_away_rant/",
        "text": "[deleted]",
        "created_utc": 1497297813,
        "upvote_ratio": ""
    },
    {
        "title": "Tony Awards 2017: Big winners ('Evan Hansen,' 'Dolly!') and surprises",
        "author": "Khhollah12",
        "url": "https://www.usatoday.com/story/life/theater/2017/06/11/tony-awards-news-and-views/102764538/",
        "text": "",
        "created_utc": 1497247791,
        "upvote_ratio": ""
    },
    {
        "title": "What are some tips to succeed in a work environment?",
        "author": "willwritefortacos",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6gnist/what_are_some_tips_to_succeed_in_a_work/",
        "text": "I work from home which is amazingly comforting to me but it makes things a little harder since communication is going to be slightly more difficult, I worry about pestering my boss over every single detail and him getting really annoyed at me over the simple stuff.\n\nAnd when I do inevitably make a mistake, I have panic attacks over it and pretty much prepare myself for the worse. Any advice on how to deal with this?\n\nEdit:\n Thank you so much for your insightful responses!!",
        "created_utc": 1497211765,
        "upvote_ratio": ""
    },
    {
        "title": "Need roommate help",
        "author": "agent_skullz",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6gkeh4/need_roommate_help/",
        "text": "Hey all.\n\nSo I've been NC with my smothering Nmother for a year now and I've ended up in a few weird roommate situations because I don't seem to be able to accurately judge character. Currently I live with my best friend, her boyfriend (who I am friends with), and another woman who I lived with in a previous apartment. We weren't friends in the previous apartment but I ended up making a bad decision to let a narc I knew years before move in with us there after the two other girls we lived with moved out. I felt guilty about leaving someone with my bad life choice so I offered to let the woman move in with my friends and I at our new place.\n\nBig mistake! This woman somehow decided she owned my entire life and all of my emotions. I work a nightshift and sleep all day but the literal second I would wake up she'd be all over me about topics I am incredibly sensitive about. I was trying to be friendly for a while but I guess I gave her too much information? I hated leaving my room because I was afraid I'd get ambushed. After a few weeks of this I eventually told her off (quite angrily, I'm afraid) and said she needed to back off. She hasn't done anything really since then and my friend says that the girl is \"terrified of me\" now but I still don't want to leave my room. I don't want to have anything to do with her. I have anxiety attacks when we are in the same space because even when she's not saying anything to me I am just waiting for her to because for so long I had to armor up and prepare myself to deal with her at all. Literally anything she would say to me for like a month was incredibly prying and exhausting and so my conditioned response is to be on guard for that from her still.\n\nI need to tell her that she has until the end of the lease to find a new place to live because I 100% will not ever sign another lease with her again. That's 8 months away so it's not like I'm kicking her out, but also I don't want to be in her presence at all so I don't know how to be like \"hey, by the way, I can't live with you.\"\n\nI'm not sure what I'm asking, I just know that I keep having panic attacks at the prospect of even having this person in my presence BUT I need to inform her that I don't want to live with her anymore. I recognize that there's A LOT of other stressful stuff going on in my life right now, but feeling like I have to vomit if I need to leave my bedroom is not helping with any of it either.\n\nI don't want to be passive aggressive or be that person who terrorizes others because I don't want to become my shitty mother but I don't actually know how to do this??????",
        "created_utc": 1497169996,
        "upvote_ratio": ""
    },
    {
        "title": "Should I notify my brother of my counsellor's passing?",
        "author": "throwaway9347n33t",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6gjrl9/should_i_notify_my_brother_of_my_counsellors/",
        "text": "On one hand I want to tell him, but on the other I unblocked him briefly for this purpose and I can already feel my head getting foggy again. It would go back to my parents. It would (potentially) break NC. I don't know what I hope to get out of this, but I just feel obligated to tell, like this big thing happened and I should notify him. What do you suggest I do? In the case of big things happening (moves, deaths, etc.) do you notify your Nfamily members at all? Like, on one hand I want them to understand what I'm going through. On the other, emotional contact with them has never ended well. \n\nThanks for listening. ",
        "created_utc": 1497157773,
        "upvote_ratio": ""
    },
    {
        "title": "The pesky good memories",
        "author": "steelyeye",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6gebiu/the_pesky_good_memories/",
        "text": "TL;DR: trying to figure out how not to feel conflicted about good memories of N's.\n\nWhen I was about 12 I got really really sick.  Like death's door apparently, as I had stopped eating for several days and was barely even getting any water...generally my dad just left me and all things illness for my mom to take care of, while giving all kinds of weird instructions he would \"intuit\" bc superior intellect.  Anyway, with the fever etc I'm not sure but I vaguely heard them discussing how if I wasn't better by morning or something they'd take me to the hospital...she went to bed and he sat with me. I was too far gone to really care what happened but I do remember vividly, he tried to give me something, some water or something, and when I couldn't take it he got mad. Like they do, you know, like I'll just get so mad I'll intimidate you into doing this so you get better. But I was just too sick, too done to even respond to his anger...and then he got scared. It's one of the few times I've ever seen the wall come down, and one of a few memories that really pains me- because I truly felt that he cared about me in that moment. That he really loved me and was desperate not to let me die. That he knew he didn't know what to do, and was just helpless and panicked and scared for his daughter.  And then he switched to saying something kind, maybe there were tears, some kind of parental tenderness that I don't remember with the fever haze and the years now. But I remember how surprised I felt, and how I knew I must be really bad off bc I can't remember my dad ever showing me that level of concern or engagement before. And probably only once since.\n\nIt's a memory I struggle with, bc thinking of my Ndad as any kind of human makes it hard for me to keep him at bay with nc. However long I go, eventually I forget all the reasons and something like this will tug at my heartstrings and I'll go back. So mostly I guard against my good memories of him, think of him as a monster only, and generally try to ignore that he exists somewhere out there. But whenever things like this surface, they hurt, because I question all over again if I've made the right choices or if I'm the monster, or if he and others in the family who are on his side are maybe right and there is something awful and broken about me bc I just can't get along \"with anybody\". \n\nI guess this is akin to obsessing over \"the good times\" after a breakup; the past is past regardless of what you choose in the present...like, restarting a relationship with my dad now wouldn't bring back that moment anyway, and I've already decided time and again that having that guy in my adult life is not in my sanity's best interest. \n\nI guess it bothers me because I still feel all my decisions are so precarious- if anyone objected enough that I was putting them out, there's probably nothing I wouldn't change. And I wish I wasn't like that, wish I didn't always put others first even in my mind. But I do, so my solution is to keep them all at arm's length, so I don't have to choose between what People want and what I want, bc I just don't find out what they want. That's my biggest problem with Ndad- not that he's overtly abusive but that he's so overbearing I cease to exist. The constant onslaught of opinions and chatter and instructions and judgements and overtalking and mansplaining- I just don't have the energy to parry it all so I give up and shut myself down and defer to him in all things- bc who wants to fight with an N about anything only to hear how little they really care what you think and btw they win anyway. \n\nI guess memories like this tempt me to think \"underneath it all...\", which is what brought me back so many many times. \"Underneath it all\" I was loved-? \"Underneath it all\" I was valued-? All I had to do was ALMOST DIE, ONE TIME WHEN I WAS TWELVE, to know it. Lol...I guess I just don't really know what to do with that fact. Nothing, I guess, but I wish I could put it to bed, like if I knew *how* to think of it then it wouldn't hurt me when I do. ",
        "created_utc": 1497085106,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone else notice Narcissists have a psychotic need for everyone to like them?",
        "author": "kielera714",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6gdgrz/anyone_else_notice_narcissists_have_a_psychotic/",
        "text": "Every narc i've known seems to desperately charm the pants off of everyone in an attempt to be extremely well liked and is completely agreeable with people until someone criticizes them.Then they go into a whole they're losers and just jelly of me mentality",
        "created_utc": 1497069184,
        "upvote_ratio": ""
    },
    {
        "title": "How to prep when you know you will see your Nex",
        "author": "jeckylln",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6gc9pf/how_to_prep_when_you_know_you_will_see_your_nex/",
        "text": "So I have a wedding to go to tomorrow and my Nex is going to be there. We were together only a year (thank god) and we've been split for just over 2 months. We're low contact because we have friends in common and because I don't want him to know Ive worked him out as he has a lot of power and could make things difficult for me so I just grey rock him and keep as far away as I can. But tomorrow I have to see him. \n\nI don't have to talk to him I don't think and my current plan is just to avoid and hang with others and try and seem strong but I was wondering if you wonderful people had any special advice for these kinds of occasions, especially as I can't promise myself he won't follow me out for a smoke or somehow convince the friends I'm going with to hang out in a wider gang so I want to be prepared for all eventualities.\n\nAny good suggestions kind folk? Anything I should stay cognizant of to protect myself best? He's not really done any full on hoovering but he also hasn't left me alone for longer than a week since we broke up...\n\nTldr: gotta see Nex tomorrow. Any advice?",
        "created_utc": 1497053297,
        "upvote_ratio": ""
    },
    {
        "title": "Feeling of deja-vu",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6g92ly/feeling_of_dejavu/",
        "text": "My Nex girlfriend left me a year ago in the most horrid way and kept me on a leach for some time untill I had enough and went no contact last december.\nTwo weeks ago, I learned about NPD and all the dots connected, I felt so angry. Now I know I meant nothing more than a way for her to get out of the country, money, ego boost and fun. I guess it was fun for her to crush me, discard me and ignore me while watching me struggle all this time.\n\n\nLast night, I came back home on a nice warm summer night. The night, smells, warm humidity, It felt so good...it felt familiar...oh...yea that's how I felt then when I was with her: safe. That was my flashback, my feeling of deja vu, and it's depressing and maddening.\n\n\nNow I'm having a really hard time to reconcile the two: my image of then and the real her. I feel sad, melancholic, mournful for myself, for those memories that are corrupted, not real.\nI want to go on with my life! But I can't repress these thought, they obscess me and I can't get past them! If I do, I'll be repressing them and I already repressed them for too long now. My friends, family, her past exes, my therapist, they all agree with me when I explained I thought she had NPD, but sometime I can't connect the two!!! This is so perverse, and I'm tired of this.",
        "created_utc": 1497021730,
        "upvote_ratio": ""
    },
    {
        "title": "Today I lost it at work [support]",
        "author": "starshinedrop",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6g22xa/today_i_lost_it_at_work_support/",
        "text": "Today I lost it at work. My late ndad never asked. He commanded. Today at work, without saying please, thank you, a colleage, younger than me but on the same level said \"MEETING NOW.\" And I was like, woah, wait what I can't NOW. I'm busy NOW. So he barks at me \"If you don't want to be there FINE.\" I wanted to be there but I stuck to my damn guns because nobody barks to me to be anywhere in the environment where I work. You ask, arrange. So I got all shaky and teary eyed. Later when I told another colleague what happened, I almost stopped breathing. I got red in the face and dizzy and I almost passed out.\n\nThen I thought, maybe this wasn't about my younger colleague. Maybe it was about my dad.",
        "created_utc": 1496939886,
        "upvote_ratio": ""
    },
    {
        "title": "Narcissist boss is bringing back old feelings of being trapped.",
        "author": "HollyLongstockings",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6g13hb/narcissist_boss_is_bringing_back_old_feelings_of/",
        "text": "I don't know if my boss is a narcissist or just has some serious FLEAs (she admitted once that her mother is very controlling and has a personality disorder). But either way, her own personality is full of N traits, and I have this urge to run away from my job.\n\nA little background, three years ago I quit a job of over a decade because I could no longer stand working there. Basically threw away a fantastic career that I loved for reasons unknown (at the time) because my anxiety had become so high that I couldn't bring myself to even get out of bed in the morning. \n\nAfter quitting I found a great therapist who worked with me to realize that my old boss had been a raging narcissist, and I'd become her victim. It had gradually worn me down to a point I could no longer function. Working through therapy brought up all the child abuse that I'd tried to bury for so long, and my therapist made the connection that my mother was an abusive narcissist, my old boss had basically become my replacement Nmom, and I'd willing stepped into the victim role because it's what I knew.\n\nI went through therapy intensely for two years, went NC with my parents, and finally started to feel at peace - healthy and happy for the first time ever. So I decided it was time to go back to work again.\n\nNow I'm one year into this job, and despite loving the work, the old feelings are coming back. There have been major setbacks with my health, and I can feel the anxiety creeping back in and gradually taking over my life again. I'm jumpy, defensive, and feel like an animal that wants to run away from danger. \n\nMy current boss is a difficult person to get along with, and she seems to relish that. She actually goes out of her way to make other people look bad, preying on employees who are having difficulties to magnify their weaknesses. It's Nmom all over again, and I feel so much pressure to overperform in order to avoid criticism.\n\nShe will pry into my personal life, probably because she can sense I'm cagey about it, and keeps asking questions about why I don't visit my family at the holidays. There's no way in hell I'm telling her details of that, because she'll use it against me. She keeps saying things like \"I so want to know what that's all about so bad!\" because nothing gets her off more than drama and other people's misfortune. I can just feel her trying to sniff out ways to make me her victim.\n\nOne day I had a slight injury on the job, and instead of being helpful she actually said \"I gotta thank you for this. My day had been so boring until this happened.\" She was excited because I was injured...how fucked up is that?\n\nSo now I'm sitting at home this morning, having called in sick, because I don't have the strength today to deal with it. There's also an overwhelming sense of guilt at being a coward and not being able to cope that I'm all too familiar with. It's history repeating itself.\n\nI can't go to HR and do anything practical because this place is staffed through nepotism, and my boss got her job through family connections that run deep. I often wonder if her attitude is the result of N insecurities because she's completely unqualified for the job her family got her and she knows it.\n\nI don't know what to do at this point. Feels like I should be able to deal with it, and that therapy should have helped me work out these things. Running away from another job would look so bad. How can I find another job without the fear that my next boss, and the next, and the next will make me feel the same way? \n\nOr maybe this boss isn't even *that* bad, and I'm projecting my own insecurities onto her...which my logical brain tells me is exactly what an N victim in denial would say.\n\nWriting this all out has helped me make sense of what I'm feeling, and realize that I'm still incredibly vulnerable to Ns.\n\nHas anyone else gone through a similar pattern of dealing with Ns? How did you finally break out of it? ",
        "created_utc": 1496930236,
        "upvote_ratio": ""
    },
    {
        "title": "Managing down expectations in an abusive cycle",
        "author": "clown-penisdotfart",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6g0wjs/managing_down_expectations_in_an_abusive_cycle/",
        "text": "I posted last week about how the cycle of abuse causes us to miss a N after discard. Today I read a comment that made me realize how the cycle of abuse worsens over time and manages down our expectations of a relationship and we find ourselves wondering how we ever thought any of that was acceptable.\n\nThe cycle of abuse is \"calm &gt; tensions rising &gt; incident &gt; reconciliation &gt; repeat from calm.\" The reconciliation and calm periods are the high of the drug that you always want to experience. But now consider what brought you to the \"incident.\" Probably in general it can be described as some disagreement where you were unable to reach an acceptable compromise that triggered the tensions and incident. And probably it is because your N had unacceptable, unreasonable expectations as would be viewed by the average observer. Then, after the incident you make up and it feels good. Somehow you found a solution, and sure, maybe you gave more than you wanted and maybe she should not have acted that way, but it is fixed and we compromised like successful couples do! That's what you tell yourself.\n\nRemember that this stuff happens slowly over time, so you can't try to imagine the most recent incidents as the starting point. You start with something far less extreme, but still outside the range of \"generally acceptable behavior.\" And in the cycle, your expectations shift when you reconcile. That situation is now within your range of \"acceptable outcomes.\" \n\nThere's a concept in public politics called the \"Overton Window.\" It states that the general public is willing to support policies across some range of outcomes, but at some point a position becomes too extreme such that it is so far out of the norm that the public will not support. So some political operatives use a strategy of pushing completely extreme positions, not so they get that position enacted, but because by being sooooo extreme, it makes positions that are juuuuuuust outside the Overton Window seem more reasonable, and perhaps these fringe policies are enacted. Then they have succeeded in moving the Overton Window. Do this long enough and you'll be ready to support fascists and whatnot.\n\nSo now in your relationship, you've given a bit more than you had planned, but hey, it worked out. You feel great again. Your partner is happy and showing you love. You're getting laid, getting gifts, etc. But your baseline has shifted a bit. The Overton Window of what you will accept from your partner moved. You may not really notice it. But do this over and over for years and years and you will find yourself in a completely different place of what is acceptable to you. This is what we mean when we say you have lost yourself. You don't recognize any more what kind of relationship it is that you're in, and you don't know how it got so bad.\n\nAnd that's your new baseline. Thats what you have to build yourself back up from and reestablish boundaries. That's hard. It isn't your fault. You aren't the bad person. In fact you were probably the good person. It implies you gave quite a bit to your SO, unfortunately you didn't get the equivalent in retur.",
        "created_utc": 1496928078,
        "upvote_ratio": ""
    },
    {
        "title": "My counsellor died in an accident.",
        "author": "throwaway9347n33t",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6fzngk/my_counsellor_died_in_an_accident/",
        "text": "Some of you may have seen my posts here - I post mainly from a different account [user/cantseeyounow](https://www.reddit.com/user/cantseeyounow) now, but I wanted to update you on my situation. I've posted before about having trouble with therapists, and how I recently found someone that I really clicked with. (It's why I haven't been posting much here) Today I found out that she has died suddenly in an accident. We had about six sessions together and I'd been seeing her for about a month and a half.  \n\nI've already spoken to my old therapist about the incident. She is also distraught. I will be getting further counseling, but not sure about therapy in the future. \n\nThanks for listening. ",
        "created_utc": 1496909838,
        "upvote_ratio": ""
    },
    {
        "title": "How did you accept you were nothing to them?",
        "author": "windlep7",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6fw6zd/how_did_you_accept_you_were_nothing_to_them/",
        "text": "Even though I know logically that they're mentally damaged and can't care about anyone but themselves.  Emotionally I find it hard to accept.\n\nI also find it hard to accept that being nothing to them isn't the same thing as being nothing.",
        "created_utc": 1496867864,
        "upvote_ratio": ""
    },
    {
        "title": "What do you tell kids when Nex makes you the bad guy?",
        "author": "steelyeye",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6fuhen/what_do_you_tell_kids_when_nex_makes_you_the_bad/",
        "text": "Here, if you owe too much child support because you haven't been paying, they issue a warrant with a purge amount. If you want the warrant to go away, you have to pay the amount. My Nex has one, and lives out of state.\n\nWe have court today where he'll ask again that the warrant be lifted for free bc \"he's broke\", and I'll ask that the amount be tripled because he's not. He owes more than an entire college education will cost, because of a lifetime of not bothering to pay. This is all the background.\n\nThe problem is, he just stared telling Kid he's coming out to visit, for two weeks (!) starting tomorrow.  He's obviously brazenly flouting the warrant- there's little to no chance the court would just drop it even without my saying anything, since it's designed expressly to motivate him to pay *something*. So the odds it will get resolved today in time for his trip are slim to none. But behind my back, he's built up the idea in Kid's head like it's a done deal.\n\nSo potential outcomes are: \n\n-Court actually does drop the warrant and he comes, which would be morally and financially fucked up for me, but make the Kid happy. Nex is probably figuring I'll feel pressure to go along with that, since Kid hasn't seen him for 3 years and misses him\n\n-Court leaves the warrant in place and possibly increases the amount for removing it, per my request. He comes anyway and visits Kid, leaving me to decide whether to call police down on him at my own house in front of Kid, since that's the only time I'll know where he is.\n\n-Court leaves the warrant, he comes anyway but avoids Kid bc I might call the police\n\n-Court leaves the warrant, he cancels trip or goes to see family in another state where he's safe, disappointing Kid\n\n-....He magically becomes a different person, pays off his warrant and comes to visit Kid legally. By tomorrow.\n\nI'm just...sad, because if I get what I want (for the warrant to stay and amount be increased),  Kid will almost certainly be disappointed.  Worse, Nex will have no problem saying something terribly inappropriate like \"I can't come after all bc mom threatened to have me arrested if I do\".  Kid is a young teenager but hasn't really been exposed to any of this, and doesn't realize his dad is a lying, conniving pos. I never ever talk to kid about legal matters, or who his dad is, or ANYTHING remotely like that- just small talk on the subject of dad, you must miss him, memories from before he left, what does he say he likes about the new state.  So when Nex tells Kid something, it sounds like the truth because I haven't said anything to contradict it.\n\nNex already told Kid we have court this morning. So even if he doesn't explicitly say anything is \"my fault\", the simple fact that tree was a plan, we went to court, the plan changed, will make it my fault. I can't see any way out of the corner he's painted me in and...just wish I could EVER see these things coming, understand how he does this and sidestep it, let alone turn the tables. I guess it's because they're willing to hurt and use anyone around to get what they want, that they can think up these schemes...I never would have told Kid I was coming if there was a possibility of disappointing him. The fact that he can disappoint him AND make it MY fault all in one fell swoop...it's amazing, really. \n\nAny insight or encouragement appreciated. Very anxious and sad as I wait for this all to go down this morning.\n\n\n",
        "created_utc": 1496852456,
        "upvote_ratio": ""
    },
    {
        "title": "[Support please] Facing off in court again in a few hours",
        "author": "steelyeye",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6frzf9/support_please_facing_off_in_court_again_in_a_few/",
        "text": "It's a pretty routine appearance for his huge amount of overdue child support. But I get nervous every time...nervous that I'll be treated unfairly (yet again) by the court, nervous that he'll say something awful or untrue yet again and I'll spend the next several days triggered over it. Mostly, I get nervous about how upset I'll get and now long it'll last. I wish I could just let it all roll off my back, since it's all so predictable after all this time- it's not IF he'll say something vile, it's how long before he does- but I'm just not that resilient when it comes to this person, to the \"justice\" system that can be triggering on is own. I have ptsd about the whole scenario. Any supportive comments appreciated :/\n\nUpdate: as some said, he didn't get a chance to say anything actually vile, just to lie about his situation and convince the judge to give him what he wants based on that lie. It's not an earth-shattering outcome, but my frustration and disappointment are deep. Why are they so good at lying. Why does everyone always fall for it. Why can't I learn even a little bit from constantly losing to the these tactics and become a better fighter? Why, when they are THE WORST people, are they able to WIN over and over and over?? I know it's childish to complain it's \"not fair\"...But I don't know how to shake it-?",
        "created_utc": 1496821249,
        "upvote_ratio": ""
    },
    {
        "title": "DAE really hate any kind of attention from a young age?",
        "author": "throwaway-person",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6frqhs/dae_really_hate_any_kind_of_attention_from_a/",
        "text": "I remember being very young and trying to avoid showing any kind of reaction to my mom. She would often react to me in ways that were exaggerated but joking or silly. It still really bothered me and caused me to learn to conceal my emotions and avoid being expressive. \n\nNow that I'm much older I have social anxiety, I'm very withdrawn and quiet, and still feel uncomfortable when people react to me in any significant way, positively or otherwise. \n\nCan anyone relate? I've been trying to figure myself out, especially relating to the very early years I don't quite remember.",
        "created_utc": 1496817319,
        "upvote_ratio": ""
    },
    {
        "title": "I [16F] am apparently being raised by a narcissist and I need to leave",
        "author": "PigThumbs",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6fpa7t/i_16f_am_apparently_being_raised_by_a_narcissist/",
        "text": "[removed]",
        "created_utc": 1496788084,
        "upvote_ratio": ""
    },
    {
        "title": "Planning to try and talk",
        "author": "cerulean_swan",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6fnnzv/planning_to_try_and_talk/",
        "text": "Hi! I am new to this page and have created a new (secret) account for this.\nI am currently still married to my suspected N. We have a 7 month old and after giving birth to him, I bumped into blogs about narcissism by chance. I quickly realized he ticks pretty much all the boxes. He has his own version of the truth, believes himself to be better than others (he is extremely smart which is kind of inconventient), is very controlling, good at the guild tripping, lacks empathy, doesn't do well with criticism or authorities. I could go on.\nAfter this realization I confronted him. This was maybe one month after giving birth and I was still recovering. I still am doing that by the way, since he doesn't work (he does do daddy-days and is really sweet with our son. When he looks at him he genuinely smiles and radiates), so I am providing for all of us and near a burn out. Anway after confronting him he got mad of course and told me I don't appreciate all the nice things he does for me. After getting over that guilt, I decided I felt sorry for him, that he needs this persona to live. I hoped that with this in mind I'd be able to handle it again. I did for the past few months, but I've reached a point now where it can not go on like this.\nI am still fairly strong and feel close to myself, if anything motherhood has brought me closer to my self and my strength. At the moment I am home alone with out little one for a few weeks, while he visits his family. We will follow him there soon. While there I am planning to talk to him and tell him something needs to change and that he needs to go into therapy, because I refuse to go on like this. I probably could, but I don't want to. Not for me, I deserve actual intimacy and love, but mainly not for my son. Right now he still looks at him with light in his eyes, but what will happen when the little one starts understanding things, exploring and starts making mistakes in the eyes of his father?\n\nDoes anyone here have any success stories regarding the recovery of an N. Or experience with being with one and having small children?\n\nHe does have a good heart somewhere under there, I'm sure of it. It is such a shame he got so damaged along the way.",
        "created_utc": 1496773301,
        "upvote_ratio": ""
    },
    {
        "title": "Afraid I'm on the verge of sabotaging first post-Narcissist relationship",
        "author": "tralalalalalalalala9",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6fna8n/afraid_im_on_the_verge_of_sabotaging_first/",
        "text": "I've posted on here in the past but my Nex found a bookmark to this sub on my laptop and is now checking it regularly, so I've been too scared to post for the last 10 months. But I went ahead and created a new ID because I could really use advice with my current situation..\n\nGetting over the situation with my Nex has taken some time. Three years to be exact. I've been trying to do a lot of personal growth and the pain and PTSD are almost totally background noise.\n\nI've recently met a new guy. Unfortunately, it's a bit of a long distance situation. But he's one of the sweetest people I've ever met. Secure, kind, funny. We've only hung out in person a couple times since it's early, but he texts all day long and calls me as much as possible. In many respects, he's the unicorn all the dating books talk about.\n\nI'd read about how, with secure people, your body doesn't go into the fight or flight response and you feel calm. But when I was with him last week and I felt he wanted to kiss me, I was hit with the realization that I'm nothing but calm with him. I don't feel any butterflies when he texts or calls. Which in some way is nice because my emotions aren't all over the place. But it hit me that I didn't really feel a spark either and wasn't wanting to kiss him.\n\nObviously, it's still pretty early on, but I really WANT to be attracted to him in that way. True, his looks aren't what I've historically gone for and he's not really taller than I am, but what I went for in the past wasn't working out and I don't want to base attraction solely on looks anyway. \n\nI can't figure out if I'm hesitating and feeling a bit overwhelmed because I'm not used to being treated well by someone who seems to adore me, or if I'm doomed to think of him more like a friend. When I mentioned this to a friend of mine, she immediately said, \"If there's no spark, there's not much you can do.\" But he has so amazing qualities that I feel I'll be kicking myself if I just let him go. I'm 37 and he's 39 with no kids and no prior marriage, so less baggage than most guys too.\n\nPlease help. This is new territory for me. :-)",
        "created_utc": 1496769950,
        "upvote_ratio": ""
    },
    {
        "title": "Useful information before heading to college",
        "author": "colin771",
        "url": "https://youtu.be/SlnHSr4Hxpo",
        "text": "",
        "created_utc": 1496741400,
        "upvote_ratio": ""
    },
    {
        "title": "Just deal with life",
        "author": "kat1010",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6fdssp/just_deal_with_life/",
        "text": "Do any of you find you still play out things you learnt as a child with your SO?  \n\nexample being; I've been with him for 7 years now and NC from the nut house the whole time. However, I'm hyper vigilant about peoples bad moods around me and tend to walk on eggshells even if they have never did anything to warrant me needing to. This happens with all areas of social issues, strangers, friend, co-workers and my SO.  This is a big half unspoken issue between my SO and I as it makes him feel worse cus he was in a bad mood that has now affected me in such away. \n\nI guess I'm just trying to figure out the source of this issue. \n\n",
        "created_utc": 1496665033,
        "upvote_ratio": ""
    },
    {
        "title": "how do you get past the nasty feelings of depression/self-loathing of saying goodbye when you're trauma bonded?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6fbx1a/how_do_you_get_past_the_nasty_feelings_of/",
        "text": "[deleted]",
        "created_utc": 1496635183,
        "upvote_ratio": ""
    },
    {
        "title": "When an N says you're accusing them...",
        "author": "jeangenie18",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6far5l/when_an_n_says_youre_accusing_them/",
        "text": "It's just another form of gaslighting, isn't it? Just had my nsis try to force a talk with me and I cooly said I wasn't interested and there's nothing to talk about. She goes on about how I'm accusing her of things that happened growing up and that it wasn't her. This was in front of other family members at a dinner table. My parents are enablers of her behavior and try to force a relationship saying I should apologize to her too. I stood my ground saying I've done nothing wrong but cut her out of my life. I know full well what I remember because I've talked about this in therapy for a long time. \n\nThis is pretty frustrating that my boundaries aren't respected here but I get to fly home in two days. There's a reason I'm 1800 miles away from the nearest family member.",
        "created_utc": 1496621187,
        "upvote_ratio": ""
    },
    {
        "title": "And so, N-mom had a heart attack and, despite all I said during this 3 years of very low contact period, I went to her. And it went like this:",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6f9qpw/and_so_nmom_had_a_heart_attack_and_despite_all_i/",
        "text": "[deleted]",
        "created_utc": 1496609822,
        "upvote_ratio": ""
    }
]