[
    {
        "title": "LPT Stop Leaking Trash",
        "author": "Thaknobodi87",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q79rz/lpt_stop_leaking_trash/",
        "text": "I keep a sharp knife of some sort like a PM2 for cutting up cardboard boxes into 6 x 12\" sheets for placing into the bottom of 13 gal trash bags. Never a leak in several years of doing this at work. Chicken bones, sharp toothpicks and glass or open cans hit the cardboard first saving the fragile plastic.",
        "created_utc": 1675191484,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT REQUEST:How do I live on the move and make money.",
        "author": "Apprehensive-Cold895",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q76i6/lpt_requesthow_do_i_live_on_the_move_and_make/",
        "text": "I’ve always dreamed of roaming the world in a minivan or a car or a caravan but I’ve never been able to figure out how to finance it, I don’t come from a particularly wealthy family . I am going go into my 20’s and I want to experience the world.\nTLDr; I want to live life on the move but I don’t know the source of income.",
        "created_utc": 1675191266,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: It's not enough to just \"work out,\" you gotta stretch!",
        "author": "LovingKindnessFGC",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q74fq/lpt_its_not_enough_to_just_work_out_you_gotta/",
        "text": "It was early last year that I was really starting to get down on myself.  I was 29, it was getting harder to run, harder to keep up a weight lifting routine, harder to do chores and life in general.  My joints creaked, my chest felt tight and I was slouched all the time.  I was about to chalk it up to just getting old.\n\n&amp;#x200B;\n\nLuckily I started a consistent yoga routine at the behest of my therapist and it's been simply amazing.  I've gone from being barely able to touch my toes to sitting on the floor all the time and working up to being able to do a handstand for the first time in my life.  I should've been doing this the whole time and maybe I would've been even more active when I was younger.  Stretching is a meditation, cardio, and calisthenic exercise rolled up into one that also keeps your body from becoming a Stony tomb.\n\n&amp;#x200B;\n\nSome tips:\n\n&amp;#x200B;\n\n1.  10 minutes is enough to start.\n\n&amp;#x200B;\n\n2.  Some easy beginner goals are being able to sit on the floor and being able to squat with your heels on the ground.\n\n&amp;#x200B;\n\n3.  Unlike with weight training or running, you can stretch every day (you just switch to static stretching).",
        "created_utc": 1675191121,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: My bathroom vent smells like cigarettes from my neighbors. How can I remove the smell?",
        "author": "Dragons22222",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q74d3/lpt_request_my_bathroom_vent_smells_like/",
        "text": "[removed]",
        "created_utc": 1675191115,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: Cost of Living Raise",
        "author": "eternally_ndifferent",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q73kn/lpt_request_cost_of_living_raise/",
        "text": "[removed]",
        "created_utc": 1675191060,
        "upvote_ratio": 1.0
    },
    {
        "title": "[LPT Request] Cost of Living Raise?",
        "author": "eternally_ndifferent",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q6zjd/lpt_request_cost_of_living_raise/",
        "text": "[removed]",
        "created_utc": 1675190795,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Don't announce something before you actually start doing it.",
        "author": "GameSpection",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q6w90/lpt_dont_announce_something_before_you_actually/",
        "text": "Especially if you procrastinate. There's no point in telling people your plans before it starts. Not only does it make it harder to finish with the added pressure (that you placed on yourself) but it doesn't matter when you announce it in the first place. \n\nThis is why New Year's Resolutions don't work. The only thing reinforcing the drive to follow up on it is tradition. The need to create a promise is hollow, so the promise itself is too. \n\nJust do it. Expectations aren't enough to fuel your ambition, and you'll just feel like an idiot if you can't do it. Actually starting and making progress before adding expectations will make you more likely to finish. You already got far enough without them.",
        "created_utc": 1675190583,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When someone is tailgating you, don't be dangerous and brake check them, do this...",
        "author": "YeVkiN",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q6kgg/lpt_when_someone_is_tailgating_you_dont_be/",
        "text": "Clean your windshield. Use the toggle on your wipers that sprays the fluid and runs the wipers. I have a long commute and I deal with aggressive drivers all the time. This popped into my head while it was happening to me this morning and it worked immediately. Guy backed way up off of me. No one can be mad at it either. What're they gonna say to you? Lol. Even if they try my response would be along the lines of, \"I was just cleaning my windshield, I didn't know that it would get on your car. That sounds impossible unless you were really close.\" 🤪🤣",
        "created_utc": 1675189828,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Make your CV and personal knowledge seem professional without learning new skills",
        "author": "Mayion",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q5zfm/lpt_make_your_cv_and_personal_knowledge_seem/",
        "text": "[removed]",
        "created_utc": 1675188492,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: You can clean out the dishwasher spray arms in your dishwasher. Food and other items can get in them and clog it up, causing it to not clean efficiently.",
        "author": "JainaW",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q59jv/lpt_you_can_clean_out_the_dishwasher_spray_arms/",
        "text": "I just realized this at age 40, so I thought maybe someone else may not know.",
        "created_utc": 1675186817,
        "upvote_ratio": 1.0
    },
    {
        "title": "First Aid for Eye Injuries, What You Need to Know?",
        "author": "Dennymorris",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q570s/first_aid_for_eye_injuries_what_you_need_to_know/",
        "text": "[removed]",
        "created_utc": 1675186653,
        "upvote_ratio": 1.0
    },
    {
        "title": "[LPT Request] How to spot stuff that needs to be clean ?",
        "author": "ITE_1415",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q53kk/lpt_request_how_to_spot_stuff_that_needs_to_be/",
        "text": "Hi, this question seem very obvious, but I'm a 21F, who was/is sheltered from doing tasks by my parents because of my disabilit(ies) and overall don't know how to clean. \n\nI need to know everything there is about cleaning but more specifically how do I spot water splashes...It sounds really lame, but please understand I don't clean a lot, I want to, but I don't know how to do it properly, and no one in my family wants to help me learn it, they just say it should be innate, which it isn't for me.",
        "created_utc": 1675186429,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Create a Mail Account for work related contacts and don’t give away private contact data.",
        "author": "Feine_b",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q531y/lpt_create_a_mail_account_for_work_related/",
        "text": "[removed]",
        "created_utc": 1675186394,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Don't get in ANY car that randomly offers you a ride",
        "author": "Mindraker",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q4ldi/lpt_dont_get_in_any_car_that_randomly_offers_you/",
        "text": "If a car stops next to you on the side of the road, DO NOT GET IN, even if you know the person.\n\nYou didn't ask for their help.  Why are they offering for you to get in?",
        "created_utc": 1675185263,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: previously posted this in unpopular opinion, but its really not an opinion at all actually. so in this subreddit it goes. warm water bottles",
        "author": "peach_pearl",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q4ivv/lpt_request_previously_posted_this_in_unpopular/",
        "text": "[removed]",
        "created_utc": 1675185102,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: previously posted this in unpopular opinion, but its really not an opinion at all actually. so in this subreddit it goes. warm water bottles",
        "author": "peach_pearl",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q4fhf/lpt_previously_posted_this_in_unpopular_opinion/",
        "text": "[removed]",
        "created_utc": 1675184891,
        "upvote_ratio": 1.0
    },
    {
        "title": "previously posted this in unpopular opinion, but its really not an opinion at all actually. so in this subreddit it goes. warm water bottles",
        "author": "peach_pearl",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q4e52/previously_posted_this_in_unpopular_opinion_but/",
        "text": "[removed]",
        "created_utc": 1675184804,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Don’t allow yourself to lose sleep trying to keep up with a long distance relationship",
        "author": "TheLittleNorsk",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q4bt2/lpt_dont_allow_yourself_to_lose_sleep_trying_to/",
        "text": "If you take the time to get adequate sleep, the quality of the relationship won’t dwindle due to your own exhaustion! \n\nIf you decide to stay up talking or get up earlier than normal, you may find yourself taking naps more often or spacing out more often which will cause unwanted distance or confusion.",
        "created_utc": 1675184651,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How to spend less time talking about myself or my own personal stories to people in awkward social settings?",
        "author": "Apondfrog",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q449z/lpt_request_how_to_spend_less_time_talking_about/",
        "text": "Whenever I am in a group setting or even just me and another person, I find that when the other person isn’t opening up very much about their own life or what’s going on with them, that in order to fill the gaps or the silence I will just start going on about myself. This makes conversations feel a lot less static since I can generally talk about anything and keep a conversation going. \n\nBut sometimes in conversations I find that I am completely dominating and by the end I realize I didn’t get to hear much about them and I feel bad. This sometimes carries over into group settings when people run out of things to talk about, I just start and try to get some conversation going. \n\nHow can I just stop talking about myself so much and try to get others to lead the discussion and share about themselves? I wouldn’t want them to feel like they can’t share because I’m talking a lot.",
        "created_utc": 1675184181,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cost of living raise?",
        "author": "eternally_ndifferent",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q3q6t/cost_of_living_raise/",
        "text": "[removed]",
        "created_utc": 1675183261,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: how to get into the acting world with no experience?",
        "author": "TheHaptic",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q39u1/lpt_request_how_to_get_into_the_acting_world_with/",
        "text": "I have been practicing acting with script samples. I would sit in front of camera and read a script to practice and I have gotten decently good at it I think. From what friends have said, i understand they can be biased but the way my friend dynamic is they are honest. And truthfully I have a drive for it. And I think it’s my passion.\n\nSo I’m curious if there’s anyone out there that has an idea on where to start. Who to go to? Do I absolutely need to go to acting school? Or could I hire a private instructor to help me tame my skills and get good at it? Thank you :)",
        "created_utc": 1675182187,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: I am a recent gradute looking for work. It seems applying for jobs on sites like LinkedIn is a lost cause.",
        "author": "Mysterious_Explorer4",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q39fh/lpt_request_i_am_a_recent_gradute_looking_for/",
        "text": "Hello, I recently graduated with my master of arts degree. The university has a career department, but its primary purpose is to post job vacancies and look over resumes and cover letters, which is helpful. I've applied for probably thirty jobs in the past few weeks, but all the applications are lost in the ether. Does anyone have tips on getting an employer to look at your resume and give you a call back for an interview? Thank you so much.",
        "created_utc": 1675182160,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am a recent MA gradute looking for work and I would like to find a job quickly. It seems applying on LinkedIn on is a lost cause",
        "author": "Mysterious_Explorer4",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q36nn/i_am_a_recent_ma_gradute_looking_for_work_and_i/",
        "text": "[removed]",
        "created_utc": 1675181983,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you have sick children, they should stay at home. This will help them get better faster and is a basic public health guideline.",
        "author": "ntrrrmilf",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q346p/lpt_if_you_have_sick_children_they_should_stay_at/",
        "text": "The stories of people taking their children with nausea and diarrhea to the movies and parties are RIDICULOUS.",
        "created_utc": 1675181823,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If your car is ever stuck in the snow, use floormats or towels and blankets under the moving tires for traction.",
        "author": "chickanpoo",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q2r4h/lpt_if_your_car_is_ever_stuck_in_the_snow_use/",
        "text": "Helps to carry spare towels and blankets, but most cars have removable floormats with great grip.  Works especially well when your tire is stuck in an ice wedge/valley and just spins.",
        "created_utc": 1675180958,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am a recent graduate looking for work. How do I get a job quickly aside from applying for jobs on sites like LinkedIn?",
        "author": "Mysterious_Explorer4",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q2qlf/i_am_a_recent_graduate_looking_for_work_how_do_i/",
        "text": "[removed]",
        "created_utc": 1675180925,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: What is your pro tip to help me clear all the fear of failure and doubts from my mind and become confident and self - disciplined?",
        "author": "captain_hardon",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q2ocs/lpt_request_what_is_your_pro_tip_to_help_me_clear/",
        "text": "I (39m) have been living a life without taking any risks. I have fear of failure that prevent me from taking actions that will improve my life. Also I lack self discipline that will prevent me from completing activities or courses that may have improved my life.",
        "created_utc": 1675180799,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When Managing Cables, Turn Equipment Around",
        "author": "Rodlund",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q2mh2/lpt_when_managing_cables_turn_equipment_around/",
        "text": "I ran into this issue again after not listening to my own advice. \n\nWhen you care having to make cables for any electronic equipment, for example a Home Theater Receiver, turn the equipment all the way around to the point you would need to when unplugging something in the future. \n\nToo many times I place something where I want it finally, then make the cable to that length and can't turn it around to remove/add cables.",
        "created_utc": 1675180671,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: occasionally google your email password to see if it is on any lists",
        "author": "Hard-R-Smitty",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q2clv/lpt_occasionally_google_your_email_password_to/",
        "text": "Generally my password is jibberish enough that it wouldn’t mistakenly be used for something else at random. I once found out that my password had been hacked simply by googling my password, where a search produced a document containing like 50,000 email addresses and passwords, one of which was mine.  \n\nAlso, this probably goes without saying, but don’t use the same password for your email that you use for other sites. If you do, by cracking one they’re able to access multiple sites, reset your password to the sites, etc.  As much of a pain as it is, try to use multiple passwords for different logins (one PW for email, one PW for banking, one PW for credit cards, etc). I only use duplicate passwords on sites like Netflix or something where they can’t really do any harm by having it.",
        "created_utc": 1675179995,
        "upvote_ratio": 1.0
    },
    {
        "title": "Excuses to get out of annoying tasks",
        "author": "SpeechGrouchy9116",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q1zrp/excuses_to_get_out_of_annoying_tasks/",
        "text": "[removed]",
        "created_utc": 1675179119,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: if you just spent a long time looking for something in your house, put it back in the first place you checked.",
        "author": "freeeeels",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q1skh/lpt_if_you_just_spent_a_long_time_looking_for/",
        "text": "",
        "created_utc": 1675178649,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: You're far more likely to get a promotion befriending your boss than working hard. It shouldn't be like that but it is.",
        "author": "sexting_king",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q1k0g/lpt_youre_far_more_likely_to_get_a_promotion/",
        "text": "",
        "created_utc": 1675178078,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you are considering learning a musical instrument or learning to sing, I highly recommend also learning the basics of a piano. Knowing your way around a keyboard will help you understand what you're doing on all other instruments and while singing.",
        "author": "BellyScratchFTW",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q1f5k/lpt_if_you_are_considering_learning_a_musical/",
        "text": "",
        "created_utc": 1675177758,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: when choosing a restaurant and your partner says “I don’t care where we go…”",
        "author": "TheDuckFarm",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q0p2b/lpt_when_choosing_a_restaurant_and_your_partner/",
        "text": "Don’t make any suggestions at all, dont ask any questions, don’t even say where you’re going, just say ok I know a place. The go where you want, open the door for them, and get a table. \n\nThis avoids the “no, not that one” endless loop of the “I don’t care but I’ll veto your suggestions.”",
        "created_utc": 1675175987,
        "upvote_ratio": 1.0
    },
    {
        "title": "“LPT” when choosing a restaurant and your partner says “I don’t care where we go…”",
        "author": "TheDuckFarm",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q0nj8/lpt_when_choosing_a_restaurant_and_your_partner/",
        "text": "[removed]",
        "created_utc": 1675175874,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: someone made a bad tweet about me then took it down, can employers still see it now that it’s been deleted?",
        "author": "Shin_Malphur_",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q0f6u/lpt_request_someone_made_a_bad_tweet_about_me/",
        "text": "[removed]",
        "created_utc": 1675175288,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Video chat apps have a Flatulence Filter. Somehow, Teams and Zoom are clever (and polite) enough to filter out and remove unwanted bodily sounds. So relax and let 'er rip!",
        "author": "thebucksays",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q0dk2/lpt_video_chat_apps_have_a_flatulence_filter/",
        "text": "I made a huge, hilarious raspberry noise on MS Teams yesterday. My coworkers thought I was just pantomiming because they didn’t hear anything but silence. Apparently the software removes this particular noise if it can be isolated. The coworkers confirmed it from their end and some friends replicated it on Zoom later in the day.",
        "created_utc": 1675175170,
        "upvote_ratio": 1.0
    },
    {
        "title": "someone made a bad tweet about me, they took it down but can employers still see the tweet if i was tagged in it?",
        "author": "Shin_Malphur_",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q0bal/someone_made_a_bad_tweet_about_me_they_took_it/",
        "text": "[removed]",
        "created_utc": 1675175005,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Ask your boss what it would take for you to get promoted, preferably in an email. If you do it all and don't get promoted, you can use it to at least get a raise.",
        "author": "PM__me_ur_milf_tits",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pzte9/lpt_ask_your_boss_what_it_would_take_for_you_to/",
        "text": "",
        "created_utc": 1675173719,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT : Try to avoid plastic utensils/ plates / bottles for every day usage.",
        "author": "homelymonster",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pyq7n/lpt_try_to_avoid_plastic_utensils_plates_bottles/",
        "text": "Plastics are known to mix into food items/beverages in traces, which can cause harm in the long run. Instead use metal ones like stainless steel or glass.",
        "created_utc": 1675170858,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: when paying by card abroad, always choose to pay in local currency when given the choice because you will pay less!",
        "author": "deliciousprawns",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pyloz/lpt_when_paying_by_card_abroad_always_choose_to/",
        "text": "I just bought something in Spain for €54 with my (British) debit card and was given the option to pay seemingly less in £ instead (£50).  (£50 is roughly €57!).  I opted to stick with euros as advised by somebody else the other day and…\n\nPaying the €54 debited my account by £47.62 (plus transaction fee which with my bank is pennies).  Paying in £ would have debited my account by… £50.  D:\n\nScrew you banks and things  \n\n(I am aware this post may count as common sense for some)",
        "created_utc": 1675170510,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Is it possible to learn how to drive in 28 days?",
        "author": "SuperDuperMarvel7",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pxyvz/lpt_is_it_possible_to_learn_how_to_drive_in_28/",
        "text": "I have a Drivers test March 2nd and I have almost no experience behind the wheel. I was wondering if it’s possible I could learn enough in 28 days to where I will be able to pass the drivers test.",
        "created_utc": 1675168681,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to learn to drive in 28 days?",
        "author": "SuperDuperMarvel7",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pxw45/is_it_possible_to_learn_to_drive_in_28_days/",
        "text": "[removed]",
        "created_utc": 1675168447,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: How do I overcome the freedom and anxiety of having to begin a new day?",
        "author": "itgoesdownandup",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pxpyz/lpt_request_how_do_i_overcome_the_freedom_and/",
        "text": "I sometimes struggle with sleeping because I don't want a new day. I don't want it to begin. I don't want to experience it. I will say it could partly be as well at night I'm doing things I enjoy, so maybe that mixed with the dread and anxiety it's like why pull myself away from fun to sleep until I have to experience dread. Any insights on things that can help this?",
        "created_utc": 1675167929,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: clean your washing machine properly. Your clothes will smell better.",
        "author": "turtlechop",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pxc2x/lpt_clean_your_washing_machine_properly_your/",
        "text": "If you've been using your washing machine for at least a year, the inside is likely full of black mold and mildew. Here's how to get rid of it!\n\n1. Wear rubber gloves.\n2. Prepare a strong bleach solution (1/2 cup bleach in 3L of water).\n3. Open the detergent drawer of your washing machine and remove it completely. Place the drawer into the bleach solution to soak.\n4. Look inside the hole left from the drawer. It's all black and gross! Soak a washcloth in the bleach solution and clean this space as well as you can. Use an old toothbrush for the nooks and crannies.\n5. Use a brush to scrub the drawer and remove any dirt from it. Place it back inside the washing machine.\n6. Use a washcloth soaked with bleach solution to clean the the rubber seal of the washing machine.\n7. Close the door of the washing machine.\n8. Pour about 1/2 cup of bleach into the detergent compartment of the drawer and close it.\n9. Set your machine to do a 90°C cycle.\n\nAfter it's over, your washing machine will be good as new. Your clothes will smell great! Do this once a year to keep your machine clean.",
        "created_utc": 1675166736,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: ALWAYS wear shoes on a ladder",
        "author": "StillAsTheSnowFalls",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10px16f/lpt_always_wear_shoes_on_a_ladder/",
        "text": "It’s the simplest thing, but it could save you an injury or worse.  Ladder accidents are really common. Its easy to think that hanging a picture or changing a light bulb with slippers, sandals, socks, or barefoot would be okay, but it’s very dangerous.  But please put on some shoes.  Your balance is greatly improved on the thin rungs of the ladder when wearing proper shoes.  We aren’t apes.  Except of course r/wallstreetbets",
        "created_utc": 1675165731,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Never agree with anything the same day you hear it",
        "author": "usernameTaken3217",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pwdsj/lpt_never_agree_with_anything_the_same_day_you/",
        "text": "Some ideas are persuasively hypnotic. It's better to wait a few days to decide what you really think.\n\nThis way you can process those ideas properly and more logically.\n\nThis also has to do with the person trying to convince you. Some people have very good persuasive skills and can convince you with anything they say.\n\nHowever, if you write what they say on a piece of paper, let it sit for a few days, then try to decide if it makes sense, you'll be able to evaluate it objectively instead of being driven by emotions and excitement.",
        "created_utc": 1675163441,
        "upvote_ratio": 1.0
    },
    {
        "title": "[LPT] Do not buy a gift card if it comes with same value as the money that was paid for it.",
        "author": "an0nym0us11",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pwap5/lpt_do_not_buy_a_gift_card_if_it_comes_with_same/",
        "text": "Just remember few points that a gift card has expiry date, and it is limited to a specific store or mall where you can use it. Money has no limitations. There is a propaganda circling around telling younger people that \"giving money is not cool\" or \"Giving cash makes it look like you didn't put in any effort\", but any one actually receiving cash instead of gift card will be appreciate it more than a gift card. They can actually buy what they need/want rather than being forced to buy from a specific place. Also if they put it aside and forget about it, and find it 5 years later, they can still use it, where as a gift card expires, and the money goes to the company without any repercussions. Cash never expires.",
        "created_utc": 1675163127,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do not buy a gift card if it comes with same value as the money that was paid for it.",
        "author": "an0nym0us11",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pw9gh/do_not_buy_a_gift_card_if_it_comes_with_same/",
        "text": "[removed]",
        "created_utc": 1675163002,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Call your bank directly even if you sign up for fraud alerts",
        "author": "Foodie1989",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pvcxm/lpt_call_your_bank_directly_even_if_you_sign_up/",
        "text": "Today was a really bad day. Dealt with fraudulent activity on my bank account all day closing everything. Just a warning to others, I got a call from my bank coming in listed as my bank and number matching the customer service number on the site and everything only for it to be fake. They were pretending to go over unauthorized transactions which my bank has done before...and typically I call hang up and them directly myself if I even get a call from my bank but because I recently dealt with unauthorized charges I thought it was a follow up. Also, they apparently have technology now to mask it as the bank which is why the name and number shows as is... always call your bank directly even if you sign up for fraud alerts.",
        "created_utc": 1675159566,
        "upvote_ratio": 1.0
    },
    {
        "title": "Even if you sign up for fraud alerts, call your bank directly",
        "author": "Foodie1989",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pv8t9/even_if_you_sign_up_for_fraud_alerts_call_your/",
        "text": "[removed]",
        "created_utc": 1675159206,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Be mindful of how your friend reacts to your achievements and milestones",
        "author": "IntrovertedSapien",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pusxc/lpt_be_mindful_of_how_your_friend_reacts_to_your/",
        "text": "Often times, we quantify the value of relationship by the supportiveness a friend/partnershows when during our lows. \n\nBad friendships can easily pass this threshold since people can be a really good friend during our low points and still be extremely envious and toxic behind us.\n\nPaying attention to how a person reacts and responds to your milestones and highs can suprisingly show the goodness and purity of the bond we share with them.\n\nIt is always best to have one less loved one, than to invest in a bond where your worth is not recognized and well received.",
        "created_utc": 1675157887,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: How to be less modest when you know you did a good job?",
        "author": "Mintpile",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pujif/lpt_request_how_to_be_less_modest_when_you_know/",
        "text": "[removed]",
        "created_utc": 1675157307,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT:Your credit score can help lower your car insurance rate",
        "author": "JimJonesSuckerPunch",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pu7hk/lptyour_credit_score_can_help_lower_your_car/",
        "text": "When it comes time to renew your car insurance, ask your provider to run your credit to help save you money on your monthly premium. \n\nYour insurance provider will run a soft check, and based on that can offer you savings upon renewal. This can only help you, so if your credit isn't perfect it will not cost you more. \n\nCar insurance in my state is very expensive, and when I asked them to run my credit today I was able to save roughly $450 over 6 months for full coverage. For an idea, I paid about $1100 for 6 months in 2022.",
        "created_utc": 1675156552,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When in Ireland, order this instead of drinks to save money.",
        "author": "Turtlethebean",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pu5y4/lpt_when_in_ireland_order_this_instead_of_drinks/",
        "text": "[removed]",
        "created_utc": 1675156463,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: You will not remember it later. Write it down now.",
        "author": "rubberseatbelt",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pt2a9/lpt_you_will_not_remember_it_later_write_it_down/",
        "text": "",
        "created_utc": 1675154061,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: My partner wanted kids and I am undecided. Was it right to break up over this?",
        "author": "hammpyy",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10psel7/lpt_request_my_partner_wanted_kids_and_i_am/",
        "text": "[removed]",
        "created_utc": 1675152404,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request : Infant Hacks",
        "author": "busuta",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10prr7j/lpt_request_infant_hacks/",
        "text": "Hi everyone, \nLet me elaborate the title; I’m looking for tips that may help a newborn, kid or even an adult to improve their life quality on the long run. It can be something you heard, witness or tried personally. I want to learn ;\n\n1-How many unknown hacks are out there ?\n\n2-if any of these actually works or if anyone tried.\n\nPlease state your hack as tested or not so we would know. \n\nHere are 2 examples from me;\n\n1- Washing an infant with salt would prevent smelly sweat for the rest of the life. I heard it from some elders rubbing salt to armpits would prevent bad odor of the sweat. I didn’t tested.\n\n2- Not using razor for armpits and private parts actually making them really soft and easy to remove in adulthood. I tested this one and yes I can confirm. \n\nPlease share your knowledge and pro tips!",
        "created_utc": 1675149899,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: about half of all dogs will do the cute head tilt thing if you make the “phaser beam” noise Jim Carrey makes in Dumb &amp; Dumber",
        "author": "Manakanda413",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pqdw9/lpt_about_half_of_all_dogs_will_do_the_cute_head/",
        "text": "",
        "created_utc": 1675145006,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I stop cutting off people",
        "author": "ChutiyaChutney420",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pqa1t/how_do_i_stop_cutting_off_people/",
        "text": "[removed]",
        "created_utc": 1675144663,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Tips from a frequent flyer",
        "author": "Creatrix",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10ppl1i/lpt_tips_from_a_frequent_flyer/",
        "text": "I've flown hundreds of times commercially in the past 30 years, and I have some tips. (These are for flying, not for in the airport.)\n\n* You're allowed to bring your own food on board. Pack snacks and a sandwich instead of using a credit card to pay for a meal. Buy bottled water on the flight; never drink the bathroom tap water.\n\n* Bring antiseptic wipes, and wipe down things you'll be touching: tray table, window shade, the seat-back pocket, armrests. These things aren't cleaned between flights (or ever).\n\n* If you dislike turbulence, don't sit behind the wings. The tail especially will feel turbulence the worst. Commercial aircraft are built to be flexible, and the tail can flip a fair bit. Sitting over or in front of the wings, you'll feel turbulence the least.\n\n* Don't order a hot beverage. Clear-air turbulence can come out of nowhere. I've seen flight attendants floating in freefall with their beverage carts. Would you rather have a cold soft drink or a hot coffee spilled on you?\n\n* When you fasten your seatbelt upon boarding and you want to take a nap, by all means use your coat as a blanket, but make sure the flight attendant can see the buckle. Otherwise they'll have to wake you up to check that it's fastened. (Bring an eye mask and earplugs for your nap.)\n\n* Speaking of seatbelts, keep yours fastened at all times unless you have to go to the loo. That clear-air turbulence that can come out of nowhere can give you a nasty head or neck injury when your skull cracks into the overhead bulkhead. Why take a chance?\n\n* Treat your flight attendants like gold. They know first aid and CPR and what to do when a passenger dies mid-flight. They have to deal with assholes all day long, but they're the ones who will save your butt when the plane is upside-down and underwater.\n\n* And lastly, never sit in the last row. Not only because the seats don't really recline at all, but if there's an emergency that requires the oxygen masks to pop out, the pilot will have one priority: to get down to where the air is breathable. The masks pop out, the plane goes into a steep dive, your mask swings forward, and the guy ahead of you frantically grabs it, thinking it's his. Don't be the blue-faced guy in the last row.",
        "created_utc": 1675142353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips from a frequent flyer",
        "author": "Creatrix",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10ppbbq/tips_from_a_frequent_flyer/",
        "text": "[removed]",
        "created_utc": 1675141513,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Don't break out small or corner windows if you lock your keys in your car.",
        "author": "Bailmage",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pozxe/lpt_dont_break_out_small_or_corner_windows_if_you/",
        "text": "LPT: If you are ever in a situation where you locked the keys out of your car and decide to break a window do not break the small glue in windows. The small windows tend to be the most expensive and most difficult to replace. Its never a great idea to break out your windows, but when push comes to shove, the small or corner windows are the worst option.",
        "created_utc": 1675140615,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If someone is having a rough time, send prayers FOR them, not TO them.",
        "author": "Crafty-Regret-2023",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10po9jj/lpt_if_someone_is_having_a_rough_time_send/",
        "text": "[removed]",
        "created_utc": 1675138831,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How to handle a 9-5, a part time degree and other life priorities",
        "author": "LiquidChocolate",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pnqvd/lpt_request_how_to_handle_a_95_a_part_time_degree/",
        "text": "I'm 17 and this is all new to me. \nplus I got a 5 hour commute to both my job and lectures 7 days a week",
        "created_utc": 1675137616,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How to use cognitive defusion to reduce our remove unwanted thoughts or feelings",
        "author": "CauseISaidSo_",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pnkf6/lpt_request_how_to_use_cognitive_defusion_to/",
        "text": "I've read cognitive defusion is a method for helping disassociate yourself from harmful thoughts or feelings but have never been able to fully grasp it. \n\nHow is this technique performed and how can it help mend unwanted self talk?",
        "created_utc": 1675137202,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Before deleting a phone number you know you should never call again, change the phone number you have saved for them before deleting it.",
        "author": "alfafeta",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pn4n2/lpt_before_deleting_a_phone_number_you_know_you/",
        "text": "[removed]",
        "created_utc": 1675136169,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How to tell a friend that their negative talk (raging) needs to stop?",
        "author": "swishphish1",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pn2sc/lpt_request_how_to_tell_a_friend_that_their/",
        "text": "So I have a friend who will let everyone know that they are performing poorly at whatever task is at hand. For example, he can be heard yelling (like full on screaming) when he loses at video games. Another example, we have a “learn to bowl” class (bowling) together, and he constantly lets us know that he is doing bad. The strange thing is, he isn’t normally good at bowling, so his performance is to be expected. \n\nAll of the other friends in our group agree that his negative talk is annoying. It takes a toll on us all and prevents us from enjoying the shared experiences we have. \n\nHow can I politely tell him that his comments are unwanted? \n\nFYI, this isn’t a “once in a while” thing, it’s more than a common occurrence.",
        "created_utc": 1675136052,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who else is going through a quarter life crisis... cheers to 25🙃",
        "author": "Lowwkey37",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pn16x/who_else_is_going_through_a_quarter_life_crisis/",
        "text": "",
        "created_utc": 1675135952,
        "upvote_ratio": 1.0
    },
    {
        "title": "[LPT Request] how do I move on from being heavily taken advantage of by HR?",
        "author": "PairSuccessful483",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pm7x6/lpt_request_how_do_i_move_on_from_being_heavily/",
        "text": "I didn't know that HR couldn't be trusted. It was only after  I was taken advantage of by HR, that I found out that HR couldn't be trusted. I just feel so betrayed. I'm more angry at myself for letting myself be treated that way.\n\nI learnt the hard way that HR couldn't be trusted.\n\nHow do I overcome this and not let it ruin my life.\n\nHR has moved on, I haven't.",
        "created_utc": 1675133767,
        "upvote_ratio": 1.0
    },
    {
        "title": "[LifeProTips Request] How do I move on from being heavily taken advantage of by HR?",
        "author": "PairSuccessful483",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pm71m/lifeprotips_request_how_do_i_move_on_from_being/",
        "text": "[removed]",
        "created_utc": 1675133696,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: how do people who work demanding 9-5 jobs take care of other “life” tasks?",
        "author": "ThrowRAnopenope",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pl018/lpt_request_how_do_people_who_work_demanding_95/",
        "text": "I work a pretty demanding 9-5 job in tech. I’m having a really hard time doing my job and also finding time to schedule “life” appointments (doctor, dentist, mechanic, etc) let alone actually GO to them. Similar situation for all other life things like taking care of literally anything that requires you to call a business during the week to resolve an issue. How do you all handle balancing this? \n\nMany of the doctors, dentists, etc are also closed on Friday as well as the weekend which limits my time to only M-TR for even going to appointments. I’m starting to feel real stressed as there isn’t enough time in the day to sit on the phone for hours trying to resolve “life issues”, schedule appointments and then actually go to the appointment plus work. What’s worse is that it seems like most places are starting to push the leg work back on the customer, for example: I made an appointment to see my doctor to get a prescription filled. Went to said appointment. Went to the pharmacy and the pharmacy didn’t have my meds. Called doctor and doctor told me I had to call around all other pharmacies to find one that had my meds in stock. Called X number of pharmacies who told me that they couldn’t give me that info and to have the doc call directly. Called doc back to report this to him. Doc still pushed me to figure it out due to staffing shortages. This phone tag ate up 4 hours of my day. Just this. Trying to take care of simple tasks is now taking 3X the time. How do normal people handle this and not get fired for asking off all the time to deal with life?",
        "created_utc": 1675130368,
        "upvote_ratio": 1.0
    },
    {
        "title": "When you are speaking to person of color. Instead of asking \"Where are you from?\" ask \"What is your ethnicity?\" instead.",
        "author": "Kokodokoe",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pkycr/when_you_are_speaking_to_person_of_color_instead/",
        "text": "[removed]",
        "created_utc": 1675130232,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: dating",
        "author": "Jimmynaz97K",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pkjgm/lpt_request_dating/",
        "text": "On april last year me and my now ex girlfriend peacefully decided to put our six years relationship to an end due to the fact that our careers took us to very distant places (our relationship was already hard because of her parents but the distance made it worse).\nAfter months spent alone waiting for the breakup pain to go away I decided to get back to the dating world but it looks like I don't f**g remember how to approach girls anymore.\nI have tried approaching them in clubs and bars but I get blocked every time by my low social skills and every time feels awkward, even tried dating apps but didn't succeed.\nAny tip is appreciated.",
        "created_utc": 1675129028,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When overthinking, keep your eye balls still and stare at something. immediately your mind will stop ruminating.",
        "author": "Adrenalin_dasher4454",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pk4ok/lpt_when_overthinking_keep_your_eye_balls_still/",
        "text": "",
        "created_utc": 1675127875,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT",
        "author": "phunaholic",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pjt9k/lpt/",
        "text": "[removed]",
        "created_utc": 1675127028,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Best thing to use for cold sores and chapped lips I stg",
        "author": "Embarrassed-Law7976",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pjflj/lpt_best_thing_to_use_for_cold_sores_and_chapped/",
        "text": "[removed]",
        "created_utc": 1675126018,
        "upvote_ratio": 1.0
    },
    {
        "title": "BEST ITEM FOR COLD SORES AND CHAPPED LIPS!",
        "author": "Embarrassed-Law7976",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pjdc7/best_item_for_cold_sores_and_chapped_lips/",
        "text": "[removed]",
        "created_utc": 1675125844,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request - 27M in PA Unemployed for 6 months - but after 10+ interviews I receive an offer - problem: it's in Houston",
        "author": "adjustMyEBITDA",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10phvmx/lpt_request_27m_in_pa_unemployed_for_6_months_but/",
        "text": "[removed]",
        "created_utc": 1675121940,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT REQUEST Need help developing shallow friendships",
        "author": "snootyboopy",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10phuhl/lpt_request_need_help_developing_shallow/",
        "text": "[removed]",
        "created_utc": 1675121854,
        "upvote_ratio": 1.0
    },
    {
        "title": "Developing deeper friendships?",
        "author": "snootyboopy",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10phsf5/developing_deeper_friendships/",
        "text": "[removed]",
        "created_utc": 1675121704,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Block ads on your smart TV by blocking the DNS in your router. Here’s how.",
        "author": "degolfer02",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10phqwp/lpt_block_ads_on_your_smart_tv_by_blocking_the/",
        "text": "[removed]",
        "created_utc": 1675121590,
        "upvote_ratio": 1.0
    },
    {
        "title": "Block DNS sources in your router to stop ADs on your smart TV",
        "author": "degolfer02",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10phkmt/block_dns_sources_in_your_router_to_stop_ads_on/",
        "text": "[removed]",
        "created_utc": 1675121162,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request : How do I mingle well in an international aperitif event?",
        "author": "TKYRRM",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10phk60/lpt_request_how_do_i_mingle_well_in_an/",
        "text": "I’ve just moved to a new city and want to make new friends. I’m thinking about participating meet-ups, or some international parties, but I don’t know how to “mingle well”.   Specifically I want to know how to:\n\n- join a conversation of several people\n- get out of the conversation \n- how to keep an interesting conversation with a group or people/an individual\n\nI don’t consider myself particularly shy and if someone approches me, I don’t get nervous or anything.  I can even approach someone if she/he is alone.  But I feel a bit awkward in the above-mentioned situation.  Cheers!",
        "created_utc": 1675121128,
        "upvote_ratio": 1.0
    },
    {
        "title": "27M Unemployed for 6 months in PA - after 10+ interviews I receive an offer - problem: it's in Houston",
        "author": "adjustMyEBITDA",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10phhyd/27m_unemployed_for_6_months_in_pa_after_10/",
        "text": "[removed]",
        "created_utc": 1675120976,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: I feel as though I have no motivation anymore and struggle waking up.",
        "author": "greywingspan",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10phczt/lpt_request_i_feel_as_though_i_have_no_motivation/",
        "text": "It's not that I struggle waking up as in sleeping past an alarm etc, but I mean getting out of bed. \n\nI have GCSEs in roughly 4½ months and this really isn't good; I just feel as though I can't be bothered anymore to try and should just give up. I cannot stand school nor the people, the only thing keeping me going at the moment is my future plans and grades I would possibly require for them.\n\nHow can I get out of this void?",
        "created_utc": 1675120641,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: I'm beating inflation by working 6 remote Tech jobs, making 1 Million a year",
        "author": "engineernasa",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10ph0nv/lpt_im_beating_inflation_by_working_6_remote_tech/",
        "text": "I'm a software engineer in Aerospace working 6 remote J's making an average of $70k+ per month. I get each job done in about 2-3 hours each day because of my experience (19 years), and also have no kids etc. Anyone else doing this?",
        "created_utc": 1675119791,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm beating inflation by working 6 remote Tech jobs, making 1 Million a year",
        "author": "engineernasa",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pgm7w/im_beating_inflation_by_working_6_remote_tech/",
        "text": "[removed]",
        "created_utc": 1675118822,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: How to politely tell someone to stop bragging about their achievements?",
        "author": "throwmeupyourasshole",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pfdqm/lpt_request_how_to_politely_tell_someone_to_stop/",
        "text": "I have one friend in particular which tends to talk a lot about their accomplishments and I don’t know how to make them limit this. \nI understand that it might sound like I am a bad friend, but I really mean it when I say I’m happy for them. It’s just that their constant bragging is causing me to lose interest in their accomplishments, plus I run out of things to say after they mention it too often. \nI realize that they are proud of themselves and/or excited and I don’t want to take that away from them. I just want to find a way to make them see it from another person’s point of view. \nI would not have asked this question if somebody else didn’t tell me that they had noticed this about our friend. I didn’t want to make them think that our friend is a bad person for this so I just said that they probably find joy in sharing their excitement with others, which I believe. But internally I agree that it can be a bit difficult to deal with such scenarios.",
        "created_utc": 1675115898,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: Need some guidance. I come from a split family, I’ve abused LSD as a young adult, I seek external validation, I have no job, I don’t have any strong relationships, and have no responsibilities.",
        "author": "Fun-Fee-7058",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pejoc/lpt_request_need_some_guidance_i_come_from_a/",
        "text": "[removed]",
        "created_utc": 1675113959,
        "upvote_ratio": 1.0
    },
    {
        "title": "Search engines give horrible results for specific or obscure questions nowadays, if you're looking for a concise answer use this format; **site:reddit.com [whatever you're searching for]**",
        "author": "potato_nest_69",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pefll/search_engines_give_horrible_results_for_specific/",
        "text": "",
        "created_utc": 1675113693,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Get free del taco.",
        "author": "excelsiornick",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pe7re/lpt_get_free_del_taco/",
        "text": " If you sign up for the del taco app you get a free 2 the del tacos. They have you enter your phone number and email every time you do, but they only verify the account through email. Meaning for the low low price of making a gmail account you can have a quick free lunch as often as you like.",
        "created_utc": 1675113183,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sucky handwriting? Get a fountain pen",
        "author": "RGBonmyeverything",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pe7j2/sucky_handwriting_get_a_fountain_pen/",
        "text": "[removed]",
        "created_utc": 1675113167,
        "upvote_ratio": 1.0
    },
    {
        "title": "___🦋༎”𝙏𝙝𝙚 𝙨𝙩𝙤𝙧𝙮 𝙤𝙛 𝙡𝙞𝙛𝙚 𝙞𝙨 𝙤𝙫𝙚𝙧 𝙬𝙝𝙚𝙣 𝙩𝙝𝙚 𝙗𝙧𝙚𝙖𝙩𝙝 𝙨𝙩𝙤𝙥𝙨”༎.!”:)🙂🖤 ___🦋🖤",
        "author": "bigboss0278",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pdzww/𝙏𝙝𝙚_𝙨𝙩𝙤𝙧𝙮_𝙤𝙛_𝙡𝙞𝙛𝙚_𝙞𝙨_𝙤𝙫𝙚𝙧_𝙬𝙝𝙚𝙣_𝙩𝙝𝙚_𝙗𝙧𝙚𝙖𝙩𝙝_𝙨𝙩𝙤𝙥𝙨/",
        "text": "",
        "created_utc": 1675112688,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT- if you live near mountains/hiking areas. You don't need a gyms treadmill",
        "author": "skateralex240",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pdmtc/lpt_if_you_live_near_mountainshiking_areas_you/",
        "text": "Might sound a little random but I was noticing today- one thing I liked about the gyms arpund here was mainly for their treadmills but I had a realization- \n\nwhen the cold weather goes down a little I could simply visit the mountains near me and go for a hike instead! It costs me gas money to get there but it's way cheaper than any gym memberships I've seen. \n\nAlso as a bonus- I personally find nature walks/hikes very refreshing and good for my mental health given how much time I can spend indoors or on the computer. \n\nI realize this may not work for everyone depending on your goals or where you live but I imagine it may work for some people. \n.",
        "created_utc": 1675111876,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Always keep enough fuel in your vehicle for an emergency",
        "author": "Eastonsilly",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pdjlt/lpt_always_keep_enough_fuel_in_your_vehicle_for/",
        "text": "Filling up my truck with diesel takes awhile and isn't the most convenient thing to do one the way home from work. I decided to do it anyway on a Friday afternoon. My puppy happened to step on a bee when I took him outside and I was able to rush him to the vet and get him treated in time because the truck had fuel in it. Always keep enough fuel in your vehicle to get to a vet or hospital if needed. Also, liquid Benadryl is good to have on standby for allergic reactions.",
        "created_utc": 1675111657,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: how to transitionin to working a night shift?",
        "author": "Lively_Plant",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pd8nt/lpt_request_how_to_transitionin_to_working_a/",
        "text": "I'm salaried at a warehouse job that has both a day shift and night shift. My whole career I've worked days but recently have been moved to run a new team on night shift. I've never worked a night shift before in my life (closest was a couple noon to midnight shifts) - I switch to my new schedule in a couple weeks. Any advice for making the transition easier?",
        "created_utc": 1675110934,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Anxiety pushes back the harder you try to fight it. And trying to \"overcome\" it will in turn induce stress. So rather than putting too much pressure on yourself, take small steps, every day, and be proud of what you overcome.",
        "author": "incredibleinkpen",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10pcum3/lpt_anxiety_pushes_back_the_harder_you_try_to/",
        "text": "",
        "created_utc": 1675109979,
        "upvote_ratio": 1.0
    }
]